{
    "case_title": "BNY Corporate Trustee Services Ltd\n      v\n      Celestial Nutrifoods Ltd",
    "ncitation": "[2014] SGHC 155",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       Under s 285 of the Companies Act (Cap 50, 2006\n                    Rev Ed) (“the Act”), when a company is in liquidation, the court\n                    may summon before it any person whom the court considers capable of giving\n                    information concerning the promotion, formation, trade dealings, affairs or\n                    property of the company. Such person may be examined on oath regarding the\n                    aforesaid matters and the court may also require him to produce any books or\n                    papers in his custody or power relating to the company. The application before\n                    me concerns the exercise of that power. 2       The application is made by Mr Yit Chee Wah\n                    (“Mr Yit” or “the Liquidator”), the liquidator of\n                    Celestial Nutrifoods Limited (“the Company”). He wants the court\n                    to examine the Company’s former auditors, PricewaterhouseCoopers LLP\n                    (“PwC”) and its relevant representatives including, but not\n                    limited to, Mr Tham Tuck Seng and Mr Tan Boon Chok. PwC resists the application\n                    on the basis that the Liquidator is acting oppressively, that to comply with the\n                    disclosure orders might require it to do acts that are illegal under Chinese law\n                    and that its working papers are not reasonably required by the Liquidator. This\n                    judgment will explore those issues. 3       In the application as originally filed, the\n                    Liquidator sought orders under s 285 not only against PwC but also against\n                    various other persons. These included Mr Ming Dequan (“Mr Ming”),\n                    the chairman of the Company, and three individuals in the People’s\n                    Republic of China (“the PRC”) who were the legal representatives\n                    of the Company’s subsidiaries. These latter persons did not appear at the\n                    first hearing of the application and I made the orders sought against them. They\n                    have not appealed against those orders. Accordingly, I need say no more about\n                    the reasons for making those orders. In this judgment, I am dealing only with\n                    the Liquidator’s application against PwC and its\n                representatives.",
        "Background": "4       The Company was incorporated in Bermuda in 2003.\n                    It was an investment holding company for several subsidiaries, all incorporated\n                    in the British Virgin Islands (“the BVI Subsidiaries”). The BVI\n                    Subsidiaries in turn owned subsidiaries incorporated in the PRC (collectively\n                    called “the PRC Subsidiaries”). The operations of the Group\n                    (comprising the Company and its subsidiaries) were carried on in the PRC by the\n                    PRC Subsidiaries who also owned the physical and financial assets of the Group.\n                    The Group’s main business activity was producing soybean protein-based\n                    foods under the “Sun Moon Star” brand. The Company was listed on\n                    the Singapore Stock Exchange (“SGX”) on 9 January 2004 and raised\n                    some S$33m from this exercise. 5       On 12 June 2006, the Company raised S$235m from\n                    investors by issuing Zero Coupon Convertible Bonds (“the Bonds”).\n                    The bondholders were granted put options which allowed them to compel the\n                    Company to redeem all or some of the Bonds at 116.5% of their face value. On 23\n                    May 2009, a majority of the bondholders exercised their put options and the\n                    Company was required to redeem the Bonds on 12 June 2009. Shortly thereafter,\n                    the Company announced it would be unable to meet this obligation. On the due\n                    date, it failed to redeem any of the Bonds. 6       On 23 November 2010, BNY Corporate Trustee\n                    Services Ltd (“BNY”), the trustee of the Bonds, issued a statutory\n                    demand against the Company for the amount due under the Bonds. When this was not\n                    satisfied, BNY commenced winding up proceedings against the CompanyviaCWU 195/2010 (“CWU 195”). BNY thus\n                    became the plaintiff in CWU 195. Mr Yit was appointed the Company’s\n                    provisional liquidator on 24 December 2010. A  year later, the Company\n                    was wound up and Mr Yit then became the Liquidator. The winding up order was\n                    made on 2 December 2011. 7       After taking control of the Company in December\n                    2010, the Liquidator discovered that the Group’s operating companies,\n                    management and directors were based in the PRC. Despite his efforts, he was\n                    unable to obtain any meaningful assistance from them with regard to the affairs\n                    of the Company or of its subsidiaries. He also ascertained that the\n                    Company’s main assets, namely the PRC Subsidiaries, appeared to have been\n                    diverted to third parties in a series of suspicious transactions. The Liquidator\n                    considered that the Company’s shareholders and creditors had been left\n                    holding shares in a worthless company whose assets had been completely stripped\n                    away. 8       The Liquidator also discovered that the Company\n                    did not have funds to investigate suspicious transactions or to commence legal\n                    proceedings against other parties to recover money and assets that were\n                    allegedly paid out wrongfully. The Liquidator therefore entered into a Funding\n                    Agreement (“the Funding Agreement”) with several creditors\n                    (collectively referred to as “Blackrock creditors”) who are\n                    members of a group identified as the Blackrock Group. Blackrock creditors hold\n                    the majority of the Bonds. Under the Funding Agreement, Blackrock creditors are\n                    to provide: (a)     US$507,122 to the Liquidator as part\n                        payment towards his outstanding fees and costs; (b)     an additional US$230,000 for costs incurred in\n                        examination and/or discovery proceedings commenced by the Liquidator;\n                        and (c)     another\n                        US$507,122 to pay for the Liquidator’s remaining outstanding fees and\n                        costs and additional funding to commence proceedings if the Liquidator\n                        identifies any potential claim which Blackrock creditors decide to\n                        pursue. 9       This application was filed after the Funding\n                    Agreement was concluded. The Liquidator maintained that the purpose of the\n                    application was not simply to obtain information to enable him to bring legal\n                    action against any party. The application had the wider purpose of obtaining\n                    further documents and information to enable the Liquidator to carry out his\n                    statutory duty to: (a)     reconcile the accounts of the Company\n                        and reconstitute the state of the Company’s\n                    knowledge; (b)     investigate the circumstances that led to the Company’s eventual\n                        collapse, including certain suspicious transactions identified by the\n                        Liquidator; and (c)     upon ascertaining the true financial position of the Group and the true\n                        cause of the Company’s collapse, consider whether claims should be\n                        pursued to recover the Company’s assets and/or for breaches of duty by\n                        the Company’s officers. Whilst the\n                        application is drafted in general terms, before me, counsel for the\n                        Liquidator, Ms Blossom Hing, clarified that there were seven specific areas\n                        in respect of which the Liquidator considered that PwC’s information\n                        and records would be particularly helpful. According to the Liquidator, the\n                        documents and information that he had already obtained had come primarily\n                        from the following sources: (d)     the Company’s corporate\n                    secretary; (e)     the\n                        Company’s registered agent in Bermuda; (f)     the Company’s independent directors in\n                        Singapore, Mr Lai and Mr Loo; (g)     the corporate regulatory authorities in Daqing,\n                        PRC; (h)     KPMG\n                        Singapore (“KPMG”), the independent accountants appointed by\n                        the Company on 25 September 2009 to conduct an independent review of the\n                        Company’s financial position to facilitate a restructuring of the\n                        Bonds; and (i)     PwC\n                        who had provided three arch-lever files of documents. 10     Turning to PwC, its role in regard to the\n                    Company was set out in the affidavit of Mr Tan Boon Chok. PwC was engaged to\n                    audit the consolidated financial statements of the Company for the financial\n                    years (“FY”) 2004 to 2009. It issued audit reports for FY 2004 to\n                    FY 2009. 11     As the Company’s auditors, PwC was\n                    responsible for examining the Company’s consolidated financial statements\n                    so as to express an opinion on the same. Broadly, this entailed PwC performing\n                    procedures to obtain audit evidence about the amounts and disclosures in the\n                    financial statements in accordance with the Singapore Financial Reporting\n                    Standards (“SFRS”). PwC’s audit also included evaluating the\n                    appropriateness of accounting policies used and the reasonableness of accounting\n                    estimates made by management, as well as evaluating the overall presentation of\n                    the financial statements. PwC emphasised that as auditors of the Company it did\n                    not participate in any management or executive decisions of the Company\n                    including its trade dealings, affairs or property. 12     PwC issued the FY 2009 audit report on 29\n                    March 2010. According to Mr Tan, it did not commence any audit work for FY 2010\n                    thereafter. PwC took the view that the Liquidator’s real motivation in\n                    bringing the application is to obtain advance evidence in order to gain an\n                    unfair advantage in any claim which he intends to bring or contemplates bringing\n                    against PwC. 13     In dealing with this application, I shall take\n                    the following approach: I shall first consider the law. I shall then\n                    consider the objections made by PwC and the relevant facts relating to the\n                    application.",
        "The general legal principles": "14     The extent and purpose of s 285 of the Act\n                    have been considered on several occasions by the court. The leading authorities\n                    in Singapore areLiquidator of W&P Piling Pte Ltd v Chew\n                        Yin What and others[2004] 3 SLR(R) 164 (“W&P Piling”) andRe Lion\n                        City Holdings Pte Ltd[2003] 3 SLR(R) 493. Foreign judgments on\n                    similar legislation which have been found persuasive in Singapore includeRe British & Commonwealth Holdings plc v Spicer and\n                        Oppenheim[1993] 1 AC 426 (“British\n                        & Commonwealth”) andIn Re Rolls\n                        Razor Ltd (No 2)[1970] 1 Ch 576. 15     The Singapore courts have adopted an expansive\n                    approach towards s 285. As emphasised by V K Rajah JC inW&P Piling, the legislative policy behind s 285 was that the\n                    power given by the section should be used to assist the liquidator in\n                    accumulating facts, information and knowledge that would enable him to discharge\n                    his statutory duties. The judge pointed out that s 285 is couched in extremely\n                    generous terms and should not be interpreted in a constricted manner. Whilst it\n                    cannot be used for a collateral purpose that affords no benefit to the company,\n                    it may be invoked for any proper purpose that would benefit the company and\n                    which is within the statutory powers of the liquidator and the scheme of the\n                    legislation. 16     The authorities make clear that when it is\n                    faced with an application under s 285, the court must bear the following in\n                    mind: (a)     A liquidator is presumed to be\n                        neutral, independent and acting in the company’s best interests. It is\n                        the court’s role to support its officers while policing their\n                        conduct. (b)     The\n                        court must balance between the purpose and intent of the application and the\n                        oppression, inconvenience and disadvantage that it might cause to the\n                        proposed examinee. If relevant information can be obtained without s 285, it\n                        should not be invoked. (c)     No distinction is made between company officers and\n                        outsiders and the same test applies to both categories of people although\n                        the presence of a relationship between the company and the proposed examinee\n                        is a relevant factor that would be considered in evaluating the\n                        application. (d)     An\n                        order for oral examination would be seen as more onerous than an order to\n                        produce documents which would be granted quite readily if relevance is\n                        shown. (e)     Using s\n                        285 as a way to prove a case against the examinee himself is\n                        oppressive. (f)     Information can be sought and fact discovered in a situation where the\n                        liquidator contemplates a specific claim against the examinee or related\n                        entity. However, if the liquidator has already decided to sue the proposed\n                        examinee, this procedure is inappropriate. (g)     Whether the order is sought against a person\n                        already under an obligation to co-operate with the\n                    liquidator. (h)     Exposure to civil or criminal liability is only a factor to be taken into\n                        account and is not conclusive as to the matter. 17     PwC did not disagree with the general\n                    principles stated above. Its counsel, Mr Alvin Yeo SC, sought however to\n                    emphasise the extraordinary and coercive nature of the power bestowed on the\n                    court by s 285. In the light of this, the court should avoid making an order\n                    that is wholly unreasonable, unnecessary or oppressive to the person concerned.W&P Pilingat [30] itself establishes that\n                    a proposed examinee can oppose or discharge an application for examination by\n                    showing: (a)     a case of oppression or unfair\n                        prejudice; (b)     that\n                        the information is not reasonably required; (c)     the liquidator is acting inappropriately,\n                        outside his statutory functions or is motivated by improper\n                        considerations; (d)     that there has been a lack of full and frank disclosure by the liquidator;\n                        or (e)     that the\n                        examination is sought to give the company an undue\n                advantage. 18     There are other relevant principles but since\n                    those relate to the application of the general principles set out above, I will\n                    discuss them as they arise in the context of the particular items of disclosure\n                    that the Liquidator wishes to obtain.",
        "Documents and information sought from PwC": "19     The Liquidator asserted that PwC had provided\n                    the Company with only three arch-lever files even though it had been auditor of\n                    the Company for more than seven years. Those files contained only high-level\n                    consolidation schedules, limited company and subsidiary level financial\n                    information, year-end balances and minutes of meetings which the Liquidator had\n                    already recovered from other sources. Those documents would not be of use to the\n                    Liquidator unless he also has access to the full general ledgers and accounts\n                    that made up the high level consolidation schedules and year-end\n                    balances. 20     The Liquidator said that he needs primary\n                    records for a proper analysis of the consolidated financial statements and\n                    year-end balances. This is essential to the Liquidator’s ability to\n                    reconstruct the financial records of the Company and to investigate the\n                    suspicious transactions. The primary records to which the Liquidator is\n                    referring and which he believes PwC would have include: (a)     general ledgers and trial balance(s)\n                        of each entity in the Group; (b)     bank statements and bank reconciliations of the same that\n                        would have been prepared by each entity in the Group; (c)     fixed assets’ registers of each\n                        entity in the Group and evidence of the ownership of assets and land use\n                        rights recorded on the register; (d)     copies of loan facility documents for each loan facility\n                        operated by each entity of the Group; (e)     sales contracts, purchase contracts, supplier contracts,\n                        receipts and payments vouchers; (f)     detailed creditors and debtors schedules;\n                    and (g)     statutory\n                        documents filed by each entity of the Group. The liquidator also wants access to PwC’s working\n                        papers. 21     The Liquidator has identified seven suspicious\n                    and/or irregular and/or undisclosed transactions undertaken by the Company and\n                    the Group between 2006 and 2010 which warrant further investigation. These can\n                    be briefly described as follows: (a)     surreptitious disposal of\n                        substantially all of the Company’s assets on or around 4 December 2010\n                        by way of an auction (“the Auction”) of the shares of the PRC\n                        Subsidiaries which had been pledged to the China Construction Bank\n                        (“CCB”) as security for certain loans apparently extended by\n                        CCB to the BVI Subsidiaries; (b)     cash payments totalling some S$16.8m to Power Charm Group\n                        Ltd (“Power Charm”) between December 2009 and September\n                        2010; (c)     payment\n                        of some RMB 70m in or around December 2009 to purchase technical\n                        know-how in respect of a Bio-diesel Plant; (d)     goods that had been sold and returned, the value\n                        of which amounted to RMB 254m in 2009 and RMB 437.1 million in\n                        2010, and some of which were subsequently re-sold for only\n                        RMB 14.8m; (e)     cash payments of some RMB 529m without written documentation in\n                        relation to the Soybean Hi-Tech Industrial Zone in Daqing (“Soybean\n                        Zone”); (f)     an undisclosed lease of land to construct a hotel known as the Daqing\n                        Manhatwen Hotel; and (g)     suspicious transactions described in certain anonymous letters\n                        regarding the Company. 22     The Liquidator believes that PwC would have\n                    obtained documents and information relating to the Group’s trade dealings,\n                    affairs and properties which information could assist in his investigations\n                    because: (a)     it was the reporting accountant and\n                        auditor for the initial public offering of the Company’s shares in\n                        December 2003 and in this role would have prepared and presented pro-forma\n                        financial information; (b)     it was the Company’s and Group’s auditor for\n                        seven years and was closely involved in the Company’s affairs.\n                        PwC’s representatives attended every single Audit Committee meeting\n                        between FY 2004 and FY 2009 and attended two Audit Committee meeting held in\n                        2010; (c)     the\n                        Company’s management would have provided to PwC relevant information\n                        on the background, nature and parties involved in particular\n                        transactions; (d)     PwC audited the financial accounts of the Group in accordance with the\n                        Singapore Standards on Auditing (“SSA”) and would therefore\n                        have examined, on a test basis, audit evidence supporting the amounts and\n                        disclosures in the Group’s financial statements; (e)     the SSA requires PwC to keep a record\n                        of audit procedures performed, the relevant audit evidence obtained and\n                        conclusion reached for a period of not less than five years from the date of\n                        the audit reports. 23     Referring to the record of audit procedures\n                    performed, Ms Hing submits that PwC would most likely have audit evidence in the\n                    form of PwC’s working papers. This would include: (a)     extracts of the accounting records\n                        of the Company; (b)     external confirmations; (c)     reconciliation schedules; (d)     samples of major invoices issued to, and by, the\n                        Company and its subsidiaries; (e)     copies of material contracts, loan documentation, payroll\n                        related documentation, tax filings and/or assessment; (f)     details of major customers and\n                        suppliers; and (g)     records of interviews with the Company and the Group’s management\n                        and/or staff and other supporting documents which contain information that\n                        is not reflected in the Company’s financial statements, but which may\n                        nevertheless be important to assist the Liquidator in discharging his\n                        statutory duties. 24     The Liquidator pointed out that in 2006 PwC\n                    had confirmed that it had: (a)     been granted unrestricted access to\n                        the Group’s accounting and other records; (b)     had carried analytical procedures on sales\n                        revenue, gross profit margin, Value-Added Tax and substantial vouching of\n                        sales; (c)     received\n                        bank confirmations from bank officers; (d)     sighted documentation on the legal title deeds of the\n                        material property, plant and equipment; and (e)     attended a physical inventory account and had\n                        tested the reconciliation of the inventory account\n                    information. Ms Hing submits that similar\n                        access and work would have been given and performed in the following years\n                        as well. 25     The Liquidator contends that although PwC did\n                    not carry out audit work in respect of FY 2010, after the issue of the FY 2009\n                    audit report on 29 March 2010, it would still have been provided with\n                    further information and documents as part of its follow up work in respect of\n                    material subsequent events. In fact, PwC continued to attend Audit Committee\n                    meetings up to 5 May 2010 and at that meeting it was apprised of\n                    information relating to the return of sold goods during the period between\n                    January and March 2010. 26     Given the evidence and PwC’s own letters\n                    to the Liquidator, the Liquidator considers that PwC would be able to provide\n                    the following information or documents in relation to the Group: (a)     working papers and/or notes with\n                        information on the “analytical procedures on sales revenue”\n                        and “substantive vouching of sales and VAT” for the purpose of\n                        verifying the true nature of the trading relationships the Group had with\n                        its customers; (b)     copies of the general ledgers, trial balances, aged receivables schedules\n                        and debtors lists for the Company and each of its\n                    subsidiaries; (c)     copies of bank statements and bank reconciliation\n                    schedules; (d)     confirmations from the bank officers of Agricultural Bank of China, Bank of\n                        Communications and Daqing Commercial Bank that were given to\n                    PwC; (e)     written\n                        confirmations from the Company’s top five customers and the\n                        reconciliation with the accounting records of the\n                    Company; (f)     working\n                        papers of PwC along with the external bank confirmations which show how the\n                        confirmations from the bank officers were reconciled with the accounting\n                        records of the Company; (g)     copies of the legal title deeds of the material property,\n                        plant and equipment held by the Group which will allow the Liquidator to\n                        ascertain the assets of the Group, and notes or memoranda on physical\n                        inspections conducted by PwC’s staff; and (h)     notes recording the physical inventory stocktake\n                        conducted by PwC and working papers showing the reconciliation of the\n                        inventory count information.",
        "PwC’s objections to the application": "",
        "Is the Liquidator objective?": "27     PwC submits that the Liquidator is not\n                    exercising his power under s 285 for a proper purpose. CitingKorea Asset Management Corp v Daewoo Singapore Pte Ltd (in\n                        liquidation)[2004] 1 SLR(R) 671 (“KAMC”), PwC asserts that any liquidator making such an\n                    application should be seen to be properly wearing the mantle of objective\n                    neutrality untarnished by any special interest, including considerations of his\n                    own fee. In this case, the Liquidator does not meet this standard\n                    because: (a)     he is represented by the same\n                        solicitors as acted for BNY in presenting CWU 195; (b)     he is focussing on claims which can be\n                        made to maximise recovery for the Company’s creditors, and in\n                        particular Blackrock creditors, and seeks to achieve this by applying\n                        pressure on Mr Ming and other parties through the s 285 procedure so as to\n                        procure more reasonable settlement offers; (c)     the Funding Agreement makes it clear that the\n                        Liquidator is not purely trying to ascertain information relating to the\n                        Company through the s 285 procedure but is doing so with a view to\n                        identifying and/or obtaining more information about claims which can be\n                        pursued; (d)     under\n                        the Funding Agreement, the Liquidator would only be paid the other half of\n                        the outstanding fees of US$507,122 in the event that he identifies potential\n                        claims that may be available against third parties, the Blackrock creditors\n                        decide to pursue any of these claims, and parties agree on additional\n                        funding for the same. Therefore, the Liquidator has every incentive to\n                        commence proceedings that are frivolous and that would only result in losses\n                        for the Company. 28     I do not accept the contention that the\n                    Liquidator in this case is not objective and neutral. The fact that the\n                    Liquidator is represented by the same solicitors as BNY in CWU 195 was, cannot,\n                    without more, establish a lack of objectivity on the part of the Liquidator. The\n                    Liquidator’s function is to collect assets for and protect the interests\n                    of the unsecured creditors. In that respect, there is an identity of interests\n                    between BNY, as the trustee for the bondholders who are among the\n                    Company’s unsecured creditors, and the Liquidator as the protector of that\n                    class of creditors. There is no doubt that the Company owed the bondholders a\n                    debt and that the winding up order was properly made. In those circumstances,\n                    the simple fact that the Liquidator’s solicitors formerly acted for BNY\n                    cannot imply any lack of objectivity on the part of the\n                Liquidator. 29     The second reason given, that the Liquidator\n                    is not objective because he has been seeking out claims to maximise recovery for\n                    the Company’s creditors is, as the Liquidator submits, unintelligible. One\n                    of the functions of the Liquidator is to maximise recovery for the\n                    Company’s creditors. The fact that these creditors include Blackrock\n                    creditors that are funding the exercise is irrelevant. It would be a breach of\n                    duty if the Liquidator did not seek to determine whether there were claims that\n                    could be pursued for the benefit of the creditors despite being put in funds to\n                    do so. 30     Thirdly, I see nothing suspicious in the\n                    Funding Agreement. The Liquidator needs funds to pursue investigations and\n                    claims for the benefit of all creditors. Although the funds are being provided\n                    by Blackrock creditors, there is nothing in the Funding Agreement that would\n                    give these Blackrock creditors any preference from any recoveries made by the\n                    Company. All benefits from claims and recoveries would be shared rateably among\n                    all the unsecured creditors. It is correct that the Liquidator will not recover\n                    half of his outstanding fees unless certain conditions are met but it is as much\n                    in the interests of all the creditors as of the Liquidator (with regard to his\n                    fees) that if the Company has been wrongfully deprived of assets, a proper\n                    investigation should be done to determine whether viable claims for recovery of\n                    the same can be brought. If the Liquidator finds and substantiates such claims\n                    there may very well be benefits for the unsecured creditors and the Liquidator\n                    should not be hindered by allegations of bias simply because he too may benefit\n                    from the same. The Liquidator is an officer of the court. Further, apart from\n                    carrying out his statutory duties, he has his own professional reputation to\n                    protect. No basis has been established for the allegation that he will pursue\n                    frivolous proceedings where there will be no benefit to the creditors and that\n                    the creditors will not support such actions. In any case, if the Liquidator acts\n                    unreasonably in pursuing frivolous claims, the court has the power to make\n                    personal costs orders against him. 31     I accept the Liquidator’s evidence that\n                    there are claims that can be investigated for the benefit of the creditors and\n                    that the Liquidator needed financing because the Company had no funds of its own\n                    to support the investigation. The Funding Agreement was a proper step for the\n                    Liquidator to take when he found out that Blackrock creditors were willing to\n                    finance the investigation. It should also be noted that at the hearing that Mr\n                    Yeo stated he was not suggesting that the Liquidator was misconducting\n                    himself. 32     PwC relies onKAMCto show that the Liquidator was not acting objectively in\n                    the present case. The facts ofKAMCare very\n                    different and do not assist PwC. InKAMC, the\n                    majority creditors of a company sought to obtain a compulsory winding up order\n                    when voluntary winding up proceedings had already been commenced. The\n                    liquidators appointed for the voluntary winding up proceedings objected to the\n                    application. The court found that the applicants were not comfortable with or\n                    confident in the liquidators’ ability to discharge their duties\n                    even-handedly. It also noted that the liquidators had not been able to\n                    adequately satisfy the applicants or the court how layer upon layer of intricate\n                    transactions between the company and related entities could be satisfactorily\n                    peeled back and accounted for. There was real basis for the applicants to\n                    perceive some apparent conflict of interest between the liquidators and the\n                    creditors. The situation here is completely unlike that which occurred inKAMC. The Liquidator was appointed by\n                    creditors in a compulsory winding up and all his actions so far have been to\n                    further the interests of the creditors rather than those of the Company or its\n                    shareholders.",
        "Is the Liquidator’s true motivation to obtain evidence against\n                PwC?": "33     Mr Yeo submits that the Liquidator’s\n                    true motivation in bringing this application is to seek discovery from PwC to\n                    bolster his case in respect of a potential claim against them. 34     This allegation is partly based on PwC’s\n                    interpretation of the Liquidator’s previous statements. PwC points to the\n                    first report that the Liquidator gave to the court dated 28 November 2011\n                    (“First Report”). In the First Report, the Liquidator identified\n                    three areas of concern (‘the original concerns”) regarding the\n                    handling of assets of the Company. Then, in a report to creditors dated 6\n                    December 2011, the Liquidator said he had identified possible claims against Mr\n                    Ming, the former directors and other parties related to the three specific\n                    matters, that is, the original concerns. None of them involved PwC. Next, in an\n                    affidavit filed in CWU 195, in June 2012, the Liquidator continued to list the\n                    original concerns when describing matters that he considered warranted further\n                    investigation and action. In none of the documents referred to did the\n                    Liquidator claim that there were other suspicious transactions which warranted\n                    investigation. Five of the seven transactions which the Liquidator now considers\n                    to be suspicious were not even hinted at earlier. 35     Mr Yeo submits that the original concerns were\n                    matters that PwC could not provide the Liquidator with further information on\n                    because they related to actions that had been taken after 29 March 2010 when PwC\n                    was no longer doing audit work. In particular, the Liquidator was concerned with\n                    the payments made to Power Charm, the loans made to the BVI Subsidiaries by CCB\n                    and the propriety of the Auction. PwC said it could not assist the Liquidator in\n                    respect of those matters because they all occurred in FY 2010. PwC did not\n                    perform any audit work in FY 2010 and would not have any information pertaining\n                    to those transactions. When this had been pointed out to him, the Liquidator had\n                    sought to re-package his request in relation to those matters. This was not\n                    permissible especially because the Liquidator had not informed the court of the\n                    full nature and extent of the information that he had already received from\n                    various parties and/or uncovered from his own investigation. It was therefore\n                    not clear what information the Liquidator was seeking to verify or corroborate\n                    from the documents or what information he wanted PwC to disclose. Mr Yeo went on\n                    to submit that if the Liquidator made full disclosure of the information that he\n                    already had, this would expose his true motives for the application (ie, to fish for information in order to bolster a claim\n                    against PwC). 36     I am not convinced by this argument. In the\n                    first place, the fact that the Liquidator originally identified three areas of\n                    concern and has now asked the court for documents relating to seven areas of\n                    concern is by itself a completely neutral fact. The Liquidator has been carrying\n                    on his investigation since he was first appointed in December 2010 and he has\n                    managed to obtain information over the past few years which has enabled him to\n                    identify further areas of concern. Just because PwC may not be able to help very\n                    much in relation to the original concerns, does not mean that the new areas have\n                    been selected in order to persecute PwC. 37     Secondly, the objection is too vague. The\n                    Liquidator has never said anything in any of the reports or court affidavits\n                    about the quality of PwC’s audit work or about suing PwC. So far there has\n                    been no suggestion that PwC, in the course of its audit work, behaved\n                    unprofessionally in any way. The approach by PwC appears to be unduly defensive.\n                    At this stage of the proceedings, the assertion that the Liquidator’s true\n                    motive is to fault PwC’s audit work and unfairly obtain advance evidence\n                    to substantiate a claim against PwC is completely baseless. 38     The Liquidator’s evidence is that he has\n                    not settled on any view as to whether any claims may even exist against PwC. He\n                    simply wants to try and obtain as much information as possible in relation to\n                    the Company’s affairs. In any case, in the English case ofRe Chesterfield United Inc and another company; Akers and another v\n                        Deutsche Bank AG[2013] 1 BCLC 709, the court observed that it\n                    was not a bar to an examination order being made that the liquidators have in\n                    mind the possibility of litigation and that it was legitimate for an office\n                    holder to seek relief with a view to investigation whether a claim\n                    exists. 39     In this connection, PwC also argues that the\n                    Liquidator had no reasonable requirement for the information and documents\n                    sought from it. I disagree. I will deal with this below but I accept that\n                    PwC’s information and documents will assist the Liquidator to carry out\n                    his statutory duty as described at [9] above.",
        "Would granting the application result in oppressing PwC?": "40     PwC submits that granting the application\n                    would result in an order which is oppressive to it because: (a)     it is being asked to turn over its\n                        audit working papers, which are its proprietary\n                    information; (b)     the\n                        order would expose PwC to a real risk of civil liability as well as criminal\n                        sanction under Chinese law; and (c)     an oral examination of Mr Tham and Mr Tan would be\n                        oppressive, unnecessary and unfruitful in any case. Proprietary information 41     It is true that the working papers belong to\n                    PwC and contain their proprietary information meant for internal use when PwC\n                    staff was preparing the various audit reports. This does not mean, however, that\n                    disclosure of these documents cannot be ordered. 42     InBritish &\n                        Commonwealth, the auditors of the company concerned were ordered\n                    to disclose their working papers because the same included “information\n                    of relevance”. The applicant in that case was the administrator of an\n                    insolvent company which had earlier purchased and acquired a target company\n                    based in part on a report by the target company’s auditors that the target\n                    company had sufficient working capital for its operations. Subsequently, it was\n                    found that the target company’s assets were insufficient for this purpose\n                    and the administrator of the insolvent company applied for and obtained an order\n                    for the auditors of the target company to produce “all books, papers, or\n                    other records … relating to or having any connection” with: (a)     the target company’s year-end\n                        audit report immediately before the acquisition; (b)     the target company’s year-end\n                        audit report immediately after the acquisition; and (c)     the acquisition of the target company,\n                        including but not limited to the working capital\n                review. 43     The order for production was challenged on the\n                    basis that it was so wide that it included the working papers of the target\n                    company’s auditors besides simply the papers of the target company itself.\n                    The House of Lords upheld the order on the basis that these papers could clearly\n                    contain information of relevance to the administrator’s\n                    investigation. 44     In a more recent Hong Kong case,Re Kong Wah Holdings Ltd & Anor (in liquidation)[2004] 2 HKC 255 (“Kong Wah\n                    Holdings”), the liquidator relied on a statutory power in Hong\n                    Kong’s company legislation that is equivalent to s285 to compel the\n                    production of the auditors’ “internal review” papers in\n                    addition to its audit working papers. The court stated at [53] that the fact\n                    that the documents were internal documents did not necessarily mean that they\n                    should be excluded from production but was merely a factor to be taken into\n                    account in the balancing exercise. In that case, the auditors did not suggest\n                    that the internal review documents did not contain pertinent information. The\n                    judge took the view that the risk of oppression to the auditors was outweighed\n                    by the reasonable requirements of the liquidator to have access to them in order\n                    to carry out his duties. 45     Thus, the fact that PwC’s working papers\n                    are their property cannot in itself form a basis for resisting the\n                    Liquidator’s application. The papers would have to be disclosed as long as\n                    they contain information of relevance to the Liquidator’s\n                    investigation. Risk of civil liability and criminal sanctions 46     PwC submits that granting the application\n                    against it will expose it to a real risk of civil liability as well as criminal\n                    sanctions under PRC law. PwC relies on the opinions of its PRC law experts, Mr\n                    Zhang Zhonggang (“Mr Zhang”) and Mr Lin Lei (“Mr\n                    Lin”) and, in certain respects only, on the opinion of the\n                    Liquidator’s PRC law expert, Mr Gao Jun (“Mr Gao”). The PRC\n                    legislation referred to by the experts are entitled “Provisions on\n                    Strengthening Confidentiality and Archives Administration of Overseas Issuance\n                    and Listing of Securities” (“the Provisions”) and\n                    “Law of the People’s Republic of China on Protecting the State\n                    Secrets” (“State Secrets Law”). It should be noted that the\n                    Provisions were issued by the China Securities Regulation Commission, the State\n                    Secrecy Bureau and the State Archives Administration in October 2009. The State\n                    Secrets Law was promulgated on 5 September 1988 and revised on 29 April\n                    2010. Confidentiality 47     PwC’s first submission here is that all\n                    the PRC law experts agree that PwC owes duties of confidentiality to the PRC\n                    Subsidiaries (who owned any document or information PwC might have obtained from\n                    them). The PRC Subsidiaries are now under the control of new owners. A breach of\n                    confidentiality obligations by PwC would render it legally liable to compensate\n                    the PRC Subsidiaries for losses incurred as a result. 48     I do not accept that submission. I agree with\n                    the Liquidator that PwC could not be in breach of any contractual\n                    confidentiality obligations if it merely provides to the Liquidator historical\n                    documents relating to the Company which the PRC Subsidiaries had previously\n                    consented to provide and which the Company had access to when it was their\n                    ultimate holding company. Any documents and information belonging to the PRC\n                    Subsidiaries which are now in PwC’s possession must have been given to\n                    them by the Company with the consent of the PRC Subsidiaries. The Liquidator is\n                    now the Company’s administrator and as such the breach of confidentiality\n                    argument cannot apply to him. 49     PwC’s second submission is based on\n                    Article 219 of the PRC Criminal Law (“Art 219”). Mr Yeo says that\n                    this article prohibits the disclosure of “business secrets [which] causes\n                    heavy losses to the obligee” and if Art 219 is infringed, PwC will be\n                    subject to penal sanctions. However, according to Mr Gao, Art 219 is\n                    predicated on a severe violation of contractual obligations or use of other\n                    illegitimate means which would in turn cause losses to the PRC Subsidiaries.\n                    There is no evidence that disclosure of any documents in PwC’s possession\n                    would cause heavy losses or losses of any kind to the PRC Subsidiaries. The\n                    information and documents are historical in nature and it is difficult to\n                    envisage how in 2014 they could still be considered business secrets, the\n                    disclosure of which would cause any party heavy financial losses. 50     I agree with the Liquidator’s\n                    submissions. Mr Gao also pointed out that the PRC courts would be unlikely to\n                    make a finding of criminal or civil liability for the disclosure of the\n                    requested information and documents when PwC would be acting pursuant to a court\n                    order which is binding on it. Whilst Mr Zhang disagree with this point, he did\n                    not cite any examples of cases where the PRC courts had imposed liability,\n                    whether civil or criminal, on a foreign entity which had acted in accordance\n                    with an order from a foreign court of competent jurisdiction. Criminal sanctions 51     In relation to the submission that that\n                    disclosure of its audit papers would contravene the penal laws of the PRC, PwC\n                    relies on a number of points. The first is Art 6 of the Provisions which,\n                    according to the English translation provided, reads: In the process of overseas issuance and listing of securities, working\n                        papers or other archives formed within the territory of China by the\n                        securities companies and securities services institutions that provide\n                        relevant securities services shall be stored in the territory of\n                        China. Where the working papers mentioned in the preceding paragraph involve\n                        state secrets, state security or vital interests, such papers shall not be\n                        stored, processed or transferred in non-confidential computer information\n                        system; the said papers are forbidden from carrying, transporting overseas\n                        or transferring to overseas institutions or individuals via any means such\n                        as information technology without approval of competent authorities. 52     In the view of Mr Zhang and Mr Lin, Art 6 of\n                    the Provisions covered all audit work done by PwC not just for the\n                    Company’s listing in Singapore but also for the purposes of keeping the\n                    listing on the SGX. Since PwC was engaged to audit the consolidated financial\n                    statements of the Company which contained financial information of the PRC\n                    Subsidiaries, PwC would be subject to the confidentiality obligations imposed by\n                    Art 6. They opined that Art 6 also extends to working papers created in\n                    Singapore containing information on state secrets, state security or the\n                    state’s vital interests. 53     Mr Gao’s view was different. He opined\n                    that the Provisions did not apply to the Company because Art 10 refers to\n                    overseas listed companies as “domestic companies limited by shares that\n                    issue foreign shares listed overseas”. Since the Company was incorporated\n                    in Bermuda, it was not a domestic company with an overseas listing and therefore\n                    did not fall within the Provisions. Further, Mr Gao noted that the Provisions\n                    are only applicable to documents “formed within the territory of\n                    China”. Therefore, the expansive definition of audit working papers given\n                    by Mr Zhang and Mr Lin did not have a legal basis. 54     The views of Mr Gao appear to me to be more in\n                    line with the text of Art 6 of the Provisions as provided to me, than those of\n                    PwC’s experts. I accept that because the Company was incorporated in\n                    Bermuda it could not be covered by Art 6. Secondly, there is nothing in Art 6\n                    that states that the Provisions would have extraterritorial effect in respect of\n                    documents that had already been removed from the PRC and are stored outside it.\n                    Article 6 prohibits the carriage of such documents that contain state secrets\n                    outside the PRC. If PwC has done that, it may have already committed an offence\n                    under PRC law but I consider it reasonable to assume that PwC would not\n                    take any documents containing state secrets out of the PRC without the requisite\n                    approval from the competent authorities and that therefore any order that I make\n                    would not cause PwC to contravene the Provisions. In any case, any order made by\n                    this court could only apply to documents which are already in PwC’s\n                    possession in Singapore. I would not order PwC to transport documents to\n                    Singapore if doing so would cause them to contravene PRC law. I note that Mr\n                    Gao’s opinion is that the Provisions do not prohibit the carriage out of\n                    China of documents that do not contain state secrets. Nor do they prohibit the\n                    disclosure of such documents to the Liquidator. 55     Secondly, I note that Art 6 refers to\n                    documents that are produced during the process of overseas issuance and listing\n                    of securities. As Mr Gao observed, there is nothing in Art 6 that refers to\n                    documents that are produced to comply with post-listing\n                requirements. 56     The next objection taken by PwC is that\n                    disclosure of the documents and information would offend the State Secrets Law.\n                    Mr Zhang and Mr Lin stated that Art 2 of this law defines “state\n                    secrets” as those which are “related to national security and\n                    interests”. In Art 9 of the same law, “national security and\n                    interests” is further defined to be in relation to “the politics,\n                    economy, national defence, foreign affairs and etc”. They opined that as\n                    the documents demanded by the Liquidator may include loans or documents issued\n                    or signed by local governments in the PRC, as well as documents referring or\n                    relating to certain governmental decisions and correspondence, these documents\n                    “could therefore very possibly involve some state secrets, state security\n                    or vital interests”. They did put in a caveat that whether the documents\n                    truly contained such matters would ultimately be subject to the examination and\n                    approval of the relevant competent authorities. Documents containing such\n                    material cannot be shown to overseas institutions or individuals, including the\n                    Liquidator, without the approval of the relevant competent authorities. In their\n                    opinion, if the Liquidator wished to obtain such documents, he should seek\n                    assistance from the Chinese Embassy in Singapore or communicate with the\n                    relevant authorities to obtain their approval before requesting PwC to provide\n                    the documents. 57     Mr Gao did not deny the applicability of Art 2\n                    of the State Secrets Law if the documents contained state secrets – if\n                    there were, state consent was needed before they could be disclosed. However, he\n                    noted that Mr Zhang and Mr Lin had not shown that the documents contained state\n                    secrets or that state approval was needed for their disclosure. Even if there\n                    were allegedly state secrets in the documents, Art 20 of the State Secrets Law\n                    provided a mechanism for ascertaining what should be treated as state secrets\n                    and if approval was not granted for their disclosure, the parts which did not\n                    contain state secrets could still be disclosed. 58     It is clear from the summary of their opinion\n                    which I have given above, that the views of Mr Zhang and Mr Lin were based on\n                    many assumptions. They provided no real evidence as to what state secrets there\n                    were in the documents or how revealing them would be against PRC law. PwC could\n                    have provided the documents to its experts so that they would be in a position\n                    to make more informed opinions. The fact that the experts did not refer to more\n                    specific details in the documents is an indication that either they did not see\n                    the documents or that the documents that were shown to them did not contain\n                    state secrets. PwC has not discharged the burden on it to show that the\n                    documents asked for contain state secrets. 59     Mr Gao also pointed out that the fact that PwC\n                    was able to conduct its audit process must mean that the authorities had at that\n                    point consented to the disclosure of the documents if they contained state\n                    secrets. Alternatively, the examination of the documents by PwC meant that they\n                    did not contain state secrets and no consent was needed for their disclosure. On\n                    either case, there is no reason why the documents disclosed to the auditor of\n                    the Company cannot be further disclosed to the liquidator of the\n                Company. 60     Having considered all the evidence, I am not\n                    satisfied that an order for disclosure to the Liquidator of the documents and\n                    information requested would subject PwC to criminal sanctions in the\n                PRC.",
        "Is the Liquidator’s request too wide?": "61     An objection that PwC pressed very strongly is\n                    that the request applies to a wide range of documents and that it should not be\n                    obliged to disclose its working papers. 62     As regards the working papers, Ms Hing\n                    submitted that it was not unusual for a court to order that working papers be\n                    disclosed. She cited four authorities and relied on two in particular:Re New China Hong Kong Group Ltd[2003] 3 HKC 252\n                        (“Re New China”) andKong Wah Holdings. 63     InRe New China,\n                    the liquidator had asked for the working papers to be disclosed by the auditors\n                    as there had been payments made to third parties, massive write-downs, cost\n                    overruns in construction and questionable transactions. Objections made were\n                    based on the request being oppressive, too broad and vague, and it constituting\n                    a fishing expedition. Kwan J held that whether documents should be identified\n                    with specificity depended on the nature and subject of the investigation. In\n                    that case, the liquidators could not practically go into further detail other\n                    than what they had been supplied with and it was not the court’s job to\n                    undertake fine judgments as to the precise width of the order to be made:Re New Chinaat [57]–[59]. The\n                    liquidator was to be trusted in his assessment of what was needed. 64Kong Wah\n                        Holdingsconcerned the liquidation of two companies which had\n                    collectively lost more than US$2bn in total assets. The liquidators sought to\n                    obtain the books and records of the companies from the auditor because they had\n                    to reconstruct the assets and liabilities of the companies. The auditor\n                    eventually offered to provide access to all the documents except those for the\n                    purposes of the auditor’s internal review and approval process and audit\n                    planning and programming. This was rejected by the liquidator and the issue was\n                    whether the internal review documents should be provided to the\n                    liquidators. 65     The court ordered the disclosure of all the\n                    documents including the internal review documents. This was because the\n                    liquidations were massive; there were highly unusual and doubtful transactions\n                    which had taken place not long before the winding up petition was made, there\n                    were important gaps as to the liquidator’s knowledge of the\n                    companies’ affairs, there were specific substantial transactions\n                    identified by the liquidators as requiring investigation but for which no\n                    meaningful assistance had been obtained. In the circumstances, any prejudice\n                    caused to the auditor was outweighed by the public interest which required them\n                    to give assistance to the liquidators:Kong Wah\n                        Holdingsat [51]. The risk that the auditor might be sued by the\n                    liquidator was only one of the factors to be considered and this was outweighed\n                    by other countervailing public interest considerations:Kong\n                        Wah Holdingsat [55]. 66     Ms Hing submits that two other cases support\n                    her application:Joint Liquidators of Sasea Finance Ltd v\n                        KPMG[1998] BBC 216 (“Sasea v\n                        KPMG”) andBritish &\n                        Commonwealth. In those cases, the public interest in assisting\n                    liquidators outweighed any prejudice that would be caused to the\n                auditor. 67     Mr Yeo submits that the cases do not assist\n                    the Liquidator because: (a)     InRe New\n                            China, the facts were unusual as the partner of the audit\n                        firm was also the financial advisor of the company. The facts are not the\n                        same here; (b)Kong Wah Holdingsat [57] recognised that\n                        in normal situations specific transactions had to be identified but there\n                        was no identification of any specific transaction here; (c)     InSasea v\n                            KPMG, there was a fraud and criminal conviction while here\n                        any fraud was only in relation to the CCB share pledges and had not been\n                        proven. Furthermore, while consolidated\n                        accounts were done up and reviewed by PwC, it did not mean that PwC had the\n                        source documents. All the correspondence with the Company had been provided\n                        to the Liquidator. The rest of the documents were mainly internal\n                        workings. 68     The exact facts in the cases cited may be\n                    different from those before me but these authorities show that the exercise is,\n                    in essence, a balance between the public interest in providing assistance to a\n                    liquidator in the execution of his duties and the prejudice that may be caused\n                    to the proposed examinee. 69     An examination of the suspicious transactions\n                    identified by the Liquidator shows that the Liquidator needs more information in\n                    order to correctly assess these transactions and determine whether anything\n                    wrong has been done and, if so, who should be held responsible for the same.\n                    Such information is not limited to the transactions themselves. In a number of\n                    cases, the transactions took place after PwC ceased to act as auditor but this\n                    does not mean that the documents in its possession will not be helpful to the\n                    Liquidator. There are huge gaps in the Liquidator’s knowledge, and the\n                    Group’s operations having been conducted in a foreign country, big\n                    obstacles in the way of the Liquidator obtaining information from the BVI\n                    Subsidiaries and the PRC Subsidiaries themselves. The documents with PwC will\n                    assist the Liquidator in building up the picture of the operations of the\n                    Company and the Group and indicate not only the background but also how members\n                    of the Group conducted themselves. Some examples may assist. 70     First, in relation to the CCB loans, the share\n                    pledges and the Auction, the information that the Liquidator had was that the\n                    BVI Subsidiaries had disposed of the shares in the PRC Subsidiaries for\n                    RMB 580m pursuant to share pledges that they had executed in favour of CCB.\n                    However, the loans and the share pledges were not disclosed in the audited\n                    accounts and the share pledges were not filed and registered promptly with the\n                    State Administration of Industry and Commerce (“SAIC”). There was\n                    no good reason for this. Next, CCB had exercised its rights under the share\n                    pledges just three days after the statutory demand was issued by BNY and the\n                    shares were sold in the Auction within the next ten days. The purchasers were\n                    Weihai Guosheng Real Property Development Co Ltd (“WGPD”) and Rui\n                    Feng Group Ltd (“RFG”). CCB had not given the Liquidator any\n                    information on the Auction and said that it had no knowledge of it and had not\n                    received any of the proceeds from the Auction. This was inconsistent with\n                    documents obtained from SAIC. 71     Additionally, the Liquidator’s\n                    suspicions were aroused because (a) four months prior to the appointment of the\n                    provisional liquidator, 2% of the shares in each PRC Subsidiary were sold to a\n                    company called Weihai Zhuozhan Import & Export Co Ltd (“WZIE”)\n                    for a sum of RMB 10.641m; and (b) WZIE, WPGD and RFG might be related to Mr\n                    Ming and the Group because the people managing these companies were also in\n                    charge of the PRC Subsidiaries whilst they belonged to the Group. 72     Whilst the Auction took place after PwC ceased\n                    to be the Company’s auditor, the loans by CCB and the share pledges were\n                    apparently signed between September 2009 and March 2010. There may therefore be\n                    useful information relating to CCB and the loans in the possession of PwC, in\n                    particular, in relation to the need for funds on the part of the BVI and PRC\n                    Subsidiaries. PwC has said that the pledges and the loans were not disclosed to\n                    it. However, the documents it has may be able to clarify the operations of the\n                    PRC Subsidiaries and the cash needs of the Group. 73     The second item, the Power Charm cash\n                    payments, concerned S$17m paid to Power Charm between December 2009 and\n                    September 2010. The bulk of the money was paid between 29 June 2010 and 21\n                    September 2010 which fell within the six-month period prior to the appointment\n                    of the provisional liquidator. The Liquidator considers that the timing of the\n                    payments warrants further information. He needs to know the reason for the\n                    payments, which person or entities are associated with Power Charm and why it\n                    became inactive in December 2010, shortly after receiving such substantial\n                    payments. 74     The Liquidator’s position is that PwC\n                    can assist the Liquidator because it was the Company’s auditor during the\n                    relevant period and would have test-examined the audit evidence supporting the\n                    Power Charm payments and the information would enable it to reconstruct the\n                    circumstances surrounding the payments. PwC’s response is that all the\n                    information it had regarding the 8 December 2009 payment to Power Charm was\n                    set out in Mr Tan’s affidavit and it could not furnish any more\n                    information. However, other documents in its possession may be helpful in\n                    assisting the Liquidator in re-constructing the position of the Group at the\n                    time these payments were made. 75     As regards the Bio-diesel Plant, RMB 70m\n                    was paid to buy expertise for this Plant on 28 December 2009 when the Company\n                    was in financial difficulty and had already defaulted on the Bonds. The\n                    Liquidator submitted that PwC can assist because it would have examined audit\n                    evidence supporting the payment and the minutes of the 27 February 2010 Audit\n                    Committee meeting stated PwC had asked management to expedite the amended\n                    contract’s finalisation. The acquisition was also discussed in the 5\n                    November 2009 Audit Committee meeting and since PwC had participated in the\n                    Audit Committee discussions on all the relevant dates and identified the lack of\n                    documentation regarding the payment, it is likely to have information useful to\n                    the Liquidator. I accept the submission. The fact that the acquisition was a\n                    business decision for which PwC was not responsible (as it argued) does not mean\n                    that it may not have information and documents that would be of\n                    assistance. 76     The next suspicious circumstance concerned the\n                    return in 2009 and 2010 of significant numbers of goods that had been sold. The\n                    Liquidator pointed out that these substantial product returns had been accepted\n                    for the first time by the Group in 2009 and they had substantially reduced the\n                    Group’s revenue. The product returns represented about 15% of the\n                    Group’s revenue in 2009 and 66% of the total revenue generated for the\n                    first half of 2009. There was no plausible explanation for the returns or for\n                    the Company’s acceptance of the same. 77     PwC had knowledge of the returns. It had noted\n                    in its 2009 Report that: (i) sales returns of such magnitude were the first in\n                    the Group’s history; (ii) it was impossible to ensure that the\n                    re-processed goods were sold at reasonable prices to maximise return; and (iii)\n                    it was not possible to ascertain whether the goods were re-sold properly.\n                    Further, PwC actively participated in the Audit Committee discussions on the\n                    sales returns in FY 2010. I agree that there may be information in PwC’s\n                    possession on the returns which would assist the Liquidator in understanding\n                    what occurred. 78     The Liquidator also needs documents in order\n                    to assist in understanding two payments made in late 2008. First, RMB 268m\n                    was paid to the Daqing New Hi-Tech City Construction Investment Development Co\n                    Ltd (“NHC”) apparently in relation to loans made by NHC to the\n                    Group for the construction of what was called the Soybean Zone. Second, a sum of\n                    RMB 261m was paid to contractors. These payments were made without written\n                    documentation and the Liquidator has not been able to determine whether any\n                    services were provided by the contractors. The Liquidator cannot even ascertain\n                    the identity of these contractors. The Group had borrowed RMB 291m from NHC\n                    but because of the difference between the loan amount and the repayment amount,\n                    the Liquidator cannot be certain that the RMB 268m paid to NHC was a\n                    repayment of the loan. The Liquidator is concerned that there may be a further\n                    undisclosed liability between the Group and NHC. Even the NHC loan is not\n                    supported by a loan agreement and the Liquidator has been unable to verify if it\n                    had been disbursed in the first place. PwC was the auditor at the relevant time\n                    and may be able to assist in answering these questions.",
        "Conclusion": "79     I am satisfied that PwC would have information\n                    and documents which would assist the Liquidator in discharging his statutory\n                    duty even if some of the transactions took place after its appointment ended,\n                    and even though it was not involved in the business decisions of the Group. It\n                    had a long relationship with the Group and was involved in the Company’s\n                    affairs in its role as the Company’s auditor. It cannot be that the only\n                    information in PwC’s possession that would assist the Liquidator in his\n                    investigation are the documents contained in the three arch-lever files that PwC\n                    has given to the Liquidator. Other documents which PwC has, including but not\n                    limited to, those referred to in [23] above, would be helpful to the Liquidator\n                    in discharging his statutory functions. 80     In [17] above, I set out the matters which\n                    could afford PwC with grounds to resist this application. PwC has not\n                    established any of those grounds. In my judgment, in balancing the oppression to\n                    PwC in compelling it to produce its working papers and the assistance the\n                    Liquidator may be able to derive from the same, in this case the second\n                    consideration outweighs the first. 81     In all the circumstances, I am satisfied that\n                    the application must be allowed and that PwC and its relevant representatives,\n                    Mr Tham Tuck Seng and Tan Boon Chok, shall produce all books, correspondence and\n                    documents in their custody, power or control as may be required by the\n                    Liquidator including PwC working papers and all documents and records in its\n                    possession which were supplied to it by the Company and any member of the\n                    Group. 82     PwC has submitted that it would be unduly\n                    oppressive for me to order Mr Tham Tuck Seng and Mr Tan Boon Chok to attend\n                    before the judge/registrar and be orally examined by the Liquidator as to the\n                    trade dealings, affairs and property of the Company. I think that to make this\n                    order would be premature. After all the books and records have been supplied,\n                    the Liquidator may have questions for Mr Tham Tuck Seng and Mr Tan Boon Chok and\n                    these may be put and answered by letter. In the event that the Liquidator\n                    considers that his questions have not been adequately answered, he may make a\n                    further application to court for oral examination of these persons in relation\n                    to the matters which have not been answered. 83     The Liquidator’s costs of this\n                    application shall be paid out of the assets of the Company. There shall be\n                    liberty to apply."
    }
}