{
    "case_title": "Total English Learning Global Pte Ltd and another\n      v\n      Kids Counsel Pte Ltd and another suit",
    "ncitation": "[2014] SGHC 258",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       This was a dispute arising out of a series of franchise agreements that had been purportedly assigned to the incoming franchisors, Total English Learning Global Pte Ltd (“TELG”) and Total English Learning International Pte Ltd (“TELI”). There were two separate actions before me, namely, Suit No 420 of 2013 (“S 420/2013”) and Suit No 822 of 2013 (“S 822/2013”). TELG and TELI are the plaintiffs (referred to collectively as “the Plaintiffs”) in both actions. Kids Counsel Pte Ltd (“D8”) is the sole defendant in S 420/2013 and the eighth defendant in S 822/2013. There are seven other defendants in S 822/2013: (a)My English Pte Ltd (“D1”);(b)Wise Education Centre Pte Ltd (“D2”);(c)Rolmar Pte Ltd (“D3”);(d)Wise English Pte Ltd (“D4”);(e)Wise Learners Private Limited (“D5”);(f)Literacy Development Pte Ltd (“D6”); and(g)My Literacy Place Pte Ltd (“D7”).Therefore, including D8, there are a total of eight defendants (referred to collectively as “the Defendants”) in S 822/2013. With the exception of D1, the Defendants were the franchisees of the English literacy and phonics programme known as the “I Can Read” system (“the ICR system”).2       The present dispute arose after the purported assignment of the franchise agreements by the original franchisor, Total Literacy (Singapore) Pte Ltd (“TLS”), to TELG. Given the overlap between both actions, S 822/2013 was scheduled to be heard immediately after S 420/2013 and the parties were directed to file only one affidavit of evidence-in-chief for each witness in both actions. I reserved judgment upon the conclusion of the trial in late August 2014. On 8 September 2014, I delivered judgment as follows:(a)     In relation to S 420/2013:(i)       the Plaintiffs’ claims were dismissed; and(ii)       D8’s counterclaims were dismissed.(b)     In relation to S 822/2013:(i)       the Plaintiffs’ claims were dismissed;(ii)       D1’s counterclaim was dismissed;(iii)       D2–D8’s counterclaim was dismissed; and(iv)       the injunction granted against D1–D8 in Summons No 4816 of 2013 was set aside with no order as to damages.Each party was to bear its own costs for both actions. TELG (ie, the second plaintiff in S 822/2013) has since filed an appeal against part of my decision. I now set out the grounds for my decision.The factsBackground to the ICR system3       The ICR system was developed by two Australian nationals, Annabel Seargeant (“Annabel”) and Antony Earnshaw (“Antony”). Different entities were set up to market the ICR system internationally. For the purposes of the present proceedings, we need to focus only on two entities controlled by Antony and Annabel: the Australian entity, Total Literacy Pty Ltd (“TLA”), and the Singaporean entity, TLS. The trade marks, copyright and other intellectual property rights were supposedly owned by TLA, which then granted a licence to TLS. The arrangement was for TLS to enter into franchise agreements with franchisees in Singapore. Under those franchise agreements, the franchisees, such as D2–D8, were allowed to operate education centres in Singapore offering the ICR system.The franchisees4       TLS entered into multiple franchise agreements with different franchisees for the purpose of exploiting the ICR system in Singapore. Based on the evidence that has been led in the course of the present proceedings, there appeared to be variations in the franchise agreements entered into with different franchisees. In other words, while the structure of the franchise agreements remained broadly similar, there were significant differences in the wording of specific clauses, such as the confidentiality clause and the non-compete clause. As will be seen subsequently, these differences in wording have, at times, given rise to dissimilar outcomes in respect of D2–D8.D2–D65       D2–D6 were franchisees owned and operated by Kaske Gerold Ulrich (“Kaske”) at the material time. As at the date of the trial, D2–D6 are dormant companies after having sold their businesses to D1. Nevertheless, Kaske remains the director of D2–D6 and he gave evidence on behalf of D2–D6 in the course of the trial.6       Kaske has a background in engineering. He worked in the software industry for about 11 years before setting up his own business.[note: 1]He was first involved in the education industry back in 2006 when he acquired D5.[note: 2]Subsequently, Kaske came to know that the owner of D6 was interested in selling her stake in D6. He proceeded to acquire D6 after obtaining the consent of TLS (ie, the franchisor prior to the purported assignment).[note: 3]Over the course of the next few years, Kaske obtained rights from TLS to set up three other ICR centres in Singapore.[note: 4]D2–D4 were used as corporate vehicles for these additional ICR centres. In total, Kaske owned and operated five ICR centres in Singapore at the material time.[note: 5]D77       D7 was a franchisee owned and operated by Chih Chien Lih Jennifer (“Jennifer”). Jennifer and her former husband acquired D7 and took over the running of the ICR centre in August 2007.[note: 6]8       Jennifer is currently practising as a lawyer in a local law firm. She gave evidence on how Kaske chipped in to lend a hand in the running of her ICR centre as and when she needed assistance.[note: 7]In return, she would reciprocate by helping out with or giving advice on legal matters. Unlike D2–D6, D7 is still operating although no longer as an ICR centre.D89       D8 was a franchisee owned and operated by Lum Wai Onn (“Lum”) at the material time. The franchise agreement between D8 and TLS was for an initial term of ten years and the agreement was due to expire on 26 October 2012. It was Lum’s case that the term of the franchise agreement was varied from ten years to one in perpetuity but personal to him. This was the main factual dispute in S 420/2013.10     In the course of the trial, Lum gave evidence that he was mainly occupied with his family businesses that were unrelated to the education industry. In other words, the acquisition of D8 was only a side venture for Lum. Unlike D2–D6, D8 is still operating but no longer as an ICR centre.The franchisors and the purported assignment11     TLS was originally the franchisor in the franchise arrangements entered into in Singapore. In other words, the contracting parties in the franchise agreements were TLS and the respective franchisees. The Plaintiffs came into the picture when Antony and Annabel decided to sell the business to the Plaintiffs. This was executed by way of three deeds of assignment dated 19 July 2012.12     In the first deed of assignment, there was a purported assignment of the business contracts in Singapore, including the franchise agreements, to TELG.[note: 8]In the second deed of assignment, the copyright and all other intellectual property rights (excluding the trade mark rights) concerning the ICR system were assigned to TELI.[note: 9]For the purposes of the present dispute, only the first and second deeds of assignment are relevant. Nevertheless, for completeness, it is noted that the relevant parties also entered into a third deed of assignment where the trade mark rights were assigned to TELG.[note: 10]13     On 25 July 2012, an email was sent by Annabel on behalf of TLS to the franchisees to inform them about the change in ownership.[note: 11]As will be seen below, this email was rather misleading in so far as it suggested that there were “new shareholders” in TLS. In particular, there was no mention of the purported assignment of the franchise agreements from TLS to TELG.14     This was followed by a letter dated 1 October 2012 sent by TLS to the franchisees to inform them that the business had been sold to the Plaintiffs and that all future payments were to be directed to TELG.[note: 12]The Plaintiffs relied on this letter as the notice of assignment.The dispute over the purported assignment15     Between October and December 2012, there were meetings and negotiations between the representatives of the Plaintiffs and the respective owners of D2–D8 (ie, Kaske, Jennifer and Lum). In this respect, the situation between the Plaintiffs and D8 was slightly different as compared to the other franchisees as the Plaintiffs maintained the position that D8’s franchise agreement had expired on 26 October 2012. The facts unique to D8 are relevant only to the issues arising in S 420/2013 and will be dealt with separately below.16     Meanwhile, the general tenor of the evidence was such that D2–D8 had maintained their position that the assignment was invalid in so far as their consent had not been sought. There was some discussion on the possibility of entering into new franchise agreements and the grant of a power of attorney but nothing came out of those discussions. The concept of a novation agreement was also explored by the parties but this did not materialise eventually.17     On 7 December 2012, a letter of demand was issued by the Plaintiffs against D8 regarding, among other things, the non-payment of royalties.[note: 13]The incorporation of D118     D1 was incorporated on 29 January 2013 and David Chong (“David”) was appointed as the sole director.[note: 14]He was also the sole shareholder of D1. This was followed by the appointment of Kaske as a director of Monkwell on 5 February 2013. David’s shareholding in D1 was transferred to another entity known as Monkwell on 19 February 2013. In the course of the trial, it became clear that David was merely acting as a nominee of Kaske.19     On 25 March 2013, Monkwell changed its name to MEIL. This was followed by an increase in the number of shares in D1 on 8 April 2013 from one to ten. Out of the ten shares, nine shares were held by MEIL while the remaining share was held by David. On 24 April 2013, Kaske transferred his shares in MEIL to Loh Lye Ai (“Loh”). It appeared in evidence that Loh was also a nominee acting on behalf of Kaske.20     On 25 April 2013, Kaske ceased to be a director of MEIL and Loh was appointed as the director of MEIL in place of Kaske.The termination of the franchise agreements21     D2–D7 terminated their respective franchise agreements on 21 June 2013.[note: 15]The transition to the My English School (“MES”) system22     It was not disputed by the parties that the MES system, being an English literacy and phonics programme, was in direct competition with the ICR system. On 10 September 2013, letters were sent to the parents of the students, informing them about the impending switch to the MES system. The week leading up to 16 September 2013 happened to be the term break and D2–D8 took the opportunity to prepare for the migration from the ICR system to the MES system. The ICR signboards were replaced with the MES equivalent at the various centres. On 16 September 2013, the centres started offering the MES programme. Arrangements were made for the unused ICR materials to be returned to the Plaintiffs on or about 12 September 2013.The commencement of S 822/201323     On 16 September 2013, the Plaintiffs commenced S 822/2013 against the Defendants. On the same day, the Plaintiffs filed an urgent application for an injunction against the Defendants. The matter came before Choo Han Teck J and a limited injunction was granted against the Defendants. The terms of the injunction were subsequently varied on 18 September 2013 when parties appeared before me.The dispute over D8’s franchise agreement24     As mentioned above, D8 is the sole defendant in S 420/2013 and the main factual dispute between the Plaintiffs and D8 pertained to the term of D8’s franchise agreement. The Plaintiffs took the view that D8’s franchise agreement had expired on 26 October 2013 while D8 took the position that its franchise agreement had been varied to one in perpetuity.25     According to Lum, at around the time when he was in the process of acquiring D8, he met with the then Managing Director of TLS, Allston Boyer Parkinson (“Allty”). During the meeting, Lum made a request for the term of D8’s franchise agreement to be varied to an open-ended term. In response to Lum’s request, it was alleged that Allty orally agreed to the variation and handed to Lum an addendum to reflect the variation. This addendum will be covered in greater detail later in the judgment.26     After Lum acquired D8, there was a period of time when Lum made multiple requests for a formal written confirmation regarding the variation of D8’s franchise agreement. It was undisputed that nothing came out of these requests and that at the time of the trial, the only written documentation available was the addendum given by Allty.27     When the Plaintiffs were in the process of acquiring the ICR business, they knew about Lum’s claim regarding the variation of D8’s franchise agreement. Nevertheless, the Plaintiffs and TLS agreed to put the matter on hold. To this end, letters were sent to Lum to assure him that his claim would be looked into and that he need not worry about the dispute.28     When the Plaintiffs completed the acquisition of the ICR business, they adopted the position that D8’s franchise agreement was due to expire on 26 October 2012. Towards the end of 2012, the discussions between the Plaintiffs and Lum were largely in relation to the potential sale of D8 to the Plaintiffs. Pursuant to these negotiations, a non-disclosure agreement was signed by both parties on 2 January 2013.[note: 16]Negotiations for the sale of D8 to the Plaintiffs eventually broke down as both parties had fundamental differences concerning the valuation and offer price of D8. A second letter of demand was sent to D8 on 2 May 2013 and S 420/2013 was commenced soon after on 8 May 2013.[note: 17]The decision29     At the outset, I note that the Plaintiffs and the Defendants have raised multiple claims and counterclaims across both S 420/2013 and S 822/2013. Unfortunately, a few of these claims and counterclaims appeared to be sidelined in so far as minimal evidence was led to support the legal arguments. Nevertheless, for completeness, I attempted to deal with all the claims and counterclaims raised by the parties in the present dispute. Although S 420/2013 and S 822/2013 were heard together, the legal issues arising in both actions could be grouped into three broad categories:(a)     the validity of the purported assignment, which affected the outcome in both S 420/2013 and S 822/2013;(b)     the claims and counterclaims in S 420/2013, which affect only D8 given that it was the sole defendant in S 420/2013; and(c)     the claims and counterclaims in S 822/2013.For ease of reference, I will approach the legal issues in the order set out above.The validity of the purported assignment30     The original franchisor in the various franchise arrangements entered into with D2–D8 was TLS. In this respect, the Plaintiffs derive their standing to commence both actions from the deeds of assignment entered into by the relevant parties, where various assets of the ICR system were purportedly assigned to the Plaintiffs. In the event that the assignment is found to be invalid, TLS will remain as the contracting party and the Plaintiffs will not have the requisite standing to commence the present actions.31     At the outset, the Defendants raised the issue of whether TELI had any interest in the present dispute. As discussed above, TELI was the assignee of the copyright and other intellectual property rights (excluding the trade mark rights) pursuant to the deed of assignment dated 19 July 2012.[note: 18]Initially, the Plaintiffs included a few intellectual property claims in S 420/2013. These were, however, abandoned subsequently. There were also no intellectual property claims in S 822/2013. Nevertheless, in the course of the trial, a dispute arose over the issue of whether TELI had any database rights to give it the requisite standing to bring an action against D2–D8 in S 822/2013. In my judgment, the issue concerning the assignment of database rights, if any, was a red herring as there were no intellectual property claims in both S 420/2013 and S 822/2013. The claims brought by the Plaintiffs were based on various breaches of the franchise agreements. In other words, the basis for the Plaintiffs’ claims was in contract and the proper party to commence the actions would be the purported assignee of the various franchise agreements,ie, TELG. Further, both parties did not deal with the threshold issue of whether database rights were capable of existing independently within the intellectual property regime in Singapore. There was no attempt to illustrate how the existence of such database rights would have any bearing on the claims for breach of contract by the Plaintiffs. I was therefore of the view that TELI had no interest in the present proceedings, given that it was the purported assignee of only the intellectual property rights (excluding the trade mark rights).32     Moving on to the issue of the validity of the purported assignment, I note the existence of a “no-assignment” clause in D6 and D7’s franchise agreements.[note: 19]This raised a separate issue of whether a purported assignment in the face of a “no-assignment” clause was capable of having any legal effect. As this issue only arose in relation to D6 and D7, I will consider this issue after dealing with the general issues that applied across the board to all Defendants. The general issues concerning the validity of the assignment can be grouped into two broad categories:(a)     whether a franchise agreement comprising both benefits and burdens can be assigned as a whole; and(b)     whether there was a valid notice of assignment on the facts of the present case.Whether the franchise agreement was assignable as a whole33     It is undisputed that the franchise agreements incorporate ongoing rights and obligations vis-à-vis both the franchisor and the franchisee. In this regard, a distinction has to be drawn between an assignment and a novation. InFairview Developments Pte Ltd v Ong & Ong Pte Ltd and another appeal[2014] 2 SLR 318, the general principles relating to novations and assignments were set out by the Court of Appeal at [46]:... The term “novation” refers to the process by which the contract between the original contracting parties isdischarged through mutual consentandsubstituted with a new contractbetween the new parties. A novation is therefore to be distinguished from anassignment. In a novation,both the benefits and the burdensof the original contract are transferred to thenew contracting parties, essentially because, as just mentioned, the original contract is extinguished and a new contract is formed. And, as Lord Selborne LC observed in the House of Lords decision ofBenjamin Scarf v Alfred George Jardine(1882) 7 App Cas 345 (at 351), the new contract can, of course, be either between the same parties to the original contract or between different parties. The learned Law Lord also referred (at 351) to the term “novation” as being one derived from the Civil Law (cfalso the doctrine of frustration) as well as to the fact that the necessary (and sufficient) consideration consists in the discharge through mutual consent of the original contract. In an assignment, however,only the benefits of the contractare transferred to the assignee. The assignor remains bound to perform the obligations under the contract. The assignee doesnotbecome a party to the contract, which continues to subsist as between the contracting parties. Accordingly, in an assignment, the consent of the other contracting party isnotnecessary for a contracting party to assign the benefits under the contract to a third party. All these legal principles are well-established ...[emphasis in original]34     A novation involves the change in the identity of a contracting party with the consent of the other contracting party. Given that a novation involves the wholesale substitution of the original contract, it has the effect of subjecting the incoming third party to both the benefits and burdens of the contract.35     This can be contrasted with an assignment, where only the benefit of the contract can be transferred from the assignor to the assignee. Unlike a novation, the consent of the other contracting party is generally not required in the case of an assignment. Given that an assignment involves the transfer of only the benefit of the contract, the assignor remains obligated to perform any remaining obligations under the contract. Difficulties arise when parties purport to assign an entire “contract” as opposed to only the “benefit” of the contract. This problem is compounded when the assignment of the entire “contract” is carried out without the consent of the other contracting party, as in the present case. In the House of Lords decision ofLinden Gardens Trust Ltd v Lenesta Sludge Disposals Ltd and others[1994] 1 AC 85 (“Linden Gardens v Lenesta”), Lord Browne-Wilkinson made the following observations at 103:... It is trite law that it is, in any event, impossible to assign “the contract” as a whole, i.e. including both burden and benefit. The burden of a contract can never be assigned without the consent of the other party to the contract in which event such consent will give rise to a novation. ...36     On the facts of the present case, it was undisputed that the purported assignment had been carried out without the consent of the franchisees. Therefore, in the absence of such consent, the arrangement between TLS and TELG could not give rise to a valid novation. The issue was thus whether the franchise agreements were capable of being assigned as a whole to TELG so as to give it requisite standing to commence the present actions.37     At the outset, I note that the franchise agreements provided executory rights and obligations on both the franchisor and franchisee. This could be contrasted with a contract where one party has already discharged its obligations in full and the only remaining obligations are owed by the other contracting party. In my view, given that the franchise agreements were ongoing contracts with existing obligations on both contracting parties, they are not capable of being “assigned” as a whole. Any purported assignment of the entire contract would run afoul of the general rule that the burdens and obligations of a contract could not be assigned or transferred without the consent of the other contracting party.38     To get around this problem, the Plaintiffs argued that the purported assignment of the franchise agreements could be construed as transferring only the benefits accruing to TLS under the franchise agreements to TELG. On this basis, the purported assignment would not involve the transfer of TLS’ obligations and the consent of the franchisees would therefore be unnecessary. I could not accept the Plaintiffs’ arguments as such a construction was wholly inconsistent with the deed of assignment that was entered into by the parties. The process of ascertaining the scope and effect of the deed of assignment was effectively one of construction. The court has to give effect to the objective intentions of the contracting parties. For ease of reference, the relevant portion of the deed of assignment is set out below:[note: 20]2ASSIGNMENT OF BUSINESS CONTRACTS2.1    The Assignors hereby unconditionally, absolutely and irrevocably TRANSFER and ASSIGN with full title guarantee, the Business Contracts to [TELG] (only in connection with the Business Contracts in Singapore) or [TELI] (only in connection with the Business Contracts in Other Territories), including without limitation:(a)    (a) the rights (excluding Tax benefits and Relief in relation to any period before the Transfer Time), benefits, liabilities (excluding Tax liabilities in relation to any period before the Transfer time) and obligations of each of [TLS] and Total Literacy (International) Pte. Ltd. as franchisors of the Business Contracts in Singapore and the Business Contracts in Other Territories (as applicable) as particularised inSchedule 2 (List of Business Contracts);(c)    ...[emphasis in original]In this respect, it was obvious that the parties to the deed of assignment had intended the assignment to be in relation to the entire contract, as opposed to only the rights and benefits of the contract. In fact, the parties went so far as to specifically state that the assignment was inclusive of the rights, benefits, liabilities and obligations of TLS as franchisor of the business contracts (ie, the franchise agreements). In the circumstances, the Plaintiffs’ argument that the parties had only intended to assign the benefits of the contract was wholly inconsistent with and would clearly go against the express and unambiguous intent of the parties as embodied in the wording of the clause in question. Upholding the deed of assignment by reading down the scope of the assignment clause would be tantamount to imputing an intention to the parties which they never had. Therefore, I rejected the Plaintiffs’ submission that the parties had only intended to assign the benefits of the franchise agreements.39     Moving on, the Plaintiffs submitted that D2–D8 ought to be estopped from denying that there was a valid assignment as they had, through their conduct, accepted the performance of the franchisor’s obligations by the Plaintiffs. In this regard, the Plaintiffs relied on the following evidence:(a)     that D2–D8 had continued to operate as ICR centres even after the purported assignment;(b)     that D2–D8 had continued to receive programmes, workbooks and materials necessary for the operation of the ICR centres; and(c)     that D8 had made payments of royalties to TELG.40     In my judgment, the Plaintiffs’ reliance on estoppel or waiver should be rejected for the following reasons. First, it was clear that D2–D8 had maintained their objections to the purported assignment of the franchise agreements in the course of discussions and negotiations among the parties. Their objections and reservations with regard to the purported assignment were set out in a series of letters and emails exchanged between the relevant parties.41     Second, in view of D2–D8’s stance towards the purported assignment, they must surely have every right to continue with the franchise agreement as if the assignment had not taken place. D2–D8 were not obliged to terminate the franchise agreement and they were entitled to continue with the arrangement on the assumption that TLS was still the contracting party. This is wholly consistent with the observations made above that the original contracting party remains a party to the contract even after an assignment has taken place. In fact, the original contacting party remains obliged to discharge any of its remaining obligations pursuant to the contract. Therefore, I was not inclined to accept the Plaintiffs’ argument that D2–D8 must be estopped from denying the validity of the assignment when all that they did was to continue with the franchise agreements as if the purported assignment had not taken place. Such conduct on the part of D2–D8 could not give rise to a case for an estoppel or waiver.42     For the reasons set out above, I was of the view that the purported assignment was invalid. On that basis alone, the Plaintiffs did not have the requisite standing to commence the present actions against the Defendants in so far as they were not parties to the franchise agreement.43     For completeness, D2–D8 also relied on the argument that the franchise agreements were personal contracts which were not assignable at law. D2–D8 attempted to draw an analogy between a franchise agreement and an employment contract. In this respect, it was highlighted that a contractual right to the services of an employee is generally regarded as being personal and incapable of assignment.44     I accepted the existence of the general rule that personal contractual rights could not be assigned without the consent of the obligor. A contractual obligation could not be vicariously performed if it required the personal performance of the obligor. This is otherwise known as the “personal rights” rule (see Greg Tolhurst,The Assignment of Contractual Rights(Hart Publishing, 2006) at para 6.68).45     I was, however, unable to accept D2–D8’s argument that the “personal rights” rule was relevant to the present case. First, it appeared to me that D2–D8 had, in the course of arguing that the franchise agreement was personal in nature, mainly relied on the franchisor’s obligations, as opposed to the franchisor’s rights. This line of argument was academic in so far as it was accepted that a contractual obligation could not be assigned without the consent of the other contracting party. In this respect, D2–D8 did not highlight any particular right that the franchisor had against the franchisee which was personal in nature so as to prevent any assignment of that right to a third party.46     Second, I was not prepared to accept the Plaintiffs’ analogy that a franchise agreement was akin to an employment contract. The franchise agreement in the present case was effectively a business contract entered into between corporate entities. The franchise agreement was not entered with Antony and Annabel on a personal basis. A company has the ability to vary its management and control, and even its ownership, at any time. On the facts, there were also no provisions on change of control in the franchise agreements. There was also no restriction on Antony or Annabel to transfer their shares in TLS to a third party.47     Third, it appeared to me that the ICR system was already at an advanced stage of development and there was no evidence to suggest that Antony and Annabel were required to play a major role in the developmental process of the ICR system. Rather, their role was generally that of having oversight of the company. In the circumstances, it was unlikely that the franchise agreements would fall within the scope of personal contracts that would render the rights therein unassignable.48     In any event, given the finding that the purported assignment was invalid, my observations on this specific issue of personal contracts are academic.Whether there was a valid notice of assignment49     It was the Plaintiffs’ pleaded case that the letter dated 1 October 2012 (“the 1 October 2012 letter”) from TLS to D2–D8 constituted a valid notice of assignment. The Plaintiffs argued that the test for what amounted to a valid notice of assignment involved a low threshold and that there was no specific requirement for the notice to expressly include the word “assignment”. It was further submitted that the notice would be valid in so far as information relative to the assignment was conveyed to the debtor and the notice expressly or implicitly recorded the fact of the assignment. On this basis, the Plaintiffs argued that the 1 October 2012 letter was a valid notice of assignment.50     The Defendants took the position that the 1 October 2012 letter was unclear and capable of different interpretations, regardless of whether it was read alone or in the context of the facts and circumstances then. Specifically, the Defendants referred to the phrase “sold our business” in the 1 October 2012 letter as being vague.[note: 21]The Defendants also highlighted the confusion caused by the earlier email from Annabel to D2–D8 on 25 July 2012 (“the 25 July 2012 email”), where she stated that TLS had “changed the corporate structure of the business by expanding [its] shareholder base”.[note: 22]It was argued that the 25 July 2012 email was misleading. The Defendants also pointed out that there was no communication from either TLS or TELG to correct the inaccurate statement by Annabel.51     The Plaintiffs did not offer any arguments on whether the assignment of the business contracts from TLS to TELG could be construed as an equitable assignment. In any event, an equitable assignment would generally require the assignee to join the assignor to the action. It was undisputed that TLS was not joined as a party in the present proceedings. I therefore approached the issue concerning the assignment of the business contracts on the basis that the Plaintiffs were only seeking to rely on the purported assignment as being statutory in nature.52     Both parties referred to s 4(8) of the Civil Law Act (Cap 43, 1999 Rev Ed) (“CLA”), reproduced as follows:Assignment of debts and choses in action effectual to pass right and remedy(8) Any absolute assignment by writing under the hand of the assignor, not purporting to be by way of charge only, of any debt or other legal chose in action of whichexpress notice in writing has been given to the debtor, trustee or other person from whom the assignor would have been entitled to receive or claim such debt or chose in action, shall be and be deemed to have been effectual in law, subject to all equities which would have been entitled to priority over the right of the assignee under the law as it existed before 23rd July 1909, to pass and transfer the legal right to such debt or chose in action, from the date of such notice, and all legal and other remedies for the same, and the power to give a good discharge for the same, without the concurrence of the assignor.[emphasis added]The requirements for a statutory assignment were discussed in the High Court decision ofSalim Anthony v Sumitomo Corp Capital Asia Pte Ltd and others and another application[2004] 3 SLR(R) 331, where Lai Siu Chiu J observed (at [91]) that compliance with s 4(8) of the CLA was not the only legal requirement. It was emphasised that the notice of assignment must also be clear and unambiguous. In the subsequent decision ofCooperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank International), Singapore Branch v Motorola Electronics Pte Ltd[2010] 3 SLR 48 (Cooperatieve Centrale v Motorola”), Lai J acknowledged (at [101]) that “what constitutes adequate notice must depend on the context of each case”.53     Apart from that, in approaching the issue of whether there was a valid notice of assignment, it must be acknowledged that there is no prescribed form of notice. There is no requirement for the notice to be embodied in a separate document for the specific purpose of notifying the debtor. This was emphasised in the High Court decision ofLanxess Pte Ltd v APP Chemicals International (Mau) Ltd[2009] 2 SLR(R) 769, where Andrew Ang J observed (at [8]) that the fact of assignment may be implicitly recorded and it would suffice for information relative to the assignment to be conveyed to the other contracting party in writing.54     In the present case, the Plaintiffs relied on the 1 October 2012 letter as being the notice of assignment. For ease of reference, the main text of the 1 October 2012 letter is reproduced below:[note: 23]Sale of BusinessThank you for all your support in making the I Can Read franchise a success. As you may know, we havesold our businessin Singapore to Total English Learning Global Pte Ltd.With immediate effect,please pay the Royalties, Marketing Fee, purchase of books and resources to “Total English Learning Global Pte Ltd”. ...Once again, thank you for your support and we look forward to your continued support to Total English Learning Global Pte Ltd,the new owner.[emphasis added]It was undisputed that the 1 October 2012 letter was sent to Kaske, Jennifer and Lum. The 1 October 2012 letter was signed off by Antony as Director of TLS.55     In my view, the phrase “sold our business” was inherently vague in so far as it was capable of supporting multiple interpretations. From one perspective, the sale of the business could have been achieved through a transfer of assets belonging to TLS, presumably including the franchise agreements, to TELG. From another perspective, the sale of the ICR business could also have been carried out by TELG acquiring the shares of TLS. The latter scenario involving a transfer of shares would not be entirely inconsistent with the direction to pay the royalties, marketing fees and other payments to TELG. In the event that TELG had acquired the shares of TLS, TELG would be the parent company and would be entitled to receive payments on behalf of TLS. Finally, the reference to TELG as being the “new owner” was also unclear in so far as it was capable of supporting either scenario.56     Looking at the 1 October 2012 letter as a whole, I was of the view that the requirement for a notice of assignment to be clear and unambiguous was not satisfied. In fact, it was recognised that such a requirement would not be met if the language of the notice was equally capable of a contrary interpretation (Cooperatieve Centrale v Motorolaat [97]). As explained above, the 1 October 2012 letter was capable of supporting multiple interpretations due to the vague language used. Any reference to the franchise agreements, which were the subject matter of the assignment, was also conspicuously absent from the 1 October 2012 letter. It was almost as if the parties to the deed of assignment did not wish the other franchisees to know the exact mechanism by which the sale of the ICR business was carried out.57     In my judgment, the adequacy of a notice of assignment must also be considered within the context and circumstances of each case. The 1 October 2012 letter was preceded by the 25 July 2012 email, where Annabel made the following statements:[note: 24]Total Literacy has taken a big step forward and we are pleased to advise that we havechanged the corporate structure of the business by expanding our shareholder base. Ournew shareholders are actually majority shareholdersand we are excited in anticipation of forging new directions together with them....[emphasis added]The 25 July 2012 email suggested that the incoming franchisors had acquired the business by acquiring shares in TLS. There was no mention of any assignment of the ongoing franchise agreements. In fact, reading both the 25 July 2012 email and the 1 October 2012 letter together, the more likely interpretation would be that of an acquisition of the business by way of a share transfer. Up to the point in time when the 1 October 2012 letter was sent to Kaske, Jennifer and Lum, there was no attempt made by either TLS or TELG to clarify or correct the misleading statement made by Annabel in the 25 July 2012 email. Therefore, looking at the evidence as a whole, I was of the view that the 1 October 2012 letter was not a valid notice of assignment.58     The parties had further communications after the 1 October 2012 letter and these exchanges could have been reduced into writing. Under such circumstances, these written further communications could very well constitute a valid notice of assignment under s 4(8) of the CLA. Nevertheless, both parties did not make any arguments to this effect and the Plaintiffs’ pleaded case was confined to the 1 October 2012 letter being relied upon as the notice of assignment. I therefore confined my observations to the 1 October 2012 letter for the purposes of ascertaining whether there was a valid notice of assignment. As discussed above, the 1 October 2012 letter did not fulfil the requirements of being clear and unambiguous for it to be regarded as a valid notice of assignment.The “no-assignment” clause59     Apart from the general issues concerning the validity of the assignment that affected all the Defendants, there was a specific issue which concerned only D6 and D7. This was the “no-assignment” clause incorporated into their respective franchise agreements with TLS. Both clauses were worded exactly the same and were in the following terms:[note: 25]26.NO ASSIGNMENTThis Agreement shall not be assignable or transferable by any party, unless otherwise agreed to by the other party in writing, which agreement shall not be unreasonably withheld.On this basis, it was argued on behalf of D6 and D7 that the “no-assignment” clause would prohibit the assignment of even the benefit of the contract and any purported assignment in the absence of the other contracting party’s consent would be invalid. The House of Lords decision ofLinden Gardens v Lenestawas cited in support of this proposition.60     In response, the Plaintiffs relied on the Court of Appeal decision ofJubilee Electronics Pte Ltd and others v Tai Wah Garments and Knitting Factory Pte Ltd[1996] 1 SLR(R) 352 (“Jubilee Electronics v Tai Wah”), where an assignment of a lease was held to be valid in spite of a clause in the lease agreement prohibiting any such assignment without the consent of the landlord. On this basis, the Plaintiffs argued that an assignment in breach of a “no-assignment” clause did not render the assignment void but merely provided an opportunity for the other contracting party to terminate the agreement. It was further submitted that D7 did not exercise its right to terminate the agreement as it had continued to receive ICR materials and performed its obligations under the agreement.61     I was of the view that the purported assignment from TLS to TELG was wholly ineffective in the light of the “no-assignment” clause in D6 and D7’s franchise agreements. The Plaintiffs’ reliance onJubilee Electronics v Tai Wahwas misconceived given that it was a case dealing with the assignment of a lease. InLinden Gardens v Lenesta, a similar argument was raised to the effect that the assignment of a leasehold term in breach of a covenant against assignment was effective to vest the term in the assignee. Lord Browne-Wilkinson, in tracing the differences in approach between the assignment of property rights and contractual rights, made the following observations at 109:... The law became settled that an assignment [of a lease] in breach of covenant gave rise to a forfeiture, but pending forfeiture the term was vested in the assignee. In contrast, the development of the law affecting the assignment of contractual rights was wholly different. It started from exactly the opposite position, viz., contract rights were personal and not assignable. Only gradually did the law permitting assignment develop ...He concluded that it was therefore not surprising that the law applicable to the assignment of contractual rights would differ from that applicable to the assignment of leases (at 109).62     In arriving at the conclusion that the assignment of a lease was valid in spite of the covenant not to assign without the consent of the landlord, the Court of Appeal inJubilee Electronics v Tai Wahrelied on English authorities such asWilliams v Earle(1868) LR 3 QB 739 andOld Grovebury Manor Farm Ltd v Seymour (W) Plant Sales & Hire Ltd (No 2)[1979] 1 WLR 1397. These authorities were also cited by Lord Browne-Wilkinson inLinden Gardens v Lenesta. However, both cases dealt with the assignment of leases and the legal principles governing the assignment of contractual rights differ from those applicable to the assignment of property rights.63     Moving on, counsel for the Plaintiffs, Mr Mark Goh (“Mr Goh”), highlighted that the House of Lords decision ofLinden Gardens v Lenestawas not binding on the local courts. He submitted that in the absence of any binding local authority on the legal effect of such “no-assignment” clauses, I was free to, and should, in fact, depart from the English position set out inLinden Gardens v Lenesta.64     In my view, cl 26 of D6 and D7’s franchise agreement was drafted in a straightforward and unambiguous manner. The franchise agreement shall not be assignable or transferred by any party unless otherwise agreed to by the other party in writing. Clearly, neither TLS nor TELG obtained the consent of D6 and D7. In the circumstances, the assignment would be ineffective. As it was held inLinden Gardens v Lenesta, an attempted assignment of contractual rights in breach of a contractual prohibition, as in the present case, would be “ineffective to transfer such contractual rights” (at 108). Lord Browne-Wilkinson regarded the law as being “satisfactorily settled” and he went on to make the following observation at 108:... If the law were otherwise, it would defeat the legitimate commercial reason for inserting the contractual prohibition, viz., to ensure that the original parties to the contract are not brought into direct contractual relations with third parties.Although Mr Goh urged me to depart from the English position set out inLinden Gardens v Lenesta, there was no reason to suggest why the legal reasoning adopted therein would be inapplicable to the local context.65     I was also unable to accept the Plaintiffs’ argument that D6 and D7 had somehow waived their rights to terminate the franchise agreement when they elected to continue receiving ICR materials and running the ICR centre. The purported assignment was legally ineffective in so far as D6 and D7’s consent in writing had not been sought. It was surely within the rights of D6 and D7 to treat the assignment as invalid given that their consent had not been obtained and to continue performing the contract on the basis that TLS was still the contracting party. There was no argument to suggest that D6 and D7’s actions in continuing with the contract could be regarded as a manifestation of their consent to the assignment for the purposes of cl 26 of the franchise agreement. In the light of the above, the purported assignment from TLS to TELG was invalid.The claim in S 420/201366     In S 420/2013, it was the Plaintiffs’ pleaded case that D8 breached cl 13 of the franchise agreement when it failed to comply with the procedure stipulated therein after the expiry of the franchise agreement on 26 October 2012.67     In response, D8 argued that there had been a variation of the term of the franchise agreement from ten years to one in perpetuity. This variation supposedly took place in 2008 when Lum was in the process of acquiring D8. Lum stated that the then managing director of TLS, Allty, had agreed to vary D8’s franchise agreement by waiving the ten-year period. A handwritten note that was purportedly initialled by Allty was adduced as evidence.68     Initially, there was some concern about whether Allty had the requisite authority to vary D8’s franchise agreement on behalf of TLS. Antony had sent an email to Lum dated 2 December 2012, where he had stated:[note: 26]Regretfully we have no record of any agreement between you and Allty. Allty had no power to make agreements on behalf of TLS. I am sorry but this means there is no agreement. ...Nevertheless, in the course of the trial, it became clear that the Plaintiffs were not entirely in agreement with Antony’s position that Allty did not have the authority to enter into agreements on behalf of TLS. In fact, during the course of cross-examination, Tan stated unequivocally that he did not agree with Antony in relation to this issue. In my judgment, Antony’s argument was a non-starter as it was undisputed by all parties that Allty was the managing director of TLS at the material time. In the absence of any evidence to the contrary, Allty must be regarded as having the requisite authority to enter into binding agreements on behalf of TLS.69     I was of the view that there was an oral variation of the contract as stated by Lum. First, Lum’s evidence with regard to the oral variation of the franchise agreement by Allty remained largely unrebutted even under cross-examination. Second, Lum produced the handwritten note to support his position that the franchise agreement had been varied to an open-ended term. In that note, it was stated that the term of the franchise agreement would be “open ended for the current buyers of the Goldhill Centre”.[note: 27]There was also a further qualifier that the extension was not to be “granted to anyone/entity buying from them”.[note: 28]The period of ten years for the further term upon the expiry of the franchise agreement was also struck off and replaced with “N/A”. Both variations were accompanied by an initial which was purportedly Allty’s. During cross-examination, when Tan was asked to compare the initials in the handwritten note with another specimen of Allty’s signature, he agreed that they looked “similar”.70     More significantly, while the parties were having a dispute over whether the term of D8’s franchise agreement had been varied, the handwritten note produced by Lum was brought to the attention of Allty. In an email to Chan dated 24 June 2013, Allty stated the following in relation to the handwritten note:[note: 29]... I was told by Jennifer that there had been a meeting, which included Wai Onn’s mother I believe, at which I had agreed to an open term for Wai Onn’s franchise license. Initially I was unable to recall the meeting, but eventually did come to recall a meeting during which the issue of the franchise agreement term was discussed. Jennifer then informed me that I had in factsigned a document that was called a Deacon’s Addendum to that effect. I could not remember this, but she followed up the phone call with an email containing the Deacon’s Addendum thatpurports to have my initials reflecting an open term clause. The email also had a letter for me to sign.To the best of my knowledge, I cannot remember a new franchise agreement ever being executed for Wai Onn’s centre or receiving any countersigned franchise agreement concerning the open-ended term.[emphasis added]In this email, it is obvious that when Allty was referred to the handwritten note with his purported initials, he did not deny that the initials were his. In fact, Allty chose to emphasise the fact that there was no new franchise agreement entered into by the parties. In my view, if the handwritten note or the purported initials were doctored or forged, a reasonable person in Allty’s position would have given a straightforward denial that there was either no such document or that the initials were not made by him. Allty, however, chose to side-step the issue of the handwritten note by highlighting the fact that there was no formal agreement concerning the open-ended term.71     In the circumstances, given the substantial factual dispute between the Plaintiffs and D8, it would have been prudent for the Plaintiffs to call Allty to give evidence in the present proceedings. However, the Plaintiffs took the position that D8 ought to have called Allty as a witness in so far as D8 was the party asserting that such an oral variation existed. Unsurprisingly, D8 adopted the contrary position and argued that the Plaintiffs should be responsible for calling Allty given that the evidential burden had shifted to the Plaintiffs after Lum’s testimony.72     In my opinion, the Plaintiffs should have called Allty to give evidence on their account of events. As mentioned above, Lum’s evidence on how Allty had agreed to a variation of the term of the franchise agreement remained largely unrebutted. The handwritten note purportedly initialled by Allty was also produced to support Lum’s account of events. Coupled with the fact that Allty did not deny that the initials were his when the handwritten note was brought to his attention, it would have been prudent for the Plaintiffs to call Allty as a witness to the present proceedings so as to allow him to give his side of the story.73     In the absence of any evidence to the contrary, I was prepared to accept that the handwritten note was initialled by Allty and there had been a variation of the franchise agreement to an open-ended term. At this juncture, I note that the Plaintiffs also attempted to suggest that they encountered difficulties in trying to contact Allty. The Plaintiffs stated that they could only communicate with Allty via Antony or Annabel. I could not accept this part of their evidence as it was apparent that the Plaintiffs did, in fact, manage to contact Allty directly without going through Antony or Annabel. In an email dated 18 June 2013 from Chan to Antony, it was stated that she needed Antony’s “assistance to drop a note to Allty to inform him that [she] will be calling him”.[note: 30]Subsequently, Allty replied via email directly to Chan on 24 June 2013.[note: 31]This was the email in which Allty emphasised that there was no formal agreement to extend the term of D8’s franchise agreement as discussed above. In the circumstances, I was not convinced that the Plaintiffs were not able to contact Allty for the purpose of inviting him to give his evidence in the present proceedings. This was also consistent with Tan’s evidence that the Plaintiffs had not tried to contact Allty after the email dated 24 June 2013. Tan clarified that it was not a case where they had tried to contact Allty but there was no response.74     Finally, I note the presence of an entire agreement clause in D8’s franchise agreement, where it was stated that:[note: 32]This Agreement, together with each Schedule attached hereto, constitutes the entire agreement between the parties hereto with respect to the subject matter hereof and there are no representations, understandings or agreements relative hereto which are not fully expressed herein.No variation, alteration or modification of any of the terms of this Agreement shall be of any effect unless evidenced in writing signed by or on behalf of each of the parties hereto by a duly authorised representative.[emphasis added]Both parties did not make any submissions on the effect of this clause on the oral variation by Allty or the handwritten note purportedly bearing Allty’s initials. I therefore say no more about this issue.The counterclaims in S 420/201375     D8 had two main counterclaims against the Plaintiffs in S420/2013:(a)     breach of the non-disclosure agreement (“the NDA”); and(b)     fraudulent misrepresentation.Breach of the non-disclosure agreement76     In December 2012, the parties were in discussions regarding a potential sale of D8 to the Plaintiffs. For the purpose of allowing the Plaintiffs to make an offer for the acquisition of D8, Tan had requested information concerning the details of the lease agreement, the staff list and costs. In an email dated 31 December 2012, Lum replied that he would only release the information requested on the condition that Tan agreed to keep the information strictly confidential and not to use it for any other purpose.[note: 33]This was followed by an email dated 2 January 2013 where Tan attached a copy of the NDA and informed Lum to send a signed copy back to him.[note: 34]On the same day, Lum replied with the signed NDA attached and the information requested by Tan.77     In this respect, D8 referred to cl 7 of the NDA which stated that the parties agreed “to negotiate in good faith with each other” for the acquisition.[note: 35]With regard to the term of the NDA, D8 referred to cl 8 of the NDA, reproduced as follows:[note: 36]This Agreement shall become effective on the date written above [ie, 2 January 2013] and shall remain in effect until the earlier of: (i) termination bywritten agreement of both parties, or (ii)twelve monthsfrom the date written above.[emphasis added]On this basis, D8 submitted that the NDA gave rise to a one-year moratorium on the commencement of legal proceedings by either party. It was therefore argued that the Plaintiffs’ act in commencing S 420/2013 against D8 amounted to a breach of the NDA.78     In response, the Plaintiffs submitted that the one-year period only pertained to the protection of confidential information and did not extend to the agreement to negotiate in good faith. It was further argued that the parties to the NDA did not intend to negotiate in good faith for twelve months and the argument raised by D8 was merely an afterthought for the purpose of vexing the Plaintiffs.79     InHSBC Institutional Trust Services (Singapore) Ltd (trustee of Starhill Global Real Estate Investment Trust) v Toshin Development Singapore Pte Ltd[2012] 4 SLR 738 (“HSBC v Toshin”), the Court of Appeal had the opportunity to explore the content of an express agreement between contracting parties to negotiate in good faith. On the facts of that case, the lease agreement incorporated a rent review mechanism, which stated that the parties “shall in good faith endeavour to agree on the prevailing market rental value of the Demised Premises” prior to the appointment of the valuers (at [6]). At the outset, the Court of Appeal drew a distinction between pre-contractual negotiations and negotiations between parties who were already in an existing relationship (at [37]). In the English decision ofWalford v Miles[1992] 2 AC 128, Lord Ackner, in delivering the leading judgment of the House of Lords, observed that the concept of a duty to carry on negotiations in good faith was inherently repugnant to the adversarial position of the parties when involved in negotiations (at 138). Lord Ackner further stated that a duty to negotiate in good faith was therefore unworkable in practice as it was inherently inconsistent with the position of a negotiating party (at 138). The Court of Appeal inHSBC v Toshinsought to reason that the observations inWalford v Milesmay not be strictly applicable to a situation where parties to an existing relationship commit themselves to a mechanism to resolve how the rental was to be set. Unlike parties who were merely in pre-contractual negotiations, the Court of Appeal observed that the landlord and tenant were “not free to simply walk away from the negotiating table for no rhyme or reason” (at [37]).80     Returning to the facts in the present case, while D8 had referred to the Court of Appeal decision inHSBC v Toshin, there were no arguments on the issue of whether the present case fell within the category of pre-contractual negotiations, as in the case ofWalford v Miles, or the category of negotiations within the framework of an existing relationship, as in the case ofHSBC v Toshin. The Plaintiffs, in defending the counterclaim for breach of the NDA, did not refer to the decision ofHSBC v Toshin.81     Even if it was accepted that cl 7 of the NDA was capable of having some form of legal content, I am not prepared to accept D8’s submissions that it would give rise to a moratorium on the commencement of all legal proceedings. InHSBC v Toshin, the Court of Appeal observed (at [45]) that at its core, the concept of good faith encompasses the threshold subjective requirement of acting honestly, as well as the objective requirement of observing accepted commercial standards of fair dealing in the performance of the identified obligations. It was elaborated that this encompassed a duty to act fairly, having regard to the other party’s legitimate interests. More importantly, the Court of Appeal held (at [49]) that what constituted reasonable commercial standards of fair dealing in the context of an express contractual duty of good faith would depend heavily on “the commercial nature and purpose of the contract in question”.82     Applying the principles to the present case, it was reasonably clear that the main purpose of the NDA was to protect the confidentiality of the information supplied by D8 to TELG. Clause 7 of the NDA stated that the parties agreed “to negotiate in good faith with each other” for the acquisition of D8 by TELG.[note: 37]In this respect, D8’s interpretation of cl 7 does not accord with commercial sense and reality in so far as it sought to prevent any party from commencing legal proceedings regardless of the stage and progress of the negotiations. It would be highly unsatisfactory if parties were to reach a deadlock in negotiations one month into the term of the NDA and then be precluded from commencing legal proceedings when that was the only way in which the dispute could be resolved. It must not be overlooked that at the point in time when the NDA was entered into, both parties were already locked in a dispute over whether the term of D8’s franchise agreement had been varied to an open-ended term. In the circumstances, I was unable to accept D8’s submission that the parties to the NDA intended to forbear from suing for a period of one year from the specified date (ie, 2 January 2013). While the commencement of legal proceedings could, in certain circumstances, give rise to a breach of an express contractual duty of good faith, the finding of such liability would depend heavily on the facts of the particular case. This was quite different from D8’s argument that the contents of cl 7 of the NDA could give rise to a blanket moratorium on the commencement of all legal proceedings regardless of the circumstances.83     There was nothing amiss in the course of negotiations between D8 and TELG that could give rise to a breach of the duty to negotiate in good faith. At the point in time when TELG commenced S 420/2013 against D8, it was clear that the negotiations were not making headway. Both parties had fundamental disagreements in relation to the valuation of D8 and the price offered by TELG. In an email dated 7 April 2013, Lum informed Chan that the offer price by TELG was “still too low”.[note: 38]Apart from the issue concerning the offer price, Lum also brought up two other “commercial points” regarding the term sheet. The first was in relation to the due diligence process while the second concerned the proration of royalties on the part of D8. Lum concluded by stating that the term sheet had expired. Given that the negotiations between TELG and D8 had practically broken down at that juncture, the commencement of S 420/2013 to resolve the outstanding dispute between the parties should not give rise to any breach of the express contractual duty to negotiate in good faith. I therefore rejected D8’s arguments and dismissed the counterclaim in relation to the breach of cl 7 of the NDA.Fraudulent misrepresentation84     D8’s other counterclaim against the Plaintiffs is in the tort of fraudulent misrepresentation. D8 relies on two separate representations that were made by the representatives of the Plaintiffs:(a)     the Plaintiffs’ instructions to Yeo to inform Lum not to worry and that “Antony and Annabel have set time aside to review [D8’s] franchise contract in June/July”;(b)     Chan’s email to Lum dated 15 November 2012 where she made the following representations:[note: 39](e)    ... TELG will enter new franchise agreement with your company [ie, D8]. Can you come by our office for a discussion on the franchise renewal and the issue which you have written below?D8 argued that these representations were made in order to lull Lum into not exercising the right to renew the franchise agreement for a further five years pursuant to cl 4 of the agreement. It was submitted that D8 suffered the loss of revenue stream for five years.85     The Court of Appeal inPanatron Pte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 held at [14] that the essential elements of the tort of fraudulent misrepresentation were as follows:(a)     a representation of fact made by words or conduct;(b)     the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff;(c)     the plaintiff acted upon the false statement;(d)     the plaintiff suffered damage by so doing; and(e)     the representation must be made with the knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true.Looking at the evidence as a whole, I was not satisfied that the fifth element was made out. At the point in time when the representations were made, both parties were still in the process of engaging in negotiations. Lum took the position that the franchise agreement had been varied by Allty while TELG was of the view that it required further documents to ascertain if the term of the franchise agreement had, in fact, been varied. Given that the entire situation was in a state of flux, there was no evidence to suggest that the representation concerning the review of the franchise agreement was made with the knowledge that it was false or in the absence of any genuine belief that it was true. In an email dated 14 May 2012, Annabel asked for suggestions on how to deal with Lum’s queries regarding the term of the franchise agreement. She went on to state that she would “prefer to ignore it for two months”.[note: 40]In the circumstances, given that this email was sent after the said representation was made to Lum on 6May 2012, there was no reason to suggest that the representation was made in the absence of any genuine belief that it was true. A delay of two months from 14 May 2012 would effectively mean that Annabel would deal with the matter in July, which was consistent with the representation made to Lum. In the circumstances, I was not satisfied that the representation concerning the review of the franchise agreement by Annabel and Antony could give rise to fraudulent misrepresentation.86     With regard to the second representation made by Chan in the email dated 15 November 2012, there was no evidence to suggest that it was made fraudulently. At that point in time, the Plaintiffs took the position that Lum’s contract had already expired on 26 October 2012 and this was consistent with their request to enter into a new franchise agreement with D8. In fact, on the very same afternoon the email was sent by Chan, Antony wrote to Lum to reiterate the point that there was no variation of the franchise agreement and that Allty, being a minority shareholder and employee of TLS, did not have the authority to vary the term of the franchise agreement.[note: 41]In that email, Antony concluded by advising Lum to deal with the new management team. This was consistent with Chan’s request for Lum to drop by her office for the purpose of discussing the renewal of the franchise. More importantly, Lum also acknowledged in the course of cross-examination that he did not accept Chan’s invitation. Lum was of the view that they were not the right people to talk to. In the circumstances, given that Lum did not accept Chan’s offer to negotiate and enter into a new franchise agreement, Lum could not now turn around and allege that the offer was made fraudulently. The fact that the Plaintiffs subsequently issued a letter of demand against D8 on 7 December 2012 was also explicable as Lum had failed to respond to Chan’s offer. I was not satisfied that Chan’s offer to Lum was wilfully false or made in the absence of any genuine belief that it was true.  D8’s claim for fraudulent misrepresentation was therefore rejected.87     D8 also brought a counterclaim against the Plaintiffs for wrongful repudiation or termination of the franchise agreement. Nevertheless, both parties did not make any substantive arguments on this particular issue during the trial. Given that I have already found in favour of D8 in terms of the oral variation of the franchise agreement, I therefore need say no more about this issue.The claims in S 822/201388     I will now deal with the claims that were brought by the Plaintiffs against the Defendants in S 822/2013. For ease of reference, the claims could be categorised as follows:(a)     In relation to D2–D8:(i)       breach of the non-compete clause in the franchise agreements;(ii)       breach of the non-solicitation clause in relation to the customers;(iii)       breach of the non-solicitation clause in relation to the employees; and(iv)       breach of the confidentiality clause.(b)     In relation to D1:(i)       tort of inducing breach of contract.(c)     In relation to the Defendants (ie, D1–D8):(i)       tort of conspiracy by unlawful means.I will deal with these claims individually before turning to the counterclaims by the Defendants against the Plaintiffs.Breach of the non-compete clause89     The main dispute concerning the alleged breach of the non-compete clause was in relation to whether the clause should be struck down under the doctrine of restraint of trade. In this respect, D2–D8 argued that the Plaintiffs have not adduced any evidence of a legitimate proprietary interest sought to be protected by the non-compete clause. It was further submitted that the Plaintiffs also failed to demonstrate how the non-compete clause was reasonable in the interests of the parties and in the interests of the public. On this basis, D2–D8 argued that the non-compete clause should be struck down by the court.90     InCLAAS Medical Centre Pte Ltd v Ng Boon Ching[2010] 2 SLR 386 (“CLAAS Medical v Ng”), the Court of Appeal set out the following general principles applicable to covenants in restraint of trade at [44]:Therefore, all covenants in restraint of trade areprima facievoid. However, they can be held to be valid if the party seeking to rely on the restrictive covenant can show that, firstly, the clause concerned is reasonable in the interests of theparties and, secondly, the clause is also reasonable in the interests of thepublic. Additionally, there must be a legitimate proprietary interest to be protected. As was held inMan Financial, the court will only enforce the covenant if it goes no further than necessary to protect the legitimate interests. There cannot be a bare and blatant restriction of the freedom to trade ... Moreover, even where a legitimate proprietary interest is shown, the court will ensure that the covenant in restraint of trade goesno further than what is necessaryto protect the interest concerned.[emphasis in original]The party seeking to enforce a covenant in restraint of trade bears the burden of proving that it has a legitimate proprietary interest to be protected by the covenant and that the covenant is reasonable in the interests of the parties and in the interests of the public. In the application of these legal principles, the court has to adopt a contextual approach and consider the specific circumstances of each case. Although there is no one single decisive factor, the courts have generally approached this issue by considering three main factors: the trade restrained, the geographical area and the duration of the restraint.91     As mentioned earlier, there were differences in the wording adopted in the non-compete clauses among the respective franchise agreements. I will first deal with the non-compete clause found in D2, D3 and D4’s franchise agreements. For ease of reference, the entire clause is reproduced as follows:[note: 42]On expiry or termination of this Agreement, the Franchisee shall not for a period oftwenty four (24) monthsthereafter be engaged in or be employed by or concerned or interested directly or indirectly in any business which competes with the Business within the Territory, or solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in thetwenty four (24) monthsperiod prior to termination. The Franchisee shall also not, either directly or indirectly, for itself or on behalf of or in conjunction with any other person, partnership or corporation, employ or solicit for the purpose of employing any of the Franchisor’s employees or former employees during the period of this Agreement and, for a period oftwenty four (24) monthsafter the expiry or termination of this Agreement, shall not also employ or solicit for the purpose of employing any employees or former employees who were employed in the Business by the Franchisee or the Franchisor or any other Franchisee of the Franchisor or any director or officer of the Franchisor or any of its Other Franchisees, save for any such employee entering into the employ of the Franchisee in response to any public recruitment advertisement.[emphasis in original]Although the geographical scope of the clause above was restricted to “within the Territory”, there was no definition of “Territory” in the franchise agreement. “Business” was defined in the interpretation clause as follows:[note: 43]“Business” means the [ICR] Centre conducted by the Franchisee in the Region pursuant to this Agreement including the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the System as defined below.92     The non-compete clause in D6 and D7’s franchise agreements was the same as that found in D2, D3 and D4’s franchise agreements but in D6 and D7’s franchise agreements, “Territory” was defined as “the geographical area of Singapore”. The term “Business” was defined as follows:[note: 44]“Business” means the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the System as defined below ...93     Finally, the non-compete clause in D5 and D8’s franchise agreements differed from the rest as there was no reference to any geographical scope in the clause itself:[note: 45]On expiry or termination of this Agreement, the Franchisee shall not for a period of twelve (12) months thereafter be engaged in or be employed by or concerned or interested directly or indirectly in any business which competes with the Business, or solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in thetwelve (12) monthperiod prior to termination. The Franchisee shall also not, either directly or indirectly, for itself or on behalf or in conjunction with any other person, partnership or corporation, employ or solicit for the purpose of employing any of the Franchisor’s employees or former employees during the period of this Agreement and, for a period oftwelve (12) monthsafter the expiry or termination of this Agreement, shall not also employ or solicit for the purpose of employing any employees or former employees who were employed in the Business by the Franchisee or the Franchisor or any other franchisee of the Franchisor or any director or officer of the Franchisor or any of its franchisees.Curiously, although there was no reference to “Territory” in the non-compete clause, “Territory” was defined in cl 1.1 of the franchise agreement to mean “the geographical area of Singapore”.[note: 46]94     By way of summary, the differences which existed between the non-compete clauses are summarised below:FranchiseeGeographical ScopeDurationD2, D3 and D4Non-compete clause includes the term “Territory”. However, “Territory” is not defined in the franchise agreement.24 monthsD6 and D7Non-compete clause includes the term “Territory”. “Territory” is defined as the “geographical area of Singapore”.24 monthsD5 and D8“Territory” is defined as the “geographical area of Singapore”. However, the non-compete clause does not include the term “Territory”.12 monthsThe non-compete clause in D2, D3, D4, D5 and D8’s franchise agreements had an unlimited geographical scope. On that basis alone, I was of the view that the scope of the clause was far too wide and that it had gone beyond what was necessary to protect the interest concerned. In the circumstances, the clause should not be upheld by the court.95     In respect of the non-compete clause in D6 and D7’s franchise agreements, the geographical scope was restricted to Singapore and the duration of the restraint was limited to 24 months after the expiry or termination of the agreement. In the circumstances, I would uphold the non-compete clause as being reasonable in the interests of the parties. In arriving at this conclusion, I took into account the fact that the franchise agreement in the present case was essentially a business contract entered into by corporate entities. This was not an employment contract between a corporate entity and an individual. There was no evidence to suggest any inequality in bargaining power between the contracting parties.96     Apart from that, both clauses were also limited to the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the operation manual. There was no evidence to suggest that D6 and D7 were not able to trade outside the scope of the trade restraint. The courts generally adopt a relatively stricter approach towards restraint of trade covenants in the employment context (Man Financial (S) Pte Ltd (formerly known as E D & F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008] 1 SLR(R) 663 at [81]).97     As mentioned above, the franchise agreement was effectively a business contract entered into by corporate entities. Kaske was trained in engineering and Jennifer was a practising lawyer at that point in time. In the circumstances, it was unlikely that the non-compete clause would have a significant adverse impact on their livelihood. I therefore held that the non-compete clause in D6 and D7’s franchise agreements to be reasonable in the interests of the parties.98     In respect of the issue of whether the non-compete clause was reasonable in the interests of the public, the Defendants relied on three main arguments. First, it was submitted that the non-compete clause was contrary to the interests of the public given that the education industry was one of the pillars of the Singapore economy. Second, it was argued that the Plaintiffs would effectively be allowed to monopolise the phonics business in the event that the clause was upheld. This would in turn restrict the market’s access to education services. Third, it was highlighted that the customers were young children and enforcing the restrictive covenant would mainly “serve to upset the children”. I was unable to accept these arguments as there was no reason why the education industry should be treated differently from all other industries. The attempt to characterise the Plaintiffs as having a monopoly over the phonics business in Singapore was also unsupported by any evidence. Education is also not all about phonics and language and certainly not all about the English language in any case.99     The Plaintiffs did not put forward any arguments on the doctrine of severance, at least in relation to the non-compete clause in D2, D3, D4, D5 and D8’s franchise agreements. I therefore did not have to deal with this issue.100    Having found that the non-compete clause in D6 and D7’s franchise agreements ought to be upheld by the court, the only remaining issue was whether D6 and D7 had breached this clause. D7 is operating a MES centre and the MES system is a system of teaching English through phonics. In this regard, D7’s running of the MES centre would therefore fall within the scope of the non-compete clause.101    With respect to D6, things were slightly more complicated. Unlike D7, D6 is now a dormant company because it entered into an agreement to sell the business to D1. In other words, D6 was no longer actively trading and the MES centres under Kaske’s control were being operated by D1 instead. It was therefore argued that D1 was not a contracting party to the franchise agreements and could not be held liable for breach of the clauses in the franchise agreements. In my view, such an argument could not be allowed to stand as that would be akin to giving contracting parties a free hand in using the corporate vehicle as an instrument of fraud to avoid existing obligations. On the facts of the present case, Kaske had relied on D1 as a corporate vehicle to avoid being bound by the clauses of the franchise agreement. In a bid to further distance himself from D1, Kaske interposed multiple parties in the chain of ownership. Nevertheless, it was clear from the facts that these parties were mere nominees of Kaske. In fact, David, the director of D1, went so far as to concede that he was merely a “puppet” of Kaske. Although Kaske attempted to justify the setting up of D1 by stating that he was merely trying to “protect” and “ring fence” his existing investments in D2–D6, that did not change the fact that Kaske was effectively using the corporate vehicle of D1 to surreptitiously evade the existing obligations imposed on D2–D6. In the circumstances, I was of the view that this was an abuse of the corporate vehicle, which justified the lifting of the corporate veil to extend liability to D1.Breach of the non-solicitation clause in relation to the customers102    The parties did not make any submissions on whether the non-solicitation aspect of the restrictive covenant should be struck down. All arguments concerning the doctrine of restraint of trade were made in the context of the non-compete clause, as opposed to the non-solicitation clause. I therefore proceeded on the basis that both parties did not contest the fact that the non-solicitation aspect of the clause would be upheld by the court.103    With the exception of the duration of restraint, the non-solicitation of customers clause was worded similarly across D2–D8’s franchise agreements:[note: 47]On expiry or termination of this Agreement, the Franchisor shall not for a period of twenty four (24) months [twelve (12) months in the case of D5 and D8] thereafter ... solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in the twenty four (24) months [twelve (12) month in the case of D5 and D8] period prior to termination.In my judgment, there was sufficient evidence to prove that D2–D8 actively solicited their previous customers under the ICR system. The general tenor of the evidence throughout the course of the trial suggested that the shift from the ICR system to the MES system was meant to be as seamless and fuss-free as possible. Nicola Jane Smith (“Nicola”), a teacher who used to be employed by D3 and subsequently moved to D1 after the sale of the business from D3 to D1, gave evidence to the effect that a majority of the students in the classes remained the same. Apart from that, the schedule of classes and the respective teachers also remained largely unchanged after the switch to the MES system.104    In a letter sent by MES to the parents of the students, it was stated that the fees structure and the curriculum would remain aligned after the switch. The parents were also promised that their children would remain in the same class, with the same teacher at the same designated day and time. This was consistent with the evidence given by Nicola. Apart from that, the parents were also expressly invited to convert to the MES programme. They were assured of a seamless transition and, to further sweeten the deal, the students who converted to the MES programme were promised free gifts and two free lessons.[note: 48]I was satisfied that the Defendants did actively solicit their previous students under the ICR system. Breach of the non-solicitation of customers clause was therefore established. For the avoidance of doubt, the observations in relation to the lifting of the corporate veil as set out above would also apply to the breach of the non-solicitation of customers clause.Breach of the non-solicitation clause in relation to the employees105    Similarly as in the case of the clause prohibiting the solicitation of customers, the parties did not make any submissions concerning the legal principles set out inCLAAS Medical v Ng. Therefore, in spite of the fact that such clauses undoubtedly fell within the scope of covenants in restraint of trade, I proceeded on the basis that the parties did not dispute that the clause should be given effect to.106    The parties paid little attention to the issue concerning the alleged solicitation of employees. The Plaintiffs’ written submissions were only two paragraphs long and it was briefly argued that the Defendants had solicited the teachers by “offering them the same timetable, same classes, same students, and at the same centre venue”. This was followed by a long extract of Nicola’s cross-examination to support the position that there was, in fact, a seamless transition from the ICR system to the MES system.107    I observed that the evidence relied upon by the Plaintiffs in the paragraph above was probably more relevant to their claim for breach of the non-solicitation clause in relation to the customers. The fact that there was a seamless transition to the MES system was, at best, marginally relevant to the issue concerning the alleged solicitation of the employees. While it may have gone some way towards demonstrating that there were teachers who decided to switch to the MES system, the Plaintiffs failed to highlight any evidence relating to the act of solicitation that was allegedly undertaken by the Defendants.108    With regard to the issue of what could be regarded as solicitation, Tan Lee Meng J, inWalton International Group (Singapore) Pte Ltd and others v Yau Kwok Seng Winston and another[2011] SGHC 144 at [45], cited the following extract from the New South Wales Supreme Court decision ofHellmann Insurance Brokers v Peterson[2003] NSWSC 242 at [11]–[12]:11 The meaning of ‘solicitation’ is elucidated by a decision of Wood CJ at CL inR v Laws[2000] NSWSC 880 (2000) 50 NSWLR 96, at 98. His Honour, at [8] recorded the remarks of Spigelman CJ and Hidden J inR v Azzopardi, 1 October 1998, unreported, which in turn approved remarks of Stout CJ inSweeney v Astle[1923] NZLR 1198 at 1202 which I quote:(g)    The word ‘solicit’ is a common English word and it means in a simplified form, ‘to ask’. In various English dictionaries this simple meaning is given, but other simple words are also used to explain other meanings it possesses, such as ‘to call for’, ‘to make a request’, ‘to petition’, ‘to entreat’, ‘to persuade’, ‘to prefer a request’.12 Whether an employee is soliciting a former client is not something which depends upon whether it is the employee who telephones or arranges to meet the former client, or the other way around. Rather,whether solicitation occurs depends upon the substance of what passes between them once they are in contact with each other. There is solicitation of a client by a former employee if the former employee in substance conveys the message that the former employee is willing to deal with the client and, by whatever means, encourages the client to do so.The same extract was referred to by Belinda Ang J in the earlier decision ofTan Wee Fong and others v Denieru Tatsu F&B Holdings (S) Pte Ltd[2010] 2 SLR 298. That was a decision concerning the solicitation of employees.109    In my opinion, the Plaintiffs did not satisfy the burden of proving that the Defendants had engaged in any form of solicitation of the employees so as to give rise to a breach of the non-solicitation clause. The Plaintiffs’ reliance on the evidence demonstrating a seamless transition to the MES system was equivocal at best. There was no other evidence to suggest that that the Defendants had encouraged, persuaded or even asked the employees to shift to the MES system. In the circumstances, I was not satisfied that there was a breach of the non-solicitation clause in relation to the employees.Breach of the confidentiality clause110    The Plaintiffs’ claim for breach of the confidentiality clause was based on the assertion that the following constituted confidential information within the scope of the franchise agreements:(a)     the student progress reports;(b)     the class registers;(c)     the teacher timetables;(d)     the fees structure; and(e)     the class timetables.111    As with the covenants in restraint of trade, there were significant variations in the drafting of the confidentiality clauses across the different franchise agreements. There was, however, a common feature across all the franchise agreements. Information in the public domain was expressly excluded from the scope of confidential information. In D2–D4’s franchise agreements, this exclusion was found in the definition of “Confidential Information”:[note: 49]Confidential information means:(iv)   ...but does not include information which:(h)    at the time of first disclosure to the Franchisee isalready in the public domain; or(i)    after disclosure to the Franchiseebecomes part of the public domainotherwise than by disclosure in breach of the terms of this Agreement ...[emphasis added]D5–D8’s franchise agreements were slightly different in this aspect due to the absence of a specific clause defining confidential information. The scope of confidential information was set out within the confidentiality clause itself. The relevant portion of the confidentiality clause was as follows:[note: 50]… for the purposes of this Agreement, the terms of this Agreement and the attached Schedules, information contained in the Operations Manual and all other information and knowledge relating to the System and the conduct of the Business that isnot already in the public domainshall be deemed confidential …112    InPH Hydraulics & Engineering Pte Ltd v Intrepid Offshore Construction Pte Ltd and another[2012] 4 SLR 36, I observed (at [46]) that the essence of information being confidential is that it is not freely available in the public domain. Information may therefore still be regarded as not being in the public domain even though a number of people know about it. Whether the information was published in a sufficiently widespread manner for it to lose its confidentiality depended on various factors such as (at [46]):... the type of information, the section of public who have an interest in knowing about the information, the domain in which the publication occurred, the degree of publication in that domain, the form in which the information is published and the vigour with which the information is likely to be pursued within that domain ...Given the express reference to the “public domain” in D2–D8’s franchise agreements, the principles set out above were also applicable to the present case.113    It was difficult to accept that the information concerning the fees structure and the timetables could be regarded as confidential information in so far as they were likely to have been part of the public domain. Such information would surely have been accessible to the customers (eg, the parents and students) of the ICR centre, or even to the prospective customers. On that basis, it should be excluded from the scope of confidential information as set out in the franchise agreements. A similar argument was raised in the High Court decision ofTrident Pharm Pte Ltd v Yong Pei Pei Tracey and another[2014] SGHC 59, where Choo Han Teck J observed that the prices were not confidential “since every patient who purchased the plaintiff’s products would have known what the prices were” (at [13]). Similarly, the fees structure and the timetables in the present case could not be regarded as being confidential in nature.114    I therefore proceeded to consider the Plaintiffs’ claim for breach of the confidentiality clause in relation to the customer information, such as the student progress reports and the class registers. Unlike the fees structure and the timetables, these data were likely to be accessible only to a select group of individuals, such as the teachers and staff of the respective ICR centres.115    The relevant portions of the confidentiality clause in D5–D8’s franchise agreements were as follows:[note: 51]... not to at any time during the term of this Agreement nor at any time after its expiry or termination make use of or disclose, other than exclusively for the purpose of this Agreement, any information or trade secrets relating to the Business and the conduct thereof, the Intellectual Property or the System or any other confidential informationsupplied by or on behalf ofthe Franchisor and ensure that none of the Franchisee's employees make use of such information other than for such purpose ...[emphasis added]The customer information did not fall within the scope of information or trade secrets relating to the ICR system and neither was it confidential information supplied by or on behalf of the franchisor. In the circumstances, the contracting parties could not have intended for customer information to fall within the scope of protection of the confidentiality clause. It was more likely to be protected under the non-compete and non-solicitation covenants.116    On the other hand, the definition of “Confidential Information” in D2–D4’s franchise agreements expressly included customer information:[note: 52]Confidential information means:(k)    …(c)    the transaction records and customer information;(xii)  …In so far as such transaction records and customer information did not become part of the public domain, they could be protected under the confidentiality clause of these franchise agreements.117    Having established that such information was capable of being protected under the scope of confidential information, the next question would be to ascertain if there was unauthorised disclosure by the relevant Defendants. The obligation not to disclose such confidential information was encapsulated in cl 16.2 of D2–D4’s franchise agreements:[note: 53]The Franchisee must not:(1)    before or after the end of the Franchise disclose any Confidential Information to any person other than to employees of the Franchisee or to a Local Area Licensee to the extent necessary for the conduct of the Business; and(2)    after the end of the Franchise or after an assignment of the Franchise by the Franchisee, use any part of the Confidential Information.The Defendants did disclose the customer information to D1 for the purposes of enabling D1 to bring the students on board the MES system. Under cross-examination, David, the director of D1, agreed that there were about 4000 student records and that it would have been “very difficult” to put the information together. In that respect, David conceded that D1 had obtained the information from the Defendants’ ICR centres and that there was no way D1 could have put the information together in such a short period of time without doing so. On that basis, I arrived at the finding that D2–D4 had breached the confidentiality clause by disclosing customer information to D1.Tort of conspiracy by unlawful means118    The Plaintiffs’ claim in conspiracy for unlawful means was based on the assertion that D1 had conspired with D2–D8 to injure the Plaintiffs’ legitimate business interests. It was further argued that D2–D8 had conspired to adopt a common stance – which was to deny that TELG was a party to the franchise agreement – after the 1 October 2012 letter was sent. The Plaintiffs alleged that the Defendants were, at the same time, in the process of secretly setting up D1 with David as the nominee. This was said to be for the purpose of enticing teachers and students from their respective ICR centres to shift to the MES system.119    In response, the Defendants submitted that an allegation of conspiracy was extremely serious and thus required a higher level of proof than that required in a normal civil action. It was argued that the Plaintiffs failed to meet this high threshold. The Defendants also highlighted that it was not sufficient for the Plaintiffs to demonstrate that it was reasonably foreseeable that the Plaintiffs would or might suffer damage as a result of the Defendants’ acts. It was submitted that the Plaintiffs had to prove that the unlawful means and conspiracy were targeted or directed at the Plaintiffs.120    InEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”), the Court of Appeal observed (at [112]) that the following elements had to be established in order to succeed in a claim for conspiracy by unlawful means:(a)     there was a combination of two or more person to do certain acts;(b)     the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts;(c)     the acts were unlawful;(d)     the acts were performed in furtherance of the agreement; and(e)     the plaintiff suffered loss as a result of the conspiracy.On the facts of the present case, the elements of combination and intention were disputed by the parties.121    With regard to the first element, a distinction had to be drawn between D1–D6 on the one hand and D7–D8 on the other. As discussed above, although Kaske only purported to be the director of D2–D6, it was obvious that he was also in control of D1. David, who happened to be the director of D1 on record, conceded that he was merely a “puppet” of Kaske. In fact, the general tenor of the evidence suggested that Kaske was the brainchild behind the entire scheme to set up D1 for the purpose of establishing the MES system. This could be contrasted with D7 and D8, which were controlled by Jennifer and Lum respectively. Although Kaske, Jennifer and Lum appeared to share a significant degree of common ground, especially in relation to their united response to TELG that it was not a contracting party, Jennifer’s and Lum’s level of involvement was relatively lower as compared to Kaske. This was probably attributable to the fact that Jennifer was a practising lawyer while Lum was in charge of running his family business. Unlike Kaske, their involvement in the education industry was only a side venture. Further, as at the date of the trial, D7 and D8 were still operational. It appeared that they were running MES centres under a licencing arrangement with D1. This could be contrasted with D2–D6 which have sold their business to D1. In the light of this distinction in the level of involvement, I was of the view that only D1–D6 could be said to have been in a combination to do certain acts. A director can be found to be liable for the tort of conspiracy with his company. In other words, a company can be regarded as a co-conspirator with its director. InNagase Singapore Pte Ltd v Ching Kai Huat and others[2008] 1 SLR(R) 80, Judith Prakash J observed that there could be a conspiracy between a company and its controlling director to damage a third party by unlawful means notwithstanding that the director might have been the moving spirit of the company. Returning to the facts in the present case, the evidence pointed towards Kaske being the moving force behind the entire plan to set up the MES system as a competitor to the ICR system. In the circumstances, I was of the view that the first element of combination was made out against D1–D6.122    With regard to the element of intention, the Defendants reiterated on multiple occasions that Kaske was merely attempting to protect his investment. It was submitted on behalf of the Defendants that there was no intention to cause damage or injury to the Plaintiffs by those acts. InEFT Holdings, the Court of Appeal made the following observations in relation to the element of intention (at [101]):A claimant in an action for unlawful means conspiracy would have to show that the unlawful means and the conspiracy were targeted or directed at the claimant. It is not sufficient that harm to the claimant would be a likely, or probable or even inevitable consequence of the defendant's conduct. Injury to the claimant must have been intended as a means to an end or as an end in itself. ...The following extract from Lord Hoffmann’s judgment inOBG Ltd and another v Allan and others[2008] 1 AC 1 was also cited by the Court of Appeal:In theLumley v Gyetort, there must be an intention to procure a breach of contract. In the unlawful means tort, there must be an intention to cause loss. The ends which must have been intended are different. ... But the concept of intention is in both cases the same.In both cases it is necessary to distinguish between ends, means and consequences. One intends to cause loss even though it is the means by which one achieved the end of enriching oneself.On the other hand, one is not liable for loss which is neither a desired end nor a means of attaining it but merely a foreseeable consequence of one's actions.[emphasis added]While the Defendants have attempted to characterise Kaske’s acts as being motivated by a desire to protect his investments, this did not necessarily mean that he could not have the intention to cause loss to the Plaintiffs. As explained in the extract above, there is a need to distinguish between ends, means and consequences. While it could be argued that Kaske was essentially driven by the desire to enrich himself and protect his investment, it was conceivable that this was merely the end he was working towards. The means by which he achieved this end was to set up D1 and to sell the businesses in D2–D6 to D1 for the sole purpose of establishing the competing MES system. In the circumstances, I was of the view that Kaske and the companies he was controlling had the intention to cause loss to the Plaintiffs by carrying out those acts. To approach the element of intention from another perspective, the Court of Appeal inEFT Holdingsalso observed that the claimant has to establish that the unlawful means and the conspiracy were targeted or directed at the claimant. On the facts of the present case, the acts undertaken by Kaske and the relevant companies were in fact targeted and directed at the Plaintiffs.123    In the light of the above, I was of the view that D1–D6 were liable for the tort of conspiracy by unlawful means.Tort for inducing breach of contract124    Unlike the other claims, the Plaintiffs’ claim in the tort of inducing breach of contract was only brought against D1. InTribune Investment Trust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407 (“Tribune Investment v Soosan”), the Court of Appeal held (at [17]) that to establish a claim in the tort for inducement of breach of contract, the plaintiff must show that:(a)     the procurer acted with the requisite knowledge of the existence of the contract, although knowledge of the precise terms was not necessary; and(b)     the procurer had the intention, which has to be determined objectively, to interfere with the performance of the contract.Apart from that, the contract in question must also be shown to be a valid one.125    On the facts of the present case, the first element of knowledge was relatively uncontroversial. Kaske, the controlling mind of D1, clearly acted with the knowledge of the other franchise agreements. In fact, Kaske would, in all likelihood, have knowledge concerning the major covenants in the franchise agreements such as the non-compete and non-solicitation clause.126    With regard to the second element of intention, the Plaintiffs made the following submissions:Kaske stated in his AEIC at [112] that D1 was set up to give him a “layer of protection”. [Jennifer] and Lum both stated in their AEICs as well at paragraphs [113] and [245] that this was a fall back position. There statements, together with the circumstances behind the complex and convoluted set-up of D1 clearly shows thattheyharboured intentions to breach and circumvent the post termination restrictive covenants in the Franchise Agreements.[emphasis added]The intention that is required is that of the procurer and not the contracting party. Given that the claim was brought against D1 alone, Jennifer and Lum’s intentions were strictly irrelevant for the purposes of this claim.127    Nevertheless, the second element of intention was established on the facts of the present case. In acknowledging that intention was to be determined objectively, the Court of Appeal inTribune Investment v Soosanmade the following observations at [18]:The relevant mental state is thus that of intention: the defendant must intend to interfere with the plaintiff's contractual rights, in the sense of doing so knowingly.Malice or spite in the form of a personal animus against the defendants or an illegitimate motive however is not required. It is sufficient if the defendant knows of the existence of the contract orturns a blind eye to its existence or is reckless as to the consequence of his actions in the sense of being indifferent whether or not a breach happens… It is not necessary that the defendant should have been aiming to hurt or injure the plaintiff although some deliberate conduct on the defendant's part is normally required to ground liability. Mere negligent invasions of contractual rights however are not actionable. The normal form of the tort involves direct persuasion being brought to bear on the contract-breaker, butit is possible to commit it where A and B enter into a contract which, to A's knowledge, is incompatible with B's contract with C…[emphasis added]Looking at the evidence as a whole, I was of the view that Kaske had acted with the requisite intention to give rise to liability for the tort of inducing breach of contract. Kaske clearly knew that D2–D8 were subject to the non-compete and non-solicitation clauses in their respective franchise agreements. In the case of D2–D6, Kaske proceeded to sell the businesses to D1 for the purpose of establishing the competing MES system. With regard to D7 and D8, it was not disputed that they had entered into a licence agreement with D1 for the purpose of operating MES centres. Apart from the non-solicitation clauses which have been found to be breached by the respective Defendants, the conversion of the ICR centres into MES centres was also in breach of the termination procedure set out in the franchise agreements. Kaske went so far as to state in his affidavit that:[note: 54]On 16 September 2013, D2 to D6 ceased offering the ICR System, the use of the ICR Trade Mark and ICR materials.Thereafter, D2 to D6 commenced business as English language tuition centres under the name and style of MES.[emphasis added]While Kaske attempted to clarify, in the course of cross-examination, that what he meant was that D2–D6 had sold their businesses to D1, it was not disputed that the physical locations of the centres remained the same and the ICR centres were practically “converted” to MES centres over the school break. In the circumstances, Kaske clearly had the requisite intention to interfere with the performance of the obligations under the franchise agreements. The tort for inducement of breach of contract was therefore established in the present case.The counterclaims in S 822/2013Tort of harassment128    The counterclaim in the tort of harassment was brought by D1 against the Plaintiffs. The acts in question that were relied upon by D1 to establish its counterclaim were that the Plaintiffs had, through its agents and/or servants:(a)     called the customers of D1 repeatedly to entice them to switch to the Plaintiffs’ centres;(b)     spread rumours repeatedly that the employees of D1 were personally liable for contempt of court; and(c)     engagedagent provocateursposing as concerned parents to repeatedly annoy the employees of D1.129    D1 began its submissions on its counterclaim by stating that the Court of Appeal had confirmed the existence of the tort of harassment in the recent decision ofTee Yok Kiat v Pang Min Seng[2013] SGCA 9. However, it was stated unequivocally in the grounds of decision in that case that it was not strictly necessary for the court to consider the appellant’s alternative cause of action under the tort of harassment given that her claim based on the tort of intimidation had been made out. In fact, the Court of Appeal stated that it would “nonetheless make some brief observations on this point” (at [39]). Second, it was recognised that none of the parties before the Court of Appeal questioned the existence of the tort of harassment under Singapore law. In the subsequent High Court decision ofAXA Insurance Singapore Pte Ltd v Chandran s/o Natesan[2013] 4 SLR 545 (“AXA Insurance v Chandran s/o Natesan”), Choo Han Teck J was of the view that there was no basis or principle upon which the tort of harassment was founded. As the parties did not make any substantive arguments on whether the tort of harassment exists in Singapore law, I need say no more about this issue here.130    There were two problems with D1’s counterclaim. First, one of the key elements that had to be established in the tort of harassment would be a course of conduct, whether by words or action and whether directly or through third parties, being sufficiently repetitive in nature as would cause worry, emotional distress or annoyance to the claimant. With reference to D1’s counterclaim, it would appear that the proper persons to bring the action in the tort of harassment would be the customers and employees who were allegedly harassed by the Plaintiffs. It would not be appropriate for D1, being a corporate entity, to bring the action for the tort of harassment. In any event, D1 did not make any submissions to suggest that it was entitled to sue on behalf of its employees and customers. A similar issue arose in the High Court decision ofAXA Insurance v Chandran s/o Natesan, where the plaintiff insurance company brought a claim in the alternative for the tort of harassment against an individual. Choo J observed that apart from the fact that the tort of harassment was not pleaded as a cause of action in the statement of claim, the plaintiff insurance company had not shown whether it was entitled to sue on behalf of its employees. This objection also arises on the facts of the present case.131    Second, even if it was accepted that D1 could bring the counterclaim for the tort of harassment against the Plaintiffs, there was insufficient evidence to prove the repetitive nature of the alleged conduct. As mentioned above, a key element in the tort of harassment is the alleged act beingsufficiently repetitivein nature as would cause worry, emotional distress or annoyance to the claimant. None of the alleged victims of the alleged conduct by the Plaintiffs was called to give evidence here. While the Plaintiffs have attempted to rely on Tan’s cross-examination to prove that the Plaintiffs had, in fact, engaged in such conduct, the evidence did not go so far as to establish the frequency, and more importantly, the repetitive nature of the alleged conduct.132    For the reasons above, D1’s counterclaim in the tort of harassment against the Plaintiffs could not succeed.Restitutionary claim133    The counterclaim in restitution was brought by D2–D8 against the Plaintiffs for the price of the unused ICR materials that were returned to the Plaintiffs. It was D2–D8’s case that the Plaintiffs had freely accepted the ICR materials with the knowledge that D2–D8 expected to be paid for them. It was argued that the Plaintiffs were thereby enriched upon receipt of the unused ICR materials and this enrichment was at D2–D8’s expense as the ICR materials had already been fully paid up by D2–D8.134    In reply to D2–D8’s arguments that they were entitled to the price of the unused ICR materials, the Plaintiffs argued that there was neither an express nor implied term in the franchise agreement. However, D2–D8’s claim was based on restitution, as opposed to a breach of a contractual term, whether express or implied.135    For the avoidance of doubt, it was undisputed by the parties that D2–D8 had purchased the ICR materials from the franchisor in a typical sales transaction. The arrangement was such that the franchisee would place an order for the ICR materials depending on its own needs and requirements. There was no obligation on the part of the franchisee to order a specific amount of ICR materials pursuant to the franchise agreement.136    Looking at the evidence as a whole, I was of the view that there were two fundamental problems with D2–D8’s counterclaim for the price of the unused ICR materials. First, a brief perusal of the franchise agreements showed the presence of an elaborate termination procedure which had to be complied with upon termination or expiry of the franchise agreements. One of the obligations was for the franchisee to return all programmes, workbooks and materials to the franchisor at the end of the franchise arrangement. The franchise agreement was silent on the issue of whether the franchisor was obliged to make any refunds for the returned ICR materials. In the face of this contractual arrangement between the parties, I was of the view that the receipt of the unused ICR materials by the Plaintiffs could not give rise to any claim in restitution by D2–D8. I note in passing that D2–D8 alluded to the fact that there was a practice of crediting their respective accounts with the value of the returned ICR materials in the course of previous dealings. However, the previous practice of returning the ICR materials, if it existed, was not pursuant to any contractual arrangement within the franchise agreement. In any case, it was done in the course of a continuing relationship. The return of the ICR materials in the present case was expressly stated in the franchise agreements in that the franchisee would return all programmes, workbooks and materials to the franchisor upon the termination or expiry of the franchise arrangement.137    Second, I was unable to accept D2–D8’s arguments that the Plaintiffs had “freely accepted” the returned ICR materials. This free acceptance was relied upon by D2–D8 as the unjust factor to ground their counterclaim in restitution. I was not able to accept that the Plaintiffs freely accepted the returned ICR materials. It was undisputed that D2–D8 had delivered the ICR materials to TELG on their own accord. In a letter dated 12 September 2013 from D2–D8 to TELG, it was stated that:[note: 55]Please note that we will be delivering the items in the enclosed inventory, to your office ... between 4–5pm today. Please be ready to receive them.If you do not wish to take delivery of these items, please be notified thatthe cost of storage of these inventory, additional transport charges to store the items and any other incidental charges will be charged to you.[emphasis added]Under such circumstances, given the clear threat by D2–D8 to seek further charges from the Plaintiffs in the event that the goods were not accepted, the Plaintiffs had little free choice and could not be said to have “freely accepted” the returned ICR materials. I was therefore of the view that D2–D8 could not rely on the alleged free acceptance by the Plaintiffs as the unjust factor to support their counterclaim in restitution. D2–D8’s counterclaim for the value of the returned ICR materials therefore failed.Conclusion138    For the reasons set out above, I dismissed all the claims and counterclaims in both S 420/2013 and S 822/2013. Although the Plaintiffs’ claims mostly failed as a result of the invalid assignment, they would have succeeded in a number of claims had the assignment been valid. On the other hand, the Defendants also brought a few counterclaims against the Plaintiffs which were dismissed entirely. I was therefore of the view that each party should bear its own costs.[note: 1]Kaske Gerold Ulrich’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Kaske-1”) at p 6, para 25.[note: 2]Kaske-1 at pp 6–7, para 26.[note: 3]Kaske-1 at p 7, para 27.[note: 4]Kaske-1 at p 7, para 29.[note: 5]Kaske-1 at p 7, para 29.[note: 6]Chih Chien Li Jennifer’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Jennifer-1”) at p 5, para 15.[note: 7]Jennifer-1 at p 6, para 22.[note: 8]Plaintiffs’ Bundle of Documents at pp 3–15.[note: 9]Plaintiffs’ Bundle of Documents at pp 16–31.[note: 10]Plaintiffs’ Bundle of Documents at pp 32–44.[note: 11]Agreed Bundle of Documents (Volume 2) at pp 411–413.[note: 12]Agreed Bundle of Documents (Volume 2) at pp 429–431.[note: 13]Agreed Bundle of Documents (Volume 2) at pp 512–513.[note: 14]Plaintiffs’ Closing Submissions dated 20 August 2014 (“PCS”) at p 19.[note: 15]Agreed Bundle of Documents (Volume 3) at pp 799–804.[note: 16]Agreed Bundle of Documents (Volume 2) at pp 567–569.[note: 17]Agreed Bundle of Documents (Volume 3) at pp 712–714.[note: 18]Plaintiffs’ Bundle of Documents at pp 16–31.[note: 19]Agreed Bundle of Documents (Volume 1) at pp 88, 114.[note: 20]Plaintiffs’ Bundle of Documents at p 5.[note: 21]Agreed Bundle of Documents (Volume 2) at pp 429–431.[note: 22]Agreed Bundle of Documents (Volume 2) at pp 411–413.[note: 23]Agreed Bundle of Documents (Volume 2) at pp 429–431.[note: 24]Agreed Bundle of Documents (Volume 2) at pp 411–413.[note: 25]Agreed Bundle of Documents (Volume 1) at pp 88, 114.[note: 26]Agreed Bundle of Documents (Volume 2) at p 479.[note: 27]Lum Wai Onn’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Lum-1”) at p 182.[note: 28]Lum-1 at p 182.[note: 29]Agreed Bundle of Documents (Volume 3) at p 818.[note: 30]Agreed Bundle of Documents (Volume 3) at p 793.[note: 31]Agreed Bundle of Documents (Volume 3) at p 818.[note: 32]Agreed Bundle of Documents (Volume 1) at p 37.[note: 33]Agreed Bundle of Documents (Volume 2) at p 564.[note: 34]Agreed Bundle of Documents (Volume 2) at p 563.[note: 35]Agreed Bundle of Documents (Volume 2) at p 568.[note: 36]Agreed Bundle of Documents (Volume 2) at p 568.[note: 37]Agreed Bundle of Documents (Volume 2) at p 568.[note: 38]Agreed Bundle of Documents (Volume 3) at p 687.[note: 39]Agreed Bundle of Documents (Volume 2) at p 469.[note: 40]Agreed Bundle of Documents (Volume 2) at p 409.[note: 41]Agreed Bundle of Documents (Volume 2) at pp 479–480.[note: 42]Agreed Bundle of Documents (Volume 1) at pp 200–201.[note: 43]Agreed Bundle of Documents (Volume 1) at p 151.[note: 44]Agreed Bundle of Documents (Volume 1) at p 72.[note: 45]Agreed Bundle of Documents (Volume 1) at pp 61–62.[note: 46]Agreed Bundle of Documents (Volume 1) at p 48.[note: 47]Agreed Bundle of Documents (Volume 1) at p 200.[note: 48]Agreed Bundle of Documents (Volume 7) at p 2065.[note: 49]Agreed Bundle of Documents (Volume 1) at p 151–152.[note: 50]Agreed Bundle of Documents (Volume 1) at p 56.[note: 51]Agreed Bundle of Documents (Volume 1) at p 56.[note: 52]Agreed Bundle of Documents (Volume 1) at p 151.[note: 53]Agreed Bundle of Documents (Volume 1) at p 185.[note: 54]Kaske-1 at p 47, para 164.[note: 55]Agreed Bundle of Documents (Volume 4) at pp 1159, 1160, 1162.",
        "The facts": "",
        "Background to the ICR system": "3       The ICR system was developed by two Australian nationals, Annabel Seargeant (“Annabel”) and Antony Earnshaw (“Antony”). Different entities were set up to market the ICR system internationally. For the purposes of the present proceedings, we need to focus only on two entities controlled by Antony and Annabel: the Australian entity, Total Literacy Pty Ltd (“TLA”), and the Singaporean entity, TLS. The trade marks, copyright and other intellectual property rights were supposedly owned by TLA, which then granted a licence to TLS. The arrangement was for TLS to enter into franchise agreements with franchisees in Singapore. Under those franchise agreements, the franchisees, such as D2–D8, were allowed to operate education centres in Singapore offering the ICR system.",
        "The franchisees": "4       TLS entered into multiple franchise agreements with different franchisees for the purpose of exploiting the ICR system in Singapore. Based on the evidence that has been led in the course of the present proceedings, there appeared to be variations in the franchise agreements entered into with different franchisees. In other words, while the structure of the franchise agreements remained broadly similar, there were significant differences in the wording of specific clauses, such as the confidentiality clause and the non-compete clause. As will be seen subsequently, these differences in wording have, at times, given rise to dissimilar outcomes in respect of D2–D8. D2–D6 5       D2–D6 were franchisees owned and operated by Kaske Gerold Ulrich (“Kaske”) at the material time. As at the date of the trial, D2–D6 are dormant companies after having sold their businesses to D1. Nevertheless, Kaske remains the director of D2–D6 and he gave evidence on behalf of D2–D6 in the course of the trial. 6       Kaske has a background in engineering. He worked in the software industry for about 11 years before setting up his own business.[note: 1]He was first involved in the education industry back in 2006 when he acquired D5.[note: 2]Subsequently, Kaske came to know that the owner of D6 was interested in selling her stake in D6. He proceeded to acquire D6 after obtaining the consent of TLS (ie, the franchisor prior to the purported assignment).[note: 3]Over the course of the next few years, Kaske obtained rights from TLS to set up three other ICR centres in Singapore.[note: 4]D2–D4 were used as corporate vehicles for these additional ICR centres. In total, Kaske owned and operated five ICR centres in Singapore at the material time.[note: 5] D7 7       D7 was a franchisee owned and operated by Chih Chien Lih Jennifer (“Jennifer”). Jennifer and her former husband acquired D7 and took over the running of the ICR centre in August 2007.[note: 6] 8       Jennifer is currently practising as a lawyer in a local law firm. She gave evidence on how Kaske chipped in to lend a hand in the running of her ICR centre as and when she needed assistance.[note: 7]In return, she would reciprocate by helping out with or giving advice on legal matters. Unlike D2–D6, D7 is still operating although no longer as an ICR centre. D8 9       D8 was a franchisee owned and operated by Lum Wai Onn (“Lum”) at the material time. The franchise agreement between D8 and TLS was for an initial term of ten years and the agreement was due to expire on 26 October 2012. It was Lum’s case that the term of the franchise agreement was varied from ten years to one in perpetuity but personal to him. This was the main factual dispute in S 420/2013. 10     In the course of the trial, Lum gave evidence that he was mainly occupied with his family businesses that were unrelated to the education industry. In other words, the acquisition of D8 was only a side venture for Lum. Unlike D2–D6, D8 is still operating but no longer as an ICR centre.",
        "The franchisors and the purported assignment": "11     TLS was originally the franchisor in the franchise arrangements entered into in Singapore. In other words, the contracting parties in the franchise agreements were TLS and the respective franchisees. The Plaintiffs came into the picture when Antony and Annabel decided to sell the business to the Plaintiffs. This was executed by way of three deeds of assignment dated 19 July 2012. 12     In the first deed of assignment, there was a purported assignment of the business contracts in Singapore, including the franchise agreements, to TELG.[note: 8]In the second deed of assignment, the copyright and all other intellectual property rights (excluding the trade mark rights) concerning the ICR system were assigned to TELI.[note: 9]For the purposes of the present dispute, only the first and second deeds of assignment are relevant. Nevertheless, for completeness, it is noted that the relevant parties also entered into a third deed of assignment where the trade mark rights were assigned to TELG.[note: 10] 13     On 25 July 2012, an email was sent by Annabel on behalf of TLS to the franchisees to inform them about the change in ownership.[note: 11]As will be seen below, this email was rather misleading in so far as it suggested that there were “new shareholders” in TLS. In particular, there was no mention of the purported assignment of the franchise agreements from TLS to TELG. 14     This was followed by a letter dated 1 October 2012 sent by TLS to the franchisees to inform them that the business had been sold to the Plaintiffs and that all future payments were to be directed to TELG.[note: 12]The Plaintiffs relied on this letter as the notice of assignment.",
        "The dispute over the purported assignment": "15     Between October and December 2012, there were meetings and negotiations between the representatives of the Plaintiffs and the respective owners of D2–D8 (ie, Kaske, Jennifer and Lum). In this respect, the situation between the Plaintiffs and D8 was slightly different as compared to the other franchisees as the Plaintiffs maintained the position that D8’s franchise agreement had expired on 26 October 2012. The facts unique to D8 are relevant only to the issues arising in S 420/2013 and will be dealt with separately below. 16     Meanwhile, the general tenor of the evidence was such that D2–D8 had maintained their position that the assignment was invalid in so far as their consent had not been sought. There was some discussion on the possibility of entering into new franchise agreements and the grant of a power of attorney but nothing came out of those discussions. The concept of a novation agreement was also explored by the parties but this did not materialise eventually. 17     On 7 December 2012, a letter of demand was issued by the Plaintiffs against D8 regarding, among other things, the non-payment of royalties.[note: 13]",
        "The incorporation of D1": "18     D1 was incorporated on 29 January 2013 and David Chong (“David”) was appointed as the sole director.[note: 14]He was also the sole shareholder of D1. This was followed by the appointment of Kaske as a director of Monkwell on 5 February 2013. David’s shareholding in D1 was transferred to another entity known as Monkwell on 19 February 2013. In the course of the trial, it became clear that David was merely acting as a nominee of Kaske. 19     On 25 March 2013, Monkwell changed its name to MEIL. This was followed by an increase in the number of shares in D1 on 8 April 2013 from one to ten. Out of the ten shares, nine shares were held by MEIL while the remaining share was held by David. On 24 April 2013, Kaske transferred his shares in MEIL to Loh Lye Ai (“Loh”). It appeared in evidence that Loh was also a nominee acting on behalf of Kaske. 20     On 25 April 2013, Kaske ceased to be a director of MEIL and Loh was appointed as the director of MEIL in place of Kaske.",
        "The termination of the franchise agreements": "21     D2–D7 terminated their respective franchise agreements on 21 June 2013.[note: 15]",
        "The transition to the My English School (“MES”) system": "22     It was not disputed by the parties that the MES system, being an English literacy and phonics programme, was in direct competition with the ICR system. On 10 September 2013, letters were sent to the parents of the students, informing them about the impending switch to the MES system. The week leading up to 16 September 2013 happened to be the term break and D2–D8 took the opportunity to prepare for the migration from the ICR system to the MES system. The ICR signboards were replaced with the MES equivalent at the various centres. On 16 September 2013, the centres started offering the MES programme. Arrangements were made for the unused ICR materials to be returned to the Plaintiffs on or about 12 September 2013.",
        "The commencement of S 822/2013": "23     On 16 September 2013, the Plaintiffs commenced S 822/2013 against the Defendants. On the same day, the Plaintiffs filed an urgent application for an injunction against the Defendants. The matter came before Choo Han Teck J and a limited injunction was granted against the Defendants. The terms of the injunction were subsequently varied on 18 September 2013 when parties appeared before me.",
        "The dispute over D8’s franchise agreement": "24     As mentioned above, D8 is the sole defendant in S 420/2013 and the main factual dispute between the Plaintiffs and D8 pertained to the term of D8’s franchise agreement. The Plaintiffs took the view that D8’s franchise agreement had expired on 26 October 2013 while D8 took the position that its franchise agreement had been varied to one in perpetuity. 25     According to Lum, at around the time when he was in the process of acquiring D8, he met with the then Managing Director of TLS, Allston Boyer Parkinson (“Allty”). During the meeting, Lum made a request for the term of D8’s franchise agreement to be varied to an open-ended term. In response to Lum’s request, it was alleged that Allty orally agreed to the variation and handed to Lum an addendum to reflect the variation. This addendum will be covered in greater detail later in the judgment. 26     After Lum acquired D8, there was a period of time when Lum made multiple requests for a formal written confirmation regarding the variation of D8’s franchise agreement. It was undisputed that nothing came out of these requests and that at the time of the trial, the only written documentation available was the addendum given by Allty. 27     When the Plaintiffs were in the process of acquiring the ICR business, they knew about Lum’s claim regarding the variation of D8’s franchise agreement. Nevertheless, the Plaintiffs and TLS agreed to put the matter on hold. To this end, letters were sent to Lum to assure him that his claim would be looked into and that he need not worry about the dispute. 28     When the Plaintiffs completed the acquisition of the ICR business, they adopted the position that D8’s franchise agreement was due to expire on 26 October 2012. Towards the end of 2012, the discussions between the Plaintiffs and Lum were largely in relation to the potential sale of D8 to the Plaintiffs. Pursuant to these negotiations, a non-disclosure agreement was signed by both parties on 2 January 2013.[note: 16]Negotiations for the sale of D8 to the Plaintiffs eventually broke down as both parties had fundamental differences concerning the valuation and offer price of D8. A second letter of demand was sent to D8 on 2 May 2013 and S 420/2013 was commenced soon after on 8 May 2013.[note: 17]",
        "The decision": "29     At the outset, I note that the Plaintiffs and the Defendants have raised multiple claims and counterclaims across both S 420/2013 and S 822/2013. Unfortunately, a few of these claims and counterclaims appeared to be sidelined in so far as minimal evidence was led to support the legal arguments. Nevertheless, for completeness, I attempted to deal with all the claims and counterclaims raised by the parties in the present dispute. Although S 420/2013 and S 822/2013 were heard together, the legal issues arising in both actions could be grouped into three broad categories: (a)     the validity of the purported assignment, which affected the outcome in both S 420/2013 and S 822/2013; (b)     the claims and counterclaims in S 420/2013, which affect only D8 given that it was the sole defendant in S 420/2013; and (c)     the claims and counterclaims in S 822/2013. For ease of reference, I will approach the legal issues in the order set out above.",
        "The validity of the purported assignment": "30     The original franchisor in the various franchise arrangements entered into with D2–D8 was TLS. In this respect, the Plaintiffs derive their standing to commence both actions from the deeds of assignment entered into by the relevant parties, where various assets of the ICR system were purportedly assigned to the Plaintiffs. In the event that the assignment is found to be invalid, TLS will remain as the contracting party and the Plaintiffs will not have the requisite standing to commence the present actions. 31     At the outset, the Defendants raised the issue of whether TELI had any interest in the present dispute. As discussed above, TELI was the assignee of the copyright and other intellectual property rights (excluding the trade mark rights) pursuant to the deed of assignment dated 19 July 2012.[note: 18]Initially, the Plaintiffs included a few intellectual property claims in S 420/2013. These were, however, abandoned subsequently. There were also no intellectual property claims in S 822/2013. Nevertheless, in the course of the trial, a dispute arose over the issue of whether TELI had any database rights to give it the requisite standing to bring an action against D2–D8 in S 822/2013. In my judgment, the issue concerning the assignment of database rights, if any, was a red herring as there were no intellectual property claims in both S 420/2013 and S 822/2013. The claims brought by the Plaintiffs were based on various breaches of the franchise agreements. In other words, the basis for the Plaintiffs’ claims was in contract and the proper party to commence the actions would be the purported assignee of the various franchise agreements,ie, TELG. Further, both parties did not deal with the threshold issue of whether database rights were capable of existing independently within the intellectual property regime in Singapore. There was no attempt to illustrate how the existence of such database rights would have any bearing on the claims for breach of contract by the Plaintiffs. I was therefore of the view that TELI had no interest in the present proceedings, given that it was the purported assignee of only the intellectual property rights (excluding the trade mark rights). 32     Moving on to the issue of the validity of the purported assignment, I note the existence of a “no-assignment” clause in D6 and D7’s franchise agreements.[note: 19]This raised a separate issue of whether a purported assignment in the face of a “no-assignment” clause was capable of having any legal effect. As this issue only arose in relation to D6 and D7, I will consider this issue after dealing with the general issues that applied across the board to all Defendants. The general issues concerning the validity of the assignment can be grouped into two broad categories: (a)     whether a franchise agreement comprising both benefits and burdens can be assigned as a whole; and (b)     whether there was a valid notice of assignment on the facts of the present case. Whether the franchise agreement was assignable as a whole 33     It is undisputed that the franchise agreements incorporate ongoing rights and obligations vis-à-vis both the franchisor and the franchisee. In this regard, a distinction has to be drawn between an assignment and a novation. InFairview Developments Pte Ltd v Ong & Ong Pte Ltd and another appeal[2014] 2 SLR 318, the general principles relating to novations and assignments were set out by the Court of Appeal at [46]: ... The term “novation” refers to the process by which the contract between the original contracting parties isdischarged through mutual consentandsubstituted with a new contractbetween the new parties. A novation is therefore to be distinguished from anassignment. In a novation,both the benefits and the burdensof the original contract are transferred to thenew contracting parties, essentially because, as just mentioned, the original contract is extinguished and a new contract is formed. And, as Lord Selborne LC observed in the House of Lords decision ofBenjamin Scarf v Alfred George Jardine(1882) 7 App Cas 345 (at 351), the new contract can, of course, be either between the same parties to the original contract or between different parties. The learned Law Lord also referred (at 351) to the term “novation” as being one derived from the Civil Law (cfalso the doctrine of frustration) as well as to the fact that the necessary (and sufficient) consideration consists in the discharge through mutual consent of the original contract. In an assignment, however,only the benefits of the contractare transferred to the assignee. The assignor remains bound to perform the obligations under the contract. The assignee doesnotbecome a party to the contract, which continues to subsist as between the contracting parties. Accordingly, in an assignment, the consent of the other contracting party isnotnecessary for a contracting party to assign the benefits under the contract to a third party. All these legal principles are well-established ... [emphasis in original] 34     A novation involves the change in the identity of a contracting party with the consent of the other contracting party. Given that a novation involves the wholesale substitution of the original contract, it has the effect of subjecting the incoming third party to both the benefits and burdens of the contract. 35     This can be contrasted with an assignment, where only the benefit of the contract can be transferred from the assignor to the assignee. Unlike a novation, the consent of the other contracting party is generally not required in the case of an assignment. Given that an assignment involves the transfer of only the benefit of the contract, the assignor remains obligated to perform any remaining obligations under the contract. Difficulties arise when parties purport to assign an entire “contract” as opposed to only the “benefit” of the contract. This problem is compounded when the assignment of the entire “contract” is carried out without the consent of the other contracting party, as in the present case. In the House of Lords decision ofLinden Gardens Trust Ltd v Lenesta Sludge Disposals Ltd and others[1994] 1 AC 85 (“Linden Gardens v Lenesta”), Lord Browne-Wilkinson made the following observations at 103: ... It is trite law that it is, in any event, impossible to assign “the contract” as a whole, i.e. including both burden and benefit. The burden of a contract can never be assigned without the consent of the other party to the contract in which event such consent will give rise to a novation. ... 36     On the facts of the present case, it was undisputed that the purported assignment had been carried out without the consent of the franchisees. Therefore, in the absence of such consent, the arrangement between TLS and TELG could not give rise to a valid novation. The issue was thus whether the franchise agreements were capable of being assigned as a whole to TELG so as to give it requisite standing to commence the present actions. 37     At the outset, I note that the franchise agreements provided executory rights and obligations on both the franchisor and franchisee. This could be contrasted with a contract where one party has already discharged its obligations in full and the only remaining obligations are owed by the other contracting party. In my view, given that the franchise agreements were ongoing contracts with existing obligations on both contracting parties, they are not capable of being “assigned” as a whole. Any purported assignment of the entire contract would run afoul of the general rule that the burdens and obligations of a contract could not be assigned or transferred without the consent of the other contracting party. 38     To get around this problem, the Plaintiffs argued that the purported assignment of the franchise agreements could be construed as transferring only the benefits accruing to TLS under the franchise agreements to TELG. On this basis, the purported assignment would not involve the transfer of TLS’ obligations and the consent of the franchisees would therefore be unnecessary. I could not accept the Plaintiffs’ arguments as such a construction was wholly inconsistent with the deed of assignment that was entered into by the parties. The process of ascertaining the scope and effect of the deed of assignment was effectively one of construction. The court has to give effect to the objective intentions of the contracting parties. For ease of reference, the relevant portion of the deed of assignment is set out below:[note: 20] 2ASSIGNMENT OF BUSINESS CONTRACTS 2.1    The Assignors hereby unconditionally, absolutely and irrevocably TRANSFER and ASSIGN with full title guarantee, the Business Contracts to [TELG] (only in connection with the Business Contracts in Singapore) or [TELI] (only in connection with the Business Contracts in Other Territories), including without limitation: (a)    (a) the rights (excluding Tax benefits and Relief in relation to any period before the Transfer Time), benefits, liabilities (excluding Tax liabilities in relation to any period before the Transfer time) and obligations of each of [TLS] and Total Literacy (International) Pte. Ltd. as franchisors of the Business Contracts in Singapore and the Business Contracts in Other Territories (as applicable) as particularised inSchedule 2 (List of Business Contracts); (c)    ... [emphasis in original] In this respect, it was obvious that the parties to the deed of assignment had intended the assignment to be in relation to the entire contract, as opposed to only the rights and benefits of the contract. In fact, the parties went so far as to specifically state that the assignment was inclusive of the rights, benefits, liabilities and obligations of TLS as franchisor of the business contracts (ie, the franchise agreements). In the circumstances, the Plaintiffs’ argument that the parties had only intended to assign the benefits of the contract was wholly inconsistent with and would clearly go against the express and unambiguous intent of the parties as embodied in the wording of the clause in question. Upholding the deed of assignment by reading down the scope of the assignment clause would be tantamount to imputing an intention to the parties which they never had. Therefore, I rejected the Plaintiffs’ submission that the parties had only intended to assign the benefits of the franchise agreements. 39     Moving on, the Plaintiffs submitted that D2–D8 ought to be estopped from denying that there was a valid assignment as they had, through their conduct, accepted the performance of the franchisor’s obligations by the Plaintiffs. In this regard, the Plaintiffs relied on the following evidence: (a)     that D2–D8 had continued to operate as ICR centres even after the purported assignment; (b)     that D2–D8 had continued to receive programmes, workbooks and materials necessary for the operation of the ICR centres; and (c)     that D8 had made payments of royalties to TELG. 40     In my judgment, the Plaintiffs’ reliance on estoppel or waiver should be rejected for the following reasons. First, it was clear that D2–D8 had maintained their objections to the purported assignment of the franchise agreements in the course of discussions and negotiations among the parties. Their objections and reservations with regard to the purported assignment were set out in a series of letters and emails exchanged between the relevant parties. 41     Second, in view of D2–D8’s stance towards the purported assignment, they must surely have every right to continue with the franchise agreement as if the assignment had not taken place. D2–D8 were not obliged to terminate the franchise agreement and they were entitled to continue with the arrangement on the assumption that TLS was still the contracting party. This is wholly consistent with the observations made above that the original contracting party remains a party to the contract even after an assignment has taken place. In fact, the original contacting party remains obliged to discharge any of its remaining obligations pursuant to the contract. Therefore, I was not inclined to accept the Plaintiffs’ argument that D2–D8 must be estopped from denying the validity of the assignment when all that they did was to continue with the franchise agreements as if the purported assignment had not taken place. Such conduct on the part of D2–D8 could not give rise to a case for an estoppel or waiver. 42     For the reasons set out above, I was of the view that the purported assignment was invalid. On that basis alone, the Plaintiffs did not have the requisite standing to commence the present actions against the Defendants in so far as they were not parties to the franchise agreement. 43     For completeness, D2–D8 also relied on the argument that the franchise agreements were personal contracts which were not assignable at law. D2–D8 attempted to draw an analogy between a franchise agreement and an employment contract. In this respect, it was highlighted that a contractual right to the services of an employee is generally regarded as being personal and incapable of assignment. 44     I accepted the existence of the general rule that personal contractual rights could not be assigned without the consent of the obligor. A contractual obligation could not be vicariously performed if it required the personal performance of the obligor. This is otherwise known as the “personal rights” rule (see Greg Tolhurst,The Assignment of Contractual Rights(Hart Publishing, 2006) at para 6.68). 45     I was, however, unable to accept D2–D8’s argument that the “personal rights” rule was relevant to the present case. First, it appeared to me that D2–D8 had, in the course of arguing that the franchise agreement was personal in nature, mainly relied on the franchisor’s obligations, as opposed to the franchisor’s rights. This line of argument was academic in so far as it was accepted that a contractual obligation could not be assigned without the consent of the other contracting party. In this respect, D2–D8 did not highlight any particular right that the franchisor had against the franchisee which was personal in nature so as to prevent any assignment of that right to a third party. 46     Second, I was not prepared to accept the Plaintiffs’ analogy that a franchise agreement was akin to an employment contract. The franchise agreement in the present case was effectively a business contract entered into between corporate entities. The franchise agreement was not entered with Antony and Annabel on a personal basis. A company has the ability to vary its management and control, and even its ownership, at any time. On the facts, there were also no provisions on change of control in the franchise agreements. There was also no restriction on Antony or Annabel to transfer their shares in TLS to a third party. 47     Third, it appeared to me that the ICR system was already at an advanced stage of development and there was no evidence to suggest that Antony and Annabel were required to play a major role in the developmental process of the ICR system. Rather, their role was generally that of having oversight of the company. In the circumstances, it was unlikely that the franchise agreements would fall within the scope of personal contracts that would render the rights therein unassignable. 48     In any event, given the finding that the purported assignment was invalid, my observations on this specific issue of personal contracts are academic. Whether there was a valid notice of assignment 49     It was the Plaintiffs’ pleaded case that the letter dated 1 October 2012 (“the 1 October 2012 letter”) from TLS to D2–D8 constituted a valid notice of assignment. The Plaintiffs argued that the test for what amounted to a valid notice of assignment involved a low threshold and that there was no specific requirement for the notice to expressly include the word “assignment”. It was further submitted that the notice would be valid in so far as information relative to the assignment was conveyed to the debtor and the notice expressly or implicitly recorded the fact of the assignment. On this basis, the Plaintiffs argued that the 1 October 2012 letter was a valid notice of assignment. 50     The Defendants took the position that the 1 October 2012 letter was unclear and capable of different interpretations, regardless of whether it was read alone or in the context of the facts and circumstances then. Specifically, the Defendants referred to the phrase “sold our business” in the 1 October 2012 letter as being vague.[note: 21]The Defendants also highlighted the confusion caused by the earlier email from Annabel to D2–D8 on 25 July 2012 (“the 25 July 2012 email”), where she stated that TLS had “changed the corporate structure of the business by expanding [its] shareholder base”.[note: 22]It was argued that the 25 July 2012 email was misleading. The Defendants also pointed out that there was no communication from either TLS or TELG to correct the inaccurate statement by Annabel. 51     The Plaintiffs did not offer any arguments on whether the assignment of the business contracts from TLS to TELG could be construed as an equitable assignment. In any event, an equitable assignment would generally require the assignee to join the assignor to the action. It was undisputed that TLS was not joined as a party in the present proceedings. I therefore approached the issue concerning the assignment of the business contracts on the basis that the Plaintiffs were only seeking to rely on the purported assignment as being statutory in nature. 52     Both parties referred to s 4(8) of the Civil Law Act (Cap 43, 1999 Rev Ed) (“CLA”), reproduced as follows: Assignment of debts and choses in action effectual to pass right and remedy (8) Any absolute assignment by writing under the hand of the assignor, not purporting to be by way of charge only, of any debt or other legal chose in action of whichexpress notice in writing has been given to the debtor, trustee or other person from whom the assignor would have been entitled to receive or claim such debt or chose in action, shall be and be deemed to have been effectual in law, subject to all equities which would have been entitled to priority over the right of the assignee under the law as it existed before 23rd July 1909, to pass and transfer the legal right to such debt or chose in action, from the date of such notice, and all legal and other remedies for the same, and the power to give a good discharge for the same, without the concurrence of the assignor. [emphasis added] The requirements for a statutory assignment were discussed in the High Court decision ofSalim Anthony v Sumitomo Corp Capital Asia Pte Ltd and others and another application[2004] 3 SLR(R) 331, where Lai Siu Chiu J observed (at [91]) that compliance with s 4(8) of the CLA was not the only legal requirement. It was emphasised that the notice of assignment must also be clear and unambiguous. In the subsequent decision ofCooperatieve Centrale Raiffeisen-Boerenleenbank BA (trading as Rabobank International), Singapore Branch v Motorola Electronics Pte Ltd[2010] 3 SLR 48 (Cooperatieve Centrale v Motorola”), Lai J acknowledged (at [101]) that “what constitutes adequate notice must depend on the context of each case”. 53     Apart from that, in approaching the issue of whether there was a valid notice of assignment, it must be acknowledged that there is no prescribed form of notice. There is no requirement for the notice to be embodied in a separate document for the specific purpose of notifying the debtor. This was emphasised in the High Court decision ofLanxess Pte Ltd v APP Chemicals International (Mau) Ltd[2009] 2 SLR(R) 769, where Andrew Ang J observed (at [8]) that the fact of assignment may be implicitly recorded and it would suffice for information relative to the assignment to be conveyed to the other contracting party in writing. 54     In the present case, the Plaintiffs relied on the 1 October 2012 letter as being the notice of assignment. For ease of reference, the main text of the 1 October 2012 letter is reproduced below:[note: 23] Sale of Business Thank you for all your support in making the I Can Read franchise a success. As you may know, we havesold our businessin Singapore to Total English Learning Global Pte Ltd. With immediate effect,please pay the Royalties, Marketing Fee, purchase of books and resources to “Total English Learning Global Pte Ltd”. ... Once again, thank you for your support and we look forward to your continued support to Total English Learning Global Pte Ltd,the new owner. [emphasis added] It was undisputed that the 1 October 2012 letter was sent to Kaske, Jennifer and Lum. The 1 October 2012 letter was signed off by Antony as Director of TLS. 55     In my view, the phrase “sold our business” was inherently vague in so far as it was capable of supporting multiple interpretations. From one perspective, the sale of the business could have been achieved through a transfer of assets belonging to TLS, presumably including the franchise agreements, to TELG. From another perspective, the sale of the ICR business could also have been carried out by TELG acquiring the shares of TLS. The latter scenario involving a transfer of shares would not be entirely inconsistent with the direction to pay the royalties, marketing fees and other payments to TELG. In the event that TELG had acquired the shares of TLS, TELG would be the parent company and would be entitled to receive payments on behalf of TLS. Finally, the reference to TELG as being the “new owner” was also unclear in so far as it was capable of supporting either scenario. 56     Looking at the 1 October 2012 letter as a whole, I was of the view that the requirement for a notice of assignment to be clear and unambiguous was not satisfied. In fact, it was recognised that such a requirement would not be met if the language of the notice was equally capable of a contrary interpretation (Cooperatieve Centrale v Motorolaat [97]). As explained above, the 1 October 2012 letter was capable of supporting multiple interpretations due to the vague language used. Any reference to the franchise agreements, which were the subject matter of the assignment, was also conspicuously absent from the 1 October 2012 letter. It was almost as if the parties to the deed of assignment did not wish the other franchisees to know the exact mechanism by which the sale of the ICR business was carried out. 57     In my judgment, the adequacy of a notice of assignment must also be considered within the context and circumstances of each case. The 1 October 2012 letter was preceded by the 25 July 2012 email, where Annabel made the following statements:[note: 24] Total Literacy has taken a big step forward and we are pleased to advise that we havechanged the corporate structure of the business by expanding our shareholder base. Ournew shareholders are actually majority shareholdersand we are excited in anticipation of forging new directions together with them. ... [emphasis added] The 25 July 2012 email suggested that the incoming franchisors had acquired the business by acquiring shares in TLS. There was no mention of any assignment of the ongoing franchise agreements. In fact, reading both the 25 July 2012 email and the 1 October 2012 letter together, the more likely interpretation would be that of an acquisition of the business by way of a share transfer. Up to the point in time when the 1 October 2012 letter was sent to Kaske, Jennifer and Lum, there was no attempt made by either TLS or TELG to clarify or correct the misleading statement made by Annabel in the 25 July 2012 email. Therefore, looking at the evidence as a whole, I was of the view that the 1 October 2012 letter was not a valid notice of assignment. 58     The parties had further communications after the 1 October 2012 letter and these exchanges could have been reduced into writing. Under such circumstances, these written further communications could very well constitute a valid notice of assignment under s 4(8) of the CLA. Nevertheless, both parties did not make any arguments to this effect and the Plaintiffs’ pleaded case was confined to the 1 October 2012 letter being relied upon as the notice of assignment. I therefore confined my observations to the 1 October 2012 letter for the purposes of ascertaining whether there was a valid notice of assignment. As discussed above, the 1 October 2012 letter did not fulfil the requirements of being clear and unambiguous for it to be regarded as a valid notice of assignment. The “no-assignment” clause 59     Apart from the general issues concerning the validity of the assignment that affected all the Defendants, there was a specific issue which concerned only D6 and D7. This was the “no-assignment” clause incorporated into their respective franchise agreements with TLS. Both clauses were worded exactly the same and were in the following terms:[note: 25] 26.NO ASSIGNMENT This Agreement shall not be assignable or transferable by any party, unless otherwise agreed to by the other party in writing, which agreement shall not be unreasonably withheld. On this basis, it was argued on behalf of D6 and D7 that the “no-assignment” clause would prohibit the assignment of even the benefit of the contract and any purported assignment in the absence of the other contracting party’s consent would be invalid. The House of Lords decision ofLinden Gardens v Lenestawas cited in support of this proposition. 60     In response, the Plaintiffs relied on the Court of Appeal decision ofJubilee Electronics Pte Ltd and others v Tai Wah Garments and Knitting Factory Pte Ltd[1996] 1 SLR(R) 352 (“Jubilee Electronics v Tai Wah”), where an assignment of a lease was held to be valid in spite of a clause in the lease agreement prohibiting any such assignment without the consent of the landlord. On this basis, the Plaintiffs argued that an assignment in breach of a “no-assignment” clause did not render the assignment void but merely provided an opportunity for the other contracting party to terminate the agreement. It was further submitted that D7 did not exercise its right to terminate the agreement as it had continued to receive ICR materials and performed its obligations under the agreement. 61     I was of the view that the purported assignment from TLS to TELG was wholly ineffective in the light of the “no-assignment” clause in D6 and D7’s franchise agreements. The Plaintiffs’ reliance onJubilee Electronics v Tai Wahwas misconceived given that it was a case dealing with the assignment of a lease. InLinden Gardens v Lenesta, a similar argument was raised to the effect that the assignment of a leasehold term in breach of a covenant against assignment was effective to vest the term in the assignee. Lord Browne-Wilkinson, in tracing the differences in approach between the assignment of property rights and contractual rights, made the following observations at 109: ... The law became settled that an assignment [of a lease] in breach of covenant gave rise to a forfeiture, but pending forfeiture the term was vested in the assignee. In contrast, the development of the law affecting the assignment of contractual rights was wholly different. It started from exactly the opposite position, viz., contract rights were personal and not assignable. Only gradually did the law permitting assignment develop ... He concluded that it was therefore not surprising that the law applicable to the assignment of contractual rights would differ from that applicable to the assignment of leases (at 109). 62     In arriving at the conclusion that the assignment of a lease was valid in spite of the covenant not to assign without the consent of the landlord, the Court of Appeal inJubilee Electronics v Tai Wahrelied on English authorities such asWilliams v Earle(1868) LR 3 QB 739 andOld Grovebury Manor Farm Ltd v Seymour (W) Plant Sales & Hire Ltd (No 2)[1979] 1 WLR 1397. These authorities were also cited by Lord Browne-Wilkinson inLinden Gardens v Lenesta. However, both cases dealt with the assignment of leases and the legal principles governing the assignment of contractual rights differ from those applicable to the assignment of property rights. 63     Moving on, counsel for the Plaintiffs, Mr Mark Goh (“Mr Goh”), highlighted that the House of Lords decision ofLinden Gardens v Lenestawas not binding on the local courts. He submitted that in the absence of any binding local authority on the legal effect of such “no-assignment” clauses, I was free to, and should, in fact, depart from the English position set out inLinden Gardens v Lenesta. 64     In my view, cl 26 of D6 and D7’s franchise agreement was drafted in a straightforward and unambiguous manner. The franchise agreement shall not be assignable or transferred by any party unless otherwise agreed to by the other party in writing. Clearly, neither TLS nor TELG obtained the consent of D6 and D7. In the circumstances, the assignment would be ineffective. As it was held inLinden Gardens v Lenesta, an attempted assignment of contractual rights in breach of a contractual prohibition, as in the present case, would be “ineffective to transfer such contractual rights” (at 108). Lord Browne-Wilkinson regarded the law as being “satisfactorily settled” and he went on to make the following observation at 108: ... If the law were otherwise, it would defeat the legitimate commercial reason for inserting the contractual prohibition, viz., to ensure that the original parties to the contract are not brought into direct contractual relations with third parties. Although Mr Goh urged me to depart from the English position set out inLinden Gardens v Lenesta, there was no reason to suggest why the legal reasoning adopted therein would be inapplicable to the local context. 65     I was also unable to accept the Plaintiffs’ argument that D6 and D7 had somehow waived their rights to terminate the franchise agreement when they elected to continue receiving ICR materials and running the ICR centre. The purported assignment was legally ineffective in so far as D6 and D7’s consent in writing had not been sought. It was surely within the rights of D6 and D7 to treat the assignment as invalid given that their consent had not been obtained and to continue performing the contract on the basis that TLS was still the contracting party. There was no argument to suggest that D6 and D7’s actions in continuing with the contract could be regarded as a manifestation of their consent to the assignment for the purposes of cl 26 of the franchise agreement. In the light of the above, the purported assignment from TLS to TELG was invalid.",
        "The claim in S 420/2013": "66     In S 420/2013, it was the Plaintiffs’ pleaded case that D8 breached cl 13 of the franchise agreement when it failed to comply with the procedure stipulated therein after the expiry of the franchise agreement on 26 October 2012. 67     In response, D8 argued that there had been a variation of the term of the franchise agreement from ten years to one in perpetuity. This variation supposedly took place in 2008 when Lum was in the process of acquiring D8. Lum stated that the then managing director of TLS, Allty, had agreed to vary D8’s franchise agreement by waiving the ten-year period. A handwritten note that was purportedly initialled by Allty was adduced as evidence. 68     Initially, there was some concern about whether Allty had the requisite authority to vary D8’s franchise agreement on behalf of TLS. Antony had sent an email to Lum dated 2 December 2012, where he had stated:[note: 26] Regretfully we have no record of any agreement between you and Allty. Allty had no power to make agreements on behalf of TLS. I am sorry but this means there is no agreement. ... Nevertheless, in the course of the trial, it became clear that the Plaintiffs were not entirely in agreement with Antony’s position that Allty did not have the authority to enter into agreements on behalf of TLS. In fact, during the course of cross-examination, Tan stated unequivocally that he did not agree with Antony in relation to this issue. In my judgment, Antony’s argument was a non-starter as it was undisputed by all parties that Allty was the managing director of TLS at the material time. In the absence of any evidence to the contrary, Allty must be regarded as having the requisite authority to enter into binding agreements on behalf of TLS. 69     I was of the view that there was an oral variation of the contract as stated by Lum. First, Lum’s evidence with regard to the oral variation of the franchise agreement by Allty remained largely unrebutted even under cross-examination. Second, Lum produced the handwritten note to support his position that the franchise agreement had been varied to an open-ended term. In that note, it was stated that the term of the franchise agreement would be “open ended for the current buyers of the Goldhill Centre”.[note: 27]There was also a further qualifier that the extension was not to be “granted to anyone/entity buying from them”.[note: 28]The period of ten years for the further term upon the expiry of the franchise agreement was also struck off and replaced with “N/A”. Both variations were accompanied by an initial which was purportedly Allty’s. During cross-examination, when Tan was asked to compare the initials in the handwritten note with another specimen of Allty’s signature, he agreed that they looked “similar”. 70     More significantly, while the parties were having a dispute over whether the term of D8’s franchise agreement had been varied, the handwritten note produced by Lum was brought to the attention of Allty. In an email to Chan dated 24 June 2013, Allty stated the following in relation to the handwritten note:[note: 29] ... I was told by Jennifer that there had been a meeting, which included Wai Onn’s mother I believe, at which I had agreed to an open term for Wai Onn’s franchise license. Initially I was unable to recall the meeting, but eventually did come to recall a meeting during which the issue of the franchise agreement term was discussed. Jennifer then informed me that I had in factsigned a document that was called a Deacon’s Addendum to that effect. I could not remember this, but she followed up the phone call with an email containing the Deacon’s Addendum thatpurports to have my initials reflecting an open term clause. The email also had a letter for me to sign. To the best of my knowledge, I cannot remember a new franchise agreement ever being executed for Wai Onn’s centre or receiving any countersigned franchise agreement concerning the open-ended term. [emphasis added] In this email, it is obvious that when Allty was referred to the handwritten note with his purported initials, he did not deny that the initials were his. In fact, Allty chose to emphasise the fact that there was no new franchise agreement entered into by the parties. In my view, if the handwritten note or the purported initials were doctored or forged, a reasonable person in Allty’s position would have given a straightforward denial that there was either no such document or that the initials were not made by him. Allty, however, chose to side-step the issue of the handwritten note by highlighting the fact that there was no formal agreement concerning the open-ended term. 71     In the circumstances, given the substantial factual dispute between the Plaintiffs and D8, it would have been prudent for the Plaintiffs to call Allty to give evidence in the present proceedings. However, the Plaintiffs took the position that D8 ought to have called Allty as a witness in so far as D8 was the party asserting that such an oral variation existed. Unsurprisingly, D8 adopted the contrary position and argued that the Plaintiffs should be responsible for calling Allty given that the evidential burden had shifted to the Plaintiffs after Lum’s testimony. 72     In my opinion, the Plaintiffs should have called Allty to give evidence on their account of events. As mentioned above, Lum’s evidence on how Allty had agreed to a variation of the term of the franchise agreement remained largely unrebutted. The handwritten note purportedly initialled by Allty was also produced to support Lum’s account of events. Coupled with the fact that Allty did not deny that the initials were his when the handwritten note was brought to his attention, it would have been prudent for the Plaintiffs to call Allty as a witness to the present proceedings so as to allow him to give his side of the story. 73     In the absence of any evidence to the contrary, I was prepared to accept that the handwritten note was initialled by Allty and there had been a variation of the franchise agreement to an open-ended term. At this juncture, I note that the Plaintiffs also attempted to suggest that they encountered difficulties in trying to contact Allty. The Plaintiffs stated that they could only communicate with Allty via Antony or Annabel. I could not accept this part of their evidence as it was apparent that the Plaintiffs did, in fact, manage to contact Allty directly without going through Antony or Annabel. In an email dated 18 June 2013 from Chan to Antony, it was stated that she needed Antony’s “assistance to drop a note to Allty to inform him that [she] will be calling him”.[note: 30]Subsequently, Allty replied via email directly to Chan on 24 June 2013.[note: 31]This was the email in which Allty emphasised that there was no formal agreement to extend the term of D8’s franchise agreement as discussed above. In the circumstances, I was not convinced that the Plaintiffs were not able to contact Allty for the purpose of inviting him to give his evidence in the present proceedings. This was also consistent with Tan’s evidence that the Plaintiffs had not tried to contact Allty after the email dated 24 June 2013. Tan clarified that it was not a case where they had tried to contact Allty but there was no response. 74     Finally, I note the presence of an entire agreement clause in D8’s franchise agreement, where it was stated that:[note: 32] This Agreement, together with each Schedule attached hereto, constitutes the entire agreement between the parties hereto with respect to the subject matter hereof and there are no representations, understandings or agreements relative hereto which are not fully expressed herein.No variation, alteration or modification of any of the terms of this Agreement shall be of any effect unless evidenced in writing signed by or on behalf of each of the parties hereto by a duly authorised representative. [emphasis added] Both parties did not make any submissions on the effect of this clause on the oral variation by Allty or the handwritten note purportedly bearing Allty’s initials. I therefore say no more about this issue.",
        "The counterclaims in S 420/2013": "75     D8 had two main counterclaims against the Plaintiffs in S420/2013: (a)     breach of the non-disclosure agreement (“the NDA”); and (b)     fraudulent misrepresentation. Breach of the non-disclosure agreement 76     In December 2012, the parties were in discussions regarding a potential sale of D8 to the Plaintiffs. For the purpose of allowing the Plaintiffs to make an offer for the acquisition of D8, Tan had requested information concerning the details of the lease agreement, the staff list and costs. In an email dated 31 December 2012, Lum replied that he would only release the information requested on the condition that Tan agreed to keep the information strictly confidential and not to use it for any other purpose.[note: 33]This was followed by an email dated 2 January 2013 where Tan attached a copy of the NDA and informed Lum to send a signed copy back to him.[note: 34]On the same day, Lum replied with the signed NDA attached and the information requested by Tan. 77     In this respect, D8 referred to cl 7 of the NDA which stated that the parties agreed “to negotiate in good faith with each other” for the acquisition.[note: 35]With regard to the term of the NDA, D8 referred to cl 8 of the NDA, reproduced as follows:[note: 36] This Agreement shall become effective on the date written above [ie, 2 January 2013] and shall remain in effect until the earlier of: (i) termination bywritten agreement of both parties, or (ii)twelve monthsfrom the date written above. [emphasis added] On this basis, D8 submitted that the NDA gave rise to a one-year moratorium on the commencement of legal proceedings by either party. It was therefore argued that the Plaintiffs’ act in commencing S 420/2013 against D8 amounted to a breach of the NDA. 78     In response, the Plaintiffs submitted that the one-year period only pertained to the protection of confidential information and did not extend to the agreement to negotiate in good faith. It was further argued that the parties to the NDA did not intend to negotiate in good faith for twelve months and the argument raised by D8 was merely an afterthought for the purpose of vexing the Plaintiffs. 79     InHSBC Institutional Trust Services (Singapore) Ltd (trustee of Starhill Global Real Estate Investment Trust) v Toshin Development Singapore Pte Ltd[2012] 4 SLR 738 (“HSBC v Toshin”), the Court of Appeal had the opportunity to explore the content of an express agreement between contracting parties to negotiate in good faith. On the facts of that case, the lease agreement incorporated a rent review mechanism, which stated that the parties “shall in good faith endeavour to agree on the prevailing market rental value of the Demised Premises” prior to the appointment of the valuers (at [6]). At the outset, the Court of Appeal drew a distinction between pre-contractual negotiations and negotiations between parties who were already in an existing relationship (at [37]). In the English decision ofWalford v Miles[1992] 2 AC 128, Lord Ackner, in delivering the leading judgment of the House of Lords, observed that the concept of a duty to carry on negotiations in good faith was inherently repugnant to the adversarial position of the parties when involved in negotiations (at 138). Lord Ackner further stated that a duty to negotiate in good faith was therefore unworkable in practice as it was inherently inconsistent with the position of a negotiating party (at 138). The Court of Appeal inHSBC v Toshinsought to reason that the observations inWalford v Milesmay not be strictly applicable to a situation where parties to an existing relationship commit themselves to a mechanism to resolve how the rental was to be set. Unlike parties who were merely in pre-contractual negotiations, the Court of Appeal observed that the landlord and tenant were “not free to simply walk away from the negotiating table for no rhyme or reason” (at [37]). 80     Returning to the facts in the present case, while D8 had referred to the Court of Appeal decision inHSBC v Toshin, there were no arguments on the issue of whether the present case fell within the category of pre-contractual negotiations, as in the case ofWalford v Miles, or the category of negotiations within the framework of an existing relationship, as in the case ofHSBC v Toshin. The Plaintiffs, in defending the counterclaim for breach of the NDA, did not refer to the decision ofHSBC v Toshin. 81     Even if it was accepted that cl 7 of the NDA was capable of having some form of legal content, I am not prepared to accept D8’s submissions that it would give rise to a moratorium on the commencement of all legal proceedings. InHSBC v Toshin, the Court of Appeal observed (at [45]) that at its core, the concept of good faith encompasses the threshold subjective requirement of acting honestly, as well as the objective requirement of observing accepted commercial standards of fair dealing in the performance of the identified obligations. It was elaborated that this encompassed a duty to act fairly, having regard to the other party’s legitimate interests. More importantly, the Court of Appeal held (at [49]) that what constituted reasonable commercial standards of fair dealing in the context of an express contractual duty of good faith would depend heavily on “the commercial nature and purpose of the contract in question”. 82     Applying the principles to the present case, it was reasonably clear that the main purpose of the NDA was to protect the confidentiality of the information supplied by D8 to TELG. Clause 7 of the NDA stated that the parties agreed “to negotiate in good faith with each other” for the acquisition of D8 by TELG.[note: 37]In this respect, D8’s interpretation of cl 7 does not accord with commercial sense and reality in so far as it sought to prevent any party from commencing legal proceedings regardless of the stage and progress of the negotiations. It would be highly unsatisfactory if parties were to reach a deadlock in negotiations one month into the term of the NDA and then be precluded from commencing legal proceedings when that was the only way in which the dispute could be resolved. It must not be overlooked that at the point in time when the NDA was entered into, both parties were already locked in a dispute over whether the term of D8’s franchise agreement had been varied to an open-ended term. In the circumstances, I was unable to accept D8’s submission that the parties to the NDA intended to forbear from suing for a period of one year from the specified date (ie, 2 January 2013). While the commencement of legal proceedings could, in certain circumstances, give rise to a breach of an express contractual duty of good faith, the finding of such liability would depend heavily on the facts of the particular case. This was quite different from D8’s argument that the contents of cl 7 of the NDA could give rise to a blanket moratorium on the commencement of all legal proceedings regardless of the circumstances. 83     There was nothing amiss in the course of negotiations between D8 and TELG that could give rise to a breach of the duty to negotiate in good faith. At the point in time when TELG commenced S 420/2013 against D8, it was clear that the negotiations were not making headway. Both parties had fundamental disagreements in relation to the valuation of D8 and the price offered by TELG. In an email dated 7 April 2013, Lum informed Chan that the offer price by TELG was “still too low”.[note: 38]Apart from the issue concerning the offer price, Lum also brought up two other “commercial points” regarding the term sheet. The first was in relation to the due diligence process while the second concerned the proration of royalties on the part of D8. Lum concluded by stating that the term sheet had expired. Given that the negotiations between TELG and D8 had practically broken down at that juncture, the commencement of S 420/2013 to resolve the outstanding dispute between the parties should not give rise to any breach of the express contractual duty to negotiate in good faith. I therefore rejected D8’s arguments and dismissed the counterclaim in relation to the breach of cl 7 of the NDA. Fraudulent misrepresentation 84     D8’s other counterclaim against the Plaintiffs is in the tort of fraudulent misrepresentation. D8 relies on two separate representations that were made by the representatives of the Plaintiffs: (a)     the Plaintiffs’ instructions to Yeo to inform Lum not to worry and that “Antony and Annabel have set time aside to review [D8’s] franchise contract in June/July”; (b)     Chan’s email to Lum dated 15 November 2012 where she made the following representations:[note: 39] (e)    ... TELG will enter new franchise agreement with your company [ie, D8]. Can you come by our office for a discussion on the franchise renewal and the issue which you have written below? D8 argued that these representations were made in order to lull Lum into not exercising the right to renew the franchise agreement for a further five years pursuant to cl 4 of the agreement. It was submitted that D8 suffered the loss of revenue stream for five years. 85     The Court of Appeal inPanatron Pte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 held at [14] that the essential elements of the tort of fraudulent misrepresentation were as follows: (a)     a representation of fact made by words or conduct; (b)     the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff; (c)     the plaintiff acted upon the false statement; (d)     the plaintiff suffered damage by so doing; and (e)     the representation must be made with the knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. Looking at the evidence as a whole, I was not satisfied that the fifth element was made out. At the point in time when the representations were made, both parties were still in the process of engaging in negotiations. Lum took the position that the franchise agreement had been varied by Allty while TELG was of the view that it required further documents to ascertain if the term of the franchise agreement had, in fact, been varied. Given that the entire situation was in a state of flux, there was no evidence to suggest that the representation concerning the review of the franchise agreement was made with the knowledge that it was false or in the absence of any genuine belief that it was true. In an email dated 14 May 2012, Annabel asked for suggestions on how to deal with Lum’s queries regarding the term of the franchise agreement. She went on to state that she would “prefer to ignore it for two months”.[note: 40]In the circumstances, given that this email was sent after the said representation was made to Lum on 6May 2012, there was no reason to suggest that the representation was made in the absence of any genuine belief that it was true. A delay of two months from 14 May 2012 would effectively mean that Annabel would deal with the matter in July, which was consistent with the representation made to Lum. In the circumstances, I was not satisfied that the representation concerning the review of the franchise agreement by Annabel and Antony could give rise to fraudulent misrepresentation. 86     With regard to the second representation made by Chan in the email dated 15 November 2012, there was no evidence to suggest that it was made fraudulently. At that point in time, the Plaintiffs took the position that Lum’s contract had already expired on 26 October 2012 and this was consistent with their request to enter into a new franchise agreement with D8. In fact, on the very same afternoon the email was sent by Chan, Antony wrote to Lum to reiterate the point that there was no variation of the franchise agreement and that Allty, being a minority shareholder and employee of TLS, did not have the authority to vary the term of the franchise agreement.[note: 41]In that email, Antony concluded by advising Lum to deal with the new management team. This was consistent with Chan’s request for Lum to drop by her office for the purpose of discussing the renewal of the franchise. More importantly, Lum also acknowledged in the course of cross-examination that he did not accept Chan’s invitation. Lum was of the view that they were not the right people to talk to. In the circumstances, given that Lum did not accept Chan’s offer to negotiate and enter into a new franchise agreement, Lum could not now turn around and allege that the offer was made fraudulently. The fact that the Plaintiffs subsequently issued a letter of demand against D8 on 7 December 2012 was also explicable as Lum had failed to respond to Chan’s offer. I was not satisfied that Chan’s offer to Lum was wilfully false or made in the absence of any genuine belief that it was true.  D8’s claim for fraudulent misrepresentation was therefore rejected. 87     D8 also brought a counterclaim against the Plaintiffs for wrongful repudiation or termination of the franchise agreement. Nevertheless, both parties did not make any substantive arguments on this particular issue during the trial. Given that I have already found in favour of D8 in terms of the oral variation of the franchise agreement, I therefore need say no more about this issue.",
        "The claims in S 822/2013": "88     I will now deal with the claims that were brought by the Plaintiffs against the Defendants in S 822/2013. For ease of reference, the claims could be categorised as follows: (a)     In relation to D2–D8: (i)       breach of the non-compete clause in the franchise agreements; (ii)       breach of the non-solicitation clause in relation to the customers; (iii)       breach of the non-solicitation clause in relation to the employees; and (iv)       breach of the confidentiality clause. (b)     In relation to D1: (i)       tort of inducing breach of contract. (c)     In relation to the Defendants (ie, D1–D8): (i)       tort of conspiracy by unlawful means. I will deal with these claims individually before turning to the counterclaims by the Defendants against the Plaintiffs. Breach of the non-compete clause 89     The main dispute concerning the alleged breach of the non-compete clause was in relation to whether the clause should be struck down under the doctrine of restraint of trade. In this respect, D2–D8 argued that the Plaintiffs have not adduced any evidence of a legitimate proprietary interest sought to be protected by the non-compete clause. It was further submitted that the Plaintiffs also failed to demonstrate how the non-compete clause was reasonable in the interests of the parties and in the interests of the public. On this basis, D2–D8 argued that the non-compete clause should be struck down by the court. 90     InCLAAS Medical Centre Pte Ltd v Ng Boon Ching[2010] 2 SLR 386 (“CLAAS Medical v Ng”), the Court of Appeal set out the following general principles applicable to covenants in restraint of trade at [44]: Therefore, all covenants in restraint of trade areprima facievoid. However, they can be held to be valid if the party seeking to rely on the restrictive covenant can show that, firstly, the clause concerned is reasonable in the interests of theparties and, secondly, the clause is also reasonable in the interests of thepublic. Additionally, there must be a legitimate proprietary interest to be protected. As was held inMan Financial, the court will only enforce the covenant if it goes no further than necessary to protect the legitimate interests. There cannot be a bare and blatant restriction of the freedom to trade ... Moreover, even where a legitimate proprietary interest is shown, the court will ensure that the covenant in restraint of trade goesno further than what is necessaryto protect the interest concerned. [emphasis in original] The party seeking to enforce a covenant in restraint of trade bears the burden of proving that it has a legitimate proprietary interest to be protected by the covenant and that the covenant is reasonable in the interests of the parties and in the interests of the public. In the application of these legal principles, the court has to adopt a contextual approach and consider the specific circumstances of each case. Although there is no one single decisive factor, the courts have generally approached this issue by considering three main factors: the trade restrained, the geographical area and the duration of the restraint. 91     As mentioned earlier, there were differences in the wording adopted in the non-compete clauses among the respective franchise agreements. I will first deal with the non-compete clause found in D2, D3 and D4’s franchise agreements. For ease of reference, the entire clause is reproduced as follows:[note: 42] On expiry or termination of this Agreement, the Franchisee shall not for a period oftwenty four (24) monthsthereafter be engaged in or be employed by or concerned or interested directly or indirectly in any business which competes with the Business within the Territory, or solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in thetwenty four (24) monthsperiod prior to termination. The Franchisee shall also not, either directly or indirectly, for itself or on behalf of or in conjunction with any other person, partnership or corporation, employ or solicit for the purpose of employing any of the Franchisor’s employees or former employees during the period of this Agreement and, for a period oftwenty four (24) monthsafter the expiry or termination of this Agreement, shall not also employ or solicit for the purpose of employing any employees or former employees who were employed in the Business by the Franchisee or the Franchisor or any other Franchisee of the Franchisor or any director or officer of the Franchisor or any of its Other Franchisees, save for any such employee entering into the employ of the Franchisee in response to any public recruitment advertisement. [emphasis in original] Although the geographical scope of the clause above was restricted to “within the Territory”, there was no definition of “Territory” in the franchise agreement. “Business” was defined in the interpretation clause as follows:[note: 43] “Business” means the [ICR] Centre conducted by the Franchisee in the Region pursuant to this Agreement including the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the System as defined below. 92     The non-compete clause in D6 and D7’s franchise agreements was the same as that found in D2, D3 and D4’s franchise agreements but in D6 and D7’s franchise agreements, “Territory” was defined as “the geographical area of Singapore”. The term “Business” was defined as follows:[note: 44] “Business” means the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the System as defined below ... 93     Finally, the non-compete clause in D5 and D8’s franchise agreements differed from the rest as there was no reference to any geographical scope in the clause itself:[note: 45] On expiry or termination of this Agreement, the Franchisee shall not for a period of twelve (12) months thereafter be engaged in or be employed by or concerned or interested directly or indirectly in any business which competes with the Business, or solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in thetwelve (12) monthperiod prior to termination. The Franchisee shall also not, either directly or indirectly, for itself or on behalf or in conjunction with any other person, partnership or corporation, employ or solicit for the purpose of employing any of the Franchisor’s employees or former employees during the period of this Agreement and, for a period oftwelve (12) monthsafter the expiry or termination of this Agreement, shall not also employ or solicit for the purpose of employing any employees or former employees who were employed in the Business by the Franchisee or the Franchisor or any other franchisee of the Franchisor or any director or officer of the Franchisor or any of its franchisees. Curiously, although there was no reference to “Territory” in the non-compete clause, “Territory” was defined in cl 1.1 of the franchise agreement to mean “the geographical area of Singapore”.[note: 46] 94     By way of summary, the differences which existed between the non-compete clauses are summarised below: FranchiseeGeographical ScopeDurationD2, D3 and D4Non-compete clause includes the term “Territory”. However, “Territory” is not defined in the franchise agreement.24 monthsD6 and D7Non-compete clause includes the term “Territory”. “Territory” is defined as the “geographical area of Singapore”.24 monthsD5 and D8“Territory” is defined as the “geographical area of Singapore”. However, the non-compete clause does not include the term “Territory”.12 months   The non-compete clause in D2, D3, D4, D5 and D8’s franchise agreements had an unlimited geographical scope. On that basis alone, I was of the view that the scope of the clause was far too wide and that it had gone beyond what was necessary to protect the interest concerned. In the circumstances, the clause should not be upheld by the court. 95     In respect of the non-compete clause in D6 and D7’s franchise agreements, the geographical scope was restricted to Singapore and the duration of the restraint was limited to 24 months after the expiry or termination of the agreement. In the circumstances, I would uphold the non-compete clause as being reasonable in the interests of the parties. In arriving at this conclusion, I took into account the fact that the franchise agreement in the present case was essentially a business contract entered into by corporate entities. This was not an employment contract between a corporate entity and an individual. There was no evidence to suggest any inequality in bargaining power between the contracting parties. 96     Apart from that, both clauses were also limited to the business of providing courses of English literacy instruction, as well as educational programmes, products and other resources and services in accordance with the operation manual. There was no evidence to suggest that D6 and D7 were not able to trade outside the scope of the trade restraint. The courts generally adopt a relatively stricter approach towards restraint of trade covenants in the employment context (Man Financial (S) Pte Ltd (formerly known as E D & F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008] 1 SLR(R) 663 at [81]). 97     As mentioned above, the franchise agreement was effectively a business contract entered into by corporate entities. Kaske was trained in engineering and Jennifer was a practising lawyer at that point in time. In the circumstances, it was unlikely that the non-compete clause would have a significant adverse impact on their livelihood. I therefore held that the non-compete clause in D6 and D7’s franchise agreements to be reasonable in the interests of the parties. 98     In respect of the issue of whether the non-compete clause was reasonable in the interests of the public, the Defendants relied on three main arguments. First, it was submitted that the non-compete clause was contrary to the interests of the public given that the education industry was one of the pillars of the Singapore economy. Second, it was argued that the Plaintiffs would effectively be allowed to monopolise the phonics business in the event that the clause was upheld. This would in turn restrict the market’s access to education services. Third, it was highlighted that the customers were young children and enforcing the restrictive covenant would mainly “serve to upset the children”. I was unable to accept these arguments as there was no reason why the education industry should be treated differently from all other industries. The attempt to characterise the Plaintiffs as having a monopoly over the phonics business in Singapore was also unsupported by any evidence. Education is also not all about phonics and language and certainly not all about the English language in any case. 99     The Plaintiffs did not put forward any arguments on the doctrine of severance, at least in relation to the non-compete clause in D2, D3, D4, D5 and D8’s franchise agreements. I therefore did not have to deal with this issue. 100    Having found that the non-compete clause in D6 and D7’s franchise agreements ought to be upheld by the court, the only remaining issue was whether D6 and D7 had breached this clause. D7 is operating a MES centre and the MES system is a system of teaching English through phonics. In this regard, D7’s running of the MES centre would therefore fall within the scope of the non-compete clause. 101    With respect to D6, things were slightly more complicated. Unlike D7, D6 is now a dormant company because it entered into an agreement to sell the business to D1. In other words, D6 was no longer actively trading and the MES centres under Kaske’s control were being operated by D1 instead. It was therefore argued that D1 was not a contracting party to the franchise agreements and could not be held liable for breach of the clauses in the franchise agreements. In my view, such an argument could not be allowed to stand as that would be akin to giving contracting parties a free hand in using the corporate vehicle as an instrument of fraud to avoid existing obligations. On the facts of the present case, Kaske had relied on D1 as a corporate vehicle to avoid being bound by the clauses of the franchise agreement. In a bid to further distance himself from D1, Kaske interposed multiple parties in the chain of ownership. Nevertheless, it was clear from the facts that these parties were mere nominees of Kaske. In fact, David, the director of D1, went so far as to concede that he was merely a “puppet” of Kaske. Although Kaske attempted to justify the setting up of D1 by stating that he was merely trying to “protect” and “ring fence” his existing investments in D2–D6, that did not change the fact that Kaske was effectively using the corporate vehicle of D1 to surreptitiously evade the existing obligations imposed on D2–D6. In the circumstances, I was of the view that this was an abuse of the corporate vehicle, which justified the lifting of the corporate veil to extend liability to D1. Breach of the non-solicitation clause in relation to the customers 102    The parties did not make any submissions on whether the non-solicitation aspect of the restrictive covenant should be struck down. All arguments concerning the doctrine of restraint of trade were made in the context of the non-compete clause, as opposed to the non-solicitation clause. I therefore proceeded on the basis that both parties did not contest the fact that the non-solicitation aspect of the clause would be upheld by the court. 103    With the exception of the duration of restraint, the non-solicitation of customers clause was worded similarly across D2–D8’s franchise agreements:[note: 47] On expiry or termination of this Agreement, the Franchisor shall not for a period of twenty four (24) months [twelve (12) months in the case of D5 and D8] thereafter ... solicit for the purpose of a competing business the custom of any person firm or company that has been a customer of the Franchisee at any time in the twenty four (24) months [twelve (12) month in the case of D5 and D8] period prior to termination. In my judgment, there was sufficient evidence to prove that D2–D8 actively solicited their previous customers under the ICR system. The general tenor of the evidence throughout the course of the trial suggested that the shift from the ICR system to the MES system was meant to be as seamless and fuss-free as possible. Nicola Jane Smith (“Nicola”), a teacher who used to be employed by D3 and subsequently moved to D1 after the sale of the business from D3 to D1, gave evidence to the effect that a majority of the students in the classes remained the same. Apart from that, the schedule of classes and the respective teachers also remained largely unchanged after the switch to the MES system. 104    In a letter sent by MES to the parents of the students, it was stated that the fees structure and the curriculum would remain aligned after the switch. The parents were also promised that their children would remain in the same class, with the same teacher at the same designated day and time. This was consistent with the evidence given by Nicola. Apart from that, the parents were also expressly invited to convert to the MES programme. They were assured of a seamless transition and, to further sweeten the deal, the students who converted to the MES programme were promised free gifts and two free lessons.[note: 48]I was satisfied that the Defendants did actively solicit their previous students under the ICR system. Breach of the non-solicitation of customers clause was therefore established. For the avoidance of doubt, the observations in relation to the lifting of the corporate veil as set out above would also apply to the breach of the non-solicitation of customers clause. Breach of the non-solicitation clause in relation to the employees 105    Similarly as in the case of the clause prohibiting the solicitation of customers, the parties did not make any submissions concerning the legal principles set out inCLAAS Medical v Ng. Therefore, in spite of the fact that such clauses undoubtedly fell within the scope of covenants in restraint of trade, I proceeded on the basis that the parties did not dispute that the clause should be given effect to. 106    The parties paid little attention to the issue concerning the alleged solicitation of employees. The Plaintiffs’ written submissions were only two paragraphs long and it was briefly argued that the Defendants had solicited the teachers by “offering them the same timetable, same classes, same students, and at the same centre venue”. This was followed by a long extract of Nicola’s cross-examination to support the position that there was, in fact, a seamless transition from the ICR system to the MES system. 107    I observed that the evidence relied upon by the Plaintiffs in the paragraph above was probably more relevant to their claim for breach of the non-solicitation clause in relation to the customers. The fact that there was a seamless transition to the MES system was, at best, marginally relevant to the issue concerning the alleged solicitation of the employees. While it may have gone some way towards demonstrating that there were teachers who decided to switch to the MES system, the Plaintiffs failed to highlight any evidence relating to the act of solicitation that was allegedly undertaken by the Defendants. 108    With regard to the issue of what could be regarded as solicitation, Tan Lee Meng J, inWalton International Group (Singapore) Pte Ltd and others v Yau Kwok Seng Winston and another[2011] SGHC 144 at [45], cited the following extract from the New South Wales Supreme Court decision ofHellmann Insurance Brokers v Peterson[2003] NSWSC 242 at [11]–[12]: 11 The meaning of ‘solicitation’ is elucidated by a decision of Wood CJ at CL inR v Laws[2000] NSWSC 880 (2000) 50 NSWLR 96, at 98. His Honour, at [8] recorded the remarks of Spigelman CJ and Hidden J inR v Azzopardi, 1 October 1998, unreported, which in turn approved remarks of Stout CJ inSweeney v Astle[1923] NZLR 1198 at 1202 which I quote: (g)    The word ‘solicit’ is a common English word and it means in a simplified form, ‘to ask’. In various English dictionaries this simple meaning is given, but other simple words are also used to explain other meanings it possesses, such as ‘to call for’, ‘to make a request’, ‘to petition’, ‘to entreat’, ‘to persuade’, ‘to prefer a request’. 12 Whether an employee is soliciting a former client is not something which depends upon whether it is the employee who telephones or arranges to meet the former client, or the other way around. Rather,whether solicitation occurs depends upon the substance of what passes between them once they are in contact with each other. There is solicitation of a client by a former employee if the former employee in substance conveys the message that the former employee is willing to deal with the client and, by whatever means, encourages the client to do so. The same extract was referred to by Belinda Ang J in the earlier decision ofTan Wee Fong and others v Denieru Tatsu F&B Holdings (S) Pte Ltd[2010] 2 SLR 298. That was a decision concerning the solicitation of employees. 109    In my opinion, the Plaintiffs did not satisfy the burden of proving that the Defendants had engaged in any form of solicitation of the employees so as to give rise to a breach of the non-solicitation clause. The Plaintiffs’ reliance on the evidence demonstrating a seamless transition to the MES system was equivocal at best. There was no other evidence to suggest that that the Defendants had encouraged, persuaded or even asked the employees to shift to the MES system. In the circumstances, I was not satisfied that there was a breach of the non-solicitation clause in relation to the employees. Breach of the confidentiality clause 110    The Plaintiffs’ claim for breach of the confidentiality clause was based on the assertion that the following constituted confidential information within the scope of the franchise agreements: (a)     the student progress reports; (b)     the class registers; (c)     the teacher timetables; (d)     the fees structure; and (e)     the class timetables. 111    As with the covenants in restraint of trade, there were significant variations in the drafting of the confidentiality clauses across the different franchise agreements. There was, however, a common feature across all the franchise agreements. Information in the public domain was expressly excluded from the scope of confidential information. In D2–D4’s franchise agreements, this exclusion was found in the definition of “Confidential Information”:[note: 49] Confidential information means: (iv)   ... but does not include information which: (h)    at the time of first disclosure to the Franchisee isalready in the public domain; or (i)    after disclosure to the Franchiseebecomes part of the public domainotherwise than by disclosure in breach of the terms of this Agreement ... [emphasis added] D5–D8’s franchise agreements were slightly different in this aspect due to the absence of a specific clause defining confidential information. The scope of confidential information was set out within the confidentiality clause itself. The relevant portion of the confidentiality clause was as follows:[note: 50] … for the purposes of this Agreement, the terms of this Agreement and the attached Schedules, information contained in the Operations Manual and all other information and knowledge relating to the System and the conduct of the Business that isnot already in the public domainshall be deemed confidential … 112    InPH Hydraulics & Engineering Pte Ltd v Intrepid Offshore Construction Pte Ltd and another[2012] 4 SLR 36, I observed (at [46]) that the essence of information being confidential is that it is not freely available in the public domain. Information may therefore still be regarded as not being in the public domain even though a number of people know about it. Whether the information was published in a sufficiently widespread manner for it to lose its confidentiality depended on various factors such as (at [46]): ... the type of information, the section of public who have an interest in knowing about the information, the domain in which the publication occurred, the degree of publication in that domain, the form in which the information is published and the vigour with which the information is likely to be pursued within that domain ... Given the express reference to the “public domain” in D2–D8’s franchise agreements, the principles set out above were also applicable to the present case. 113    It was difficult to accept that the information concerning the fees structure and the timetables could be regarded as confidential information in so far as they were likely to have been part of the public domain. Such information would surely have been accessible to the customers (eg, the parents and students) of the ICR centre, or even to the prospective customers. On that basis, it should be excluded from the scope of confidential information as set out in the franchise agreements. A similar argument was raised in the High Court decision ofTrident Pharm Pte Ltd v Yong Pei Pei Tracey and another[2014] SGHC 59, where Choo Han Teck J observed that the prices were not confidential “since every patient who purchased the plaintiff’s products would have known what the prices were” (at [13]). Similarly, the fees structure and the timetables in the present case could not be regarded as being confidential in nature. 114    I therefore proceeded to consider the Plaintiffs’ claim for breach of the confidentiality clause in relation to the customer information, such as the student progress reports and the class registers. Unlike the fees structure and the timetables, these data were likely to be accessible only to a select group of individuals, such as the teachers and staff of the respective ICR centres. 115    The relevant portions of the confidentiality clause in D5–D8’s franchise agreements were as follows:[note: 51] ... not to at any time during the term of this Agreement nor at any time after its expiry or termination make use of or disclose, other than exclusively for the purpose of this Agreement, any information or trade secrets relating to the Business and the conduct thereof, the Intellectual Property or the System or any other confidential informationsupplied by or on behalf ofthe Franchisor and ensure that none of the Franchisee's employees make use of such information other than for such purpose ... [emphasis added] The customer information did not fall within the scope of information or trade secrets relating to the ICR system and neither was it confidential information supplied by or on behalf of the franchisor. In the circumstances, the contracting parties could not have intended for customer information to fall within the scope of protection of the confidentiality clause. It was more likely to be protected under the non-compete and non-solicitation covenants. 116    On the other hand, the definition of “Confidential Information” in D2–D4’s franchise agreements expressly included customer information:[note: 52] Confidential information means: (k)    … (c)    the transaction records and customer information; (xii)  … In so far as such transaction records and customer information did not become part of the public domain, they could be protected under the confidentiality clause of these franchise agreements. 117    Having established that such information was capable of being protected under the scope of confidential information, the next question would be to ascertain if there was unauthorised disclosure by the relevant Defendants. The obligation not to disclose such confidential information was encapsulated in cl 16.2 of D2–D4’s franchise agreements:[note: 53] The Franchisee must not: (1)    before or after the end of the Franchise disclose any Confidential Information to any person other than to employees of the Franchisee or to a Local Area Licensee to the extent necessary for the conduct of the Business; and (2)    after the end of the Franchise or after an assignment of the Franchise by the Franchisee, use any part of the Confidential Information. The Defendants did disclose the customer information to D1 for the purposes of enabling D1 to bring the students on board the MES system. Under cross-examination, David, the director of D1, agreed that there were about 4000 student records and that it would have been “very difficult” to put the information together. In that respect, David conceded that D1 had obtained the information from the Defendants’ ICR centres and that there was no way D1 could have put the information together in such a short period of time without doing so. On that basis, I arrived at the finding that D2–D4 had breached the confidentiality clause by disclosing customer information to D1. Tort of conspiracy by unlawful means 118    The Plaintiffs’ claim in conspiracy for unlawful means was based on the assertion that D1 had conspired with D2–D8 to injure the Plaintiffs’ legitimate business interests. It was further argued that D2–D8 had conspired to adopt a common stance – which was to deny that TELG was a party to the franchise agreement – after the 1 October 2012 letter was sent. The Plaintiffs alleged that the Defendants were, at the same time, in the process of secretly setting up D1 with David as the nominee. This was said to be for the purpose of enticing teachers and students from their respective ICR centres to shift to the MES system. 119    In response, the Defendants submitted that an allegation of conspiracy was extremely serious and thus required a higher level of proof than that required in a normal civil action. It was argued that the Plaintiffs failed to meet this high threshold. The Defendants also highlighted that it was not sufficient for the Plaintiffs to demonstrate that it was reasonably foreseeable that the Plaintiffs would or might suffer damage as a result of the Defendants’ acts. It was submitted that the Plaintiffs had to prove that the unlawful means and conspiracy were targeted or directed at the Plaintiffs. 120    InEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”), the Court of Appeal observed (at [112]) that the following elements had to be established in order to succeed in a claim for conspiracy by unlawful means: (a)     there was a combination of two or more person to do certain acts; (b)     the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts; (c)     the acts were unlawful; (d)     the acts were performed in furtherance of the agreement; and (e)     the plaintiff suffered loss as a result of the conspiracy. On the facts of the present case, the elements of combination and intention were disputed by the parties. 121    With regard to the first element, a distinction had to be drawn between D1–D6 on the one hand and D7–D8 on the other. As discussed above, although Kaske only purported to be the director of D2–D6, it was obvious that he was also in control of D1. David, who happened to be the director of D1 on record, conceded that he was merely a “puppet” of Kaske. In fact, the general tenor of the evidence suggested that Kaske was the brainchild behind the entire scheme to set up D1 for the purpose of establishing the MES system. This could be contrasted with D7 and D8, which were controlled by Jennifer and Lum respectively. Although Kaske, Jennifer and Lum appeared to share a significant degree of common ground, especially in relation to their united response to TELG that it was not a contracting party, Jennifer’s and Lum’s level of involvement was relatively lower as compared to Kaske. This was probably attributable to the fact that Jennifer was a practising lawyer while Lum was in charge of running his family business. Unlike Kaske, their involvement in the education industry was only a side venture. Further, as at the date of the trial, D7 and D8 were still operational. It appeared that they were running MES centres under a licencing arrangement with D1. This could be contrasted with D2–D6 which have sold their business to D1. In the light of this distinction in the level of involvement, I was of the view that only D1–D6 could be said to have been in a combination to do certain acts. A director can be found to be liable for the tort of conspiracy with his company. In other words, a company can be regarded as a co-conspirator with its director. InNagase Singapore Pte Ltd v Ching Kai Huat and others[2008] 1 SLR(R) 80, Judith Prakash J observed that there could be a conspiracy between a company and its controlling director to damage a third party by unlawful means notwithstanding that the director might have been the moving spirit of the company. Returning to the facts in the present case, the evidence pointed towards Kaske being the moving force behind the entire plan to set up the MES system as a competitor to the ICR system. In the circumstances, I was of the view that the first element of combination was made out against D1–D6. 122    With regard to the element of intention, the Defendants reiterated on multiple occasions that Kaske was merely attempting to protect his investment. It was submitted on behalf of the Defendants that there was no intention to cause damage or injury to the Plaintiffs by those acts. InEFT Holdings, the Court of Appeal made the following observations in relation to the element of intention (at [101]): A claimant in an action for unlawful means conspiracy would have to show that the unlawful means and the conspiracy were targeted or directed at the claimant. It is not sufficient that harm to the claimant would be a likely, or probable or even inevitable consequence of the defendant's conduct. Injury to the claimant must have been intended as a means to an end or as an end in itself. ... The following extract from Lord Hoffmann’s judgment inOBG Ltd and another v Allan and others[2008] 1 AC 1 was also cited by the Court of Appeal: In theLumley v Gyetort, there must be an intention to procure a breach of contract. In the unlawful means tort, there must be an intention to cause loss. The ends which must have been intended are different. ... But the concept of intention is in both cases the same.In both cases it is necessary to distinguish between ends, means and consequences. One intends to cause loss even though it is the means by which one achieved the end of enriching oneself.On the other hand, one is not liable for loss which is neither a desired end nor a means of attaining it but merely a foreseeable consequence of one's actions. [emphasis added] While the Defendants have attempted to characterise Kaske’s acts as being motivated by a desire to protect his investments, this did not necessarily mean that he could not have the intention to cause loss to the Plaintiffs. As explained in the extract above, there is a need to distinguish between ends, means and consequences. While it could be argued that Kaske was essentially driven by the desire to enrich himself and protect his investment, it was conceivable that this was merely the end he was working towards. The means by which he achieved this end was to set up D1 and to sell the businesses in D2–D6 to D1 for the sole purpose of establishing the competing MES system. In the circumstances, I was of the view that Kaske and the companies he was controlling had the intention to cause loss to the Plaintiffs by carrying out those acts. To approach the element of intention from another perspective, the Court of Appeal inEFT Holdingsalso observed that the claimant has to establish that the unlawful means and the conspiracy were targeted or directed at the claimant. On the facts of the present case, the acts undertaken by Kaske and the relevant companies were in fact targeted and directed at the Plaintiffs. 123    In the light of the above, I was of the view that D1–D6 were liable for the tort of conspiracy by unlawful means. Tort for inducing breach of contract 124    Unlike the other claims, the Plaintiffs’ claim in the tort of inducing breach of contract was only brought against D1. InTribune Investment Trust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407 (“Tribune Investment v Soosan”), the Court of Appeal held (at [17]) that to establish a claim in the tort for inducement of breach of contract, the plaintiff must show that: (a)     the procurer acted with the requisite knowledge of the existence of the contract, although knowledge of the precise terms was not necessary; and (b)     the procurer had the intention, which has to be determined objectively, to interfere with the performance of the contract. Apart from that, the contract in question must also be shown to be a valid one. 125    On the facts of the present case, the first element of knowledge was relatively uncontroversial. Kaske, the controlling mind of D1, clearly acted with the knowledge of the other franchise agreements. In fact, Kaske would, in all likelihood, have knowledge concerning the major covenants in the franchise agreements such as the non-compete and non-solicitation clause. 126    With regard to the second element of intention, the Plaintiffs made the following submissions: Kaske stated in his AEIC at [112] that D1 was set up to give him a “layer of protection”. [Jennifer] and Lum both stated in their AEICs as well at paragraphs [113] and [245] that this was a fall back position. There statements, together with the circumstances behind the complex and convoluted set-up of D1 clearly shows thattheyharboured intentions to breach and circumvent the post termination restrictive covenants in the Franchise Agreements. [emphasis added] The intention that is required is that of the procurer and not the contracting party. Given that the claim was brought against D1 alone, Jennifer and Lum’s intentions were strictly irrelevant for the purposes of this claim. 127    Nevertheless, the second element of intention was established on the facts of the present case. In acknowledging that intention was to be determined objectively, the Court of Appeal inTribune Investment v Soosanmade the following observations at [18]: The relevant mental state is thus that of intention: the defendant must intend to interfere with the plaintiff's contractual rights, in the sense of doing so knowingly.Malice or spite in the form of a personal animus against the defendants or an illegitimate motive however is not required. It is sufficient if the defendant knows of the existence of the contract orturns a blind eye to its existence or is reckless as to the consequence of his actions in the sense of being indifferent whether or not a breach happens… It is not necessary that the defendant should have been aiming to hurt or injure the plaintiff although some deliberate conduct on the defendant's part is normally required to ground liability. Mere negligent invasions of contractual rights however are not actionable. The normal form of the tort involves direct persuasion being brought to bear on the contract-breaker, butit is possible to commit it where A and B enter into a contract which, to A's knowledge, is incompatible with B's contract with C… [emphasis added] Looking at the evidence as a whole, I was of the view that Kaske had acted with the requisite intention to give rise to liability for the tort of inducing breach of contract. Kaske clearly knew that D2–D8 were subject to the non-compete and non-solicitation clauses in their respective franchise agreements. In the case of D2–D6, Kaske proceeded to sell the businesses to D1 for the purpose of establishing the competing MES system. With regard to D7 and D8, it was not disputed that they had entered into a licence agreement with D1 for the purpose of operating MES centres. Apart from the non-solicitation clauses which have been found to be breached by the respective Defendants, the conversion of the ICR centres into MES centres was also in breach of the termination procedure set out in the franchise agreements. Kaske went so far as to state in his affidavit that:[note: 54] On 16 September 2013, D2 to D6 ceased offering the ICR System, the use of the ICR Trade Mark and ICR materials.Thereafter, D2 to D6 commenced business as English language tuition centres under the name and style of MES. [emphasis added] While Kaske attempted to clarify, in the course of cross-examination, that what he meant was that D2–D6 had sold their businesses to D1, it was not disputed that the physical locations of the centres remained the same and the ICR centres were practically “converted” to MES centres over the school break. In the circumstances, Kaske clearly had the requisite intention to interfere with the performance of the obligations under the franchise agreements. The tort for inducement of breach of contract was therefore established in the present case.",
        "The counterclaims in S 822/2013": "Tort of harassment 128    The counterclaim in the tort of harassment was brought by D1 against the Plaintiffs. The acts in question that were relied upon by D1 to establish its counterclaim were that the Plaintiffs had, through its agents and/or servants: (a)     called the customers of D1 repeatedly to entice them to switch to the Plaintiffs’ centres; (b)     spread rumours repeatedly that the employees of D1 were personally liable for contempt of court; and (c)     engagedagent provocateursposing as concerned parents to repeatedly annoy the employees of D1. 129    D1 began its submissions on its counterclaim by stating that the Court of Appeal had confirmed the existence of the tort of harassment in the recent decision ofTee Yok Kiat v Pang Min Seng[2013] SGCA 9. However, it was stated unequivocally in the grounds of decision in that case that it was not strictly necessary for the court to consider the appellant’s alternative cause of action under the tort of harassment given that her claim based on the tort of intimidation had been made out. In fact, the Court of Appeal stated that it would “nonetheless make some brief observations on this point” (at [39]). Second, it was recognised that none of the parties before the Court of Appeal questioned the existence of the tort of harassment under Singapore law. In the subsequent High Court decision ofAXA Insurance Singapore Pte Ltd v Chandran s/o Natesan[2013] 4 SLR 545 (“AXA Insurance v Chandran s/o Natesan”), Choo Han Teck J was of the view that there was no basis or principle upon which the tort of harassment was founded. As the parties did not make any substantive arguments on whether the tort of harassment exists in Singapore law, I need say no more about this issue here. 130    There were two problems with D1’s counterclaim. First, one of the key elements that had to be established in the tort of harassment would be a course of conduct, whether by words or action and whether directly or through third parties, being sufficiently repetitive in nature as would cause worry, emotional distress or annoyance to the claimant. With reference to D1’s counterclaim, it would appear that the proper persons to bring the action in the tort of harassment would be the customers and employees who were allegedly harassed by the Plaintiffs. It would not be appropriate for D1, being a corporate entity, to bring the action for the tort of harassment. In any event, D1 did not make any submissions to suggest that it was entitled to sue on behalf of its employees and customers. A similar issue arose in the High Court decision ofAXA Insurance v Chandran s/o Natesan, where the plaintiff insurance company brought a claim in the alternative for the tort of harassment against an individual. Choo J observed that apart from the fact that the tort of harassment was not pleaded as a cause of action in the statement of claim, the plaintiff insurance company had not shown whether it was entitled to sue on behalf of its employees. This objection also arises on the facts of the present case. 131    Second, even if it was accepted that D1 could bring the counterclaim for the tort of harassment against the Plaintiffs, there was insufficient evidence to prove the repetitive nature of the alleged conduct. As mentioned above, a key element in the tort of harassment is the alleged act beingsufficiently repetitivein nature as would cause worry, emotional distress or annoyance to the claimant. None of the alleged victims of the alleged conduct by the Plaintiffs was called to give evidence here. While the Plaintiffs have attempted to rely on Tan’s cross-examination to prove that the Plaintiffs had, in fact, engaged in such conduct, the evidence did not go so far as to establish the frequency, and more importantly, the repetitive nature of the alleged conduct. 132    For the reasons above, D1’s counterclaim in the tort of harassment against the Plaintiffs could not succeed. Restitutionary claim 133    The counterclaim in restitution was brought by D2–D8 against the Plaintiffs for the price of the unused ICR materials that were returned to the Plaintiffs. It was D2–D8’s case that the Plaintiffs had freely accepted the ICR materials with the knowledge that D2–D8 expected to be paid for them. It was argued that the Plaintiffs were thereby enriched upon receipt of the unused ICR materials and this enrichment was at D2–D8’s expense as the ICR materials had already been fully paid up by D2–D8. 134    In reply to D2–D8’s arguments that they were entitled to the price of the unused ICR materials, the Plaintiffs argued that there was neither an express nor implied term in the franchise agreement. However, D2–D8’s claim was based on restitution, as opposed to a breach of a contractual term, whether express or implied. 135    For the avoidance of doubt, it was undisputed by the parties that D2–D8 had purchased the ICR materials from the franchisor in a typical sales transaction. The arrangement was such that the franchisee would place an order for the ICR materials depending on its own needs and requirements. There was no obligation on the part of the franchisee to order a specific amount of ICR materials pursuant to the franchise agreement. 136    Looking at the evidence as a whole, I was of the view that there were two fundamental problems with D2–D8’s counterclaim for the price of the unused ICR materials. First, a brief perusal of the franchise agreements showed the presence of an elaborate termination procedure which had to be complied with upon termination or expiry of the franchise agreements. One of the obligations was for the franchisee to return all programmes, workbooks and materials to the franchisor at the end of the franchise arrangement. The franchise agreement was silent on the issue of whether the franchisor was obliged to make any refunds for the returned ICR materials. In the face of this contractual arrangement between the parties, I was of the view that the receipt of the unused ICR materials by the Plaintiffs could not give rise to any claim in restitution by D2–D8. I note in passing that D2–D8 alluded to the fact that there was a practice of crediting their respective accounts with the value of the returned ICR materials in the course of previous dealings. However, the previous practice of returning the ICR materials, if it existed, was not pursuant to any contractual arrangement within the franchise agreement. In any case, it was done in the course of a continuing relationship. The return of the ICR materials in the present case was expressly stated in the franchise agreements in that the franchisee would return all programmes, workbooks and materials to the franchisor upon the termination or expiry of the franchise arrangement. 137    Second, I was unable to accept D2–D8’s arguments that the Plaintiffs had “freely accepted” the returned ICR materials. This free acceptance was relied upon by D2–D8 as the unjust factor to ground their counterclaim in restitution. I was not able to accept that the Plaintiffs freely accepted the returned ICR materials. It was undisputed that D2–D8 had delivered the ICR materials to TELG on their own accord. In a letter dated 12 September 2013 from D2–D8 to TELG, it was stated that:[note: 55] Please note that we will be delivering the items in the enclosed inventory, to your office ... between 4–5pm today. Please be ready to receive them. If you do not wish to take delivery of these items, please be notified thatthe cost of storage of these inventory, additional transport charges to store the items and any other incidental charges will be charged to you. [emphasis added] Under such circumstances, given the clear threat by D2–D8 to seek further charges from the Plaintiffs in the event that the goods were not accepted, the Plaintiffs had little free choice and could not be said to have “freely accepted” the returned ICR materials. I was therefore of the view that D2–D8 could not rely on the alleged free acceptance by the Plaintiffs as the unjust factor to support their counterclaim in restitution. D2–D8’s counterclaim for the value of the returned ICR materials therefore failed.",
        "Conclusion": "138    For the reasons set out above, I dismissed all the claims and counterclaims in both S 420/2013 and S 822/2013. Although the Plaintiffs’ claims mostly failed as a result of the invalid assignment, they would have succeeded in a number of claims had the assignment been valid. On the other hand, the Defendants also brought a few counterclaims against the Plaintiffs which were dismissed entirely. I was therefore of the view that each party should bear its own costs.  [note: 1]Kaske Gerold Ulrich’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Kaske-1”) at p 6, para 25. [note: 2]Kaske-1 at pp 6–7, para 26. [note: 3]Kaske-1 at p 7, para 27. [note: 4]Kaske-1 at p 7, para 29. [note: 5]Kaske-1 at p 7, para 29. [note: 6]Chih Chien Li Jennifer’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Jennifer-1”) at p 5, para 15. [note: 7]Jennifer-1 at p 6, para 22. [note: 8]Plaintiffs’ Bundle of Documents at pp 3–15. [note: 9]Plaintiffs’ Bundle of Documents at pp 16–31. [note: 10]Plaintiffs’ Bundle of Documents at pp 32–44. [note: 11]Agreed Bundle of Documents (Volume 2) at pp 411–413. [note: 12]Agreed Bundle of Documents (Volume 2) at pp 429–431. [note: 13]Agreed Bundle of Documents (Volume 2) at pp 512–513. [note: 14]Plaintiffs’ Closing Submissions dated 20 August 2014 (“PCS”) at p 19. [note: 15]Agreed Bundle of Documents (Volume 3) at pp 799–804. [note: 16]Agreed Bundle of Documents (Volume 2) at pp 567–569. [note: 17]Agreed Bundle of Documents (Volume 3) at pp 712–714. [note: 18]Plaintiffs’ Bundle of Documents at pp 16–31. [note: 19]Agreed Bundle of Documents (Volume 1) at pp 88, 114. [note: 20]Plaintiffs’ Bundle of Documents at p 5. [note: 21]Agreed Bundle of Documents (Volume 2) at pp 429–431. [note: 22]Agreed Bundle of Documents (Volume 2) at pp 411–413. [note: 23]Agreed Bundle of Documents (Volume 2) at pp 429–431. [note: 24]Agreed Bundle of Documents (Volume 2) at pp 411–413. [note: 25]Agreed Bundle of Documents (Volume 1) at pp 88, 114. [note: 26]Agreed Bundle of Documents (Volume 2) at p 479. [note: 27]Lum Wai Onn’s Affidavit of Evidence-in-Chief dated 11 July 2014 (“Lum-1”) at p 182. [note: 28]Lum-1 at p 182. [note: 29]Agreed Bundle of Documents (Volume 3) at p 818. [note: 30]Agreed Bundle of Documents (Volume 3) at p 793. [note: 31]Agreed Bundle of Documents (Volume 3) at p 818. [note: 32]Agreed Bundle of Documents (Volume 1) at p 37. [note: 33]Agreed Bundle of Documents (Volume 2) at p 564. [note: 34]Agreed Bundle of Documents (Volume 2) at p 563. [note: 35]Agreed Bundle of Documents (Volume 2) at p 568. [note: 36]Agreed Bundle of Documents (Volume 2) at p 568. [note: 37]Agreed Bundle of Documents (Volume 2) at p 568. [note: 38]Agreed Bundle of Documents (Volume 3) at p 687. [note: 39]Agreed Bundle of Documents (Volume 2) at p 469. [note: 40]Agreed Bundle of Documents (Volume 2) at p 409. [note: 41]Agreed Bundle of Documents (Volume 2) at pp 479–480. [note: 42]Agreed Bundle of Documents (Volume 1) at pp 200–201. [note: 43]Agreed Bundle of Documents (Volume 1) at p 151. [note: 44]Agreed Bundle of Documents (Volume 1) at p 72. [note: 45]Agreed Bundle of Documents (Volume 1) at pp 61–62. [note: 46]Agreed Bundle of Documents (Volume 1) at p 48. [note: 47]Agreed Bundle of Documents (Volume 1) at p 200. [note: 48]Agreed Bundle of Documents (Volume 7) at p 2065. [note: 49]Agreed Bundle of Documents (Volume 1) at p 151–152. [note: 50]Agreed Bundle of Documents (Volume 1) at p 56. [note: 51]Agreed Bundle of Documents (Volume 1) at p 56. [note: 52]Agreed Bundle of Documents (Volume 1) at p 151. [note: 53]Agreed Bundle of Documents (Volume 1) at p 185. [note: 54]Kaske-1 at p 47, para 164. [note: 55]Agreed Bundle of Documents (Volume 4) at pp 1159, 1160, 1162."
    }
}