{
    "case_title": "M2B World Asia Pacific Pte Ltd\n      v\n      Matsumura Akihiko",
    "ncitation": "[2014] SGHC 225",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The claim in the present proceedings arises out of a purported oral agreement between M2B World Asia Pacific Pte Ltd (“the Plaintiff”) and Mr Matsumura Akihiko (“the Defendant”). The Defendant had allegedly agreed to secure advertising contracts worth at least US$10m annually for the Plaintiff’s new web-based television channel in return for an annual commission of US$1m. No advertising contracts materialised. In April 2010, the Plaintiff sent the Defendant a letter of demand claiming the return of US$1m it said it had paid him as advance commission. The Defendant denied liability. 2       On 16 October 2013, the Plaintiff commenced this action. The Plaintiff pleaded that at its request, on 24 October 2007, Central Point Co Ltd (“Central Point”) had paid US$1m to the Defendant on its behalf as advance payment of the commission payable under the oral agreement. The Plaintiff claimed repayment of that sum for total failure of consideration. On 18 December 2013, the Plaintiff took out a summary judgment application (Summons No 6467 of 2013 (“Sum 6467/2013”)) pursuant to O 14 r 1 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“ROC”). The Defendant resisted the summary judgment application on the basis that there were triable issues arising from his contention that there was never any oral agreement as alleged. 3       Sum 6467/2013 was heard by an Assistant Registrar (“the AR”) on 29 January 2014. The AR granted the Defendant leave to defend the action on the condition that the Defendant provided a banker’s guarantee for the sum of $100,000. Subsequently the parties filed cross-appeals against the AR’s decision. 4       I heard both appeals on 7 March 2014. I dismissed the Defendant’s appeal but allowed the Plaintiff’s appeal. The Defendant has since filed an appeal against my decision.",
        "Background": "5       The Plaintiff is a Singapore incorporated company whose business involves, among other things, the provision of internet entertainment content. In connection with this business, the Plaintiff created WOWtv, a web-based television channel. 6       In or around July 2007, the Defendant was asked to help the Plaintiff secure advertisement contracts for WOWtv so as to generate advertising revenue for the Plaintiff. The Plaintiff claimed that one of its directors, Mr Torisawa Sakae (“Mr Sakae”), was its sole point of contact with the Defendant. The Defendant, however, claimed that he was approached by Mr Sakae and Mr Eddie Lim (“Mr Lim”), a shareholder of the Plaintiff. The significance of this fact will become apparent in the course of these grounds of decision. It ought to be pointed out that Mr Sakae and the Defendant had been acquainted with each other since 2002. The Defendant was a director of Transcu Ltd, of which Mr Sakae was also a director from 23 April 2007 until his resignation on or about 24 April 2008. 7       The Plaintiff and the Defendant gave varying accounts of what transpired after the Defendant’s help was sought. I set out their cases below.",
        "Plaintiff’s Account": "8       The Plaintiff claimed that the Defendant mentioned that he knew the senior management of Dentsu Co Ltd (“Dentsu”), a large and well-known advertising agency. The Defendant told Mr Sakae that he was confident that he would be able to obtain Dentu’s commitment to annually channel advertising contracts worth over US$10m to the Plaintiff. In or around October 2007, the Plaintiff and the Defendant reached an oral agreement for the Defendant to get Dentsu to channel at least US$10m worth of advertising contracts to WOWtv annually in exchange for which the Plaintiff agreed to pay the Defendant US$1m in commission annually (“the Agreement”). 9       Subsequently, the Defendant asked the Plaintiff for advance payment of the commission payable under the Agreement with the promise that if the Defendant failed to deliver on his aforementioned obligation under the Agreement, he would refund the Plaintiff the full commission paid. Relying on this undertaking, the Plaintiff effected payment of US$1m to the Defendant’s Credit Agricole (Suisse) SA account on or about 24 October 2007. The payment was made through Central Point. The Plaintiff exhibited bank debit and credit statements to evidence this transfer. 10     Thereafter, the Defendant introduced Mr Sakae to the then Senior Managing Director of Dentsu, Mr Haruyuki Takahashi (“Mr Takahashi”). Mr Takahashi arranged meetings for Mr Sakae in Dentsu’s Shanghai and Beijing offices in a bid to help the Plaintiff procure advertising for WOWtv. However, these meetings came to nought and Dentsu did not award a single advertising contract to WOWtv.",
        "Defendant’s Account": "11     There are a number of permutations of the Defendant’s case. The common elements in the various permutations are that (a) there was no agreement between the Plaintiff and the Defendant as alleged by the Plaintiff; and (b) the sum of US$1m that was paid to the Defendant on or about 24 October 2007 was received by him on behalf of a third party. At this juncture, I will simply set out the final version of the Defendant’s case as it was presented before me. 12     The Defendant claimed that Mr Sakae and Mr Lim approached him sometime during or around July 2007, seeking his assistance to secure advertising revenue for WOWtv. Mr Sakae and Mr Lim asked if he had any business contacts within Dentsu. The Defendant did not personally know anyone within Dentsu. However, he introduced Mr Sakae and Mr Lim to his close business partner of more than 30 years, Mr Kunio Kubota (“Mr Kubota”), who was personally acquainted with Mr Takahashi. The Defendant also requested Mr Kubota to explore the possibility of setting up a meeting between Mr Sakae, Mr Lim and Mr Takahashi. Mr Kubota acceded. The Defendant was present only for the first of a series of meeting between these parties. The Defendant claimed that he helped to set up the meeting, “as a personal favour to [Mr Sakae] and entirely on a gratuitous basis”. He denied ever agreeing to obtain Dentsu’s commitment to annually channel advertising contracts worth over US$10m to the Plaintiff in return for commission. 13     The Defendant also claimed that he did not receive any money from the Plaintiff. He did not deny that US$1m was credited to his Credit Agricole (Suisse) SA account from Central Point. He claimed that the money in fact came from Mr Lim. He asserted that the Plaintiff had been unable to provide any evidence to show that Central Point had disbursed money on behalf of the Plaintiff despite his expressly disputing that the money had come from the Plaintiff. 14     The Defendant’s explanation as to why Central Point had transferred US$1m to him is as follows. He claimed that Mr Lim wanted to pay Mr Kubota US$1m to: (a)     Reward Mr Kubota and Mr Takahashi so that they would continue to assist the Plaintiff to conclude a deal with Dentsu; and (b)     Reimburse Mr Kubota and Mr Takahashi for the substantial expenses they had incurred in introducing Mr Lim to Dentsu’s subsidiaries in Shanghai, Beijing, and Taipei. The expenses included travel and entertainment expenses incurred over the course of more than twenty trips. 15     However, it was “logistically inconvenient” for Mr Kubota to receive the money in Singapore because he did not have any bank accounts outside Japan. Moreover, payment to Mr Kubota’s bank account in Japan would have involved “cumbersome procedures due to Japan’s foreign exchange controls”. At this time, Mr Kubota owed the Defendant US$1.45m. The Defendant exhibited copies of “IOUs” to evidence Mr Kubota’s debt. Mr Kubota suggested that the Defendant receive the money from Mr Lim and retain it, in part satisfaction of the outstanding loan that he owed the Defendant. It was for this reason that the Defendant agreed to receive the money from Mr Lim. The Defendant maintained that it was Mr Lim and not the Plaintiff who transferred the money to him and that the money was not meant to be advance payment of commission under the Agreement.",
        "Parties’ submissions": "16     The Plaintiff argued that its version of events should be preferred over the Defendant’s because the Defendant’s version was unsubstantiated and had changed several times. It maintained that the Defendant had no defence to its claim and, as such, it should be granted summary judgment. The Defendant on the other hand stated that his version of events raised triable issues and that there was a “litany of factual disputes” between the parties as to whether the Agreement was formed. Therefore, he argued that he should be granted unconditional leave to defend.",
        "The Law": "17     The legal principles governing an application for summary judgment are well known. To obtain judgment, the plaintiff first has to show that he has aprima faciecase for summary judgment. If he fails to do that, his application ought to be dismissed. However, once the plaintiff shows that he has aprima faciecase, the burden shifts to the defendant who, in order to obtain leave to defend, must establish that there is a fair or reasonable probability that he has a real orbona fidedefence: see, for example,Ritzland Investment Pte Ltd v Grace Management & Consultancy Services Pte Ltd[2014] 2 SLR 1342 (“Ritzland”) at [43]–[47]. 18     InRitzland, it was clarified that it is the tactical burden and not the evidential or legal burden that shifts to the defendant. 19     The defendant need only show that there is a triable issue or question or that for some other reason there ought to be a trial:Singapore Civil Procedure, vol 1 (Sweet & Maxwell, 2013) at para 14/4/5 (“Singapore Civil Procedure”). A court would not grant leave to defend if all the defendant provides is a mere assertion, contained in an affidavit, of a given situation which forms the basis of his defence:Prosperous Credit Pte Ltd v Gen Hwa Franchise International Pte Ltd[1998] 1 SLR(R) 53 at [14]. The following statement fromBank Negara Malaysia v Mohd Ismail & Ors[1992] 1 MLJ 400 is also instructive: Under an O 14 application, the duty of a judge does not end as soon as a fact is asserted by one party, and denied or disputed by the other in an affidavit.Where such assertion, denial or dispute is equivocal, or lacking in precision or is inconsistent with undisputed contemporary documents or other statements by the same deponent, or is inherently improbable in itself, then the judge has a duty to reject such assertion or denial, thereby rendering the issue not triable. In our opinion, unless this principle is adhered to, a judge is in no position to exercise his discretion judicially in an O 14 application. Thus, apart from identifying the issues of fact or law, the court must go one step further and determine whether they are triable. This principle is sometimes expressed by the statement that a complete defence need not be shown. The defence set up need only show that there is a triable issue. [emphasis added] 20     The Defendant raised two English cases (Merchantbridge and Co Ltd v Safron General Partner I Ltd[2005] EWCA Civ 158 (“Merchantbridge”) andED & F Man Commodity Advisers Ltd and another v Fluxo-Crane Overseas Ltd and another[2009] EWCA Civ 406 (“Man Commodity”)) that suggest that where an oral contract is sued on and the terms thereof or the contract’s very existence is disputed, the court should be cautious in granting summary judgment. However, the cases do not preclude the possibility of the court doing so nor did the Defendant make that submission. 21     InMerchantbridge, the court did not grant summary judgment. In that case, the plaintiff entered into a contract with the defendant to provide the latter with investment advice over the course of a year in consideration for a sum of money to be paid to it over the same period. The defendant terminated the investment advisory agreement prematurely. Thereafter, there was a meeting between the interested parties. On an application for summary judgment by the defendant, the judge found that there was an oral agreement that no action would be brought by the plaintiff for wrongful termination in exchange for the defendant paying the plaintiff certain funds. Given the existence of the oral agreement, the judge gave summary judgment to the defendant on the basis that the plaintiff’s claim had no prospect of success. It should be noted that this case was brought pursuant to Part 24 of the Civil Procedure Rules 1998 (SI 1998 No 3132) (UK) (“CPR”) which is somewhat broader than O 14 of the ROC. Pursuant to r 24.2(a)(i) of the CPR, the court may grant summary judgment against a claimant if it considers that the “claimant has no real prospect of succeeding on the claim or issue”. Order 14 contains no similar provision. 22     The English Court of Appeal allowed the plaintiff’s appeal. In the course of the judgment, the Court of Appeal stated: 18.    … it is unusual, to say the least, for a judge to give summary judgment on the basis of an alleged oral agreement, the existence of which is disputed by one of the parties. … … 21.    It seems to me that, with all respect to the judge, he came to too robust and hasty a decision on the documentation that an oral agreement forgoing any right to sue for wrongful termination had been made … and that this is a matter which should therefore go for trial. Although the court stated that it would be “unusual” for summary judgment to be granted where a disputed oral contract is involved, the court’s actual reason for allowing the appeal was that it was satisfied, on the basis of the available evidence, that the plaintiff’s contention that no oral agreement was formed was probable or capable of belief. In fact, the evidence in that case was so inconclusive that even the defendant conceded on appeal that it was reasonably arguable, for the purposes of the summary judgment application, that no oral agreement had been concluded (at [22]). 23     InMan Commodity, the English Court of Appeal discouraged the use of summary judgment procedure to test whether an oral agreement had been concluded. Nevertheless, the court proceeded to finally determine the issue. Admittedly, this was because of the unique features of that case: there were extensive transcripts of the meeting at which the alleged oral agreement had been reached. Moreover, both parties had agreed that it was possible for the court to finally determine the issue by reference to the transcripts. The Court of Appeal stated: 2.    … the issue … was whether a legally enforceable agreement had been reached during telephone and round table conversations which took place on 17 January 2008 between representatives of ten sugar brokers, including Man [the plaintiff], and Mr Manoel Garcia representing FCO [the defendant]. 3.A less likely subject for decision under [Part 24 of the CPR] seems at first sight difficult to imaginebut there were extensive transcripts of the discussion and Mr Paul Downes, for Man, was able to submit to the judge that it was possible to take a view that it was unarguable that there was a contract. Mr Stephen Males QC, for FCO, was able to argue to the contrary and his main argument was that the issue was unsuitable for summary determination, having regard to the further materials that might be available at a trial. But he also submitted that if the judge concluded, on the basis of the transcript, that there was a binding agreement he had no objection to the judge determining the matter summarily in FCO's favour. … 6.The idea of deciding on a Part 24 application, even by reference to an extensive transcript, whether an oral agreement or an agreement by conduct was reached, seemed to me at least initially unlikely to be a proper use of that summary procedure.I have been tempted simply to say that. But once, as has happened in this instance, the court below has been persuaded to embark on the exercise and has effectively tried out the whole question almost as if it were a full trial, and once his decision is both attacked but also sought to be upheld, it is difficult to contemplate both wrestling with the detail and then concluding that the whole exercise should be carried out again at a trial unless there is likely to be further material available for a trial which might make a difference. If both parties are saying that it is possible to reach final conclusions by reference to the transcript under Part 24 in their favour, it is unattractive of either to say that if the decision is not in their favour then the only answer is a further trial. [emphasis added] 24     I accept that the court should generally not grant summary judgment where an oral contract is sued on and the terms thereof or the contract’s very existence is disputed. However, the court is not precluded from doing so in an appropriate case. I would approve the suggestion inSingapore Civil Procedurethat in such cases, summary judgment may be granted where the plaintiff can satisfy the court that (a) even on the defendant’s version he is entitled to judgment; or (b) the defendant’s version is not truthful or capable of belief (at para 14/4/7).",
        "My decision": "25     In the present case, the first of the two grounds mentioned in [24] did not assist the Plaintiff. This was because its claim for total failure of consideration would be a non-starter if there was no underlying contract as contended by the Defendant. However, I was of the view that the case fell squarely within the second ground. 26     I concluded that the Plaintiff had established its claim for the repayment of US$1m for total failure of consideration on aprima faciebasis. Its position all along was that it had transferred US$1m to the Defendant as advance payment of commission conditioned upon the Defendant getting Dentsu to channel at least US$10m worth of advertising contracts to the Plaintiff’s WOWtv website. I thought this to have been likely given that (a) both parties accepted that there were several meetings between the Plaintiff and Dentsu which at the very least suggested they were negotiating to reach an agreement; (b) the Defendant had been instrumental (even on his own case) in having the meetings set up; and (c) the fact that US$1m had been transferred to the Defendant’s account by Central Point. As I explain at [29] below, the Defendant had initially accepted that Central Point had transferred this sum on behalf of the Plaintiff. There appeared to be no independent reason for him to have received this sum of money from the Plaintiff. It was also not disputed that Dentsu never awarded any advertising contracts to WOWtv. I was of the view that these facts shifted the tactical burden to the Defendant for him to establish that he had a fair or reasonable probability of raising a real orbona fidedefence to the Plaintiff’s claim. 27     The Defendant failed to discharge this burden because the version of events put forward by the Defendant was not capable of belief. I reached this conclusion for two reasons. First, the defence he mounted had undergone numerous changes and he had taken inconsistent positions along the way when all the facts that he finally relied on were within his knowledge from the outset. This suggested to me that his final defence was more an afterthought than a genuine one. Second, several key planks of his defence were merely assertions on affidavit that were not adequately substantiated. I will elaborate on each in turn.",
        "Changes in the Defence": "28     The Defendant’s case as it was presented before me differed in at least three respects from earlier positions he had taken. The differences are as follows: (a)     Initially, the Defendant accepted that Central Point had transferred US$1m to him on behalf of the Plaintiff. However, before me, he argued that it was Mr Lim rather than the Plaintiff who transferred the money. (b)     The Defendant’s explanation as to why Central Point had transferred US$1m to him also changed over time. His original position was that he was merely acting as a conduit and had passed the money to Mr Takahashi. In his Defence filed on 8 November 2013, he had pleaded that the money was used to satisfy, in part, a debt that Mr Takahashi owed him. He subsequently changed his position yet again and stated that he used the money to satisfy, in part, a debt owed by Mr Kubota. (c)     No mention was made of either Mr Kubota’s or of Mr Lim’s involvement in the initial correspondence between his solicitors and the Plaintiff’s solicitors. Nor did he mention these individuals in his Defence. They were introduced for the first time by means of an affidavit dated 8 January 2014 and his Defence (Amendment No 1) (“the Amended Defence”). I will explain how his defence evolved over time. 29     On 4 March 2010, G N Tang & Co, acting on behalf of Central Point, issued the Defendant a notice of demand for the sum of US$1m. The Defendant’s solicitors, Rajah & Tann LLP, responded on 19 March 2010 denying the claim and stated “[w]e are instructed that our client has not had any previous dealings with your client”. Then, on 9 April 2010, G N Tang & Co issued the Defendant another notice of demand for the same amount, this time stating that it was acting for both Central Point and the Plaintiff. In the second of these two letters, the Plaintiff stated its case as set out above and stated, “M2B effected payment through Central Point the commission of USD$1.0 million to your client”. The Defendant’s solicitors, responded on 19 April 2010 again denying the claim. However, they did not deny that it was the Plaintiff who had made payment. In fact, they impliedly accepted that Central Point had transferred the money on behalf of the Plaintiff. They stated: We are instructed as follows: (i)    At the request of your client, M2B, out client arranged for an introduction to Mr Haruyuki Takahashi (“Mr Takahashi”) of Dentsu. (ii)  Pursuant to or in connection with the foregoing, our client was requested tofacilitate M2B’s payment of USD$1.0 millionto Mr Takahashi. (iii)  Accordingly, upon receipt of the said funds, payment of the same was made to Mr Takehashi. (iv)  Apart from the foregoing, our client has had no other involvement in your client’s collaboration with Mr Takahashi, and our client has not received any benefit whatsoever for the above. [emphasis added] It is evident from paragraph (ii) that the Defendant accepted that although the money came from Central Point, it constituted payment made by the Plaintiff. It is also pertinent to note that, according to this letter, the Defendant had received the money merely as a conduit and that the money was ultimately transferred to Mr Takahashi. 30     These proceedings were started some three years later. The Defendant was represented by the same solicitors but his defence had changed. The pleaded defence marked a departure from his earlier position that he received the money to effect payment to Mr Takahashi and that he had done so. In it he mentioned, for the first time, that Mr Takahashi owed him US$1.45m and that he had used the money to satisfy this debt in part. 31     Thereafter, on 18 December 2013, the Plaintiff took out Sum 6467/2013. The summons was supported by Mr Sakae’s first affidavit which was dated the same day (“Mr Sakae’s First Affidavit”). On 14 January 2014, the Defendant filed Summons No 205 of 2014 (“Sum 205/2014”) to amend his Defence. In support of the proposed amendments, the Defendant claimed that he had conveyed his instructions in Japanese to his personal assistant who had translated them into English. In so doing, some of his original instructions had not been accurately transmitted to his solicitors when they prepared his Defence. The Plaintiff argued that the Defendant’s application to amend his Defence was a result of his realisation that he had no valid defence after reading Mr Sakae’s First Affidavit. In particular, the Plaintiff maintained that a “Statement” from Mr Takahashi dated 30 September 2013 (“the Statement”), which was exhibited in Mr Sakae’s First Affidavit “contradicted the Defendant’s version of events” because Mr Takahashi had denied receiving US$1m from the Plaintiff in that Statement. Therefore, the Defendant had “concocted” a new set of facts and applied to amend his Defence so as to be able to rely on them. Sum 205/2014 was heard together with Sum 6467/2013 by the AR on 29 January 2014. The AR allowed the application to amend the Defence. 32     I was of the view that the Statement was not quite as unequivocal as made out to be by the Plaintiff. The Statement was in fact Mr Takahashi’s refusal to accede to the Plaintiff’s request that he execute a Statutory Declaration stating categorically that he did not receive US$1m or any sum with reference to the subject matter of the present dispute from the Defendant. In the Statement, Mr Takahashi stated: This mail refers to your e-mails to me…in which you requested me to execute an affidavit with respect to the contractual relationship with [the Defendant] and mentioned the claim for reimbursement (“hensai-seikyu”) of one (1) million dollars to me. … … I have no legal obligation to submit such an affidavit to M2B as per your request. Therefore, unfortunately I cannot accept your request. In addition to the above, there has been no contractual relationship between Mr. Matsumura and I in the past. Therefore, Mr Takahashi did not categorically deny that he received the money from the Defendant. In any event, the Defendant’s case had evolved by that time and it was no longer that he had transferred the money to Mr Takahashi, but rather that he had used it to satisfy, in part, a debt owed to him by Mr Takahashi. The Statement makes no mention of this debt. Therefore, it cannot not be said that the Defendant applied to amend his Defence because he realised that he had no valid defence, having read Mr Sakae’s First Affidavit. 33     Nonetheless, the Defendant effected major changes to his case by means of his affidavit dated 8 January 2014 and his Amended Defence. He introduced the involvement of Mr Kubota and Mr Lim for the first time. Moreover, he also raised the contention that it was Mr Lim who had transferred the money to him and that this was done ultimately to reward and compensate Mr Kubota and Mr Takahashi in the hope that they would continue to assist the Plaintiff to reach a deal with Dentsu. It was alleged that the money was received by the Defendant in part satisfaction of a debt that Mr Kubota owed him. 34     All these new facts were matters that were within the Defendant’s knowledge from the outset. In fact, the “IOUs” that he relied on to prove the debt that Mr Kubota owed him were from 2007. The fact that the Defendant did not raise these matters earlier and had taken inconsistent positions along the way suggested that these matters were raised as an afterthought. I was not persuaded that the changes were necessitated because his original instructions were inaccurately transmitted to his solicitors by his personal assistant who had translated them from Japanese to English. Given that the central plank of his defence all along was that he had received the money on behalf of a third party, his solicitors must have asked him in 2010 if he had any documents to support that contention. If the “IOUs” were connected to this case, he would have produced them then to his solicitors. The fact that this did not happen suggested that the “IOUs” were perhaps not even related to this dispute. I was fortified in this conclusion by virtue of the fact that most of the Defendant’s assertions in his affidavit dated 8 January 2014 were unsubstantiated.",
        "Unsubstantiated Assertions": "35     It would be evident from the foregoing that the credibility of the Defendant’s account depended very much on Mr Lim and Mr Kubota agreeing with his version of events. He described Mr Kubota as a close, long-time business partner whom he had known for more than 30 years. Hence, had the Defendant’s account been true, I saw no reason why Mr Kubota would not have acceded to a request from him to file an affidavit to support his case. Yet, there was no such affidavit from Mr Kubota. Nor was there one from Mr Lim. In fact, the Defendant had not even shown that Mr Lim was a shareholder of the Plaintiff. Lastly, the Defendant had also stated on affidavit that he had spoken to Mr Takahashi concerning his Statement and that Mr Takahashi had “confirmed to [him] that he neither gave nor signed off on the [Statement]”. However, he did not produce any evidence to prove that he had spoken to Mr Takahashi. Mr Takahashi did not file an affidavit verifying the Defendant’s account. I was of the view that key parts of his defence were mere assertions which were not adequately substantiated.",
        "Conclusion": "36     In my judgment, the Defendant had not raised abona fidedefence to the Plaintiff’s claim. Thus, I allowed the Plaintiff’s appeal in RA 41/2014 and ordered that judgment be entered for the Plaintiff in the sum of US$1m and interest at the rate of 5.33% from the date of the Writ of Summons. I also dismissed the Defendant’s cross-appeal in RA 45/2014 for unconditional leave to defend or for the reduction in the banker’s guarantee it had to provide. I ordered the Defendant to pay the Plaintiff costs of $5,000 for the action and costs for the appeal fixed at $4,000 plus the Plaintiff’s reasonable disbursements."
    }
}