{
    "case_title": "Wan Lai Ting\n      v\n      Kea Kah Kim",
    "ncitation": "[2014] SGHC 180",
    "coram": "Edmund Leow JC",
    "sections": {
        "Introduction": "1       The Plaintiff applied to admit two affidavits of evidence-in-chief (“AEICs”) sworn by her 78-year-old mother-in-law (“Lau”) as hearsay evidence under s 32(1)(j) of the Evidence Act (Cap 97, 1997 Rev Ed) (“the EA”). The stated reason was that Lau, who lives in Hong Kong, is unfit to travel to Singapore or appear as a witness before the court. I dismissed the Plaintiff’s application after some consideration. As the application was an unusual one and raised an issue that might be of interest to practitioners, I now give the grounds for my decision.",
        "Background facts": "2       I will set out briefly the background facts only in so far as they are pertinent to the present application. 3       The Plaintiff’s husband, Henry Chow (“Chow”), was the majority owner of Carriernet Corporation Ltd (HK) (“CNET”). CNET was acquired by ArianeCorp Ltd (now known as Polaris Limited (“Polaris”)) in 2007. The Defendant was the CEO and substantial shareholder of Polaris. 4       The Plaintiff purports to be the beneficial owner of 15,000,000 shares in Polaris (“the Shares”). Although the registered legal owner of the Shares was one Leung Man Ha (“Leung”), who is Chow’s sister-in-law, the Plaintiff claims that Leung had transferred the beneficial interest in the Shares to her on 29 December 2006, which transfer was recorded in a document of the same date signed by Leung and witnessed by Lau (“the 29 December 2006 Document”). The Plaintiff is unable to produce the original of the 29 December 2006 Document and has only tendered a copy of it in these proceedings. 5       The Plaintiff’s claim against the Defendant relates to 10,800,000 of the Shares. The Plaintiff says that she had lent those shares to the Defendant but the Defendant sold them without her knowledge or consent. The Defendant then agreed to pay the Plaintiff the value of the 10,800,000 shares at S$0.10 each (for a total of S$1,080,000), and had made part payment of S$500,000. However, despite repeated requests by the Plaintiff for payment of the remaining S$580,000, the Defendant has failed, refused or neglected to pay the remaining sum. The Plaintiff is therefore suing the Defendant for the sum of S$580,000. 6       In his defence, the Defendant denies that he had borrowed the 10,800,000 shares from the Plaintiff. He further disputes the authenticity of the 29 December 2006 Document and alleges that the purported transfer of beneficial ownership in the shares to the Plaintiff was a sham. He says that it was part of an illegal scheme hatched by Chow, acting in concert with the Plaintiff and Leung, to circumvent SGX regulatory and disclosure requirements.",
        "The application": "7       On 16 July 2014, the Plaintiff filed the present application asking for two AEICs deposed by Lau on 28 May 2014 and 16 June 2014 to be admitted as documentary hearsay under s 32(1)(j) of the EA. The key points made in Lau’s AEICs were as follows: (a)     Since the sale of CNET to Polaris, the Plaintiff has been giving Lau a monthly allowance of HK$10,000. In addition, the Plaintiff and her family have paid for all of Lau’s medical and other bills. (b)     Lau instructed her son, Chow, to ensure that his brothers, sisters and their families receive their share of benefits from the sale of CNET because they had helped in starting the company. (c)     Her property was mortgaged to the bank in 2007 to raise funds. One of the reasons why the Plaintiff had to buy back the Shares of Polaris from Leung and why the latter agreed to the sale was to use the sale proceeds of the Shares to redeem Lau’s property from its mortgage and to continue funding CNET in Hong Kong. (d)     She confirms that she was the witness who signed the 29 December 2006 Document which evidenced that Leung sold the Shares in Polaris to the Plaintiff. 8       The Plaintiff claimed that Lau could not testify before the court because her health is frail. She produced two handwritten notes signed by one Dr Chau Hok Ping (“Dr Chau”) in Hong Kong dated 3 July 2014 and 15 July 2014 stating that: (a)     Lau had two stroke attacks one year ago; (b)     she has a mild to moderate degree of cognitive impairment with poor memory and slurring of speech; (c)     stress during the legal proceedings increases the chances of another stroke attack; (d)     she has multiple medical conditions including asthma and lower back pain; (e)     she requires a wheelchair to move around; (f)     she is “not recommended to travel outside Hong Kong”; and (g)     she is “not recommended to present herself in court case personally or through video conference”. 9       The Plaintiff also said that taking evidence by video link was too expensive. She produced a quotation from Succinct Communication stating that the cost for video conferencing facilities was S$1,234 per hour. 10     Unsurprisingly, the Defendant opposed the application. Counsel for the Defendant said that the points made in Lau’s AEICs were disputed and he needed to cross-examine Lau on her evidence. He further argued that given Lau’s admitted cognitive impairment, the reliability of her evidence is dubious. 11     In response, counsel for the Plaintiff contended that Lau’s cognitive impairment was only mild to moderate and she was still lucid enough to sign an affidavit. She further submitted that the court should admit Lau’s evidence as long as it was relevant; any concerns about its reliability or the Defendant’s inability to test Lau’s evidence under cross-examination should go to weight and not admissibility.",
        "My decision": "",
        "Should Lau’s AEICs be admitted under s 32 of the EA?": "12     The relevant provisions of the EA state as follows: Cases in which statement of relevant fact by person who is dead or cannot be found, etc., is relevant 32.—(1) Subject to subsections (2) and (3), statements of relevant facts made by a person (whether orally, in a document or otherwise), are themselves relevant facts in the following cases: … (j) when the statement is made by a person in respect of whom it is shown — (i) is dead or unfit because of his bodily or mental condition to attend as a witness; (ii) that despite reasonable efforts to locate him, he cannot be found whether within or outside Singapore; (iii) that he is outside Singapore and it is not practicable to secure his attendance; or (iv) that, being competent but not compellable to give evidence on behalf of the party desiring to give the statement in evidence, he refuses to do so; … (3)  A statement which is otherwise relevant under subsection (1) shall not be relevant if the court is of the view that it would not be in the interests of justice to treat it as relevant. 13     A threshold issue was whether s 32 of the EA covered situations like the present where the witness has sworn an AEIC but, for whatever reason, will not be attending court to be cross-examined. After all, the purpose of s 32 was to establish exceptions to the common law rule against hearsay, and it seemed inapt to describe affidavit evidence as hearsay. InLejzor Teper v The Queen[1952] 1 AC 480 at 486, Lord Normand described hearsay as follows: … It is not the best evidence and it is not delivered on oath. The truthfulness and accuracy of the person whose words are spoken to by another witness cannot be tested by cross-examination, and the light which his demeanour would throw on his testimony is lost. … Affidavit evidence is evidence delivered on oath by someone who has personal knowledge of the facts attested to. An AEIC, in particular, is meant to replace a witness’s evidence-in-chief at trial. It might therefore seem strange to regard it as hearsay evidence that could be admitted under s 32 of the EA. 14     In my judgment, however, the rationale for the rule against hearsay is not so much that the evidence being given is second-hand, but that the maker of the statement is not available for cross-examination. The rule therefore applies to all out-of-court statements even if the statement sought to be admittedwasmade by a person with personal knowledge of the circumstances referred to in the statement. Thus, although an affidavit that is made under oath might not fall within the classic notion of hearsay, it should still be regarded as such if the deponent is unavailable for cross-examination. Moreover, although the intent of s 32 was to establish exceptions to the hearsay rule, the drafters of s 32 did not restrict its operation only to statements that fall within the classic notion of hearsay. Instead, s 32 applies to all “statements of relevant facts made by a person (whether orally, in a document or otherwise)”. 15     In any event, even if s 32 did not apply to affidavit evidence, it would be a simple matter for a litigant to repackage an affidavit into some other form of document or statement and then seek to admitthatstatement as hearsay evidence under s 32. It would therefore serve no practical purpose to exclude affidavits from the ambit of s 32. 16     Proceeding on the basis that affidavit evidence could possibly be admitted under s 32 of the EA, two issues arose for my consideration: (a)     whether one or more of the limbs under s 32(1)(j) were satisfied; and (b)     if so, whether it was nonetheless in the interests of justice to exclude Lau’s AEICs from evidence. 17     Given that Lau was wheelchair bound and suffering from asthma and lower back pain, I was prepared to accept that it was impracticable for her to travel to Singapore to attend court. But I was not convinced that her health was in such a dire state that she was unfit to give evidence via video link. Dr Chau’s bare assertion that the stress of legal proceedings might increase the likelihood of a stroke attack and that Lau is “not recommended” to give evidence via video link was equivocal at best, and hardly constituted a firm basis for exempting Lau from being cross-examined by video link. It was also not open to the Plaintiff to reject the option of video link on the basis that it was too expensive. Since the Plaintiff was seeking to rely on Lau’s evidence, it was incumbent on her to take all reasonable steps to make Lau available for cross-examination. 18     Even if s 32(1)(j) was satisfied, I took the view that s 32(3) was applicable on the facts of the present case. Section 32(3) was a new provision introduced into the EA in 2012, at the same time the rules for admitting hearsay evidence were liberalised. The purpose of s 32(3) was to ensure that the expanded exceptions to hearsay were not abused (Singapore Parliamentary Debates, Official Report(14 February 2012) vol 88 (K Shanmugam, Minister for Law)): Let me now move to hearsay … The hearsay rule provides that an out-of-court statement shall not be admitted as proof of its contents, unless the maker of the statement is produced in Court. The rule has been much criticised and exceptions have been carved out. Strong views have been expressed to us that the hearsay rule should be abolished. The present amendments, however, do not go that far. There is still a core of sense – commonsense – in the hearsay rule that,prima facie, a statement should not be admitted to prove the truth of its contents if its maker cannot be cross-examined as to its veracity. What we have done is to introduce more flexible exceptions to the hearsay rule. Section 32 is amended, so that the exceptions in that section will no longer be predicated on the unavailability of the maker.…The Court is given a residual discretion to exclude hearsay evidence in the interests of justice. This ensures that the expanded exceptions are not abused.This is in addition to the Court’s inherent jurisdiction to exclude prejudicial evidence. A party who intends to rely on hearsay evidence would also have to give advance notice of his intent, in accordance with the relevant rules of procedure. [emphasis added] 19     In my judgment, s 32 was not meant to be used to admit an affidavit where a party decides for ulterior reasons not to present the witness for cross-examination even though the witness could have testified (whether in person or via video link). In the present case, I considered it a distinct possibility that the Plaintiff was simply trying to prevent Lau from being cross-examined because she was afraid that Lau’s evidence might not withstand cross-examination. In such circumstances, the prejudicial effect of Lau’s AEICs far outweighed their probative value, and it was not in the interests of justice to admit them into evidence. I will elaborate on this point further in the next section.",
        "Should Lau’s AEICs be admitted under O 38 r 2(1) of the Rules of Court?": "20     Although the Plaintiff’s application was based solely on s 32 of the EA, there was another provision under which Lau’s AEICs could have been admitted into evidence. Under O 38 r 2(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”), the court may allow the affidavit of a witness to be received into evidence even though the witness does not attend trial for cross-examination: Evidence by affidavit (O. 38, r. 2) 2.—(1) Without prejudice to the generality of Rule 1, and unless otherwise provided by any written law or by these Rules, at the trial of an action commenced by writ, evidence-in-chief of a witness shall be given by way of affidavit and,unless the Court otherwise orders or the parties to the action otherwise agree, such a witness shall attend trial for cross-examination and, in default of his attendance, his affidavit shall not be received in evidence except with the leave of the Court.[emphasis added] 21     The principles governing the court’s discretion to grant leave under O 38 r 2(1) was considered inIndustrial & Commercial Bank Ltd v PD International Pte Ltd[2003] 1 SLR(R) 382. In that case, the witness, Cheang, was an employee of the plaintiff but had been retrenched by the date of trial. She returned to Ipoh and refused to attend court when asked, citing family commitments. S Rajendran J nonetheless admitted her affidavit into evidence on the basis that its contents were not especially contentious. The reasoning adopted by Rajendran J merits setting out in full (at [17]–[23]): 17    Cheang had sworn her affidavit on 20 December 2001. Evidence was led that shortly thereafter, she had been retrenched by ICB and had returned to her hometown in Ipoh. Evidence was also led that when asked to attend this hearing, Cheang, citing family commitments, had refused to attend. 18    Mr Vinodh Coomaraswamy, who appeared for PDI, submitted that as the crucial issue in this case was the intention of the parties when they signed the security memorandum, it was important that he cross-examine Cheang, not only because the testimony in her affidavit differed materially from the testimony of Poh, but also to elicit information material to his client not alluded to in her affidavit. He therefore urged the court, in the exercise of its discretion under O 38 r 2(2), to reject her affidavit since she was not present for cross-examination. 19    Mr Coomaraswamy was not able to cite any direct authority on the principles that should guide the court in exercising that discretion. He, however, drew the attention of the court to the case ofUMBC Finance Ltd v Woon Kim Yan Robin[1990] 3 MLJ 360 where the Malaysian Supreme Court held thatthe discretion to admit the affidavit of a person not called as a witness at the trial should not be exercised if the evidence was strongly contested or where the evidence related closely to the credibility of the witness. Mr Coomaraswamy submitted that although that case related to the calling of witnesses at a trial begun by writ, the approach taken by the court in that case would, nevertheless, be a relevant guideline. 20    Mr Hri Kumar, who appeared for ICB, also adopted the guidelines enunciated inUMBC Finance Ltd. Mr Kumar accepted thatthe more contentious the contents of the affidavit, the less likely it would be that the court would exercise its discretion to admit that affidavit in evidence without cross-examination.Mr Kumar submitted that on that criterion there was nothing particularly contentious about the contents of the affidavit of Cheang. The most “contentious” part of her affidavit, he submitted, was para 5 where she said: I did not, at any time, represent to any of the Defendants' representatives in any of our discussions and/or meetings that the deposit of the Twinwood shares were meant to secure only the MEP facilities ... It was not within my authority to vary the terms of the Security Memorandum. Paragraph 5, Mr Kumar submitted, did not contain anything dramatically different from the evidence of Poh. He submitted that, to the contrary, Cheang's affidavit was consistent with Poh's evidence in that, like Poh, she too states that the discussions centred on the securing of MEP's facilities. There was therefore considerable common ground between the affidavits of Cheang and Poh. On the question of PDI not being able to question Cheang on matters not covered in her affidavit, Mr Kumar pointed out that all the documents (including internal documents) prepared by Cheang in connection with the deposit of the Twinwood shares had been produced to the court and those documents spoke for themselves. 21I was satisfied that there was nothing particularly contentious in the affidavit that had been sworn by Cheang and I noted Mr Kumar's submission that all relevant documents prepared by Cheang were available in evidence. ICB had also adduced satisfactory evidence to explain why they were not able to procure Cheang's attendance.Mr Coomaraswamy's complaint, that because of the failure to call Cheang for cross-examination he will not be able to elicit information material to his clients that had not been covered in Cheang's affidavit, was a valid complaint but was not, by itself, sufficient reason to exclude Cheang's affidavit which – as Mr Kumar submitted – did not contain any seriously contentious matter. 22    In the circumstances, I was inclined to grant ICB the leave it sought to use Cheang's affidavit as evidence. However, since the evidence as it unfolded in the course of cross-examination of the witnesses for both sides may have a bearing on the matter, I felt that it would be prudent not to make a final order until the close of the case. I therefore directed that pending a final ruling, the case proceed on the basis that the affidavit was admissible. 23    Having now heard all the evidence and the submissions of the parties, I see no reason to alter that initial ruling. The fact that Cheang's affidavit was admitted, without PDI having the opportunity which it sought to cross-examine her on matters not covered by her affidavit, is a matter that I can take into account in assessing the overall merit of each party's case. [emphasis added in bold italics] 22     Having regard to the Defendant’s defence, I was of the view that the matters deposed to by Lau were highly contentious. The Defendant is saying that the alleged sale of Shares from Leung to the Plaintiff was a sham, and that the purported consideration for the sale (the Plaintiff’s payment of allowances to Lau) was illusory. Moreover, he doesnotadmit the authenticity of the 29 December 2006 Document which Lau purportedly witnessed; he says that it is backdated. Lau’s AEICs go directly towards proving the truth of these matters, and it would be unfair to the Defendant to admit her AEICs if he will not have the opportunity to cross-examine her on them. 23     Further, Lau’s admitted cognitive impairment cast doubt on the reliability of her AEICs. InHwang Cheng Tsu Hsu (by her litigation representative Hsu Ann Mei Amy) v Oversea-Chinese Banking Corp Ltd[2010] 4 SLR 47, the aged plaintiff was unable to attend trial because she was in a state of advanced dementia. However, Lai Siu Chiu J refused to grant leave under O 38 r 2(1) to admit the affidavits sworn by her because there were “serious doubts” as to whether she could have made those affidavits given her state of health (at [101]). Similarly, it was unclear in the present case whether Lau was fully responsible for the contents of her AEICs. I noted that her AEICs were sworn only one to two months before Dr Chau wrote the notes saying that she had suffered two stroke attacks one year ago and that she had “mild to moderate” cognitive impairment, “poor memory” and “slurring of speech”. It was doubtful whether she would have been capable of giving evidence on events that took place seven to eight years ago. Her evidence was therefore of low probative value, and it would have been highly prejudicial to admit her AEICs without giving the Defendant a chance to cross-examine her.",
        "Conclusion": "24     It only remains to note that both s 32 of the EA and O 38 r 2(1) of the ROC should be applied consistently with each other. Where the court has decided not to grant leave under O 38 r 2(1) to admit an affidavit without the witness appearing for cross-examination, it would usually not be in the interests of justice to admit the affidavit under s 32 either. 25     For the reasons given, I dismissed the Plaintiff’s application and ordered that all references to Lau’s AEICs in the Plaintiff’s affidavits be expunged. The Defendant was awarded costs for the summons."
    }
}