{
    "case_title": "Nordic International Ltd\n      v\n      Morten\nInnhaug",
    "ncitation": "[2014] SGHCR 20",
    "coram": "Tan Teck Ping Karen AR",
    "sections": {
        "Introduction": "1       This\nis the Defendant’s application for security for costs of the action from\nthe Plaintiff and/or Sinwa SS (HK) Co Ltd (“Sinwa HK”), a non-party. The\napplication for security for costs is based on two grounds, first,\non the basis that Sinwa HK is a non-party under Order 23 rule 1(3)(b);\nand second, on the basis that the Plaintiff is a nominal Plaintiff\nunder Order 23 rule 1(1)(b). 2       The\nPlaintiff is a company whose shares are equally owned by the Defendant\nand Sinwa HK. The Defendant is also a director of the Plaintiff. 3       Prior\nto the commencement of this action, Sinwa HK obtained leave from\nthe Court of Appeal to bring an action in the name and on behalf\nof the Plaintiff against the Defendant for alleged breaches of directors’\nduties arising from a time-charterparty of a vessel owned by the\nPlaintiff. Pursuant to the leave granted by the Court of Appeal,\nSinwa HK commenced this current suit as a derivative action in the\nname of the Plaintiff against the Defendant.",
        "Security for Costs against a\nNon-party": "4       The\nDefendant’s application for security for costs against Sinwa HK,\na non-party, is based on Order 23 rule 1(3)(b), which states: (3)    Where,\non the application of a defendant to an action or other proceeding\nin the Court, it appears to the Court – (a)    … (b)    that the non-party has contributed\nor agreed to contribute to the plaintiff’s costs in return for a\nshare of any money or property which the plaintiff may recover in\nthe action or proceeding, and the non-party is a person against whom\na costs order may be made, then, if having regard to all the circumstances\nof the case, the Court thinks it just to do so, it may order the\nnon-party to give such security for the defendant’s costs of the\naction or other proceeding as the Court thinks just. 5       A\ntwo-stage test is to be applied to determine whether a non-party should\nbe ordered to provide security for the defendant’s costs. At the\nfirst stage, the defendant has to establish that the non-party contributed\nor agreed to contribute towards the plaintiff’s legal costs in return\nfor a share of the money or property which the plaintiff may recover\nin the action or proceedings. If the first stage is satisfied, then\nthe issue at the second stage would be whether the non-party is\na person against whom a costs order may be made and whether it would\nbe just to order the non-party to provide security for costs. Stage One – Litigation Funder? 6       For\nthe first stage, it was not disputed that Sinwa HK had made payment\nof the costs owed by the Plaintiff to the Defendant. The issue before\nme was whether this payment of costs wasin\nreturnfor a share of any money or property which the\nPlaintiff may recover in the action or proceedings. On the facts\nbefore me, there was no agreement between Sinwa HK and the Plaintiff\nthat Sinwa HK will received any direct benefit or share in the damages\nreceived if the Plaintiff is successful. Rather, the Defendant counsel\nargued that a wide interpretation should be applied and an indirect\nbenefit of the fruits of the litigation would be sufficient to satisfy this\nlimb. It was pointed out that Sinwa HK had admitted on affidavit\nthat its shares in the Plaintiff will increase in value if the Plaintiff\nis successful.This is the indirect benefit which Sinwa HK would\nreceive in return for its contribution to the Plaintiff’s costs.\nThe Defendant counsel submitted that if the Plaintiff was successful\nand assuming it recovers USD10 million from the Defendant, the value\nof Sinwa HK’s shares in the Plaintiff would increase by USD5 million\nas Sinwa HK owns 50% of the issued share capital of the Plaintiff.\nThis would amount to Sinwa HK paying for the Plaintiff’s costs of\nlitigation in return for a share of money that the Plaintiff may\npotentially recover from the Defendant. 7       Sinwa\nHK’s counsel argued that this rule covers litigation funders, who\nfund litigation in exchange for a direct share of the benefits of\nthe litigation. It was submitted that this does not apply to a derivative\naction where Sinwa HK’s contribution towards the Plaintiff’s costs\nis not in exchange for a share of the proceeds of the action, but\nto pursue the Plaintiff’s rights. The fact that Sinwa HK, a shareholder,\nwill receive some indirect benefit due to an increase in the share\nvalue does not satisfy the requirements of this rule. 8       An\nunderstanding of the purpose behind this rule would assist in the interpretation\nto be applied. In the commentary on Order 23 Rule 1(3) in theSingapore Court Practice 2014(LexisNexis,\n2014) at page 1021, Professor Jeffrey Pinsler noted that the scope\nof the security for costs provisions were extended to non-parties\nas the“limitation of O23 to the power to award security for costs against\na nominal plaintiff (and the absence of such a power against thenon-party plaintiff) was a weakness because the nominal\nplaintiff might have been uninterested and impecunious while the non-party,\nwho wasfunding the litigation, was beyond the reach of the court.”(emphasis\nadded) Therefore, it appears that the securities for costs provisions\nwere extended to cover litigation funders. 9       The\nrationale for extending the security for costs provisions to cover litigation\nfunders may be seen from the observations of Hodgson JA sitting in\nthe New South Wales Court of Appeal inGreen\n(as liquidator of Arimco Mining Pty Ltd) v CGU Insurance Ltd[2008]\nNSWCA 148 at [51]: …a court should be readier to order security\nfor costs where the non-party who stands to benefit from the proceedings\nis not a person interested in having rights vindicated, as would\nbe a shareholder or creditor of a plaintiff corporation, but rather\nis a person whose interest is solely to make a commercial profit\nfrom funding the litigation. Although litigation funding is not\nagainst public policy (Campbells Cash and Carry\nPty Limited v Fostif Pty Limited[2006] HCA 41; 229 CLR\n386 at [87]-[95]), the court system is primarily there to enable\nrights to be vindicated rather than commercial profits to be made;\nand in my opinion, courts should be particularly concerned that\npersons whose involvement in litigation is purely for commercial\nprofit should not avoid responsibility for costs if the litigation fails. 10     It\nseems to me that the Defendant counsel’s interpretation of Order 23\nrule 1(3)(b) is not in line with the purpose behind this rule. The\nwords of Order 23 rule 1(3)(b) support the interpretation that it\nis aimed at non-parties whose only interest in the proceedings is\nto make a commercial profit i.e. litigation funders. Sinwa HK is\na shareholder who had obtained leave of the Court of Appeal to commence\nthis derivative action. Sinwa HK clearly has an interest in the\nproceedings and is not a litigation funder. Therefore, Stage One\nis not satisfied. Stage Two – Whether it would\nbe just to order security 11     Even\nif I were to accept that a wide interpretation should be given to Order\n23 rule 1(3)(b), which I do not, I am of the view that the second\nstage is not satisfied as it would not be just to order Sinwa HK\nto provide security for the Defendant’s costs. 12     The\nprinciples governing the court’s exercise of discretion in respect of\ncosts to be paid by a non-party were summarised by the Privy Council\ninDymocks Franchise Systems (NSW) Pty Ltd\nv Todd[2004] 1 WLR 2807 (“Dymocks”).\nThese were adopted with approval by the Singapore Court of Appeal\ninDB Trustees (Hong Kong) Ltd v Consult Asia\nPte Ltd[2010] 3 SLR 542 (“DB Trustees”)\nat [36]: …The core consideration in relation to\nthe court’s exercise of discretion in ordering costs against a non-party\nis that it must bejust, in all\nthe circumstances of the case, to do so. …Ordinarily, considerable\nweight would be placed on the presence of two factors,viz, a close connection between the non-party and\nthe proceedings and a causal link between the non-party and the\nincurring of costs.[emphasis added] 13     The\nprinciples governing the court’s discretion in respect of costs\nto be paid by a non-party would similarly apply to the court’s discretion\nin respect of the provision of security of costs by a non-party. 14     First,\nwhile there is a close connection between Sinwa HK and the current\nproceedings, this factor by itself would not be sufficient to justify ordering\nSinwa HK to provide security for the Defendant’s costs. 15     While\nSinwa HK is one of the two shareholders of the Plaintiff and would,\ntherefore, be one of beneficiaries of a successful outcome of the current\nproceedings, that is merely one factor to be taken into consideration.\nChan Seng Onn J inRaffles Town Club Pte Ltd\nv Lim Eng Hock Peter and others (Tung Yu-Lien Margaret and others,\nthird parties)[2011] 1 SLR 582 (“Raffles\nTown Club”) was of the view (at [26]) that the fact that\nthe non-parties were the only shareholders of the company should not\nbe the “overriding factor in consideration”. Otherwise, this would “drive\na coach and horses through the doctrine of the separate liability\nof the company”. It was further held at [26]: …Fiduciary duties are owed by directors\nto the company, not to the shareholders directly, and it is thecompanywhich has to enforce those duties against\nthe directors even though it may well be the present shareholders\nand directors who are controlling the litigation. Thus, if the company\nhas not succeeded in establishing its claim of breach of fiduciary\nduties against the directors who are not or no longer shareholders\nof the company,it is the company which has\nto pay the legal costs of the directors who have successfully resisted\nits claims, not the shareholders of the company. Such are the consequences\nof the doctrine of separate legal personality. InDB Trustee, it was Ms Koh’s lack of cooperation\nwith the receivers, denying them access to documents pertaining\nto the affairs and property of Consult Asia that precipitated the\nlitigation instituted by DB Trustees. [emphasis added] 16     Similarly\ninNanyang Law LLC v Alphomega Research GroupLtd [2012]\n4 SLR 1153 (“Nanyang Law”), the\ndoctrine of separate legal personality of a company was the basis\non which Choo Han Teck J declined to order the non-party to bear\nthe costs of the proceedings. Choo Han Teck J held at [5]: …that by ordering costs against a non-party\nwho is a shareholder and director of an impecunious litigant company,\nthe court pierces the corporate veil… [this] is not an order the\ncourt would be quick to make. …being the managing director alone,\nand thus, having a substantial connection to the case is only one\nof the many factors the court would take into account. It is also\nnot a principle of law that where a litigant company is unable to\npay costs the successful party can look to the person with a close\nconnection to it and the litigation for costs. Much of the law that\npermits the corporate veil to be lifted concerns fraud or highly\nunconscionable conduct. … 17     Second,\nthe causal link. A non-party would generally not be made liable\nfor costs if those costs would have been incurred in any event even without\nthe non-party’s involvement in the proceedings. On the present facts,\nthis is a derivative action which was commenced in the name of the Plaintiff\nby Sinwa HK. While on the surface, it appears that the casual link\nis satisfied, it has to be borne in mind that Sinwa HK did not act\nunreasonable in commencing this derivative action as it had obtain\nand commenced this action with the leave from the Court of Appeal. 18     Before\nI move on to the third factor, I wish to deal with the Defendant’s\nargument that since Sinwa HK is the shareholder directing this common\nlaw derivative action on behalf of the company, it would normally be\nexpected to pay for the costs of the action, though the fruits of\nthe victory go to the company. Reliance is placed onWalter Woon on Company Law(Sweet &\nMaxwell Asia, 2005) 3rded at [9.65]\nfor this argument. I believe the Defendant has misunderstood Professor\nWoon. The position stated by Professor Woon refers to an action\nwhere a shareholder commences the derivative action on behalf of\nall the shareholders except the defendants and the company is joined\nas a defendant in order to be bound by the results of the the action.\nIt is in this context that Professor Woon commented that the shareholder,\nwho is the plaintiff in the derivative action, should expect to pay\nfor the costs of the litigation. The current proceedings are different\nas it is the company who is named as the Plaintiff. As stated above,\nthe decision to pierce the corporate veil and hold a shareholder,\na non-party, responsible for the costs incurred by the company who\nis the Plaintiff is not one which is to be taken lightly. 19     The\nthird and most important factor is that the Plaintiff is at all material\ntimes a solvent company. Chan Seng Onn J inRaffles\nTown Clubat [28] held that “apart from the “close connection”\nand “causal link” elements, theinability of\nthe unsuccessful partyto pay the\ncosts of litigationis an important factor in the determination\nof whether it would be just to make the non-party bear the costs”\n(emphasis added). The inability of the unsuccessful company to pay\nthe costs of litigation inDymocksand\ninDB Trusteeswas a determinative\nfactor in the court’s decision to order a third party to bear the\nlitigation costs of the unsuccessful company. 20     Both\nsolicitors for the Plaintiff and the Defendant admitted that the Plaintiff\nis a solvent company and there is no evidence that it would not\nbe able to pay the costs of litigation. The Plaintiff has stated\non affidavit that the Plaintiff has funds in a bank account in Singapore\nand is also the owner of a vessel which has a desk top value of\napproximately USD15.5 million. The Defendant has challenged the\nvaluation of the vessel saying that the vessel only has a value\nof USD2 million. However, the Defendant did not provide any documents\nin support of its valuation. In any event, it is clear that the\nvessel is a valuable asset which belongs to the Plaintiff. 21     I\nalso understand from both counsels for the Plaintiff and Defendant that\nthe Plaintiff has not been able to access its funds in its Singapore\nbank account as the Defendant has so far not agreed to authorise\nany withdrawals from the Plaintiff’s bank account. Therefore, Sinwa\nHK has had to pay the costs payable from the Plaintiff to the Defendant.\nSince the Plaintiff’s inability to access its funds to pay legal\ncosts was caused by the Defendant, it would not be just to allow\nthe Defendant to rely on this as a basis to seek security for costs\nfrom Sinwa HK. 22     For\nthe above reasons, I am of the view that it would not be just to order\nSinwa HK, a non-party, to provide security for the Defendant’s costs. 23     As\nthe Defendant has failed to satisfy both Stage One and Two, Sinwa HK\nwill not be ordered to provide security for the Defendant’s costs.",
        "Nominal Plaintiff": "24     The\nDefendant’s application for security for costs from the Plaintiff\nis on the basis that the Plaintiff is a nominal plaintiff. This\nis based on Order 23 Rule 1(1)(b) which provides: 1(1)  Where,\non the application of a defendant to an action or other proceeding\nin the Court, it appears to the Court – … (b)    that\nthe plaintiff (not being a plaintiff who is suing in a representative\ncapacity) is a nominal plaintiff who is suing for the benefit of\nsome other person and that there is reason to believe that he will\nbe unable to pay the costs of the defendant if ordered to do so; … then, if, having regard to all the circumstances\nof the case, the Court thinks it just to do so, it may order the\nplaintiff to give such security for the defendant’s costs of the\naction or other proceedings as it thinks just. 25     The\nDefendant submits that as the current proceedings were commenced\nby Sinwa HK as a derivative action in the Plaintiff’s name and as\nSinwa HK is the main party who has conduct of the current proceedings, the\nPlaintiff should be regarded as a nominal plaintiff. 26     It\nis necessary to understand the nature of a derivative action to\naccess the weight of the Defendant’s submissions. InWallersteiner v Moir (No. 2)[1975] 2\nWLR 389 (“Wallersteiner”), the English\nCourt of Appeal at [396 C-D] adopted the observation ofProfessor Gower in Modern Company Law, 3rded\n(1969), p587 as to what constitutes a derivative action: [where an action brought on behalf of the\ncompany by minority shareholders as the company’s representatives\nto seek redress for the company] is allowed, the member is not really\nsuing on his own behalf nor on behalf of the members generally,\nbut on behalf of the company itself. Although… he will have to frame\nhis action as a representative one on behalf of himself and all the\nmembers other than the wrongdoers, this gives a misleading impression of\nwhat really occurs. The plaintiff shareholder is not acting as a representative\nof the other shareholders, but as a representative of the company…In\nthe United States … this type of action has been given the distinctive\nname of a ‘derivative action,’ recognising that its true nature\nis that the individual member sues on behalf of the company to enforce\nrights derived from it. 27Walter Woon on Company Law(Sweet &\nMaxwell Asia, 2005) 3rded at [9.65]\nconfirms that in a derivative action, “[normally], the shareholder who\ninstigates a suit should expect to pay for it, even though thefruits of the victory go to the company.”\n(emphasis added) 28     It\nis clear that in while a derivative action is commenced by a shareholder\nwho has conduct of the proceedings, it is the plaintiff company who\nwould receive the benefits and fruits of the derivative action. Therefore,\nin the current derivative action, the Plaintiff is not suing for\nthe benefit of some other person. It is the Plaintiff who will receive\nthe benefits of a successful outcome of the proceedings. The Plaintiff\nis not a nominal plaintiff. 29     Further,\nOrder 23 Rule 1(1)(b) also requires the Defendant to show that the\nPlaintiff is not able to pay the costs of the Defendant if ordered\nto do so. As stated above at [20], I am of the view that the Plaintiff\nis a solvent company and will be able to pay the costs of the Defendant\nif ordered to do so. 30     Accordingly,\nI am of the view that the Plaintiff company is not a nominal plaintiff\nand there are no grounds to order it to provide security for costs\nunder Order 23 1(1)(b). 31     In\nlight of the above, the application for security for costs from\nSinwa HK, a non-party and/or the Plaintiff on the basis it is a\nnominal plaintiff was therefore dismissed with costs to the non-party\nand the Plaintiff."
    }
}