{
    "case_title": "Su Ah Tee and others\n      v\n      Allister Lim and Thrumurgan (sued as a firm) and another (William Cheng and others, third parties)",
    "ncitation": "[2014] SGHC 159",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       In this action, the plaintiffs are claiming damages for breach of contract and negligence from the defendants who acted as their solicitors in the purchase of a Housing Development Board (“HDB”) shophouse situated at Blk 63 Kallang Bahru, #01-423, Singapore (“the Property”). The plaintiffs allege that it was only sometime after the purchase was completed that they learnt that: (a) they had paid $900,000 for a property which had only 17 years remaining out of a 30-year lease, instead of what they had expected, which was a property with 62 years of its lease remaining (“the tenure problem”), and (b) the Property was subject to a head tenancy agreement instead of two separate tenancy agreements which the first plaintiff had received with the option to purchase (“the tenancy problem”). The plaintiffs allege that the defendants,inter alia, failed to advise or inform them of the tenure problem before completion or at all, and further, failed to advise them on the head tenancy to which the sale of the Property was subject. The plaintiffs claim that these breaches have caused them to suffer loss and damage, including overpayment for the Property. 2       The scope of the defendants’ professional duty to the plaintiffs is central to the plaintiffs’ claim against the defendants (“the main action”) since the starting point of any discussion on liability for damages must be the precise nature of the duty which has allegedly been breached. In this judgment, the content of the defendants’ professional duty to the plaintiffs and an understanding of the facts and circumstances giving rise to that duty will be examined. 3       Regrettably, through an unfortunate coincidence of events and sheer bad luck, the real position on the Property’s leasehold tenure was not appreciated before completion of the conveyancing transaction. The facts reveal that the defendants carried out a Singapore Land Authority (“SLA”) title search on the Property before the option to purchase was exercised on 7 April 2011, and they learnt from the search results that the Property had a 30-year lease with effect from 1 August 1998, of which only 17 years remained at the time the option was purchased. However, that particular piece of information was not passed on to the plaintiffs. Ironically, the defendants, in their capacity as solicitors for the lender-bank, provided the latter with a report on the Property’s title that mentioned the Property’s leasehold tenure of 30 years with effect from 1 August 1998. For unknown reasons, despite that report, the lender-bank offered and the plaintiffs accepted a 30-year term loan that was secured by a property (ie, the Property) with only 17 years remaining out of its 30-year lease. 4       Interestingly, as can be seen from the brief narration at [3] above, this case is not about losses incurred as a result of the plaintiffs’ reliance on erroneous or inaccurate information provided by the defendants. Rather, it is about losses incurred following the defendants’ failure to provide the plaintiffs the requisite information for them to make an informed decision as to whether to proceed with the purchase of the Property. This distinction is relevant to the evidential burden which the plaintiffs have to discharge. If the plaintiffs’ case had been based on reliance on erroneous or inaccurate information from the defendant, it would have been sufficient for the plaintiffs, in order to prove their case, to demonstrate that they had relied on the defendants’ information. However, in view of how the plaintiffs have pleaded their case, the plaintiffs must satisfy the court, on a balance of probabilities, that they would not have purchased the Property at $900,000 if the defendants had conveyed to them relevant information on the tenure problem and the tenancy problem (collectively “the tenure & tenancy problems”) at any time before completion. 5       The defendants have brought third party proceedings (“the third party action”) for an indemnity, or alternatively a contribution under s 15 of the Civil Law Act (Cap 43, 1999 Rev Ed) (“the Civil Law Act”) from (a) the vendor of the Property, William Cheng (“Cheng”); (b) the plaintiff’s property agent, Ng Sing; and (c) Ng Sing’s then-employer, SGR Property Pte Ltd (“SGR Property”). The defendants’ case against the third parties is that they had each, amongst other things, fraudulently and/or negligently misstated that the Property had 62 years of its lease remaining and was being sold subject to two tenancy agreements when that was clearly not the true position. 6       On the first day of the trial, Cheng, the first third party, withdrew his counterclaim against the defendants. Hence, the claims which this court has to deal with in this judgment are confined to: (a) the plaintiffs’ claims against the defendants in the main actionvis-à-visthe latter’s handling of the conveyancing transaction; and (b) the defendants’ indemnity and contribution claims against the third parties in the third party action. 7       In the course of the arguments presented in the main action and in the third party action, a number of subsidiary matters were ventilated and many authorities were cited. It is unnecessary for me to address in this judgment every subsidiary matter that was raised as some have little or no bearing on the claims whilst others merely add to the chronology of events. Therefore, I will make findings on these subsidiary matters where necessary in this judgment, but my focus will be on the core issues in dispute.",
        "The parties": "8       The first plaintiff, Su Ah Tee (“Su”), is a businessman. His son, Su Hong Quan (“Hong Quan”), and his wife, Lye Yin (“Lye”), are the second and third plaintiffs respectively. It is not disputed that: (a) at all material times, Su had a personal interest in the purchase of the Property and was the person who had negotiated (through Ng Sing) with Cheng; and (b) it was Su who had engaged the defendants to act for the plaintiffs in the conveyancing transaction. It is also not disputed that Su made use of the names of his son and his wife to purchase the Property and provided all the funds for the purchase aside from the money obtained from a bank loan. In short, Hong Quan and Lye were Su’s nominees. The defendants accept that they had a solicitor-client relationship not only with Su, but also his nominees. Only Su and Hong Quan testified at the trial. 9       The particular solicitor who had conduct of the plaintiffs’ conveyancing transaction is the second defendant, Allister Lim (“Lim”), a partner in the first defendant, M/s Allister Lim & Thrumurgan (“ALT”). Lim qualified as a lawyer in 1999, and his practice has included conveyancing since 2004. The defendants had previously acted for Su in other conveyancing transactions. According to Su, Lim was the solicitor whom he had instructed to act on his behalf in relation to other conveyancing transactions from December 2010 to 2011. 10     Cheng, the first third party, is the vendor of the Property. He is a semi-retired cleaning supervisor and was the registered owner of the Property before it was sold to the plaintiffs. 11     Ng Sing is the second third party. He was employed by the last third party, SGR Property, at the material time. As stated, Ng Sing was Su’s property agent in relation to the sale and purchase of the Property. He testified on behalf of the plaintiffs. 12     Other persons who testified at the trial were: (a)     Oh Seng Lee (“Sam Oh”), a property agent with PropNex Realty Pte Ltd at the material time, who now works as a warehouse supervisor. Sam Oh, who purportedly acted as Cheng’s agent in the sale and purchase of the Property, was also a co-broker with Ng Sing in the transaction; (b)     Fu Lee Ping (“Fu”), ALT’s conveyancing clerk at the material time; (c)     Boldwin Sim (“Sim”), a home loan manager at a branch office of the lender-bank who dealt with Su’s loan application; (d)     Derrick Wong (“Wong”), the plaintiffs’ expert witness on conveyancing practices; and (e)     the respective parties’ expert who gave evidence on the value of the Property. Cheng’s solicitors for the transaction, M/s Esvaran & Tan (“E&T”), did not testify at the trial. 13     The plaintiffs’ counsel is Mr Thomas Lei (“Mr Lei”) while the defendants’ counsel is Mr Christopher Anand Daniel (“Mr Daniel”). Cheng is represented by Mr Subbiah Pillai (“Mr Pillai”), and Ng Sing (the second third party) by Mr Joseph Chai. SGR Property filed its defence in the third party action, but was neither present nor represented at the trial.",
        "The arguments in the main action": "14     Essentially, the plaintiffs’ case is that if they had known of the tenure & tenancy problems, they would not have gone ahead with the purchase of the Property as the purchase price of $900,000 was too high for the Property. The plaintiffs invite the court to find the following facts as proved in respect of the aforementioned problems: The tenure problem (a)     The defendants were aware that Su had been told that there were 62 years remaining on the lease of the Property as Su had conveyed the same information to Fu in March 2011. (b)     The defendants became aware on 5 April 2011 that the Property’s leasehold tenure was a 30-year term of which only 17 years remained. (c)     The defendants failed to inform, communicate with or advise the plaintiffs on the tenure problem prior to the exercise of the option to purchase or at any time thereafter before the completion of the sale and purchase of the Property. The tenancy problem (a)     The defendants knew that the Property was to be sold subject to tenancy, but failed to appreciate that the sale and purchase of the Property was subject to a head tenancy and that the two tenancy agreements which they had earlier received from Su were sub-tenancies. (b)     The defendants failed to explain the legal effect and implications of all three tenancy agreements to the plaintiffs. 15     The defendants deny any breach of duty owed to the plaintiffs and argue that Su was committed to the transaction from the start. They allege that Su was eager to complete the transaction and was willing to bend over backwards to get the deal done. Specifically, their defence is as follows: The tenure problem (a)     Su did not communicate to Fu that the Property had 60-plus years remaining on its lease. (b)     Defendants were not given any specific instructions to look into the remainder and duration of the lease on the Property. (c)     There was no duty (whether specific or general) on the defendants’ part to inform the plaintiffs about the particulars of the Property’s leasehold tenure or to pass on to the latter the results of the SLA title search on the Property. The tenancy problem (d)     The head tenancy to which the sale of the Property was subject was passed to the defendants less than a week before the completion of the sale and purchase of the Property. (e)     The plaintiffs did not inform the defendants that they had any issues with any of the tenancy agreements that required the defendants’ legal advice or assistance. (f)     Given Lim’s standing arrangement with Su (see [106] below), the defendants did not owe any duty to explain to the plaintiffs the effect of the head tenancy agreement and its implications on the two sub-tenancy agreements. 16     The defendants’ alternative contention is that even if they are liable, the plaintiffs are only entitled to recover the difference in the price (ie, the difference between the contract price and the market value) attributable to the Property at a later date and not at date of the breach. In this respect, the defendants contend that any upward appreciation in the value of the Property should be taken into consideration.",
        "The arguments in the third party action": "17     In the event that the plaintiffs succeed in the main action, the defendants’ case for an indemnity or contribution from the third parties is that they had each,inter alia, fraudulently and/or negligently misstated that there were 62 years remaining on the lease and that the Property was being sold subject to two tenancies instead of a head tenancy, when that was clearly not the true position. These misstatements caused the plaintiffs to suffer the same loss. 18     In denying any obligation to indemnify the defendants or contribute to the damages which the defendants may be liable to pay the plaintiffs, the third parties each contend that they never met or spoke to the defendants and, hence, never made any representations to the defendants. More importantly, the third parties argue that the defendants have no reasonable prospect of establishing a successful claim under s 15 of the Civil Law Act since the third parties are not liable for “the same damage” as the defendants. Under s 15(1), in order for the defendants to be able to claim contribution at all from the third party, it is necessary that the third parties and the defendants are, at least to some extent, liable and responsible to the plaintiffs for “the same damage”. On this point, this court will have to decide with reference to the facts and circumstances of this case, what exactly “the same damage” is and to what extent the defendants and the third parties are liable for “the same damage”. 19     For the purposes of the third party action, the legal issues relate to the interpretation of the phrases “the same damage” and “the damage in question” in ss 15(1) and 16(1) of the Civil Law Act respectively.",
        "Preliminary points to note in relation to the evidence": "20     The following issues are preliminary points to note in relation to the evidence as they are relevant to both the main action and the third party action.",
        "The Property was purchased in the names of Su’s nominees": "21     With regard to Su and his expectations after having instructed the defendants to handle the conveyancing transaction, it is important to note some facts. First, Su bought the option to purchase the Property which was dated 18 March 2011,beforeengaging the defendants. I will hereafter refer to this option to purchase as “the SGR-Option” as it was prepared and typed on the letterhead of SGR Property by Ng Sing. The SGR-Option was received and accepted by Su from Ng Sing on or around 18 March 2011, and a cheque for $9,000 (being 1% of the purchase price of $900,000) was issued in favour of Ng Sing, who had earlier advanced the 1% of the purchase price to Cheng as the option fee for the SGR-Option. 22     Second, Su was the intended purchaser named in the version of the SGR-Option that Su received on or around 18 March 2011. That version of the SGR-Option did not provide for the option to be exercised by Su’s nominees. 23     Third, the second and third plaintiffs eventually became the named purchasers (see [24] below). Initially, when the SGR-Option was exercised on 7 April 2011 in the names of Su’s nominees, Cheng rejected it. Cheng subsequently agreed to accept the exercise of the SGR-Option in the names of Su’s nominees upon Su paying an additional deposit of 5% of the purchase price (ie, a sum of $45,000) on 14 April 2011. The point to note is that the defendants were not involved in the negotiations to add Su’s nominees to the SGR-Option; that was a matter negotiated by Su through Ng Sing. 24     For convenience, the material portions of the version of the SGR-Option that was eventually used for the completion of the sale and purchase of the Property are reproduced below. The portions of the SGR-Option that are double underlined were not in the version of the SGR-Option that Su received from Ng Sing on or around 18 March 2011, but were unilaterally added in later by Ng Sing before the option was exercised. All portions that are single underlined were handwritten into the version of the SGR-Option that Su received on or around 18 March 2011.[note: 1]  25     The completion date for the sale and purchase of the Property was 22 June 2011. The purchase price was $900,000.",
        "The SGR-Option stated that the Property was to be sold subject to tenancy": "26     The SGR-Option identified the Property by its Kallang Bahru address. It did not expressly stipulate the nature of the legal tenure that Cheng had contracted to sell. It is, however, common ground that the subject matter of the SGR-Option was a leasehold interest in an identified HDB shophouse. As regards Su’s belief that there were 62 years remaining on the lease, there was no allegation that Cheng had represented the Property’s leasehold tenure to be either 78 or 99 years. I digress to elaborate that the term of the leasehold tenure for other shophouses located in the same block as the Property in Kallang Bahru is 78 years commencing 1 August 1995, and not 99 years (see [47] below). The Property is “unique” in that it is the only shophouse in Block 63 whose term of the leasehold tenure is 30 years. 27     Clause 4 of the SGR-Option expressly stated that the sale of the Property was “subject to existing tenancy agreement”. No tenancy agreement was “attached” to the SGR-Option contrary to what was stated in cl 4. Neither was the amount of the monthly rent stated in that clause. However, the plaintiffs’ pleaded case, which is borne out by the evidence, is that the SGR-Option was handed to Su by Ng Sing on or around 18 March 2011 at Su’s residence together with copies of the two tenancy agreements described at [30(a)] and [30(b)] below.[note: 2] 28     A point to note here is that the first time Su e-mailed copies of the same two tenancy agreements to the defendants was on 25 April 2011afterthe SGR-Option was exercised (on 7 April 2011) and after the further payment of $45,000 to Cheng (on 14 April 2011). There was no averment in the pleadings that copies of these two tenancy agreements were handed over to Fu on or about 24 or 25 March 2011 when Su (so he alleges) had first met Fu to instruct the defendants to handle the conveyancing transaction. Copies of the two tenancy agreements were subsequently e-mailed to the defendants on 11 May and 15 June 2011.[note: 3] 29     A third tenancy agreement (which is hereafter referred to as “the head tenancy” or “the Invoice Factoring Tenancy”) was disclosed to Su on 20 June 2011, two days before the scheduled completion on 22 June 2011.[note: 4]It transpired that on 15 June 2011, E&T faxed three tenancy agreements to the defendants, and Fu sent them on to Su on 20 June 2011.[note: 5]Unlike the initial completion account that E&T sent on 10 June 2011, which referred to two tenancy agreements (ie, the two that Su received on or around 18 March 2011 with the SGR-Option), the final version of the completion account that E&T sent to ALT on 20 June 2011 referred to only one tenancy agreement, namely the Invoice Factoring Tenancy (see [30(c)] below). This was to take into account the head tenancy which E&T sent to ALT on 15 June 2011. Cheng did not call E&T to testify despite his claim that he had told E&T about all three tenancies as early as April 2011. On the evidence before this court, I am of the view that E&T received the Invoice Factoring Tenancy only sometime between 10 and 15 June 2011 after it was stamped on 10 June 2011. 30     For convenience, the three tenancy agreements mentioned above are as follows: (a)     A tenancy agreement dated 22 February 2011 between one “Invoice Factoring” (as landlord) and one Lochen International Pte Ltd (“Lochen”) and Chen Bo (as tenants) for the use of the first storey of the Property (“the Lochen Tenancy”). The tenancy was for two years from 1 March 2011 to 28 February 2013 at a monthly rent of $2,200. The rental deposit was $2,200. This tenancy agreement was not stamped and was received by Su with the SGR-Option. (b)     A tenancy agreement dated 15 March 2011 between Cheng (as landlord), trading as “Invoice Factoring LLP”, and one Mdm Erniwati (as tenant). This tenancy was for the second storey of the Property (“the Erniwati Tenancy”). It transpired that Mdm Erniwati was Cheng’s daughter-in-law.[note: 6]The Erniwati Tenancy was for one year from 1 April 2011 to 31 March 2012, with an option to extend the tenancy for two more years. The rent was $1,600 a month and the rental deposit was $1,600. This tenancy agreement was not stamped and was received by Su with the SGR-Option. (c)     A tenancy agreement dated 22 February 2011 between Cheng (as landlord) and “Invoice Factoring” (as tenant) in respect of the whole of the Property. This is the Invoice Factoring Tenancy or the head tenancy referred to at [29] above.[note: 7]The tenancy period was for three years from 1 March 2011 to 1 March 2014, with an option to extend the tenancy for a minimum of three years. The deposit was $3,800. Rent was $2,000 a month with an additional $1,800 per month for utilities. The head tenancy was stamped on 10 June 2011.[note: 8] 31     The Invoice Factoring Tenancy was the head tenancy and it purported to give Cheng an interest in the Property as head tenant even after the sale. This also meant that the Erniwati Tenancy and the Lochen Tenancy (collectively “the two Tenancy Agreements”) were sub-tenancy agreements, and the plaintiffs would be landlords only to Invoice Factoring. Completion took place on the footing that the Invoice Factoring Tenancy was the applicable tenancy (see [29] above). 32     Both the plaintiffs and the defendants invited me to consider the validity of the Invoice Factoring Tenancy. The defendants and the plaintiffs both submit that Cheng was guilty of self-dealing by contracting with Invoice Factoring and this consequently meant that it was invalid.[note: 9]This argument will be dealt later in relation to the tenancy problem as this issue of validity only matters as a factor in considering the defendants’ breach of duty (see [104] below).",
        "Cheng’s relationship with Sam Oh and Ng Sing": "33     Cheng denied that Sam Oh was appointed as his agent to sell the Property. Furthermore, Cheng claimed that Sam Oh knew from the outset that there were only 17 years remaining out of the Property’s 30-year lease and that the Invoice Factoring Tenancy was made known to Su at an early stage. In my view, this assertion was Cheng’s way of dispelling Sam Oh’s and Ng Sing’s evidence that it was Cheng who had informed them that there were 62 years remaining on the lease of the Property. 34     In my view, Cheng’s challenge that Sam Oh was not his agent in the sale and purchase transaction fails. I am satisfied that Sam Oh acted as Cheng’s agent and that the $9,000 paid as commission was shared between Sam Oh and Ng Sing because of the co-brokering arrangement between the two agents. Sam Oh’s claim that he acted as agent for Cheng is borne out by the documentary evidence. Besides cl 10 in the SGR-Option that promised a commission of 1% of the purchase price ($9,000) to SGR Property upon completion of the sale and purchase of the Property, there is also an SGR Property co-brokering agreement signed by both Sam Oh and Ng Sing on 18 March 2013 stating that $4,500 was to be paid to SGR Property as commission upon the purchaser’s receipt of the Property.[note: 10]The veracity of this document and its contents were not challenged by Cheng. A handwritten note disclosed by Cheng, which was identified to have been written by him and one of the co-brokers (either Ng Sing or Sam Oh), stated that Cheng had paid $4,500 as commission and a balance of $4,500 was to be paid upon completion.[note: 11]An SGR Property invoice was later issued to Cheng on 28 June 2011 for a commission amount of $9,000.[note: 12] 35     I reached this conclusion about Sam Oh’s status despite Cheng’s testimony on how he met Sam Oh and that the latter was aware of the remaining duration of the Property’s leasehold tenure from the outset. According to Cheng, it was Sam Oh who approached him to buy the Property in December 2010 (ie, Sam Oh was first interested buyer), and he had shown Sam Oh a copy of a letter from HDB that clearly stated that the leasehold tenure of the Property was for 30 years commencing, 1 August 1998.[note: 13]It was only in late January or early February 2011 that Sam Oh revealed to Cheng that he was an estate agent and that his friend was interested in buying the Property at $900,000. Ng Sing was then introduced to Cheng as the second interested buyer on or around 18 March 2011. 36     Cheng’s evidence is that Ng Sing issued a cheque of $9,000 in exchange for an option to purchase that was prepared by Cheng (“the Cheng- Option”).[note: 14]The Cheng-Option, dated 18 March 2011, was made out to Ng Sing and/or his nominees and was to expire on 1 April 2011.[note: 15]A copy of the head tenancy was also attached to the Cheng-Option. Cheng denied that there were 62 years remaining on the lease of the Property and relied on the Cheng-Option which stated that the leasehold tenure of the Property was for 30 years commencing from 1 August 1998. There was also no discussion about the valuation of the Property.[note: 16] 37     According to Cheng, Ng Sing later found Su to buy the Property. Sam Oh and Ng Sing then met Cheng on or around 25 March 2011. At that meeting, Cheng was asked to use the SGR-Option (without the word “nominees” added).[note: 17]The differences between the SGR-Option and the Cheng-Option were as follows:[note: 18] (a)     the SGR-Option was printed on SGR Property’s letterhead; (b)     Ng Sing was replaced by Su whom Cheng did not know as the interested purchaser; (c)     a clause for commission payment to SGR Property was included; (d)     the SGR-Option was backdated to 18 March 2011, but the last date to exercise the SGR-Option was extended to 7 April 2011; (e)     the original deposit of 10% was reduced to 5%; and (f)     clause 11 of the SGR-Option was added. Regardless of the changes described and the fact that certain terms were not what Cheng had initially intended, Cheng agreed to use the SGR-Option for the sale and purchase of the Property and signed it. 38     In contrast, Su, Ng Sing and Sam Oh gave completely different accounts of the events. Ng Sing’s and Sam Oh’s accounts of the chronology of events began only in February 2011, as opposed to December 2010. At that time, Ng Sing told Sam Oh that there was a prospective buyer of a HDB shophouse unit in the Kallang Bahru area. Sam Oh then placed an advertisement in a local Chinese newspaper seeking information about HDB shophouses that were available for sale in the Kallang Bahru area.[note: 19]This advertisement was not produced to the court in evidence. Ng Sing explained that he did not place an advertisement himself for two reasons.[note: 20]First, it was improper for him to represent any potential seller when he was already Su’s agent. Second, it was intended that Sam Oh would act as the seller’s agent and collect a seller’s commission from the sale, which could then be split between them. In that way, Ng Sing would be able to receive extra money from the sale and purchase of the Property. Sam Oh and Ng Sing thus agreed to act as co-brokers in the transaction.[note: 21] 39     Sam Oh’s version is that Cheng called him about the advertisement he had placed. In that telephone call, Sam Oh agreed to be his agent.[note: 22]Cheng informed Sam Oh that there were 62 years remaining on the lease of the Property. Sam Oh conveyed that information to Ng Sing. After some negotiations, the price was lowered from $1.1m to $900,000. As the price was agreed upon, Su instructed Ng Sing to secure an option to purchase the Property.[note: 23] 40     As for Cheng’s evidence that he had shown Sam Oh the HDB letter mentioned at [35] above when Sam Oh approached him about the sale of the Property, Sam Oh’s testimony was that he did not receive the document as alleged, and that he saw the document for the first time in his cross-examination.[note: 24]This testimony was not challenged by Cheng’s counsel, Mr Pillai, in his cross-examination of Sam Oh. 41     During cross-examination, Cheng said that he could not read Chinese and the Chinese newspapers, and would not have seen Sam Oh’s advertisement. He explained that it was Sam Oh who had approached him and not the other way round.[note: 25]While this aspect of the evidence was plausible, the rest of Cheng’s story was not credible. 42     As regards Cheng’s evidence that Sam Oh made a verbal offer to buy the Property, this evidence has little weight since the verbal offer was never reduced into writing. There was thus nothing to support Cheng’s assertion that Sam Oh was his first intended buyer. 43     Ng Sing and Sam Oh also refuted Cheng’s chronology of events on the Cheng-Option and the SGR-Option. Ng Sing and Sam Oh stated in their respective affidavits that they met Cheng once at a coffee shop on 18 March 2011 in relation to the SGR-Option and the two Tenancy Agreements (see [31] above). At the coffee shop, Cheng repeated that there were 62 years remaining on the lease of the Property. This March date tallied with Su’s evidence that Ng Sing gave the SGR-Option with copies of the two Tenancy Agreements to him at his residence on or around the same day, whereas Cheng’s version was that they all agreed to use the SGR-Option only later on or around 25 March 2011. Besides, as regards the Cheng-Option, both Sam Oh and Ng Sing categorically denied seeing it before the commencement of the trial.[note: 26] 44     There are a few other issues that stood out about the Cheng-Option that supported Sam Oh’s and Ng Sing’s evidence. Cheng admitted that he had not met Ng Singbefore18 March 2011, and yet inexplicably, Cheng was in possession of information that enabled him to type into the Cheng-Option Ng Sing’s personal particulars such as his name, his NRIC number and the number of the cheque used to pay for the 1% option fee.[note: 27]The Cheng-Option was allegedly witnessed by an individual known as “Winnie”, but this individual did not testify at the trial to corroborate Cheng’s evidence. By 18 March 2011, Cheng would also have known that Sam Oh and Ng Sing were agents given that the SGR-Option had been shown to him by then and that it was addressed to Su. Hence, there is no credence to the story that Ng Sing was the second interested buyer of the Property after Sam Oh. 45     I therefore find that Cheng created the Cheng-Option and made up the story of meeting the agents so as to support his position that the agents knew from the outset that the Property’s leasehold tenure was a 30-year term of which only 17 years remained. I also find that Cheng made up the story that the head tenancy was attached to the Cheng-Option. The evidence showed that Fu received the head tenancy only on 15 June 2011 and E&T did not receive it much earlier than that (see above at [29]).This supported Su’s and Ng Sing’s version that the SGR-Option was received together with the two Tenancy Agreements. 46     Given the overall evidence, Cheng’s version of events lacked credibility, whilst Ng Sing and Sam Oh’s versions were consistent with the objective evidence. I therefore find that: (a) Sam Oh acted as Cheng’s agent in the transaction; and (b) the information that the Property had 62 years remaining on its lease came from Cheng.",
        "The bank loan": "47     Su wanted a 30-year term loan for the Property. It appears that on 22 March 2011, Su handed copies of the SGR-Option and the two Tenancy Agreements to Sim, a home loan officer with the lender-bank (see [12(c)] above). He told Sim that the leasehold tenure of the Property was for 99 years, of which 62 years remained, and that the monthly rental income was $3,800.[note: 28]I must highlight that it was never alleged nor suggested that Cheng had informed Sam Oh and Ng Sing that the duration of the leasehold was 99 years although he stated that 62 years remained. I understand from Exhibit D12 that the term of the lease for 8 other shophouses in Blk 63 Kallang Bahru was 78 years commencing 1 August 1995, and not 99 years. There was no explanation as to where and how Su derived his information as to the duration of the Property’s lease term in the absence of any suggestion that Cheng had represented the lease term to be 99 years. On 5 May 2011, the bank offered a 30-year term loan of $630,000.[note: 29] 48     On 7 June 2011, the lender-bank appointed the defendants as solicitors in the mortgage transaction.[note: 30]The bank was notified via a report on title that the leasehold tenure of the Property was for “30 years commencing 1 August 1998”.[note: 31]On 13 June 2011, ALT lodged a caveat against the Property on behalf of the lender-bank. Thereafter, on 22 June 2011, the lender-bank disbursed the loan of $630,000 on behalf of the plaintiffs to complete the purchase. 49     It is to be noted here that the lender-bank was notified that the Property had 17 years remaining on its 30-year lease, but still offered a 30-year loan to the plaintiffs.",
        "The date of ALT’s appointment": "50     According to Su, he telephoned Fu on or about 23 March 2011 to inform her that he was purchasing the Property. An e-mail addressed to Fu was sent by Su on 24 March 2011, with a copy of the SGR-Option which named Su as the intended named purchaser (as opposed to his nominees). On that day or a day earlier, Su personally handed the SGR-Option to Fu at ALT’s office. He also gave Fu a cheque for $36,000 made payable to “Esapan & Tan Advocates & Solicitors” (“the Esapan cheque”). This cheque was post-dated to 6 April 2011.[note: 32]It was for the remaining 4% of the purchase price (after initial payment of 1% of the purchase price as option fee) that was to be paid upon the exercise of the SGR-Option. Su told Fu that the remaining duration of the lease of the Property was around 60 years, with a total monthly rental income of $3,800, and that the SGR-Option was to be exercised in the name of his nominees, Hong Quan and Lye.[note: 33] 51     In contrast, the defendants’ version is that Fu only met Su on 28 March 2011. Fu said that she could not locate a copy of the e-mail that Su had sent on 24 March 2011 and that it was not in the file.[note: 34]Her evidence is that Su handed to her the SGR-Option (ie, the version without reference to “nominees”) and the Esapan cheque. Fu could not find the law firm’s name (Esapan & Tan Advocates & Solicitors) in the directory and informed Su that the name of the payee on the cheque was wrong. She also informed Su to get the SGR-Option changed so that his nominees could exercise the SGR-Option. She returned the SGR-Option to Su. Fu informed Lim about Su dropping by ALT’s office and she handed over to Lim a photocopy of the SGR-Option and the cheque which Su made out to Esapan.[note: 35]This cheque was returned to the plaintiffs on 5 April 2011.[note: 36] 52     On 29 March 2011, Fu received an e-mail from Su stating the details of Cheng’s conveyancing lawyersie, E&T.[note: 37]The e-mail of 29 March 2011 setting out E&T’s details supports Fu’s evidence that she had informed Su about the error in the Esapan cheque, and Su had subsequently provided her with the correct information. 53     On 5 April 2011, Su handed Fu the SGR-Option (ie, the version at [24] above) and a fresh cheque with E&T’s name correctly spelt, post-dated to 6 April 2011.[note: 38]Su instructed the defendants to exercise the SGR-Option.[note: 39]ALT opened a file for the Property’s transaction on the same day.[note: 40] 54     I prefer and accept Fu’s evidence that Su went to the office on 28 March 2011 and not earlier. The date 28 March 2011 ties in with Ng Sing’s evidence that he recommended other law firms to Su on 25 March 2011, which post-dated Su’s alleged first visit to ALT.[note: 41]The e-mail that Fu received on 29 March 2011 from Su with E&T’s details also supports Fu’s evidence. 55     I interpret Su’s e-mail of 24 March 2011 to Fu as a step taken in contemplation of the defendants being instructed at a later date to act for the Plaintiffs, at which time, but not before, it would be necessary for the defendants to read and act on the documents relating to the sale and purchase of the Property. 56     I am of the view that as at 28 March 2011, no retainer had arisen even though Fu had already communicated with Su. Until the SGR-Option and the Esapan cheque were amended, there was nothing for ALT to act on. It was only after Su had come back on 5 April 2011 with amendments to the SGR-Option and a cheque correctly addressed to E&T that ALT accepted the retainer to act for the plaintiffs in the conveyancing transaction. The file for the transaction was also opened that very day. Fu conducted a SLA title search on the Property on the same day and Lim reviewed the search results. Also on 5 April 2011, Lim reviewed the SGR-Option and e-mailed Su his comments on the terms of the option.[note: 42]I therefore find on the evidence that ALT accepted Su’s instructions to act for him and his nominees on 5 April 2011. 57     As stated above at [28], I also find that Su e-mailed the two Tenancy Agreements to the defendants for the first time only on 25 April 2011afterthe SGR-Option was exercised on 7 April 2011 and after further payment of $45,000 to Cheng was made on 14 April 2011. I should make clear that on 25 April 2011, Fu received only the two Tenancy Agreements. However, on 11 May 2011, Fu received from Su the Two Tenancy Agreements as well as a floor plan and Invoice Factoring’s offer to Lochen.",
        "Information from Su to the defendants about the term of the lease on the Property": "58     According to Su, on the day when he went to ALT’s office for the first time, he informed Fu that there was 62 years left on the Property’s lease and that the rental income was $3,800 a month.[note: 43]Fu disagreed. She said that there was neither mention of the Property having 62 years of the lease remaining, nor of the tenancies; she would have passed such information on to Lim if she had been informed.[note: 44]Instead, Su had only told her to check if Cheng was the owner of the Property, which she did.[note: 45] 59     I find that Su did not inform Fu about the lease on the Property being 62 years remaining and about the tenancies affecting the Property before ALT exercised the SGR-Option on 7 April 2011 or at anytime thereafter before completion. The overall evidence supports this finding. 60     Fu carried out the first SLA title search on the Property on 5 April 2011. Fu did a second search on 22 June 2011, the scheduled completion date, just before actual completion of the transaction.[note: 46]The results of both searches were not forwarded to Su and no report on title was given either. 61     Fu’s evidence accords with Lim’s testimony that his practice was to inform his clients about the tenure of the leasehold property if the clients asked about it.[note: 47]Lim stated that the defendants’ SLA title search carried out before the exercise of the option was to check on the ownership of the property and on encumbrances.[note: 48]This was Fu’s evidence as well in relation to the title search on the Property.[note: 49]An e-mail from Lim to Su only stated that the SGR-Option would be exercised “as instructed”.[note: 50]Notably, Su did not reply to the e-mail even though he did not receive any information relating to the lease on the Property being 62 years remaining. 62     Lim knew that there was only 17 years left on the lease from the results of the first SLA title search done on 5 April 2011.[note: 51]According to Lim, nothing unusual was gleaned from the results of that search, so he did not forward them to Su.[note: 52]This explanation is plausible in the context of a property with a leasehold tenure of 30 years since 17 years represent more than half of the remaining duration of the lease in contrast to a balance of 17 years out of a lease of 99 or 78 years. The discrepancy between 62 years and 17 years as the remaining duration of the lease on the Property would have come to light as early as 5 April 2011 if the defendants had been aware of Su’s belief that the Property had 62 years left on its lease. That, however, is not the end of the matter as the crux of the issue is whether there is a duty on a solicitor’s part to inform his client of the property’s title search results. I will deal with this issue later in this Judgment.",
        "Events after Su found out about the tenure & tenancy problems": "63     According to Su, he realised that the Property had a leasehold tenure of 30 years with effect from 1 August 1998 (ie, at the time the plaintiffs purchased the Property, there were only 17 years left on its lease) from the notice of transfer of the Property which Fu sent to him.[note: 53]According to Su, he contacted Fu on 8 July 2011 to enquire about the tenure problem and an apologetic Fu arranged for him to meet Lim on 12 July 2011.[note: 54] 64     From the defendants’ perspective, this was the first time that ALT realised that Su had intended to buy a property with 60 plus years of its lease remaining, and not a property held on a 30-year lease. On Su’s complaint that he had overpaid for the Property, Fu told him that she thought he knew of the leasehold tenure of the Property as he had paid the option fee for the SGR-Option before approaching ALT, and that Ng Sing should have informed him of the Property’s leasehold tenure.[note: 55]Su called Fu again to inform her that Ng Sing was also under the impression that the lease over the Property had at least 60 years left on its lease. 65     After the completion of the sale of the Property, Su received letters from Invoice Factoring on 5 and 7 July 2011 stating that Hong Quan and Lye were landlords to Invoice Factoring only and should not be approaching Lochen and Mdm Erniwati directly for rent collection.[note: 56]Su’s position on the tenancy problem was that he had received the SGR-Option from Ng Sing with only the two Tenancy Agreements.[note: 57]He did not know that the Property was actually sold subject to the Invoice Factoring Tenancy. 66     At that meeting on 12 July 2011, Su asked Lim about the tenure problem. According to Su, Lim informed him that he would take full responsibility for the matter and suggested that Su auction the Property.[note: 58]Lim also informed Su that he would help to resolve the situation relating to the tenancy agreements. After the meeting, Su agreed to retain ALT’s services to auction the Property and resolve the tenancy issues arising from the discovery of Invoice Factoring Tenancy as the head tenancy.[note: 59] 67     However, by 18 July 2011, Su had begun to instruct Mr Lei’s firm who sent a letter of demand to ALT on that day itself.[note: 60]On 22 September 2011, Su formally asked ALT and Lim to stop working on the tenancy disputes.[note: 61] 68     As at the date of the trial, the Property was still retained by the plaintiffs and unsold.",
        "Summary of important facts to note": "69     I find it necessary to highlight the foregoing findings and facts as they are important to the analysis of the defendants’ duties. To summarise, the important findings and facts to note are the following: (a)     It was Cheng who informed Sam Oh and Ng Sing that the Property had 62 years remaining on its lease. Sam Oh was Cheng’s agent in respect of the sale of the Property. (b)     Cheng gave copies of the two Tenancy Agreements (ie, Lochen Tenancy and Erniwati Tenancy), along with some other documents (that will be elaborated upon later), to Ng Sing on 18 March 2011 with the SGR-Option. All these documents were passed on to Su on the same day. (c)     On 5 April 2011, ALT accepted Su’s instructions to act for him and his nominees in the conveyancing transaction. (d)     Su did not tell Fu that he believed there were 62 years remaining on the Property’s lease until after completion. Su did not tell Fu about the two Tenancy Agreements before 7 April 2011. (e)     Before the exercise of the SGR-Option on 7 April 2011, the defendants did not receive any tenancy agreements. Su e-mailed the two Tenancy Agreements to the defendants on 25 April, 11 May and 15 June 2011, while E&T sent those two tenancy agreements as well as the Invoice Factoring Tenancy to ALT on 15 June 2011. (f)     There were two SLA searches done on the Property’s title. One was done on 5 April 2011 after the defendants were retained by Su to act for him and his nominees; the other was done on 22 June 2011, the actual day scheduled for completion. (g)     Completion of the sale and purchase of the Property took place on the footing that the Invoice Factoring Tenancy was the applicable tenancy.",
        "The defendants’ duties in contract and in tort": "70     The scope of a solicitor’s duty in contract depends upon his particular retainer and the particular circumstances of the case (perOliver J inMidland Bank v Hett, Stubbs & Kemp[1979] Ch 384 at 437 (“Midland Bank”) and approved inYeo Yoke Mui v Ng Liang Poh[1999] 2 SLR(R) 701 at [17] (“Yeo Yoke Mui”)). On the other hand, a solicitor’s duty of care in tort concerns the standard that a client can expect from a professional who has assumed the responsibility of representing the client in the discharge of the solicitor’s engagement. This assumption of responsibility by one party and reliance on that party by another has been accepted and explained in the framework set out in the Court of Appeal decision ofSpandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”) which founded a single test for determining the imposition of a duty of care in all claims arising out of negligence (seeGo Dante Yap v Bank Austria Creditanstalt AG[2011] 4 SLR 559 at [31]–[32], where the assumption of responsibility was considered and accepted under the limb of proximity). In the context of a solicitor’s relationship with a client,local case law has shown that the standard of care expected of a solicitor is that of a reasonably competent and diligent solicitor, and in cases on conveyancing, the standard would be that expected of a reasonably competent and diligent conveyancing lawyer (see Yeo Yoke Mui at [22]). This test is not controversial. 71     It is common ground that the defendants were engaged to act for the plaintiffs in the purchase of the Property. Notably, Lim did not take direct instructions from Su. The instructions were given by Su to Fu, and his instructions were given orally. There were no attendance notes that recorded Su’s oral instructions. One aspect of the dispute was what was said by Su to Fu and what the exact terms of Su’s oral instructions were. The paucity of particulars in the pleadings is telling, in that the plaintiffs must have recognised the vagueness of Su’s oral instructions - the plaintiffs’ Statement of Claim (Amendment No.1) (“the Statement of Claim”) averred to the existence of a retainer without particularising the exact terms of the retainer. On the face of it, the averment in the Statement of Claim that Su had told the defendants that the “Property had a remaining 60 plus years’ leasehold” is ambiguous, and hence, problematic. Oral instructions have to be clear before one can consider the scope and width of the express instructions given. The problem in respect of the averment just mentioned seems to be whether that averment was a term of the retainer and if so, what the effect of that term was. This renders the determination of the extent of the contractual duty beyond the scope of the express instructions given difficult. 72     Given the state of the pleadings on the retainer point, the relationship of solicitor and client at the very least gives rise to a concurrent duty in tort, and the scope of the duty in tort is the same as the scope of the duty in contract unless a particular aspect of the duty has been expressly excluded from or included in the contract. Thus, the bottom line is that the defendants’ retainer here could only be construed as providing for the defendants to do no more and no less than the exercise of reasonable skill and care expected of a reasonably competent and diligent conveyancing solicitor in the transaction they were engaged to do and for which the plaintiffs had agreed to pay them in respect of the sale and purchase of the Property since there was no evidence to support any other construction.",
        "The alleged breaches of duty": "73     I now come to the plaintiffs’ complaints in relation to the defendants’ alleged breaches of duty, namely,[note: 62] (a)     failing to check and report on the Property’s title as well as failing to inform/advise the plaintiffs of the remaining duration of the lease on the Property;[note: 63] (b)     failing to ensure and advise the plaintiffs that the purchase of the Property was subject to the Invoice Factoring Tenancy instead of the two Tenancy Agreements, and would not have yielded a rental income of $3,800 per month;[note: 64]and (c)     confirming or advising the lender-bank to extend a 30-year loan to the plaintiffs for the purchase of a property which had only 17 years of its lease remaining. 74     First, I note from the outset that item (c) was not pleaded, while items (a) and (b) were essentially a summary of the particulars found in the plaintiffs’ pleadings. In relation to the bank loan mentioned in item (c), there was no specific plea in the Statement of Claim that the defendants had been engaged to act for the plaintiffs in the mortgage of the Property to the lender-bank. 75     However, the Statement of Claim stated that the defendants had failed to advise the plaintiffs on the fact that the Property had only 17 years left on its lease which resulted in the repayment period of the mortgage loan being set at 30 years.[note: 65]Contrary to the pleadings just mentioned, Mr Lei’s submissions advance an entirely different point: that Lim had made a mistake in advising the lender-bank to grant a 30-year loan on the security of a property which had only 17 years remaining on its lease.[note: 66]Notably, Mr Lei’s cross-examination had also proceeded on such a basis.[note: 67]Effectively, Mr Lei was not only advancing in his submissions an averment different from the one stated in the Statement of Claim, but also one which was premature as the complaint related to a loss suffered under the bank loan, which loss had not yet materialised and was also not pleaded. 76     Separately, it must be remembered that the lender-bank was notified on 13 June 2011 via a specific report on the Property’s title that the Property had 17 years remaining on its lease (see above at [48]). Although this report came after the bank had made its offer to the plaintiffs on 5 May 2011, the bank would, as of 13 June 2011, have already been put on notice that the security of the loan was shorter than the duration of the loan. How the lender-bank came to proceed with the finance of the purchase of the Property is distinct and independent of the alleged negligence of the defendants in the main action. I thus say no more on item (c), and the discussion on the defendants’ alleged breaches of duty will be in respect of (a) and (b) only. 77     Before going on to consider the tenure & tenancy problems, there are two preliminary considerations that should be addressed first. The first relates to the weight of expert evidence in relation to a solicitor’s duty of care, while the second relates to the experience of the solicitor’s client.",
        "Preliminary considerations": "Weight of the plaintiffs’ expert evidence on the defendants’ duties 78     The plaintiffs invited this court to adopt the opinion expressed by Wong, their expert witness, on the practice adopted by the legal profession on the matter of a solicitor’s duty to his client on the title to a property which the client intends to buy and to advise his client on the tenancy agreements affecting that property. Wong has 24 years of experience as a conveyancing solicitor and was the chairperson for the Law Society’s Conveyancing Practice Committee from 1997 to 2001 and from 2008 to the present time. For the purposes of this case, Wong’s evidence is not helpful for several reasons. 79     The first objection has to do with the nature of Wong’s testimony. To illustrate, it is apparent from the underlined portions of Wong’s testimony set out below that the salient points of his opinion referred to what ought to be the practice, and not what the actual practice was. This much was accepted by him as well.[note: 68]On the issue of a report on title, he stated:[note: 69] (1) … [A] reasonably competent solicitor practising conveyancing is expected to conduct a title search and give [an information report]. If the property is a leasehold, a reasonably competent solicitorshouldinform the purchaser client of the number of years of the lease as shown in the instrument of title after a search is carried out, as well as the date from which the lease commences. … The shorter the remaining leasehold years, the greater the necessity for a reasonably competent solicitor to advise the purchaser client. [emphasis added] 80     Wong later elaborated on the practice standard of conveyancing solicitors in the following manner: 16. … During the option period, the solicitor, upon being appointed,is expectedto carry out all the preliminary but necessary checks on the: (1) Title to the property purchased or to be purchased; (2) Encumbrances to the title or to the property (if any); (3) Description of the property e.g. area of property; (4) The approved use of the property; and (5) Finally, the legal capacity of the vendor to sell the property. … 25. … Even if the client is somewhat knowledgeable or aware of the remaining lease, it isnevertheless a practiceto check the leasehold title and to report the basic information to the client. …. I must also add that even if the solicitor failed to report the Title to the client before the exercise of the option, that solicitor must nonetheless report title as soon as the solicitor receives the results of the Checks which he had conducted weeks before the completion. [emphasis added] 81     In relation to tenancy agreements which might affect the subject property, Wong stated: 30.    The solicitor on receiving the copy or original of the tenancy agreement must first review the said tenancy agreement. Prima facie the solicitorshouldcheck that the tenancy agreement is legitimate, legally binding and enforceable on all parties. After reviewing the tenancy agreement, the solicitorshould as a practice standard, report the essential particulars of the tenancy to the client. … [emphasis added] 82     Wong also relied on academic materials as well as the Singapore Institute for Legal Education’s preparatory materials for Part B of the Singapore Bar Examinations to support his opinion of what the precise standard ought to be. These materials indicate a standard that solicitors are supposed to endeavour to meet, and are not reflective of the actual current standards of conveyancing practice. This substantially undermined the usefulness of Wong’s opinions as it was not for Wong to opine on what ought to have been the case or to lay down a standard that conveyancing solicitors should be held to; instead Wong’s role as an expert witness was to inform the court on whether there was a standard in the conveyancing practice, and if so what that standard was. 83     The second objection to Wong’s evidence lies in the need for expert evidence in the particular circumstances of this case, seeing that the extent of the defendants’ legal duty in any given situation is a question of law for the courts to determine. As Oliver J put it inMidland Bankat 402 (approved by the English Court of Appeal inBown v Gould & Swayne[1996] PNLR 130 at 135 B-D): Clearly, if there is some practice in a particular profession, some accepted standard of conduct which is laid down by a professional institute or sanctioned by common usage, evidence of that can and ought to be received. But evidence which really amounts to no more than an expression of opinion by a particular practitioner of what he thinks that he would have done had he been placed, hypothetically and without the benefit of hindsight, in the position of the defendants, is of little assistance to the court; whilst evidence of the witnesses’ view of what, as a matter of law, the solicitor’s duty was in the particular circumstances of the case is, I should have thought, inadmissible, for that is the very question which it is the court’s function to decide. 84     Hence, I find that Wong’s evidence was of little or no assistance to the court in considering the defendants’ breaches of duty. Su’s experience in the sale and purchase of shophouses 85     Before considering the defendants’ duty to inform the plaintiffs about the tenure problem and to advise them on the tenancy problem, this is a convenient juncture to deal with the defendants’ argument that their legal duty is circumscribed by Su’s commercial experience in buying and selling HDB shophouses. It was argued that Su’s experience in this field meant that the defendants did not have to inform the plaintiffs about the tenure & tenancy problems as it was not for them to second-guess Su’s decision to purchase the Property.[note: 70] 86     At around the time the Property was purchased, Su had bought six other HDB shophouses and there were on-going conveyancing transactions being handled by ALT.[note: 71]Lim regarded Su to be an experienced investor-buyer of leasehold HDB shophouses. In the period between January 2010 and June 2011, Su had bought and sold nine HDB shophouses. According to the defendants, Su would have known the exact leasehold tenure of the HDB shophouse he was buying and whether the sale was with vacant possession or subject to tenancy. To support his argument, Lim also relied on the fact that Su had bought the SGR-Option without prior legal assistance and advice. 87     I make two broad comments. First, it is settled law that it is not necessary for a solicitor to explain to his client matters of a commercial or economic nature. Second, I accept that the experience of a client is a relevant factor to determine the extent of a solicitor’s duty to advise that client. Legal advice which would be required by a first-time buyer of a property with no legal experience whatsoever may differ from that required by an experienced businessman-client who is buying property for the second or third time (see William Flenley and Tom Leech,Solicitors’ Negligence and Liability(Haywards Heath, 2nd Ed, 2008) (“Flenley and Leech”) at para 9.51). Thus, the extent of the defendants’ basic duty to inform a client in the same position as Su about the tenure and the tenancy of the Property is a matter of degree as explained by Donaldson LJ inCarradine Properties Ltd v DJ Freeman Co[1999] Lloyd’s Rep PN 48 at 487: An inexperienced client will need and will be entitled to expect the solicitor to take a much broader view of the scope of his retainer and of his duties than will be the case with an experienced client. 88     However, any consideration of the client’s degree of experience cannot be taken too far. As the authors ofFlenley and Leechopine at para 9.52, which I accept, it is generally not palatable for a solicitor to argue that his client’s degree of experience means that it is outside the ambit of his duty to give advice to the client: that argument is capable of amounting to a submission by the solicitor that he or she was entitled to assume that the client knew what to do, and this was precisely the defendants’ stance in this case. 89     The law is clear that even an experienced client would still require some information and advice. Returning to the point made inMidland Bank, in a solicitor-client relationship, the solicitor assumes a responsibility to his or her client by the nature of his or her professional expertise. It is not correct for the defendants to say that there was no breach of duty if they had assumed the responsibility of acting as Su’s (and the other plaintiffs’) conveyancing solicitors and in carrying out their duty of exercising the SGR-Option had failed to inform Su of something that was within their realm of skill and knowledge simply because Su was an experienced investor. In the final analysis, the proper approach is to ask whether the defendants owed the plaintiffs a duty to take reasonable care in and about the handling the conveyancing transaction, and, if so, whether the defendants had breached that duty by failing to inform and advice the plaintiffs about the tenure & tenancy problems which the plaintiffs should have been given in circumstances where any reasonable conveyancing solicitor in the defendants’ position would have given that information or advice. 90     Bearing the above comments in mind, I will proceed to assess the defendants’ duties in relation to the tenure & tenancy problems.",
        "The tenure problem": "91     The tenure is important to the nature of the Property. It cannot be gainsaid that in leasehold property the tenure of the property being purchased is a crucial aspect of that property. Unlike a freehold interest, a leasehold HDB shophouse has a fixed term lease, and when the property is being on-sold by another person (as opposed to HDB) as in this case, the remaining duration of the lease would be a material concern to the purchaser. The question for determination in the present case is whether it was implicit in the defendants’ engagement to handle the sale and purchase of the Property that the defendants had a duty to inform the plaintiffs of the tenure which included passing on to the plaintiffs information that had come into the defendants’ possession about the term of the lease on the Property and the number of years remaining on that lease. 92     On 5 April 2011, Lim advised the plaintiffs on the terms of the SGR-Option in an e-mail. He noted, amongst other things, that the SGR-Option did not provide for the sale to be subject to HDB’s consent. He did not, however, inform Su about the term of the lease or the remaining duration of that lease. After reviewing the first SLA title search done on 5 April 2011, Lim would have been aware that there were only 17 years remaining on the Property’s lease but, unfortunately, he and Fu had mistakenly assumed that Su wanted to acquire the Property despite its having only 17 years left out of its 30-year lease.[note: 72]Lim therefore did not notify Su of the results of the SLA title search. 93     In terms of timing, the information on the Property’s leasehold tenure came into the defendants’ possession as a result of their carrying out Su’s instructions to act for him and his nominees in the conveyancing transaction: the first SLA title search was done by Fu on 5 April 2011 when the file for the transaction was opened, and the second search was done on 22 June 2011, shortly before completion. It is common ground that the SLA title search results were not sent to Su.At all material times, Lim’s practice of carrying out a first title search was to ascertain the vendor’s title to sell the property, and to ensure that encumbrances against the property would not affect the purchase. The second title search conducted just before completion was to check if the purchasers’ caveat and the lender-bank’s caveat were registered, and to ensure that no other caveats had been filed. The issue in this case is not about the solicitors failing to ensure that the purchasers obtained good title to the Property being purchased and the plaintiffs are not disputing that. Instead, the concern here is that the plaintiffs did not get the legal particulars of the leasehold property from the defendants at all. In this regard, Lim stated that he would not inform a client of the tenure of the leasehold property which the client intended to purchase unless he was specifically asked to check, and that there was no express instruction from Su to do so in this case. In response to the court’s question, Lim said:[note: 73] Court:So when someone comes to say, “Look, I’m buying a unit in there [new development]”, and then you go off and you do your searches, how would the client know that the advertisement is accurate? He thinks he’s buying a freehold but it may be actually a leasehold interest.Witness:Yes, Your Honour. Erm, but at that point in time, I do not inform my clients of the tenure or the leasehold interest unless I’m specifically asked by the client.   94     In my question to Lim, I had in mind the many new condominium developments frequently advertised in the newspapers. At the bottom of the advertisements – in fine print – are the legal particulars of the development concerned such as the tenure of the land and date of legal completion. If a 99-year leasehold is involved, the description of the land tenure would typically be as follows: Leasehold of 99 years with effect from a specified date, month and year. Unlike a freehold interest in a property, a leasehold interest cannot be describedsimpliciteras there will be no context to the nature of that leasehold interest as regards the term of the lease and the remaining duration of the lease. 95     I cannot agree with the defendants that the solicitor’s duty to protect his client from the possibility of a misdescription of the legal particulars of the leasehold property which the client intends to purchase only arises upon the client’s specific express instructions to the solicitor. One way of protecting the client’s interest would be for the solicitor to check what kind of leasehold interest the client thought he was buying and to verify this through the title searches. 96     I also did not find it helpful for the defendants to rely on the decisions inPickersgill v Riley[2004] UKPC 14 andClark Boyce v Mouat[1994] 1 AC 428, which state that: (a) the scope of a solicitor’s duty is governed by the instructions he receives and the circumstances of the case, and (b) a solicitor is not obliged to investigate matters which his client had not asked him to investigate. These general propositions that a solicitor’s duty is strictly circumscribed by his instructions cannot be taken too far, and do not assist the defendants in this case. Although Su merely instructed the defendants to exercise the SGR-Option,implicitin that express instruction to exercise the option was the duty to inform the plaintiffs about the tenure of the Property, seeing that the Property was a leasehold commercial property. As Laddie LJ put it inCredit Lyonnais v Russell Jones & Walker[2002] PNLR 2 at [28]: … However if, in the course of doing that for which he is retained, he becomes aware of a risk or a potential risk to the client, it is his duty to inform the client. In doing that he is neither going beyond the scope of his instructions nor is he doing “extra” work for which he is not to be paid.He is simply reporting back to the client on issues of concern which he learns of as a result of, and in the course of, carrying out his express instructions.In relation to this I was struck by the analogy drawn by Mr Seitler. If a dentist is asked to treat a patient's tooth and, on looking into the latter's mouth, he notices that an adjacent tooth is in need of treatment, it is his duty to warn the patient accordingly. So too, if in the course of carrying out instructions within his area of competence a lawyer notices or ought to notice a problem or risk for the client of which it is reasonable to assume the client may not be aware, the lawyer must warn him. … [emphasis added] Any risk of misdescription of the legal particulars of the tenure of a leasehold property can easily be cured or avoided by the solicitor informing the client-purchaser about the nature of the leasehold interest in the property. More importantly, this is a task that is implicit in the solicitor’s duty to exercise an option to purchase a leasehold interest on a client’s behalf. 97     Lim’s additional argument for not telling the plaintiffs about the tenure of the Property was that, in his mind, he saw the tenure of the property as a commercial matter, and it was not necessary for him as a conveyancing solicitor to explain to the plaintiffs essentially matters of a commercial or economic nature. Lim elaborated in his re-examination: … Okay, starting from my general practice is,I don’t send the title search itself and then advising on tenure, land area, ... how many storeys it is or what kind of built-up it is, … to me …I see this as commercial aspects which I do not inform the clients unless they ask or unless there’s a reason for me to do so.Right, for Mr Su I do not because … he is to me … someone who has bought and sold commercial HDB properties a lot of times. And though, from the previous cases I have done with him and even for this case, most of the time I am reacting to his instructions. … [emphasis added] 98     As stated, it is not controversial that a solicitor has no general duty to advise a client on matters of business since it is for the client to make his own commercial decision (seeJackson & Powell on Professional Liability(Sweet & Maxwell, 7th Ed, 2012) (“Jackson & Powell”) at para 11-177). But, in my view, the tenure particulars of a leasehold property are an integral part of the title to that property and go beyond a commercial decision to purchase that property. The mere fact that the tenure of a leasehold property has a bearing on the value of the property doesnotdetract from the fact that a leasehold property can only be said to be properly described if the legal particulars of its tenure in terms of the duration of the lease and the number of years remaining on the lease are included. Further reasons as to why the term of the lease is important information to a client purchasing a leasehold interest are stated by the authors Robert M Abbey and Mark B Richards inA Practical Approach to Conveyancing(Oxford University Press, 15thEd, 2013) at para 10.83: First, if the residue of the term is fairly limited it will be unacceptable to many lenders. Some lenders will decline to lend if the lease term has less than 60 years left to run. Second, the lender may have based the loan on a term of years stated to it by the buyer. While this statement arguably has a geographical context, the observation is capable of general application. 99     Thus, information on the duration of the term of the lease and the remaining number of years left on the lease cannot be categorised as being purely commercial or economic information simply because of its relationship to the value of the property. I am thus unable to agree with Lim that the tenure of the Property is only a commercial matter that falls beyond the purview of the defendants’ professional duty to the plaintiffs. 100    For these reasons, I find that the defendants had a duty to inform the plaintiffs about the duration of the lease and the number of years remaining on the lease, but they omitted to do so before the exercise of the SGR-Option and at any time thereafter until completion.",
        "The tenancy problem": "101    I now turn to the tenancy problem which is another instance of the defendants’ alleged breach of duty of care arising from the defendants’ failure to advise that the purchase of the Property was subject to the Invoice Factoring Tenancy instead of the two Tenancy Agreements, and that rental derived from the head tenancy was not $3,800 per month. 102    Specifically, it is the plaintiffs’ case that the defendants did not alert or advise them on the effects and ramifications of the three tenancy agreementsin totobecause they had not addressed their minds to these agreements.[note: 74]Their main contention was that the Invoice Factoring Tenancy operated as a head tenancy to the two Tenancy Agreements. This meant that in the event of an assignment of the Invoice Factoring Tenancy to Lye and Hong Quan upon completion of the Property, they would be collecting a smaller amount of rent based on the terms of the head tenancy ($2,000 as opposed to $3,800).[note: 75]Furthermore, the Invoice Factoring Tenancy was for three years, which meant that even after the Tenancy Agreements expired, Invoice Factoring could continue as head tenant and keep out Lye and Hong Quan from any arrangements with new occupiers who could potentially pay more rent to Invoice Factoring.[note: 76] 103    The defence raised by the defendants was that Su had notice of the three tenancy agreements, and that he should have reviewed them. However, he was so eager to complete the transaction that he did not pay attention to them. The defendants are thus not to be blamed for Su’s inaction especially when the purchase of the Property was subject to tenancy which meant that there was very little the plaintiffs could do to change the terms of the tenancies or their implications.[note: 77] 104    As mentioned earlier (see [32] above), the defendants and, to some extent, the plaintiffs challenged the validity of the Invoice Factoring Tenancy. The defendants and the plaintiffs submitted that Cheng was guilty of self-dealing by contracting with Invoice Factoring in the head tenancy, and consequently this meant that it was invalid. Mr Daniel had traced the legal entities involved in the ownership of Invoice Factoring and other related business entities and argued that they were all beneficially owned by Cheng. Hence, Cheng was actually dealing with himself in the head tenancy. In order to advance the self-dealing argument, the parties have to overcome the separate legal entity rule and establish that piercing the corporate veil is on the facts of this case justified by reference to the general principle of law which enables a court, in limited circumstances, to pierce the corporate veil. Mr Daniel and Mr Lei have not stated whether they are relying on agency, trust or fraud as a ground to pierce the corporate veil (seeCape v Adamson[1990] Ch 433 &Thode Gerd Walter v Mintwell Industry Pte Ltd and Others[2009] SGHC 44), and their respective pleadings are devoid of material averments. Their submissions are equally without evidential basis. Accordingly, the self-dealing argument fails. 105    It is must be remembered that the plaintiffs are not making a claim for additional losses on the ground that the head tenancy purported to give a lower rent as opposed to the two Tenancy Agreements, or that they had lost the opportunity to rent the Property out because of the head tenancy.[note: 78]In short, the validity of the head tenancy is really a peripheral point in the argument on the defendants’ alleged breach of duty to advise the plaintiffs on the terms of the tenancy agreements. 106    Lim’s usual course of dealing with Su was for the latter to secure a copy of the tenancy agreement from the agent and to go through the document on his own first before turning to Lim if he had any queries regarding the tenancy (hereafter referred to as “the standing arrangement”).[note: 79] 107    I accept Lim’s evidence that although Su had not provided the defendants with a copy of the two Tenancy Agreements before 7 April 2011, he was nonetheless aware that the purchase was not with vacant possession but was subject to tenancy. In light of the standing arrangement with Su, the defendants did not follow up on the two Tenancy Agreements that were said to be “attached” to the SGR-Option from the plaintiffs or from E&T. The defendants only had sight of the Erniwati Tenancy, Lochen Tenancy, the floor plan and Invoice Factoring’s offer to Lochen on 11 May 2011, and the Invoice Factoring Tenancy on 15 June 2011. Notably, the standing arrangement was not disputed. Whilst Lim’s practice of leaving Su to go through a tenancy agreement and leaving him to inform Lim only if Su has queries invites trouble for the defendants since Lim is relying on the purchaser-client to give to him what the purchaser-client thinks is necessary for an understanding of the legal implications of the conveyancing transaction. Nonetheless, the standing arrangement was certainly in place at the material time as evidenced by Su’s delayed transmission of the two Tenancy Agreements to Fu (they were sent well after the SGR-Option was exercised). Su’s delay is conduct that demonstrated the plaintiffs’ ambivalent attitude towards the two Tenancy Agreements and their perceived unimportance to the plaintiffs in the sale and purchase of the Property. In any case, despite the standing arrangement, a prudent purchaser-client in the position of Su would nonetheless notify his solicitor if, for instance, the number of tenancy agreements were at odds with his discussions with the vendor or estate agent. 108    There is another related point. Even if the Property was sold subject to the two Tenancy Agreements, and their terms could not be changed, it does not follow that the solicitor appointed to handle the sale and purchase transaction has no duty to advise the plaintiffs on the terms of the tenancies. A solicitor owes a general duty to explain important and relevant documents to the client (seePerotti v Barlow Lyde & Gilber[2004] EWHC 3017 at [48] andJackson & Powellat para 11-174), or at least ensure that he understands the effect and purport of material parts of the documents (seeTe An Nyah v Tan Jenny and Another[1998] SGHC 261 at [81]–[85]). In my view, Lim’s standing arrangement with Su did not exonerate him of his duty to advise the plaintiffs on the terms of the tenancy agreements. Here, there were two material aspects of the Invoice Factoring Tenancy that should have been brought to the plaintiffs’ attention which Lim admitted he did not do: (a) the plaintiffs would be entitled to less rent than they would be getting under the two Tenancy Agreements, and (b) the head tenancy was for a longer period than the two Tenancy Agreements.[note: 80] 109    Had the duty to inform the plaintiffs about the effect of the tenancy agreements been observed, Lim would have noticed the discrepancies in the two Tenancy Agreements that would alert him to the existence of the Invoice Factoring Tenancy. These discrepancies should have been followed up with E&T and told to the plaintiffs as well. 110    First, when the defendants received the two Tenancy Agreements from Su on 11 May 2011, it also came with a floor plan of the Property and a letter of offer from Invoice Factoring to Lochen. It was not denied that these documents were passed by Cheng to Su through Ng Sing. On 15 June 2011, the two tenancy agreements came with the letter of offer again.[note: 81]The letter of offer from Invoice Factoring to Lochen states as follows:[note: 82] Dear Sir/Madam: We are authorised by the Owner ([Cheng]) to subletand we hereby offer the [Property] to you on a “as is where is basis” for your rental on the following terms and conditions: - … [emphasis added] 111    It was plain that Invoice Factoring was offering a sub-lease on the Property to Lochen and Lim also admitted during his cross-examination that this would have been obvious to him upon his review.[note: 83]Furthermore, the Lochen Tenancy stated that the first floor of the Property was being “sublet”.[note: 84]Without having the Invoice Factoring Tenancy, Lim ought to have noticed certain inconsistencies in the two Tenancy Agreements to alert him to the fact that something was amiss. 112    Second, Lim admitted that between 15 and 22 June 2011 (upon receipt of the head tenancy until the scheduled date of completion), he went through the three tenancy agreements thinking that they were three separate agreements. Admittedly, Lim failed to appreciate that the Invoice Factoring Tenancy was the head tenancy and that the two Tenancy Agreements were sub-tenancies.[note: 85]Lim testified that he was confused on 15 June 2011 by the different numbers of agreements – he had received two tenancy agreements from Su but three from E&T. He reacted in the following manner:[note: 86] “… To play safe, I asked for certificates for all three tenancy agreements because I don’t know which is operative, which is not or what is the arrangement between seller and buyer. Hence, my instructions to [Fu] to please ask Mr Su what’s happ --- I mean, basically, confirm what is the position. … I’m not privy to certain arrangements that are made. I’m just told after the fact. So it sometimes --- I’m --- I’m just left there, er, er, enquiring what’s happening.” 113    Lim accepted that the defendants did not advise Su on the effect of the Invoice Factoring Tenancy as a head tenancy. His instructions to Fu were to follow up on the stamp duty certificates for the three tenancies and to inquire from Su whether the three tenancy agreements were in keeping with his arrangement with Cheng.[note: 87]As much as I accept that Lim’s query was akin to confirmatory instructions, I am inclined to believe that if Lim had reviewed the three agreements properly, he would have discovered for himself that the “third tenancy” was in fact the head tenancy agreement seeing that the Property was a two-storey shophouse which comprised a shop on the first level and residential unit above. 114    Third, Lim also failed to pick up on the changes in the completion accounts sent by E&T on 10 and 20 June 2011. The Invoice Factoring Tenancy was the only tenancy that was reflected in the later version of the completion account (ie20 June) while only the two Tenancy Agreements were stated in the first version (ie10 June 2011). Even though the 20 June completion account stated there was one tenancy agreement, the defendants were in possession of copies of three tenancy agreements by 20 June 2011. Lim admitted that he had not gone back to E&T for clarification on the different versions of the completion accounts. 115    There were certainly multiple lapses on the part of Lim in relation to the tenancy problem which was compounded by his standing arrangement with Su. The defendants had a duty to explain all the tenancy agreements to the plaintiffs. This duty required the defendants to inquire into and ask for the tenancy agreement “attached” to the SGR-Option and to review it. This duty also required the review of the two Tenancy Agreements to appreciate and recognise that they referred to “sub-letting” and to make necessary inquiries on the existence of a head tenancy. Lastly, the defendants would then have had to explain/advise the plaintiffs on the implications of the tenancy agreements. It is not an excuse to say that the Tenancy Agreements were not given to the defendants until much later as the onus was on the defendants to ask the plaintiffs and/or E&T for a copy having seen that the Property was being sold subject to tenancy. For the reasons stated above, I find that the defendants have breached their duty to explain/advice the plaintiffs on the tenancy agreements and their legal implications.",
        "Conclusion on the breaches of duties": "116    For the reasons stated above, I find the defendants in breach of duty of care to the plaintiffs by having failed (a) to inform the plaintiffs about the duration of the lease of the Property and the number of years remaining on its lease and (b) to explain/advice the plaintiffs on the tenancy agreements and their legal implications. 117    I wish to add that the defendants, and rightly so, did not submit a defence which was an abdication of their dutyviz, the alleged fraud by Cheng. Notably, fraud by a third party does not absolve the defendants of their failure, which is limited to the taking of reasonable care. Therefore, if a professional undertakes with care that which he is retained or instructed to do, he ought not to be readily found to have nevertheless warranted to being responsible for a misfortune caused by the fraud of another. As explained by Rix LJ inPlatform Funding Ltd v Bank of Scotland Plc[2009] 2 WLR 1016 at [52], fraud is a mechanism of loss and does not determine the breach of the solicitor’s obligations: … [A] professional surveyor or valuer, like a solicitor, should not readily be thought of as promising to answer to his client for the fraud of a third person. Like Moore-Bick LJ, I am inclined to think that does not readily answer the issue before us, in part because neither party will have had that particular risk in mind, but also in part because the fraud of a third party will simply be the mechanism of loss, and the real issue is whether what has occurred is a breach of the surveyor’s (or solicitor’s) obligations. Whether those obligations sound only in negligence or whether there is some stricter duty is the very issue to be determined, and that must be determined for reasons other than the mechanism of loss. The client may very well be thought of as saying: “Well, I do not absolve you of your failure, just because of any fraud of my counter-party. It is your job to use your professional expertise to see that you are not deceived by his fraud. And besides that, you have undertaken to carry out a (careful) inspection in any event.” That is the issue. …",
        "Causation and damages": "118    Having concluded on the breaches of duty by the defendants in the plaintiffs’ favour, the burden of proof is on the latter to show that substantial damages ought to be awarded. As to what has to be proved, Millett LJ inBristol and West Building Society v Mothew[1998] Ch 1 at 11 (and cited with approval by VK Rajah JA inLie Hendri Rusli v Wong Tan & Molly Lim (a firm)[2004] 4 SLR(R) 594 at [65]) explained: Where a client sues his solicitor for having negligently failed to give him proper advice, he must show what advice should have been given and (on a balance of probabilities) that if such advice had been given he would not have entered into the relevant transaction or would not have entered into it on the terms he did.The same applies where the client's complaint is that the solicitor failed in his duty to give him material information. ... Where, however, a client sues his solicitor for having negligently given him incorrect advice or for having negligently given him incorrect information, the position appears to be different. In such a case it is sufficient for the plaintiff to prove that he relied on the advice or information, that is to say that he would not have acted as he did if he had not been given such advice or information. It is not necessary for him to prove that he would not have acted as he did if he had been given the proper advice or the correct information. [emphasis added] In this case, the defendants’ failure to give the plaintiffs material information or advice is within Millett LJ’s first scenario. 119    For expediency, I will consider causation in the context of the damages pleaded by the plaintiffs. The plaintiffs’ claim for damages is set out in the Statement of Claim in the following manner: 16. By reason of the matters aforesaid, the [p]laintiffs have suffered serious loss and damage in that they would not have purchased the [P]roperty with such a short remainder leasehold at all had they known it had a remainder leasehold of only seventeen (17) years or, alternatively, the [p]laintiffs would not have paid such an exorbitant and unreasonably high price for the property or a price that is not reflective of or near to the reasonable market price for similar properties at that material time. 17. Further, the [p]laintiffs have lost the chance of rescinding the sale and purchase agreement and recovery of damages and/or suffered prejudice and/or are exposed to claims from [Cheng] and/or Invoice Factoring. Particulars of loss As a result of the 2ndDefendant’s breach of duties and/or negligence, the Plaintiffs have suffered: 1.    General Damages $900,000 2.    Opportunity loss or loss of chance with the monies which the [p]laintiffs could have profitably invested elsewhere. 3.    Diminution in value of the [P]roperty as a result of the encumbrance by the [Invoice Factoring Tenancy]. Particulars of Special Damage 1.    Refund of all conveyancing fees paid by [the bank] to the [p]laintiffs: $2,520.00 + $180 paid to the 1stDefendant; 2.    [The bank’s] penalty charges for cancellation of loan (to be made): $9,540.00 (being 1.5% of $630,000) 3.    Stamp fees on the conveyance: $21,600; 4.    Valuation report charges: $500.00 5.    Auction fees (to be paid): (normally 1% of the auction price); 6.    All other incidental expenses in relation to the purchase of the [P]roperty a.    loss of interest on upfront cash payment of $270,000 (x 5.25% interest on overdraft facility/12 mths): $1,182.25 per month (w.e.f. 23.6.11) b.    loss of interest on [bank] loan of $630,000: $880.16 per month (or $5,281.06 for the first 6 months); c.    Property tax: $1,535.36; d.    Fire insurance premium: $168.53 e.    HDB conservancy charges: $147.60 per mth (w.e.f 23.6.2011). Bank interests continue to accrue on a daily basis.",
        "Claim of $900,000 or diminution in value of the Property": "120    The alternative claims in para 16 of the Statement of Claim are inconsistent pleas – the plaintiffs would not have purchased the Property at all, and alternatively, there had been overpayment for the Property. Typically, the plaintiffs would have to choose one claim or the other. The plaintiffs have not shown that they are entitled to keep the Property and claim the full $900,000. Indeed, diminution in value is the proper measure of damages if they wish to keep the Property. 121    Su insisted that he would not have bought the Property if he had known that it had only 17 years left on its lease. The court has to be mindful that Su’s testimony may be coloured by the benefit of hindsight. So is there objective evidence that he would have not? 122    Evidence was adduced of Su’s past purchases of HDB shophouses that had 62 years or more years remaining on the leases at the time of purchase.[note: 88]Those purchases included a property which had 58 years remaining on its lease when Su sold it. None of Su’s previous purchases reflected an interest to purchase a HDB shophouse with 17 years of its 30-year lease remaining. But this distinction is not conclusive of the issue for determination as the answer to this question will depend on the circumstances such as the duration of the lease (eg, a 99-year lease compared to a 30-year lease) and the number of years remaining on the lease. 123    In fact, the overall evidence before the court is that Su’s real objection was with the price which was too high for a 30-year leasehold tenure which took effect from 1 August 1998. This view is consistent with the plaintiffs’ true claim for the diminution in value of the Property, and from the fact that at the time of the trial, the Property was still registered in Hong Quan and Lye’s name and was unsold. 124    Even though Su stated repeatedly in his affidavit and oral testimony that he did not wish to keep the Property, no real steps were taken to auction the Property despite a letter to the defendants on 18 July 2011 stating that they intended to auction the property.[note: 89]Beyond that, there was no evidence before the court to demonstrate any efforts made in that direction. When Su was asked why the Property had still not been auctioned, Su stated: (a) the plaintiffs “[couldn’t] do anything at the moment”, and (b) they were supposedly waiting for a court order.[note: 90]I find his explanations neither sincere nor convincing. 125    Su’s testimony - that a rescission of sale would have complicated the situation and that it would be “difficult if not impossible” to rescind or rightfully terminate the sale and purchase of the Property - is without merit.[note: 91]Su’s view that the disposal of the Property would mean that the plaintiffs would have no recourse against Cheng is also ill-founded.[note: 92] 126    As for the defendants’ failure to advise the plaintiffs on the tenancy agreements, the plaintiffs are not claiming additional damages for this breach over and above the plaintiffs’ claim for the same diminution in value of the Property. For instance, there is no pleaded claim made in respect of the loss of an expected total monthly rental income of $3,800 when comparing the two Tenancy Agreements with the Invoice Factoring Tenancy. Hence, Su’s references to the clauses in the head tenancy that resulted in a lower rent and that Invoice Factoring would be a tenant for a longer period of time than Lochen and Erniwati are irrelevant. For clarity sake, Mr Lei confirmed at trial that this was not an area of claim the plaintiffs were pursuing.[note: 93]",
        "Assessment of diminution in value": "Observations 127    The plaintiffs’ loss in acquiring the Property is that they had paid too much for it. The measure of damages is normally the difference between the price paid and the market value of the Property at the time of the purchase which is basically the date of the breach. The burden of proof is on the plaintiffs to establish the market value of the Property at the time of the purchase. The plaintiffs are hence required to provide evidence from which the court can find or draw an inference as to the difference between the price paid and the market value. 128    Expert evidence is normally adduced (as was the case here) to establish the value of the property as at the date of the purchase – on the assumption that any purchaser in the market would have been aware of the tenure problem to which the defendants ought to have drawn to the plaintiffs’ attention. Put another way, the inquiry starts with a determination of the market value of the Property in light of the 17 years left on its lease which commenced from 1 August 1998. 129    In this case, the defendants contend that the price difference should be measured as the difference between the price paid for the Property and the market value as at the time of the trial or judgment (as opposed to the breach date) given that there was an increase in the value of the Property by 35% since March 2011 and that the plaintiffs still owned the Property.[note: 94] 130    The issues that arise for consideration are: (a) the applicable date of valuation and (b) the market value of the Property at the relevant date. The date of valuation of the Property 131    I begin with Mr Daniel’s argument that this court should adopt a different date from the breach date. Bingham LJ stated inCounty Personnel  (Employment Agency) Ltd v Alan R Pulver & Co[1987] 1 WLR 916 at 925-926: While the general rule undoubtedly is that damages for tort or breach of contract are assessed at the date of the breach ... this rule also should not be mechanistically applied in circumstances where assessment at another date may more accurately reflect the overriding compensatory rule. Bingham LJ’s explanation for departing from the general rule is premised on the need to ensure that compensation is representative of the loss sustained by the plaintiff. The same point was made earlier by Megaw LJ inDodd Properties (Kent) Ltd v Canterbury City Council[1980] 1 WLR 433 at 451: In any case of doubt, it is desirable that the judge, having decided provisionally as to the amount of damages, should, before finally deciding, consider whether the amount conforms with the requirement of Lord Blackburn's fundamental principle. If it appears not to conform, the judge should examine the question again to see whether the particular case falls within one of the exceptions … or whether he is obliged by some binding authority to arrive at a result which is inconsistent with the fundamental principle. 132    Mr Daniel’s increase-in-value-over-time argument – because of the passage of time since the date of the purchase – conflates the concept of remoteness of damages with the question of quantum. Market changes in value are normally regarded as a reasonable consequence within the scope of a solicitor’s duty of care, and in this case it was not pleaded otherwise. AsFlenley and Leechputs it at para 3.55: Whether or not they can be attributed to the defendant’s breach of duty, increases or decreases in price or cost due to market forces which the claimant is forced to bear as a direct consequence of the defendant’s negligence, however unexpected, are ordinarily treated as within the contemplation of the parties. The reason for this was given by sir Thomas Bingham MR inBBL v Eagle Star[[1995] QB 375 at 405]: [I]t has not been argued that L’s claim for any part of his loss including that part attributable to the fall in the property market is too remote. The reason is obvious. L and V know, as everyone knows, that in any market prices may move upwards or downwards. That is the essence of a market. No one in recent times has expected property prices to remain stable over a prolonged period. It was plainly foreseeable that if, on the strength of an overvaluation by V, L entered into a mortgage transaction, he would not otherwise have entertained, his risk of loss would be increased if the market moved downwards or reduced if it moved upwards. 133    The defendants also rely onOates v Anthony Pittman & Co[1998] PNLR 683 (“Oates”) andKeydon Estates Ltd v Eversheds LLP[2005] PNLR 817 (“Keydon”) to argue that a later date should be used.Oatesconcerns the use of a different method of assessment when the diminution in value test is not appropriate. In that case, the English Court of Appeal (at 695) established that there were two alternative ways the diminution in value rule could apply to a claim against a solicitor for negligence: first, where the property was unusual or to be used for a particular purpose, and second, where time had elapsed between the purchase and the defects coming to light, the court would consider a reduced market value which the hypothetical reasonable buyer would pay knowing the defects, the cost of removing and/or correcting the defects; or where the plaintiff had entered into a transaction from which he would subsequently extricate himself from, damages would be assessed on the basis of the cost of extrication. 134    I do not disagree that in a proper case a different method of assessment as an alternative to the diminution in value approach may apply. However, there is no evidence in this case to support a different method of assessment using a later valuation date. Furthermore, the defendants’ contention lies with the date of the valuation as opposed to the method of assessment of damages. 135    As for the case ofKeydon, the court there awarded damages to the claimant for loss incurred from the date of the judgment. In that case, the claimants had specifically purchased a piece of property to obtain rent from the lessee of the property. When the income stream stopped because of the solicitor’s negligence, the claimants specifically claimed for the difference between the position it would have been in had it bought an alternative property and its current position, and the judge awarded damages for losses flowing from the date of the judgment. Arguably, the assessment of damages from the date of judgment may have been dependent on how the damages were to be calculated, however this in itself was not clear from the judgment. Hence, I do not rely onKeydonfor the proposition that the date of judgment would be appropriate for a valuation in these circumstances. In this case, the plaintiffs are only claiming for the diminution in value of the Property; there is no claim for loss of an income stream. 136    Apart from the upward appreciation in the Property’s price over time, which I have earlier said was foreseeable (see [132] above), there is no other reason why the current facts warrant a departure from the general rule. The loss suffered by the plaintiffs as a consequence of the defendants’ breach of the duty is the difference in value between the price paid and the market value at the time of purchase. The breach in this case crystallised when the sale of the Property was completed on 22 June 2011. I thus find that the applicable date of valuation is the date of the breachie, 22 June 2011. The market value of the Property 137    I now turn to the market value of the Property as at the date of breach. 138    The defendants rely on two reports to show that the plaintiff did not pay more for the Property. It was argued that the price paid by the plaintiffs was the market value in light of the 17 years left on its 30-year lease. As such there was no loss of bargain and the plaintiffs were entitled only to nominal damages. 139    The defendants rely on GSK Global Group’s report dated 25 July 2011 (“the GSK Report”).[note: 95]The GSK Report was not disclosed by Su even though it was obtained by him. According to the GSK Report, the value of the Property was $800,000 with vacant possession. The defendants wish to rely on the GSK Report as evidence that the price paid by the plaintiffs (ie, $900,000) was a reasonable one, but they did not call the author of the GSK Report as a witness to explain the basis of his valuation. The GSK Report is thus inadmissible. Even if, for the sake of argument, it were admissible, it would be of little or no assistance to this court given its content. 140    The other report the defendants rely on was commissioned at the request of the lender-bank. Realty International Associates Pte Ltd’s report (“the RIA Report”), dated 17 June 2011, valued the Property at $900,000 as of 8 June 2011.[note: 96]The author of the RIA report, Paul Ho (“Ho”), testified at the trial. His valuation was with vacant possession as required by the lender-bank. Ho was unable to find comparable data of a HDB shophouse with a similar profile of a short lease being bought and sold at $900,000.[note: 97]Instead, Ho adopted the “comparable method of valuation” by looking at comparable properties, prevailing market conditions and underlying economic factors that might influence the trend of the market prices.[note: 98]The workings of the comparable properties were set out in a separate document.[note: 99]Ho had compared the Property to three other properties of which one had a 62-year lease while the other two had 68-year leases and made percentage deductions based on a series of variables (location, tenure, time, floor area) to arrive at an adjusted value of $919,643 (which was rounded down to $900,000). In another set of valuations, Ho utilised the comparable properties that the plaintiffs relied on in their valuation report to conclude that the Property could be valued at $804,478.[note: 100] 141    However, there were certain discrepancies in Ho’s calculations that affected the accuracy of his calculations. First, Ho had included an additional comparable (Comparable 2) which the plaintiffs’ expert valuer had not used and this affected the adjusted average price of the comparable properties. Second, Ho had erroneously computed the floor area of the Property as 138 m2, when it was actually 129 m2. These discrepancies affected the deductions made for the size of the comparable properties. 142    Additionally, the plaintiffs questioned both sets of valuations prepared by Ho because of his deduction of 25% and this percentage figure, which he applied to the tenure of each of the comparable properties, was not fully explained in detail. Ho’s position was that the values stated were based on the capitalisation method which was used to find a percentage discount of a dollar for a 17-year lease as opposed to a 62-year lease.[note: 101]While I follow Ho’s methodology, he was not able to defend his choice of 25% as he did not explain the financial formula he used to derive at this percentage figure.[note: 102]Ho was given a further opportunity to disclose the financial formula when this court requested an updated valuation of the Property as of 8 July 2013, but he did not do so. 143    In summary, the defendants did not make good their contention that the GSK Report and the RIA Report showed that the Plaintiffs had not overpaid Cheng for the Property and, that damages, if any, should be nominal. 144    As for the plaintiffs, their expert witness Chew May Yenk (“Chew”), a valuer from Cushman & Wakefield VHS Pte Ltd, produced a report dated 18 January 2012. Chew had valued the Property as of 22 June 2011 and 8 December 2011. The market value which she arrived at for the Property was $460,000 for both dates, while the value of the Property subject to the Invoice Factoring Tenancy was $400,000.[note: 103]Chew similarly applied the “comparable method of valuation” in her report and cross-checked it with the “partial income method”. She used two 62-year lease properties and one 63-year lease property as comparable properties and used variables for adjustments as well (time, size, location, frontage, tenure and condition). 145    Chew accepted that the divergence between Ho’s and her calculations were largely caused by the percentage deductions made to the tenure of the comparable properties.[note: 104]Instead of using a deduction of 25%, she applied a higher deduction of 47% to the tenure of comparable properties.[note: 105] 146    Chew relied on a table found on the SLA website to derive at her 47% deduction.[note: 106]This table showed leasehold values as a percentage of freehold value. The difference in value between a 17-year lease and a 62-year lease (37.8%) was divided by the value of the 62-year lease (81.2%) to reflect the proportionate difference between the 17-year and 62-year lease (47%).[note: 107]Applying this percentage to the comparable properties, she concluded that the market value of the Property was $473,603 as of 22 June 2011. 147    I am mindful of the intended purpose of the table used by Chew and the danger of using a table that was designed for a completely different purpose. According to the SLA website (this table can be found as an annexure to the SLA policy paper “The Differential Premium System”[note: 108]), when the tenure of the land is a leasehold and the SLA imposes a differential premium on State land for lifting a title restriction involving the change of use and/or increase in intensity, the premium will be adjusted according to the residual tenure of the land by percentages listed in the table. Additionally, the table would not be applicable to all types of land and this depended on the land use. If so, the differential premium would be determined by the chief valuer. 148    It is clear from the write up provided by SLA that the table could not be used for Chew’s present purposes where she was not determining a differential premium at all. It is also not known how the percentages are derived, and since they are meant to be used to determine development premiums, the percentages may be affected by this purpose. Chew’s evidence that the use of the table was a common practice among valuers[note: 109]was contradicted by Ho whose view was that the table was designed specifically for a land premium adjustment, and he did not understand the basis for how the table could be computed for a different purpose.[note: 110] 149    Not only was Chew’s evidence of a “common practice” not corroborated, the logic behind Chew’s calculations in applying the table was erroneous as well. Chew’s calculation was to find the difference between a 62- or 63-year lease and a 17-year lease and consider this as a proportion of a 62- or 63-year lease. This cannot be correct because the difference in the length of the lease is not the focus of the inquiry, and the difference in relation to a 62- or 63-year lease is not useful either. Notably, the table in question was also based on a 99-year lease property whereas the Property had a 30-year lease and the other comparable properties had 78-or 80-year term leases. I therefore reject the 47% reduction that Chew had made to account for the difference in tenure. 150    Lastly, Chew’s calculation for Comparable 2 was also mathematically wrong which thus affected her average value. An adjusted table of Chew’s calculations is annexed below (see Annex 1), and the average value that represents the market value of the Property, based on the correct calculations, is $473,863. 151    While Ho’s final calculation of the market value of the Property was wrong for the reasons stated in [141] above, this has no adverse effect on the 25% discount he used for adjusting the tenure of the comparable properties on the basis of the capitalisation method. By putting this discount into Chew’s calculation table – which variables for adjustments Mr Daniel did not dispute – I found the corrected figure of Ho’s to be $709,265 (see Annex 2). This is to be contrasted to Chew’s 47% discount which gives the figure of $473,863. 152    I have already explained why the different percentages opined by the experts are not supportable given that their justifications for the percentage deductions made to the tenure were found wanting. Be that as it may, both experts accept that there should be a diminution in value of the Property and given the weight of the evidence before me, I have to find a fair and reasonable diminution in value somewhere in the range of $709,265 (25%) and $473,863 (47%). An appropriate method would be to use a fair percentage and put this into Chew’s calculation table whose methodology was not disputed. A fair percentage to use would be 36%, being the average of the two percentage figures. Therefore, the valuation of the Property based on the comparable properties is $591,564 (see Annex 3 for calculations). 153    I now turn to Chew’s evidence in support of a further reduction in the value of the Property for the “Present Value of Rent Reversions”.[note: 111]This deduction was not explained in her calculations and I thus reject it. Chew also came up with the figure of $60,000 as reduction to account for the Invoice Factoring Tenancy.[note: 112]She justified this by saying that more rent could be earned than what was provided under the Invoice Factoring Tenancy.[note: 113]She also stated that the valuation of the Property had been carried out on the basis of vacant possession, and the reduction was made after finding the value of the Property.[note: 114]However, I have difficulty accepting Ms Chew’s reduction of $60,000 which appears nothing more than the plaintiffs’ attempt to recover an un-pleaded claim for reduced rental. This deduction was made without the plaintiffs establishing and substantiating their assertion that the head tenancy caused a diminution in the Property’s value. For these reasons, I reject Chew’s $60,000 reduction. 154    I thus find that $591,564 represents the market value of the Property as of 22 June 2011. The damage recoverable for diminution in value of the Property is $308,436 being the difference between the price of $900,000, which the plaintiffs paid for the Property, and the market value. Particulars of Special Damage as pleaded 155    I now turn to the particulars of special damage as listed under para 17 of the Statement of Claim (see [119] above). The plaintiffs’ premise for most of the claims of special damage is on their argument that they did not want to keep the Property and hence all incidental expenses relating to the Property are recoverable. This premise is, however, a non-starter for the reason that the main claim is properly characterised as a claim for damages for the diminution in value of the Property (see [123] above). With ownership of the Property in Hong Quan and Lye, expenses incidental to the acquisition of the Property are rightfully borne by themie, claims particularised at points 1 and 6 of para 17 of the Statement of Claim. To elaborate on point 1, legal fees would still have to be paid even if the market value of the Property is less than $900,000, and the difficulty here is that there is no evidence as to what the fees would be like if the Property’s price changes. Turning to point 6, Su admitted by Su that it was a commercial decision to take out an overdraft facility which the defendants did not know about.[note: 115]Therefore, for point 6(a) being the interest accrued on the overdraft facility, this claim fails as it is too remote. As for point 3, although stamp fees are an incidental expense to the Property, they are also proportionate to the price paid. As the market value is much less than the value paid by the plaintiffs, damages under this head would be accordingly reduced to take into account the fact that the plaintiffs have overpaid the stamp duty of the Property. The amount payable as damages is thus $9,252 (rounded down to the nearest dollar). 156    Points 2 and 4 of para 17 of the Statement of Claim proceed on the basis that the lender-bank would cancel the loan. Point 2 relates to the lender-bank’s penalty charges for the plaintiff’s cancellation of the loan. Should the loan or any part thereof be cancelled, a cancellation fee of 1.5% on the amount cancelled or left undrawn would be payable.[note: 116]As for point 4, the valuation report charges relate to Ho’s valuation report that was commissioned by the lender-bank, and become payable upon cancellation of the loan. I am not prepared to deal with the mortgage in this action for two reasons. First, it was not the plaintiffs’ pleaded case that the defendants were retained to act for them as mortgagors. There was thus no discovery of the loan and mortgage documents to give a complete picture. Besides, a proper representative from the bank was not been called to testify why a loan for 30 years was given for a security of 17 years despite the lender-bank’s knowledge of the remaining tenure of the Property through the report on title (see above at [48]). Additionally, the steps taken by the lender-bank in relation to the transaction and those taken by Su to further secure the loan are unknown. What the plaintiffs and the defendants have said in their affidavits about the lender-bank’s actions is hearsay. Second, the losses claimed have not crystallised. It is a fact that the lender-bank has yet to cancel the loan. It is also not known if the plaintiffs are selling the Property and, if so, when. Despite Su’s assertions that the plaintiffs do not want to keep the Property, no steps have been taken to sell it. It is thus too remote and unforeseeable for the defendants to pay for the valuation report. This applies as well to the cancellation fee which is dependent on the amount cancelled or left undrawn and will not be crystallised until the point in time when the loan is cancelled. It would be imprudent to decide on the evidence before me the alleged damages the plaintiffs have suffered in relation to the bank loan and accordingly, the plaintiffs’ claims for points 2 and 4 are dismissed. 157    As for point 5 which relates to the claim for auction fees, such a claim is incongruous seeing that the plaintiffs are seeking damages for diminution in value of the Property, and is accordingly dismissed. 158    In conclusion, for the particulars of special damage, the plaintiffs’ claims are dismissed except for point 3ie, the stamp fees on the conveyance.",
        "Summary of damages": "159    I thus find that the defendants are liable to pay damages in the sum of $317,688 being the: (a)     diminution in value of the Property: $308,436, and (b)     overpayment of stamp fees: $9,252.",
        "Other claims in paragraph 17 of the Statement of Claim": "160    Before moving on to consider the next issue, there is the matter of the other claims pleaded in para 17of the Statement of Claim. 161    Paragraph 17 of the plaintiffs’ Statement of Claim contains multiple claims. I propose to comment on the claim for loss of chance. As for the other professed claims, they cannot validly stand alongside the main claim for diminution in value, and it is thus not necessary to dwell on them. 162    With respect to the claim for the loss of a chance to invest, Su stated that the money used to purchase the Property could have been used to purchase other HDB shophouse units. In particular, there were two other shophouses he had been considering alongside the Propertyie, a two-storey shophouse at Teck Whye Lane, and a two-storey shophouse at Kallang Bahru in the same block as the Property.[note: 117] 163    The plaintiffs’ claim for loss of chance is far-fetched. First, the shophouse at Kallang Bahru was occupied by a hair salon at the time of the transaction for the Property. Ng Sing mentioned that the shophouse was in the same block as the Property and testified that the owner’s son was not interested in selling the property.[note: 118]So, that property was never offered to Su around the time the offer for the Property was made.[note: 119]There was also no evidence that the property was available for sale in March 2011. Second, there was no evidence that the property at Teck Whye Lane was on sale for the alleged price of $940,000. There were also no steps taken by Su or the other plaintiffs that revealed their interest in the property at Teck Whye Lane. 164    Su, aware of the weakness of the plaintiffs’ case, confirmed in court that he was not pursuing this head of claim. His late confirmation was a wise one.",
        "Mitigation by the plaintiffs": "165    I will now consider the defendants’ contention that the plaintiffs had failed to mitigate their losses. 166    Mr Daniel submitted that the plaintiffs failed to mitigate their loss by failing to pursue Cheng and Ng Sing timeously or at all on the transaction. The defendants claimed that the plaintiffs should have commenced proceedings against Cheng and Ng Sing to set aside the purchase of the Property on the grounds of fraud or fraudulent or negligent misrepresentation, or against Cheng to set aside the Invoice Factoring Tenancy for fraud. Additionally, the plaintiffs should have attempted to extend the lease of the Property.[note: 120] 167    As a general proposition that the plaintiffs ought to have sued Cheng to rescind the purchase, case law does not support the defendants given that the plaintiffs’ right to sue is distinct from their duty to mitigate. A plaintiff does not have to take steps to recover compensation for his loss from parties who, in addition to the defendant, are liable to him. This is a principle independent of mitigation. This principle, which was once considered to be one of the nine rules of mitigation, now stands on its own, separate from mitigation principles (see Harvey McGregor,McGregor on Damages(Sweet & Maxwell, 18th Ed, 2009) (at para 7-085 and fn 335)). 168    The distinction between the principle of the right to sue and that of mitigation was first explained by Harman LJ (at 82–83) inThe Liverpool (No 2)[1963] P 64. In that case, theOuselsank as a result of a collision with theLiverpool. The harbour authority took possession of theOuselunder its statutory powers and claimed against the limitation fund based on the admitted liability of the owners of theLiverpool. The harbour authority also took steps to enforce their statutory rights against the owners of theOuselto recover from them any expenses outstanding after raising and selling the wreck. The amount was statutorily limited to about £10,000. The question that arose was whether the harbour authority had to make a deduction from the sum claimed against the limitation fund for the £10,000. In the court below, the judge held that the harbour authority ought to have reasonably mitigated its loss by enforcing the claim against the owners of theOuseland he concluded that a deduction had to be made (at 82). On appeal, the Court of Appeal overturned this ruling. According to Harman LJ, the authority was under no duty to recover the damages from theOuseland it did not matter that the owners were ready to pay and had in fact tendered the money to the authority. The board’s legal rights to sue those liable to it “had nothing to do with the duty to mitigate damages”. This was explained at 83 in the following manner: As to the second part of the President’s decision, this case, in our judgment, has nothing to do with the duty to mitigate damages. It concerns the board's legal rights, and no duty rests on it at the demand of a tortfeasor to satisfy part of the damages by resorting to another tortfeasor; still less by resorting to an innocent party made liable merely by statute. 169    Harman LJ also elaborated that if there was such a duty imposed on the plaintiff, it would have been unnecessary for the legislature to make provisions for contribution and indemnity between joint and several tortfeasors, and in the current context, this would be illustrated by making wrongdoers liable for the “same damage” as illustrated in the Civil Liability (Contribution) Act 1978 (c 47) (UK) (“UK Civil Liability Act”) (see below for analysis). In the case ofPeters v East Midlands Strategic Health Authority[2009] EWCA Civ 145, the English Court of Appeal considered this principle at length. The underlying premise for why the principle stood apart from mitigation was that it was up to the plaintiff to decide who it intended to bring an action against when there were several parties liable to it for the same loss. There is thus no duty imposed on the plaintiff to bring an action against one wrongdoer at the request of another wrongdoer so as to recover part of the plaintiff’s damages (at [41]). The English Court of Appeal reiterated this position inHaugesund Kommune v Depfa ACS Bank[2011] PNLR 14, where Rix LJ stated at [40]: In my judgment, the principle inThe Liverpoolis not in doubt. If it were otherwise, no Claimant with remedies against more than one Defendant could ever get judgment against either, for each Defendant could play off the claim against him by referring to the claim against the other. And where the Claimant has sued only one out of a number of possible Defendants, the litigation before the court would become embroiled in satellite litigation involving the alleged position relating to other parties. It is rather for the Defendants involved to bring contribution or other similar proceedings against each other, or for the sole Defendant to implead other parties if it is thought prudent to do so. 170    Rix LJ neatly encapsulated the point that it is not for one defendant to accuse the plaintiff of not suing another liable party but for that defendant to pursue its own claim in contribution if it is of the opinion that it is not fully liable for the damages caused to the plaintiff. The plaintiff should not be prejudiced in its claim for the full sum of damages simply because more than one party caused it. The plaintiff is entitled to claim from whichever party is liable. It must however be recognised that this applies only after establishing that these parties are liable to the plaintiff for the same damage, but perhaps to a different extent. 171    Thus, in distinguishing the right of the plaintiff to choose to bring a claim against any defendant liable for its loss and the principle of mitigation, it is clear that the plaintiffs were under no duty to pursue litigation against Cheng as a liable party for the same losses and were entitled to claim their full losses from the defendants. 172    Next, the defendants argue that the plaintiffs should have taken the reasonable position that the head tenancy was void and then contracted with Lochen and Mdm Erniwati as new tenants.[note: 121]However, the plaintiffs failed to do so and did not end up collecting any rent from the two tenants. I cannot see how this can be a relevant point of mitigation since any claims against the tenants for unpaid rent were not part of the plaintiffs’ pleaded case against the defendants – the plaintiffs were not suing the defendants for having lost income from the presence of the head tenancy agreement as opposed to only the two Tenancy Agreements. Hence, the loss that the defendants are arguing about here is not related to the damages claimed against them. I therefore reject this argument. 173    As for the defendants’ last argument, I do not see how an extension of the lease could be argued as a form of mitigation of the damages in the circumstances. There was no evidence that HDB would allow for an extension of the lease term given that there was still 17 years left on the Property’s lease. This much was also made clear in the plaintiffs’ enquiry to HDB.[note: 122]Therefore, it could not be said that the plaintiffs ought to have mitigated their loss through this measure. 174    I hence find that the plaintiffs have not failed to mitigate their losses, and are thus entitled to the full sum of damages as stated above (see [159] above). 175    I will now move on to consider the third party action that the defendants have brought against Cheng, Ng Sing and SGR Property.",
        "The third party action": "",
        "Meaning and scope of statutory provisions": "176    The defendants’ action for contribution is brought pursuant to s 15(1) of the Civil Law Act which states: Entitlement to contribution 15. —(1) … [A]ny person liable in respect of any damage suffered by another person may recover contribution from any other person liable in respect of the same damage (whether jointly with him or otherwise). Assessment of contribution 16.—(1) Subject to subsection (3), in any proceedings for contribution under section 15, the amount of the contribution recoverable from any person shall be such as may be found by the court to be just and equitable having regard to the extent of that person’s responsibility for the damage in question. 177    Section 15 must be read with s 19 which states: Interpretation and application of sections 15 to 18 19. —(1) A person is liable in respect of any damage for the purposes of sections 15 to 18 if the person who suffered it (or anyone representing his estate or dependants) is entitled to recover compensation from him in respect of that damage (whatever the legal basis of this liability), whether tort, breach of contract, breach of trust or otherwise). 178    In this context, the third parties can only be liable for contribution under s 15 if the plaintiffs were entitled to recover compensation from them for either a tort, breach of contract, breach of trust or otherwise, and it was in respect of the same damage committed by the defendants. The word “damage” in s 16 bears the same meaning as that in s 15, and therefore “the damage in question” in s 16(1) is a reference to the “same damage” specified in s 15(1). 179    Sections 15(1), 16(1) and 19(1) of the Civil Law Act arein pari materiawith ss 1(1), 2(1) and 6(1) of the UK Civil Liability Act. In the case ofTan Juay Pah v Kimly Construction Pte Ltd and others[2012] 2 SLR 549 (“Tan Juay Pah”), the Court of Appeal followed the decision of the House of Lords inRoyal Brompton Hospital Trust v Hammond[2002] 1 WLR 1397 (“Royal Brompton”) which discussed and detailed the legislative history of s 1(1) of the UK Civil Liability Act. At [49] ofTan Juay Pah, the Court of Appeal adopted the three-step test established inRoyal Brompton which in this context would be: (a)     What damage has the plaintiffs suffered? (b)     Are the defendants liable to the plaintiffs in respect of that damage? (c)     Are the third parties also liable to the plaintiffs in respect of that damage or some of it? 180    Cheng argued that the defendants could not rely on s 15 as the defendants had to show that he owed a duty of care to the plaintiffs and in this case there was no duty of care.[note: 123]This, however, was a misreading ofTan Juay Pah. In that case, the defendants had to show that the third party owed a duty of care to the plaintiff because the third party did not have a contract with the plaintiff and hence, a claim in contract could not be brought.Tan Juay Pahdoes not stand for the proposition that a defendant must always prove that the third party owed a duty of care to the plaintiff. In this case, there was a contractual relationship between Cheng and the plaintiffs and the defendants’ ground for contribution is for fraudulent or negligent misrepresentations made by Cheng and/or Ng Sing. 181    The recent Northern Irish High Court case ofMcCallion Brothers Limited v Fisher[2012] NICh 5 (“McCallion”) is instructive to the facts at hand. InMcCallion, the plaintiff company purchased some property from the defendant vendor to which the vendor had no title to. It was noted at [2] by Deeny J that it was “uncommon” that the plaintiff did not sue its solicitors. The vendor took out an application under the UK Civil Liability Act to join the plaintiff’s solicitors as a third party to the action. The issue before the judge was whether the solicitors were liable in respect of the same damage as the vendor. FollowingRoyal Brompton, the judge found that s 6(1) of the UK Civil Liability Act did not require the solicitors and the vendor to be liable in the same way. However the same harm had to be done. The claim by the plaintiff against the vendor was that the plaintiff had paid for a property it did not get good title to. The claim by the plaintiff against its solicitors was also that the plaintiff had paid for a property it did not get good title to. Deeny J thus allowed the application to join the plaintiff’s solicitors. Likewise, it is incorrect for the third parties in this present action to raise the argument that the damage caused by them was not the same harm as that caused by the defendants simply because liability was established in a different way. 182    It must be understood that the principle of contribution is that the defendant and the third party would both be subject to a common liability to the plaintiff. Section 1(1) of the UK Civil Liability Act expanded the principle only insofar that both the defendant and the third party must be liable for the same damage suffered by the plaintiff. The legislation referred to “damage” and not to “damages” and so effectively meant harm or loss. This meant that the defendant and the third party could be liable for the same harm or damage,whateverthe legal basis of their liabilityie, whether in tort, contract, or otherwise. This also meant that the defendants did not have to bring a claim for contributory negligence against the third parties, contrary to Cheng’s submissions.[note: 124]Ng Sing argued that he was not liable as he was not professionally negligent like the defendants,[note: 125]and for reasons stated above, this is a flawed argument which I reject. 183    I am of the view that the defendants are entitled to rely on the Civil Law Act to claim contribution from the third parties if the third parties’ liabilities are established.",
        "Liability for contribution": "184    I now turn to the question of the third parties’ liability to contribute. 185    In respect of the first representation that the Property had a 62-year lease when it actually only had 17 years at the time of purchase (the “First Misrepresentation”): (a)     Cheng and/or his agent had fraudulently or negligently represented this to Ng Sing who had then fraudulently or negligently represented it to Su; or (b)     Ng Sing had made this representation to Su fraudulently or negligently on his own accord. 186    In respect of the second representation that the Property was subject to the two Tenancy Agreements (ie, Lochen Tenancy and Erniwati Tenancy) when it was also subject to the Invoice Factoring Tenancy (the “Second Misrepresentation”): (a)     Cheng had fraudulently or negligently represented this to Su; or (b)     Ng Sing had made this representation to Su fraudulently or negligently on his own accord; or (c)     Cheng and/or his agent had fraudulently or negligently represented this to Ng Sing who had then fraudulently or negligently represented it to Su. 187    Lastly, the third representation is that Cheng had failed to disclose the Invoice Factoring Tenancy to Su, either directly or through his agents, at the time the SGR-Option was bought, before the SGR-Option was exercised, or “well before” the completion of the purchase (the “Third Misrepresentation”). 188    The defendants’ alternative claim is that if it had not been made fraudulently, they would rely on s 2 of the Misrepresentation Act (Cap 390, 1994 Rev Ed) (“Misrepresentation Act”) which states: Damages for misrepresentation 2.—(1) Where a person has entered into a contract after a misrepresentation has been made to him by another party thereto and as a result thereof he has suffered loss, then, if the person making the misrepresentation would be liable to damages in respect thereof had the misrepresentation been made fraudulently, that person shall be so liable notwithstanding that the misrepresentation was not made fraudulently, unless he proves that he had reasonable ground to believe and did believe up to the time the contract was made that the facts represented were true. 189    This alternative plea is misconceived: s 2 relates to a claim for damages as stated inTan Chin Seng and others v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [22] and [23]; s 2 of the Misrepresentation Act does not alter the manner in which they have to prove actionable misrepresentation. I will hence deal with this later. Fraudulent misrepresentation by Cheng (1)   Whether false representations were made to Su 190    For completeness, the elements of fraudulent misrepresentation stated by the Court of Appeal inPanatron Pte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at [14] are: … First, there must be a representation of fact made by the defendant by words or conduct. Second, the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff. Third, it must be proved that the plaintiff had acted upon the false statement. Fourth, it must be proved that the plaintiff suffered damage by so doing. Fifth, the representation must be made with knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. 191    The defendants had to prove that the three representations above were made to the plaintiffs. Cheng had made the First Representation to Sam Oh over the phone, and Sam Oh then told Ng Sing. Ng Sing eventually passed this representation on to Su. 192    On a later occasion, Cheng made the First Misrepresentation to Ng Sing and Sam Oh at the coffee shop on 18 March 2011, during which time Ng Sing bought the SGR-Option on Su’s behalf (see above at [43]). 193    As regards the Second and Third Misrepresentations, Ng Sing received the SGR-Option together with the two Tenancy Agreements (see above at [27]). The defendants also only received the Invoice Factoring Tenancy a few days before the completion of the sale of the Property and it was made known to Su only shortly thereafter (see above at [29]). In this regard, I find it helpful to refer to the case ofTrans-World (Aluminium) Ltd v Cornelder China (Singapore)[2003] 3 SLR(R) 501 (“Trans-World”) where observations on misrepresentation by silence were made at [66]–[68]: 66    Misrepresentation by silence entails more than mere silence. A mere silence could not, of itself, constitute wilful conduct designed to deceive or mislead.The misrepresentation of statements comes from a wilful suppression of material and important facts thereby rendering the statements untrue. 67   In an action in deceit, the plaintiffs have to prove, to use the language of Lord Cairns inPeek v Gurney[1861-73] All ER Rep 116 at 129: ... some active misstatement of fact, or, at all events, such a partial and fragmentary statement of fact that the withholding of that which is not stated makes that which is stated absolutely false. The statement made must be either in terms, or by such an omission in the sense stated by Lord Cairns, an untrue statement. 68   When silence on the part of [the representor] or a failure to speak is alleged to constitute misleading conduct or deception,the proper approach to take is to assess silence as a circumstance like any other act or statement and in the context in which it occurs.Hence, it is necessary to examine the silence with reference to the charge that is made against the defendants. [emphasis added] 194    By not disclosing the Invoice Factoring Tenancy to Ng Sing at the time the SGR-Option was bought, and by providing only the two Tenancy Agreements, Cheng was giving Su the false impression that the Property was being sold subject to the two Tenancy Agreements only. As stated earlier in [45] above, Cheng’s concoction of the Cheng-Option was intended to cover his falsehoods in relation to the tenure of the Property and early introduction of the Invoice Factoring Tenancy to Ng Sing and Su at the time of the Cheng-Option. In other words, the existence of the Invoice Factoring Tenancy had been suppressed until June 2011 to give the false impression that the Property was sold with the two Tenancy Agreements (see the findings on this issue above at [33]–[46]). 195    I find that all three false representations were made by Cheng. Cheng knew the actual tenure of the Property as the owner and vendor of the Property, and that the Property was to be sold subject the Invoice Factoring Tenancy and not the two Tenancy Agreements because he was a party to the Invoice Factoring Tenancy, and was the beneficial owner of Invoice Factoring who had made two other sub-tenancy agreements. In making up the Cheng-Option, Cheng cannot deny knowledge and purpose. 196    It was also not disputed that Su did not have direct contact with Cheng, and Ng Sing was, for all intents and purposes, Su’s agent in the transaction. Cheng also knew that the Ng Sing was Su’s agent. Therefore, it could be said that representations were made to Su through Ng Sing. (2)   Inducement, reliance and damages 197    In this case, it was clear that the three misrepresentations had been made by Cheng with the intention for Su to act upon it, and Su had in fact relied on the misrepresentations. Su bought the SGR-Option and completed the purchase of the Property in the name of Hong Quan and Lye. 198    I find that the losses suffered by the plaintiffs as a result of Cheng’s misrepresentations to be the same as that caused by the defendants. The plaintiffs were not seeking a rescission of sale against Cheng. The quantification of damages for fraudulent misrepresentations is to put the victim in the position as if the deceit had not been committed. In this case, Su was claiming for the diminution in value of the Property and incidental losses. (3)   Defences 199    In his defence, Cheng argued that the misrepresentations were not actionable because of cl 11 of the SGR-Option which states: The terms and conditions contained in this “Terms and Conditions of Sale”supersede any previous representations, warranties, information, agreements or undertakings (if any). Whether such be written or oral, given by the Vendor or the Vendor’s agent/s andthese “Terms and Conditions of Sale” shall solely govern the parties’ rights. [emphasis added] 200    Cheng contends that the italicised portions of cl 11 excluded liability for any misrepresentation, and that it was the SGR-Option that conclusively governed the rights of parties. Although cl 11 operates as an entire agreement clause, the crux of the issue is whether cl 11, as an entire agreement clause, also excludes liability for misrepresentations on the part of the vendor. 201    As a matter of public policy, a person cannot rely on a contract to exclude liability for his own fraud. The leading authority,HIH Casualty & General Insurance Ltd v Chase Manhattan Bank[2003] 1 CLC 358 (“HIH Casualty”), ruled at [16] that the law did not permit a contracting party to exclude liability for his own fraud in inducing the making of the contract unless “such intention [is] expressed in clear and unmistakable terms on the face of the contract”. In that case, the House of Lords held (at [17]) that the law required a party seeking to exonerate himself from the consequences of his agent’s fraud to do so expressly and openly and the phrase “shall have no liability of any nature to the insurers for any information provided by any other parties” was insufficient to do so. On the present facts, there was no mention of an explicit exclusion for fraud or fraudulent misrepresentations in the SGR-Option at all. 202    Even so, could it be argued that the entire agreement clause could operate to exclude liability for misrepresentations? Turning to the cases dealing with entire agreement clauses and exclusion clauses, I am of the view that it could not unless it was expressly provided for. 203    The decision inHIH Casualtyon exclusion clauses aligns itself neatly with the purpose of entire agreement clauses. In an earlier case ofThe Inntrepreneur Pub Co Ltd v East Crown Ltd[2000] 2 Lloyd’s Rep 611, Lightman J described (at [7]) the entire agreement clause as one to preclude a party from using statements made in the course of negotiations against the other party. All contractual terms were thus found in the document and previous promises and assurances made in the course of negotiations would have no contractual force. An entire agreement clause thus excluded terms that were not found within the printed agreement that parties had signed. Lightman J’s remarks came with the underlying assumption that entire agreement clauses made were to give certainty to terms of the contract, and were not meant to exclude claims relating to the untruthfulness of statements unless expressly done so. 204    That said, much, however, remains a matter of construction of the clause and, in a proper case, liability for fraudulent misrepresentations could be excluded in a clause which was meant to govern the entire agreement as well. In the more recent case ofAxa Sun Life Services plc v Campbell Martin Ltd[2011] 1 CLC 312 (“Axa Sun Life”), the clause in contention was cl 24 which stated: This Agreement and the Schedules and documents referred to herein constitute the entire agreement and understanding between you and us in relation to the subject matter thereof. Without prejudice to any variation as provided in clause 1.1,this Agreement shall supersede any prior promises, agreements, representations, undertakings or implications whether made orally or in writing between you and us relating to the subject matter of this Agreementbut this will not affect any obligations in any such prior agreement which are expressed to continue after termination. [emphasis added] The question inAxa Sun Lifewas whether the defendants were precluded from alleging,inter alia, misrepresentations in their defence and counterclaim because of cl 24 which operated as an entire agreement clause. This is very much the same question before the court here, and a brief review of the decision is necessary. 205    As regards Lightman J’s remarks above, the Court of Appeal came to the conclusion that “representations” in cl 24 did not cover misrepresentations made because the clause was about giving certainty to the terms of the contract (per Stanley Burnton LJ at [64]) and “being concerned only with matters of agreement” (per Rix LJ at [81]). Rix LJ broke cl 24 into parts and took the view that the non-italicised portions of the clause were concerned with identifying the agreement that the parties had made. Read in totality, it could not be said that the italicised portion referred to misrepresentations made before the contractual agreement. Instead, it referred to representations made earlier and which were not stated in the agreement, and because of the clause, were not terms of the agreement. He also interpreted the word “supersede” to be a word of agreement (to override previous agreements) rather than exclusion. This would be in accordance with the various documents “constitut[ing] the entire agreement”. The essence of misrepresentation was the concern with inaccurate statements which one party would have relied on in entering into the agreement, and was not about what parties had agreed to. It did not make sense that the italicised portions had concerned itself with the issue of inaccurate statements when the rest of the clause was about matters of agreement between both parties. 206    Read in the context of the agreement, Rix LJ also noted (at [82]) that the immediately preceding clause (cl 23) and immediately following clause (cl 25) were also concerned with matters of contractual agreement. Clause 22 had also stated “representations” in the context of a contractual obligation which would also be indicative of how cl 24 was to be interpreted: as a clause of agreement and not one for the exclusion of liability for misrepresentations. For such an exclusion, clear words were required. Rix LJ also summarised the current law on this issue and came to the conclusion that cl 24 did not exclude liability for any misrepresentations, and express words were required if the agreement was to do so. 207    I am of the view that the decision ofAxa Sun Lifeis applicable in the circumstances. Clause 11 of the SGR-Option did not exclude misrepresentations, whether fraudulent or negligent. The clause, as the last clause of the SGR-Option stood as an entire agreement clause and represented the entire understanding of the agreement. In that context, the SGR-Option supersedes any previous representations such that representations are not terms of the SGR-Option if they are not included in it. There were also no clear words in cl 11 that indicated that parties had agreed to exclude the vendor’s liability for misrepresentations at all. All that could be seen was that previous representations (issues of agreement) were superseded by what was stated in the SGR-Option. Furthermore, the first sentence stated that all terms were that stated in the SGR-Option, and this is then repeated in the second sentence in relation to the parties’ rights. Therefore, it could not be said that cl 11 excluded the vendor’s liability for any misrepresentations, be it fraudulent or negligent, which were made by him. 208    Accordingly, Cheng had no defence to the defendants’ allegation of fraudulent misrepresentation committed against the plaintiffs. As I have found Cheng to be liable for fraudulent misrepresentation, it is not necessary for me to deal with the defendants’ allegation of Cheng’s negligent misrepresentations. Fraudulent misrepresentation by Ng Sing 209    The defendants also claimed that Ng Sing had fraudulently misrepresented to the plaintiffs in respect of the First and Second Misrepresentations. I am of the view that this was not a case where Ng Sing was recklessly indifferent about the tenure of the Property. He knew what Su wanted and had conveyed them to Sam Oh. Sam Oh then replied with Cheng’s offer. Ng Sing had also orally confirmed with Cheng that the Property had a 62 year lease. In this case, Ng Sing simply accepted what he was told at face value. 210    Ng Sing’s acceptance at face value of what he was told is not conduct that is deceitful. As stated inPasley v Freeman(1789) 3 Term Rep 51 at 56, “[e]very deceit comprehends a lie, but a deceit is more than a lie”. That Ng Sing was not the originator of the representation would go some way to show that he did not intend to deceive Su, and was not dishonest. 211    Ng Sing was not being recklessly indifferent about the tenancies that the Property was being sold subject to either. The first time he was handed the SGR-Option and the two Tenancy Agreements was at the coffee shop on 18 March 2011 (see above at [43]), he simply accepted them at face value. As stated inTrans-Worldat [84], the important question is whether Ng Sing had genuinely believed that the Property had a 62-year lease and had two existing tenants, and it was not for the court to find that it was not so because the representation turned out to be untrue. I did not find it unreasonable for Ng Sing to accept at face value at that stage what he was told by Sam Oh and Cheng. Hence, I do not find that Ng Sing had made fraudulent misrepresentations to Su. Negligent misrepresentation by Ng Sing 212    Although Ng Sing is not liable for fraudulently misrepresenting to the plaintiffs, I find that he is nevertheless liable for negligent misrepresentations. 213    The defendants first relied on the Estate Agents Act (Cap 95A, 2011 Rev Ed) to show that Ng Sing had a duty of care. Under that statutory provision, Ng Sing was a “salesperson” and had to comply with the Code of Ethics and Professional Client Care set out in the First Schedule of the Estate Agents (Estate Agency Work) Regulations 2010 (“the Code”). According to s 42(2) of the Estate Agents Act, a failure to comply with the Code may render a salesperson liable to disciplinary action. This however, did not make it a legal duty in the sense required for an action of negligent misrepresentation. 214    The defendants approached the common law duty of care on the assumption that Ng Sing was the property agent of Su. I am of the view that it was factually foreseeable that should the number of years left on the lease of the Property be represented as beng more than 60 years, the plaintiffs would proceed to buy the Property. 215    The first stage test ofSpandeckis whether there was a legal proximity between Ng Sing and the plaintiffs for a duty of care to arise, and the court there had cautioned (at [82]) that proximity should be determined incrementally. At [77] ofSpandeck, the court also noted thatHedley Byrne & Co Ltd v Heller & Partners Ltd[1964] AC 465 considered the relationship between the parties as being determinative of duty. This required an assumption of responsibility on the part of Ng Sing by providing a service to Su, and him knowing that Su would rely on the information he told Su (see alsoDeutsche Bank AG v Chang Tse Wen and another appeal[2013] 4 SLR 886 (“Chang Tse Wen”) at [37]). It was not denied that Ng Sing was Su’s property agent in other transactions and it was the same in this transaction as well. Therefore, an established relationship of property agent and buyer was apparent. Ng Sing also accepted that while he only liaised with Su, he was acting as the property agent for all the plaintiffs in this transaction as he knew that Su would be using nominees to hold the Property in their names.[note: 126]Su had also referred to Ng Sing in his affidavit as his property agent who had recommended various properties to him and had assisted him in purchasing the option and passing it on to him. Also, Ng Sing had made changes to the SGR-Option so that Su’s nominees could hold the Property for him upon the purchase. In the circumstances, there was a voluntary assumption of responsibility by Ng Sing to be the property agent of Su in this transaction. Su had also relied on Ng Sing’s information as evidenced by the fact that Su wanted Ng Sing to purchase the SGR-Option after Ng Sing had informed him about the tenure. 216    Given my finding above that the actions of both Ng Sing and Su pointed towards an assumption of responsibility by the former and reliance on the former by the latter, I am of the view that a tortious duty of care isprima facieestablished. 217    Moreover, I am also of the view that there was no policy reason militating against a finding of a tortious duty of care owed by property agents to purchasers. In fact, as purchasers rely on their property agents to find a property that suited their requirements and needs, it would only be fair to impute a duty of care upon property agents to discharge their obligations to meet the purchasers’ requirements. Arguably, a property agent could be liable for making or passing on false or inaccurate statements even if he believed them to be true or accurate when his purchaser-client relied on his skill and knowledge to purchase a property. 218    As mentioned earlier, Ng Sing was a “salesperson” for the purposes of the Estate Agents Act, and had to comply with the Code. I am of the view that the statute and regulations were indicative of a standard that Ng Sing had to meet as a salesperson. According to ss 6(2)(a) and (b) of the Code which relates to the general duty to clients and the public, salespersons were required to act according to the instructions of the client and protect the interests of the client. Moreover, the salesperson was not to mislead the client or provide any false information to the client. It is apparent that, as an issue of public policy, the Code took misrepresentations by salespersons seriously and the Code implicitly required a salesperson to take steps to ensure that false information or misrepresentations would not be made. I find this indicative of the need for the protection of purchasers and sellers from negligent and/or fraudulent salespersons. 219    In conclusion, I find that there was a duty of care owed by Ng Sing to the plaintiffs. I will now consider if Ng Sing had breached his duty of care in relation to the First and Second Misrepresentations. 220    In relation to the First Misrepresentation, Ng Sing had taken at face value the assurances of both Sam Oh and Cheng when he spoke to them. Although this was done honestly, as Ng Sing stated that he trusted Sam Oh and believed that Sam Oh had made the relevant checks, he was negligent. He chose to accept what Cheng told him at face value without making any independent verification; a risk he was willing to assume. In my view, it was conduct that is tantamount to a failure to exercise reasonable skill and care to check if the Property had a 62-year lease left. Ng Sing testified that it was important to verify that Cheng was the owner of the Property and had the capacity to sell. He accepted a property tax bill that showed that Cheng was the owner of the Property.[note: 127]Moreover, he verified Cheng’s identity by asking for Cheng’s identification card. Ng Sing confirmed that if the property tax bill was not shown to him he would have asked for proof that Cheng was the owner.[note: 128]Ng Sing knew that Su wanted to purchase a HDB shophouse in Kallang Bahru that had a lease of more than 60 plus years. Not only did he not provide for this specific requirement in the SGR-Option that he prepared (Ng Sing took over the preparation of the option from Sam Ho because the latter was illiterate in English), he also did not independently verify the information provided by Cheng on the Property’s lease. When asked why there was no evidence shown to prove the Property’s leasehold tenure, Ng Sing became evasive and could not give an explanation for why he had not asked for some proof of the tenure.[note: 129]His reply was that he was not required to conduct a SLA search on title as that was a matter for the defendants to carry out. 221    I am of the view that Ng Sing’s negligence was in not verifying the tenure of the Property when he could have done so, and he passed on the information to Su on the assumption that it was truthful. 222    As for the Second Misrepresentation, I am of the view that a reasonable property agent would have found that the Lochen Tenancy was a sub-tenancy as seen from how the Lochen Tenancy stated that the first floor of the Property was being “sublet”. This should have raised a red flag even though the Lochen Tenancy was signed by Cheng for and on behalf of Invoice Factoring. On its face, the Erniwati Tenancy looked like a tenancy agreement between Cheng as the Property’s owner and the tenant: Cheng’s particulars were used as the landlord[note: 130]even though this was actually inaccurate as Cheng could not be trading as Invoice Factoring. Invoice Factoring was a sole proprietorship owned by Contac Point LLP and managed by Cheng.[note: 131]Therefore it could only be Contac Point LLP trading as Invoice Factoring. Even so, I am of the view that even if an estate agent would not have noticed the distinct legal personalities of Cheng and Invoice Factoring, he would still have queried about the Lochen Tenancy and the letter of offer for the Lochen Tenancy received with the two Tenancy Agreements (see also [110] above). The absence of the letter of offer to Lochen in Ng Sing’s affidavit does not mean that he was not the person who obtained the letter of offer from Cheng. He met Cheng in person at the coffee shop on 18 March 2011 when the SGR-Option and the two Tenancy Agreements including the letter of offer were passed to him. Therefore, I find that Ng Sing had also been negligent in discharging his duty as a property agent for not verifying the discrepancies in the two Tenancy Agreements which might have alerted him to the fact that there was another tenancy agreement or that Cheng did not have capacity as landlordviz, Lochen and Mdm Erniwati. 223    In conclusion, I find that Ng Sing had indeed negligently made the First and Second Misrepresentations and thus breached his duty of care owed to the plaintiffs. The damages suffered by the plaintiffs was the overpayment of the Property (and its incidental losses) as Su had specifically told Ng Sing that he was looking to buy a property with a lease of 60 years or more and had indicated a price he was willing to pay. Su had overpaid as the Property had only 17 years remaining on its 30-year lease. I am thus of the view that Ng Sing’s breach of duty has caused the same damage as that caused by the defendants as well. 224    To reinforce my finding that an property agent like Ng Sing would be required to check whether the property was really what the vendor represented it to be, I refer to the observations of Choo Han Teck J inYuen Chow Hin and another v ERA Realty Network Pte Ltd[2009] 2 SLR(R) 786 on the property agent’s duty to act in the interest of his principal. Choo J found that the engagement of a property agent made that property agent an agent of the principal buyer or seller, and that the relationship between the property agent and the principal was fiduciary in nature and one founded in trust. He further added that that the agent could be held liable for negligent statements made to the principal as the agent would have a duty to act in the interests of the principal. Vicarious liability of SGR Property 225    Lastly, there is an issue of vicarious liability that was raised by the defendants in respect of Ng Sing and SGR Property. As stated at the start of the judgment, other than filing its defence, SGR Property did not participate in this action and was not present at the trial. 226    The defendants argue that SGR Property should be held vicariously liable for Ng Sing’s negligent misrepresentations as Ng Sing was employed at SGR Property at the material time.[note: 132]Based on Mr Daniel’s cross-examination of Ng Sing, the defendants’ submissions, and the state of the pleadings before me, I am of the view that a more appropriate order to make is a judgment in default of SGR Property’s absence at the trial under O 35 r 1(2) of the Rules of Court (Cap 322, R 5, 2011 Rev Ed). A judgment on the merits would not be appropriate given that the evidence before me appeared incomplete: (a)     Ng Sing was not asked about his relation to SGR Property in great detail; (b)     The claim against SGR Property in the defendants’ Statement of Claim only stated that SGR Property was Ng Sing’s employer and would be responsible and liable in law for the actions and liabilities of Ng Sing; (c)     The defendants relied on an associate agreement dated 21 November 2009 in their reply to the SGR Property’s Defence. This agreement was signed by Ng Sing but Ng Sing was not asked about it at trial; and (d)     There may be other documents that may prove to be relevant to this action but are not before this court. 227    In conclusion, with respect to SGR Property, I order judgment in default of its appearance at trial with costs.",
        "Assessment of contribution": "228    Having established that (a) Cheng is liable for the fraudulent misrepresentations made to Su; (b) Ng Sing is liable for negligent misrepresentations; and (c) the damage caused by the third parties was the same damage suffered by the defendants, the defendants thus succeed in claiming a contribution for damages from the third parties pursuant to s 15(1) of the Civil Law Act. In this regard, the defendants have relied on s 2 of the Misrepresentation Act. As earlier stated, the defendant’s reliance on s 2 is misplaced. It is inaccurate to utilise s 2 as a cause of action as its purpose was merely to extend the type of relief a representee could attain from a representor. Pursuant to s 2, a representor who is found liable for any type of misrepresentation would be liable in damages as if the representor had made the misrepresentation fraudulently. In this case, as Cheng is liable for fraudulent misrepresentation under common law, the defendants do not need to rely on s 2 for a claim of damages as if a fraud had been committed. Furthermore, as s 2 of the Misrepresentation Act was a claim founded on an action in contract, Ng Sing could not be made liable under this section. 229    As for s 16 of the Civil Law Act, the amount of contribution recoverable from any person shall be such as may be found by the court to be just and equitable having regard to the extent of that person’s responsibility for the damage in question. In this case, the defendants’ argument is that Cheng’s deceit was more culpable than the defendants’ negligence and he should thus bear the majority of the damages.[note: 133]In a proper case, the moral blameworthiness and the causative potency of the fraud is very much greater than that of negligence (see generallyJackson & Powell at para 4-018). This is reflected in the measure of damages for fraud being much wider than that for negligence as damages are not limited by the remoteness rule (seeWishing Star Ltd v Jurong Town Corp[2008] 2 SLR(R) 909 at [24]). I am of the view that in a case of contribution for damages such as the present, while the damages apportioned to the fraudster should take into consideration moral culpability and deterrence, this must be balanced against the responsibilities of the other parties who are contributing. 230    In the case ofNationwide Building Society v Dunlop Haywards Ltd[2010] 1 WLR 258, a property was fraudulently overvalued by an employee of the valuer. The plaintiff made two advances to a company based on the valuations, and the company later defaulted. The plaintiff sued the valuer and the negligent solicitors who handled the transaction in relation to the advances made. The solicitors subsequently brought a claim for contribution against the valuer. Christopher Clarke J decided at [77] that the contribution should be apportioned 80% to the valuer and 20% to the solicitors on the basis that the moral blameworthiness of the valuer and the causative potency of the fraud of its agent was much greater than that of the solicitors’ as it was a bare-faced fraud and was not the only one of its kind. The deceit was also the prime reason for the plaintiff to make the advances that it did. Although the plaintiff had failed to pick up on the fraud, his failure wasnotto participate in it and was another reason which warranted a lower amount of contribution. Similarly, in the recent case ofClydesdale Bank Plc v Workman[2014] PNLR 18, the judge also took the view that dishonesty also correlated to a higher contribution from that party who bore 65% of the contribution as opposed to the negligent party who bore 35% (at [97]–[99]). Therefore, I must consider the causative potency and the blameworthiness of all the parties present. 231    I must also consider whether any party benefited from the transaction. InDubai Aluminium Co Ltd v Salaam[2003] 2 AC 366, the House of Lords considered the apportionment of contribution in relation to parties to a fraud after the parties had settled with the plaintiff. Some of the parties remained in possession of sums of misappropriated monies while some had none. At [52]–[53], Lord Nicholls of Birkenhead stated: 52    … The object of contribution proceedings under the Contribution Act is to ensure that each party responsible for the damage makes an appropriate contribution to the cost of compensating the plaintiff, regardless of where that cost has fallen in the first instance. The burden of liability is being redistributed.But, of necessity, the extent to which it is just and equitable to redistribute this financial burden cannot be decided without seeing where the burden already lies. The court needs to have regard to the known or likely financial consequences of orders already made and to the likely financial consequences of any contribution order the court may make.… 53    In the present case a just and equitable distribution of the financial burden requires the court to take into account the net contributions each party made to the cost of compensating [the plaintiff].Regard should be had to the amounts payable by each party under the compromises and to the amounts of [the plaintiff’s] money each still has in hand.As Mr Sumption submitted, a contribution order will not properly reflect the parties' relative responsibilities if, for instance, two parties are equally responsible and are ordered to contribute equally, but the proceeds have all ended up in the hands of one of them so that he is left with a large undisgorged balance whereas the other is out of pocket. [emphasis added] 232    On the present facts, the defendants’ failure to exercise skill and care in relation to the handling of the conveyancing transaction enabled Cheng’s fraudulent misrepresentation to persist and remain undetected. It was certainly very bold of Cheng to recklessly make a false statement about the leasehold tenure of the Property in the knowledge that the subject matter of the falsehood was easily verifiable. Had the defendants informed the plaintiffs of the SLA search results, Cheng’s fraudulent misrepresentations would have come to light early, before the exercise of the SGR-Option. Whilst Cheng’s deceit perpetuated, he was able to persuade Su to shell out more money upfront towards the purchase of the Property. Cheng’s fraudulent conduct cannot be taken lightly. He further deceived the plaintiffs by lying that the head tenancy and the tenure of the Property were made known to Sam Oh and Ng Sing even before Su came into the picture. Through his fraudulent misstatements, he managed to sell the Property for a price well above its market value and received the overpayment. As for Ng Sing, his negligence allowed for Cheng’s fraudulent misstatements to perpetuate as well, but to a much smaller extent as he had a much more limited role in the transaction. Moreover, he had not participated in the making of the misstatements. I am thus of the view that, in this case, compared to Ng Sing, Cheng should be held responsible for a larger extent of the damages. 233    Consequently, I apportion the parties’ contribution for damages stated above at [159] as follows: 50% to Cheng, 45% to the defendants and 5% to Ng Sing.",
        "Conclusion": "234    The plaintiffs succeed against the defendants in the main action to the extent that there is judgment in favour of the plaintiffs in the total sum of $317,688 as damages for the defendants’ breach of duty of care as solicitors in the conveyancing transaction. I also award interest on the aforesaid sum at the rate of 5.33% per annum from the date of the writ until payment. The defendants are to pay the plaintiffs the costs of the main action which are to be taxed if not agreed. 235    As for the third party action, the defendants are entitled to recover from Cheng and Ng Sing their respective proportionate share of contribution in the sum of $158,844 and $15,884 (rounded down to the nearest dollar) respectively together with the amount of interest the defendants have to pay the plaintiffs in satisfaction of this judgment. Additionally, as the defendants succeeded in the third party action, costs, which are to be taxed if not agreed, are awarded to them and are to be paid in the proportionate share of the contribution by Cheng and Ng Sing. As the issues in the main action and the third party action overlap, I am looking at one set of costs, and this particular set of costs is already awarded to the defendants in the third party action. This means that Cheng and Ng Sing are not required to bear in the proportion of their respective contributions, the defendants’ costs of defending the main action including the costs ordered in favour of the plaintiffs in the main action. 236    As for Cheng’s counterclaim that was subsequently withdrawn with leave at the start of the trial, I award costs to be taxed if not agreed to the defendants in relation to this counterclaim.",
        "Annex 1": "",
        "Annex 2": "",
        "Annex 3": "[note: 1]Agreed Bundle (“AB”), Vol 1, pp 81-85. [note: 2]Bundle of Pleadings (“BP”), pp 19, 62. [note: 3]Bundle of Affidavits of Evidence-in-Chief (“BOA”), Vol 1, Tab 1, para 11(4); BOA, Vol 3, Tab 7, paras 24-25. [note: 4]BOA, Vol 1, Tab 1, para 19. [note: 5]BOA, Vol 2A, Tab 2, paras 90-91. [note: 6]Transcript of Evidence (“TE”), 28/6/13, p 7. [note: 7]1st Third Party Bundle of Documents (“3PBD”), p 1. [note: 8]Third Party Proceedings Agreed Bundle (“TPAB”), p 84. [note: 9]Plaintiffs’ Closing Submissions (“PCS”), para 98(1); Defendants’ Closing Submissions(“DCS”), para 202; Defendants’ Third Party Submissions (“DCS3P”), para 141-146. [note: 10]AB, p 47. [note: 11]TPAB, p 56. [note: 12]TPAB, p 96. [note: 13]TPAB, pp 1-4. [note: 14]TE, 28/6/13, p 35; 3PBD, pp 12-15. [note: 15]BOA, Vol 3, Tab 10, para 12. [note: 16]TE, 28/6/13, p 48. [note: 17]BOA, Vol 3, Tab 10, paras 13-16. [note: 18]BOA, Vol 3, Tab 10, para 17. [note: 19]BOA, Vol 3, Tab 11, paras 6-8; BOA, Vol 3, Tab 12, paras 6-8. [note: 20]TE, 1/7/2013, p 59. [note: 21]BOA, Vol 3, Tab 11, para 4. [note: 22]BOA, Vol 3, Tab 12, paras 9-10, TE, 1/7/13, pp 14-15. [note: 23]BOA, Vol 3, Tab 11, para 10. [note: 24]TE, 1/7/13, pp 17-18. [note: 25]TE, 28/6/13, p 44. [note: 26]TE, 1/7/13, pp 19, 77. [note: 27]3PBD, p 25. [note: 28]TE 26/6/13, p 47. [note: 29]BOA, Vol 1, Tab 1, paras 14-15. [note: 30]BOA, Vol 2A, Tab 2, para 78. [note: 31]AB, p 274. [note: 32]AB, p 73. [note: 33]BOA, Vol 1, Tab 1, para 11. [note: 34]BOA, Vol 3, Tab 7, para 25. [note: 35]BOA, Vol 2A, Tab 2, para 12. [note: 36]TE, 26/6/2013, p 75. [note: 37]AB, p 50. [note: 38]BOA, Vol 3, Tab 7, para 12. [note: 39]BOA, Vol 2A, Tab 2, paras 19-20. [note: 40]AB, p 60. [note: 41]TE, 25/6/13, p 5; 1/7/13, pp 87-88. [note: 42]AB, p 72. [note: 43]BOA, Vol 1, Tab 1, para 11(2). [note: 44]BOA, Vol 3, Tab 7, para 17. [note: 45]BOA, Vol 3, Tab 7, para 7. [note: 46]BOA, Vol 2A, Tab 2, paras 98-99. [note: 47]TE, 27/6/13, p 27. [note: 48]TE, 27/6/13, p 26. [note: 49]TE, 27/6/13, p 100. [note: 50]AB, p 72. [note: 51]TE, 27/6/13, p 79. [note: 52]BOA, Vol 2A, Tab 2, para 24. [note: 53]AB, pp 424-426. [note: 54]BOA, Vol 1, Tab 1, para 30. [note: 55]BOA, Vol 3, Tab 7, para 41. [note: 56]AB, p 416; AB, p 423. [note: 57]BOA, Vol 2A, Tab 2, para 110. [note: 58]BOA, Vol 1, Tab 1, para 31(3). [note: 59]BOA, Vol 1, Tab 1, para 33. [note: 60]AB, pp 440-442. [note: 61]BOA, Vol 1, Tab 1, para 39(1). [note: 62]PCS, para 2. [note: 63]BP, p 219, para 15(a), (b), (c), (d), (e), (k), (l). [note: 64]BP, p 219, para 15(g), (h), (i), (j), (k), (l). [note: 65]BP, p 220, para 15(d). [note: 66]PCS, para 73. [note: 67]TE, 27/6/13, pp 29-31. [note: 68]TE, 2/7/13, pp 7-8. [note: 69]BOA, Vol 3, Tab 5, para 4(1). [note: 70]PCS, para 109. [note: 71]TE, 24/6/13, pp 18-20. [note: 72]TE, 27/6/13, pp 86, 103. [note: 73]TE, 27/6/13, p 27. [note: 74]PCS, para 56, 59. [note: 75]BOA, Vol 1, Tab 1, para 40(5). [note: 76]BP, pp 218-219; PCS, para 63(3). [note: 77]DCS, paras 79-82. [note: 78]TE, 25/6/13, p 22. [note: 79]TE, 26/6/13, pp 78-79. [note: 80]TE, 26/6/13, pp 98-99. [note: 81]BOA, Vol 2A, Tab 2, paras 62, 90. [note: 82]AB, p 25. [note: 83]TE, 26/6/13, pp 84-85. [note: 84]AB, p 27. [note: 85]TE, 26/6/13, pp 90-91. [note: 86]TE, 26/6/13, pp 94-95. [note: 87]TE, 26/6/13, p 91. [note: 88]BOA, Vol 1, Tab 1, pp 28-29. [note: 89]AB, p 443. [note: 90]TE, 25/6/13, p 51. [note: 91]PCS, pp 44-46; BOA, Vol 1, Tab 1, para 67(3). [note: 92]BOA, Vol 1, Tab 1, para 67(6). [note: 93]TE, 25/6/13, p 22. [note: 94]DCS, para 188. [note: 95]TPAB, pp 106-116. [note: 96]AB, pp 326-333. [note: 97]TE, 2/7/13, pp 125, 132. [note: 98]AB, p 329. [note: 99]Exhibit D9. [note: 100]Exhibit D8. [note: 101]TE, 2/7/13, pp 120-121. [note: 102]TE, 2/7/13, p 121, 138. [note: 103]AB, p 610. [note: 104]TE, 2/7/13, p 77. [note: 105]Exhibit P5, p 2. [note: 106]Exhibit P3. [note: 107](81.2-43.4) / 81.2 x 100% [note: 108]http://www.sla.gov.sg/htm/ser/ser0204.htm, accessed on 13 March 2014. [note: 109]TE, 2/7/13, pp 90-91. [note: 110]TE, 2/7/13, p 137. [note: 111]Exhibit P5, p 2. [note: 112]AB, p 610. [note: 113]TE, 2/7/13, p 78. [note: 114]TE, 2/7/13, p 79. [note: 115]TE, 25/6/13, pp 80-82. [note: 116]AB, p 140. [note: 117]BOA, Vol 1, Tab 1, para 60. [note: 118]TE, 1/7/14, p 56. [note: 119]BOA, Vol 1, Tab 1, para 60(1). [note: 120]BP, pp 37-38. [note: 121]DCS, para 202. [note: 122]AB, pp 539-540, 637. [note: 123]Cheng’s submissions, para 13. [note: 124]Cheng’s submissions, paras 26-28. [note: 125]Ng Sing’s submissions, paras 57-59. [note: 126]TE, 1/7/13, p 54. [note: 127]TE, 1/7/13, p 67. [note: 128]TE, 1/7/13, pp 68-69. [note: 129]TE, 1/7/13, pp 70-72. [note: 130]AB, p 34. [note: 131]BOA, Vol 2B, Tab 2, p 1337. [note: 132]BP, p 106, para 21. [note: 133]DCS3P, para 170."
    }
}