{
    "case_title": "Boustead Singapore Ltd\n      v\n      Arab Banking Corp (B.S.C.)",
    "ncitation": "[2015] SGHC 63",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       This dispute is between the Arab Banking\n                    Corporation (“ABC”) and its customer, Boustead Singapore Limited\n                    (“Boustead”). ABC is a Bahrain bank and Boustead is a Singapore\n                    public-listed infrastructure company that is involved in construction\n                    developments internationally. The dispute arises out of credit facilities that\n                    ABC extended to Boustead for a construction project in Libya. The central issue\n                    is whether Boustead is required to pay ABC sums of money that ABC alleges are\n                    due pursuant to ABC’s demand under a credit facilities agreement\n                    (“the FA”).",
        "Background": "2       In 2007, Boustead, acting through a joint\n                    venture (“the JV”) with a Libyan company, was employed by the\n                    Organisation for Development of Administrative Centres (“ODAC”) to\n                    construct a housing development in Al-Marj, a city in north-eastern Libya. While\n                    it does appear that one of Boustead’s wholly-owned subsidiaries, and not\n                    Boustead, was the actual party to the JV,[note: 1]this\n                    distinction is immaterial for present purposes and I will not address it\n                    further. According to Boustead, ODAC was a Libyan entity involved in public\n                    projects throughout the country and was controlled by the regime of the late\n                    Muammar Muhammad Abu Minya al-Gaddafi, better known as Muammar\n                Gaddafi. 3       The JV’s contract with ODAC (“the\n                    Public Works Contract”) was on ODAC’s standard terms. The Public\n                    Works Contract required the JV to furnish a performance bond (“the\n                    PB”) and an advance-payment guarantee (“the APG”) in favour\n                    of ODAC. 4       The issuance of the PB and APG in favour of ODAC\n                    was done through two intermediary banks. First, Boustead instructed ABC to issue\n                    two counter-guarantees in favour of a Libyan bank, the Bank of Commerce and\n                    Development (“BCD”). I shall refer to these counter-guarantees as\n                    “CG38” and “CG39”, or collectively as “the\n                    CGs”. Second, ABC instructed BCD to issue the PB and APG in favour of\n                    ODAC against the issuance of the CGs in BCD’s favour. The sums\n                    counter-guaranteed under CG38 and CG39 corresponded with the sums guaranteed\n                    under the PB and APG respectively. They were, to that extent, granted on a\n                    back-to-back basis. At the material time, both CG38 and the PB secured the sum\n                    of US$3,760,387.95 and expired on 28 July 2011. CG39 and the APG secured\n                    the sum of US$15,021,093.25 and expired on 30 June 2011. 5       The CGs, the PB and APG were demand guarantees\n                    (also known as on-demand guarantees or demand bonds). All required payment on\n                    demand as opposed to payment on proof of loss, although each instrument had\n                    different requirements for a valid demand for payment. 6       Boustead’s banking relationship with ABC\n                    was governed by the FA. Under the FA, Boustead was obliged to reimburse or\n                    indemnify ABC on ABC’s first demand for any amounts demanded or paid under\n                    the CGs. The FA stipulated that any demand from ABC was to be conclusive\n                    evidence of the amount owing from Boustead to ABC under the FA. 7       A diagrammatic representation of the parties and\n                    their relation to each other is set out below:",
        "Unrest in Libya": "8       Unrest broke out in Libya in 2011 while the\n                    Al-Marj construction project was still underway. The unrest bloomed into a\n                    full-scale civil war. According to Boustead, the Al-Marj project site was looted\n                    and pillaged. Boustead’s plant and equipment was destroyed.\n                    Boustead’s staff was evacuated from the Al-Marj project site, and\n                    subsequently from Libya on 23 February 2011 with the assistance of\n                    International SOS. The United Nations Security Council (“UNSC”)\n                    passed Resolutions 1970 (2011) and 1973 (2011) on 26 February and\n                    17 March 2011 respectively, imposing asset freezes on the assets of Muammar\n                    Gaddafi, his inner circle, and entities under their control. 9       Boustead took the position that the Public Works\n                    Contract was discharged by the war and subsequent evacuation of Boustead’s\n                    staff from the Al-Marj project site. Boustead wrote to ODAC on 13 June 2011\n                    stating that aforce majeureevent had occurred,\n                    and that the JV was no longer required to perform its obligations under the\n                    Public Works Contract.[note: 2]It is in this context that the\n                    dispute currently before the court began to take root.",
        "Notices or demands in respect of the PB or APG and the CGs": "10     After unrest in Libya broke out in early 2011,\n                    various notices or demands were sent by ODAC to BCD and by BCD to ABC in respect\n                    of the PB and CG38 and the APG and CG39. I will set out the sequence in respect\n                    of the APG and CG39 first and then the sequence in respect of the PB and\n                    CG38. 11     On 25 May 2011, after Boustead’s\n                    staff had been evacuated from Libya, BCD sent a Society for Worldwide Interbank\n                    Financial Telecommunication (“SWIFT”) message to ABC. (SWIFT\n                    messages were the primary mode of communication between ABC and BCD, and unless\n                    I mention to the contrary, any communication or correspondence between ABC and\n                    BCD was by SWIFT message.) BCD requested that the expiry of CG39 be extended to\n                    31 December 2012, or that the full sum secured under CG39 be\n                        paid.[note: 3] 12     The first extend or liquidate request from BCD\n                    to ABC was followed by a second on 20 June 2011.[note: 4]On 23 June 2011, BCD\n                    made a demand on ABC for payment under CG39 (“the CG39\n                        Demand”).[note: 5]ABC\n                    informed Boustead of the CG39 Demand on the same day. As it turned out, Boustead\n                    had commenced Originating Summons No 503 of 2011\n                    (“OS 503/2011”) against ABC on 22 June 2011. Boustead\n                    obtained anex parteinjunction restraining ABC\n                    from extending the validity of or making payments under the CGs on 23 June\n                    2011, perhaps before having knowledge of the CG39 Demand already made on ABC.\n                    Boustead wrote to ABC on 23 June 2011 informing the latter of the\n                        injunction.[note: 6]ABC\n                    relayed the message to BCD on 28 June 2011.[note: 7] 13     BCD adopted the same approach in respect of\n                    CG38 notwithstanding the injunction restraining ABC from making payment under\n                    both CGs. BCD sent ABC a first extend or liquidate request for CG38 on\n                    30 June 2011,[note: 8]followed by a second request on 3 July 2011.[note: 9]On 11 July 2011, BCD made a\n                    demand on ABC for payment under CG38 (“the CG38\n                        Demand”).[note: 10] 14     The basis of both the CG38 and CG39 Demands\n                    were stated by BCD to be demands from ODAC under the PB and APG respectively.\n                    When Boustead was informed of the earlier CG39 Demand, it asked ABC to provide a\n                    copy of the ODAC demand on which the CG39 Demand was based. ABC relayed\n                    Boustead’s request to BCD. BCD obliged, and on 14 July 2011 (which\n                    was after the CG38 Demand had been made), BCD sent to ABC copies of both the\n                    purported demands from ODAC which formed the basis for BCD’s CG38 and CG39\n                        Demands.[note: 11]These turned out to be letters from\n                    ODAC to BCD dated 16 May and 19 June 2011. I shall refer to them as\n                    “the ODAC Notices”. ABC forwarded copies of the ODAC Notices to\n                    Boustead on 18 July 2011.[note: 12]",
        "Proceedings in Singapore gain momentum": "15     It will be recalled that Boustead commenced\n                    OS 503/2011 and obtained anex parteinjunction restraining ABC from making payment to BCD under the CGs on\n                    23 June 2011. On 24 April 2012, ABC successfully challenged the\n                    jurisdiction of the Singapore court in OS 503/2011 before an assistant\n                    registrar. This was about ten months after the injunction was first granted. The\n                    assistant registrar set aside the order granting leave for service of the\n                    originating process out of jurisdiction, but did not discharge the injunction.\n                    Boustead appealed against the assistant registrar’s decision. A judge of\n                    the High Court dismissed the appeal on 29 August 2012 on the ground that\n                    Boustead had commenced the action with an incorrect originating process. The\n                    judge also discharged the injunction. 16     Boustead commenced Suit No 730 of 2012\n                    (“S 730/2012”) against ABC the next day, on 30 August\n                    2012. Boustead also made anex parteapplication\n                    for a second interim injunction to the same effect as the first. The second\n                    injunction was granted on the same day by the same judge who had discharged the\n                    first injunction. In S 730/2012, Boustead seeks a declaration that it is\n                    discharged from all liabilities and obligations to ABC under the FA insofar as\n                    they relate to the CGs. Boustead also seeks a permanent injunction restraining\n                    ABC from making payment to BCD under the CGs.[note: 13] 17     While proceedings in Singapore were unfolding,\n                    ABC continued to receive requests from BCD to extend or liquidate the CGs. On\n                    23 August 2012, BCD wrote to ABC stating that ODAC requested an extension\n                    or liquidation of the APG. In the same message, BCD further stated that if an\n                    extension was not forthcoming, BCD “shall be grateful ... if [ABC] would\n                    consider this SWIFT as an official claim for liquidation of the value of\n                        [CG39]”.[note: 14]ABC\n                    responded on 27 August 2012 acknowledging BCD’s message, and\n                    reminding BCD of the injunction.[note: 15]",
        "ABC makes a demand on the FA and issues an event-of-default\n                notice": "18     On 3 September 2012, ABC made a\n                    consolidated demand for payment of US$18,781,481.20 under the FA. I shall refer\n                    to this as “the FA Demand”. The FA Demand was for the aggregate of\n                    the sums demanded by BCD under the CGs.[note: 16]The FA Demand was made more\n                    than a year after BCD’s demands for payment under the CGs. An injunction\n                    restraining ABC from making payment to BCD under the CGs was and still continues\n                    to be in place from when it was first granted on 23 June 2011 (save for the\n                    narrow one-day window when the first injunction was discharged, which is\n                    described at [15]–[16] above). 19     Boustead responded to ABC’s FA Demand by\n                    email on 4 September 2012.[note: 17]The email reminded ABC that\n                    it was restrained from making payment under the CGs. The email also set out\n                    Boustead’s position that it disputed the validity of the CG Demands and\n                    the ODAC Notices, and that Boustead would not be making any payment to\n                    ABC. 20     ABC responded by serving an event-of-default\n                    notice (“the EOD Notice”) on Boustead under the FA on\n                    10 September 2012.[note: 18]The ground for the EOD Notice was\n                    that ABC had not received payment from Boustead. ABC’s position is that\n                    the EOD Notice terminated the FA with immediate effect. 21     ABC subsequently commenced Suit No 784 of\n                    2012 (“S 784/2012”) on 19 September 2012, claiming the\n                    sums due under the FA Demand, or alternatively, seeking a declaration that\n                    Boustead is liable to pay ABC on the sums demanded in the FA Demand. ABC also\n                    seeks the discharge of the second injunction restraining payment to BCD. The\n                    trial before me was for the two consolidated suits, S 730/2012 and\n                    S 784/2012. 22     There was also some further correspondence\n                    between ABC and BCD in 2012. These were mainly updates from ABC to BCD on the\n                    legal proceedings in Singapore. ABC on two occasions invited BCD to instruct\n                    counsel in Singapore and to be joined as defendants to the Singapore\n                    proceedings. BCD twice declined. This correspondence will be addressed in\n                    greater detail below.",
        "The relevant agreements": "23     It will be helpful to provide an outline of\n                    the terms of the relevant agreements before turning to the various allegations\n                    and claims. I will give only a brief overview of the agreements in this section.\n                    I will discuss them in greater detail as and when necessary in the course of my\n                    analysis.",
        "The FA": "24     The FA is an agreement between ABC and\n                    Boustead. The FA comprises two documents: a facility agreement dated 4 July\n                    2008; and a supplemental facility agreement dated 27 July 2009, which\n                    varied the terms of the earlier facility agreement. It is needless to draw a\n                    distinction between these two documents. Any reference to “the FA”\n                    is to the original facility agreement as varied by the supplemental facility\n                    agreement. The FA is governed by Singapore law. There are three provisions in\n                    the FA that are relevant to these proceedings, cll 6.6, 6.8 and 6.9: (a)     Clause 6.6 provides that\n                        Boustead is to indemnify ABC against any loss it might suffer with respect\n                        to the issuance of the CGs. (b)     Clause 6.8 states that ABC shall not have any\n                        obligation to make factual determinations as to the validity or genuineness\n                        of any document delivered to it under the CGs. (c)     Clause 6.9 requires Boustead to\n                        “reimburse and/or indemnify [ABC] for any amounts demanded or paid\n                        under [the CGs]”. The reimbursement or indemnity is to be provided\n                        “upon [ABC’s] demand (which demand shall, in the absence of\n                        manifest error, be conclusive evidence of the amount\n                            owing)”.[note: 19]Clause 6.9 further states that Boustead’s obligation to pay the\n                        amounts demanded by ABC “shall be absolute and unconditional\n                        irrespective of any ... disputes of [Boustead] concerning the merits or\n                        validity or propriety of any such demands or claims or any payment\n                            made”.[note: 20]The FA Demand (see [18] above) was made pursuant to\n                    cl 6.9.",
        "The CGs": "25     The CGs are demand guarantees that were issued\n                    by ABC in favour of BCD. They were issued by ABC in accordance with\n                    Boustead’s instructions and pursuant to the FA. 26     The CGs were concluded through SWIFT messages\n                    between ABC and BCD.[note: 21]The terms of both are largely\n                    similar. Both are stipulated to be “subject to the [ICC] uniform rules\n                    for demand guarantees ... and ... as to matters not governed by the uniform\n                    rules ... be governed by and construed in accordance with English law.”\n                    This is accepted to be a reference to the International Chamber of Commerce\n                    Uniform Rules for Demand Guarantees (ICC Publication No 458) (“URDG\n                    458”). Disputes arising from the CGs are also to be submitted to the\n                    non-exclusive jurisdiction of the English courts. 27     Both CGs contain the same requirements for a\n                    conforming demand for payment. A demand for payment under the CGs must have a\n                    supporting written statement specifying that BCD had received a demand for\n                    payment from ODAC in accordance with the terms of the PB or APG, as the case may\n                    be. These requirements will be examined below in the analysis of whether\n                    BCD’s demands for payment under the CGs on ABC were conforming\n                    demands.",
        "The PB and APG": "28     BCD granted the PB and APG in favour of ODAC\n                    against the CGs. Both the PB and APG are in Arabic, but English translations of\n                    the documents were made available for the purposes of the trial. The terms of\n                    both the PB and APG are largely similar. Both are demand guarantees and are\n                    stipulated to be governed by Libyan law and subject to the non-exclusive\n                    jurisdiction of the Libyan courts. 29     Clause 2 of the PB requires a demand for\n                    payment from ODAC to state:[note: 22](a) the amount that was due\n                    to ODAC; (b) that Boustead was in breach of its obligations under the Public\n                    Works Contract; and (c) the respect in which Boustead was in\n                breach. 30     In the same vein, cl 2 of the APG\n                    requires a demand for payment from ODAC to state:[note: 23](a) that Boustead has failed\n                    to repay the advance payment in accordance with the conditions of the Public\n                    Works Contract; and (b) the amount which the JV has failed to\n                repay.",
        "The arguments and issues": "",
        "Boustead’s position": "31     Boustead’s main contention is that it\n                    should be discharged from all obligations owed to ABC under the FA that are in\n                    relation to the CGs. This contention is made on four separate grounds: fraud,\n                    conspiracy, unconscionability and contract. 32     Boustead’s fraud argument is that\n                    ABC’s claim against Boustead is dishonest[note: 24]because it has “no basis in\n                    fact and ... law”.[note: 25]Boustead’s allegation of\n                    dishonesty has two separate bases: first, ABC turned a blind eye to the fraud\n                    perpetrated by BCD, ODAC, or both, against Boustead;[note: 26]or second, ABC turned a\n                    blind eye to the lack of authority, validity, genuineness, accuracy or\n                    correctness of BCD’s demands for payment under the CGs.[note: 27] 33     Boustead’s conspiracy argument is that\n                    there are circumstances which show that ABC conspired with BCD, ODAC, or both,\n                    to perpetrate a fraud on Boustead.[note: 28] 34     Boustead’s unconscionability argument is\n                    that the CG Demands and ODAC Notices were made or issued unconscionably. The FA\n                    Demand was therefore also made unconscionably. ABC should accordingly be\n                    precluded from claiming for the demanded sum. 35     Boustead’s contract argument is cast in\n                    two ways. First, that cll 6.6, 6.8 and 6.9 of the FA are unreasonable\n                    exclusions of liability for negligence and therefore invalid under the Unfair\n                    Contract Terms Act (Cap 396, 1994 Rev Ed) (“the UCTA”). Second,\n                    that there were implied terms in the FA that ABC will not make a demand against\n                    Boustead unless there have been valid or genuine claims made under the\n                    CGs.",
        "ABC’s position": "36     ABC does not dispute the proposition that\n                    fraud on its part will disentitle it from seeking payment under cl 6.9 of\n                    the FA.[note: 29]ABC’s position is that Boustead\n                    has not crossed the high threshold required to establish fraud. In the first\n                    place, BCD’s demands were valid and sufficient to trigger ABC’s\n                    liability to pay BCD under the CGs. ABC’s claim against Boustead was\n                    therefore not made fraudulently. ABC argues that the FA Demand was not made\n                    unconscionably, and that this aspect of unconscionability was, in any event, not\n                    pleaded. 37     On the contract ground, ABC argues that\n                    cll 6.6, 6.8 and 6.9 of the FA (see [24] above) are not exclusions of\n                    liability for negligence. Even if they are, they are valid because they pass\n                    muster under the reasonableness test in the UCTA. ABC disputes the existence of\n                    the implied terms which Boustead contends for.",
        "The issues": "38     In the context of the positions described\n                    above, the following issues arise for determination: (a)     Whether ABC’s claim against\n                        Boustead is brought fraudulently with no basis in fact or law\n                        because: (i)       BCD made the CG Demands\n                            fraudulently and ABC had knowledge of BCD’s fraud;\n                        or (ii)       BCD’s CG Demands were invalid for failing to conform to the\n                            requirements stipulated in the CGs and ABC had knowledge of such\n                            non-conformity. (b)     Whether ABC conspired with BCD, ODAC, or both to\n                        perpetrate a fraud on Boustead. (c)     Whether it will be unconscionable for ABC to obtain\n                        payment from Boustead against the FA Demand. (d)     Whether cll 6.6, 6.8 and 6.9 of the FA are\n                        invalid under s 2(2) of the UCTA as unreasonable exclusions of\n                        liability for negligence. (e)     Whether ABC’s claim against Boustead is precluded\n                        by terms that are implied in the FA. 39     The latter two contract issues fall squarely\n                    to be decided under Singapore law, which is the proper law of the\n                FA. 40     The fraud issue is also to be decided under\n                    Singapore law. ABC’s claim is brought in Singapore under the FA that is\n                    governed by Singapore law. The fraud issue, however, raises subsidiary issues\n                    that may engage elements of foreign law. ABC’s legal position with respect\n                    to BCD under the CGs is a question of English law. The validity of BCD’s\n                    demands under the CGs would therefore have to be determined according to English\n                    law. Libyan law, which is the proper law of the PB and APG, may also be\n                    applicable. It would be relevant to the extent that the validity of the ODAC\n                    Notices are in question. 41     Determining whether there is a conspiracy or\n                    unconscionability will also require an examination of the entire context,\n                    including the positions of the parties under the CGs, the PB and APG, as well as\n                    the Public Works Contract. 42     Three experts on foreign law were called to\n                    give evidence at the trial. Stuart Isaacs QC and Sir Royston Miles Goode QC (who\n                    is also known as Professor Roy Goode, and was referred to as Sir Roy during\n                    the trial) were called by Boustead and ABC respectively to give evidence on\n                    English law. Mr Isaacs is a commercial silk at the English bar with over 30\n                    years of experience in practice. Sir Roy is an emeritus professor of law at the\n                    University of Oxford and an emeritus fellow of St John’s College,\n                    Oxford. The third expert was Mohamed Abdulkader Tumi. Dr Tumi was called by\n                    Boustead to give evidence on Libyan law. Dr Tumi is a Libyan lawyer who has\n                    been admitted to appear before the Libyan Supreme Court for more than 15\n                        years.[note: 30]ABC elected not to call a\n                    Libyan law expert.",
        "Whether ABC’s claim against Boustead is fraudulent": "43     Boustead asserts that ABC’s claim is\n                    fraudulent because it has “no basis in fact and in\n                        law”.[note: 31]Boustead’s argument\n                    is that ABC makes the claim against Boustead despite ABC knowing that it does\n                    not have any liability to BCD under the CGs because: (a) BCD made the CG Demands\n                    fraudulently; or (b) the CG Demands were not made in conformity with the terms\n                    of the CGs. 44     BCD’s demands for payment under the CGs\n                    are said to be fraudulent because both the CG38 and CG39 Demands\n                        stated:[note: 32] [W]e hereby support our demand by our written statement specifying thatwe have received a demand for payment under the above\n                            advance payment guarantee in accordance with[its]terms... [emphasis added] It is clear that the ODAC Notices which formed the basis of\n                        the CG38 and CG39 Demands were not made in accordance with the terms of the\n                        PB and APG (see [68]–[69] below). 45     Dr Tumi, Boustead’s Libyan law\n                    expert, gave unchallenged evidence that under Libyan law (which is the governing\n                    law of the PB and APG), the ODAC Notices did not constitute valid demands in\n                    accordance with the terms of the PB and APG. The ODAC Notices would therefore\n                    not have triggered BCD’s liability to ODAC under the PB and\n                        APG.[note: 33] 46     The CG Demands therefore made false statements\n                    that BCD had “received ... demand[s] for payment ... in accordance with\n                    [the] terms [of the PB or APG, as the case may be]”. Boustead argues that\n                    BCD made the false statements knowing they were false, or recklessly, without\n                    caring as to its truth or falsity. BCD was therefore acting fraudulently in\n                    making the CG Demands. Boustead also alleges that BCD’s demands were\n                    themselves, non-compliant with the terms of the CGs. These allegations of\n                    non-compliance are detailed, and I will address them further\n                below. 47     As a preliminary point, I address ABC’s\n                    submission that Boustead did not plead that ABC made a fraudulent claim against\n                    Boustead. ABC argues that Boustead merely stated that ABC’s commencement\n                    of S 784/2012 was a “wrongful act”.[note: 34]While Boustead’s\n                    pleadings are convoluted, it is my view that the allegation is sufficiently\n                    pleaded. 48     In paragraph 48 of Boustead’s\n                    amended statement of claim, Boustead avers that ABC has committed a\n                    “wrongful act” against Boustead. At sub-paragraph (i) of the\n                    particulars to paragraph 48, Boustead refers to ABC having turned a blind\n                    eye to ODAC’s or BCD’s fraud, or to the lack of validity of\n                    documents which include a reference to the ODAC Notices and the CG Demands. It\n                    is not necessary to allege in the pleading that turning a blind eye amounts to\n                    fraud. The factual allegation has been made. With that, I will turn to the\n                    evidence on English law in respect of demand guarantees.",
        "English law on demand guarantees": "49     The English law experts, Mr Isaacs for\n                    Boustead and Sir Roy for ABC, each filed an expert report on the English law\n                    applicable to demand guarantees. This was followed by a joint expert report that\n                    was filed pursuant to a direction by the court. After the joint expert report\n                    was filed, each expert filed a supplementary report that addressed various areas\n                    of disagreement in the first round of reports and the later joint\n                report. 50     The experts agreed that three fundamental\n                    principles of demand guarantee law were applicable:[note: 35] (a)     that the demand guarantee is\n                        autonomous from the counter-guarantee, which is, in turn autonomous from the\n                        underlying contract; (b)     that the issuer of a demand guarantee (or counter-guarantee) is\n                        concerned with documents and not external facts; and (c)     that the issuer of a demand guarantee\n                        (or counter-guarantee) is only concerned with apparent\n                    conformity. 51     These three principles also find expression in\n                    the URDG 458 which was incorporated into the CGs. Article 2(b) of the URDG 458\n                    states that the duty of a guarantor under a guarantee (or counter-guarantee) is\n                    to pay the sum stated on the presentation of a written demand for payment and\n                    other documents specified in the guarantee, which appear on their face to be in\n                    accordance with the terms of the guarantee. Article 2(c) stipulates the same\n                    conditions in relation to payments on counter-guarantees. It further states that\n                    counter-guarantees are by their nature separate transactions from the guarantees\n                    to which they relate and from any underlying contract. Counter-guarantors are in\n                    no way concerned with or bound by such guarantees or contracts. 52     The principle of autonomy posits that the\n                    underlying contract (in this case, the Public Works Contract) is independent\n                    from the guarantee (in this case, the PB and APG issued by BCD in favour of\n                    ODAC). The guarantee is, in turn, independent from the counter-guarantee (in\n                    this case, the CGs issued by ABC in favour of BCD). 53     The corollary of the principle of autonomy is\n                    the second principle that the issuer is concerned with documents and not\n                    external facts. This means that the guarantor or counter-guarantor pays againstand only againsta demand for payment\n                    accompanied by the presentation of specified documents. Precisely what is\n                    required of a conforming demand for payment depends on the terms of the\n                    guarantee under which the demand is made. Apart from the conformity of the\n                    demand or documents, the guarantor or counter-guarantor is not concerned with\n                    the truth or accuracy of the statements contained within those\n                documents. 54     Closely related is the third\n                    principle—that of apparent conformity. Under this principle, the guarantor\n                    or counter-guarantor is concerned only with whether documents presented appear\n                    on their face to conform to the terms of the guarantee or counter-guarantee, as\n                    the case may be. 55     The effect of these principles is that ABC\n                    will be under an obligation to pay on the demands made by BCD under the CGs as\n                    long as BCD’s demands conform with the requirements of the CGs and the\n                    URDG 458. Payment must be made regardless of how unfair it may be in the\n                    circumstances: seeEdward Owen Engineering Limited v Barclays\n                        Bank International Limited[1978] QB 159 (“Edward Owen v Barclays Bank”) at\n                169. 56     The thread that ties these three principles\n                    together, despite the possible unfairness of payment on demand, is the\n                    commercial role that a demand guarantee serves. Demand guarantees under English\n                    law are treated as the equivalent of cash; they provide a promptly and assuredly\n                    realisable security when the prescribed event occurs:Siporex\n                        Trade SA v Banque Indosuez[1986] 2 Lloyd’s Rep 146 at\n                    158. 57     The only exception (under English law) that\n                    unravels the tight weave of the three principles described above is fraud. InEdward Owen v Barclays Bank, Lord Denning MR\n                    stated at 169 that the bank “ought not to pay under the credit if itknowsthat the documents are forged or that\n                    the request for payment ismade fraudulentlyin\n                    circumstances when there is no right to payment” [emphasis added]. A bank\n                    may (or on some authorities, must: seeUnited City Merchants\n                        (Investments) Ltd and Glass Fibres and Equipment Ltd v Royal Bank of Canada\n                        and others[1983] 1 AC 168) refuse to pay on a demand where: (a)\n                    the beneficiary to the guarantee (or counter-guarantee) is a party to the fraud;\n                    (b) the bank has knowledge of the fraud by a particular time; and (c) the\n                    beneficiary has been given an opportunity to answer the allegation of\n                    fraud. 58     The English law experts also agreed that there\n                    is a relatively high evidential threshold in order for the fraud exception to be\n                    made out.[note: 36]Various phrases have been used by the\n                    English courts to describe this standard: (a)     “clearly established”\n                        inEdward Owen v Barclays Bankat\n                    173; (b)     “particularly cogent evidence” inEnka\n                            Insaat Ve Sanayi AS v Banca Popolare dell'Alto Adige SpA[2009] EWHC 2410 (Comm) at [25]; and (c)     “the only realistic inference” inUnited Trading Corporation SA and Murray Clayton Ltd v Allied\n                            Arab Bank Ltd and others[1985] 2 Lloyd’s Rep 554 at\n                        561 (“United\n                    Trading”). 59     One must be careful, however, not to overstate\n                    the narrowness of the fraud exception. The English Court of Appeal observed inUnited Tradingat 561: [I]t cannot be in the interests of international commerce or of the\n                        banking community as a whole that this important machinery that is provided\n                        for traders should be misused for the purposes of fraud. 60     I have laid out the English law on demand\n                    guarantees broadly. I now turn to consider whether BCD’s demands under the\n                    CGs were made fraudulently, or were invalid because they did not conform to the\n                    terms of the CGs.",
        "Whether BCD made the CG Demands fraudulently and if so whether ABC\n                had knowledge of the fraud": "61     The fraud exception requires establishing\n                    first, that BCD made the demands under the CGs fraudulently; and second, that\n                    ABC had knowledge of BCD’s fraud at the relevant time. The experts\n                    differed on when exactly this relevant time was. Whether BCD made the CG38 and CG39 Demands fraudulently 62     It is not disputed that the statements made by\n                    BCD in the CG Demands, that BCD had received demands from ODAC in accordance\n                    with the terms of the PB and APG, were false. The ODAC Notices clearly did not\n                    comply with the terms of the PB and APG. But the mere fact that BCD made false\n                    statements in the CG38 and CG39 Demands does not, without more, amount to\n                    fraud. 63     The classic statement of fraud is found in the\n                    English House of Lords case ofDerry v Peek(1889)\n                    14 App Cas 337 (“Derry v Peek”).\n                    Lord Herschell stated at 374 that fraud is proved when a false representation\n                    has been made eitherknowingly, without belief in\n                    its truth, orrecklessly, careless as to whether\n                    it be true or false. Fraud therefore requires that BCD made the false statements\n                    in the CG Demands either knowing that they were false, or recklessly without\n                    caring as to their truth or falsity. 64     The English law experts both expressed views\n                    on whether the evidence would lead to the conclusion that BCD was acting\n                    fraudulently, but they did so with reticence. Both maintained that it was not\n                    for them to say whether or not there was fraud on the part of BCD. That is a\n                    question of fact which is the sole province of the trier of fact and not an\n                    expert witness.[note: 37] 65     Nevertheless, Mr Isaacs did say that\n                    there was a good arguable case of fraud in the sense of recklessness, based on a\n                    few factors stated in his expert opinion:[note: 38] (a)     BCD would have drafted the PB and\n                        the APG and so, would have been aware of the requirements (described at\n                        [29]–[30] above) for a valid demand under the PB and the\n                    APG. (b)     The\n                        requirements for a valid demand under the PB and the APG were very short and\n                        straightforward. (c)     The ODAC Notices were very obviously non-compliant with the\n                        requirements of the PB and the APG. There was no reference in either letter\n                        to any failure to pay or other breach of the underlying Public Works\n                        Contract by Boustead or the JV. (d)     It would be surprising if BCD had not sought to check\n                        that it had received valid demands. (e)     ABC had informed BCD that the latter’s initial\n                        demand under CG39 dated 20 June 2011 was non-compliant because it did\n                        not contain a statement specifying that it had received a demand under the\n                        APG in accordance with its terms. (I will elaborate more on this point\n                        below.) (f)     There\n                        was no evidence of communication between BCD and ODAC which suggests that\n                        BCD attempted to establish that the requirements for demands under the PB\n                        and the APG had been met. 66     Sir Roy, on the other hand, expressed the\n                    view that the circumstances above did not necessarily lead to the conclusion\n                    that there was fraud. There were other equally credible possibilities that\n                    amounted to mere negligence or carelessness, but not recklessness. 67     Considering the evidence as a whole, it is my\n                    view that the “only realistic inference” (United Tradingat 560) that can be drawn is that BCD made the\n                    false statements in the CG38 and CG39 Demands recklessly. I base this conclusion\n                    on four reasons. 68     First, the ODAC Notices were obviously\n                    non-compliant with the terms of the PB and APG. It bears repeating that\n                    cl 2 of the PB required a demand from ODAC under the PB to state: (a)     the amount that was due to\n                        ODAC; (b)     that the\n                        JV was in breach of its obligations stipulated in the Public Works Contract;\n                        and (c)     the respect\n                        in which the JV was in breach. Clause 2 of the APG required a demand from ODAC under the APG to\n                        state: (d)     that the\n                        JV has failed to repay the advance payment in accordance with the conditions\n                        of the Public Works Contract; and (e)     the amount which the JV has failed to\n                    repay. 69     The ODAC Notices, which related to the PB and\n                    the APG were similar in all material respects. Both ODAC Notices merely\n                        stated:[note: 39] [W]e hope from you to extend the validity term [sic] of the above described guarantee ... or to liquefy the\n                        value of the said bound in favor of our [account]. The ODAC Notices did not satisfyanyof the requirements for a valid demand under the PB and\n                        APG. The non-conformity of the ODAC Notices would have been apparent to\n                        anyone that read and considered what was required in the PB and APG against\n                        what was stated in the ODAC Notices. It is my view that the obvious\n                        non-conformity of the ODAC Notices is relevant to the question of\n                        BCD’s state of mind at the time it made the CG\n                Demands. 70     Second, and as Mr Isaacs pointed out, ABC\n                    had put BCD on notice of the importance of a complying demand prior to BCD\n                    making the CG39 Demand and subsequently, the CG38 Demand. It will be recalled\n                    that before the CG39 Demand was made, BCD had made requests to extend or\n                    liquidate CG39. On 20 June 2011, BCD made the second extend or liquidate\n                    request on CG39 (see [11]–[12] above). In the second extend or liquidate\n                    request, BCD stated that “we shall be grateful therefore if you [ABC]\n                    would consider this SWIFT as an official claim for liquidation of the value\n                    [secured by CG39]”.[note: 40] 71     ABC responded to BCD on 22 June 2011,\n                    informing BCD that its request “[did] not constitute a complying demand\n                    as per the terms of [CG39]”.[note: 41]ABC further stated that in order for a\n                    demand under CG39 to be valid, the demand had to “confirm that [BCD had]\n                    received claim [sic] from [ODAC] in accordance\n                    with the terms of the [APG] ...”. It was only after this reminder that\n                    BCD made the CG39 Demand which stated falsely that BCD had received a demand\n                    from ODAC in accordance with the terms of the APG. 72     This is not a situation where BCD made a\n                    demand which happened to contain false statements. As mentioned above, when BCD\n                    made the second extend or liquidate request which purported to be a demand, ABC\n                    drew the specific requirements of a valid demand under the CGs to BCD’s\n                    attention on 22 June 2011. BCD was therefore reminded that CG39 required a\n                    demand from BCD to state that it had received a conforming demand from ODAC\n                    under the APG. 73     Despite being put on notice of the requirement\n                    to state that it had received a conforming demand from ODAC under the APG, BCD\n                    nevertheless went on to falsely assert in the CG39 Demand on 23 June 2011,\n                    and thereafter in the CG38 Demand on 11 July 2011, that it had received\n                    conforming demands from ODAC. 74     Sir Roy’s view was that these\n                    circumstances did not necessarily lead to the conclusion that there was fraud.\n                    Sir Roy explained that there was another equally credible explanation. The\n                    clerk at BCD who was unfamiliar with the requirements of demand guarantees could\n                    have mechanically followed the requirements that ABC laid out in its SWIFT\n                    message of 22 June 2011, without realising the effect of those requirements\n                    or what exactly they entailed.[note: 42]Sir Roy stated that it was\n                    therefore quite possible that the employee concerned did not even appreciate\n                    that ODAC’s demands on the PB and the APG were\n                non-conforming. 75     I accept that a clerk at BCD could have done\n                    as Sir Roy suggests. I also accept that that would not amount to fraud in\n                    the sense of dishonesty. But it could amount to fraud in the sense of\n                    recklessness. 76     This brings me to the third reason, that in\n                    the context of demand guarantees, thevery concern of the\n                        banks is with the documents presented to it. If the same slip\n                    occurred in the context of a consumer or retail transaction, then perhaps it\n                    would not have amounted to recklessness. But this is a formal banking\n                    transaction. It is no answer to suggest that BCD was unfamiliar with the\n                    requirements of demand guarantees and what they entail, and therefore it did not\n                    examine the documents presented to it before making the CG38 and CG39 Demands.\n                    Although BCD was not required to be concerned with external facts, its core duty\n                    was to examine the documents presented to it. 77     If BCD had indeed made the CG38 and CG39\n                    Demands mechanically without checking the requirements of the PB and APG which\n                    formed the basis for its demands, then I am of the view that BCD acted\n                    recklessly, in the sense that it was careless as to whether its statements were\n                    true or false. Furthermore, this was not an accidental slip arising from some\n                    inadvertent misdescription or spelling error, and the false statement was made\n                    twice in respect of both CGs. Quite clearly, BCD did not care whether its\n                    statement was true or false. This was all the more so when we remember that BCD\n                    was informed by ABC that BCD’s own demand had to state that BCD had\n                    received a demand from ODAC in accordance with the terms of the PB or APG (as\n                    the case may be). 78     Fourth, the allegations of fraud which have\n                    been made against BCD have been left unanswered. InUnited\n                        Trading, the English Court of Appeal observed at 561 that a\n                    failure to explain conduct may add to the finding of fraud: The corroborated evidence of a plaintiff and theunexplained failure of a beneficiary to respond to the\n                            attack, although given a fair and proper opportunity,may well make the only realistic inference that of\n                            fraud, although the possibility that he [the beneficiary] may\n                        ultimately come forward with an explanation cannot be ruled out. [emphasis\n                        added] 79     The facts and holding inUnited Tradingprovide a convenient starting point for the\n                    discussion of this final reason. InUnited\n                    Trading, the plaintiffs, which comprised European and South American\n                    corporations from the same corporate group, supplied foodstuff to an Iraqi\n                    entity known as Agromark. Agromark was controlled by the Iraqi Ministry of\n                    Agriculture. The plaintiffs were required to secure performance of their\n                    obligations to Agromark by procuring performance bonds in favour of Agromark\n                    from Rafidain, which was an Iraqi state bank. The plaintiffs did not approach\n                    Rafidain directly for the procurement of the performance bonds. They did so\n                    through a chain of banks, much like the arrangement in the present\n                case. 80     War broke out between Iran and Iraq, giving\n                    rise to considerable disruption in the performance of the plaintiffs’\n                    contracts with Agromark. Agromark subsequently called on the performance bonds.\n                    The plaintiffs took the view that the calls were “manifestly\n                    fraudulent”. The plaintiffs sought and obtainedex\n                        parteinjunctions against the banks, including Rafidain,\n                    restraining payment. The injunctions were, however, discharged atinter parteshearings. The plaintiffs appealed to the\n                    English Court of Appeal. 81     The appeal was dismissed because the\n                    plaintiffs had not produced sufficient evidence to show that “the only\n                    realistic inference [was] that the demands were fraudulent”. In the\n                    course of argument before the English Court of Appeal, counsel for the\n                    plaintiffs placed “considerable reliance on Agromark’s failure to\n                    disclose its defence to the charge of fraud” (United\n                        Tradingat 564). To this, the English Court of Appeal had a\n                    pointed response: Agromark had legitimate reasons for not responding to the\n                    allegations of fraud. The English Court of Appeal was therefore not prepared to\n                    hold Agromark’s silence against it on the facts of that case (United Tradingat 565): The point is again made that each contract between the plaintiffs and\n                        Agromark was made and was to be performed in Iraq, is subject to Iraqi law\n                        and contains an Iraqi jurisdiction clause ... Iraqi Courts have exclusive\n                        jurisdiction in the event of any dispute. ... In the light of this material, there is a wholly understandable reason for\n                        Agromark not being prepared to answer in any detail the claim made against\n                        them by the plaintiffs. Quite clearly Agromark do not wish to submit to the\n                        jurisdiction of the English Courts and quite understandably take the view\n                        that it is Iraqi law that has to be applied to the resolution of the\n                        disputes and, pursuant to the exclusive jurisdiction clause, that litigation\n                        should take place in Iraq.It seems to us that those\n                            advising Agromark are justified in being wary of taking any steps that\n                            might be said to result in Agromark submitting to the jurisdiction of\n                            the English Courts or, even without submitting to the jurisdiction,\n                            being indirectly drawn into litigation in this country concerning a\n                            dispute which they understandably consider has no place here. In these\n                            circumstances we do not consider that we are entitled to draw any strong\n                            inference of guilt from Agromark’s silence. [emphasis added] 82     ABC in its closing submissions makes an\n                    argument along similar lines. It says that BCD had a legitimate reason to\n                    decline to participate in legal proceedings in Singapore because the Public\n                    Works Contract, the PB and the APG were subject to the jurisdiction of the\n                    Libyan courts and governed by Libyan law.[note: 43]Therefore, the suggestion was\n                    that BCD had a legitimate reason for not explaining its conduct. 83     I do not accept ABC’s submission. BCD\n                    may not have wanted to be a party to the Singapore proceedings, and\n                    understandably so. But that did not preclude BCD from giving an explanation in a\n                    manner that did not amount to a submission to the jurisdiction of the Singapore\n                    court. BCD had an opportunity to do so on at least two occasions in 2012, but\n                    did not. 84     First, on 17 January 2012, ABC wrote to\n                    BCD by letter. ABC informed BCD about the proceedings Boustead had commenced\n                    against ABC in Singapore. Further, that Boustead had obtained an interim\n                    injunction restraining ABC from making payment to BCD. The letter also stated\n                    that one of Boustead’s allegations was that BCD had made an\n                    “abusive call”.[note: 44]ABC went on to state that the\n                    proceedings are “in substance between Boustead on one hand, and BCD\n                    and/or ODAC on the other”. ABC was a neutral party and would “[not\n                    be] in a position to lead evidence on the substantive issues”. ABC\n                    concluded by “strongly [urging] BCD to engage lawyers in Singapore to\n                    make the necessary court application to be added as a\n                defendant”. 85     BCD’s response to ABC was by a letter\n                    dated 19 January 2012. BCD addressed some concerns raised by ABC relating\n                    to whether the Public Works Contract was still subsisting, and whether the UNSC\n                    Resolutions 1970 (2011) and 1973 (2011) prevented payment from being made to\n                    BCD. BCD also added that the Public Works Contract was governed by\n                    “Libyan law and no disputes concerning it can be heard except by the\n                    Libyan law courts”.[note: 45]BCD went on to state that it was not a\n                    party to the relationship between ABC and Boustead, and that BCD had “no\n                    right to be involved in any litigation with [Boustead]”.[note: 46] 86     BCD had a second opportunity to explain its\n                    position in November 2012. On 22 November 2012, BCD wrote to ABC asking for\n                    an update on the Singapore court proceedings.[note: 47]ABC provided a lengthy response on\n                    28 November 2012. The response detailed the progress of the Singapore\n                    litigation until that point. ABC also summarised Boustead’s statement of\n                    claim in S 730/2012 stating clearly that one of the allegations was that\n                    “ABC had turned a blind eye to thefraud[perpetrated]against Boustead by BCD and/or\n                    ODAC” [emphasis added].[note: 48]ABC again reiterated that the dispute\n                    was in substance between Boustead and BCD and/or ODAC and urged BCD to engage\n                    Singapore counsel and apply to be added as a defendant in the Singapore\n                    proceedings. 87     BCD responded on 3 December\n                        2012,[note: 49]stating that the\n                    dispute was a matter between Boustead and ABC, and that BCD did not consider\n                    itself as having a right to be involved in the proceedings. BCD further stated\n                    that ABC was “fully responsible” to BCD on CG38 and CG39, and that\n                    BCD would help ABC in the Singapore litigation by “providing any\n                    necessary documntation [sic] or\n                    information” regarding CG38 and CG39.[note: 50] 88     There is no evidence that BCD was specifically\n                    informed that the allegation of fraud was in the context of BCD falsely stating\n                    that it had received a demand for payment from ODAC in accordance with the terms\n                    of the PB and APG respectively, when both ODAC Notices were obviously not in\n                    accordance with the said terms. Nevertheless, BCD could and ought to have made\n                    further inquiries as to the specific allegations of fraud that were made against\n                    it if it was truly unaware of and concerned about the specificity of the\n                    allegations. 89     BCD was, after all, presumably still seeking\n                    payment on the CG Demands, which had been made more than a year ago. BCD was\n                    aware of the fact that Boustead had obtained an order to restrain ABC from\n                    making payment, and that ABC was involved in litigation in Singapore. BCD was\n                    also aware that Boustead had made allegations of fraud against BCD in the\n                    proceedings in Singapore. BCD could have explained its position through SWIFT\n                    message or letter. That would not have resulted in BCD “submitting to the\n                    jurisdiction [or] being indirectly drawn into litigation” in Singapore\n                        (United Tradingat 565). BCD did not do so.\n                    Neither did BCD say that it chose not to state its position out of a fear of\n                    being construed to have submitted to the jurisdiction of the Singapore court.\n                    Furthermore, if the fear of submitting to the jurisdiction of another court is\n                    accepted, without more, as a valid explanation for a non-response, then it would\n                    generally be easy for a foreign party to justify a non-response. 90     I add that the absence of a satisfactory\n                    explanation is not necessary before a court may draw a conclusion of fraud in\n                    the reckless sense. InUnited Trading, the\n                    plaintiffs’ allegation of breach of contract by the beneficiary of the\n                    bond was not clearly established. Hence the plaintiffs relied heavily on the\n                    absence of a satisfactory response to the allegation to establish its allegation\n                    of breach. 91     On the facts before me, the falsity of the\n                    statements in the CG Demands is obvious. Boustead does not need to rely heavily\n                    on the absence of a satisfactory response from BCD to establish that BCD acted\n                    recklessly in view of the factors I mentioned above. It is therefore my view\n                    that the only realistic inference to draw is that BCD made the CG38 and CG39\n                    Demands recklessly, without caring as to the truth or falsity of the assertions\n                    within them. Whether ABC had knowledge of BCD’s fraud 92     The next issue is whether ABC had knowledge of\n                    BCD’s fraud at the relevant time. For analytical clarity, I will put the\n                    issue another way, in the form of four questions: (a)     First, what are the facts which\n                        establish that BCD made the CG Demands fraudulently? (b)     Second, did ABC have knowledge of\n                        those facts such that it knew (or ought to have known) that BCD made the CG\n                        Demands fraudulently? (c)     If the second question is answered in the affirmative, then third:\n                        when did ABC acquire knowledge of those facts? (d)     Fourth, was ABC’s acquisition of those\n                        facts within the relevant time? The\n                        second question focuses on thestateorqualityof ABC’s knowledge. The\n                        third and fourth questions focus on thetimeABC acquired such knowledge and whether it was within the relevant time for\n                        the fraud exception. I should point out at this juncture that the English\n                        law experts disagreed as to what the relevant time was for the purposes of\n                        the fourth question. I will come back to this disagreement further\n                        below. 93     In relation to the first question, I have\n                    stated my reasons for concluding that BCD made the CG Demands fraudulently in\n                    the reckless sense at [68]–[91] above. There were four reasons that led me\n                    to that conclusion, which I will summarise. First, the ODAC Notices were very\n                    clearly not conforming demands in accordance with the terms of the PB and APG.\n                    Second, ABC had put BCD on notice of the importance of a complying demand prior\n                    to BCD making the CG39 Demand and the CG38 Demand. Third, in the context of\n                    demand guarantees, BCD’s very concern would have been the documents\n                    presented to it, namely the ODAC Notices. Fourth, BCD failed to provide a\n                    satisfactory answer to the allegations of fraud. 94     I turn to the second question of whether ABC\n                    had knowledge of these facts and whether ABC therefore had knowledge that BCD\n                    made the CG Demands fraudulently. 95     Boustead commenced OS 503/2011 on\n                    22 June 2011. Mr Koh Nghee Kwang, a project director of Boustead,\n                    filed an affidavit dated 22 June 2011 in OS 503/2011 (“Mr\n                    Koh’s first OS 503/2011 affidavit”).[note: 51]Mr Koh also was one\n                    of Boustead’s witnesses in the proceedings before me. Mr Koh’s\n                    first OS 503/2011 affidavit exhibited copies of the PB[note: 52]and\n                        APG.[note: 53]ABC\n                    was served with a copy of Mr Koh’s affidavit (and therefore the PB\n                    and the APG) probably soon after 22 June 2011, because Ms Nehad\n                    Alkazmawi filed a reply affidavit in OS 503/2011 dated 21 July\n                        2011.[note: 54]Ms Nehad was\n                    an ex-employee of ABC, and the first vice-president of the Bank’s Global\n                    Trade Finance & Forfaiting Department at the material time. Ms Nehad\n                    also gave evidence for ABC at the trial. Ms Nehad’s reply affidavit\n                    made express reference (at paragraph 8)[note: 55]to Mr Koh’s first\n                    OS 503/2011 affidavit and addressed the points raised\n                therein. 96     ABC received copies of the ODAC Notices on\n                    14 July 2011 (see [14] above). ABC forwarded the ODAC Notices to Boustead\n                    on 18 July 2011. By 14 July 2011, ABC would therefore have had (a)\n                    copies of the PB and APG; (b) the ODAC Notices; and (c) the CG Demands made by\n                    BCD on 28 June and 11 July 2011. 97     The fact that ABC possessed these three\n                    documents alone did not necessarily mean that ABC knew that BCD had been\n                    fraudulent in the sense of being reckless. However, the first three of the four\n                    facts I mentioned above (at [93]) would have been obvious to ABC, leaving aside\n                    for the time being the point that BCD had not given any satisfactory explanation\n                    why it had made the false statements. The non-conformity of the ODAC Notices was\n                    manifest. ABC was aware of the necessity of conforming demands in the context of\n                    demand guarantees. I reiterate that ABC sent BCD a reminder on 22 June 2011\n                    that BCD’s extend or liquidate requests were not valid demands, and of the\n                    requirements for a conforming demand. ABC itself was a bank that dealt in demand\n                    guarantees. ABC would have been alive to the concern of the primacy of documents\n                    in such transactions. 98     In view of these circumstances, I find that by\n                    14 July 2011, ABC must have known, or ought to have known, based on the\n                    documents in its possession, that BCD made the CG Demands recklessly, without\n                    caring as to their truth or falsity. 99     If that finding is incorrect, and ABC did not\n                    have knowledge of BCD’s fraud on 14 July 2011, then it is my view\n                    that ABC must have known of BCD’s fraud, at the latest, on\n                    24 September 2012. That was when Boustead filed its statement of claim in\n                    S 730/2012. In the statement of claim, Boustead alleged at\n                    paragraphs 37(b) and (c) that the ODAC Notices did not comply with the\n                    requirements of a valid demand under the PB or APG, and the statements that BCD\n                    made in its CG Demands were therefore untrue or incorrect. These allegations,\n                    coupled with the fact that ABC already had in its possession copies of the ODAC\n                    Notices, the PB and APG, as well as BCD’s CG Demands, must have resulted\n                    in ABC knowing that BCD made the CG Demands recklessly. 100    That brings me to the fourth question, of\n                    whether ABC acquired knowledge of BCD’s fraud within the relevant time.\n                    Both Boustead and ABC disagreed over when the relevant time was for the purpose\n                    of the fraud exception under English law. 101    Boustead’s position is that under\n                    English law, the fraud exception is triggered as long as ABC has knowledge of\n                    BCD’s fraud at any time prior to its having made payment. ABC has not made\n                    payment to BCD. It has been restrained from doing so by a court order since\n                    23 June 2011 (save for the narrow window between 29 and 30 August\n                    2011 when the first injunction was discharged and a second injunction was\n                    granted). Boustead’s submission is that ABC must have been put on notice\n                    of BCD’s fraud—at the latest—by the time of the trial in early\n                    to mid-2014. ABC would accordingly be discharged from its obligation to pay BCD\n                    under the CG38 and CG39 Demands from the time it acquired such\n                knowledge. 102    ABC’s position is that the relevant\n                    time is when the bank has taken an irrevocable step in reliance on the apparent\n                    conformity of the demands presented, and in ignorance of any fraud. ABC claims\n                    that that occurred when ABC made the FA Demand against Boustead on\n                    3 September 2012 and, following Boustead’s failure to pay, issued the\n                    EOD Notice to terminate the FA on 10 September 2012. Accordingly, if ABC\n                    subsequently acquired knowledge of BCD’s fraud, the fraud exception would\n                    not be satisfied, as ABC’s knowledge only arose after the relevant\n                    time. 103    Both parties’ positions on the\n                    relevant time are predicated on an implicit factual premise: that ABC only\n                    acquired knowledge of BCD’s fraudafterit\n                    issued the EOD Notice on 10 September 2012. If my finding above at [98]\n                    above is correct, and ABC knew or ought to have known of BCD’s fraud on\n                    14 July 2011, then that factual premise is removed. The issue of the\n                    relevant time falls away because ABC’s knowledge of BCD’s fraud\n                    would have been acquired before what ABC itself was contending as the cut-off\n                    date for the relevant time (10 September 2012). 104    If that finding is incorrect, and ABC only\n                    knew of BCD’s fraud on 24 September 2012 (when Boustead filed its\n                    statement of claim in S 730/2012), then the issue of the relevant time is\n                    engaged. If ABC is right in its submission that the relevant time stopped\n                    running on 10 September 2012, then ABC’s subsequent acquisition of\n                    knowledge of BCD’s fraud on 24 September 2012 would not have\n                    triggered the fraud exception. ABC’s liability to BCD under the CG would\n                    have crystallised as at the relevant time. I will therefore turn to address the\n                    issue of the relevant time. 105    There was considerable evidence from\n                    Mr Isaacs and Sir Roy on the issue of the relevant time. Each party\n                    also made substantial closing submissions asserting the correctness of their\n                    positions of the relevant time under English law. 106    Mr Isaacs relied on two cases in\n                    support of his (and Boustead’s) position: (a)Balfour Beatty\n                            Civil Engineering v Technical & General Guarantee Co Ltd[2000] CLC 252; and (b)Solo Industries UK Ltd v Canara Bank[2001] 1 WLR 1800. 107    Sir Roy (supporting ABC’s\n                    position), on the other hand, relied on two other cases: (a)United\n                            Trading; and (b)European Asian Bank AG v Punjab &\n                            SindBank (No 2)[1983] 1 WLR 642. 108    Both Mr Isaacs and Sir Roy agreed\n                    that no clear approach to the relevant time of fraud had been established by\n                    existing case law. They agreed that a bank would not be affected by fraud which\n                    comes to its knowledge onlyafterit has made\n                    payment (which was the holding inUnited Trading).\n                    Their opinions diverged as to when the relevant time would be in a situation\n                    where the bank had not yet made payment. 109    From the cases, Sir Roy extrapolated a\n                    principle which he said governed the relevant time for the bank’s\n                    knowledge. He stated that once the bank has acted irrevocably in reliance on the\n                    apparent conformity of the presentation and in ignorance of any fraud, it would\n                    be quite unfair to deprive the bank of its right to be indemnified by its\n                    customer. In Sir Roy’s view, ABC took the irrevocable step when,\n                    after having made the FA Demand on Boustead which was not complied with, ABC\n                    terminated the FA by issuing the EOD Notice on 10 September\n                2012. 110    Mr Isaacs, on the other hand, gave\n                    evidence that the better view was that the relevant time was any time prior to\n                    the bank having made payment.[note: 56]Since ABC has not made payment, it\n                    would have definitely have knowledge of fraud within the relevant\n                time. 111    It seems to me that the disagreement between\n                    Mr Isaacs and Sir Roy is not as great as it appears. The evidence of\n                    Mr Isaacs and of Sir Roy may be reconciled in the following\n                    proposition: that if the bank has taken an irrevocable step in reliance on the\n                    apparent conformity of the demands, and in the absence of knowledge of fraud,\n                    this would stop the relevant time running. They disagreed as to what amounts to\n                    an irrevocable step. To Mr Isaacs, only payment by ABC on the CG Demands\n                    would suffice. To Sir Roy, the subsequent issuance of the EOD Notice after\n                    the FA Demand was made constituted an irrevocable step even though ABC had not\n                    made payment yet. 112    Even if I accept Sir Roy’s\n                    proposition that some other act apart from payment may amount to an irrevocable\n                    step, my view is that ABC’s issuance of the EOD Notice (and thus purported\n                    termination of the FA) is no more an irrevocable step than its FA Demand on\n                    Boustead. In cross-examination, it was suggested to Sir Roy that\n                    ABC’s termination of the FA was not an irrevocable step. Sir Roy\n                        explained:[note: 57] Assuming that the [CG Demands] were apparently conforming demands, [ABC]\n                        incurred a liability to pay within a given number of days of the demand and\n                        the only reason it hasn’t been paid is the injunction. If the\n                        injunction were to be lifted, and nobody can ever be sure when an injunction\n                        would be lifted, it would have to make immediate payment. So, to protect\n                        itself, [ABC] invoked be provisions of [the FA] and those not having been\n                        complied with ... [ABC] terminated [the FA] ... So it’s not really\n                        involuntary in that sense at all. They acted, I think, out of what was\n                        perceived to be commercial need. But ABC’s termination of the FA simply means that it is\n                        no longer obliged to make the facilities under the FA available to Boustead.\n                        It does not mean that ABC cannot exercise other accrued rights, if\n                        any. 113    Therefore, the fraud exception would still\n                    be satisfied even if I am incorrect in my finding that ABC knew or ought to have\n                    known of BCD’s fraud on 14 July 2011 at [98] above. ABC would, in any\n                    event have known of BCD’s fraud on 24 September 2012 (see [99] above)\n                    which was within the relevant time based on the English law evidence which I\n                    have heard.",
        "Whether the CG Demands conformed to the terms of the CGs and if not\n                whether ABC had knowledge of the non-conformity": "114    I turn now to Boustead’s alternative\n                    argument, that BCD’s demands for payment under the CGs are invalid because\n                    they did not conform with the terms of the CGs. In view of my conclusion above,\n                    this question is no longer a live one. I will nonetheless address the extensive\n                    arguments and evidence on the alternative argument in case I am\n                wrong. 115    Under English law, a demand for payment\n                    under the CGs must comply strictly with the requirements in the CGs for the\n                    demand to be valid. Further, since the CGs incorporate the URDG 458, the demands\n                    also have to comply with the requirements stipulated in the URDG\n                458. 116    Before going into the alleged grounds of\n                    non-conformity, it will be helpful to set out in full the terms of the CGs,\n                    which were issued by ABC in favour of BCD, as well as the CG38 and CG39\n                    Demands. 117    CG38 and CG39 are substantially similar to\n                    each other and stipulate the same requirements for a conforming demand. The only\n                    differences are: (a) the CG reference numbers; (b) the sums secured under the\n                    CGs; and (c) the name of the guarantee (the PB or the APG) to which the CGs\n                    relate. I have underlined the differences for convenience. CG38\n                        reads:[note: 58] Our counter guarantee No. ILG/09/20038:- In consideration of your issuing the above performance bond, we hereby\n                        unconditionally and irrevocably undertake to reimburse you on your first\n                        written demand communicated through authenticated SWIFT message or\n                        registered mail, despite any contestation on the part of the applicant or a\n                        third-party provided you confirm that you have received claim [sic] from [ODAC] in accordance with the terms of the\n                        aboveperformance bondprovided such amount\n                        does not exceed the guaranteed sum of USD3,760,387.95(as defined in the above performance bond).\n                        Such demand shall be supported by a written statement specifying that you\n                        have received a demand for payment under the aboveperformance bondin accordance with its terms. ... This counter guarantee is subject to the Uniform Rules for Demand\n                        Guarantees ICC Publication No 458 (the “Uniform Rules”) and\n                        shall, as to matters not governed by the Uniform Rules, be governed by and\n                        construed in accordance with English law. Any dispute arising from this\n                        counter guarantee shall be submitted to the non-exclusive jurisdiction of\n                        the English courts ... CG39 reads:[note: 59] Our counter guarantee No. ILG/09/20039:- In consideration of your issuing the aboveadvance\n                            payment guarantee, we hereby unconditionally and irrevocably\n                        undertake to reimburse you on your first written demand communicated through\n                        authenticated SWIFT message or registered mail, despite any contestation on\n                        the part of the applicant or a third-party provided you confirm that you\n                        have received claim [sic] from [ODAC] in\n                        accordance with the terms of the aboveadvance payment\n                            guaranteeprovided such amount does not exceed the guaranteed\n                        amount of USD18,331,891.37(as defined in\n                        the above advance payment guarantee). Such demand shall be supported by a\n                        written statement specifying that you have received a demand for payment\n                        under the aboveadvance payment guaranteein\n                        accordance with its terms. ... This counter guarantee is subject to the Uniform Rules for Demand\n                        Guarantees ICC Publication No 458 (the “Uniform Rules”) and\n                        shall, as to matters not governed by the Uniform Rules, be governed by and\n                        construed in accordance with English law. Any dispute arising from this\n                        counter guarantee shall be submitted to the non-exclusive jurisdiction of\n                        the English courts ... 118    The CG38 and CG39 Demands also bore a\n                    striking similarity to each other. I have marked up in double-underline the\n                    phrases in the CG38 and CG39 Demands which Boustead says are non-conforming. The\n                    CG38 Demand reads:[note: 60] Transaction Reference Number 10/21/LG008/2007 Related Reference ILG/09/20038 Narrative Claim under your LG NO ILG/09/20038 Attnt. Trade Finance Ops. We hereby demand USDOLLARS 3,760,387.95 say USDOLLARS three million seven\n                        hundred sixty thousand three hundred eighty seven and ninety five cents,\n                        under your aforesaid counter guarantee which please credit our USDOLLARS\n                        account with your goodselves. We confirm that we have received the a [sic]\n                        claim for USDOLLARS three million seven hundred sixty thousand three hundred\n                        eighty seven and 95 cents from [ODAC] in accordance with the terms of the\n                        aboveadvance payment guarantee. We hereby support our demand by our written statement specifying that we\n                        have received a demand for payment under the aboveadvance payment guaranteein accordance with it,s [sic] terms. As an alternative to the demand for payment submitted in accordance with\n                        terms and conditions of the guarantee, [ODAC], Tripoli, Libya had requested\n                        an extension of the validity of ouradvance guarantee\n                            No 10/21/LG00008/2007until 31/12/2012. The CG39 Demand reads:[note: 61] Transaction Reference Number 10/21/LG00009/07 Related Reference ILG/09/20039 Narrative Claim under your LG NO ILG/09/20039 Attnt. Trade Finance Ops. We hereby demand USDOLLARS 15,021,093.25 say USDOLLARS fifteen million\n                        twenty one thousand and ninety three USDOLARS [sic] and 25 cents, under your aforesaid counter guarantee\n                        which please credit our USDOLLARS acount [sic]\n                        with your goodselves. We confirm that we have received the a [sic]\n                        claim for US DOLLARS fifteen million and twenty one thousand and ninety\n                        three and 25 cents from [ODAC] in accordance with the terms of the above\n                        advance payment guarantee. We hereby support our demand by our written statement specifying that we\n                        have received a demand for payment under the above advance payment guarantee\n                        in accordance with it,s [sic] terms. As an alternative to the demand for payment submitted in accordance with\n                        terms and conditions of the guarantee, [ODAC], Tripoli, Libya had requested\n                        an extension of the validity of ouradvance guarantee\n                            No 10/21/LG00009/07until 31/12/2012. 119    It will be recalled that the demand on CG39\n                    (that relates to the APG) was madebeforethe\n                    demand on CG38 (that relates to the PB). It appears that BCD simply reproduced\n                    the earlier CG39 Demand for the subsequent CG38 Demand, making only amendments\n                    to the sum demanded and the reference numbers. BCD apparently omitted to make\n                    changes to the description of the guarantee to which CG38 related to (hence the\n                    reference to “advance payment guarantee” instead of\n                    “performance bond” in the CG38 demand). 120    The non-conformity that Boustead complains\n                    of falls into three categories:[note: 62] (a)     First, the CG38 Demand refers to\n                        theadvance payment guaranteeandadvance guarantee, when the underlying guarantee\n                        to which CG38 relates is the “performance bond”. The CG39\n                        Demand refers to anadvance guaranteewhen\n                        the underlying guarantee to which CG39 relates is the “advance\n                        payment guarantee”. I will refer to this as the “incorrect\n                        description” issue. (b)     Second, the CG38 and CG39 Demands refer to instruments\n                        with reference numbers ofNo 10/21/LG00008/2007andNo 10/21/LG00009/07respectively. The reference numbers\n                        are incorrect, because the reference numbers of the PB and APG are\n                        10/21/LG008/2007 and 10/21/LG009/2007 respectively. The non-conformity is\n                        alleged to arise from the insertion of two additional zeros in the reference\n                        numbers of the PB and APG. I will refer to this as the “incorrect\n                        reference number” issue. (c)     Third, both the CG38 and CG39 Demands do not state that\n                        BCD has received demands [ie, the ODAC\n                        Notices] in accordance with Art 20(b) of the URDG 458, as is required\n                        by Art 20(b). I will refer to this as the\n                        “Art 20(b)” issue. 121    Before I address these issues, I set out the\n                    evidence given by the English law experts on the conformity of a demand under\n                    English law. English law on the conformity of a demand 122    The English law experts in their joint\n                    report agreed that whether a demand is conforming is purely a question of\n                    construction of the demands.[note: 63]Both agreed that two principles of construction\n                    were applicable: (a) that the demands must be read as a whole and (b) in a\n                    manner which avoids absurdity or inconsistency. Mr Isaacs, however,\n                    disagreed with Sir Roy’s position that a third principle was\n                    applicable: (c) that the demand must be construed, where possible, in such a way\n                    as to uphold its validity rather than render it ineffective. 123    Mr Isaacs’ supplementary expert\n                    report, which was prepared subsequent to the joint expert report, stated that\n                    the question was “more correctly to be one of construction of [the CG]\n                    and not of [the demand]: what did [the CG] require in order for there to be a\n                    conforming demand thereunder?”[note: 64]Mr Isaacs considered this to be\n                    consistent with the approach adopted by Teare J inSea-Cargo Skips AS v State Bank of India[2013] 2 Lloyd’s\n                    Rep 477 (“Sea-Cargo Skips”). InSea-Cargo Skips, the question that\n                    Teare J posed at [30] in determining whether a demand made under a\n                    performance bond was conforming was: “what type of demand did the parties\n                    intend would trigger the bank’s liability to pay?” Mr Isaacs\n                    maintained this position in cross-examination.[note: 65] 124    It also appears from Sir Roy’s\n                    oral evidence that his approach was the same as that of Mr Isaacs’.\n                    Sir Roy stated in cross-examination that:[note: 66] My point here is there isnothing in the terms of the\n                            counter-guaranteethat specifies that there must be a\n                        reference to advance payment guarantee or any other means of identification.\n                        All that was necessary was that you should gather from the document as a\n                        whole that this demand was referring to the relevant guarantee. That is a\n                        matter of construction. That was agreed -- that was agreed by the two of us\n                        in our joint report to be a matter of construction. [emphasis added] 125    It is apparent then, that the common ground\n                    between the experts was that the issue of conformity turned on two distinct\n                    questions of construction. The prior question being one ofconstruing the CGto determine what was required for a demand to\n                    be conforming. The subsequent question was that ofconstruing\n                        the demandto determine whether it complied with what was\n                    required by the CG. 126    I am mindful of the difficulties with\n                    considering expert evidence on the correct construction of a document governed\n                    by foreign law. First, the construction of documents is an inherently technical\n                    exercise. At times the distinctions that the English experts were attempting to\n                    draw were so fine that they bordered on being, as counsel for ABC put it,\n                    “distinction[s] without a difference”. The second difficulty is\n                    drawing the line between “where proof of foreign law ends and application\n                    of the foreign law begins”: Yeo Tiong Min,Halsbury’s Laws of Singaporevol 6(2) at\n                    para 75.297. Principles of construction have to be proven as foreign law,\n                    but theapplicationof those principles to the\n                    facts is a question of forum procedure in the adjudication process:Pacific Recreation Pte Ltd v S Y Technology Inc[2008] 2\n                    SLR(R) 491 at [81]. The incorrect description issue 127    Boustead submits thatboththe CG38 and CG39 Demands were non-conforming because they\n                    made reference to an incorrect underlying guarantee. I note that the severity of\n                    the alleged non-conformity in the CG38 Demand is greater than that in the CG39\n                    Demand. The CG38 Demand describes the underlying guarantee incorrectly (it\n                    refers to “advance payment guarantee” and “advance\n                    guarantee” instead of “performance bond”). The CG39 Demand\n                    merely omits the word “payment” towards the end of the CG39\n                    Demand; further, “advance payment guarantee” is used earlier on in\n                    the demand. (1)   The CG38 Demand 128    Adopting the approach described above, the\n                    first step is to construe CG38 to determine what is required from a demand made\n                    under it. It will be helpful to reproduce for convenience the operative portion\n                    of CG38: In consideration of your issuing the above performance bond, we hereby\n                        unconditionally and irrevocably undertake to reimburse you on your first\n                        written demand communicated through authenticated SWIFT message or\n                        registered mail, despite any contestation on the part of the applicant or a\n                        third-party provided you confirm that you have received claim [sic] from [ODAC] in accordance with the terms of the\n                        above performance bond provided such amount does not exceed the guaranteed\n                        sum of USD 3,760,387.95 (as defined in the above performance bond). Such\n                        demand shall be supported by a written statement specifying that you have\n                        received a demand for payment under the above performance bond in accordance\n                        with its terms. 129    What does CG38 require of a conforming\n                    demand? Does CG38 require a written statement that a demand for payment has been\n                    received in accordance with the terms of an instrumentexpressly describedto be the “performance bond”?\n                    Or does CG38 merely require a written statementconveying the\n                        informationthat a demand for payment has been received in\n                    accordance with the terms of the PB? 130    I am of the view that all CG38 requires is\n                    that the demand convey the information that a demand for payment has been\n                    received in accordance with the terms of the PB. I am of the view that the\n                    parties would have intended a demand which stated the receipt of “a\n                    demand for payment under theabove guaranteein\n                    accordance with its terms” and which mentioned the reference numbers of\n                    CG38 and the PB, would have been conforming. Put the other way, the failure to\n                    mention “performance bond” is not fatal. It would have been\n                    sufficient for the recipient to have known that the demand was made under\n                    CG38. 131    The second question of construction is\n                    whether the CG38 Demand complied with the requirements of CG38. In line with the\n                    analysis above, the demand must conform strictly with the requirement that itconvey the informationthat a demand had been\n                    received in accordance with the terms of the PB. It will be helpful to set out\n                    again the relevant portions of the CG38 demand: Transaction Reference Number 10/21/LG008/2007 Related Reference ILG/09/20038 Narrative Claim under yourLG NO\n                            ILG/09/20038 Attnt. Trade Finance Ops. We hereby demandUSDOLLARS 3,760,387.95sayUSDOLLARS three million seven hundred sixty thousand\n                            three hundred eighty seven and ninety five cents, under your\n                        aforesaid counter guarantee which please credit our USDOLLARS account with\n                        your goodselves. We confirm that we have received the a [sic]\n                        claim for USDOLLARS three million seven hundred sixty thousand three hundred\n                        eighty seven and 95 cents from [ODAC] in accordance with the terms of the\n                        above advance payment guarantee. We hereby support our demand by our written statement specifying that we\n                        have received a demand for payment under the above advance payment guarantee\n                        in accordance with it,s [sic] terms. As an alternative to the demand for payment submitted in accordance with\n                        terms and conditions of the guarantee, [ODAC], Tripoli, Libya had requested\n                        an extension of the validity of our advance guarantee No 10/21/LG00008/2007\n                        until 31/12/2012. 132    Applying the principles of construing the\n                    demand as a whole, and reading the demand in such a manner as to avoid absurdity\n                    and inconsistency (the two principles of construction agreed on by the English\n                    law experts), I am of the view that the demand conveys the information that a\n                    demand has been received in accordance with the terms of the PB. The CG38 Demand\n                    is therefore not invalidated by the incorrect reference to the “advance\n                    guarantee” or “advance payment guarantee”. 133    Mr Isaacs made the point that an\n                    incorrect description in the CG38 Demand created ambiguity as to whether or not\n                    the demand was made under CG38 to begin with.[note: 67]However, stacked against that are three other\n                    factors that would lead a reader of the CG38 Demand to the conclusion that it\n                    was in fact made under CG38, and that the incorrect description of the\n                    instrument was merely a slip. First, under “Transaction Reference\n                    Number” heading, the reference number of the PB is indicated. Second,\n                    under the “Related Reference” and “Narrative”\n                    headings, the reference number of CG38 is indicated. Third, the sum demanded was\n                    the precise amount covered by CG38 down to the last cent. 134    Mr Isaacs further expressed the view\n                    that “the correct question” was whether “it’s\n                    apparent on its face that the demand is compliant”.[note: 68]While Mr Isaacs stressed that the\n                    mention of an incorrect instrument immediately rendered the demand\n                    non-compliant, he perhaps glossed over the first question of construction as to\n                    what “compliance” meant under the terms of the CG38. His assertion\n                    that the CG38 Demand’s reference to the incorrect instrument rendered it\n                    non-compliant also does not cohere with his subsequently expressed opinion that\n                    neither CG38 nor the URDG required the nature of the guarantee to be stated in a\n                    demand under CG38.[note: 69] 135    Ms Nehad, an ex-employee of ABC gave\n                    evidence on this point. In cross-examination, Ms Nehad was asked whether\n                    she agreed that the reference to “advance payment guarantee” was\n                    wrong, and that it must have been immediately obvious to anyone looking at\n                        it.[note: 70]She agreed. While Ms Nehad\n                    subsequently also agreed that there was no strict compliance,[note: 71]that in my view, was a legal\n                    conclusion, which could not be answered by a witness of fact. It would have been\n                    apparent to any reader that the use of the label “advance payment\n                    guarantee” or “advance guarantee” was a mistake. The CG38\n                    demand therefore complied with what was required of a demand under\n                CG38. 136    There remain two other points raised by the\n                    English law experts which I should address. First, they disagreed as to whether\n                    the principle of construction in favour of upholding the validity of an\n                    instrument applied to the construction of demands.[note: 72]I too share the unease expressed by\n                    Mr Isaacs about the principle’s compatibility with that of strict\n                    compliance. 137    Second, Sir Roy also expressed the\n                    opinion that, at the time of the CG38 Demand, a demand under CG39 for\n                    US$15,021,093.25 had already been made. He stated that the CG38 Demand could\n                    therefore only have referred to the PB. He considered this the\n                    “context” which could properly be relied on while construing the\n                    CG38 Demand.[note: 73]That would, in his view, have\n                    removed any ambiguity that would have arisen from the incorrect description of\n                    the instrument. His approach, however, does not sit comfortably with the\n                    principle of autonomy, and that the bank is only concerned with documents and\n                    not facts, which Sir Roy had earlier placed such great emphasis\n                on. 138    I therefore did not take into account these\n                    two points in coming to my conclusion that the CG38 Demand was made in\n                    accordance with the terms of CG38. (2)   The CG39 Demand 139    As mentioned above, the severity of the\n                    incorrect description in the case of the CG39 Demand is not as great as that in\n                    the case of the CG38 Demand. I set out the CG39 Demand again for\n                        convenience:[note: 74] Transaction Reference Number 10/21/LG00009/07 Related Reference ILG/09/20039 Narrative Claim under your LG NO ILG/09/20039 Attnt. Trade Finance Ops. We hereby demand USDOLLARS 15,021,093.25 say USDOLLARS fifteen million\n                        twenty one thousand and ninety three USDOLARS [sic] and 25 cents, under your aforesaid counter guarantee\n                        which please credit our USDOLLARS acount [sic]\n                        with your goodselves. We confirm that we have received the a [sic]\n                        claim for US DOLLARS fifteen million and twenty one thousand and ninety\n                        three and 25 cents from [ODAC] in accordance with the terms of the aboveadvance payment guarantee. We hereby support our demand by our written statement specifying that we\n                        have received a demand for payment under the aboveadvance payment guaranteein accordance with it,s [sic] terms. As an alternative to the demand for payment submitted in accordance with\n                        terms and conditions of the guarantee, [ODAC], Tripoli, Libya had requested\n                        an extension of the validity of ouradvance\n                            guaranteeNo 10/21/LG00009/07 until 31/12/2012. 140    Boustead’s objection to the incorrect\n                    description in the CG39 Demand is the reference to the “advance\n                    guarantee” (in double-underline) instead of “advance payment\n                    guarantee”. It should be noted, however, that “advance payment\n                    guarantee” in full is mentioned on two instances (in underline) prior to\n                    the mention of the “advance guarantee”. It would therefore be\n                    apparent that the omission of the word “payment” was a slip. The\n                    omission does not create any ambiguity that renders the CG39 Demand\n                    non-conforming to the terms of CG39. In any event, the incorrect description\n                    issue in relation to CG39 was not pleaded by Boustead nor raised in the course\n                    of the trial. The point was raised for the first time in its closing\n                    submissions. The incorrect reference number issue 141    Boustead relies on the additional zeros\n                    referred to in the CG38 and CG39 Demands and argues that this rendered the\n                    demands non-conforming (see above at [120(b)]).[note: 75]Boustead relies on the Singapore Court of Appeal case ofIndian Overseas Bank v United Coconut Mills Inc[1992] 3 SLR(R)\n                    12 (“Indian Overseas Bank v United Coconut\n                        Mills”) in support of its argument. 142    I do not accept that the CG38 and CG39\n                    Demands were non-conforming for including additional zeros. That, in my view,\n                    was an immaterial error and would not have affected the conformity of the\n                    demands. It also bears mention that Boustead’s English law expert,\n                        Mr Isaacs,[note: 76]agreed with ABC’s position and\n                    Sir Roy that the additional zeros were immaterial. 143    Boustead’s reliance on the Singapore\n                    case ofIndian Overseas Bank v United Coconut\n                        Millsis misplaced. First, the conformity of the CG38 Demand is\n                    an issue to be decided under English law. There was extensive English law\n                    evidence led on the point. The utility of a Singapore case is therefore\n                    questionable. 144    Second,Indian Overseas\n                        Bank v United Coconut Millsraised quite different facts from the\n                    facts presently before me. There, one of the supporting documents made a\n                    reference to measurements of “oleic acid” instead of\n                    “lauric acid” as was required under the letter of credit. The\n                    Court of Appeal was of the view that although it was a widely known fact in the\n                    industry that oleic and lauric acid could be used interchangeably, it would not\n                    have been apparent to an ordinary and reasonably competent banker that this was\n                    the case. The Art 20(b) issue 145    The final ground of non-conformity that\n                    Boustead relies on is the failure of the CG38 and CG39 Demands to mention that\n                    ODAC’s Notices were made in accordance with the terms of Art 20(b) of\n                    the URDG 458. 146    Article 20 of the URDG 458 stipulates\n                    the documentary requirements for a conforming demand. It has separate\n                    requirements for demands made under a demand guarantee on one hand, and a\n                    counter-guarantee on the other. Article 20(a) lists the requirements for a\n                    conforming demand under a guarantee (the PB and the APG). It requires that a\n                    demand for payment under a guarantee must be supported by a written statement\n                    stating that: (i) the principal (the JV) is in breach of its obligation(s) in\n                    the underlying contract (the Public Works Contract); and (ii) the respect in\n                    which the principal is in breach. 147    Art 20(b) applies to\n                    counter-guarantees. Art 20(b) states: Any demand under the Counter-Guarantee shall be supported by a written\n                        statement that the Guarantor has received a demand for payment under the\n                        Guarantee in accordance with its termsand with this\n                            Article. [emphasis added] The English law experts agreed that the requirement in Art\n                        20(b) was only invoked where the underlying guarantee (in this case, the PB\n                        and APG) wasalsogoverned by the URDG\n                            458.[note: 77]The PB and APG are governed\n                        by Libyan law, and the URDG 458 was not incorporated on the face of the\n                        documents. Boustead’s Libyan law expert, Dr Tumi, gave evidence\n                        that the URDG 458 was incorporated into the PB and APG as a matter of Libyan\n                        law. Boustead’s position is that since the PB and APG incorporated the\n                        URDG 458, then in order for the CG38 and CG39 Demands to be conforming, they\n                        had to state additionally that the demands under the PB and APG were\n                        received in conformity with the requirements of\n                Art 20. (1)   Boustead’s pleadings on Art 20(b) 148    The first objection ABC takes to the\n                    Art 20(b) issue is that Boustead did not plead it. There are three parts to\n                    Boustead’s Art 20(b) argument: (a) that the PB and APG are governed\n                    by Libyan law; (b) that Libyan law incorporates the URDG 458 into the PB and\n                    APG; and (c) that BCD’s demands were invalid because they failed to comply\n                    with Art 20(b).[note: 78] 149    On the first part, Boustead’s position\n                    at trial is consistent with ABC’s pleaded position that Libyan law applied\n                    to the PB and the APG in its amended defence and counterclaim,[note: 79]although ABC’s pleading was\n                    denied by Boustead in its amended defence and reply to counterclaim.[note: 80] 150    In relation to the second part, Boustead\n                    could not point to anything in its pleadings that expressly states that Libyan\n                    law incorporated the URDG 458. The best it could muster was a reference at\n                    paragraph 5(c) of its amended reply and defence to counterclaim that it would\n                    “rely on the provisions of the [URDG 458] for their full purport and\n                        effect”.[note: 81]This\n                    paragraph in Boustead’s amended reply and defence to counterclaim,\n                    however, was in response to paragraph 13 of ABC’s amended defence and\n                    counterclaim, which concerned the applicability of the URDG 458to the CGsand had nothing to do with the PB and\n                    APG. 151    As to the third part, Boustead relies on its\n                    answer dated 9 September 2013 in response to ABC’s request for\n                    further and better particulars. The answer states: [Boustead] avers that ODAC’s purported ‘extend or pay’ notices are not demands which comply\n                        with the terms of the respective guarantees and in breach of the\n                        requirements of Article 20 of the [URDG 458]. As can be seen, the reference to Art 20 of the URDG 458\n                        was targeted at the non-compliance of the ODAC Notices, rather than the CG38\n                        and CG39 Demands. 152    In my view, none of the pleadings referred\n                    to above adequately cover the points they are said to establish, much less a\n                    coherent pleading covering all three points which makes clear that Boustead is\n                    relying on Art 20(b) of the URDG 458 to invalidate the CG38 and CG39\n                    Demands. 153    The issue of Boustead’s deficient\n                    pleadings was brought up at various junctures across two tranches of the trial.\n                    Despite the considerable controversy over the adequacy of Boustead’s\n                    pleadings, it was not addressed in Boustead’s closing submissions. ABC, on\n                    the other hand, took strong objection to the state of Boustead’s pleadings\n                    in its closing submissions.[note: 82]In Boustead’s reply closing\n                    submissions, Boustead raised four points in response to ABC’s\n                    objection. 154    First, Boustead argues that ABC’s\n                    allegations of deficiencies in its pleadings are baseless, “as Boustead\n                    had already pleaded Article 20(b) in its pleadings”.[note: 83]This is a bare assertion which is\n                    neither here nor there. 155    Second, Boustead argues that “the\n                    purport of Art 20(b) is a matter of law and is in fact obvious on its face,\n                    and need not be pleaded”.[note: 84]It seems to me that it is not sufficient\n                    for Boustead to say that the purport of Art 20(b) is obvious on its face.\n                    Boustead has to plead that it was relying on Art 20(b)to invalidate the CG38 and CG39 Demands. It did not do\n                    so. 156    Third, Boustead states that “[i]n\n                    relation to the alleged deficiency of Boustead’s pleadings on Libyan law,\n                    it is also trite that matters of law need not be pleaded”.[note: 85]However, it is well established that\n                    foreign law is required to be pleaded and proved as a fact:EFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and\n                        another[2014] 1 SLR 860 at [56]. Otherwise, the court treats the\n                    case as a purely domestic one and applies Singapore law. 157    Fourth, Boustead states that “[i]n\n                    any event, ABC was not prejudiced in any way, and was given ample opportunity to\n                    address this point, by way of the Joint English Law Experts Report, Professor\n                    Goode’s two supplementary opinions …”.[note: 86]No authority was cited for the\n                    proposition that the lack of prejudice overcomes a deficiency in pleadings.\n                    Clearly, Boustead’s pleadings on the issue are inadequate and Boustead\n                    failed to amend its pleadings in the face of repeated objection by ABC to\n                    Boustead’s reliance on the Art 20(b) argument in the light of its\n                    pleadings. I am of the view that the inadequacy of Boustead’s pleadings is\n                    sufficient to dismiss this argument. I will nonetheless address the merits of\n                    the argument. 158    I return to the three parts necessary to\n                    establish Boustead’s Art 20(b) argument: (a) the PB and the APG were\n                    governed by Libyan law; (b) Libyan law incorporates the URDG 458 into the PB and\n                    APG; and (c) BCD’s demands were invalid because they failed to comply with\n                    Art 20(b). 159    There is no dispute as to the first point,\n                    which is consistent with ABC’s position that Libyan law is the proper law\n                    of both the PB and the APG. The more contentious issue is whether Libyan law\n                    incorporates the URDG 458 into the PB and APG. (2)   Whether Libyan law incorporates the URDG 458 into the PB and\n                APG 160    Dr Tumi, Boustead’s Libyan law\n                    expert, gave evidence that Art 764 of the Libyan Commercial Code\n                    (“the Commercial Code”) incorporated the URDG 458 into the PB and\n                    the APG. Article 746 of the Commercial Code states: Letters of Guarantee shall be subject to international unified banking\n                        regulations and customs on all matters which are not regulated under this\n                        Law. Dr Tumi’s oral evidence was that the URDG 458 fell\n                        within “international unified banking regulations and customs”\n                        and was therefore incorporated into the PB and the APG at part of Libyan\n                            law.[note: 87] 161    However, no mention of the URDG 458 was made\n                    in Dr Tumi’s expert report dated 19 December 2013. Dr Tumi\n                    only gave evidence that Libyan law incorporated the URDG 458 into the PB and APG\n                    when he was on the stand. He gave evidence on the point only because counsel for\n                    Boustead made an eleventh-hour oral application (which I allowed) for\n                    Dr Tumi to do so on the day he took the stand. The application was to\n                    amplify Dr Tumi’s testimony to cover the issue of whether Libyan law\n                    incorporated the URDG 458 into the PB and APG.[note: 88] 162    Further, the substance of\n                    Dr Tumi’s evidence on this point was unimpressive. First,\n                    Dr Tumi had no material to support his assertion that the URDG 458 fell\n                    within “international unified banking regulations and\n                        customs”.[note: 89]Dr Tumi did\n                    not produce any court decisions, academic articles or other literature\n                    supporting his proposition that this was so. All Dr Tumi relied on was his\n                    bare assertion that this was the case. 163    Second, when it was suggested to\n                    Dr Tumi that “international unified banking regulations and\n                    customs” could refer to a few instruments apart from the URDG 458,\n                    Dr Tumi responded tersely: “in practice we normally apply such\n                        rules”.[note: 90]No other substantiation or\n                    explanation was provided for his assertion. Further, when Dr Tumi’s\n                    attention was drawn to other international instruments such as the International\n                    Standby Practices 1998, he stated that he could not assist the\n                        court.[note: 91] 164    While a court is not entitled to substitute\n                    its own views for those of an expert who is not contradicted, the court must\n                    also not accept unchallenged evidence without question. An expert’s\n                    evidence must be sifted, weighed and evaluated:Sakthivel\n                        Punithavathi v PP[2007] 2 SLR(R) 983 at [76]. In my view, the\n                    evidence given by Dr Tumi on Libyan law incorporating the URDG 458 was\n                    unconvincing, and I do not accept it. 165    I am therefore of the view that Boustead has\n                    not discharged its burden of proving that the URDG 458 was incorporated into the\n                    PB and APG by virtue of Art 746 of the Commercial Code. It is not necessary\n                    for me to examine whether the CG38 and CG39 Demands were invalid because they\n                    failed to conform to the requirements of Art 20(b) of the URDG\n                458. Whether ABC had knowledge of the non-conformity 166    Since Boustead’s position is that ABC\n                    made the FA Demand fraudulently, ABC’s knowledge of the non-conformities,\n                    if any, might also be relevant. I have found that the CG Demands conformed to\n                    the requirements of the CGs under English law. It is therefore not necessary for\n                    me to address this question.",
        "Conclusion on whether ABC’s claim against Boustead is\n                fraudulent": "167    Based on the analysis above, I have\n                    concluded that, on an application of English law, ABC would not be liable to pay\n                    BCD under the CGs because BCD made the CG Demands fraudulently (in the reckless\n                    sense), and ABC would have had knowledge of BCD’s fraud at the relevant\n                    time. I now come to the question of Boustead’s liability to\n                ABC. 168    Boustead’s argument is that, in view\n                    of the invalidity of the CG Demands made by BCD,ABC’s\n                        claim against Bousteadis made fraudulently. Boustead says that\n                    the known facts and information leading up to the trial reveal that the demands\n                    made by BCD were either made fraudulently, or alternatively, were\n                    non-conforming. Boustead repeatedly brought the fraud or non-conformity of\n                    BCD’s demands to ABC’s attention, to which ABC turned a blind\n                        eye.[note: 92]Boustead says that this\n                    “points only to one realistic inference – ABC’s claim ... is\n                    a dishonest one”.[note: 93] 169    ABC would be acting fraudulently if it is\n                    shown that: (a) ABC brought its claim against Bousteadknowingthat it had no basis in fact or law; or (b) that ABC\n                    brought its claim recklessly. These are the two limbs in the classic statement\n                    of fraud found inDerry v Peek, which was approved\n                    by the Singapore Court of Appeal inPanatron Pte Ltd and\n                        another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at\n                    [13]. 170    ABC made the FA Demand on 3 September\n                    2012, stating that:[note: 94] [ABC] has received demands from BCD for payment under the [CGs] in the\n                        following amounts on the following dates: •US$\n                                15,021,093.25under [CG39] on 23 June 2011;\n                            and •US$\n                                3,760,387.95under [CG38] on 11 July\n                        2011, in aggregate, the sum of US$ 18,781,481.20 ... In accordance with the terms of [the FA] …DEMANDis hereby made that Boustead pay [ABC]within three (3) Business Days of the date of this\n                            letterthe sums ofUS$ 15,021,093.25 and\n                            US$ 3,760,387.95... [emphasis in original] It is apparent from the text of the FA Demand that it is\n                        premised on the apparent validity of the CG Demands, which is the basis on\n                        which the FA Demand is made. 171    I have found that: (a)     BCD made the CG Demands\n                        fraudulently in the reckless sense (at [91] above). (b)     ABC had knowledge on 14 July\n                        2011 or at the latest on 24 September 2012, that the CG Demands were\n                        invalid because BCD made them fraudulently (at [98]–[99]\n                        above). In the light of these findings,\n                        it is my view that when ABC made the FA Demand on 3 September 2012, ABC\n                        was acting fraudulently in the reckless sense. Even if ABC only acquired\n                        knowledge of the invalidity of the CG Demands as a consequence of\n                        BCD’s fraudafter3 September 2012,\n                        it is fraudulent (in the reckless sense) for ABC to continue maintaining its\n                        claim against Boustead in these circumstances when it has not paid BCD\n                        before acquiring such knowledge.",
        "Whether ABC conspired with BCD, ODAC, or both to perpetrate a fraud\n                on Boustead": "172    This argument on conspiracy and the next\n                    argument on unconscionability are academic in the light of my finding on fraud\n                    above. I will nonetheless address them for completeness or in the event that my\n                    finding on fraud is wrong. 173    Boustead argues that ABC conspired with BCD,\n                    ODAC, or both to perpetrate a fraud on Boustead,[note: 95]in reliance on the following\n                    factors: (a)     ABC’s disregard for several\n                        matters Boustead brought to ABC’s attention, which might have\n                        suggested that the BCD demands were unjustified and most likely\n                            fraudulent:[note: 96] (i)       the purportedforce majeureevent, Boustead suffering loss\n                            beyond the sums guaranteed under the CGs; (ii)       Boustead’s inability to\n                            contact ODAC; and (iii)       the unauthorised withdrawals from\n                            Boustead’s account with BCD. (b)     ABC’s receipt of the ODAC Notices which\n                        BCD “untruthfully claimed to be purported demands from\n                            ODAC”.[note: 97] (c)     ABC informing BCD of the requirements for a conforming\n                        demand under the CGs in its SWIFT message dated 22 June\n                            2011.[note: 98] (d)     The “mutually beneficial relationship”\n                        between BCD and ABC in relation to the CGs, where there was a reciprocal\n                        commission arrangement in place between the two banks.[note: 99] (e)     ABC’s “indifference” to\n                        BCD’s false statements in the CG38 and CG39 Demands.[note: 100] 174    In essence, Boustead asserts that ABC,\n                    despite being aware of the circumstances above, was “indifferent”\n                    to the invalidity of BCD’s claims. ABC’s sustained indifference\n                    leads one to reach an “irresistible conclusion”, namely that ABC\n                    was complicit in BCD’s false claim for the counter-guaranteed\n                        sums.[note: 101] 175    In my view, these circumstances do not\n                    suggest a conspiracy between ABC and BCD. The allegation of a conspiracy is\n                    speculative. If ABC was conspiring with BCD or ODAC to perpetrate a fraud\n                    against Boustead, BCD would not have forwarded copies of the ODAC Notices to ABC\n                    and, likewise, ABC would not have forwarded such copies to Boustead (see [14]\n                    above).",
        "Whether it would be unconscionable for ABC to obtain payment from\n                Boustead against the FA Demand": "176    It is well established that under Singapore\n                    law, injunctive relief will be granted to restrain payment under a demand\n                    guarantee where the beneficiary makes a demand for payment unconscionably.\n                    Unconscionability exists as a distinct ground from fraud for restraining payment\n                    on a demand. It covers situations of abuse, unfairness and dishonesty:BS Mount Sophia Pte Ltd v Join-Aim Pte Ltd[2012] 3 SLR\n                    352 (“BS Mount Sophia”) at\n                    [18]–[19]. Singapore courts have departed from English law, which\n                    recognises only fraud as an exception to the restraint of a demand for payment\n                    under a demand guarantee. 177    Boustead argues in its reply closing\n                    submissions that the demands for payment by ODAC or BCD under the CGs or the PB\n                    and APG are unconscionable. Boustead argues that “[ABC’s] attempt\n                    to enforce its rights under the FA would be unconscionable”.[note: 102]The application of\n                    unconscionability in this case raises a number of legal issues.",
        "The applicable law": "178    First, there is the choice of law problem:\n                    what is the law applicable to the grant of injunctive relief for restraining\n                    payment against a demand under a demand guarantee? 179    It is clear that Singapore law is applicable\n                    where both the underlying contract (or the equivalent of the Public Works\n                    Contract in the present case) and the demand guarantee are governed by Singapore\n                    law: see for example,Dauphin Offshore Engineering &\n                        Trading Pte Ltd v The Private Office of HRH Sheikh Sultan bin Khalifa bin\n                        Zayed Al Nahyan[2000] 1 SLR(R) 117 (“Dauphin Offshore”),BS Mount\n                        SophiaandJBE Properties Pte Ltd v Gammon Pte\n                        Ltd[2011] 2 SLR 47(“JBE\n                        Properties”). It is also clear that Singapore law does not\n                    apply where both the underlying contract and the demand guarantee are governed\n                    by English law:Shanghai Electric Group Co Ltd v PT Merak\n                        Energi Indonesia and another[2010] 2 SLR 329 (“Shanghai Electric v PT Merak”) at [30] and\n                    [35]. 180    The authorities have not addressed what law\n                    will apply to the grant of an injunction where different laws govern the\n                    underlying contract and the demand guarantee in question. InShanghai Electric v PT Merak, Lee Seiu Kin J characterised\n                    the restraint of a demand made under a demand guarantee as a substantive matter.\n                    It was therefore not governed by thelex fori, but\n                    the applicable law reached after applying the relevant choice of law rule:Shanghai Electric v PT Merakat [17] and\n                    [30]. 181    Lee J did not, however, articulate the\n                    choice of law rule that he applied to determine that English law was the\n                    applicable law. Indeed, he had no need to. Both the underlying contract and the\n                    demand guarantee in that case were governed by English law. English law was\n                    therefore the only potentially applicable law once thelex\n                        fori(Singapore law) was excluded. Lee J nevertheless seems\n                    to have thought that the applicable law was the law governing the demand\n                    guarantee (see his characterisation of the issue inShanghai\n                        Electric v PT Merakat [2]), and I would hold that it is as\n                    such. 182    I recognise that the issue of whether an\n                    injunction should be granted to restrain a demand necessarily entails\n                    “examin[ing] the circumstances surrounding the underlying\n                    contract”:Dauphin Offshoreat [37]. But\n                    applying the law governing the demand guarantee is the most intuitive and most\n                    likely to be consistent with the parties’ expectations. Parties would\n                    likely expect that the conditions under which they are entitled to make a demand\n                    for payment, and the circumstances where they would be precluded from receiving\n                    payment, would be determined by the law governing the demand guarantee under\n                    which the demand for payment is made. 183    Accordingly, Libyan law would apply to the\n                    restraint of payment on demands under the PB and APG. However, this question\n                    does not arise because neither BCD nor ODAC are party to the present\n                    proceedings. English law would apply to the restraint of payment on demands\n                    under the CGs. Since English law does not recognise unconscionability as a\n                    ground of restraint of payment/demands, this is also a moot point. Singapore law\n                    would apply to the restraint of payment on demands under the FA.",
        "Whether the unconscionability exception applies to the FA\n                Demand": "184    There is a second difficulty that arises in\n                    the context of demands made under the FA. It is not clear whether the\n                    unconscionability exception applies to a demand made by a bank against its\n                    customer under a facility agreement. Thus far, the situations where the court\n                    has dealt with the unconscionability exception have been in the context of a\n                    beneficiary’s demand on a bank under a demand guarantee. The situation\n                    here is slightly different. The question of unconscionability arises in the\n                    context of ABC’s demand on Boustead for an indemnity, but this does not\n                    necessarily mean that ODAC’s or BCD’s demands under the PB and APG\n                    or the CGs are irrelevant. 185    The Court of Appeal inBS\n                        Mount Sophiastressed at [41] that unconscionability as an\n                    exception has been carved out specifically “in the context of performance\n                    bonds”, and is not to be mistaken for the general contractual doctrine of\n                    unconscionability. In other words, the nature of the instrument in question is\n                    essential to the applicability of the doctrine of unconscionable\n                demands. 186    In my view, the unconscionability exception\n                    should be similarly extended to a demand for payment made by a bank against its\n                    customer under a facility agreement. The FA between ABC and Boustead requires\n                    Boustead to indemnify ABC on the latter’s first demand, so the obligation\n                    owed by Boustead to ABC is in substance similar to that found in a demand\n                    guarantee or performance bond. 187    An English High Court decision,Technical & General Guarantee Company Ltd v Mark\n                        Patterson(2003) WL 18223105 (“Technical & General Guarantee”), does not appear to\n                    have drawn a distinction between the two situations. InTechnical & General Guarantee, a bank was instructed by the\n                    customer to grant a performance bond in favour of a third party. The bank did so\n                    against the customer granting it a cross-indemnity for sums demanded under the\n                    performance bond. The cross-indemnity required the customer to pay the bank on\n                    the latter’s first demand, with the demand being conclusive evidence of\n                    the amount owing. Mr Launcelot Henderson QC, sitting as a deputy judge of\n                    the English High Court, treated the cross-indemnity on the same footing as a\n                    performance bond. He said that the effect of the cross-indemnity was that the\n                    customer had to put the bank in funds any time, whether or not a demand had been\n                    made under the performance bond. 188    Further, applying the unconscionability\n                    exception to a demand for payment made by a banker on his customer is consistent\n                    with the rationale and practical considerations that motivate the\n                    unconscionability exception. These were articulated by the Court of Appeal inJBE Propertiesat [10]–[13], and may be\n                    distilled into two broad propositions. 189    First, the function served by a demand\n                    guarantee differs from that served by a letter of credit. (In the latter case,\n                    fraud is the only recognised exception to the payment against an apparently\n                    conforming letter of credit.) A letter of credit is issued as performance of the\n                    primary obligation of making payment. It is therefore the “lifeblood of\n                    commerce”. A demand guarantee, on the other hand, stands in a different\n                    position. It is issued merely as security for a secondary obligation, to pay\n                    damages in the event of a breach. 190    Second, the one-sided nature of a demand\n                    guarantee may result in the beneficiary receiving more than he bargained for.\n                    The beneficiary may call on a sum well in excess of the quantum of the\n                    beneficiary’s actual or potential loss. Such an excessive or abusive call\n                    may have a damaging impact on the party who is required to make the payment.\n                    That party may be confronted with liquidity problems and find difficulty\n                    recovering the monies from the beneficiary. 191    Both these considerations apply with equal\n                    force to a demand for payment made by a bank against its customer under a\n                    facility agreement. Particularly so in the present case. Clause 6.9 of the FA\n                    weighs the scales heavily in favour of ABC. ABC is entitled to make a demand\n                    against Boustead, requiring Boustead to put ABC in funds, even before ABC has\n                    made payment against demands received under the CGs. ABC’s demand is\n                    stipulated to be conclusive evidence of the amount that Boustead owes to ABC.\n                    There is a potential for abuse or oppression from an excessive or unwarranted\n                    call. I do not see any reasons why the unconscionability exception should not\n                    apply to demands for payment made by ABC under the FA.",
        "Whether there is unconscionability on the facts of this\n                case": "192    I turn now to whether the factual basis for\n                    Boustead’s unconscionability argument is satisfied. Unconscionability has\n                    been stated to include elements of abuse, unfairness and dishonesty:Raymond Construction Pte Ltd v Low Yang Tong[1996] SGHC\n                    136 at [5]. It is, however, not possible to define unconscionability apart from\n                    a broad indication such as lack ofbona fides.\n                    What constitutes unconscionability depends on the facts of the case:Dauphin Offshoreat [42]. The entire context of the case\n                    must be considered, and only if it is “particularly malodorous”\n                    will the unconscionability exception be made out:BS Mount\n                        Sophiaat [21]. A high threshold needs to be met before\n                    unconscionability will be established, lest it upset the contractual bargain\n                    between the parties and undermine theraison\n                        d’êtreof the demand guarantee:BS Mount\n                        Sophiaat [39]. 193    In my view, and on the facts presently\n                    before me, the circumstances as a whole are such that it would be unconscionable\n                    for ABC to obtain payment from Boustead under the FA. The following facts lead\n                    me to this conclusion: (a)     ABC has not made payment under the\n                        CGs. That is apparent from communications that ABC sent in response to\n                        BCD’s CG Demands, reminding the latter that ABC was injuncted from\n                        making payment. Indeed, the parties before me proceeded on the common basis\n                        that ABC had not yet made payment to BCD. (b)     It does not appear to me that BCD has made\n                        payment to ODAC under the PB or APG. While there is no direct evidence\n                        before me on this point, the lack of urgency in the communications between\n                        ABC and BCD subsequent to the CG Demands suggests that BCD has not made\n                        payment under the PB or APG, and that is an inference I am prepared to\n                        draw. (c)     BCD does\n                        not appear to have commenced proceedings against ABC, or attempted to\n                        enforce the sums purportedly owing under the CGs against\n                    ABC. (d)     BCD has made\n                        the CG Demands fraudulently in the reckless sense, and ABC has knowledge of\n                        such fraud. (e)     The civil war in Libya was aforce majeureevent that would have discharged the Public Works Contract. The internal\n                        strife in Libya was to the extent that the Al-Marj project site was pillaged\n                        and looted, with Boustead’s staff having to be evacuated (see [8]\n                        above). This rendered the performance of the Public Works Contract\n                        impossible, and it was to no fault on the part of Boustead. Dr Tumi\n                        gave evidence for Boustead on this issue. Unlike his unsatisfactory evidence\n                        as to whether Libyan law incorporates the URDG 458 (see [160]–[165]\n                        above), his evidence on this issue was addressed in his expert\n                            report.[note: 103]His\n                        evidence that the Public Works Contract was discharged was also supported by\n                        references to the appropriate articles in the Libyan Civil Code and Libyan\n                        court decisions on point.[note: 104] (f)     The ODAC Notices which form the basis\n                        of BCD’s demands against ABC under the CGs are very clearly not in\n                        accordance with the terms of the PB and APG (see [68]–[69]\n                        above). (g)     ODAC\n                        and thus BCD only pursued their extend or liquidate requests and demands for\n                        paymentsubsequentto the outbreak of unrest\n                        leading to the civil war in Libya in 2011, after the Public Works Contract\n                        was discharged byforce\n                    majeure. (h)     There was no prior allegation by ODAC that the JV had breached the\n                        Public Works Contract in the material that was placed before me. Indeed, it\n                        appears from the evidence that the ODAC Notices were relied upon as demands\n                        under the PB and APG only after BCD failed to extend the validity of these\n                        instruments. There is no evidence that ODAC was entitled to seek the\n                        extension in the unfortunate events which erupted. (i)     The conflict in Libya has persisted,\n                        with reports of fighting in Al-Marj as late as\n                mid-2014. 194    Against this backdrop, if all the parties,\n                    including BCD and ODAC were before me, I would have been minded to grant an\n                    injunction restraining ODAC from seeking payment from BCD. While the PB and APG\n                    are governed by Libyan law, there was no pleading or evidence as to whether\n                    Libyan law incorporates the unconscionability exception. I would therefore have\n                    presumed that it was similar to Singapore law and granted the injunction. If\n                    ODAC was restrained from receiving payment from BCD, then it would follow that\n                    BCD should not be entitled to receive payment from ABC, and ABC from\n                    Boustead. 195    Even if Libyan law does not have the\n                    unconscionability exception, I would have been inclined to restrain ODAC from\n                    receiving payment from BCD, and BCD from ABC and ABC from Boustead if all of\n                    them were before me. This is because the ODAC Notices are clearly invalid\n                    demands and all the parties down the line, including ODAC, must know this.\n                    Dr Tumi’s unchallenged evidence was that the ODAC Notices were not in\n                    accordance with the terms of the PB and APG and would not have triggered\n                    BCD’s liability to ODAC (see [45] above). 196    I am aware that Singapore cases which have\n                    applied the unconscionability exception have done so in different factual\n                    scenarios. The courts have usually been presented with a three-party scenario\n                    (the instructing party, the bank, and the beneficiary), with similar governing\n                    laws. The situation here is of greater complexity. There are four parties (two\n                    banks). There are multiple laws governing different aspects of the transaction.\n                    The relationship between ABC and BCD under the CGs is governed by English law,\n                    which does not recognise the unconscionability exception. But I have concluded\n                    above that the unconscionability exception applies to the instant case because\n                    the FA is governed by Singapore law. 197    I have relied on the fact that BCD acted\n                    fraudulently in the reckless sense (at [193(d)] above) in coming to my\n                    conclusion of unconscionability. I am aware that this judgment will not bind BCD\n                    or ODAC. If BCD were to bring a claim against ABC, whether before the English\n                    courts (disputes under the CGs are submitted to the non-exclusive jurisdiction\n                    of the English courts, see [26] above) or elsewhere, there is the possibility\n                    that that court might not agree with my finding and ABC may be found liable to\n                    BCD for the sums demanded under the CGs. There is the risk that ABC may\n                    “fall between two stools”, to borrow Ackner LJ’s phrase\n                    inUnited Tradingat 566. That was one of the\n                    reasons that dissuaded the English Court of Appeal inUnited\n                        Tradingfrom granting the injunctions sought: that a bank which\n                    has acted without any hint of dishonesty, who has merely acted on the\n                    instructions passed down the line, should not be put in a “perilous\n                    situation” (United Tradingat\n                566). 198    Even if I am wrong, and BCD did not act\n                    fraudulently, I would still have granted an injunction on the ground of\n                    unconscionability. Requiring Boustead to pay ABC against a chain of demands that\n                    emanates from the clearly invalid ODAC Notices will almost certainly lead to\n                    injustice to Boustead. Between that and the risk of ABC facing litigation from\n                    BCD and an adverse order from another court, it is my view that an injunction\n                    should be granted to preserve the existing state of affairs. 199    It remains for me to address\n                    Boustead’s reliance on UNSC Resolutions 1970 (2011) and 1973 (2011)\n                    mentioned at [8] above. These resolutions were given effect in Singapore by the\n                    Monetary Authority of Singapore (Sanctions and Freezing of Assets of Persons\n                    – Libya) Regulations 2011 (“the MAS Regulations”) which were\n                    issued by the Monetary Authority of Singapore on 8 July 2011. Boustead, in\n                    its reply closing submissions, argues that any payment by ABC to BCD would have\n                    been in breach of Resolutions 1970 (2011) and 1973 (2011), as well as the MAS\n                        Regulations.[note: 105]Boustead argues thatBCD’s demandsare\n                    therefore made unconscionably. 200    I reject this argument. First, it is well\n                    established, and also agreed by both the English law experts, that the\n                    unconscionability exceptiondoes notform part of\n                    English law on demand guarantees. Unconscionability would therefore not be a\n                    basis for the restraint ofBCD’s demandsunder the CGs, which are governed by English law, as opposed to ABC’s\n                    demand under the FA, which is governed by Singapore law. Second, even if payment\n                    to BCD would have been in breach of the UNSC Resolutions and the MAS\n                    Regulations, Boustead does not state the effect of the breach on ABC’s\n                    obligations to BCD under the CGs, or to Boustead under the FA. This point is\n                    therefore inconclusive and does not assist Boustead. While I note that the UN\n                    resolutions indicate the severity and urgency of the crisis in Libya in 2011,\n                    they do not directly affect the issues before me.",
        "Whether unconscionability was sufficiently pleaded by\n                Boustead": "201    I should mention one point that ABC takes\n                    against Boustead on Boustead’s pleadings on unconscionability.[note: 106]ABC argues that Boustead only pleaded\n                    unconscionability in relation to the demands made by ODAC and/or BCD under the\n                    PB and APG or CGs. Boustead did not plead thatABCmade the FA Demand unconscionably. 202    Boustead’s amended statement of claim\n                    pleads that the demands made “by ODAC and/or BCD for payment under CG38\n                    and/or CG39 [are] unconscionable”.[note: 107]The demands are said to be unconscionable\n                    because ODAC made demands in excess of what it was owed, even though the Public\n                    Works Contract was discharged as a consequence of the Libyan war, aforce majeureevent.[note: 108]Boustead only expressly mentions\n                    ABC as having made the FA Demand unconscionably in its opening statement and\n                    closing submissions. In Boustead’s opening statement, Boustead stated that\n                    in the light of the “various suspicious circumstances” which\n                    Boustead had alerted ABC to, ABC’s conduct in making the FA Demand and\n                    issuing the EOD Notice were unconscionable.[note: 109]Boustead’s closing submissions\n                    state in passing that ABC’s unconscionable conduct should not be\n                        condoned.[note: 110]Boustead’s reply closing submissions take the point further by stating\n                    that the FA Demand is unconscionable, presumably because the FA was granted on a\n                    back-to-back basis to the CGs.[note: 111] 203    Although Boustead should have included a\n                    plea that the FA Demand was unconscionable in the circumstances, I am of the\n                    view that this omission is not fatal and does not preclude Boustead from raising\n                    unconscionability in the circumstances. 204    The reason why Boustead may rely on\n                    unconscionability is that the ODAC Notices were not valid demands in the first\n                    place. There is no evidence suggesting that the JV was in breach of contract or\n                    that ODAC was entitled to an extension of the PB or APG in the circumstances.\n                    ODAC is not entitled to payment. This is known to BCD and ABC. Yet any payment\n                    by Boustead to ABC will, as stated above, flow to BCD, then eventually to\n                    ODAC.",
        "Whether cll 6.6, 6.8 and 6.9 of the FA are invalid under\n                s 2(2) of the UCTA as unreasonable exclusions of liability for negligence": "205    My conclusions on the fraud and\n                    unconscionability arguments both provide bases for the grant of injunctive\n                    relief. I turn to address Boustead’s contract arguments in\n                brief. 206    Boustead argues that cll 6.6, 6.8 and\n                    6.9 of the FA are invalid under s 2(2) of the UCTA. Section 2(2) of the\n                    UCTA applies to loss other than personal injury or death. It states that a\n                    person cannot exclude or restrict his liability for negligence except in so far\n                    as the term or notice satisfies the requirement of reasonableness. Boustead\n                    argues that the clauses have the effect of excluding or restricting ABC’s\n                    liability for negligence and that they are not reasonable. 207    In order for a clause to fall within the\n                    purview of s 2(2) of the UCTA, it has to be an exclusion of liability for\n                    negligence on a proper construction. The court is concerned with the substance\n                    rather than the form of the clause. The Court of Appeal inDeutsche Bank AG v Chang Tse Wen[2013] 4 SLR 886 stated at [68]\n                    that: [T]he UCTA simply addresses itself to clause which “exclude or\n                        restrict” a liability, obligation or duty. The legislative eye is\n                        firmly set on the substantiveeffectof a term\n                        or notice, rather than on itsformor\n                        identification. Seen in this light, the only question which arises for a\n                        court is whether a term or notice has the effect of excluding or restricting\n                        the imposition of a duty of care in law. [emphasis in original] The court must therefore ascertain the effect of the clause in\n                        question and determine whether or not it is, in substance, an exclusion of\n                        liability for negligence.",
        "The effect of cll 6.6, 6.8 and 6.9 of the FA": "208    It will be helpful to set out in full the\n                    clauses which Boustead says are exclusions or restrictions of liability and to\n                    examine the effect of the clauses. 209    Clause 6.6 of the FA states: 6.6Indemnity for Assumption of\n                                Obligations: Without prejudice to any provision in this\n                            Agreement, the Borrower hereby unconditionally and irrevocably agrees\n                            and undertakes with [ABC] thatit shall at all times\n                                on first demand fully indemnify[ABC]from and against any and all\n                                actions, proceedings, claims, demands, expenses, loss, damage and\n                                liability of whatever nature which[ABC]may at any time and from time to\n                                time sustain, incur or suffer by reason of the assumption of any\n                                obligations (hereunder or otherwise) with respect to any[counter-guarantee] or the execution and delivery of any\n                            [counter-guarantee] or its payment of any demand or claim thereunder or\n                            otherwise in connection with or arising in any way whatsoever out of any\n                            [counter-guarantee]. Without prejudice to its generality, the foregoing\n                            indemnity shall extend to any interest, fees or other sums whatsoever\n                            paid or payable on account of any funds borrowed in order to carry any\n                            unpaid amount. [emphasis added] Clause 6.6 requires Boustead to indemnify ABC on demand\n                        for any loss that ABC may suffer, or any expenses it may incur in relation\n                        to any of the CGs that were issued under the FA. It is unclear as to whether\n                        the indemnity is required to be made on ABC’s first demand, or on\n                        proof of loss. 210    Clause 6.8 of the FA states: 6.8No Liability: [ABC]\n                            shall haveno obligationwhatsoeverto make any factual determinationsas\n                            to thevalidity or genuineness or notice or accuracy\n                                or correctness of any certificate or statement or notice or other\n                                document deliveredwith respect to or under any\n                            [counter-guarantee] (whether by the beneficiaries of the\n                            [counter-guarantee] thereof or otherwise)or as to\n                                any other mattersbefore making payment under any\n                            [counter-guarantee]. [emphasis added] The operative phrase in cl 6.8 is that ABC shall have no\n                        obligation to make any factual determinations as to the validity or\n                        genuineness,etc, of the documents presented\n                        to it. Under this clause, ABC is therefore not required to ascertain the\n                        truth or falsity of the facts which are represented in the documents\n                        presented to it. 211    Finally, cl 6.9 of the FA\n                    states: 6.9Indemnity: Without\n                            prejudice to any provisions in this Agreement, the Borrower hereby\n                            undertakes and agrees with [ABC] thatit shall\n                                immediately upon demand from[ABC] (which demand shall, in the absence of manifest\n                            error,be conclusive evidence of the amount\n                                owing), reimburse and/or indemnify [ABC] for any amounts\n                            demanded or paid under any [counter-guarantee], by paying such amount to\n                            [ABC]. ... The Borrower’s obligations to pay such amount demanded\n                            by ABC shall be absolute and unconditionalirrespective of any acts, matters or things, including any disputes\n                                of the Borrower concerning the merits or validity or propriety of\n                                any such demands or claimsor any payment made and\n                            notwithstanding any counter-claims or set off or any other rights the\n                            Borrower has or may have (whether or not[ABC]has notice of\n                                any of the acts, matters or things). [emphasis added] Clause 6.9 clause relates only toamounts demanded or paid under any CG(in contrast to the\n                        more widely-framed cl 6.6, discussed above). Clause 6.9 requires\n                        Boustead to pay ABC “immediately upon demand”, which demand\n                        shall be “conclusive evidence of the amount\n                    owing”. 212    Construing the clauses as a whole, the\n                    contractual mechanism for payment between Boustead and ABC emerges.\n                    Clause 6.9 of the FA requires Boustead to put ABC in fundsimmediately upon demand, but only for sumsdemanded or paid under the CGs. Clause 6.8 of the\n                    FA, which states that ABC has no obligation to make any factual determinations\n                    in relation to the documents presented to ABC, complements the on-demand nature\n                    of cl 6.9. ABC is thus able to act on the apparent conformity of demands\n                    presented to it under the CGs to make demands on Boustead under cl 6.9 of\n                    the FA. There is no further need for ABC to make factual determination of the\n                    accuracy or truth of facts stated within the demands under the\n                CGs. 213    While cl 6.6 of the FA appears to\n                    suggest that Boustead is to indemnify ABC only on proof of loss, this is to be\n                    read together with cl 6.9 of the FA. In any event, both parties proceeded\n                    on the basis that the FA requires Boustead to pay ABC on demand.",
        "Whether cll 6.6, 6.8 and 6.9 of the FA are exclusions of\n                liability for negligence and if so whether they are reasonable": "214    Boustead argues that these clauses exclude\n                    liability for negligence. Boustead says that cl 6.8 excludes “all\n                    liabilities” on the part of ABC to “make any factual\n                    determinations as to the validity or genuineness or notice or accuracy or\n                    correctness of any certificate or statement or notice or other document”.\n                    This includes liability for negligence. Further, cll 6.6 and 6.9 require\n                    Boustead to indemnify ABC even in cases of negligence or fraud. They are\n                    therefore restrictions of ABC’s liability.[note: 112] 215    Boustead goes on to argue that cll 6.6\n                    and 6.9 both have the effect of allowing ABC to make a claim against Boustead\n                    “without conducting the reasonable examination expected of it ... or even\n                    if it had no basis to do so and no corresponding obligations to meet under the\n                    Counter Guarantees”. Boustead contends that it would have to indemnify or\n                    reimburse ABC where the bank onward transmits a demand even if ABC has knowledge\n                    that the demand under the CGs is invalid or made fraudulently. 216    I do not accept Boustead’s submissions\n                    that cll 6.6, 6.8 and 6.9 of the FA are exclusions of liability for\n                    negligence. 217    I begin first with cl 6.8 of the FA. I\n                    have mentioned above that cl 6.8 obviates the need for ABC to make factual\n                    determinations as to the accuracy of statements or facts in the documents\n                    presented to it. ABC is therefore entitled to take the documents at face value,\n                    and is not required to look behind them to make factual determinations. It is\n                    not an exclusion of liability for negligence. 218    I turn next to cll 6.6 and 6.9 of the\n                    FA. As mentioned above at [213], both sides proceeded on the basis that the\n                    express terms of the FA require Boustead to pay on demand. This is subject to\n                    the argument about implied terms. While cl 6.6 appears to be an indemnity\n                    clause, it is to be read together with cl 6.9. 219    Clause 6.9 states that Boustead’s\n                    obligation to pay the demanded amount shall be absolute and unconditional,\n                    “irrespective of any acts, matters or things”, including any\n                    “disputes of [Boustead] concerning the merits or validity or propriety of\n                    any such demands”, “whether or not [ABC] has notice of any of the\n                    acts, matters or things”. While the clause may have the effect of\n                    requiring Boustead to make payment to ABC even if ABC makes a demand under the\n                    FA negligently, that does not mean it excludes liability for negligence.\n                    Clause 6.9 merely requires Boustead to put ABC in funds on demand,\n                    regardless of any dispute Boustead might have. The clause does not purport to\n                    prevent Boustead from subsequently making a claim against ABC for breach of\n                    duty. It does not purport to exclude ABC’s liability to Boustead in that\n                    respect. 220    It is therefore my view that cll 6.6,\n                    6.8 and 6.9 are not exclusions of liability for negligence. They are therefore\n                    not caught by s 2(2) of the UCTA. Even if the clauses are exclusions of\n                    liability, I would have been minded to hold that they are reasonable. They are\n                    consistent with the mechanism requiring payment on demand and the fundamental\n                    principle of demand guarantees that banks are only concerned with documents and\n                    not facts. I should also mention that there was no suggestion that the clauses\n                    entitle ABC to receive payment even if it makes a demand under the FA\n                    fraudulently (ie, recklessly). ABC accepts that a\n                    fraudulent demand would disentitle it from receiving payment under the\n                        FA.[note: 113]",
        "Whether ABC’s claim against Boustead is precluded by terms that\n                are implied in the FA": "221    Finally, there is the issue of the\n                    implication of terms into the FA. Boustead argues that two terms should be\n                    implied into the FA:[note: 114] (a)     To examine with reasonable care all\n                        documents presented under and in connection with the CGs. ABC would,\n                        therefore, only make demands against Boustead under the FA if the documents\n                        presented fully and strictly complied with the terms of the CGs (“the\n                        first implied term”). (b)     Not to make payment under the CGs and/or make a demand\n                        against Boustead for payment of any sum under the CGs if ABC has knowledge\n                        of the lack of validity, genuineness, accuracy or correctness of any\n                        statement, notice, or other documents delivered with respect to or under the\n                        CGs and/or knowledge of fraudulent conduct in connection with any demand\n                        made under the CGs (“the second implied\n                term”). 222    The process of implication is an exercise of\n                    giving effect to the parties’presumedintentions:Sembcorp\n                        Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp Marine”)\n                    at [93]. It necessarily follows that a term which contradicts the express terms\n                    of the contract will not be implied:Foo Jong Peng and others\n                        v Phua Kiah Mai and another[2012] 4 SLR 1267 at [35]. A term\n                    will be implied only to fill a gap in the contract. The implication of a term\n                    involves a three-step process,Sembcorp Marineat\n                    [101]: (a)    The first step is to ascertain how the gap in the\n                            contract arises. Implication will be considered only if the court\n                            discerns that the gap arose because the parties did not contemplate the\n                            gap. (b)    At the second step, the court considers whether it\n                            is necessary in the business or commercial sense to imply a term in\n                            order to give the contract efficacy. (c)    Finally, the court considers the specific term to\n                            be implied. This must be one which the parties, having regard to the\n                            need for business efficacy, would have responded “Oh, of\n                            course!” had the proposed term been put to them at [the] time of\n                            the contract. If it is not possible to find such a clear response, then,\n                            the gap persists and the consequences of that gap ensue. 223    Even if the first implied term exists, it\n                    does not assist Boustead, as I have concluded that the CG Demands did comply\n                    with the terms of the CGs. 224    The first part of the second implied term\n                        (ie, that ABC is not to make payment under the\n                    CGs and/or make a demand against Boustead for payment of any sum under the CGs\n                    if ABC has knowledge of the lack of validity, genuineness, accuracy or\n                    correctness of any statement, notice, or other documents delivered with respect\n                    to or under the CGs) seeks to modify the fraud exception under common law in\n                    that it would be sufficient if ABC has knowledge of the lack of correctness with\n                    respect to the CG Demands even if that knowledge does not amount to fraud. The\n                    second part is the same as the fraud exception under common law. 225    Since the common law already has the fraud\n                    exception and Singapore law applies the doctrine of unconscionability, there is\n                    no reason to imply either part of the second implied term even if there were a\n                    gap because the parties did not contemplate the gap, which I\n                doubt. 226    Boustead’s arguments on both implied\n                    terms fail.",
        "Conclusion": "227    I will briefly summarise my conclusions\n                    above: (a)     ABC is injuncted from receiving\n                        payment from Boustead under the FA Demand and is injuncted from making\n                        payment to BCD on BCD’s CG Demands. This is because the FA Demand was\n                        made fraudulently in the reckless sense, or alternatively, the circumstances\n                        are such that it would be unconscionable for ABC to receive payment of\n                        monies from Boustead, which will eventually be paid to ODAC. BCD made the CG\n                        Demands fraudulently in the reckless sense, and ABC had knowledge of\n                        BCD’s fraud at the relevant time. (b)     Clauses 6.6, 6.8 and 6.9 of the FA are not\n                        invalid under the UCTA. (c)     There is no basis for the implication of the terms that\n                        Boustead is seeking. 228    Boustead also prays for declarations that:\n                    (a) it is discharged from all liabilities in relation to the CGs that it owes to\n                    ABC under the FA; and (b) the EOD Notice is invalid. There is no need for the\n                    former and I dismiss it. In relation to the latter, since I have concluded that\n                    ABC made the FA Demand fraudulently in the reckless sense, ABC’s EOD\n                    Notice was wrongly issued. I will therefore grant the declaration that the EOD\n                    Notice is invalid. 229    The interlocutory injunction granted on\n                    30 August 2012 is discharged as it is replaced by the injunctions ordered\n                    above. 230    I dismiss ABC’s claim for the payment\n                    of the sums of US$3,760,387.95 and US$15,021,093.25 and its prayer for a\n                    declaration of the same. 231    I will hear the parties on\n                costs.  [note: 1]Notes of\n                                Evidence (“NE”) 18 February 2014 at p 12 lines\n                                12–20 and p 13 lines 7–12. [note: 2]PCB\n                        235–236. [note: 3]PCB 222. [note: 4]PCB 265. [note: 5]PCB 279. [note: 6]PCB 280. [note: 7]PCB\n                                289. [note: 8]PCB 296. [note: 9]PCB\n                                304. [note: 10]PCB\n                    310. [note: 11]PCB\n                        312–314. [note: 12]PCB\n                                316. [note: 13]Statement\n                                of Claim in Suit 730/2012 (Amendment No 3) at para 49(a) and\n                                (b). [note: 14]PCB 354. [note: 15]PCB\n                                355. [note: 16]PCB\n                                364–365. [note: 17]PCB\n                                366–367. [note: 18]PCB\n                        379–380. [note: 19]PCB 74. [note: 20]PCB 74. [note: 21]PCB 128 and\n                            PCB 133. [note: 22]PCB\n                                118–119. [note: 23]PCB 122. [note: 24]Plaintiff’s closing submissions at paras 8 and\n                                160. [note: 25]Plaintiff’s closing submissions at\n                            para 159. [note: 26]Statement of Claim (Amendment No 3) at\n                                para 48(i). [note: 27]Statement of Claim (Amendment No 3) at\n                                para 48(i). [note: 28]Plaintiff’s closing submissions at para\n                        159(a). [note: 29]Defendant’s reply closing submissions at para\n                                20. [note: 30]NE 19 March 2014 at p 4 lines\n                                15–20. [note: 31]Plaintiff’s closing submissions\n                                at para 159. [note: 32]PCB 291A and PCB\n                        310. [note: 33]Expert report of Dr Mohamed Abdulkader Tumi at\n                                paras 40–48. [note: 34]ABC’s reply closing submissions at\n                                para 16(c). [note: 35]Joint report of the experts on English law at para\n                            7. [note: 36]Joint report of the experts on English law at para\n                                18. [note: 37]Supplementary expert report of Royston\n                                Miles Goode at para 9; NE 30 June 2014 at p 98 lines\n                                13–18. [note: 38]Supplementary expert report of Stuart Isaacs QC at para\n                            66. [note: 39]PCB\n                        326–327. [note: 40]PCB\n                                265. [note: 41]PCB\n                                271. [note: 42]Supplementary expert report of Royston Miles Goode at para\n                                8. [note: 43]Defendant’s closing submissions at\n                            para 147. [note: 44]PCB\n                                339. [note: 45]PCB\n                                342. [note: 46]PCB 343. [note: 47]PCB\n                                388. [note: 48]PCB\n                                390. [note: 49]PCB 391A. [note: 50]PCB\n                                391A. [note: 51]8 AB 4602. [note: 52]8 AB 4622–4623. [note: 53]8 AB 4627–4628. [note: 54]8 AB 4853. [note: 55]8 AB\n                                4856. [note: 56]Supplementary expert report of Stuart Isaacs QC at paragraph\n                                11. [note: 57]NE 2 July 2014 at p 5 line\n                                15–p 6 line 4 . [note: 58]PCB\n                    128. [note: 59]PCB\n                                    133. [note: 60]PCB\n                    310. [note: 61]PCB\n                                    279. [note: 62]Plaintiff’s closing submissions at paras\n                                107–110. [note: 63]Joint\n                                report of the experts on English law at para\n                        15. [note: 64]Supplementary expert report of Stuart Isaacs QC at para\n                            10. [note: 65]NE 30 June\n                                2014 at p 54 line 23–p 55 line\n                    4. [note: 66]NE 1 July\n                                2014 at p 91 line 19–p 92 line\n                    3. [note: 67]NE\n                                30 June 2014 at p 35 line 13–p 36 line\n                        5. [note: 68]NE 30 June 2014 p 41 lines\n                        20–22 [note: 69]NE 30 June 2014 p 50 line\n                                10–p 52 line 6. [note: 70]NE 26 February 2014 at p 11 lines\n                            5–9. [note: 71]NE 26 February 2014 at p 35 lines\n                        9–16. [note: 72]Joint\n                                report of the experts on English law at para\n                        15. [note: 73]NE 1 July 2014 p 104 lines\n                                12–20. [note: 74]PCB\n                    279. [note: 75]Plaintiffs\n                                closing submissions at paras 108 and 110. [note: 76]NE 30 June 2014 at p 39 lines\n                                21–25 and p 40 line 20–p 41 line\n                        3. [note: 77]NE 30 June 2014 at p 23 lines\n                                    4–9. [note: 78]NE 1 July 2014 at p\n                        132. [note: 79]Defence and Counterclaim (Amendment No 2) at para\n                                23(d). [note: 80]Reply and Defence to Counterclaim (Amendment No 2) at para\n                                8(a). [note: 81]Reply and Defence to Counterclaim\n                                (Amendment No 2) at para 5(c). [note: 82]Defendant’s closing submissions at paras\n                            94–108. [note: 83]Plaintiff’s reply closing submissions at para\n                                40. [note: 84]Plaintiff’s reply closing submissions at para\n                            40. [note: 85]Plaintiff’s reply closing submissions at para\n                                40. [note: 86]Plaintiff’s reply closing submissions at para\n                                41. [note: 87]NE 19 March 2014 at p 37 line\n                                    4–p 38 line\n                3. [note: 88]NE 19 March\n                                2014 at p 6 line 5–p 7 line\n                    14. [note: 89]NE 19 March 2014 at p 120 line\n                                11–p 121 line 10. [note: 90]NE 19 March 2014 at p 119 lines\n                                19–20. [note: 91]NE 19 March 2014 at p 120 lines\n                                1–7. [note: 92]Plaintiff’s closing submissions at\n                                para 159. [note: 93]Plaintiff’s closing submissions\n                                at para 8. [note: 94]PCB\n                    364. [note: 95]Plaintiff’s closing submissions at para\n                        159(a). [note: 96]Plaintiff’s closing\n                                    submissions at para 167. [note: 97]Plaintiff’s closing\n                                    submissions at para\n                    168. [note: 98]Plaintiff’s closing\n                                    submissions at para\n                    170. [note: 99]Plaintiff’s closing submissions at para\n                                    171. [note: 100]Plaintiff’s closing submissions at para\n                                    172. [note: 101]Plaintiff’s closing\n                                submissions at para 173. [note: 102]Plaintiff’s reply closing submissions at paras\n                                92–93. [note: 103]Expert report of Dr Mohamed\n                                    Abdulkader Tumi at para 18. [note: 104]Expert report of Dr Mohamed Abdulkader Tumi at\n                                    paras 29–32. [note: 105]Boustead’s reply closing\n                                submissions at paras 111–116. [note: 106]Defendant’s closing submissions at para\n                            178. [note: 107]Statement of Claim (Amendment No 3) at para\n                        20. [note: 108]Statement of Claim (Amendment No 3) at paras\n                            13–20. [note: 109]Plaintiff’s opening statement at\n                        para 83. [note: 110]Plaintiff’s closing\n                                submissions at para 100. [note: 111]Plaintiff’s reply closing submissions at paras\n                                92–93. [note: 112]Plaintiff’s closing submissions at para\n                        28. [note: 113]Defendant’s reply closing\n                                submissions at para 20. [note: 114]Plaintiff’s closing\n                                submissions at para 35."
    }
}