{
    "case_title": "Five Ocean Corporation\n      v\n      Cingler Ship Pte Ltd (PT Commodities & Energy Resources, intervener)",
    "ncitation": "[2015] SGHC 311",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       This Originating Summons No 625 of 2015 (“OS 625”) concerned the court’s powers under s 12A of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the IAA”). The purpose of the sale application in OS 625 was to preserve the value of a cargo of 77,000 mt of Indonesian steam coal (“the Cargo”) as an interim measure in aid of arbitration between the relevant parties in Singapore under the auspices of the Singapore Chamber of Maritime Arbitration Rules. 2       The situation at the time of the application was as follows. For the plaintiff, Five Ocean Corporation (“FOC”), the time had come to make the sale application which was fully supported by Corrina Maritime Inc (“CMI”), the owner of the vesselCorinna. For FOC, there was concern that its alleged contractual lien would be worthless as security seeing that the total amount of the unpaid freight together with detention and other expenses accruing and due from the defendant, Cingler Ship Pte Ltd (“Cingler”) could exceed the value of the Cargo presently on board theCorinna. For FOC and CMI, the condition of the Cargo was a source of concern. There were reports of visible signs of heating damage. OS 625 was also taken out at a time when it was thought necessary to preserve the safety of theCorinnaand her crew. The Cargo, vessel and crew had been kept in international waters off the last nominated discharge port for months because of the on-going dispute between the parties concerned and earlier delays by Cingler in the nomination of a legitimate discharge port. Discharge of the Cargo in the last nominated discharge port was not a viable prospect in the absence of local legal entitlement to exercise a lien over the Cargo in India. An Indian law expert, Mr Amitava Majumdar, opined that CMI and/or FOC as the time charterer of theCorinnawould lose their lien rights if theCorrinaproceeded to an Indian port for discharge of the Cargo. Furthermore, even if after discharge, CMI and/or FOC continued to legally have a right of lien, it would be impractical to maintain their right of lien due to commercial and physical constraints at the Indian port. Hence, the lien was exercised over the Cargo outside the territorial waters off the last nominated port, Paradip on 16 June 2015.[note: 1] 3       Against that background, the interveners, PT Commodities & Energy Resources (“CER”), wanted an adjournment of the hearing of OS 625 to,inter alia, allow it time to negotiate the sale of the Cargo to one “Adani group of companies”, and to demonstrate sincerity, Mr Bazul Ashhab who represented Adani Global (an interested buyer of the Cargo) appeared at the hearing on 3 August 2015 to support CER’s application for an adjournment that was strenuously opposed by the other interested parties in court citing months of delay on the part of CER and the urgency of the application as the main reasons. 4       It was apparent to me that there were a number of very substantial obstacles in the way of resolving the issue of the contractual lien in the near future. Up to the time fixed for hearing, the court was not told and, presumably, there had not been any offers of any specific amount in relation to the unpaid freight, detention and other expenses that were accruing. At no time did CER present the relevant bill of lading to CMI, for delivery of the Cargo. Neither did CER resort to O 29 r 6 of the Rules of Court (Cap 322 R 5, 2014 Rev Ed) (“2014 ROC”) to obtain release of the Cargo that was subject to a contractual lien exercised by CMI for the benefit of FOC. CER’s ability to freely sell the Cargo at that point in time was doubtful seeing that there was a worldwide freezing order granted by the High Court of England and Wales on 3 July 2014 over CER’s assets in an unrelated dispute which it had with another entity named Akamas Navigation Limited and a vessel called theAeolian Glory. In light of the English Court’s freezing order, a corresponding injunction was granted by Andrew Ang J on 6 July 2015 over CER’s assets in Singapore. The upshot of all these considerations is that the adjournments sought by CER on two separate occasions were not granted and the sale application proceeded to hearing. 5       Although OS 625 was madeex parte, the hearing before me proceededinter partes. Cingler did not oppose FOC’s application. The owner ofCorinna, CMI, also supported FOC’s sale application. CMI confirmed in affidavit that it would comply with any order made by this court so as to facilitate the court’s directions even though it was a non-party.[note: 2]This cooperation is obvious since it would be in CMI’s business interest to free the vessel of the Cargo so that it could be deployed again. In addition, crew members whose employment contracts had expired would have to be taken off the vessel and repatriated. 6       On 5 August 2015, I allowed FOC’s application to sell the Cargo and made the following orders: (a)     The net proceeds of the sale of the Cargo are to be paid into court pending further order from the arbitral tribunal. (b)     Cingler and CER are to provide FOC’s solicitors with any documents in their possession, custody or control which may be required to facilitate the sale of the Cargo. (c)     The sale of the Cargo and any other steps taken in connection therewith and in and about the preservation, maintenance, sale and/or disposal of the Cargo shall be effected without prejudice to all existing claims, liens (including but not limited to FOC’s lien over the Cargo), charges, encumbrances and rights over or to the Cargo (collectively referred to as “All Claims”), all of which rights are expressly reserved, and the net proceeds shall stand in the place of the Cargo, with All Claims being transferred to the net proceeds. 7       CER has appealed against my Order of 5 August 2015. I now set out the reasons for my decision.",
        "The charterparty chain": "8       The charterparty chain was as follows: (a)     The plaintiff, FOC, time chartered theCorinnafrom her owner, CMI under a time charterparty dated 19 March 2015 (“the March time charter”). The March time charter on a New York Produce Exchange 1946 time charterparty form (the NYPE 46 form) with additional rider clauses was “for [a] one time charter trip of about 25/30 days without guarantee via Indonesia to East Coast [sic] India and via Singapore for bunkers with bulk coal”[note: 3]. Clause 60 stated that the parties agreed to use and issue only the CONGENBILL 1994 bill of lading form during the currency of the March time charter. (b)     FOC voyage chartered theCorinnato the defendant, Cingler, on 19 March 2015 on a Gencon 1994 form with additional rider clauses (“the head voyage charterparty”). Clause 8 is the lien clause (see [10] below). The head voyage charterparty provided for disputes to be referred to arbitration in Singapore, with English law to apply. (c)     Cingler voyage chartered theCorinnato the intervener, CER. No copy of this sub-charter was produced in court.",
        "The head voyage charterparty": "9       Under the head voyage charterparty of 19 March 2015, the Cargo was to be loaded in Indonesia for discharge in India. Cingler was to declare, at its option, before the vessel passed Singapore, the discharge port from the list of named ports on the east coast of India: Haldia, Paradip, Vizag, Gangvaram, Dharma, Ennore and Kakinada. 10     As stated, the head voyage charterparty contained an arbitration clause that stipulated the seat of arbitration of any dispute to be in Singapore, with English law to apply. Clause 8 is the lien clause (hereinafter referred to as “the Lien Clause”) and it reads as follows:[note: 4] The owners shall have a lien over the cargo and on all sub-freights payable in respect of the cargo for freight, deadfreight demurrage claims for damages and for all other amounts due under this Charter Party including costs of recovering the same. 11     Although the head voyage charterparty was not signed, Mr James Baek (“Mr Baek”), the Assistant Manager of FOC, confirmed in his affidavit that the charterparty represented the terms of the agreement that was entered into between FOC and Cingler. For the purposes of OS 625, Cingler did not contradict Mr Baek on this point. 12     Both the March time charter and the head voyage charterparty provided for English law as the governing law.",
        "Cingler’s sub-voyage charter with CER": "13     It was not disputed that Cingler entered into a sub-voyage charter with CER and that the sub-voyage charterparty was not produced in court. Counsel for Cingler, Mr Joseph Tan (“Mr Tan”), confirmed that the sub-voyage charterparty adopted the Gencon 1994 Form. Mr Syed Zia Ur Rehman (“Mr Rehman”), Chief Executive Officer of CER, exhibited in his affidavit a draft fixture note for the hire of theCorinna. The contracting parties in the draft fixture note were identified as CER and International Maritime & Trading Pte Ltd (“IMT”), a company which seemed to be related to Cingler. The draft fixture note also provided for English law to be the governing law. In these circumstances, the parties were content to proceed on the basis that English law governed and applied to the question of whether FOC possessed a contractual right of lien over the Cargo. This threshold issue was the only issue raised by CER in the dispute before me.",
        "Gencon 1994 bill of lading form dated 7 April 2015 and notice of lien for unpaid freightetc": "14     On or about 24 March 2015, theCorinnaarrived at the Indonesian port of Samarinda, East Kalimantan to load the Cargo. Loading of the Cargo commenced on 28 March 2015 and was completed on 7 April 2015. A set of Gencon 1994 form bill of lading was issued on 7 April 2015 and released to CER on 8 April 2015 (“the Bill of Lading”). The Bill of Lading named CER as the shipper and Adani Enterprises Ltd (“Adani Enterprises”), an Indian company, as the Notify Party. The Bill of Lading was consigned “To Order” and was signed by the load port agent, PT Bahari Eka Nusantara (“the Agent”) as agent “for and on behalf of the master of MVCorinna”, Captain Nikolas Bourdos (“the Master”). 15     The defendant, Cingler, failed to pay freight due five banking days after the release of the Bill of Lading (ie, by 15 April 2015) or at all. In addition, Cingler failed to nominate a discharge port from the range of ports listed in the head voyage charterparty on time. Subsequently, on 23 May 2015, Cingler requested FOC to “instruct the Master to depart immediately for ‘Visak’ [Visag] port East Coast India”. However, as this instruction was not accompanied by the payment of freight, theCorinnaremained in the high seas. On 13 June 2015, Cingler revised the discharge port to Paradip, but again, this instruction was not accompanied by payment. 16     Both CMI and FOC gave notice of lien and the exercise of the lien to Cingler, CER and Adani Enterprises. All concerned were informed of FOC’s lien rights under the head voyage charterparty and that the Cargo would be detained and not be released for delivery until payment of freight and other sums due under the head voyage charterparty. CMI gave notice of exercise of its contractual lien over the Cargo on 17 June 2015.[note: 5]Thereafter, FOC, Cingler, CER and Adani Enterprises communicated on a without prejudice basis in order to reach a settlement. Talks broke down and FOC filed OS 625 on 2 July 2015. 17     As at 25 June 2015, Mr Baek affirmed that the total amount of freight due from Cingler amounted to US$431,756 (on the basis of Paradip as the discharge port).[note: 6]Additional sums subject to the lien were detention charges and other running expenses that were accruing and recoverable from Cingler. Detention charges were incurred as a result of Cingler’s failure to nominate a legitimate discharge port until 23 May 2015. 18     In light of Cingler’s breaches of the head voyage charterparty, FOC, in accordance with the dispute resolution mechanism thereunder, issued a Notice of Arbitration to Cingler. However, Cingler did not respond to the Notice of Arbitration or appoint an arbitrator and the time for doing so expired on 22 July 2015. 19     As of June 2015, other creditors have filed winding up applications against Cingler. On 3 July 2015, Cingler obtained a court order to stay proceedings because of a scheme of arrangement under s 210 of the Companies Act (Cap 50, 2006 Rev Ed). By consent, leave of court was granted on 4 August 2015 for OS 625 to continue against Cingler (see Summons No 3749 of 2015 in Originating Summons No 627 of 2015). 20     Mr Tan explained that Cingler did not pay freight to FOC because CER had yet to make payment for the shipment. On the other hand, Mr Rehman explained in his affidavit that CER had not paid the freight due to Cingler for the shipment of the Cargo for two reasons. First, there was running account between CER and Cingler due to the long running relationship between the parties, and in view of the running account, Cingler had not demanded payment of freight from CER. The second reason was related to a different dispute concerning theAeolian Glory, but CER alleged that Cingler was involved in that as well (see [4] above).",
        "The issues in OS 625": "21     FOC’s assertion of a contractual lien was over cargo that belonged to CER as shipper and holder of the “To Order” Bill of Lading for unpaid freight and other sums. In other words, the difficulty in the present case lies in the fact that FOC is seeking to claim the benefit of a contractual lien on cargo against CER with whom it has no contract. Before me, CER’s focus was simply on its contention that the Lien Clause of the head voyage charterparty was not incorporated into the Bill of Lading because the parties intended to incorporate the March time charter. In contrast, FOC’s case is that the charterparty referred to in the Bill of Lading is the head voyage charterparty and not the March time charter or the sub voyage charter between CER and Cingler. 22     Thus, the threshold question of whether or not FOC had a contractual right of lien over the Cargo involved an inquiry into which of the two charters was incorporated into the Bill of Lading. If the head voyage charterparty was incorporated, then the Lien Clause would be a term of the Bill of Lading. A related question would be the nature of FOC’s right of lien and whether FOC’s right of lien was an “asset” which could be properly preserved by an order for sale of the Cargo under s 12A(4) read with s 12(1)(d) of the IAA. As stated, the purpose of the sale was to preserve the value of the Cargo and, in turn, the security represented by the contractual lien over the Cargo pursuant to the Lien Clause. For avoidance of doubt, I should mention the hearing proceeded on the basis that the Cargo belonged to CER and that physical possession of the Cargo was with CMI.",
        "Incorporation of the Lien Clause": "23     The starting point is the conditions of carriage printed on the Bill of Lading which states: the “terms and conditions, liberties and exceptions of the Charter Party … including the Law and Arbitration Clause” are incorporated. Furthermore, the face of the Bill of Lading states in two places: “Freight payable as Per Charterparty”, but the date of this charterparty was not inserted. 24     As stated earlier, the March time charter and the head voyage charterparty provided for English law as the governing law. Even though the sub-voyage charter had not been produced before the court, it appeared to be in Gencon 1994 Form and it would be governed by English law. Counsel for FOC, Ms Vivian Ang (“Ms Ang”) explained that FOC had filed the affidavit of its expert witness on English law, Mr Michael Coburn QC (“Mr Coburn”), to elucidate the position under English law. It is worth noting that the parties’ were prepared to proceed on the basis that English law governed the question of incorporation. 25     Mr Coburn opined that under English law, the charterparty referred to and incorporated into the Bill of Lading was the head voyage charterparty between FOC and Cingler. He cited the following passage from Cookeet al,Voyage Charters(Informa Law, 4th Ed, 2014) (“Voyage Charters”) at para 18.62 to support his view: It not infrequently happens that a head time charterer voyage charters the vessel on particular freight, demurrage and lien terms and then the sub-charterer in his turn sub-voyage charters her on different terms. Where a bill of lading is issued in such circumstances and is silent as to the identity of the charterparty whose terms are to be incorporated, it is submitted that ... for practical reasons, the incorporated charterparty is the head voyage charter and not the sub-voyage charter. Although it might be said that the shipowner is not a party to the head voyage charter, and although the shipper may well be the sub-sub-charterer, the time charterer will usually have the lawful authority of the shipowner, as well as the commercial incentive, to sign and issue the bill of lading or to direct the master to sign and issue bills of lading. It is also the time charterer who has the lawful power to direct the shipowner to exercise carrier’s right under the bill of lading, in particular a lien, as his trustee. In practice, it may also be said that the shipper has the remedy in his own hands, for he is the person who usually prepares the bill of lading and presents it for signature and, if he omits to identify the charterparty, he has only himself to blame. 26     This analysis inVoyage Chartershas also been accepted as correct by Mr Justice David Steel inXiamen Xindaan Trade Co Ltd v North China Shipping Co Ltd[2009] EWHC 588 (“The Michalakis”) at [26]–[27]. 27     I now come to CER’s argument that the Bill of Lading incorporated the March time charter. To support its contention, CER relied on a signed letter of authority from the Master that authorised the Agent to sign bills of lading on his behalf in accordance with instructions. For present purposes, the relevant instruction is found in para 4 of the letter:[note: 7] Any reference in the bill(s) of lading to a charter party shall, in the absence of contrary instructions, show the date of the head charter party between the Owners of the vessel and their time charterers, namely19-March-2015. If contrary instructions are given, you are to seek guidance from me or from Owners before inserting a different date in the bill of lading. [emphasis in original] 28     Ms Ang submitted that notwithstanding what was stated in the letter of authority to the Agent, the charterparty being referred to in the Bill of Lading was the head voyage charterparty between FOC and Cingler. In this connection, she pointed out that the word “freight” (as opposed to “hire”) was used in the Bill of Lading which indicated that the reference was to a voyage (and not a time) charter. Ms Ang’s submission is borne out by Sheen J’s observations inItex Itagrani Export SA v Care Shipping Corporation and others (The “Cebu”) (No 2)[1990] 2 Lloyd’s Rep 316 at 321: By 1979 [ie, the time upon which the parties contracted], I am satisfied, the vocabulary of the shipping trade had for many used the word “hire” for sums payable under time charters, and restricted the word “freight” to voyage charter-parties and bills of lading. No doubt there was not complete uniformity of usage but about the general understanding of the meaning of those words there cannot be much doubt. In one of the passages which I have quoted from Mr Justice Lloyd’s judgment he said that “in a strict sense freight means bill of lading freight and freights earned under a voyage charter-party. My view on the materials deployed in this case is that this had been the ordinary or popular meaning of the word “freight” for many years. And in 1979 the head charter was made with reference to that specialized vocabulary of the shipping trade. 29     I noted that Mr Coburn did not deal with the letter of authority in his opinion. Ms Ang was requested to seek clarification of Mr Coburn’s opinion, but she could not reach Mr Coburn who was on vacation. Mr Timothy Young QC (“Mr Young”) stood in to give his advice on the letter and on CER’s point. In Mr Young’s opinion, clauses 8 and 60 of the March time charter afforded the Master a very narrow right to refuse to sign a bill of lading. Clause 8 of the March time charter reads:[note: 8] That the Captain shall prosecute his voyages with utmost despatch, and shall render all customary assistance with ship’s crew and boats. The Captain (although appointed by the Owners), shall be under the orders and directions of the Charterers as regards employment and agency; and the Charterers are to load, stow, tally, trim, secure, unsecure, lash/unlash, chock and discharge the cargo at their expense under the supervision of the Captain, who is to sign Bills of Lading for cargo [as] presented, in conformity with Mate’s and Tally Clerk’s receipts. 30     Clause 60 then provides that FOC would be liable to indemnify CMI if the bills of lading that were signed were not in strict conformity with the Mate’s or Tally Clerk’s receipt. Clause 60 also further stated that parties agreed to use only the CONGENBILL 1994 bill of lading form. It was Mr Young’s opinion, and Ms Ang’s submission, that as the Master had, under the March time charter, no right to decline to sign the Bill of Lading (which was in CONGENBILL 1994 with typical terms) as presented, any restrictions in his letter of authority would be ineffective and could be characterised as a breach of the March time charter (seeThe Nanfri[1979] 1 Lloyd’s Rep 201). Ms Ang argued that there was therefore no departure from the standard position as set out inVoyage ChartersandThe Michalakis, and the charterparty incorporated in the Bill of Lading was the head voyage charterparty. The case ofThe “Berkshire”[1974] 1 Lloyd’s Rep 185 was also referred to. In that case, Brandon J commented on a clause almost identical to clause 8 of the March time charter in the following terms (at 188): The effect of such a clause in a charter-party is well settled. In the first place, the clause entitles the charterers to present to the master for signature by him on behalf of the shipowners bills of lading which contain or evidence contracts between the shippers of goods and the shipowners, provided always that such bills of lading do not contain extraordinary terms or terms manifestly inconsistent with the charter-party; and the master is obliged, on presentation to him of such bills of lading, to sign them on the shipowner’s behalf. In the second place, the charterers may, instead of presenting such bills of lading to the master for signature by him on behalf of the shipowners, sign them themselves on the same behalf. In either case, whether the master signs on the directions of the charterers, or the charterers short-circuit the matter and sign themselves, the signature binds the shipowners as principals to the contract contained in or evidenced by the bills of lading. 31     As Ms Ang explained, the words “as presented” are important. It is that term rather than the Master’s letter of authority, which defined his authority to issue a bill of lading on behalf of the shipowner who had agreed in clause 60 of the March time charter to use and issue only the CONGENBILL 1994 bill of lading form. This commitment necessarily contemplated a Gencon form charterparty with “freight” terms as distinct from a time charter with its “hire” terms. I accepted that the position as stated by Mr Coburn and Mr Young was the position at English law based on the facts of this case, and accordingly, the charterparty that was incorporated in the Bill of Lading was the head voyage charterparty between FOC and Cingler. This was also the position which CMI took through its counsel, Mr Edgar Chin (“Mr Chin”).[note: 9]",
        "FOC’s claim to a contractual lien to assert an interest in the Cargo": "32     A question of importance was whether FOC (or alternatively, CMI for FOC’s benefit) could exercise a lien over the Cargo for unpaid freight and other sums owing to FOC by Cingler. In Mr Coburn’s opinion, as against Cingler, the Lien Clause in the head voyage charterparty (see [10] above) qualified FOC’s obligation as carrier under the head voyage charterparty to discharge the Cargo. Thusvis-à-visCingler, it was Mr Coburn’s view that FOC was entitled to exercise a lien and to refuse to discharge the Cargo. Put simply, the Lien Clause gave FOC the right to detain by directing CMI to retain the Cargo and not to discharge it until the sums outstanding were paid. Presumably CMI would have to comply with FOC’s instructions under clause 8 of the March time charter. It seems to me that as physical possession of the Cargo was with CMI, the right to detain the Cargo by directing CMI not to discharge the same was all it could do. This right as described is strictly not the same as the conventional understanding of a security interest granted by a “lien?”. Hence, it was inaccurate for FOC to claim to assert a contractual lien over the Cargo because it was CMI, the owner, and not FOC, the time charterer, which was in possession of the Cargo. I will come to Mr Coburn’s reasoning on this point shortly. At the same time, the effect of the Lien Clause gives FOC as equitable assignee the right to require payment from CER of money which is owned by CER to Cingler under the sub-charter. FOC had “intercepted” the sub-freight because CER has not paid it over and sub-freight remains unpaid. In this regard, FOC issued a Notice of Lien on Sub-Freight to CER and Cingler on 29 April 2015.[note: 10] 33     To elaborate on [32] above, Mr Coburn interpreted the Lien Clause as giving FOC the right to direct CMI to retain the Cargo and not to discharge it until the sums secured by CMI’s lien are paid. In Mr Coburn’s view, “[a]ny other interpretation is liable to lead to absurdity, since it cannot have been intended that Cingler should have the right (as against FOC) to insist on discharge without first having paid freight and other sums due” under the head voyage charterparty. Mr Coburn also noted that the Lien Clause was incorporated into the Bill of Lading and it was CMI who could under the Bill of Lading lawfully assert a contractual lien over the Cargo as it had physical possession of the Cargo. Hence, in so far as other parties apart from Cingler were concerned, Mr Coburn stated that FOC “probably has neither any relevant rights nor any relevant obligations, since FOC is not a party to the [Bill of Lading]”. The upshot of Mr Coburn’s analysis is that FOC’s right to detain the Cargo under the head voyage charterparty is not the same as the conventional understanding of a security interest granted by a “lien” as that right depends on possession of the Cargo before the lien can be exercised. 34     Mr Coburn was alive to FOC’s limited right to detain. He opined that CMI would have to exercise its lien on the Cargo for the benefit of FOC. In this connection, Mr Coburn repeated the statement inVoyage Chartersquoted at [25] above that the shipowner (ie, CMI) was exercising its lien rights as trustee for the time charterer, FOC. In this context, by the affidavit of Mr Lambros Hilas (“Mr Hilas”), an officer of CMI, Mr Hilas deposed that CMI was exercising its lien over the Cargo for FOC’s benefit given that freight and other amounts due to FOC under the head voyage charterparty have not been paid by Cingler.[note: 11] 35     I should add here that Mr Coburn cited in a footnote in his report the following passage found inVoyage Charters. The commentary on the term “Freight payable as per charterparty” at para 13.39 is helpful. It reads: The purpose of this term is to enable the shipowner to have the legal right as against the bill of lading holder to receive freight which is due under the bill of lading, where he is a party to it. The freight may be under a charter to which he is a party or under a sub-charter to which he is not a party, but between the shipowner and the bill of lading holder, it is immaterial that the former is not a party to the charterparty thus incorporated. The shipowner may require the payment for one of two principal reasons: he may require it as security for a sum which is due to him under a charterparty,or he may seek and receive it for the benefit of a charterer who has discharged his obligations to the shipowner but who may be owed freight under a sub-charter or booking note which is incorporated. As between the shipowner and the bill of lading holder,it is enough that the former has the legal right to the freight, whoever else may haveequitable or beneficial rightsto it in the shipowner’s hands. However, where the shipowner does not actually receive payment of the freight, the question arises whether he is under an obligation to the charterer to take steps to recover it. [emphasis added in italics and in bold italics] The question posed in last sentence of the passage quoted does not arise here as CMI had exercised its contractual lien (as trustee for the benefit of FOC) under the Bill of Lading over the Cargo against CER. 36     Finally, Mr Coburn also opined that the lien could be exercised over the entire Cargo even if the amount claimed was less than the value of the Cargo, and irrespective of who owned the Cargo. There were no hard and fast rules as to where the lien had to be exercised. In the absence of contradictory evidence on English law, I accepted Mr Coburn’s and Mr Young’s views as stating the position at English law. Therefore, evidentially as a fact, FOC had: (a) a right to postpone discharge and delivery of the Cargovis-à-visCingler; and (b) an equitable or beneficial right derived from CMI’s exercise of its lien (as trustee for FOC’s benefit) under the Bill of Lading over the Cargo against CER. In respect of the latter, the extract quoted above at [35] demonstrates that a shipowner, who has been paid, may nonetheless “seek and receive” freight under a bill of lading for the benefit of a charterer. Such freight where received is beneficially owned by the charterer. Conversely, where freight is sought through the exercise of a lien but not received, the shipowner’s exercise of the lien right is, as stated at the extract quoted above at [19], as the charterer’s trustee. CMI’s exercise of its right as trustee vests in FOC an equitable right in the benefit of the security in the Cargo to the extent of CMI’s entitlement to lien the Cargo (hereafter referred to as “FOC’s derivative right”). For ease of reference, in the discussion which follows, these two combined rights in the Cargo will be termed collectively as “FOC’s right to detain possession”.",
        "Conditions to be satisfied under s 12A(4) of the IAA": "37     Section 12A of the IAA gives the court the power to order interim measures in aid of international arbitrations, whether or not the place of arbitration is in the territory of Singapore. The interim measures that the court may order under s 12A may be found in s 12(1)(c) to (i) of the IAA. For ease of reference, I set out the relevant provisions here: Powers of arbitral tribunal 12.—(1) Without prejudice to the powers set out in any other provision of this Act and in the Model Law, an arbitral tribunal shall have powers to make orders or give directions to any party for — … (c) giving of evidence by affidavit; (d) thepreservation, interim custody or sale of any property which is or forms part of the subject-matter of the dispute; (e) samples to be taken from, or any observation to be made of or experiment conducted upon, any property which is or forms part of the subject-matter of the dispute; (f) the preservation and interim custody of any evidence for the purposes of the proceedings; (g) securing the amount in dispute; (h) ensuring that any award which may be made in the arbitral proceedings is not rendered ineffectual by the dissipation of assets by a party; and (i) an interim injunction or any other interim measure. Court-ordered interim measures 12A.—(1) This section shall apply in relation to an arbitration — (a) to which this Part applies; and (b) irrespective of whether the place of arbitration is in the territory of Singapore. (2) Subject to subsections (3) to (6), for the purpose of and in relation to an arbitration referred to in subsection (1), the High Court or a Judge thereof shall have the same power of making an order in respect of any of the matters set out in section 12(1)(c) to (i) as it has for the purpose of and in relation to an action or a matter in the court. (3) The High Court or a Judge thereof may refuse to make an order under subsection (2) if, in the opinion of the High Court or Judge, the fact that the place of arbitration is outside Singapore or likely to be outside Singapore when it is designated or determined makes it inappropriate to make such order. (4)If the case is one of urgency, the High Court or a Judge thereof may, on the application of a party or proposed party to the arbitral proceedings, make such orders under subsection (2) as the High Court or Judge thinksnecessary for the purpose of preserving evidence or assets. (5) If the case is not one of urgency, the High Court or a Judge thereof shall make an order under subsection (2) only on the application of a party to the arbitral proceedings (upon notice to the other parties and to the arbitral tribunal) made with the permission of the arbitral tribunal or the agreement in writing of the other parties. (6) In every case, the High Court or a Judge thereof shall make an order under subsection (2) only if or to the extent that the arbitral tribunal, and any arbitral or other institution or person vested by the parties with power in that regard, has no power or is unable for the time being to act effectively. (7) An order made by the High Court or a Judge thereof under subsection (2) shall cease to have effect in whole or in part (as the case may be) if the arbitral tribunal, or any such arbitral or other institution or person having power to act in relation to the subject-matter of the order, makes an order which expressly relates to the whole or part of the order under subsection (2). [emphasis added] 38     There was no question of the court’sin personamjurisdiction over the parties. Cingler is a Singapore incorporated company and is present in this jurisdiction. CER had submitted to jurisdiction having intervened in OS 625. However, the Cargo in question was on board theCorinnawhich was lying outside the last nominated port in international waters.Ms Ang was queried whether the court would have the jurisdiction or power to grant the order for the sale of the Cargo under s 12A(4) of the IAA. 39     The main legislative intention behind the enactment of s 12A was to give the court powers over assets and evidence situatedin Singaporeand to make orders in aid of arbitrations that wereseated in Singapore and overseas. However, I agree with Ms Ang that if the seat of the arbitration is in Singapore and the assets are overseas, the court would have the power to protect or preserve assets and evidence situated outside Singapore. Indeed, the language of s 12A is wide enough to confer such a power on the High Court. This exercise of power to grant interim measures is not unlike the exercise of the court’s powers and jurisdiction in granting an injunction that covered assets outside Singapore provided the court hasin personamjurisdiction over the parties to the local proceedings. 40     In the present case, all parties who had an interest in the Cargo were present before the court and were amenable to the court’s jurisdiction. CMI, Cingler and CER had legal representation at the hearings. Two other points are also noteworthy. First, the Cargo and theCorinnawere, at the time of the hearing of OS 625, in international waters outside the last nominated port and as such it was outside the jurisdiction of any court. Thus, the grant of the sale order would not have interfered with the jurisdiction of any court. Second, an order for the sale of Cargo that was not situated within a country’s jurisdiction was not without precedent. InStelios B Maritime Ltd v Ibeto Cement Co (The “Stelios B”)(2007) 711 LMLN 2 (“The Stelios B”) Tomlinson J ordered the sale of the cargo although the vessel was in Nigerian territorial waters or shortly outside of it. The application was made under s 44 of the English Arbitration Act 1996 (c 43) (UK) (“the English Act”) the language of which is very similar to s 12A. In fact, s 44(3) of the English Act isin pari materiawith s 12A(4) of the IAA. 41     I now turn to the requirements of s 12A(4) of the IAA. The applicant has to satisfy the court on the following matters: (a) the application is an urgent one; and (b) that an order would be necessary for the purpose of preserving assets (ie, under s 12(1)(d), the property which is or forms part of the subject-matter of the dispute). I shall first deal with the issue of whether a right of lien over the Cargo was an “asset” which could be preserved under s 12A(4) and whether this could be preserved through an order for sale of the Cargo, before turning to whether such an order was necessary in the circumstances.",
        "Was FOC’s right to detain possession an “asset” within the meaning of s 12A(4)?": "42     The Court of Appeal inMaldives Airport Co Ltd v GMR Male International Airport Pte Ltd[2013] 2 SLR 449 (“Maldives Airport”) held at [39] that while the term “assets” under s 12A(4) of the IAA was drafted widely for the purpose of including choses in action or rights under a contract, this was limited to contractual rights that were capable of being preserved. It would be necessary to distinguish between contractual rights that could and were ordinarily preserved by way of an order for specific performance or an injunction, and contractual rights which, if breached, would give rise to a secondary obligation to pay damages (seePhoto Production Ltd v Securicor Transport Ltd[1980] AC 827 at 848-­849). On the facts ofMaldives Airport, the Court of Appeal held that contractual rights such as the right to be served a notice, or the right to perform the contract were not capable of being preserved under s 12A(4). On the flip side, the Court of Appeal was of the view that contractual rights in land (in that case, a lessee’s right to occupy, use and enjoy the land for a term) are rights which are capable of coming within the meaning of “asset” in s 12A(4). The touchstone of the distinction between the two appears to lie in whether damages would be an adequate remedy for the breach. 43     Here, the right(s) which FOC requested this court to preserve was couched as FOC’s contractual right to a lien over the Cargo. I have already explained that FOC’s right to detainvis-à-visCingler is not “security” in the conventional sense but is in effect a mechanism to enforce payment of the sums due to FOC under the head voyage charterparty. The conventional understanding of a security interest was explained by Browne-Wilkinson VC (as he then was) inBristol Airport plc v Powdrill[1990] Ch 744 at 760: Security is created where a person (“the creditor”) to whom an obligation is owed by another (“the debtor”) by statute or contract,in additionto the personal promise of the debtor to discharge the obligation, obtains rights exercisable against some property in which the debtor has an interest in order to enforce the discharge of the debtor's obligation to the creditor. [emphasis added] 44     The incorporation of the Lien Clause in the Bill of Lading gave to CMI a contractual lien in respect of goods in its possession. A contractual lien is in the nature of security and may be defined as a right to retain possession of goods or documents belonging to another until all claims against that other are satisfied. A lien may exist at common law or, as in this case under the Bill of Lading, as a term of an agreement (see Alfred H Silvertown, The Law of Lien (Butterworths, 1988) at p 19; Re Cosslett (Contractors) Ltd [1988] 1 Ch 495 at 508). This security interest is as an additional right under a contract to obtain payment, is one which is capable of being preserved under s 12A(4) of the IAA. Through CMI’s exercise of its contractual lien, the Cargo was detained and discharge and delivery was postponed. 45     InCastleton Commodities Shipping Company Pte Ltd v Silver Rock Investments[2015] EWHC 2584 (Comm) (“Castleton Commodities”), the time charterer who was owed freight by the voyage charterer asserted a right to direct the vessel not to unload the cargo. Waksman J held that this was a “similar but not identical right” to a lien. It was implicit in the case that such a right, though not a “lien” in the strict sense, was an “asset” within the meaning of the English equivalent of s 12A(4) of the IAA. 46     In the present case, the FOC’s right to detain possession of the Cargo, that is to say its right as against Cingler under the head voyage charterparty to postpone discharge and delivery of the Cargo until it received payment coupled with its derivative right in the benefit of CMI’s security in the Cargo (see [36] above) culminated in and crystallised FOC’s right to detain possession. Both of these rights were and of themselves choses in action, and taken together amounted to an interest similar, though not equivalent to a security interest like CMI’s contractual lien, which fortunately for FOC, CMI had willingly exercised as trustee for FOC’s benefit. FOC’s right to detain possession is a chose in action and qualifies as an “asset” within the meaning of s 12A(4) of the IAA. Equally, CMI’s contractual lien is also a chose in action and qualifies as an “asset” within the meaning of s 12A(4) of the IAA. I will now turn to discuss this in the context of the sale application.",
        "Could the right to detain possession of the Cargo be preserved through an order for sale of the Cargo?": "47     The next point is whether the right to detain possession of the Cargo could be preserved through an order for sale of the Cargo. At first glance, an order for the sale of the Cargo appears inconsistent with the concept of a right to detain which typically does not give rise to a right to sell unless expressly provided for in the contract. This was also a matter which Mr Coburn pointed out; in this regard, he observed that the lack of a substantive contractual right of sale would not preclude the court’s exercise of a discretionary power of sale. 48     Ms Ang submitted, relying onCetelem SA v Roust Holdings Ltd[2005] 1 WLR 3555 (“Cetelem”), that the “asset” in question which FOC was seeking to preserve was thevalueof the Cargo and not the Cargoper se. She drew from the comments of Clarke LJ inCetelemat [65] where he discussed the type of orders a court could make under s 44(3) of the English Arbitration Act ( which isin pari materiato s 12A(4) of the IAA): There was some discussion in the course of the argument as to whether the court could, for example, order the sale of a perishable cargo under section 44(3) in a case of urgency on the footing that they were “goods the subject of the proceedings within section 44(2)(d)”. … [I]n my opinion, if the court thought that it was necessary so to order in order to preserve the value of the fish, which would otherwise be lost or diminished by putrefaction, the court could properly conclude that the order was necessary for the purpose of preserving assets. The asset would be thevalue of the fishrather than the fish itself. [emphasis added] 49     Ms Ang also drew my attention to a recent English case, the facts of which bear close resemblance to the present case. InCastleton Commodities, the cargo was being carried on the vessel, theMonarch, from Mexico to China. The claimant had entered into a time charterparty with the long-term charterer of theMonarchand had voyage chartered the vessel to the defendant, the immediate purchaser of the cargo. The defendant failed to pay freight, dead freight, demurrage and other charges to the claimant, which caused the claimant to wait outside of Chinese waters to give effect to its rights, being its lien over the cargo. The English court had, on 16 May 2013, allowed the sale of the cargo. InCastleton Commodities, the claimant applied for the withdrawal of the proceeds of sale. The claimants proffered two bases for its application. First, it had been adjudicated a judgment creditor as against the defendant through the recognition and enforcement of an arbitral award. The second basis was its right of “lien” over the cargo pursuant to either: (a) a right to direct the vessel not to unload the cargo; or (b) the assignment of the shipowner’s lien rights to the claimant via the bill of lading. It is in respect of this second basis that the comments of Waksman J sitting in the English High Court are noteworthy (at [9]): … It is said that [the claimant] is the beneficiary of a lien conferred by the voyage charterparty as against [the defendant], although in practice, it is well established that that lien would not entitle it to take possession of the cargo as such as it is a mere time charterer.Instead, it would have a similar but not identical right, which is to direct the vessel, effectively, not to unload the cargo.In truth this is what happened here.[The claimant] is also the beneficiary by way of assignment of a true lien in favour of the carrier and as against the shipper … pursuant to the Bill of Lading.In … the skeleton argument, [counsel for the claimant] sets out, convincingly, a route by which the holder of a lien acquires the rights in proceeds of sale which are the subject, effectively, of the exercise of the rights of lien.I am satisfied that in circumstances such as this, the rights of lien, which pre-existed the sale, can be said to have been transformed into a right to the proceeds of sale of the cargo concerned in the hands of [the claimant] or, as it were, are followed into those proceeds… In one sense, of course, this is reflected by the Order which refers to the proceeds of sale as, effectively, representing the cargo immediately prior to the sale. … [emphasis added in italics and bold italics] 50     Waksman J accepted that either basis, in itself, was sufficient to show that the claimant was entitled to the proceeds of sale, and granted the order for the payment of the sums out to the claimant. It was implicit inCastleton Commoditiesthat the judge who granted the order for the sale of the cargo would have considered that the claimant’s lien right could be preserved through an order for sale. CMI had not acted any differently from the carrier inCastleton Commoditieswho had “assigned” its right of lien to the time charterer. In the present case, CMI had exercised its right of lien over the Cargo on for FOC’s sole benefit. CMI through Mr Chin supported to sale application and CMI, through Mr Hilas’ affidavit, expressed a willingness to abide by any sale order of this court made in OS 625. 51     Another case of note isThe Stelios B, where under the terms of a Gencon form for a voyage charter from China to Nigeria which were incorporated into the bill of lading, the shipowners were given a lien on the cargo (being cement) for demurrage and all other amounts due under the charter. The vessel arrived at Nigeria but was unable to unload the cargo as the import licence of the cargo owners had been revoked by the Nigerian authorities. After some months, the owner terminated the charterparty and the bill of lading contracts due to the inability and/or refusal of the charterers and cargo interests to discharge the cargo. The shipowners also applied to court under s 44 of the English Act for a sale of the cargo. The cargo interests opposed the sale on the basis that they should be given the opportunity to sell the cargo to an interested purchaser. 52     Tomlinson J held that as the sale to the interested purchaser would require at least a month to be finalised, the demurrage and other amounts that would continue to accrue would erode the value of the cargo such that the cargo interests would have no real residual financial interest in the cargo. Furthermore, there was powerful and uncontroverted evidence that the cargo was deteriorating. In the circumstances, Tomlinson J favoured a sale of the cargo. 53     Finally, I refer to a decision of Chan Sek Keong J (as he then was) inEmilia Shipping Inc v State Enterprise for Pulp and Paper Industries[1991] 1 SLR(R) 411 (“Emilia Shipping”) where Chan J, although recognising that a lien over cargo did not confer a right of sale, recognised that the court had the power to order the sale of the cargo under O 29 r 4 of the Rules of Supreme Court 1970 (“1970 RSC”), which provided for the sale of moveable property the subject-matter of an action “which is of a perishable nature or likely to deteriorate if kept or which for any other good reason is desirable to sell forthwith”. Chan J took into account these reasons for allowing the sale of the cargo (being wood pulp): (a)     the refusal and/or inability of the defendants, who were the notify party on the bill of lading, to provide security; (b)     the market price for wood pulp was falling; and (c)     the plaintiff shipowner had incurred heavy storage and other charges in storing and protecting the cargo. 54     Order 29 r 4 of the 2014 ROC (which is the same as O 29 r 4 of 1970 RSC) is similar to s 12A(4) of the IAA in that it gives the court the power to make orders of sale. The rationale behind O 29 r 4 is that where goods are perishable, or likely to deteriorate if kept, the value of the movable property the subject-matter of the proceedings would be lost. This rationale fits squarely into the intention behind s 12A(4) read with s 12(1)(d) of the IAA, which is to preserve the property which is or forms part of the subject-matter of the dispute that is or will be referred to arbitration. InEmilia Shipping, Chan J held that the cargo was the subject matter of the proceedings as it formed the subject-matter (ie, the lien) of the claims for freight. This was squarely applicable in the present case – the dispute between FOC and Cingler was for unpaid freight and other sums, and the arbitration would determine Cingler’s liability for such claims and the validity of FOC’s exercise of its right to detain possession including the assertion of a lien over the Cargo by CMI for the benefit of FOC for such claims. 55     Thus, on the basis of these authorities, and keeping in mind the fact that FOC was asserting a right that is similar in effect to (though not the same as) a lien, I concluded that FOC right to detain possession could be effectively preserved through an order for sale. FOC’s right to detain possession would then be transferred to the proceeds of sale which (as prayed for) would be held in court in Singapore until further order by the arbitral tribunal after it has been constituted.",
        "The urgency and necessity for the order of sale": "56     Lastly, I come to the factors that demonstrate the urgency and necessity for the order of sale. Ms Heera Kang, the General Manager of FOC, stated that: (a)     As the crew had been on board the vessel for almost four months, some of the crew were falling ill. (b)     There was a lack of fresh food, water and medical supplies. (c)     Overheating of the Cargo had been detected, and there was risk that the coal would self-ignite if it continued to remain in the Vessel’s holds. (d)     The monsoon season at the Bay of Bengal (where the vessel was situated) was exacerbating the already dire situation. 57     I should add that Mr Baek had also deposed to the fact that some of the crew members’ contracts have long expired and they have not been repatriated.[note: 12]I also quote from Mr Hilas’ affidavit (sworn on 29 June 2015):[note: 13] The Vessel has now been in the high seas for more than 70 days and she is badly in need of supplies and the morale of the crew is very low. They have long run out of fresh food provisions on board such as vegetables and fruits and are also out of medicines. One crew member in particular is diabetic and is in need of insulin supplies. There is a lack of fresh water on board and there are serious hygiene issues. More bunkers have to be consumed as well in order to distill the seawater to fresh water. Many of the crew contracts have long expired and the crew need to be repatriated. They have threatened to report CMI to [the International Transport Workers’ Federation] and to take legal action. 58     CER, through Mr Rehman’s affidavit, attempted to contradict this evidence in two ways. First, Mr Rehman opined that the coal aboard the vessel was unlikely to ignite, and that the weather conditions around the Indian coast were not as dire as FOC had characterised. However, Mr Rehman, for good reasons, did not comment on the crew’s welfare. The Master is the person on the spot so to speak and his voice carried much weight. I gave consideration to the Master’s comments on the condition of the Cargo, the living conditions on board for the crew, and the safety of the vessel. The Cargo could not remain on board indefinitely. There was also evidence submitted by FOC that the world coal market was on a down trend although there were signs of rising prices in Australia between April and June 2015. FOC’s expert, Mr Peter Sceats (“Mr Sceats”) opined that it did not follow from the rise in prices in Australia that the value of the Cargo would have arisen at a similar rate. He was also of the opinion that it could be assumed that the value of the Cargo was not affected by the global down trend or the rising prices in Australia in the time window set out above.[note: 14] 59     In my view, this was a clear case of urgency for the reasons outlined. I was also mindful that the arbitral tribunal had not yet been constituted. 60     Besides the element of urgency, an order made under s 12A(4) of the IAA must also be one that is “necessary for the purpose of preserving evidence or assets”. InMaldives Airport, the Court of Appeal held that an order under s 12A(4) would not be “necessary” if other reasonably available alternatives for securing the evidence or asset existed (at [44]). 61     I was of the view that an order for sale was “necessary” in order to preserve FOC’s right to detain possession of the Cargo. There were no other reasonably available alternatives. I accept the evidence of FOC’s Indian law expert that Indian law would not recognise CMI’s lien rights if the Cargo was discharged in India. I also accept his opinion that as the dispute between FOC and Cingler was to be arbitrated in Singapore, the Indian courts would not allow CMI to preserve the lien over the Cargo, whether by way of sale or otherwise. Without an effective order preserving the parties’ rights, CMI and/or FOC would continue to detain the Cargo on board thus prolonging the grim situation on board theCorinna. Notably, CER did not present the Bill of Lading for delivery of the Cargo. This was because CER wanted to sell the Cargo and indorse the Bill of Lading to the buyer. This fact was evident from its desire to seek an adjournment for negotiations and its anxiety was that FOC might not sell the Cargo at the best price possible. 62     On the condition of the Cargo, there was a non-negligible risk that the value of the Cargo would be steadily diminished over time. This coupled with the increase in expenses in maintaining the Cargo aboard the vessel, may result in a situation where CER retained no residual financial interest in the Cargo and might even abandon the same if the Cargo became commercially worthless. Mr Sceats, a former coal trader and broker, in his expert report estimated that the value of the Cargo was US$1.9m to US$2.5m. His estimate was on the basis of documents and extrapolations from the quality of the coal at the time of shipment. Mr Sceats’ estimations of the value of the Cargo should be contrasted with FOC’s position that Cingler owed it at least US$1.4m with costs and expenses mounting daily. 63     Finally, the necessity of an order for sale was also reinforced by the fact that there was no end in sight to stop this impasse that arose from a confluence of matters. On the one side, there was the effect of the combined exercise of FOC’s and CMI’s rights in relation to the Cargo. On the other side, there is evidence of Cingler’s inability to pay the sums due under the head voyage charterparty given the numerous winding-up applications filed against it. At the same time, there is no evidence that CER had the requisite funds or willingness to make payment into court to obtain release of the Cargo pursuant to an application under O 29 r 6 of the 2014 ROC. Neither did CER intend to take delivery of the Cargo for it had not demanded delivery from CMI. CER’s intention was to sell the Cargo and this was made clear when it twice sought to adjourn the hearing of the sale application. I did not see a real distinction between granting an adjournment for CER to negotiate a sale with the Adani group of companies, and the order of sale sought by FOC; the Adani companies would still be in a position to buy the Cargo in either event. In my judgment, as a fair balance of the respective interests – preservation of the value of the Cargo and the safety of the vessel and crew – and without a satisfactory and reasonably agreed solution in place amongst FOC, Cingler and CER, an order for FOC to sell the Cargo was made. 64     The orders made are set out in [6] above. Costs of the application were adjourned.",
        "Subsequent developments": "65     After I allowed FOC’s application on 5 August 2015, CER filed an application for a stay of execution pending its appeal to the Court of Appeal. CER’s Notice of Appeal was filed on 19 August 2015. However, the stay of execution application was filed on 1 September 2015, close to one month after the Order of 5 of August 2015. Before this stay application could come up for hearing before me, CER was informed that the Cargo had been sold. Leave to withdraw the application for a stay of execution was granted by the Assistant Registrar. I was informed by the Assistant Registrar that CER decided not to apply for an expedited appeal.  [note: 1]Affidavit of Lambros Hilas, para 24. [note: 2]Affidavit of Lambros Hilas, para 34. [note: 3]1stAffidavit of James Baek, para 23. [note: 4]1stAffidavit of James Baek, para 29. [note: 5]Affidavit of Lambros Hilas, p31. [note: 6]1stAffidavit of James Baek, para 107. [note: 7]1stAffidavit of James Baek, p 140. [note: 8]1stAffidavit of James Baek, page 71. [note: 9]Affidavit of Lambros Hilas, para 11–12. [note: 10]1stAffidavit of James Baek, p189. [note: 11]Affidavit of Lambros Hilas, para 20-21. [note: 12]1stAffidavit of James Baek, para 12. [note: 13]Affidavit of Lambros Hilas, para 29. [note: 14]Expert report of Peter Sceats, para 7(d)."
    }
}