{
    "case_title": "Lee Hsien Loong\n      v\n      Roy Ngerng Yi Ling",
    "ncitation": "[2015] SGHC 320",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       On 7 November 2014, I found that an article entitled “Where Your CPF Money Is Going: Learning From The City Harvest Trial” (“the Article”) written by the defendant was defamatory of the plaintiff. I held that certain words and images in the Article conveyed the meaning that the plaintiff was guilty of criminal misappropriation of the monies paid by Singaporeans to the Central Provident Fund (“the CPF”). I therefore ordered that the defendant be restrained from publishing or disseminating this allegation and any words and/or images to the same effect. I granted interlocutory judgment to the plaintiff with damages to be assessed. This judgment pertains to the assessment of damages payable by the defendant to the plaintiff.",
        "The background facts": "2       The relevant facts are set out at length in my judgment in respect of the plaintiff’s application in Summons No 3403 of 2014 (SUM 3403/2014): seeLee Hsien Loong v Roy Ngerng Yi Ling[2014] SGHC 230 (“LHL v Roy Ngerng”). Nevertheless, for convenience, I set out below the salient facts of the matter. I have also expanded on the acts of the defendant subsequent to the publication of the Article as they are relevant to the issue of the quantum of damages.",
        "The Article": "3       The plaintiff is the Prime Minister of Singapore. He is also the Chairman of GIC Private Limited (“GIC”), which manages the nation’s sovereign wealth fund. The defendant is the owner and writer of the blog “The Heart Truths to Keep Singaporeans Thinking by Roy Ngerng Yi Ling” (“the Blog”). On or about 15 May 2014, the defendant published the Article on the Blog. The parts of the Article which I held to be defamatory are as follows (“the Defamatory Material”): The Heart Truths To Keep Singaporeans Thinking by Roy Ngerng ... Where Your CPF Money Is Going: Learning From the City Harvest Trial Last week, Channel NewsAsia reported about how, “The founder of City Harvest Church Kong Hee and his five deputies [are] accused of misusing millions of church building funds.” According to Channel NewsAsia, “The court accepted that there is evidence to show that the monies were moved from the church to the various firms to generate a false appearance that the church’s investments were redeemed. The judge said the six had been dishonest in the use of the money.” It was also reported that, “Judge See said the auditors’ opinions were “only as good as the information they were given”.” Below is the chart that Channel NewsAsia had created to show the relations of Kong Hee and his five deputies, and the funds that they have misappropriated.   Meanwhile, something bears an uncanny resemblance to how the money is being misappropriated.  Channel NewsAsia had reported that, “The court accepted that there is evidence to show that the monies were moved from the church to the various firms to generate a false appearance that the church’s investments were redeemed. The judge said the six had been dishonest in the use of the money.” “Judge See said the auditors’ opinions were “only as good as the information they were given”.” Meanwhile, the GIC claims that the “GIC manages the Government’s reserves, but as to how the funds from CPF monies flow into reserves which could then be managed by either MAS, GIC or Temasek, this is not made explicit to us.” The GIC also claims that, “The Government, which is represented by the Ministry of Finance in its dealings with GIC, neither directs nor interferes in the company’s investment decisions. It holds the board accountable for the overall portfolio performance.” However, the PAP prime minister, the two deputy prime ministers and the ministers for Trade and Industry and Education also sit on the board of directors. Lee Hsien Loong is the Chairman and Lee Kuan Yew is the Senior Advisor. ... 4       The defendant also published a link to the Article on his Facebook page and The Heart Truths’ Facebook page on that day.",
        "The plaintiff’s letter of demand": "5       On 18 May 2014, the plaintiff issued a letter of demand to the defendant through his solicitors (“the Letter of Demand”), which set out the web address at which the Article could be found and the manner in which the Article was said to be defamatory. The plaintiff demanded that the defendant: (a)     Immediately remove the Article from the Blog. (b)     Immediately remove the links to the Article on the defendant’s Facebook page and on The Heart Truths’ Facebook page. (c)     Publish, at his own expense, within three days of the date of the Letter of Demand, an apology and an undertaking in terms of the draft which was enclosed to the Letter of Demand. The apology and undertaking were to be published without any amendment with prominence on the homepage of the Blog. The said apology and undertaking were to remain on the Blog for the same number of days that the Article remained on it. (d)     Compensate the plaintiff by way of damages. (e)     Indemnify the plaintiff in respect of the costs and expenses which he would have incurred in connection with the matter. 6       The defendant was also requested to confirm in writing that he would comply with the demands and provide an offer for damages and costs within three days from the date of the Letter of Demand. This deadline was subsequently extended to 23 May 2014.",
        "The defendant’s subsequent publications": "7       On 19 May 2014, the defendant published on the Blog an article entitled “I Have Just Been Sued By The Singapore Prime Minister Lee Hsien Loong” (“the 19 May Article”). The Letter of Demand was reproduced on the Blog on the same day. The relevant parts of the 19 May Article are as follows: Hello everyone, I am Roy Ngerng. I am an ordinary citizen in Singapore who believes in speaking up for my country and my fellow citizens. Over the past 2 years, I have written nearly 400 articles about what is happening in Singapore. I have advocated for a fairer and more equal Singapore where every Singapore (sic) and every person in Singapore can be taken care of and protected by our country. As of today, there have been nearly 2 million views on my blog. Today, I received an email from Lee Hsien Loong’s lawyer. I am being sued for defamation. I have tried my best to speak up for my country. I have tried my best to advocate for my fellow citizens. However, today, I am sued by the very government which should be protecting its citizens, such as me. This is disappointing. I have reproduced the [Letter of Demand] in this blog. … … I have exposed many truths about the Singapore government and how they have intentionally planned since 1984 to gun down on Singaporeans. Today, I am finally being silenced. It is disappointing that the government has decided to turn against ordinary Singaporeans. … To know why the government is on my heels, you need to read the following articles to find out why: … It is only right that as citizens, we stand up for our country and we stand up for one another. It is only right that as people, we stand and fight for our freedoms. When faced with tyranny and treachery, we have to remain strong and united, and fight the wrongs that are wrought upon us. For our future, for our rights and for our families and children, we need to stand and fight. It’s time we stand united. It’s time we fight. … 8       On 20 May 2014, the defendant published on the Blog another article that he had written entitled “YOUR CPF: The Complete Truth And Nothing But The Truth” (“the 20 May Article”). It read: Due to impending legal action, there are constraints that I am facing. Whatever my decision [may] be, I will continue to keep my head up high and stay optimistic. I have always believed in justice, fairness and equality and believe that it is a right for everyone to be protected and to live lives that are respected. I will continue to do my part to speak up on behalf of ordinary Singaporeans like us, and to advocate for transparency and accountability. … The government had actually not taken issue with the articles that I have written on the CPF. Today, I am going to show you once and for all how our CPF is being used. By the end of this article, you will know why the CPF is a time bomb waiting to happen. The CPF forms the bedrock of the whole government’s plan to entrap Singaporeans. And when you realise the truth, you will know why it’s time to stand up and fight to protect ourselves. And you will know why I have stuck my head out to do so – if we don’t fight for ourselves, no one else would (sic). …",
        "The defendant’s apology and offer of damages": "9       On 21 May 2014, at around 5.00pm, the defendant removed the Article from the Blog. He, through his then-solicitors, subsequently sent a letter to the plaintiff’s solicitors (“the Apology Letter”) on 23 May 2014. It stated that the defendant recognised “that the Article means and is understood to mean that Mr Lee Hsien Loong, the Prime Minister of Singapore and Chairman of GIC, is guilty of criminal misappropriation of the monies paid by Singaporeans to the Central Provident Fund”. He also stated that “this allegation is false and completely without foundation” and “unreservedly apologise[s]” for causing the plaintiff “distress and embarrassment” by the allegation. The Apology Letter also requested that the plaintiff consider dropping his demand for damages. The defendant also published two articles on the Blog on the same day (“the 23 May Articles”) – one entitled “Letter To Lee Hsien Loong On Defamation Suit And Opportunity For ‘Open Dialogue’” in which the Apology Letter was published; and another entitled “Apology and Undertaking to Lee Hsien Loong” which contained his apology together with an undertaking not to make any further allegations of this nature. 10     The request to the plaintiff to drop his demand for damages was turned down by the plaintiff’s solicitors, who maintained the plaintiff’s right to damages. The defendant was informed of this by his then-solicitors on 24 May 2014 and he published the following on the Blog in an article entitled “Roy Ngerng’s Message: Defamation Suit From Singapore Prime Minister” (“the 24 May Article”): Yesterday, I had put up the apology which the prime minister had demanded and requested not to pay damages. However, I only found out from the news yesterday that the prime minister is still demanding for damages, failing which, he would take me to court. I am disappointed. I would like to reaffirm my stance that the apology was made only in relation to the perceived suggestion of “misappropriation”. The prime minister had not taken issue with the rest of the article with which CPF matters were discussed. I repeat my call for transparency and accountability from the Singapore government to fully disclose to Singaporeans how our CPF is being used. I had also invited the prime minister to an open dialogue on our CPF. However, he has not responded. He only asked for damages. Yesterday, Law and Foreign Affairs Minister K Shanmugam said that, “So if you say, the Prime Minister steals from pension funds, then you better be prepared to prove it.” Today, I have made this video. Please watch it. … 11     That video, to which a link was provided in the 24 May Article, was posted by the defendant on YouTube on the same day (“the Video”). Among other things, he said the following: … Now I am just an ordinary Singaporean who believes that I should speak up for what is right and what I believe in. I have researched on the issue of CPF for two years now. In the article that the Prime Minister had taken issue with, he only took issue with the suggestion of the misappropriation. He did not take issue with any of the other CPF matters that I had brought up. … When the Singapore Prime Minister sued me, he did not take issue with these matters. I did not apologise on this as well. The government has still not responded as to how Singaporeans’ CPF is being used, and to the lack of transparency and accountability to our CPF, it is only right that as Singaporeans we demand transparency and accountability to the use of our CPF and demand that our CPF is returned to Singaporeans. … I am disappointed that the Prime Minister has chosen to use the law against an ordinary citizen like me who believes in speaking up for what is right in Singapore. … We have lived in fear for too long and the government has once against (sic) used the law to prosecute and silence innocent Singaporeans. This is not right. This is…this is not morally right. … Now with this law suit, my character will be discredited, my character will be assassinated. But it is fine for me because my reputation is not something that I am concerned about. What I’m concerned about, is that Singaporeans will be aware of what is going on in Singapore and that we will continue to fight for our freedoms and our rights. On Monday, the Prime Minister will like me to offer how much I would like to pay in damages and costs. I’m only an ordinary Singaporean who has spoken up because I believe in speaking the truth and in speaking up for my fellow Singaporeans. It’s a sacrifice that I have long believed that I need to pay for, that I knew that I was willing to fight for and I knew was worth it. I do not regret what I have done and I’m glad that there’s this opportunity for more Singaporeans to finally be aware of the CPF. …",
        "The subsequent acts of the defendant": "12     On 25 May 2014, the defendant sent an email to members of the international media with the subject heading “Singapore Blogger Sued By Singapore Prime Minister for Defamation” (“the First Email”). The email provided links to some of the articles above, and read: … Last Sunday, the Singapore prime minister sent me a letter of demand for defamation for an article that I had written. He demanded that I take the article down, apologise and pay for damages. … The following Monday, I had to take down the article which the prime minister had taken issue with. I’ve taken the article down but it can still be found on other websites: [link to website] … Tomorrow, I will be required to propose to the prime minister how much to pay him for damages. Based on previous precedence (sic), it is likely that the amount I propose would be inadequate for the prime minister. If so, there is a high likely (sic) that I would be made bankrupt like the previous opposition politicians in Singapore who were made bankrupt. … I am sending this email out to raise awareness of the archaic use of the law of the Singapore government to strike fear among Singaporeans and to politically eliminate opponents. The reason why the prime minister has taken such a strong issue against me is because the retirement funds of Singaporeans is used as the financial bedrock for the government for their investments. The reason why the government wants to use the law to silence me is because I had exposed the truth about our retirement funds, which has exposed them of their deceit. I hope that this email will find you well and you will find the information useful. I am uncertain as to how the prime minister will proceed with his motives tomorrow. I have sacrificed myself to raise awareness of the government’s use of our retirement funds and have been politically prosecuted for it. I believe that what I am doing is right and will continuing (sic) advocating. 13     The First Email was also forwarded on two other occasions on 26 May 2014 to 61 other email addresses belonging to members of the media, of which seven were unable to receive the First Email. 14     At about the same time, the defendant also sent out on three occasions another email entitled “UPDATE: Singapore Blogger Sued By Singapore Prime Minister for Defamation” (“the Second Email”) to the addressees of the First Email, as well as another seven locally-based persons or entities. The Second Email read: … I have received a letter from the Singapore prime minister to remove 4 articles and 1 video, 2 of which dates back to 2012 and 2013 which have completely no relation to the defamation suit. Please see attached the links to the four articles and video. In particular, please look at links number 1 and 2, which refer to the articles in 2012 and 2013. [links to articles, including the 20 May Article and the 24 May Article, and the Video] … There is absolutely no reason for the government to link these articles to the defamation suit, but he has. It is clear that he is trying to eliminate the evidence of the corruption from my blog. … This defamation suit isn’t just aimed at silencing me. They are also using this defamation suit and me to eliminate the evidence of how the government is actually using our retirement funds. I will leave it to you to expose if there is any real corruption. I hope word gets out on this – because the Singapore government’s use of Singaporeans’ retirement funds is clearly suspicious. 15     The letter referred to in the Second Email was likely to have been the letter sent by the plaintiff’s solicitors to the defendant’s then-solicitors on 26 May 2014 (“the 26 May Letter”) highlighting the aggravating nature of the 24 May Article and the Video. The letter also stated that the plaintiff would not claim aggravated damages against the defendant if he immediately took down other articles drawing comparisons between the criminal charges relating to the alleged misuse of funds belonging to the City Harvest Church and the use of the CPF funds (including the 20 May Article and the 24 May Article), and undertook not to “further aggravate the injury and distress” to the plaintiff. The defendant agreed to this request by way of a letter from his then-solicitors dated 26 May 2014. Both these letters were published on the Blog on the same day in an article entitled “Lee Hsien Loong’s New Request To Take Down 4 More Articles And 1 Video” (“the 26 May Article”). 16     Notwithstanding the above, the defendant did not remove the Video but instead restricted its access to a select group of people. Accordingly, the plaintiff’s solicitors sent a letter to the defendant’s then-solicitors on 27 May 2014 pointing out the same. They also sought clarification on the First Email and the Second Email (collectively, “the Emails”), which they viewed to be “further aggravation”. The reply by the defendant’s then-solicitors stated that they had no prior knowledge of those emails, and that the defendant “sincerely and unreservedly apologises for his momentary lapse of judgment”. This was soon followed by another letter from the defendant’s then-solicitors offering $5,000 as damages to the plaintiff. This letter conveying the defendant’s offer was published on the Blog on 27 May 2014 in an article entitled “I Have Proposed The Damages To Lee Hsien Loong For The Defamation Suit” (“the 27 May Article”). 17     This offer was rejected and on 28 May 2014, the defendant’s then-solicitors wrote to the plaintiff’s solicitors, stating: 2. As part of your client’s demand to our client, you have stated … that our client undertakes in writing that he will not aggravate the injury and distress to your client throughsimilar other posts. 3. For the avoidance of doubt,similar other postsshould not be construed as a curtailment of our client’s right to his freedom of expression to write or engage the public on the CPF issue and raise any matters relating to CPF that requires transparency and accountability to the public. 4. Any attempt to curtail our client’ (sic) freedom of expression would be frowned upon by Article 14 of the Constitution of the Republic of Singapore, especially since these other posts do not refer directly to your client. … 5. Our client’s clarion call for an open dialogue on the CPF issue is also in line with recent parliamentary exchanges that emphasize the importance of a robust debtate. … [emphasis in original] 18     This letter was published in the Blog on 28 May 2014 in an article entitled “I Will Continue To Speak Up On Singaporeans’ CPF To Protect Us”. The plaintiff commenced legal proceedings the following day. 19     It is appropriate to note at this juncture that the only defamatory statement that the defendant has been found to have made is that which is comprised in the Article as I have held it inLHL v Roy Ngerng. Nevertheless, the defendant’s actions, the Video and the other articles that the plaintiff asked to be taken down in the 26 May Letter may be relevant in the assessment of damages flowing from the defamatory statement.",
        "The quantification of damages for defamation": "20     The Court of Appeal set out the manner in which a plaintiff in a defamation suit may recover damages inLim Eng Hock Peter v Lin Jian Wei and another and another appeal[2010] 4 SLR 357 (“Peter Lim”) at [5] (citing Pearson LJ inMcCarey v Associated Newspapers Ltd (No 2)[1965] 2 QB 86 at [104]–[105]): Compensatory damages … may include not only actual pecuniary loss and anticipated pecuniary loss or any social disadvantages which result, or may be thought likely to result, from the wrong which has been done. They may also include the natural injury to his feelings—the natural grief and distress which he may have felt at having been spoken of in defamatory terms, and if there has been any kind of high-handed, oppressive, insulting or contumelious behaviour by the defendant which increases the mental pain and suffering caused by the defamation and may constitute injury to the plaintiff’s pride and self-confidence, those are proper elements to be taken into account in a case where the damages are at large. 21     General damages therefore serve three functions in defamation actions – to act as consolation to the plaintiff for the distress he suffered from the publication of the statement, to repair the harm to his reputation, and to vindicate his reputation: seeArul Chandran v Chew Chin Aik Victor[2001] 1 SLR(R) 86 (“Arul Chandran”) at [53]. In order to fulfil these functions, the court will take into account the following circumstances in the assessment of general damages: (a)     the nature and gravity of the defamation; (b)     the conduct, position and standing of the plaintiff and the defendant; (c)     the mode and extent of the publication; (d)     the natural indignation of the court at the injury caused to the plaintiff; (e)     the conduct of the defendant from the time the defamatory statement is published to the very moment of the verdict; (f)     the failure to apologise and retract the defamatory statement; and (g)     the presence or otherwise of malice. 22     Notwithstanding the basic common law rule that damages are awarded on a compensatory basis in civil actions, it has been held that deterrence is also a relevant consideration in respect of the quantification of general damages in defamation actions. InPeter Limat [8]–[9], the Court of Appeal held: 8    Another consideration relevant to the determination of the quantum of general damages to be awarded is its intended deterrent effect. InThe Gleaner Co Ltd v Abrahams[2004] 1 AC 628, the Privy Council (perLord [Hoffmann]) said (at 646): [D]efamation cases have important features not shared by personal injury claims.The damages often serve not only as compensation but also as an effective and necessary deterrent.The deterrent is effective because the damages are paid either by the defendant himself or under a policy of insurance which is likely to be sensitive to the incidence of such claims. [emphasis added] 9    The effectiveness of the deterrent would depend on the amount of the damages awarded. InKiam v MGN Ltd[2003] 1 QB 281, Sedley LJ discussed the importance of awarding an adequate amount of damages in order for the award to be an effective deterrent, and said (at 304): … [T]heineffectiveness of a moderate award in deterring future libels is painfully apparent. It is this, I believe, that is leading both judges and juries once more to lift the level of general damages for libel into a different league from personal injury damages, at least in cases like the present where the newspaper has not simply got its facts wrong but has behaved outrageously from start to finish. [emphasis added] 23     One might observe that considerations of deterrence do not sit comfortably with the compensatory nature of damages in a civil action. As it stands, the role that deterrence plays in the assessment of damages in defamation actions in England is less than settled;Gatley on Libel and Slander(Sweet & Maxwell, 12th ed, 2013) (Prof Alastair Mullis and Richard Parkes QC eds) (“Gatley”) at para 9.4 observes that “[a]lthough deterrence may not be a formalpurposeof general damages for defamation, yet where such damages are substantial (as they are in England) deterrence is aneffectof them” [emphasis in original]. Indeed, it was probably Sedley LJ’s disquiet over the blurring of the common law rule in respect of the award of damages in defamation actions that led him to propose a revival of the criminalisation of defamation inKiam v MGN Ltd[2003] QB 281. Nevertheless, our courts appear to have accepted, as Lord Hoffmann seemed to have done inThe Gleaner Co Ltd v Abrahams[2004] 1 AC 628 (“The Gleaner”), the role deterrence plays in the quantification of damages for defamation as a practical compromise. InThe Gleanerat [54], the learned judge held: The remedy suggested by Sedley LJ to preserve the purity of the distinction between compensation and punishment was a revival of the prosecution for criminal libel. But some might feel that so drastic an intervention by the state in regulating the conduct of the media had other disadvantages. They might prefer instead to compromise the purity of the distinction and see practical wisdom in what Lord Wilberforce said inBroome v Cassell & Co Ltd[1972] AC 1027, 1114: “It cannot lightly be taken for granted, even as a matter of theory, that the purpose of the law of tort is compensation, still less that it ought to be, an issue of large social import, or that there is something inappropriate or illogical or anomalous (a question-begging word) in including a punitive element in civil damages, or, conversely, that the criminal law, rather than the civil law, is in these cases the better instrument for conveying social disapproval, or for redressing a wrong in the social fabric, or that damages in any case can be broken down into two separate elements. As a matter of practice English law has not committed itself to any of these theories: it may have been wiser than it knew.” Oil and vinegar may not mix in solution but they combine to make an acceptable salad dressing. 24     The conduct of a defendant may also warrant the award of aggravated damages. While they are assessed as separate heads of damage, there is little distinction conceptually between aggravated and general damages for a defamation action; aggravated damages are similarly governed by compensatory principles. As the circumstances warranting the award of aggravated damages show, these damages are better viewed as damages awarded for the aggravation of the injury to the plaintiff.Arul Chandranat [55] sets out some of the relevant factors, many of which overlap with the factors relevant to the assessment of general damages: … The conduct of a defendant which may often be regarded as aggravating the injury to the plaintiff’s feelings so as to support a claim for ‘aggravated’ damages includes a failure to make any or any sufficient apology and withdrawal, a repetition of the libel; conduct calculated to deter the plaintiff from proceeding, persistence by way of a prolonged or hostile cross-examination of the plaintiff …, a plea of justification which is bound to fail; the general conduct either of the preliminaries or of the trial itself calculated to attract wide publicity; and persecution of the plaintiff by other means. 25     With that, I turn to apply these principles to the facts of the present case.",
        "The nature and gravity of the defamation and the natural indignation of the court": "26     InKoh Sin Chong Freddie v Chan Cheng Wah Bernard and others and another appeal[2013] 4 SLR 629 at [25], the Court of Appeal held (citing Sir Thomas Bingham MR inJohn v MGN Ltd[1997] QB 586 at 607): … the more closely it touches the plaintiff’s personal integrity, professional reputation, honour, courage, loyalty and the core attributes of his personality, the more serious it is likely to be. … 27     In particular, allegations of corrupt and criminal conduct can have severe repercussions, especially if levelled against the leader of a country. As stated by F A Chua J (“Chua J”) inLee Kuan Yew v Seow Khee Leng[1988] 2 SLR(R) 252 at [25] (“Seow Khee Leng”), “[s]uch charges unless challenged head on would destroy the plaintiff, as moral authority is the cornerstone of effective government”. InSeow Khee Leng, the defendant, then the Secretary-General of the Singapore United Front, had accused the Prime Minister of deliberately allowing Phey Yew Kok, a member of Parliament from the ruling party, to escape from Singapore to Taiwan after embezzling more than $6m, having “assisted or connived at or condoned … members of Parliament and ministers corruptly enriching themselves” (at [23]), as well as having the intention of resisting any investigations into the conduct of these members of Parliament and ministers. 28     In a similar vein, it was held by Goh Joon Seng J inLee Kuan Yew and another v Vinocur John and others and another suit[1995] 3 SLR(R) 38 (“Vinocur John”) at [55] that the allegation of nepotism and corruption levelled against the Senior Minister, the Deputy Prime Minister and the Prime Minister was “an attack that would cause grievous harm to them in the discharge of the functions of their office and indignation on their part as it was an attack on the very core of their political credo”. The defendants inVinocur Johnwere employees of the International Herald Tribune and had implied,inter alia, that the Deputy Prime Minister had been appointed to his various posts through the practice of nepotism by the Senior Minister, aided and abetted by the Prime Minister. 29     The allegation in the present case was no less serious. As is apparent from recent events in this region, an accusation that one has criminally misappropriated monies paid by citizens to a state-administered pension fund is one of the gravest that can be made against any individual, let alone a head of government. Such accusations, striking at the heart of one’s personal integrity, can severely undermine the credibility of the target. For these reasons and in particular, the criminal nature of the act allegedly committed by the plaintiff, I am of the view that this was a grave defamation that a fair-minded person would react with indignation to.",
        "The position and standing of the plaintiff and the defendant": "30     As the Court of Appeal observed inPeter Limat [12]-[13], Singapore courts have consistently awarded higher damages for the defamation of public leaders compared to other persons. This is because of the unique factors which apply to such figures: 12 Singapore courts have consistently awarded higher damages to public leaders than other personalities for similar types of defamation because of the greater damage done not only to them personally, but also to the reputation of the institution of which they are members. …Public leaders are generally entitled to higher damages also because of their standing in Singapore society and devotion to public service. Any libel or slander of their character with respect to their public service damages not only their personal reputation, but also the reputation of Singapore as a State whose leaders have acquired a worldwide reputation for honesty and integrity in office and dedication to service of the people.In this connection, it is pertinent that it has been said that the most serious acts of defamation are those that touch on the “core attributes of the plaintiff’s personality”, ie, matters such as “integrity, honour, courage, loyalty and achievement”… 13 Defaming a political leader is a serious matter in Singapore because it damages the moral authority of such a person to lead the people and the country. InCrampton v Nugawela(1996) 41 NSWLR 176 (“Crampton”), the Supreme Court of New South Wales stated (at 193): In some cases, a person’s reputation is, in a relevant sense, his whole life. The reputation of a clerk for financial honesty and [that] of a solicitor for integrity are illustrations of this. The reputation of a doctor is, I think, of this character: at least, it is so where a substantial part of his work is in an area where he acts on reference from or with the recommendation of other doctors. In our view, the reputation of public leaders in Singapore can, to use the words of the court inCrampton, be considered to be their “whole life”.Without a clean or credible reputation, their moral authority to lead the people is compromised.… [emphasis added] 31     It was not disputed that the plaintiff is the holder of the highest political office in the country. The defamation of the plaintiff therefore warrants damages which would be higher than what would be awarded to an ordinary individual. As alluded to in the above extract, public leaders in Singapore hold positions of trust and confidence and their reputations are vital to their ability to lead and to be given the mandate to govern. InGoh Chok Tong v Chee Soon Juan[2005] 1 SLR(R) 573 (“GCT v CSJ”), Kan Ting Chiu J said at [40]–[42]: 40 The plaintiff was at the material time the Prime Minister and Secretary-General of the People’s Action Party. Since 12 August 2004, he is the Senior Minister in the Cabinet. 41 The defendant was at the material time the Secretary-General of the Singapore Democratic Party and a candidate in the 2001 parliamentary elections. 42They are prominent public figures. The public perception of their integrity will affect their effectiveness and standing, and they have the capacity to damage the reputations of those they speak ill of. [emphasis added] 32     It has been said that reputation is merely temporary; to the extent that it suggests that damage to reputation may be vindicated, I agree. But reputation is a priceless asset that takes years of effort to build. Once stained, it can be a long arduous process to restore one’s reputation to its original state. There may still remain indelible marks, which will sow seeds of doubt that may jeopardise any political career. The defamation of public leaders has thus been taken seriously by the courts – a stand that has been reflected in the quantum of damages awarded to this class of plaintiffs. 33     As the extract above fromGCT v CSJalso shows, the standing of the defendant is another salient consideration. The greater the standing of the defamer, the greater will be the impact of the defamation and degree of injury. InLee Kuan Yew v Jeyaretnam Joshua Benjamin[1979-1980] SLR(R) 24 (“LKY v Jeyaretnam (HC)”), Chua J noted at [70] that the slander in that case was “spoken by the principal opposition speaker and a prominent person whose words would carry more weight than that of a lesser individual and his hearers would be inclined to believe that there must be something in the accusation he was making”. 34     The defendant submits that the converse also applies. That is, a defamer of low credence would be less likely to be believed and this would lessen the gravity of the accusation. He refers me to the decision of the Hong Kong Court of Final Appeal inOriental Daily Publisher Ltd and Anor v Ming Pao Holdings Ltd and others[2012] HKCFA 59 (“Oriental”), where it held that the low credence of the accused justified a reduction in the award of damages by the Hong Kong Court of Final Appeal. The Hong Kong Court of Final Appeal stated at [41]: … it seems clear that unless some principle of law operates to exclude it, the poor credibility of an accuser ought to be regarded as relevant to assessing general damages. Defamatory accusations originating from someone whose credibility is doubted is likely, as a matter of commonsense, to do less harm to the plaintiff’s reputation, cause less distress and require less to vindicate his reputation, than the same accusations originating from an authoritative and credible source. Unless excluded by some legal principle or as a matter of fact, low credence is a potentially important reason for a lower award. 35     Counsel for the plaintiff, Mr Davinder Singh SC (“Mr Singh”), does not seek to dissuade me from following this proposition. Instead, Mr Singh submits that the facts ofOrientalshow that a high threshold had to be met before a party could be said to have “low credence”.Orientalinvolved the republication by the defendant, a Chinese language daily, of defamatory material authored by the principal defamer, a man who referred to himself as the “Hong Kong bin Laden”. The Hong Kong Court of Final Appeal held that the fact that the principal defamer had likened himself to “an infamous terrorist responsible for the deaths of thousands of innocent people” and that he had just emerged from prison for criminally intimidating one of the plaintiffs would have severely undermined his credibility. Accordingly, few readers would have found the accusations credible. 36     I disagree that a high threshold has to be met before the credibility of the defamer could be taken into consideration in the assessment of damages. In my opinion, no such legal proposition can be discerned fromOrientaland I cannot see why there has to be a threshold. I am reinforced in my views by the fact that none of the cases cited by the Hong Kong Court of Final Appeal inOrientalsuggests any such threshold. InRandall v Weich1982 CarswellBC 2254, a decision of the British Columbia Supreme Court, a member of the International Union of Operating Engineers was found guilty of defaming officers of the Union. The defendant had been openly and actively opposed to the plaintiffs for a number of years prior to his act of defamation and as a result, the court held at [24]: The damage done was likely not great. The better informed Union members could be expected to understand that the economic terrorism allegations were unfounded and it is members in that group, who attend meetings and pay attention to the affairs of the Union, who would be most likely to receive the message. The allegations of misappropriation of funds and materials are more insidious in their nature but are so lacking in substance and detail that most people would be inclined to dismiss them as the outpourings of a malcontent. I have little doubt that that is the reputation which, by February 1981 Mr. Weich had within the Union and that, as a consequence, his credibility was not great. If the accuser lacks credibility, his accusations against persons of good character and reputation for integrity are likely to do little harm. 37     Similarly, inKohuch v Wilson71 Sask R 33, a decision of the Saskatchewan Court of Queen’s Bench, the mother of an elementary school child launched a personal campaign against the principal and the director of education, making countless allegations against them by calling open line radio shows and writing letters to various parties. The court held that damages would be attenuated by the fact that the defendant would not be taken seriously by most people. 38     Neither of the defendants in these Canadian cases possessed a reputation that approached the level of notoriety that the principal defamer inOrientalhad. They were merely ordinary citizens who ostensibly had an axe to grind. 39     Because damages in defamation are for injury to reputation, it is quite evident that the standing of the defamer is relevant to the degree of injury. In my view, there is a continuum of damages that is commensurate with the standing, or lack of it, of the defamer. The words of a dishevelled tramp in a street corner would be far less capable of causing damage than that of the CEO of a multi-national company. 40     I turn now to consider the circumstances of the defendant. Mr Singh emphasises the following features in the present case: (a)     The defendant had a widespread reach through the Blog, which attracted a high number of views and had won an award from “TheSmartLocal.com” for being one of the “Most Popular Singapore Blogs” in 2013. (b)     The defendant had “represented himself to be a person who promised to speak the truth and to present accurate information on issues concerning Singaporeans”. 41     In relation to the first point,viz, the reach of the defamatory publication, I am of the view that the popularity of the Blog, while indicative of its reach, is not necessarily indicative of the credibility of the defendant. In any case, I certainly do not think that the popularity of the Blog (which averaged around 355 views per day in 2013) and the manner in which his views were presented were sufficient to elevate his credibility to that of a leading opposition politician for instance, or to imbue his words with the gravitas they would have had had they been in a publication with an international circulation. 42     As for the second point, Mr Singh makes reference to how the defendant had used the blog as a platform for the discussion of social and political issues and how he had viewed himself as an alternative to the mainstream media. He also points to the defendant’s portrayal of himself as the voice of truth, and that the defendant had considered himself to have a significant standing amongst Singaporeans. I accept that the defendant had made many representations in the Blog to that effect. But there is nothing to show that he had in fact enjoyed such standing – there is no evidence of his perceived credibility or the influence he actually wielded. I would compare this with the situation inBarrick Gold Corporation v Lopehandia et al71 OR (3d) 416 (“Barrick”), which is discussed further below at [54]. InBarrick, the defamatory statements resulted in inquiries to the Toronto Stock Exchange as well as its shareholders in respect of those allegations. As Blair JA noted at [40], “[a]n inquiry of that nature from a regulatory agency governing a public company is not to be taken lightly”. There is nothing to suggest that the allegations in the present case were treated with the same import, particularly given the gulf in the relative standings of the plaintiff and defendant. Notwithstanding his attempts to fashion himself as an investigative journalist of sorts, the defendant has never sought to conceal the fact that he is merely an ordinary citizen writing on his personal blog; there was no pretence that he had any information that others were not privy to that would have lent credence to his allegations. 43     In these circumstances, I am of the view that the defendant’s standing points to a lower award of damages in comparison to the other cases involving the defamation of public leaders in Singapore.",
        "The mode and extent of the publication": "44     It is trite law that the wider the extent of publication, the greater the award of damages for defamation:Peter Limat [33]. In this regard, it was not disputed that the Article was hosted on the Blog from 15 to 21 May 2014, where it could be viewed in its entirety either as a standalone entry on the sub-page (“the Sub-Page”) or on the home page of the Blog (“the Home Page”). 45     The defendant provided statistics on the number of views that the Article garnered during this period, as compiled by the webhost of the Blog. They showed that the Sub-Page had been accessed 9,122 times prior to its removal from the Blog on 21 May 2014. Additionally, the number of views that the Home Page garnered during the relevant period were as follows: Time periodNumber of views15–18 May 2014(Article was at the top of the Home Page)2,11919 May 2014(Article was the second article on the Home Page)36,52120 May 2014(Article was the third article on the Home Page)39,63621 May 2014(Article was the fourth article on the Home Page)17,167Total95,443   46     The defendant sought to downplay the extent of the reach of the Article, asserting that the Article had only been read by 3,558 people (being 39% of the 9,122 times the Sub-Page was accessed prior to its removal). He arrived at this percentage in the following manner. Although the total number of views of the Blog in May 2014 was 1,121,870, only 440,432 were unique visitors,ie, 39% of the total views. According to the defendant, this same percentage should be applied in relation to views of the Sub-Page to determine the number of unique individuals there. I have my doubt as to whether it is appropriate to use the total views of the Blog as the basis for estimating the number of distinct individuals who viewed the Sub-Page; unlike the Home Page, which is likely to be the first point of access for repeat visitors to the Blog, it is unlikely that visitors would have gone back to the Sub-Page on subsequent occasions. 47     In any case, the figure of 3,558 does not account for the instances on which the Article was viewed on the Home Page. In this regard, the defendant suggests that the number of views of the Home Page is not indicative of the number of individuals who viewed the Article, since they could be that of repeat visitors to the Blog or visitors who were simply viewing the non-defamatory material hosted on the Blog. There is, in my view, greater force to this argument. Nevertheless, I agree with Mr Singh that the spike in viewers of the Home Page after the publication of the Letter of Demand, and the drop in viewership after the Article was removed from the Blog, suggests that a large number of the 95,433 views could be attributed to distinct individuals who sought the Defamatory Material in the Article after it had received some publicity in the mainstream media and elsewhere. In any case, as Mr Singh highlights, even if I were to accept the defendant’s basis for the calculation of distinct viewers of the Article, there would still have been another 39% of 95,443, amounting to 37,223 individuals, who viewed the Article on the Home Page, a not insubstantial number. 48     The defendant argues that the spike in the number of views from 19 May 2014 indicates that many of these visitors to the site would have been interested in his being sued by the plaintiff rather than the Article. It may well be, as the spike in the number of views of the Blog from 19 May 2014 shows, that the publicity generated by the commencement of legal action by the plaintiff and the publication of the Letter of Demand in the Blog were what drew interest to the Blog. But the reasons for viewing the Blog have little relevance to the extent of its reach. The most that could be said is that many of these visitors to the Blog would have known, at the time of viewing, that the defendant was facing the threat of being sued for defamation on account of the Defamatory Material and therefore exercised a greater degree of scepticism as to its contents. This would be a relevant factor in the assessment of damages. 49     Both the plaintiff and defendant also draw my attention to the mode of the publication (ie, making the Defamatory Material available on a website), albeit for different reasons. Mr Singh highlights the potential for vast and rapid spread in relation to defamatory material posted online, referring to the decision of the UK Court of Appeal inCairns v Modi[2013] 1 WLR 1015 (“Cairns”). InCairns, the defendant had posted a defamatory message (“the Tweet”) on Twitter. The judge found, by consent, that there were 65 immediate publishees to the Tweet. Notwithstanding that, he held that a court should not confine the assessment of damages only to the publication to the original publishees, but should take into account the propensity of defamatory messages to “percolate through underground channels and contaminate hidden springs” (at [26]). Lord CJ held at [27]: Mr Caldecott QC contended that with allegations of this scandalous nature it is likely nowadays that word will “percolate” by way of the Internet, and particularly in this case among those interested in cricket—not least because of the responsible position held by Mr Modi and the apparent authority of his words.Dealing with it generally, we recognise that as a consequence of modern technology and communication systems any such stories will have the capacity to “go viral” more widely and more quickly than ever before.Indeed it is obvious that today, with the ready availability of the world wide web and of social networking sites, the scale of this problem has been immeasurably enhanced, especially for libel claimants who are already, for whatever reason, in the public eye.In our judgment, in agreement with the judge, this percolation phenomenon is a legitimate factor to be taken into account in the assessment of damages.[emphasis added] 50     In the same vein, the author of Matthew Collins,The Law of Defamation and the Internet(Oxford University Press, 3rd Ed, 2010) says at para 20.11: [One should also consider] the ease with which defamatory Internet content, long after the event, can be retrieved by Internet users. In the past, a defamatory article in a newspaper might have been quickly forgotten and accessible only to an intrepid researcher prepared to spend hours in a dusty archive or poring over micro-fiche film. Today, the same article stored in an online archive may be able to be retrieved in a matter of seconds by anyone with a computer or other Internet-enabled device, an Internet connection, and a passing familiarity with the formulation of search engine inquiries. Where defamatory matter remains accessible in the wilds of the Internet as the ordinary consequence of its original publication, and where there is no hope of successfully corralling the matter by a permanent injunction at the end of a defamation trial, the measure of damages ought thus to be increased to reflect the extent of the injury caused by the original publication and the risk that it will cause future damage to the claimant. 51     Indeed, subsequent events showed that the Defamatory Material did “percolate” soon after its publication by the defendant, facilitated no doubt by the ease by which it could be reproduced and disseminated. The defendant did not dispute that that the Defamatory Material was republished or linked to on 11 other blogs and websites, nor did I think it would have come as any surprise to him given the nature of the allegations. 52     The defendant, on the other hand, argues that the publication of the Defamatory Material on the Blog warrants the lowering of damages against him. In essence, he contends that that thecontextin which the defamation was made detracted from the credibility of the defamatory allegations. Specifically, the fact that the Defamatory Material had been published on a blog weighs against its credibility and accordingly, reduces its defamatory sting. He emphasises that “a blog is not subject to oversight, editorial review and professional pressures to provide accurate and unbiased information”, and that “[t]he internet is known to be transient and unregulated to a large extent”. It should be stressed that this is a submission distinct from that on the defendant’s standing – the defendant’s argument, as I understand it, is that defamatory material posted on a blog isnecessarilygiven lesser credenceby virtue only of the medium on which it is hosted. 53     I note that the context in which a defamatory remark is made is not one of the factors that have been commonly listed in our courts. Notwithstanding that, it is clear to me that the factors listed above at [21] were not intended to be exhaustive. Indeed,Peter Limat [7] states that the “circumstances that are relevant and should be taken into accountinclude” [emphasis added] those factors. The mode in which the publication was made was also considered inLee Kuan Yew v Davies Derek Gwyn and others[1989] 2 SLR(R) 544 (“LKY v Davies”), in which the court found (at [132]) the fact that “[t]he libels appeared in a reputable and influential publication with worldwide circulation … read generally by people in the business and financial communities and the intelligentsia” to be aggravating. 54     Neither the defendant nor the plaintiff cited any authority specifically addressing blogs as a species of internet defamation. Nevertheless, there have been judicial pronouncements on the credibility of defamatory material on the internet, albeit in relation to bulletin board posts. InNigel Smith v ADVFN Plc and others[2008] EWHC 1797 (QB) (“ADVFN”) at [14]–[17], the English High Court held that such communications are not taken as seriously as “they are often uninhibited, casual and ill thought out” and “it is often obvious to casual observers that people are just saying the first thing that comes into their heads”. The majority of the Court of Appeal for Ontario inBarrick, however, came to a different conclusion.Barrickconcerns a businessman who had embarked on “a systematic, extensive and vicious campaign” of internet postings relating to the plaintiff. This comprised numerous messages posted on bulletin or message boards on various websites, attacking the plaintiff’s claim to ownership over one of their mining properties and accusing the plaintiff of numerous acts of criminal conduct. Blair JA, delivering the judgment of the majority, held at [38]: The notion that Mr. Lopehandia's Internet dialogue style—a style that may not be taken seriously in a traditional medium such as a newspaper—may undermine the credibility of his message has some appeal to those of us who are accustomed to the traditional media. However, as I have noted, the Internet is not a traditional medium of communication. Its nature and manner of presentation are evolving, and there is nothing in the record to indicate that people did not take Mr. Lopehandia's postings seriously. In fact, the uncontradicted evidence is to the contrary. 55     I see some force in the defendant’s arguments in that the Blog was not an institutional site – it did not have the backing of any organisation from which it could draw credibility, nor did it pretend to. However, unlike the defamatory statements inADVFNandBarrick, this was not merely a bulletin board post written flippantly or in haste, nor was it incoherent or rambling. This was a website which had existed since 2012 and, according to the defendant, contained close to 400 articles. The Article was written in a well-structured and grammatical manner, bolstered by charts and statistics from verifiable sources and accompanied by quotes purportedly from persons of repute. There is no reason to believe this was not the standard in most if not all the other articles. In my opinion, there is no hard and fast rule that publication in a blog would mean that an article is less likely to be believed. What matters is the impact of the Article on the objective reader. It is probably true that the credibility of an article published in the blog of a person who is not well known would be lower than one in an edited journal. However a well-written article in such a blog would be taken more seriously than one that is poorly written, or poorly presented. The fact that the Article is well presented would give it greater credibility than a less well written one in a personal blog. In my judgment this quality of the Blog raises its impact above that of a run-of-the-mill blog. But it would be much less influential than a traditional newspaper.",
        "The defendant’s apology": "56     The parties agree that an immediate withdrawal of the Defamatory Material coupled with an apology by the maker of the defamatory statement is a mitigating factor. InCairns, the Court of Appeal held at [24] that the “rapid publication of the withdrawal of a defamatory statement, accompanied by an apology, together with an admission of its falsity given as wide publicity as the original libel diminishes its impact more effectively than an apology extracted after endless vacillation”. The dispute before me is whether the apology by the defendant was truly unreserved and sincere. 57     The defendant points to the fact that the Article was removed from the Blog on 21 May 2014, less than a week after it was published, and that he had published his apology and undertaking in the 23 May Articles two days thereafter. The apology and undertaking continue to remain on the Blog. The defendant also emphasises that he had reiterated his apology several times in his then-solicitor’s letters to the plaintiff’s solicitors, and that the Articlein fullcan no longer be found on the internet. I note in passing that the defendant does not say that the Defamatory Material can no longer be found on the internet, though I am of the view that it is of little relevance to the mitigation value of his apology. Taking all of the above into account, the defendant submits that the apology and retraction are matters tending to mitigate damages: seeLee Hsien Loong v Singapore Democratic Party and others and another suit[2009] 1 SLR(R) 642 (“LHL v SDP”) at [72]. 58     Mr Singh does not contend that the apology, which was in terms requested by the plaintiff, was ineffective on its face. However, he casts doubts over the sincerity of the defendant’s apologies, contending that they were made in order to “enable [the defendant] to get away without paying damages and to use … the response to the libel to get further into the public eye by having a debate with the [p]laintiff”. In particular, he points to the fact that the defendant had continued to make the Letter of Demand, containing the Defamatory Material, available on the Blog for more than a year. He also directs my attention to the 24 May Article, in which the defendant had stated that “the apology was made only in relation to the perceived suggestion of ‘misappropriation’”. In this regard, he says that the apology was not sincere, and submits that the authorities support the proposition that an apology that is neither unreserved nor sincere is an aggravating factor. 59     I am not persuaded that the reasonable inference to be drawn from the continued availability of the Letter of Demand on the Blog is that the apology was false. The defendant accepts that he would have read the Letter of Demand and that he would have seen that it reproduced the Defamatory Material. What Mr Singh appears to suggest is that this shows that the defendant had deliberately left the Letter of Demand on the Blog as a means of maintaining the Defamatory Material in the public domain, contrary to his undertaking. I do not think that this is sufficiently supported by the evidence before me. 60     I next consider the significance of the phrase “perceived suggestion of ‘misappropriation’” in the 24 May Article. The defendant sought to provide an explanation as to what this meant during his cross-examination: You have another point. You said at the moment the Prime Minister wanted damages you pulled back on your apology. No, because when I said perceived suggestion of misappropriation, my understanding is this is how the reasonable person would look at it. As much as I did not say the Prime Minister criminally misappropriated the funds or did I not say the Prime Minister misappropriated the CPF funds. I therefore realised that the reasonable person would then perceive the article and realise I was saying there was a misappropriation. As such, it was really just a matter of looking at how defamation would be looked at in law and to describe it in my own words how defamation was being looked at in law. 61     Mr Singh contends that the phrase conveys the meaning that the defendant was only apologising for an allegation that was perceived only by the plaintiff and which the defendant himself did not believe the Article to contain. Mr Singh argues that this paints a picture of the defendant being bullied into apologising by the plaintiff. He also says that the defendant’s explanation contradicts the defendant’s affidavit of evidence-in-chief (“AEIC”), in which he stated at para 45: When the Prime Minister insisted that I pay damages, I was quite taken aback and shocked. I felt aggrieved. It is one thing to ask me to apologise, hence reinstating or vindicating his reputation, and another to demand from his citizen monetary compensation. After all, I am not a politician. This compelled me to make a YouTube video and write an article, “Roy Ngerng’s Message: Defamation Suit from Singapore Prime Minister”. I needed the opportunity to explain myself. As I have affirmed several times, I have never intended nor would I have said things to defame the Prime Minister. My focus has always been on the management of our CPF and to demand more than an apology was disproportionate to an innocent act. Whatever the impression given by my article, it was unintentional.When I put up the apology letter on 23 May 2014, I felt aggrieved. I felt that the apology made it look like I was apologising for what I had written about the CPF. But this is not the case. The apology was made in relation to the plaintiff and in no way represents my views on the CPF.As such, it spurred me to make the video to clarify. I made the video at about 1.00am the day after and posted up the video at about noon. It was made urgently. I wanted to continue to affirm my stance on the CPF – that there was a lack of transparency and accountability on its management and the government has an explanation to do. [emphasis added] 62     As I understand it, the defendant’s explanation is that the phrase “perceived suggestion of misappropriation” was intended to mean that he had no intention of making any such allegation. That is, “perceived” meansperceived by the reasonable personand not only by the plaintiff. I accept his explanation. This phrase, when read in the context of the 24 May Article, did not suggest that he was contesting the falsity of his allegations of criminal conduct against the plaintiff; it simply indicated that hepersonallydid not believe the Article contains the libel. This is entirely consistent with paragraph 45 of his AEIC. 63     It is important to flag out at this juncture that this is the constant thread that runs through the defendant’s arguments (and indeed, the material before me) in the present proceedings – the defendant’s case, essentially, is that he has never deviated from his apology and retraction ofthis particular allegation of criminal misappropriation. That is, a distinction should be drawn between his comments relating to the management of the CPF monies and the defamation which he has published. This is also relevant to the assessment of the defendant’s conduct and is discussed further below. 64     I now consider how an apology serves to mitigate damages.Gatleyat para 29.2 states that the “purpose of an apology is to appease the injured feelings of the person defamed and to undo the harm done to his reputation in consequence of the publication”. The mitigatory effect of an apology must therefore be assessed with a view towards the fulfilment of its consolatory and vindicatory aims, bearing in mind the defamatory imputation of the Article for which damages are to be quantified. This is a distinct inquiry from whether an act or publication is deemed to be aggravating. 65     I proceed to examine the defendant’s apology in that light and also in the context of his actions immediately after the apology was posted. He removed the Article from the Blog on 21 May 2014 and on 23 May 2014, sent the Apology Letter to the plaintiff’s solicitors and published it on the Blog. However, one day after this, on 24 May 2014, when his request to waive damages was rejected by the plaintiff, he posted the 24 May Article on the Blog. He also provided a link to the Video, posted on YouTube. On 25 May 2014, he sent the First Email to members of the international media, followed by the Second Email. These are described in [9]–[14] above. In my view, those publications have the effect of diluting the force of the Apology Letter. InAdelson v Associated Newspapers Ltd (No 2)[2009] EMLR 10 (“Adelson”) at [72]–[74], the English High Court accepted the plaintiff’s submission that “an apology that is not full or frank does not appease the feelings of the person defamed and does not undo the harm to the claimant's reputation”.Adelsoninvolved a defendant who had advanced a substantive defence of justification containing 64 paragraphs of particulars. The defendant was, at the same time, publicly asserting the truth of its defence of justification and offering to make a statement in open court acknowledging that the defamatory allegations that were the subject of the plea of justification was “absolutely and utterly false”. Similarly, inSeow Khee Leng, the defendant there admitted not only that he had meant to qualify his apology, but that his statements were understood as such. 66     The general public who have read the 23 May Articles would have seen that the defendant had acknowledged that the allegation that the plaintiff had criminally misappropriated monies from the CPF was “false and completely without foundation”. Although nothing in the defendant’s subsequent publications over the next few days changed that position as far as the allegation of criminal misappropriation was concerned, the disinterested observer would conclude from the acts of the defendant subsequent to the publication of the Apology Letter that he was not contrite: he posted the 24 May Article on the Blog where he qualified his apology, he posted the Video on YouTube in which he accused the plaintiff of using the law to silence him, and he sent out emails to the international media containing similar accusations. Clearly, the articles and emails that followed the publication of the Apology Letter in the Blog would have done little to appease the injured feelings of the plaintiff notwithstanding the unequivocal terms of the Apology Letter. As for the second purpose of undoing the harm done by the libel, the post-apology publications would have undone any mitigation effect that the publication of the Apology Letter had achieved.",
        "The conduct of the defendant and his purported malice": "67     Mr Singh submits extensively on this point, arguing that the conduct of the defendant demonstrates malice on his part that warrants an award of aggravated damages. As stated inGatleyat para 9.21: … Even where aggravated damages are based upon the malice of the defendant they are in principle compensatory because they are concerned with the way in which the injury to the claimant is increased by the motive or conduct of the defendant: a libel which is maliciously published and persisted in is likely to be more hurtful than one which is published in error and promptly corrected. … 68     In the context of a defamation action, the use of the term malice has not been restricted to its ordinary meaning of spite or ill-will, but has also been taken to include “some wrong or improper motive”: seeLKY v Daviesat [112]. Malice can be inferred by the defendant’s conduct at any time and not just immediately prior to the making of the defamatory statement; whether before or after the publication of the defamatory material, or during the course of litigation: seeGatleyat para 32.45. In particular, it can be inferred from the defendant’s demeanour and attitude at trial or from the publication of allegations which are patently false: seeLHL v SDPat [104] and [140]. It was held inGoh Chok Tong v Jeyaretnam Joshua Benjamin[1998] 2 SLR(R) 971 at [53] that the maker of a defamatory statement made “recklessly, without considering or caring whether it be true or not” is “treated as if he knew it to be false” and had acted in malice. 69     Mr Singh invites me to infer malice on the part of the defendant from,inter alia, the following: (a)     The defendant had published patently false allegations when he was either aware of the falsity of the Defamatory Material from the start or was reckless as to its truth. (b)     The defendant had caused the libel to be widely published and republished. (c)     The defendant had repeated the Defamatory Material even though he had no belief in its truth from the start. I address each of these aspects of the defendant’s conduct in turn. The publication of a patently false allegation 70     The defendant testified, and Mr Singh does not contend otherwise, that he had never operated under the impression that the plaintiff had actually misappropriated monies from the CPF. What Mr Singh does dispute is the defendant’s assertion that the defamation was wholly unintentional. That is, the defendant claims that he did not know that the Defamatory Material conveyed the defamatory meaning as I had found inLHL v Roy Ngerng. Malice, being a subjective state of mind, is not made out if the defendant’s version is true. 71     The defendant proffered several explanations in support of his claims of innocent publication. First, he stated in his opening statement that “the unfortunate juxtaposition of the [City Harvest Church trial] and the issue of CPF was purely unintended” as he “was [only] used to dealing with socio-political commentaries” and not “personalities”. Second, when questioned as to his use of the word “misappropriated”, he claimed that he was not aware and therefore was not referring tocriminalmisappropriation as set out in the Penal Code (Cap 224, 2008 Rev Ed). Third, he further stated during his cross-examination that the Article was directed at the government and not the plaintiff. 72     I am not convinced by any of the defendant’s explanations, and am of the view that he did in fact know of the imputation that the Defamatory Material carried. His first explanation (ie, that he had not intended to draw parallels between the City Harvest Church trial and the issue of the CPF) is, in my judgment, completely untenable given the use of the phrase “uncanny resemblance”, and is undermined by his later explanation that he had only intended to show how the government was routing the CPF funds between certain state-related entities. Neither am I persuaded, as the defendant appears to suggest, that his use of the word “misappropriation” was intended to be independent of any connotations of criminal wrongdoing. Putting aside my difficulty in understanding how an allegation of the taking of monies from a state-administered pension fund was not an allegation of criminal wrongdoing, the defendant himself conceded during his cross-examination that he was aware, having read the Channel News Asia article, that misappropriation was a crime for which the accused persons in the City Harvest Church trial were charged. As for the distinction that the defendant drew between the government and the plaintiff, I agree with Mr Singh that there is no reason why the defendant would have used the plaintiff’s photograph and referred to him by name had he truly intended to refer only to the government as an entity independent of the plaintiff. I therefore find that the defendant had in fact published the Article despite knowing that it was defamatory of the plaintiff. 73     Mr Singh contended that the publication of the Defamatory Material was an act calculated by the defendant to “boost the viewership of the Blog and bolster his standing in the community”, which he had sought to achieve by crafting the Article in a sensational manner and by timing its publication to maximise its effect and circulation. He points to the fact that the defendant had been aware of the Blog’s falling viewership and of the high degree of public interest that the City Harvest Church trial was generating. 74     While I do not think that there is sufficient evidence to show that the defendant had bided his time and exploited the notoriety of the City Harvest Church trial in order to maximise its effect, I am satisfied that the circumstances viewed in their totality at least show that the defendant had cynically defamed the plaintiff in order to increase viewership of the Blog. Having found that the defendant was aware of the defamatory meaning of the Article at the time of its publication, there seems to be no other reason as to why he would have published the Article other than to boost the viewership of the Blog and his credentials as a socio-political critic. 75     Even if I am wrong and his motives for the publication of the Article were independent of any desire for self-promotion, that does not detract from a finding of malice on the part of the defendant. Regardless of his motives, he had clearly published an article containing assertions, the truth of which he was not just reckless to, but which he hadactually knownto be false and injurious to the reputation of the plaintiff. This is further aggravated by his conduct subsequent to the publication of the Article as discussed below. Increasing the reach of the Defamatory Material 76     Mr Singh points to the publication of the 19 May Article as further evidence of the defendant’s malice, arguing that the defendant had used it to draw more attention to the Defamatory Material. This is because the 19 May Article reproduced the Letter of Demand, which would have displayed not just the Defamatory Material but also the links to the Article. The defendant, on the other hand, denies that he had any intention to do so. He first claimed during cross-examination that he “[did] not remember the contents of the letter because [he] was in shock and fear” and that it “went out without [his] knowing”. 77     In my view, the credibility of the defendant’s claims of having experienced “shock and fear” is greatly diminished by the contents of the 19 May Article and the 20 May Article. The defiance of the defendant is manifested in his call to the readers of the Blog to “stand up and fight”. I am not convinced by the defendant’s claim that he had been unaware that the Defamatory Material was reproduced in the Letter of Demand as he had conceded in cross-examination that he had read the Letter of Demand and was aware of its contents. In my view, the defendant knew that the Letter of Demand would attract much public interest. He would therefore have known that the publication of the 19 May Article, which reproduced the Letter of Demand, would greatly increase the reach of the Defamatory Material and the likelihood of its republication. 78     What is also of significance is that unlike the 24 May Article and the Video, there had not been any apology at the time the 19 May Article was published, nor was there any distinction drawn in the 19 May Article between the defendant’s allegation of criminal conduct by the plaintiff and his general criticisms of the CPF. The reasonable reader of the 19 May Article would therefore have understood the defendant to be maintaining the truth of his assertions, at least until the publication of his apology on 24 May 2014. 79     Mr Singh also refers to the publication of the 20 May Article. He argues that its publication is aggravating given that it “reminded the readers of the Blog to read the earlier comparisons between the CPF monies and the City Harvest Church case”. This, Mr Singh says, is an example of how the defendant “sought to use every opportunity to promote himself and rub salt to the wound”. I am unable to agree. Mr Singh does not point to any actionable libel in the 20 May Article, in my view rightly so. In that article, the defendant was making his case as to why the government was wrong in its CPF policy. Whether those arguments are valid is not relevant; what is beyond doubt is his right to make and publish them. There was no direct reference to the Article or the allegations therein, and to find that it was aggravating in the manner that Mr Singh contends would be to limit the defendant’s right to free speech simply on the basis that theycould have ledto the Defamatory Material, a finding which I am not prepared to make. The defendant’s post-apology conduct 80     I now turn to the defendant’s conduct subsequent to his apology, which includes: (a)     The publication of the articles on the Blog between 24 and 28 May 2014. (b)     The posting of the Video on YouTube. (c)     The sending of the emails to persons including members of the media. (d)     The publication of Court documents containing the Defamatory Material on the Blog. (e)     The publication of articles on the Blog on 9 and 30 June 2015, in which he claimed to have been persecuted for his views. I refer to them collectively as “the Subsequent Publications”. 81     A recurring theme of political persecution emanates from these materials and which continued into the hearing – clearly, the defendant saw himself to be, or at least sought to fashion himself as, a martyr, a bastion of truth which would be crushed under the weight of oppression and tyranny. Mr Singh submits that they show that the defendant had portrayed the plaintiff as being unreasonable and as “someone who was out to persecute him for his advocacy of CPF-related issues” despite knowing this was false. 82     These submissions were made with specific regard to the 26 May Article and the Video respectively, but could fairly be made in respect of the Subsequent Publications as a whole and I address this accordingly. I think it is fair to say that the Subsequent Publications did cast the plaintiff in a highly unflattering light, to say the least. They appeared to suggest that the plaintiff was using the present suit not just to vindicate his reputation but to quell political dissent, or even to prevent investigation into the mismanagement (dishonest or otherwise) of the CPF monies. During cross-examination, the defendant appeared to suggest that a distinction ought to be drawn, in relation to what he had said in the Subsequent Publications, between the government and the plaintiff. That is, they should be read to mean that it was the government that had such improper motives. There is little merit to this argument – it is clear from the Subsequent Publications that the defendant himself drew little distinction between the two, often alternating between them within the same paragraph and the same narrative. In any case, as his continued acts of publication showed, there was no indication that he had truly believed that he was prevented from writing about the CPF. This was not denied by the defendant during his cross-examination: Q.You have told us that you believed at that time that the plaintiff had not stopped you, by his letter of demand, from speaking about the CPF? A.Yes. Q.Indeed, you continued to blog about the CPF, right? A.Because they are two separate issues, yes. 83     This being the case, quite aside from the defamatory imputation that the plaintiff had criminally misappropriated monies from the CPF, it could well be argued that the defendant had compounded the defamation by alleging that the present suit was brought for improper motives. Indeed, the emails sent by the defendant to members of the media appeared to be of the same nature, with the defendant stating in the First Email that “[t]he reason why the government wants to use the law to silence me is because I had exposed the truth about our retirement funds, which has exposed them of their deceit”, and stating in the Second Email that “[i]t is clear that [the plaintiff] is trying to eliminate the evidence of the corruption from my blog”. What Mr Singh would have me do, in essence, is to find that a second statement that is potentially defamatory in itself is aggravating of a first defamatory statement for which damages are being assessed. 84     It is not entirely clear as to the nexus the defendant’s subsequent conduct (be it the publication of a subsequent defamatory article having a different defamatory meaning or otherwise) must have to the original defamatory statement. In other words, must the subsequent conduct aggravate the injury arising from the defamation for which the defendant has been sued in order for it to constitute an aggravating factor? The position in England, as set out inCollins Stewart Ltd v The Financial Times Ltd[2006] EMLR 5 (“Collins”) at [24] to [27], appears to be that it must: 24.    The starting point for any discussion of the legitimacy of the use to which Collins Stewart wish to put the subsequent articles is that they could, if they had chosen to do so, have complained of them as separate causes of action. Issues of meaning and any defences could then have been debated at trial in the usual way. In the event that Collins Stewart failed to establish that any of the subsequent articles was defamatory of them or theFinancial Timesestablished a defence to it, no question of additional damages would arise. If on the other hand liability were to be established against the newspaper, Collins Stewart would be entitled to further separate awards after the judge had directed the jury (or himself) to take care to avoid double-counting. This is a familiar and workable scenario. 25.    However, Collins Stewart, for whatever reason, did not take that course. It is necessary to look with some care at the position which arises as a result of their having confined their cause of action to the original article. As it appears to me, Collins Stewart would be entitled to recover by way of compensatory damages the damage to its reputation, standing and good name flowing from the publication of the article of August 27. … 26.    … What is the position where a claimant is the subject of a series of articles? There are various possibilities. Assume that the defendant publishes three defamatory articles referring to the claimant, articles A, B and C. If articles B and C add to the damage caused by the publication of the original article A and are not defensible, then I think that articles B and C should in principle generally be made the subject of separate complaint as separate causes of action. To do so would make matters simpler and clearer for the jury (or judge) if and when it comes to assessing damages. If on the other hand articles B and C, whilst defamatory of and damaging to the claimant, do not repeat the libel which was contained in article A, it appears to me to be objectionable in principle to allow the claimant to rely on articles B and C in connection with damages recoverable for the publication of article A. Articles B and C would be separate torts giving rise to separate claims for damages. … 27.    My starting point is therefore that there are sound reasons both of principle and of practice why a claimant, whether an individual or a corporation, should not be permitted to seek to recover increased damages in respect of the publication by the defendant of article A by reason of the publication by that defendant of subsequent articles B and C which are not themselves the subject of complaint. 85     As was the case inCollins, it was entirely open for the plaintiff to have sued the defendant on the basis of allegations that the plaintiff had brought the suit for the improper motives which I highlighted. This does not in any way reflect any view on my part as to the merits of such a claim. Indeed, it is difficult for the court to form a view without a proper consideration of all relevant matters including any defences that might be available to the defendant. Putting aside the difficulties that arise in the quantification of damages in the absence of the consideration of such factors, my discomfort also lies in providing what could be essentially a backdoor admission for an unproven tort in the assessment of damages – I have not heard the parties on whether the Subsequent Publications really did convey such a defamatory imputation and whether the defendant would be able to avail himself of any defences. 86     Notwithstanding its appeal, it appears that the narrow approach as set out inCollinsis inconsistent with that taken inLKY v Jeyaretnam (HC), at least to the extent that the casting of aspersions over a plaintiff’s motives in the defamation action in question constitutes an aggravating factor . InLKY v Jeyaretnam (HC), Chua J held at [70] that the defendant’s approval of the name of a fund was aggravating as it impugned the plaintiff’s motives in bringing the action. This was upheld by the Court of Appeal inJeyaretnam Joshua Benjamin v Lee Kuan Yew[1979–1980] SLR(R) 255 (“Jeyaretnam v LKY (CA)”) at [17]. In the present case, I am satisfied that the Subsequent Publications did similarly convey the meaning that was found to be aggravating inJeyaretnam v LKY (CA),ie, the present suit was commenced as “an attack on democracy” rather than to vindicate the plaintiff’s reputation. I am therefore constrained to find, on the authority ofJeyaretnam v LKY (CA), that the Subsequent Publications are aggravating. The defendant’s conduct in the present proceedings 87     Mr Singh argues that the defendant’s conduct in the present proceedings was aggravating of the damages to be awarded to the plaintiff. This, he says, is because the defendant had disputed issues that were previously uncontended and had “carefully designed” his cross-examination of the plaintiff to “aggravate and cause further hurt to the [p]laintiff’s reputation”. Mr Singh refers me toGCT v CSJat [54], which he says is an example of a court having regard to a defendant trying to go back on what was earlier admitted to be common ground between parties in assessing aggravated damages. 88     In my view,GCT v CSJdoes not assist the plaintiff’s case in the broad manner as argued by Mr Singh. InGCT v CSJ, the court took into account the defendant’s subsequent conduct in denying that he had uttered the defamatory statements in question and his plea of justification in his defence as being relevant to the assessment of damages. But that was because it cast doubt over the sincerity of the defendant’s apology. The nature of the defendant’s resilements pointed out by Mr Singh, which relate to the extent of the publication and republication of the Defamatory Material, do not qualify his apology in that manner. It must also be borne in mind that the defendant was not legally represented in the hearing for the assessment of damages; some leeway must therefore be given for any infractions, if they be such. 89     With this in mind, I turn to Mr Singh’s submission that the defendant had, in a manner akin to the defendants inLHL v SDP, exploited the opportunity to cross-examine the plaintiff for improper purposes. InLHL v SDPat [129]–[131], Belinda Ang Saw Ean J held as follows: 129    Turning to the Assessment Hearing itself, [the Defendants’] malevolent stance towards the Plaintiffs was full-blown at that hearing. At that highly-publicised hearing, [the Defendants] played out the two broad objectives stated earlier …, namely: (a)    to air their political grievancesvis-à-visthe current system of government in Singapore; and (b)    to (i) indict a political regime, (ii) discredit, insult, humiliate and embarrass the Plaintiffs and (iii) denigrate the Judiciary. Of relevance in this assessment of damages is [the Defendants’] objective of,inter alia, discrediting and embarrassing the Plaintiffs as this objective concerns the Plaintiffs directly. The conduct and the motive of [the Defendants] in this regard were among the elements to which I attached importance in deciding whether aggravated damages ought to be awarded for the injury to the Plaintiffs’ feelings. … 130    In their cross-examination of the Plaintiffs, the Defendants said that they wanted to show that the Plaintiffs’ standing and integrity were not unblemished, contrary to what the Plaintiffs claimed. However, the line of questioning pursued by the Defendants was totally irrelevant to their stated objective for it was aimed instead at justifying the Libel based on the meaning of the Disputed Words and on defences that were no longer open for debate at the assessment stage. 131    Dragging in material (such as the matters listed in para 8 of the Amended Defence under the section titled “Particulars of Public Interest” …) to justify the Libel by the back door is, in my judgment, a legally impermissible tactic, and it is also an aggravating factor in so far as injury to the Plaintiffs’ feelings is concerned. The Defendants’ questions confirmed time and again that, on the quantification issue, there was really no genuine dispute of fact or law to be resolved. The manner in which cross-examination was conducted by [the Defendants] was intended to hold the Plaintiffs up to public vilification, ridicule and humiliation. It was meant to denigrate and insult the Plaintiffsvis-à-visa wide range of matters such as freedom of speech, the electoral system in Singapore and detention under the Internal Security Act, all of which were outside the scope of the Libel as well as the quantification issue. … 90     The question, however, is the extent to which the irrelevance of cross-examination can be taken as aggravating.Goh Chok Tong v Jeyaretnam Joshua Benjamin[1997] 3 SLR(R) 46 at [195] suggests that the conduct in trial must reinforce the defamation to warrant aggravated damages: I am conscious of the fact that, although objection was not taken, a fair number of Mr Carman’s questions, in particular those relating to the plaintiff’s views on democracy and government policy, were not directly relevant to the case.However, mere irrelevance of cross-examination is not a ground for aggravating damages. In every case, whether civil or criminal, cross-examination will occasionally exceed the strict boundaries of relevance, which sometimes cannot be distinctly drawn except in retrospect, when all the evidence has been adduced. As for thedictaof L P Thean J inLee Kuan Yew v Davies, I think the true effect of that case is thatquestions which are irrelevant in the sense that they are intended to annoy or antagonise the witness and reinforce the defamation may aggravate damages. [emphasis added] 91     While the High Court judge there was found on appeal to have erred in his assessment of damages, this aspect of his findings was not overruled. Nevertheless, the approach taken by the High Court judge (which was upheld by the Court of Appeal) appeared to be less restricted than the paragraph above suggests. At [199] of that judgment, the High Court judge held that a sufficient nexus to the defamatory words could be formed where the cross-examination on irrelevant matters causes further harm to the plaintiff: … There is nothing wrong with putting a good or arguable case strongly to a witness but to put a case with the driving force of a strong one and then fail to call any evidence to support that case is to indulge in pure rhetoric. Ordinarily such rhetoric may not do much harm but in this case the rhetoric was an attack on the integrity of the plaintiff as Prime Minister. It is clear, by the failure to call evidence to support the allegations, that the questions were directed not towards assisting the court in determining the issues before it but directed at the gallery and the press in order to denigrate the Prime Minister and the way he governs Singapore. For such conduct aggravated damages is payable.The enhanced damages arise out of the nexus between the harm done by the defamatory words originally spoken and the further harm done by the hurt caused to the plaintiff’s feelings as a result of the cross-examination on irrelevant matters. [emphasis added] 92     In the present proceedings, there were instances that appeared to show that the defendant had used the hearings as an opportunity for an “open dialogue” as to the purported lack of transparency in the administration of the CPF monies (as he had sought in the 23 May Articles) and for scoring political points rather than the conduct of his case. However, these were largely isolated incidents. Much of the irrelevance in cross-examination was attributable to his eagerness to put forward his case, which, as I understood it, involved the use of objective evidence to demonstrate that it was evident from the information in the Article that he could not have been acting in malice – an approach which often appeared to be at odds with his acceptance of the defamatory import of the Article. He would also occasionally embark on points that were best left for submission and had to be reined in, but that is not uncommon of litigants who appear without the benefit of counsel. The tangents on which the defendant had gone off did not denigrate the plaintiff save for his revisiting of the Defamatory Material. But I accept that this was an attempt to show his purported lack of malice. However I find the defendant’s comments that the plaintiff was “disproportionate in using the law against his citizen which he has a duty to protect” to be aggravating. Considered in its entirety, I do not find that the defendant’s conduct in the trial to be objectionable in view of the fact that he had to conduct the trial by himself and had to respond to any point that was raised with little time to consider it, a feat that, I might add, many trained lawyers find intimidating. His conduct was certainly nothing approaching that of the defendants in the cases cited to me.",
        "The chilling effect on freedom of expression": "93     In both his opening statement and closing statement, the defendant stressed repeatedly the chilling effect that a large award of damages would have on free speech in Singapore while making numerous references to the plaintiff’s position as a holder of public office. Annexed to his opening statement, and presented as part of his submissions, were a “legal opinion” by the International Commission of Jurists (“the IC Jurists”), an international non-government organisation whose primary focus appears to be human rights; and an amicus brief authored by the Center for International Law (“the CIL”), which describes itself as “a Philippine registered non-governmental organization dedicated to the promotion of free expression in the Asian region”. As I understand it, the defendant’s argument is that lower damages ought to be awarded against himbecauseof the plaintiff’s status as the head of government. 94     As Mr Singh points out, these arguments are not novel and have been canvassed at length by our courts. InTang Liang Hong v Lee Kuan Yew and another and other appeals[1997] 3 SLR(R) 576 (“Tang v LKY”) at [113]–[119], the Court of Appeal held: 113    Mr Gray’s next ground of complaint is really a political one. He submits that these actions contain an intensely political flavour. The political motivation of the respondents, he argues, is itself a reason for clamping damages at a modest level. Libel actions are for vindicating reputation and not for use as political bludgeons. If large damages are allowed to stand, it would have what he describes a “chilling effect” on the freedom of expression and political debate. He cites two cases in support:City of Chicago v Tribune Co139 NE 86 (1923) andDerbyshire County Council v Times Newspapers Ltd[1993] AC 534. … 116    Clearly these two cases are distinguishable from the instant cases. In each of the two cases the party suing was a public authority and as a matter of policy the laws in those jurisdictions do not permit such an authority to bring an action for libel.In the cases before us, the plaintiffs are individuals suing as private citizens. None of them brought the actions in their official capacity.Even under English law, a prime minister or a minister in office may sue in their private capacity for damages in respect of defamatory matters published of them and depending on the circumstances may recover substantial damages. … 117    As Mr Gray concedes,politicians, like any other citizens, do not forfeit the protection of their reputations merely because they have entered the political arena and assumed high offices. Freedom of expression is perfectly legitimate so long as it does not encroach upon the realm of defamation. … 118    Accordingly, if a person chooses to defame another or others, he must pay for the consequences with damages to be assessed according to the prevailing law.Any argument which calls for a reduction or moderation of damages purely on the basis that the successful plaintiff is a politician, say a minister, or that the case has a political flavour is untenable and wrong.To accept such a contention is to allow a person more latitude to make defamatory remarks of such personality and to escape with lesser consequences for the defamation he committed. Such a result, if permitted, would be in violation of Art 12(1) of our Constitution which states: All persons are equal before the law and entitled to the equal protection of the law. 119    No one is free to defame with impunity another person, irrespective of whether such person is a politician or ordinary citizen. Freedom of expression comes with responsibility, and a breach of such responsibility would be visited with consequences (sometimes serious consequences). [emphasis added] 95Tang v LKYcontinues to be good law in Singapore (save possibly for one aspect which I discuss below), and the holding of the Court of Appeal as I have reproduced above is sufficient to dispose of the defendant’s arguments in this regard. I would nevertheless like to voice my opinions on some of the points raised by the defendant as well as the submissions of the IC Jurists and CIL, which do not appear to pay sufficient heed to the nature of the allegations or the confines of my decision inLHL v Roy Ngerng.",
        "The argument from truth": "96     Singaporeans enjoy a constitutional right to freedom of speech that is enshrined in Art 14(1)(a) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“the Constitution”). This provides that “every citizen of Singapore has the right to freedom of speech and expression”. But this is not an absolute right; Art 14(2)(a) of the Constitution allows Parliament to impose “such restrictions as it considers necessary or expedient in the interest of the security of Singapore or any part thereof, friendly relations with other countries, public order or morality and restrictions designed to protect the privileges of Parliament or to provide against contempt of court, defamation or incitement to any offence”. Thus Parliament is constrained in that any law derogating from this right must be for the limited purposes prescribed. 97     There are different philosophical justifications for the right to free speech. Three primary arguments can be identified: the argument from truth, the argument from democracy, and the argument from human dignity (see,eg, Dario Milo,Defamation and Freedom of Speech(Oxford University Press, 2008) (“Freedom of Speech”) at pp 55–79; Thio Li-ann,A Treatise on Singapore Constitutional Law(Academy Publishing, 2012) (“Singapore Constitutional Law”) at paras 14.006–14.020). No one theory prevails over the others. Nevertheless, it has been observed that “aspects of defamation law predominantly reflect the first two theories, and defamation law betrays a bias for the argument from democracy”: seeFreedom of Speechat p 55. 98     The classic exposition of the argument from truth, as encapsulated in the works of the theorists John Milton and John Stuart Mill, says that opinions, both true and false, should be protected so as not to deprive society of “the opportunity of exchanging error for truth” and a “clearer perception and livelier impression of truth”: see John Stuart Mill, “Of the Liberty of Thought and Discussion” inOn Liberty(1869) ch 2 <http://www.bartleby.com/130/2.html> (accessed 8 October 2015)). This is premised on an assumption that theabsolutetruth will eventually emerge. In more recent times, the argument from truth has been conceptualised in an alternative manner, which considers truth to berelative. What is “true” is simply what emerges from open discussion and argument to be accurate and/or rational: seeSingapore Constitutional Lawat para 14.011. This is expressed in Holmes J’s powerful and widely-cited dissent inAbrams v United States250 US 616 (1919) at 630, in which he states: [W]hen men have realized that time has upset many fighting faiths, they may come to believe even more than they believe the very foundations of their own conduct that the ultimate good desired is better reached by free trade in ideas—that the best test of truth is the power of the thought to get itself accepted in the competition of the market, and that truth is the only ground upon which their wishes safely can be carried out. … 99     The merits of the “competition of the market” rationale was discussed by the Court of Appeal inReview Publishing Co Ltd and another v Lee Hsien Loong and another appeal[2010] 1 SLR 52 (“Review Publishing”) at [279]–[285], which questioned its applicability to false statements offact(as opposed to opinions) – the core of the tort of defamation. Putting aside the observations of the Court of Appeal at [285] that “[o]ur political culture places a heavy emphasis on honesty and integrity in public discourse on matters of public interest, especially those matters which concern the governance of the country” (which I have addressed above in relation to the gravity of the defamation), there is force in the criticism that there is simply “no interest in being misinformed”: seeReynolds v Times Newspapers Ltd and others[2001] 2 AC 127 (“Reynolds (HL)”) at 238. Essentially, the point that is made is that there is no benefit to a system in which false statements of fact are freely disseminated, relying only on the “competition of the market” to expose them. This perhaps lays bare the disjoint between theory and practice; asFreedom of Speechstates at p 57, “history has taught us that falsehood frequently prevails over truth with deleterious societal consequences”. Through the competition of ideas, the best ones surface. But there is no benefit in permitting the free dissemination of false assertions of fact that destroy a person’s reputation.",
        "The argument from democracy": "100    The defendant’s submissions do not make this explicit, but they appear to be based on the argument from democracy. He says that the award of “extravagant damages” sends the signal to other Singaporeans that they will have to “self-censor and keep [their] thoughts to [themselves]”. This chilling effect arises because of the unusual nature of civil law defamation actions: plaintiffs need only prove that the offending material is defamatory. There is no need to prove fault (defamation being a tort of strict liability), and the burden of proving the truth of the defamatory material lies with the defendants: see Andrew T Kenyon, “LangeandReynoldsQualified Privilege: Australian and English Defamation Law and Practice” (2004) 28 MULR 406 at p 407. The result, the defendant says, is that the “ability of Singaporeans to be engaged and to improve Singapore” is compromised. 101    I pause here to note that the defendant has not been prevented from speaking on the purported mismanagement of the CPF monies, nor has he been prevented from criticising the plaintiff or any other politician. Indeed, he has published almost 400 articles, many of which were critical of government policies. What the law of defamation prevents him from doing is to besmirch the “integrity, honesty, honour, and such other qualities that make up the reputation of a person”: (per Peter Limat [13]) unless he is able to prove the truth of his allegations or can rely on the other defences of fair comment, privilege, or qualified privilege. In fact, as the defendant’s publications subsequent to the Article show, he had in fact continued to speak up on matters relating to the CPF even after he had apologised for the Article. 102    Broadly understood, the defendant’s argument is that the process of democracy requires the unfettered exchange of ideas between individuals, an exchange that would be constrained where these views and opinions are given under the threat of sanction (monetary or otherwise). This is entirely consonant with the argument from democracy as elaborated on inSingapore Constitutional Lawat para 14.017: The theory of the value of speech in a democracy focuses on the interests of the recipients of communications. It stands on a commitment to democratic procedures and open political discussions and is predicated on the idea that in the process of deliberation which requires informational flows, citizens gain an understanding of public issues and are better equipped to participate in the workings of a democratic society. For this process to work best, citizens must be exposed to a plurality of views, rather than a selected few. 103    The argument from democracy is epitomised by the Australian approach to the law of defamation. InLange v Australian Broadcasting Corporation(1997) 145 ALR 96 (“Lange v ABC”), the High Court of Australia distilled from the system of representative government provided under the Australian Constitution a freedom of political communication. In a joint decision by all members of the court, it held at 115–116: Because the Constitution requires “the people” to be able to communicate with each other with respect to matters that could affect their choice in federal elections or constitutional referenda or that could throw light on the performance of ministers of State and the conduct of the executive branch of government, the common law rules concerning privileged communications, as understood before the decision inTheophanous, had reached the point where they failed to meet that requirement. However, the common law of defamation can and ought to be developed to take into account the varied conditions to which McHugh J referred. … Accordingly, this court should now declare that each member of the Australian community has an interest in disseminating and receiving information, opinions and arguments concerning government and political matters that affect the people of Australia. The duty to disseminate such information is simply the correlative of the interest in receiving it.The common convenience and welfare of Australian society are advanced by discussion—the giving and receiving of information—about government and political matters.The interest that each member of the Australian community has in such a discussion extends the categories of qualified privilege. Consequently, those categories now must be recognised as protecting a communication made to the public on a government or political matter. … [emphasis added] 104    Similarly, judicial pronouncements from England indicate that their courts have recognised the argument from democracy as justification for freedom of expression. In the seminal case ofReynolds (HL)at 200, which developed what is now referred to as theReynoldsprivilege, Lord Nicholls of Birkenhead said: My starting point is freedom of expression. The high importance of freedom to impart and receive information and ideas has been stated so often and so eloquently that this point calls for no elaboration in this case.At a pragmatic level, freedom to disseminate and receive information on political matters is essential to the proper functioning of the system of parliamentary democracy cherished in this country. This freedom enables those who elect representatives to Parliament to make an informed choice, regarding individuals as well as policies, and those elected to make informed decisions.… [emphasis added] 105    It was with these overarching considerations in mind that the highest courts in Australia and England developed the defence of qualified privilege in their respective countries. The effect of these expansions of qualified privilege was to curtail the chilling effect defamation actions had by allowing greater scope for the operation of a defence that does not require proof of truth. It must be observed that despite the implicit recognition of the argument from democracy as a theory informing freedom of expression, neither of these decisions were considered inReview Publishingat [287] to have embodied the “fundamental right” approach. Freedom of speech takes precedence over the protection of reputation only when certain conditions are met. For example, when the “responsible journalism” test is satisfied or when the defendant’s conduct in publishing the defamatory statement is reasonable within the meaning of (the then) s 22 of the Defamation Act (1974) (NSW). 106    A similar policy-based argument was put forward inReview Publishingto justify the incorporation of theReynoldsprivilege in Singapore. The appellants argued that the Court of Appeal should follow the lead of Parliament in “encourag[ing] democratic participation in the political affairs of Singapore”, and that the governance of Singapore was a matter of public interest. This was dismissed on the ground that an adoption of theReynoldsprivilege would have to be on the basis that “the freedom of speech enshrined in Art 14(1)(a) of the Singapore Constitution is likewise ‘a right based on a constitutional or higher legal order foundation’”: seeReview Publishingat [264]. The appellants, not possessing Singapore citizenship, could not avail themselves of such an argument. 107    The question of liability and the applicability of theReynoldsprivilege is not in issue here, the defendant having being found to have defamed the plaintiff. Nevertheless, the Court of Appeal left open the possibility that what was termed inReview Publishingat [265] as theReynoldsrationale: that freedom of speech is “a right based on a constitutional or higher legal order foundation” … and, thus, “freedom of expression is the rule and regulation of speech is the exception requiring justification” could be taken into consideration in the assessment of damages. This provides an avenue for an argument by the defendant, who (unlike the defendants inReview Publishing) is a Singapore citizen enjoying aconstitutionalright to freedom of speech, that I should “shift the existing balance between constitutional free speech and protection of reputation in favour of the former” by finding that the plaintiff’s status as head of government warrants (or potentially warrants) aloweraward of damages: seeReview Publishingat [267]. In this regard, an allegation of criminal misappropriation of monies from a state-administered pension fund by a head of government is clearly a matter of public interest that was contemplated inReview Publishingto be capable of being the subject of any such shift in balance. 108    I have my reservations as to whether I may do so in the present case. First, as stated inReview Publishingat [273], it is the proponent of change that bears the burden of producing evidence of change in our “political, social and cultural values” such as to warrant a shift in the existing balance between constitutional free speech and the protection of reputation. No such evidence was brought by the defendant to my attention. Second, as I have mentioned, it seems to me that an adoption of theReynoldsrationale, if in the form of a simple discount in damages on the sole basis of the political overtones in the present case, as the defendant appears to suggest, runs contrary to the principles laid down inTang v LKYas set out above at [94]. The comments of the Court of Appeal in respect of the adoption of theReynoldsrationale, which were madeobiter, did not consider the possibility that theReynoldsrationale be given effect in such a manner.Peter Lim, which postdatesReview Publishing, also justified the award of higher damages for defamation of political leaders. 109    I am therefore of the view that even if I were to find that the existing balance constitutional free speech and protection of reputation should be shifted in favour of the former, it is not open for me to give effect to this shift by way of a discount in damages. Nor do I think I should. As I have alluded to at [105], neither the English nor Australian courts were willing to give effect to theReynoldsrationale in anunqualifiedmanner, in the sense that the act of publication must be “reasonable” in order for privilege to attract. This is not an easy hurdle to cross; despite the expansion of the defence of qualified privilege in both jurisdictions, politicians have successfully sued in defamation in their personal capacity: see,eg,Galloway v Telegraph Group Ltd[2006] EMLR 11 andHockey v Fairfax Media Publications Pty Limited[2015] FCA 652 (“Hockey v Fairfax”). This requirement of “reasonableness” is recognition, in my view, that there are limits to unrestricted communication in matters of public interest holding primacy in a democratic society. 110    In this regard, the comments of the Court of Appeal inReview Publishingat [297] suggest a more likely manner in which theReynoldsrationale can be given effect: A further observation which we wish to make is that, if theReynoldsrationale were to be applied in Singapore in the context of publication of matters of public interest, the new balance which has to be struck between constitutional free speech and protection of reputation so as to give effect to this rationale does not necessarily entail excusing or immunising the defendant from liability where the conditions for giving constitutional free speech precedence over protection of reputation are satisfied.The Reynolds rationale can equally be given effect by holding the defendant liable for defamation but adjusting the quantum of damages payable, with the exact amount to be paid in each case being calibrated by the court in proportion to the degree of care which the defendant has taken (or failed to take) to ensure that what he publishes is “accurate and fit for publication” (perLord Binghamin Jameelat [32]).Such an approach has the merit of deterring irresponsible journalism.There is no reason why a defendant who has published a defamatory statement should be allowed to get off scot-free for injuring the plaintiff’s reputation simply because he has satisfied the “responsible journalism” test. [emphasis added] 111    English and Australian decisions suggest that the degree of care that has to be taken must be greater where the defamatory statements in question relate to serious allegations of criminal wrongdoing. InHockey v Fairfax, which related to newspaper articles that implied that the Federal Treasurer of Australia was corrupt, the Federal Court of Australia stated at [358]: … [A]n assertion that the person acting in the high office of Federal Treasurer iscorruptlyselling privileged access to himself to a select group in return for donations would undoubtedly be a serious defamation.This consideration points up the need for considerable care to be taken before the conduct in publishing could be regarded as reasonable. [emphasis in italics in original, emphasis in bold italics added] 112    In England, the decision ofGrobbelaar v News Group Newspapers Ltd[2001] EMLR 18 suggests that theReynoldsprivilege is unlikely to apply for false allegations of criminal guilt. The English Court of Appeal noted, at [39]–[41], in relation to allegations of bribery levelled against a footballer: 39    … The ultimate question, of course, is whether the general public was entitled to receive the information contained in these publications irrespective of whether in the end it proved to be true or false. Who, in other words, is to bear the risk that allegations of this sort, convincing though no doubt they appear to the newspaper when published, may finally turn out to be false? … 40    To my mind there can be only one answer to these questions.If newspapers choose to publish exposés of this character, unambiguously asserting the criminal guilt of those they investigate, they must do so at their own financial risk. … 41    There is this additional consideration too. Where, as here, the published allegations are of serious criminality and likely, therefore, to be followed by the person’s arrest and trial, it is surely preferable not totally to prejudge, and thereby risk prejudicing, the criminal process in advance. … [emphasis added] 113    In the present case, I have found the defendant to have acted out of malice. He knew of the defamatory imputation that the Article carried and that it was false, but still went ahead to publish it. There was no indication, despite the defendant’s purported commitment to fact-checking, that he had any evidence to support this allegation, let alone that he had taken steps to verify such information. He had, to put it simply, called the plaintiff a thief when what he had wanted to do was to criticise the CPF policy of the government headed by the plaintiff. He had no basis to call the plaintiff a thief and it was totally unnecessary for the purpose of his criticism of the CPF policy. In these circumstances, I do not think that the incorporation of theReynoldsrationale in the manner discussed above at [110] would warrant a calibration in the damages to be awarded.",
        "Conclusion": "114    Mr Singh does not specify the amount of damages that he thinks to be appropriate, merely contending that a “very high award of damages, including aggravated damages” is warranted in this case. He points me to the following cases involving the defamation of our Prime Ministers (both former and present): (a)Seow Khee Leng– in 1988, the then-Prime Minister was awarded $250,000 in general and aggravated damages for the defamatory statement set out at [27] above, which was uttered by the then Secretary-General of an opposition party at an election rally. He was found to have been actuated by malice. He had also, by defending himself on wholly unmeritorious grounds, denied the plaintiff vindication for three and a half years. Nevertheless, he had apologised and admitted liability at the trial. (b)LKY v Davies– the then-Prime Minister was awarded $230,000 in 1989 for an article published in a reputable international publication that implied he was anti-Catholic Church and had caused or connived at the arrest and detention of other persons as an attack against four priests. The statement was found to have been made maliciously, and the defendant had cross-examined the plaintiff repeatedly on unrelated issues. (c)Lee Kuan Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 709 – the then-Prime Minister was awarded $260,000 in damages for an allegation that he had been implicated in the unlawful taking of a life for a sinister purpose. The defamatory statement, which had been uttered by a leading member of an opposition party at an election rally, was heard by 7,000 people. The defendant was found to have been “up to no good” and had timed the slander. Although the judgment did not expressly state that this sum included aggravated damages, the judge noted that the defendant had failed to correct or apologise for his imputations and had inflicted increased hurt in a subsequent defiant speech which had given the impression that he was reaffirming the original slander. The court also noted that the plaintiff had to pursue the litigation for two years and face the defence of fair comment. (d)Vinocur John– in 1995, the then-Prime Minister was awarded $350,000 in general and aggravated damages for the defamatory statement set out at [28] above, which appeared in an international publication with a local circulation of 4,000 copies daily. The allegations were found to have been unprovoked and actuated by malice. The defendants had published another article comprising allegations of a similar nature despite having undertaken not to do so barely a month earlier. (e)GCT v CSJ– in 2005, the then-Prime Minister was awarded $300,000 in general and aggravated damages for allegations that he had concealed from Parliament and the public, and/or misled Parliament in relation to, a $17 billion loan made to Indonesia. The defamatory statements were made by the leader of an opposition party in the presence of members of the public and the news media. (f)LHL v SDP– in 2009 the Prime Minister was awarded $330,000, taking into account sums received in settlement from the other defendants, in general and aggravated damages for defamatory articles published in the newspaper of the Singapore Democratic Party which drew comparisons between the PAP-led Government and the National Kidney Foundation. The articles carried the ordinary and natural meanings that the Prime Minister,inter alia, was guilty of corruption, nepotism, criminal conduct, and had condoned or permitted corruption in Government institutions. 5,000 copies of that edition of the newspaper were sold, while the English version of the defamatory article was published online. The defendants were found to have acted in malice. 115    It is apposite to compare these with awards that have been given to leaders of opposition parties who have succeeded in defamation actions. Chiam See Tong (“Chiam”) was the founder of the Singapore Democratic Party (“SDP”) and its secretary-general from 1984 to 1993. InChiam See Tong v Xin Zhang Jiang Restaurant Pte Ltd[1995] 1 SLR(R) 856, he was awarded $50,000 in damages against the defendant who had used his photograph in a newspaper advertisement to promote its business. InChiam See Tong v Ling How Doong and others[1996] 3 SLR(R) 942, Chiam was awarded $120,000 against the defendants who had published words imputing that, in his craze for personal political power and motivated by spite and jealousy against the central executive committee, he had attempted to destroy the SDP and was therefore not a man of honour or principle. 116    It is trite that each case lies on its own facts. This is particularly so in respect of the assessment of damages for defamation. The cases above nevertheless indicate the range of damages awarded to prime ministers who have been defamed. These have been substantial, falling within the highest end of the spectrum of damages for defamation. As discussed above at [30]–[32], this is in recognition of the standing that political leaders have in our society. I have also found the defendant to have acted out of malice and the mode of publication to be aggravating. On the other hand, none of the awards given to a prime minister involves a defendant of modest standing such as the defendant in the present case. I find this factor to be significant for the reasons given in [34]-[43] above. The general and aggravated damages that have been awarded to a prime minister have ranged from $230,000 to $260,000 in the 1980s to sums in excess of $300,000 in the last 20 years. In the present case, I am of the view that a substantial reduction would be appropriate in the circumstances of the case, primarily in view of the comparatively low standing of the defendant. I find the sum of $150,000 (comprising $100,000 in general damages and $50,000 in aggravated damages) to be a fair and reasonable figure for damages. I therefore order the defendant to pay the plaintiff damages in the sum of $150,000. 117    I will hear the parties on the question of costs."
    }
}