{
    "case_title": "Ishak bin Abdul Kadir\n      v\n      Khoo Hui Ying",
    "ncitation": "[2015] SGHC 181",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "The undisputed facts": "4       Sometime between late 2009 and early 2010, the plaintiff and defendant became lovers. The defendant moved in with the plaintiff who had a room in his parents’ HDB flat. Their relationship broke down sometime in the middle of 2012. At the material time the plaintiff worked as an engineer with a monthly salary of around $7,000 to $8,000, taking home about $6,000 to $7,000. 5       In 2010, the property known as 21 Oxford Road #18-04, Oxford Suites, Singapore 218817 (“Oxford Property”) was purchased for $800,000. It was registered in the names of the parties as joint tenants. They obtained a loan of 90% of the purchase price from CIMB Bank as joint mortgagors. The balance was paid for by cash from the plaintiff and funds from the parties’ CPF accounts. The defendant’s only direct contribution towards the purchase was the sum of $15,319.14 from her CPF account. Stamp duty and other fees amounting to $18,600 were paid by the plaintiff. 6       The parties lived together in the Oxford Property from the time it was purchased until it was sold in January 2012. The sale price was $990,000. After repayment of the bank loan and refunding the CPF accounts of the parties, the balance sum of $213,548.71 was paid into the plaintiff’s UOB bank account. 7       The sale and purchase agreement for the Property, at the price of $1.568m, was signed on 3 February 2012. It was registered in the names of the parties as joint tenants. A loan for 80% of the purchase price was obtained from UOB by the parties as joint mortgagors. The remainder 20%, amounting to $313,600, was paid using the parties’ CPF funds and cash as follows: (a)     plaintiff’s CPF: $46,100; (b)     defendant’s CPF: $15,900; (c)     cash: $251,600. 8       Stamp duty and other legal fees were also paid in cash. The defendant’s only direct contribution came from her CPF although she claimed a half share in the balance cash sum of $213,548.71 from the sale of the Oxford Property. 9       After completion, the parties moved into the Property together with the plaintiff’s parents. However their relationship broke down a few months after that and they decided to end their liaison. The defendant moved out of the Property sometime in mid-2012.",
        "The disputed facts": "10     The plaintiff’s position was that he had intended to purchase a property in November 2011 for him to reside with his parents. At the time his relationship with the defendant was serious and they had discussed marriage and he had intended for the defendant to reside with him in that property. After viewing a number of apartments, he settled on the Property. The plaintiff had intended to pay for the Property using his own funds as his main intention was to provide a home for him and his parents. However he decided, as an expression of love for the defendant, to include her name as co-owner of the Property. He elaborated in cross-examination that this was to demonstrate his commitment and to assure her of his intentions towards her. The plaintiff said that he was not aware of the implications of holding the Property as joint tenants. He said that he had sufficient funds to pay for the Property but “it was decided that the Defendant would contribute whatever funds she could from her CPF Ordinary Account” as this was a practical thing to do as the money would otherwise be idle. 11     The defendant’s narrative went further back in time. Her position was that around January 2010, the plaintiff’s father was in arrears of monthly instalments of about $700 for the latter’s HDB flat. This was because he earned a low income as a driver, had no CPF contribution and was getting on in age. The plaintiff had the option of becoming co-owner of the flat in which case he could use his CPF contribution to pay the monthly instalment. However this option did not appeal to him as the plaintiff wanted to live on his own in a private property. In the end, the plaintiff’s parents sold their flat and moved into their daughter’s flat. The defendant helped the plaintiff to look for a suitable property, settling on the Oxford Property for which he paid $8,000 option fee. However the plaintiff only had $45,000 in cash, which would require him to borrow 90% of the purchase price of the Oxford Property. The plaintiff was unable to obtain in-principle approval from the banks he applied to for the loan as his income was insufficient. The plaintiff asked the defendant to be a co-borrower in order for him to be able to obtain the 90% financing. The plaintiff made the following offer to the defendant: he would make all payments for the property, including the loan, property tax and maintenance, and she would contribute in terms of utility bills and broadband subscription. They would hold the property as joint tenants and in the event of severance, they would share the proceeds equally. The defendant agreed and they completed the purchase of the Oxford Property on this basis. The defendant claimed that she kept to her part of the bargain by making payments to SP Services for utilities and Singtel for broadband charges. The defendant said that the plaintiff subsequently decided to upgrade to a larger apartment (the Oxford Property had only one bedroom) because he needed to house his parents. The plaintiff decided to buy the Property and they sold the Oxford Property. The defendant said that around this time their relationship was turning sour. She had wanted to withdraw her half share of the profit from the sale of the Oxford Property which she said amounted to $106,774.35. However this would have meant that the plaintiff would not have enough cash to complete the purchase of the Property. The defendant said that in view of her good relationship with the plaintiff’s parents, she permitted the money to be used for the purchase. The defendant said that she came to an oral agreement with the plaintiff that should their relationship come to an end, she would not lay claim to her half share of the Property if the plaintiff paid her her half share of the proceeds of sale of the Oxford Property.",
        "My findings of fact": "12     For the reasons that follow, I prefer the defendant’s version to that of the plaintiff. 13     In the first affidavit filed in support of this originating summons, the plaintiff did not mention the Oxford Property at all. It was only after the defendant filed her affidavit which provided the full background that the plaintiff provided the complete narrative in his reply affidavit. It would appear that the reasons he gave for including the defendant as joint tenant in relation to the Property would also apply to her being a joint tenant in the Oxford Property. 14     The plaintiff claimed that part of the reason for the breakup was because the defendant could not stand his parents. However the defendant had given evidence of text messages which showed that she got on well with his parents. There was even an instance after they broke up when she agreed to meet with the plaintiff and his parents for a meal and the plaintiff said that his mother would be very happy about that. 15     The plaintiff claimed that he had agreed to put the defendant’s name as joint owner as an expression of his love for her. He said that at the time he did not know the significance of a joint tenancy. He also said that in any event, if they were to be married eventually, it would not make a difference. I found the plaintiff’s explanations to be contradictory. If the plaintiff did not understand the significance of joint tenancy, then the fact that it would not make any difference as they would get married eventually would not even have been considered. This appeared to be a submission after the fact rather than something he had actually thought about at the time. 16     The plaintiff said that he did not need the defendant’s CPF funds as he had sufficient funds because he could have borrowed money from his father who had just sold his HDB flat. The plaintiff explained that he had used the defendant’s CPF funds only because it seemed a convenient thing to do. However he did not provide any evidence that his father had sufficient money to lend to him. The defendant’s position was that the plaintiff did not have sufficient funds to make the down payment. Further he was not able to procure a bank loan on his own and required the defendant to be a co-borrower, having been rejected for a loan by some banks. On the plaintiff’s version, the defendant had agreed to use her CPF funds, and risked losing it if the property value fell, purely out of love. 17     When asked why he agreed to registering as joint tenants, the plaintiff said that he did not know its implications. He said that the intention was that the defendant would have no share in either property. He was then shown a form entitled “Manner of Holding” in relation to the Property that he and the defendant both signed sometime in November 2012. This form explained the nature of joint tenancy and tenancy in common. They had both opted for joint tenancy. The plaintiff’s explanation for this was that he had no recollection of this form as everything happened quickly in the lawyer’s office. However the form required the parties to elect the manner of holding and gave a detailed explanation of the nature of both types of holdings. The plaintiff is a university graduate and the simple language in the form could not have eluded him. In any event the solicitor was available to advise him if he had any doubt. There was no reason for the plaintiff not to elect tenancy in common if that was what he had intended all along. 18     It must be remembered that the parties were in a domestic relationship at the time. The defendant had lent her name to procure the bank loan and had used her CPF funds to pay for both properties, which were registered in both their names as joint tenants. 19     I should also add that I found the plaintiff to be evasive, both in the manner in which he had attempted to put his case initially by not providing the court with the complete picture, and in his answers in cross-examination. The defendant on the other hand had set out in her affidavit a complete and consistent narrative, supported by documentary evidence where she could. 20     For the reasons above I found the version of the defendant to be the truthful one. The defendant’s position was that they had agreed that, should they break up, the plaintiff would repay her share of the net profits from Oxford Property. I therefore found that the defendant has an interest in the Property to the extent of her share of the net profit from the Oxford Property. Taking into consideration the parties’ CPF contributions, I assessed the net profit to be $127,783.81. The defendant’s interest in the Property therefore amounts to $63,936.91."
    }
}