{
    "case_title": "TCT\n      v\n      TCU",
    "ncitation": "[2015] SGHCF 3",
    "coram": "Valerie Thean JC",
    "sections": {
        "Introduction": "1       Where a wife seeks maintenance for herself and her child under s 113(a) and s 127 of the Women’s Charter (Cap 353, 2009 Rev Ed) (“the Charter”) after the commencement of divorce proceedings, must she prove, as is required in applications under s 69 of the Charter, that the husband has failed to provide reasonable maintenance? 2       I answered this question in the affirmative while allowing an appeal from a husband (“the Husband”) against the decision of a district judge (“the Judge”) awarding interim maintenance for his son (“the Son”) and wife (“the Wife”) on 23 April 2015. These are my grounds of decision.",
        "The facts": "3       The Wife is at present about 42 years old, the Husband is about 40. They married on 14 July 2005. The Son, aged 9, is their only child. 4       As at 20 August 2014, the Wife earned a gross monthly salary of $16,303.[note: 1]As at 24 September 2014, the Husband earned a gross monthly salary of $17,375.[note: 2]The Husband’s mother, who was also residing at the matrimonial home, took care of the Son when the parents were working and also paid for various expenses for the Son and the household on behalf of the Husband.[note: 3]The Husband later reimbursed his mother, albeit with delay. 5       After some eight years, the Wife commenced divorce proceedings on 25 February 2014. Interim judgment was granted on 3 July 2014. Parties, meanwhile, still reside in the matrimonial home and the Husband’s mother continues to care for the Son while the Wife and Husband are at work.",
        "The application for interim maintenance": "6       On 20 August 2014, the Wife applied for interim maintenance in Summons No [B].[note: 4]She sought $1,000 in monthly maintenance for herself and $4,000 in monthly maintenance for the Son.",
        "The Judge’s decision": "7       The Judge dealt with this on 31 October 2014, 4 December 2014 and 8 January 2015. Although the Judge “[could not] say that the Husband neglected or refused to maintain either [his child or wife]”, she ordered that the Husband pay maintenance for the Wife at $500 a month and the Son at $1,500 a month. 8       She explained, in the following terms, that s 113 of the Charter did not contain the same legal threshold as s 69:[note: 5] 2. It must be borne in mind that this was an application under [s 113 of the Women’s Charter (Cap 353, 2009 Rev Ed) (“the Women’s Charter”)] and not [s 69]. Whilst both statutory sections [deal] with maintenance orders that a [court] may make, there were different legal thresholds to be met. a. Section 69(1) states that any married woman whose husband neglects or refuses to provide her reasonable maintenance may apply for such maintenance. Section 69(2) similarly stated that where a parent has neglected or refused to provide reasonable maintenance for his child, the parent can be ordered to do so. b. On the other hand, [s 113] does not impose the element of “neglect” or “refusal” to provide maintenance before the [court] can order such maintenance to be payable to the wife or former wife. 3. [Counsel for the Husband] repeatedly submitted that the [Husband] was not neglecting to pay for the child’s maintenance especially, thus the [Wife’s] application had to fail necessarily. But this was misconceived. It was clear that the legal provisions under [s 113] did not require any “neglect” or “refusal” on the part of the [Husband]. Had this been an application under [s 69], it was possible that the [Husband] would then have been able to successfully rely on this argument. 9       In dealing with the evidence, the Judge found that the Wife’s figures as to expenses incurred by herself, the Son and the household were overstated. She found that the Son’s monthly expenses were $2,149.99 rather than $3,995.64 as submitted by the Wife. She also found that the Wife’s monthly expenses were $514.54 instead of $1,833.67, and that the household monthly expenses were $500 instead of $1,500.",
        "The appeal": "10     Dissatisfied, the Husband appealed. Parties first appeared before me on 8 April 2015. The main ground of appeal was that the Judge had not made a specific finding that the Husband had neglected to reasonably maintain his Son and Wife. At that point, it was unclear from the Wife’s submissions on appeal whether in the event that there was a need to prove that the Husband had failed to maintain her and the Son, this criterion was made out. I gave both parties an opportunity to illustrate the proportion of the household expenses and the maintenance for the Son and Wife that was paid by each party, with counsel to return on 23 April 2015 with any relevant reply.",
        "My decision": "11     On 23 April 2015, after considering the submissions and hearing counsel, I allowed the appeal and set aside the orders made below. I also fixed costs to the Husband at $5,000, both for the appeal and the matter below. I explain my reasons here.",
        "The appeal against the Judge’s orders": "",
        "The legal context": "The availability of two modes of seeking interim maintenance once divorce proceedings commence 12     Where parties are in a marriage, the relevant provision for seeking maintenance is s 69 of the Charter, which reads as follows: Court may order maintenance of wife and children 69.—(1) Any married woman whose husband neglects or refuses to provide her reasonable maintenance may apply to the court, and the court may, on due proof thereof, order the husband to pay a monthly allowance or a lump sum for her maintenance. (2) The court may, on due proof that a parent has neglected or refused to provide reasonable maintenance for his child who is unable to maintain himself, order that parent to pay a monthly allowance or a lump sum for the maintenance of that child. … 13     Once divorce proceedings have commenced, the wife may use s 113(a) (for the wife) and s 127 (for the child). They read as follows: Power of court to order maintenance 113.The court may order a man to pay maintenance to his wife or former wife — (a) during the course of any matrimonial proceedings; … Power of court to order maintenance for children 127.—(1) During the pendency of any matrimonial proceedings or when granting or at any time subsequent to the grant of a judgment of divorce, judicial separation or nullity of marriage, the court may order a parent to pay maintenance for the benefit of his child in such manner as the court thinks fit. Commonality in criteria for child maintenance 14     In the case of child maintenance, the relation between s 127(1) of the Charter and s 69(2) is made clear by s 127(2), which states: The provisions of Parts VIII and IX shall apply, with the necessary modifications, to an application for maintenance and a maintenance order made under subsection (1). In addition, the factors for determining the quantum for child maintenance are located in s 69(4) of the Charter. Do ss 69(1) and 113 of the Charter have the same commonality? 15     For spousal maintenance, as the Judge mentioned, there are no express statutory criteria mentioned within s 113 of the Charter. Nevertheless, in light of how the same factual situation could result in either remedy being used, it would be desirable for like situations to be treated alike. The object of the sections and its legislative history support this interpretation. Legislative history 16     Section 69 of the Charter finds its origin in a new s 60, which was inserted in 1981 by the Women’s Charter (Amendment) Act (Act 26 of 1980). This changed the common law paradigm which previously necessitated culpability and substituted it with a need basis: see Leong Wai Kum, “The Duty to Maintain Spouse and Children during Marriage” (1987) 29 MLR 56 at pp 62–63. 17     Then Acting Minister of Social Affairs, during the deliberations of the Select Committee of Parliament on the Women’s Charter (Amendment) Bill (Bill No 23/79), explained in the report dated 25 February 1980:[note: 6] The existing [s 60] is not entirely satisfactory and this is borne out by the criticism by the YMCA, Ms Leong Wai Kum, the Lawyer’s Christian Fellowship and Mr Michael Hwang. Therefore, a new [s 60] is to be enacted to lay down principles for a Court to grant maintenance for the wife and children.These principles are similar to those laid down in the new Part IX of the Women’s Charter.[Emphasis added] 18     The new Part IX mentioned by the Minister contained the power to order maintenance and the principles for determining the amount of maintenance to be paid. 19     InLetchme v Gopal[1980] 1 MLJ 143 (“Letchme”), the High Court stated,obiter, in the context of the 1970 Rev Ed of the Women’s Charter, that “[a]s against an erring husband, a wife has a remedy for her maintenance and in seeking to enforce this remedy she can elect either to go to the subordinate courts or to the High Court depending on whether the maintenance sought is (1) the primary and only relief she is seeking or (2) whether it is ancillary to proceedings, under Pt IX of the Women’s Charter, affecting her marital status. If it is the former she can only use the subordinate courts as her forum, if the latter then the High Court is her forum.”. 20     It would be ideal if the two sections, put together in the same statute for the first time in 1961 when the Charter was enacted, did not overlap. Prof Leong Wai Kum, for example, in Leong Wai Kum, “The Duty to Maintain Spouse and Children during Marriage” (1987) 29 MLR 56 at p 66, criticisedLetchmeand thought that the two remedies “cannot both be available to an applicant at the same time”. Indeed it would be more appropriate if, after the commencement of divorce, married women only used s 113 of the Charter. This would make for neatness, enabling all pending proceedings after commencement of divorce to be in a single suit before the court. However, where a woman is still married but is involved in pending divorce proceedings, there is nothing in the Charter to prevent her filing an application under s 69(1) rather than s 113(a) if she requires interim maintenance. In practice many women do file s 69 applications even after the commencement of divorce proceedings. Relevant cases 21     InSengol v De Witt[1987] 1 MLJ 201 (“Sengol”), in the context of the relevant factors to determine the amount of maintenance to be ordered, the High Court made the observation that “[i]t is most unlikely that a High Court exercising jurisdiction to make a maintenance order is required to apply different principles according to whether the application is made prior to … or consequent upon … matrimonial proceedings”. Although the factors for deciding maintenance were slightly different for both sections, the High Court decided that “the use of an all embracing formula ‘all the circumstances’” indicated that “the same principles should govern both sets of proceedings, save for para (g) of s 102(1) which is applicable only in divorce proceedings”. 22     Of relevance is that inSengol, the High Court structured the maintenance order in a way similar to a court exercising its discretion under s 113(b) of the Charter although it was not yet known at that point if the parties would divorce. The High Court followed the approach inHayes v Hayes(1981) 11 Fam Law 208, where transitional periodic payments were ordered upon divorce after a short marriage. The husband’s obligation to pay maintenance inSengoldid not arise on the ground simply that they were married, but on the ground of reasonableness. On the facts, the High Court decided that it would be reasonable for the husband to see her through a period of transition in light of the loss that she had suffered for the flat. 23     InPrasenjit K Basu v Viniti Vaish (m.w.)[2003] SGDC 303 (“Prasenjit”), both counsel conceded, and the District Court agreed, that even if the application was brought under s 113(a), neglect or failure to provide reasonable maintenance must be shown (at [10]–[11]), and in both cases, the applications should be dealt with as applications for interim maintenance pending the final decision of the court. Similarly inTEM v TEN[2014] SGDC 238 (“TEM v TEN”) at [19]–[20], the District Court, in a s 69 application where divorce had been commenced, dealt with the case in the same manner as it would have dealt with a s 113(a) interim maintenance application. 24     Counsel for the Wife argued for a more relaxed standard for s 113, hinging his argument upon the District Judge’s statement inPrasenjit,obiter, that “the court would be more prepared to make a finding that the husband/father has failed to pay reasonable maintenance in a [s 113(a) or s 127] application as opposed to a [s 69] application” [original emphasis omitted] (at [12]). The District Court stated (at [13]): … the [s 69] maintenance order is made on the basis that the marriage is still subsisting and will continue to subsist. Court orders regulating the conduct of members of an intact family in relation to each other should not be lightly made. The reason for this is that society should not seek to interfere in what are essentially private and personal relationships, unless one of those family members has clearly failed in his responsibilities towards the relevant family member or members. In a [s 113(a)] or [s 127] application, however, divorce proceedings have already commenced. The court has already been asked to regulate the lives of the family members, and there is the expectation that it will do so. Court orders in respect of maintenance for the wife and children will be made, at the end of the day, and they will be made even if there has been no failure or neglect on the husband’s part to maintain the wife and children. 25     I would put this in another way. The legal threshold is specified in s 69 simply because parties are not yet before the court. The section thus provides the specific criteria to found the court’s jurisdiction. In a s 113(a) application, there is no need to specify any criteria to allow a litigant to file the application, because the court is already seised of the suit. However, simply because a suit lies in its jurisdiction does not necessitate that the court should go on and regulate the lives of parties with a lower threshold. The premise of need ought to still be there, in line with Parliament’s intentions in 1981, and the High Court’s previous interpretation inSengol. In this context, a distinction may be drawn between s 113(a) and s 113(b) of the Charter. While the court must settle any outstanding ancillary matters after interlocutory judgment under s 113(b), and in that context, provide maintenance even where a husband has acted reasonably, this is on the premise of a final termination of their joint lives. Up until that point where the court makes its orders under s 113(b), a husband’s obligation to reasonably maintain his wife still exists. Thereafter if there is no court order, that obligation ceases. Conversely, even if there had not been any order of maintenance up to that point, the Court is able to order maintenance on the termination of the marriage: seeFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506. This is a different situation from an application for interim maintenance under s 113(a). For s 113(a), the court should not be more ready to intervene simply because a divorce suit exists. There are wider implications on the family if a court were so to do, to which I now turn. The interests of the child 26     A point not yet considered is the effect of litigation on familial ties. Court litigation and orders inevitably further exacerbate strained ties. Where a child is involved, a court order sends a signal to the child about whether his father is a responsible parent or whether the father is callous towards his mother. This will strain the father-son relationship. This will be detrimental because if a father-son relationship is strong and ideally continues so after divorce it can be a source of comfort to a child in a time of unhappiness and uncertainty. 27     The recent Court of Appeal decision ofBNS v BNT[2015] SGCA 23, which concerned a mother seeking to relocate her children to Canada, highlighted “the golden thread that runs throughallproceedings directly affecting the interests of children” (at [19]). This “golden thread” is that “the welfare of the child is paramount and this principle ought to override any other consideration” [emphasis in original]. For the reasons I have stated at [26] above, it is not in the interests of a child to make an order either for his or his mother’s maintenance in the absence of a need to do so. 28     In this particular case, the paternal grandmother’s well-being is also relevant to the Son’s welfare as she is an essential caregiver for the Son. It was clear from her affidavit that she wished to have peace in the household. In particular, she stated the following (in reply to a statement in the Wife’s affidavit that she did not know if the Son was reimbursing the mother for household expenses):[note: 7] 5.    I confirm too that nothing has changed since the Plaintiff has filed for divorce. All are residing under the same roof and life goes on as per normal. The Defendant is paying for the bills as per normal and continues to reimburse me. I hope that there will be peace even though parties are divorced. This affidavit is to assure the Plaintiff too that the Defendant has not taken advantage of me. I also regard the Plaintiff as my daughter and I hope that both can resolve matters amicably for the sake of their son. Other consequences of a court order 29     Even where children are not involved, there is a broader issue of fairness. InPrasenjit, the District Court said most aptly (at [11]): … It would be oppressive and unfair to a party if a court order was made against him, even a short-term order pending the final resolution of the ancillary matters in divorce proceedings, if his conduct had been entirely blameless. Moreover, the court would not normally wish to interfere and regulate the private lives and relationships of individuals unless there was some need to do so. 30     This is especially true of family proceedings, where tension and emotion are the order of the day. Each application has costs consequences, in both financial and non-financial terms, not only on the party responding and the party applying, but on broader family relationships. Where such costs are financial, they impact not only upon the financial positions of the parties themselves but also the joint assets which ought to be preserved for division to address the wider needs of the family. The court ought to be asked to intervene only where required and necessary. Conclusion on legal criteria applicable to ss 113(a) and 127 of the Charter 31     For these reasons, I was of the view that, whilst s 113(a) of the Charter did not expressly specify that a court should only order maintenance where the husband has neglected to reasonably maintain his wife. In cases where divorce proceedings have commenced, the principles applicable to interim maintenance that the courts have defined in the context of s 113(a) should also apply to s 69 applications made in the same circumstances. As for s 127(1) of the Charter, the link to s 69(2) and (4) of the Charter is made clear by s 127(2).",
        "Whether the husband failed to provide reasonable maintenance": "Parties’ arguments 32     The Husband argued that he had not neglected to maintain the Wife, as is most clearly evinced by his provision of supplementary credit cards to which the Son’s expenses had been charged.[note: 8]The Husband, through his submissions, indicated that he had been paying 84% of the Son’s expenses. He highlighted evidence which showed that the Wife had been using these cards at least up till April 2014 and made the point that he had not restricted her use of the cards in any way. The Husband also alleged that he would reimburse his mother for whatever payments she made towards the expenses of the Son and the household. 33     The Wife, on her part, tabulated her contributions to her own expenses, and the expenses of the Son and the household. The issue as to what proportion of total expenses this came to was not addressed. Although she indicated that the Husband contributed “minimally and the mode and manner he made his contribution [was] unreasonable … in that he reluctantly paid up … relying on his mother to cover the household expenses”,[note: 9]she accepted that the Husband provided her with two supplementary credit cards, neither of which had been cancelled. The Wife argued that the supplementary credit cards were only used for the Son’s lessons and not for her maintenance, and that the Husband generally left it to his mother to pay for the Son.[note: 10]The Wife also complained that there were long delays in the Husband reimbursing his mother: in one instance she took the household cash (which she conceded was left by the Husband) and banked that in for her mother-in-law. Conclusion on whether maintenance orders were necessary Household expenses 34     I deal with this point first because the Husband, the Wife, the Son and the grandmother still live in the same home. This issue is relevant both to the issue of the Son’s and the Wife’s maintenance. It was accepted that the Husband’s mother pays for a substantial component of the household expenses, with reimbursements being made by the Husband. The mother affirmed, in her affidavit, that the Husband had reimbursed her for payments that she made in relation to the household expenses.[note: 11] 35     There was no contention that the Wife paid her mother-in-law for what the mother-in-law paid on behalf of the Husband. She conceded that the household cash which she had banked in for her mother-in-law was left at home by the Husband. Her contention was that she had paid for other expenses, such as family holidays which involved the Husband’s mother but not the Husband, car expenses, monthly newspaper subscription costing $40 and the quarterly maintenance fees of $1,000 for the condominium unit in which they reside.[note: 12] The Wife’s maintenance 36     On the Wife’s evidence, prior to the commencement of proceedings, the Husband did not pay her anything by way of maintenance save for paying the premiums of her insurance policies.[note: 13]In addition, after the commencement of the divorce proceedings, he stopped paying the premiums on her insurance policies. 37     Nevertheless, it is not correct to say the Husband was not maintaining the Wife in any way. She lived in the matrimonial home, where a substantial proportion of the household expenses were paid by him through his mother. The component of expenses paid for in the first instance by his mother remained the Husband’s contribution. His mother was content with the mode of payment, which had been in place since 2008. It was not the Wife’s contention that she had paid her mother-in-law. Her contention was that the Husband was slow to reimburse his mother. His mother, on the other hand, had no complaint. It did not make sense to impose a court order for the Husband to pay the Wife in order for her to pay his mother when both had their own arrangement which neither were unhappy with. 38     The Wife’s other contention was that she contributed to the expenses. Yet the law does not render it the sole obligation of the Husband to pay for all the family’s needs. While the Wife also paid for various expenses, it is commonplace in a marriage not to account for each expense and split expenses down a precise middle line; indeed the law should not encourage that. Spouses often pay for different components, and the Husband would have failed to reasonably maintain her if he was shown to have paid such a minimal proportion as to be neglectful. On the facts, I was not persuaded that the Wife was paying so much and the Husband paying so little that he had failed to reasonably maintain her. The Son’s maintenance 39     Again, it was clear that the Son benefits from the household expenses paid by the Husband. In addition, the Husband had made two supplementary credit cards available to the Wife. While her evidence was that she had stopped using these cards, this was not because of any request on the part of the Husband. The Husband imposed no limitation on her use of the cards, and adduced evidence that she had been using the cards for various expenses up until relatively recently. The duty to maintain a child is shared by both parents. The Wife was not able to make out a case that she had paid so much, and the Husband so little, that he had failed to maintain his Son. And there remained, throughout, the provision of the credit cards.",
        "Conclusion": "40     I therefore allowed the appeal by the Husband and set aside the Judge’s orders for interim maintenance for the Son and the Wife. 41     As for costs, these are at the discretion of the Court. In my judgment, it was appropriate in this case - and followed from my reasoning at [29] that such applications ought to be made only where required and necessary - for costs to follow the event. Costs of the appeal, and of the hearing below, were fixed at $5,000 after hearing counsel.  [note: 1]The Appellant’s Record of Appeal (“ROA”) at p 14. [note: 2]ROA at p 77. [note: 3]ROA at p 70. [note: 4]ROA at p 4. [note: 5]ROA at pp 288–289. [note: 6]Report of the Select Committee of Parliament on the Women’s Charter (Amendment) Bill, Appendix IV, C4. [note: 7]ROA at p 202. [note: 8]ROA at p 282. [note: 9]The Wife’s submissions dated 10 March 2015 at para 31. [note: 10]ROA at p 283. [note: 11]ROA at p 202. [note: 12]ROA at pp 9–10. [note: 13]ROA at p 8 and the Wife’s submissions dated 10 March 2015 at para 10."
    }
}