{
    "case_title": "Tjong Mark Edward\n      v\n      Public Prosecutor and another appeal",
    "ncitation": "[2015] SGHC 91",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The appeal against sentence for the first charge": "73     On 24 March 2015, I dismissed Tjong’s appeal against sentence for the first charge. I now set out my reasons. 74     In an appeal against sentence, appellate intervention is warranted if the sentence is manifestly excessive or inadequate, wrong in law or against the weight of the evidence (s 394 of the CPC). It was stated inPublic Prosecutor v UI[2008] 4 SLR(R) 500 that intervention on the latter two grounds require the DJ to have: (a)     erred with respect to the proper factual basis for sentencing; (b)     failed to appreciate the material before him, or (c)     applied a wrong principle in sentencing. 75     In corruption cases, deterrence features strongly as a sentencing consideration. Even in private sector corruption cases, there is no presumption of a non-custodial sentence (Public Prosecutor v Ang Seng Thor[2011] 4 SLR 217 (“Ang Seng Thor”) at [33(c)] and [39]perV K Rajah JA). In determining whether the custodial threshold is crossed, the following factors can be distilled fromAng Seng Thorat [33(d)] and [42] and from the judgment of Sundaresh Menon CJ inPublic Prosecutor v Marzuki bin Ahmad and another appeal[2014] 4 SLR 623 (“Marzuki”) at [28]: (a)     the seniority of the accused, the nature of the duty owed to the principal or the level of control enjoyed by the accused; (b)     the gravity of the offence as measured by the duty compromised or the mischief or likely consequence of the corruption; (c)     the size of the bribes; (d)     the number of people drawn into the web of corruption; (e)     whether such conduct was endemic, was systematic or occurred over a long period of time; and (f)     any applicable policy considerations. 76     The DJ reasoned that Tjong was in a position of influence, that the size of the gratification was fairly substantial and that Tjong tried to cover his tracks by disguising the sum in C1 and by using Ho’s bank account. Considering that he was a first offender, the DJ sentenced him to 8 weeks imprisonment. 77     Mr Nathan argued that the sentence was manifestly excessive because the custodial threshold was not crossed in this case. He said that the DJ placed too little weight on the mitigating factors and the Defence’s precedents and too much weight on the aggravating factors and the Prosecution’s precedents. He emphasised that STE did not suffer any adverse effects, that the actual profit-sharing was spontaneous and was triggered by Mujibur asking what he could do for Tjong. Further, the amount of gratification was relatively low and Tjong had no criminal record before this incident. 78     It is true that STE eventually secured the contract and that it would not have to pay Mujibur anything if it did not. In that sense, STE did not suffer direct monetary losses. However, the fact remains that Tjong’s duty to STE was compromised. Tjong clearly acted with premeditation and deliberation. He wrote the amount of $57,386.67 on C1 to disguise its true purpose and received the money indirectly in order to throw off suspicion. The idea to share profits was mutual and, more importantly, it was Tjong who dictated the terms of the gratification. The gratification involved was not a small amount. Together with the amount involved in C2, it represented 47.1% of Mujibur’s commission. This was by any standard a very generous share. Even Mujibur had to think of recovering the amount from future business. 79     I agreed with the DJ that Tjong was in a position of influence. At the material time, he was a business development director in charge of the South Asia region. Tjong’s recommendation was accepted by STE’s president unhesitatingly as he was trusted by STE to manage and promote its interest in Bangladesh. 80     I shall now turn to two of the precedents that the Prosecution cited. InPublic Prosecutor v Rajagopal v Chandrachagaran(DAC 47221 of 2013), the accused, an operations manager, pleaded guilty to one count of receiving $39,479.40 for recommending a supplier for the procurement of equipment. He was sentenced to two months’ imprisonment. InTang See Meng v Public Prosecutor([2001] SGDC 161; MA 62 of 2001), the accused, a contracts manager, received gratification ranging from $10,000 to $40,000 (and totalling $140,000) on five occasions over eight months for recommending that certain work be sub-contracted to one firm. Following a trial, he was convicted on all five charges and sentenced to three months’ imprisonment per charge (the total sentence was six months’ imprisonment). No specific mitigating or aggravating circumstances were mentioned. 81     Mr Nathan submitted that the DJ failed to place enough weight on the “strikingly similar” case of PublicProsecutor v Subramaniam s/o Muneyandi[2003] SGDC 259 (“Subramaniam”). There, the accused, a commercial manager, was convicted after trial on two charges under s 6(a) of the PCA for obtaining two loans of $20,000 and $30,000 for recommending that ST Marine’s ship piping jobs be awarded to Omega. He was sentenced to a global fine of $25,000. It was submitted that the facts inSubramaniamwere even more aggravating since the accused there actively sought the loans from Omega’s operations director. However, as I have reasoned above, Tjong was not a passive party. There are also two more distinguishing factors. First, Tjong was in a position of greater influence since he was STE’s sole presence in Bangladesh and his recommendations were trusted by the approving panel. In contrast, the accused inSubramaniamwas not directly involved in selecting sub-contractors for piping jobs. Second, the accused there repaid $10,000 of the gratification while Tjong, who denies having taken any money from Mujibur, has naturally not repaid anything.[note: 1] 82     In the circumstances, it could not be said that the DJ erred with respect to the proper factual matrix or the weight ascribed to the relevant factors or that the sentence was manifestly excessive considering the precedents. I therefore upheld the sentence on the first charge.",
        "The appropriate sentence for the second charge": "83     After I reversed the acquittal on the second charge, I invited both parties to tender further submissions on the appropriate sentence for the second charge and whether it should run consecutively with the first (if an imprisonment term was also imposed). 84     The Prosecution submitted that a global sentence of five to seven months’ imprisonment was appropriate because the fresh conviction on the second charge amplified the extent of Tjong’s criminality in terms of quantum and premeditation. The total gratification of $87,386.67 received exceeded 60% of Tjong’s then-gross annual salary of $140,000 and this reflected his greed and abuse of influence. The fact that Tjong deposited the cheque in the same circuitous fashion but nearly two weeks later and that he spaced out the subsequent encashment showed a higher degree of premeditation and resolve to avoid detection. To achieve this global imprisonment term in light of the fact that I had dismissed Tjong’s appeal against sentence on the first charge, the Prosecution invited the court to invoke its revisionary power to increase the sentence for the first charge. What was palpably wrong with the DJ’s decision, it was submitted, was that the DJ relied on an incomplete picture of Tjong’s acts and culpability because he took into account only the facts and circumstances relating to the first charge. 85     Mr Nathan submitted that there were only two differences between the two charges, namely, the quantum of the gratification and the fact that there was no deliberate concealment insofar as the sum of $30,000 was not disguised to be for another purpose. He submitted that an appropriate sentence for the second charge was between four and six weeks’ imprisonment and that both imprisonment terms should run concurrently based on the one-transaction principle. He also opposed the Prosecution’s application for criminal revision. 86     I will first deal with the Prosecution’s argument regarding criminal revision. First, as Mr Nathan pointed out, I could not exercise my powers of revision in respect of the sentence for the first charge since I had already dismissed the appeal against sentence. I held inTee Kok Boon v Public Prosecutor[2006] 4 SLR(R) 398 that the High Court cannot revise a decision of a subordinate court which had been upheld on appeal by the High Court. Second, in any event, in asking for a global sentence of five to seven months’ imprisonment and for a criminal revision to normalise the sentences, the Prosecution was in effect seeking to enhance the sentence for the first charge. Considering that the Prosecution had asked for a sentence of two to three months’ imprisonment in the court below,[note: 2]this application amounted to a rethinking about the sentence. Criminal revisions may not be used as a backdoor appeal against sentence (s 400(2) of the CPC;Public Prosecutor v Muhammad Noor Indra bin Hamzah[2009] 4 SLR(R) 1007 at [5]–[7]perLee Seiu Kin J). The proper procedure would have been to lodge an appeal against sentence for the first charge on the ground that the DJ was wrong in acquitting Tjong on the second charge (and therefore wrong with respect to the factual basis for his sentence). Third, I did not see any serious injustice here calling for the exercise of the court’s revisionary powers. Accordingly, I declined to exercise such powers. 87     I will now deal with the sentence for the second charge. At the outset, I accepted that these two charges were part of the same transaction,ie, that Tjong received two cheques for a total of $87,386.67 on the same day and for one act of corruption (even though he deposited and encashed the cheques on different occasions). In my view, a single charge of corruption which particularised the two amounts and the two occasions would still have been valid if the prosecution had chosen to proceed thus. This is not to say that it was wrong to have preferred two charges in the way it was done before the District Court. At [54] of the GD, the DJ said that the basis for the sentence he imposed was that Tjong had received $57,386.67. This sentence was appealed by Tjong but not by the Prosecution. Now that Tjong has been convicted on both charges, I have to consider what the appropriate global sentence should be, bearing in mind Tjong’s overall criminality. 88     The sentencing factors I have discussed regarding the first charge applied equally to the second charge. It could not be said that C2 was less surreptitious than C1 simply because it was not disguised to look like legitimate expenses. Similarly, it could not be said that C2 was more premeditated than C1 simply because Tjong waited about two weeks to deposit and encash C2. Tjong’s attempts to cover his tracks were part and parcel of one big transaction. Looking at the circumstances in totality, it is correct to say that C2 was tainted with the same level of surreptitiousness as C1 because Tjong split the sum of $87,386.67 into two cheques to disguise the true nature of the monies. With the decision on C2, the amount of gratification received by Tjong is now $30,000 more. In light of the amount in C2, the sentence for the first charge and the precedents cited, I was of the view that four weeks’ imprisonment (to run consecutively with the imprisonment term of eight weeks for the first charge) would be an appropriate sentence together with an additional penalty of $30,000.00 pursuant to s 13(1) of the PCA. 89     If the DJ had convicted Tjong on both charges and considered the overall criminality in sentencing, it would in all likelihood have been proper to order concurrent imprisonment sentences as the two charges were in reality one transaction of corruption. However, as explained above, because of what took place at the trial and the appeal, consecutive imprisonment terms became necessary. In addition to the issue of the quantum of gratification, although this case of corruption involved the private sector, it also involved a government-linked entity and a transaction with a cross-border commercial element. At all material times, STE was fully-owned by Singapore Technologies Engineering Ltd, which in turn was approximately 50%-owned by Temasek Holdings (Private) Limited, a government-owned company. STE could easily be viewed as a government-linked or government-owned entity. The harm caused by the offences here therefore included the possible adverse impact on the reputation and integrity of Singapore companies and of Singapore generally. 90     Bearing in mind all the circumstances of the case as set out above, the proper order was for both imprisonment terms of eight weeks and four weeks to run consecutively and I so ordered. In my opinion, the total sentence of 12 weeks’ imprisonment is appropriate considering Tjong’s position in STE, the amount of money he received and the level of surreptitiousness involved in the transfer of the reward from Mujibur to Tjong. The penalty and default imprisonment term for the first charge ordered by the DJ stands. I also ordered Tjong to pay a penalty of $30,000.00 for the second charge, in default of which he will have to undergo six more weeks’ imprisonment.",
        "Overall conclusion": "91     I affirmed the conviction on the first charge (as amended by me) and reversed the acquittal on the second charge (as amended by me). For the first charge, I affirmed the sentence of eight weeks’ imprisonment (together with the penalty of $57,386.67 ordered and the default sentence of 3 months’ imprisonment). For the second charge, I sentenced Tjong to four weeks’ imprisonment and imposed an additional penalty of $30,000.00, in default of which Tjong will undergo another six weeks’ imprisonment. I ordered the imprisonment terms for both charges to run consecutively, making a total of 12 weeks’ imprisonment. 92     At the request of Mr Nathan, the commencement of the sentences was deferred pending the outcome of an application to be filed for leave to refer questions of law to the Court of Appeal. If no such application is filed by the deadline, Tjong will have to commence serving the sentences the following day.  [note: 1]4 ROP 75, 82–83 (Mitigation plea). [note: 2]2 ROP 610 (Prosecution’s Submissions on Sentence) at para 31."
    }
}