{
    "case_title": "Formula One Licensing BV\n      v\n      Idea Marketing SA",
    "ncitation": "[2015] SGHC 263",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Tribunal Appeal No 22 of 2013 (“TA 22”)": "1       Formula One Licensing B.V. (“the appellant”) manages the trade marks for the FIA Formula One World Championship. In 1997, the Federation Internationale de l'Automobile (“FIA”) granted the appellant’s group of companies the right to organise and commercially exploit the championship.[note: 1] 2       Idea Marketing S.A. (“the respondent”) has been the global promoter for the F1 Powerboat World Championship, a high-octane powerboat racing event, since 1993. The F1 Powerboat Championship started globally in 1981 and is among the water sport competitions administered by the sporting body Union Internationale Monoautique (“UIM”).[note: 2] 3       On 28 March 2007, the respondent applied to register “F1H20” (“the application mark”) in Singapore for goods and services in these classes:[note: 3] Class 09 Sunglasses and spectacles; cords, spectacle frames, lenses and cases for sunglasses and optical apparatus; apparatus for recording, transmitting and reproducing sound or images; magnetic recording media, recording discs; data processing and computer apparatus and equipment, computers; video games, games for computers and microcomputers; game apparatus for computers and software, in particular computer games. Class 25 Clothing, footwear, headgear. Class 38 Broadcasting by radio and television, also on digital networks in particular services directly or indirectly linked to the Internet; telecommunications; electronic transmission of data, images and sound using computer terminals and computer networks, also via the Internet and websites. Class 41 Education, training; entertainment; sporting and cultural activities; direction, management, organization and execution of sporting competitions, shows, films, games provided online on a computer network. 4       The priority date was 11 January 2007 (“the relevant date”).[note: 4]On 21 August 2009, “F1H20” was accepted and published for opposition purposes.[note: 5]The appellant then commenced opposition proceedings to stop the registration. The appellant relied on various sections in the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the TMA”): ss 8(2)(b), 8(4)(b)(i), 8(4)(b)(ii), 8(7)(a) and 7(6).[note: 6] 5       The Assistant Registrar of Trade Marks (“the AR”) heard the parties on 30 September 2013. In her grounds of decision dated 19 November 2013 (In the Matter of a Trade Mark Application by Idea Marketing S.A. and Opposition thereto by Formula One Licensing B.V.[2013] SGIPOS 8) (“the 2013 GD”), she held that the opposition failed on all grounds and that the application mark should proceed to registration.[note: 7] 6       The appellant appealed to the High Court in TA 22. In Summons No 2188 of 2014, the appellant applied for leave to adduce further evidence. I heard the summons and made the following orders dated 22 September 2014: 1.    Further evidence by way of the newspaper articles and the ESPN Agreement dated 16 September 2005 exhibited in the Affidavit of Sean Joseph Corbett filed on 30 April 2014 is allowed. 2.    The further evidence will be placed before the Registrar of Trade Marks by way of written submissions with no cross-examination. 3.    The foreign decisions exhibited in the Affidavit of Sean Joseph Corbett may be placed before the Registrar of Trade Marks by way of written submissions and not as further evidence (as agreed by the Defendant). 4.    The remaining portions of Ian De Cotta's book which the Plaintiff is seeking to admit are disallowed. 5.    The Plaintiff's affidavit of Sean Joseph Corbett and the Defendant's joint Affidavit of Nicolo’ Costa and Jean Menthonnex are to be admitted and placed before the Registrar of Trade Marks. 6.    Costs of this hearing are fixed at $5000 with reasonable disbursements to be paid by the Plaintiff to the Defendant. 7.    Costs of the further hearings to be reserved for the Registrar of Trade Marks. 7       TA 22 remained pending while the matter was remitted to the Trade Marks Registry for a rehearing before the same AR with the further evidence on 20 January 2015. She maintained her decision, which was elaborated on in her grounds of decision dated 15 April 2015 (Formula One Licensing B.V. v Idea Marketing S.A.[2015] SGIPOS 7) (“the 2015 GD”). 8       On 16 July 2015, I heard TA 22 as an appeal against both the 2013 GD and the 2015 GD.",
        "The AR’s decisions": "9       In the 2013 GD, the AR found that: (a)     Evidence after 11 January 2007 was irrelevant as the issue was whether the application mark should proceed to registration as at the date it was deemed to have been applied for, at 2013 GD at [8]. (b)     The appellant’s (ie, the opponent before her) marks that were “earlier trade marks” under s 2(1)(a) of the TMA were its three marks that were registered before 11 January 2007, at 2013 GD at [46]. (c)     The appellant’s marks, specifically the unregistered plain F1 mark, were not well known in Singapore as at 11 January 2007. So the plain F1 mark did not qualify as an earlier trade mark under s 2(1)(b) of the TMA, at 2013 GD at [47]–[48], and [76]. (d)     The plain F1 mark was descriptive of a particular class or standard of sport in both motor racing and powerboat racing. She should be cautious in granting a descriptive mark protection as a well known mark, at 2013 GD at [59]–[60]. (e)     The opposition under s 8(2)(b) of the TMA failed as the appellant’s earlier marks – the three registered marks – were not similar to the application mark, at 2013 GD at [91]. (f)     The opposition under s 8(4)(b) of the TMA failed as the appellant’s marks were not well known in Singapore under s 8(4)(a), at 2013 GD at [93]. (g)     The opposition under s 8(7) of the TMA failed as the appellant had not established the requisite goodwill in the tort of passing off, 2013 GD at [107]. (h)     The opposition under s 7(6) of the TMA failed as the appellant had failed to prove bad faith, 2013 GD at [120]. 10     In the 2015 GD, the AR found that: (a)     Distinctiveness, whether inherent or acquired, played an important role in determining if the plain F1 mark could be considered a trade mark. To qualify as a trade mark, the plain F1 mark must be capable of distinguishing goods or services (see definition of “trade mark” in s 2 of the TMA),ie, the plain F1 mark must be capable of distinguishing the appellant’s motor races, at 2015 GD at [27]. (b)     The further evidence showed that there were at least two possible undertakings – the appellant’s motor race and the respondent’s powerboating event – that the relevant sector of the public would associate with the plain F1 mark and therefore, it was not distinctive of the appellant alone, 2015 GD at [69]. (c)     In view of the evidence, the plain F1 mark was unable to perform the basic function of distinguishing the appellant’s goods or services from those of its competitors. It was therefore not in the public interest to allow the appellant to register and obtain a monopoly on words and phrases which other traders might wish to use for their goods and services, 2015 GD at [72]. (d)     The plain F1 mark was not distinctive of the appellant’s goods and/or services alone. There was also evidence that it simply referred to a certain standard associated with motor sport or powerboating. As such, it had not been used as a trade mark and did not satisfy the definition in s 2 of the TMA. So it was unnecessary to consider if the mark was a “well known” trade mark under s 2 of the TMA. Therefore, the mark did not qualify as an “earlier trade mark” such that it could be considered under s 8(2)(b) or s 8(4)(b)of the TMA, 2015 GD at [73]. (e)     There was no pre-trading activity that was sufficient to constitute goodwill for the purpose of s 8(7)(a) of the TMA on the basis of the new evidence, 2015 GD at [82].",
        "The appellant’s arguments on appeal": "11     In this originating summons, the appellant appealed on the grounds that: a.    The AR erred in fact and/or law in holding that the Plaintiff’s “F1” Trade Marks (hereinafter “the Plaintiff’s Marks”) are not well known in Singapore; b.    The AR erred in fact and/or law in holding that the Plaintiff’s Marks are not well known to the “relevant sector of the public” in Singapore; c.    The AR erred in fact and/or law in holding that there was no similarity between the Defendant’s Mark and the Plaintiff’s Marks; d.    The AR erred in fact and/or law in holding that the Plaintiff has not established the requisite goodwill in Singapore; and/or e.    The AR erred in fact and/or law by not finding that the Defendant applied for Trade Mark Application No. T0715123H in bad faith. 12     At the hearing before me, the appellant submitted that the salient points of its appeal were: (a)     The AR failed to consider if the unregistered mark – the plain F1 mark – was a well known trade mark as at the relevant date, and thus an earlier trade mark for the purpose of opposition proceedings under the TMA; (b)     The AR at the rehearing failed to properly consider the further evidence, which indicates that the plain F1 mark was well known to the relevant sector of the public, if not the public at large; (c)     As a result of her finding that the plain F1 mark was not well known in Singapore as at the relevant date, the AR failed to consider the rest of the inquiry under s 8(4)(b) of the TMA; and (d)     The AR erred in finding that there was no goodwill in the plain F1 mark and as a result of her finding, she failed to consider the rest of the inquiry in the tort of passing off.",
        "The decision of the court": "",
        "The appellant’s earlier trade marks": "13     The priority date claimed for the application mark is 11 January 2007. Therefore, the appellant’s earlier trade marks for the purpose of opposition proceedings are its trade marks that predated 11 January 2007, the relevant date.[note: 8]Therefore, I agree with the AR that evidence that post-dates the relevant date is irrelevant to the opposition proceedings: see 2013 GD at [8]. 14     The appellant has three registered trade marks that can be considered earlier trade marks for the purpose of opposition proceedings, as they were registered before the relevant date. These trade marks, which were registered on 5 September 1997 (priority claim: 30 May 1997) are:[note: 9]  15     The appellant contends that the plain F1 mark – “F1” – is also an earlier trade mark for the purpose of opposition proceedings. “F1” was in fact registered on 10 May 2007, after the relevant date.[note: 10]The question is whether as at the relevant date, “F1” qualifies as an earlier, albeit unregistered, mark. Whether the plain F1 mark is an earlier trade mark 16     Under s 2(1) of the TMA, an “earlier trade mark” is: (a)    a registered trade mark or an international trade mark (Singapore), the application for registration of which was made earlier than the trade mark in question, taking account (where appropriate) of the priorities claimed in respect of the trade marks; or (b)    a trade mark which, at the date of application for registration of the trade mark in question or (where appropriate) of the priority claimed in respect of the application, was a well known trade mark, and includes a trade mark in respect of which an application for registration has been made and which, if registered, would be an earlier trade mark by virtue of paragraph (a) subject to its being so registered. 17     Therefore, to qualify as an earlier trade mark, the plain F1 mark must be a well known trade mark as at the relevant date. If so, the appellant may rely on it as an earlier trade mark – and not only on its three registered marks – to oppose the registration of the application mark. Whether the plain F1 mark is a well known trade mark 18     Under s 2(1) of the TMA, a “well known trade mark” means: (a)    any registered trade mark that is well known in Singapore; or (b)    any unregistered trade mark that is well known in Singapore and that belongs to a person who — (i)    is a national of a Convention country; or (ii)   is domiciled in, or has a real and effective industrial or commercial establishment in, a Convention country, whether or not that person carries on business, or has any goodwill, in Singapore; 19     Therefore, an unregistered trade mark that is well known in Singapore can be an earlier trade mark. WHETHER THE PLAIN F1 MARK IS A DESCRIPTIVE MARK THAT HAS NOT ACQUIRED DISTINCTIVENESS 20     The respondent submits that the plain F1 mark is descriptive, which impacts on whether it is the appellant’s earlier/well known trade mark as at the relevant date.[note: 11]Being descriptive, the plain F1 mark can become well known only if it has acquired distinctiveness through use. The term “F1” is descriptive as its primary meaning refers to a set of motor racing standards. While “F1” may have acquired a lot of use here today (the annual F1 night races started in September 2008 with the 2008 Formula 1 Singtel Singapore Grand Prix), the question is to be answered with reference to the relevant date. 21     In support of its argument, the respondent cites the High Court’s decision inSociete Des Produits Nestlé SA and another v Petra Foods Ltd and another[2014] SGHC 252 (“Nestle”).[note: 12]InNestle, the court held: 239    The use and promotion of the trade mark is only a factor among several to be considered when deciding whether a trade mark is “well known in Singapore.” Moreover, sub-ss 2(7)(b)(i) and (ii) of the TMA refer to “anyuse of the trade mark” and “anypromotion of the trade mark”. This implies that use of the trade mark is not mandatory, and, in any event, the aforementioned sub-sections do not say that it must necessarily be limited only to use or promotionin Singaporebefore the trade mark can become well known in Singapore. Many in Singapore travel overseas for business or pleasure and with the internet, they are readily exposed to products not sold or promoted within Singapore. A trade mark may be well known in Singapore though products bearing the trade mark may not be sold or promoted locally and the trade mark has not been used as a trade mark in Singapore. It was also stated inAmanresortsat [137] that the court is “ordinarily free to disregard any or all of the factors listed in s 2(7) as the case requires”. Of all the factors enumerated in s 2(7) of the TMA, it is factor (a) that is crucial, which cannot be ignored, and indeed the Court of Appeal even went on to say that “it appears that all the other factors listed in s 2(7) are irrelevant once it is determined that the trade mark in question is well known to ‘any relevant sector of the public in Singapore’” (Amanresortsat [139] and [140]). This must mean that a trade mark can become well known in Singapore even if the proprietor makes no use of it in this country, whether in a trade mark sense or not. 240    So if the trade mark is inherently distinctive orde factodistinctive though acquisition of distinctiveness, a requirement of use cannot be read as a requirement before making the finding that it is well known. However, I think what the defendants mean is that a mark, not inherently distinctive, but capable of distinguishing a trader’s goods or services as originating from that trader must first be factually distinctive through acquisition of a distinctive character under s 7(2) before it can be considered to be well known. If the mark is not inherently distinctive but is capable of distinguishing a trader’s goods, it can only acquire distinctiveness through use. So if there is no evidence of trade mark use for such marks to be at least distinctive enough to be registrable in Singapore as a trade mark, then the question of whether they are well known cannot arise. This I will accept. 22     InNestle, the court noted that under s 2(1)(b) of the TMA, a well known trade mark is an unregistered trade mark that is well known in Singapore (see [18] above). However, the court, in examining the policy behind the protection of well known trade marks, held that an “unregistered trade mark” will necessarily imply the exclusion of an unregistered trade mark that is deemed to be unregistrable under s 7 of the TMA (seeNestleat [231]–[234]). I turn to s 7(1) of the TMA, which states: Absolute grounds for refusal of registration 7.—(1) The following shall not be registered: (a)    signs which do not satisfy the definition of a trade mark in section 2(1); (b)    trade marks which are devoid of any distinctive character; (c)    trade marks which consist exclusively of signs or indications which may serve, in trade, to designate the kind, quality, quantity, intended purpose, value, geographical origin, the time of production of goods or of rendering of services, or other characteristics of goods or services; and (d)    trade marks which consist exclusively of signs or indications which have become customary in the current language or in the bona fide and established practices of the trade. 23     Under s 7(1)(a), a mark cannot be registered if it does not meet the definition of a trade mark in s 2(1), which defines a trade mark as: “trade mark” means any sign capable of being represented graphically and which is capable of distinguishing goods or services dealt with or provided in the course of trade by a person from goods or services so dealt with or provided by any other person. 24     Under ss 7(1)(b)–(d), inherently non-distinctive marks are also rejected if they are devoid of distinctive character, descriptive of some quality or characteristic of the goods or services in question and have become customary in the current language or established practices of the trade: see Ng-Loy Wee Loon,Law of Intellectual Property of Singapore, (Sweet & Maxwell, 2nd Ed, 2014) (“Law of Intellectual Property of Singapore”) at para 21.3.22. 25     However, under s 7(2) of the TMA, marks caught by ss 7(1)(b)–(d) can be registered if they have acquired distinctive character as a result of the use made of them,ie,de factodistinctiveness. 26     On distinctiveness, the respondent relies on the Court of Appeal case ofStaywell Hospitality Group Pty Ltd v Starwood Hotels & Resorts Worldwide, Inc and another and another appeal[2014] 1 SLR 911 (“Staywell”).[note: 13]InStaywell, the court stated that distinctiveness refers to the capacity of a mark to act as a badge of origin; this capacity can either be inherent or acquired through use. The court held (at [24]): Distinctiveness in the technical sense on the other hand, usually stands in contradistinction to descriptiveness. Where the latter connotes words that describe the goods or services in question, or of some quality or aspect thereof, the former refers to the capacity of a mark to function as a badge of origin. Distinctiveness can be inherent, usually where the words comprising the mark are meaningless and can say nothing about the goods or services; or acquired, where words that do have a meaning and might well say something about the good or services, yet come to acquire the capacity to act as a badge of origin through long-standing or widespread use (seeWindsurfing Chiemsee Produktions- und Vertriebs GmbH v Boots- und Segelzubehör Walter Huber and Franz Attenberger[1999] ETMR 585 (ECJ),Love & Co Pte Ltd v The Carat Club Pte Ltd[2009] 1 SLR(R) 561 at [98]–[100] andHai Tong([18] supra) at [32]–[33]). 27     InWindsurfing Chiemsee Produktions- und Vertriebs GmbH v Boots- und Segelzubehör Walter Huber and Franz Attenberger[1999] ETMR 585 (ECJ), the European Court of Justice interpreted Article 3(3) of the First Council Directive 89/104/EEC.[note: 14]This is similar to s 7(2) of the TMA, which renders registrable an inherently non-distinctive mark if it has acquired distinctiveness through use (see [25] above). The ECJ held (at [54]) that if it is found that “a significant proportion of the relevant class of persons identify goods as originating from a particular undertaking because of the trade mark, it must hold the requirement for registering the mark to be satisfied”. 28     InNestle, the High Court (at [165]) referred to James Melloret al,Kerly’s Law of Trade Marks and Trade Names(Sweet & Maxwell, 15th Ed, 2011) (“Kerly”) when it discussed the meaning of “identify goods as originating from a particular undertaking because of the trade mark”. The authors made the following propositions at para 8-027: We suggest that the Court of Justice will affirm what it said inPhilips, para.65. Thus, we propose the following propositions: (1)    Mere association with a particular manufacturer is not enough; (2)    The use of the sign must establish, in the perception of the average consumer, that the product originates from a particular undertaking; (3)    That perception must result from the use of the sign as a trade mark —in other words, the proprietor must have done something in his use to identify the sign as being a trade mark, and mere extensive use during a period of monopoly, without more, is most unlikely to have achieved this. 29     To summarise, a trade mark that is capable of distinguishing a trader’s goods and services from those of others (thus meeting the definition of a trade mark in s 2(1) of the TMA) may nevertheless be unregistrable due to s 7(1)(b)–(d) of the TMA if it is not inherently distinctive, unless it has acquired distinctiveness through use (thus triggering s7(2)). WhileNestleis under appeal, I agree that the meaning of “unregistered trade mark” must necessarily exclude unregistered trade marks that are unregistrable under s 7. Therefore, such trade marks, including those that are devoid of distinctiveness, can never qualify for protection as well known trade marks under the TMA. Otherwise, to cite an example, immoral and deceptive marks – which are barred from registration by s 7(4) of the TMA – can receive protection simply because they are well known. AsNestleheld (at [233]): The indefensibility of the plaintiffs’ position can be further illustrated by the other absolute grounds for refusal of registration under s 7 of the TMA. For example, s 7(4) of the TMA bars the registration of a trade mark that is contrary topublic policy,moralityor is such a nature as todeceivethe public. Surely immoral and deceptive marks (well known or otherwise) canneverbe given protection of any sort under the TMA. The plaintiffs’ submission would also, by parity of reasoning, allow for the protection of marks as well known trade marks that are devoid of any distinctive character or acquired distinctive character (which I have found to be the case here). It is obvious that an unregistered mark, though well known, but does not fulfil the essential function of a trade mark of distinguishing a trader’s goods or services as originating from that trader, is not capable of being protected as a well known trade mark. Accordingly, a shape that has not been registered as a trade mark and is also unregistrable under s 7(1)(b) – because the shape is devoid of any inherent distinctive character and has also not acquired a distinctive character under s 7(2) – simply cannot enjoy protection merely on account of the fact that it has become well known in Singapore. [emphasis in original] 30     I understand that the question of whether the meaning of “unregistered trade mark” excludes an “unregistrable” mark is one of the issues being considered by the Court of Appeal inNestleand that arguments have been made that it excludes only unregistered marks that are “unregistrable” under the absolute grounds in s 7 of the TMA and not under the relative grounds in s 8. For the purposes of this judgment, therefore, I confine “unregistrability” to the absolute grounds in s 7 of the TMA. 31     I now consider the respondent’s submissions that the words “F1” and “FORMULA 1” are descriptive and lack distinctive character in relation to sports events and the related goods or services, such as merchandising.[note: 15]The respondent submits that the appellant has provided no evidence to show that “F1” or its three registered marks have acquired distinctiveness. 32     In the 2013 GD at [59], the AR found that “F1” was descriptive. This led her to be slow in granting it well known mark protection. She stated:[note: 16] 59    As stated at [49] above, there is tension between the protection of a well known mark that a trader has made significant investment in and the need to prevent commercial monopolization of trade marks that are essentially “words and symbols” insofar that they should be left free to be the subjects of “everyday commentary, comparison and critique.” I find that the Opponents’ Plain F1 Mark is descriptive and therefore, I should be cautious in granting the Opponents’ Plain F1 Mark “well known” mark protection. 33     The AR found that the evidence suggested that the plain F1 mark was “descriptive of a particular class or standard of sport in both motor racing and powerboat racing” (at [60] of the 2013 GD). She found that the respondent’s evidence also showed that “F1” was “the name of a particular standard associated with power boating, as opposed to an invented word to describe the Applicants’ power boating event” (at [61] of the 2013 GD). This included: (i)    Article from Straits Times newspaper dated 11 September 2004, “Women making waves”, where Ms Procaccini, one of the managers of the UIM Formula One Powerboat Championship teams, speaking about women’s participation in the sport, informs the newspaper that “[t]here are also many lower divisions like Formula Twowhere [women] can race when they are young and develop passion, and knowledge of the sport”; (ii)  Article from “Think Magazine” dated 18 August 2004, “UIM F1 Powerboat Championships”, which writes that “[t]he Singapore race forms part of the UIM F1 Powerboat World Championship with points contributing to the overall World ranking, similar to F1 Cars.Drivers from more than 14 countries compete in a sport which puts them at the pinnacle of their careers, with many having started off in F2 and F4 before reaching the heady heights of Formula 1”; and (iii)  Article from I-S Magazine dated 10 September 2004, “Too Fast Too Furious”, where powerboat racer Massimiliano Moreschi stated in an interview: “When I am not travelling on the F1 Powerboat circuit, I take part in local events usinga different class of boats. While these are not as powerful as F1 boats, you still get good practice at high speed maneuvering and reaction times –which helps me prepare for the F1 Championships.” [emphasis in original] 34     The AR also found that “F1” was used in the context of powerboating in 2003 and 2004, at a time when the appellant’s “Formula 1” mark was already registered (see 2013 GD at [62]). Numerous newspaper and Internet articles referred to the respondent’s races as the “F1”/ “FORMULA 1/ONE” powerboat race in 2003 and 2004. Both powerboating and motor racing were referred to in the media as “F1” events without any evidence that the public associated “F1” with motor racing in particular. The news articles that demonstrated the equal use of “F1” in the context of both sports were: (i)    Article from Straits Times (Sports) dated 11 September 2004, “F1 v F1”, comparing an F1 car and an F1 powerboat; (ii)  Article from The Sunday Times dated 12 September 2004, “Women Making Waves,” referring to the “Formula Two” tier of powerboat racing and comparing powerboating with “Formula 1 cars”, which is “a completely different world” with “so much more money and a lot more ego”; (iii)  Article in The Peak magazine, “Precision Masters”, dated 9 September 2004, comparing the points and ranking system of the “UIM F1 Powerboat World Championships” as being “similar to F1 Cars”; (iv)  Article in The Business Times Singapore, dated 15 March 2003, “Powerboat racing is back – with money and glamour in tow”, stating that “The F1 Powerboat championships is set up in much the same way as Formula One motor racing”; and (v)    Article in The Business Times Singapore, dated 24 October 2003, “Storming the Bay; Come this weekend the Marina Bay area will stage the S'pore leg of the F-1 Powerboat World Championship after a 11-year hiatus”, referring to the “F-1 motor races” and later referring to the “UIM F-1 promoter” and the “F-1 contingent”. [emphasis in original] 35     At the rehearing before the AR, the respondent tendered further evidence that the plain F1 mark, which is commonly abbreviated from Formula 1 or Formula One, is descriptive of a class of sport.[note: 17]This included:[note: 18] (a)     A Wikipedia article on “Formula One” describing the term as referring to “the highest class of single-seater auto racing”; (b)     A Wikipedia article on “Formula racing”, which explains that “formula racing” refers to any of several forms of open-wheeled single seater motorsport; (c)     An article in The New Straits Times in Malaysia dated 26 October 2000 headlined “Close gap between F1 and karting”, which describes the various tiers of racing such as Formula One, Formula Three and F2000, although the AR noted that this article referred to the Malaysian market;[note: 19] (d)     An article in The Straits Times dated 24 August 2002 headlined “So you want to be an F1 driver?” that pertains to the Singapore market and talks about how drivers move up the various rungs from Formula Three (F3) upwards;[note: 20]and (e)     An article in The Straits Times dated 31 August 2003 headlined “Mark his progress on the F1 track”, which discusses how Australian driver Mark Webber scaled the different tiers of motor sports races, from “Formula Ford”, “Sportscars”, “F3” and “F3000”.[note: 21] 36     The AR held that the last two articles appeared to corroborate the conclusion in Wikipedia that the plain F1 mark represented a particular standard for motor car racing.[note: 22] 37     Moreover, the AR found in the 2015 GD at [69] that the further evidence showed “at leasttwopossible undertakings that the relevant sector of the public wouldassociatewith the Plain F1 Mark, and therefore, it is not distinctive of the Opponents alone” [emphasis in original]. For example, it was reasonable to conclude that in 2005, the relevant sector of the public in Singapore would associate the plain F1 mark with the respondent’s powerboat race.[note: 23]She based this on the respondent’s video recordings of its powerboating championships in 2005, from which she observed the following:[note: 24] a)     The event was held in the Marina Bay area, which is essentially a waterfront area overlooking the Central Business District (CBD); b)     The powerboat race was attended by a crowd of people who sat along the sides of the river; c)     The voice-over to these videos refers to the event as “the 6th annual grand prix of Singapore” (at 42:43-42:38 of MC-3A); d)     The banners to this event on the video screen refer to it as “F1 UIM World Championship” and “GP of Singapore”; e)     The Plain F1 Mark appears on one of the boats in the competition, on the back of a person's t-shirt (in a prominent location), on the commentator’s microphone on the video screen, on the victory podium (“F1 World Championship 2005”). 38     However, the AR found that at around the same time, the general public mightalsohave associated the plain F1 mark with motor racing or even more specific events such as the appellant’s championship or the Sepang Grand Prix in Malaysia.[note: 25]For example, television broadcasts of the appellant’s championship took place in September 2005, the same year and the same month as the respondent’s powerboat race. The appellant had provided evidence of the broadcast and newspaper articles in 2005 that made reference to the plain F1 mark in relation to its motor races. 39     The respondent submits that I should uphold the AR’s findings. The plain F1 mark was descriptive and had not acquired distinctiveness. To become distinctive, it is not enough that a section of the public may associate “F1” with the appellant or that the motorsports races organised by the appellant are known as “F1”. That is insufficient to show trade mark significance as it has to be shown that “F1” signifies trade origin (seeKerlyat [28] above). This, the respondent contends, was not established at both hearings before the AR.[note: 26]It also highlights that even the appellant itself sees “F1” as being indicative of a classification of motor sport, rather than as a trade mark.[note: 27]This was also noted by the AR, who pointed out in the 2013 GD at [60] that the appellant submitted that “F1” referred to a set of rules identifying the technical specifications that motor cars must conform to, to compete in the appellant’s championship. The respondent also states that had the appellant truly regarded the plain F1 mark as its trade mark, it would have applied to register “F1” along with the other registered marks in 1997.[note: 28]Further, there is also evidence that “F1” has been used in a descriptive sense in other sports such as airplane racing. 40     In view of the foregoing, I agree that prior to the relevant date, the terms “F1” and “Formula 1/One” were descriptive.[note: 29]“F1” was used to refer to a standard by which vehicles – whether motor cars or powerboats – were categorised, and the media had not associated “F1” exclusively with the appellant.[note: 30]Since the plain F1 mark had not acquired distinctiveness as at the relevant date, s 7 of the TMA rendered it unregistrable, although it was registered in May 2007, apparently without opposition. However, the respondent argues that this did not mean the respondent could not subsequently apply to cancel the registration. Since I accept that an unregistrable mark is outside the meaning of an “unregistered trade mark” in the TMA (see [29] above), “F1” was not an unregistered mark that was well known in Singapore,ie, a “well known trade mark”, by the relevant date. It therefore could not be an “earlier trade mark” for the purpose of opposition proceedings. 41     Notwithstanding this conclusion, I will consider if the plain F1 mark could be considered well known based on the factors in s 2 of the TMA. WHETHER THE PLAIN F1 MARK IS WELL KNOWN IN SINGAPORE 42     As stated above at [18], an unregistered trade mark that is well known in Singapore is a well known trade mark under s 2(1) of the TMA. Section 2(7) provides guidance on whether a trade mark is “well known in Singapore”: Subject to subsection (8), in deciding, for the purposes of this Act, whether a trade mark is well known in Singapore, it shall be relevant to take into account any matter from which it may be inferred that the trade mark is well known, including such of the following matters as may be relevant: (a)    the degree to which the trade mark is known to or recognised by any relevant sector of the public in Singapore; (b)    the duration, extent and geographical area of — (i)    any use of the trade mark; or (ii)   any promotion of the trade mark, including any advertising of, any publicity given to, or any presentation at any fair or exhibition of, the goods or services to which the trade mark is applied; (c)    any registration or application for the registration of the trade mark in any country or territory in which the trade mark is used or recognised, and the duration of such registration or application; (d)    any successful enforcement of any right in the trade mark in any country or territory, and the extent to which the trade mark was recognised as well known by the competent authorities of that country or territory; (e)    any value associated with the trade mark. 43     While the court must have regard to the list of factors in s 2(7) in assessing if a trade mark is well known in Singapore, the Court of Appeal inNovelty Pte Ltd v Amanresorts Ltd and Another[2009] 3 SLR(R) 216 (“Amanresorts”) noted (at [137]) that these factors “are not an exhaustive list” and are “more accurately described as a set of guidelines”.[note: 31]However, the court (at [140]) held that s 2(7)(a) cannot be disregarded because of the deeming provision in s 2(8), which states: Where it is determined that a trade mark is well known to any relevant sector of the public in Singapore, the trade mark shall be deemed to be well known in Singapore. 44     The court stated (at [140]): “Indeed, it appears that all the other factors listed in s 2(7) are irrelevant once it is determined that the trade mark in question is well known to “any relevant sector of the public in Singapore” (pers 2(7)(a))”. 45     As for “relevant sector of the public in Singapore”, s 2(9) of the TMA provides guidance: In subsections (7) and (8), “relevant sector of the public in Singapore” includes any of the following: (a)    all actual consumers and potential consumers in Singapore of the goods or services to which the trade mark is applied; (b)    all persons in Singapore involved in the distribution of the goods or services to which the trade mark is applied; (c)    all businesses and companies in Singapore dealing in the goods or services to which the trade mark is applied. SECTIONS 2(7)(A) AND 2(8) 46     In the 2013 GD at [57], the AR found that the relevant sector of the public could minimally include the Singaporean fans who visited the Sepang circuit to watch the Malaysian leg of the appellant’s motor races. On a broader view, the relevant sector of the public would also include the Singapore distributors and readers of the “F1 Racing” magazine in Singapore as well as the actual and potential consumers of the range of products offered for sale (including clothing, headgear, bags, stationery, car accessories, personal effects, toys and games, souvenirs and household items). However, the AR found that the case did not turn on the definition of the relevant sector of the public as there was no evidence to show that the plain F1 mark was well known to either group of people.[note: 32] 47     The respondent submits that this finding is correct[note: 33]and that the appellant’s evidence prior to the relevant date clearly falls short of the standard of evidence produced inAmanresorts[note: 34]which enabled the Court of Appeal to find that the “Aman” names were well known in Singapore. The evidence inAmanresorts, as summarised in the 2013 GD at [52], included: (i)     Worldwide sales of their goods and services of more than S$39 million in 1995 to more than US$86 million in 2006; (ii)     An international reservations office located in Singapore that handled approximately 30% to 40% of their global reservations; (iii)     1,382 Singaporean visitors to Amanusa Bali between 1995 and 2005; (iv)     More than US$3 million spent on promoting and marketing their goods and services globally; (v)     Newsletter “Amanews” distributed to 2,700 persons in Singapore; (vi)     Marketing strategy to promote the Amanresorts Group to 900 American Express Centurion members and 4,200 American Express Platinum members in Singapore; and (vii)     Features in several local publications, such as Asian Style Hotels, Singapore, in 2005. 48     However, in the present case, the respondent submits that the appellant provided merely general and unsubstantiated claims on the use of its marks. Except for two instances, the appellant’s claims make no reference to the Singapore market (see 2013 GD at [54]):[note: 35] (a)     The publication of a monthly magazine titled “F1 RACING”, which is “published in numerous countries including Singapore”; and (b)     The grant of an “Asian-wide license, including Singapore”, to a company to use the F1 logo on a range of products. 49     I agree that the two assertions should not be accorded weight without evidence of the magazine’s circulation in Singapore and evidence that the licensee has marketed products in Singapore.[note: 36]The respondent also rightly points out that while the appellant made claims concerning the grant of licenses to use its trade marks worldwide, no evidence had been adduced to the use of the marks in Singapore.[note: 37] 50     I also examined three newspaper articles from the Today newspaper that were published before the relevant date: (a)     “Singapore pit-stop for F1?” dated 28 March 2006; (b)     “Thumbs up for F1 in S’pore” dated 29 March 2006; and (c)     “Mosley backs F1 in Singapore” dated 31 March 2006. 51     The 28 March 2006 article related the possibility of the appellant’s motor races taking place in Singapore as early as in 2008. However, this does not demonstrate that the appellant’s trade marks had become well known by the relevant date.[note: 38]The 29 March 2006 article states that the Sepang circuit attracts about 15,000 Singapore fans. However, the origin of this figure is unclear and does not, without more, show how well known “F1” was in Singapore.[note: 39]The 31 March 2006 article was an interview with former FIA president Max Mosley, who stated his support for a Singapore leg of the Grand Prix. The relevant part of the article reads: “One important aspect to consider is whether there is a strong fan base for the sport in the region,\" Mosley told Today. “As we have seen from the many Singaporeans who frequent the Malaysian Grand Prix, this seems to be the case. “I believe Singapore contributes the biggest number of foreign spectators for that race.” 52     In the 2013 GD, the AR considered at [71] that the references to Singaporeans attending the motor races in Malaysia could be “the only piece of evidence of the use of the “F1” and “FORMULA 1/ONE” in a foreign country that may contribute to them being well known in Singapore”. However, she found deficiencies in the evidence: However, it is unclear from the evidence whether these 15,000 fans represent the total number of people that visited Sepang Circuit in 2006 alone or whether they represented an average number of fans each year or the cumulative number of fans over a few years, since Sepang Circuit’s opening in 1999. In any event, justonereference to the number of fans that visited Sepang Circuit during one or more years, without any other piece of independent or corroborative evidence, is insufficient to show that the “F1” and “Formula 1/ONE” marks were well known to the relevant sector of the public in Singapore. As for the second TODAY newspaper article dated 31 March 2006, the statements made by Max Mosley are hearsay evidence as he has not deposed any statutory declaration to confirm the facts stated in the article. Additionally, these facts are merely a statement of Mr Mosley’s opinion and are not admissible as evidence that the “F1” and “FORMULA 1/ONE” marks were well known to the relevant sector of the public in Singapore. No submissions were made by the Opponents on this particular point. [emphasis in original] 53     In view of the above, I have no reason to disagree with the AR’s finding that the plain F1 mark – and the rest of the appellant’s marks – was not well known to the relevant sector of the public in Singapore. The AR held at [65] of the 2013 GD: The Opponents have not adduced sufficient evidence that their Plain F1 Mark was well known as at 11 January 2007 to the relevant sector of the public in Singapore. The evidence referred to at [54]-[55] above are merely bare statements made by the Opponents in relation to the Singapore market. No further particulars as to the circulation of the “F1 RACING” magazine in Singapore or the revenue derived from sales of such magazine in Singapore have been adduced. No supporting documents or other evidence as to either of the Opponents’ licensing projects in Singapore have been produced by the Opponents. Accordingly, I find that the Opponents’ Marks, specifically the “F1” and FORMULA 1/ONE” do not satisfy Section 2(7)(a) of the Act. 54     The appellant urged me to relook the further evidence that the AR reviewed for the 2015 GD. The appellant submitted that the AR had given short shrift to its evidence at the re-hearing. The appellant’s contention was that even if the plain F1 mark was not well known to the public at large, it was well known to a segment of the Singapore public as at the relevant date. 55     This evidence included an article in the weekend edition of the Today newspaper dated 16–17 April 2005 that was headlined “S’pore can’t afford to let casino chance pass us by: MM Lee”.[note: 40]The appellant drew my attention to the following excerpt: He cited the decision not to build a Formula 1 circuit in Singapore as a “mistake” and one that had cost the country money. “My colleagues and I said: ‘Oh, It’s bad. It’ll teach our drivers to be reckless. Better not.’ But that was a stupid decision because everybody wants to be on F1 and they put their names on it … and millions of eyes are watching F1,” he said. 56     That “millions of eyes are watching” was not in reference to the Singapore public, but to viewers all over the world. As such, this evidence is too general to support a finding that “F1” was well known to the relevant sector of the public in Singapore. In any event, the AR had considered the evidence. In the 2015 GD at [35], she cited the article in concluding that the appellant appeared “to be confusing the notion of ‘popularity’ with the technical meaning of what is ‘well known’”. 57     Another article, dated 7 August 1999, was from The Straits Times. It was on “Malaysia’s Sepang F1 Circuit” and headlined: “A winner, says Mika Hakkinen”.[note: 41]Part of the article reads: The building of the circuit was the idea of Malaysia’s Prime Minister, Datuk Seri Dr Mahathir Mohamed, who could see the benefits of hosting one round of the Formula One championship. With F1 viewership at two billion globally, there is no better way to put the country in the spotlight. Moreover, 30,000 foreigners are expected among the spectators in the Malaysian Grand Prix, which will give tourism a boost. An estimated 20,000 die-hard fans are said to follow the entire championship around the world. 58     The appellant’s point was that the figures showed the notoriety of “F1” as a sport and brand even in 1999, about eight years before the relevant date. Therefore, the plain F1 mark must at the very least be well known to the relevant sector of the public. This article suffers from the same deficiency as the previous article (see [56] above). Moreover, at that time, it is unclear if racing fans would have taken “F1” to referonlyto the appellant’s motor races and no other sport. In other words, what was “F1” well known in reference to? As I have found, the appellant’s plain F1 mark was descriptive and had not acquired distinctiveness. Having reviewed this article along with other articles, the AR held in the 2015 GD at [47] that the articles showed that the Singapore public was likely to have associated the plain F1 mark with motor racing prior to the relevant date. However, she went on to state at [48]: All the evidence tendered above relates to the time period between 1992 and 1999 and 2001-2006. However,during the same period, there was evidence of the Applicants’ use of the Plain F1 Mark in relation to their own powerboating championship races in Singapore, which were held in 1993, 2003, 2004 and 2005. Evidence of the same was tendered before me in the opposition proceedings in[2013] SGIPOS 8and has been discussed at [12], [13], [61]-[62]. In relation to this evidence, I concluded at [60] that the evidence suggests that the Plain F1 Mark is descriptive of a particular class or standard of sport in both motor racing and powerboat racing. [emphasis in original] 59     The appellant also referred to a book written by a local journalist with the Today newspaper, Ian De Cotta. The book, titled “The Singapore Grand Prix (50 years in the making)”, was published in September 2008, after the relevant date.[note: 42]At the first hearing, the appellant had tendered some portions of the book. The AR noted that the appellant was using the book as “evidence that proves the existence of historical facts regarding a ‘Singapore Grand Prix’ in the 1960s – 1970s”.[note: 43]She treated the facts in the book as hearsay and inadmissible. In my subsequent order to the parties prior to the rehearing, I disallowed the appellant from admitting the remaining portions of the book. In its submissions, the appellant states that the information on the “Singapore Grand Prix” in the 1960s and 1970s can help demonstrate how well known the “F1” races in Singapore were during the relevant period:[note: 44] It also can demonstrate that the F1 was a potential player in Singapore prior to 11 January 2007. The existence of the main fact, that is, whether the ‘F1’ was well-known in Singapore prior to 11 January 2007 can be deduced from such circumstantial evidence. It sheds light on the public perception of the ‘F1’ event prior to 11 January 2007. However, I do not think that the book is of assistance to the appellant for the reason that the motor races were referred to as the “Singapore Grand Prix”. 60     The appellant also tendered a television rights agreement in respect of the 2006–2010 FIA Formula One Championship with ESPN Star Sports to broadcast the championship in Asia, including in Singapore.[note: 45]The agreement was entered into on 16 September 2005.[note: 46]The appellant submits that the agreement,inter alia, allows ESPN Star Sports to undertake that its website and printed materials will display the following trade mark notice:[note: 47] 4. The Licensee undertakes that the Printed Materials and an agreed location on the Licensee’s Website will display the following trade mark notice: “FORMULA 1, F1, the F1 Formula 1 and device, the FIA FORMULA ONE WORLD CHAMPIONSHIP and device and the FORMULA 1 Title Mechanisms and designs are the trade marks of FORMULA ONE Licensing B.V. a FORMULA ONE Group Company and are used under license. All rights reserved”. [emphasis in original] 61     In the 2015 GD at [46], the AR observed that the agreement was a private contract that cannot confer trade mark rights – which are obtained through registration or asserted as a common law right through use as a trade mark – on the appellant. Without more, the agreement is insufficient to allow an inference that “F1” was well known or recognised by the relevant sector of the public, especially given that the plain F1 mark was associated with at least two undertakings prior to the relevant date (see above at [37]-[38]). 62     Hence, I find that the appellant’s plain F1 mark was not well known or recognised by the relevant sector of the public in Singapore as at the relevant date. It follows that it cannot be deemed as a mark that is well known in Singapore pursuant to s 2(8) of the TMA. SECTION 2(7)(B) 63     I move on to the other factors in s 2(7) of the TMA. The AR in the 2013 GD at [66] cited the explanatory notes to the World Intellectual Property Organization’s (WIPO) Joint Recommendation Concerning Provisions on the Protection of Well-Known Marks. The notes state at [2.4]: The duration, extent and geographical area of any use of the mark are highly relevant indicators as to the determination whether or not a mark is well known by the relevant sector of the public. Attention is drawn to Article 2(3)(a)(i), providing that actual use of a mark in the State in which it is to be protected as a well-known mark cannot be required. However, use of the mark in neighboring territories, in territories in which the same language or languages are spoken, in territories which are covered by the same media (television or printed press) or in territories which have close trade relations may be relevant for establishing the knowledge of that mark in a given State. 64     The AR considered it apparent from the explanatory notes that “an opponent who claims that his mark is well known in another country or territory should demonstrate how this evidence contributes to the mark being well known in Singapore” (see 2013 GD at [67]). In this regard, the respondent submits that the appellant’s evidence fails to explain how the worldwide use of its marks contributed to the marks being well known here.[note: 48]This was also the AR’s finding,[note: 49]which I agree with. For example, the appellants claimed that licences for computer games had been granted from as early as 1994; with as many as four global licensees in previous years. However, there were no further particulars as to the locations and quantity of the games that were sold and nothing to suggest that the efforts had contributed to the mark being well known in Singapore.[note: 50]While the appellant stated that a worldwide licence had been granted to an Austrian company to use the “F1” logo on watches, the AR found no further particulars as to which countries “worldwide” referred to, no evidence on the use of the plain F1 mark on the watches sold in those countries and nothing to suggest that the efforts had contributed to the mark being well known in Singapore.[note: 51] 65     Before the AR, the appellant relied on a survey that was conducted in 2005 in Germany to assert that “F1” in connection with Formula 1 motor races enjoyed a high degree of distinctiveness and had even acquired a secondary meaning in relation with motor racing events such that “F1” was considered a well known mark. Although the survey was conducted in Germany, the results were “exemplary” for other countries such as Singapore, where the appellant’s championship was televised and promoted.[note: 52]However, I find that the German survey is of no assistance as it concerns a different audience in Europe.[note: 53] SECTION 2(7)(C) 66     The AR noted in the 2013 GD at [73] that the appellant had repeatedly emphasised that they had numerous trade mark registrations around the world. The respondent points out that most of the appellant’s local registrations were filed or have priority dates after the relevant date.[note: 54]For the foreign registrations, the respondent submits that the appellant had not provided supporting evidence of an alleged 2,250 trade mark filings for “F1/FORMULA 1 marks in 89 countries. Given the international nature of the appellant’s enterprise, I am prepared to believe that the appellant has a substantial number of filings. However, as the AR stated in the 2013 GD at [73], registrations do not automatically equate to trade mark use and the appellant has not proved use or recognition of its marks. Therefore, the registrations, without more, do not help to prove that the appellant’s marks are well known. SECTION 2(7)(D) 67     On this factor, the appellant submits that various other jurisdictions have held that the plain F1 mark is well known and indicative of its motor racing championship.[note: 55] 68     It cites a 2006 decision from the Chinese Trademark Review and Adjudication Board, where it succeeded in cancelling the trade mark U.I.M. World F-1 Championship and device.[note: 56]In a 2011 decision, the Canadian Intellectual Property Office also held in favour of the appellant, which in 2005, opposed an application to register “F1EMPORIUM”.[note: 57]In that decision, it was held that the appellant’s evidence showed that the plain F1 mark, while not inherently strong, had acquired sufficient distinctiveness to become a famous trade mark.[note: 58]The appellant also cites a Turkish decision by the Ankara Commercial Court of First Instance in 2003,[note: 59]which stated: “The Formula 1 trade mark is a well known trade mark. Therefore the Court did not take the expert report into consideration which is stating that F1 is not a world wide known trade mark. All knows the term F1 in Turkey.” In a Court of Rome decision in 2004, the court stated that the trade mark “F1 Formula 1” “undoubtedly belongs to the category of so-calledstrong and renownedtrade marks [emphasis in original]”.[note: 60]In Romania, the appellant also successfully opposed the application of “FD1 Formula Drift One CHAMPIONSHIP” in 2011, although this happened after the relevant date.[note: 61] 69     The appellant also cited two decisions from the WIPO Arbitration and Mediation Center. These were disputes over domain names. In a 2009 decision based on the appellant’s complaint in February 2009, the panel ordered the domain name <f1rocks.com> to be transferred to the appellant.[note: 62]In the other decision based on the appellant’s complaint in June 2011, the panel ordered the domain names <f1showcar.com>, <f1showcar.net> and <f1showcars.com> to be transferred to the appellant.[note: 63] 70     Based on the above, the appellant submitted that the plain F1 mark is “palpably well-known in Singapore, as it is in various other jurisdictions”.[note: 64] 71     In my order to the parties, the foreign decisions were to be placed before the Registrar of Trade Marks by way of written submissions and not as further evidence. Therefore, the decisions are to be regarded as authorities and not evidence that “F1” is the appellant’s well known trade mark.[note: 65] 72     The question is whether the plain F1 mark was well known by the relevant date and in Singapore. Therefore, the decisions that came after 11 January 2007 are of no assistance. Further, I accept the AR’s view in the 2015 GD at [86] that the evidence in each jurisdiction is bound to be different as it concerns different sectors of the public in different jurisdictions. Therefore, the foreign decisions do not assist “in determining the threshold issue of whether the Plain F1 Mark is well known to the relevant sector of the publicin Singapore” [emphasis in original]. As the respondent submits, foreign decisions cannot be binding on Singapore courts as intellectual property rights are jurisdictional in nature; findings of fact based on the evidence that is put before a foreign court are limited to that jurisdiction.[note: 66] 73     The WIPO decisions on the disputed domain names are also unhelpful. They are limited to their own context under the Uniform Domain Name Dispute Resolution Policy: see Tan Tee Jim,Law of Trade Marks and Passing Off in Singaporevol 2 (Sweet & Maxwell, 3rd Ed, 2014), which states (at para 20.130) that “the Uniform Dispute Resolution Policy is not, and was not designed to be, a substitute for the courts”; its decision has “no binding effect other than on the registrar of the domain name in question”.[note: 67] 74     The appellant did not adduce evidence in relation to s 2(7)(e).[note: 68] 75     Having considered the factors in s 2(7) of the TMA, I find insufficient evidence that the plain F1 mark was “well known in Singapore” as at the relevant date. Therefore, it is not an “unregistered trade mark that is well known in Singapore”,ie, a “well known trade mark” under s 2 of the TMA. It follows that it is not an “earlier trade mark” that the appellant could use in the relevant grounds of opposition under the TMA. The appellant’s earlier trade marks are limited to its three registered marks (see [14] above).",
        "The grounds of opposition": "Section 8(2)(b) 76     Section 8(2) states: A trade mark shall not be registered if because — (a)    it is identical with an earlier trade mark and is to be registered for goods or services similar to those for which the earlier trade mark is protected; or (b)    it is similar to an earlier trade mark and is to be registered for goods or services identical with or similar to those for which the earlier trade mark is protected, there exists a likelihood of confusion on the part of the public. 77     The plain F1 mark does not qualify as an earlier trade mark. Even if it does, I doubt that “F1”, being unregistered at the relevant date, could be used to oppose the application mark on this ground. Under s 8(2), an identical/similar trade mark to the earlier trade mark cannot be registered if the registration is for goods or services that are similar to those for which the earlier trade markis protected. This implies that the earlier trade mark is one that has been registered, so that it is protected for classes of goods or services. (See also Burton Ong, “Protecting Well-Known Trade Marks: Perspectives from Singapore” [2005] 95 TMR 1221 at 1234, in particular, footnote no 38). 78     To succeed under s 8(2)(b), the appellant must satisfy the court that: (a)     The application mark is similar to any of its three registered marks; (b)     The application mark is to be registered for goods or services that are identical or similar to those that any of the three registered marks are protected for; and (c)     There exists a likelihood of confusing arising from the above.[note: 69] 79     The “step-by-step” approach to an analysis under s 8(2)(b) of the TMA was laid out inStaywell, where the court held (at [15]) that the three requirements – similarity of marks, similarity of goods or services and likelihood of confusion arising from the two similarities – are systematically assessed. The first two requirements are individually assessed before the third element is assessed in the round. Whether the marks are similar 80     The comparison entails an assessment of visual, aural and conceptual similarities. The following principles were set out inHai Tong Co (Pte) Ltd v Ventree Singapore Pte Ltd and another and another appeal[2013] 2 SLR 941 at [40]:[note: 70] Further, the following principles are well established in Singapore trade mark jurisprudence (see generallySarikaat [16]–[18] andSubway Niche([33]supra) at [19] and the cases cited below): (a)     The thrust of the inquiry into similarity is directed at assessing substantive similarity. The three aspects of this evaluation, namely, visual, aural and conceptual similarities, aid the court’s evaluation by signposting its inquiry. They do not serve as a mechanistic formula of any sort. It follows that the law does not require all three similarities (visual, aural and conceptual) to be made out before the registered mark and the allegedly infringing mark may be found to be similar. Conversely, the fact that any one similarity is made out does not necessarily mandate a finding that the two marks are similar. Nor is each aspect of similarity of equal importance. Rather, the relative importance of each will depend on the circumstances, including the nature of the goods and the types of marks involved (seeMediaCorp News Pte Ltd v Astro All Asia Networks plc[2009] 4 SLR(R) 496 (“MediaCorp”) at [32]), and a trade-off can be made between the three aspects of similarity (seeOzone Communityat [40]). (b)     In assessing the similarity between two contesting marks, the court considers them “as a whole” (seeCity Chain([17]supra) at [47] and [50]), but does not take into account “any external added matter or circumstances” because the comparison is “mark for mark” (seeMediaCorpat [33], citingCaterpillar Inc v Ong Eng Peng (formerly trading as Catplus International)[2006] 2 SLR(R) 669 (“Caterpillar”) at [55]). This is unlike the position when assessing whether there is a likelihood of confusion, where, subject to the further observations we have made below, it will generally be appropriate to have regard to other relevant circumstances – see below at [79]–[98]. (c)     Although the focus of this part of the inquiry is on the marks in question, it is necessary to set out the viewpoint the court should assume. This viewpoint is that of the average consumer who would exercise some care and a measure of good sense in making his or her purchases, not that of an unthinking person in a hurry (seePolo (CA)([16]supra) at [34]). Would such a person consider the marks similar? We pause to note that despite the differing expressions that are sometimes used, this viewpoint is, for all intents and purposes, the same as that which is assumed when assessing the separate but related question of whether there is a sufficient likelihood of confusion. This is unsurprising given that there will be some inevitable overlap in the factual assessment of both elements. (d)     Furthermore, it is assumed that the average consumer has “imperfect recollection” (seeMediaCorpat [33], citingNautical Concept Pte Ltd v Jeffery Mark Richard and another[2007] 1 SLR(R) 1071 (“Nautical Concept”) at [30]). As such, the two contesting marks are not to be compared or assessed side by side and examined in detail for the sake of isolating particular points of difference. Instead, the court will consider the general impression that will likely be left by the essential or dominant features of the marks on the average consumer (seeSaville Perfumery Ld v June Perfect Ld and F W Woolworth & Co Ld(1941) 58 RPC 147 (“June Perfect”) at 161–162). 81     InStaywell, the court also held that technical distinctiveness is an “integral factor” in the marks-similarity inquiry: 24    Distinctiveness in the technical sense on the other hand, usually stands in contradistinction to descriptiveness. Where the latter connotes words that describe the goods or services in question, or of some quality or aspect thereof, the former refers to the capacity of a mark to function as a badge of origin. Distinctiveness can be inherent, usually where the words comprising the mark are meaningless and can say nothing about the goods or services; or acquired, where words that do have a meaning and might well say something about the good or services, yet come to acquire the capacity to act as a badge of origin through long-standing or widespread use (seeWindsurfing Chiemsee Produktions- und Vertriebs GmbH v Boots- und Segelzubehör Walter Huber and Franz Attenberger[1999] ETMR 585 (ECJ),Love & Co Pte Ltd v The Carat Club Pte Ltd[2009] 1 SLR(R) 561 at [98]–[100] andHai Tong([18]supra) at [32]–[33]). 25    Technical distinctiveness is an integral factor in the marks-similarity inquiry (seeSarika([18] supra) at [20],Ozone Communityat [47] andPolo (CA)([8]supra) at [36]); a mark which has greater technical distinctiveness enjoys a high threshold before a competing sign will be considered dissimilar to it (Sarikaat [36]). While the components of a mark may be inherently technically distinctive, ultimately the ability of the mark to function as a strong badge of origin must be assessed by looking at the mark as a whole. Conversely, the components of a mark may not be inherently distinctive, but the sum of its parts may have sufficient technical distinctiveness. We examined this inHai Tongin relation to the composite phrase “Lady Rose”, and there stated (at [35]): … the attempt to contend that this should be the case because of any lack of distinctiveness in the Composite Mark was unfounded. Of course, the words ‘Lady’ and ‘Rose’, when used separately, are not inventive words or phrases.However, in our judgment, it would not be correct to analyse this by reference to each of the words standing alone. It is the juxtaposition of the words that engenders distinctiveness, in that when used together, the words do not convey a sensible meaning. … [emphasis added] 82     In Lionel Bently & Brad Sherman,Intellectual Property Law(Oxford University Press, 3rdEd, 2009) at 866–867 (“Bently”), the authors stated that “the less distinctive the earlier trade mark, the less literal or visual alteration is necessary to ensure that the later mark is not similar”:[note: 71] Distinctiveness.    The question of whether marks are similar will often be dependent on the inherent or acquired distinctiveness of the mark (for the goods or services for which it is registered). This has a number of effects. First, the less distinctive the earlier trade mark, the less literal or visual alteration is necessary to ensure that the later mark is not similar. For example, the CFI comparing two words CASTELLANI and CASTELLUCA for wine from the point of view of a German consumer found the two marks to be dissimilar, because the ‘castel’ element is a common descriptive component in wine names and the applicant’s suffix ‘luca’ would be seen as the Italian name and thus sufficient to differentiate the marks. InReed Executive plc. v. Reed Business Information Ltd, Jacob LJ stated that ‘where a mark is descriptive small differences may suffice to avoid confusion’, giving an illustration from the law of passing-off concerning the terms OFFICE CLEANING ASSOCIATION and OFFICE CLEANING SERVICES. Where the distinctiveness of the earlier trade mark is very low, the later mark will have to be in close proximity for it to be similar, as with THERMAWEAR and THERMAWARM. The same principle applies to common names which intrinsically have a low level of distinctiveness. 83     The respondent submits that the appellant has no evidence to show the distinctiveness of its three registered marks through use.[note: 72]Therefore, it submits that the registered marks do not enjoy any higher threshold of protection as against the application mark.[note: 73] THE APPLICATION MARK: F1H20 84     For ease of comparison, the visual, aural and conceptual components of the application mark will first be addressed. I find no reason to disagree with the AR’s analysis of the application mark in her 2013 GD. I also accept the respondent’s submissions on the application mark.[note: 74] 85     Visually, the AR held in the 2013 GD at [82]: Visually, the mark “F1H20” is simply a combination of letters and numbers that are all equally dominant relative to each other and are likely to be perceived by the average Singaporean consumer as such. She held at [85]: Visually, the mark “F1H20” is comprised of a combination of letters and numbers in a format that gives the viewer the impression that it is a type of chemical formulae. No attempt has been made to differentiate any of the letters or numbers or combination thereof and thus they appear equally dominant relative to each other. 86     Building on the AR’s analysis, the respondent submits that there is no reason for any element in “F1H20”, such as “F1” or “H20”, to be considered the essential and dominant element. The entire mark is the essential, distinctive and dominant element.[note: 75] 87     Aurally, the AR found in the 2013 GD at [86] that “F1H20” was likely to be broken down into individual letters and numbers and pronounced as the five-syllabled “F-ONE-H-TWO-OH”. The respondent submits that every single syllable will be pronounced, with none skipped, as “F1H20” comprises a string of letters and numbers. 88     Conceptually, the AR found in the 2013 GD at [84] that “F1H20” was based on the theme of a water sport. The respondent submits that as “H20” brings the chemical formula of water to mind, some people will associate the application mark with a sports race that is held on water. Alternatively, the application mark can be considered devoid of conceptual significance as a random string of letters or letters.[note: 76] COMPARISON BETWEEN F1H20 AND THE STYLISED F1 FORMULA 1 MARK 89     I reproduce this registered mark for convenience of comparison: 90     I agree with the AR that there is no visual similarity between “F1H20” and the appellant’s stylised F1 Formula 1 mark: see 2013 GD at [82]. She rightly pointed out that the application mark is a “straightforward, unembellished combination of letters and numbers”. But the appellant’s trade mark looks very different. As the AR found:The mark, on the other hand, features a heavily stylized version of “F1” and a much smaller byline that reads “Formula 1”. The dominant feature of the mark is the heavily stylized “F1” logo, which accounts for about 90% of the overall mark. There are several narrow, horizontal lines that fade from left to right to give the impression of speed, whilst the letters “F” and “1” are slanted towards the right, further contributing to the impression of speed. The effect of the stylization plays a clever visual trick, allowing the eye to see either “F1” or simply a number “1”, from the impression created by the negative space in the stylized logo.91     Aurally, the AR rightly held in the 2013 GD at [83] that both marks are dissimilar. She performed a quantitative assessment of the relative number of syllables which the two marks have in common: seeSarika Connoisseur Café Pte Ltd v Ferrero SpA[2013] 1 SLR 531 (“Sarika”) at [28][note: 77]and considered how the average Singaporean consumer will pronounce the words. The average Singaporean consumer will pronounce the application mark as five syllables (see [87] above). However, the appellant’s mark will either be pronounced as “F-ONE” (two syllables) or “FOR-MIU-LA-ONE” (four syllables). As the AR held at [83]:The Application Mark, although having the same first two syllables when compared to the earlier pronunciation, contains three additional syllables “H-TWO-OH”. In relation to the latter pronunciation, the syllables are all pronounced differently, except for the syllable “ONE”, which is placed in a different position in the syntax of each mark. Given the difference in the number of syllables, the enunciation of the syllables and their relative positions in each of the marks, I find that the two marks are aurally dissimilar.92     Conceptually, the marks are dissimilar as F1H20 is premised on the theme of a water sport while the appellant’s mark is designed to give the impression of speed: see 2013 GD at [84].F1H20 AND FORMULA 193     Visually, the AR held in the 2013 GD at [85] that the marks are similar to the extent that the average Singapore consumer would think of some formula. However, the marks share “only some slight similarity” as the application mark is an abbreviation, while the appellant’s mark is a full word.94     Aurally, the AR found the marks dissimilar in the 2013 GD at [86]:Aurally, F1H2O is likely to be broken down into its individual letters and numbers and pronounced as “F-ONE-H-TWO-OH” (5 syllables) whilst FORMULA 1 is likely to be pronounced as “FOR-MIU-LA-ONE” (4 syllables). Each syllable of the two marks is different when pronounced aurally, save for the number “ONE”. However, the syllable “ONE” appears at a different point in the syntax of each mark, and does not contribute to any aural similarity. Accordingly I find that the marks are aurally dissimilar.95     On conceptual similarity, the AR concluded in the 2013 GD at [87]: “F1H2O is centered around the concept of a sport held on water whilst FORMULA 1 is centered around the concept of the top class of motor racing. The former focuses on the idea of location (ie. on water) whilst the latter focuses on the idea of status (ie. pinnacle, top in its class), and are therefore conceptually different.”F1H20 AND FIA FORMULA 1 WORLD CHAMPIONSHIP (AND DEVICE)96     I reproduce this registered mark for convenience of comparison:97     Visually, the two marks shared no similar elements, as the AR held in the 2013 GD at [88]. Aurally, no similarity arose as the syllable count and the pronunciation of each syllable are different – the appellant’s mark could be referred to as “FIA” or “Formula 1 World Championship”: 2013 GD at [89]. In any event, aural similarity was the least important element. Conceptually, the two marks were dissimilar as the appellant’s mark referred to a motor car race on an international scale held on land, instead of water: 2013 GD at [90].CONCLUSION ON SIMILARITY OF THE MARKS98     I accept the AR’s comparisons of the application mark with the three registered marks. The application mark is visually, aurally and conceptually dissimilar from each of the three registered marks. As a whole, the application mark is dissimilar from each of the three registered marks. Further, as there is no evidence that the three marks had acquired distinctiveness by the relevant date, less literal or visual alteration is required to ensure that the application mark is dissimilar (see [83] above).[note: 78]Whether the goods or services are identical or similar99     As the respondent does not dispute that the goods or services it seeks to register the application mark for is similar or identical to that for which the appellant is protected, I assume similarity between the goods or services.[note: 79]Whether there exists a likelihood of confusion100    I have found that the application mark is not similar to the appellant’s earlier registered marks. If I am wrong on this and “F1H20” is similar to any of the registered marks, such similarity can only be very slight as “F1” and “FORMULA 1” are descriptive when used in relation to sporting events and lack distinctiveness.[note: 80]The likelihood of confusion is lower where there is less similarity between the conflicting marks: seeStaywellat [96(a)].101    InStaywell(at [96]), the court held that the impact of the similarity of the marks and the goods or services on consumer perception is relevant to the confusion inquiry. The court held (at [64]):We approach this question again from the starting point of the Act. Once similarity between the competing marks and goods or services has been established, theimpactof these similarities on the relevant consumers’ ability to understand where those goods and services originate from falls to be considered. The only relevant confusion is that which results from the similarity between marks and goods or services. Our courts have consistently recognised this since Lai Kew Chai J articulated it inPolo(HC) ([40]supra) at [15]. Equally however, the plain words of ss 8(2) and 27(2) do not have the effect of making a finding of confusion automatic upon the establishment of similarity of marks and goods or services. If that was what was intended, as observed inPolo(CA) at [25] and inSarikaat [60], Parliament would have provided that once such similarity is found the matter ends there without any need to examine whether there is a likelihood of confusion as a result. However, we reiterate that the statute requires that any likelihood of confusion must arise from the similarity of marks and goods or services.102    Given the conceptual disparity between the application mark and the appellant’s marks, the reasonable consumer is unlikely to be confused.[note: 81]Further, the possibility of confusion is speculative.[note: 82]The respondent has used the term “F1” in relation to its events since 1990. The appellant’s marks were registered seven years later in 1997; its first night motor car race in Singapore was only in September 2008. Against this chronology, there has to be more evidence that demonstrates that a likelihood of confusion has arisen or will arise. InSarika, the Court of Appeal held:63     Confusion will not be presumed simply because the marks and the goods are similar:Polo (CA)at [25]. As this court stated inPolo (CA)at [28], citingAssociated Newspapers Ltd v Express Newspapers[2003] FSR 51, the question of likelihood of confusion has to be assessed globally, taking into account all the circumstances such as the closeness of the goods, the impression given by the marks, the possibility of imperfect recollection and the risk that it may be believed that the goods came from the same source or economically-linked sources. Mere association by the relevant public between two signs based on their similar use is insufficient to establish confusion if the public is not misapprehended about the goods’ origins:City Chainat [58]. The finding of likelihood of confusion is a finding of fact and it is a matter for the court to determine at the end of the day:Electrolux Limited v Electrix Limited(1954) 71 RPC 23 at 31.64     Survey evidence is relevant in assessing whether there is a likelihood of confusion on the part of the relevant public. That said, we agree with the Judge that survey evidence should not be conclusive (see [129] of GD). Rather, it is only one factor in the global confusion analysis. Both the Appellant and the Respondent here had conducted surveys to ascertain the proportion of the relevant public who were confused. Interestingly, each of the parties’ surveys showed that about 30% of the relevant public were likely to be confused, after adjustments were made for shortcomings in survey methodology and data collection, and the Judge found so accordingly. The Appellant was not able to furnish any compelling reason to say that this determination of the Judge is wrong. By any standard, 30% cannot be said to be insignificant, and indeed we would hold that that constitutes asubstantialportion of the relevant public (see at [57] above). Due weight ought to be given to these results in the final analysis.65     We should also add that given the degree of similarity between the mark and the sign (see [39] above) and the highly distinctive nature of the respondent’s “Nutella” word mark (see [36] above), these circumstances would certainly go no small way in confusing the relevant public. As stated in Holyoak & Torremans,Intellectual Property Law(Oxford University Press, 6thEd, 2010) (“Holyoak”)at p 437, there would generally be an increased likelihood of confusion where a mark is highly distinctive.103    Without more evidence, I am unable to find in the appellant’s favour. Therefore, the opposition under s 8(2)(b) fails.104    I have not considered the plain F1 mark under s 8(2)(b) of the TMA as the ground contemplates conflicts with earlier, registered trade marks. In any event, as I also find the plain F1 mark dissimilar to the application mark (see [109] below), the appellant cannot prevail even if “F1” is considered. Moreover, the appellant has provided little beyond mere assertions of confusion based on the purported similarities between “F1” and “F1H20”.[note: 83]Section 8(4)105    Section 8(4) states:Subject to subsection (5), where an application for registration of a trade mark is made on or after 1st July 2004, if the whole or an essential part of the trade mark is identical with or similar to an earlier trade mark, the later trade mark shall not be registered if —(a)    the earlier trade mark is well known in Singapore; and(b)    use of the later trade mark in relation to the goods or services for which the later trade mark is sought to be registered —(i)    would indicate a connection between those goods or services and the proprietor of the earlier trade mark, and is likely to damage the interests of the proprietor of the earlier trade mark; or(ii)   if the earlier trade mark is well known to the public at large in Singapore —(A)    would cause dilution in an unfair manner of the distinctive character of the earlier trade mark; or(B)    would take unfair advantage of the distinctive character of the earlier trade mark.106    The respondent points out that the appellant relies only on the plain F1 mark for this ground.[note: 84]The appellant did not dispute this in the hearing before me. In any event, the appellant’s registered marks cannot succeed on this ground since I find them dissimilar to the application mark. Under s 8(4), an application mark cannot be registered if “the whole or an essential part” of it is identical or similar to the earlier trade mark. While the phraseology differs slightly from s 8(2) (where an application mark cannot be registered if it is identical or similar to the earlier trade mark), the comparison is the same: seeSarikaat [70] andLaw of Intellectual Property of Singaporeat para 21.5.38 (including the attendant footnote).Section 8(4)(b)(i)107    To succeed, the appellant must show that:(a)     The whole or an essential part of “F1H20” is identical with or similar to the plain F1 mark;(b)     The plain F1 mark is well known in Singapore;(c)     Use of “F1H20” on goods or services that it is to be registered for will indicate a connection between them and the appellant; and(d)     There is likely to be damage to the appellant’s interests.108    As the plain F1 mark was not well known in Singapore as at the relevant date, the opposition on this ground fails. Even if “F1” was well known, it was not similar to the application mark as at the relevant date.NO SIMILARITY BETWEEN “F1H20” AND “F1”109    I accept the respondent’s submissions that the application mark and the plain F1 mark are visually, aurally and conceptually dissimilar.[note: 85]I have outlined the features of the application mark at [84]–[88] above.110    Visually, the plain F1 mark, which comprises one letter and one numeral, is less than half the length of the application mark.[note: 86]As the term “F1” is descriptive and lacks distinctiveness, a lower degree of visual alteration is required to ensure that the application mark is dissimilar to it (seeBentlyat [82] above). Moreover, I do not find the “F1” element in the application mark to be any more dominant than its “H20” element.111    For aural similarity, the two marks do not share the same number of syllables on a quantitative assessment. InStaywell(at [32]), the court described quantitative assessment as an “alternative approach”. The court also considered the dominant and distinctive components of the marks when read out:Staywellat [31]. See also theThe Audience Motivation Company Asia Pte Ltd v AMC Live Group China (S) Pte Ltd[2015] SGHC 77 at [40].112    “F1” is the common denominator of the plain F1 mark and the application mark.[note: 87]“F1” forms the first two syllables of the application mark and the whole of the plain F1 mark and will be pronounced in the same way in both marks. The appellant submits that the “H20” component in the application mark, as the molecular formula for water, is descriptive.113    However, I agree with the respondent that the essential, distinctive and dominant element is the entire application mark as a whole.[note: 88]114    The appellant submits that the “first component of a trade mark is often considered more important for the purposes of distinction”. It citesConde Nast Publications Inc v Union des Editions Modernes[1979] 46 CPR (2d) 183 (F.C.T.D.) (“Conde Nast”) andPhantom Industries Inc v Sara Lee Corp(2000) 8 CPR (4th) 109 (T.M.O.B) (“Phantom Industries”) in support of its contention.[note: 89]The appellant states: “In this instance, the first component is the distinctive term ‘F1’. The Defendant has merely juxtaposed the name for the formula of water “H20” with the Plaintiff’s ‘F1’ mark”.[note: 90]115    InConde Nast, the Federal Court of Canada found that the respondent had appropriated the appellant’s mark – MADEMOISELLE – in its entirety and added a suffix, “age tendre”. The court held at [34]:[note: 91]It is axiomatic that the first word or the first syllable in a trade mark is far the more important for the purpose of distinction. Here the first and most important word in the mark which the respondent seeks to register is identical to the mark registered by the appellant.116    The importance of the beginning of words has been stated in cases such asLondon Lubricants (1920) Ltd’s application (Tripcastroid)(1925) 42 RPC 264, where it was held (at 279):But the tendency of persons using the English language to slur the termination of words also has the effect necessarily that the beginning of words is accentuated in comparison, and, in my judgement, the first syllable of a word is, as a rule, far the most important for the purpose of distinction.117    However, while the court inDoctor’s Associates Inc v Lim Eng Wah (trading as SUBWAY NICHE)[2012] 3 SLR 193 noted that the “basis of the “first syllable” principle is that English speakers tend to slur subsequent syllables”, the rule does not apply in every case. It held (at [35]):The plaintiff submitted that as the first word of the SUBWAY NICHE mark is identical to the alleged infringing mark, the marks are aurally similar. Further, as the first syllable of the word is typically accepted to be the most important, the fact that the marks share the first word indicates the requisite similarity required under s 27(2). The basis of the “first syllable” principle is that English speakers tend to slur subsequent syllables. However, the applicability of the “first syllable” principle to the instant case is doubtful given that it seems reserved for cases where the marks comprise only one word. In any case, it is clear that the “first syllable principle” should not be applied in a “blanket fashion” (Valentino Globe BV v Pacific Rim Industries Inc[2009] 4 SLR(R) 577 at [34], citingLondon Lubricants (1920) Ltd’s Application(1925) 42 RPC 264 at 279).118    In my view, the pronunciation of “F1H20” will not lead to the slurring of the last three syllables. InPhantom Industries, a case which the appellant has cited, the Canadian Trademarks Opposition Board held (at [13]):[note: 92]The opponent has been using its mark SILKS since 1986 and therefore the length of time that the marks in issue have been in use favours the opponent. The parties’ wares are essentially the same, and, in the absence of evidence to the contrary, I assume that the parties’ channels of trade would also be the same. The parties’ marks SILKS and SILKIENCE resemble each other visually, aurally and in ideas suggested to the extent that the prefix SILK is a component of each mark. Ordinarily, it is the first portion of a trade-mark that is the most relevant for the purposes of distinction: seeConde Nast Publications Inc. v. Union des éditions modernes(1979), 46 C.P.R. (2d) 183(Fed. T.D.), at 188,Pernod Ricard v. Molson Breweries(1992), 44 C.P.R. (3d) 359(Fed. T.D.), at 370. However, in a case such as this where the first portion of the mark namely, SILK, is suggestive of the character or quality of the wares, the significance of the first portion is lessened.119    Therefore, where the first portion of a trade mark is used in a descriptive sense, its significance is lessened.[note: 93]As I have held, “F1” was descriptive at the relevant time. It described a class or standard of sport in motor racing and powerboat racing.120    On conceptual similarity, I also find both marks dissimilar. “F1H20” connotes a sport race that is held on water. It may also be considered as a random string of letters or letters and thus devoid of significance. However, as the respondent submits, “F1” – which had not acquired distinctiveness as at the relevant date – focussed on the idea of status (being at the pinnacle or in the top class) in the context of motorsport.[note: 94]121    In view of the above, I cannot accept the appellant’s submissions that whether “F1” is attached to “H20” as a prefix or suffix, the resulting mark is similar to the plain F1 mark. As a whole, the plain F1 mark and the application mark are different.122    Further, I refer to foreign decisions that held that the two marks are dissimilar on comparison.[note: 95]In a judgment dated 21 May 2015, the Court of Justice of the European Union upheld the decision dated 20 November 2012 of the Fourth Board of Appeal of OHIM or the Office for Harmonisation in the Internal Market (Trade Marks and Designs).[note: 96]The Board of Appeal found that between “F1” and “F1H20”, there was at best only a “very remote visual and aural similarity between the signs and no conceptual similarity at all”.[note: 97]The Court of Justice upheld the finding.123    Visually, it observed only a weak similarity due to the length of “F1H20” and the equal position that the components “F1” and “H20” occupy.[note: 98]Aurally, the differences in length and composition meant that the marks would be pronounced differently. While the beginnings of the marks were the same, that fact was insufficient to offset the differences.[note: 99]In addition, the difference between the lengths of the signs was more striking phonetically than visually. Therefore, the phonetic similarity was weak. Conceptually, the differences between the marks counteracted their weak visual and phonetic similarities.[note: 100]The court agreed with the Board of Appeal that “F1” was an abbreviation of “Formula one” which signified “the top class of professional motor racing”, according to an English reference dictionary. It held that “F1” was the term commonly used to designate a type of racing car and by extension, the races involving such vehicles. In contrast, “F1H20” would be perceived as a sequence of letters and figures or a chemical formula.[note: 101]124    The Court of Justice’s observations are pertinent. The respondent also cited favourable decisions from Switzerland’s Federal Administrative Tribunal and the Board of Appeals in Japan but I need not go into them.[note: 102]125    For completeness, I briefly consider the remaining elements in an opposition under s 8(4)(b)(i) of the TMA. As stated at [107(c)] above, the appellant must show that the use of the application mark in relation to the goods or services for which registration is sought will indicate a connection between them and the appellant.[note: 103]126    The “connection” element contains an implicit requirement of likelihood of confusion. The courts have held as much in the context of s 55(3)(a) of the TMA, which shares the same “connection” element as s 8(4)(b)(i). Section 55(3)(a) states:Subject to subsections (6) and (7), the proprietor of a well known trade mark shall be entitled to restrain by injunction the use in Singapore, in the course of trade and without the proprietor’s consent, of any trade mark which, or an essential part of which, is identical with or similar to the proprietor’s trade mark, in relation to any goods or services, where the use of the trade mark —(a) would indicate a connection between those goods or services and the proprietor, and is likely to damage the interests of the proprietor.127    InSarika, the court held (at [76]):As regard the “connection” and the “likely to damage the proprietor’s interests” requirements in s 55(3)(a) TMA, the Judge adopted the holding by this Court inAmanresorts(at [234]) that the tests for both these elements were “substantively the same” as the tests relating to the misrepresentation and damage elements under the law of passing off; the only difference is that the tests in passing off concern the proprietor’s “goodwill” while the tests under s 55(3)(a) TMA concern the “interests” of the well known trade mark proprietor. It is an implicit requirement that the requisite “connection” must be a confusing one,viz, a likelihood of confusion must be shown in relation to the connection between the parties’ products:Amanresortsat [218], [226] and [233];Hyundai Mobis(CA) at [36].128    It follows that the “connection” requirement in s 8(4)(b)(i) also has an implicit requirement of a likelihood of confusion. However, I have found that there can be no likelihood of confusion (see above at [100]–[104]).129    Section 8(4)(b)(i) also requires proof of the likelihood of damage to the appellant’s interests. It is unnecessary to discuss the respondent’s submissions in this respect[note: 104]as no damage arises without a confusing connection.Section 8(4)(b)(ii)130    The appellant submitted at the hearing before me that the AR should have discussed dilution. It contends that the plain F1 mark has been taken advantage of in terms of its prestige and popularity and that the respondent has tarnished the plain F1 mark by associating “F1” with the respondent’s “poorly organised power boat race”.[note: 105]131    Section 8(4)(b)(ii) sets out the anti-dilution right of the owner of an earlier trade mark which is well known to the publicat largein Singapore. I have held that the plain F1 mark, as at the relevant date, was not well known to the relevant sector of the public. It follows that it would not have been well known to the public at large. Even if the plain F1 mark was well known to a sector of the public, it is highly unlikely to have been well known to the public at large as being the appellant’s trade mark as the appellant’s night races started only in 2008. The threshold set by s 8(4)(b)(ii) is high. As stated in theLaw of Intellectual Property of Singaporeat para 21.5.50:The first point to note is that the level of reputation that the earlier trade mark must enjoy is a very high one. Niche fame – reputation within a relevant sector of the public – suffices for the confusion-based protection in s 8(4)(b)(i), but not for the anti-dilution protection in s 8(4)(b)(ii). To qualify for anti-dilution protection, the earlier trade mark must be recognised in ‘most’ sectors of the public in Singapore. In fact, it has been said that the anti-dilution protection in Singapore is the ‘preserve of a rare and privileged few’. An example of such a ‘privileged’ trade mark is theNUTELLAchocolate cream spread.132    As the plain F1 mark was not well known to the public at large, it is unnecessary to go on to consider the two limbs in s 8(4)(b)(ii).Section 8(7)(a)133    Under s 8(7)(a):A trade mark shall not be registered if, or to the extent that, its use in Singapore is liable to be prevented —(a) by virtue of any rule of law (in particular, the law of passing off) protecting an unregistered trade mark or other sign used in the course of trade.134    The provision recognises the law of passing off, which requires three elements to be proved: goodwill attached to the claimant’s product or service, misrepresentation that the defendant’s goods are the claimant’s goods or emanate from a source that is economically linked to the claimant and damage or likelihood of damage due to the defendant’s misrepresentation. The three-step process was laid out inThe Singapore Professional Golfers’ Association v Chen Eng Waye and others[2013] 2 SLR 495 at [20] (“Professional Golfers”):As a first step, a claimant will therefore have to show that there is goodwill attached to its product or service before a claim in passing off can be mounted. The inquiry at this stage might perhaps best be understood in terms of whether the claimant has established that it does have an interest that the law of passing off will protect. The second inquiry is whether the defendant’s actions amount to a misrepresentation that its goods are the claimant’s goods or emanate from a source that is economically linked to the claimant, or, to put it another way, whether the defendant is “passing off” its goods or services as those of the claimant. This typically begins with a consideration of how the defendant is said to be doing this. In general, it will entail the use of some element that serves as a badge or identifier marking the goods or services in question as emanating from the claimant (see also Christopher Wadlow,The Law of Passing-Off: Unfair Competition by Misrepresentation(Sweet & Maxwell, 4th Ed, 2011) (“The Law of Passing-Off”) at paras 3-005 and 8-001). It will be necessary here to consider whether that element does serve as a badge or identifier, or, in the parlance of the action, whether it is “distinctive” of the claimant’s goods and services, and whether the claimant’s goodwill (established under the first stage of the inquiry) is in fact associated with that element. It will then be necessary to consider, amongst other factors, whether there is such a similarity between the corresponding element that is being used by the defendant on the one hand and by the claimant on the other such that in all the circumstances, it is sufficiently likely to result in the relevant segment of the public being deceived or confused into thinking that the defendant’s goods or services are, or emanate from a source that is linked to, the claimant’s. Finally, because the tort of passing off is concerned with the protection of goodwill, it will be necessary to establish that the defendant’s misrepresentation has damaged or is likely to damage the claimant’s goodwill. We turn to consider each of these inquiries.Goodwill135    Generally, goodwill cannot exist on its own. It attaches to a business in the jurisdiction. This is often proved by evidence, such as the trader’s sales and expenses incurred in promoting its goods and services in association with the mark or brand that they bear: seeProfessional Golfersat [22]. As the appellant’s first “F1” night race took place only in 2008, I agree with the respondent that the appellant could not have acquired goodwill as at 11 January 2007 – it had yet to commence business or trade in Singapore.[note: 106]136    However, as the AR correctly held (see 2015 GD at [76]), certain types of pre-trading activity will be recognised despite the requirement for business in the jurisdiction. InCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 2 SLR 550 at [58] (“CDL Hotels”), the Court of Appeal held:On the basis of these authorities, pre-business activities can generate goodwill. This is a commonsense approach and is in line with commercial reality where promoters of businesses usually embark on massive advertising campaigns before the commencement of trading to familiarise the public with the service or product. In every case, whether the pre-trading activity suffices in generating goodwill is a question of fact and depends on the nature and intensity of the activity in question. Heavy advertising, as in Allen v Brown Watson (supra), will be adequate. On the other hand, mere preparations for trading will not, as in Amway Corpn v Eurway International Ltd [1974] RPC 82, where the foreign plaintiffs, apart from ‘minor trading activities’, had merely begun organising promotion of their business by seeking premises and interviewing prospective employees in England.137    InStaywell, the court held (at [163(j)]):The “hard-line” approach to goodwill is softened in Singapore to the extent that pre-trading activity need not be revenue-generating as long as it is directed at generating demand for the plaintiff’s business and the trader evinces an unequivocal intention to enter the market (see [140]–[145] above).138    TheLaw of Intellectual Property of Singaporeat para 17.4.38 emphasised the importance of requiring an unequivocal intention to enter the market. The author stated: “The unfairness to a plaintiff (whether he is a foreign trader or a local trader) is more pronounced when a plaintiff, who has a reputation in Singapore and has unequivocally demonstrated his interest in the Singapore market, is pre-empted by another trader who seeks to have a free ride on his reputation in Singapore.”139    Before me, the appellant submitted that while the AR recognised the possibility that a trader can have goodwill in a country before it operates a business in the jurisdiction, she erred in finding insufficient pre-trading activity, and hence insufficient goodwill, on the evidence before her.140    However, there is no reason to disagree with the AR. The appellant’s evidence does not demonstrate pre-trading activities that evince its unequivocal intention to enter the Singapore market. Before the relevant date, three news articles from the Today newspaper (see [50] above) merely stated the possibility of appellant having a race in Singapore in 2008. For example, the article dated 31 March 2006 and headlined “Mosley backs F1 in Singapore” quoted the former FIA president as saying: “If the infrastructure and financial commitment is in place, then it is always possible that Singapore could host a Grand Prix in 2008.” However such a statement does not amount to an unequivocal intention to enter the Singapore market.[note: 107]141    The appellant does not have evidence of its sales or expenses incurred in promoting its goods or services, such as evidence of heavy advertising prior to the relevant date.[note: 108]There were articles that suggested that the appellant’s Sepang circuit was popular among Singaporeans[note: 109]but the evidence was directed at the Malaysian circuit.[note: 110]It does not follow that because its championship had business presence in Malaysia, goodwill as to the “F1” mark was necessarily engendered in Singapore before the relevant date.[note: 111]As the AR held in the 2015 GD at [79]: “Specifically in relation to the Sepang Grand Prix, the activities relied on by the Opponents were not generating demand internally (within Singapore) but aimed primarily at promoting their business in Sepang, Malaysia.”142    Other articles documented the television broadcast in Singapore of the appellant’s championship and the promoting and marketing of “F1” merchandise.[note: 112]The appellant submits that these clearly show that it has taken substantial effort to establish goodwill in the “F1” mark in Singapore prior to the relevant date. The goodwill has caused the plain F1 mark to be distinctively indicative of its championship.[note: 113]However, as the AR pointed out in the 2015 GD at [78], the broadcasts in 2005 and 2006[note: 114]were for the Italian and Monaco Grand Prix and “there is no indication that it was intended to generate demandin Singaporefor the Opponents’ goods and services” [emphasis in original]. She also found that articles and advertisements on “F1” merchandise were in fact generating demand for other parties’ products.143    In several news articles, “F1” was used to refer to the appellant’s championship.[note: 115]However, I have found that before the relevant date, “F1” was used in a descriptive sense and not as a trade mark denoting the appellant exclusively. These articles do not evince the appellant’s unequivocal intention to enter the market.[note: 116]Other articles before the relevant date include a letter to the press dated 31 March 2005 by a self-professed “F1 fan”, urging the Singapore authorities not to let the chance to host the appellant’s championship slip past and a news article dated 18 May 2005 that claimed that Renault’s success in the championship had boosted sales of its cars.[note: 117]I share the AR’s doubts that such articles can constitute pre-trading activities as they were not conducted by the appellants: see 2015 GD at [79].144    At the hearing before me, the appellant also drew my attention to the fact that politicians in Singapore had recognised the prestige and popularity of its championships and the plain F1 mark in Singapore, as well as in the neighbouring countries.[note: 118]It cited a written reply to a parliament question by Second Minister for Trade and Industry S Iswaran in November 2012.[note: 119]In the reply, the minister said that the cost of organising each race was about $150 million and the government co-funded 60% of approved costs. In turn, the F1 Singapore Grand Prix had generated about $150 million in incremental tourism receipts per race. This article was after the relevant date. However, the appellant contended that the article showed that given the costs involved, the authorities must have found sufficient goodwill prior to the relevant date. Otherwise, they would not have decided to bring in the appellant’s motor race in 2008. In further support of its contention, the appellant also cited the Today newspaper article dated 16–17 April 2005 (at [55] above) in which the late Minister Mentor Lee Kuan Yew said that the decision not to build a Formula 1 Circuit earlier was one that had cost Singapore money.145    Generally, goodwill cannot exist on its own but attaches to a business in the jurisdiction. The appellant had not started its races in Singapore at the relevant date. Pre-trading activities may lead to a finding of goodwill but the evidence does not support any such conclusion.Misrepresentation and Damage146    Even if the appellant had the requisite goodwill, the evidence does not support any misrepresentation. When the term “F1” was first applied to the respondent’s powerboat racing championships in Singapore, it preceded the appellant’s night races here by 18 years.[note: 120]Before the relevant date, the plain F1 mark was not linked exclusively with the appellant. This is evident from several articles tendered by the respondents, which show that the media or third parties used “F1” in relation to the respondent.[note: 121]Hence, no misrepresentation can arise. It follows that there is no damage to the appellant’s goodwill.Section 7(6)147    Under s 7(6), a trade mark shall not be registered if an application is made in bad faith. However, the appellant has not adduced any evidence to discharge its legal burden to prove bad faith. In contrast, the respondent has tendered evidence to support its assertion of prior use of the plain F1 mark in Singapore.[note: 122]Therefore, I agree with the AR in the 2013 GD:116    The Applicants have filed substantial evidence in relation to their use of the terms FORMULA 1/ONE” and “F1” in the context of powerboating, from 1990 to 1992 and subsequently, in 2004 (3rd Renaud, Exhibits D and E respectively). In particular, the Applicants have filed a 150-page media report on their UIM F1 Powerboat Championship event held on 19-20 September 2004 in Marina Bay, Singapore, exhibiting a set of receipts from Mediatech Services Pte Ltd and Mediacorp TV, showing that the Applicants have spent $192,160 on advertisement and promotion in cinemas and outdoor LED boards as well as $56,700 on paid spots in local television channels such as Channel 5 and Channel 8, for this event alone.117    The Applicants have stated in 1st Renaud that the Applicants coined the Application Mark “F1H2O” as it references the F1 Powerboat World Championship and the fact that powerboating is a water sport (H2O being a reference to water). The Opponents do not dispute that H2O is a reference to water. In view of the evidence above, I accept that the Applicants are likely to have derived the mark “F1H2O” on their own, with references to the class of powerboat racing (F1) and water (H2O). The extensive use of the term “F1” in relation to powerboat racing by the Applicants between 1990 and 2004 and the fact that it is a term that relates to a particular class of powerboat racing and notexclusivelywith the Opponents' motor racing events, suggests that the Applicants have not made the present application in bad faith. I note that the Opponents, although claiming to have used the Plain F1 Mark prior to 1990, have not shown any evidence of such use, or how their Plain F1 Mark could have informed the creation of the Application Mark. [emphasis in original]Conclusion148    In the years since the start of the appellant’s annual night races in 2008, it could perhaps be said that the plain F1 mark has become distinctive of the appellant in Singapore. This is especially likely as it has been a few years since the respondent’s last powerboating championship was held here in 2011.[note: 123]However, for the purpose of these opposition proceedings, the findings have to be based on the evidence before the relevant date.149    Having considered the parties’ submissions, I find no reason to disagree with the AR. The appellant’s case is dismissed on all grounds and the respondent’s application mark can proceed to registration. The appellant is to pay the respondent its costs to be agreed or taxed.[note: 1][2013] SGIPOS 8 at [14].[note: 2]Respondent’s submissions at [24].[note: 3]Respondent’s submissions at [9].[note: 4]Plaintiff’s submissions at [2].[note: 5]Respondent’s submissions at [10].[note: 6][2013] SGIPOS 8 at [3].[note: 7][2013] SGIPOS 8 at [122].[note: 8]See Respondent’s Submissions at [31]-[36].[note: 9]Respondent’s Submissions at [65].[note: 10]Plaintiff’s Bundle of Documents Vol II at p172.[note: 11]Respondent’s Submissions at [122].[note: 12]Respondent’s Bundle of Authorities Vol 2 at Tab 16.[note: 13]Respondent’s Submissions at [51].[note: 14]Respondent’s Bundle of Authorities Vol 2 at p812.[note: 15]Respondent’s Submissions at [56].[note: 16][2013] SGIPOS 8 at [59].[note: 17][2015] SGIPOS 7 at [59] and [62].[note: 18]Respondent’s Submissions at [60].[note: 19][2015] SGIPOS 7 at [62].[note: 20]Respondent’s Submissions at [60(d)].[note: 21][2015] SGIPOS 7 at [62].[note: 22][2015] SGIPOS at [62].[note: 23][2015] SGIPOS 7 at [51].[note: 24][2015] SGIPOS 7 at [50].[note: 25][2015] SGIPOS 7 at [69].[note: 26]Respondent’s Submissions at [63].[note: 27]Respondent’s Submissions at [64].[note: 28]Respondent’s Submissions at [65].[note: 29]Respondent’s Submissions at [124].[note: 30]Respondent’s Submissions at [66].[note: 31]See also Respondent’s Submissions at [119].[note: 32][2013] SGIPOS 8 at [57].[note: 33]Respondent’s Submissions at [130].[note: 34]Respondent’s Submissions at [132].[note: 35]Respondent’s Submissions at [133].[note: 36]Respondent’s Submissions at [133].[note: 37]Respondent’s Submissions at [134].[note: 38]Respondent’s Submissions at [136].[note: 39]Respondent’s Submissions at [137].[note: 40]Plaintiff’s Bundle of Documents Vol 1 at p37.[note: 41]Plaintiff’s Bundle of Documents Vol 1 at p14.[note: 42]Plaintiff’s Bundle of Documents Vol 2 at p185.[note: 43][2013] SGIPOS 8 at [45].[note: 44]Plaintiff’s submissions at [53]-[54].[note: 45]Plaintiff’s submissions at [34].[note: 46]Plaintiff’s Bundle of Documents Vol 1 at p38.[note: 47]Plaintiff’s Bundle of Documents Vol 1 at p51.[note: 48]Respondent’s Submissions at [145].[note: 49][2013] SGIPOS at [68].[note: 50]Respondent’s Submissions at [68(v)].[note: 51]Respondent’s Submissions at [68(vi)].[note: 52]Respondent’s Submissions at [146] and [2013] SGIPOS 8 at [69].[note: 53][2013] SGIPOS 8 at [70].[note: 54]Respondent’s Submissions at [151].[note: 55]Plaintiff’s submissions at [36].[note: 56]Plaintiff’s Bundle of Documents Vol 1 at p65.[note: 57]Plaintiff’s Bundle of Documents Vol 1 at p68.[note: 58]Plaintiff’s Bundle of Documents Vol 1 at p81.[note: 59]Plaintiff’s Bundle of Documents Vol 1 at p111.[note: 60]Plaintiff’s Bundle of Documents Vol 1 at p136.[note: 61]Plaintiff’s Bundle of Documents Vol 1 at p100.[note: 62]Plaintiff’s Bundle of Documents Vol 1 at p91.[note: 63]Plaintiff’s Bundle of Documents Vol 1 at p98.[note: 64]Plaintiff’s submissions at [46].[note: 65]Respondent’s Submissions at [154].[note: 66]Respondent’s Submissions at [155].[note: 67]Respondent’s Bundle of Authorities Vol 2 at p821.[note: 68]Respondent’s Submissions at [157] and [2013] SGIPOS 8 at [75].[note: 69]Respondent’s Submissions at [46].[note: 70]Respondent’s Bundle of Authorities Vol 1 at Tab 11.[note: 71]Respondent’s Bundle of Authorities at Tab 21.[note: 72]Respondent’s Submissions at [56].[note: 73]Respondent’s Submissions at [69].[note: 74]Respondent’s Submissions at [78].[note: 75]Respondent’s Submissions at [78].[note: 76]Respondent’s Submissions at [78].[note: 77]Respondent’s Bundle of Authorities Vol 2 at Tab 15.[note: 78]Respondent’s Submissions at [92], [98] and [102].[note: 79]Respondent’s Submisisons at [109].[note: 80]Respondent’s Submissions at [110].[note: 81]Respondent’s Submissions at [112].[note: 82]Respondent’s Submissions at [113].[note: 83]Plaintiff’s submissions at [58], [63] and [66].[note: 84]Respondent’s Submissions at [115].[note: 85]Respondent’s Submissions at [160]-[166].[note: 86]Respondent’s Submissions at [162].[note: 87]Plaintiff’s submissions at [58].[note: 88]Respondent’s Submissions at [81] and [163].[note: 89]Plaintiff’s submissions at [64].[note: 90]Plaintiff’s submissions at [64].[note: 91]Plaintiff’s Bundle of Authorities at p41.[note: 92]Plaintiff’s Bundle of Authorities at p47.[note: 93]Respondent’s Submissions at [86].[note: 94]Respondent’s Submissions at [165].[note: 95]Respondent’s Submissions at [103]-[106].[note: 96]See Respondent’s Bundle of Authorities Vol 1 at Tabs 9 and 10.[note: 97]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p176.[note: 98]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 39.[note: 99]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 40.[note: 100]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, paras 43-44.[note: 101]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 41.[note: 102]Respondent’s Submissions at [105]-[106].[note: 103]Respondent’s Submissions at [167]-[169].[note: 104]Respondent’s Submissions at [170]-[184].[note: 105]Plaintiff’s submissions at [47]-[48].[note: 106]Respondent’s Submissions at [188].[note: 107]Respondent’s Submissions at [190].[note: 108]Respondent’s Submissions at [191].[note: 109]Plaintiff’s submissions at [21]-[25].[note: 110]Respondent’s Submissions at [192].[note: 111]Plaintiff’s submissions at [21].[note: 112]Plaintiff’s submissions at [16]-[18].[note: 113]Plaintiff’s submissions at [19].[note: 114]Plaintiff’s Bundle of Documents at pp11-12.[note: 115]Plaintiff’s submissions at [20].[note: 116]Respondent’s Submissions at [193].[note: 117]Plaintiff’s Bundle of Documents Vol 1 at pp 26-27.[note: 118]Plaintiff’s submissions at [31]-[33].[note: 119]Plaintiff’s Bundle of Documents Vol 1 at p141.[note: 120]Respondent’s Submissions at [203].[note: 121]Respondent’s Submissions at [203].[note: 122]Respondent’s Submissions at [209].[note: 123]Plaintiff’s submissions at [49].",
        "Conclusion": "148    In the years since the start of the appellant’s annual night races in 2008, it could perhaps be said that the plain F1 mark has become distinctive of the appellant in Singapore. This is especially likely as it has been a few years since the respondent’s last powerboating championship was held here in 2011.[note: 123]However, for the purpose of these opposition proceedings, the findings have to be based on the evidence before the relevant date. 149    Having considered the parties’ submissions, I find no reason to disagree with the AR. The appellant’s case is dismissed on all grounds and the respondent’s application mark can proceed to registration. The appellant is to pay the respondent its costs to be agreed or taxed.  [note: 1][2013] SGIPOS 8 at [14]. [note: 2]Respondent’s submissions at [24]. [note: 3]Respondent’s submissions at [9]. [note: 4]Plaintiff’s submissions at [2]. [note: 5]Respondent’s submissions at [10]. [note: 6][2013] SGIPOS 8 at [3]. [note: 7][2013] SGIPOS 8 at [122]. [note: 8]See Respondent’s Submissions at [31]-[36]. [note: 9]Respondent’s Submissions at [65]. [note: 10]Plaintiff’s Bundle of Documents Vol II at p172. [note: 11]Respondent’s Submissions at [122]. [note: 12]Respondent’s Bundle of Authorities Vol 2 at Tab 16. [note: 13]Respondent’s Submissions at [51]. [note: 14]Respondent’s Bundle of Authorities Vol 2 at p812. [note: 15]Respondent’s Submissions at [56]. [note: 16][2013] SGIPOS 8 at [59]. [note: 17][2015] SGIPOS 7 at [59] and [62]. [note: 18]Respondent’s Submissions at [60]. [note: 19][2015] SGIPOS 7 at [62]. [note: 20]Respondent’s Submissions at [60(d)]. [note: 21][2015] SGIPOS 7 at [62]. [note: 22][2015] SGIPOS at [62]. [note: 23][2015] SGIPOS 7 at [51]. [note: 24][2015] SGIPOS 7 at [50]. [note: 25][2015] SGIPOS 7 at [69]. [note: 26]Respondent’s Submissions at [63]. [note: 27]Respondent’s Submissions at [64]. [note: 28]Respondent’s Submissions at [65]. [note: 29]Respondent’s Submissions at [124]. [note: 30]Respondent’s Submissions at [66]. [note: 31]See also Respondent’s Submissions at [119]. [note: 32][2013] SGIPOS 8 at [57]. [note: 33]Respondent’s Submissions at [130]. [note: 34]Respondent’s Submissions at [132]. [note: 35]Respondent’s Submissions at [133]. [note: 36]Respondent’s Submissions at [133]. [note: 37]Respondent’s Submissions at [134]. [note: 38]Respondent’s Submissions at [136]. [note: 39]Respondent’s Submissions at [137]. [note: 40]Plaintiff’s Bundle of Documents Vol 1 at p37. [note: 41]Plaintiff’s Bundle of Documents Vol 1 at p14. [note: 42]Plaintiff’s Bundle of Documents Vol 2 at p185. [note: 43][2013] SGIPOS 8 at [45]. [note: 44]Plaintiff’s submissions at [53]-[54]. [note: 45]Plaintiff’s submissions at [34]. [note: 46]Plaintiff’s Bundle of Documents Vol 1 at p38. [note: 47]Plaintiff’s Bundle of Documents Vol 1 at p51. [note: 48]Respondent’s Submissions at [145]. [note: 49][2013] SGIPOS at [68]. [note: 50]Respondent’s Submissions at [68(v)]. [note: 51]Respondent’s Submissions at [68(vi)]. [note: 52]Respondent’s Submissions at [146] and [2013] SGIPOS 8 at [69]. [note: 53][2013] SGIPOS 8 at [70]. [note: 54]Respondent’s Submissions at [151]. [note: 55]Plaintiff’s submissions at [36]. [note: 56]Plaintiff’s Bundle of Documents Vol 1 at p65. [note: 57]Plaintiff’s Bundle of Documents Vol 1 at p68. [note: 58]Plaintiff’s Bundle of Documents Vol 1 at p81. [note: 59]Plaintiff’s Bundle of Documents Vol 1 at p111. [note: 60]Plaintiff’s Bundle of Documents Vol 1 at p136. [note: 61]Plaintiff’s Bundle of Documents Vol 1 at p100. [note: 62]Plaintiff’s Bundle of Documents Vol 1 at p91. [note: 63]Plaintiff’s Bundle of Documents Vol 1 at p98. [note: 64]Plaintiff’s submissions at [46]. [note: 65]Respondent’s Submissions at [154]. [note: 66]Respondent’s Submissions at [155]. [note: 67]Respondent’s Bundle of Authorities Vol 2 at p821. [note: 68]Respondent’s Submissions at [157] and [2013] SGIPOS 8 at [75]. [note: 69]Respondent’s Submissions at [46]. [note: 70]Respondent’s Bundle of Authorities Vol 1 at Tab 11. [note: 71]Respondent’s Bundle of Authorities at Tab 21. [note: 72]Respondent’s Submissions at [56]. [note: 73]Respondent’s Submissions at [69]. [note: 74]Respondent’s Submissions at [78]. [note: 75]Respondent’s Submissions at [78]. [note: 76]Respondent’s Submissions at [78]. [note: 77]Respondent’s Bundle of Authorities Vol 2 at Tab 15. [note: 78]Respondent’s Submissions at [92], [98] and [102]. [note: 79]Respondent’s Submisisons at [109]. [note: 80]Respondent’s Submissions at [110]. [note: 81]Respondent’s Submissions at [112]. [note: 82]Respondent’s Submissions at [113]. [note: 83]Plaintiff’s submissions at [58], [63] and [66]. [note: 84]Respondent’s Submissions at [115]. [note: 85]Respondent’s Submissions at [160]-[166]. [note: 86]Respondent’s Submissions at [162]. [note: 87]Plaintiff’s submissions at [58]. [note: 88]Respondent’s Submissions at [81] and [163]. [note: 89]Plaintiff’s submissions at [64]. [note: 90]Plaintiff’s submissions at [64]. [note: 91]Plaintiff’s Bundle of Authorities at p41. [note: 92]Plaintiff’s Bundle of Authorities at p47. [note: 93]Respondent’s Submissions at [86]. [note: 94]Respondent’s Submissions at [165]. [note: 95]Respondent’s Submissions at [103]-[106]. [note: 96]See Respondent’s Bundle of Authorities Vol 1 at Tabs 9 and 10. [note: 97]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p176. [note: 98]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 39. [note: 99]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 40. [note: 100]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, paras 43-44. [note: 101]Respondent’s Bundle of Authorities Vol 1 Tab 9 at p193, para 41. [note: 102]Respondent’s Submissions at [105]-[106]. [note: 103]Respondent’s Submissions at [167]-[169]. [note: 104]Respondent’s Submissions at [170]-[184]. [note: 105]Plaintiff’s submissions at [47]-[48]. [note: 106]Respondent’s Submissions at [188]. [note: 107]Respondent’s Submissions at [190]. [note: 108]Respondent’s Submissions at [191]. [note: 109]Plaintiff’s submissions at [21]-[25]. [note: 110]Respondent’s Submissions at [192]. [note: 111]Plaintiff’s submissions at [21]. [note: 112]Plaintiff’s submissions at [16]-[18]. [note: 113]Plaintiff’s submissions at [19]. [note: 114]Plaintiff’s Bundle of Documents at pp11-12. [note: 115]Plaintiff’s submissions at [20]. [note: 116]Respondent’s Submissions at [193]. [note: 117]Plaintiff’s Bundle of Documents Vol 1 at pp 26-27. [note: 118]Plaintiff’s submissions at [31]-[33]. [note: 119]Plaintiff’s Bundle of Documents Vol 1 at p141. [note: 120]Respondent’s Submissions at [203]. [note: 121]Respondent’s Submissions at [203]. [note: 122]Respondent’s Submissions at [209]. [note: 123]Plaintiff’s submissions at [49]."
    }
}