{
    "case_title": "Tan Bee Hoon (executrix for the estate of Quek Cher Choi, deceased) and\n                another\n      v\n      Quek Hung Heong and others",
    "ncitation": "[2015] SGHC 229",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1       This case concerns an order of court that was\n                    sought by the plaintiff-executors (“the Plaintiffs”) for the sale\n                    of a plot of land at Coronation Road (“the Property”), originally\n                    bought in 1966, co-owned by the deceased persons and the surviving parties. This\n                    application for an order for sale followed from an earlier action involving\n                    them. In the earlier action, the 1st Defendant, Quek Hung Heong, sought to\n                    establish that he was the sole beneficial owner of the Property. While one of\n                    the other co-owners did not contest this, the 1st Defendant failed against the\n                    rest. Given the state of relations and the impracticability of dividing the\n                    Property, the Plaintiffs thus sought the sale of the Property in the present\n                    proceedings. The 1st Defendant however resisted this by raising a number of\n                    arguments, including that he was entitled to exclusive possession, that the\n                    Plaintiffs were estopped from claiming the Property, and that he had obtained\n                    adverse possession. I found that he did not succeed on any of these points, and\n                    that the Property should be sold with the proceeds divided. I also found that he\n                    could not raise the claim in proprietary estoppel as this should have been\n                    raised in the earlier proceedings. The 1st Defendant has appealed.",
        "Background": "2       In 1966, the Quek family purchased the Property\n                        (ie, a plot of land at Coronation Road), upon\n                    which a bungalow presently stands. The Quek family members held the Property as\n                    tenants-in-common in equal shares. The registered proprietors are: (a)     Quek Cher Choi, the father. He passed\n                        away in 1981. (b)     Heng Sai Kee, the mother. She passed away in 1986. (c)     Kwek Hann Song, the oldest child. He\n                        passed away in 2006. (d)     Quek Yang Eng, the middle child; and (e)     Quek Hung Heong, the youngest\n                    child. The Plaintiffs are the estates of the\n                        parents. They seek an order against the other owners or their respective\n                        estates for the sale of the Property. As noted, the 1st Defendant is Quek\n                        Hun Heong. The 2nd Defendant is Quek Yang Eng and the 3rd and 4th Defendants\n                        are the executor and executrix of Kwek Hann Song. None of the other\n                        Defendants aside from the 1st Defendant took an active part in these\n                        proceedings. 3       The 1st Defendant had actually launched an\n                    action,Quek Hung Heong v Tan Bee Hoon (executrix for estate\n                        of Quek Cher Choi, deceased) and others and another suit[2014]\n                    SGHC 17 (“S 722”), against the other four owners, claiming the\n                    whole beneficial interest in the Property and seeking its transfer to him. He\n                    founded his claim on various equitable bases including a resulting trust, a\n                    constructive trust and proprietary estoppel. Quek Yang Eng consented to judgment\n                    in favour of the 1st Defendant. The suit was dismissed by Coomaraswamy J, who\n                    found that the other owners beneficially owned their own share. 4       Following the conclusion of S 722, the\n                    Plaintiffs sought sale in lieu of partition. The 3rd and 4th Defendants\n                    supported the position of the Plaintiffs; the 2nd Defendant, Quek Yang Eng, was\n                    only a nominal defendant. The 1st Defendant resisted the Plaintiffs’\n                    application.",
        "Additional arguments invited": "5       After hearing arguments, and reserving judgment,\n                    I invited additional arguments on the following questions: (a)     Whether proprietary estoppel, as\n                        opposed to promissory estoppel, can be used to acquire new rights and can\n                        thus operate as a cause of action? See for example,Thorner v Major and others[2009] UKHL 18 (“Thorner v Major”). If a proprietary estoppel\n                        is found to arise, the remedy awarded by the Court is at the Court’s\n                        discretion:Low Heng Leon Andy v Low Kian Beng Lawrence\n                            (administrator of the estate of Tan Ah Kng, deceased)[2013]\n                        3 SLR 710. (b)     On\n                        this basis, is the 1st Defendant barred from raising proprietary estoppel by\n                        the rule inHenderson v Henderson[1843-1860]\n                        All ER Rep 378 (“Henderson v\n                        Henderson”),ie, the rule\n                        against abuse of process, also known as the expandedres\n                            judicatadoctrine? SeeGoh Nellie v Goh\n                            Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”). In particular, are therebona fidereasons why the proprietary\n                        estoppel claimed here, and the other grounds raised by the 1st Defendant,\n                        such as the claim in ‘adverse possession’, were not raised in S\n                        722? (c)     As the\n                        remedy is discretionary, does the rejection in S 722 of a proprietary\n                        estoppel claim giving rise to a beneficial interest bar, whether onHenderson v Henderson,res judicataor issue estoppel grounds, the present\n                        proprietary estoppel claim of exclusive possession for his lifetime? That\n                        is, could the 1st Defendant, (who was the plaintiff in S 722), have asked\n                        the court there to award exclusive possession for his lifetime, and did his\n                        omission then prevent him from raising this in the present\n                        proceedings?",
        "The Plaintiffs’ Case": "6       The Plaintiffs argued that the Property should\n                    be subject to sale in lieu of partition. Sale was necessary, expedient and more\n                    appropriate. Partition would be impractical and unworkable. Sale on the other\n                    hand would allow the value of the Property to be realised. As to the arguments\n                    made by the 1st Defendant in resisting the sale, it was argued that the\n                    Plaintiffs’ actions were neither time barred by adverse possession, or by\n                    the doctrine of laches. The latter in particular was not applicable as the\n                    Plaintiffs’ claim was legal and not equitable. Neither was there any\n                    proprietary estoppel, nor issue estoppel against the Plaintiffs. In the\n                    circumstances, sale should be ordered without any crediting for the value of\n                    improvements or consequential orders sought by the 1st Defendant. 7       As to the questions raised by the Court, the\n                    Plaintiffs argued that the 1st Defendant’s arguments on proprietary\n                    estoppel and adverse possession were indeed an abuse of process, infringing the\n                    rule inHenderson v Henderson. In particular, the\n                    1st Defendant’s claims in the present case were a collateral attack on the\n                    decision in S 722, and the 1st Defendant relied essentially on the same facts as\n                    in S 722. The claims in the present application should have been raised in the\n                    earlier proceedings.",
        "The 1st Defendant’s case": "8       The 1st Defendant resisted the application,\n                    seeking to have exclusive possession of the Property, during his lifetime. The\n                    1st Defendant argued that the claim by the Plaintiffs for sale was time barred\n                    under the Limitation Act (Cap 163, Rev Ed 1996) (“the Limitation\n                    Act”) and by the adverse possession of the Property by the 1st Defendant.\n                    The claim of adverse possession was not an assertion of title, and therefore the\n                    Land Titles Act (Cap 157, Rev Ed 2004) (“the LTA”) did not come\n                    into play. There was also laches and/or acquiescence against the\n                    Plaintiffs. 9       The Plaintiffs were estopped, through a\n                    representation and reliance – no action was taken to dispossess the 1st\n                    Defendant, and he suffered detriment in the form of expenditure on the Property,\n                    as well as losing the opportunity of having his own property. Alternatively, the\n                    others had obtained a benefit and gained – this is sufficient to establish\n                    promissory estoppel. 10     As for the sale of the Property, this was\n                    neither necessary nor expedient. No urgency was shown. In any event, even if\n                    sale should be ordered, time should be given for the 1st Defendant to find\n                    alternative accommodation. The 1st Defendant also counterclaimed under O 28 r 7\n                    of the Rules of Court (Cap 322, R5, Rev Ed 2014) for improvements made by him\n                    relating to improvements made on the Property, property taxes paid by him and\n                    the freeing in 1981 of an encumbrance over the Property. As against the 3rd and\n                    4th Defendants,res judicataapplied. 11     No issue estoppel arises in the present case.\n                    Neither was the issue at hand fundamental to the previous decision in S 722.\n                    That earlier suit did not investigate the 1st Defendant’s right of\n                    exclusive possession. The rule inHenderson v\n                        Hendersonwas not engaged either: the 1st Defendant was not\n                    required to raise the issue of exclusive possession earlier. Only the beneficial\n                    interest was a live issue in S 722. There was no abuse of process. In\n                    particular, he did not seek to challenge any of the conclusions in the earlier\n                    suit. If anything, the abuse of process argument would also apply to the\n                    Plaintiffs in their claim for possession or sale.",
        "The Decision": "I found that the Plaintiffs’ application for sale should be\n                    granted. The various grounds relied upon by the 1st Defendant in resisting the\n                    application were not made out. 12     I concluded that the 1st Defendant was\n                        precluded from raising proprietary estoppel on the basis of the letters as\n                        that was a matter he should reasonably have raised in the earlier suit: in\n                        other words, it was an abuse of process for him to raise proprietary\n                        estoppel in the present proceedings. On the other hand, neither cause of\n                        action nor issue estoppel operated against him. In any event, even if the\n                        1st Defendant was not barred from raising proprietary estoppel in the\n                        present case, this was not made out. Neither was adverse possession nor\n                        promissory estoppel made out. Given this, there was nothing to stand in the\n                        way of the Plaintiffs’ application for partition or sale in lieu of\n                        partition. Sale was preferable in the circumstances of the case. However,\n                        some of the expenditure incurred by the 1st Defendant had to be taken into\n                        account, and this was reflected in my order. 13     As a preliminary point, it should be noted\n                    that these grounds deal with estoppel in three main guises: (a)     Estoppel in respect of past\n                        decisions in the form of cause of action estoppel and issue\n                    estoppel; (b)     Proprietary estoppel; and (c)     Promissory estoppel. Care has to be taken to ensure that the requirements of each use are borne\n                        in mind; inadvertent eliding of the differences is to be avoided. The\n                        distinction is most marked between (a) on the one hand, with (b) and (c) on\n                        the other. In (a), the estoppel is in the ability of the parties to avoid\n                        the binding effect of previous judicial determination. In the latter, the\n                        estoppel is concerned with whether one party can move away from a particular\n                        position that it had held out to the other. Proprietary estoppel operates to\n                        give effect to what is held out even to the extent of affecting the\n                        proprietary rights of the implicated party. Promissory estoppel protects an\n                        expectation of forbearance in an existing relationship. It may be that the\n                        lines between promissory estoppel and proprietary estoppel may blur further\n                        in future, but that is outside the scope of these\n                grounds. 14     The 1st Defendant’s submissions\n                    interweaved the discussion of proprietary estoppel and promissory estoppel.\n                    While the requirements of representation, reliance and detriment overlap, to my\n                    mind, it is inadvisable to combine any discussion of the two doctrines in this\n                    way – there remain significant differences between them. 15     I should also note that acquiescence was\n                    considered in the proceedings in two senses: as an aspect of representation in\n                    proprietary estoppel, and as a defence in equity. The latter will be discussed\n                    briefly towards the end of these grounds.",
        "Abuse of Process": "16     I found that the 1st Defendant was precluded\n                    from asserting proprietary estoppel as a basis of resisting the application by\n                    the Plaintiffs. As noted above, the earlier proceedings involved a claim by the\n                    1st Defendant against the Plaintiffs and the other present Defendants that the\n                    Property was held in trust for him, and that they should transfer their\n                    respective shares to him. The primary basis was that this reflected a family\n                    arrangement made by the parties. In the course of his decision on the claim,\n                    Coomaraswamy J found that proprietary estoppel based on that family arrangement\n                    was not made out: at [122]. As proprietary estoppel and indeed the assertion of\n                    a full beneficial interest was raised in the earlier suit, S 722, the invocation\n                    by the 1st Defendant of proprietary estoppel in the present case was an abuse of\n                    process since it should have reasonably been raised in S 722, and. he did not\n                    give adequate reason why this was not done. 17     The 1st Defendant argued that in the earlier\n                    proceedings, the only live issue was the beneficial interest claimed by the 1st\n                    Defendant. It was not unreasonable therefore for the 1st Defendant not to have\n                    addressed the exclusive possession claim in that case. No abusive element arose\n                    from the circumstances of the case. It was said that it never occurred to him\n                    nor was it in his contemplation to assert proprietary estoppel in order to\n                    assert exclusive possession. It was further argued that the Plaintiffs should\n                    have been under an obligation to raise their present claim in the earlier\n                    proceedings as well. The 1st Defendant contended that in the earlier\n                    proceedings, parties were only concerned with the beneficial interest. I found\n                    that none of these arguments could hold. The statement of the rule in Henderson v Henderson 18     The rule inHenderson v\n                        Hendersonessentially states that a party will not be allowed to\n                    raise an issue which could have been raised and determined in earlier\n                    proceedings:Barrow v Bankside Members Agency Ltd[1996] 1 All ER 981. This may be an assertion of the general inherent\n                    jurisdiction of the court: Professor Zuckerman inPrinciples\n                        of Civil Procedure(Sweet & Maxwell, 2nd Ed, 2006)\n                        (“Principles of Civil\n                    Procedure”) para 25.101. The scope of the rule has been much\n                    considered and refined since its first pronouncement inHenderson v Henderson. In certain circumstances, abuse of\n                    process would be committed by a party arguing a point in current proceedings\n                    which could have been raised in earlier proceedings. The rule is essentially\n                    founded on a need to protect the administration of justice, by preventing\n                    relitigation. In broad terms, it helps protect against a party having multiple\n                    bites at the cherry. 19     The rule was considered inGoh Nellie. CitingHunter v Chief Constable\n                        of the West Midlands Police[1982] AC 529 (“Hunter”), and after referring to the local cases\n                    ofKwa Ban Cheong v Kuah Boon Sek[2003] 3 SLR(R)\n                    644 (“Kwa Ban Cheong”) andLai Swee Lin Linda v AG[2006] 2 SLR(R) 565\n                        (“Linda Lai”), Sundaresh Menon\n                    JC stated at [53] : … a court should determine whether there is an abuse of process by\n                        looking at all the circumstances of the case, including whether the later\n                        proceedings in substance is nothing more than a collateral attack upon the\n                        previous decision; whether there is fresh evidence that might warrant\n                        re-litigation; whether there arebona fidereasons why an issue that ought to have been raised in the earlier action\n                        was not; and whether there are some other special circumstances that might\n                        justify allowing the case to proceed. The absence or existence of these\n                        enumerated factors (which are not intended to be exhaustive) is not\n                        decisive. Menon JC emphasised that in determining whether abuse of\n                        process arose, there should be consideration of the balance between allowing\n                        a litigant his day in court, and the undue oppression that would result to\n                        the defendant because of repeated litigation. What needed to be determined\n                        was whether, considering the circumstances of the earlier proceedings, the\n                        issue ought really to have been raised at that time. 20     As noted by Professor Zuckerman inPrinciples of Civil Procedureat para 25.105: … [T]here is no hard and fast rule in this regard. Whether a party\n                        would be prevented from advancing a claim or an issue he could have advanced\n                        in previous proceedings will depend on the circumstances of the case. In\n                        determining whether to allow a party to advance such cause or issue the\n                        court will consider whether it was reasonable or desirable to advance the\n                        cause or issue in previous proceedings. From this, it can be derived that the fact that an issue was not raised in\n                        earlier litigation does not by itself bar raising it subsequently. There\n                        must be something in the nature of an abuse. Situations where no abuse arises 21     Cases in which the rule inHenderson v Hendersonwere not held to apply can generally be\n                    seen as involving reasonable grounds for not having raised the issue earlier.\n                    This explains the cases cited by the 1st Defendant. (a)     Consequential matters. A number of\n                        these cases were concerned with the second action coming as a consequence of\n                        the first. Where the latter proceedings flowed out of the earlier, to deal\n                        with consequential matters or to effect a remedy contemplated in the earlier\n                        proceedings, there would not be any abuse of process. The case ofLee Hiok Tng v Lee Hiok Tng[2001] 1 SLR(R) 771\n                        concerned a second action following on as a consequence of the first. There\n                        is alsoNg Chee Chong and another v Toh Kouw and\n                            another[1999] 2 SLR(R) 909, which concerned an earlier\n                        action for a deposit, and a later action for wrongful\n                    repudiation. (b)     New\n                        circumstances. Another instance in which no abuse would be found would be\n                        where new circumstances arise. So for instance in the case ofChing Mun Fong (executrix of the estate of Tan Geok Tee,\n                            deceased) v Liu Cho Chit and another appeal[2000] 1 SLR(R)\n                        53, the mistake of law was not known in the earlier\n                    proceedings. (c)     Impecuniosity or other explanation for initial inaction. A category of\n                        situations in which reasonableness was shown would include the case ofBradford & Bingley Building Society v\n                            Seddon[1999] 1 WLR 1482, in which claims were not sought\n                        initially because of impecuniosity. As for the case ofLow Heng Leon Andy v Low Kian Beng Lawrence (administrator of the\n                            estate of Tan Ah Kng, deceased)[2013] 3 SLR 710, the earlier\n                        proceedings were terminated by consent order, which presents a different\n                        context: the circumstances giving rise to a consent order, especially the\n                        facts that may have been the basis of the consent order, have to be\n                        carefully considered by the court. In some cases, there may be a distinct\n                        difference in the facts as understood, and facts subsequently uncovered. It\n                        may be that subsequent proceedings should more readily be allowed\n                        then. (d)     Reasonable grounds. A broader class where the rule is not applicable\n                        encompasses situations where it is reasonable that the issue or argument was\n                        not raised. The case ofGoh Nellieillustrates\n                        this. On the facts of that case, it was found that the rule was not engaged.\n                        That case concerned the devise of two properties by the deceased there to\n                        her children. One of the children, R, applied for and obtained in\n                        Originating Summons No 618 of 2005 (“OS 618/2005”) an order\n                        that she could reside in one of the properties rent free and that it could\n                        not be sold without her consent. Subsequently, an order for sale for the\n                        property was sought by some of the other beneficiaries in Originating\n                        Summons No 950 of 2006 (“OS 950/2006”). An application was\n                        thus made under the Trustees Act to sanction the sale. Menon JC found that\n                        the order made in OS 618/2005 related only to R’s right of residence\n                        and was not similar or identical to her right of veto of sale in OS\n                        950/2006. There was thus no abuse of process. 22     In comparison, cases where the rule was\n                    properly invoked are as follows: (a)     Those in which it is clear that\n                        there is nothing more than re-litigation and an attack on a prior decision.Kwa Ban CheongandLinda Laiare examples of this. And inKwa Ban Cheong, Belinda Ang J noted that re-litigation could\n                        arise even if different plaintiffs were involved; in that case, it was held\n                        that it was an abuse of process for the plaintiff to seek adjudication on\n                        the title to shares when this had been already decided in previous\n                        proceedings. And inLinda Lai, the plaintiff\n                        was barred from raising judicial review in her claim as that had already\n                        been determined earlier, albeit against a different formal party. She was\n                        additionally barred from raising matters which should have been raised in\n                        the earlier proceedings. The Court of Appeal additionally found that despite\n                        a difference in the remedies claimed, it would have been abuse of process\n                        for her to proceed. (b)     Those in which it is clear that the issue would have readily refuted\n                        the initial claim. This is illustrated by the Privy Council decision ofYat Tung Investment Co Ltd v Dao Heng Bank\n                            Ltd[1975] AC 581 (“Yat\n                            Tung”). In that case, the initial proceedings involved\n                        a claim by the appellant that a mortgage supposedly given over its property\n                        to a bank was a nullity. The counterclaim by a bank for a mortgage balance\n                        was allowed. In that case, no question was raised by the customer of the\n                        bank about the power of sale exercised by the bank. Subsequently, the\n                        customer sought a declaration that the sale by the bank was fraudulent. The\n                        Privy Council held that the second proceedings were an abuse of process\n                        because the issue of fraud should have been raised in the initial\n                        proceedings. While the remarks on what constituted abuse of process given by\n                        Lord Kilbrandon in the advice of the Privy Council have been rejected inJohnson v Gore Wood & Co[2002] 2 AC\n                        1, the actual result has not. What is common betweenYat\n                            Tungand the present application was that the issue raised\n                        the second time around in both cases was something that could have been\n                        readily refuted in the initial claim; where such an issue is not raised\n                        until later, it is clearly an abuse of process. Another instance is found in\n                        the case ofTalbot v Berkshire County Council[1994] QB 290. A claim for injuries was made following an earlier claim for\n                        contribution for an accident. The claim of injuries was\n                    barred. 23     Much depends on an appreciation of the overall\n                    justice of the case. It is unlikely that any definitive rule could be developed.\n                    InDe Crittenden v Bayliss[2005] EWCA Civ 1425\n                        (“De Crittenden”), the English\n                    Court of Appeal dismissed an appeal against the decision of the judge at first\n                    instance finding that the action should be dismissed as the claim made should\n                    have been raised in earlier proceedings. In this case, much turned on the\n                    inability of the court to fully inquire into the matter because the main\n                    protagonists had passed away. The complexity of the earlier action may also be\n                    material:Aldi Stores Limited v WSP Group PLC and\n                        Ors[2007] EWCA Civ 1260. That case concerned complex commercial\n                    litigation resulting from building damage to a supermarket, involving the\n                    operators of the supermarket, builders, and specialist consultants. In essence,\n                    the plaintiff was faced by an argument that it was barred from proceeding in the\n                    action as it should have raised its claim in its actions against one Holmes\n                    (“H”) as H would have in turn joined the defendants. The English\n                    Court of Appeal found that there was no abuse as the decision made by the\n                    plaintiff was reasonable in view of the complexity of the litigation there. The\n                    case ofBooth v Booth[2010] EWCA Civ 27 is also\n                    probably best seen as an illustration of a holistic assessment: it would seem\n                    that in that case the English Court of Appeal would have been inclined to allow\n                    a striking out on the basis of abuse of process as the issues had been raised in\n                    earlier litigation, but did not do so as the point was not taken up till\n                    substantial rights had been determined in the second litigation. Application to the present case 24     In the present case, the assertion of\n                    proprietary estoppel did amount to an abuse of process given that this was\n                    claimed, albeit on a different basis, in S 722. It was in effect an attack on\n                    the previous action in S 722, in which the Court there found that the claim made\n                    by the present 1st Defendant in proprietary estoppel on the basis of the family\n                    arrangements was not made out? The basis of the judge’s finding was that\n                    there was no family arrangement on the evidence, as there were internal\n                    inconsistencies in the 1st Defendant’s evidence, there was no support from\n                    relevant accounts or documents, and subsequent actions were inconsistent with\n                    any family arrangements. 25     I did not accept the 1st Defendant’s\n                    arguments. The 1st Defendant argued that there was no abuse: firstly,bona fidereasons existed why exclusive possession was\n                    not raised in S 722, as the 1st Defendant’s focus was on beneficial\n                    ownership and the proprietary estoppel claim was on the basis of inaction over\n                    the years, particularly after letters had been sent by lawyers acting for the\n                    parents and Kwek Hann Song; and secondly, , ifHenderson v\n                        Hendersonshould apply to the 1st Defendant, it should also apply\n                    to the Plaintiffs in respect of their claim Proprietary estoppel was to the same effect 26     As noted above, the 1st Defendant sought to\n                    invoke proprietary estoppel as a property right to defeat or at least modify the\n                    Plaintiffs’ claim. The assertion of this property right here was just a\n                    mirror image of the claim that the 1st Defendant launched against the other\n                    co-owners in S 722: what was raised here was a defence, while what was raised in\n                    S 722 was a cause of action. 27     As will be considered below, proprietary\n                    estoppel is a broad and discretionary doctrine that aims to vindicate\n                    representations or promises made, which are supported by detrimental reliance by\n                    the claimant. In dealing with the possibility of abuse of process in the context\n                    of a proprietary estoppel claim, one must look at a broad factual substratum:\n                    there can be variation in representations and reliance that are easily raised or\n                    invoked. This is not to say that there can only be one shot at making out\n                    proprietary estoppel, but there must be a markedly different set of\n                    circumstances relied upon, and an entirely different proprietary remedy sought.\n                    A party cannot finesse the representation relied on: given the broad nature of\n                    the doctrine, almost any statement, action or omission could theoretically be\n                    the basis of a claim of representation. While it is true that the\n                    representations were on the surface different, this did not bring the present\n                    case out of the rule. One was founded on the family arrangements. The other on\n                    inaction. Had they been the same, eitherres\n                        judicataor issue estoppel would have applied. However, even with\n                    this surface difference, the basis of the 1st Defendant’s assertion that\n                    the Plaintiffs were bound by a representation made by them, causing the 1st\n                    Defendant to incur detrimental reliance, was the same in both s 722 and the\n                    present case. 28     It is also pertinent that in the present case\n                    what is at stake is the Plaintiffs’ assertion of rights flowing from\n                    ownership recognised and vindicated in S 722. The 1st Defendant was attacking\n                    the result and determination in that case: he sought to assert a larger interest\n                    than his acknowledged share, by way of a property right derived from proprietary\n                    estoppel after it had been decided that the 1st Defendant had only an equal\n                    share alongside the other co-owners. The fact of the matter is that the 1st\n                    Defendant raised the point that he had a beneficial interest in the earlier\n                    proceedings, invoking multiple grounds as a basis. It would have been reasonable\n                    for him to have raised his current proprietary estoppel claim then. While the\n                    present claim is for a proprietary estoppel founded on a different basis and a\n                    different specific remedy, it is of the same broad nature as his previous\n                    claim. 29     In addition, while the remedy sought differs\n                    in that the 1st Defendant now asks for an equity to be recognised for his\n                    exclusive possession of the Property during his life time, rather than a sole\n                    beneficial interest, it was a claim that he could have made earlier as well in S\n                    722. The fact that the specific remedies may be different does not mean that\n                    abuse would not arise. What matters is whether the issue was indeed raised in\n                    the earlier proceedings.Linda Laiillustrates\n                    this point. The Court of Appeal there gave short shrift to the appellant’s\n                    argument that abuse orres judicatadid not arise\n                    because she had sought a quashing order previously, as opposed to her instant\n                    claim of a declaration: seeLinda Laiat [56] to\n                    [61]. 30     In the present case, it is significant that\n                    the remedy that may be ordered is at the discretion of the Court. The Court\n                    aims, when a proprietary estoppel claim is made out, to craft a remedy or equity\n                    that vindicates the representation or promise giving rise to the proprietary\n                    estoppel. This may thus take various forms. Conceivably, it may even involve the\n                    payment of a sum of money. At the other end of the spectrum would be the\n                    granting of a full beneficial interest in the Property. As the remedy is\n                    discretionary, conceivably, the previous action founded on proprietary estoppel\n                    could have resulted in the 1st Defendant’s success in that case by way of\n                    an order for exclusive possession. A party cannot invoke variations on the theme\n                    of the proprietary remedy that is claimed. Permitting this would again be too\n                    loose, resulting in a never ending series of different proprietary estoppel\n                    claims. 31     The 1st Defendant argued that what was at\n                    stake in the first action was a claim for the whole beneficial interest, while\n                    what was claimed here was just a right to exclusive possession. But the\n                    essential effect was the same in either case – the other co-owners (save\n                    for his sister who had conceded his claim earlier) would not be able to enjoy\n                    the Property – they would not be able to exercise their right to dispose\n                    of it, or even to enter and use it. Ownership entails the right to enjoy\n                    exclusive possession or its fruits; exclusive possession is the prime benefit of\n                    ownership. These two rights are sides of the same coin. The fact of the matter\n                    is that the 1st Defendant argued in the earlier case for a whole interest. That\n                    should encapsulate any lesser interest. Otherwise, it would lead to the opposing\n                    side suffering delay by a thousand different cuts. 32     This is illustrated byDe\n                        Crittenden, where the English Court of Appeal found that it was\n                    an abuse of process for the plaintiff there to pursue an action founded on\n                    fiduciary duties, when he had already pursued against the defendant an action\n                    based on an agreement between them. The English Court of Appeal agreed with the\n                    finding by the trial judge in the second action that the plaintiff could and\n                    should have framed the fiduciary claim as an alternative. As the business\n                    relationship between the parties was in issue in the first action, the plaintiff\n                    there should have brought his entire case then. 33     There was thus nothing raised in the present\n                    proceedings to show that the present proprietary estoppel claim was founded on\n                    evidence that was newly discovered or which could not have been used in the\n                    earlier proceedings. All in all, there was no sufficient explanation given as to\n                    why this claim could not have been raised earlier. Fact that the 1st Defendant initiated the earlier action is\n                immaterial 34     The fact that that the 1st Defendant was the\n                    plaintiff in the other action cannot be a material consideration. If it were\n                    otherwise, the operation of the rule would just be a tactical matter. Whether\n                    the rule applied or not would be the result of the vagaries of who commenced\n                    proceedings. 35     It is true that English Court of Appeal inHenley v Bloom[2010] 1 WLR 1770\n                        (“Henley v Bloom”) stated at\n                    [33] that where a second action is brought by the party who was the defendant in\n                    the earlier action, it is more difficult to argue that an abuse arises, as\n                    compared to where the claimant is the same in both actions. This observation did\n                    not raise an absolute bar to abuse being found in situations where the role of\n                    the parties are reversed between the first and second actions. The English Court\n                    of Appeal inHenley v Bloomtook pains to note\n                    that their observation was not one of principle. To my mind, it is certainly\n                    easier for a party who is the defendant in both actions to make out abuse\n                    – harassment for instance would be more readily made out, as the defendant\n                    would be at the receiving end in both instances; it would also be easier to find\n                    overlap between causes of action founded on the same facts. However, there is\n                    nothing in principle that requires the court to not apply theHenderson v Hendersonrule where parties switch roles in\n                    litigation, whether the party committing abuse moves from plaintiff to\n                    defendant, or vice versa. No special circumstances 36     No special circumstances exist in the present\n                    case that would justify a departure from the effect of the rule inHenderson v Henderson. 37     The present case differed fromGoh Nellie. It is pertinent that the legal basis in each\n                    of theGoh Nellieactions was different. In the\n                    first action there, what was in issue was the right to stay on the property. The\n                    second action concerned the right of veto of sale conferred on a beneficiary: at\n                    [45] ofGoh Nellie. In the present case however,\n                    the 1st Defendant made a claim of proprietary estoppel giving him an interest in\n                    the Property in both S 722 and the present application. 38     The case ofHenley v\n                        Bloomdiscussed above may be thought of as contrary authority. In\n                    the first action, Mr Henley had an action brought against him by Mrs Bloom for\n                    possession of a rental flat occupied by Mr Henley. Mr Henley initially resisted\n                    it on grounds that it was not just and equitable, as required by the relevant\n                    legislation in the United Kingdom, for an order of possession to be made against\n                    him. Eventually, a consent order was recorded in which Mr Henley gave up\n                    possession in good and tenantable repair and condition in return for various\n                    payments by Mrs Bloom. Subsequently, in a second action, after obtaining an\n                    expert’s assessment of the condition of the flat, Mr Henley then brought\n                    an action against Mrs Bloom for breach of obligations to repair and quiet\n                    enjoyment, claiming damages. Mrs Bloom not unexpectedly raised abuse of process.\n                    The District Judge held in favour of Mrs Bloom. On appeal to the County Court,\n                    the appeal was dismissed on the basis that the condition of the flat was raised\n                    in the submissions and was subject to the consent order. On further appeal to\n                    the English Court of Appeal, it was found that there was no abuse of process as\n                    the issues were distinct. In the view of the Court of Appeal, the possession\n                    claim did not involve any issue about the state of repair. That alone makesHenley v Bloomdistinguishable from the\n                    present case: here, the proprietary estoppel would establish a right excluding\n                    and depriving the co-owners of their legal title, just as much as the finding of\n                    beneficial interest in S 722 would have excluded them as well. Additionally, the\n                    position inHenley v Bloomwas also reached\n                    because of the non-availability of the expert report on the condition of the\n                    flat in the earlier proceedings: seeHenley v\n                        Bloomat [34].Henley v Bloomshould also then be seen as a case where no abuse arose because of new evidence\n                    or circumstances.",
        "Cause of Action and Issue Estoppel": "39     The requirements of cause of action and issue\n                    estoppel were not met in the present case. Cause of action estoppel did not\n                    arise as the cause of action was not the same in both the earlier and subsequent\n                    proceedings; the comparison of the two causes of action differ from the\n                    comparison undertaken in theHenderson v Hendersonanalysis. As the claim in the earlier proceedings was one for the Property by\n                    the 1st Defendant and the current proceedings relate to his assertion of a\n                    property right to resist the application for sale, the causes of action cannot\n                    be said to be the same at all. 40     Issue estoppel was not available as there was\n                    insufficient identity of subject matter. The requirements of issue estoppel are\n                    that (seeLee Tat Development Pte Ltd v Management\n                        Corporation Strata Title Plan No 301)[2005] 3 SLR (R)\n                    157): (a)     There be a final and conclusive\n                        judgment on the merits; (b)     The judgment must be by a court of competent\n                        jurisdiction; (c)     There is identity of parties; and (d)     Identity of subject matter. Identity of parties is not viewed narrowly:Goh\n                            Nellie. However, no issue turns on that in the present case.\n                        What was crucial here was identity of subject matter, which is weighed\n                        taking into account the factual matrix in the earlier decision:Goh Nellie.Menon JC noted inGoh\n                            Nellieat [34]: … the issues must be identical in the sense that the prior decision\n                        must traverse the same ground as the subsequent proceeding’s and the\n                        facts and circumstances giving rise to the earlier decision must not have\n                        changed or should be incapable of change. Menon J considered other decisions, such asRichards v Richards[1953] P 36 andMills\n                            v Cooper[1967] 2 QB 459, illustrating that differences in\n                        the facts, or changes, even potential changes, in facts, would mean that the\n                        subject matter is different. 41     In the present case, in S 722, the\n                    determination of the court was that there was no proprietary estoppel. The claim\n                    of proprietary estoppel was founded on a family arrangement arising out of a\n                    family meeting convened in 1966. In addition, the claim of proprietary estoppel\n                    in S 722 was geared towards establishing a full beneficial interest. Strictly\n                    speaking then, the ambit of the issue in S 722 was different from that in the\n                    present proceedings, though the legal category was the same. Issue estoppel\n                    could not thus be made out.",
        "Proprietary Estoppel": "42     Even if it was not barred by the previous suit\n                    from being presently argued, proprietary estoppel was not made out by the 1st\n                    Defendant. The 1st Defendant could not establish any of the elements of\n                    proprietary estoppel. These were that there was a representation (or assurance,\n                    as is sometimes preferred), reliance and detriment; the exact formulation may\n                    differ in the cases and texts, but nothing to my mind turns on this in the\n                    present case. I should note also that there are local cases such asChng Bee Kheng and another (executrixes and trustees of the estate\n                        of Fock Poh Kum, deceased) v Chng Eng Chye[2013] 2 SLR 715, in\n                    which estoppel by acquiescence was considered as a separate concept from\n                    proprietary estoppel. The elements are traditionally listed slightly differently\n                    from proprietary estoppel. I am of the view, however, that estoppel by\n                    acquiescence is really a species of proprietary estoppel and its analysis should\n                    proceed with the same elements. 43     What is required for proprietary estoppel has\n                    been the subject of further consideration in England. InThorner v Major, Lord Walker reiterated that proprietary\n                    estoppel is based on the elements: representation or assurance, reliance by the\n                    claimant and detriment because of reasonable reliance. However, there remains a\n                    live concern among some commentators that a distinction be maintained between\n                    different standards of the doctrine. These have been identified as an\n                    acquiescence-based principle, a representation based-one and a promise-based\n                    principle, with differences as to how the elements are satisfied in each\n                    instance, and what remedies may be available: seeSnell’s Equity(John McGhee gen. ed) (Sweet & Maxwell,\n                    33rd Ed, 2015) (“Snell’s\n                    Equity”) at paras 12-032 to 12-037 and Ben McFarlane’sThe Law of Proprietary Estoppel(Oxford\n                    University Press, 2014) at para 1.05. While there may be some force in this\n                    argument in favour of a segregated analysis, especially when one considers the\n                    historical development of the doctrine, my inclination would be to see these as\n                    aspects of a single doctrine, protecting against unconscionable conduct. Some\n                    distinction may need to be drawn depending on how the representation is made and\n                    also between a representationsimpliciter,\n                    acquiescence, or promise, but they are at the heart different manifestations of\n                    the same concept. There has to be some cause emanating from the Plaintiffs\n                    leading to the 1st Defendant’s detrimental reliance. 44     It may be that this issue would merit further\n                    consideration in and guidance by a higher court, but I did not call for\n                    arguments on these points as I did not think that even on the application of\n                    segregated as opposed to a unified analysis, the result here would be different.\n                    As it is, the development of the doctrine and its local application up to 2007\n                    has been amply considered by Menon JC inHong Leong Singapore\n                        Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292\n                        (“Hong Leong Finance”). I will\n                    thus consider the issue that there be: (a)     A representation, whether by way of\n                        a representation in its conventional sense, encouragement, by a promise, or\n                        by acquiescence; (b)     reliance; and (c)     detriment. 45     I note that in some discussions, reliance and\n                    detriment are considered together. The editors ofTan Sook\n                        Yee’s Principles of Singapore Land Law(S Y Tan, H W Tang\n                    & K Low eds) (LexisNexis, 3rd Ed, 2009) (“Tan Sook\n                        Yee”) analyse ‘detrimental reliance’\n                    compositely. This may allow for more efficient exposition. I have not however\n                    adopted that approach in the present case simply because the submissions and\n                    authorities cited use the three-fold set of requirements. Representation 46     No representation was made out. There was no\n                    express promise invoked in the present case. To put the 1st Defendant’s\n                    case at its best, the 1st Defendant relied upon the inaction of the Plaintiffs\n                    or the deceased persons, all the years he was allowed to remain on the Property,\n                    as well as specifically, the inaction after letters of demand were sent by the\n                    Plaintiffs in 1979 and 1980. That would not be sufficient. The required\n                    representation must be one that the claimant had an interest or right to the\n                    land. The letters themselves could not be taken as representations that rights\n                    or claims would be recognised. The letters asked for the Property to be vacated.\n                    That is entirely incompatible with the existence of a right to occupy. Further,\n                    the letters themselves asserted a right by the Plaintiffs’ predecessors in\n                    title that was contrary to the 1st Defendant’s assertion of his interest.\n                    The inaction thereafter could be construed in many ways – it was not\n                    unequivocally an acceptance of the 1st Defendant’s claim on the Property.\n                    There was nothing more that was required for the Plaintiffs, who were not under\n                    an obligation to reassert the same point continuously, or to assert the claim on\n                    a frequent, regular basis. The inaction over the decades could have been borne\n                    out of inertia, confusion, or ignorance. Any inaction alone does not amount to a\n                    representation that a right or claim is recognised or admitted. Inaction could\n                    simply be unequivocal. 47     Further, as noted by Menon JC inHong Leong Financeat [194] silence can only amount to\n                    sufficient representation if there is a duty to speak. This recognises that\n                    silence can be attributed to many reasons, which may not at all be connected\n                    with recognition or acceptance of a right or interest in the Property or a\n                    representation, even in the form of acquiescence. There is certainly no duty to\n                    speak imposed on the Plaintiffs; the mere passage of time could not create such\n                    a duty. Reliance 48     There was no reliance in the present\n                    case. 49     The test for reliance has been described in\n                    several ways. Again, it has been posited that there should be a differentiation\n                    depending on the type of proprietary estoppel in question:Snell’s Equity, para 12-042. I am again doubtful that\n                    there should be such granularity. It suffices to note that what mattered was\n                    showing that the 1st Defendant acted on the basis of the content of the\n                    representation or promise made. The various formulations, conveniently\n                    summarised inSnell’sEquityat para 12-042, include: (a)     Whether the 1st Defendant would have\n                        acted any differently apart from the representation.Taylors Fashions Ltd v Liverpool Victoria Trustees Co Ltd[1982] QB 133 at 156,. (b)     Whether the representation was a significant factor:Steria Ltd v Hutchison[2006] EWCA Civ\n                        1551; and (c)     The\n                        existence of a sufficient causal link:Gillett v\n                            Holt[2001] Ch 210 (“Gillett v\n                            Holt”). 50     I was satisfied that on any of these, the 1st\n                    Defendant had not made out his case. In any event, I would be inclined to the\n                    view that the various formulations require linkage only; I am doubtful that the\n                    various cases consciously adopted different formulations because of the\n                    different strands of proprietary estoppel as identified inSnell’s Equity. 51     There is some controversy on the burden of\n                    showing reliance. The more common view is that the burden is taken to have\n                    shifted to the party denying reliance once representation and detriment is made\n                    out:Hong Leong Financeat [207] citingGreasley v Cooke[1980] 3 All ER 710. This shifting is\n                    of the evidential burden and has on occasion been characterised as a\n                    presumption: seeSnell’s Equityat para\n                    12-042.Snell’s Equitytakes the view that\n                    there is no actual shift, but simply an inference of reliance from\n                    representation and detriment. The High Court of Australia has taken a different\n                    view that the burden lies on the claimant:Sidhu v Van\n                        Dyke[2014] HCA 19 at [57]. I do not think that in the present\n                    case the issue is material, though I am sympathetic to the view expressed inSnell’s Equityand am of the view that\n                    the burden always lies on the party claiming the estoppel, but that in some\n                    factual situations, reliance is readily inferable once representation and\n                    detriment is made out. 52     In the present case, the 1st Defendant’s\n                    actions on the Property are referable instead to his maintenance of the Property\n                    while he was in sole occupation of it. The 1st Defendant relied upon the fact\n                    that the 1st Defendant did not purchase another property that he could have\n                    built his life with; that he was deprived of the possibility of accretion to\n                    such other property that he could have obtained; that he is now old and would\n                    suffer if he moved out; and that he had paid for property taxes, discharged a\n                    mortgage and made other payments maintaining the Property. 53     None of these could be linked or connected\n                    directly with the representation that the 1st Defendant relied on. Most of the\n                    expenses on the Property could be explained as being part of the necessary\n                    expenditure of someone who was in actual occupation of the Property and went to\n                    his enjoyment of that Property. There was nothing that was referable to the\n                    representation or promise – there had to be something more than what a\n                    co-owner occupying the Property would have to do. It may be that if there had\n                    been an express quid pro quo between the parties, something of a promise to him\n                    that in return for his expenditure that he would obtain a greater interest, the\n                    kind of expenditure he incurred would be sufficient. But that would have\n                    required a different kind of representation other than mere silence or inaction\n                    as the 1st Defendant relied on in the present case. Detriment 54     In assessing detriment, the court does not\n                    take a narrow view:Gillett v Holt. The fact that\n                    benefit may be obtained is relevant, and may outweigh the need to vindicate the\n                    claimant’s reliance on a representation. Here, what the 1st Defendant\n                    referred to as detriment were largely expenses that would be expected of any\n                    co-owner seeking to continue his enjoyment of the Property. The 1st Defendant\n                    obtained the occupation, use and enjoyment of the Property all these years.\n                    Aside from the payment made to discharge a mortgage, he did not show that there\n                    was anything that would have gone beyond the normal expenditure of a co-owner in\n                    actual occupation. Spending what one would need to even in the absence of any\n                    right larger than the legal ownership that one has is not detriment by any\n                    means. It may be that he may have some right to reimbursement or accountinginter sefor such expenditure, but that is a\n                    separate issue. 55     As for the discharge of the mortgage or\n                    encumbrance, in S 722, this was found to be payment of a debt which did not\n                    arise in respect of the purchase of the Property, but freeing an encumbrance\n                    arising from an overdraft granted to him and his brother, Kwek Hann Song, for\n                    share trading: see the judgment in S 722 at [110]-[111]. This raises at least an\n                    issue estoppel against the 1st Defendant on this point: there was commonality of\n                    identity of subject matter and parties, as well as a final conclusive judgment\n                    on the merits. Given that the payment was not in respect of the Property, and\n                    not in respect of all the co-owners, this could not count as\n                detriment.",
        "Promissory estoppel": "56     The 1st Defendant invoked promissory estoppel.\n                    This was not barred as an abuse of process as it could not have been asserted as\n                    a basis for the 1st Defendant’s claim in S 722. But for the same reasons\n                    as that in respect of proprietary estoppel, there was no representation or\n                    promise that would have been a foundation for the estoppel. 57     For promissory estoppel to be established\n                    there must be (B P Exploration (Libya) v Hunt (No.\n                        2)[1979] 1 WLR 783 at 812): (a)     A legal relationship giving rights\n                        and duties between the parties; (b)     A representation from one party to the other that he will\n                        not enforce his strict legal rights arising out of that relationship;\n                        and (c)     Reliance by\n                        the other party on that representation. In addition, it must also be inequitable for the representing party to go\n                        back on that representation:Nippon Yusen Kaisha v\n                            Pacifica Navegacion SA (The Ion)[1980] 2 Lloyd’s Rep\n                        245. This is usually supplied by detriment. 58     The same points can be made here as were made\n                    in respect of representation and reliance in the context of proprietary\n                    estoppel. As noted above, silence could be explained in many ways, and cannot\n                    generally be taken as assent or in this case forbearance giving up enforceable\n                    rights. I do accept, as argued by the 1st Defendant, thatLam\n                        Chi Kin David v Deutsche Bank AG[2011] 1 SLR 800 has adopted a\n                    broader notion of detriment: it would be sufficient for an advantage to be\n                    gained by the promisor. However, in this case, there was no such advantage. If\n                    anything, in this case it was the 1st Defendant who secured an advantage in the\n                    intervening years – namely his use of the Property. Neither could benefit\n                    to the Plaintiffs be seen in the expenditure incurred by the 1st Defendant for\n                    the reasons given above.",
        "The adverse possession argument": "59     The next argument raised asserting a property\n                    interest countervailing the Plaintiffs’ rights as co-owner was adverse\n                    possession. I also rejected the 1st Defendant’s invocation of adverse\n                    possession as a sufficient basis to resist the order for sale. In respect of\n                    Torrens land in Singapore, adverse possession is but an assertion of the\n                    operation of a limitation period barring the erstwhile land owner from asserting\n                    title better than that of the claimant in possession of that land. 60     The 1st Defendant did not comply with ss\n                    174(7) or (8) of the LTA, which required him to lodge applications for\n                    possessory title. The Plaintiffs made this omission the primary plank of their\n                    argument against the 1st Defendant’s reliance on adverse\n                    possession. 61     The 1st Defendant tried to argue that his\n                    position was preserved by the predecessor to the current version of the LTA. He\n                    had a right under the predecessor version of the LTA, namely, the 1985 edition\n                    of the LTA (“the 1985 LTA”), to either lodge a caveat claiming\n                    adverse possession when qualified title was issued, or to claim adverse\n                    possession 12 years after the qualified tile was issued. 62     No caveat was in fact lodged, but the 1st\n                    Defendant contended that his interest had crystallised 12 years after qualified\n                    title had been issued. The problem faced by the 1st Defendant was that the 1985\n                    LTA was replaced by the 1994 version of the LTA. Section 174(4) of the LTA\n                    preserves the position of a claimant relying on adverse possession for claims of\n                    adverse possession before 1st March 1994, provided the claimant had lodged an\n                    application under the previous LTA, and such application was pending. Section\n                    174(8) of the LTA preserved a claim arising before that date but for which no\n                    application had yet been made: such application had however to be made within\n                    six months of 1stMarch 1994. As noted by the\n                    Plaintiffs, inTSM Development Pte ltd v Leonard Stephanie\n                        Celine nee Pereira[2005] 2 SLR(R) 371, the court highlighted\n                    that the aim of the LTA was to abolish adverse possession subject to savings for\n                    claims crystallised by 1st March 1994. In the present case, however, the 1st\n                    Defendant could not bring himself within the LTA, as there was nothing to show\n                    that he had made any such application. The 1st Defendant argued that the\n                    provisions of the LTA could not operate retrospectively from before 1994. The\n                    answer to this simply that s 174 of the LTA clearly and unequivocally dealt with\n                    time periods before 1994. It was intended to, did and still does operate\n                    retrospectively from 1994. 63     The 1st Defendant’s other line of\n                    argument was that the authorities on adverse possession in the context of the\n                    LTA were distinguishable as they concerned disputes between adjacent land. It\n                    was argued that this was supported by the legislative debates in which it was\n                    clear that the focus of the legislation was disputes between plots. It is clear\n                    though that while such disputes would perhaps commonly involve adjacent plots\n                    that would not be the only factual scenario throwing up issues of adverse\n                    possession. The classical situation would involve squatters claiming possession\n                    against an absent landowner. I could not see anything in either the legislation\n                    or the parliamentary debates that would narrow the scope of the provisions of\n                    the LTA to claims on adjacent plots. The relevant LTA provision is sufficiently\n                    broad to cover such situations. Section 50 reads: Except as provided in section 174(7) and (8), no title to land adverse in\n                        or in derogation of the tile of a proprietor of registered land shall be\n                        acquired by any length of possession by virtue of the Limitation Act (Cap\n                        163) or otherwise, nor shall the title of any operator of registered land be\n                        extinguished by the operation of that Act. The section is worded expansively. 64     The 1st Defendant’s arguments about the\n                    non-application of Torrens legislation also goes against the scheme of the LTA.\n                    Torrens systems require certainty and compliance with the statutory provisions\n                    – some interests that are not specifically provided for may of course be\n                    protected by caveats, but adverse possession is dealt with specially under the\n                    LTA, and there should thus be strict compliance with it. The LTA is clear that\n                    the requirement had to be met that there had to be registration that was at\n                    least pending before 1st March 1994. The land was converted to the Torrens\n                    system in 1967, and had been unqualified by 2003. 65     The 1st Defendant however went beyond this\n                    line of argument and referred to dispossession of the Plaintiffs and their\n                    parents, and referred to their failure to take action until after 12 years. As I\n                    understood the eventual argument, a strand of the 1st Defendant’s position\n                    is that the Plaintiffs’ claim should be defeated because the adverse\n                    possession created an independent basis, that it is a property right in itself,\n                    even if does not become perfected through registration under the statute. The\n                    issue of non-compliance with the LTA was therefore, on the 1st Defendant’s\n                    argument, beside the point. 66     I could not accept the 1st Defendant’s\n                    argument. Adverse possession is an aspect of limitation:Tan\n                        Sook Yee, p 822. It operates in the context of the concept of\n                    relativity of title and a contest between titles or claims to title. And in that\n                    context of relativity of title, there has to be compliance with the LTA as that\n                    statute controls all aspects of title and its perfection in respect of Torrens\n                    land in Singapore. In other words, the land register is absolute and registered\n                    title is indefeasible:Gibbs v Messer[1891] AC\n                    248; andWong Kok Chin v Mah Ten Kui Joseph[1992]\n                    1 SLR(R) 894. In the words of the editors ofTan Sook\n                        Yeeat para 13.5: …Title is passed only by registration. Second, once the title is\n                        registered, it is indefeasible except by other interest as provided in the\n                        statute itself. Certainly, it does not operate as an independent equitable\n                        right that goes to the conscience of the other party, unlike proprietary\n                        estoppel. 67     Furthermore, the characteristics of the 1st\n                    Defendant’s line of argument here makes this novel adverse possession\n                    claim seem similar to proprietary estoppel – the 1st Defendant claims a\n                    right against the other legal owners, based on the passage of time, defeating\n                    those other rights. However, no representation or detrimental reliance needs to\n                    be shown. There is no authority for a right of this nature. 68     It was also doubtful that even if adverse\n                    possession was at all a viable argument, that it should have been raised in this\n                    way in opposition for an order for partition or sale. Properly speaking, if the\n                    assertion by the 1st Defendant was to the legal title, and not just the\n                    equitable title, he should have sought rectification of the land register; that\n                    would have put paid to the Plaintiffs’ claim if it were\n                successful.",
        "Miscellaneous grounds raised against the application": "69     Several other issues were also raised, which\n                    may be addressed briefly. 70     There was an argument based on limitation\n                    raised by the 1st Defendant, citing the Limitation Act. This argument was\n                    misconceived. The orders sought by the Plaintiffs was for partition or sale: it\n                    is not an action for recovery of land subject to the Limitation Act. An order\n                    for sale or partition is simply an order giving effect of the legal ownership\n                    that is already vested in the co-owners. There is no recovery of land at all:\n                    the land in question was and is theirs. 71     The 1st Defendant invoked laches and\n                    acquiescence. Acquiescence here may be synonymous with a form of waiver or\n                    laches properly speaking,ie, delay with\n                    prejudice: see Meagher, Gummow and Lehane'sEquity: Doctrine\n                        and Remedies(LexisNexis Butterworths, 5th Ed, 2015) at para\n                    38-010. Where laches arise, equitable relief will be refused:Lindsay Petroleum Company, The v Prosper Armstrong Hurd, Abram Farewell,\n                        and John Kemp(1874) LR 5 PC 221. As noted by the Plaintiffs, inTan Yong San v Neo Kok Eng[2011] SGHC 30, Loh\n                    JC stated that laches would be a defence to a claim for equitable relief, but\n                    not a legal one. The Plaintiffs’ claim was founded on a legal right not an\n                    equitable one. It was an order giving effect to their legal title as\n                    co-owners. 72     The 1st Defendant indicated that he wished to\n                    challenge the validity of the will of 1980. This was a separate matter from the\n                    present proceedings.",
        "The Sale of the Property": "73     The 1st Defendant failed to show that he had\n                    any competing rights that would bar the sale by the Plaintiffs. As to the sale\n                    of the Property, I found that there were no reasons that would stand in the way\n                    of a sale. I rejected the arguments against the sale that were founded on\n                    proprietary estoppel, promissory estoppel, and other grounds. I was satisfied\n                    that sale should be ordered under paragraph 2 of the First Schedule and s 18(2)\n                    of the Supreme Court of Judicature Act (Cap 322, Rev Ed 2007) (“the\n                    SCJA”). As noted by the Plaintiffs, the power to order a sale has been\n                    recognised, even where other co-owners object:Toh Tian Sze v\n                        Han Kim Wah[2012] 3 SLR 682 (“Toh Tian\n                        Sze”). The Plaintiffs argued that impracticability of\n                    partition was a relevant consideration. Such impracticability could be due to\n                    the size of the property, absence of planning permission, and the inability of\n                    the co-owners to cooperate to partition. In addition, the Plaintiffs further\n                    contended that it would be relevant to consider whether sale may be more\n                    advantageous for all the co-owners, and whether there would be any serious\n                    injustice to objecting co-owners. 74     The controlling authority in this area isAbdul Razak Valibhoy and another v Abdul Rahim Valibhoy\n                        and others[1995] 1 SLR(R) 441. That decision noted that the\n                    Court would take into account all relevant considerations. In particular, it was\n                    highlighted in that case that at first instance, proposals for partition had\n                    been explored; impracticabilities and difficulties in doing so were\n                    demonstrated, and that it was found that partition was not practicable or\n                    feasible on a just and equitable basis. 75     As noted by the parties, various factors have\n                    been taken into account by the Courts in determining whether a sale is necessary\n                    or expedient. Section 18(2) of the SCJA states that the High Court will have in\n                    addition to powers vested under sub-section (1), the powers set out in the First\n                    Schedule. Paragraph 2 of the First Schedule reads: Partition and sale in lieu of\n                        partition 2. Power to partition land and to direct a sale instead of partition in\n                        any action for partition of land; and in any cause or matter relating to\n                        land, where it appears necessary or expedient, to order the land or any part\n                        of it to be sold, and to give all necessary and consequential\n                        directions. I agree with the views expressed inTan\n                            Sook Yee, at para 9.65 that the requirements of necessity and\n                        expediency strictly apply only to situations other than a direct application\n                        for sale or partition. Nonetheless, I consider these requirements as\n                        possibly relevant factors in the determination by the\n                court. 76     In exercising the discretion, the courts have\n                    looked at the question of injustice and impact on the parties:Chiam Heng Luan and others v Chiam Heng Hsien and others[2007] 4 SLR(R) 305. The inquiry is thus broad ranging. Probably little will be\n                    gained by any attempt to exhaustively define the scope of the Court’s\n                    survey. As recognised inToh Tian SzeandAbu Bakar v Jawahir and others[1993] 1 SLR(R)\n                    865, a co-owner has the right to seek partition. The Court may consider sale as\n                    an alternative, which would probably be the more attractive option to the\n                    applicant anyway. 77     I accepted the Plaintiffs’ arguments\n                    that there were impracticalities in partitioning, given the state of the\n                    relationship of the parties. The various co-owners have had little contact\n                    between themselves. There was also the previous litigation to take into account.\n                    In view of the clearly strained relationship, it would be too optimistic to\n                    require the parties to work together. Partitioning land would require\n                    negotiation, trade-offs and compromise. None of these were likely to be\n                    forthcoming here. Partition would also run into difficulties here given the\n                    location and shape of the Property: the road frontage for the partitioned plots,\n                    as well as the fact that building on the Property straddled the land, would mean\n                    that any partition would be awkward. It may be that gerrymandering the Property\n                    to preserve the building may yet be topologically possible, but would likely\n                    have resulted in a diminished commercial value of the partitioned plots. These\n                    difficulties would also probably mean that planning permission would be\n                    difficult to obtain. 78     I found that there was no injustice on the\n                    facts. The 1st Defendant contended that he had been deprived of the opportunity\n                    to have purchased another property. He also referred to the emotional attachment\n                    he had, the inaction by the Plaintiffs, his health conditions and the\n                    difficulties he would face finding another property at his age. None of these to\n                    my mind were sufficient to bar the sale of the Property. Attachment to a\n                    particular plot is not a determining factor. It may be relevant in some\n                    circumstances, but it cannot normally be determinative when other co-owners wish\n                    to partition or sell. Their property rights, including the rights of disposal,\n                    would have to be given due weight. Similarly, difficulties in finding\n                    alternative property, or health problems, could not normally deprive co-owners\n                    of their property rights unless it was of such a significant degree that\n                    movement out of the property was near impossible. As to being deprived of the\n                    opportunity to purchase another property, that was simply outweighed by the 1st\n                    Defendant’s enjoyment of the Property all these years.",
        "The division of the proceeds": "79     The division took into account the relevant\n                    contributions made by the 1st Defendant and which were the subject of his\n                    counterclaim. The 1st Defendant argued that he had spent money on maintaining\n                    the Property. The Plaintiffs disputed this. I was of the view that the\n                    counterclaim made by the 1st Defendant for expenses incurred by him did not\n                    succeed except for one part. 80     As argued by the Plaintiffs, there was little\n                    by way of documentary evidence for most of the claims. Additionally, the various\n                    expenses made by him were largely for his own benefit in the years of\n                    occupation, and were not such as to create an obligation for repayment by the\n                    other owners in the present circumstances. There may be expenses incurred which\n                    may be necessary to preserve the Property, and such expenses may be the subject\n                    of reimbursement; however, enjoyment of the Property by the claiming party can\n                    be taken into account:Tan Chui Lian v Neo Liew\n                        Eng[2007] 1 SLR(R) 265. 81     The 1st Defendant also claimed that he had\n                    paid off a mortgage over the Property. However, as argued by the Plaintiffs,\n                    this was found in S 722 to have been in respect of a share trading account and\n                    had no link to the Property. Aside from the issue estoppel that would have\n                    arisen, I found on the evidence before me in this application that there was no\n                    evidence anyway that there was any mortgage over the Property that was\n                    discharged by the 1st Defendant. 82     There was however one category that should be\n                    taken into account, namely the taxes that were due on the Property. These\n                    payments would have had to be made by the owners, and were not just for the\n                    benefit of the 1st Defendant in his enjoyment of the occupation of the Property,\n                    so there should be accountinginter se. An\n                    adjustment was thus made to the amount due here.",
        "Orders made": "83     I ordered a sale in lieu of partition.\n                    However, no sale was to take place until six months after the date of the order,\n                    with a sum representing the property tax to be shared by the other co-owners to\n                    be reimbursed to the 1st Defendant from the proceeds of sale. Subsequently, on\n                    the 1st Defendant’s application, I granted a stay of execution pending the\n                    appeal filed by him. I also fixed costs in favour of the Plaintiffs payable by\n                    the 1st Defendant."
    }
}