{
    "case_title": "Diora-Ace Ltd and others\n      v\n      Management Corporation Strata Title Plan No 3661 and\n            another",
    "ncitation": "[2015] SGHC 88",
    "coram": "Hoo Sheau Peng JC",
    "sections": {
        "Background": "",
        "Parties": "4       As mentioned above, the Plaintiffs are\n                    subsidiary proprietors of the Development. Together, the Plaintiffs own 18 out\n                    of the 49 units in the Development, and 123 out of 321 of the total share value\n                    therein. The first to sixth plaintiffs are incorporated in the British Virgin\n                    Islands, and the seventh plaintiff, I.Contemporary Living Pte Ltd, is the\n                    developer of the Development (“the Developer”). The main\n                    contractor of the Development is I.Delight (S) Pte Ltd (“the Main\n                    Contractor”). In March 2010, the Temporary Occupation Permit was issued\n                    by the Commissioner of Building Control for the Development. During the interim\n                    period before the first council of the MCST was appointed, the Developer assumed\n                    the duties of the council under Division 1 of Part V of the\n                    BMSMA. 5       Colliers International Consultancy &\n                    Valuation (Singapore) Pte Ltd (“Colliers”) was the Managing Agent\n                    of the Development up to the end of February 2013, when it was replaced by\n                    Affinity Property Consultants Pte Ltd (“Affinity”). 6       The first council of the MCST was appointed on\n                    18 November 2011, with one Mr Teo Boon Kang Peter\n                    (“Mr Teo”) as the chairman. Mr Teo has described himself\n                    in affidavits filed on behalf of the Plaintiffs as the “Manager of all\n                    the Plaintiffs”. During the term of the first council, in February 2012,\n                    a fire broke out at the basement consumer switch room of the Development. The\n                    power supply to the Development was cut off for safety reasons until the damaged\n                    equipment in the switch room had been repaired. During the interim, a temporary\n                    generator was used to supply power to the residents. The repair works cost\n                    $165,315 of which $69,550 was paid by the insurers and $15,765 was paid by the\n                    MCST. The Main Contractor contributed the remaining $80,000 as a\n                    “goodwill gesture”.",
        "Acts of the second council": "7       The second council of the MCST was appointed on\n                    19 December 2012, with Dr Sim as its chairman. Mr Teo was also\n                    appointed as a member of the second council. During the term of the second\n                    council, a council resolution was sought to be passed by simple majority,\n                    allowing the chairman and secretary of the council to jointly approve any\n                    discretionary expenditure in relation to “maintenance, repair and\n                    replacement works” in the Development, “not exceeding $2,000/- per\n                    single item or collective items (whichever lower) under each single\n                    receipt”. Under this resolution, the MCST made purchases of Ikea\n                    furniture in two receipts of $1,976 and $1,014 respectively on 30 May 2013.\n                    The Plaintiffs also alleged that the second council of the MCST mismanaged its\n                    finances by wrongfully utilising the sinking fund in April, June and July\n                    2013. 8       On or about 7 November 2013, the MCST sent\n                    out a letter to all its subsidiary proprietors requiring, among other things, a\n                    copy of the tenancy agreement in relation to their units, if any. The Plaintiffs\n                    did not comply. A standing instruction was also issued by the MCST sometime in\n                    November 2013, requiring the corporate subsidiary proprietors of the Development\n                    to deposit a letter of authority (“LOA”) and a company profile or\n                    certificate of incorporation at the Managing Agent’s office 48 hours\n                    before the third annual general meeting (“AGM”) of the MCST which\n                    was to be held on 1 December 2013 (“the Standing\n                    Instruction”). The Plaintiffs did not do so, and did not attend the third\n                    AGM. Subsequently, one Mr Joel Chang Chung Yhow\n                    (“Mr Chang”) was elected as the chairman of the third council\n                    of the MCST.",
        "Proceedings": "9       On 29 April 2014, the Plaintiffs filed the\n                    present action. On the same day, the Plaintiffs, under s 58(3) of the\n                    BMSMA, issued a written notice to the secretary of the third council, one\n                    Mr Heng Chih Yang (“Mr Heng”) informing him that they\n                    opposed any decision of the third council that would result in the MCST\n                    incurring legal costs in the present proceedings (“the s 58(3)\n                    Notice”). Another application, being Originating Summons No 994 of\n                    2014 (“OS 994/2014”), was filed on 24 October 2014 by\n                    the Plaintiffs against the MCST, the chairman and the secretary of the third\n                    council, being Mr Chang and Mr Heng respectively, seeking an\n                    injunction to prevent the MCST from acting in breach of the s 58(3)\n                    Notice. 10     Meanwhile, in the affidavit filed on behalf of\n                    the Defendants by Dr Sim and Mr Chang in the present action, the MCST\n                    alleged that there are potential counterclaims against the Developer, being the\n                    seventh plaintiff, in respect of the following: (a)     the defects in the common\n                        property; (b)     the\n                        Developer’s failure to hand over drawings, plans, warranties to\n                        Colliers/Affinity when the first council (comprising the Plaintiff’s\n                        representatives) assumed office; and (c)     the design and construction of the basement consumer\n                        switch room which led to the fire there in 2012. 11     At the first hearing on 27 October 2014,\n                    parties indicated that the fourth AGM of the MCST was due to be held in December\n                    2014, and it was likely that no order would be necessary in respect of Prayer 1.\n                    I queried the Plaintiffs as to the legal basis for the Prayers, and asked the\n                    parties whether there were substantial disputes of fact which might require (i)\n                    a conversion of the action to a writ action or (ii) cross-examination of the\n                    witnesses, as well as whether the present action should be consolidated with\n                    OS 994/2014. The hearing was adjourned for parties to consider these\n                    preliminary issues. 12     The fourth AGM of the MCST was held on\n                    13 December 2014. Each of the Plaintiffs submitted its respective LOA duly\n                    signed by an identified person with a disclosed designation. The\n                    Plaintiffs’ representatives attended the general meeting and voted, but\n                    did not garner sufficient votes to be elected into the fourth council of the\n                    MCST. 13     At the adjourned hearing on 24 December\n                    2014, parties confirmed that given that the fourth AGM had taken place, Prayer 1\n                    was no longer necessary. The substantial disputes of facts were in respect of\n                    potential counterclaims by the MCST against the Developer, as set out in [10]\n                    above. The Defendants proposed to proceed by way of a separate claim against the\n                    Developer for such matters, which the Plaintiffs did not object to. The\n                    Plaintiffs were also of the opinion that OS 392/2014 and OS 994/2014\n                    should be dealt with separately, and that the s 58(3) Notice would not bind\n                    the court’s discretion on costs of the present action. Given these\n                    positions taken by the parties, I proceeded to hear the parties on Prayers 2 to\n                    5 of OS 392/2014.",
        "Parties’ submissions": "",
        "Plaintiffs’ arguments": "14     The Plaintiffs submitted that this court had\n                    the jurisdiction to grant the declarations sought either under s 88 of the\n                    BMSMA or under the inherent jurisdiction of the court. It was the\n                    Plaintiffs’ case that the MCST had committed numerous breaches of the\n                    BMSMA in issuing the Standing Instruction and requesting for tenancy agreements.\n                    The Plaintiffs also pointed to the MCST’s mismanagement of its finances by\n                    (i) wrongfully utilising the sinking fund in April, June and July 2013 and (ii)\n                    purchasing furniture from Ikea in an unauthorised manner. In this regard,\n                    Dr Sim was made a defendant in this action because the Plaintiffs were of\n                    the view that he was a “dominating member” of the second council\n                    of the MCST. They also pointed out that all the matters complained of happened\n                    during the time when Dr Sim was the chairman of the second council of the\n                    MCST.",
        "Defendants’ arguments": "15     The Defendants dealt at length in their\n                    submissions about the relationship between the Plaintiffs and the Main\n                    Contractor. According to the Defendants, the first to sixth plaintiffs were\n                    nominees of, or otherwise closely related to, the Developer. The Defendants also\n                    contended that the Main Contractor was a related company of the Developer. It\n                    was also the Defendants’ case that Mr Teo, besides being the\n                    “Manager of all the Plaintiffs” (see above at [6]) was also the\n                    Senior Manager of the Main Contractor. This relationship between the various\n                    plaintiffs and the Main Contractor placed Mr Teo, being both a\n                    representative for the Plaintiffs and also the chairman of the first council of\n                    the MCST and a member of the second council of the MCST, in a position of\n                    conflict of interest in a number of situations. These included the MCST’s\n                    potential claims against the Developer and Main Contractor in respect of the\n                    defects in the common property as well as the fire at the basement consumer\n                    switch room. In the Defendants’ view, the relationship between the\n                    Plaintiffs and Main Contractor was relevant to the understanding of the factual\n                    context of the disputes that have arisen, and why the Plaintiffs were pursuing\n                    the present action against the Defendants. 16     The Defendants also submitted that if the\n                    first to sixth plaintiffs were indeed nominees of the Developer, then\n                    s 53(12) of the BMSMA would have been breached as the first council would\n                    have comprised only representatives of the Developer and its nominees. The\n                    Defendants said that it was partly to address this concern that the MCST\n                    requested the corporate subsidiary proprietors of the Development to furnish\n                    additional documents in the form of a company profile or certificate of\n                    incorporation through the Standing Instruction. Further, the additional\n                    documents were required to ascertain the identity and authorisation of the\n                    Plaintiffs’ respective representatives, as the MCST had concerns with the\n                    LOAs which the Plaintiffs submitted previously. 17     The Defendants were also of the view that\n                    there was no unauthorised drawdown of the sinking fund in April, June and July\n                    2013, and that the purchase of the Ikea furniture was properly carried out. In\n                    relation to the request for the subsidiary proprietors’ tenancy\n                    agreements, the Defendants submitted that this was not for the purpose of\n                    prejudicing the Plaintiffs’ right to vote at the AGM, but merely in order\n                    to ascertain who the tenants of the units in the Development were and, thus, the\n                    persons who would be eligible to use the amenities in the\n                Development. 18     The Defendants also submitted that the\n                    decisions which the Plaintiffs took issue with were not made by Dr Sim\n                    unilaterally, but were decisions of the second council of the MCST. In the\n                    Defendants’ submission, there was therefore no reason to make Dr Sim\n                    a defendant in these proceedings.",
        "Issues": "19     In relation to the prayers which the\n                    Plaintiffs were seeking, the following issues were in dispute: (a)     as a preliminary issue, the legal\n                        basis for the prayers, and whether this court has jurisdiction and power to\n                        grant the bare declarations sought (“the Legal Basis\n                        issue”); (b)     whether the MCST was wrong in issuing the Standing Instruction (“the\n                        Standing Instruction issue”); (c)     whether the MCST was wrong in utilising the sinking fund\n                        for April, June and July 2013 (“the Sinking Fund\n                        issue”); (d)     whether the MCST was wrong in requiring the Plaintiffs to submit copies of\n                        their tenancy agreements (“the Tenancy Agreements issue”);\n                        and (e)     whether the\n                        purchase of items from Ikea was unauthorised (“the Unauthorised\n                        Purchase issue”). 20     The Defendants also raised the issue whether\n                    there was legal basis to join Dr Sim as a defendant.",
        "My decision": "",
        "Joinder of Dr Sim": "21     I begin by disposing of the matter in relation\n                    to Dr Sim. In my view, there was no legal basis for the Plaintiffs to have\n                    taken out the application against Dr Sim personally. Even if I were to\n                    accept the Plaintiffs’ assertion that Dr Sim was a “dominating\n                    member” of the council, given that the claims were for declarations in\n                    relation to breaches committedby the MCST, andnotDr Sim, there was no reason for\n                    Dr Sim to have been made a party to this action in his personal\n                    capacity. 22     Under s 61(1) of the BMSMA, Dr Sim\n                    had a statutory duty to act honestly and use reasonable diligence in the\n                    discharge of his duties as the chairman of the second council. He also must,\n                    pursuant to s 61(2) of the BMSMA, not directly or indirectly, use his\n                    position to gain an advantage for himself. However, the Plaintiffs did not\n                    allege that Dr Sim had breached his duties under s 61 of the BMSMA,\n                    but were seeking declarations thatthe MCSTcommitted certain breaches. I accordingly dismissed Prayers 2 to 5 against\n                    Dr Sim.",
        "The Legal Basis issue": "23     Moving on, I requested parties to address me\n                    on the legal basis for the prayers as it was not apparent from the documents\n                    whether the Plaintiffs were relying on any particular provision within the\n                    BMSMA, and I was concerned as to whether the court has the jurisdiction to hear\n                    the application, and the power to grant the declaratory relief sought, without\n                    any other consequential relief. The prayers (see above at [2]) were framed only\n                    in terms of declaring whether there were breaches by the MCST, without any other\n                    relief sought. 24     In response, the Plaintiffs submitted that the\n                    application was brought under s 88 of the BMSMA, and, as required under\n                    s 124 of the BMSMA, it had been brought by way of an originating summons.\n                    In the alternative, the Plaintiffs also relied on s 18 of the Supreme Court\n                    of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”) read with\n                    para 14 of the First Schedule thereof and O 15 r 16 of the Rules\n                    of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”). The\n                    Plaintiffs submitted that the court’s jurisdiction has not been ousted by\n                    the jurisdiction accorded to the Strata Titles Board\n                    (“STB”). 25     The Defendants submitted that neither\n                    s 88 of the BMSMA nor the inherent jurisdiction of the court were tenable\n                    grounds for the Plaintiffs to rely on to apply for bare declaratory relief. If\n                    the Plaintiffs sought to invalidate the acts of the MCST, it should have\n                    commenced its proceedings before the STB which has the powers under ss 103\n                    and 104 of the BMSMA to make the necessary orders. As the Plaintiffs had instead\n                    commenced proceedings before the High Court, the Plaintiffs must then satisfy\n                    s 88 of the BMSMA, and the Plaintiffs had failed to do so. 26     Specifically, the Defendants argued that a\n                    mere declaration was outside the ambit of s 88 of the BMSMA as that section\n                    prescribes that the power of the court thereunder is to make a finding of a\n                    breach by the MCSTand thengrant specific relief\n                    of an injunction and/or damages. The court was not empowered to act on an\n                    application for a bare declaration that the MCST had breached its duties, and\n                    grant a bare declaration without any consequential relief. 27     In respect of the Plaintiffs’\n                    alternative submission under O 15 r 16 of the ROC, the Defendants\n                    characterised this as the Plaintiffs’ invocation of the inherent powers of\n                    the court. Relying onTan Ah Thee and another (administrators\n                        of the estate of Tan Kiam Poh (alias Tan Gna Chua), deceased) v Lim Soo\n                        Foong[2009] 3 SLR(R) 957 (“Tan Ah\n                        Thee”), the Defendants argued that as s 88 of the\n                    BMSMA governed the exercise of the court’s powers in respect of this\n                    particular dispute, the Plaintiffs could not invoke the court’s inherent\n                    powers to override a statutory rule that dealt with the exact situation.\n                    Furthermore, the inherent powers of the court could only be invoked in\n                    exceptional circumstances where a clear need for it can be shown. The Plaintiffs\n                    could have taken steps either shortly before or after the acts complained of or\n                    otherwise raise to the second council its objections or difficulties with\n                    complying with the requirements. As the Plaintiffs did not do so, it could not\n                    be said that the facts disclosed a clear need or exceptional circumstances for\n                    the court to exercise its discretion to grant the declarations\n                sought. The difference between jurisdiction and power 28     At the outset, I should point out the\n                    difference between “jurisdiction” and “power”. As\n                    Chan Sek Keong J, as he was then, stated inMuhd Munir v\n                        Noor Hidah and other applications[1990] 2 SLR(R) 348 (at\n                    [19]): The jurisdiction of a court is its authority, however derived, to hear and\n                        determine a dispute that is brought before it. The powers of a court\n                        constitute its capacity to give effect to its determination by making or\n                        granting the orders or reliefs sought by the successful party to the\n                        dispute. … A court may have jurisdiction to hear and determine a\n                        dispute in relation to a subject matter but no power to grant a remedy or\n                        make a certain order because it has not been granted such power, whereas if\n                        a court has the power to grant a remedy or make a certain order, it can only\n                        exercise that power in a subject matter in which it has jurisdiction.\n                        … 29     This distinction received recent support by\n                    the Court of Appeal inRe Nalpon Zero Geraldo\n                        Mario[2013] 3 SLR 258 (at [13] and [31]). The jurisdiction of\n                    the court thus refers to the court’s authority to hear and determine a\n                    dispute. The power of the court, on the other hand, is the ability of the court\n                    to give effect to its determination by making the orders or reliefs sought by\n                    the successful party to the dispute. Whether this was an application under s 88 of the\n                BMSMA 30     With this understanding, I turn to consider 88\n                    of the BMSMA which states: 88.—(1)  If a\n                        management corporation or subsidiary management corporation commits a breach\n                        of any provision of this Part, or makes default in complying with any\n                        requirement of, or duty imposed on it by, any provision of this Part, a\n                        subsidiary proprietor or mortgagee in possession or occupier of a lot shall\n                        be entitled to apply to the court — (a) for an order to restrain the\n                            breach of any such provision by; or (b) to recover damages for any loss\n                            or injury to the subsidiary proprietor, mortgagee in possession, or\n                            occupier or property arising out of the breach of any such provision\n                            from, the management corporation or subsidiary management corporation, as the\n                        case may be. (2)  The court may make such order against any such person, the\n                        management corporation or the members of its council, or the subsidiary\n                        management corporation or its executive committee, or the managing agent, as\n                        the court thinks fit. (3)  Where a requirement or duty is imposed on a management\n                        corporation or subsidiary management corporation by this Part, any person\n                        for whose benefit, or for the benefit of whose lot that requirement or duty\n                        is imposed on the management corporation or subsidiary management\n                        corporation, as the case may be, may apply to the court for an order\n                        compelling the management corporation or subsidiary management corporation,\n                        as the case may be, to carry out the requirement or perform the duty and, on\n                        such an application being made, the court may make such order as it thinks\n                        proper. 31     Section 88 of the BMSMA is found in\n                    Part V of the same Act; under Part V, the duties and powers of\n                    management corporations and other details are set out. Section 88(1) of the\n                    BMSMA entitles a subsidiary proprietor to apply to court either to restrain any\n                    breach of the provisions of Part V of the BMSMA by a management\n                    corporation, or to recover damages for any loss or injury occasioned by the\n                    breach. Section 88(2) then provides that the court may make any order that\n                    the court thinks fit against,inter alia, the\n                    management corporation, the members of its council, or the managing agent.\n                    Section 88(3) also provides that a subsidiary proprietor may apply to the\n                    court to compel the management corporation to carry out any requirement or duty\n                    imposed by law, and the court may make such an order, or to make any other\n                    orders as it thinks proper. 32     Thus, it appears that while the applicant mustapplyfor these reliefs as stated in\n                    ss 88(1) or 88(3), the court, in hearing the matter under this section, is\n                    not limited to ordering only such reliefs as applied for; the court may makeany such orderas the court thinks fit.\n                    However, in seeking bare declarations only, the Plaintiffs,prima facie, fell outside s 88 of the BMSMA. Despite an\n                    invitation by the court to do so, the Plaintiffs opted not to amend any of their\n                    prayers. Save for Prayer 5 which I shall deal with below, I am doubtful\n                    that the remaining prayers could be treated as being made under s 88 of the\n                    BMSMA. Jurisdiction to deal with this application outside s 88 of the\n                BMSMA 33     I turn next to the Plaintiffs’\n                    alternative submission that declaratory relief could be granted under s 18\n                    of the SCJA and para 14 of the First Schedule of the same, read with\n                    O 15 r 16 of the ROC. The Defendants characterised the\n                    Plaintiffs’ reliance on these provisions as an invocation of the\n                    court’s inherent powers to grant declaratory relief, rather than its\n                    inherent jurisdiction. 34     The difference between the terms jurisdiction\n                    and power has been explained above (see [28]–[29]). Under s 16 of the\n                    SCJA, the jurisdiction of the High Court may be established by service on the\n                    defendant of a writ or other originating process, or by a defendant’s\n                    submission to the High Court’s jurisdiction, or where statute vests such\n                    jurisdiction in the High Court. The jurisdiction of the court may be ousted if\n                    exclusive jurisdiction over a dispute is vested in another tribunal, such as the\n                    STB in the present case. However, the Defendants have not argued that the STB\n                    has exclusive jurisdiction. In any event, the High Court inFu Loong Lithographer Pte Ltd and others v Mok Wai Hoe and\n                        another[2014] 1 SLR 218 at [24]–[27] (“Fu Loong”) has held that the STB does not have\n                    exclusive jurisdiction over disputes falling within the scope of the\n                    BMSMA. 35     InFu Loong, the\n                    plaintiffs were a group of subsidiary proprietors in a strata development. They\n                    brought an application against the management corporation as well as the\n                    chairman of the second council of the management corporation in the High Court,\n                    seeking,inter alia, the invalidation of certain\n                    rulings made by the chairman at an extraordinary general meeting, on the basis\n                    that these rulings were in conflict, or inconsistent with, the BMSMA. Notably,\n                    the application to court in that case was not made under s 88 of the BMSMA.\n                    Chan Seng Onn J held that in the absence of an express provision ousting\n                    the court’s jurisdiction, the court and the STB both have the jurisdiction\n                    to hear matters concerning strata management disputes; would-be plaintiffs thus\n                    have two possible forums to choose from to resolve their disputes. I agree with\n                    the reasoning set out inFu Loong. This court thus\n                    has the jurisdiction under general law to hear this application which is\n                    concerned with breaches of the BMSMA by the MCST. Power to grant bare declarations 36     The next issue then is whether this court has\n                    thepowerto grant a bare declaration. In general,\n                    the High Court’s power to grant declarations may be found in s 18 of\n                    the SCJA read with para 14 of the First Schedule of the SCJA.\n                    Section 18(2) of the SCJA provides that the High Court “shall have\n                    the powers set out in the First Schedule”. Paragraph 14 of the First\n                    Schedule of the SCJA states that the High Court has the power to “grant\n                    all reliefs and remedies at law and in equity”. Order 15 r 16\n                    of the ROC supplements this, by providing that: Declaratory judgment (O. 15,\n                            r. 16) 16.No action or other proceeding\n                        shall be open to objection on the ground that a merely declaratory judgment\n                        or order is sought thereby, and the Court may make binding declarations of\n                        right whether or not any consequential relief is or could be claimed. 37     The Court of Appeal inSalijah bte Ab Latef v Mohd Irwan bin Abdullah Teo[1996] 2\n                    SLR(R) 80 (“Salijah”) considered the\n                    above provisions and held that these provisions formed the basis of the\n                    court’s power to grant declaratory judgments. 38     The Defendants relied on the case ofTan Ah Theeto argue that the presence of s 88 of\n                    the BMSMA limited the powers of the court in granting declaratory relief in such\n                    cases. Counsel for the Defendants submitted that as s 88 of the BMSMA dealt\n                    with the specific situation at hand, the Plaintiffs could not invoke the\n                    inherent powers of the court to override s 88. 39Tan Ah Theewas\n                    a case that considered,inter alia, whether the\n                    court had the power to declare avoidablemarriagevoidwhere the s 105 of the Women’s\n                    Charter (Cap 353, 1997 Rev Ed) (“Women’s Charter”)\n                    provided an exhaustive list of grounds on which marriages may be declared to be\n                    void, the operative words being “shall be void on the following groundsonly” [emphasis added]. The plaintiffs\n                    sought,inter alia, to declare the marriage\n                    between their late father and the defendant void on the ground of lack of\n                    consent, which under s 106(c) of the\n                    Women’s Charter, is a ground that renders a marriage voidable. The High\n                    Court rejected this, holding that s 105 of the Women’s Charter\n                    provided an exhaustive and exclusive list of grounds on which the power to\n                    declare a marriage void may be exercised. It leaves no room for the court to\n                    declare a marriage void on any other grounds. 40     In contrast, s 88 of the BMSMA enables a\n                    subsidiary proprietor to apply for certain remedies when a provision of\n                    Part V of the BMSMA has been breached or not complied with. However, there\n                    is nothing within s 88 which suggests that the court only has jurisdiction\n                    to hear disputes about the breaches of the BMSMA under the provision. It is also\n                    noteworthy that the provision does not restrict the power of the court to order\n                    any relief. In the absence of express wording, s 88 of the BMSMA does not\n                    oust the court’s jurisdiction and powers under the SCJA and ROC to hear\n                    the dispute and order the appropriate relief, including bare declaratory\n                    relief. 41     Further, s 123 of the BMSMA provides\n                    that: 123.Nothing in this Act shall\n                        affect or take away any rights or remedies that a subsidiary proprietor or\n                        mortgagee of a lot or a management corporation may have in relation to any\n                        lot or the common property apart from this Act. 42     In Teo Keang Sood,Strata\n                        Title in Singapore and Malaysia(LexisNexis, 4th Ed, 2012), the\n                    learned author made the following comments on s 123 of the BMSMA (at\n                    p 841): The expression “rights or remedies … in relation to any lot\n                        of the common property apart from this Act” in section 123 of\n                        the BMSMA refers to the rights and remedies apart from those provided by the\n                        Act which are thenormal incidents of legal relationships\n                            that the Act bring[s] into beingand those relationships\n                        include not only the proprietary rights incidental to lots and common\n                        property, but also the contractual rights between the parties concerned\n                        arising from their participation in the strata scheme. [emphasis\n                        added] Section 123 of the BMSMA thus makes clear that a\n                        subsidiary proprietor or management corporation continues to have rights and\n                        remedies under general law apart from the BMSMA as a result of the legal\n                        relationships in play. 43     At the end of the hearing on 24 December\n                    2014, I had expressed reservations about the applicability of s 88 of the\n                    BMSMA, and the jurisdiction and power of the court to deal with the application.\n                    Nonetheless, I had proceeded to deal with the application on the merits. Upon\n                    review, I am of the opinion that the court has the jurisdiction to deal with the\n                    application, and the power to grant declarations pursuant to s 18 of the\n                    SCJA, para 14 of the First Schedule of the SCJA and O 15 r 16 of\n                    the ROC. Discretion in granting bare declarations 44     As conceded by the Plaintiffs, declaratory\n                    relief is discretionary in nature. The factors to be considered by the court in\n                    deciding whether to grant bare declaratory relief have been considered by the\n                    Court of Appeal inSalijahand inKaraha Bodas Co LLC v Pertamina Energy Trading Ltd and another\n                        appeal[2006] 1 SLR(R) 112 (“Karaha”). InKaraha, the\n                    Court of Appeal held that the following factors governed the exercise of the\n                    court’s discretionary power to grant declaratory relief (at [14]): (a)     the court must have the jurisdiction\n                        and power to award the remedy; (b)     the matter must be justiciable in the\n                    court; (c)     the exercise\n                        of the discretion must be justified by the circumstances of the\n                    case; (d)     the plaintiff\n                        haslocus standiand there must be a real\n                        controversy for the court to resolve; (e)     any person whose interests might be affected by the\n                        declaration should be before the court; and (f)     there must be some ambiguity or uncertainty\n                        about the issue in respect of which the declaration is asked for so that the\n                        court’s determination would have the effect of laying such doubts to\n                        rest. 45     InSalijah bte Ab Latef v\n                        Mohd Irwan bin Abdullah Teo[1995] 3 SLR(R) 233 (HC), Judith\n                    Prakash J also stated that the remedy of a declaration should provide\n                    “relief” in a real sense (at [17]). The court will also require a\n                    useful or practical purpose to be served before it would exercise its discretion\n                    to grant a declaration (seeScott Latham v Credit Suisse\n                        First Boston[1999] SGHC 302 at [59] which was affirmed on appeal\n                    atLatham Scott v Credit Suisse First Boston[2000] 2 SLR(R) 30 at [74], andSingapore Court Practice\n                        2014(Jeffrey Pinsler gen ed) (LexisNexis, 2014) at\n                    para 15/6/8). 46     In the present action, the pertinent factors\n                    were whether there was a real controversy to be resolved, or if any useful or\n                    practical purpose would be served by the grant of a bare declaration. Even if\n                    the Plaintiffs’ allegations were made out, in all the circumstances of the\n                    case, I was not convinced that I should exercise my discretion in favour of\n                    granting the bare declarations sought by the Plaintiffs. The breaches complained\n                    of in Prayers 2, 3 and 4 were of acts that have long passed. As contended\n                    by the Defendants, the Plaintiffs could have taken prompt steps to get the\n                    Defendants to address these issues, but chose not to do so. It seemed to me that\n                    there was no real purpose to be served in the grant of such declarations. Again,\n                    as the Defendants submitted, the Plaintiffs did not show that they suffered any\n                    prejudice, or incurred any loss or damages which required redress. At this\n                    juncture, there was no real controversy for the court to resolve, or any real\n                    relief to be provided to the Plaintiffs by making bare\n                declarations. 47     Further, in respect of Prayers 2, 3 and\n                    4, I found that the Plaintiffs had not made out their case on the merits against\n                    the MCST. In respect of Prayer 5, I found that there was a breach of the\n                    BMSMA by the MCST. However, instead of granting a bare declaration, I ordered\n                    the MCST to ratify the unauthorised purchases. Each issue will now be considered\n                    in turn.",
        "The Standing Instruction issue": "48     Under the Standing Instruction, the MCST had\n                    requested that its corporate subsidiary proprietors produce a company profile or\n                    certificate of incorporation, and duly lodge such documents with the Managing\n                    Agent 48 hours before the scheduled time for the third AGM. 49     The Plaintiffs submitted that the Standing\n                    Instruction was issued wrongfully, relying on s 27(3) and\n                        s 29(1)(h) of the BMSMA which requires\n                    management corporations to conduct their general meetings in accordance with the\n                    First Schedule of the BMSMA. The relevant paragraphs in the First Schedule are\n                    paras 16 and 18. Paragraph 16 of the First Schedule of the BMSMA\n                    provides that a corporate subsidiary proprietor may, under the seal of the\n                    company or hand of its director or a duly authorised attorney, appoint a\n                    representative to attend the meetings of the management corporation. There is no\n                    mention in para 16 of the need for either a company profile or certificate\n                    of incorporation. Paragraph 18 of the First Schedule of the BMSMA provides\n                    that the instrument appointing a proxy and the power of attorney or other\n                    authority shall be deposited at a specified address not less than 48 hours\n                    before the holding of the meeting, in default of which, the instrument would not\n                    be treated as valid. The Plaintiffs pointed out that para 18 of the\n                    BMSMA’s First Schedule dealt with instruments appointing proxies in\n                    relation to individuals, and not LOAs. There was thus no reason why the MCST\n                    required the deposit of the LOAs and other company documents 48 hours\n                    before the AGM. 50     The Plaintiffs’ case is that by the\n                    issuance of the Standing Instruction, the MCST went beyond paras 16 and 18\n                    of the First Schedule of the BMSMA. In seeking to establish that the Standing\n                    Instruction was issued wrongfully, the Plaintiffs said that they were prejudiced\n                    by these additional requirements imposed by the MCST in that they were unable to\n                    appoint authorised representatives to attend and vote at the third\n                AGM. 51     However, the Plaintiffs conceded that they did\n                    not inform the MCST or its council of their concerns with procuring the company\n                    profile and/or the certificate of incorporation. The Plaintiffs stated that this\n                    was not done because of their previous experience that any such concerns by them\n                    would be rebuffed, dismissed or avoided by the MCST or the council members. The\n                    Plaintiffs also chose not to attend the third AGM. 52     The MCST, on the other hand, submitted that it\n                    was reasonable for them to require the additional company documents and their\n                    lodgement 48 hours ahead of the third AGM. In the LOAs submitted by the\n                    Plaintiffs in 2011, no reference was made to the designation or authority of the\n                    person who had signed them. In 2012, the LOAs were signed by an “unnamed\n                    person”. Moreover, save for the LOA for the Developer, the LOAs were not\n                    on the letterheads of the Plaintiffs. It was the MCST’s position that the\n                    additional company documents were required in order to ascertain the identity\n                    and designation of any person who would sign the LOAs in 2013 in order to ensure\n                    that they were signed by an authorised officer as required by para 16 of\n                    the First Schedule of the BMSMA. Given that the first to sixth plaintiffs were\n                    incorporated in the British Virgin Islands, the documents requested were either\n                    a company profile or certificate of incorporation, with a third option of a\n                    board resolution. The MCST also requested for the documents 48 hours before\n                    the AGM in order to have sufficient time for verification. These requirements\n                    were not inconsistent with para 16 of the First Schedule of the BMSMA, and\n                    were introduced to address genuine concerns. 53     In response, the Plaintiffs contended that if\n                    the MCST was indeed concerned with the authenticity of the LOAs, it should have\n                    written to the Plaintiffs themselves, asking for confirmation. It appeared to me\n                    that this is exactly what the MCST did. The Defendants have produced\n                    correspondence dated January and March 2013, showing the then Managing Agent,\n                    Colliers, sending emails and official notices requesting for the name of the\n                    authorised signatory of the Plaintiffs’ previous LOAs. These requests\n                    appeared to have gone unanswered. 54     I am of the view that the Plaintiffs’\n                    actions suffer from the same defect that they alleged in the MCST. Just as the\n                    Plaintiffs said that the MCST should have written to the Plaintiffs for\n                    confirmation, the Plaintiffs should also have, when faced with the Standing\n                    Instruction, made their objections with the Standing Instruction known to the\n                    Defendants. This they did not do. On the face of it, after the Defendants were\n                    apprised of the Plaintiffs’ concerns with the requirement of additional\n                    company documents, the MCST did not insist on them. At the fourth AGM, the MCST\n                    accepted the Plaintiffs’ LOAs which were signed by an identified person\n                    with a disclosed designation. The Plaintiffs’ representatives attended and\n                    voted at the fourth AGM, but failed to garner sufficient votes to be elected to\n                    the council. 55     In my judgment, given that the Plaintiffs did\n                    not make their concerns known, and failed to attend the third AGM, it could not\n                    be said that the MCST was “wrong ininsisting” [emphasis added] on the Standing Instruction.\n                    Furthermore, the MCST did not breach the provisions of the First Schedule of the\n                    BMSMA by falling below the requirements, but rather, requested for additional\n                    documents, and required lodgement of such documents 48 hours in advance of\n                    the AGM. Given the circumstances surrounding the Plaintiffs’ LOAs in 2011\n                    and 2012, the Standing Instruction was not made unreasonably. Further, as stated\n                    in [46] and [54] above, there was no longer any real controversy to be resolved\n                    by the court. I therefore dismissed Prayer 2 against the\n                MCST.",
        "The Sinking Fund issue": "56     The Plaintiffs also alleged that the MCST\n                    wrongfully utilised the sinking fund in April, June and July 2013 in\n                    contravention of ss 38(6) and 39(2) of the BMSMA by $9,333.25, $3,622.92\n                    and $19,472.04 respectively, on the basis that the cash in the MCST’s bank\n                    account was less than the value of the sinking fund for each of those\n                    months. 57     The MCST submitted that there was no drawdown\n                    on the sinking fund and the shortfall in the sums was due to late payments by\n                    the subsidiary proprietors to the management fund and the sinking fund. This was\n                    classified as receivables. The MCST produced its monthly balance sheets, and\n                    also pointed to its financial statements for the year ended 31 August 2013\n                    where the independent auditors reported their opinion that the financial\n                    statements were drawn up accurately and in accordance with the provisions of the\n                    BMSMA and the Singapore Financial Reporting Standards so as to give a true and\n                    fair view of the state of affairs of the MCST as at 31 August 2013\n                    (“the Auditor’s Report”). The auditors also stated that in\n                    their opinion, the accounting and other records which the BMSMA required the\n                    MCST to keep were kept properly in accordance with the provisions of that\n                    Act. 58     The Plaintiffs submitted that there were a\n                    number of cheques that had been issued by the MCST to various payees such as the\n                    Managing Agent and other contractors for the Development which had not been\n                    presented by the payees to the bank for payment. On the Plaintiffs’ case,\n                    if these un-presented cheques were taken into account, it would be clear that\n                    the MCST had wrongly utilised the sinking fund. The Plaintiffs also submitted\n                    that the Auditor’s Report did not take into account these un-presented\n                    cheques. 59     Considering all the evidence before me,\n                    including the monthly balance sheets, I did not find that the Plaintiffs had\n                    made out a sufficient basis to question the management of the funds, or the\n                    accuracy orbona fidesof the Auditor’s\n                    Report. In particular, in coming to their opinion, the auditors would have\n                    looked at all the financial documents of the MCST, including the fact that these\n                    cheques remained un-presented. 60     Even if the Plaintiffs were right, and the\n                    MCST had wrongfully utilised the sinking fund in April, June and July 2013, I\n                    would not have exercised my discretion to grant the declaratory relief sought.\n                    These alleged breaches occurred in April, June and July 2013. As is clear from\n                    the Auditor’s Report, the management of the sinking fund was in order from\n                    August 2013, with the correct sum of cash being appropriated to the sinking\n                    fund. The breaches, if any, were not subsisting ones. As stated at [46] above,\n                    there was no clear or useful purpose for granting a bare declaration. The\n                    Plaintiffs certainly did not claim that they had suffered any loss from the\n                    alleged breaches. I therefore dismissed Prayer 3 against the\n                MCST.",
        "The Tenancy Agreement issue": "61     The Plaintiffs take issue with the\n                    MCST’s request for a copy of the subsidiary proprietors’ tenancy\n                    agreements in order to update the particulars of the owners. The relevant\n                    portions of the letter sent by the MCST read: To:    All Subsidiary Proprietors / Occupiers /\n                            Tenants Riveria Gardens COMPULSORY UPDATING OF OWNER’S\n                            PARTICULARS … Pursuant to Section 65 of the Building Maintenance and\n                            Strata Management Act 2004 (BMSMA 2004), the Management is\n                        carrying out update of particular of all subsidiary proprietors (SP) of\n                        Riveria Gardens. We would appreciate if you could complete the\n                            “Updating Form” enclosed\n                        overleaf and attach the following relevant document for our\n                        update: - (i) If the unit is tenanted, a copy of the tenancy agreement with the\n                            particular of the tenant and the duration of the tenancy. … Please note that the above information will be kept confidential and will\n                        only be used for the purpose of Filing and Management in accordance to BMSMA\n                        2004. … 62     The Plaintiffs submitted that the MCST’s\n                    reliance on s 65 of the BMSMA was wrong in law, as that section does not\n                    empower management corporations to ask for such documents. It was the\n                    Plaintiff’s view that the MCST cited s 65 of the BMSMA in order to\n                    rely on s 65(9) which disentitles any subsidiary proprietor who has not\n                    complied with s 65 from voting at any general meeting, as the MCST knew\n                    that the Plaintiffs would not furnish copies of their tenancy agreements to the\n                    MCST for commercial reasons. 63     I found the Plaintiffs’ arguments\n                    far-fetched. It was not at all clear to me that the MCST was relying on\n                    s 65 of the BMSMA as a method of depriving the Plaintiffs of their right to\n                    vote at the general meetings. Although the letter refers to s 65 of the\n                    BMSMA, this was in the context of conducting an exercise to update the\n                    particulars of the subsidiary proprietors. As is clear from the extract of the\n                    letter set out at [61], following the paragraph which referred to s 65 of\n                    the BMSMA, the letter then proceeded to call for documentswithoutspecifically referring to any powers under s65 of the\n                    BMSMA to require these documents. 64     In oral submissions, the Defendants took the\n                    position that s 65(9) of the BMSMA would not have applied to bar the\n                    Plaintiffs from voting at a general meeting. This was entirely sensible.\n                    Sections 65(2), 65(5), 65(6) and 65(7) of the BMSMA require notice to be\n                    given to the MCST when the interest in a lot changes hands. There is no\n                    requirement under s 65 for the MCST to conduct such any update of\n                    particulars of tenants. In the absence of any transfer of interest in the units\n                    by the Plaintiffs to other parties, no obligation on the Plaintiffs’ part\n                    to give a notice under s 65 of the BMSMA would have arisen.\n                    Section 65(9) would thus have been inapplicable. 65     However, although the section does not\n                    expressly require the MCST to conduct an exercise in updating particulars of\n                    tenants, it was not unreasonable that the MCST would have wished to do so in\n                    order to know the parties who were substantially interested in the lots in the\n                    Development. Indeed, the Defendants stated that the purpose of calling for the\n                    tenancy agreements was to ascertain who the occupants of the units in the\n                    Development were in order to ensure that those using the Development’s\n                    facilities were entitled to do so. This was in line with items (o) and (p)\n                    of the Residents’ Handbook, which consisted of various “house\n                    rules” that the MCST laid down to ensure the smooth day-to-day running of\n                    the common facilities in the Development. Item (o) required subsidiary\n                    proprietors to provide the names of the tenants or occupiers of any unit in the\n                    Development, and item (p) provided that if a unit was leased out to a\n                    tenant, the subsidiary proprietor would no longer be entitled to use the\n                    Development’s facilities. The Defendants were prepared to accept redaction\n                    of the tenancy agreements and also undertook in the letter to keep the\n                    information in the tenancy agreements confidential. 66     In my view, there was nothing seriously amiss\n                    with the MCST’s conduct. If the Plaintiffs were of the view that the\n                    tenancy agreements contained commercially sensitive and confidential terms, it\n                    was always open to them to offer to redact the tenancy agreements, or object to\n                    furnishing their tenancy agreements, and to provide particulars instead.\n                    However, the Plaintiffs again kept silent and made no objections. Furthermore,\n                    the letter was addressed to all the subsidiary proprietors, occupiers and\n                    tenants of the Development, and was certainly not targeted only at the\n                    Plaintiffs. There was no basis for the Plaintiffs to claim that the MCST’s\n                    request for the tenancy agreements was motivated by a desire to deprive the\n                    Plaintiffs of their rights. Further, as stated at [46], no substantive purpose\n                    would be served by a bare declaration. I therefore dismissed\n                    Prayer 4.",
        "The Unauthorised Purchase issue": "67     The Plaintiffs also sought a declaration that\n                    the MCST’s purchases of certain items of furniture from Ikea totalling\n                    $2,990 in May 2013 were unauthorised. 68     The background to the purchases was as\n                    follows. Sometime around 13 May 2013, Mr Roger Teo, the property\n                    manager from Affinity (“the Property Manager”), circulated an\n                    email to the members of the second council of the MCST seeking a mandate for the\n                    chairman and secretary of the MCST to jointly approve expenditures in relation\n                    to “maintenance, repair and replacement works in the estate not exceeding\n                    $2,000 per single item or collective items”. Six out of the 11-member\n                    council communicated their assent to the resolution either through email or by\n                    signing the resolution. 69     Following this, an email was sent out by one\n                    “lo ks” on 23 May 2013 confirming the points of discussion of\n                    a meeting held on 21 May 2013 by the maintenance sub-committee. The salient\n                    portions of the email were as follows: Confirming points of Discussion. Tues 21 May 2013. … 10. Approved replacement of 6 pieces Loungers from IKEA @ $179 each\n                        (exclude transport and fixings) … 13. MA to recommend Table/Chair furniture for L2, subject to maximum\n                        $2,000 for Chairman’s approval. … 70     In a follow-up email on 24 May 2013,\n                    “lo ks” instructed the Property Manager to proceed with the\n                    purchases of the furniture from Ikea. The purchases were made on 30 May\n                    2013 in two receipts of $1,014 (for the loungers) and $1,976 (for the garden\n                    tables and chairs). The delivery and assembly charges were $178.60 and $158.05\n                    respectively. 71     The Plaintiffs raised the following issues\n                    with the purchases: (a)     The purchases were deliberately\n                        split into two receipts so that the chairman and secretary alone could\n                        approve the said expenditure. (b)     The resolution permitting the chairman and secretary to\n                        approve expenditures below $2,000 did not comply with the Second Schedule of\n                        the BMSMA. (c)     The\n                        purported resolution did not authorise the purchases as: (i)       the total amount of the\n                            purchase of garden tables and chairs exceeded $2,000;\n                        and (ii)       the\n                            purchase of the garden tables and chairs did not constitute\n                            “maintenance, repair and replacement works” as there were\n                            no garden table and chairs in the Development before the\n                            purchase. (d)     The purchases were not approved jointly by the chairman and the\n                        secretary of the council but by a non-council member known as “lo\n                        ks”. 72     I did not consider it improper for the\n                    purchases to be split into separate receipts given that these were separate\n                    items dealt with at the meeting of 21 May 2013. I also did not accept the\n                    Plaintiffs’ contention that it was “lo ks” who approved the\n                    purchases. Although the emails were sent by “lo ks”, the chairman\n                    and secretary of the then council were copied in those emails. Further,\n                    “lo ks” also stated in his email of 24 May 2013 that the\n                    purchases had the “support of the Chairman”. 73     There were, however, two problems with the\n                    purchases which, in my judgment, made them unauthorised. Firstly, it was not\n                    entirely clear whether the resolution authorising the chairman and secretary of\n                    the council to jointly approve purchases under $2,000 was validly passed.\n                    Section 53(11) of the BMSMA provides that the Second Schedule of the BMSMA\n                    shall govern the proceedings of the council of a management corporation.\n                    Paragraph 7 of the Second Schedule provides that: Resolutions in\n                        writing 7.A resolution of a council or an executive\n                        committee shall be taken to have been validly passed even though the meeting\n                        at which the motion for the resolution was proposed to be submitted was not\n                        held if — (a) notice was given in accordance with\n                            this Schedule of the intended meeting of the council or executive\n                            committee, as the case may be; (b) a copy of the motion for the\n                            resolution was served on each member of the council or executive\n                            committee, as the case may be; (c) the resolution was approved in\n                            writing by a majority of members of the council or executive committee,\n                            as the case may be; and (d) the motion for the resolution does\n                            not concern any matter that the management corporation or subsidiary\n                            management corporation, as the case may be, determines under\n                            section 59 may only be decided upon by its council or executive\n                            committee, as the case may be, at a meeting. 74     The Plaintiffs submitted that para 7 of\n                    the Second Schedule was not complied with as no notice was given in accordance\n                    with para 7(a) of the Second Schedule of the\n                    BMSMA. The MCST has not produced any evidence to the contrary. 75     Another difficulty that the MCST faced was\n                    that in relation to the garden table and chairs, these items did not fall within\n                    “maintenance, repair and replacement works”, since prior to the\n                    purchase of these items, there were no tables and chairs at the garden of the\n                    Development. Due to the above reasons, these purchases were thus\n                    unauthorised. 76     However, I was not persuaded that granting a\n                    bare declaration that the MCST had breached its duties, without remedying the\n                    breach, would be appropriate. What was more important was for the MCST to ratify\n                    the purchases. Indeed, the Plaintiffs could have applied under s 88(3) of\n                    the BMSMA for the court to compel the management corporation to perform any\n                    requirement or duty imposed on a management corporation by Part V of the\n                    BMSMA. Section 53(11) of the BMSMA imposes a duty on councils of management\n                    corporations to conduct their proceedings in accordance with the Second Schedule\n                    of the BMSMA. This includes ensuring that resolutions are passed validly, and\n                    where these resolutions relate to the purchase of common property for the\n                    benefit of subsidiary proprietors, these purchases should be appropriately\n                    authorised. 77     While it might be noted that the Plaintiffs\n                    did not specifically apply for relief under s 88(3) of the BMSMA, as the\n                    Plaintiffs indicated that in general, the present action was made under\n                    s 88, I was of the view that in this instance, it would be appropriate to\n                    treat Prayer 5 as an application under s 88(3), and to make the order\n                    for ratification. In any case, as stated above at [33]–[43], this court\n                    has jurisdiction over this dispute and the power to order the appropriate relief\n                    under general law. I thus ordered the MCST to ratify these\n                purchases.",
        "Miscellaneous matters": "78     Two other matters should be briefly dealt\n                    with. As stated above (at [10]), the potential counterclaims by the MCST against\n                    the Developer involved substantial disputes of fact, and the Defendants proposed\n                    to proceed by way of a separate claim against the Developer. I granted leave to\n                    the MCST to commence a writ action pursuant to O 28 r 8 of the ROC\n                    within six weeks of the order made. 79     The second is with regard to the s 58(3)\n                    Notice, issued by the Plaintiffs to oppose any decision of the council that\n                    might result in the incurring of legal costs for the present action. The\n                    Defendants submitted that the s 58(3) Notice was issued in bad faith, to\n                    intimidate the MCST and prevent it from defending the present action. The\n                    Defendants urged this court to declare the s 58(3) Notice null and void. The\n                    Plaintiffs submitted that there was no need for the court to deal with this, and\n                    that OS 994/2014 should be dealt with separately. In reply, the Defendants\n                    accepted that if I took the view that I was not bound by the notice in terms of\n                    costs, there would be no need to rule on this issue in the present proceedings.\n                    The Plaintiffs accepted that I was not bound by the notice in relation to\n                    costs. 80     Accordingly, there was no need for me to deal\n                    with the issue whether the s 58(3) Notice was valid. As the Plaintiffs had\n                    failed in most of their prayers, save for Prayer 5, and had withdrawn\n                    Prayer 1, I awarded costs to the Defendants fixed at $7,000, with\n                    disbursements to be agreed or taxed."
    }
}