{
    "case_title": "PT Sariwiguna Binasentosa \n      v\n      Sindo Damai Shipping Pte Ltd and others",
    "ncitation": "[2015] SGHCR 20",
    "coram": "Justin Yeo AR",
    "sections": {
        "Background facts": "2       The Plaintiff is an Indonesian tin mining and exporting company. The 1stDefendant is a company incorporated in Singapore and is in the business of providing shipping services. The 2ndto 6thDefendants are present or former directors of the 1stDefendant, while the 7thDefendant is employed by the 1stDefendant as its assistant general manager. The 2ndto 7thDefendants are not involved in the present application. 3       The Plaintiff’s claim against the 1stDefendant is for (a) the 1stDefendant’s alleged conversion and/or misdelivery of certain tin cargo shipped under a bill of lading (“BL No SIN 25”) without presentation of the original bill of lading; and (b) the 1stDefendant’s alleged detinue, conversion and wrongful interference of the tin cargo shipped under three other bills of lading (“BL Nos SIN 21, 22 and 26”). 4       The brief procedural history, insofar as is relevant to the present application, is as follows. The Plaintiff filed the Writ of Summons and Statement of Claim on 10 April 2015. The 1stDefendant filed its Defence and Counterclaim on 13 May 2015. On 18 June 2015, the Plaintiff filed an application for summary judgment. On 24 July 2015, the Registrar heard the summary judgment application and ordered that: (a)     Final judgment be entered in favour of the Plaintiff against the 1stDefendant in relation to the cargo shipped under BL No SIN 25 for the sum of US$1,077,448.27. (b)     Interlocutory judgment be entered in favour of the Plaintiff for its claim against the 1stDefendant in relation to the cargo shipped under BL Nos SIN 21, 22 and 26, with damages to be assessed, including damages occasioned by the 1stDefendant’s delay in delivery up of the cargo shipped under BL Nos SIN 21, 22 and 26. (c)     The 1stDefendant be given leave to defend the Plaintiff’s claim for a declaration that the 1stDefendant indemnifies the Plaintiff for all liabilities and/or claims and/or losses, expenses and costs incurred or to be incurred (whether made directly or indirectly against the Plaintiff) arising from and/or as a result of and/or in connection with the 1stDefendant’s breaches and/or conversion and/or detinue in respect of the tin cargo under BL Nos SIN 21, 22, 25 and 26. (d)     Costs of the application fixed at S$7,500 (inclusive of disbursements) to be paid by the 1stDefendant to the Plaintiff. 5       By way of a Notice of Appeal filed on 29 July 2015, the 1stDefendant appealed against the parts of the Registrar’s decision as mentioned in [4(a)] and [4(b)] above. The appeal, HC/RA 228/2015 (“RA 228”), has been fixed for hearing on 14 September 2015. 6       As the appeal did not operate as a stay of execution (see s 41 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) in general and O 56 r 1(4) of the Rules of Court in particular; and seeLian Soon Construction Pte Ltd v Guan Qian Realty Pte Ltd[1999] 1 SLR(R) 1053 at [13]), the 1stDefendant took out the present application on 3 August 2015, seeking a stay of execution of the summary judgment pending the determination of RA 228.",
        "Issue": "7       The main issue before this court was whether a stay of execution pending appeal should be granted pursuant to O 45 r 11 of the Rules of Court, in view that the 1stDefendant was willing to pay the judgment sum plus interest into court as a condition for obtaining a stay.",
        "Decision": "8       The arguments raised by way of oral and written submissions at the hearing on 12 August 2015 may be analysed under five headings: (a)     Merits of the appeal; (b)     Risk of dissipation by the judgment creditor; (c)     Risk of dissipation by the judgment debtor; (d)     Winding up petition against the judgment debtor; and (e)     Balance of prejudice between the parties, particularly in view that the 1stDefendant was willing to pay the judgment sum plus interest into court as a condition for obtaining a stay pending appeal.",
        "Merits of the appeal": "9       First, the merits of the appeal, which would affect its prospects of success. It is well established that while the existence of strong grounds for appeal is not by itself a reason for granting a stay, the fact that there is little merit in the appeal is a relevant circumstance that a court can take into account in exercising its discretion to grant a stay pending appeal (Strandore Invest A/S and others v Soh Kim Wat[2010] SGHC 174 (“Strandore Invest”) at [10], citingLee Kuan Yew v Jeyaretnam Joshua Benjamin[1990] 1 SLR(R) 772 andDenis Matthew Harte v Tan Hun Hoe and another[2001] SGHC 19 (“Denis Matthew Harte”)). 10     Counsel for the Plaintiff, Mr Leong Kah Wah (“Mr Leong”), argued that going by established legal principles, in particular those set out inAPL Co Pte Ltd v Voss Peer[2002] 2 SLR(R) 1119 (“APL v Voss Peer”) at [55], a ship-owner should only deliver cargo against the presentation of a bill of lading. As such, he submitted that the present suit was a clear case of conversion and misdelivery, and that the prospects of a successful appeal were slim. Counsel for the 1stDefendant, Mr Thomas Tan (“Mr Tan”), clarified that the 1stDefendant was not looking to contest the issue of liability on appeal; rather, RA 228 concerned the issue of whether the Registrar had erred by giving final judgment instead of interlocutory judgment with damages to be assessed. 11APL v Voss Peerdid not deal with the issue of whether the court should have granted final judgment or interlocutory judgment with damages to be assessed. As such, I could not conclude that based on the authority ofAPL v Voss Peer, there was little merit in the 1stDefendant’s appeal.",
        "Risk of dissipation by the judgment creditor": "12     Second, the risk of dissipation of assets by the judgment creditor (in this case, the Plaintiff) in the event a stay pending appeal is refused. 13     Mr Tan emphasised that the Plaintiff was a foreign company with no known presence or assets in Singapore, and that the 1stDefendant had little, if any, information about the Plaintiff. Mr Leong responded that the Plaintiff was a reputable company that had substantial dealings in Singapore and was certainly not, to borrow Mr Leong’s turn of phrase, a “debt dodger”. To substantiate his submissions, Mr Leong cited the 9thAffidavit of Mr Juan Setiadi Widjaja (“Mr Widjaja”), which stated that: (a)     Since 2003, the Plaintiff had been an established tin mining and smelting company in Indonesia. The Plaintiff had, in 2013, satisfied the criteria of the Indonesia Commodity Derivative Exchange and the Commodity Futures Trading Regulatory Agency and became a licensed member, entitling the Plaintiff to trade through the Exchange. In January 2015, the Plaintiff received accreditation under the Conflict-Free Sourcing Initiative, a program started by the United States of America and the European Union for tin production and smelting, and which included checks on compliance with corporate and social responsibility standards. (b)     The Plaintiff is in strong financial health. At the close of the Financial Year 2014, the Plaintiff had total assets of S$16,244,289; revenue of S$50,146,998; net income of S$386,209; and retained earnings of S$1,082,136. (c)     The Plaintiff traded regularly with Singapore parties, and in the 12 months from June 2014 to June 2015, the Plaintiff had sold tin valued at US$18,080,071.43 to parties in Singapore. 14     In response, Mr Tan emphasised that he was not suggesting that the Plaintiff was an “insolvent company” or a “debt dodger”. However, he sought to bring the court through the affidavit of Mr Widjaja in an attempt to show that the Plaintiff’s financial health may not be as good as Mr Widjaja had made it out to be. He pointed out, amongst other things, that: (a) there were “accounts receivable” from Uni Bros Metal Pte Ltd which may not be collectible as that company was undergoing liquidation; (b) even if the Plaintiff had sold tin valued at US$18,080.071.43 to parties in Singapore, these receivables may not all be collectible, and in any case, would not detract from the fact that the Plaintiff had no assets in Singapore; (c) in 2014, the Plaintiff’s total “cash and bank” amounted to 781,383,206 Indonesian Rupiah (about S$79,889.55), which was a drastic difference from the amount of 6,074,300,167 Indonesian Rupiah (about S$621,043.60) in 2013; and (d) the Plaintiff had obtained two bank loan facilities in 2014. Mr Tan submitted that in deciding whether to grant a stay pending appeal, the court should consider that the Plaintiff may not be in good financial health, and also take into account the allegedly less-than-ideal prospects of debt recovery in Indonesia. 15     I could not agree with Mr Tan’s contentions on the Plaintiff’s financial health, as these were not substantiated by any evidence. Indeed, in the affidavit supporting the present application, it was expressly stated that “the 1stDefendant is not aware of the financial position of the Plaintiff”; if so, it would appear to follow that there can be little (if any) basis for the 1stDefendant’s assertions on the Plaintiff’s financial health. Furthermore, Mr Tan was not an accounting expert and in any case had no evidence for his interpretation of the Plaintiff’s accounts, which (as he candidly admitted) was in some respects purely speculative in nature. Overall, there was no objective evidence that the Plaintiff was impecunious or in financial difficulty, likely to abscond with the judgment sum, or become untraceable in the event of a successful appeal (seeDenis Matthew Harteat [65] andStrandore Investat [13]). It followed that Mr Tan could not show that a successful appeal might be rendered nugatory. 16     Mr Tan’s point on the prospects of debt recovery in Indonesia was not substantiated by any evidence. In any event, mere inconvenience, expense and difficulty of having to bring proceedings in a foreign jurisdiction to recover a judgment debt would not be sufficient to justify a stay without more (seeDenis Matthew Harteat [66] andStrandore Investat [13]). 17     As such, the 1stDefendant failed to demonstrate that there was any risk of dissipation of assets by the Plaintiff that may render nugatory a successful appeal.",
        "Risk of dissipation by the judgment debtor": "18     Third, the risk of dissipation of assets by the judgment debtor (in this case, the 1stDefendant) should a stay pending appeal be granted. 19     Mr Leong pointed out that there has been some record of dishonesty on the part of the 1stDefendant. InPT Sariwiguna Binasentosa v Sindo Damai Shipping Ltd and others[2015] SGHC 195, Choo J made a finding (at [17]) about the 1stDefendant’s dishonesty. While Choo J had emphasised (at [18]) that the finding on dishonesty did not go towards showing an inclination to dissipate assets, Mr Leong argued that given the existence of a summary judgment against the 1stDefendant, there was now a greater risk of dissipation of assets by the 1stDefendant. 20     I found this argument to be speculative and unsupported by any evidence. In any case, given that the 1stDefendant was willing to pay the judgment sum plus interest into court as a condition for obtaining a stay pending appeal, it was difficult to see how there could be any risk of dissipation of assets by the 1stDefendant should a conditional stay be granted.",
        "Winding up petition against the judgment debtor": "21     Fourth, the prospect of a winding up petition against the 1stDefendant. 22     Mr Tan informed the court that the Plaintiff had served a statutory demand and was actively seeking to wind up the 1stDefendant. Pursuant to the statutory demand, the 1stDefendant had (a) until 3 August 2015 to make payment of the judgment sum plus costs, failing which the Plaintiff would proceed “as it deems fit” for recovery of the same; and (b) until 17 August 2015 to make payment, failing which the Plaintiff would apply for winding up against the 1stDefendant. Mr Tan submitted that where a judgment creditor pursues a winding up of the judgment debtor, the court may find that there are special circumstances warranting the grant of a stay of execution, since a successful winding up of the judgment debtor would render an appeal nugatory (seeCathay Theatres Pte Ltd v LKM Investment Holdings Pte Ltd[2000] 1 SLR(R) 15 at [14]–[15] andStrandore Investat [12]). In the present case, Mr Tan submitted that in the absence of a stay pending appeal, the 1stDefendant may be wound up prior to the hearing of RA 228, thus rendering the 1stDefendant’s appeal nugatory 23     However, Mr Leong clarified that the Plaintiff was agreeable to fixing the hearing of the winding up petition after the determination of the appeal, so that RA 228 would not be jeopardised by winding up proceedings against the 1stDefendant. As such, the fact that the 1stDefendant may be wound up weighed little, if at all, in considering whether this court should grant a stay pending appeal.",
        "Balance of prejudice between the parties": "24     Fifth, the prejudice caused to the Plaintiff and 1stDefendant respectively should a stay pending appeal be granted or refused, as the case may be. 25     Mr Tan reiterated that the 1stDefendant was willing to put the judgment sum plus interest into court as a condition for obtaining a stay pending appeal. This would ensure that the Plaintiff would obtain the full benefits of the judgment in the event that the 1stDefendant was to fail in its appeal. There was therefore no prejudice to the Plaintiff since the Plaintiff’s interests would be adequately protected pending appeal. On the contrary, Mr Tan argued that short of a stay of execution, the 1stDefendant had no protection in the event that the Plaintiff dissipated its assets pending appeal (on which, see [12]–[17] above). 26     Mr Leong argued that the Plaintiff would suffer prejudice in the event that a stay was granted because it would not be able to immediately enjoy the fruits of a judgment that it had obtained. However, Mr Leong admitted that the Plaintiff would not suffer serious prejudice if (a) a stay was granted on the condition that the Defendant pay the full judgment sum, plus any interest, into court, and (b) RA 228 is indeed heard on 14 September 2015 and promptly decided by the appeal court. 27     Be that as it may, while prejudice to the parties is a relevant factor to be considered in determining whether a stay should be granted, the “balance of prejudice” is not the touchstone for the granting of a stay. The key touchstone, which is also the common thread that underlies the decided cases on granting of a stay pending appeal (see,eg,The “Shen Ming Hong 7”[2010] SGHC 269 at [12]–[13], as well as the other cases cited in the present grounds of decision), is that a stay is only granted where the appeal, if successful, may be rendered nugatory in the circumstances. In this regard, inStrandore Invest, the court emphasised that the discretion to grant a stay must be exercised judicially,ie, in accordance with well-established principles, and stated three principles in this regard (Strandore Investat [7]): (a)     First, the court does not deprive a successful litigant of the fruits of his litigation, and lock up funds to which he isprima facieentitled, pending an appeal. (b)     Second, the court ought to see that the appeal, if successful, is not nugatory. A stay will be granted if it can be shown by affidavit that if the damages and costs are paid, there is no reasonable probability of getting the money back if the appeal succeeds. (c)     Third, as an elaboration of the second principle, the judgment debtor must show special circumstances before the court will grant a stay. 28Strandore Investdid not, however, directly address the situation in which a judgment debtor offers to pay the judgment sum plus interest into court as a condition for obtaining a stay pending appeal. Indeed, neither Mr Tan nor Mr Leong could cite any decision of the Singapore courts that dealt directly with the point just mentioned. Mr Tan cited two English cases in which there was payment of the judgment sum into court pending appeal, but these were not directly relevant to the present application: (a)     InRosengrens Ltd v Safe Deposit Centres Ltd[1984] WLR 1334 (“Rosengrens”), the issue before the English Court of Appeal was whether a bank guarantee should be allowed in lieu of payment into court. The issue of whether there should be a stay of execution pending appeal was not before the Court of Appeal (seeRosengrensat 1336G–1337AperSir John Donaldson MR and 1337C–1337EperParker LJ). (b)     InSunico v Commissioners for Her Majesty’s Revenue and Customs[2014] EWCA Civ 1108, the issue before the English Court of Appeal was whether payment of the judgment sum should be made a condition forgranting leave to appeal(rather than a condition for astay pending appeal). The court found that the judgment debtor had deliberately failed to pay the judgment sum when it had resources to do so, and had also deliberately put the available resources out of reach to deny the judgment creditor of the judgment sum. 29     The two English cases just mentioned are examples of situations in which the English courts have protected a judgment creditor by way of ordering the payment of the judgment sum into court. However, they do not provide guidance in determining whether the payment into court of a judgment sum, without more, is in itself sufficient to justify a stay pending appeal. 30     Returning to the present application, the 1stDefendant’s offer to pay the judgment sum plus interest into court appeared to give weight the first principle (see [27(a)] above) in the sense that it ensured that the Plaintiff would not be deprived of the fruits of its litigation in due course. However, such an offer would still result in the locking up of funds to which the Plaintiff isprima facieentitled, a situation which may be countenanced only if the second and/or third principles (see [27(b)] and [27(c)]) are made out. In the absence of any evidence that the 1stDefendant’s appeal would be rendered nugatory (see [12]–[17] above), and in view that the Plaintiff was agreeable to fixing the hearing of the winding up petition after the determination of RA 228 (see [23] above), the fact that there was an offer to pay the judgment sum plus interest into court did not, by itself, justify a stay pending appeal. Otherwise, it would be open to every judgment debtor to justify a stay pending appeal simply by paying the judgment sum into court rather than to the judgment creditor – a situation that would be in violation of the first principle cited inStrandore Investinsofar as it results in the locking up of funds to which the judgment creditor isprima facieentitled.",
        "Conclusion": "31     For the reasons given above, I dismissed the application and made an order of costs of S$3,500, inclusive of disbursements, to the Plaintiff."
    }
}