{
    "case_title": "Trans Eurokars Pte Ltd\n      v\n      Koh Wee Meng",
    "ncitation": "[2015] SGHCR 6",
    "coram": "Justin Yeo AR",
    "sections": {
        "The Applicable Legal Principles": "6       In Singapore, the incidence of costs in civil litigation is governed by the “indemnity principle”,ie, that an unsuccessful party would generally be ordered to pay the successful party’s reasonable litigation costs (Ng Eng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd, intervener) and another appeal[2009] 4 SLR(R) 155 (“Ng Eng Ghee”) at [6]; and seeThen Khek Koon and another v Arjun Permanand Samtani and another and other suits[2014] 1 SLR 245 (“Then Khek Koon”) at [153]–[154]). The indemnity principle gives the winning party an indemnity in respect of his costs from the losing party, subject to the court’s overriding discretion (Then Khek Koonat [153]). Underlying the indemnity principle is the notion that costs are generally imposed tocompensatethe successful party, rather than topunishthe losing party (Ng Eng Gheeat [7], cited inThen Khek Koonat [155]). The indemnity principle extends only tocosts reasonably incurred, rather than to all costs incurred; it therefore does not amount to a full and complete indemnity to the successful party against his expenses incurred in relation to the proceedings (Ng Eng Gheeat [7]). This is because while the indemnity principle is compensatory in nature, its ultimate policy is rooted not in compensation but in enhancing access to justice; it must therefore seek a balance between the interests of the parties (Then Khek Koonat [156] and [158]). 7       For clarity, the “indemnity principle” should not to be confused with costs awarded on the “indemnity basis”. Costs awarded on the “indemnity basis” are costs taxed on the basis that any doubts as to reasonableness of the costs incurred are to be resolved in favour of the receiving party (O 59 r 27(3) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“Rules of Court”); and seeNg Eng Gheeat [6]). In contrast, where costs are awarded on the “standard basis”, the burden of proof is on the receiving party and doubts are resolved against recovery (Then Khek Koonat [167]). As a norm, the quantification rules are applied so as to maintain an appreciable margin between the two bases (ibidat [168]). In the present case, the Applicant had sought for costs to be taxed on the “indemnity basis”, but the Judge ordered that costs were to be taxed on the “standard basis”. 8       InLin Jian Wei and anor v Lim Eng Hock Peter[2011] 3 SLR 1052 (“Lin Jian Wei”) at [78], the Court of Appeal set out the approach to be taken in taxation. The taxing court should first assess the relative complexity of the matter, the work supposedly done against what was reasonably required in the prevailing circumstances, the reasonableness and proportionality of the amounts claimed on an item by item basis (ibid). Thereafter, the taxing officer should assess the proportionality of the resulting aggregate costs (ibid). In so doing, all considerations in Appendix 1 to O 59 are relevant, with no single consideration ordinarily to take precedence (ibid). In this regard, paragraph 1(2) of Appendix 1 to O 59 of the Rules of Court requires the taxing court to take into account “the principle of proportionality and all the relevant circumstances”, and in particular: (a) the complexity of the item or of the cause or matter in which it arises and the difficulty or novelty of the questions involved; (b) the skill, specialised knowledge and responsibility required of, and the time and labour expended by, the solicitor; (c) the number and importance of the documents (however brief) prepared or perused; (d) the place and circumstances in which the business involved is transacted; (e) the urgency and importance of the cause or matter to the client; and (f) where money or property is involved, its amount or value. 9       The importance of the proportionality of costs in taxation cannot be overemphasised. In this regard, it is important to note the interplay between reasonableness, proportionality and necessity as set out by the Court of Appeal inLin Jian Weiat [56]: We think that costs that are plainly disproportionate to,inter alia, the value of the claim cannot be said to have been reasonably incurred. Thus, in assessing whether costs incurred are reasonable, it needs to be shown that the costs incurred were not just reasonable and necessary for the disposal of the matter, but also,in the entire context of that matter, proportionately incurred. [emphasis added] 10     With these general principles in mind, I will address each section of costs in turn.",
        "Section 1 Costs": "",
        "The Applicant’s arguments": "11     The Applicant sought $608,807.28 (before GST) for Section 1 costs. The Applicant set out in some detail the issues raised at trial, as well as the time spent by the Applicant’s team of solicitors and counsel comprising Mr Tan Chee Meng, Senior Counsel (“Mr Tan SC”), Ms Josephine Choo (“Ms Choo”), Mr Quek Kian Teck (“Mr Quek”) and Mr Wilbur Lim (“Mr Lim”). Mr Quek represented the Applicant at all the taxation hearings before me. He attempted to justify the Applicant’s claim for Section 1 costs on the following grounds. 12     First, Mr Quek contended that a higher costs award was justifiable in view of the complexity of the matter and novelty of questions involved. In this regard, Mr Quek argued that: (a)     Suit 873 involved highly complex technical issues.[note: 1]The Judge had recognised that in order to deal with the issues in Suit 873, it was necessary to first determine whether there was a defect in the Rolls when it was delivered to the Respondent (Koh Wee Mengat [33]). In order to determine the technical issue of whether the noise and vibration constituted a defect, it was necessary for the Rolls to be inspected on two occasions, at meetings that involved different experts. It was also necessary for the Respondent’s expert, Mr David John Bellamy (“Mr Bellamy”), to inspect two comparison vehicles in the United Kingdom (“UK”), and for the Applicant’s expert, Mr Robert Johann Matawa (“Mr Matawa”), to inspect six similar vehicles at the Rolls-Royce factory in Goodwood, UK. In addition, the Applicant’s witnesses had to give evidence in respect of a particular rating system used in the automotive industry (known as the “BI Rating”). The application of the BI Rating was complex, technical and required specific expertise. It should be noted that the Judge found that Mr Bellamy was unable to apply the BI Rating as he did not possess the necessary expertise (ibidat [87]). (b)     Suit 873 also involved numerous legal issues which the Judge had to consider, and upon which parties had submitted at length. The issues were as follows: (i)       What constitutes “satisfactory quality” under s 14 of the Sale of Goods Act (Cap 393, 1999 Rev Ed) (“Sale of Goods Act”) (Koh Wee Mengat [89]–[91]). (ii)       Whether a reasonable person who, like the Respondent, had paid $1.4m to purchase a luxury motor vehicle touted for its ride comfort and quiet performance, would have considered the quality of the car to be unsatisfactory because of the noise and vibration experienced during a three-point turn (ibidat [93]–[99]). (iii)       Whether the Respondent had acquiesced in any breach (ibidat [119]–[122]). (iv)       The measure of damages payable in the event of any breach, and in particular, whether the buyer of defective goods is entitled to rely on the measure in s 56(3) of the Sale of Goods Act if doing so would recover more than his true loss (ibidat [123]–[124]). (v)       Whether the Respondent had proved his claim for loss of amenity (ibidat [135]). (vi)       Whether the Respondent was obliged to mitigate his losses, and if so, whether he failed to do so by continuing to use the Rolls or, alternatively, because he had refused to accept the Applicant’s offer made in October 2009 to send the Rolls to Rolls-Royce’s UK workshop for further investigation (ibidat [136]–[141]). 13     Second, Mr Quek submitted that the costs sought were reasonable in light of the considerable skill, specialised knowledge and responsibility required of, and the time and labour expended by, the Applicant’s team of solicitors and counsel: (a)     Due to the complex technical nature of the dispute, the Applicant’s solicitors had to attend inspection of the Rolls (on 28 and 29 February 2012), inspection of Rolls-Royce vehicles at Goodwood, UK (in August 2012), and a meeting with Mr Matawa and Mr Alexander Uphoff (“Mr Uphoff”) in Munich, Germany (in March 2013). According to Mr Quek, the legal costs incurred from inspections and meetings alone amounted to $107,065.[note: 2]Mr Quek submitted that the Applicant’s team of solicitors and counsel had acted reasonably in attending these inspections and meetings. For instance, for the two-day inspection of the Rolls in February 2012, Ms Choo attended only half a day, and Mr Quek attended only one day. Mr Quek claimed that such attendances were necessary for the team to understand how the readings were taken as well as the rationale of the expert’s approach.[note: 3]The inspection at Goodwood was attended only by Ms Choo.[note: 4]The meeting in Germany involved both Mr Tan SC and Ms Choo as it was necessary for both counsel to get up for the second tranche of trial.[note: 5] (b)     There were three different periods of getting-up for trial. Trial dates were initially fixed in November 2012. However, as the Respondent’s lead counsel had to attend a Court of Appeal hearing during that time, the trial dates were re-fixed, three working days prior to the trial, to January 2013 (first tranche) and February 2013 (second tranche). At the hearing of RA 6 before the Judge on 8 January 2013, the second tranche was further re-fixed to March 2013. According to Mr Quek, the legal costs incurred for getting-up and trial attendance alone amounted to $415,326.[note: 6] (c)     On the issue of Pre-Trial Conferences (“PTCs”), the Respondent did not dispute the attendance at and the length of the PTCs. According to Mr Quek, the legal costs incurred from attending the PTCs amounted to $4,275.[note: 7] (d)     Mr Quek pointed out that all of these costs (iefor attendance at inspections and meetings, for getting-up for trial, and for PTCs) already amounted to $537,291. He further pointed out that the total time costs for all legal work since 2011 (ieincluding the taking of instructions, the drafting and preparation of documents, discovery,etc, but excluding interlocutory applications where costs had been fixed by the court) amounted to $842,684,[note: 8]of which the time costs of the two most senior solicitors (ieMr Tan SC and Ms Choo) alone amounted to $776,800.[note: 9]He emphasised that the amount of Section 1 costs claimed already included a sizeable discount from the actual time costs incurred by the Applicant’s team of solicitors and counsel. 14     Third, Mr Quek argued that the amount of Section 1 costs claimed was not disproportionate to the Respondent’s total claim of $1,055,304 (as quantified in the Respondent’s Closing Submissions in Suit 873).[note: 10] 15     Fourth, Mr Quek submitted that while there was no certificate for more than two counsel in the present case, the court should still take the costs of the third and fourth solicitors into consideration, for the following reasons: (a)     If only the time spent by the two most senior solicitors could be considered in the present case, this would lead to the unfair result that the Applicant is substantially deprived of its costs for work done by the more junior solicitors just because different solicitors had handled different aspects of the dispute for better costs management.[note: 11]Awarding costs strictly on the basis of only two solicitors’ costs would give rise to an unrealistic costs award which did not take into consideration that work should reasonably be delegated to more junior solicitors in the interests of costs management.[note: 12]In this regard, Mr Quek argued that the Applicant’s team of solicitors and counsel had allocated work such that work of lesser complexity would be appropriately delegated to the junior solicitors so as to reduce costs. As an example, he pointed out that he had attended a full day inspection of the Rolls while Ms Choo had attended only half a day, and Mr Tan SC did not attend at all. Mr Quek also submitted, in response to a query from this court, that the team was careful to ensure that there was minimal overlap of the responsibilities of the different counsel. (b)     As a matter of policy, it is desirable for work to be appropriately delegated to junior solicitors. As such, the court should consider the reasonable costs to be allowed rather than depriving the Applicant of the costs of the junior solicitors even in the absence of a certificate for more than two counsel. In making this argument, Mr Quek relied onGreenslade on Costs (Fees Update) 1997(“Greenslade on Costs”),[note: 13]where the learned authors observed that: … briefing of two counsel in a complex or voluminous case allows for division of labour, expertise in certain areas and cover by one counsel in the absence of the other… . Mr Quek also relied onST International Company Limited v General Nice Resources (Hong Kong) LtdDCCJ 4192 of 2007 (“ST International”),[note: 14]where the District Court of Hong Kong noted (at [12]) that: … a more senior solicitor supervising a junior solicitor in litigation is usual and reasonable … . It is proper for a solicitor of more than 10 years of post admission experience to take charge of this case and delegate appropriate litigation works to [a less senior solicitor]. (c)     There are also practical policy implications should costs incurred by junior solicitors be disallowed. Such an approach would mean that senior solicitors are expected to undertake every aspect of the case, including drafting pleadings, attending to all witnesses, complying with discovery obligations, compiling lists of documents, attending all interlocutory applications and PTCs, preparing all affidavits, preparing all legal submissions, and so forth.[note: 15]This, Mr Quek submitted, would not be optimal from the perspective of costs management. 16     As such, Mr Quek submitted that costs for all four members of the Applicant’s team of solicitors and counsel should be taken into consideration. Taking this approach, Mr Quek emphasised that even assuming that a 40% discount was applied to the actual time costs of Mr Tan SC and Ms Choo (on which, see [13(d)] above), the time costs still amounted to $466,080. Further, assuming that a 50% discount was applied to the time costs of Mr Quek, this would amount to an additional $103,360. In all, even with these significant discounts applied, the time costs still amounted to about $569,440. Mr Quek therefore submitted that the claim of $608,807.28 for Section 1 costs “cannot be considered unreasonable”.[note: 16] 17     On the costs for RA 6, Mr Quek argued that although no order was made by the Judge, the Respondent had opposed the application for Mr Uphoff to give evidence by video link because the Respondent wanted to obtain discovery against Mr Uphoff when he came to Singapore. However, the Judge did not order any discovery against Mr Uphoff. Although the Judge did not disturb the $6,000 costs awarded to the Respondent by the Assistant Registrar at the first instance hearing, the Judge expressly awarded costs to the Applicant, to be taxed on the standard basis. Mr Quek therefore submitted that the costs for RA 6 should be at least $6,000 to $8,000.",
        "The Respondent’s arguments": "18     Ms Samantha Tan (“Ms Tan”) argued, on behalf of the Respondent, that the Section 1 costs claimed by the Applicant were excessive, for the following reasons. 19     First, according to Ms Tan, Suit 873 was “simple and straightforward”. The matter concerned only a single sale of goods transaction in Singapore, in which the legal and factual issues fell within a very narrow compass. No particular skill, specialised knowledge or responsibility, or extensive time and labour was required by the Applicant’s team of solicitors and counsel. Furthermore, the documentary evidence was not voluminous.[note: 17] 20     Second, the Section 1 costs claimed by the Applicant were not in accordance with the taxation precedents.[note: 18]An amount of $80,000 for Section 1 costs would be more in line with the position taken inBasil Anthony Herman v Premier Security Co-Operative Ltd and others[2012] 2 SLR 616 at [7],ie, that Section 1 costs awarded should be in the range of between $10,000 and $20,000 for each day of trial, and that claims or awards outside this range will be regarded as “exceptional”.[note: 19] 21     Third, Ms Tan contended that in view of the points made at [19] above, pursuant to O 59 r 19(3) of the Rules of Court, the Applicant should be limited to claiming the costs of only one counsel. In this regard, she further contended that the court should only allow a reasonable amount in respect of costs reasonably incurred by Mr Tan SC.[note: 20]She argued that the court should not allow the Applicant to recover the costs incurred by Ms Choo as the Applicant had not shown that the use of two solicitors was reasonable. 22     Fourth, and related to the point just mentioned, Ms Tan further argued that pursuant to the “two counsel rule” found in O 59 r 19(1) of the Rules of Court, the court had no discretion to take into consideration and/or award costs for the work done by Mr Quek and Mr Lim. In this regard, Ms Tan disagreed entirely with Mr Quek’s submissions concerning the “two counsel rule” (see [15]–[16] above). Ms Tan argued that the “two counsel rule” limited all Section 1 costs claims to the costs reasonably incurred by two actual counsel on the Applicant’s team of solicitors and counsel, and that as a result, the Applicant had to elect two named counsel for which it was claiming Section 1 costs. The reasons for her position (which shall be referred to in shorthand as the “headcount” approach) are as follows: (a)     A certificate for more than two solicitors will be granted if, and only if, the court is satisfied that the services of more counsel are reasonably necessary for the adequate presentation of the case, or that the case involves a high degree of complexity of facts and/or law, or where the trial is lengthy (citingColliers International (Singapore) Pte Ltd v Senkee Logistics Pte Ltd[2007] 2 SLR(R) 230 andRaffles Town Club Pte Ltd v Lim Eng Hock Peter and others (Tung Yu-Lien Margaret and others, third parties)[2011] 1 SLR 852).[note: 21]If a party chooses not to apply for a certificate for more than two solicitors, that party is simply not allowed to claim or recover costs incurred by a third, fourth or subsequent solicitor working on the case.[note: 22] (b)     As a matter of precedent, inLin Jian Wei, the Court of Appeal did not consider it appropriate to allow a party to recover costs beyond those of two solicitors in the absence of the requisite certificate, even though a team of six solicitors had worked on the case.[note: 23] (c)     On a plain reading of O 59 r 19 of the Rules of Court, it is clear that unless the court so certifies, a party will not be allowed to recover costs for getting up the case by and for attendance in court of more than two solicitors, even if the first two senior solicitors have delegated work to other junior solicitors.[note: 24]Furthermore, in view of the language “shall not” in O 59 r 19(1) of the Rules of Court, the court has no discretion to award costs for more than two counsel.[note: 25]This is because the express words of O 59 r 19(2) of the Rules of Court specifically provide that the restrictions in O 59 r 19(1) of the Rules of Court apply even where the solicitors are members of the same firm,[note: 26]and no distinction is made as to the seniority of the solicitors in question. Furthermore, the Rules Committee must have been alive to the distinction between junior and senior solicitors when it amended O 59 r 19 of the Rules of Court 1970. As such, it must be inferred that the rule was meant to preclude claims for costs of three or more solicitors, regardless of their seniority, even if there were junior solicitors who did some of the legwork for the two senior solicitors. This position was buttressed by the note dated 22 November 2006 issued by the Supreme Court on the Rules of Court (Amendment) Rules 2006. The note stated,inter alia, that prior to the Rules of Court (Amendment) Rules 2006, “the receiving party cannot include in his bill of costs, the costs (of attendance, getting up, etc) of another solicitor, even if two or more solicitors had attended court or done the work”, and that the 2006 amendments did not effect any substantial change to this practice. Taking the time costs of the third, fourth or subsequent solicitors into consideration would render O 59 r 19 of the Rules of Court nugatory. 23     On the costs for RA 6, Ms Tan submitted that as the Judge had declined to disturb the costs order below, Mr Quek could not rely on the quantum of costs ordered by the Assistant Registrar to justify seeking $6,000 to $8,000 in costs for RA 6. Ms Tan also pointed out that when Mr Uphoff came to Singapore, he produced some documents overnight, and was cross-examined on those documents. She argued that if Mr Uphoff had not come to Singapore, it was uncertain if he would have disclosed those documents. As the Judge had made no order in RA 6, this was equivalent to a dismissal of the appeal. As such, she submitted that the Applicant was entitled only to nominal costs for RA 6.",
        "Decision": "24     The taxation of party-and-party costs calls for a practical approach that takes into consideration a large range of factors, with proportionality as the ultimate touchstone (see [8]–[9] above). In my view, the issues canvassed in Suit 873 were relatively complex. While the trial took about 7.5 days, it must be kept in mind that time was required for grappling with technically complex issues outside the courtroom. The voluminous closing submissions and reply submissions tendered before the Judge, as well as the numerous authorities cited by the parties, further supported the view that the case was relatively complex. It should be noted that the Judge devoted 34 paragraphs (or about 10 pages) ofKoh Wee Mengto the evidence presented by the three independent experts in the suit. I therefore did not agree with Ms Tan that Suit 873 was “by no means complex”, or involved “only four straightforward issues”.[note: 27]A fortiori, this wasnota case in which the Applicant should be limited to recovering the costs for only one solicitor,[note: 28]particularly when the Respondent’s own team of solicitors and counsel comprised one eminent Senior Counsel and at least three other solicitors. 25     That said, the Applicant’s claim for $608,807.28 in Section 1 costs was disproportionate to the case and also excessive when assessed against the taxation precedents that were brought to my attention. As was observed inLin Jian Weiat [73], Section 1 costs in the region of $600,000 have only been allowed “when the matters typically involved highly specialised and/or novel points of law as well as the consideration of evidence from multiple factual and/or expert witnesses in lengthy hearings”. InLin Jian Wei, the Court of Appeal referred to Bill of Costs No 195 of 2006 (Suit No 609 of 2002,Trek Technology (Singapore) Pte Ltd v F E Global Electronics Pte Ltd) (“BC 195” and “Trek Technology” respectively) and Bill of Costs No 296 of 2004 (Suit No 149 of 2011,PT Bumi International Tankers v Man B&W Diesel S E Asia Pte Ltd) (“BC 296” and “PT Bumi” respectively) as examples of cases in which Section 1 costs were awarded in the region of $600,000. To elaborate: (a)     BC 195 concerned a consolidated suit which related to a specialised and technical area of patents and inventions, and was believed to be the “longest and most intensive patent litigation in Singapore”. The subject matter was complex, involving 40 pieces of alleged prior art and numerous novel issues of law. Counsel for the applicant in BC 195 had spent a total of 2,250 hours on the case, with about 300 hours accruing to Senior Counsel. The High Court eventually awarded $668,000 (before GST) as Section 1 costs. (b)     BC 296 involved a negligence claim that required highly technical expert evidence in relation to the malfunctioning of ship engines due to defective design and manufacture of component parts of an oil tanker. The trial lasted 28 days, and a total of 15 witnesses testified. The claim of $600,000 by the receiving party was not disputed by the paying party; in this regard, it should be noted that inLin Jian Wei, the Court of Appeal opined (at [73]) that the $600,000 bill in BC 296 was “rightly” not disputed, hence providing further confirmation that the amount claimed was proportionate and reasonable. 26     In my view, the Section 1 costs in Suit 873 should be lower than that awarded in BC 195 and BC 296. The issues inTrek Technologywere clearly far more novel and complex than those in Suit 873, while the trial inPT Bumiwas 3.5 times as long as the trial in Suit 873. As such, when juxtaposed against the precedents of BC 195 and BC 296, the Applicant’s claim for Section 1 costs exceeding $600,000 appeared excessive. 27     The taxation precedents cited by Mr Quek did not support the Applicant’s claim for Section 1 costs exceeding $600,000. (a)     First, Mr Quek cited Bill of Costs No 115 of 2014 (Originating Summons No 505 of 2010,Fong Wai Lyn Carolyn v Airtrust (Singapore) Pte Ltd and another) (“BC 115”). The claim in that case concerned an application for leave to commence an action on behalf of a company pursuant to s 216A of the Companies Act (Cap 50, 2006 Rev Ed). The matter was heard over seven days, and the applicant had instructed Senior Counsel. The applicant claimed that the time spent was about 750 hours, but that there were numerous urgent applications that had to be dealt with in the course of the matter (including,inter alia, applications for amarevainjunction and a search order). The claim amount had not been quantified, but allegedly went into the millions of dollars. The High Court awarded $300,000 (before GST) as Section 1 costs. (b)     Second, Mr Quek cited Bill of Costs No 32 of 2010 (Suit No 615 of 2007,RecordTV Pte Ltd v MediaCorp TV Singapore Pte Ltd and others) (“BC 32”). The claim in that case concerned groundless threats of legal proceedings pursuant to s 200 of the Copyright Act (Cap 63, 2006 Rev Ed) in respect of each alleged act of infringement in relation to each alleged broadcast and cinematograph film. The matter was heard over five days, and, for the purposes of the taxation, the applicant claimed that the total amount of time spent on getting up was about 1,441.5 hours, including the services of one Senior Counsel. In BC 32, the High Court awarded $230,000 (before GST) for Section 1 Costs. It should be noted that the 1.441.5 hours claimed in BC 32 was very similar to the alleged amount of time spent by counsel in Suit 873, which the Applicant quantified at about 1,400 hours (excluding interlocutory applications for which costs were fixed by the court). 28     It is evident that neither of these taxation precedents supported the Applicant’s claim for Section 1 costs exceeding $600,000; if anything, they buttressed the suggestion that the claim was excessive. 29     I pause here to address the arguments concerning the “two counsel rule”, which were canvassed at some length before me. Order 59 r 19 of the Rules of Court provides: 19. Costs for more than two solicitors (O. 59, r. 19) (1) Subject to paragraph (3), costs for getting up the case by and for attendance in Court of more than 2 solicitors for a party shall not be allowed unless the Court so certifies at the hearing or upon an application made by that party within one month from the date of the judgment or order. (2) Such costs may be allowed notwithstanding that the solicitors are members of the same firm of solicitors. (3) Notwithstanding paragraph (1), the Court must be satisfied at the taxation of costs that the use of 2 solicitors is reasonable, having regard to paragraph 1 of Appendix 1 to this Order. 30     There appears to be two possible approaches to the “two counsel rule”. The first approach is the “headcount” approach, proposed by Ms Tan (see [22] above). The second approach is the “notional” approach, alluded to by Mr Quek (see [15]–[16] above). Under the “notional” approach, the “two counsel rule” applies to a notional team of two counsel; in other words, the court may award costs for the work that would reasonably have been done by a notional two-man team. 31     I did not think that the authorities cited by Mr Quek (see [15(b)] above),ie Greenslade on CostsandST International, directly supported the adoption of a “notional” approach in the context of O 59 r 19 of the Rules of Court. Neither of the authorities dealt with a similar provision or addressed the issue of whether the court can consider the time spent by the third and fourth solicitors in a situation where there is no certificate for more than two counsel. 32     However, in the final analysis, I preferred the “notional” approach to the “headcount” approach, for the following reasons: (a)     First, it is trite the court may take the amount of time spent on a case into consideration when taxing a bill, although the time spent and actual costs incurred are not conclusive of the amount of costs to be awarded. While the assessment of costs is not an arithmetic exercise based on trial days or hours spent by counsel (seeLin Jian Weiat [71]), the time and effort invested by counsel is certainly a relevant factor. As such, in appropriate circumstances, even where there is no certificate for more than two counsel, there appears to be no reason in principle why the court cannot take into consideration the work done by the legal team as a whole. This would, at the very least, assist the court in formulating a fuller picture of the magnitude of the legal task at hand. The court is, of course, free to tax the bill downwards to reflect the absence of a certificate for more than two counsel, but this is altogether different from Ms Tan’s submission that the court cannot even take the time and effort of the third and fourth solicitors into consideration. (b)     Second, the “headcount” approach would lead to practical difficulties in some, if not many, cases. By way of a simple illustration, in a situation where four solicitors arrange to work, on a “half time” basis each, as part of a legal team to perform the tasks that would otherwise have proportionately and reasonably been done by a two-man team, it does not appear proportionate or fair to insist that the taxing court can only take into consideration the time spent by two of those four “half time” solicitors. The practical effect of a procrustean adherence to the “headcount” approach is that the “two counsel rule” would generally reward law practices that function in a particular manner (eg, with each solicitor, regardless of seniority, specialising full-time on a particular file), while prejudicing other styles of case and costs management (eg, deploying teams of solicitors of varying seniority to work cooperatively across different files). This does not seem to be an intended or desired effect of the “two counsel rule”. (c)     Third, the “notional” approach avoids the practical problems engendered by the “headcount” approach, and as such, appears to be more in line with the overarching principle of proportionality. It also better gives effect to the indemnity principle, which must, to paraphraseThen Khek Koonat [158], not only set a ceiling on the loser’s liability to pay costs, but also “aflooron the winner’s entitlement to recover costs” (emphasis added). If the work done by the legal team is, in totality, proportionate to the matter at hand, and may reasonably and realistically have been done by a notional two-man team, there seems to be no reason to limit the court to considering only the work done by two actual counsel and to disregard all other work done. (d)     Fourth, contrary to Ms Tan’s argument, adopting the “notional” approach does not render O 59 r 19(1) of the Rules of Court nugatory. As alluded to in the foregoing paragraph, the limitation in O 59 r 19(1) of the Rules of Court restricts the total amount of costs claimable to what would have been proportionately and reasonably incurred by a notional team of two counsel. A claiming party remains unable to claim for costs exceeding what would have proportionately and reasonably been incurred by a notional two-man team. 33     Returning to the present case, I am of the view that the time spent by Mr Quek and Mr Lim should be taken into consideration even in the absence of a certificate for more than two counsel. To put matters in perspective, the time spent by Mr Quek (approximately 443 hours) and Mr Lim (approximately 110 hours) amounted to about 40% of the total time spent by the Applicant’s team of solicitors and counsel. If these hours could not be considered, this would mean that only 847 hours of work could be taken into consideration for what was effectively 2.5 years of legal proceedings in a relatively complex suit. Such a drastic reduction in the hours taken into consideration seemed neither proportionate nor reasonable in the circumstances of the present case. 34     I must emphasise that this was not a case where the Applicant was trying to claim for the costs of a notional three- or four-man team. It was also unlike the case inLin Jian Weiwhere “few legal stones were left unturned… [and] several stones were repeatedly turned over by different members of the team of six solicitors and counsel” (seeLin Jian Weiat [80]). Taking into consideration the circumstances of the present case, it cannot be said that the total amount of hours claimed would have been entirely disproportionate to the case. Neither could it be said that the amount of time spent was unreasonable or unrealistic for a notional team of two counsel. As such, I saw no reason to disregard out of hand the time spent by Mr Quek and Mr Lim. 35     Having considered all the factors in paragraph 1 of Appendix 1 to O 59 of the Rules of Court, the precise circumstances of the case, taxation precedents, as well as the overarching principle of proportionality, I taxed the Section 1 costs, on a standard basis, at $320,000 (before GST). For completeness, this amount included the costs awarded to the Applicant for RA 6. In this regard, I did not agree with Ms Tan that the Judge had intended the costs for RA 6 to be limited to nominal costs as the Judge did not actually so order. On the other hand, I had to take into consideration the circumstances of the appeal, that the Judge had made no order on the appeal, as well as the fact that the Judge had expressly declined to set aside the costs ordered by the Assistant Registrar. I therefore fixed the costs for RA 6 at $3,000, all inclusive.",
        "Section 3 Costs": "36     At the hearing on 22 January 2015, the Applicant tendered a revised table of disbursements to correct some minor errors. There were 119 items of disbursements claimed in all, amounting to a total of $6,190.60 (for disbursements on which no GST is chargeable) and $274,177.07 (on which GST is chargeable, amounting to $19,192.39), resulting in a total of $299,560.06 (inclusive of GST). The Respondent did not contest the disbursements relating to court fees, document filing fees, photocopying and binding charges, and transcription charges. However, the Respondent took issue with all other disbursements, claiming that these were either unreasonable, or have not been sufficiently proven by the Applicant. 37     Without going into the minutiae of the 34 disputed items, I will address the items which, in my view, were either unreasonably incurred or lacked the necessary supporting evidence: (a)     First, the attendance of Mr Uphoff and Mr Marshall at the inspection in February 2012 did not appear to be necessary. Mr Uphoff and Mr Marshall were not acting as expert witnesses, and indeed, at the time of the inspection, Mr Uphoff was not even a factual witness. I therefore did not grant the $12,921.84 claimed for the accommodation and air fare incurred for this inspection. (b)     Second, the Applicant’s expert Mr Matawa came to Singapore four days in advance for the first tranche of trial, and stayed all the way to the end of the first tranche of trial despite the fact that on the second day of trial, it was decided that his evidence would only be given at the second tranche of trial. This was an “overstaying” of about nine days. For the second tranche of trial, Mr Matawa again came five days in advance. While the Applicant might have preferred having his expert with him, I did not think that it was reasonable to visit these costs upon the Respondent. As such, I taxed off $5,000 from the travelling expenses claimed on behalf of Mr Matawa. (c)     Third, for the meeting with Mr Matawa in Germany, it did not seem reasonable for the Applicant to fly two senior solicitors to Germany for the meeting. No good reasons were given as to why it would not have been sufficient to fly only one of the two solicitors, or for the meeting to take place via video- or tele-conference. I therefore allowed the costs of only one solicitor’s travel to Germany and taxed off $8,727.02 from the travelling expenses claimed under this head. (d)     Fourth, the inspection of the Rolls-Royce vehicles in Goodwood concerned the “subjective test” conducted by Mr Matawa. No convincing reason was given as to why the Applicant’s solicitor had to attend such an inspection, or why the solicitors could not be briefed on the same by way of video- or tele-conference. While it may be the Applicant’s preference for a solicitor to attend the inspection, I did not think that these costs should be foisted upon the Respondent. As such, I taxed off $9,403.51 from the travelling expenses claimed under this head. (e)     Fifth, I agreed with the Respondent that the Applicant’s experts’ fees, which amounted to about $167,079, were somewhat excessive. As such, I taxed off 20% of the said fees (ie$33,415.80). 38     There were also items relating to miscellaneous travel expenses (amounting to $701.03) and translation charges (amounting to $1,150) that were not supported by any documentary evidence. On the authority ofOng Jane Rebecca v Lim Lie Hoa[2008] 3 SLR(R) 189 (see, in particular, at [11]), I disallowed the disbursements claimed for these items. 39     After the deductions, the total amount of disbursements amounted to $223,248.52 (with GST on items for which GST is chargeable). While this appeared to be a relatively large amount for disbursements, it may be attributed to the unique circumstances of the case which required, on the side of the Applicant, the services and presence of two expert witnesses (one of whom was not based in Singapore) and two factual witnesses (both of whom were not based in Singapore), as well as inspections of vehicles both in Singapore and the UK.",
        "Section 2 Costs": "40     On Section 2 costs, Mr Quek submitted that costs of the taxation should be more than in usual cases in view of the heavily contested proceedings, and submitted that costs of $5,000 should be awarded. Ms Tan disagreed and submitted that the Applicant should be entitled to costs of $500 instead. 41     I fixed Section 2 costs at $2,000, taking into consideration the fact that Mr Quek’s further submissions on the “two counsel rule” issue were relatively brief, as well as the fact that many of the issues arising with regard to Section 3 costs were necessitated by the Applicant having provided insufficient documentation for its claim at the outset.",
        "Conclusion": "42     In summary, I taxed the Bill as follows: (a)     Section 1: $320,000 (before GST); (b)     Section 2: $2,000 (before GST); and (c)     Section 3: $223,248.52 (with GST on items for which GST is chargeable). 43     As a parenthetical closing observation, this case was an example of the process of taxation becoming a source of satellite litigation between the parties, with opposing sides inclined to either inflate or deflate (as the case may be) the amount of costs that they claim would be proportionate and reasonable to the case. As observed by Menon CJ in his Honour’s response at the Opening of the Legal Year 2014, there is a “tendency for successful parties to inflate their cost claims even as losing parties object vehemently to sums that they themselves might not have hesitated to claim had the shoe been on the other foot”. The Supreme Court has recently introduced initiatives to address some of these issues. The costs scheduling mechanism requires parties to “set out with sufficient particularity”, prior to knowing the outcome of a case, “the quantum of party-and-party costs and disbursements that the party intends to claim in the event that the party succeeds” (see paragraph 99A(2) of the Supreme Court Practice Directions). The costs budgeting scheme, which is currently in its pilot phase, promises to further reduce the amount of time and effort expended inex postdisputes about the proportionality and reasonableness of costs claimed.  [note: 1]Applicant’s Submissions dated 30 Dec 2014, paras 14–21 [note: 2]Applicant’s Submissions dated 30 December 2014 at para 25 [note: 3]Applicant’s Submissions dated 30 December 2014 at para 25 [note: 4]Applicant’s Submissions dated 30 December 2014 at para 25 [note: 5]Applicant’s Submissions dated 30 December 2014 at para 25 [note: 6]Applicant’s Submissions dated 30 December 2014 at para 29 [note: 7]Applicant’s Submissions dated 30 December 2014 at para 30 [note: 8]Detailed Bill of Costs dated 3 December 2014 at p 29 s/no 8.4; Applicant’s Further Submissions dated 5 Feb 2015, para 3(d) [note: 9]Applicant’s Further Submissions dated 5 Feb 2015, para 3(e) [note: 10]Applicant’s Submissions dated 30 December 2014 at para 33 [note: 11]Applicant’s Further Submissions dated 5 Feb 2015, para 3(c) [note: 12]Applicant’s Further Submissions dated 5 Feb 2015, para 3(g) [note: 13]Applicant’s Submissions dated 30 Dec 2014, para 9 [note: 14]Applicant’s Further Submissions dated 5 Feb 2015, para 3(a) [note: 15]Applicant’s Further Submissions dated 5 Feb 2015, para 3(h) [note: 16]Applicant’s Further Submissions dated 5 Feb 2015, para 3(f) [note: 17]Respondent’s Submissions dated 19 January 2015 at para 1(c) [note: 18]Respondent’s Submissions dated 19 January 2015 at para 23 [note: 19]Respondent’s Submissions dated 19 January 2015 at para 1(a) [note: 20]Respondent’s Submissions dated 19 January 2015 at para 18(a) [note: 21]Respondent’s Further Submissions dated 5 Feb 2015, para 14 [note: 22]Respondent’s Further Submissions dated 5 Feb 2015, para 15 [note: 23]Respondent’s Further Submissions dated 5 Feb 2015, para 12 [note: 24]Respondent’s Further Submissions dated 5 Feb 2015, para 6 [note: 25]Respondent’s Further Submissions dated 5 Feb 2015, para 18(c) [note: 26]Respondent’s Further Submissions dated 5 Feb 2015, paras 6(a)–(b) [note: 27]Respondent’s Further Submissions dated 5 Feb 2015, para 18(b) [note: 28]Respondent’s Further Submissions dated 5 Feb 2015, para 18(b)"
    }
}