{
    "case_title": "Yong Vui Kong\n      v\n      Attorney-General",
    "ncitation": "[2015] SGHC 178",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       The plaintiff, Yong Vui Kong (“Yong”), is currently serving a sentence of life imprisonment imposed by the High Court in Criminal Motion No 56 of 2013 pursuant to s 33B(1)(a) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”) on 14 November 2013. The sentence of life imprisonment took effect from 14 June 2007. The High Court also imposed caning of 15 strokes of the cane on Yong as mandated by s 33(B)(1)(a) of the MDA. Yong then appealed against the sentence of caning in Criminal Appeal No 11 of 2013. On 4 March 2015, the Court of Appeal dismissed his appeal (seeYong Vui Kong v Public Prosecutor[2015] 2 SLR 1129). 2       On 13 March 2015, Yong filed the present Originating Summons (“the OS”) to seek leave to proceed with an application for a prohibiting order and two declarations in relation to the caning. 3       On 14 April 2015, the Attorney-General (“the AG”), who was the defendant in the OS, filed Summons No 1788 of 2015 (“Summons 1788”) to strike out the OS. 4       On the same day,ie, 14 April 2015, Yong filed Summons No 1789 of 2015 (“Summons 1789”) to amend the OS. 5       On 20 May 2015, I heard both summonses. By then, various affidavits had been filed, including an affidavit by Ms L.F. Violet Netto, counsel for Yong (“Ms Netto”), and an affidavit by one Lai Yew Thiam (“Mr Lai”). These two affidavits were filed on 15 and 19 May 2015 respectively, long after the deadline of 6 May 2015 imposed by an assistant registrar. 6       At the hearing on 20 May 2015, Ms Netto orally applied to admit these two affidavits. After hearing arguments, I dismissed her application to admit these two affidavits. I also dismissed Yong’s application to amend the OS and I granted the AG’s application to strike out the OS. I ordered Ms Netto to personally pay the AG’s disbursements of both the summonses fixed at $1,514 and the AG’s costs of Summons 1788 fixed at $1,000. I declined to order her to pay the AG’s costs for Summons 1789. I set out below the reasons for my various decisions.",
        "The court’s reasons": "7       In Criminal Appeal No 11 of 2013, Yong was at all material times represented by Mr M Ravi, who was from the law firm M/s L F Violet Netto,ie, the same firm which Ms Netto was practising under. However, Mr Ravi was suspended from practice at the time the Court of Appeal delivered its judgment on 4 March 2015. 8       At all material times, Yong was represented by Ms Netto for the OS and Summonses 1788 and 1789. 9       Although the OS sought an order to prohibit the Commissioner of Prisons (“COP”), wrongly described in the OS as the Director of Prisons, from executing the sentence of caning imposed on Yong, the main relief which the OS sought was a declaration that Yong had been subject to unequal treatment before the law on grounds of nationality, which violates Art 12 of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (“the Constitution”). The alleged reason for this claim was that an Indian national, one Shankar Aiyar, who had been in the custody of the Singapore Prison Service (“SPS”), had been allowed to escape caning when that prisoner’s private orthopaedic practitioner gave evidence that he was unfit for caning. However, the request to have Yong’s own medical practitioner to ascertain his fitness for caning was rejected by the SPS. 10     As mentioned above, the High Court imposed the sentence of caning on Yong on 14 November 2013. 11     On 22 November 2013, Mr Ravi wrote to the Director of Prison, Tanah Merah Prison, to say that his law firm was in the midst of arranging a specialist doctor to independently ascertain Yong’s fitness for caning. 12     On 18 December 2013, SPS replied to say that any medical assessment of an inmate’s fitness for caning would be conducted by the Prison Medical Officer. Therefore, SPS did not approve the request for Yong’s own medical practitioner to ascertain Yong’s fitness for caning. This standard prison protocol applied to all other inmates sentenced to caning as well. SPS also said that the caning sentence would not be carried out pending the outcome of Yong’s appeal against the caning sentence. 13     As mentioned above, Yong’s appeal on the caning sentence was dismissed by the Court of Appeal on 4 March 2015. Six days later, on 10 March 2015, SPS received by email a copy of a letter signed off under the name of “M. Ravi”. On 11 March 2015, SPS received the original copy of the 10 March letter together with the original copy of another letter this time dated 11 March 2015 signed off under Ms Netto’s name. The contents of both letters were identical (except for an inadvertent and immaterial omission of a word in the second letter). The thrust of both letters was to allege unequal treatment against Yong on grounds of nationality as an Indian national Shankar Aiyar was allowed to escape caning when his private orthopaedic practitioner gave evidence that he was unfit for caning. A photocopy of a newspaper article from the Straits Times issue of 4 September 2004 was attached as alleged evidence of the allegation concerning Mr Aiyar. The letters gave notice that M/s L F Violet Netto would be filing a judicial review application in relation to the unequal treatment. 14     On 12 March 2015, the Attorney-General’s Chambers (“AGC”) replied to Ms Netto’s letter of 11 March 2015. AGC informed her that the prisoner she was referring to was never permitted to be seen by his own medical practitioner when he was in the custody of SPS and that a prisoner’s fitness to be caned can only be determined by a medical officer appointed by the COP pursuant to s 25 of the Prisons Act (Cap 247, 2000 Rev Ed) (“Prisons Act”). AGC also informed her that they would consider any application for leave to apply for judicial review to be vexatious and that they would make the necessary applications which may include an application for an order under O 59 r 8 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“Rules of Court”) in respect of any solicitor who files such an application. 15     On 13 March 2015, Ms Netto filed the OS on the basis that Yong was being subject to unequal treatment because he was denied his own private medical practitioner to ascertain his fitness for caning. 16     On 26 March 2015, parties to the OS attended a pre-trial conference (“PTC”) before a senior assistant registrar (“SAR”). Ms Netto indicated that she wished to apply for leave to amend the OS. The SAR gave various directions, including a direction that she was to file and serve the application to amend by 13 April 2015. 17     This was not done by the deadline given. Accordingly, the AG filed Summons 1788 on the next day,ie, 14 April 2015, to strike out the OS. On that same day, Ms Netto filed Summons 1789 to amend the OS with a supporting affidavit from her. Subsequently, about a month later, Ms Netto filed another affidavit from herself on 15 May 2015. This affidavit was filed just before the hearing date of the OS on 18 May 2015. That hearing date was adjourned to 20 May 2015 as Ms Netto was unwell on 18 May 2015. On 19 May 2015, Ms Netto filed an affidavit of Mr Lai. 18     When counsel appeared before me on 20 May 2015, I asked Ms Netto how many affidavits had been filed for the application to amend and how many were filed out of time. In fact, the application to amend the OS and her first supporting affidavit filed on 14 March 2015 were both already filed out of time, although by one day only. The other two affidavits,ie, her affidavit filed on 15 May 2015 and Mr Lai’s affidavit filed on 19 May 2015, were filed out of time by a larger margin. 19     Ms Netto orally asked for leave to admit the last two affidavits only, although she should also have asked for leave to file Summons 1789 and her first affidavit out of time as well. 20     After hearing arguments from both sides, it was clear to me that the last two affidavits did not help Yong’s application to amend the OS as Yong’s application to amend was itself made on an invalid premise. Hence, I dismissed the oral application to admit the two affidavits. I also dismissed the application to amend. 21     The application to amend the OS filed on 14 April 2015 sought to delete the original prayer and grounds relied on in the OS for a declaration, and to introduce additional grounds to seek a prohibiting order against the COP from executing the sentence of caning. The application sought to introduce new grounds to support a prohibiting order. The grounds included the absence of rules spelling out exactly how the caning is to be administered and the refusal of the COP to disclose a protocol on which he relies on to execute the caning. It was alleged that these grounds were in breach of Art 9 of the Constitution. 22     Ms Netto’s affidavit filed on 15 May 2015 introduced yet another new draft of the OS to be amended. In this new draft, Yong was seeking: (a)     a prohibiting order to restrain the COP from exceeding his statutory power of executing the sentence of caning by inflicting torture on Yong; (b)     a mandatory order requiring the COP to produce to the court internal Standing Orders and Standard Operating Procedures (collectively called “the Orders”) whereby judicial caning is regulated; (c)     a prohibiting order to restrain the COP from executing the caning until the Orders were produced and examined by the court; (d)     permission to submit an affidavit whereby it could be established that the COP had exercised his discretion in an unlawful manner; and (e)     a stay of execution of the caning pending the outcome of his application in the OS. 23     Ms Netto did not give any good reason why the last two affidavits were filed so late. More importantly, the contents of the last two affidavits as well as her first supporting affidavit for the application to amend the OS and the intended amendments themselves did not have a valid legal basis. 24     The crux of the latest draft OS (as introduced in Ms Netto’s 15 March 2015 affidavit) was to seek a mandatory order to compel the COP to produce the Orders. 25     The Orders were already mentioned and raised before the Court of Appeal in the hearing of Yong’s appeal against the High Court’s sentence of caning. Yong’s solicitors had written to ask for a copy of any rules and directions made under s 329(1) and s 329(2) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”). Eventually, AGC responded on 8 September 2014 to say that no rules had been made under s 329(1) and (2) of the CPC, although SPS has the Orders. AGC contended that the Orders should not be produced as they concern matters which were undisputed in the proceedings and pertain to operational matters with security implications. 26     Yong’s solicitors then wrote on 9 September 2014 to the Registrar of the Supreme Court, and stated in para 15 of their letter: 15.    It is for the Court to decide whether to seek production to the Court of the [Orders] (if necessary with suitable redactions for matters irrelevant to this appeal to protect identities. The Appellant’s duty in this matter is merely to assist the Court with the considerations that the Court may wish or would be entitled to weigh when considering whether production is in the interest of the administration of justice. 27     Thereafter, the Registrar wrote on 10 September 2014 to the parties to state that if the AG does not disclose the Orders, the Court of Appeal would proceed to assess the position on the basis that there are no such Orders. Alternatively, the AG could furnish a redacted version to exclude the parts which posed a security risk. 28     On 15 September 2014, AGC replied to say that the AG had consulted the Ministry of Home Affairs and both were of the view that it would not be in the public interest for the Orders to be disclosed. 29     Thereafter, the appeal proceeded on the basis that there were no such Orders and, after considering all submissions, the Court of Appeal eventually dismissed Yong’s appeal. 30     Ms Netto argued that the principle ofres judicatadid not apply. I was of the view that Yong was clearly precluded from seeking the production of the Orders under the principle ofres judicataor abuse of process. 31     First, the Court of Appeal was clearly faced with the question whether to order the production of the Orders. It decided not to do so. In my view, that decision constitutedres judicatain the sense of issue estoppel, for which the requirements are set out inLee Tat Development Pte Ltd v Management Corporation of Strata Title Plan 301[2005] 3 SLR(R) 157 at [14]–[15], and expounded inGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453. 32     Alternatively, even if issue estoppel does not apply to criminal cases (for which see Lord Diplock’s observation inHunter v Chief Constable of the West Midlands Police and others[1982] AC 529 (“Hunter”) at p 541A), or even if it could be said that Yong’s solicitors did not actually argue for the Orders to be produced and therefore there was nores judicatain the strict sense, this would still beres judicatain the wider sense as expounded by Sir James Wigram V-C inHenderson v Henderson(1843) 3 Hare 100 at 114–115. I add that Sir James Wigram V-C’s exposition has been considered to be about the principle of abuse of process rather thanres judicata(for example, see the judgment of Lord Bingham of Cornhill inJohnson v Gore Wood & Co (a firm)[2002] 2 AC 1). 33     In the present case, Yong’s solicitors were aware of the Orders and if they chose not to press for the production of the Orders when they could have done so, then they could not have a second bite at the cherry by subsequently commencing a fresh civil action to seek leave to apply for an order to compel the production of the Orders. In my view, the OS amounted to a collateral attack on the decision of the Court of Appeal when Yong had every chance to pursue the question of the production of the Orders (see alsoHunterat 541 B). 34     As for the affidavit of Mr Lai, his affidavit sought to elaborate on how a sentence of caning was executed on him. His main purpose was to demonstrate that caning, as executed by SPS, was a form of torture. However, again, this was a matter which was either already brought before the Court of Appeal or which should have been brought before the Court of Appeal. InYong Vui Kong v Public Prosecutor[2015] 2 SLR 1129 at [99], the Court of Appeal had considered Yong’s account of caning based on media and public reports and accounts, but did not think that the mode of caning that was said to be adopted by SPS constituted torture. 35     I should mention that the AG had sought leave to file and serve an affidavit to show that the substance of Mr Lai’s allegations on what judicial caning entails was already part of Yong’s allegations about caning before the Court of Appeal. However, I was of the view that it was unnecessary for yet another affidavit to be filed. The issue as to how judicial caning is executed was already placed squarely before the Court of Appeal. It was not for the High Court exercising its civil jurisdiction to consider allegations about how judicial caning is executed with a view to stopping the caning when Yong’s appeal against caning had been dismissed. 36     If, for the sake of argument, Mr Lai’s affidavit did contain new and material evidence which was not already included in Yong’s account of caning before the Court of Appeal, then Yong’s remedy lay elsewhere. 37     In the circumstances, Summons 1789 to amend the OS was doomed to fail and the two latest affidavits did not make a cause which was clearly invalid an arguable one. 38     Coming back to the crux of the latest draft OS (as introduced in Ms Netto’s 15 March 2015 affidavit), Ms Netto as counsel for Yong must have known that it was obviously too late to try and compel the production of the Orders. Yet, she decided to do so. 39     As for the OS itself as it originally stood, Ms Netto’s conduct was egregious. The point as to whether Yong was entitled to seek the opinion of a private medical practitioner on his fitness for caning was already raised as early as 22 November 2013 (see [11] above). On 18 December 2013, SPS had replied to say that any medical assessment would be conducted by its medical officer. 40     When Yong’s solicitors later relied on a Straits Times article to claim unequal treatment on the ground of nationality, even after the decision of the Court of Appeal, it is important to note that the article did not explicitly say what they were alleging it did. The relevant portions of the article stated: “[The lawyer for the other prisoner] told the court that both Singapore General Hospital specialists and a Prisons Department medical officer had concluded that [the other prisoner] was unfit for caning. He also said that in January, he had petitioned the President for clemency. The reply, from the President’s principal private secretary, was that there was ‘no need to consider a clemency petition’ as the prison’s medical officer had found [the other prisoner] unfit for caning.” 41     Therefore, there was no reference to a private medical practitioner examining the other prisoner. Also, the reference to the response from the President’s principal private secretary mentioned that it was the SPS medical officer, and not a private medical practitioner, who had found the other prisoner unfit for caning. Also, and importantly, there was no mention that the other prisoner was spared caning or allowed access to his private medical practitioner because of his nationality. The argument based on nationality appeared to be a point which was dreamed up. Furthermore, as mentioned above at [14], AGC had replied on 12 March 2015 to Yong’s solicitors to point out that the prisoner they were referring to was never permitted to be seen by his own medical practitioner and that a prisoner’s fitness to be caned can only be determined by a medical officer appointed by the COP pursuant to s 25 of the Prisons Act. Ms Netto did not deny receiving the AGC’s reply that day. However, the OS was filed the next day on 13 March 2015. 42     Ms Netto suggested that she had filed the OS because there was some confusion over the judgment of the Court of Appeal. However, the judgment of the Court of Appeal did not touch on the question of examination by Yong’s own medical practitioner. So the judgment could not have caused confusion on this point. 43     Ms Netto also mentioned that Mr Ravi was recently suspended from practice, but that was not the point. She did not say that she needed more time to check the basis for alleging unequal treatment. Indeed, one would have assumed that her firm would already have checked the facts before making the allegation, whether it was Mr Ravi or her who was in charge of the case at the material time. 44     There was no explanation from Ms Netto as to the following matters: (a)     When she first knew about the Straits Times article – was it since the letter dated 22 November 2013 or just before the letters dated 10 and 11 March 2015? (b)     What steps Mr Ravi or she had taken to check whether the other prisoner was indeed certified by his own medical practitioner to be unfit for caning and whether SPS acted on that certification when there was no such allegation in the Straits Times article. (c)     Why her firm had asserted that there was discrimination on the ground of nationality when the Straits Times article did not suggest that the other prisoner was being treated differently because of his nationality. (d)     Why the OS was filed so quickly after AGC’s reply of 12 March 2015 and how it was that soon after the filing of the OS, she had concluded that she needed to amend the OS to the extent that the allegation about unequal treatment on the ground of nationality would be completely dropped. 45     In the circumstances, the inference was that Ms Netto was determined to go ahead and file the OS as a holding action in an attempt to stay the execution of the caning whatever the response from AGC was and regardless of whether she had any fact to support the allegation of unequal treatment. She was determined to do so notwithstanding AGC’s warning reference to O 59 r 8 of the Rules of Court under which the AG might seek costs against the solicitor who still decided to file the OS if indeed there was no valid basis to claim unequal treatment. 46     As mentioned above, it was only at a PTC on 26 March 2015, some 13 days later, that Ms Netto intimated that she was intending to file an application to amend the OS. The SAR directed that she file and serve any application to amend the OS by 13 April 2015. She missed the deadline. 47     Although one might think that Ms Netto was late by one day only, that was not the point. No explanation was given by her as to why she could not meet the deadline. Neither was there any explanation from her as to why she did not give AGC notice that she would be filing the amendment application one day late. It appeared that she had taken things for granted. 48     As it was, AGC, having waited to see if she would comply with the deadline, and in the absence of any notice from her that she would file it one day late, were justified in filing the application to strike out the OS on 14 April 2015. 49     Thus, when Ms Netto filed Yong’s application to amend on 14 April 2015, it was too late because AGC had already incurred costs and disbursements in filing the application to strike out. 50     Ms Netto did not dispute that she could be liable to pay costs and disbursements under O 59 r 8(1)(c). She however argued that she should not be liable. That provision states: 8.—(1) Subject to this Rule, where it appears to the Court that costs have been incurred unreasonably or improperly in any proceedings or have been wasted by failure to conduct proceedings with reasonable competence and expedition, the Court may make against any solicitor whom it considers to be responsible (whether personally or through an employee or agent) an order — … (c) directing the solicitor personally to indemnify such other parties against costs payable by them. … 51     I would also mention O 59 r 8(4) for completeness. This provision states: (4) The Court may, if it thinks fit, direct or authorise the Attorney-General to attend and take part in any proceedings or inquiry under this Rule, and may make such order as it thinks fit as to the payment of his costs. 52     In the circumstances, I ordered Ms Netto to pay the AG’s disbursements arising from Summonses 1788 and 1789, and the AG’s costs for Summons 1788. I did consider whether to order her to pay the AG’s costs for Summons 1789 as well, but I decided not to do so as a matter of indulgence since her conduct in respect of Summons 1789 was less egregious than her conduct in respect of Summons 1788, and this was the first time that I was making an order for costs or disbursements against her. For Summons 1788: (a)     she had been informed why the allegation of unequal treatment was untenable; (b)     she had been warned about her possible exposure to a costs order; and (c)     she also had had the opportunity to file the application to amend the OS before Summons 1788 was filed. 53     I was mindful that a court should be slow to award costs against a lawyer personally, and that lawyers are expected to proceed fearlessly to advance the interests of their clients. However, on the other hand, that does not mean that lawyers may do whatever they like or advance an untenable claim when they know it is untenable. There are consequences when a claim is made. The defendant incurs costs to defend against the claim or to strike it out. As a general rule, someone should pay the defendant’s costs when the defendant succeeds. Where a lawyer has acted knowing that there is no valid basis for his action, the lawyer takes the risk of being made personally liable for costs. It is not always a good answer to say that the lawyer was merely acting on instructions when the lawyer knows or must know that the claim is untenable. 54     This is not to say that a lawyer should be made personally liable for costs each time a claim is struck out or is dismissed. All the facts have to be considered. When the lawyer’s conduct is egregious, he may be personally liable for the costs and/or disbursements of the other side. Even if his conduct was not egregious, but was negligent, he may still be personally liable. For example, if a lawyer omits to obtain leave of court to proceed with a certain action when he ought to know that such leave is necessary, he may be personally liable for costs and/or disbursements of the other side if the action is dismissed for want of leave. This is not just a question of whether to punish the lawyer for his conduct, but rather, a question of who should bear the consequences of his conduct. The other side would be entitled to claim costs, and if such costs are allowed, the question then would be whether, as between the lawyer and his client, who should be liable for the costs. If the omission was due to the lawyer’s own negligence, then there is much in favour of the view that he should be personally liable, and not his client. 55     On the facts before me, Ms Netto did not suggest that it was Yong who insisted on proceeding with the OS or with an application to amend. She said she was acting on a general mandate from Yong given previously. It appeared that Yong would not know whether there was a tenable basis to assert unequal treatment or to apply to amend the OS. Also, it was for Ms Netto to ensure that she met the deadline from the SAR to file the application to amend, or to give notice to the AGC that she would be one day late, and also to ensure that the alternative ground or grounds she was relying on in the application to amend were tenable."
    }
}