{
    "case_title": "Humpuss Sea Transport Pte Ltd (in compulsory liquidation)\n      v\n      PT Humpuss Intermoda Transportasi TBK and another",
    "ncitation": "[2015] SGHC 144",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       Almost 30 years ago, Chan Sek Keong JC (as he then was), delivered a decision inOng & Co Pte Ltd v Chow YL Carl[1987] SLR(R) 281 (“Ong & Co”) in which he held that “the service of the notice of the writ by means of a court process server employed by a solicitors’ firm in Kuala Lumpur was not an authorised method of service under the 1970 Rules [ie, the Rules of the Supreme Court 1970 (S 274/1970) (“the 1970 Rules”)].” In so finding, Chan JC observed that the “service of a writ is an exercise of judicial power” and that “the judicial power of one State cannot be extended or exercised in another independent State except with the consent of that State.” He went on to rule that service of the notice of the writ could only be validly carried out either through the government of that country or through the Singapore consular authority in that country under O 11 r 6(2) and, additionally in the case of Malaysia or Brunei, through the judicial authority in the area where the defendant is resident under O 11 r 5(8). Any other mode of service would not be in compliance with the 1970 Rules and was hence a nullity which could not be cured. 2       The decision inOng & Cocreated practical difficulties in the service of process on defendants out of jurisdiction. This led a young lawyer, Sundaresh Menon, to pen a bold critique ofOng & Cowhich was published in the Singapore Academy of Law Journal (see Sundaresh Menon, “Effecting Service of Process Out of the Jurisdiction” (1990) 2 SAcLJ 111 (“Ong & Co case note”)). He raised a number of interesting points which were not specifically argued inOng & Co. In particular, he stressed that although it was “undoubtedly correct” that the service of a writ is an exercise of judicial power, an important distinction should have been drawn between a writ which is a command to the defendant and anotice of a writwhich is simply a notification to the defendant that an action had been commenced against him. InOng & Co, as only the notice of the writ was served and not the writ itself, the sovereignty concerns highlighted by Chan JC were not engaged. The author expressed the hope that the High Court would revisit its decision should an opportunity arise in light of arguments and authorities which were not raised in that case. 3       In 1991, about a year after the publication of the article, a number of amendments were introduced to the 1970 Rules. Two should be singled out for brief mention. First, O 11 r 6(2)(c) (now O 11 r 4(2)(c) of the Rules of Court (Cap 332, R 5, 2014 Rev Ed)) (“2014 Rules” or simply “our Rules”) was introduced to provide that service of process may also be effected by a method of service authorised by the law of that country for service of any originating process issued by that country. Therefore, the same manner of service effected inOng & Cowould be valid under the post-1991 amendments given that it was common ground in that case that serviceviathe agency of foreign solicitors was permitted by the rules of procedure applicable in Malaysia. Second, our form of writ (which until 1991 was issued as a command in the name of the President of Singapore) was amended to delete the reference to the President and restructured as a notification to the defendant of the commencement of an action against him instead of being framed as a command. Thereafter, the writ itself, and not just the notice of the writ, would be served out of jurisdiction. 4       The amendments to O 11 did not specifically address the correctness of the court’s nullity finding inOng & Co. It was, however, questioned recently in two High Court decisions. InITC Global Holdings Pte Ltd (in Liquidation) v ITC Ltd and others[2011] SGHC 150 (“ITC 2011”), Lee Seiu Kin J observed that “the currency of this view has diminished over time” and consequentlyOng & Cois “no longer authoritative” for the point that improper service out of jurisdiction is a nullity. He held that improper service would constitute a mere irregularity which is capable of cure. This view was endorsed inSRS Commerce Ltd and another v Yuji Imabeppu and others[2015] 1 SLR 1 (“SRS Commerce”). 5       Despite the development of the law in this area over the last 30 years, O 11 continues to vex lawyers. The central question in this application is this: how many methods of service does O 11 of our Rules provide for? Even this deceptively simple question has given rise to a fundamental disagreement over the basic structure of the statutory scheme. The plaintiff argued that O 11 provided forsixmethods of service, which may be found in rr 3 and 4. By contrast, the defendant contended that there were onlythreemethods of service, which may be found exclusively in r 4(2). In order to determine the dispute before me, I believe a closer examination of the legislative history of O 11 is essential. I begin first with the facts.",
        "Facts": "6       The plaintiff and the defendants are part of the “Humpuss” group of companies whose business interests range from shipping services to asset management.[note: 1]The plaintiff was incorporated in Singapore and it owns several oil products tankers in addition to being the majority shareholder in a number of marine companies.[note: 2]On 20 January 2012, the plaintiff was ordered to be placed in compulsory liquidation.[note: 3]Both defendants were incorporated in Indonesia. 7       On 18 August 2014, the plaintiff, through the liquidator, commenced Suit No 896 of 2014 against the first and second defendants, seeking repayment of $110m in loans owed and a declaration that several transactions entered into between the plaintiff and the second defendant in 2009 be set aside for being transactions at an undervalue.[note: 4]On 18 September 2014, the plaintiff obtained leave to serve its writ of summons and statement of claim on the defendants at their registered address in Indonesia.[note: 5] 8       On 2 October 2014, Kristian Takasdo, a Junior Associate with Budijaja & Associates, a firm of solicitors practising in the Republic of Indonesia, effected service of the original as well as translated copies of (a) the writ of summons; (b) the statement of claim; and (c) the order of court granting leave to effect service out of jurisdiction (collectively, “the Court Documents”).[note: 6]Mr Takasdo effected service on both defendants by (a) personally serving the Court Documents at the respective defendants’ registered addresses;[note: 7]and (b) by arranging for copies of the same to be sent to them by way of courier service.[note: 8]The defendants do not dispute that they have received the Court Documents.[note: 9] 9       On 23 October 2014, M/s Drew & Napier LLC entered an appearance on behalf of both defendants.[note: 10]On 6 November 2014, the defendants filed Summons No 5543 of 2014, seeking a declaration that the Court Documents had not been duly served on them.[note: 11]",
        "The parties’ arguments": "10     I will first set out the relevant provisions of O 11 rr 3 and 4 for ease of reference: Service of originating process abroad: Alternative modes (O. 11, r. 3) 3.—(1) Subject to paragraphs (2) to (8), Order 10, Rule 1 and Order 62, Rule 5 shall apply in relation to the service of an originating process out of Singapore. (2) Nothing in this Rule or in any order or direction of the Court made by virtue of it shall authorise or require the doing of anything in a country in which service is to be effected which is contrary to the law of that country. (3) An originating process which is to be served out of Singapore need not be served personally on the person required to be served so long as it is served on him in accordance with the law of the country in which service is effected. … Service of originating process abroad through foreign governments, judicial authorities and Singapore consuls or by other method of service (O. 11, r. 4) … (2) Where in accordance with these Rules an originating process is to be served on a defendant in any country with respect to which there does not subsist a Civil Procedure Convention providing for service in that country of process of the High Court, the originating process may be served — (a) through the government of that country, where that government is willing to effect service; (b) through a Singapore consular authority in that country, except where service through such an authority is contrary to the law of that country; or (c) by a method of service authorised by the law of that country for service of any originating process issued by that country.",
        "The defendants’ arguments": "11     Ms Hing, counsel for the defendants, submitted that because Indonesia is not a country with which Singapore has a Civil Procedure Convention, the only acceptable methods for service of the Court Documents were those stipulated in r 4(2).[note: 12]In support, she relied on the decision inOng & Coand argued that “strict compliance” with r 4(2) was required.[note: 13]She submitted that the plaintiff had failed to show that the service in the present case complied with r 4(2). For a start, it was clear that service had not been effected either through the Indonesian government orviathe Singapore consular authority. This left only service under r 4(2)(c):ie, service by a method of service authorised by the law of Indonesia for the service of originating process issued by Indonesia.[note: 14]She argued that the service effected in the present case could not be justified under r 4(2)(c) because service through a private agent was not a method of service authorised for the service ofanyoriginating process by Indonesia.[note: 15]She contended that the plaintiff’s argument — that service of foreign process by private agent was authorised by Indonesian customary law — should be rejected because it was unsupported by authority.[note: 16] 12     Ms Hing also argued that the service was contrary to Indonesian law for two reasons. (a)     First, she submitted that, since 2013, foreign parties seeking to serve an originating process in Indonesia couldonlydo so through the agency of the Indonesian Ministry of Foreign Affairs (“MFA”), which would work in tandem with the Indonesian Supreme Court to effect service.[note: 17]She argued that this was stipulated by the Memorandum of Understanding between the Indonesian Supreme Court and the Indonesian Ministry of Foreign Affairs dated 19 February 2013 (No 162/PAN/KH.001II/2013, No NKIH1I01/022013/58) (“the MOU”), which governed the service of foreign process in Indonesia.[note: 18]She argued that service, not having been effected by the Indonesian MFA, was therefore contrary to Indonesian law. (b)     Second, she submitted that the Het Herziene Indonesisch Reglement (S.1848-16) (Indonesia) (“the Revised Indonesian Rules” or “HIR”) and the Reglement op de Rechtsvordering (S.1847-52; 1849-63 – as subsequently amended) (Indonesia) (“The Rules on Procedure” or “Rv”) governed the service of process in Indonesia and they provided that the service ofanyoriginating process (domestic or foreign) in Indonesiamustbe effected by the court bailiff and could not be done by private agents.[note: 19] 13     Finally, Ms Hing submitted that a failure to comply with the mandatory provisions in r 4(2) rendered the service a nullity which could not be cured by the exercise of this court’s discretion under O 2 r 1 of our Rules. In support of this proposition, she cited two cases:Ong & CoandITC Global Holdings Pte Ltd (under judicial management) v ITC Limited and Others[2007] SGHC 127 (“ITC 2007”). She contended that the later decision of this court inITC 2011, insofar as it stood for the proposition that such defects in service were curable, was wrong and should not be followed.",
        "The plaintiff’s arguments": "14     Mr Chan, counsel for the plaintiff, submitted that the Court Documents were served in accordance with a method provided for in our Rules. He argued that our Rules provided forsix(and notthree, as contended by the defendants) valid methods of service in the present case: (a) personal service; (b) substituted service; (c) service in accordance with a manner prescribed by the law of Indonesia; (d) service through the Indonesian Government; (e) service through the Singapore consular authority; and (f) service by a method authorised by Indonesia for the service of originating process issued by Indonesia.[note: 20]From that premise, Mr Chan submitted that the method of service employed in this case could be justified on the basis of at least two methods of service provided for under our Rules.[note: 21] (a)     First, he argued that service through a private agent was a manner of servicespecificallypermitted under Indonesian customary law for the service offoreignprocess. (b)     Second, and in the alternative, he argued that the service through a private agent was an authorised method of service for Indonesiandomesticprocess since Art 390(1) of the HIR only required that the process be “delivered to the persons concerned”, which was done in the instant case. 15     Furthermore, Mr Chan argued that the service of process in this case was not contrary to Indonesian law. He first submitted that the MOU did not have the force of law and that, even if it did, it merely providedan additional, rather than the exclusivemethod for the service of foreign process in Indonesia.[note: 22]Mr Chan also submitted that the HIR only governed the service ofdomesticprocess in Indonesia and therefore did not require that service offoreignprocess be effected through the court bailiff.[note: 23] 16     In the course of the hearing before me, however, Mr Chan made two critical concessions. First, he conceded that based on the materials placed before the court, he was unable to prove that Indonesian customary law specifically authorised the service offoreignprocess by way of private agent.[note: 24]Second, he conceded that the service ofdomesticprocess in Indonesia must be effected by the court bailiff, as provided for under Arts 388 and 390 of the HIR and that service in the present case did not fall under any of the methods provided for under O 11 r 4(2) of our Rules.[note: 25]The effect of these two concessions is that Mr Chan is unable to justify the method of service employed in this case byeitherof the two methods he initially identified in his written submissions (see [14] above). Under Mr Chan’s construction of our Rules, there was one additional route of service available: personal service in a manner not contrary to Indonesian law. 17     However, he did not specifically pursue this line of argument during the oral hearing and instead proceeded on the basis that even if the service were irregular, this court nonetheless had the power under O 2 r (1) to cure the irregularity.[note: 26]He citedITC 2011as authority for this proposition and argued that the court should exercise its discretion in the plaintiff’s favour because (a) the defendants were fully apprised of the nature of the proceedings; and (b) the plaintiff had done its best to effect service validly as it had relied on the advice of Indonesian counsel in serving the writ by the present method.",
        "The issues": "18     Based on the parties’ submissions, three issues arise for determination: (a)     First, was service effected in a manner provided for under our Rules? (b)     Second, was service, even though effected in a manner provided for under our Rules, nevertheless invalid because it was contrary to the law of Indonesia? (c)     Third, if the service were invalid, can and should it be cured by this court?",
        "Was the service effected by a method provided for in our Rules?": "19     InOng & Co, the plaintiffs obtained leave to serve a notice of a writ on the defendant in Kuala Lumpur and duly did so by effecting personal service through a process server employed by a firm of solicitors practising in Kuala Lumpur. Subsequently, the defendant applied to set aside the service on the basis that service could not be effected by a private agent. The plaintiffs disagreed and argued that O 11 r 5(1) of the 1970 Rules (which isin pari materiawith O 11 r 3(1) of the 2014 Rules) permitted them to effect service by serving the writ personally on the defendant through the agency of a firm of Malaysian solicitors. 20     Chan JC agreed with the defendant. He reasoned that the service of a writ was an exercise of judicial power which could not be exercised in the territorial limits of another state except with its express consent. Thus, he concluded that service may only be effected through official channels, which would not impinge on the sovereignty of Malaysia. This meant that service had to take place either under O 11 r 5(8) (ie, serviceviathe appropriate judicial officer of the Malaysian courts) or under O 11 r 6(2) (ie, service through the Malaysian Government or through the Singapore consular authority). He concluded at [9], Against this background, it is therefore plain that the expression “may” as used in O 11 rr 5(8) and 6(2) connotes permission and not discretion. Without these rules, service of process outside the jurisdiction would not be possible. 21     The pivotal issue which will dispose of this application is this: are the methods of service (followingOng & Co) confined only to the three methods prescribed under O 11 r 4(2) of our Rules? It is important to understand the critical significance of this point. Mr Chan had already conceded that the method of service in this case does not fall under r 4(2) (see [16] above). Thus, if Ms Hing (relying onOng & Co) is right and theonlypermissible methods of service are contained in r 4(2), then the service in this case is clearly invalid. If, however, Mr Chan is right and there are in factsixmethods of service then the service employed in this case isprima facievalid because it is not disputed that the writs had been personally served on the defendants (see [8] above). 22     Even though Mr Chan did not cite any specific authority for his reading of our Rules or address me onOng & Codirectly, he drew my attention to a number of cases in which the courts had permitted the service of process by a methodnotprovided for under r 4(2) (see [54]–[56] below). It is therefore necessary for me, in light of this apparent conflict of authority, to resolve this issue (seeAttorney-General v Shadrake Alan[2011] 2 SLR 445 at [2]–[5]). Given the importance of this issue — not just to the disposal of the instant case but also to the practice of litigation in Singapore — I will endeavour to deal with this matter comprehensively, beginning first with the provenance of our Rules before moving on to revisit the decision inOng & Coand ending with the subsequent treatment of this subject by the courts postOng & Co.",
        "The evolution of rules 3 and 4": "23     The history of O 11 is a microcosm of the development of civil justice in Singapore. The jurisdiction of the courts over foreign defendants is not a creature of the common law, but of statute. It traces its origins to the Courts Ordinance of 1868 (Ordinance No V of 1868) (“Courts Ordinance 1868”), the first courts ordinance to be passed in the Straits Settlements. Section 23 of the Courts Ordinance 1868 provided that the “Court shall have such jurisdiction and authority as the Court of Queen’s Bench and the Justices thereof, and also as the Court of Chancery and the Courts of Common Pleas and Exchequer respectively”. By this time, the Court of Chancery (seeRe Busfield(1886) 32 Ch D 123) and the common law courts (seeLenders v Anderson(1883–1884) 12 QBD 50) of England had already been statutorily conferred jurisdiction over foreign defendants in limited cases. 24     However, there were no specific rules to govern the manner in which service may be effected until the passage of the Civil Procedure Ordinance 1878 (Ordinance No V of 1878), s 66 of which specified that “any order giving leave to effect such service [out of jurisdiction] shall prescribe the mode of service.” The origin of rule 3 25     In 1907, this position was refined with the passage of the Civil Procedure Code of 1907 (Ordinance No XXXI of 1907) (“CPC 1907”), ss 108 and 109 of which stated, 108.  When the defendant is neither a British subject, nor in the British dominions, nor in any of the Federated Malay States,notice of the writ and not the writ itself is to be served upon him. Notice in lieu of service is to be given in the manner in which writs of summons are served. 109.  If the defendant resides in any of the Federated Malay States,the writ of summons may be sent to the Registrar or an Assistant Registrar of the Supreme Court of the Federated Malay States, by post or otherwise, for the purpose of being served upon the defendant, and, if the writ of summons be returned with the indorsement of service thereon as hereinbefore prescribed, and with an affidavit of such service purporting to have been made before the Registrar or an Assistant Registrar, such writ of summons shall be deemed to have been duly served. [emphasis added] 26     The CPC 1907 wrought two important changes which still exist in our Rules today. The first was the creation of a distinction between service within the Federated Malay States (“FMS”), the State of Johore, and the State of Brunei (collectively “British Malaya and Brunei”) and service out of it. In British Malaya and Brunei, the writ itself would be served; outside of it, only the notice of the writ would be served. The reason for this is historical. At that time, the FMS and the State of Johore (which was part of the Unfederated Malay States) were part of British Malaya and under British control (seeThe Cambridge History of Southeast Asia Vol 2(Nicholas Tarling ed) (Cambridge University Press, 1992) (“Cambridge History of SEA”) at pp 28–34, 97). The State of Brunei had, since the Treaty of Protection of 1888, been a British Protectorate (seeCambridge History of SEAat p 62). Thus, these three territories were effectively under the control of the British sovereign. This is an important point because the writ issued at that time was structured as a command from the British sovereign so care was taken to ensure that the courts would not issue edicts in the name of the British sovereign to persons lying outside his dominion. 27     The second change was that s 108 of the CPC 1907 specified that the notice of the writ would be “given in the manner in which writs of summons are served”. Since s 89 specified that all originating processes had to be served personally, the effect of s 108 was that notice of the writ must likewise be servedpersonally. There were two exceptions: (a) if substituted service were ordered (see s 92); or (b) if service were effected through the Registrar of the Supreme Court of the FMS (see s 109). However, there was one complication. Section 105(2) stated that the court granting leave for service outside of jurisdiction “shall direct in what mode service is to be effected.” This section, which was a reproduction of s 66 of the Civil Procedure Ordinance 1878, gave rise to a potential for conflict because a courtcould, when granting leave for service out of jurisdiction, potentially specify a mode of service other than personal service, substituted service, or service effected through the Registrar. 28     This problem was remedied with the passage of the Civil Procedure Rules of the Supreme Court 1934 (S 2941/1934) (“CPR 1934”). Order XI r 1 of the CPR 1934, which governed the grant of leave for service out of jurisdiction, no longer gave the court the liberty to specify the method by which service may be effected. Following this change, it was clear that service both within and outside jurisdiction had, unless an order for substituted service was made or the writ was served through the Registrar, to be carried outpersonally. The origin of rule 4 29     The CPR 1934 was modelled on the English Rules of the Supreme Court 1883 (SI 1883 No 5009) (UK) (“UK RSC 1883”) (see Jeffrey Pinsler SC,Civil Justice in Singapore(Butterworths Asia, 2000) (“Civil Justice in Singapore”) at p 10). English law also drew a distinction between the service of the writ itself and the service of the notice of the writ (which would be served on non-British subjects outside the British Dominions) (see O XI r 6 of the UK RSC 1883). Further, it also specified that the notice of the writ had to be given in the same manner in which writs were served (ie, by personal service: see O XI r 7 of the UK RSC 1883). (1)   The UK Rules of the Supreme Court 1903 and 1965 30     In 1903, the English Order XI was amended when the Rules of the Supreme Court, July 1903 (UK) (“UK RSC 1903”) were published. Most notably, rr 7 and 8 read, 7.    Where leave is given under Rules 1 and 6 of this Order to serve notice of a writ of summons out of the jurisdiction,such notice shall, subject to Rule 8 of this Order, be served in the manner in which writs of summons are served. 8.    Where leave is given to serve notice of a writ of summons in any foreign country to which this Rule may by order of the Lord Chancellor from time to time be applied, the following procedureshallbe adopted: — (1) The notice to be served shall be sealed with the seal of the Supreme Court for use out of the Jurisdiction, and shall be transmitted to His Majesty’s Principal Secretary of State for Foreign Affairs by the President of the Division, together with a copy thereof translated into the language of the country in which service is to be effected, and with a request for the further transmission of the same to the Government of the country in which leave to serve notice of the writ has been given. … [emphasis added] 31     Under the UK RSC 1903, personal service was still the default method of service of process out of jurisdiction (O XI r 7). The only exception was cases falling within the ambit of r 8 — service of process on defendants residing in countries specified by the Lord Chancellor — in which service had to be effected through the government of the country in question. Under O XI r 8(3) of the UK RSC 1903, service would be deemed to have been duly effected if there is official certification that the notice has either (a) been personally served; or (b) been duly served upon the defendant “in accordance with the law of such foreign country”. 32     The English O XI remained largely unchanged until the passage of the Rules of the Supreme Court (Revision) 1962 (SI 1962 No 2145) (UK), which enacted comprehensive reforms. The relevant provisions of the new English Order 11 rr 5 and 6 (now numbered with Hindu-Arabic numerals instead of Roman numerals) were later incorporated into the Rules of the Supreme Court 1965 (SI 1965 No 1776) (UK) (“UK RSC 1965”) with minor amendments. The relevant provisions of the UK RSC 1965 now read: 5.—(1) Subject to the following provisions of this Rule,Order 10, Rule 1, and Order 67, Rule 4, shall apply in relation to the service of a writ, or notice of a writ, notwithstanding that the writ or notice is to be served out of the jurisdiction. … (3) A writ, or notice of a writ, which is to be served out of the jurisdiction— (a)need not be served personally on the person required to be served so long as it is served on him in accordance with the law of the country in which service is effected; and (b)need not be served by the plaintiff or his agent if it is served by a method provided for by Rule 6 or Rule 7. … 6.—(3): Where in accordance with these Rules notice of a writ is to be served on a defendant in any country with respect to which there does not subsist a Civil Procedure Convention providing for service in that country of process of the High Court,the notice may be served— (a)    through the government of that country, where that government is willing to effect service; or (b)    through a British consular authority in that country, except where service through such an authority is contrary to the law of that country. [emphasis added in italics; added emphasis in bold] 33     Under the UK RSC 1965, private service — either personal or substituted — was still the default method of serving writs or notices of writs out of jurisdiction. This is clear from O 11 r 5(1), which stated that “Order 10, Rule 1 [personal service], and Order 67, Rule 4 [substituted service], shall apply in relation to the service of a writ, or notice of a writ, notwithstanding that the writ or notice is to be served out of the jurisdiction.” The new English O 11 r 6, which was a successor to the old O XI r 8 of the UK RSC 1903, was now expressly facilitative: it no longermandatedthat service be effected through official channels but merely provided that it “may” be done in that manner. This view is in line with the commentary of Jack I H Jacobet al, TheAnnual Practice 1966vol 1 (Sweet & Maxwell, 1965) at p 118 that the English O 11 r 6 “does not exclude any other method[ie, personal or substituted service under O 11 r 5(1)] which may be available.” (2)   The 1970 Singapore Rules 34     The provisions of the UK RSC 1965 were imported into Singapore with minimal substantive change in the Rules of the Supreme Court 1970 (S 274/1970) (“1970 Rules”) (seeCivil Justice in Singaporeat p 10). The relevant provisions of O 11 of the 1970 Rules read, 5.—(1)    Subject to the following provisions of this Rule, Order 10, Rule 1, and Order 62, Rule 5, shall apply in relation to the service of anotice of a writnotwithstanding that the notice is to be served out of the jurisdiction. (2)    Nothing in this Rule or in any order or direction of the Court made by virtue of it shall authorise or require the doing of anything in a country in which service is to be effected which is contrary to the law of that country. (3)    Anotice of a writwhich is to be served out of jurisdiction need not be served personally on the person required to be served so long as it is served on him in accordance with the law of the country in which service is effected. … (8)Where the defendant is in Malaysia or Brunei, the notice of a writmaybe sent by post or otherwise by the Registrar to the Magistrate, Registrar, or other appropriate officer of any Court exercising civil jurisdictionin the area in which the person to be served is said to be or to be carrying on business for service on the defendant, and if it isreturned with an indorsement of service and with an affidavit of such service, itshallbe deemed to have been duly served. … 6.—(2)    Where in accordance with these Rules notice of a writ is to be served on a defendant in any country with respect to which there does not subsist a Civil Procedure Convention providing for service in that country of a process of the High Court, the notice may be served — (a) through the Government of that country, where that Government is willing to effect service; or (b) through a Singapore consular authority in that country, except where service through such an authority is contrary to the law of that country. [emphasis added in italics; added emphasis in bold] 35     Order 11 rr 5 and 6 of the 1970 Rules were almost identical with their equivalents in the UK RSC 1965 save for two differences. The first was that special provision continued to be made for service in Malaysia and Brunei. The second was that the 1970 Rules did not contain the equivalent of the English O 11 r 5(3)(b), which specified that the notice of the writ “need not be served by the plaintiff or his agent if it is served by a method provided for in rule 6 or rule 7”. However, in my view, that omission was not material as the English O 11 r 5(3)(b), was insertedex abundanti cautela. If service were effected through the Government of that country or a Singapore Consular Authority (as specifically provided for in O 11 r 6(2) of our 1970 Rules) then, as a corollary, it must follow that service need not be effected by the plaintiff or his agent. The decision in Ong & Co and the 1991 Amendment Rules 36     That remained the position untilOng & Coeffectively outlawed the private service of process overseas (see [20] above). It appeared that this decision sent ripples throughout the Bar, seeing as how the preferred practice of many local practitioners was to effect the service of process overseas through the agency of a firm of solicitors in the jurisdiction in question (seeOng & Co case noteat p 111). 37     The Rules of the Supreme Court (Amendment No 2) Rules 1991 (S 281/1991) (“1991 Amendment Rules”) was introduced specifically to deal with the difficulties created byOng & Co. It made three important changes to O 11 of the RSC 1970, all of which still exist in our Rules today. (a)     First, it provided for a new method of service on defendants in non-Civil Procedure Convention countries. This took the form of a new O 11 r 6(2)(c) of the 1970 Rules (now r 4(2)(c)) which provided that writs may be served “by a method of service authorised by the law of that country for service of any originating process issued in that country.” (b)     Second, it amended the existing r 5(8) to make it explicit that where the defendant is in Malaysia or Brunei, the notice of a writ “may be served in accordance with Rule 6.” (c)     Third, it amended the marginal note to O 11 r 5(1) from “[s]ervice of notice of writ abroad: General” to “[s]ervice of notice of writ abroad: Alternative modes”. 38     Of the amendments, the most significant is the introduction of O 11 r 6(2)(c) (now r 4(2)(c), which is how I shall refer to it), which appears to have been intended to “undo” the outcome ofOng & Co. Rule 4(2)(c) permits service in a manner which is authorised by the law of the foreign country “for service of any originating processissued in that country[ie, domestic process]” [emphasis added]. As a clarification, r 4(2)(c) does not refer to the law of the foreign jurisdiction with respect to the service offoreignprocess, which appears to be the interpretation adopted inSRS Commerce, where the court examined the service of the Singapore writ in Japan with reference to Japanese law for the service of foreign process (see Benny Tan, “Curing Non-Compliance with Foreign Laws in the Context of Service Out of Jurisdiction” (2015) 27 SAcLJ 91 (“Curing Non-Compliance”) at paras 19–21). Instead, the purport of r 4(2)(c) is “do as the Romans do”: whatever is permitted by the law of the foreign jurisdiction for the service oftheir domestic processwill also be held, under our Rules, to be an acceptable method of service for Singapore process in that jurisdiction (seeFortune Hong Kong Trading Ltd v Cosco Feoso (Singapore) Pte Ltd[2000] 1 SLR(R) 962 (“Fortune”) at [32]). Following the introduction of r 4(2)(c), the same method of service effected inOng & Cowould be valid since, under O 10 of the Rules of the High Court 1980 (PU(A) 50/1980) (Malaysia) (“Malaysian RHC 1980”), a Malaysian originating processes could be served through private agents. The 1991 re-enactment until present day 39     The Rules of the Supreme Court (Amendment No 3) Rules 1991 (S 532/1991) (“the 1991 re-enactment”) repealed and re-enacted O 11. At this point, O 11 rr 5 and 6 of the 1970 Rules were re-numbered rr 3 and 4 respectively, which is how they appear today. The only substantive change of note was the amendment to the form of the writ (now drafted in the form of a notification and not a command) and the consequential amendments arising therefrom (see [3] above). Following this change, theactual writwould be served out of jurisdiction and all references to the service of the notice of the writ were removed. The change in the content of the writ, which paralleled a similar change that took place in England in 1981, was instituted to simplify proceedings by making it compatible with international comity for thewrit itselfto be served (seeFortuneat [30]). Following this, O 11 rr 3 and 4 have existed in their present form, largely unchanged, to the present day.",
        "Revisiting Ong & Co": "40     The key authority relied on by the defendant isOng & Co, a decision with which I have some difficulty reconciling with the 1970 Rules. For a start, it is clear from the discussion in the preceding section thatOng & Coruns against the grain of legislative history of O 11. Service hadalwaysbeen permitted to be effected through private means (either personal or substituted service) before the 1970 Rules were introduced: see,eg,M. N. Mootoo Rahman Chetty V. M. A. R. Mootoo Rahman Chetty[1927] SSLR 13;In the Matter of the Estate of Choo Eng Choon, Deceased; Tan Siok Yang & Ors v Choo Ang Chee[1934] 1 MLJ 182 (“Choo Eng Choon”). There is no reason to believe that the 1970 Rules changed this position. As the development of the equivalent rules in England shows (see [30]–[33] above), it had always been contemplated — even after the introduction of r 6(2) — that thedefaultposition would be personal service through private means. Service through official channels was meant to supplement, but not supplant, private service. 41     Furthermore, it seems to me thatOng & Cowould alter the structure of the Rules. As pointed out in theOng & Co case note, Chan JC’s reading would render O 11 rr 5(1)–(4) (now r 3(1)–(4)) otiose since there would be no need to specify that the provisions governing personal and substituted service would continue to apply to service of process out of jurisdiction if the only acceptable methods of service were those stipulated in O 11 r 6 (now r 4) (seeOng & Co case noteat pp 120–121). InFerrarini SpA and others v Magnol Shipping Co Inc(The “Sky One”) [1988] 1 Lloyd’s Rep 238 (“The Sky One”) at 240–241, Staughton J (as he then was), in commenting on O 11 rr 5 and 6 of the UK RSC 1965, wrote, It is common ground thatthe methods of service provided in that sub-rule[O 11 r 6(3) of the UK RSC 1965, which is almost identical to O 11 r 6(2) of the RSC 1970]are not exclusive.Service may be effected by private means rather than through the Master’s Secretary’s Department, the Foreign and Commonwealth Office and diplomatic channels, provided always that nothing is done in the country where service is to be effected which is contrary to the law of the country. So the question is whether service by private means in Switzerland is contrary to the law of Switzerland. [emphasis added] I find Staughton J’s interpretation of the overseas service regime under the UK RSC 1965 to be equally applicable to a construction of our Rules. 42     In that connection, the Malaysian decision inMa Boon Lan v UOB Kay Hian Pte Ltd (previously known as Kay Hian Pte Ltd) and another appeal[2013] 4 MLJ 848 is instructive. There, the plaintiff had been granted leave to serve a Malaysian writ on a defendant in Singapore and duly did so through a process server engaged by a firm of Singapore solicitors. At first instance, the judicial commissioner set the service aside as being irregular on the basis that O 11 r 5(8) of the Malaysian RHC 1980 (which is, in substance,in pari materiawith O 11 r 3(8) of our Rules) provided for the exclusive means through which service in Singapore may be effected. In allowing the appeal, Azahar Mohamed JCA, delivering the judgment of the Malaysian Court of Appeal, held at [11], It is to be noted that the words ‘may’ and ‘shall’ occur in the same provision. The two words are used in contradistinction to each other. Since the words occur in the same provision, they should be given their natural meaning. For this reason, in our judgment the word ‘may’ where it appears in O11 r 5(8) of the RHC must be taken in its natural sense, that is, permissive sense and not mandatory or obligatory sense. There is no valid reason for giving ‘may’ a mandatory meaning as argued by learned counsel for the defendant. In our view, in the context of the present case, it merely gives the plaintiff an option to serve should he so desire, the notice of writ of summons to be served out of jurisdiction and the writ of summons together with the statement of claim to the defendant in the mode as stated in the provision. I find the reasoning of the Malaysian Court of Appeal persuasive and I would go further to add that the reasoning is equally applicable to the methods of service provided for under O 11 r 4(2) of our Rules. The use of the word “may” in r 4(2) in contradistinction to the use of the mandatory “must” in rr 4(3) and (4) is a strong indication that the provisions on serviceviaofficial channels found in rr 4(1) and (2) are not intended to be mandatory. The sovereignty argument 43     The central premise underpinning the decision inOng & Cois that the service of the notice of a writ is an exercise of judicial power. The relevant paragraphs ofOng & Coread, 6    …The service of a writ is an exercise in judicial power.The judicial power of a State can only be exercised within the territorial limits of the State over which the courts have jurisdiction. … 7    In other words, the judicial power of one State cannot be extended or exercised in another independent State except with the consent of that State. The reason is that it encroaches upon the sovereign rights of the other State. As was said by Lord Denning inAfro Continental Nigeria Ltd v Meridian Shipping Co SA (The Vrontados)[1982] 2 Lloyd’s Rep 241 at 245: [S]ervice of a writoutof the jurisdiction is an exercise of sovereignty within the country in which service is effected. It can only be done with the consent of that country. That is why our rules provide for service through the judicial authorities of that country: or through a British Consular authority in that country, see RSC, O 11 rr 5(5) and (6). … 10    Accordingly, the service of the notice of the writ by means of a court process server employed by a solicitors’ firm in Kuala Lumpur was not an authorised method of service under the 1970 Rules. 44     With respect, there appears to be a disconnect in the reasoning. Chan JC begins by stating that the service of awritis an exercise of judicial power and goes on to conclude that, for reasons of sovereignty, the service of thenotice of the writin Malaysia outside of official channels was unauthorised. The conflation of the service of thewritand the service of thenotice of the writis problematic. As pointed in theOng & Co case noteat pp 114­–115, the difference between the two is crucial. 45     Under the CPC 1907 and the CPR 1934, the writ itself would be served on defendants in British Malaya and Brunei. However, this was no longer appropriate after the end of colonial rule. Thus, O 11 r 5 of the 1970 Rules provided that thenoticeof the writ (which was not structured as a command from the President of Singapore), and not the writ itself, would be served out of the jurisdiction. For this reason, I agree with the observation in theOng & Co case noteat p 117 that the “service of anotice of a writout of the jurisdiction [as was done inOng & Co] does not constitute an exercise of the judicial power of a state outside its territorial limits.” 46     This position has now been definitively put to rest following the passage of the 1991 re-enactment, which amended the form of the writ (see [39] above). InFortune, the Court of Appeal explained the changes in the following fashion (at [30]): … In 1991, very substantial amendments were made to our Rules of Supreme Court 1970, and the amendments came into force on 1 February 1992. One of the amendments made was to the form of the writ. It was amended along a similar line as in England in 1981, and the notice of the writ for issue and service abroad was dispensed with.Our writ in the present form is no longer structured in the form of a command to the defendant and does not contain any reference to the President of the Republic of Singapore and is not tested or witnessed by the Chief Justice. In its present form, the writ is more of a notification to the defendant that an action has been commencedagainst him in the court in Singapore than a command to him issued by the court. It seems to us that this change in the content of the writ has made it “compatible with international comity to allow service out of jurisdiction” of the writ: (perthe commentary at para 6/1/1C of the 1982 edition ofThe Supreme Court Practice). In its present form, the writ has lost its meaning of a judicial order, and it can hardly be contended that the service of our writ abroad would interfere with or encroach upon the sovereignty of the country in which the writ is served. [emphasis added] 47     It is clear that the issue of the encroachment on the sovereignty of another state is no longer an issue (in my view it never was, given that only the notice of the writ was ever served). With that being the case, I do not see any sound policy reason why Singapore litigants should bemandatorilyrequired to go through the cumbersome process of engaging the official channels of service. This point was also eloquently made inFortuneat [34], where it was stated: … In this regard, it is important not to lose sight of the purpose of service of process, whether it be a foreign or local process. Essentially, it is to notify the defendant of the proceedings that have been commenced against him, and in our view, a more pertinent consideration is whether the method of service employed by the plaintiff is sufficient to bring to the attention of the defendant such proceedings and not whether the service is effected through the official means. While those remarks were made in the context of service offoreign process withinSingapore, the same logic, in my view, applies to the service ofSingapore process outof jurisdiction. After all, the paramount concern is that the litigants must have notice of each other’s claims. As long as this can be achieved in a manner which does not impinge on the law of a foreign country (which would be proscribed under r 3(2)), it does not matter whether it is effected through official or private means. The 1991 Amendment Rules 48     I am further fortified in my conclusion upon my examination of the 1991 Amendment Rules. First, it is notable that the Rules Committee amended the marginal note to O 11 r 5(1) of the 1970 Rules. In its original form, it read, “Service of notice of writ abroad: General”. However, the expression “general” was amended to read “alternative modes”, which is how it remains today. It seems to me that this change was underscored by a desire to reinforce the point that O 11 rr 5 and 6 of the 1970 Rules provided complementary and alternative means through which service may be effected and to dispel any notion that service was confined only to the official channels. 49     Second, I find the introduction of O 11 r 5(8)(a) to the 1970 Rules to be highly significant. It will be recalled that the primary purpose of r 6(2)(c) was to undo the decision inOng & Co(see [38] above). At first blush, r 5(8)(a) appears to be superfluous becauseOng & Coalready held that service may only be effected in Malaysiaviar 5(8) or r 6(2), of which r 6(2)(c) was now a part. It would seem that r 6(2)(c) would have been applicable even without r 5(8)(a). In order to understand why the introduction of r 5(8)(a) was vital, it is important to set out [8] ofOng & Coin full: The relevant rules in O 11 of the 1970 Rules differ slightly from the English O 11 but provision is made in r 6(2) for service: (a) through the government of that country where that government is willing to effect service; or (b) through a Singapore consular authority in that country, except where service through such an authority is contrary to the law of that country. Order 11 r 5(8) in fact sets out the agreements of two foreign governments,vizMalaysia and Brunei to allow Singapore parties to effect service of process in the manner set out therein. I do not think it is an alternative mode of service outside the jurisdiction. … 50     TheratioofOng & Cowas that the service of a Singapore writ in Malaysiamay only be effected through official channelsset out in r 5(8) and r 6(2) because it was the only way it could be done without impinging on the sovereignty of Malaysia. In the case of r 5(8), it was because “r 5(8) in fact sets out the agreements of two foreign governments,vizMalaysia and Brunei to allow Singapore parties to effect service of process in the manner set out therein”; in the case of r 6(2), it was because service would either take place through the foreign government (obviating any concerns of sovereignty) or through the Singapore consular authority (which was enjoined to doonly ifit would not be contrary to the law of Malaysia). In other words, applyingOng & Co, a plaintiff would be precluded from serving process in Malaysia under r 6(2)(c) since it contemplated service through private means. 51     This is where r 5(8)(a) comes in. It was intended to clarify that,Ong & Conotwithstanding, r 6(2)(c) would apply in cases of service on defendants in Malaysia. The purpose behind the introduction of r 5(8)(a)in conjunction withr 6(2)(c) is unmistakeable: it was meant to permit the service of process in Malaysia throughprivatemeans. In essence, the 1991 Amendment Rules subtly negated the impact ofOng & Cowithout explicitly saying so. 52     InCuring Non-Complianceat 100, Mr Benny Tan argued that the Rules Committee had intended to preserveOng & Co’s reading of O 11 rr 5 and 6 of the 1970 Rules (ie, that the official routes of service provided for in r 6 are mandatory). He argued that if the Rules Committee had disagreed withOng & Co, it would have replaced the word “may” in rr 5(8) and 6(2) with another expression that made it clear that the official channels of service are discretionary, instead of mandatory. 53     With respect, I do not agree. First, I have already explained why, in my view, the changes wrought by the 1991 Amendment Rules clearly demonstrate that the Rules Committee were cognisant of the difficulties caused by the decision inOng & Coand desired to address it without effecting a wholesale revision of the Rules (see [49]–[51]). Second, ifOng & Cowere to be followed, rr 5(1)–(3) would effectively be rendered redundant (see [41] above). If the Rules Committee agreed withOng & Co, it would not make sense to amend r 5(8) but still retain r 5(1), which contained the provisions on personal and substituted service. Post-Ong & Co cases 54     Finally, a review of the cases decided over the past 15 years supports the conclusion that Singapore permits the service of process through private means. This exercise is necessary to illustrate the point that service of Singapore process overseas is not, contrary to the defendants’ submissions, confined to the three methods prescribed under O 11 r 4(2) of our Rules. By the same token, it would also show thatOng & Co— insofar as it stands for the proposition that r 4(2) is exhaustive of the methods of service — is not good law today. 55     InPetroval SA v Stainby Overseas Ltd and others[2008] 3 SLR(R) 856 (“Petroval”), Tay Yong Kwang J upheld an order granting leave for substituted service to be effected on three defendants who were resident in Switzerland, by way of service on their lawyers in the British Virgin Islands (“BVI”). In doing so, Tay J explicitly relied on O 11 r 3(1) of the Rules of Court (Cap 332, R5, 2006 Rev Ed) (“2006 Rules”) and held that this court could grant an order for substituted service (seePetrovalat [26]). 56     InAstro Nusantara International BV and others v PT Ayunda Prima Mitra and others[2013] 1 SLR 636 (“Astro”), the plaintiffs were litigants in an international arbitration in whose favour five awards had been rendered. They sought to enforce their awards under O 69A r 6(1) of the 2006 Rules and were granted leave to effect service out of jurisdiction. The plaintiffs attempted to effect service of the enforcement orders by engaging Indonesian solicitors to deliver the documents to the second defendant’s office in Indonesia. Belinda Ang Saw Ean J, after reviewing the expert testimony, arrived at the conclusion that, under Indonesian law, the service ofdomesticcourt process had to be done by the bailiff of an Indonesian court. However, Ang J held that this did not apply to the service offoreignprocess. Thus, she concluded, the service offoreigncourt documents may be effectedviaIndonesian solicitors by leaving copies of the same at the registered address of the party sought to be served. Given her earlier finding that this was not an authorised mode of service ofdomesticprocess under Indonesian law, it must follow that the service could not have come within O 11 r 4(2)(c) of the 2006 Rules. Thus, it is clear that Ang J had decided the case on the basis that personal service through a private agent was an acceptable mode of serving Singapore process on defendants in Indonesia (although, on the facts, Ang J held that service had not been successfully effected: see [82] below). 57     In both these cases, the method of service was held to be valid even though the service was not one of the methods prescribed under r 4(2). It is therefore implicit from these cases that the methods of service are not limited to r 4(2). Instead, personal service and substituted service continue to be permissible methods through which service of process overseas may be effected. This is in line with the following observation by Andrew Ang J inConsistel Pte Ltd and another v Farooq Nasir and another[2009] 3 SLR(R) 665 at [28]: The regime of service out of jurisdiction, as provided for in Singapore under O 11 of the ROC, was eventually introduced to deal with the situation where the defendant had left the jurisdiction before the writ was issued. Even so, service out of jurisdiction was not intended to derogate from the general requirement for personal service. … … Hence, O 11 of the ROC was meant to supplement s 16(1)(a)(ii) of the SCJA and not to detract from the primary requirement of personal service. Personal service should, generally, still be applied to cases where the defendant was not in Singapore. [emphasis added]",
        "How many methods of service are there?": "58     In my judgment, it is clear that O 11 rr 3 and 4 of our Rules provide alternative and complementary methods of effecting service out of jurisdiction. I now return to my original question: how many ways of serving a writ outside of jurisdiction are recognised by our Rules? The answer depends on whether the defendant resides in (a) Malaysia and Brunei (seven methods); (b) a Civil Procedure Convention country (five methods); or (c) a non-Civil Procedure Convention country (six methods). I will first identify the four methods of service which are common to all before turning to the methods which are unique to each grouping. 59     The four common methods of service which are available irrespective of where the defendant resides are: (a)     Personal service, as long as it does not contravene the law of the foreign jurisdiction (r 3(1) r/w r 3(2)). (b)     Substituted service with leave of court provided it does not contravene the law of the foreign jurisdiction (r 3(1) r/w r 3(2)). (c)     Service by a methodspecifically authorisedby the law of the foreign jurisdiction for the service offoreign process(r 3(3)) (see [108] below). (d)     Service through a Singapore consular authority, as long as it does not contravene the law of the foreign jurisdiction (r 4(1)(b) and r 4(2)(b)). 60     If the defendant resides in Malaysia or Brunei, there are three additional methods which are applicable, resulting in a total ofsevenavailable methods of service: (a)     Service through the government of Malaysia or Brunei (r 3(8)(a) r/w r 4(2)(a)). (b)     Service by a method recognised in either Malaysia or Brunei for the service ofdomestic processissued by the Malaysian and Bruneian courts, provided such service is not contrary to Malaysian or Bruneian law (r 3(8)(a) r/w r 4(2)(c)). (c)     By post from the Registrar of the Singapore court to the judicial officer exercising civil jurisdiction in the territory in which the defendant resides (r 3(8)(b)). 61     If the defendant resides in a country with which Singapore has a Civil Procedure Convention, one additional method is available, making for a total offivemethods of service: (a)     Service through the judicial authorities of the foreign jurisdiction (r 4(1)(a)). 62     If the defendant resides in a country with which Singapore doesnothave a Civil Procedure Convention, two additional methods are available, adding up to a total ofsixavailable methods of service: (a)     Service through the government of the foreign jurisdiction (r 4(2)(a)). (b)     Service by a method recognised by the law of the foreign jurisdiction for the service ofdomestic processissued by the courts of that country, provided such service is not contrary to the law of that country (r 4(2)(c)).",
        "Was the service contrary to Indonesian law?": "63     Given my finding at [58] above that r 4(2) does not stipulate the exhaustive methods of service, it is clear that the method of service employed in this case is permitted under our Rules since it is undisputed that the Court Documents were in fact servedpersonallyon the defendants (see [8] above). Thus, the next issue is whether the service was contrary to the law of Indonesia. Ms Hing has two strings in her bow (see [12] above). She first submitted that the MOU mandated that the service of foreign process in Indonesia be effected through the Indonesian MFA. Second, she submitted that, under the HIR, the service ofallprocess, domestic and foreign,mustbe effected through a court bailiff. I will examine each argument in turn.",
        "The MOU": "64     In my judgment, the MOU does not render the present service invalid for two reasons. First, I accept Mr Chan’s submission that the MOU is facilitative and not mandatory. Article 6 of the MOU, which governs requests for judicial assistance from foreign courts, reads,[note: 27] Handling of Request for Judicial Assistance for Service of Process from a Foreign Court Article 6 (1)    The Ministry of Foreign Affairs via its diplomatic channels received a request for judicial assistance for service of process from a foreign court to Indonesian citizen and/or legal entity domiciled in Indonesia. (2)    The Ministry of Foreign Affairs shall deliver the request for judicial assistance for service of process as referred to in paragraph (2) to the Supreme Court for follow-ups. 65     There is nothing in the MOU which states that this is theexclusiveandmandatorymethod through whichallforeign process in Indonesia must be served. Instead, the MOU merely provides a mechanism through which a foreign partymayarrange to have a writ served through an Indonesian court bailiff. It appears that this is a view shared by the Indonesian MFA in their press release accompanying the conclusion of the MOU (dated 19 February 2013):[note: 28] Therefore… this MOU became abreakthrough in technical procedurebetween the MOFA and the Supreme Court in whichone of the important points was to follow up by formulating a Supreme Court Regulationconcerning the procedure of letters of rogatory … [emphasis added] 66     Second, I also find that, in any event, the MOU is not law. When they appeared before me, both Ms Hing and Mr Chan agreed that the MOU was not statutory law. They agreed that it was, at best, a guideline which allowed foreign parties to validly engage the services of the Indonesian court bailiff to effect service within the jurisdiction of Indonesia.[note: 29]This must be correct. A cursory glance at the MOU is sufficient to show that it does not (and was never intended to) be a law of general application. Just three examples will suffice: (a) Art 2(1) of the MOU states that it is a “joint coordination guideline”; (b) Art 10(1) states that the MOU will last for a period of five years; and (c) Art 10(3) states that the MOU is terminable (at will) by either party so long as three months’ notice is provided. It is clear that the MOU only governs the relationship between the Indonesian MFA and the Indonesian Supreme Courtinter se.[note: 30]It neither affects the legal rights of third parties nor does it purport to do so. 67     Therefore, even if the MOU purported to provide for an exclusive means through which foreign process must be served, non-compliance with its terms would not render the present service invalid under r 3(2). The language of r 3(2) is clear: it prohibits an act which is “contrary to thelawof that country”. It does not apply to procedural guidelines like the MOU. InBNP Paribas (formerly known as Banque National De Paris) v Polynesia Timber Services Pte Ltd and another[2002] 1 SLR(R) 539, the defendant argued that service was invalid because the plaintiff had not complied with Practice Note No 1 of 1968 of the Malaysian High Court (“the Malaysian PD”) before attempting substituted service on the defendant in Malaysia. After reviewing the expert evidence, Lai Siu Chu J held that the Malaysian PD did not have the force of law in Malaysia so non-compliance with its terms did not automatically render the service invalid. By parity of reasoning, non-compliance with the MOU, which is not law, would not in itself invalidate the service effected in this case.",
        "The HIR and Rv": "68     I first set out the relevant provisions of Indonesian law. Articles 388(1) and 390(1) of the HIR read,[note: 31] 388.(1)    All bailiffs, messengers on duty at the court tribunal, and general affairs officers are entitled and obligated to perform summons, notices and any other bailiff letters and to carry out the judge’s orders and ruling. … 390.(1)    Every bailiff letter, unless those are mentioned below, shall be delivered to the people concerned at their domicile or address, and if they may not be found there, to the village Head or its assistant, who has to immediately notify to the people of such bailiff letter, but it is not necessary to be stated by law. 69     Art 1 of the Rv reads,[note: 32] Every civil proceeding, so long as no specific exceptional, commences by notice of lawsuit performed by an authorized bailiff at the location of the notice, shall inform the derivative of such notice letter to the defendant or sending it to the defendant’s domicile or address. 70     On the face of it, neither the HIR nor the Rv pertain to the service of foreign process. This must be right given that it is common ground between the two Indonesian law experts that there is no express statutory law which governs the service of foreign process in Indonesia.[note: 33]I pause to note that there is some disagreement over whether the Rv continues to apply in Indonesia today. However, given the fact that the parties agree that neither the HIR nor the Rv govern the service of foreign process, I need not decide this point. 71     Ms Hing submitted that “[i]n the absence of any express statute on service of foreign process, the method of service of originating process authorised by Indonesia is therefore what is stated in the HIR … ie service must be effected through a Baliff [sic] and not by Private Service Method.”[note: 34]However, she has not drawn my attention to any authorities in support of this proposition. In making this argument, she purported to rely on  the expert testimony of Dr Winarta, who averred, All service of court proceedings (whether foreign or local) on Indonesian entities in Indonesia must be carried out by the court bailiff. Any purported service of foreign or local court proceedings on Indonesian entities in Indonesia by private service methods described in Budijaja’s Report is wrong and invalid regardless of whether the receiving party objects to such methods of service. [emphasis added][note: 35] 72     With respect, Dr Winarta’s proposition that the requirement for the service to be carried out by the Indonesian court bailiff applies mandatorily toforeignprocess cannot be right since Dr Winarta himself accepts that “there areno laws which govern the service of foreign originating processeson Indonesian individuals or legal entities in Indonesia” [emphasis added]. Dr Winarta attempted to bridge this “gap” by asserting that “[a]lthough [the MOU] is not lawunder Indonesian legislation,the Supreme Court and the MOFA will rely on [the MOU]in relation to the service of foreign originating processes on individuals or legal entities in Indonesia” [emphasis added]. However, the fact remains that the MOU is not law (see [66] above) and hence cannot mandate that the service of foreign process be carried out by the Indonesian court bailiff. In this connection, I note that, inAstro, Ang J also had to consider Arts 388 and 390 of the HIR and she found at [53] that, … In particular, I waspersuaded by Mr Prahasto’s explanation as to why Arts 388 and 390 of the Herziene Indonesisch Reglement (S.1848-16) (Indonesia) (“the HIR”), which provide that service of documents must be done by the Bailiff of the South Jakarta District Court, is limited to documents issued by Indonesian courts.Given the parochial references in the HIR to service “on the village head” or the “head of the Chinese people”, it seemed unlikely that the HIR was intended to apply to foreign court documents. In the light of the above, I accept Mr Prahasto’s evidence that under Indonesian law,service of foreign court documents may be effected by a lawyer from an Indonesian firm leaving copies of the same at the registered address of the party sought to be served. [emphasis added] In my judgment, the defendants have not successfully demonstrated that the method of service employed in this case is contrary to Indonesian law so the service is valid.",
        "Would any irregularity have been curable?": "73     Given my finding that the service in this case is valid, it is not strictly necessary for me to examine the third issueie, whetheranynon-compliance with rr 3 and 4 would be curable under O 2 r 1(1) of our Rules. However, given that the parties have made extensive submissions on this point, I shall go on to express my views. Order 2 r 1(1) and (2) provide as follows: (1)    Where, in beginning or purporting to begin any proceedings or at any stage in the course of or in connection with any proceedings there has, by reason of anything done or left undone, been afailure to comply with the requirements of these Rules, whether in respect of time, place, manner, form or content or in any other respect, the failure shall be treated as an irregularity and shall not nullify the proceedings, any step taken in the proceedings, or any document, judgment or order therein. (2)    Subject to paragraph (3), the Court may, on the ground that there has been such a failure as is mentioned in paragraph (1), and on such terms as to costs or otherwise as it thinks just, set aside either wholly or in part the proceedings in which the failure occurred, any step taken in those proceedings or any document, judgment or order therein or exercise its powers under these Rules to allow such amendments (if any) to be made and to make such order (if any) dealing with the proceedings generally as it thinks fit. [emphasis added] 74     On this issue, as on the first, we begin with the decision inOng & Co. Having found that the service effected by the plaintiff was invalid (see [20] above), the court then went on to hold at [11] that it was not curable: The next submission of counsel for the plaintiffs is that if the service was wrong it was merely an irregularity which can be amended under O 2 r 2 of the 1970 Rules on the ground that the defendant, having been actually served with the notice of the writ and entered appearance, has not suffered any prejudice. There is no substance in this argument.By effecting service of the notice of the writ without complying with r 5(8) or r 6(2) of O 11, the plaintiffs have in fact disregarded the legal basis upon which the judicial power in Singapore may be exercised in Malaysia. That must render the purported service a nullity. [emphasis added] 75     The use of the expression “nullity” is somewhat unfortunate since it harks back to the old position which existed before the 1970 Rules, where a distinction was drawn between irregularities (which were curable) and nullities (which were not) (seeCivil Justice in Singaporeat pp 452–456). However, even under the new O 2, there are categories of failures to comply with the statutory requirements which are so egregious and so fundamental that the courts have regularly held them to be too serious to cure (seeSingapore Civil Procedure 2015vol 1 (G P Selvam gen ed) (Sweet & Maxwell, 2015) (“Singapore Civil Procedure”) at para 2/1/1). In my view, perhaps what the court meant inOng & Cowas that to effect service in a manner not provided for in our Rules was a breach so serious that itought not to, rather thancannotbe cured. 76     InITC 2011, Lee J held, at [38], that “Ong & Cois no longer authoritative … not all errors arising in the process of service out of jurisdiction would render the purported service a nullity. Rather they would constitute a mere irregularity and the Singapore courts do have jurisdiction to cure such irregularities under O 2 r 1(2) of [the 2006 Rules].” While I agree that “not all errors” of overseas service are incapable of cure, the question remains: what sorts of irregularities should be cured and what should not? Having reviewed the authorities, I have observed that cases involving irregularities in the service of process out of jurisdiction may be divided into three broad categories. (a)     Cases where service was held to be invalid because the attempted service was unsuccessful in bringing notice of the claim to the defendant (“Category A”). (b)     Cases where service was held to be invalid because the method of service employed — though successful in bringing notice of the claim to the defendant — was contrary to the law of the foreign jurisdiction (“Category B”). (c)     Cases where service was invalid because the method of service employed — though successful in bringing notice of the claim to the defendant and not contrary to the law of the foreign jurisdiction — had nevertheless failed to comply with a procedural requirement provided for in our Rules (“Category C”). 77     In my view, cases falling within Categories A and B are not curable whereas cases falling within Category C are curable if it would be just for the court to do so.",
        "Category A cases": "78     The essence of service is the notification to the defendant of the claims made against him (seeFortuneat [34]). In my view, if the attempt at service was ineffective in drawing the defendant’s attention to the claims against him then it is simply a non-starter —no service was effectedso there is nothing that can be “cured”. 79     InGolden Ocean Assurance Ltd and World Mariner Shipping S A v Christopher Julian Martin and others[1990] 2 Lloyd’s Rep 215 (“the Goldean Mariner”), the plaintiffs were the insurers of a fleet of vessels (which included the Goldean Mariner) the risk of which was underwritten by the defendants. While on a voyage to Japan, the Goldean Mariner suffered a serious casualty and required repairs which were eventually quantified at $1.5m. The plaintiffs sought to claim this sum from the defendants and obtained leave from the English courts to serve its writs out of jurisdiction. A number of the defendants applied to set the writs aside on the basis that they had been invalidly served. The defendants who filed the applications fell into two groups: (a) the 10th defendant, which was not served the writ itself but merely an acknowledgement of service; and (b) the 9th, 12th, and 15th–18th defendants, which were each served a copy of a writ which (though proper in all other respects) was wrongly addressed (for example, the 9thdefendant received the writ addressed to the 17thdefendant). 80     For present purposes, I will focus on the service on the 10thdefendant. The majority of the English Court of Appeal (Lord Justice McCowan and Sir John Megaw) held that the service to the 10th defendant was an irregularity that fell within the ambit of O 2 r 1 of the UK RSC 1965 (which isin pari materiawith O 2 r 1 of our Rules). McCowan LJ analysed this as a case where there was “plainly an attempt to take a step in the proceedings but a failure to comply with a requirement of these rules as towhatshould be served” [emphasis added]. They also exercised their discretion to cure the irregularity on the basis that the 10thdefendant had suffered no prejudice since it knew of the plaintiffs’ suit and had filed an appearance. Lord Justice Lloyd, dissenting, agreed with the decision of the judge below that the failure to serve the writ was an omission so serious that it fell outside the ambit of O 2 r 1 and was thus incapable of cure. At 219 ofThe Goldean Mariner, Lloyd LJ explained, It [the service on the 10thdefendant] ismore accurately described as doing nothing. It is no better than serving a blank piece of paper, or a writ in some proceedings in which the person served is not even named as a defendant. The service of the form of acknowledgement cannot make up for the absence of the writ. [emphasis added] 81     Lloyd LJ’s reasoning is compelling. The acknowledgement of service served on the 10th defendant only contained the title of the proceedings and the names of the defendants – there was no indication either of the subject matter of the claim or the time limited for appearance. It was as if nothing had been served at all. Although the jurisdiction of this court under O 2 r 1 is extremely wide, there are nonetheless limits. It extends to all acts performed “in beginning or purporting to begin any proceeding… [in which] there has, by reason of anything done or left undone, been afailure to comply with the requirement of these rules” [emphasis added]. However, I am of the view that an attempt at service which fails to notify the defendant of the claims against him is not a “failure to comply with the requirement of these rules” so much as it is a complete non-starter. 82     That said, the question of whether an attempt can be characterised as non-service is a question of fact. The inquiry is whether the defendant was notified of the claims brought against himandof the appropriate legal steps he needs to take to defend the claim. InAstro(see [56] above), the plaintiff’s Indonesian solicitor attempted to effect service by leaving the documents at the defendant’s registered address. As the bundles were voluminous, the solicitor made two trips. In the first, he left a sealed envelope containing the enforcement orders at the mailing room. In the second (which took place about 90 minutes later), he attempted to deliver a box containing translated copies of all the affidavits connected with the suit. On this occasion, the solicitor was turned away and also asked to take away the sealed envelope (which was unopened) containing the enforcement orders. Ang J found that, on the facts, the defendant had no notice of the subject matter of the enforcement orders or — more crucially — of the defendant’s right to apply to set aside the enforcement order by making the appropriate application to the Singapore court within 21 days. 83     By contrast, the 9th, 12th, and 15th–18thdefendants inThe Goldean Marinerwere each served a copy of the writ, albeit wrongly addressed (see [79] above). In these circumstances I would agree with the Court of Appeal (including Lloyd LJ, who agreed with the majority on this point) that the irregularity in service was one which fellwithinthe scope of O 2 r 1 of the UK RSC 1965: the defendants each knew of the subject matter of the claim against them, of the time limited for appearance and of the forum in which the case was to be heard. The irregularity was thus of a technical nature. 84     I am conscious that my analysis of “Category A” cases treads perilously close to the position which existed before the passage of the 1970 Rules (ie, the distinction between irregularities and nullities). Yet, it seems to me that the law must recognise that there are situations which fall outside the ambit of the Rules and are thus incapable of cure. In the context of service, this certainly occurs where thesine qua nonof service — the notification to the defendant of the subject matter of the claim — has not been achieved. However, even if I were wrong about this falling outside the ambit of O 2, I am still of the view that cases belonging in this category disclose such an error “so fundamental or serious that the court ought not to exercise its discretion under [O 2] r 1 to remedy it” (seeKuah Kok Kim v Chong Lee Leong Seng Co (Pte) Ltd[1991] 1 SLR(R) 795 at [21]).",
        "Category B cases": "85     This category concerns cases where service has been found to be contrary to the law of the foreign jurisdiction and are therefore invalid under O 11 r 3(2). In my view, cases in this category are incapable of cure. 86     As a clarification, there is an important, but sometimes overlooked, distinction between service in a mannernot specifically provided forby foreign law and service which is positivelycontrary toforeign law. The former does not fall within the ambit of r 3(2) at all. The fact that service has been effected in a manner notspecifically provided forby foreign law does not,per se, make the attempt at service invalid. Thus, there is nothing which needs to be cured. In many cases, such as the present, the foreign jurisdiction does not make specific provisions on how foreign process may be served. In such situations, plaintiffs may avail themselves of the other methods of service set out at [58]–[62] above even though service effected through r 3(3) (viaa route specifically provided for the service of foreign process by the law of the jurisdiction) is unavailable. The latter — service which is positively contrary to foreign law — is proscribed by r 3(2). Cases of this sort fall into two groups: (a) cases where the foreign jurisdiction has provided for amandatorymethod of service of foreign process but the plaintiff did not adopt this method of service and employed another instead (eg, in Japan, service of foreign processmustbe effected by the Japanese courts: seeSRS Commerce); and (b) cases where the method of service employed by the plaintiff wasspecifically outlawedby the foreign jurisdiction (eg, service of foreign process by way of private agent is illegal in Switzerland: seePetroval). 87     In my view, the mandatory and imperative nature of r 3(2) excludes the possibility of cure. This is so for two reasons. The first is textual. The language of r 3(2) is categorical: “[n]othing in this Ruleor in any order or direction of the Court made by virtue of itshall authorise or require the doing of anything … contrary to the law of that country” [emphasis added]. Any order providing for the retrospective validation of service would therefore be caught by this provision. I agree with Prof Pinsler (see Jeffrey Pinsler SC,Singapore Court Practice 2014vol I (LexisNexis, 2014) at p 52) when he writes that there are provisions which are framed in such directory terms that a failure to comply with them may not be cured under O 2 r 1. Furthermore, by application of the legal maxim,generalibus specialia derogant(the more specific law takes precedence over the more general — see Oliver Jones,Bennion on Statutory Interpretation(LexisNexis, 6th Ed, 2013) at pp 1038–1040), the specific proscription in r 3(2) should be applied in preference to the general power of cure provided for in O 2 r 1. The second reason is based on international comity. If our court were to cure an irregularity occasioned by a breach of foreign law, then it would be implicitly giving its assent to the breach. Such an act would represent a patent disregard for the law of the foreign state. International comity is a principle of signal importance (seeQ & M Enterprises Sdn Bhd v Poh Kiat[2005] 4 SLR(R) 494 at [25] and [44]) and it demands that our courts not give its sanction to an attempt at service whichexpressly breachesthe law of the foreign jurisdiction (seeBasil Shiblaq v Kahraman Sadikoglu[2004] EWHC 1890 (Comm) at [41]). 88     The case ofAbela and others v Baadarani and another[2013] 1 WLR 2043, although decided in a different statutory context, is instructive. Under r 6.15(2) of the English Civil Procedure Rules 1998 (SI 1998 No 3132) (UK) (“r 6.15(2)”), the English courts have the power to order that “steps already taken to bring the claim form to the attention of the defendant by an alternative method or at an alternative place is good service”, notwithstanding the fact that the steps taken did not adhere to a method of service specifically provided for under the English Civil Procedure Rules 1998. Although we have no direct parallel in our Rules, the use of r 6.15(2) to retrospectively validate the service effected is functionally equivalent to curing an irregularity in serviceviaan exercise of the court’s powers under O 2 of our Rules. The facts need not concern us. What is interesting is the construction that the UK Supreme Court placed on r 6.15(2). At [24] of his judgment, Lord Clarke of Stone-cum-Ebony JSC (with whom the rest of the court agreed) held that the one bar to the exercise of the court’s power under r 6.15(2) is the restriction in r 6.40(4), which reads, “[nothing] in any court order authorises or requires any person to do anything which is contrary to the law of the country where the claim form or other document is to be served.” In other words, the UKSC recognised that the court’s general curative power under r 6.15(2) was constrained by the mandatory proscription contained in r 6.40(4). In a similar vein, I would also hold that the general curative power of our court — conferred by virtue of O 2 r 1 of our Rules — is also constrained by the express restriction contained in O 11 r 3(2). 89     InITC 2011(cited by Mr Chan), the plaintiff served the Singapore-issued writs out of jurisdiction on the first to third defendants (respectively, a company, ITC, and two of its directors, both of whom were resident in India). The plaintiffs effected service on all defendants through the agency of the Indian courts, which despatched a process server to deliver the documents to ITC’s corporate secretarial department. The court found that Indian law specified that if a defendant were a natural person, process had to be served either personally or, failing that, it had to be served on the defendant’s authorised agent. However, service had only been effected on ITC, which was not an authorised agent of the second and third defendants. Thus, service was invalid. Nevertheless, the court went on to cure the irregularity. In doing so, it relied principally on two English decisions:The Goldean MarinerandPhillips and another v Symes and others (No 3) [2008] 1 WLR 180 (“Phillips”). Similarly, inSRS Commerce, the plaintiff effected service of a Singapore writ on the defendants (who were resident in Japan) through registered post. The court held that the service was improper because Japanese lawrequiredthe service of overseas process to be effected through the Japanese Ministry of Foreign Affairs. Nevertheless, the court, relying onITC 2011, exercised his discretion to cure the irregularity. 90     The difficulty with the decision inITC 2011, as pointed out by Prof Pinsler in Jeffrey Pinsler SC,Principles of Civil Procedure(Academy Publishing, 2013) at para 05.036, is that neitherThe Goldean MarinernorPhillipsinvolved service which was contrary to foreign law. InThe Goldean Mariner, the irregularities consisted of the failure to serve the writ (in respect of the 10th defendant) or the service of the writs to the wrong addressees (in respect of the rest of the defendants): see [79] above. InPhillips, the plaintiff obtained leave to serve an English originating process on a defendant in Switzerland. Unfortunately, due to several administrative errors, the original English claim form was mistakenly removed from the package of documents which were eventually handed over to the defendant (although a translated copy in German was included). This was a breach of r 7.5 of the English Civil Procedure Rules 1998, which specified that the claim form itself (ie, the original claim form in English) had to be served on the defendant. NeitherThe Goldean MarinernorPhillipsdealt with the curing of invalid service which had beenexplicitly found to be contraryto the law of the foreign jurisdiction. 91     I am of the view that permitting such irregularities to be cured may encourage litigants to serve writs in a manner which ignores the law of the jurisdiction in question (out of convenience or expediency) in the hope that the service may be retrospectively validated by our courts. This cannot be countenanced. For my part, I would hold that Category B cases are incapable of cure.",
        "Category C cases": "92     The final cluster of cases concerns situations where the service has violated a provision of our Rules. The significant difference between Category B and Category C cases is that the latter do not engage concerns over international comity nor do they violate the specific proscription contained in r 3(2). Thus, in deciding whether irregularities ought to be cured, the court should look at the issue in the round and make the order which best does justice in all the circumstances of the case (seePrinciples of Civil Procedureat para 01.040). In exercising its discretion, the court should consider,inter alia, (a) the blameworthiness of the respective parties; (b) whether the plaintiff had made a good faith effort to comply with the rules; (c) whether the defendant would be prejudiced if the court’s discretion were exercised in the plaintiff’s favour; and (d) the reasons which caused the non-compliance (seeSingapore Civil Procedureat para 2/1/2). 93     InPhillips, the defect consisted of a failure to serve the original copy of the writ. However, this was not the plaintiff’s fault. The foreign process section of the High Court of England had erroneously stamped the original English claim form with the words “Not for service out of jurisdiction” and it was this error which led the Swiss courts to remove the claim form from the package of documents which was handed over to the defendant. However, the defendant knewexactlywhat the claim was about. She had been served with a translated copy of the claim form (and the particulars of claim —ie, the statement of claim, which contained more details than the claim form itself) in German. It was notable that the defendant had, immediately upon receipt of the documents, commenced parallel proceedings in Zurich in the hope that she could steal a march on the plaintiff by obtaining a stay of the English proceedings under the Lugano Convention on Jurisdiction and the Enforcement of Judgments in Civil and Commercial Matters, 16 September 1988, 1659 UNTS 13. In the circumstances, I would have found this case — as Lord Brown of Eaton-Under-Heywood did — to be a compelling call on the exercise of the court’s discretion. 94     Another example of a defect which is capable of cure is the case ofChoo Eng Choon(see [40] above). In that case, the plaintiffs obtained an order for service of a notice of a writ out of jurisdiction. In granting the order, the judge specified that appearance was to be entered within one month of service. The defendant later applied to set aside the service of the notice of the writ on two grounds: first, because the writ erroneously stated that appearance was to be entered within one month of the date of the writ instead of one month from the date of service as ordered; and second, it was not the original writ that was served, but a copy (contravening s 90 of the CPC 1907). There was no application to cure the irregularity but it was a case which, in my view, was fit for cure since the non-compliance involved a technical breach of our Rules (and not any provisions of foreign law on service) which occasioned little, if any, prejudice on the defendant. 95     I would only add that in deciding whether to cure the invalid service, it cannot be sufficient to show that the defendant now knows of the Singapore proceedings. If this were the case, then all irregularities would be cured as a matter of course since the mere fact that service is contested,ipso facto, shows that the defendant is aware of the claim that has been brought against him in Singapore. The application to set aside would thus be self-defeating. Something more is needed to justify the exercise of the court’s discretion.",
        "Conclusion": "96     In the circumstances, the service method employed by the plaintiff on the defendants is valid under O 11 r 3(1). Accordingly, the defendants’ application is dismissed with costs which I fix at $5,000 inclusive of disbursements.",
        "A restatement of the law on service outside jurisdiction": "97     I believe it useful to gather up the various strands of analysis that have been pursued in this judgment into a comprehensive re-statement of the law on the procedural requirements governing the service of process outside jurisdiction, particularly as regards the manner through which service may be effected. Thiscodawill be divided into three parts: first, I will explain the critical importance of proper service; second, I will discuss the relevance of foreign law to an inquiry into the validity of overseas service; and finally, I will sketch out a “roadmap” for litigation on the validity of the service of process overseas. 98     As a clarification, I note that O 11 comprises two parts. The first concerns the grant of leave for service out of jurisdiction (O 11 rr 1 and 2), which is premised on proof that there is sufficient nexus between the claim and this jurisdiction. At this stage, the plaintiff must show that one of the jurisdictional grounds specified in O 11 r 1 exists, that its claim has a sufficient degree of merit, and that Singapore is the proper forum (seeZoom Communications Ltd v Broadcast Solutions Pte Ltd[2014] 4 SLR 500 at [26]). The second concerns the actual service of process abroad, which is governed principally by O 11 rr 3 and 4. It is the latter which will be the focus of this section.",
        "Service as a jurisdictional requirement": "99     A plaintiff who seeks to invoke the jurisdiction of the High Court of Singapore against a foreign defendant must satisfy s 16(1)(a)(ii) of the Supreme Court of Judicature Act (Cap 332, 2007 Rev Ed) (“the SCJA”), which states: Civil jurisdiction — general 16.—(1) The High Court shall have jurisdiction to hear and try any action in personam where — (a) the defendant is served with a writ of summons or any other originating process — (i) in Singapore in the manner prescribed by Rules of Court or Family Justice Rules; or (ii) outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court or Family Justice Rules; or (b) the defendant submits to the jurisdiction of the High Court. [emphasis added] 100    As stated by Sundaresh Menon JC (as he then was) inLee Hsien Loong v Review Publishing Co Ltd and another and another suit[2007] 2 SLR(R) 453 (“Lee Hsien Loong”) at [21], absent the defendant’s voluntary submission to the jurisdiction of this court, “a plaintiff’s jurisdictional title to sue a foreign defendant depends upon the claim falling within the circumstances authorised by the Rules (in other words, the sub-rules of O 11 r 1) as well as upon the writ being served in the manner prescribed by the Rules.” In other words, the jurisdiction of this court over foreign defendants is expressly conferred by statute and service in accordance with O 11 is astatutory condition precedent to the exercise of jurisdictionunder s 16(1)(a)(ii) of the SCJA. Two important points flow from this. Singapore law determines the validity of service 101    The first is that the validity of service — which is a jurisdictional matter — falls to be determined by the law of Singapore (specifically, O 11). This is because questions of jurisdiction must be decided by thelex fori, particularly where jurisdiction is conferred by statute (seeThe “Kapitan Temkin”[1998] 2 SLR(R) 537 at [5]). Furthermore, matters relating to service of process are procedural, which are eminently matters for thelex fori(seePacific Assets Management Ltd and others v Chen Lip Keong[2006] 1 SLR(R) 658 (“Pacific Assets”) at [14]). The plaintiff bears the burden of proof 102    The second is that the burden of proof falls on the plaintiff to establish that the method of service employed complies with O 11. Although there are contrary statements in past cases (see,eg,Pacific Assetsat [12] andReemtsma Cigarettenfabriken GmbH v Hugo Boss AG[2003] 3 SLR(R) 469 at [10]), I respectfully agree with the observation inLee Hsien Loong(at [18]–[21]) that the courts in those cases did not have the benefit of full arguments and that the true position is that the burden ought to lie on the party who is invoking the jurisdiction of this court:ie, the plaintiff.",
        "The relevance of foreign law": "103    As a corollary of the fact that the validity of service is a matter for thelex fori, the provisions of foreign law are relevant only insofar asourlaws make compliance with foreign law relevant. This is why, for example, letters from foreign courts and/orex parteorders made by foreign courts on the validity of the service of Singapore process are of little assistance to this court, which has to assess the validity of service according to our Rules (seePacific Assetsat [14] andAstroat [46]). Under our Rules, foreign law on service plays either arestrictiveorpermissivefunction. Foreign law as a restriction on the validity of service 104    There are two provisions in O 11 rr 3 and 4 which explicitly make reference to foreign law as a limitation on the validity of service. They are rr 3(2) and 4(2)(b). Rule 3(2) states that “[n]othingin this Ruleor in any order or direction of the Court made by virtue of it shall authorise or require the doing of anything in a country in which service is to be effectedwhich is contrary to the law of that country” [emphasis added]. In the same vein, r 4(2)(b) specifies that service of process may be effectedviathe Singapore consular authority “except where service through such an authority is contrary to the law of that country”. Generally speaking, service could be contrary to foreign law in one of two ways (see [86] above): (a) because it failed to comply with a mandatory manner of service of foreign process prescribed by foreign law; or (b) because it had been effected in a manner specifically prohibited by foreign law. 105    Read literally, it might seem that r 3(2) only applies to methods of service provided for in r 3 and not to those in r 4. However, I am of the view that, notwithstanding the literal words of the rule, r3(2)should be read purposively as imposing ageneralrestriction on the service of process outside jurisdiction, whatever the method employed. The basis for the introduction of r 3(2) is the principle of international comity. As observed by Lord Diplock inSiskina (Owners of cargo lately laden on board) v Distos Compania Naviera SA[1979] AC 210 at 240G, “[t]he exercise of this power [to allow the service of writs outside jurisdiction] raises delicate questions of the relationships inter se of sovereign states and of international comity. These are matters with large political implications.” International comity demands restraint in the manner in which service is effected out of jurisdiction. It does not matter that the method of service employed is provided by r 4 instead of r 3. 106    In order to understand why r 3(2) is drafted this way, one has to look at the legislative history of the provision. When r 3(2) was first introduced (as O 11 r 5(2) of the 1970 Rules), the only alternative methods of service provided for in the 1970 Rules outside those found in O 11 r 5 (now O 11 r 3 of the 2014 Rules) were service through the judicial authorities, service through the government of the foreign country, or service through a Singapore consular authority (O 11 rr 6(1) and 6(2) of the 1970 Rules). The first two methods of service rely on the agency of the organs of the foreign state (which can safely be assumed will always act in accordance with the law of their own state) while service through a Singapore consular authority was only permissible subject to the proviso that it be effected according to the terms of the relevant Civil Procedure Convention to which the foreign state was a party (O 11 r 6(1)(b)) or the requirement that it cannot contravene the law of the foreign country (O 11 r 6(2)(b)). Thus, there was no need for the wording of O 11 r 5(2) of the 1970 Rules to encompass methods of service provided for in O 11 r 6. This changed when O 11 r 6(2)(c) (now r 4(2)(c)) was introduced in 1991 since it contemplated the recognition of service by private means. However, our courts have always consistently held that the restriction in r 3(2) applies even where the plaintiff attempts to effect service of process under r 4(2)(c): seeFortuneat [32],ITC 2011at [22]. This supports my conclusion that a broad reading of r 3(2) should be adopted. Foreign law as providing for a permissible method of service 107    Rule 3(3) provides that “[a]n originating process which is to be served out of Singapore need not be served personally on the person required to be served so long as it is served on him in accordance with the law of the country in which service is effected.” The expression “in accordance with the law of the country in which service is effected” in r 3(3) could give rise to varying interpretations. It could be construed as (a) a reference to a method of servicespecifically provided forby the foreign jurisdiction for the service offoreign process; (b) servicespecifically provided forby the foreign jurisdiction for the service ofdomestic process; or (c) service which isnot contraryto the law of the foreign jurisdiction. 108    Interpretation (b) would render r 3(3) superfluous since r 4(2)(c) already specifically provides that service in a manner provided for by foreign law for their domestic process is a permitted method of service under our Rules. Interpretation (c) would render the specific methods of service provided for in rr 3 and 4 otiose since it would permit service inanyform, as long as it is notspecifically proscribedby the foreign jurisdiction. Thus, interpretation (a) must be the right one. It is also entirely consistent with the principle of international comity that we respect the prerogative of other states to make provisions for how foreign process will be served within their jurisdiction.",
        "Challenging the propriety of service: O 11 litigation": "109    As the plaintiffs always bear the burden of proving that service had been validly effected, they have to establish the following: (a)     First, they have to identify exactly which method of service they are relying on (see [59]–[62] above). If they had effected service by a method specifically provided for by that jurisdiction for foreign process (r 3(3)) or by that jurisdiction for the service of domestic process (r 4(2)(c)), they will necessarily have to lead evidence on the content of the supporting foreign law. (b)     Second, they have to prove that service had been validly effectedviathe identified method. For example, if they had effected substituted service, they must demonstrate compliance with the terms of the order granting leave for substituted service. In order to prove that service had been validly effected, the plaintiffs must tender either a memorandum of service under O 10 r 1(4) or an official certificate under O 11 r 3(4), as the case may be. Whatever the method of service employed, it cannot be in contravention of the law of the foreign jurisdiction in question (r 3(2)). (c)     Third, if the service were proven to be invalid, they have to show that the non-compliance with the Rules can and should be cured under O 2 r (1). Sufficient evidence must be placed before the court to justify the exercise of its discretion to cure the defect in service. 110    Defendants challenging the validity of service may do so through three principal routes: (a)     First, they can demonstrate that service had not, despite the attempt, been effected. For example, in the case of personal service, they may show that the attempt at service had not been successful in giving the defendant notice of the claim (eg, inAstro— see [82] above). In the case of substituted service, the defendants may show that service had been effected in a manner not provided for in the order granting leave. (b)     Second, they can demonstrate that the method of service employed was not one that is provided for under the law of the foreign jurisdiction. This only applies to service purportedly carried out under rr 3(3) or r 4(2)(c). The case ofLee Hsien Loongis a good example of a challenge to a service under r 4(2)(c). InLee Hsien Loong, the plaintiff sued the two defendants and obtained leave to serve the writs out of jurisdiction. The plaintiff had effected service on both defendants in Hong Kong by way of a process server who left the documents at the registered office of the first defendant (a company) and personally served the writ on the second. It was undisputed that these were methods of service permitted for the service of domestic writs under Hong Kong law. The plaintiff argued that it had therefore effected valid service under r 4(2)(c) of our Rules. The defendant argued that the plaintiff could not avail himself of r 4(2)(c) because the People’s Republic of China was a country with whom Singapore had concluded a Civil Procedure Convention so r 4(1) and not r 4(2) ought to apply instead. (c)     Third, the defendants can demonstrate that service was contrary to the law of the jurisdiction in question, thus violating r 3(2). (d)     Finally, in response to the plaintiff’s attempt to cure an invalid service, the defendants can show that the invalid service is one which is either not curable under O 2 r (1) of the Rules or that, even if curable, the court’s discretion should not be exercised. In doing so, they ought to have regard to the factors that I have set out at [78]–[95] above. 111    It is my hope that this judgment has provided sufficient clarity on the procedural requirements governing service out of jurisdiction, obviating or at least reducing the need for lengthy and protracted interlocutory tussles over this issue in the future.  [note: 1]Statement of Claim dated 18 August 2014 (“SOC”) at para 6. [note: 2]SOC at paras 1 – 5. [note: 3]SOC at para 11. [note: 4]SOC at para 119. [note: 5]SUM 4577/2014, found at the plaintiff’s Bundle of Documents (“PBOD”), Tab 2. [note: 6]Affidavit of Kristian Takasdo dated 9 October 2014. [note: 7]Affidavit of Kristian Takasdo at paras 6 and 8. [note: 8]Affidavit of Kristian Takasdo at paras 7 and 9. [note: 9]Minute sheet of Steven Chong J dated 16 March 2015 at p 1, para 8. [note: 10]PBOD, Tab 4. [note: 11]SUM 5543/2014 found at PBOD, Tab 5. [note: 12]Defendants’ written submissions at para 9. [note: 13]Defendant’s written submissions at paras 14 and 15. [note: 14]Defendants’ written submissions at para 31. [note: 15]Defendant’s written submissions at para 31. [note: 16]Defendant’s written submissions at para 32 – 45. [note: 17]Defendant’s written submissions at paras 47 and 48. [note: 18]Defendant’s written submissions at para 46. [note: 19]Defendant’s written submissions at para 52. [note: 20]Plaintiff’s written submissions at paras 4.1 and 4.2. [note: 21]Plaintiff’s written submissions at paras 8.1 and 8.2. [note: 22]Plaintiff’s written submissions at paras 5 and 6. [note: 23]Plaintiff’s written submissions at para 8.2. [note: 24]Minute sheet of Steven Chong J dated 16 March 2015 at p 4, para 8. [note: 25]Minute sheet of Steven Chong J dated 16 March 2015 at p 3, paras 7 and 8. [note: 26]Plaintiff’s written submissions at para 9. [note: 27]Winarta’s 1stAffidavit at pp 44–45. [note: 28]Affidavit of Tony Budijaja dated 19 December 2014 (“Budijaja’s 1stAffidavit) at p 63. [note: 29]Minute sheet of Steven Chong J dated 16 March 2015 at p 4, para 5. [note: 30]Budijaja’s 1stAffidavit at para 11. [note: 31]Affidavit of Dr Frans Hendra Winarta dated 4 November 2014 (“Winarta’s 1stAffidavit”) at p 52. [note: 32]Winarta’s 1stAffidavit at p 54. [note: 33]Minute sheet of Steven Chong J dated 16 March 2015 at p 2, para 3. [note: 34]Defendant’s written submissions at para 55. [note: 35]Affidavit of Dr Frans Hendra Winarta dated 13 February 2015 at p 25."
    }
}