{
    "case_title": "AREIF (Singapore I) Pte Ltd\n      v\n      NTUC Fairprice Co-operative Ltd and another matter",
    "ncitation": "[2015] SGHC 28",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "The parties": "1       This case turns on the proper construction of an option to renew a lease. The option appears in a lease between AREIF (Singapore I) Pte Ltd (“AREIF”) and NTUC Fairprice Co-operative Ltd (“NTUC”). AREIF is the landlord under the lease. AREIF’s position is that it is under no obligation to grant NTUC a new lease pursuant to the option because AREIF and NTUC could not agree the rent that NTUC was to pay under the new lease and because NTUC failed to sign a document embodying the terms of the new lease within the period prescribed in the option. NTUC is the tenant under the lease. NTUC asserts that it is entitled to a new lease pursuant to the option because it has fulfilled all the conditions precedent to trigger AREIF’s obligation to grant it one. NTUC’s position is that the two issues upon which AREIF relies are not conditions precedent to AREIF’s obligation to grant NTUC a new lease. 2       For the reasons which follow, I accept AREIF’s submissions and hold that AREIF owes no obligation to grant NTUC a new lease. As a result, I dismiss NTUC’s claim for specific performance of AREIF’s obligation to grant NTUC a new lease and allow AREIF’s claim for possession of the demised premises and for a mandatory injunction requiring NTUC to deliver vacant possession upon expiry of the lease. NTUC has appealed to the Court of Appeal against my decision. I therefore now set out the grounds for my decision.",
        "The option to renew": "3       The lease is dated 2 August 2011. Under it, AREIF let to NTUC the premises known as 111 Somerset Road, Unit #01-04/04A/05/06/07/08/09, TripleOne Somerset, Singapore 238164 for a term of four years from 1 April 2010 to 31 March 2014 (both dates included) at $53.82 per square metre per month (“psm”) being the combined rent and service charge.[note: 1] 4       The option on which this case turns is found at cl 6.15(a) of the lease. The option is in the following terms:[note: 2] 6.15Option to Renew (a)    If the Tenant makes a written request not less than six (6) months nor more than nine (9) months before the expiration of the Term and at the time of such request, there is no existing breach or non-observance of any of the terms and covenants on the part of the Tenant contained in this Lease, the Landlord shall grant to the Tenant a new lease of the Demised Premises at the cost and expense of the Tenant, subject to the following conditions: (i)    the new lease shall be for a term offour (4)years (the “New Term”) commencing from the day following the date of expiry of the Term; (ii)   the rent payable for the New Term (the “New Rent”) shall be at an aggregate Monthly Rent and Monthly Service Charge of not exceeding Singapore Dollars Eighty Seven And Cents Eighty Four Only (S$87.84) per square metre per month of the floor area; (iii)   the amount payable as the monthly service charge shall be determined by the Landlord; (iv)   The Tenant shall be granted a one month rent free period in the 1st month of the renewal term; (v)    the new lease shall contain no option for renewal; (vi)   the new lease shall contain such covenants and provisions as shall be imposed by the Landlord; and (vii)  the new lease must be signed by the Tenant at a date not later than four (4) months before the expiration of the Term. [emphasis in original in bold] 5       I draw attention to three features of the option: (a)     The body of cl 6.15(a) provides that AREIF “shall grant…a new lease” to NTUC if: (i) NTUC makes a written request to AREIF for a new lease between 1 July 2013 and 30 September 2013 (both dates included) and; (ii) NTUC is not, at the time of the request, in breach of the lease. (b)     Clause 6.15(a)(ii) provides that the rent under any new lease cannot exceed $87.84 psm (comprising both the rent and the service charge).  Although cl 6.15(a)(ii) says nothing about how that rent is to be determined, it is common ground that the rent is to be determined by agreement between the parties. (c)     Clause 6.15(a)(vii) provides that the new lease must be signed by NTUC no later than four months before the term expires on 31 March 2014,ieon or before 30 November 2013. 6       It is not in dispute that the two conditions in the body of cl 6.15(a) were satisfied. It is also not in dispute that NTUC and AREIF failed to agree rent (cfcl 6.15(a)(ii)) and NTUC failed to sign a new lease (cfcl 6.15(a)(vii)) on or before 30 November 2013. The simple question on which the parties’ dispute hinges is whether, on a proper construction of cl 6.15(a), AREIF’s obligation to grant NTUC a new lease arises as soon as the two conditions in the body of cl 6.15(a) are satisfied or whether, in addition, the two conditions in cl 6.15(a)(ii) and (vii) must also to be satisfied.",
        "Factual background": "7       On 29 July 2013,[note: 3]NTUC made a written request to AREIF for a new lease. This request, as I have said, complied with both conditions set out in the body of cl 6.15(a). 8       Following NTUC’s request, the parties tried to agree the rent that NTUC was to pay AREIF under the new lease. AREIF started the discussions on 29 August 2013. It proposed that NTUC pay rent at of $87.84 psm (or $8.16 per square foot per month (“psf”)).[note: 4]That was the maximum rent that NTUC could be asked to pay under cl 6.15(a)(ii). NTUC responded on 4 October 2013. It counter-proposed that: (a) it pay an average of $6.98 psf (or $75.13 psm) over four years; (b) that the new lease contain an option for a further renewal of four years; and (c) that any increase in rent in that further renewal be capped at 15%.[note: 5]These last two requests were NTUC’s attempt to improve the terms of the new lease beyond what it was entitled to under cl 6.15(a). Clause 6.15(a)(v) expressly provides that there was to be no further renewal. Consequently, no question of a cap on rent in that further renewal could arise. 9       On 17 October 2013, AREIF offered NTUC an average rent of $7.40 psf (or $79.66 psm) over four years with no further option to renew and, as a consequence, no cap on any increase in the rent in that further renewal.[note: 6]On 30 October 2013, NTUC counter-proposed $5.35 psf (or $57.59 psm) on the basis that it had had not yet recovered its capital expenditure incurred at the outset of the existing lease and wished to do so over the term of a new lease. NTUC further reiterated that the new lease should contain both an option to renew for another four years and a cap of 15% on any rent increase.[note: 7] 10     AREIF believed that its last proposal of $7.40 psf (or $79.66 psm) was already below the market rent of between $7.50 psf and $8.00 psf (between $80.73 psm and $86.11 psm).[note: 8]On 15 November 2013, each party asked the other by email to reconsider its position on rent. On 27 November 2013, AREIF notified NTUC that “other parties are interested in the space and that [AREIF is] seeking a minimal rental rate of the high $7+psf range”.[note: 9] 11     Meanwhile, unbeknownst to NTUC, AREIF had started discussions on 6 November 2013 with Cold Storage Singapore (1983) Pte Ltd (“Cold Storage”) about the possibility of Cold Storage leasing the premises after NTUC’s lease had expired on 31 March 2014. AREIF says that it did this because the gap between the parties on rent was widening rather than narrowing and because AREIF thought it unlikely that there would be agreement on rent on or before 30 November 2013.[note: 10]AREIF’s discussions with Cold Storage eventually bore fruit. On 22 November 2013, AREIF issued a letter of offer to Cold Storage, offering it a lease of the premises for five years at an average rent of $7.74 psf (or $83.31 psm).[note: 11] 12     On 28 November 2013, NTUC offered AREIF rent at $5.50 psf (or $59.20 psm).[note: 12]Although slightly higher than NTUC’s offer of 30 October 2013, this offer was still substantially below NTUC’s initial offer on 4 October 2013 and substantially below the maximum rent prescribed by cl 6.15(a)(ii). 13     On 29 November 2013, AREIF responded to NTUC as follows: “Thank you for the updated offer. We will take it up with management for consideration and get back to you”.[note: 13]AREIF states quite candidly that it said this to NTUC – instead of rejecting NTUC’s offer outright – so that it could come back to NTUC if the potential lease of the premises to Cold Storage fell through.[note: 14] 14     The next day, 30 November 2013, was the deadline under cl 6.15(a)(vii) for a new lease to be signed by NTUC. Nothing was signed. NTUC sent emails on 16 December 2013, 26 December 2013, 8 January 2014 and 20 January 2014 to AREIF inquiring about AREIF’s response to NTUC’s last proposal. In response, AREIF told NTUC by emails dated 17 December 2013 and 22 January 2014 that its management was still considering NTUC’s last proposal.[note: 15] 15     Meanwhile, on 18 December 2013,[note: 16]Cold Storage accepted AREIF’s letter of offer. AREIF and Cold Storage then began negotiating their lease. They eventually reached agreement on the terms of their lease on 4 February 2014.[note: 17]That agreement included AREIF’s commitment that it would deliver to Cold Storage vacant possession of the premises on 2 April 2014, one clear day after the expiry of the term of the lease on 31 March 2014. 16     So it was that on 6 February 2014, AREIF informed NTUC that it took the position that NTUC’s option to renew the lease had lapsed because there had been no agreement on rent as envisaged by cl 6.15(a)(ii) and no new lease had been signed by NTUC on or before 30 November 2013 as required by cl 6.15(a)(vii). AREIF reminded NTUC that it was obliged to reinstate the premises and deliver vacant possession to AREIF on or before 31 March 2014.[note: 18] 17     NTUC was understandably dismayed. It responded to AREIF on 7 February 2014 asserting that, because AREIF had not responded to NTUC since AREIF’s email of 29 November 2014, the parties were still in negotiation on rent. NTUC’s position was that AREIF could not make a unilateral decision not to renew the lease.[note: 19]NTUC now volunteered to renew the lease at the maximum rent of $87.84 psm as provided in cl 6.15(a)(ii).[note: 20]This is what AREIF had suggested at the very outset of the negotiations on 29 August 2013 and was almost 50% above NTUC’s last proposal. And although NTUC had no way of knowing that at the time, it was in nominal terms more than 5% above the rent that Cold Storage had agreed to pay AREIF. 18     From AREIF’s perspective, NTUC’s offer to pay the maximum rent came too late. AREIF was already committed to Cold Storage. AREIF and Cold Storage executed a lease of the premises on 7 February 2014.[note: 21]",
        "The parties commence proceedings": "19     Each party then commenced separate proceedings against the other. AREIF was the first to commence proceedings. It did so on 13 March 2014. AREIF’s position is that it was under no obligation whatsoever to NTUC to renew the lease and that NTUC was obliged to reinstate and deliver up the premises as soon as the current lease expired, at midnight on 31 March 2014. Accordingly, in Originating Summons No 244 of 2014 (“OS244”), AREIF sought: (a) vacant possession of the premises by midnight on 31 March 2014; and (b) an order for possession of the premises effective 1 April 2014. Concerned about potential liability to Cold Storage, AREIF also sought an order that NTUC indemnify it against all claims should NTUC fail to deliver up vacant possession of the premises to AREIF upon the expiry of the term. 20     NTUC commenced proceedings three days later, on 17 March 2014. NTUC’s position was that AREIF had breached a contractual obligation to grant NTUC a new lease. Accordingly, in Originating Summons No 248 of 2014 (“OS248”), NTUC sought an order for specific performance of AREIF’s obligation pursuant to cl 6.15(a) of the lease to grant NTUC a new lease of the premises for a further term of four years from 1 April 2014 to 31 March 2018 at a rent of $87.84 psm. NTUC also sought an interlocutory injunction to restrain AREIF from excluding NTUC from the premises – or in any other way interfering with NTUC’s quiet enjoyment of the premises – until OS248 could be heard and determined. 21     The parties’ respective applications in OS244 and OS248 are mirror images of each other. If one application succeeds, the other application necessarily fails. I therefore heard the two applications together with all evidence in one being evidence in the other.",
        "The parties’ positions": "22     AREIF accepts that NTUC validly rendered its option exercisable on 29 July 2013. But it submits that the conditions precedent which give rise to an obligation binding AREIF to grant NTUC a new lease have not been satisfied. In order for that obligation to arise, AREIF says, each of the seven conditions enumerated in cll 6.15(a)(i) to (vii) must be satisfied.[note: 22]On the facts summarised above, two conditions were not satisfied: (a) the parties did not agree on rent; and (b) NTUC did not sign a new lease by 30 November 2013. Further, AREIF submits, once 30 November 2013 passed without NTUC signing a new lease, the condition in cl 6.15(a)(vii) could never be fulfilled. The result is that NTUC’s option is no longer capable of being exercised and, in that sense, has lapsed. 23     NTUC, on the other hand, submits that it validly exercised its option to renew the lease on 29 July 2013.[note: 23]On NTUC’s view, the seven enumerated limbs of cl 6.15(a) are not conditions precedent to ARIEF’s obligation at all. Its case is that the only two conditions precedent which must be satisfied to give rise to ARIEF’s obligation to grant NTUC a new lease are found in the body of cl 6.15(a). NTUC satisfied those conditions on 29 July 2013. Clause 6.15(a)(i) to (vii) merely set the parameters for the terms of the lease that AREIF became obliged to grant NTUC on 29 July 2013.",
        "Decision in summary": "24     In summary, I dismiss NTUC’s claim for specific performance and allow AREIF’s claim for possession of the premises upon the expiry of the term for the following reasons: (a)     NTUC’s construction of cl 6.15(a) ignores the plain words of cl 6.15(a) and is uncommercial; and (b)     AREIF’s construction does not render NTUC’s option illusory. 25     Having adopted AREIF’s construction of cl 6.15(a), I hold that AREIF’s obligation to grant NTUC a new lease never arose because: (a)     It cannot be said that the reason the conditions set out in cll 6.15(a)(ii) and 6.15(a)(vii) were not satisfied on or before 30 November 2013 was because AREIF breached one of its express or implied obligation under the option; and (b)     AREIF did not waive its right to insist on compliance with cl 6.15(a)(vii) as a condition precedent to its obligation to grant NTUC a new lease.",
        "AREIF’s construction of cl 6.15(a) is correct": "",
        "NTUC’s construction of cl 6.15(a) ignores its plain words": "26     NTUC’s submission that the seven limbs of cl 6.15(a) are not conditions which must be satisfied in order for NTUC validly to exercise its option to renew the lease is contrary to the clear words of that clause. The body of cl 6.15(a) ends with the following words which introduce those seven limbs: “[AREIF] shall grant to [NTUC] a new lease of the Demised Premises…subject to the following conditions”. The verb “shall” is clearly used to embrace an imperative. It makes clear that AREIF is under an obligation. But the word “shall” does more than just that. Taken together with the words “subject to the following conditions”, it also imports futurity. It indicates that AREIF has an obligation to grant NTUC a new lease, but one that is to arise (iein the future) and which is “subject to” the conditions which follow. Thus, cl 6.15(a), as a matter of language, frames AREIF’s future obligation to grant NTUC a new lease as being conditional upon the seven limbs. Further, the seven limbs are cumulative. That is indicated by the conjunction “and” appearing between cl 6.15(a)(vi) and cl 6.15(a)(vii). 27     All of this taken together means that, as a matter of language, it is if –and only if– all seven of those conditions are satisfied that AREIF “shall grant to [NTUC] a new lease”. It follows, then, that if any one of these seven conditions is not satisfied, AREIF’s obligation to grant NTUC a new lease simply does not arise. 28     Clause 6.15(a) would have to look quite different for NTUC’s construction of it to be correct as a matter of language. It would, first, have to make AREIF’s obligation to renew the lease an unconditional imperative, by ending cl 6.15(a) without any concept of conditionality or futurity. Second, it would have to frame the seven limbs of cl 6.15(a) as independent, standalone obligations. Thus framed, it would read as follows: 6.15Option to Renew (a)    If the Tenant makes a written request not less than six (6) months nor more than nine (9) months before the expiration of the Term and at the time of such request, there is no existing breach or non-observance of any of the terms and covenants on the part of the Tenant contained in this Lease, the Landlord shall grant to the Tenant a new lease of the Demised Premises at the cost and expense of the Tenant, subject to the following conditions:. (ib)theThe new lease shall be for a term of four (4) years (the “New Term”) commencing from the day following the date of expiry of the Term.; (iic)theThe rent payable for the New Term (the “New Rent”) shall be at an aggregate Monthly Rent and Monthly Service Charge of not exceeding Singapore Dollars Eighty Seven And Cents Eighty Four Only (S$87.84) per square metre per month of the floor area.; (iiid)theThe amount payable as the monthly service charge shall be determined by the Landlord.; (ive)TheTenant shall be granted a one month rent free period in the 1st month of the renewal term.; (vf)  the The new lease shall contain no option for renewal.; (vig)theThe new lease shall contain such covenants and provisions as shall be imposed by the Landlord.; and (viih)theThe new lease must be signed by the Tenant at a date not later than four (4) months before the expiration of the Term. 29     This would be a very different clause to the one which NTUC and AREIF actually agreed. Construing the existing cl 6.15(a) as though it were drafted as set out above, as NTUC advocates, disregards entirely the parties’ choice of language to express their agreement.",
        "NTUC’s construction of cl 6.15(a) is uncommercial": "30     In addition to being unsustainable as a matter of language, NTUC’s construction of cl 6.15(a) is uncommercial. NTUC submits that AREIF came under an immediate and irreversible obligation on 29 July 2013 to grant NTUC a new lease. The corollary is that NTUC also was immediately and irreversibly obliged on and from 29 July 2013 to take a new lease. But at what rent? NTUC accepts that the parties deliberately did not fix the rent for the new lease when they signed the initial lease in 2011, but chose instead to leave that for future agreement. What if the parties were unable to agree the rent to be paid under this lease to which they were already bound? NTUC is driven to take the position that, in that event, NTUC was bound to pay AREIF the maximum rent stipulated in cl 6.15(a)(ii). This submission cannot be correct. 31     If the true effect of cl 6.15(a) was to bind NTUC to a lease at the maximum rent even before negotiations on rent began, AREIF would have absolutely no incentive in those negotiations to propose, let alone to agree, a rent lower than the maximum. It would be AREIF who then had the option unilaterally to determine the rent. There is no commercial reason for two sophisticated entities dealing at arm’s length in 2011 to frame cl 6.15(a)(ii) as stipulating that the rent for their new lease in 2014 should be agreed failing which it would be the stipulated maximum, when there was no practical scope for any agreement that it should be anything less than that maximum. If that is what the parties envisaged, cl 6.15(a)(ii) would merely have fixed the rent at $87.84 psm. In other words, if NTUC’s construction is correct, there is no reason the parties stipulated in cl 6.15(a)(ii) amaximumrent rather than afixedrent.",
        "AREIF’s construction is natural and commercial": "32     AREIF’s construction, on the other hand, is both natural and commercial. Clause 6.15(a) divides the renewal process into three phases. In the first phase, NTUC has the right (but not the obligation) to render its option exercisable by making a timely written request to AREIF to renew the lease at a time when NTUC is not in breach of the lease. In the second phase, the parties try to reach agreement on rent. Rent is the only one of the six prescribed terms of the new lease which is neither agreed in advance (cll 6.15(a)(i), (iv) and (v)) nor in AREIF’s unilateral control (cll 6.15(a)(iii) and (vi)). That is not to say, of course, that the parties are precluded from negotiating during this phase terms of the lease other than the six terms prescribed by cll 6.15(a)(i) to (vi). They are undoubtedly free to make proposals and counterproposals on all terms. But all of that takes place in the shadow of cl 6.15(a). So long as what they are discussing is a renewal pursuant to the option, no party can compel the other to accept any term that is prohibited by one of those six limbs or which is not prescribed in one of those six limbs. In the third phase, the lease is documented and signed by NTUC. To be effective, that must be done on or before 30 November 2013 as stipulated by cl 6.15(a)(vii). It isonlywhen all three phases are complete that NTUC secures its new lease. Until that moment, NTUC is entirely at liberty to walk away from a new lease. 33     On this view, the parties had a clear commercial purpose in stipulating a maximum rent in cl 6.15(a)(ii). That purpose is consistent with the nature of an option. After NTUC’s option becomes exercisable, cl 6.15(a)(ii) contemplates a period of time during which AREIF is contractually obliged to accept the stipulated maximum rentif NTUC chooses to offer it, while NTUC is contractually free to propose a rent which is lower than the maximumeven if AREIF offers the maximum. On this construction, AREIF has a clear incentive to accept a lower rent. During this period, NTUC is not yet bound to a new lease. AREIF’s incentive to agree a lower rent is that by doing so, it can persuade NTUC to remain in possession as a sitting tenant, and it can avoid the transaction costs and possible void period which would result if NTUC vacated the premises and AREIF had to search for a new tenant. All of this is in keeping with the unilateral nature of an option: the grantee (NTUC) has only rights; the grantor (AREIF) has only obligations. The effect of cl 6.15(a)(ii) is that until the parties reach agreement on rent, cl 6.15(a)(ii) is not satisfied and NTUC’s entitlement to a new lease simply does not arise. 34     That this is the more commercial construction is clear from the fact that this is how these two substantial commercial entities actually conducted themselves on and after 29 July 2013. This is why they both entered into a discussion on the rent after NTUC made the request for a new lease. AREIF proposed the maximum rent and then, after NTUC’s counter-offer, proposed a rent lower than the maximum (see [8] above). That is something which AREIF would have had no incentive to do on NTUC’s construction. 35     It is clear from the tenor of the parties’ correspondence that they viewed what they were undertaking, starting with AREIF’s offer of the stipulated maximum rent on 29 August 2013, as agreeing a rent which would applyif there were to be a new lease. They did not see themselves as negotiating rent under a new lease which already bound NTUC, and under which NTUC was already bound to pay the maximum rent unless otherwise agreed. It is significant that, when AREIF told NTUC on 6 February 2014 that it was not bound to grant NTUC a new lease, NTUC did not assert in any contemporaneous correspondence that AREIF had been bound since 29 July 2013 to grant NTUC a new lease. NTUC’s construction is a clear afterthought.",
        "AREIF’s construction does not render the option illusory": "36     NTUC submits that AREIF’s construction – the construction which I accept to be correct – renders NTUC’s option to renew illusory. AREIF could prevent any contractual obligation to grant NTUC a new lease from arising simply by refusing to negotiate or agree a rent. I do not accept this submission. An option is rendered illusory only if the grantee of the option is denied a right which is an essential characteristic of an option and for which he bargained. NTUC bargained for a contractual right to a new lease, but did not bargain for a fixed rent. NTUC bargained only for a contractual right to a new lease at a rent no higher than the maximum. So if AREIF refuses to negotiate or to agree a rent, or stubbornly insists on the maximum rent, NTUC can still satisfy cl 6.15(a)(ii) by agreeing to the maximum rent. AREIF has no right to try and improve upon this rent, and its assent to that rent for the purposes of cl 6.15(a)(ii) is presumed. If, at the same time, NTUC seeks only the terms prescribed by cl 6.15(a) for the new lease and is ready, willing and able to sign a document embodying it on or before 30 November 2013, NTUC can argue with justification that it has triggered its entitlement to a new lease, or at the very least that AREIF is precluded from arguing that NTUC has not. But all of that is quite far removed from what happened here. 37     In support of its submission that AREIF’s construction renders NTUC’s option to renew illusory, NTUC cites two English cases:Corson and others v Rhuddlan Borough Council(1990) 59 P & CR 185 (“Corson”) andLittle v Courage Ltd[1995] CLC 164 (“Little”). Neither case assists NTUC. Corson 38     InCorson, a lease contained an option for the tenant to renew the lease at a rent to be agreed subject to a maximum of £1,150 per annum. The tenant declared itself willing to pay the maximum rent from the very outset. The landlord wanted to free itself from the stipulated maximum rent in order to seek an even higher rent, the market having risen. It therefore argued that the entire option was void for uncertainty. It was common ground inCorsonthat if the option to renew was not void for uncertainty, it had been validly exercised. The English Court of Appeal – with respect, quite rightly – had no difficulty in holding that the option was sufficiently certain to be enforced. 39     Whether NTUC’s option is sufficiently certain to be enforced is not in issue. Unlike the landlord inCorson, AREIF does not allege that cl 6.15(a) is void for uncertainty and never attempted to extract a rent from NTUC higher than AREIF had bargained for. AREIF alleges simply that two critical conditions precedent for NTUC’s entitlement to a new lease to arise have not been satisfied. 40     In any event, the proposition for whichCorsonstands is not the proposition which NTUC needs to establish in order to succeed.Corsonstands for the proposition that an option to renew which provides for the parties to agree a rent subject to a maximum is not void for uncertainty, and a notice by thetenantcalling for a new lease at that maximum is a valid and effective exercise of the option obliging the landlord to grant a new lease. In the present case, NTUC’s very first step in the rent negotiations was to reject AREIF’s offer of the maximum (see [8] above). If NTUC had instead then accepted AREIF’s offer, it would have been clear beyond argument that the condition in cl 6.5(a)(ii) had been satisfied. NTUC undoubtedly had the right to try to agree a lower rent. But by doing that, NTUC left one condition precedent unsatisfied, and, it appears, failed to notice that another condition precedent as to time was counting down in the background. By the time NTUC made an unqualified offer to AREIF to renew at the maximum rent on 7 February 2014, the condition as to time in cl 6.15(a)(vii) could no longer be satisfied. NTUC’s acceptance of the maximum rent was therefore wholly ineffective to trigger any obligation on AREIF’s part to grant a new lease. Little 41     Another case that NTUC relies on is the decision of the English Court of Appeal inLittle. NTUC cites the following proposition from the judgment of Millett LJ (as he then was) at 168: 9.    In construing an option the court will endeavour to ascertain the true intentions of the grantor as expressed in the words which he has chosen. The whole point of an option is that the grantor undertakes to grant an interest to the grantee in the future if the grantee calls on him to do so, whether the grantor is then willing to grant it or not. The court will struggle to avoid a construction which would render the option illusory by making it impossible for the grantee to exercise it unless the grantor were willing to grant the interest anyway. 42     That proposition is undoubtedly true: the defining characteristic of an option is that the grantee thereby secures a right which is valuable precisely because he may exercise it in the future regardless of the grantor’s consent. ButLittleis of no assistance to NTUC because it is an unusual case which turns on its own facts. 43     InLittle, the tenant’s option to renew a lease became exercisable. The grant of the new lease was subject to a condition that the parties at the same time renew the business agreement which governed the conduct of the tenant’s business on the demised premises. The landlord was initially willing to renew both the lease and the business agreement. It then had a change of heart and refused to negotiate a new business agreement with the tenant. That condition could not, therefore, be satisfied. Millett LJ considered the effect of the landlord’s conduct. He first held (at 168–169) that there was no express or implied term which obliged the landlord to negotiate a new business agreement. So the landlord was not in breach of contract. Millett LJ then held (at 170) that, the landlord having committed no wrong, the principle that a party will not be allowed to take advantage of its own wrong could not operate to prevent the landlord from claiming that the condition requiring a new business agreement had not been satisfied. 44     Given these holdings, the only remaining way in which the tenant could secure a new lease under the option was if the option could somehow be construed so as to dispense with compliance with the condition. Millett LJ was able to do just that. He held, on the true construction of the condition and on the facts before him, that the tenant did not need to satisfy that condition in order to become entitled to a new lease. First, he found (at 171) that the process envisaged by the parties for the new business agreement was entirely one-sided: at renewal, the landlord was to present the new business agreement to the tenant as a take it or leave it proposition. On that basis, Millett LJ held that the condition requiring a new business agreement was essentially for the landlord’s benefit (at 172). That allowed Millet LJ to imply a proviso to that condition precedent, such that the tenant had to agree a new business agreement onlyif the landlord required the tenant to do so. Second, the landlord made a crucial admission (at 167) that it had “refused to enter into negotiations for a new business agreement … and [the tenant] was given no opportunity to agree either.” It is only because of these two essential features that Millett LJ found himself able to hold, on a remarkably generous construction, that the condition in question did not have to be satisfied in order for the landlord’s obligation to grant the tenant a new lease to arise. He therefore held that the tenant was entitled to a new lease. 45     NTUC submits that the construction which Millett LJ adopted inLittleapplies in the present case to dispense with compliance with cl 6.15(a)(vii). Thus, NTUC argues that cl 6.15(a)(vii) is a condition which on its true construction merely requires NTUC to sign a new lease by 30 November 2013 onlyif AREIF requires NTUC to do so. AREIF never required NTUC to sign a new lease: indeed, it failed entirely to present a new lease to NTUC for signature. Therefore, notwithstanding non-satisfaction of cl 6.15(a)(vii), NTUC is entitled to a new lease. I cannot accept that submission. It is impossible to liken cl 6.15(a)(vii)’s requirement that NTUC sign a new lease by 30 November 2013 to the condition inLittlerequiring the parties to agree a new business agreement. 46     First, the only purpose of the condition inLittlewas to yield a new business agreement. It is not the only purpose of cl 6.15(a)(vii) to yield a document embodying the parties’ new lease with NTUC’s signature upon it. At least part of the purpose of cl 6.15(a)(vii) is to set a long-stop deadline of 30 November 2013 for the entire lease renewal process and, by implication, for NTUC’s right to renew. 47     Second, Millett LJ found inLittlethat the new business agreement was essentially for the landlord’s benefit. That is not the case with the long-stop date fixed by the condition in cl 6.15(a)(vii). Clause 6.15(a)(vii) ensures that, if 30 November 2013 passes without NTUC signing a new lease, neither party is bound to the other. That condition is to both parties’ commercial benefit. The obvious commercial benefit to AREIF is that it allows AREIF to know with certainty when it is free of its obligation to grant NTUC a new lease. But that is a commercial benefit to AREIF only if AREIF does not for some reason want to grant a new lease to NTUC. That could be because alternative tenants are prepared to offer AREIF rents higher than the maximum rent, or simply because AREIF no longer wishes to have NTUC as a tenant. But AREIF is by no means assured of that happy situation. If the circumstances are such that it is AREIF who wants to hold NTUC to a new lease, cl 6.15(a)(vii) operates to AREIF’s detriment and to NTUC’s benefit. For example, NTUC could have alternative premises available to it at rents lower than the maximum rent, or it could simply prefer not to have AREIF as a landlord. In that situation, cl 6.15(a)(vii) offers NTUC maximum commercial freedom by deferring until the last possible moment the time at which NTUC is bound to a new lease. 48     The commercial benefit of this freedom to NTUC is real, not hypothetical or technical. The lease envisages renewal as a process, not as an event. The process could take as long as five months: from July 2013 to November 2013. Much could happen during those five months not only in terms of market fluctuations but also in terms of NTUC’s needs and wishes. Clause 6.15(a)(vii) leaves NTUC free of any contractual obligation to AREIF until and unless NTUC binds itself by signing on the dotted line. And if NTUC, having initiated the renewal process and having agreed all terms with AREIF, ultimately decides that it is not in NTUC’s commercial interests to bind itself by signing on the dotted line, it can withdraw without consequence, and at a time when it still has ample opportunity – in the four months from December 2013 to March 2014 – to make alternative arrangements. But in exchange for that freedom, NTUC bargained for a condition that it must sign the new lease on or before 30 November 2013. That is what NTUC failed to do. It failed to that because it failed to reach agreement with AREIF on the crucial issue of rent by that date.",
        "AREIF’s obligation to grant a new lease never arose": "49     I cannot therefore accept NTUC’s submission that the proper construction of cl 6.15(a) is that, as soon as NTUC issued its written request to AREIF for a renewal on 29 July 2013, AREIF was thereby and thereupon immediately bound to grant NTUC a new lease at the maximum rent unless the parties agreed a lower rent. In my view, the proper construction of cl 6.15(a) is that until all the conditions in cl 6.15(a) are satisfied, NTUC has no entitlement to a new lease. One of those conditions is the condition as to rent. That is to be discussed and agreed by both parties, save only if NTUC offers the maximum rent which AREIF has no right to exceed. The rent and all other terms of the new lease, including those prescribed by cl 6.15(a), are then to be embodied in a document which NTUC must sign – or at the very least must demonstrate that it is ready, willing and able to sign – on or before 30 November 2013. Unless all those conditions are satisfied, NTUC has no right to a new lease from AREIF.",
        "AREIF did not breach its obligations under cl 6.15(a)": "50     On the construction of the option which I have found to be correct, the only way in which NTUC can succeed in its claim for a new lease is if it can demonstrate either that: (a) NTUC’s failure to agree rent and to sign a new lease by 30 November 2013 came about because AREIF breached one of its express or implied obligations under the option; or (b) AREIF is somehow precluded from relying on NTUC’s failure to agree rent and sign a new lease by 30 November 2013. 51     NTUC has failed to demonstrate either point. AREIF breached no express or implied obligation under the option and is not precluded from relying on NTUC’s failure to satisfy cl 6.15(a)(ii) and (vii).",
        "AREIF had no obligation to bring about fulfilment of the conditions precedent": "52     Millett LJ inLittleunder the heading “General Principles” set out a series of nine principles summarising the rights and obligations of the grantor and grantee of options. I gratefully adopt these general principles as being correct statements of the law. I have already cited the ninth of these general principles at [41] above as a principle upon which NTUC relies. When that ninth general principle is read in the context of Millett LJ’s eight other general principles, however,Littlesupports AREIF’s case, not NTUC’s. 53     Millett LJ’s nine general principles are as follows (at 167–168): General principles 1.    The doctrine of fictional fulfilment of a condition precedent which is found in the civil law forms no part of English law. The only questions which fall to be answered in English law are whether on the true construction of [the option to renew] and in the events which have happened: (i)    the condition precedent…has been satisfied; and (ii)   if not whether in the circumstances it needed to be satisfied. 2.    The process of construction includes, where applicable, the necessary implication of unexpressed terms and the doctrine that a man may not take advantage of his own wrong. 3.    The latter doctrine is confined to the case where a party seeks to take advantage of his own breach of a legal obligation owed by him to the party opposite. Where, in breach of a contractual obligation, express or implied, a party has prevented the fulfilment of a condition precedent, he may not only be liable in damages for the breach but may also be precluded from claiming that the condition has not been fulfilled. But nothing less than breach of a legal obligation will do: seeCheall v. Association of Professional Executive Clerical and Computer Staff[1983] 2 AC 180. 4.    An option to renew a lease, like any other option, is a unilateral contract under which the grantor undertakes to do something if, but only if, certain conditions are satisfied. If those conditions are not satisfied the grantor is not obliged to do anything. If they are satisfied the grantor must comply with his undertaking, and in the meantime,so long as it remains possible that the conditions will be satisfied, he must not put it out of his power to perform his undertaking when the time comes.This apart, however, he is under no obligation to do anything. In particular, he is under no obligation to try and bring about the fulfilment of the conditions, or not to try to frustrate them.For these propositions, see the analysis of Diplock L.J. inUnited Dominion Trust (Commercial) Ltd v. Eagle Aircraft Services Ltd[1968] 1 WLR 74. 5.    It is in general impossible to imply terms (that is to say terms which impose legal obligations) into a unilateral contract. This would be to imply a contractual obligation on a person whoex hypothesiis not yet a party to any contract and therefore not yet subject to any contractual obligations on the ground that it is necessary in order to bring a contract into existence. This is wrong in principle: SeeAotteara International v. Scancarriers[1955] 1 NZLR 513. 6.    These principles are equally applicable to an option or other unilateral contract which forms part of a bilateral contract such as a lease. An option to renew a lease was given as the archetypal example of unilateral contract inUnited Dominion Trust (Commercial) Ltd v. Eagle Aircraft Services Ltd. Such an option is usually found as one of the terms of a lease, but its proper construction cannot depend on whether it is included as a term of a lease or is granted by a separate document. 7.    It is, therefore, impossible to imply any terms into [the option to renew] which import a legal obligation on [the landlord] to do or to refrain from doing anything until its obligation to grant a further term has arisen. It follows that there is no room for the doctrine that a man cannot take advantage of his own wrong. 8.    Whether an obligation to grant a further term has arisen depends on the true construction of [the option to renew]. The ordinary process of construction, however, may involve reading words into the clause, and provided that they do not import a legal obligation on the part of the grantor this is no more difficult in the case of a unilateral contract than in the case of a bilateral contract. 9.    In construing an option the court will endeavour to ascertain the true intentions of the grantor as expressed in the words which he has chosen. The whole point of an option is that the grantor undertakes to grant an interest to the grantee in the future if the grantee calls on him to do so, whether the grantor is then willing to grant it or not. The court will struggle to avoid a construction which would render the option illusory by making it impossible for the grantee to exercise it unless the grantor were willing to grant the interest anyway. [emphasis added] 54     Millett LJ’s fourth to seventh principles mean that, subject to his ninth principle, cl 6.15(a) is incapable of imposing any express or implied obligation on AREIF to bring about the fulfilment of the conditions precedent in that clause; and it is equally incapable of imposing any express or implied obligation on AREIF not to frustrate their fulfilment. This means that AREIF: (a) had no obligation to remind NTUC in advance of the contractual significance of the 30 November 2013 deadline; (b) had no obligation to hurry NTUC along in its negotiations on rent so that NTUC could meet that deadline; (c) had no obligation to issue NTUC an ultimatum before the 30 November 2013 deadline expired; (d) had no obligation to take other steps to put NTUC on notice that it intended to insist on compliance with that deadline; and (e) had no obligation to keep NTUC informed of the commencement, content or status of AREIF’s negotiations with Cold Storage. 55     This approach may appear harsh. But in truth, there is nothing harsh about it. NTUC does not suggest that there are any circumstances in this case which warrant the intervention of ameliorating doctrines such as relief against forfeiture, mistake, misrepresentation ornon est factum. Given that, there is nothing harsh about expecting two contracting parties to understand for themselves their rights and obligations under the lease and under the option; and of bearing for themselves the entire burden of protecting and advancing their own self-interest. That is all the more so when those two contracting parties are sophisticated commercial entities who are dealing at arm’s length as commercial adversaries and who are either legally advised or who have ready access to legal advice.",
        "AREIF did not put it out of its power to grant NTUC a new lease": "56     The only indisputable obligation which AREIF owed NTUC under the option was an obligation not to put it out of its power, on or before 30 November 2013, to grant NTUC a new lease (see the italicised words in Millett LJ’s fourth proposition at [53] above). AREIF did not breach this obligation. It is true that AREIF issued a letter of offer to Cold Storage on 22 November 2013, at a time when it was still open to AREIF and NTUC to reach agreement on the rent for a new lease. But Cold Storage did not accept AREIF’s letter of offer until well after 30 November 2013. Issuing a letter of offer in itself does not put it beyond AREIF’s power to grant NTUC a new lease. AREIF was free to revoke its offer to Cold Storage at any time before it was accepted. AREIF put it out of its power to grant NTUC a new lease only when Cold Storage accepted its offer on 18 December 2013. But by that time, it had become impossible for NTUC to fulfil the conditions under cl 6.15(a) – an in particular cl 6.15(a)(vii) – so as to impose upon AREIF an obligation to grant a new lease. 57     It is true that, by its dealings with Cold Storage, AREIF exposed itself to a risk that it might find itself unable to grant NTUC a new lease pursuant to its option. AREIF was exposed in this way between 22 November 2013 (the date of its letter of offer to Cold Storage) and 30 November 2013 (NTUC’s deadline to sign the new lease under cl 6.15(a)(vii)). Although AREIF’s letter of offer to Cold Storage was conditional, none of the conditions made the offer subject to NTUC’s option. Quite the contrary: the letter of offer expressly provided that Cold Storage would become bound by AREIF’s standard lease immediately upon acceptance, and even if the parties failed subsequently to execute a formal lease.[note: 24] 58     The result is that between 22 November 2013 and 30 November 2013, ARIEF knowingly and intentionally put itself at risk of being unable to grant NTUC a new lease. But it was AREIF’s risk to take. As events transpired, that risk never eventuated. In effect, AREIF took a risk and got away with it. But merely to put itself at risk of breaching cl 6.15(a) is not actually to breach cl 6.15(a) or any obligation that can be implied into it.",
        "AREIF did not breach any other term of the option": "59     Millett LJ’s ninth proposition (at [53] above) is sufficiently wide to permit AREIF to owe NTUC two, and only two, obligations: (a) an obligation to negotiate rent; and (b) an obligation, once rent is agreed, to present a document embodying the terms of the new lease to NTUC for it to sign. For present purposes, it matters not whether these obligations arise as a matter of construction or as terms which it is necessary to imply in fact into the option in order to give it business efficacy. 60     But even if AREIF were subject to these obligations, AREIF did not breach them. First, AREIF did negotiate rent. Rent is the only one of the six conditions under cl 6.15(a) governing the terms of the lease which were not fixed in advance or which AREIF did not have the power unilaterally to dictate. And rent is fundamental: until rent is agreed, there is no reason – and therefore no obligation – for AREIF to dictate any of the other terms for the new lease. An examination of the events shows clearly that AREIF did in fact negotiate rent with NTUC. The negotiations on rent began with ARIEF offering to accept 100% of the maximum rent. NTUC responded by proposing 85.5%. AREIF counter proposed 90.7%. NTUC went in the opposite direction and proposed 65.6%, later improving that to 67.4%. AREIF then told NTUC that it would consider NTUC’s offer. That is clearly a negotiation. 61     Second, it is true that AREIF did not present a document embodying the terms of the new lease to NTUC for signature. But that argument elevates form over substance. There was no point for AREIF to prepare or present such a document to NTUC until AREIF and NTUC had agreed rent. An agreed rent is asine qua non. It would be quite different if AREIF and NTUC had agreed a rent and AREIF then refused to present a lease to NTUC for signature before 30 November 2013 despite NTUC being ready, willing and able to sign it. But that is not what happened here.",
        "AREIF did not have a general or specific contractual obligation to act in good faith, whether express or implied": "62     NTUC does not argue AREIF’s dealings with Cold Storage were in breach of any contractual duty of good faith which AREIF owed to NTUC in connection with the option.[note: 25]It is correct not to. 63     There is no express obligation in cl 6.15 requiring AREIF to act in good faith generally in connection with NTUC’s option to renew or, more specifically, in negotiating rent under the new lease. Such an express obligation is both valid and enforceable:HSBC Institutional Trust Services (Singapore) Ltd (trustee of Starhill Global Real Estate Investment Trust) v Toshin Development Singapore Pte Ltd[2012] 4 SLR 738 at [40]. In that case, the Court of Appeal considered a rent review mechanism which expressly obliged the parties “in good faith [to] endeavour to agree” (at [6]) the annual rent for a future terms. The Court of Appeal upheld the clause. In the absence of any such express obligation, parties negotiating the terms of a prospective contract are free to lose interest, to refuse the other party’s offers, to make demands upon the other party which it knows the other party is not able or willing to fulfil and to walk away for no reason or for any reason. If a party to a negotiation wants to restrict his counterparty’s freedom in this regard, he must bargain for it. 64     There also cannot be any implied obligation to that effect. Singapore law does not recognise a general duty of good faith implied into contracts at common law (Ng Giap Hon v Westcomb Securities Pte Ltd[2009] 3 SLR(R) 518 at [47] and [60]). Parties in anexistingcontractual relationship thus retain the freedom to perform their contractual obligations in their own self-interest and in a manner which maximises their benefit, subject only to the limits imposed by the general law. 65     This is all the more so when the parties are negotiating the terms of aprospectivecontractual relationship. The grantor of an option is in this position, even where the option does not stand alone but is embedded in a wider bilateral contract. This is the import of Millett LJ’s sixth and seventh propositions inLittle(see [53] above). As Lord Ackner explained in the House of Lords’ decision inWalford and others v Miles and another[1992] 2 AC 128 (“Walford v Miles”) at 138, “the concept of a duty to carry on negotiations in good faith is inherently repugnant to the adversarial position of the parties involved in negotiations”. Furthermore, as Lord Ackner observed, there are practical difficulties in enforcing an agreement to negotiate in good faith. When the question arises whether an obligation to negotiate in good faith has been breached, it is well-nigh impossible for a court to discern which party was responsible for the negotiations breaking down, let alone whether that party brought about the breakdown by failing to act in good faith. 66     The result is that AREIF did not owe any express or implied duty of good faith to NTUC, whether a general duty to act in good faith or a more specific duty to negotiate the terms of the new lease, including rent, in good faith. AREIF therefore breached no contractual obligation in proposing on 29 August 2013 a renewal at the maximum rent. It would also have breached no contractual obligation by refusing to budge from the maximum rent. That is so whether it took that position because: (a) it genuinely believed that the maximum rent was the prevailing market rent; (b) it knew that the maximum rent was well above the market rent, but also that NTUC could afford to pay the maximum rent and still earn a reasonable profit from its operations on the premises; or (c) it knew that the maximum rent was well above the market rent, knew that NTUC could not afford to pay that rent, and just wanted to be rid of NTUC as a tenant. If NTUC wanted a more robust right to renew, it was for NTUC to bargain for that enhanced robustness in 2011 together with the other terms of the initial lease. The option that it assented to in 2011 was by definition the option that it was prepared to accept and was presumably the most robust option it could bargain for. 67     In any event, on the facts of this case, AREIF cannot be said to have failed to negotiate in good faith. AREIF did not believe that the maximum rent was well above the market rent. It believed that the market rent was between $7.50 and $8.00 psf. And it did not refuse to budge from the maximum rent. It began the negotiations by offering 100% of the maximum and went down to 90.7%. It eventually bound itself, at a time when it was at liberty to do so, to grant Cold Storage a lease at 94.8%. I note in passing that NTUC’s express position during the negotiations was that it could not afford even 90.7% of the maximum rent because it was a cooperative with a social mission to moderate prices.[note: 26]Yet, when NTUC thought that there was no other way to secure a new lease, it revealed literally overnight that it was in fact able to afford 100% of the maximum rent. This is not said by way of criticism of NTUC. It is said simply to show that both parties negotiated – as its stakeholders had every right to expect – in order to maximise its own benefit. It also illustrates precisely the difficulty that Lord Ackner, speaking inWalford v Miles, feared: on the facts of the present case, who is to say who was responsible for the breakdown in the negotiations on rent when both parties were acting within the law in pursuing their self-interest.",
        "AREIF did not waive reliance on the 30 November 2013 deadline": "",
        "NTUC relies on waiver, not estoppel": "68     A party waives a contractual right when it makes an unequivocal representation to its counterparty, whether by words or by conduct, that it gives up that right. NTUC tries to spell out a waiver from the following facts. On 29 November 2013, AREIF represented to NTUC that its management would consider NTUC’s offer of 28 November 2013 and respond. On 30 November 2013, NTUC’s deadline expired. On 17 December 2013 and on 22 January 2013, in response to reminders from NTUC, AREIF repeated its representation to NTUC that its management was reviewing NTUC’s last proposal and would respond. The parties had no further communication until 6 February 2014. On that day, AREIF informed NTUC that NTUC’s option to renew had lapsed and AREIF was therefore under no obligation to grant NTUC a new lease. 69     I note at the outset that NTUC relies only on waiver and not on estoppel.[note: 27]Thus, NTUC does not suggest that anything done by AREIF raised any expectation on NTUC’s part that AREIF would not rely on the 30 November 2013 deadline. Equally, NTUC does not suggest that it relied on any expectation engendered by or any unequivocal representation made by AREIF and suffered prejudice because of it. There is, in fact, no basis for any argument from reliance in the correspondence. The correspondence suggest that NTUC let the deadline pass not because it relied on AREIF’s representations but because it either failed to appreciate the significance of the deadline in cl 6.15(a)(vii) or because it mistakenly believed that the operative deadline to sign a new lease was the expiry of the term on 31 March 2014. Thus, when AREIF informed NTUC on 22 January 2014 that its management was still reviewing NTUC’s last proposal, NTUC replied by saying “Thanks and we look forward to your reply. The lease…is expiring very soon on 31 Mar 14 so we would hope to be able to conclude the lease negotiations.” Quite apart from undermining any argument from estoppel, this reply also shows that NTUC viewed itself as still in negotiation for a lease on 22 January 2014, itself adopting what I have found to be the correct construction of cl 6.15(a).",
        "No waiver by failing to tender a draft lease": "70     NTUC’s argument on waiver comprises two alternatives. First, NTUC submits that AREIF waived the deadline to sign the new lease by failing to give NTUC a document to sign by 30 November 2013. Having failed to do that, NTUC argues, AREIF is now precluded from relying on NTUC’s failure to satisfy the condition in cl 6.15(a)(vii). This argument hinges on NTUC’s submission that it acquired an immediate and bilaterally binding right to a new lease simply by serving its request on 29 July 2013. If that submission were correct, signing a new lease would be a mere formality. It would merely embody in a document a contract which already bound the parties by reason of cl 6.15(a) and NTUC’s notice of 29 July 2013. But, as I have held, this submission is wrong. AREIF never came under an obligation to grant NTUC a new lease because a condition precedent – an agreement on rent – was not satisfied by 30 November 2013. NTUC’s argument on waiver on this ground therefore cannot stand.",
        "No waiver by negotiating past the 30 November deadline": "71     NTUC’s alternative argument on waiver is that AREIF waived compliance with the 30 November 2013 deadline by keeping its negotiations with NTUC alive past that deadline. NTUC submits that by its email of 29 November 2013, AREIF agreed to continue negotiating rent within the context of NTUC’s option to renew even after 30 November 2014. NTUC also relies on AREIF’s candid admission that it was prepared to consider and presumably to accept NTUC’s last proposal even after 30 November 2013, albeit only if the proposed lease with Cold Storage fell through.[note: 28] 72     AREIF asserts that simply negotiating past a deadline cannot amount to a waiver of that deadline. According to AREIF, the only clear and unequivocal representation it made to NTUC in its email of 29 November 2013 was that it would consider NTUC’s last proposal and, possibly, respond to it past the deadline.[note: 29]AREIF did exactly as it represented when it rejected NTUC’s last proposal on 6 February 2014. Its email of 29 November 2013 does not go beyond that narrow representation and amount to an unequivocal wider representation that AREIF would not rely on the non-satisfaction of the condition in cl 6.15(a)(vii) as bringing an end to NTUC’s right to compel AREIF to grant a new lease. The representation that was actually made cannot operate as a waiver which disapplies cl 6.15(a)(vii) and allows NTUC to bind AREIF to grant it a lease after 30 November 2013. 73     Again, I accept AREIF’s submissions. 74     In my view, AREIF did not waive its right to insist that the condition in cl 6.15(a)(vii) be satisfied. I accept AREIF’s submission that simply negotiating past a deadline is, in itself, insufficiently unequivocal to found a waiver of that deadline. For this submission, AREIF relies on the Privy Council case ofSuper Chem Products Ltd v American Life and General Insurance Co Ltd and others[2004] 2 All ER 358 (“Super Chem”). InSuper Chem, an insured argued that its insurer had waived a contractual limitation period in the parties’ policy of insurance because the insurer continued investigating the claim and continued negotiating a resolution of the claim with the insured after that limitation period had expired. 75     The Privy Council rejected this argument. Lord Steyn, delivering the advice of the Privy Council said (at [23]): … the mere fact that a party has continued to negotiate with the other party … after the [contractual] limitation period has expired, without anything being agreed about what happens if the negotiations break down, cannot give rise to a waiver or estoppel:Hillingdon London Borough Council v ARC Ltd (No. 2)[2000] 3 EGLR 97, at 104, per Arden LJ;Seechurn v Ace Insurance SA NV[2002] EWCA Civ 67, [2002] 2 Lloyd’s LR 390. Nothing in the exchanges [between the parties] in the present case is therefore capable of creating a representation that the time bar would not be relied on. … 76     While AREIF’s email of 29 November 2013 is indeed an unequivocal representation that AREIF would consider NTUC’s last proposal, it contains no representation at all that AREIF would not rely on a failure to comply with cl 6.15(a)(vii) or as to AREIF’s position if AREIF were to reject NTUC’s last proposal after 30 November 2013. I agree with AREIF’s submission that, at the very most, AREIF can be taken to have represented unequivocally that it would not insist on compliance with the 30 November 2013 deadlineif AREIF accepted NTUC’s last proposal on rent. Thus, I accept that AREIF could not have, after 30 November 2013, accepted NTUC’s last proposal and then relied on the failure to satisfy cl 6.15(a)(vii) to disclaim any obligation to grant NTUC a new lease at the agreed rent. But that is not what happened. AREIF rejected NTUC’s last proposal. Waiver in this sense cannot assist NTUC. 77     I find, therefore, that AREIF did not make an unequivocal representation to NTUC by words or conduct that it would not rely on the non-satisfaction of the condition in cl 6.15(a)(vii) as bringing an end to NTUC’s right to compel AREIF to grant a new lease to NTUC if AREIF rejected NTUC’s last proposal. If NTUC wanted an assurance to that effect, it ought to have sought and obtained AREIF’s agreement to it before 30 November 2013. AREIF is under no obligation to grant NTUC a new lease.",
        "Conclusion": "78     For the reasons stated, I dismiss OS248 with costs. On AREIF’s application in OS244, I order NTUC to deliver vacant possession of the premises to AREIF by midnight at the end of the term, and grant AREIF an order for possession of the premises effective immediately upon the expiry of the term. I order that the question of any damage arising from NTUC’s failure to comply with my orders to be held over as any such damage is at this stage purely prospective. 79     Having determined NTUC’s main application in OS248 against NTUC, its application for interim relief is moot. I therefore grant NTUC leave to withdraw Summons No 1358 of 2014 with no order as to costs.  [note: 1]Arjun Dosaj's 1st affidavit dated 13 March 2014 (“AD”), pp 22, 27, 69 – 70. [note: 2]AD, p 58. [note: 3]AD, p 82. [note: 4]AD, p 88. [note: 5]AD, p 87. [note: 6]AD, p 86. [note: 7]AD, p 89. [note: 8]AD, p 85. [note: 9]AD, p 85. [note: 10]AD, p 10, paragraph 19. [note: 11]AD, pp 91, 97. [note: 12]AD, pp 84 – 85. [note: 13]AD, p 84. [note: 14]AD, paragraph 22. [note: 15]AD, paragraphs 23 and 24. [note: 16]AD, p 96. [note: 17]AD, paragraph 22. [note: 18]AD, p 157. [note: 19]AD, pp 213 – 214. [note: 20]AD, p 214. [note: 21]AD, p 158. [note: 22]AREIF’s written submissions dated 20 March 2014, paragraph 9. [note: 23]NTUC’s written submissions dated 19 March 2014, paragraph 19. [note: 24]AD, p 93, Cl 15, last sub-paragraph. [note: 25]Notes of argument, p 13, line 15. [note: 26]AD, p 84. [note: 27]Notes of argument, p 10, line 13 to 14. [note: 28]AD, p 10, para 22. [note: 29]AREIF’s written submissions dated 20 March 2014, paragraph 18."
    }
}