{
    "case_title": "Sanjeev Sharma s/o Shri Sarvjeet Sharma\n      v\n      Surbhi Ahuja d/o Sh Virendra Kumar Ahuja",
    "ncitation": "[2015] SGHC 104",
    "coram": "Valerie Thean JC",
    "sections": {
        "Introduction": "1       This was an appeal against a decision of a District Judge (“the Judge) to grant a stay of a nullity suit on the ground offorum non conveniens. I heard and dismissed the appeal and now give my grounds of decision. 2       I should mention that this was a decision of the High Court in exercise of its civil appellate jurisdiction in family matters heard on 8 January 2015. Under s 34(7) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed), leave must be obtained for such an appeal and no leave has been sought.",
        "The facts": "3       The action commenced by the husband was for the marriage to be annulled on the ground that the marriage was not consummated owing either to the wilful refusal and/or incapacity of the wife. 4       The husband was born in India and became a Singaporean citizen in 2007 after working here for a number of years. He is currently residing in Singapore. The wife, also born in India, is an Indian citizen and currently resides in Haryana, India.",
        "The marriage and separation": "5       Husband and wife first married on 28 February 2011 in a traditional Hindu setting in accordance with Hindu custom and rites under the Hindu Marriage Act (Act No 25 of 1955) (India) (“HMA”) in New Delhi, India. They then followed with registration in an Indian court pursuant to the Special Marriage Act (Act No 43 of 1954) (India) (“SMA”) on 14 March 2011 in Yamuna Nagar, Haryana, India. 6       After the marriage, both moved to Singapore on 25 March 2011. After a month here, the wife returned to India to seek medical treatment.  The husband was at the same time offered a job in San Francisco. As a result, both relocated to San Francisco sometime in September 2011. 7       In January 2013, the husband returned to Singapore, while the wife returned to India to live with her family in Yamuna Nagar, Haryana, India.",
        "The legal proceedings": "8       On 8 April 2013, the husband commenced nullity proceedings in Singapore against the wife on the following grounds: (a)     that the marriage has not been consummated owing to the incapacity of the wife to consummate it; or (b)     that the marriage has not been consummated owing to the wilful refusal of the wife to consummate it. 9       The wife thereafter initiated separate proceedings in Yamuna Nagar, Haryana, India against the husband in relation to dowry harassment, domestic violence, and for maintenance. On 4 June 2013, the wife filed the present application for the nullity proceedings in Singapore to be stayed on the basis offorum non conveniens.",
        "The decision below": "10     The Judge stayed the action on 2 January 2014, with the following orders:[note: 1] 1) The Nullity Proceedings herein are stayed on condition that the Defendant commences divorce proceedings in India within one month from the date of this Order. The Plaintiff is at liberty to commence Nullity Proceedings in India. 2) The Plaintiff is at liberty to restore these proceedings in the event that the condition above is not complied with by the Defendant. After the delivery of the judgment, the wife, whose position is that the marriage has been consummated, commenced divorce proceedings against the husband in New Delhi, India on 24 January 2014. 11     Against the decision of the Judge the husband appealed to the High Court and the appeal was heard before me. The issue is which is a more convenient forum for the resolution of the dispute: the Court in India or the Court in Singapore.",
        "The legal context": "",
        "The legal test applicable": "12     Both parties agreed that the test applicable is that of the House of Lords decision ofSpiliada Maritime Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”), adopted by our Court of Appeal on many occasions: seeBrinkerhoff Maritime Drilling Corp v PT Airfast Services Indonesia[1992] 2 SLR(R) 345,Eng Liat Kiang v Eng Bak Hern[1995] 2 SLR(R) 851,CIMB Bank Bhd v Dresdner Kleinworth Ltd[2008] 4 SLR(R) 543 (“CIMB v Dresdner”) andJIO Minerals FZC and others v Mineral Enterprises Ltd[2011] 1 SLR 391 (“JIO Minerals v Mineral Enterprises”). 13     In brief, the applicable test is a two-stage test: (a)Is India the appropriate forum for trial?At this stage, in which the defendant bears the burden of persuasion, the court looks to see what factors there are which point in the direction of another forum as being the forum with which the action has the most real and substantial connection. This is a factors-based test: the weight to be placed on the various factors varies with each factual matrix:BDA v BDB[2013] 1 SLR 607 (“BDA v BDB”) at [23]perChao Hick Tin JA. (b)Are there any other special circumstances requiring the trial to take place in Singapore?At this second stage, the plaintiff bears the burden of proof. A stay would ordinarily be granted where there is another more appropriate forum for trial.",
        "The appellate context": "14     As I dealt with this matter in an appellate context, I bore in mind the guidance of the Court of Appeal that in determining whether or not to grant a stay of proceedings, the first instance judge will invariably be exercising a discretion. The appellate court should not interfere with such an exercise of discretion “unless the judge had misdirected himself on a matter of principle, or he had taken into account matters which he ought not to have taken into account or failed to take into account matters which he ought to have taken into account, or his decision is plainly wrong” (seeCIMB Bank Bhd v Dresdner Kleinwort Ltd[2008] 4 SLR(R) 543 (“CIMB Bank”) at [84], referring toThe Abidin Daver[1984] AC 398 at 420perLord Brandon of Oakbrook).  This rule was applied to appeals to the High Court from the District Court inBDA v BDB.",
        "My decision": "",
        "Is India the most appropriate forum for trial?": "15     The first stage of the test concerns a balancing of the various connecting factors. 16     The husband’s view was that the marriage was held in India as a matter of convenience, and that parties intended to live in Singapore in the longer term. Arising from registration of the marriage under the SMA (which is similar to our Women’s Charter (Cap 353, 2009 Rev Ed (“Women’s Charter”)), he thought the dispute fairly straightforward, and more speedily dealt with in Singapore. 17     The wife, on her part, pointed out that the marriage had been advertised in India and celebrated there, first as a traditional Hindu marriage valid under the HMA and then only later registered under the SMA.  Indian laws of nullity under the HMA were different from the SMA, for which her evidence was that the registration was simply for ease of obtaining a visa to the USA. On the issue of consummation, her relevant medical experts are based in the USA and India. The Indian courts are best placed to consider disputes concerning local experts, Indian domestic law and aspects of maintenance. 18     The Judge held that there are more connecting factors to India than Singapore: parties were married in India and the wife is an Indian citizen residing in India. As the husband had chosen to marry in India in accordance with Indian law and customs, the Judge felt that it is not for the husband to then claim that he would be denied justice in India. 19     I discuss in turn the various relevant connecting factors raised in argument. The domicile and residence of the parties 20     The wife is an Indian citizen and is presently domiciled in India. She has been residing in Haryana, India since the separation in 2013. The husband, on the other hand, is a Singaporean citizen who resides in and is domiciled in Singapore. In this regard, the domicile and residence of the parties do not point to any specific jurisdiction. 21     While the wife attempted to highlight that the husband remained an “Overseas Citizen of India” and there was argument and exchange of expert evidence as to the effect of this, I found it useful to refer to the recent High Court decision (on appeal from the District Court),BDA v BDB, where Chao JA observed (at [29]) that nationality is of limited significance: ... While not entirely discounting nationality as a connecting factor, nationalityper seis of limited significance. In an increasingly globalised world, multiple nationalities are becoming the norm.Residency and/or domicile are better indicators of the strength of a party's connection to a particular forum.... [emphasis added] The availability of evidence and witnesses 22     The husband’s argument was that the only potential witnesses in the present action were the parties themselves and the husband’s parents. 23     In contrast, the wife, who has sought all the while to argue that the marriage has been consummated, contended that medical reports which “clearly indicate her capacity to consummate” resulted from medical examinations in USA and India. She had received no medical attention in Singapore. 24     The Court of Appeal has highlighted inCIMB Bank(at [69]) that the place of residence of witnesses may not be a significant issue in the light of the easy availability of video conferencing. Nevertheless, in this particular case,someweight should be given, as the defendant will likely require witnesses from either USA or India, given the medical procedures that were carried out there. Her earliest post-marriage medical treatment, a couple of months after the marriage, was in India. Availability of ancillary relief 25     The wife argued that the Court in India is better placed to ascertain an appropriate quantum for any maintenance order, which she would require on termination of the marriage. 26     InBDA v BDB, Chao JA dealt with this issue (at [32]) in the context of two earlier District Court decisions. InHelen Diane Womersley (m.w.) v Niger Maurice Womersley[2003] SGDC 186 at [14], it was held that an “English court would be in a better position to consider the cost of living in England”. InPrapavathi d/o N Balabaskaran v Manjini Balamurugan[2002] SGDC 354 at [48], it was accepted that it would be easier for a Singapore court to consider the wife’s cost of living in Singapore. While Chao JA accepted that as a general proposition it would be easier for a court to consider the cost of living in its own jurisdiction, he went on to make the observation that a Singapore court was, as a whole, not at a complete disadvantage in the determination of maintenance for a wife residing in India when compared to an Indian court (at [33]): ... First, the wife must show that she needs maintenance and that the husband has neglected or refused to provide reasonable maintenance for her and any child of the marriage. Second, the court will have to determine the quantum required for maintenance. On the first question, the court in Singapore is as well placed as any other to rule on the issue. As regards the second question, the advantage of an Indian court is at best limited because of two considerations. First, the Wife has stated that she intends to return to live in Singapore. Second, in determining the quantum of maintenance, the court shall have to take into account the standard of living enjoyed by the Wife and the sonbeforethe Husband's neglect or refusal to maintain them (see s 69(4)(f) of the Women's Charter). On this aspect, a Singapore court would be better placed than an Indian court to determine that matter as the parties were then living in Singapore. Thus while a Singapore court may be at a slight disadvantagevis-à-visthe question of the cost of living in India, it is at an advantagevis-à-visthe question of the previous standard of living of the parties in Singapore. In other words, a Singapore court will not be at a complete disadvantage, when compared to an Indian court, in determining the proper quantum of maintenance. 27     InBDA v BDB, a stay was refused because the other connecting factors were strong. It was a maintenance claim where the wife and son previously lived in Singapore. The defendant husband, who sought the stay, was working and resident in Singapore, with assets in Singapore. Further, the wife had indicated that she intended to return to live in Singapore. 28     In contrast, in this case at hand, it is the party resident in India who sought the stay. Aside from an initial four weeks, the parties’ previous standard of living while together is premised on an American quality of life.  The wife’s future standard of living is premised on Indian costs of living.  One could say that quantum is a matter of evidence and it follows as a matter of logic that a Singaporean court could still make the relevant judgment once presented with the appropriate evidence. In the light of the lack of other connecting factors, however, this factor weighed against the husband. The applicable law 29     The issue concerning the applicable domestic statute was the main dispute that arose between the parties in the present application.Both parties accepted that Indian law would be the law governing their dispute.As a result, the main argument before me was confined to the question of whether the annulment of the marriage was governed by the HMA or the SMA. (1)Applicable statute: the HMA or the SMA? 30     The wife took the view that both parties had undergone a traditional marriage on 28 February 2011 and the HMA would be the relevant statute governing the dissolution of the marriage. Because the rules under the HMA were significantly different from those found in the Women’s Charter, which was, for all intents and purposes, a secular framework, the wife contended that it would be more appropriate for an Indian court to resolve the dispute between the parties. 31     On the other hand, the husband took the position that the marriage was governed by the SMA, as opposed to the HMA. Mr Shri, the husband’s Indian counsel, referred to s 18 of the SMA, which expressly provides that the marriage shall, from the date of entry into the marriage register, be deemed to be a marriage solemnised under the SMA. In the circumstances, it was argued that a marriage cannot be governed by both the HMA and the SMA. Mr Shri contended that upon registration under the SMA, the marriage would thereafter be governed by the rules therein and a Singapore court would have no difficulty in view of its similarity with the Women’s Charter. 32     The wife relied on the fact that the HMA marriage was the first in time.  In the opinion dated 31 August 2013 authored by Mr Bimlesh (the wife’s Indian counsel), it was stated that when the parties were Hindus and the marriage was solemnised under Hindu customs, even if it were registered later, it would still be governed by the HMA. She also stated that nullity as a cause of action was barred under the HMA after one year of marriage[note: 2]; Mr Shri’s answer was that this issue does not arise in SMA proceedings, which applied[note: 3]. 33     Mr Bimlesh relied on two cases. InY Narasimha Rao and Others v Y Venkata Lakshmi and Another(1991) 3 SCC 452 (“Narasimha Rao”), parties first performed Hindu rites in accordance with the HMA and then registered the marriage under the Foreign Marriage Act. The HMA was held to have prevailed.  This was followed inR Sridharan v The Presiding Officer(9 July 2010) (unreported) (“Sridharan”),[note: 4]where the husband, a US citizen, argued that although the marriage had been solemnised in the USA in accordance with Hindu rites recognised by the HMA, it was later registered in the USA. The court held that the HMA applied. 34     Mr Bimlesh and Mr Shri appeared to be arguing at cross purposes. Mr Bimlesh’s point was that the first Hindu marriage was the first valid marriage under local Indian law: as he had no specific case on point, he used a scenario where the other marriage had been one under foreign law. InNarasimha RaoandShridiran, the HMA prevailed because the Hindu rites were prior in time to the registration. The reasoning of the courts was that parties knew and contracted their marriage at the point of the first solemnisation, and to allow them to later alter that could lead to “chaos in applicability of the laws”.[note: 5]Mr Shri’s point was that s 18 of the SMA deemed the marriage a marriage solemnised under the SMA and the deeming provision was clear; however, he was unable to show any law which dealt with the interplay between the two local statutes. There was no provision in the SMA or Indian case law to state whether termination of a marriage first valid under the HMA and then registered under the SMA should be dealt with under the first domestic statute or the second. 35     The fact that the issue of whether the SMA or the HMA was applicable garnered such a great divergence in opinion between both Mr Shri and Mr Bimlesh made clear that this issue of the applicable statute is more appropriate for an Indian court. It is a matter of interpretation of Indian domestic law. 36     Related to this is the wife’s concern about the enforceability of a Singapore nullity decree in India.  Both parties accepted that the Supreme Court of India inNarasimha Raostipulated that foreign matrimonial judgments would be recognised “only if the jurisdiction assumed by the foreign court as well as the grounds on which the relief is granted is in accordance with the matrimonial law under which the parties are married.”The three exceptions to this rule did not apply: (i) where the action isfiledwhere therespondentis domiciled or habitually resides (this would have necessitated filing in India), (ii) where the respondent submits to the jurisdiction, or (iii) where the respondent consents to the relief. Mr Bimlesh’s point is that neither the jurisdictional clauses of the HMA nor the SMA allow the filing of any petition outside of India unless it was where the parties last resided together or where the respondent resides.[note: 6]While Mr Shri was sure the judgment of the Singapore court could be enforced in India in line withNarasimha Rao, this specific jurisdictional point was not dealt with by Mr Shri.[note: 7] (2)A comment on the parties’ assumption on governing law 37     Parties did not make clear the basis on which they concluded that Indian law governed the parties’ dispute. The husband did not attempt to argue that any other law was applicable. It could possibly have stemmed from a potential interpretation ofNarasimha Raoas the Supreme Court there referenced (see [36] above) the matrimonial law under which the parties are married. However, if the action is not stayed, a Singapore court dealing with the issue of applicable law would have to deal with the applicable lawas a matter of Singapore conflict of laws rules, as mandated by s 108 of the Women’s Charter, not as a matter of Indian enforcement rules. 38     In fact, the rules to determine which law should govern applications for nullity of marriage on the grounds of incapacity or wilful refusal to consummate a marriage are not settled in Singapore. As for English authorities dealing with this issue, they have been described as being “undeveloped and unclear” (see United Kingdom, The Law Commission and The Scottish Law Commission,Private International Law Choice of Law Rules in Marriage(Law Com No 165 and Scot Law Com No 105, 1987) at para 2.4). 39     In such cases, the following laws may govern the dispute: (a)     thelex loci celebrationis(ie, the law of the land where the marriage was celebrated); (b)     thelex fori(ie, the law of the forum); or (c)     thelex domicilii(ie, the law of the domicile). I deal with the various alternatives in turn. 40Lex loci celebrationis.The parties appeared to assume Indian law governed for this reason. However, while the English decision ofRobert (otherwise de la Mare) v Robert[1947] P 164 is often cited for the proposition that thelex loci celebrationisis the governing law for nullity proceedings, the reasoning in that case has been criticised on many grounds (see, for example, David McClean,Morris: The Conflict of Laws(Sweet & Maxwell, 5th Ed, 2000) at pp 205–206). Subsequent English decisions dealing with incapacity or wilful refusal to consummate a marriage have either ignored or expressly rejected thelex loci celebrationisas the governing law save for formal defects (seeWay v Way[1950] P 71;Ponticelli v Ponticelli (orse Giglio) (by her guardian)[1958] P 204 (“Ponticelli”)). 41A common lex for dual causes of nullity, whether fori or domicilii.Incapacity is often regarded as going towards the essential or substantive validity of a marriage; wilful refusal is often seen as a post-nuptial defect, more akin to a ground of divorce. Could it be argued that thelex domiciliishould be applicable for cases of incapacity while thelex fori, the choice of law for divorce proceedings, should be applicable for cases of wilful refusal to consummate? InPonticelli, Sachs J, following the judgment of Denning LJ inRamsay-Fairfax (orse Scott-Gibson) v Ramsay-Fairfax[1956] P 115 that eschewed any such distinction, pointed out that both were grounds of nullity, whether the want of consummation is due to incapacity or to wilful refusal. This was also rejected in United Kingdom, The Law Commission and the Scottish Law Commission,Private International Law Choice of Law Rules in Marriage(Working Paper No 89 and Consultative Memorandum No 64, 1985) at para 5.30, where it was reasoned that the grounds of wilful refusal and impotence were frequently pleaded in the alternative, and it would be undesirable and inconvenient if different rules were to apply. 42Lex fori.While the application of thelex foriis widely accepted in the case of divorce proceedings, cases have generally preserved a distinction between nullity and divorce, preferring not to apply it for nullity because of the possibility of arbitrary and inconsistent results. InPonticelli, Sachs J opined that it would be “unfortunate indeed if a marriage were to be held valid or invalid according to which country’s courts adjudicated on the issue” (at 215). 43Lex domicilii.In the present case, parties are domiciled in different jurisdictions.  In earlier English decisions such asPonticelli, the courts have proceeded on the basis that the law of the husband’s domicile should prevail. However, a married woman is now capable of acquiring a separate domicile: see s 47(1) of the Women’s Charter. James Fawcett & Janeen M Carruthers,Cheshire, North & Fawcett Private International Law(Oxford University Press, 14th Ed, 2008) (“Cheshire, North & Fawcett”) commented (at pp 981–982) thatPonticellimust be viewed in the context of the legal framework subsisting at that point in time, where a wife could not acquire a separate domicile from her husband. The learned authors also proffered a view (at p 982) that the law of the domicile of the spouse who is alleged to have wilfully refused or was incapable of consummating the marriage is the most appropriate choice of law rule. 44     Certainly in a case such as the present, where the wife is an Indian citizen domiciled in India who married in India under Indian law, the recommendation inCheshire, North & Fawcettwould seem more just. Apart from her short stay in Singapore prior to the parties’ relocation to the US, she has no connection with Singapore. It would not seem fair to judge a party on such personal issues with reference to a foreign law which he or she has limited connection with. In the decision ofRoss Smith v Ross Smith[1963] AC 280, Lord Reid, in declining jurisdiction as the husband was resident outside England, cited a similar concern (at 306): ... Suppose a case where the law of the parties’ domicile gives no relief on this ground. It seems to me quite contrary to principle that the wife should be able to come here and seek relief on that ground. ... 45     In the absence of proper argument by the parties, it was not necessary or proper for me to arrive at a final conclusion on this issue.  I make this comment on the governing law here for completeness, asit would be an issue to be decided by the Singapore court if the action is not stayed. Summation on the first stage of the Spiliada test 46     Having looked at the matrix of connecting factors, India is, in my judgment, a clearly and distinctly more appropriate forum than Singapore. There is, in addition to the points raised above, a close factual connection between the wife’s divorce suit in India and the husband’s nullity suit in Singapore. As a practical matter, it would be best for a single forum to deal with all the issues. The first issue would be the governing law of the parties’ dispute (which is not settled if heard in Singapore), and if that were Indian law, whether the HMA or the SMA applied (an issue of domestic statutory interpretation more appropriately dealt with by the Indian court). The question which followed closely was whether, under the HMA or SMA, there was legal remedy for the three possible scenarios alleged: the wife’s incapacity, her wilful refusal to consummate, or, the marriage being consummated, whether the petition of divorce on the ground of cruelty was merited, again a context appropriate for an Indian court. What would then be needed would be a specific factual finding as to which scenario was applicable, whether a ground for divorce or nullity was made out. Having then drawn the marriage to a close one way or another, that court could decide if maintenance or any other ancillary relief was in order and if so, what quantum should be set. An Indian court would be best placed to decide the quantum in this case.",
        "Is there any special reason to nevertheless refuse a stay?": "47     On the second stage of the test, the husband bore the legal burden of establishing the existence of special circumstances by reason of which justice requires that a stay should nevertheless be refused. The husband relied on two points: (a)     excessive delay in the resolution of litigation proceedings in India, particularly matrimonial proceedings; and (b)     substantial disadvantage to the husband in India due to a “hostile legal environment” created by the wife there. Excessive delay 48     The husband contended that the resolution of the present dispute in India will likely involve grave delays and protracted proceedings. This would greatly prejudice and impede a speedy trial. The husband relied on the opinion of Mr Shri that a realistic timeframe for the resolution of the present dispute would be betweenfivetosevenyears, taking into account the time required for any potential appeal by either party. In support of this estimate, Mr Shri referred to a number of materials, such as newspaper articles and case authorities discussing the purported chronic backlog of the Indian judiciary. 49     The husband’s arguments were not persuasive. Mr Shri cited a number of case authorities which were reported more than ten years ago.[note: 8]These include the decisions ofSmt Guru Bachan Kaur v Preetam Singh[1998] 1 AWC 275,R N Engineers v K H Desai[2003] 2 Bom CR 833 andK A Abdul Jaleel v T A Shahida(2003) 4 SCC 166. These cases are of limited utility for the purpose of ascertaining the exact situation in the Indian courtstoday. Furthermore, Mr Shri has also cited a number ofspecificcases where an appellate court had berated the lower court for allowing a matrimonial dispute to drag on unnecessarily.[note: 9]For instance, Mr Shri has cited the Indian Supreme Court decision ofBhuwan Mohan Singh v Meena & Ors[2014] INSC 365, where it was observed that it was “unfortunate that the case continued for nine years before the Family Court”. Such references tospecificcases where there existed an inordinate delay is not sufficient to establish that there is asystemicdelay acrossallcases in the Indian courts. In fact, the strong disapproval of the appellate courts with regard to the delay that had ensued in those specific cases suggests that those cases may very well be the exception rather than the norm. Mr Bimlesh also highlighted the option of using special Fast Track Courts in his affidavit of 29 September 2014.[note: 10] 50     Looking at the evidence as a whole, I am not satisfied that the present dispute will necessarily be plagued by delays if it were to be tried in India. Nor would delay be necessarily a sufficient reason.  InMala Shukla v Jayant Amritanand Shukla (Danialle An, co-respondent)[2002] 1 SLR(R) 920 (“Mala v Jayant”), for example, the petitioner wife had raised a similar argument that the proceedings in Singapore would be heard faster than in India. Woo Bih Li JC (as he then was) explained (at [60]) that the fact that proceedings may be dealt with more slowly in another jurisdiction than in Singapore is not, in itself, a sufficient basis for a stay to be avoided: I note that the proceedings in India in respect of Jayant’s appeal to the Delhi High Court and for special leave to appeal to the Supreme Court of India have not been unduly slow. Even if, for the sake of argument, divorce proceedings will be dealt with more slowly than in Singapore,this is not sufficient for me to avoid a stay. ... [emphasis added] Other pending actions in India 51     The husband contended that the wife had initiated a number of proceedings in India against the husband, including an application for maintenance, a complaint for dowry harassment and an allegation of domestic violence. This cast him in a negative light before the Indian courts. 52     Of relevance was the husband’s fear of arrest upon arrival in India. While both parties do not dispute the fact that an arrest warrant has been issued against the husband, Mr Bimlesh has, in his opinion dated 5 December 2013, explained that there exists an avenue for the husband to apply for anticipatory bail pursuant to s 438 of the Code of Criminal Procedure (Act No 2 of 1974) (India).[note: 11]In effect, an accused is allowed to seek bail in anticipation of being named or accused of having committed a non-bailable offence. In the event that the court is satisfied that there exists sufficient grounds for the grant of anticipatory bail, such an order can be issuedpriorto the accused being taken into custody. Mr Bimlesh further explained that an application for anticipatory bail could be made either by the accused himself or through his lawyer. In a further legal opinion provided by way of an affidavit dated 29 September 2014, Mr Bimlesh elaborated that while the presence of the accused is not required in an application for anticipatory bail, the accused will be under an obligation to be present at the time of the final hearing in the event that the court considers such presence to be necessary in the interests of justice.[note: 12]While Mr Shri in his affidavit filed on 1 October 2014 stated that Mr Bimlesh has “underplayed the severity of the consequences” and that it was “highly unlikely” that the husband will be granted anticipatory bail,[note: 13]the fact remains that he has not disputed the availability of the remedy, and that the husband has not attempted to obtain it. 53     Thus the husband’s argument that the wife intentionally put him in a bad light before the Indian courts rings hollow. Although the evidence suggests that he has avenues to defend himself before those courts, the husband has not taken any action. Indeed, the evidence suggests that he does not haveany intentionto take any action. At the same time, he has not produced any evidence to suggest that if he were to defend those proceedings, he would not be entitled to a fair trial before the Indian courts. If there is any negative impression of the husband on the part of the Indian courts, it would most likely be attributable to his complete disregard for the Indian courts. 54     I would mention that the husband has, on multiple occasions, referred to the wife’s complaints as being “baseless” and “financially motivated”. These are broad assertions, for which the court has no evidence from which to draw any conclusion that the legal proceedings commenced by the wife are, as suggested by him, wholly devoid of any merit. Indeed, on the issue of maintenance, there was no evidence that the husband offered the wife any maintenance after she left the USA. Thus the wife’s counsel’s argument that the wife was merely acting within her rights under Indian law is a logical one. Summation on the second stage of the Spiliada test 55     Courts, being tasked with access to justice, are concerned to act in accordance with fair rules, and yet, at the same time, to ensure equitable outcomes for each individual case.  The two-stageSpiliadatest well illustrates this two-fold objective of judicial discretion. In the first stage, the court examines a case to find logical rationale for its jurisdiction. Having failed to do so, to ensure no injustice, the court, prior to sending a suit away, satisfies itself that there is no special reason that ought to oblige it to hear the suit in order to do justice between the parties. This marriage having broken down, the husband sought a swift resolution, but sought also to avoid the inconvenience of a proper disentanglement of his obligations ancillary to marriage and its termination.  Whilst the court may have sympathy for the former, it ought not to exercise its discretion to aid the latter.",
        "Conclusion": "56     For the reasons set out above, I dismissed the husband’s appeal against the Judge’s decision. 57     Costs, after hearing counsel, were ordered in favour of the wife. The costs of the appeal and the husband’s application to adduce further evidence (which costs were earlier ordered by another High Court Judge to be in the cause), were fixed at $5,000.  [note: 1]Record of Appeal (“ROA”) Vol 1A at p 18. [note: 2]ROA Vol 1A at p 60. [note: 3]ROA Vol 1A at p 126. [note: 4]ROA Vol 1A at pp 459–464. [note: 5]ROA Vol 1A at p 258. [note: 6]ROA Vol 1A at p 261; ROA Vol 2 at pp 131–141. [note: 7]ROA Vol 1A at pp 123–125; ROA Vol 1C at pp 20–21. [note: 8]ROA Vol 1C at pp 49–50. [note: 9]ROA Vol 1C at pp 50–52. [note: 10]ROA Vol 1B at p 161. [note: 11]ROA Vol 1B at pp 51–52. [note: 12]ROA Vol 1B at pp 165–166. [note: 13]ROA Vol 1C at p 28."
    }
}