{
    "case_title": "Petroships Investment Pte Ltd\n      v\n      Wealthplus Pte Ltd and others",
    "ncitation": "[2015] SGHC 145",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1       Petroships Investment Pte Ltd (“Petroships”) is a minority shareholder of Wealthplus Pte Ltd (“Wealthplus”). By this application, Petroships seeks the court’s leave under s 216A of the Companies Act (Cap 50, 2006 Rev Ed) (“the Act”) to commence a statutory derivative action against two groups of defendants. The first group comprises Wealthplus’ ultimate holding company and its related companies. The second group comprises the two current directors of Wealthplus, both of whom are the appointees of its ultimate holding company. The objective of Petroships’ derivative action is to recover: (i) various sums of money which Wealthplus or its subsidiaries have transferred to its ultimate holding company and its related companies; and (ii) compensation from both of Wealthplus’ directors for alleged breaches of their duties as its directors. 2       Each side in due course sought[note: 1]and secured orders under Order 38 r 2(2) and Order 28 r 4(3) and 4(4) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) permitting them to cross-examine the deponents of the other side’s affidavits. 3       Having read the deponents’ affidavits, having seen them cross-examined and having considered both sides’ submissions, I have dismissed Petroships’ application with costs. I find that Petroships, in seeking leave to bring the derivative action, is not acting in good faith within the meaning of s 216A because its purpose in doing so is to advance its own private interests rather than those of Wealthplus as a company. That finding, in itself, makes it unnecessary for me to go on to consider whether bringing the derivative action appears to beprima faciein the interests of Wealthplus. However, it does not appear to me that Petroships satisfies that test either, even if I were to assume that Petroships’ derivative action is legitimate and arguable. Wealthplus is now in members’ voluntary liquidation. All of the powers of its directors, including the power to cause Wealthplus to pursue Petroships’ derivative action, are now vested in its liquidators. The liquidators’ exercise of their powers is subject to the control and supervision of the court. That, in my view, takes this case outside the rationale of s 216A. 4       Petroships has appealed against my decision. I therefore now set out my grounds.",
        "The background": "",
        "The parties": "5       Petroships holds 10% of Wealthplus, who is the first respondent. When Petroships filed this application, it named Wealthplus as the sole respondent. Wealthplus has since been joined by two other respondents, both of whom became respondents on their own application.[note: 2] 6       The second respondent is Koh Brothers Group Limited (“KBGL”). KBGL is a listed company in the construction business. It is Wealthplus’ ultimate holding company, controlling the 90% of Wealthplus which Petroships does not control. Unlike Petroships, KBGL does not itself own shares in Wealthplus. Instead, KBGL exercises its control of Wealthplus through a chain of holding companies. 7       The third respondent is Megacity Investment Pte Ltd (“Megacity”). Megacity is a shareholder of Wealthplus and is a wholly-owned subsidiary of Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd (“KBCE”). KBCE is a wholly-owned subsidiary of Construction Consortium Pte Ltd (“CCPL”). CCPL is a wholly-owned subsidiary of KBGL.[note: 3] 8       Megacity initially held 90% of the shares in Wealthplus. In 2011, Megacity transferred 41% of the shares in Wealthplus to KBCE. The result is that today, Wealthplus has 3 shareholders: Megacity holding 49% of Wealthplus, KBCE holding 41% and Petroships holding 10%. The transfer of shares in 2011 did not affect KBGL’s position as Wealthplus’ ultimate holding company. 9       The companies that Petroships seeks leave to bring a derivative action against are KBGL, CCPL, KBCE and Megacity, as well as other unnamed companies related to KBGL. Neither KBCE nor CCPL are parties to this application. 10     The directors of Wealthplus that Petroships seeks leave to bring a derivative action against are Koh Teak Huat and Koh Keng Siang. Both men are affiliated with KBGL and its group of companies. In addition to being directors of Wealthplus, they are concurrently directors of Megacity and also of other companies in the KBGL group. Both men are also related to the founder of the KBGL group, Koh Tiat Meng. Koh Teak Huat is Koh Tiat Meng’s brother.[note: 4]Koh Keng Siang is Koh Tiat Meng’s son.[note: 5] 11     The opposition to these proceedings comes only from KBGL and Megacity. As I have mentioned, Wealthplus is now in members’ voluntary liquidation. Its liquidators have committed Wealthplus to a neutral position in these proceedings. I shall explain later in my judgment the circumstances in which Wealthplus was put into liquidation and the consequences of its liquidation.",
        "The joint investment": "12     The derivative action that Petroships seeks leave to commence has its roots in the KBGL group’s project to exploit the rights to develop five plots of land in Shantou, China. Shantou is the ancestral home of many in Singapore’s Teochew community. Koh Tiat Meng is a member of that community. So too is Alan Chan, the man who controls Wealthplus. 13     KBGL obtained the land use rights[note: 6]to these five plots of land in Shantou in 1997. The land-use rights were then held by KBCE as KBGL’s vehicle. 14     Early in 1998, Alan Chan accepted Koh Tiat Meng’s invitation to invest in a project to exploit these rights. Wealthplus was the investment vehicle for this project. KBGL held its investment in Wealthplus through the chain of intermediate holding companies I have described at [7] above. Alan Chan held his investment in Wealthplus through Petroships. 15     In June 1998, Petroships and Megacity signed a joint venture agreement setting out the terms of their joint investment in Wealthplus.[note: 7]The agreement stipulated that the time horizon of the investment should be 10 years or the completion of the project in Shantou, whichever was later. It provided that Wealthplus’ paid up capital would be $1m, with Megacity contributing 90% and Petroships contributing 10%. Each shareholder was to be allotted shares in Wealthplus in proportion, obviously, to its capital contribution. The shareholders agreed that Wealthplus would reimburse KBCE for the cost of the land-use rights up to the amount of $27.7m in three tranches over five years. The shareholders agreed also that they would finance the first tranche of this reimbursement by a $11m loan to Wealthplus, extended by each shareholder in proportion to its shareholding.[note: 8]Petroships in due course extended a shareholder’s loan of $1.1m to Wealthplus. 16     In July 1998, Megacity and Petroships made their appointments to the board of Petroships. Megacity appointed Koh Teak Huat and Koh Keng Siang as directors of Wealthplus. They have both served as directors of Wealthplus without interruption to this day. Petroships appointed Alan Chan as a director of Wealthplus.[note: 9]He served as a director of Wealthplus from July 1998 until his resignation in September 2009. 17     In 2006, Megacity proposed that Wealthplus sell the land-use rights rather than exploit those rights itself. Petroships had no objections.[note: 10]Wealthplus held these rights through three wholly-owned subsidiaries in Singapore who, in turn, owned the three wholly-owned subsidiaries in China in whom the land-use rights were vested. In August 2007, Wealthplus caused the three subsidiaries in China to be sold together with their land-use rights. As a result, Wealthplus’ subsidiaries in Singapore collectively received $19.4m, being the proceeds of sale.[note: 11] 18     Starting in 2008, Petroships began to agitate for its share of the profits of the investment, as well as to recover its capital and to secure repayment of its $1.1m loan to Wealthplus (see [15] above). This led to three consequences. First, Alan Chan resigned as a director of Wealthplus in September 2009. Second, Petroships scrutinised Wealthplus’ accounts and queried certain aspects of Wealthplus’ accounts at its annual general meetings (“AGMs”) held in 2009, 2010 and 2011. Finally, Petroships commenced four unsuccessful suits in a series against Megacity, Wealthplus and KBGL (in various combinations). 19     It is necessary to describe the latter two consequences in more detail.",
        "Four actions interleaved with three AGMs": "Petroships’ first action 20     Petroships commenced the first of its four actions in March 2009. A law firm known as Chung Ting Fai & Co (“CTF”) acted for Petroships. Megacity was the sole defendant to the first action. Petroships claimed that Megacity had failed to pay Petroships its share of the profits from the investment (amounting to $117,728) and had failed to repay Petroships’ loan of $1.1m.[note: 12] 21     Petroships’ first action was struck out in August 2009. It was found to disclose no reasonable cause of action; to be scandalous, frivolous or vexatious; or both.[note: 13]Petroships consented to the striking out. 22     This result is not surprising. The first action was wholly misconceived. Megacity had in fact undertaken no obligation to Petroships to account to Petroships for its share of the profits from its investment in Wealthplus. And Petroships’ loan of $1.1m had been advanced to Wealthplus, not to Megacity. Megacity had never undertaken any direct responsibility to Petroships for this liability, whether by way of guarantee or otherwise. Wealthplus’ 2009 AGM 23     In November 2009, Wealthplus held its AGM for that year. At that AGM, the directors laid the company’s accounts for 2008 before the members. 24     Alan Chan was by that time no longer a director of Wealthplus. He attended the 2009 AGM as Petroships’ representative and raised two queries on the 2008 accounts. The first query was about a provision of $647,090 charged as an allowance for impairment of non-trade receivables. The directors explained that the company had relied on objective evidence of the impairment before making the allowance. The second query was about an expense of $439,631 classified as director’s remuneration. Alan Chan pointed out that no director of Wealthplus had ever received remuneration in past years. The directors explained that the remuneration was paid to Koh Teak Huat for his services to Wealthplus and, in particular, for his contributions in disposing of the land-use rights.[note: 14] Petroships second action 25     Petroships commenced the second of its four actions in January 2010. Once again CTF acted for Petroships. This time, Petroships named both Wealthplus and Megacity as defendants. Petroships now claimed that Wealthplus had failed to repay Petroships’ loan of $1.1m and that Megacity had failed to procure Wealthplus’ repayment of that loan. Petroships claimed, further, that Wealthplus’ delay in repaying the loan had oppressed Petroships as a minority shareholder and/or amounted to acting in disregard of its interests as a shareholder. Petroships alleged also that both Wealthplus and Megacity had acted in an unfairly discriminatory way towards Petroships as a shareholder of Wealthplus. On that factual basis, Petroships sought an order that Megacity procure Wealthplus to repay the $1.1m loan; alternatively an order that Wealthplus be wound up and ordered to repay the loan of $1.1m to Petroships.[note: 15] 26     Petroships’ second action was struck out in September 2010. It was struck out this time because Petroships had breached a peremptory order. The breach arose as follows. The second action was fixed for trial in September 2010. In the run up to trial, Petroships failed to exchange affidavits of evidence in chief as directed by the court. Instead, after the deadline for exchange had expired, Petroships applied for leave to file a supplementary list of documents and to postpone the exchange affidavits of evidence in chief. The court made a peremptory order that unless Petroships filed within one week its supplementary list of documents and an affidavit verifying it, its action would be struck out.[note: 16]Petroships failed to comply with the peremptory order. Petroships’ second action was therefore dismissed with costs.[note: 17] Petroships’ third action 27     Petroships commenced the third of its four actions in October 2010. Once again CTF acted for Petroships. The third action was commenced just over a month after the second action had been struck out. The third action was identical to the second action. The statements of claim in the two actions were exactly the same.[note: 18]Wealthplus and Megacity were again the defendants. 28     Petroships’ third action was struck out in May 2011. The third action was found to be scandalous, frivolous or vexatious; otherwise an abuse of the process of the Court; or both.[note: 19] 29     This is not surprising. Petroships was trying illegitimately to revive the second action, without explaining, excusing or remedying its breach of the peremptory order in that action. Wealthplus’ 2010 AGM 30     Wealthplus held its 2010 AGM in October 2010, the day after Petroships commenced its third action. At this meeting, the directors laid before the members Wealthplus’ accounts for 2009. 31     Alan Chan attended the 2010 AGM as Petroships’ representative. He queried the administrative expenses of $351,155 incurred by Wealthplus in 2009, pointing out that it and its subsidiaries had been dormant that year. The directors gave a breakdown of these expenses. The expenses included legal fees, auditors’ fees for the Wealthplus group (including its six subsidiaries) directors’ remuneration of $120,000 and commissions paid. 32     Alan Chan next queried the directors’ remuneration of $120,000, describing it as excessive. The directors explained that Wealthplus had remunerated Koh Teak Huat in 2009 because he had handled and liaised with the local Chinese authorities relating to the affairs of two of Wealthplus’ subsidiaries in China. Petroships raises the four transactions in correspondence 33     In August 2011, Braddell Brothers LLP wrote to Koh Tiat Meng. They did so on behalf of Alan Chan personally. The letter conveyed Alan Chan’s queries on four transactions in the accounts of Wealthplus together with his invitation to Koh Tiat Meng “to sort out these strange transactions”.[note: 20] 34     The four transactions that Alan Chan queried through Braddell Brothers LLP were: (a)     transfers of sums totalling $14.9m from Wealthplus to various companies within the KBGL group which appeared unrelated to Wealthplus’ investment in China; (b)     a write-off of $135,005 owed to Wealthplus in 2008 described only as “bad debts”; (c)     a provision for impairment of $651,658 in 2009 for non-trade related debts; and (d)     director’s fees totalling $559,631 paid in 2008 and 2009 (see [24] and [32] above). These four transactions are also the subject-matter of Petroships’ derivative action.[note: 21] 35     Koh Tiat Meng did not respond to this letter. The response came instead from Rajah & Tann LLP (“R&T”) representing Wealthplus.[note: 22]Wealthplus took the position that it was more appropriate for Wealthplus (rather than Koh Tiat Meng) to deal with Alan Chan’s queries about the four transactions. Wealthplus also told Alan Chan that its directors would be pleased to answer his queries at its AGM then fixed for October 2011.[note: 23] 36     Petroships did not send a representative to attend Wealthplus’ AGM in October 2011. Instead, Petroships instructed Braddell Brothers LLP to write to KBGL on its behalf.[note: 24]In that letter, Petroships (instead of Alan Chan) now put queries to KBGL (instead of Koh Tiat Meng). But the queries were about the same four transactions. Petroships demanded that KBGL give a full and proper account of the affairs of Wealthplus within seven days – including an explanation and account of the four transactions – failing which Petroships intended to commence proceedings against KBGL. 37     KBGL did not respond to this letter. The response again came from R&T representing Wealthplus.[note: 25]Wealthplus took the position that it was more appropriate for Wealthplus (rather than KBGL) to deal with Petroships’ queries about the four transactions. Wealthplus also told Petroships that its directors would be pleased to answer its queries at the 2011 AGM, by then rescheduled to November 2011.[note: 26] Wealthplus’ 2011 AGM 38     Wealthplus’ 2011 AGM was duly held in November 2011. Petroships attended by proxy. The proxy asked for an explanation of the four transactions. Wealthplus’ directors gave the following explanation:[note: 27] (a)    the transfer of various sums from the Wealthplus Group to companies within the [KBGL] Group was part of the reimbursement cost for the acquisition of land in Shantou, China as per the Joint Venture Agreement dated 8 June 1998; (b)    the write-off of S$135,005 was mainly the outstanding balances due from the three ex-subsidiaries in China which had been disposed [of] in FY2007 to their immediate holding company that could not be recovered; (c)    the provision for impairment of $651,658 included: (i)    an outstanding balance of S$537,253 due from the three ex-subsidiaries which had been disposed [of[ in FY2007 to related companies in China, the recovery of which was doubtful; and (ii)   a prepayment of S$112,335 in respect of an amount incurred by a director relating to the disposal of land in Shantou, China; (d)    [Wealthplus] had provided director’s remuneration to [Koh Teak Huat] as he was the only director who took an active role in managing [Wealthplus’] business. [Koh Teak Huat] was paid director’s remuneration for contributions made in respect of the disposal of five plots of land in China. Both Mr [Alan Chan] and Mr Koh Keng Siang received no directors’ remuneration. 39     At the same AGM, the directors informed the shareholders that a general meeting would be convened shortly to pass the necessary resolutions to put Wealthplus into members’ voluntary liquidation.[note: 28] Petroships’ fourth action 40     Petroships commenced its fourth and final action in November 2011, three days after Wealthplus’ 2011 AGM. This time Braddell Brothers LLP, and not CTF, acted for Petroships. I shall therefore refer to the first three actions collectively as “the CTF actions”. 41     Petroships named KBGL as the only defendant to the fourth action. Petroships alleged that KBGL was liable to Petroships on three grounds: (i) Megacity had entered into the written joint venture agreement with Petroships as KBGL’s agent; (ii) KBGL and Petroships were parties to a broader agreement, partly written and partly oral, in connection with Petroships’ investment in Wealthplus; and (iii) KBGL was a fiduciary for Petroships arising from their joint venture through Wealthplus. 42     On that basis, Petroships alleged: (i) that KBGL had wrongfully caused Wealthplus to enter into various transactions (including but not limited to the four transactions set out at [34] above) which appeared to be solely in the interests of KBGL and not in the interests of Wealthplus; (ii) that KGBL had failed to repay the loan of $1.1m which Petroships had extended to Wealthplus and had failed to distribute to Petroships its share of the profits realised by Wealthplus; and (iii) that KBGL was liable to account to Petroships for its share of Wealthplus’ profits.[note: 29] 43     Petroships’ case in the fourth action was that it had a contractual relationship with KBGL in relation to its investment in Wealthplus. That was contrary to the clear import of the written joint venture agreement entered into in 1998 between Megacity and Petroships. It was also contrary to the position which Petroships had taken and maintained in the CTF actions. 44     Petroships’ fourth action was struck out in March 2012. The court held that Petroships had failed to adduceanyevidence at all to show that Petroships had entered into a contractual relationship with KBGL (as opposed to Megacity) when Petroships invested in Wealthplus. It was therefore held that the fourth action, while perhaps not strictly speaking an abuse of process, was clearly frivolous and vexatious. 45     Petroships appealed this decision to a judge in chambers. Its appeal was dismissed in May 2012.[note: 30]",
        "Petroships applies for leave to bring a derivative action": "Petroships serves notice under s 216A 46     The following month, in June 2012, Petroships initiated the procedure under s 216A which has led to this application. Braddell Brothers LLP served notice on Wealthplus’ directors on behalf of Petroships expressly pursuant to s 216A(3)(a).[note: 31]The notice: (i) set out the four transactions (see [34] above); (ii) noted that Wealthplus had in correspondence promised Petroships that the directors would give a full explanation of those transactions at the 2011 AGM; (iii) set out the directors’ explanations (see [38] above); and (iv) rejected their explanations as mere assertions and insufficient. The notice concluded by inviting the directors within fourteen days either to furnish a full explanation of the four transactions or to cause Wealthplus to commence action: (i) against the directors who procured or authorised the four transactions for breach of their duties as directors; and (ii) against the relevant KBGL group companies to recover the money which Wealthplus had transferred to them. 47     R&T responded to Petroships in July 2012 on behalf of Wealthplus’ directors. Their position was as follows: (i) the directors had given sufficient explanations for each transaction at the 2011 AGM and at previous AGMs; (ii) Alan Chan had been a director of Wealthplus from July 1998 until September 2009 with full access to Wealthplus’ accounts and financial statements and had signed directors’ resolutions approving Wealthplus’ audited accounts for each year from 1998 to 2007; (iii) Petroships was not actingbona fidewithin the meaning of s 216A because it had commenced multiple suits against various parties arising from the joint venture agreement between Megacity and Petroships; and (iv) the directors would, as foreshadowed at the 2011 AGM, convene a general meeting in due course to place Wealthplus in members’ voluntary liquidation. Petroships commences proceedings under s 216A 48     Wealthplus’ directors having refused to act on the s 216A notice, Petroships filed this application in August 2012. 49     In this application, Petroships seeks five substantive heads of relief: (a)     Leave to bring a derivative action against Koh Teak Huat and Koh Keng Siang for breaches of their duties as directors to Wealthplus; (b)     Leave to bring a derivative action against Megacity, KBCE, KBGL and related companies to recover various sums that Wealthplus or its subsidiaries have transferred to them; (c)     An order that Petroships have the conduct of the derivative actions, and of any execution proceedings thereafter; (d)     An order that Wealthplus allow Petroships to have access to all documents and accounts relating to Wealthplus and its subsidiaries for the financial years 1997 to 2011; and (e)     An order that Wealthplus pay all costs incurred by Petroships in pursuing the derivative actions. 50     Although the relief prayed for in the originating summons does not give details of the subject-matter of the derivative action, Alan Chan’s affidavit in support of the originating summons makes clear that the subject-matter comprises the four transactions listed at [34] above.[note: 32]These four transactions were also the subject-matter of Petroships’ representative’s queries at the 2011 AGM and were expressly pleaded in its fourth action.[note: 33] Wealthplus goes into members’ voluntary liquidation 51     The directors of Wealthplus convened an extraordinary general meeting of its members to be held in August 2012 to pass a special resolution to put Wealthplus in members’ voluntary liquidation. Petroships applied in advance of the meeting for an injunction to prevent it being held but withdrew the application before it could be heard on the merits. The meeting went ahead. 52     Petroships appointed a proxy to attend the meeting. She opposed the resolution on the grounds that Wealthplus should not go into liquidation until its directors had explained the four transactions fully, with supporting documentation. The directors took the position that Petroships was at liberty to take up the four transactions with the liquidators once appointed. The special resolution was put to a vote. Not surprisingly, it passed comfortably. Yin Kum Choy and RS Ramasamy of Adept Public Accounting Corporation were appointed Wealthplus’ liquidators.[note: 34] 53     Two days after the meeting, Petroships sought an injunction to restrain Wealthplus from acting on the resolution; alternatively an injunction to restrain the liquidators from doing anything which would materially affect this application or the derivative action it contemplates. No such injunctions were ever granted, although it is not entirely clear why. Petroships pursues the four transactions with the liquidators 54     In October 2012, Braddell Brothers LLP wrote on behalf of Petroships to the liquidators.[note: 35]Petroships drew the liquidators’ attention to this application. It informed the liquidators of its view: (i) that the directors of Wealthplus had failed adequately to explain the four transactions; and (ii) that Wealthplus had a claim arising from the four transactions against Koh Teak Huat, Koh Keng Siang, KBGL and its related companies. Petroships asked the liquidators whether they accepted the directors’ explanations and, if not, whether they would be taking any action to vindicate Wealthplus’ rights. 55     In November 2012, the liquidators through solicitors wrote to all three shareholders of Wealthplus – Petroships, Megacity and KBCE – stating that the liquidators intended to take steps to investigate Petroships’ allegations and, if appropriate, to recover the sums of money in question provided that: (a) the three shareholders consented; and (b) the three shareholders indemnified the liquidators for the costs of taking those steps.[note: 36]The liquidators indicated that if there was no consensus amongst the shareholders, the liquidators would seek directions from the Court. 56     Not surprisingly, the shareholders could not arrive at any consensus on the liquidators’ proposals. In January 2013, therefore, the liquidators applied to the High Court for directions “that the Liquidators take steps to review, enquire into and/or investigate into the affairs of the Company, in particular, in respect of the matters raised by Petroships”.[note: 37] 57     While the liquidators’ application for directions was waiting to be heard, Megacity and KBCE requisitioned in June 2013[note: 38]an extraordinary general meeting of Wealthplus’ members to be held in August 2013 to consider a resolution to remove the liquidators from office. The liquidators’ application for directions was adjourned pending the meeting. The liquidators accepted the inevitable and tendered their resignations before the meeting. 58     The meeting nevertheless went ahead in August 2013. It resolved to accept the liquidators’ resignations and to appoint new liquidators in their place: Sim Guan Seng, Khor Boon Hong and Goh Yeow Kiang Victor of Baker Tilly TFW LLP.[note: 39]Petroships voted against both resolutions at this general meeting but was easily outvoted. These are the liquidators who remain in office today. 59     Petroships tried to query the new liquidators on the four transactions at the meeting but was told to take their queries up with their liquidators outside the meeting in correspondence. Petroships did so. The new liquidators indicated that they did not intend to take over the previous liquidators’ application for directions[note: 40]to investigate the four transactions. That application was accordingly withdrawn when it came up for hearing in October 2013. The new liquidators’ position 60     The current liquidators’ position is that this application arises from a dispute between the shareholders of Wealthplus. They do not consider themselves in a position to take an active part in this application, having no personal knowledge of the four transactions or of the broader background.[note: 41]It is for that reason that they have committed Wealthplus to a neutral stance on this application. 61     Given the liquidators’ position, and in order to ensure that this application is opposed, KBGL and Megacity applied successfully to be added as respondents. In September 2013, they became the second and third respondents respectively. In the absence of any opposition from Wealthplus, it is KBGL and Megacity who have borne the entire burden of opposing Petroships’ application.",
        "The issues": "62     In order to enliven my power to grant it leave under s 216A, Petroships must satisfy three statutory tests. These tests are set out in s 216A(3): (3)    No action may be brought and no intervention in an action may be made under subsection (2) unless the Court is satisfied that — (a)    the complainant has given 14 days’ notice to the directors of the company of his intention to apply to the Court under subsection (2) if the directors of the company do not bring, diligently prosecute or defend or discontinue the action; (b)    the complainant is acting in good faith; and (c)    it appears to be prima facie in the interests of the company that the action be brought, prosecuted, defended or discontinued. 63     It is common ground that Petroships has satisfied s 216A(3)(a). The only issues I have to deal with, therefore, are: (a)     whether Petroships is acting in good faith within the meaning of s 216A(3)(b); and (b)     whether it appears to beprima faciein the interests of Wealthplus, within the meaning of s 216A(3)(c), that Petroships brings the derivative action. I take these two tests in turn. I consider first whether Petroships is acting in good faith within the meaning of s 216A(3)(b).",
        "Is Petroships acting in good faith?": "64     Petroships does not begin its submissions by addressing its good faith. Instead, it begins its submissions by focusing on the merits of its derivative action and by pointing out that all that Petroships is trying to do is to help Wealthplus recover its assets.[note: 42]Petroships invites the court to infer that it is acting in good faith primarily from the fact that the derivative action has merit. 65     It is therefore necessary to say some words about the burden of proof on the issue of good faith.",
        "The burden is on Petroships to demonstrate its good faith": "The allocation of the legal and evidential burdens 66     The burden of proof on the issue of good faith under s 216A(3)(b) lies on the applicant:Ang Thiam Swee v Low Hian Chor[2013] 2 SLR 340 (“Ang Thiam Swee”) at [23]. There is no presumption that an applicant under s 216A is acting in good faith which the respondent must then rebut (cf Agus Irawan v Toh Teck Cheng[2002] 1 SLR(R) 471 (“Agus Irawan”) at [9]). 67     The burden of proof referred to inAng Thiam Sweeis the legal burden. The applicant therefore bears the burden, after all the evidence is in, of satisfying the court on the balance of probabilities that it is acting in good faith. Wigmore calls this the risk of non-persuasion. Even if the applicant goes far enough to leave the court in perfect equipoise on the issue of good faith, the applicant has failed to persuade the court and therefore loses on that issue. 68     The legal burden on any issue normally carries with it the evidential burden on that issue also. That is the case with the test of good faith under s 216A(3)(b). The applicant therefore also bears the evidential burden on this issue. This is what Wigmore calls the duty of producing evidence. The applicant has a duty to produce evidence to establish its own good faith. Indeed, the applicant bears both the legal and the evidential burden not just on s 216A(3)(b) but also on s 216A(3)(a) and s 216A(3)(c). 69     In a trial, the consequence of failing to discharge an evidential burden is brought home to a plaintiff on a submission of no case to answer. An application under s 216A is not an action and is not determined at trial. It is an application and is determined summarily. There is, therefore, no opportunity for a respondent to make a submission of no case to answer. That is so even where, as here, the deponents on both sides are cross-examined on their affidavits. That procedural device does not, in itself, turn an application into an action. It is nevertheless useful to bear in mind for the analysis which follows that the applicant under s 216A not only bears the legal burden but also the evidential burden. An applicant’s approach to good faith 70     A litigant who bears an evidential burden on a particular fact can meet that burden in one of two ways: (i) by producing direct evidence of that fact; or (ii) by producing or pointing to evidence of circumstances from which the court can infer the existence of that fact. Good faith is a subjective state of mind. Like any state of mind, it is therefore incapable of proof by direct evidence other than self-serving assertions. A bald assertion by an applicant that it is acting in good faith will meet an evidential burden only in the most technical of senses, and will only rarely suffice to discharge a legal burden of proof:Ang Thiam Siewat [19]. 71     For all practical purposes, therefore, meeting the evidential burden on the issue of good faith requires the applicant to produce or point to evidence from which its good faith can beinferred. This is an important point.Ang Thiam Sweeestablishes (at [29]) that the subjective test of good faith under s 216A(3)(b) must be kept analytically distinct from the objective test of whether it appears to beprima faciein the company’s interests to bring the derivative action under s 216A(3)(c). However, that case also establishes in the same paragraph that there is a legitimate – though, of course, never inevitable – inferential pathway from a finding that the objective test in s 216A(3)(c) is satisfied to a finding that the subjective test in s 216A(3)(b) is also satisfied. In framing its submissions as it has, Petroships prays in aid, entirely legitimately, this inferential pathway. (There is also a possible inferential pathway in reverse: from the subjective to the objective. But that inference is ordinarily so slight as to be of no practical significance.) 72Ang Thiam Sweetherefore accepts that the inquiry into an applicant’s good faith can overlap with the inquiry into whether the derivative action appears to beprima faciein the interests of the company. That is because the latter test, if satisfied, is often a circumstance from which the former can be inferred. Note that it is theinquirieswhich overlap. The concepts themselves and the statutory tests employing them are distinct. 73     It is because the inquiries overlap that a court is entitled – but not of course bound – to infer that an applicant is acting in good faith if it finds that the applicant’s derivative action is “a legitimate claim which the directors are unreasonably reluctant to pursue with the appropriate vigour or at all”: seePang Yong Hock and another v PKS Contracts Services Pte Ltd[2004] 3 SLR(R) 1 (“Pang Yong Hock”) at [20]. By the same token, a court is entitled – though again not bound – to infer that an applicant lacks good faith if it finds the derivative action to be frivolous or vexatious:Ang Thiam Sweeat [55]. 74     The result of all of this is that an applicant who meet its evidential burden on the “prima facieinterests of the company” test in s 216A(3)(c) also meets in a practical sense, albeit incidentally, its evidential burden on the “good faith” test in s 216A(3)(b). A respondent’s approach to good faith 75     A respondent can approach the issue of good faith in one of three ways. First, it can decline to put the applicant’s good faith in issue. Alternatively, it can simply challenge the applicant’s good faith without more. Finally, it can adduce or point to evidence which it says shows affirmatively that the applicant is not acting in good faith. 76     A respondent who adopts the first approach effectively concedes the issue of good faith. The result is that the court need not deal with that issue separately, save perhaps to note thede factoconcession and make a formal finding that s 216A(3)(b) is satisfied. 77     A respondent who adopts the second approach runs the very real risk of losing on the issue of good faith. If the court finds that the applicant satisfies s 216A(3)(c), the court is very likely from that finding to go on to draw the entirely legitimate inference that the applicant also satisfies s 216A(3)(b). 78     The result is that the respondent does bear, in a practical sense, a burden on the issue of good faith, but it is only atacticalburden or the burden on the application. A challenge to an applicant’s good faith which is to carry any realistic prospect of success must adduce or point to evidence capable of suggesting that the applicant isnotacting in good faith. Perhaps this is all that Choo Han Teck JC (as he then was) meant inAgus Irawanwhen he said (at [9]): If at all, the burden would be on the [respondent] to show that the applicant did not act in good faith; for I am entitled, am I not, to assume that every party who comes to court with a reasonable and legitimate claim is acting in good faith – until proven otherwise. 79     Where a respondent meets its tactical burden, the applicant can no longer simply point to the merits of the derivative action and invite the court to draw an inference of good faith from that fact alone. An applicant who does no more than that will fail to discharge its legal burden of proof on the issue of good faith. If the court find that the applicant lacks good faith, its application will fail, no matter how strong the merits of the derivative action are.",
        "The respondents attack Petroships’ good faith": "80     The respondents in this case meet their tactical burden by advancing four principal grounds which they say demonstrate that Petroships is not acting in good faith: (a)     Petroships’ derivative action is an abuse of process in light of its four actions I have described. (b)     Petroships has been guilty of unreasonable delay in commencing these proceedings. (c)     Alan Chan has displayed a lack of honesty in this application. (d)     Alan Chan participated in some of the very transactions which Petroships now alleges were wrongs done to Wealthplus. 81     I begin my analysis of these four grounds by summarising the principles underlying the test of good faith in s 216A(3)(b).",
        "What is “good faith” under s 216A?": "82     The leading case on the test of good faith under s 216A(3)(b) is the Court of Appeal’s decision inAng Thiam Swee. From that case, I derive the following four principles: (a)     The test of good faith always considers two interrelated, but non-exhaustive, factors: (i)       whether the applicant honestly believes that a good cause of action exists and has a reasonable prospect of success (at [29]); and (ii)       whether the applicant is seeking to bring the derivative action for such a collateral purpose as would amount to an abuse of process: at [27]. (b)     On the second of these factors, the focus is on the applicant’spurposein bringing the proposed derivative action rather than itsmotivein doing so: at [13] and [16]. Thus, an applicant may nevertheless be acting in good faith even if it is motivated by hostility, personal animosity or malice or even by self-interest in maximising the value of its shares so long as its purpose is to advance the interests of the company as a whole: at [16]. (c)     Even if the applicant has a collateral purpose, it will nevertheless act in good faith if that “collateral purpose [is] sufficiently consistent with the purpose of ‘doing justice to a company’”. Such a collateral purpose does not render its action an abuse of s 216A or of the company: at [31]. (d)     But an applicant whose judgment has been clouded by purely personal considerations (at [13]) or who is abusing s 216A, and by extension also the company, as a vehicle to advance its own aims and interests (at [31]) will not be acting in good faith. Examples are an applicant whose collateral purpose in bringing the derivative action is to pursue a private vendetta or to damage or destroy the company out of sheer spite or to benefit a competitor: at [29]. The two non-exhaustive factors which appear in the first proposition above are drawn from the decision of Palmer J inSwansson v R A Pratt Properties Pty Ltd(2002) 42 ACSR 313 at [36] (“Swansson”).  For that reason, I will refer to them as “Swanssonfactors”. 83     I turn now to consider the four principal grounds on which the respondents rely to submit that Petroships is not acting in good faith.",
        "The four actions": "84     The respondents’ first ground is that Petroships’ derivative action would be an abuse of the process of the court in light of its four actions, all of which have failed. 85     A summary of the respondents’ submissions is as follows. The derivative action arises out of identical facts and depends on the same evidence as Petroships’ fourth action.[note: 43]The derivative action is therefore an abuse of the process of the court in the sense that it would either: (i) involve the process of the court being used for some ulterior or improper purpose or in an improper way rather than being used fairly or honestly; or (ii) because the derivative action would be the fifth in a string of multiple or successive proceedings which cause or are likely to cause the respondents improper vexation or oppression.[note: 44]This submission relies on the second and fourth category of abuse of the process of the court identified inChee Siok Chin and others v Minister for Home Affairs and another[2006] 1 SLR(R) 582 at [34]. 86     In the alternative, the respondents submit that the extended doctrine ofres judicatarenders the derivative action an abuse of process.[note: 45]Petroships could have raised the subject-matter of the derivative action in the CTF actions but failed to do so. Although the set of defendants to the derivative action will not be identical to the defendants whom Petroships sued in the four actions, the respondents submit that the extended doctrine ofres judicatadoes not require identity of parties.[note: 46] 87     In response, Petroships makes three broad points about its four actions. First, the four actions were between different parties,[note: 47]raised different causes of action and were on different subject-matter.[note: 48]Second, the four actions are incapable of giving rise to an issue estoppel because they were all struck outwithoutthe merits being considered.[note: 49]Finally, the court ought not to draw any inferences about Petroships’ good faith from the CTF actions because CTF commenced the CTF actions without Petroships’ authority.[note: 50] Derivative action would not be an abuse of the process of the court 88     I accept Petroships’ submission that the derivative action would not be an abuse of the process of the court under the procedural law. None of Petroships’ four previous actions was brought to enforce a right vested in Wealthplus. None of those actions asserted a cause of action founded upon recovering money which Wealthplus had paid to related companies and upon recovering compensation from the directors of Wealthplus for breach of their duties as directors. 89     Instead, each of the four actions was founded upon a cause of action, however misconceived, which was said to be vested in Petroships. That cause of action was principally in contract and ultimately connected to its 1998 joint venture agreement with Megacity. All four of the actions sought to recover Petroships’ loan of $1.1m extended to Wealthplus.[note: 51]The first and fourth actions sought in addition to recover Petroships’ 10% share of the profits of the investment in Wealthplus. All four of the actions were therefore directed towards vindicating Petroships’ rights, and not Wealthplus’ rights. It is, of course, only Wealthplus’ rights which the derivative action seeks to vindicate. 90     It is true that Petroships’ fourth action pleaded the very same four transactions which are to form the subject-matter of the derivative action.[note: 52]But the fourth action was brought by Petroships against KBGL, not by Wealthplus against KBGL. And Petroships’ cause of action against KBGL was for breach of a contract said to be between KBGL and Petroships and for breach of fiduciary duties said to be owed by KBGL to Petroships. Those causes of action have nothing to do with any duties owed to Wealthplus. In any event, Petroships did not in the fourth action seek against KBGL any substantive relief arising from those four transactions. It pleaded the four transactions as part of its case that the effect of those four transactions must be taken into account when determining the value of Petroships’ 10% share of the profits of its investment in Wealthplus. The only substantive relief Petroships sought in the fourth action related to its own rights arising from its own cause of action asserted against KBGL. 91     I also do not accept the respondent’s argument that the derivative action would be an abuse of the process under the doctrine inHenderson v Henderson. The doctrine inHenderson v Hendersonis indeed an aspect of the doctrine of abuse of process under the procedural law, but it is one which does not depend wholly and exclusively on the subjective intent of the party invoking the court’s process. That subjective intent is of the essence in applying the test in s 216A(3)(b). If the doctrine inHenderson v Hendersonis relevant at all, it would be relevant to a finding on s 216A(3)(c) and only inferentially from there to a finding on s 216A(3)(b). 92     Petroships’ submission on this point can be tested in this way. If, in June 2012, the directors of Wealthplus had responded to Petroships’ notice under s 216A(3)(a) by commencing action as Petroships suggested against KBGL and its related companies and against Wealthplus’ directors, could those defendants have relied on Petroships’ four actions to strike out Wealthplus’ hypothetical action on the grounds that it was an abuse of process? The answer is clearly no, for the reasons set out at [88]–[90]. The answer cannot be any different if Wealthplus’ action is brought, not by the directors committing the company to litigation pursuant to their powers under its articles of association, but by an applicant committing the company to litigation pursuant to the leave of the court under s 216A. A company bringing a derivative action enjoys no substantive or procedural advantages and suffers no substantive or procedural disadvantages than a company litigating in the ordinary way at the initiation of and under the supervision of its directors. Drawing inferences from the four actions 93     My finding that Petroships’ four actions do not render its derivative action an abuse of the process of the court is not, however, the end of the matter. The respondents in cross-examining Alan Chan put it to him that the derivative action, even if it is not an abuse of the process of the court under the procedural law, is not brought in good faith because it is an attempt to circumvent the striking out of Petroships’ four actions against KBGL. 94     The respondents first put it to Alan Chan that his fourth action was an attempt to circumvent the striking out of the CTF actions. His response was to disclaim responsibility for the CTF actions:[note: 53] QOkay. I’m going to put it to you, Mr Chan, that [the fourth action] that was commenced after three previous suits had been struck off, was an attempt by you to claim the same thing in the previous suits which is an account of profits and the loan against a different party which is now Koh Brothers Group Ltd. It was an attempt by you to circumvent the three previous striking outs. AAre you talking about the third suit? QNo, Mr Chan, I’m putting it to you that ... your fourth suit ... which you brought against Koh Brothers Group Ltd was an attempt by you to circumvent the striking out in the three previous suits. Which is why you brought it for--- AVer--- Q---the first time against--- AVery well. Q---Koh Brothers Group Ltd. AVery well. I didn’t try to circumvent anything because the three suits were not my idea. Not my idea. So I didn’t try to circumvent. What I did know was, er, the three suits were struck off so we have a fresh one, a real one, a proper one. The three suits struck out, I’m not surprised because, er, they didn’t stand a chance. And I had nothing to do with those three suits. QSo you had nothing to do with any one of the three suits? AI had nothing to do and I---I had nothing to do with any of the three suits. I explain at [106]–[113] below why I reject Alan Chan’s attempts to distance himself and Petroships from the CTF actions. 95     The respondents then put to Alan Chan during cross-examination that this application under s 216A is nothing but an attempt to circumvent the striking out of Petroships’ fourth action.[note: 54]His response was not particularly edifying: QOkay. I’m going to put it to you that you have commenced this action, 216A action, only after your fourth suit against KBGL was struck out in an attempt to get around the striking out of that suit. AEr, again, sorry. QOkay, Mr Chan, let me give you the background. You had raised these questionable transactions in 2011 in a letter, okay. After having identified these questionable transactions, you commenced an action against Koh Brothers claiming the loan and the profits, okay. You did not claim anything in respect of the---you did---you did not bring an action on behalf of the company in respect of the questionable transaction at that time. Okay, I’ve asked you about this this morning. The fourth suit was struck out, okay. It’s only thereafter you commenced your Section 216A action. So my question---my put to you, Mr Chan, is that you are now bringing this action, 216A action, only because of your attempt to get around the striking out of your three previous suits against Wealthplus and Megacity, and your fourth suit against Koh Brothers Pte Ltd. AThe four suits have been struck out? QYes, Mr Chan, four suits have been struck out. AAh. QYou didn’t know your fourth suit had been struck out? ANo. QMr Chan, do you know what’s the evidence you’re giving in Court today? The fourth suit against Koh Brothers, are you aware that that action had been struck out? AI---er--- QI--- A---I’m not clear. QYou’re not clear? AI’m not clear, no. 96     I find that the circumstances in which Petroships chose to commence its four actions coupled with Alan Chan’s evidence in cross-examination warrant the inference that Petroships has an illegitimate collateral purpose in seeking leave to bring the derivative action. That collateral purpose is to pursue its private interests against KBGL and its related companies by a derivative action in Wealthplus’ name. That, to my mind suffices to establish that Petroships is not acting in good faith. (a)   What did Petroships do with what it knew? 97     I first look at what Petroships knew, when it knew it and what it did with that knowledge. On 17 November 2009, Alan Chan attended Wealthplus’ 2009 AGM and queried two figures in Wealthplus’ 2008 accounts: (i) the allowance for impairment of non-trade receivables amounting to $647,090; and (ii) director’s remuneration of $439,631. The first figure of $647,090 is part of the accumulated allowance for impairment amounting to $652,161 in Wealthplus’ 2009 accounts.[note: 55]This is the basis of Petroships’ claim in the derivative action in respect of a “provision for impairment of $651,658 in 2009 arising out of non-trade related debts”.[note: 56]The second figure of $439,631 is part of the sum of $559,631, the total amount of director’s remuneration paid by Wealthplus in 2008 and 2009. This is the basis of Petroships’ claim in the derivative action in respect of “payment of director’s fees to the Directors in 2008 and 2009 amounting to $559,631”.[note: 57] 98     By the time of the 2009 AGM, therefore, Petroships knew of two of the four transactions which Petroships now says amount to wrongs against Wealthplus and which are the subject-matter of its derivative action. Armed with that knowledge, Petroships’ immediate response was not to initiate the procedure under s 216A in order to right wrongs done to Wealthplus. Instead, it acted on this knowledge by commencing its second and third actions against Megacity to seek a remedy for itself. Those identical actions, both of which were struck out, claimed that Megacity had failed to procure Wealthplus’ repayment of Petroships’ loan of $1.1m and had oppressed Petroships, acted in disregard of Petroships’ interests or had acted in an unfairly discriminatory way towards Petroships (see [25] to [29] above). 99     At the latest by August 2011 (see [33]–[34] above), Petroships knew of all four of the transactions which it now says amount to wrongs against Wealthplus and which are the subject-matter of its derivative action. Armed with that knowledge, Petroships took three steps. First, it questioned these four transactions at Wealthplus’ AGM held in November 2011. Second, three days after that AGM, it commenced its fourth action, once again seeking a remedy for itself but this time from KBGL. Third, and only finally, Petroships initiated the procedure under s 216A in June 2012. 100    This sequence of events from 2009 to 2012 indicates the priority which Petroships itself attached to securing a remedy for itself as compared to securing a remedy for Wealthplus. A minority shareholder who genuinely sought to right wrongs done to Wealthplus would have initiated the procedure under s 216A immediately upon discovering the wrongs or, at the latest, immediately after the company’s directors had failed to offer a satisfactory explanation for those wrongs. That would have been in 2009 in respect of at least some of the alleged wrongs and in 2011 in respect of all of the alleged wrongs. Instead, Petroships first spent three years and commenced four actions to seek a remedy for itself. It is particularly telling that Petroships’ first instinct when it had knowledge of all four transactions in 2011 was to use that knowledge as ammunition for its own claim for a remedy against KBGL. Its current characterisation of those four transactions as serious wrongs done to Wealthplus therefore rings somewhat hollow. It is only when this fourth and final attempt failed that Petroships proceeded under s 216A ostensibly to seek a remedy for Wealthplus. 101    From this sequence of events, I find the inference irresistible that Petroships’ real purpose in seeking leave to bring the derivative action is not to right alleged wrongs done to Wealthplus but to right alleged wrongs done to Petroships. Its real purpose is to pursue by the only means which remains available to it its overriding objective of recovering forPetroshipsagainstKBGLor its related companies its $1.1m loan to Wealthplus and a share of the profits of its investment in Wealthplus. That to my mind, is a collateral purpose which defeats Petroships’ good faith. (b)   Alan Chan’s evidence about the four actions 102    The inference I draw is supported by Alan Chan’s evidence in cross-examination on the circumstances surrounding Petroships’ four actions. 103    First, Alan Chan accepted in cross-examination that he instructed CTF in 2009 to approach[note: 58]KBGL about “certain things”[note: 59]which he had to pursue with KBGL and to seek repayment from KBGL of the $1.1m loan which Petroships had extended to Wealthplus in 1998.[note: 60]These “certain things” included part of the subject-matter of Petroships’ derivative action. Alan Chan explained that he had instructed CTF to “go after”[note: 61]KBGL for repayment because that was the “headquarters”[note: 62]or the “fountain head”[note: 63]of the corporate group and Wealthplus and Megacity were just “paper companies”.[note: 64]His instructions also contemplated CTF commencing, if necessary, an action against KBGL to recover Petroships’ loan to Wealthplus:[note: 65] Very simple. My instruction to him was to go for Koh Brothers Group. Koh Brothers. ... The---the headquarters is my simple instruction. Because, er, in my---in my mind, the first agreement was with the Koh Brothers Group. That is the original agreement. So I just simply instructed him to go for Koh Brothers Group. Not the, er, the, er, paper companies. But he went to---he went for the paper companies, without letting me know. ... 104    Second, Alan Chan confirmed in cross-examination that even though Petroships had knowledge in 2011 of all four transactions, it did not then proceed under s 216A becausehe“did not need the money so urgently”.[note: 66]For that reason, he testified, he was prepared to pursue Petroships’ fourth action seeking to recover the $1.1m loan and a share of Wealthplus’ profits from KBGL first, and to defer seeking leave to pursue in Wealthplus’ name the four transactions which he accepted would restore value to Wealthplus.[note: 67] 105    Both aspects of Alan Chan’s cross-examination reinforce my view that Petroships seeks leave to bring the derivative action because it is the only remaining avenue by which it can proceed against KBGL or its related companies to achieve the objective of Petroships’ four failed actions. The CTF actions were not unauthorised 106    Petroships argues that no inferences ought to be drawn against Petroships arising from the CTF actions because CTF commenced them without Petroships’ authority. Petroships has made this argument once before: it raised the same point to oppose the striking out application in the fourth action. The court nevertheless struck out the fourth action, holding Petroships’ “assertion that its previous solicitors acted without authority … to be an afterthought”.[note: 68]I agree. 107    I find that the first action is attributable to Petroships. Alan Chan took the following position on the CTF actions as a whole in an affidavit filed in the fourth action:[note: 69] 42.    To recap, sometime in 2009, I (on behalf of the plaintiff) ... instructed M/s Chung Ting Fai (“CTF”) to help the Plaintiffs seek repayment of the Shareholder Loan it provided to Wealthplus in 1998 which wasrepayable on demand. The nature of the loan is clearly stated in Wealthplus’ annual financial statements .... I decided to recall the Shareholder Loan as I felt that the Investment had concluded and that the Shareholder Loan should be returned to [Petroships]. ... 43.    Unbeknownst to [me], CTF commenced the [CTF actions] against [Megacity] and/or Wealthplus and made various assertions and claimed various reliefs in the pleadings, all of which I did not [instruct] him to make. I wish to point out that the fact that a total ofthree (3) suitswere commenced and in succession spoke volumes – to put it simply, [Petroships] would not have agreed to file these claims (some of which were identical) against Megacity and/or Wealthplus. The only explanation is that the [first three of the earlier actions] were filed without the Plaintiff’s knowledge/consent. [Emphasis original] 108    Alan Chan accepts in this passage that he had, before the first action was commenced, instructed CTF on behalf of Petroships to pursue a claim to recover Petroships’ $1.1m loan and its share of the profits of the investment in Wealthplus, and to commence action to achieve that purpose if necessary. The only deviation from his instructions that he now complains about is that CTF commenced the first action against Megacity, and not against KBGL. That does not undermine the inference I draw from his evidence: that Petroships’ true purpose in these proceedings is to pursue by the only remaining means available a claim for Petroships against KBGL. If anything, this evidence supports that inference. 109    I find that the second action too is attributable to Petroships. Alan Chan was aware of the second action. He affirmed a discovery affidavit filed on behalf of Petroships in that action.[note: 70]For the reasons set out below at [117]–[127], I reject Alan Chan’s evidence that he signed the discovery affidavit not knowing that it was a discovery affidavit. 110    I find that Alan Chan expressly or impliedly held his son, Tony Chan, out as having authority to instruct solicitors on behalf of Petroships in relation to the CTF actions. Alan Chan does not dispute that his son, Tony Chan, instructed CTF in respect of the CTF actions and approved all documents filed in them. What Alan Chan denies is telling CTF that Tony Chan had Petroships’ authority to instruct CTF.[note: 71]That may be technically true. But Tony Chan was never a director,[note: 72]a shareholder[note: 73]or a manager[note: 74]of Petroships. I find it impossible to believe that a solicitor would take instructions from Tony Chan in connection with three actions commenced over a period of two years on behalf of Petroships unless Petroships, at the very least implicitly, held Tony Chan out as authorised to instruct the solicitor on its behalf. I also find it impossible to believe that Tony Chan, a person who had no business connection whatsoever with Petroships, would take it entirely upon himself as a meddler to instruct solicitors on Petroships’ behalf in three actions over a period of two years. I am driven to the conclusion that Alan Chan – the 90% owner of Petroships, one of its two directors[note: 75]and the father of Tony Chan – clothed Tony Chan with ostensible authority to instruct CTF on behalf of Petroships in connection with the CTF actions. 111    There is another point which shows that the CTF actions are attributable to Petroships. After the second and third actions had been struck out with costs, the costs remained unpaid. R&T wrote to Braddell Brothers LLP as Petroships’ solicitors to demand that Petroships pay those costs. Braddell Brothers LLP’s response was: “You would be aware that Messrs Chung Ting Fai & Co. has always been the solicitors acting for our client in respect of” the second and third actions.[note: 76]Alan Chan in cross-examination did not squarely deny having instructed Braddell Brothers LLP to write this letter. His response was an ambiguous “I don’t know. I don’t remember.”[note: 77]For reasons I will come to, I was not at all impressed with Alan Chan’s credibility. I find that he did instruct Braddell Brothers LLP to send this letter confirming that CTF did indeed act for Petroships in the second and third action. 112    Petroships relies on the fact that it sued CTF in 2012 for the loss and damage caused by CTF commencing the CTF actions, allegedly without authority. It is true that that action was brought and was settled with CTF paying compensation to Petroships. However, without evidence from CTF setting out the reason for the settlement, I am not able to draw any inference from this evidence which assists Petroships and which can outweigh the inferences I have drawn against Petroships for the reasons set out above. The four actions are capable of sustaining inferences 113    Petroships argues also that I should not draw any inferences from the fact that it brought four actions and failed in all of them because each of the actions was struck out without a consideration of the merits. That is not to the point. I rely on the four actions to draw the inference that Petroships is seeking to bring the derivative action for a collateral purpose unrelated to doing justice to Wealthplus and unrelated to righting a wrong which Wealthplus has suffered. I do not rely on the four actions for any finding of abuse of process, issue estoppel orres judicatain relation to the derivative action. It is sufficient to find, as I have found, that the four actions are attributable to Petroships. The reasonable inferences to be drawn from Petroships’ four actions coupled with Alan Chan’s own testimony about the purpose of those actions more than suffices for my finding that Petroships lacks good faith in seeking leave to bring the derivative action.",
        "Petroships’ unreasonable delay": "114    The second ground that the respondents rely on to submit that Petroships is not acting in good faith is Petroships’ unreasonable delay in commencing these proceedings. 115    The delay between Petroships discovering the four transactions which form the subject-matter of the derivative action and initiating the procedure under s 216A is significant in assessing Petroships’ good faith, but not simply because it is delay or because it is unreasonably long delay. Its significance lies in the underlyingreasonfor the delay. The delay arose because, on each occasion when it had a choice, Petroships chose to pursue a remedy for alleged wrongs which it claimed to have suffereditself, until June 2012. 116    I have already explained at [93]–[113] above, and need not repeat, the basis on which I have found that Petroships’ purpose in seeking to bring the derivative action is to use it as an extension of its four failed attempts to extract through Wealthplus a remedy forPetroshipsfor wrongs allegedly done toPetroshipsby KBGL and its related companies and not to seek a remedy for Wealthplus for wrongs allegedly done to Wealthplus.",
        "Alan Chan's lack of honesty": "117    The third ground that KBGL relies on is that Alan Chan has displayed a lack of honesty in this application and that that lack of honesty is attributable to Petroships and shows that it is not acting in good faith. I accept this submission. I found Alan Chan to be an evasive and untruthful witness. The most egregious example was his attempt to deny knowledge of the second action. I now detail that attempt. 118    In his affidavit filed in the fourth action to resist KBGL’s application to strike it out, Alan Chan’s evidence about the CTF actions was as follows:[note: 78] 13.    Sometime in 2009, I appointed Messrs Chun Ting Fai & Co (“CTF”) as [Petroships’] lawyers to seek repayment of the shareholder loan that [Petroships] had extended to Wealthplus. My instructions to CTF was to seek repayment of the shareholder loan on the basis that it was repayable on demand (as clearly stated in the financial statements of Wealthplus). I trusted CTF to do the necessary. 14.    Thereafter, I did not receive any updates from CTF on the matter for some time until one day I was told that the claim was dismissed because CTF had commenced the action against the wrong party. 15.    Therefore, it was a complete surprise to learn from [KBGL’s] Affidavit that not only had CTF commenced 3 separate actions in the Plaintiff’s name, but one of the actions actually touched on the [1998 joint venture agreement] on which I had not given any instructions to CTF. 119    Alan Chan’s evidence that it was a “complete surprise” to learn CTF commenced three separate actions in Petroships’ name is a lie, at the very least in respect of the first and the second actions. I have summarised Alan Chan’s evidence about the first action at [103] above. 120    As for the second action, Alan Chan affirmed a discovery affidavit,iean affidavit verifying a list of documents, which CTF filed on behalf of Petroships in that very action.[note: 79]He was therefore, contrary to his assertion, very much aware of it. 121    Alan Chan attempts to explain in his affidavits and in cross-examination how he came to affirm this discovery affidavit. His explanations are disingenuous and serve only to compound his lie. His earliest explanation of how he came to affirm this discovery affidavit is found in his affidavit filed in the fourth action on 21 March 2012. He acknowledges there that he signed the discovery affidavit in the second action but asserts that he thought it was to be filed in thefirstaction. Alan Chan’s exact words are as follows:[note: 80] When I was asked to sign the [discovery affidavit], I was under the impression that this affidavit was for the purpose of the action for the Shareholder Loan Claim. I was not aware at the time of signing this affidavit, of the pleadings in [the second action]. I was only told by CTF that I needed to sign this affidavit for the proceedings to recover the shareholder loan and I did so according to CTF’s advice. I am not a lawyer and relied on CTF to advise me on the necessary court procedures. The reference to the “Shareholder Loan Claim” is, in effect, a reference to the first action. That is the only action that Alan Chan accepts he gave CTF instructions to commence, although his evidence is that his instructions were to commence action against KBGL and not against Megacity. 122    The same explanation is repeated twice more: by Alan Chan in his affidavit filed on 7 May 2012[note: 81]and by Petroships’ counsel at the hearing of the appeal against the striking out order on 10 May 2012.[note: 82]Alan Chan’s explanation that he believed the discovery affidavit was for an action to recover the $1.1m loan, rather than for the second action, is in itself somewhat puzzling. The relief sought in the second action, it will be recalled, included an order that Megacity procure Wealthplus to repay the $1.1m loan; alternatively an order that Wealthplus be wound up and ordered to repay the $1.1m loan.[note: 83] 123    Be that as it may, Alan Chan gave a completely different explanation of how he came to sign the discovery affidavit in his cross-examination before me. He at first denied having signed a discovery affidavit in the second action at all. He said that he had instead signed a “routine document”, the signature page of which was later appended to the discovery affidavit. To give a full appreciation of Alan Chan’s incredible evidence, I have found it necessary to set out an unfortunately lengthy extract from the transcript at [126] below. 124    To set the context for the extract, counsel for the respondents has just referred Alan Chan to a copy of the discovery affidavit at page 400 to 402 of the respondents’ core bundle. Page 400 is thepro formacover page setting out the title of the action, identifying the document as an “Affidavit Verifying List of Documents” and stating the name of the firm filing the document. Page 401 is the first page of the body of the affidavit containing again the title of the action, Alan Chan’s name as the deponent together with his personal particulars and paragraphs 1 to 4 of apro formadiscovery affidavit. Page 402 is the final page of the affidavit. It contains the last two paragraphs of apro formadiscovery affidavit together with thejurat, the signature of the deponent and the signature and seal of the commissioner for oaths. Page 402 gives no indication who the parties to the action are. The title of the action which appears on both pages 400 and 401, on the other hand, show clearly that the defendants are Wealthplus and Megacity. This is a significant point. The distinction between the first action and the second action lies in the identity of the defendants. Megacity was the only defendant in the first action. Both Megacity and Wealthplus were defendants to the second action. Alan Chan shows, in the extract at [126], his determination to deny any knowledge of the parties to the action in which he affirmed his discovery affidavit. 125    In the extract at [126] below, Alan Chan confirms two things unequivocally. First, he confirms that the signature opposite thejuraton the last page of the discovery affidavit is his. Second, he confirms that when he put his signature on that page, it was attached to “something routine”, and definitelynotto a discovery affidavit. That contradicts directly his evidence, set out at [121] above: that he had indeed signed a discovery affidavit, but believed it was for the first action. 126    I now set out the extract from Alan Chan’s cross-examination:[note: 84] QOkay. Now I want you to look at the core bundle, page 400, which---this is a document that you filed in [the second action], okay, Mr Chan? Now look at page 401 and 402, yes; is this your signature?AOn?QPage 402, is that your signature?ALooks like it.QDid you sign this document?AThese documents?QThis document, did you si---ANo, I only signed that page, only that page because I would not have agreed to sue Wealthplus and Megacity. I never knew that. So I only signed that page.Court:No, Mr Chan, are you saying ... that you [were] presented only a single page and that’s what you signed or are you saying out of this document, you signed on only one page?Witness:... Your Honour, of course, this one, something attached to this. ... It---this page ... this is the signed page.Court:Page 402.Witness:Of course, I---I won’t have, er, put my signature on a page just like this. ... There are some other things. ... Something routine which I don’t remember what.Court:Okay.Witness:I will never have agreed to these names, never. So I only can acknowledge this one, er---the---this page not the previous pages.Court:So Mr Chan, you are saying that you [were] given a document which you said was something routine ... and you signed on what we see at page 402, right?Witness:Mm-hm.Court:But the document is not the document we now see starting at page 401?Witness:No, no.Court:That’s what you’re saying or you’re not saying that?Witness:Yah, not---not---not these, not these.Court:All right. So that ... means somebody took your signature page from another document and added it to the doc---Witness:Could---po---possible, yah....Court:Mr Chan, I haven’t finished. You’re suggesting that somebody took your signature page from the routine document and then added it to this affidavit verifying a list of documents that appears at page 401; is that what you’re suggesting?Witness:It is, er, the most probable outcome.Court:I see....QWhen---your signature appearing at 402, okay, you’re saying that you did not sign this affidavit verifying the list of documents; is that what you’re saying?ANo, no, I come---QYou’re saying that you signed some other routine document ... and that signature was then affixed to page 402. ... Is that what you are saying?AYah, not accompanied by these two pages.Court:No, I think, Mr Chan, do you recognise page 402 as ... a page that you signed?Witness:Mm-hm.Court:It’s---do you recognise page 402?Witness:It looks like my signature.Court:No, do you recognise the page? ... The other contents, paragraphs 5 and 6, the Jurat, do you remember appearing before the Commissioner for Oaths ... on or about the 1st of June 2010?Witness:Yah.Court:Do you remember all that?Witness:Not clearly.Court:No?Witness:Because it’s---it’s routine so I didn’t pay much attention to it.Court:No, you see, Mr Chan, there are various possibilities, right? ... You could have signed this entire document ... starting at page 401, right? ... You could have ... [signed] page 402 attached to a routine document; and then page ... 402 was attached to this affidavit verifying list. The signature could be a forgery. The signature could have been cut and pasted into another document, ... the document we now see at page 401.Witness:Mm-hm.Court:So I’m trying to work out what it is you are telling me ... actually occurred and the only way we can work that out is by finding out what you signed.Witness:Well, the best thing I can---er, I can, er, work out is I signed this page; it’s a routine, you know, matters; and I did not see these two pages at all.Court:You did not see them or they were not part of the document you signed?Witness:Er, it was not part of the document I signed.Court:I see.QI see. So you signed this sheet of paper but the other two sheets were not there?ANo, no, not---no.Court:But some other sheets were there?QSome other sheets were there?...AYah, possibly.QBut you don’t know what other sheets were?ABecause, er, they looked very routine; unimportant to me.QI see.AMm-hm.QBut they were---but they were certainly not---ANo.Q---page 401 and 400?ANo, no.QDefinitely not?ADefinitely not.   127    Alan Chan was then confronted with his earlier explanation that he had indeed signed the discovery affidavit but had mistakenly believed it was for the first action. He immediately resiled from the second of the two points I set out at [125] above. He asserted instead that the “something routine” he had referred to earlier was in fact the “same thing” as the discovery affidavit:[note: 85] Court:Mr Chan, what Mr Chandra Mohan is saying is: About 10 minutes ago, when you said that you signed---when you said you put your signature on page 402, a different document was attached to it.Witness:Mm-hm.Court:Now, he has pointed you to an affidavit you have sworn where you accepted that what you signed was an affidavit verifying a list of documents.Witness:Yah, this---er, it could---er, it could refer to the same thing, er, list of documents and what I meant by something else. Er, I did not remember exactly what it was.Court:Well, we’ll leave it---Witness:Cou---Court:---for submissions.Witness:I---I’m talking about the same thing. S---these---these documents to my mind at that time was just a routine documents, routine papers.   128    I am thoroughly unimpressed by Alan Chan’s disingenuous evidence. That, coupled with my other findings, undermines fatally Petroships’ assertion that it is acting in good faith.",
        "Alan Chan was a director of Wealthplus from 1998 to 2009": "129    The fourth ground that KBGL relies on to submit that Petroships is not acting in good faith is that Alan Chan was a director of Wealthplus at the time of the bulk of the very transactions which he now alleges were wrongs against Wealthplus and which he wants to pursue in the derivative action on behalf of Wealthplus. 130    As I have mentioned, Alan Chan was a director of Wealthplus from July 1998 up until September 2009, when he tendered his resignation. As a director, he approved Wealthplus’ accounts up to the 2007 accounts. 131    The first claim Petroships wishes to pursue in the derivative action is a claim to recover the transfers between 2003 and 2009 to group companies of sums totalling $14.95m. This amount is the total reflected in Wealthplus’ 2009 accounts as receivables due to Wealthplus from KBGL, KBCE, Megacity, other related companies and third parties as at 31 December 2009. I leave aside for the moment the fact that these “transfers” are in fact receivables (iedebts due to Wealthplus and therefore assets of Wealthplus) rather than outright transfers of money from Wealthplus without any obligation to repay them.  I leave aside also that there is absolutely no evidence that these assets are irrecoverable and that there is, on the contrary, evidence that they have been in large part recovered. 132    The sum of $14.95m is the figure reflected in Wealthplus’ accounts as at 31 December 2009, and therefore must arise from events before 31 December 2009.[note: 86]Further, Petroships’ own computation of these “transfers” shows that their total value at the end of 2008, Alan Chan’s last full year as a director, stood at $18.65m, or $3.7mmorethan their value at the end of 2009.[note: 87]An analysis of the figures for 2009 shows that the absolute outflow of funds in that year was only about $474,000. Even if it is assumed that all of that outflow took placeafterAlan Chan resigned as a director in September 2009, that still means that 96.8% of the $14.95m that Petroships seeks leave to recover for Wealthplus was transferred while Alan Chan was a director of Wealthplus. 133    The second claim in the derivative action relates to a write-off of $135,005. This is reflected in Wealthplus’ 2008 accounts as “[b]ad debts written off”. This means that the write-off took place on or before 31 December 2008,[note: 88]while Alan Chan was still a director of Wealthplus. 134    The third claim is payment of director’s fees amounting to $559,631. This figure is the sum of $439,631 and $120,000 accounted for in Wealthplus’ 2008 and 2009 accounts respectively as “Directors’ remuneration”. The bulk of these director’s fees were paid in 2008, while Alan Chan was still a director.[note: 89] 135    The fourth claim is a provision for impairment of $651,658. This is reflected in Wealthplus’ 2009 accounts as an allowance for the impairment of non-trade receivables due from third parties,[note: 90]and is in fact accounted for in the first claim.[note: 91] 136    Alan Chan was a director of Wealthplus when the bulk of these alleged wrongs were done to Wealthplus. He knew about some of these alleged wrongs while he was still a director. If these alleged wrongs are indeed wrongs, it is curious that he waited to do anything about them until he had resigned as a director. The inference, once again, is that these allegations are made and pursued now through an application under s 216A for Petroships’ own purposes and not to right wrongs done to Wealthplus. 137    It is also significant that Petroships seeks leave to bring a derivative action against Koh Teak Huat and Koh Keng Siang but not against Alan Chan. From 1998 until he resigned in 2009, Alan Chan owed the same directors’ duties to Wealthplus as Koh Teak Huat and Koh Keng Siang did. In cross-examination, Alan Chan tried to downplay his role by asserting that he merely “assisted as a director ... just in name, not in fact”[note: 92]and describing himself as a “sleeping” director.[note: 93]He said further: “I left things to the other directors. I ... wasn’t really functioning as a director. I just sat on the board in good faith”.[note: 94]None of that detracts from Alan Chan’s duties as a director. If Petroships’ position is (as it must be) that Wealthplus has a legitimate and arguable claim against Koh Teak Huat and Koh Keng Siang arising from these four transactions for breach of their directors’ duties owed to Wealthplus, then it is equally legitimate and arguable that Wealthplus has a claim also against Alan Chan for breach of his directors’ duties, at the very least arising from his abdication of those duties in connection with these four transactions. 138    The fact that Petroships does not propose to sue Alan Chan for breach of his directors’ duties is yet further evidence that Petroships’ purpose in seeking leave to bring the derivative action has to do with Petroships’ own purposes, collateral to and unrelated to doing justice to Wealthplus by righting wrongs done to it. 139    InBarrett v Duckett & Others[1995] BCC 362, all three of a company’s directors were implicated in a wrongful diversion of the company’s moneys. A shareholder brought a common law derivative action to recover compensation for the diversion, but sued only two of the company’s directors. The director whom the plaintiff declined to sue was her own daughter. The two directors which the plaintiff did sue were the plaintiff's former son-in-law and his new wife. The former son-in-law brought in the daughter as a third party to the derivative action. The plaintiff then joined the daughter as a defendant. But she did not serve the order for joinder on her daughter or amend her pleadings to make any claim against her daughter. 140    The English Court of Appeal held that the plaintiff’s failure to name her daughter as a defendant and to proceed against her daughter in the same way as she had against the other two directors was evidence from which an ulterior purpose could be inferred. That ulterior purpose was sufficient in itself to make the plaintiff an inappropriate person to bring the common law derivative action, even though the derivative action clearly had merit. The derivative action was therefore struck out. Peter Gibson LJ said (at 372) that the plaintiff’s reluctance to proceed against her daughter showed that “personal rather than financial considerations would appear to be impelling [the plaintiff] to pursue this action”. He added (at 372): I can well understand that [the plaintiff] is upset at what has occurred between [her former son-in-law] and [her daughter] and that she is indignant at the supplanting of [her daughter] by [the second wife]. But her partiality shows through all her evidence, and it is by her behaviour in relation to the claims against [her daughter], in contrast to the claims against [the other two directors], that I have become convinced that [the plaintiff] is not pursuing the actionbona fideon behalf of the company. If she had been, she would have had to sue [her daughter] no less than her [former son-in-law] in respect of diverted moneys. ... [The plaintiff’s counsel] sought to assure us that now that the decision had been made to sue [the daughter], the action would proceed against her. I am afraid that I simply do not believe that [the plaintiff] would pursue any claim against her daughter to the point of enforcing judgment.... Her failure to take the order making [the daughter] a defendant any further speaks volumes. On the other hand, I do not doubt that she would pursue the other defendants as far as she could, regardless of whether there is any real likelihood of recovery. That is not a satisfactory basis for an action on behalf of the company. 141    So too, it appears to me that Petroships is impelled in this case by personal rather than financial considerations. If that were not the case, Petroships would be seeking leave to bring a derivative action against Alan Chan with as much vigour as it seeks to bring a derivative action against Koh Teak Huat and Koh Keng Siang.",
        "Petroships does not have an honest belief": "142Ang Thiam Sweeaccepted the twoSwanssonfactors as interrelated but non-exhaustive factors which underlie the test of good faith in s 216A(3)(b) (see [82(a)] above). I have thus far considered the secondSwanssonfactor. I now turn to consider the firstSwanssonfactor. Petroships argues under this head that it honestly believes that Wealthplus has a good cause of action to recover monies pursuant to the derivative action and that doing so will increase Wealthplus’ assets such that all of its shareholders will benefit.[note: 95]It argues further that it is not abusing the process of the court because it intends to prosecute the derivative action to a conclusion. 143    The twoSwanssonfactors overlap. As Palmer J said inSwansson(at [37]): These two factors will, in most cases but not all, substantially overlap: if the court is not satisfied that the applicant actually holds the requisite belief, that fact alone would be sufficient to lead to the conclusion that the application must be made for a collateral purpose, so as to be an abuse of process. The applicant may, however, believe that the company has a good cause of action with a reasonable prospect of success but nevertheless may be intent on bringing the derivative action, not to prosecute it to a conclusion, but to use it as a means for obtaining some advantage for which the action is not designed or for some collateral advantage beyond what the law offers. If that is shown, the application and the derivative suit itself would be an abuse of the court’s process. ... 144    I would respectfully adopt the approach set out in this passage with one caveat. This passage is merely illustrative of how the two factors can overlap. It is not intended to be descriptive or prescriptive. This caveat is especially important in respect of the second half of the passage. That sets out merely one example in which an applicant who honestly believes that the company has a good cause of action with reasonable prospects of success may nevertheless be found to be engaged in an abuse of the process. That must be so. An applicant can lack an honest belief that the company has a good cause of action for any number of reasons. Palmer J does not intend here to say that an applicant will lack an honest beliefonly ifits application or the derivative action that it contemplates would be an abuse of the process of the court. Still less does he intend to say that it is only the specifictypeof abuse of process identified in this passage – an intention not to prosecute the derivative action to a conclusion – which could lead to that finding. It is therefore not to the point for Petroships to assert, as it does in its submissions on this point, that its derivative action is not an abuse of the process of the court because it intends fully to prosecute the derivative action to a conclusion. 145    For the reasons I have given above related to the history of the four failed actions, Alan Chan’s evidence of Petroships’ purpose in those four actions and my findings on Alan Chan’s honesty, I cannot come to any conclusion other than the conclusion that Petroships fails on the firstSwanssonfactor also. Even if it has a belief that it has a good cause of action with realistic prospects of success, that is not an honest belief.",
        "Multiple purposes": "146    It is true that enlarging the assets of Wealthplus, thereby benefiting Wealthplus, is at least part of Petroships’ purpose. Is that legitimate purpose sufficient to counteract the collateral purpose I have found? Where a minority shareholder pursuing a derivative action has multiple purposes in doing so, it will be acting in good faith if its dominant purpose is to benefit the company:Iesini v Westrip Holdings Ltd[2010] BCC 420 at [121]. In that case, Lewison J applied the dictum of Bridge LJ (as he then was) inGoldsmith v Sperrings Ltd and others[1977] 1 WLR 478 to arrive at the following conclusion: In my judgment if the claimant brings a derivative claim for the benefit of the company, he will not be disqualified from doing so if there are other benefits which he will derive from the claim. InNurcombeLawton LJ contrasted an action for the benefit of the company on the one hand, and an action brought for some other purpose on the other. Likewise inBarrettPeter Gibson LJ drew the same contrast. Neither of them was considering a case in which a claim was brought partly for the benefit of the company, but partly for other reasons as well. In my judgment in such a case the considerations discussed by Bridge LJ inGoldsmithcome into play. In the present case it seems to me that Mr Iesini was entitled to form the view that unless the derivative claim was brought, Westrip would be left with no assets at all. Thus in my judgment the dominant purpose of the action was to benefit Westrip. It cannot, in my judgment, be said that but for the collateral purpose, the claim would not have been brought at all. The claim is, in my judgment, brought in good faith. 147    From my assessment of Alan Chan and of his evidence, I find that the collateral purpose which I have found Petroships to have is its dominant purpose in seeking leave to bring the derivative action. In other words, I find that it would not have brought this application but for its collateral purpose. Indeed, I find that Petroships’ collateral purpose is so strong that it would lead Petroships to believe and to assert thatanycause of action it could construct against KBGL and its related companies on behalf of Wealthplus is a good cause of action, no matter how contrived that cause of action might be. 148    Alan Chan’s evidence in cross-examination is clear: his intention is to target KBGL as the “headquarters”. After three failed actions, that is precisely what Petroships did in its fourth action. The contrived nature of each of the four actions against various combinations of defendants, and the fact that they all suffered the same fate of being struck out, supports my view that this application would not be brought but for Petroships’ collateral purpose. Given my finding as to Petroships’ state of mind, if the cause of action which Petroships now seeks to advance through Wealthplus in this derivative action is indeed a good cause of action with realistic prospects of success (as I am prepared to assume it is), that is merely a coincidence. I decline to infer from that that Petroships has an honest belief in that cause of action. 149    Considering both of theSwanssonfactors, and considering the evidence as a whole, I find that Petroships has failed to discharge its legal burden of proof under s 216A(3)(b). For all of the reasons I have set out above, it has failed to satisfy me on the balance of probabilities that it is acting in good faith.",
        "Good faith is essential": "172    Good faith is essential because the drafting of s 216A(3) dictates that it is. An applicant must satisfy each of the three independent tests set out in s 216A(3) in order to enliven the court’s discretion to grant leave to bring a derivative action. A failure to satisfy any one of the three tests means that the entire application fails. 173    The policy underlying the requirement of good faith makes clear why establishing good faith is essential for an application to succeed. The power to commence and conduct litigation in the name of a company is a power vested in the company’s directors. The directors abuse that power if they exercise it to advance their own private aims and interests rather than the interests of the company as a whole. An applicant under s 216A seeks to substitute its views as to the proper exercise of that power for the directors’ views. An applicant who seeks to exercise that power to advance his own private aims and interests cannot be in a better position than a director who acts for the same improper purpose. Simply put, an applicant who fails to establish that it is acting in good faith fails to establish that it is in any better position to exercise the power to commence and conduct litigation than the company’s directors, and by extension, than the company’s majority shareholders. In that situation, there is simply no reason to displace company law’s default principle of majority rule with respect to pursuing the company’s right of action, however meritorious that right of action might be.",
        "Prima faciein the interests of Wealthplus?": "152    The question at this stage of the inquiry is whether it appears to beprima faciein the interests of Wealthplus for Petroships to bring the derivative action. The threshold test on this stage is directed towards the merits of the derivative action. The applicant must satisfy the court that the derivative action is legitimate and arguable:Ang Thiam Sweeat [53] to [55]. The threshold test deliberately sets a low standard, precisely because it is only athresholdtest. It operates to weed out “only the most obviously unmeritorious claims” (Ang Thiam Sweeat [55]). But the statutory test under s 216A(3)(c) serves a broader purpose than just protecting the company from being compelled to pursue an obviously unmeritorious claim. The statutory test requires the court to consider the overall interests of the company in the round. This is one of the shortcomings of Petroships’ submissions: it assumes that passing the threshold test is sufficient to satisfy the entirety of the test under s 216A(3)(c).[note: 96]That is not the correct approach. 153    In addition to the threshold test on the merits, the test under s 216A(3)(c) comprises a consideration of whether the derivative action is in the practical and commercial interests of the company and of the alternative remedies available to the applicant:Ang Thiam Sweeat [56]. This is a multifactorial inquiry. In order to satisfy the court that the derivative action is in the practical and commercial interests of the company, Palmer J held inSwanssonthat the applicant ought to put evidence on at least the following factors before the court: 57    First, there should be evidence as to the character of the company: different considerations may well apply depending on whether the company is a small, private company whose few shareholders are the members of a family or whether it is a large public listed company. If the company is a closely held family company, it may be relevant to take into account the effect of the proposed litigation on the purpose for which the company was established and on the family members who are the shareholders. If the company is a public listed company, such considerations will be irrelevant. Again, the company may be a joint venture company in which the venturers are deadlocked so that the proposed derivative action is seen as being for the purpose of vindicating one side’s position rather than the other’s in a way which will not achieve a useful result: see e.g.Talisman Technologies Inc v Queensland Electronic Switching Pty Ltd[2001] QSC 324. 58    Second, there should be evidence of the business, if any, of the company so that the effects of the proposed litigation on its proper conduct may be appreciated. 59    Third, there should be evidence enabling the Court to form a conclusion whether the substance of the redress which the applicant seeks to achieve is available by a means which does not require the company to be brought into litigation against its will. So, for example, if the applicant can achieve the desired result in proceedings in his or her own name it is not in the best interests of the company to be involved in litigation at all. This was the case inTalisman Technologiesin which it appeared from the evidence that the most desirable outcome for the applicant was to obtain an order for specific performance of a contract, which it could do in a suit in which the company did not need to be a party. 60    Fourth, there should be evidence as to the ability of the defendant to meet at least a substantial part of any judgment in favour of the company in the proposed derivative action so that the Court may ascertain whether the action would be of any practical benefit to the company. 154    Petroships’ insurmountable difficulty at this stage of the inquiry is not with the threshold test but with the broader test under s 216A(3)(c). I therefore assume in Petroships’ favour that it has satisfied the threshold test and that its derivative action amounts to a legitimate and arguable claim. I nevertheless find that Petroships has failed to satisfy me on the balance of probabilities that it appearsprima facieto be in the interests of Wealthplus to permit Petroships to bring any one of these four claims by way of a derivative action. I arrive at this conclusion because of the point made by Palmer J inSwanssonin the passage cited above at [59] and inPang Yong Hockat [22]. I consider that “the redress which the applicant seeks to achieve is available by a means which does not require the company to be brought into litigation against its will”. The substance of the redress which Petroships seeks is for Wealthplus to take a decision on whether to pursue the derivative action which is untainted by the majority shareholders’ self-interest or improper purposes. That redress is now available through the liquidators of Wealthplus.",
        "The interaction between s 216A and liquidation": "155    When a company goes into liquidation, control of the company passes from its shareholders and its directors to a liquidator. That is the case whether the liquidation is a solvent liquidation or an insolvent liquidation. Furthermore, the liquidator takes control of the company for specific purposes. The principal purposes are for getting in, realising and distributing the company’s assets in accordance with law. 156    Wealthplus is in member’s voluntary liquidation. This is a form of liquidation available only to solvent companies. In a members’ voluntary liquidation, the commencement of liquidation has certain consequences under the Act. First, under s 294(2), all of the directors’ powers cease except insofar as the liquidator approves. Second, under s 300, the liquidator is obliged to apply the property of the companypari passuin satisfaction of its liabilities, with the surplus (the company being solvent) being distributed to shareholders in accordance with their shareholding. Finally, and most importantly for present purposes, under s 305(1)(b) read with s 272(2)(a), it is the liquidator – and not the directors or the shareholders – who is empowered to bring or defend legal proceedings in the name of the company. The liquidator is entitled to exercise this power unilaterally,withoutthe approval of the shareholders in general meeting (compare s 305(1)(b) with s 305(1)(a)). 157    Once a company is put into liquidation, therefore, the underlying rationale for a derivative action largely disappears. Control of the company is removed from the self-interested majority and vested in a disinterested liquidator. The liquidator has a legal obligation to discharge his duties and to exercise his powers competently and impartially, without fear or favour. At the core of the liquidator’s duties is the duty to get in, realise and distribute the company’s assets (see s 294(1) and s 300). Associated with that duty is the liquidator’s power to bring or defend legal proceedings in the company’s name. Even though a voluntary liquidation is not initiated by the court, the liquidator in a voluntary liquidation has access to the court for guidance and is subject to the court’s supervision and control. The liquidator, any creditor and any shareholder all have the right to apply to the court under s 310 to have it determine any question arising in the course of the liquidation or to invite it to exercise any of the powers it would have in a compulsory liquidation. 158    At common law, this statutory change of control is a weighty factor in considering whether to permit a derivative action to proceed. InFargro Ltd v Godfroy and others[1986] 1 WLR 1134 (“Fargro”), a minority shareholder commenced a derivative action after the company had gone into liquidation. Walton J observed (at 1136): … But once the company goes into liquidation the situation is completely changed, because one no longer has a board, or indeed a shareholders’ meeting, which is in any sense in control of the activities of the company of any description, let alone its litigation. Here what has happened is that the liquidator is now the person in whom that right is vested. 159    Petroships submits that, despite Wealthplus’ liquidation, the situation in this case is no different from one “where the company is not in liquidation and its board of directors have refused to take action”.[note: 97]Petroships gives two main reasons for this submission. First, Wealthplus’ liquidators have considered and declined to bring an action in Wealthplus’ name with respect to the subject-matter of Petroships’ derivative action. Thus, Petroships argues, its derivative action is necessary because, if Petroships is not allowed to bring action to vindicate Wealthplus’ rights, nobody else will. Petroships concedes that the situation would be different if the liquidators were prepared to pursue, or at the very least investigate, Petroships’ allegations. That was the situation inFargro. That was also the situation in this case, until Wealthplus’ original liquidators resigned. 160    Second, Petroships submits that even though the majority shareholders no longer exercise direct control of Wealthplus, they exercise indirect control over it through their power in a members’ voluntary liquidation to remove the liquidators and appoint new liquidators in their place under s 294(3). Thus, Petroships suggests, the liquidators now in office know that if they indicate an intention to investigate Petroships’ allegations or to commence action to pursue those allegations, the majority shareholders of Wealthplus will present the liquidators with the choice of either resigning or being removed and replaced. Petroships points out that the majority shareholders have already done this once (see [54]–[57] above) and there is every reason to believe that they will do it again. 161    I do not accept this submission for two reasons. First, Petroships has put before me absolutely no grounds on which to impugn the liquidators’ decision not to cause Wealthplus to pursue the subject-matter of the derivative action. On this point, Petroships bears the burden in every sense. I take as my starting point the principle that “[a] liquidator is not obliged to prosecute or facilitate the prosecution of any claim unless he believes that the claim has a reasonable chance of succeeding or that it will serve some useful purpose”:Walter Woon on Company Law(Tan Cheng Han gen ed) (Sweet & Maxwell, Rev 3rd Ed, 2009) at p 757, para 17.148. It is true that these liquidators have decided not to commence action in Wealthplus’ name to pursue Petroships’ allegations. But Petroships has presented me no basis to believe that the liquidators have arrived at that decision as a result of omitting relevant considerations or of taking irrelevant considerations into account. 162    Second, there are safeguards in the Act and at common law to address Petroships’ concerns. If Petroships has a basis on which to allege that the liquidators have wrongly or wrongfully declined to commence action to pursue Petroships’ allegations, it has three options. First, if Petroships alleges that the liquidators’ conduct is so egregious as to warrant their removal, it can apply to court under s 302 to remove the liquidators and to replace them with its own nominees. Second, if it is of the view that the liquidators have erred in their decision but without warranting removal, it can apply to court under s 315 as a person aggrieved to have the liquidator’s decision reversed and for a direction that the liquidator commence action. Third, it can in any event invite the court to exercise its common law power to order the liquidators to allow Petroships, as a contributory and therefore a party to the liquidation, to bring proceedings in the name of the company against suitable indemnities. 163    InFargro(at 1136), Walton J traced the source of this common law power back to the 19th century: ...[T]he plaintiff can take a variety of courses. The plaintiff can ask the liquidator to bring the action in the name of the company. Doubtless, as in virtually all cases, the liquidator will require an indemnity from the persons who wish to set the company in motion against all the costs, including, of course, the costs of the defendant, which he may have to incur in bringing that action. The liquidator may ask for unreasonable terms or, on the other hand, the liquidator may be unwilling to bring the action, and under those circumstances it is always possible for the shareholders who wish the action to be brought to go to the court asking for an order either that the liquidator bring the action in the name of the company or, more usually, that they are given the right to bring the action in the name of the company, of course, against the usual type of indemnity, which will, if there is any difficulty about the matter, be settled by the court. And I think that this has been the practice and procedure for a very long time indeed. It is certainly referred to by Cotton L.J. inCape Breton Co. v. Fenn(1881) 17 Ch.D. 198, 208, where he said: \"There is nothing in the Act of Parliament which gives the court such power\" that is, power to authorise somebody other than a shareholder or creditor of the company, to bring proceedings in the name of a company \"andprima facieproceedings in the name of the company ought to be conducted by the liquidator,\" - in this case, of course, it was a compulsory liquidation - \"an officer appointed by the court and subject to the supervision of the court. There may be, no doubt, special cases where, although the court does not think fit to remove the liquidator on the ground that his conduct in not bringing an action is improper, it may give power to other persons to conduct the litigation upon their giving proper indemnity against any consequences of that litigation. But who are the persons who can be authorised to take these steps? In my opinion the creditors and the contributories only, not under any special clause of the Act, but because they are the persons who, under the terms of the Act, can intervene if they are advised that the liquidator does not properly do his duty. They have a right in special cases to ask the court for leave to do that which the liquidator is advised not to do, or which,\" - and in practical terms this is usually the reason - \"because he has no funds, he does not do, viz., take proceedings in the name of the company, but in my opinion the power of the court to give leave to use the name of the company stops there, and is confined to those who are parties to the liquidation.\" 164    Alternatively, if the liquidators indicate an intention to pursue Petroships’ allegations through litigation but the majority shareholders convene a general meeting of members under s 294(3) in order to remove liquidators, Petroships again has three options. First, it can agree to fund the liquidators’ application to court under s 294(3) for an order that they not be removed. Indeed, Petroships could have used just such an approach to prevent the original liquidators from being removed. Second, it can itself pose a question for the court to determine on an application under s 310(1) to prevent the removal. Finally, it can apply to the court to exercise its common law power adverted to inFargroallow Petroships to bring proceedings in the name of the company against suitable indemnities. 165    The situation in this case is analogous to the situation inAng Thiam Swee. In that case, one minority shareholder wished to bring a derivative action against another minority shareholder. The majority shareholder, who held 80% of the company’s shares, was a bankrupt. As a result, his shares had vested in the Official Assignee. InAng Thiam Swee, therefore, the power to litigate in the company’s name was in the control of a disinterested outsider. That is the position in this case also. The Court of Appeal inAng Thiam Sweefound it very telling that the applicant was unable to secure the support of the Official Assignee for the derivative action (at [46]), leaving the court with no positive affirmation on behalf of the disinterested majority that the company viewed the derivative action as worthwhile (at [57]). In the absence of any reason to doubt the competence orbona fidesof the liquidators of Wealthplus in arriving at their decision not to pursue the derivative action, I too attach weight to their decision not to do so as one of the factors in my determination that the derivative action is notprima faciein the interests of Wealthplus. 166    It may be asked what is the difference between, on the one hand, Petroships seeking leave to bring a derivative action under s 216A; and, on the other hand, Petroships seeking to reverse the liquidators’ decision under s 315, seeking directions under s 310(1)(a) or inviting the court to exercise its common law power to permit Petroships to bring action in Wealthplus’ name. The difference is in the party who bears the costs of bringing the action. When leave is granted under s 216A, it is typically the company who bears the cost of the litigation. On either of the three alternatives I have mentioned, it is the person who wishes to override the liquidator’s decision who will have to bear the cost of pursuing the action, either directly by financing the litigation itself or indirectly by furnishing to the liquidators the usual required indemnities. This, too, is weighty factor to my mind. I bear in mind that Petroships is, by this application, seeking to commit the liquidation surplus – 90% of which belongs to the majority shareholders – to pursue an action which the liquidators see no reason to pursue. 167    For these reasons, I do not consider itprima faciein the interests of Wealthplus for the derivative action to be brought, even if the derivative action is assumed to be legitimate and arguable.",
        "What if the majority shareholders had an ulterior purpose?": "168    Does it make a difference if the majority shareholders put Wealthplus into members’ voluntary liquidation as a tactic to forestall Petroships’ s 216A application? The chronology suggests that that might well have been the majority shareholders’ motivation. The dates are as follows. The directors of Wealthplus foreshadowed an intention to put Wealthplus and its subsidiaries into liquidation at the AGM of Wealthplus in November 2011. But for almost eight months, they did nothing to follow up on that intention. They did nothing even after Petroships issued its notice under s 216A(3)(a) in June 2012. On 27 July 2012, the correspondence initiated by Petroships’ notice broke off.[note: 98]On 1 August 2012, Wealthplus’ directors convened an extraordinary general meeting to be held on 21 August 2012 to consider and, if thought fit, pass resolutions to put Wealthplus into members’ voluntary liquidation.[note: 99]On 14 August 2012, Petroships filed this application under s 216A. On 21 August 2012, the shareholders in extraordinary general meeting passed the resolution placing Wealthplus in voluntary winding up and appointing liquidators. It is certainly an available, though by no means inevitable, inference that the majority shareholders put Wealthplus in members’ voluntary liquidation to forestall or frustrate Petroships’ application under s 216A. I shall assume that to be true without necessarily making a finding to that effect. 169    Even on that assumption, however, it is my view that that does not make itprima faciein the interests of Wealthplus that the derivative action be brought. The majority shareholders’ ulterior motive in commencing liquidation cannot, by itself, carry through to taint the liquidators. Whatever the majority’s ulterior purpose may have been, the liquidators are bound to conduct the liquidation in accordance with law. There is no basis before me even to suggest that the liquidators have breached the duties of their office, whether by reason of incompetence, bias or fear.",
        "Good faith is essential; abuse of process is not": "170    The result I have arrived at is that Petroships’ application fails even though I have assumed that the derivative action is legitimate and arguable. My primary reason for holding against Petroships is because I have found that it is not acting in good faith. And I have found that it is not acting in good faith even though I have also found that the derivative action will not be an abuse of the process of the court. This outcome disregards entirely the merits of Petroships’ derivative action and finds it to lack good faith even though its derivative action is not an abuse of the process of the court. This might appear to be unfair to Petroships. It is not. It is, in fact, entirely consistent with policy, principle and precedent. 171    I consider first why good faith is essential and then why a finding of an abuse of process is not essential.",
        "Abuse of process is not essential": "174    There is likewise nothing anomalous about Petroships’ application failing even though I have found that its derivative action will not be an abuse of the process of the court. A finding that a derivative action will be an abuse of process under the procedural law will obviously take the derivative action outside the objective test in s 216A(3)(c). An adverse finding under s 216A(3)(c) is also likely to lead to an inference that the applicant is outside the subjective test in s 216A(3)(b). But a finding that the derivative action willnotbe an abuse of process is not and cannot be a sufficient condition to find that the applicant iswithins 216A(3)(b). 175    This may appear puzzling. An applicant whose derivative action is not an abuse of process is clearly outside the secondSwanssonfactor (see [82(a)(ii)] above). And that applicant can scarcely be argued not to have an honest belief in the derivative action under the firstSwanssonfactor (see [82(a)(i)] above). But the converse does not follow. It cannot be right in principle that a finding that a derivative action isnotan abuse of process is sufficient in itself to satisfy s 216A(3)(b). I say this for six reasons. 176    First, Palmer J made clear inSwanssonthat the two factors he identified in that case are non-exhaustive on the issue of good faith. It is therefore contrary to theSwanssonapproach – an approach which was approved and applied inAng Thiam Swee– to focus entirely on a single concept such as abuse of process as being entirely determinative of whether an applicant is acting in good faith under s 216A(3)(b). 177    Second, the policy underlying the doctrine of abuse of process in the procedural law is conceptually distinct from the policy underlying the statutory concept of good faith in s 216A(3)(b). The procedural concept of abuse of process is rooted in the policy of safeguarding the integrity of the court’s processes. The statutory concept of good faith in s 216A(3)(b) is rooted in the policy of ensuring that an applicant is in no better position than those entrusted by law with the power to commence or conduct litigation in a company’s name (see [173] above). Equating good faith under s 216A(3)(b) with abuse of process under the procedural law blurs this important conceptual distinction. 178    Third, the consequence of finding a litigant to be abusing the process of the court under the procedural law is very different from the consequence of finding that an applicant fails in its application under s 216A. A litigant who is found to be abusing the process is found to be undeserving of access to justice. The procedural law therefore rightly sets a high standard before an abuse of process can be found. By contrast, if an application under s 216A fails, the company is not deprived of access to justice. The result, simply, is that the court upholds the company’s decision, arrived at in accordance with its corporate constitution, not to avail itself of its right of access to justice. That right continues to subsist unimpaired. The company could at any time change its mind and pursue its claim. It could even change control and pursue its claim. The test of good faith would be drawn far too widely if it operated to admit any applicant whose derivative action failed to meet the high standard necessary to be characterised as an abuse of the process of the court under the procedural law. 179    Fourth, equating good faith with not abusing the process of the court would require every challenge to good faith to be argued as a notional application to strike out the derivative action. That cannot be a mandatory aspect of every application under s 216A. It would be far too speculative an exercise in the typical application. An applicant under s 216A is not required fully to frame, plead and support with evidence his derivative action at the time it applies for leave under s 216A. Quite the opposite: the authorities are clear that the applicant need only present enough material at that stage to satisfy the court that the derivative action is legitimate or arguable:Ang Thiam Sweeat [58]. It is not often, therefore, that there will be sufficient material before the court to permit it to determine, every time that an applicant’s good faith is challenged, whether the hypothetical derivative action would be an abuse of the process of the court. 180    Fifth, equating good faith with a derivative action which is not an abuse of process is analytically unsound. AsAng Thiam Sweemakes clear, the subjective test under s 216A(3)(b) is distinct from the objective test under s 216A(3)(c). It would breach that distinction to turn the inquiry into the applicant’s good faith into an inquiry as to whether the hypothetical derivative action amounts to an abuse of the process of the court. Abuse of the process of the court is a broad doctrine in the procedural law comprising many strains. Not all of those strains turn on the litigant’s subjective purpose in commencing the litigation which is said to be an abuse. Yet, that subjective purpose is the very essence of the inquiry under s 216A(3)(b). The other strains of the procedural doctrine of abuse of process focus on objective aspects of the litigation in question, including its background, its merits and its effect on its counterparty. But it cannot be that the approach mandated byAng Thiam Sweerequires a consideration of all of these objective aspects, especially the merits, on every challenge to the applicant’s good faith under s 216A(3)(b). These objective aspects are properly to be considered on the inquiry under s 216A(3)(c). They are relevant to the inquiry under s 216A(3)(b) only indirectly and inferentially, after a finding on s 216A(3)(c). 181    Sixth, it is wrong in principle to reverse the burden of proof by approaching the test of good faith under s 216A(3)(b) as though it were a notional application by the respondent to strike out the derivative action. The party seeking to strike out an action as an action is an abuse of the process of the court bears all of the burdens. A respondent challenging an applicant’s good faith under s 216A(3)(b) bears only a tactical burden. It is therefore never for the respondent to establish that the applicant’s derivative action is an abuse of process. It is always for the applicant to establish that it is acting in good faith. 182    All of this suggests that there is significance in the actual formulation of the secondSwanssonfactor: “whether the applicant is seeking to bring the derivative suit for such a collateral purpose as would amount to an abuse of process”. This formulation has significance in two respects. First, it rightly places the emphasis on the applicant’s collateral purpose rather than on the concept of an abuse of process. Second, the words “would amount” in this formulation suggests an analogy with the procedural concept of an abuse of the process of the court rather than an equivalence with that concept. Asking whether the applicant’s collateral purpose in seeking leave to bring the derivative actionwould amountto an abuse of process is not the same as asking whether the applicant’s derivative actionwould bean abuse of process. 183    To summarise: the focus of the inquiry under the secondSwanssonfactor is not on the doctrine of abuse of the process of the court as it has developed in the procedural law in all its many strains. Instead, the focus is on ascertaining whether the applicant’s proposed derivative action is motivated by an improper collateral purpose. A collateral purpose is improper in this sense if it would amount to an abuse of process.  But a collateral purpose is also an improper collateral purpose if it involves the applicant in an abuse of s 216A and by extension of the company (Ang Thiam Sweeat [31]). A collateral purpose which is improper in this sense will take the applicant outside s 216A(3)(b) but need not suffice to render the applicant’s derivative action an abuse of the process of the court under the procedural law. 184    There is authority for the proposition that an abuse of the process of the court under the procedural law is not essential for an applicant to fail. InCoeur de Lion(at [48]), Muir JA confirms this: It was not asserted by Palmer J [inSwansson] that the “two interrelated factors” to which he referred are the only matters which a court may have regard to in determining the existence of good faith. The scope of the requirement of good faith...is informed by the considerations that if leave to bring proceedings is granted, the proceedings will be conducted on the company’s behalf and the court must be satisfied that “it is in the best interests of the company” that the applicant be granted leave. In seeking to act on behalf of a company in litigation, an applicant...is, in effect, seeking to stand in the shoes of the directors for the purposes of the litigation. That suggests that an applicant... may not be acting in good faith if acting for a collateral purpose even if the collateral purpose would not amount to an abuse of the process. It is plainly not the case that directors who cause a company to institute proceedings for collateral purposes of their own will be in breach of duty only if the proceedings constitute an abuse of process. 185    Tobias JA makes a similar point inChahwan v Euphoric Pte Ltd t/as Clay & Michel[2008] NSWCA 52 at [83]: As I have already observed, it must be kept in mind that the onus lies upon the applicant to satisfy the court that, in applying for leave to bring the relevant proceedings, he or she is acting in good faith. If such an applicant is in reality seeking to further his or her own personal interests other than as a current or former shareholder of the company, rather than the interests of the company as a whole, then in my view that onus will not have been discharged. Such a finding will not give effect to paragraph 6.36 and 6.37 of the Explanatory Memorandum, which I have recorded in [72] above. It thus matters not that the conduct in question would not support a finding of abuse of process. ... The Explanatory Memorandum that Tobias JA refers to is the Explanatory Memorandum to the Corporate Law Economic Reform Program Bill 1998 which led to the Australian legislation under consideration. Paragraph 6.37 of that Explanatory Memorandum is instructive: Applicant’s good faith 6.36  ... 6.37  The good faith requirement is designed to prevent proceedings being used to further the purposes of the applicant rather than the company as a whole. 186    The approach taken by the Court of Appeal inAng Thiam Sweebears this out also. The heart of the Court of Appeal’s determination on s 216A(3)(b) is found at [32]–[42]. In this section, the Court of Appeal examines the applicant’s purpose in bringing the derivative action and concludes (at [42]) that it is an improper collateral purpose, being a personal purpose unrelated to the interests of the company: “The overriding impression is that [the applicant] feels he either has been or will be wronged, and is using the statutory derivative action not as a means of pursuing the interests of the Company, but to secure and/or advance his own interests within the Company. In this regard, he cannot be taken as having established that he is acting in good faith.” It is on this basis that the Court of Appeal concludes that the applicant has failed to discharge his burden of proving that he is acting in good faith. 187    Then, as afurtherground for holding that the applicant fails the test in s 216A(3)(b), the Court of Appeal goes on to hold at [42]–[46] that the applicant’s improper collateral purpose suffices also to render the s 216A application an abuse of the process of the court. The availability of that further finding is a feature purely of the facts ofAng Thiam Sweeitself. It comes after and in addition to the dispositive finding at [42] that the applicant had failed to discharge his burden under s 216A(3)(b). It is not a finding that is required in every application under s 216A. 188    There is therefore nothing anomalous about Petroships’ application failing despite its derivative action being assumed to be legitimate and arguable and despite its derivative action being found not to be an abuse of the process of the court.",
        "Conclusion": "189    Petroships fails in its application for two reasons. First, Petroships lacks good faith in seeking leave to bring its derivative action. Second, it is notprima faciein the interests of Wealthplus that the derivative action be brought given that Wealthplus is now under the control of liquidators and given that there is no basis to allege that the liquidators are in breach of any of their duties. 190    I have therefore dismissed with costs Petroships’ application to bring its derivative action.  [note: 1]SUM6495/2013 and SUM6496/2013. [note: 2]SUM4262/2013. [note: 3]Alan Chan’s affidavit dated 7 May 2012, exhibit ACHJ-6 (“Alan Chan’s 4th S867/2011 affidavit”) at paragraph 12; Alan Chan’s affidavit dated 24 February 2012 (“Alan Chan’s 1st S867/2011 affidavit”) at pp 17, 19, 22. [note: 4]Alan Chan’s 4th S867/2011 affidavit at paragraph 20. [note: 5]Alan Chan’s 4th S867/2011 affidavit at paragraph 8. [note: 6]Alan Chan’s 4th S867/2011 affidavit at paragraphs 7 - 9. [note: 7]Alan Chan’s affidavit dated 23 August 2012 (“Alan Chan’s 2nd OS766/2012 affidavit”) at paragraph 12. [note: 8]Koh Keng Siang’s affidavit dated 22 October 2013 (“KKS’s 1st affidavit”) at paragraph 12. [note: 9]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 13. [note: 10]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 18. [note: 11]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 18 and at page 126. [note: 12]KKS’s 1st affidavit at pages 29 - 30. [note: 13]KKS’s 1st affidavit at page 41. [note: 14]KKS’s 1st affidavit at page 921. [note: 15]KKS’s 1st affidavit at page 54. [note: 16]KKS’s 1st affidavit at page 107. [note: 17]JUD479/2010/C. [note: 18]KKS’s 1st affidavit at pages 113 - 114. [note: 19]KKS’s 1st affidavit at pages 131 - 132. [note: 20]Alan Chan’s 2nd OS766/2012 affidavit at page 201. [note: 21]Alan Chan’s 2nd OS766/2012 affidavit at paragraphs 24 and 41. [note: 22]Alan Chan’s 2nd OS766/2012 affidavit at pages 206 and 207. [note: 23]Alan Chan’s 1st S867/2011 affidavit at pages 41 and 45. [note: 24]Alan Chan’s 2nd OS766/2012 affidavit at page 203. [note: 25]Alan Chan’s 2nd OS766/2012 affidavit at pages 206 and 207. [note: 26]Alan Chan’s 1st S867/2011 affidavit at pages 41 and 45. [note: 27]Alan Chan’s affidavit dated 17 August 2012 (“Alan Chan’s 1st OS766/2012 affidavit”) at pages 23 - 24. [note: 28]Alan Chan’s 1st OS766/2012 affidavit at pages 23 - 24. [note: 29]KKS’s 1st affidavit at pages 137, 138, 140 - 142. [note: 30]KKS’s 1st affidavit at paragraph 33. [note: 31]Alan Chan’s 1st OS766/2012 affidavit at paragraph 8, page 15. [note: 32]Alan Chan’s 2nd OS766/2011 affidavit at paragraphs 24 and 41. [note: 33]Statement of claim in S867/2011, paragraph 11. [note: 34]Yin Kum Choy’s affidavit dated 25 January 2013 (“YKC’s 1st affidavit”) at pages 14 - 15. [note: 35]YKC’s 1st affidavit at paragraph 15, pages 42 - 44. [note: 36]YKC’s 1st affidavit at paragraph 16, pages 46 - 47. [note: 37]YKC’s 1st affidavit at paragraphs 19 and 20; Alan Chan’s affidavit dated 12 November 2013 (“Alan Chan’s 4th OS766/2012 affidavit”) at page 11. [note: 38]KKS’s 2nd affidavit, pages 12 and 13. [note: 39]Alan Chan’s 4th OS766/2012 affidavit at paragraphs 11 - 12, pages 199 - 200. [note: 40]Alan Chan’s 4th OS766/2012 affidavit at page 206. [note: 41]Alan Chan’s 4th OS766/2012 affidavit at paragraph 15. [note: 42]Plaintiff’s written submissions dated 23 April 2014 (“PWS”) at paragraph 71. [note: 43]2nd and 3rd defendants’ written submissions dated 23 April 2014 (“DWS”) at paragraph 45. [note: 44]DWS at paragraph 46 read with paragraph 41. [note: 45]DWS at paragraph 47. [note: 46]DWS at paragraph 53. [note: 47]PWS at paragraph 95. [note: 48]PWS at paragraph 95. [note: 49]KKS’s 1st affidavit at p 552; PWS at paragraph 93. [note: 50]Alan Chan’s 4th OS766/2012 affidavit at paragraph 21, page 472; PWS at paragraph 90. [note: 51]KKS’s 1st affidavit at pages 30, 48, 114 and 143. [note: 52]KKS’s 1st affidavit at page 142. [note: 53]NE 4 March 2014, page 82 line 22 to page 83 line 10. [note: 54]NE 4 March 2014, page 118 line 3 to 31. [note: 55]Alan Chan’s 2nd OS766/2011 affidavit at p 198. [note: 56]Alan Chan’s 2nd OS766/2011 affidavit at paragraph 24(d). [note: 57]Alan Chan’s 2nd OS766/2011 affidavit at paragraph 24(c). [note: 58]NE 4 March 2014, page 51 line 26 to page 52 line 28. [note: 59]NE 4 March 2014, page 53 line 1 to 4. [note: 60]NE 4 March 2014, page 56 line 22 to 26. [note: 61]NE 4 March 2014, page 52 line 11 to 12. [note: 62]NE 4 March 2014, page 52 line 5 to 9. [note: 63]NE 4 March 2014, page 85 line 26 to 27; page 88 line 30. [note: 64]NE 4 March 2014, page 52 line 5 to 9. [note: 65]NE 4 March 2014, page 58 line 19 to 30. [note: 66]NE 4 March 2014, page 80 line 4 to page 81 line 2. [note: 67]NE 4 March 2014, page 80 line 18 to 21. [note: 68]KKS’s 1st affidavit at p 549. [note: 69]Alan Chan’s 4th S867/2011 affidavit at paragraphs 42 and 43. [note: 70]KKS’s 1st affidavit at pages 55 and 56. [note: 71]Alan Chan’s 1st S867/2011 affidavit at paragraphs 18 and 19. [note: 72]NE 4 March 2014, page 34 lines 16 to 26. [note: 73]Alan Chan’s 1st S867/2011 affidavit at page 9. [note: 74]Alan Chan’s 2nd S867/2011 affidavit at paragraph 11. [note: 75]Alan Chan’s 1st S867/2011 affidavit at paragraph 6, page 9. [note: 76]Defendant’s Core Bundle of Documents (“DCBD”) at page 482. [note: 77]NE 4 March 2014, page 103 (lines 8 and 9). [note: 78]Alan Chan’s 1st S867/2011 affidavit at paragraphs 13 - 15. [note: 79]KKS’s 1st affidavit at pages 55 and 56. [note: 80]Alan Chan’s affidavit dated 21 March 2012 at paragraph 9. [note: 81]Alan Chan’s 4th S867/2011 affidavit at paragraph 44. [note: 82]DCBD at p 609. [note: 83]KKS’s 1st affidavit at page 54. [note: 84]NE 4 March 2014, page 64 line 17 to page 68 line 25. [note: 85]NE 4 March 2014, pages 71 (line 27) – 72 (line 11). [note: 86]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 24(a) and page 192. [note: 87]Alan Chan’s 2nd OS766/2012 affidavit at page 37. [note: 88]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 24(b) and page 161. [note: 89]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 24(c) and pages 161 and 190. [note: 90]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 24(d) and page 192. [note: 91]Alan Chan’s 2nd OS766/2012 affidavit at paragraph 25, page 37. [note: 92]NE 4 March 2014, page 17, line 26 to 30. [note: 93]NE 4 March 2014, page 25 line 1, [note: 94]NE 4 March 2014, page 22 line 4 to 7. [note: 95]PWS at paragraphs 53 and 80. [note: 96]DWS paragraphs 127 and 150. [note: 97]PWS at paragraph 46. [note: 98]Alan Chan’s 2nd OS766/2012 affidavit at page 295. [note: 99]Alan Chan’s 2nd OS766/2012 affidavit at page 298."
    }
}