{
    "case_title": "ATZ\n      v\n      AUA",
    "ncitation": "[2015] SGHC 161",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       The plaintiff wife (“the plaintiff”) and the defendant husband (“the defendant”) were married on 12 April 2007. The parties lived apart some 19 months later. The plaintiff is aged 38 and the defendant is 48 years old. There is one female child of the marriage, aged 7 years (“the child”). 2       The plaintiff, who is from Ukraine, was working and living in Germany when she met the defendant on the Internet. After a short cyberspace courtship of about one month, she visited the defendant in Singapore in February 2007. The defendant proposed in March 2007. The plaintiff left her job as a bank officer, married the defendant on 12 April 2007 and relocated to Singapore in July 2007. The plaintiff became pregnant shortly after the marriage. The female child of the marriage was born on 7 March 2008. All in all, the parties’ virtual meeting, the plaintiff’s marriage to the defendant, relocation to Singapore, and pregnancy happened almost impulsively in smooth succession. Sadly but not surprisingly, the marriage was very short-lived. 3       The parties lived apart since 15 November 2008. At that point in time, the child was only eight months old. In the course of the next five months, steps were taken to formalise their separation. Eventually, the parties signed a Deed of Separation dated 21 April 2009 (“the Deed”). The plaintiff initially filed for divorce on 16 August 2011 citing the defendant’s unreasonable behaviour as a ground for divorce. The proceedings were withdrawn by consent on 17 January 2012. The plaintiff subsequently commenced the present divorce proceedings on 3 February 2012 after three years separation and Interim Judgment was granted on 24 April 2012. 4       Since the separation of the parties, the plaintiff has been working part-time as a real estate agent and does some informal interpretation work. 5       The defendant, a German, resides and works in Singapore. He has all along been the sole proprietor of a business that trades in raw materials. I shall refer to the business entity as “SS”. The defendant is also a director and shareholder,inter alia, of a private limited company, which I shall refer to as “DFP”. As seen from DFP’s financial statements, the company was dormant in the financial year ended December 2012.[note: 1]",
        "The Deed": "6       The terms in the Deed relevant to these proceedings are set out below: … 1.Living Apart 1.1    With effect from 15 November 2008, they have and shall continue to live separate and apart from each other as if each were single and unmarried and free from the marital control (if any) of the other and neither of them shall molest, annoy, disturb, or interfere with the other of his or her relations, friends, or acquaintances or in his or her profession or business. … 2.Divorce and Breakdown of Marriage 2.1    Either party may commence divorce proceedings on the ground of three years separation being three years from the date of separation herein, and the other party consents to a divorce and/or a Final Judgment of Divorce being granted. 3.Maintenance of Wife and [Child] 3.1    Subject to clauses 3.1, 3.2 and 3.3 herein, upon Final Judgement of Divorce being obtained, the Husband shall pay the Wife SGD 40,000 (“the Divorce Settlement”) for her contribution towards the marriage (if any and which contribution is denied by the Husband). In this respect, the Husband had on 19 November 2008 paid in advance the sum of SGD 10,000 to the Wife as part of the Divorce Settlement. 3.2    The Husband had procured an apartment at [address] (“the Apartment”) as the current living accommodation of the Wife and [the child] and had paid a deposit of SGD 5,400, which deposit the Wife may keep as part of the Divorce Settlement when she moves out of the Apartment. For this purpose, the Husband shall inform the landlord in writing that the rental deposit without deduction shall be handed over to the Wife. 3.3    Following from clauses 3.1 and 3.2 above, the Husband shall be required only to pay the Wife the balance of SGD 24,600 for the Divorce Settlement upon a Final Judgment of Divorce being obtained. 3.4    The Husband shall pay to the Wife a sum of SGD 2,700 per month being the rent of the Apartment until the Wife and [child] move out of said Apartment upon the expiry of the tenancy of the Apartment on 14 November 2011. Thereafter, the Husband shall no longer be obliged to pay for the rent of any accommodation for the Wife and [child] and shall only be responsible to pay maintenance as hereafter set out. The rent of maximum SGD 2,700 shall be paid up to and including 14 November 2011. 3.5    The Husband shall pay to the Wife a sum of SGD 2,300 per month being maintenance for the Wife and [child]. The payments shall be made with effect from December 2008 and thereafter on the 1stday of each subsequent month, until 15 November 2011. 3.6    From 15 November 2011 to the time [the child] reaches the age of 13 years, the Husband shall pay the sum of SGD 1,500 as monthly maintenance for [the child]. 3.7    Upon [the child] attaining the age of 13 years, the maintenance sum to be paid by the Husband shall be increased to SGD 1,600 per month until [the child] is 17 years old. 3.8    Upon [the child] attainting the age of 17 years, the maintenance sum to be paid by the Husband shall be increased to SGD 1,800 per month until [the child] is 19 years old. 3.9    Upon [the child] attaining the age of 19 years, the maintenance sum to be paid by the Husband shall be increased to SGD 2,000 per month until the death of the Husband or until [the child] reaches 21 years old or has completed her tertiary education, whichever is later. 3.10  The Husband shall provide medical insurance coverage which shall cover all medical and hospitalisation expenses for [the child] to the maximum premium of SGD 1,200 per annum. 4.Custody of [the child] 4.1    The Husband and Wife shall continue to have joint custody of [the child] with care and control to the Wife and liberal access to the Husband at least 3 times a week on Monday, Wednesday, Friday from 1p.m. to 6p.m. and on weekends on Sunday from 1 p.m. to 6p.m.. 4.2    The Wife may choose the country which [the child] and herself shall live in. In the event that the Wife and [the child] [move] out of the Apartment or subsequently [change] accommodation, the Wife shall immediately inform the Husband in writing of the location of their new living accommodation. 5.Assets 5.1    Each party shall retain his/her assets in his/her name. 5.2    [The apartment in Singapore (“Property”)] was brought solely by the Husband before the marriage and during the marriage the mortgage over the property was paid solely by the Husband. The Wife agrees that the Property belongs solely to the Husband and she shall not make any claim against the Husband for any share of the Property or its sale proceeds should it be sold in the future. Pending the sale of the Property, the Husband may continue to reside in the Property at his choice. In turn, the Husband shall procure payment of living accommodation for the Wife in accordance with clauses 3.2 and 3.4 herein. 6.Legal Costs 6.1    Each party shall bear his/her own solicitors’ costs in respect of this Deed and the divorce proceedings to be filed by either party. 7.No Undue Influence/Legal Representation 7.1    The legal and practical effect of this Deed has been fully explained to each of the Parties and each of the Parties acknowledges that the terms herein are accurate and fair and not the result of any fraud, distress or undue influence exercised by the other Party or any other Party or person upon either. 7.2    Each Party hereby warrants that it has entered into this Deed of its own free will, after having sought and received full and complete independent legal advice on the matters referred to in this Deed. 8.Full and Final Settlement 8.1    The terms and conditions stated in this Deed represents the full and final agreement between the parties of all the matters stated herein and that save as stated herein, neither the Husband nor the Wife shall make any claim against the other for any matter whatsoever and howsoever arising or against any of the parties’ respective assets, whether solely or jointly with another party. 8.2    All provisions of this Deed shall, so far as they are capable of being performed or observed, continue in full force and effect notwithstanding the commencement of any divorce proceedings, Interim Judgment of Divorce and a Final Judgment of Divorce in respect of those matters then already performed. 8.3    This Deed shall be in full and final settlement of all matrimonial and ancillary matters between the parties and shall also be embodied in an Order of Court in the divorce proceedings provided that if any parties does not observe or perform all or any of the aforesaid mentioned covenants, the other party shall be at liberty to apply for enforcement of the same and the defaulting party shall not contest such enforcement proceedings, if any. 7       It is evident from the terms set out above that the Deed purported to regulate the rights and liabilities of the parties at three different phases: (a) the first three years after separation and before divorce proceedings were actually filed; (b) the period between filing of divorce proceedings and grant of Final Judgment of Divorce; and (c) the period post Final Judgment of Divorce. Indeed, recital (E) of the Deed made clear the aims of the Deed which were to regulate the rights of the parties based on the terms thereof. Recital (E) reads: The Husband and the Wife have agreed that whilst apart until they make other provisions for the matters herein mentioned or until the terms hereof are superseded by any Order of Court, the following provisions shall take effect and regulate their rights and liabilities to each other. 8       Hence, pursuant to cl 5.1, each party would be able to retain the assets in his or her own name. The only major asset that was expressly referred to in the Deed was the matrimonial homeviz, the apartment which the parties lived in during the marriage. The parties considered the matrimonial home as a matrimonial asset upon which the plaintiff would otherwise have a claim in divorce proceedings. That said, the defendant did not, however, agree that the plaintiff had contributed to the marriage. Nevertheless, he settled this issue with a promise to pay $40,000 upon Final Judgment of Divorce (see cl 3.1 of the Deed). As to whether this sum of $40,000 could be taken as representing a “division of a matrimonial asset” or, was simply a “pay-off” in exchange for the plaintiff giving up her claim to the matrimonial home in cl 5.2, this matter will be considered later in the Judgment. 9       In relation to maintenance, pursuant to cl 3.4, the defendant was obliged to pay rent for the plaintiff and the child for a period of three years following the separation. Similarly, the defendant was pursuant to cl 3.5 to pay maintenance to the plaintiff for the same period. 10     More specifically, in relation to the maintenance of the child, cll 3.6 to 3.9 provide that the child was to be maintained (at an incremental rate) until she reaches 21 years old or has completed her tertiary education, whichever is later. Pursuant to cl 3.10, the defendant was also required to provide medical insurance coverage for the child to the maximum premium of $1,200 per annum. 11     Lastly, the Deed also covered the issue of custody, care and control and access in cl 4.1. Broadly, the parties agreed to joint custody with care and control to the plaintiff and liberal access to the defendant. 12     As seen from the above outline, the Deed purported to cover all of the issues that a court would have to consider in ancillary proceedings. 13     The plaintiff, however, has challenged the validity of the Deed. She asserted that the Deed should be set aside because of undue pressure from the defendant who had pressured or coerced her into signing the Deed. Besides examining the plaintiff’s allegations of undue influence as a vitiating factor, there are two preliminary issues that arise for determination. First, whether the Deed was an agreement that was binding on the parties, and second, whether it was an agreement of the type specified in s 112(2)(e) of the Women’s Charter (Cap 353, 2009 Rev Ed) (“the Charter”).",
        "Is the Deed binding?": "14     It is common ground that the Deed was executed under seal by the parties. The plaintiff did not dispute that the signature on the relevant execution page of the Deed was hers. In this case, the plaintiff signed the Deed under seal in the presence of her solicitor who witnessed her signing of the Deed on 3 April 2009. The execution page also contained an attestation certification of the plaintiff’s solicitor. It reads as follows:[note: 2] On this 3rdday of April 2009 before me, [name redacted], an Advocate and Solicitor of the Supreme Court of the Republic of Singapore practising in Singapore, personally appeared [the plaintiff] who of my own personal knowledge I know to be the identical person whose name “[signature]” is subscribed to the within instrument and acknowledged that she had voluntarily executed this instrument at Singapore. 15     Theprima facieevidence on the face of the Deed is that it was signed, sealed and delivered by the plaintiff on 3 April 2009. As for the defendant, he signed the Deed under seal in the presence of his solicitor who acted as a witness to his signing of the Deed on 21 April 2009. The Deed also contained his solicitor’s attestation certification. Theprima facieevidence on the face of the Deed is that it was signed, sealed and delivered by the defendant on 21 April 2009.",
        "Are there vitiating factors to set aside the Deed?": "16     As stated, the plaintiff argued that the Deed should be set aside because of vitiating factors. InTQ v TR[2009] 2 SLR(R) 961 (“TQ v TR”), Andrew Phang JA noted the factors that would vitiate a pre-nuptial agreement at [97]: At the other end of the contractual spectrum are to be found the various vitiating factors. These include standard contractual doctrines such as misrepresentation, mistake, undue influence, duress, unconscionability, as well as illegality and public policy. In this last-mentioned respect, there is also the possibility of \"saving\" that part of the prenuptial agreement that is objectionable via the doctrine of severance (cf, though, the unsuccessful attempt at invoking this doctrine in the English Court of Appeal decision ofBennett v Bennett[1952] 1 KB 249; the English High Court decision ofN v N([46]supra); and the Australian High Court decision ofBrooks v Burns Philp Trustee Co Ltd(1969) 121 CLR 432; cf also s 7 of the Uniform Premarital Agreement Act (US) (adopted by 26 states and the District of Columbia)). There has also been mention of the safeguard relating to the availability of independent legal advice (and see, in the US context, Allison A Marston, \"Planning for Love: The Politics of Prenuptial Agreements\" (1997) 49 Stan L Rev 887 at 909-916). We would pause to observe that this particular factor is in fact an integral part of the factors that the courts would generally take into consideration in any event (particularly in the context of the application of the doctrines of undue influence, duress and unconscionability). 17     The court inWong Kien Keong v Khoo Hoon Eng[2012] SGHC 127 at [22] extended and applied these principles to a post-nuptial agreement, which extension was accepted by our Court of Appeal inLian Hwee Choo Phebe v Tan Seng Ong[2013] 3 SLR 1162 at [18] (“Lian Phebe”). 18     On the evidence, the plaintiff’s signature on the face of the Deed mustprima faciebe taken to have the intended effect on the signatory. In this regard, cl 7.2 of the Deed (at [6] above) is instructive. It contained the plaintiff’s acknowledgment that she chose to sign the Deed of her own free will and with the benefit of legal advice. The plaintiff confirmed in cl 7.1 that the legal and practical effect of the Deed had been explained to her and that there was no “undue influence exercised” by the defendant or any person (see [6] above). 19     Notably, there were two e-mails to the plaintiff that supported the defendant’s contention that he did not force her to sign the Deed. The first e-mail dated 25 January 2009 reads:[note: 3] … I have attached the revised [Deed] and have stressed my proposition! This is, however, my very last proposition!!! Read it through.No one is forcing you to sign it. However, after this, I would not adhere much longer to my propositions, in case you think that you are not getting enough. This is a better offer than what you are legally entitled to! Even in Germany, you would be entitled to less… [emphasis added] 20     In the second e-mail dated 22 January 2009, the defendant rejected the plaintiff’s counter proposal for more money. He wrote:[note: 4] I have made you a very respectable offer, which lies within my financial means, and you are not getting enough!!! Now, I have to fight too, and in addition to that, the leasing contract will expire come August. After which, I would be facing more financial problems, and if I do not receive any application by then, I would be forced to sell the apartment, which would mean that I would incur a loss. This loss would be incorporated in our combined marital assets, and I would then only pay you what you are entitled to! The attached proposition must be signed by 31 March. Please inform me if you would be signing it or not, as it needs to be then properly edited and straightened out!!??? I would not entertain any further revisions or changes from you.You can merely choose whether you want to sign it or not![emphasis added]. 21     The plaintiff adduced e-mails to highlight that she voiced her unhappiness with certain portions of the Deed[note: 5]and to evince that she “[had] neither energy nor money to fight against [the defendant]”[note: 6]in relation to the terms of the Deed. In my view, the sentiments expressed by the plaintiff were consistent with the meaning and her understanding of the defendant’s e-mails set out above: she could choose not to sign the Deed if she did not accept his proposals. The point that she had neither the energy nor the money to fight the defendant was proffered (contemporaneously) as her reason for signing the Deed and not to suggest that she had been pressured or coerced by the defendant to sign the Deed. 22     An important point to note from Phang JA’s observations at [16] above is that the availability of independent legal advice at the material time is a key factor the court would consider in deciding if a pre-nuptial agreement or post-nuptial agreement (“marital agreement”) should be set aside. This is because it is normally the case (as in the present) that parties to a marriage would invoke the doctrines of undue influence or duress to set aside a marital agreement, given the emotionally charged circumstances in which such agreements are normally negotiated and executed. The existence of independent legal advice would normally be a strong indication of informed consent, which would undermine arguments relating to undue influence or duress. 23     In the present case, I note that both parties were legally advised in the entry into the Deed, which took five months to negotiate. I am satisfied on the evidence that there was no undue influence and that the so-called pressure felt by the plaintiff at the time of entry into the Deed was not of such quality as to undermine her consent so as to vitiate the Deed. It is natural for parties to feel some pressure in the run up to negotiating a marital agreement. However, the pressure felt and faced by the plaintiff, as evinced by the e-mail exchanges between herself and the defendant (and herself and her solicitor), would not satisfy the stringent legal requirements for vitiating a marital agreement. Additionally, the plaintiff did not state once in her e-mails to her solicitor that she was pressured to sign the Deed. The five-month period taken to finalise the Deed was also indicative of the fact that each party would have had the opportunity to review the offers and to make counter proposals. Indeed, I note that the plaintiff did propose some amendments to drafts of the Deed that were eventually accepted and incorporated. She had also asked for more money but on that matter the defendant was not prepared to give in. 24     In support of her assertion of undue influence, the plaintiff’s mother deposed an affidavit to suggest that her daughter was pressured into signing the Deed. I also find the affidavit filed by the plaintiff’s mother to be both self-serving and unreliable seeing that it was based on evidence communicated to her by the plaintiff. 25     Counsel for the defendant, Mr Ranjit Singh (“Mr Singh”), pointed out that the plaintiff had previously stated in an affidavit filed to oppose proceedings brought by the defendant for sole custody and care and control of the child under the Guardianship of Infants Act (Cap 122, Rev Ed 1985) (“GIA”) in 2010 that the Deed was “negotiated at arms’ length” and that the defendant’s application was contrary to cl 4.1of the Deed.[note: 7]He argued that the plaintiff must not be allowed to blow hot and cold and take inconsistent positions: she had previously adopted the position that the Deed was valid and negotiated at arm’s length in an attempt to bind the defendant to cl 4.1 of the Deed. Yet in these proceedings, she adopted a contradictory position in her challenge that the Deed was invalid and that it should be set aside because of,inter alia, undue influence. 26     The defendant further pointed out that plaintiff’s complaint lacked credibility, as she chose to accept payments due to her under the Deed. The defendant performed his obligations under the Deed for three years before divorce proceedings were filed and the plaintiff was content until these proceedings were commenced to receive the payments under cll 3.1, 3.2, 3.4 and 3.5 of the Deed 27     The plaintiff argued that she was kept in the dark about the defendant’s assets and his financial position at the time the Deed was signed. She claimed that the defendant had not told her about his financial resources and did not make full and frank disclosure of his assets and means when she signed the Deed.[note: 8]Counsel for the plaintiff, Ms Bernice Loo (“Ms Loo”), argued that the Deed was not valid because of the defendant’s failure “to make full and frank disclosure/material disclosure of his financial resources when he entered into the Deed”, and she argued that that “alone is a factor which mitigates against the notion that the Deed was entered into ‘at arm’s length’.”[note: 9]Not only was there no specific assertion of any misrepresentation, Ms Loo did not refer me to any authority in support of her proposition that the non-disclosure of the defendant’s financial resources is a vitiating factor recognised in law. 28     Judith Prakash J inTiong Swee Eng v Yeo Khee Siang[2015] SGHC 116 (“Tiong Swee Eng”) noted at [58] that the law makes a distinction between misrepresentation and non-disclosure. This distinction has been explained by John Cartwright in his bookMisrepresentation, Mistake and Non-Disclosure(Sweet & Maxwell, 3rd Ed, 2012) (“Cartwright”) at para 16-03 in the following manner: … In the case of a misrepresentation, [the claimant] alleges that it was the defendant’s misrepresentation that caused him to make the mistake: the defendant’s words or conduct communicated information on which the claimant relied in deciding to enter into the contract. But in the case of non-disclosure the defendant has done nothing to cause the mistake or to give rise to the claimant’s assumptions as to the circumstances surrounding the contract; he failed to give the claimant relevant information which would have corrected the mistake or false assumption. A claim of non-disclosure therefore falls between mistake and misrepresentation: the claimant is not simply relying on his own mistake or misunderstanding; but nor does he say that the defendant caused it.He claims that the defendant should have told him something to correct the mistake or to inform him better about the circumstances relevant to his decision to enter into the contract, and that he is entitled to a remedy in consequence of the defendant’s failure to fulfil his duty. [emphasis added] 29     Additionally, the general principle and starting point at common law is that there is no pre-contractual obligation on the part of parties negotiating a contract to disclose information even when the party is aware that the said information would influence the decision of the other. This principle recognises that parties are normally negotiating as adversaries prior to entering into a contact and has been outlined both inCartwrightat para 16-02 and the decision of the English Court of Appeal inBanque Financiere de la Cite SA (formerly Banque Keyser Ullmann SA) v Westgate Insurance Co (formerly Hodge General & Mercantile Co Ltd)[1990] 1 QB 665 (“Westgate Insurance”). The court inWestgate Insurancenoted as follows at 798: … There are countless cases in which one party to a contract has in the course of negotiations failed to disclose a fact known to him which the other party would have regarded as highly material, if it had been revealed. However, ordinarily in the absence of misrepresentation, our law leaves that other party entirely without remedy. … 30     Now that mere pre-contractual non-disclosure does not amount to misrepresentation at law, the plaintiff here who is seeking to argue that the Deed should be vitiated on the ground of non-disclosure of the defendant would have to first establish that the case falls within a recognised exception to the general rule, such that there is an obligation of disclosure imposed on the defendant. 31     I note that the common law imposes an express pre-contractual duty of disclosure in certain narrow circumstances. These circumstances typically arise in contracts of utmost good faith and this occurs in the insurance context. I note that Chapter 17 ofCartwrightsets out the situations where the courts have imposed a pre-contractual obligation of disclosure, and a post-nuptial agreement is not highlighted as one such situation. 32     In the present case, no authority has been cited by the plaintiff in support of her argument that the law imposes an obligation of disclosure on parties when entering into a post-nuptial agreement. In any case, the position in Singapore law as set out inTiong Swee Engat [63] is that there is no general pre-contractual obligation of disclosure imposed on parties to a post-nuptial agreement, as a post-nuptial agreement is subject to ordinary principles of contract law and is like any ordinary contract. I am of a similar view and also highlight that the position inWestgate Insurance(set out at [29] above) should form the starting point for any analysis relating to such pre-contractual disclosure obligations. The court inTiong Swee Engnevertheless highlighted that although there is no general obligation of disclosure on parties when entering into a post-nuptial agreement, the court may decide to accord less weight to a valid post-nuptial agreement (as part of its analysis pursuant to s 112(2)(e) of the Charter) if it finds that the non-disclosure by one party led to a less than equitable division of matrimonial property. 33     I make a few observations onTiong Swee Eng. In that case, the parties entered into a post-nuptial agreement where they,inter alia, divided the matrimonial assets. The husband made an express representation as to his asset position in an assets list (“Assets List”) and omitted a certain property from the said list. The court found that the husband had misrepresented his position in the Assets List and that the wife relied on the accuracy of the Assets List in entering into the post-nuptial agreement. Though the court found actionable misrepresentation, it refused to rescind the separation agreement and awarded the wife damages of $1000. 34Tiong Swee Engis distinguishable on the present facts. First, there was no list of assets that was tabulated by the parties as part of entry into the Deed. In the absence of any express representation on his assets by the defendant in the Deed, as inTiong Swee Eng, it is not possible for the plaintiff to argue that she relied on the defendant’s asset position in entering into the Deed. Therefore, even if the plaintiff ran an argument based on misrepresentation, she would not have succeeded. The plaintiff would also not be able to argue without more that the defendant had breached a common law obligation, as there would have been no general obligation of disclosure on him at common law. Second, as I will discuss shortly, the plaintiff was broadly aware of the asset position of the defendant. In the premises, there is nothing to the plaintiff’s argument that the Deed should be set aside on the basis that she was kept “in the dark”[note: 10]about the defendant’s financial position. 35     As regards the plaintiff’s allegation that she was kept in the dark about the defendant’s financial position, the defendant disagreed with this. He stated in his affidavit that the plaintiff was aware when she signed the Deed that, besides the matrimonial home, he owned two other private properties, a yacht and old model Mercedes car and that he was the sole proprietor of a business.[note: 11] 36     I note the plaintiff’s concession in her submissions that she was aware of the existence of most of the assets owned by the defendant except for certain bank accounts (some of which related to SS).[note: 12]Besides, on the plaintiff’s own case, if her averments that she was involved in collating the receipts for SS and helping the plaintiff in his administrative work were true, she would have some sense of the defendant’s finances in SS.[note: 13]In any case, I am of the view that if the plaintiff needed more information before accepting the terms of the Deed, her solicitor was there to guide her in her quest for information. I note that the Deed took five months to negotiate and the plaintiff could have (through her solicitor) asked the defendant for a list of all his assets if she indeed needed more information. 37     For all the reasons stated, the Deed is a binding document in the absence of any vitiating factors to set it aside. I am satisfied that the Deed was entered into by the plaintiff freely and voluntarily. On the overall evidence, I agree with the defendant that the plaintiff’s arguments relating to the presence of vitiating factors were afterthoughts.",
        "Is the Deed an agreement within the meaning of s 112(2)(e) of the Charter?": "38     I now turn to discuss the second preliminary issue: whether the Deed was an agreement within the meaning of s 112(2)(e) of the Charter. In this regard, the Court of Appeal inLian Phebenoted at [17] as follows: To determine whether an agreement of the type specified in s 112(2)(e) of the Charter exists, two elements must be met: first, there must have been an agreement with respect to the ownership and division of the matrimonial assets; and second, the aforesaid agreement must have been “made in contemplation of divorce”. 39     The defendant’s case is that the Deed should be given full weight (as its terms were fair and equitable) in which case, an order adopting the terms of the Deed should be granted except for cl 4.1 of the Deed now that the defendant wanted shared care and control of the child. In contrast, the plaintiff’s position is that little or no weight should be given to the Deed. In this regard, the plaintiff argued that the terms of the Deed regarding division of matrimonial assets were ambiguous as well as not equitable. 40     In these current proceedings, Ms Loo did not specifically submit that the Deed was not an “agreement between the parties with respect to the ownership and division of matrimonial assets”. Her contention, however, was that the Deed was ambiguous thereby giving rise to uncertainty in the division of matrimonial assets. Put another way, there was arguably no division of matrimonial assets in the Deed given its ambiguity. Ms Loo in her reply submissions filed on 16 March 2015 highlighted some drafting discrepancies that created the ambiguity that led to uncertainty. She pointed out that the sum of $40,000 described as “the Divorce Settlement” in cl 3.1 of the Deed was for the plaintiff’s contribution towards the marriage which the defendant denied. But the heading of cl 3 was entitled “MAINTENANCE OF WIFE AND [CHILD]”. Ms Loo also relied on cl 5.2 (at [6] above) which was a provision under the heading entitled “ASSETS”. Ms Loo argued that the combined effect of cll 5.2 and 3.1 coming under different subject headings was far from clear and was thus ambiguous. She submitted as follows:[note: 14] 16.    It is not clear from Clause 5.2 and Clause 3.1 what the Wife’s share of the matrimonial assets pursuant to the Deed would be. In fact, it is arguable that pursuant to the Deed, the Wife would effectively, (1) not receive any share of the matrimonial assets save for keeping her own assets, and (2) the payment of S$40,000 under Clause 3.1 of the Deed was intended to be a lump sum maintenance payment for the Wife and [the child] (although [the child] is entitled to additional maintenance at Clauses 3.5-3.9 of the Deed). 41     In her submissions, Ms Loo treated the sum of $40,000 as “lump sum maintenance” which does not sit well with the text of cl 3.1 of the Deed and the other sub-clauses that made provision for the plaintiff’s accommodation and maintenance for three years. 42     Ms Loo questioned cll 3.1 and 5.2 of the Deed and their effect which left the plaintiff without any share of the matrimonial home, her argument ended there and did not press the point that there was no “division” as such, although she labelled the $40,000 as lump sum maintenance. Nevertheless, her point leads on to the broader question of whether the terms of cll 3.1 and 5.2 constituted an agreement with respect to the ownership and division of the matrimonial assets within the meaning of s 112(2)(e) of the Charter. 43     Clause 5.2 is made up of three parts. The first part reiterated the position that the plaintiff made no financial contribution to the acquisition of the matrimonial home and that it was the defendant who had bought it before the marriage and made all the financial contributions towards the acquisition of the property and the mortgage repayments during the marriage. The second part concerns the plaintiff. Not only did she acknowledge the defendant’s ownership of the matrimonial property, she also expressly agreed “not to make any claim against the [defendant] for any share of the [matrimonial property] or its sale proceeds should it be sold in the future”. A sale of the matrimonial property was being contemplated at the time of the Deed. The last part of cl 5.2 dealt with the defendant’s use of the matrimonial property as his abode “pending the sale of the [matrimonial home]”. It also dealt with alternative accommodation for the plaintiff and the child. 44     In one respect, I agree with Ms Loo that cll 3.1 and 5.2 could have been better drafted and organised methodically. As a discrete point, the second part of cl 5.2 would not be given effect in determining this threshold issue (ie, whether the Deed qualifies as an agreement under s 112(2)(e)) if it attempted to contract out of the plaintiff’s share of the matrimonial home by ignoring her indirect contributions so that the sum of $40,000 was nothing more than a “pay off”. It is trite law that in such matters, the parties cannot by agreement oust the court’s jurisdiction to order the division between the parties of any matrimonial asset in such proportions as the court thinks just and equitable. 45     Clause 5.2 has to be read together with cl 3.1 of the Deed in order to understand the phrase “her contribution towards the marriage” in cl 3.1. The word “contribution” in cl 3.1 was intended to refer to non-financial contributions of the plaintiff to the marriage. This interpretation is consistent with the plaintiff’s acknowledgment that the defendant made all the financial contributions towards the matrimonial home in cl 5.2 and the undisputed fact that the plaintiff did not work during the marriage and there was no suggestion that she made any indirect financial contributions to the marriage. The Deed sought to ascribe in cl 3.1, a monetary value to the plaintiff’s indirect contributions towards the marriage at the figure of $40,000. As to the defendant’s express denial in cl 3.1 that the plaintiff had contributed to the marriage, I would liken his position to someone who had concluded a settlement of a disputed issue without admission of liability and on a without prejudice basis. This interpretation of the Deed is buttressed by the defendant’s concession at the hearing that the matrimonial home was available for division subject to proof of indirect contributions in these proceedings as noted at [56] below. 46     For completeness, I should add that the Deed was made in contemplation of divorce, as evinced by cl 2.1 of the Deed. As explained earlier, the three phases of the Deed at [7] above covered the different situations of the parties as they go through separation, divorce and post-divorce. 47     In the premises, the Deed was an agreement that is within the scope of s 112(2)(e) having satisfied the requirements set out in s 112(2)(e) (see observations inLian Phebeat [17] reproduced at [38] above).",
        "Just and equitable division": "",
        "The law": "48     An agreement coming within the meaning of s 112(2)(e) of the Charter cannot in and of itself be enforceable because such an agreement cannot oust the court’s jurisdiction to order the division between the parties of any matrimonial asset in such proportions as the court thinks just and equitable (seeAOO v AON[2011] 4 SLR 1169 at [19]). It was similarly noted inWong Kien Keong v Khoo Hoon Eng[2014] 1 SLR 1342 (“Wong Kien Keong (2014)”) at [18] that even when a marital agreement has been effectively entered into and is not set aside by the court, the court has the overriding power to scrutinise the terms of the said marital agreement so as to decide on the weight that should be accorded to it. As noted inWong Kien Keong (2014)at [31]: How much weight the court accords to a marital agreement depends on the division under the agreement as well as the facts of the case, which means that not only the terms but also the parties' conduct surrounding the making and the execution of the agreement would be scrutinised. … 49     Chao Hick Tin JA inAQS v AQR[2012] SGCA 3 at [35] remarked: In any case, an agreement between the parties made in contemplation of divorce could not be decisive. It is only one of the factors listed in s 112(2) of the Women’s Charter that the court must take into account as part of its overarching duty to reach a just and equitable division in light of all the circumstances of the case. This Court affirmed inTQ v TR and another appeal[2009] 2 SLR(R) 961 at [75] that even though post-nuptial agreements could be accorded more weight than pre-nuptial agreements how much weight was to be allocated to a post-nuptial must ultimately depend on the precise circumstances of the case. … 50     While marital agreements are normally broadly classed into pre-nuptial and post-nuptial agreements, the Court of Appeal inSurindar Singh s/o Jaswant Singh v Sita Jaswant Kaur[2014] 3 SLR 1284 (“Surindar Singh”) made the following (and further) distinction between typical postnuptial agreements and separation agreements (at [52]): … Postnuptial agreements may be made when the husband and wife are still together and intend to remain together, or when they are at the point of separating or have already separated, in which case, the postnuptial agreement may be called a “separation agreement”.A separation agreement is made when the marriage has failed and when the parties have either gone their separate ways or are proposing to do so. The separation agreement is meant to cater to the immediate needs and desires of the parties, instead of some future possibility of breakup which the couple neither want nor expect to happen.Therefore, as a general proposition, where the parties enter into a separation agreement, especially after divorce or separation proceedings have already commenced, such a separation agreement will, in our view, generally carry significant weight. … [emphasis added]. 51     The Court of Appeal then stated at [54] as a general proposition that where parties had properly and fairly come to a marital agreement with the benefit of legal advice, the court would generally attach significant weight to that agreement unless there were good and substantial grounds for concluding that to do so would be unjust. Before deciding to give weight (whether significant or otherwise) to the agreement, the court will first scrutinise the agreement. This approach is consistent with s 112(2) of the Charter. I would like to highlight the following observations of the Court of Appeal at [56]: We are of the view that giving significant weight to a separation agreement, unless there are good and substantial grounds for concluding that an injustice will be done, is not inconsistent either with the approach inTQ v TR([20] supra) or with s 112 of the Charter. This does not mean that in every case significant weight will be given to such an agreement.Whilst the court may incline to give significant weight to a separation agreement which the parties have freely and voluntarily arrived at with the benefit of legal advice, the court will always (consistently with s 112(2)) examine the precise circumstances before it to determine whether in the instant case it would be unfair to do so.In determining whether such unfairness exists, the court will not accord great significance to the fact that it might have made a different distribution than that agreed to. The grounds for disregarding such a separation agreement would have to be more substantial than a slight difference of opinion on the fairness of the distribution provided for by the agreement. [emphasis added]. 52     The holding inSurindar Singhhowever must be applied in a nuanced manner. The Court of Appeal is suggesting that where the court is satisfied that the parties have factored all the contributions of each party and arrived at a division in a marital agreement, a court should be slow to vary the marital agreement on the ground that it would have given a different percentage taking into account thosevery same contributionsmade during the marriage which are typically assessed retrospectively. 53     However, the position is different where there are prospective and continuing indirect contributions of the other to the marriage and such contributions are expected to subsist by reason of obligations under the marital agreement until a final judgment of divorce. As will be seen in this case, it would generally be inequitable for one party to not sufficiently recognise those indirect contributions. Such contributions when recognised, will align the legal position in this case with situations where the court assesses indirect contributions in the absence of a matrimonial agreement (see generallyARX v ARY[2015] 2 SLR 1103).",
        "Parties’ choice of assets": "54     As mentioned earlier, the plaintiff based her principal objection to the Deed on the defendant’s non-disclosure of his assets. Her contention is that $40,000 was not fair and equitable given the defendant’s wealth. In the course of these proceedings, the plaintiff obtained discovery against the defendant to crystallise the value of his entire asset pool. Through discovery, the plaintiff found that the total value of the defendant’s assets amounted to about $6,522,608.07 (see Annex A (Table 1) for a detailed breakdown of the net asset position of the defendant). The plaintiff argued that the defendant’s assets would qualify as matrimonial assets within the meaning of sub-sections (a) and (b) of s 112(2)(10) of the Charter. Therefore, the Deed should not be accorded weight as her share of the matrimonial assets under the Deed was a paltry 0.62% of his known wealth of $6.6m (according to the plaintiff’s tabulation).[note: 15] 55     I make two points. First, the marriage was a very short one and a binding separation agreement (ie, the Deed) was signed five months after the parties lived apart. By the terms of the Deed, the parties were to live separate lives as cl 1.1 made clear. The intention was to file for divorce after three years separation. It was also evident from the Deed that the parties no longer intended to participate in the defendant’s accumulation of wealth. Consequently, cl 5.1 set out the parties’ agreement that each party was to retain his/her assets in his/her name. The second point which follows from the first is that the agreement contemplated assets available as at 21 April 2009, the date of the Deed. The defendant was ten years older than the plaintiff and was already a businessman before he married the plaintiff, and it was conceivable that most of his assets were amassed before marriage. Thus, the most valuable asset that would qualify as a matrimonial asset was the matrimonial home, and that was what the parties focussed on discussing in the Deed. 56     In the present case, the parties decided that each party would retain the assets held in their sole names pursuant to cl 5.1. I find this arrangement to be fair as the marriage only lasted for 19 months and the plaintiff made no direct financial contributions in relation to any of the defendant’s assets listed in Annex A (Table 1). The assets held in the respective names of the plaintiff and defendant (except the matrimonial home, which I will go on to discuss) were therefore excluded from division. I repeat, of all the assets, the matrimonial home was the most appropriate asset where the contributions of the plaintiff as a wife and mother to the child of the marriage were likely to be recognised monetarily. I make two points. First, I would not have given weight to the second part of cl 5.2 (see [43] above) if it meant depriving the plaintiff of a share of the matrimonial home where there is evidence of her indirect contributions to the marriage and welfare of the family. Second, the defendant through his counsel conceded at the hearing that $40,000 was for division of matrimonial assets.[note: 16]In other words, notwithstanding the broader position of the defendant in relation to cll 5.1 and 5.2 of the Deed, the defendant through his counsel was willing to concede that the matrimonial home should in principle be the primary asset available for division in these proceedings if there was evidence of the plaintiff’s indirect contributions towards the marriage.[note: 17]Mr Singh also submitted that the matrimonial home, CPF monies of the defendant and a German flat would ordinarily fall in the pool of assets for division. As the principal asset by value would be the matrimonial home with a net value of $1.6m, and the plaintiff made no financial contributions to any of the assets, the sum of $40,000 was not far off the 3% benchmark amount that the court would have given in any case.[note: 18]",
        "Division": "57     I now turn to cl 5.2 read together with cl 3.1 of the Deed. As noted, Mr Singh accepted that the matrimonial home formed the basis for arriving at the amount of $40,000 for the plaintiff’s contributions during 19 months of the marriage. The plaintiff was therefore given about 2.5% of the net value of the matrimonial home based on $1.6m. 58     Is this amount fair and equitable seeing that she was expected under cl 4.1 to be the primary caregiver of an eight month old baby from the date of the Deed to Final Judgment? In other words, the plaintiff’s indirect contributions to the welfare of the child were expected to continue even after the breakdown of the marriage and extend beyond the date of the Deed. I should make clear that the fairness of the monetary figure has to be assessed at the date of the Deed. 59     The present case demonstrates the exact situation described at [53] above. It is clear that the Deed was looking at the indirect contributions of the plaintiff up to the date of the Deed in ascribing the sum of $40,000 and did not take into account the prospective (and continuing) indirect contributions of the plaintiff as a caregiver to the child of the marriage until the point where Final Judgment will be entered. 60     I am of the view that her indirect contributions as described had to be recognised not only from the perspective of the plaintiff caring for the child of the marriage after the Deed but also from the option she was given in cl 4.1 to start a new life with the child in Singapore or in any other country when the needs of the young child are also taken into account under s 112(2)(c) of the Charter. Viewed as such, a sum of $40,000 would not be a fair and equitable division. 61     The defendant in his affidavit explained that the plaintiff did not make any indirect contributions to the marriage. His evidence is that her lackadaisical attitude towards the welfare of the family was a cause of the breakup. While the plaintiff made no direct financial contributions to the marriage, she was nevertheless a homemaker during the marriage and was the caregiver of the child whilst she was living with the defendant and even after the Deed was entered into. Even though the defendant had liberal access to the child and spent a fair amount of time with the child, that fact alone did not detract from the plaintiff’s role in the child’s life. 62     Specifically, the plaintiff stated that after she relocated from Germany to Singapore, she became a housewife and took care of the child after she came along. She highlighted that she took care of the defendant and the household by doing all the household chores, cooking and laundry without the assistance of a domestic helper.[note: 19]She also pointed out that she was the primary caregiver of the child and continued to be the primary caregiver since the time the defendant asked them to leave the matrimonial home. She also highlighted the fact that she sought out part time employment only in order to care for the child.[note: 20] 63     I did not give any weight to the plaintiff’s claim that she assisted the defendant with administrative functions and managing receipts in relation to SS at the end of each quarter.[note: 21]The defendant adduced some evidence to show that he engaged bookkeepers to handle all administrative aspects of his business.[note: 22]Even if the plaintiff assisted in any administrative tasks, this would have been insignificant given her primary role as a caregiver. 64     The plaintiff referred me to the case ofBJS v BJT[2013] 4 SLR 41(“BJS v BJT”). In that case, the parties separated after a two-year marriage and obtained adecree nisifour and a half years later. The parties separated five months after the only child of the marriage was born. The court there awarded the wife 10% of the matrimonial assets and an additional 5% for an adverse inference. The court noted the significant indirect contributions of the wife; apart from caring for the child of the marriage, the wife acted as a nominee and director and shareholder of one of the husband’s company in a difficult and uncertain time, allowing the husband to create an environment where his business could continue. 65     However, the factual matrix inBJS v BJTis entirely distinguishable from the present facts. First, in that case, the parties did not agree pursuant to a matrimonial agreement that each party would retain the assets held in their own names. Second, the wife there contributed extraordinarily to the business of the husband. No such extraordinary contribution on the part of the plaintiff can be identified in the present case. Third, the husband’s non-disclosure of assets inBJS v BJTprejudiced the wife, as the wife there did not enter into a matrimonial agreement and hence could without impediment obtain a share of any asset that is considered a “matrimonial asset” within the meaning of s 112(10) of the Charter. In the present case, the plaintiff agreed pursuant to the Deed that the assets in the defendant’s sole name were to be held by him. 66     I will now highlight two cases of the District Court which the parties claimed to be relevant. 67     In the case ofBME v BMF[2013] SGDC 321, the parties were married for four years and had two children. The court there had to assess the indirect contributions of the wife who was (for a large part of the marriage) the primary caregiver of the children. The court held at [22] that the wife was entitled to 7.3% of the matrimonial assets for her indirect contributions. 68     Similarly, inIO v IP[2005] SGDC 45 (“IO v IP”) the parties were married for three years and had one child. The court suggested at [18] that there were no indirect contributions of the wife to speak of as the marriage was short but awarded the wife 5.2% of the matrimonial assets to take into account the needs of the child. The court there also noted at [21] that the wife had been unreasonable in issues relating to the division of the HDB flat and access of the child. In my view, the 5.2% there awarded ought to relate to the indirect contributions of the wife in her role as a mother. The fact that the husband maintained the wife and child throughout the marriage cannot negate the indirect contributions of the wife to the marriage. 69     I note that the divorce in the present case was, as inIO v IP, initially filed about three years after the marriage. Relatively speaking, the plaintiff, unlike the wife inIO v IPhas acted reasonably in these proceedings. On the other hand, the plaintiff did not contribute so significantly to the marriage so as to receive 10% of the net value of the matrimonial home like the wife inBJS v BJT(at [64] above). 70     A just and equitable amount would be in the region of 6% of the net value of the matrimonial home (rounded up to $100,000). In sum, while the Deed is upheld insofar as the parties are entitled to retain the assets they each hold in their own name, for the plaintiff’s indirect contributions, the defendant is to pay her $100,000 upon Final Judgement of Divorce. The amounts already paid to the plaintiff pursuant to cll 3.1 and 3.2 of the Deed are to be deducted from this sum of $100,000. 71     My orders in relation to the division of the matrimonial home vary cl 3.1 as follows: 1    The defendant shall pay the plaintiff upon Final Judgment of Divorce a sum of $100,000 for her contributions towards the marriage and welfare of the child of the marriage. 2.    The payments already made to the plaintiff pursuant to clauses 3.1 and 3.2 of the Deed are to be deducted from the $100,000.",
        "Maintenance": "72     The defendant was not required to pay the sum of $5,000 towards the accommodation and maintenance to the plaintiff under the Deed after 14 November 2011. As such, the plaintiff applied and obtained an order for interim maintenance in the sum of $2,950 per month as maintenance for the child and the child’s share of the rental expenses. The defendant has made monthly payment of $2,950 since December 2011. 73     Under the Deed, the defendant has agreed to pay maintenance for the child in the sum of $1,500 per month with effect from 15 November 2011. The plaintiff now seeks a monthly sum of approximately $6,000, a breakdown of this figure is as follows: (a)     $3,150 being rent; (b)     $1,112.50 being 50% share of the household expenses estimated at $2,225. (c)     $1,677 being the child’s personal expenses. 74     The plaintiff is not seeking any maintenance for her personal expenditure.[note: 23]However, she argues that she is not able to afford to pay her share of half of the rent required under the interim maintenance order, and now wants the defendant to be responsible for full rent.",
        "Maintenance for the plaintiff": "75     The court has to consider the factors in s 114(1) of the Charter and all circumstances of the case in deciding whether the wife should be awarded maintenance. However, as noted by the Court of Appeal inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 at [12], the principle of financial preservation of the wife provides overarching guidance to a court in deciding what a reasonable amount of maintenance might be. 76     As stated, the defendant provided accommodation and maintenance to the plaintiff for three years from the time the parties separated pursuant to cl 3.5 of the Deed. Clause 3.5 of the Deed had the effect of financially preserving the plaintiff for a period of three years. I note that the plaintiff has currently obtained part-time employment. On her own case, she is able to take care of her personal expenses and is therefore not asking any maintenance in relation to her personal expenses. I will deal with her application for accommodation when considering maintenance for the child.",
        "Maintenance for the child and rent": "77     The Deed provides for maintenance for the child in cll 3.6 to 3.9. The plaintiff seeks a sum of about $2,790 for the personal and household expenses of the child. There is a separate claim for rent. 78     In my view, the sum of $2,790 is excessive for a child of 7 years old. I am minded to give effect to cl 3.6 of the Deed where the defendant has promised to pay maintenance of $1,500 per month for the child. The adjustment that I am prepared to and will make is for the monthly payment of $1,500 for the child’s maintenance. 79     I now come to the separate matter of accommodation for the child. The plaintiff is asking the defendant to be fully responsible for the child and the plaintiff’s accommodation. 80     InNI v NJ[2007] 1 SLR(R) 75, VK Rajah JA cited (at [16])Wong Amy v Chua Seng Chuan[1992] 2 SLR(R) 143 where MPH Rubin JC (as he then was) observed (at [40]) that the court would be minded to ensure that there is adequate provision made for the support and accommodation of the children of the marriage in exercising its discretion to determine a reasonable amount of maintenance. 81     The defendant under cl 3.4 of the Deed would only need to pay the rental of the plaintiff and the child for three years from the separation of the parties. However, his obligation to pay for the child’s accommodation was extended by the interim maintenance order where the rent was shared between the defendant and the plaintiff. I agree with the District Judge’s decision that in principle the defendant has to provide accommodation for the child and bear one half of the rent of an accommodation. The young child would still need accommodation after November 2011 and the defendant has to provide accommodation for the child of the marriage. I was not disposed to accept the defendant’s suggestion that cheaper accommodation be taken up. The child has started formal education this year in a school that is close to the rented apartment and the defendant’s home. 82     As for the plaintiff’s application for accommodation, this is akin to asking for maintenance even though it is appreciated that as the child’s primary caregiver she would have to stay under the same roof as the child. The question is whether the monthly rent should be paid entirely by the defendant or shared between the plaintiff and the defendant. 83     Having regard to factors like the short duration of the marriage, the age of the parties and the plaintiff’s earning capacity, I reached the conclusion that the rental for the child and plaintiff’s accommodation is to be shared equally between the defendant and the plaintiff. Let me explain. 84     As stated, the defendant provided accommodation and maintenance to the plaintiff for three years from the time the parties separated pursuant to cl 3.5 of the Deed. Clause 3.5 of the Deed had the effect of financially preserving the plaintiff for a period of three years to cope with the adjustments that come with a failed marriage. Since living apart, the plaintiff found part-time employment. 85     The defendant is already established in Singapore; he has a business and is financially better off and has savings. In contrast, the plaintiff has confined herself to part-time work as an estate agent and does some informal work as an interpreter. Compared to the defendant, the plaintiff’s earning capacity is distinctly poorer. However, that is not to say that there are no prospects of financial improvement for the plaintiff who is in her late thirties. Furthermore, the plaintiff had said that she took on part-time work in order to care for the child (at [62]). I note that the plaintiff has now a live-in-maid which means that there is an adult in the household to keep an eye on the child after school. The plaintiff has to now exert herself to work more hours and even take on full time employment to increase her income by earning as much as she reasonably can. 86     The defendant paid a monthly sum of $2,790 under the interim maintenance order. By my order, which takes effect from 1 July 2015, the plaintiff will receive a monthly sum of $3,075, a breakdown of this figure is as follows: (a)     $1,500 for the child’s maintenance; and (b)     $1,575 being half share of the current rent of $3,150. 87     A related matter concerns the increments of the child’s maintenance based on the child’s age as she grows. This is stipulated in cll 3.6 to 3.9 of the Deed and the defendant has asked for the increments to be part of the ancillary orders. It is clear that the court has the power to vary any maintenance agreement/order. As noted by Phang JA inTQ v TRat [67], a court would be especially vigilant in enforcing agreements that are not in the best interests of the child. 88     Therefore, there is no need to tinker with the relevant clauses for now. The adequacy of the child’s maintenance can be considered whenever there are changes to her circumstances, such as her personal needs, schooling and educational needs, insurance and cost of living. 89     Clause 3.10 of the Deed provides for medical insurance coverage for the child. I am the view that the defendant should also provide medical insurance for the child as stated in cl 3.10 of the Deed.",
        "Custody, care and control and access": "90     The issue of custody and care and control was contested by the parties even before the divorce proceedings commenced. This happened despite the Deed which provided for joint custody with care and control to the plaintiff. 91     Both the defendant and the plaintiff applied for sole custody and care and control of the child under the GIA before divorce proceedings were filed. District Judge Shobha Nair dismissed the defendant’s application and made the following orders in relation to the plaintiff’s application:[note: 24] (a)     The plaintiff and defendant be granted joint custody of the child with care and control to the plaintiff; and (b)     The defendant is to have liberal access at least three times a week on Monday, Wednesday and Friday from 1pm to 6pm and on weekends on Sunday from 8am to 8pm. 92     Both parties appealed the decision of the District Judge. On appeal, the High Court Judge did not vary the terms on custody or care and control but ordered that the access terms be varied in the following manner:[note: 25] (a)     Tuesday, Wednesday and Friday from 1pm to 8pm; (b)     Sunday from 10am to 8pm; and (c)     Overnight access on every second Saturday from 7.30pm to Sunday 8pm. (“the GIA Order”) 93     The plaintiff was satisfied with the GIA Order and asked that it be allowed to stand save that the access terms be amended to take into account the primary school schedule of the child. The defendant on the other hand wanted the Court to consider the issue of care and control afresh, as he now wants shared care and control of the child. 94     As a preliminary point, the parties argued an important and hitherto unconsidered question of lawviz, the effect of an order made under the GIA on ancillary proceedings. At the hearing on 22 January 2015, Ms Loo argued that the matter wasres judicataand the defendant was thus estopped from raising any argument about shared care and control in these proceedings (“theres judicatapoint”). The defendant, on the other hand, argued that any order made under the GIA in contemplation of divorce was an interim and not a final order.[note: 26]The defendant relied on ss 124 to126 of the Charter. I adjourned the hearing for Ms Loo to research theres judicatapoint. 95     At the adjourned hearing, Ms Loo dropped theres judicatapoint and accepted that a court hearing ancillary matters (“the Ancillaries Court”) has the power to “reopen the issue of care and control even if there was a decision on the same under the GIA”.[note: 27]She argued that the court should be slow to change the terms of the GIA as there was no reason to do so. The plaintiff has had care and control of the child from the time she was born and the child has thrived under the plaintiff’s charge. There was no evidence to show a material change of circumstances.[note: 28] 96     In this regard, the plaintiff referred to s 128 of the Charter which provides as follows: Power of court to vary order for custody 128.  The court may at any time vary or rescind any order for the custody of a child on the application of any interested person, where it is satisfied that the order was based on any misrepresentation or mistake of fact or where there has been any material change in the circumstances. 97     As stated, the defendant relied on ss 124 to 126 of the Charter which provides as follows: Custody of children 124.  In any proceedings for divorce, judicial separation or nullity of marriage, the court may, at any stage of the proceedings, or after a final judgment has been granted, make such orders as it thinks fit with respect to the welfare of any child and may vary or discharge the said orders, and may, if it thinks fit, direct that proceedings be commenced for placing the child under the protection of the court. Paramount consideration to be welfare of child 125.—(1) The court may at any time by order place a child in the custody of his or her father or his or her mother or (where there are exceptional circumstances making it undesirable that the child be entrusted to either parent) of any other relative of the child or of any organisation or association the objects of which include child welfare, or of any other suitable person. (2)    In deciding in whose custody a child should be placed, the paramount consideration shall be the welfare of the child and subject to this, the court shall have regard — (a)    to the wishes of the parents of the child; and (b)    to the wishes of the child, where he or she is of an age to express an independent opinion. Orders subject to conditions 126.—(1) An order for custody may be made subject to such conditions as the court may think fit to impose and, subject to such conditions, if any, as may from time to time apply, shall entitle the person given custody to decide all questions relating to the upbringing and education of the child. … 98     Analysing s 124 of the Charter, it can be seen that once the parties are within the matrimonial jurisdiction of the court, the court is entitled to make any order or vary any previous order in relation to the custody, care and control and access of the child. Therefore, it is clear that the discretion of the Ancillaries Court is not fettered by any previous order made under s 5 of the GIA. Let me explain. 99     First, the Charter requires the court to exercise a broader statutory discretion in considering issues related to the child in the ancillaries proceedings. While s 3 of the GIA tracks the wording of the preamble to s 125(2) of the Charter, s 125 of the Charter is broader than the GIA as it allows the Ancillaries Court to consider the wishes of the child. Further, the court exercising the powers under the Charter also has a broader discretion pursuant to s 126 of the Charter to impose conditions in any order it makes. This mechanism for imposing conditions is absent in the GIA. Therefore, in order to not deny the parties and the child of the broader discretion conferred to it pursuant to the Charter, the Ancillaries Court would have to consider the issues of custody, care and control and access afresh. All in all, because of the broader discretion afforded to the Ancillaries Court under the Charter, it is in the best position to consider all matters relating to the custody, care and control and access of the child afresh having regard to the wishes of the child (where applicable) and make an appropriate order (with any further conditions). Second, a GIA order made in contemplation of a divorce can only have an interim effect as it does not take into account the fact that the parties would eventually be parting ways and does not allow a court to assess holistically the interaction between maintenance, the status of the matrimonial assets and the custody, care and control and access of a child. The Ancillaries Court is thus in the best position, with all the necessary information and evidence, to make an order that ensures the child’s interests are treated as and made paramount. 100    It is for these cumulative reasons that the Ancillaries Court should consider the matter afresh and make an order under the Charter. 101    There is still a need to procedurally rationalise the pre-existing order made under the GIA when the Ancillaries Court decides to make an order under the Charter. This can easily be done by an express order made in ancillaries that the GIA order is superseded by the Ancillaries Court’s order on the issue of custody, care and control and access. 102    I also do not accept the plaintiff’s argument that the Ancillaries Court should be slow to change the terms of an order made under the GIA unless evidence is adduced to show a material change of circumstances; the requirements in s 128 of the Charterviz, the need to show misrepresentation, mistake of fact or material change in circumstances, only need to be satisfied when a party is seeking to vary any order made under the Charter. In any case, I note that the variation or revocation of orders made under the GIA is governed by s 5 of the GIA which does not impose any of the requirements found in s 128 of the Charter. 103    While I make clear that there is no burden on the part of any party to show a material change of circumstances in order for the Ancillaries Court to consider the matter afresh, I must add that in most cases, it will be not uncommon to find that the Ancillaries Court would make orders that track those previously made under the GIA unless there are good reasons not to do so. Having lived with one parent for an appreciable length of time (in this case, seven years), the child is generally used to a stable living environment that does not warrant a change in the primary caregiver. 104    In the current proceedings, the defendant is seeking shared care and control of the child to the parties.[note: 29]The definition of the term “shared care and control” was articulated by the High Court inAQL v AQM[2012] 1 SLR 840 (“AQL v AQM”) at [8] in the following manner: … In my opinion, an order for shared care and control means that the child spends time living with each parent, who then becomes the child’s primary caregiver for the duration that the child lives with him (or her). The right to make the day-to-day decisions on the upbringing of the child therefore rests with the parent the child is presently living with. In the context of shared care and control, it becomes meaningless to speak of “access”. This is because the child effectively has two homes and two primary caregivers. 105    The defendant argued that shared care and control should be ordered as the child would benefit by having both the parents in her life.[note: 30]The defendant also submitted that there would be little difference between the home environments as the parties live near each other[note: 31]. He also alleged that the plaintiff has not been a good mother. To that end, he highlighted certain instances where the plaintiff had not adequately monitored the personal hygiene of the child.[note: 32]I pause here to observe that it is curious that the defendant would be content in asking for shared care and control if the plaintiff was indeed such a bad mother. 106    The plaintiff, on the other hand, argued that the orders made by the Court should track the GIA Order for a number of reasons.[note: 33]First, the child was well-adjusted to the current living arrangements and with the liberal access he enjoys, the defendant spends a fair amount of time with the child. Second, the child has moved on to primary school and should not be subject to any uprooting or disruption. Third, the plaintiff also pointed out that the relationship between herself and the defendant was strained to the extent that it was not possible for them to achieve a level of joint parenting required for a shared care and control arrangement. 107    As noted by the High Court inABW v ABV[2014] 2 SLR 769 (“ABW v ABV”) at [20], “[c]ontinuity of arrangements or stability is an important factor for the emotional well-being of a child.” The court inABW v ABValso helpfully summarised at [23] the factors apart from the continuity of living arrangements that a court should take into account in making orders in relation to the child: (a)    the need for both parents to have an involvement in the child’s life; (b)    which parent shows the greater concern for the child; (c)    the maternal bond; (d)    the child’s wishes; and (e)    the desirability of keeping siblings together. 108    The weight accorded to any of these factors would ultimately depend on the facts of each case. In the present case, I am of the view that continuity and workability of the current living arrangements is a very important consideration in determining an appropriate order to make in relation to care and control because the child has just transitioned to primary education. 109XX v XY[2008] SGDC 253 was an authority relied on by the defendant. In that case, the District Court pointed out, rightly in my view, that that a shared care and control arrangement may not be practical once the child commences formal education. I also note that the defendant was initially seeking shared care and control at the point where the child was in kindergarten. As the defendant recognised in his submissions, the child, as she grows up, “would become more occupied with school, friends and extra-curricular activities”[note: 34]. It would be wholly impractical to layer the complexity of the child’s life with a shared care and control arrangement in the present case as she has just moved on to primary one and would have to deal with many new issues from transitioning into primary education. 110    While there might naturally be disagreement among the parties as to their different parenting methods and style, I am of the view that care and control should remain with the plaintiff with liberal access to the defendant. 111    Therefore, the GIA Order (which is temporal in nature) is superseded by my order in these ancillary proceedings that there should be joint custody of the child with care and control to the plaintiff and liberal access to the defendant. The parties are to work out the terms of access, taking into account the schedule of the child. If required, they may attend before me to record in a court order their agreement on access.",
        "Conclusion": "112    My orders for the division, maintenance and custody care and control are set out in [71], [86] and [111] above. The parties are to carry out the terms of the Deed in the light of the orders made here. My order in [86] takes effect from 1 July 2015. As liberal access is granted to the defendant, I have in [111] left it to the parties to agree on an access schedule that works around the child’s school timetable. 113    I further order that each party is to bear their own costs in relation to these proceedings.",
        "Annex A": "Table 1: Net AssetsValue of Assets in defendant’s name as at July – August 2012 unless stated otherwiseS/No.DescriptionOwner(s)Value1The PropertyHusband$2,000,0002German Property (Purchased in June 2008)Husband$277,825.643Sale Proceeds of Singapore Property No. 2 (Option to purchase executed before marriage on 2 April 2007)Husband$909,056.054Sale Proceeds of YachtHusband$125,9135Car (Mercedes Benz)Husband$125,0006MotorcycleHusband$12,0007Standard Chartered Account No. XXXX5659Husband$58,616.428DBS Account No. XXXXXXXX226Husband$25,385.609DBS Account No. XXXXXXX233DFP$50,000 (As of January 2013)10Standard Chartered Account No. XXXXXXX652Husband$353,868.5111Standard Chartered Account No. XXXXXXX072Husband$1,155,696.7912Degussa Bank Account No. XXX203Husband$84,793.8313Degussa Bank Account No. XXXXXX094Husband$61,961.1214DBS USD Account No. XXXXXXX915SS/Husband$52,837.5815DBS USD Account No. XXXXXXXXX022SS/Husband$1,096,579.2716DBS Vickers Account No.XXXX645Husband$222,347.46 (as of 30 September 2012)17Shares linked to Degussa Bank Accounts(see s/no. 9-10 above)Husband$148,407.65(as of 31 December 2012)181,790 shares in GPL (“GPL shares”)Husband$50,0001950,000 shareholding in AFHusbandNot provided20150,000 ordinary shares in IILHusband$93,950.3621CPF Ordinary AccountHusband$154.92CPF Medisave Account$19,998.08Special Account$350.61Total$6,924,743.00Less Outstanding liability from mortgage of Property as of August 2013($402,134.82)Net Assets$6,522,608.07    [note: 1]Defendant’s affidavit of 31.3.14 at p 18. [note: 2]Defendant’s Core Bundle (“DCB”), p 9. [note: 3]DCB 14-15. [note: 4]DCB 15-16. [note: 5]Plaintiff’s 4thAffidavit for AM hearing, p 89. [note: 6]Plaintiff’s 4thAffidavit for AM hearing, p 112. [note: 7]Plaintiff’s affidavit dated 21.4.10, para 8. [note: 8]Plaintiff’s 1stAffidavit for AM hearing (“PAAMI”), para 77. [note: 9]Plaintiff’s Reply Submissions filed on 16.3.15 (“PRS”), para 19. [note: 10]Plaintiff’s written submissions dated 9.10.14 (“PWS”), para 46. [note: 11]Defendant’s affidavit dated 26.12.13, para 25. [note: 12]PWS, para 20. [note: 13]PWS, para 40. [note: 14]PRS, para 16. [note: 15]Plaintiff’s affidavit dated 1.4.14, para 44. [note: 16]Notes of Arguments of 9.10.14. [note: 17]Defendant’s Written Submissions dated 19.8.14 (“DWS”), paras 61 and 79. [note: 18]DWS, para 64; Notes of Arguments of 22.1.15. [note: 19]PAAM1, paras 57-59. [note: 20]PAAM1, para 67. [note: 21]PAAM1, para 60. [note: 22]Defendant’s Affidavit dated 6 January 2014, p 112. [note: 23]PWS, para 53. [note: 24]Defendant’s Further Submissions dated 9.3.15 (“DFS”), para 4. [note: 25]DFS, para 6. [note: 26]DFS, para 15. [note: 27]PRS, para 6. [note: 28]PRS, paras 6-7. [note: 29]DWS, para 19. [note: 30]DWS, para 25. [note: 31]DWS, para 31. [note: 32]DWS, para 36. [note: 33]PWS, para 75. [note: 34]DWS, para 34."
    }
}