{
    "case_title": "Lian Kok Hong\n      v\n      Lian Bee Leng and another",
    "ncitation": "[2015] SGHC 205",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This suit relates to the estate (“the Estate”) of the late Mr Lian Seng Peng (“the Testator”) and arises from an embarrassment of riches in the area of testamentary dispositions executed by him. 2       On 21 May 2013, the defendants applied to court for a Grant of Probate in respect of the Testator’s will dated 18 December 2010 (“the 18 December 2010 Will”). On 2 August 2013, the plaintiff filed a caveat against the defendants’ application for the grant of probate. Subsequently, on 16 December 2013, the plaintiff filed a Citation against the defendants stating that he held the Testator’s last Will and Testament dated 10 August 2012 (“the August 2012 Will”) and that the 18 December 2010 Will had been revoked under the terms of the August 2012 Will. The plaintiff then commenced this action against the defendants seeking to propound the August 2012 Will.",
        "The Background": "",
        "The Testator and his family": "3       The Testator was born in Longyan, China. He moved to Singapore at a young age but kept in contact with Longyan, frequently visiting and making donations to organisations in his hometown as well as giving money to his friends and relatives there. By all accounts, he was a generous man, a loving husband and a caring father who was liked by everyone around him. He passed away on 10 December 2012 at the age of 93. 4       Mdm Soh Seat Hwa (“Mdm Soh”) is the widow of the Testator. They were married for 70 years. For decades prior to his death, the Testator and Mdm Soh resided at 30 Jedburgh Gardens (“30 Jedburgh”), the property which forms the bulk of the Estate and which Mdm Soh continues to reside in to this day. 5       The Testator had acquired 30 Jedburgh sometime in the 1970s. Apparently, he did not take a loan for the purchase and the property was mortgage-free until many years later when he mortgaged it to secure a bank loan given to the plaintiff or his business. This mortgage, in the principal amount of $1.5m, remained registered against 30 Jedburgh until 2014 when the plaintiff paid off the loan. 6       The plaintiff is the only son of the Testator and the youngest of the Testator’s three children. He runs Prime Products Pte Ltd (“Prime”), a business that he started in 1986 with the assistance of the Testator. The Testator was a director of Prime, though he was not involved in the day-to-day running of the business. The plaintiff is married and has two sons. He and his family live some distance away from 30 Jedburgh but the plaintiff visited his father regularly, at least once a week. In the later years, however, he was not on cordial terms with his mother and sisters. 7       The first defendant is the older sister of the plaintiff and is the second of the Testator’s children. She lives a few doors away from 30 Jedburgh and was close to both parents, spending much time taking care of them. The second defendant is the Testator’s granddaughter by his elder daughter, Mdm Lian Bee Tin (“Mdm Lian”). In total, the Testator had six grandchildren and three great-grandchildren (all of whom are the second defendant’s children). 8       Prior to 10 December 2012, the Testator, Mdm Soh, the plaintiff, Mdm Lian and the first defendant were equal shareholders of Lian Seng Peng & Sons Pte Ltd (“LSPS”), a company which the Testator started in 1978. LSPS is currently disposing of its assets and when this is done it will be wound up.",
        "Background to the dispute": "The testamentary documents and the Testator’s health 9       The August 2012 Will is one of a series of testamentary documents that the Testator wrote in Chinese in 2012. I am using the word “testamentary” to indicate the Testator’s apparent intentions in drafting these documents but I must point out that most of them were not executed in the manner required to make them valid wills and some of them were not even signed by the Testator himself. 10     As the August 2012 Will is at the core of this dispute, I set out its terms (post-amendment, as translated) in full below: Former will[s] made by the lawyer[s] and so on are revoked. According to the new will, [the proceeds] from the sale of stocks and so on and the (after the winding up of the company) $780,000 owed by Kok Hong shall be distributed to the paternal and maternal grandsons and granddaughters who shall each get $100,000; total $600,000. After our death as husband and wife, the proceeds from the sale of the house at No. 30 and all the cash shall constitute the Lian Seng Peng & Soh Seat Hwa Charity Fund from which $1 million shall be donated to Tong Chai Medical Institution. RMB 5 million shall be remitted to my hometown and donated to No. 4 Middle School of Xinluo District for extension of the school and to provide financial assistance. 200,000 ([unintelligible]) shall be donated to poor overseas Chinese returnees in Xinluo District. A large television set and a CD player shall be donated. RMB 200,000 shall be donated to the Shexing Village Activity Centre for the Elderly. RMB 200,000 shall be donated to the welfare house for disabled children. Do not hold religious rituals after my death. The cremated remains are to be scattered into the ocean. The aforesaid matters and matters not set out above shall all be handled by Kok Hong. It should be noted that prior to the amendment, this will gave $50,000 to each of the great-grandchildren. 11     The plaintiff submits, and this is not disputed by the defendants, that the last sentence appoints the plaintiff as the executor of the will notwithstanding that the word “executor” is not expressly used. The plaintiff’s submission is based on a passage from John Ross Martyn and Nicholas Caddick,Williams, Mortimer and Sunnucks on Executors, Administrators and Probate(Sweet & Maxwell, 19th Ed, 2008) (“Williams on Probate”) at p 32, to the effect that if a testator by any word or description commits to any particular person the rights appertaining to an executor it is the same as if that person was expressly appointed as executor even though that word is not used. As the defendants do not dispute that in this will the Testator intended to appoint the plaintiff as executor (on the contrary, they rely on such appointment as evidence of the irrationality of the will), I agree that the August 2012 Will should be treated as if it nominates the plaintiff as sole executor of the Estate. 12     The date of the will was originally stated to be 10 June 2012 but on 10 August 2012 the date was amended to 10 August 2012. The Testator’s signature lies next to the amendment (“the First Signature”), and another of the Testator’s signatures (in different ink) lies below it (“the Second Signature”). The testamentary documents made before 2012 13     A number of documents expressing the Testator’s testamentary intentions were executed by him prior to 2012. The earliest of these documents was made by the Testator in 2004 (“the 2004 Will”). This was prepared by his then solicitor, Mr Warren Tan Poh Meng from M/s Warren Tan & Co (“Mr Tan”), and was executed by the Testator in 30 Jedburgh in the presence of two witnesses. I am told that under the 2004 Will, the Testator bequeathed all of his assets to his grandchildren, leaving nothing to his children. No copy of the 2004 Will was tendered to the court. It was not denied by the plaintiff that he demanded to see the 2004 Will sometime in 2008. He went to 30 Jedburgh and took away the 2004 Will, only returning it to the Testator after the latter had insisted on its return. 14     The next document that was brought to the court’s attention was dated 19 November 2008 (“the 19 November 2008 Will”). The 19 November 2008 Will was not prepared by lawyers and its execution was witnessed solely by one Mr Goh Tay Sin (“Mr Goh”), an employee of Prime. It therefore failed to fulfil the formal requirements for a will. According to the plaintiff, the Testator wrote out the 19 November 2008 Will and asked him to get one Mr Zhu Jintian (“Mr Zhu”) to type it out in Mandarin. It was the typewritten version of the will that was subsequently executed. The 19 November 2008 Will was, apparently, the first time that the plaintiff became involved in the Testator’s testamentary activities. 15     The plaintiff said that he subsequently realised that a will was supposed to be witnessed by two witnesses and that therefore the 19 November 2008 Will was not valid. He then asked Mr Zhu to type out another will which had been handwritten by the Testator. When it was ready he took it to the Testator who signed it. This will was dated 24 November 2008 (“the 24 November 2008 Will”). The 24 November 2008 Will appears to be a modification of the 19 November 2008 Will, retaining many of the same terms (albeit with amendments as to the figures). After the Testator signed it, the plaintiff took the will to his office and procured the signatures of Mr Goh and another employee as witnesses. Nevertheless, as the plaintiff later learnt from one of his lawyers, Mr Nair of Messrs Derrick Wong & Lim BC LLP, this was not a valid will as the witnesses were not present at the time it was executed by the Testator. 16     Under the terms of both the 19 November 2008 Will and the 24 November 2008 Will, a substantial amount (between 35% and 57%) of the Testator’s assets would be donated to “No 4 Middle School”, a school in his hometown (“No 4 Middle School”), as well as to various charitable institutions in that town. 30 Jedburgh would be bequeathed to the plaintiff’s sons upon the Testator’s and Mdm Soh’s passing. The 24 November 2008 Will purported to revoke the 2004 Will. 17     On 30 July 2010, the plaintiff took the Testator to Mr Nair’s office, where the Testator executed another will (“the July 2010 Will”) prepared by Mr Nair. It should be noted that prior to this date, the Testator had not spoken with Mr Nair and the instructions for the will had been given to the lawyer by the plaintiff. Under the terms of this will, the plaintiff would be appointed the sole executor of the Testator’s estate and 30 Jedburgh would be bequeathed to the plaintiff’s sons on condition that Mdm Soh be allowed to live in the property free of rent until her demise. The Testator’s shares in listed companies and the moneys in his bank accounts would be liquidated and distributed to his grandchildren, with the second defendant and her children getting $16,000, the other grandchildren getting $10,000 each and the remainder going to the plaintiff’s sons. Twenty percent of the Testator’s shares in LSPS would be given to the plaintiff and the remainder of his Estate to Mdm Soh. No provision was made under the July 2010 Will for the first defendant and Mdm Lian nor was there any provision for donations to charitable organisations. All former wills and testamentary dispositions were revoked. 18     According to the first defendant, in about September 2010, the Testator complained to her that the plaintiff had taken him to a law firm to make a fresh will but had refused to give a copy of the will to him. 19     On 1 December 2010, the Testator signed a declaration revoking all wills that he had made prior to that date, including the July 2010 Will. This was witnessed by Mdm Soh alone. Subsequently, on 3 December 2010, the Testator executed another will (“the 3 December 2010 Will”) prepared by Mr Tan. Under this will, the defendants would be made the executrices and trustees of his Estate and 30 Jedburgh would be given to Mdm Soh absolutely. The remainder of his Estate would be held on trust for the benefit of his six grandchildren in equal shares. 20     On 18 December 2010, the Testator and Mdm Soh both executed wills prepared by Mr Tan. Both wills were witnessed by Mr Tan and one Dr Liew Bee Leng (“Dr Liew”), the Testator’s family doctor. The wills were executed in Dr Liew’s office in the presence of the first defendant. Under the 18 December 2010 Will, the defendants would be appointed as executrices and trustees of the Estate and 30 Jedburgh would be given to Mdm Soh absolutely in the event she survived him by 30 days. The terms of Mdm Soh’s will mirrored the 18 December 2010 Will. Like in the 3 December 2010 Will, the remainder of the Testator’s assets were to be held on trust for the benefit of his grandchildren in equal shares, and his children would not receive anything. All former wills and testamentary dispositions were revoked. 21     In May 2011, the Testator signed another document. This was not a will but a declaration of trust which gave full power to the plaintiff to distribute the proceeds of sale of the Testator’s shares to the plaintiff’s children, at his sole discretion, upon the Testator’s demise. This document was witnessed by Mr Nair and the Testator signed it in the latter’s office, having been taken there by the plaintiff. Shortly thereafter, the Testator wrote a note to revoke the declaration. 22     In June 2011, the Testator was hospitalised for a week because he was experiencing serious breathing difficulties. The Testator had only one functioning lung. By then, he was also on medication for a heart condition. Testamentary documents made in 2012 23     All the testamentary documents made in 2012 were handwritten by the Testator in Chinese. According to the plaintiff, at the beginning of 2012, he wrote out two drafts for his father but neither was fully acceptable and the Testator wanted to make many changes. Therefore, the plaintiff told him to write out his own wills. This the Testator did with enthusiasm and that year he produced many drafts, some dated, some not. 24     The first in the 2012 sequence of dated handwritten testamentary documents is a document dated 23 February 2012. Under the terms of this draft will (which was not executed and is not fully legible), 95% of the proceeds from the sale of the Testator’s stocks and his cash as well as 30 Jedburgh, but not including the sums of $1.5m and $780,000 that were purportedly owed to him by the plaintiff, would be shared among his grandchildren upon the deaths of Mdm Soh and himself. Each of his great-grandchildren would get $30,000. A sum of $2.05m would be donated to the Long Yen Hui Kuan (the Longyan Clan Association). It is unclear as to whether Thong Chai Medical Institution was intended to be a beneficiary. It is also unclear to whom another $1m was intended to be bequeathed. All prior wills made by lawyers would be revoked. 25     On 31 March 2012, the Testator fell in the kitchen due to a giddy spell. In April 2012, the Testator was hospitalised again, this time for six days, due to his breathing difficulties. It was discovered that in addition to his chronic lung problem and weak heart, he also had severe hypothyroidism. He was discharged on 25 April 2012. 26     The Testator’s worsening health condition did not affect his production of testamentary documents. The court was shown a draft will dated 20 May 2012 (“the May 2012 Will”). Under the terms of the May 2012 Will, over $1m of the Testator’s assets with the $780,000 purportedly owed to him by the plaintiff would be distributed among his grandchildren and each of his great-grandchildren would get $50,000. A sum of $1m from the proceeds from the sale of 30 Jedburgh upon the deaths of Mdm Soh and himself would be donated to Thong Chai Medical Institution. From the balance, a sum of $1m would be remitted to his hometown and donated to the “Federation of Charities”. Another $1m would be donated to No 4 Middle School for an extension to the school building to be built. The annual interest from the “Federation of Charities” would be donated to the elderly. There was also some reference to donations to a school for deaf-mutes, a home for the aged and an orphanage. All wills made by lawyers would be revoked. 27     In chronological terms, the next testamentary document was the document that became the August 2012 Will. According to its original dating, this will was handwritten by the Testator and signed by him alone without witnesses on 10 June 2012. The plaintiff said that the Testator gave it to him on or about that date and asked him to arrange for a proper execution. The plaintiff then took the document back to his office to keep safe until he could make arrangements for the execution. 28     The next dated testamentary document, dated 30 June 2012 (“the June 2012 Will”), provided that $1.35m of the proceeds from the sale of the Testator’s shares and the $780,000 owed to him by the plaintiff would be distributed among the Testator’s grandchildren and great-grandchildren. Upon the deaths of Mdm Soh and the Testator, 30 Jedburgh would be sold and the proceeds used to set up two charity funds, one in the Testator’s and his father’s joint names and the other in the Testator’s and Mdm Soh’s joint names, from which $1m would be donated to Thong Chai Medical Institution. RMB 1m would be remitted to the first defendant’s bank account in China to be used as a charity fund for the benefit of the Testator’s hometown, with the first defendant and “Li Li” (which name appears to refer to the Testator’s niece in China, Ms Lian) having the discretion to administer the funds. The annual interest from the Federation of Charities would be given to the poor and the remainder of the proceeds from the sale of 30 Jedburgh would be shared amongst the plaintiff, the defendant and Mdm Lian. All prior wills “made by the lawyer[s] and handed over to [the plaintiff]” would be revoked. The Testator signed this will but its execution was not witnessed. 29     In July 2012, the Testator was started on home oxygen therapy. Between 20 and 23 July and again between 2 and 5 September 2012, the Testator was in hospital again. 30     The final (in terms of apparent date) testamentary document drafted by the Testator was dated 12 December 2012 (“the December 2012 Will”), a date that fell two days after his death. There is no indication of when it was actually written though it is probable that when he did it, he was in a weakened state making it likely that it was written sometime after August 2012. Many of the terms of the December 2012 Will are incomprehensible, though it is clear that after the death of Mdm Soh and the Testator, a single charity fund (as opposed to two in the June 2012 Will) would be set up in Mdm Soh’s and the Testator’s joint names, from which $1m would be donated to Thong Chai Medical Institution. It appears that some money was intended to be left for the construction of an extension to No 4 Middle School, with the remainder of his assets to be administered for charitable purposes by Mdm Lian, the defendant and the plaintiff. A school for deaf-mutes, a home for the aged and an orphanage (all of which were not specifically named) would each receive $500,000 from the Estate. The undated testamentary documents 31     The parties also tendered a number of documents of a testamentary nature that were not dated or executed. Two of these documents were drafted by the plaintiff and it was his evidence that they were likely to have been drafted in around January 2012 though he could not recall which was first in time. According to the plaintiff, he had provided the drafts to the Testator as he had tired of providing the Testator new wills on request. Each of these drafts contained amendments in the Testator’s handwriting and generally provided for some of the proceeds from the sale of the Testator’s shares to go to his grandchildren and great-grandchildren. 30 Jedburgh would be sold after his and Mdm Soh’s death and the proceeds used to set up a charity fund. One of these documents originally provided that the plaintiff would be responsible for administering the charity fund but was later amended by the Testator himself such that the plaintiff, the first defendant and Mdm Lian would jointly administer the fund. 32     There were also a number of other undated documents that appear to be of a testamentary nature. The terms of these documents vary greatly and are of limited use in discerning the Testator’s mental capacity on 10 August 2012 or the rationality of the August 2012 Will given that no one is able to determine when these documents were made. The signing of the August 2012 Will 33     According to the plaintiff, sometime in 2011, the Testator had informed him of the December 2010 Will and that he wanted to amend it. However, the Testator did not want Mdm Soh and the plaintiff’s siblings to find out about this intention as he was afraid Mdm Soh would object. That had led to the plaintiff’s suggestion that the Testator write his own wills. One of these handwritten wills was the August 2012 Will which had been handed to the plaintiff in June so that he could arrange for execution. According to the plaintiff, he was travelling extensively in July and that is why it took some time for the arrangements to be made. Further, the Testator himself was hospitalised again between 20 and 23 July 2012. 34     On the morning of 10 August 2012, between 10am and 11am, the plaintiff together with Mr Goh, Mr Zhu and three other members of the senior management of Prime (“the Remaining Visitors”) paid a visit to the Testator at his home. The plaintiff took with him the draft August 2012 Will as well as a camera. According to the plaintiff, the draft August 2012 Will was placed in a smaller white envelope which in turn was placed into a larger yellow envelope. This envelope was carried by Mr Zhu, and the plaintiff conceded that this arrangement was contrived to avoid arousing Mdm Soh’s suspicions. 35     The plaintiff, Mr Goh, Mr Zhu and the Remaining Visitors then went to the Testator’s bedroom and spent some time with the Testator there. According to the plaintiff, the Remaining Visitors then left the room, leaving the plaintiff, Mr Goh and Mr Zhu with the Testator in the room. According to the plaintiff, he explained that the Testator needed two witnesses to witness him executing his will. He told his father that Mr Zhu and Mr Goh were good people whom the Testator knew. The plaintiff eventually left the room while Mr Goh and Mr Zhu remained to witness the Testator’s execution of the August 2012 Will. Photographs were taken of the Testator with the visitors that day and of the Testator executing the August 2012 Will.",
        "Summary of pleadings and issues": "36     The plaintiff’s claim is straightforward – that Grant of Probate of the August 2012 Will be decreed in his favour. 37     The defendants aver that the 18 December 2010 Will represents the “true and valid will” of the Testator, and that: (a)     the Testator was not of sound mind when he executed the August 2012 Will; (b)     the plaintiff had put great pressure and exerted undue influence on the Testator, forcing the Testator to write the August 2012 Will; and (c)     the formalities of the August 2012 Will are not met and the will is thus null and void or invalid. 38     The issues to be resolved therefore are: (a)     whether the formalities of the August 2012 Will were complied with; (b)     whether the Testator had testamentary capacity when he executed the August 2012 Will; (c)     whether the Testator knew and approved of the contents of the August 2012 Will when he executed it; and (d)     whether the plaintiff had exercised undue influence on the Testator in respect of the August 2012 Will.",
        "Relevant legal principles": "39     The legal principles which guide the way in which this case must be decided are uncontroversial. They are reflected in a number of local cases. The following is a summary of the relevant principles which will be explored in more detail during the discussion of the issues, if necessary. 40     The propounder of a will bears the legal burden of proving that the testator had testamentary capacity (seeGeorge Abraham Vadakathu v Jacob George[2009] 3 SLR(R) 631 (“Vadakathu”) at [37]. However, testamentary capacity will generally be presumed when the testator was not suffering from any kind of mental disability and the Will was duly executed in ordinary circumstances. This was affirmed by the Court of Appeal in the case ofChee Mu Lin Muriel v Chee Ka Lin Caroline[2010] 4 SLR 373 (“Muriel Chee”). 41     If the court finds that the testator suffered from a mental disability, the court must still decide if the existence of mental illness meant that the testator lacked testamentary capacity or whether despite the illness, the testator was lucid when the Will was executed (Muriel Cheeat [41]). 42     The rationality of a will is evidence that the testator has testamentary capacity (seeVadakathuat [33]). The evidential burden of proving testamentary capacity shifts when the will is rational and duly executed. InWilliams on Probate, at para 13-20, it is stated that if a will is rational and has been duly executed and no other evidence is offered, the court will presume that the testator is mentally competent. It is then for the persons who challenge the will to adduce evidence that the testator did not have testamentary capacity. 43     Once testamentary capacity has been established, a rebuttable presumption arises that the testator knew and approved of the contents of the will, and the evidential burden of proof shifts in ordinary circumstances to the opponent of the will to rebut this presumption. This presumption does not arise where there were circumstances surrounding the execution of the will which would raise a well-grounded suspicion that the will did not express the mind of the testator:Muriel Cheeat [46]. 44     The elements of testamentary capacity have been established since the 1870 case ofBanks v Goodfellow(1870) LR 5 QB 549 (“Banks”). These elements which were endorsed in bothVadakathuandMuriel Cheeare as follows: (a)     the testator must understand the nature of the act and what its consequences are; (b)     he must know the extent of his property which he is disposing of; (c)     he must know who his beneficiaries are and be able to appreciate their claims to his property; and (d)     he must be free from an abnormal state of mind (eg, delusions) that might distort feelings or judgments relevant to making the will. 45     In the case of a will where an allegation of undue influence on the testator is made, undue influence cannot be presumed and actual undue influence must be proved (seeBiggins v Biggins[2000] All ER(D) 92 andWilliams on Probateat para 13-48).Williams on Probatealso states that undue influence is not bad influence but coercion, and therefore persuasion and advice do not amount to undue influence as long as the free volition of the testator to accept or reject the same is not impugned (see para 13-49). InRajaratnam Kumar (alias Rajaratnam Vairamuthu) v Estate of Rajaratnam Saravana Muthu (deceased) and another suit[2010] 4 SLR 93, Tan Lee Meng J set out what constitutes undue influence in testamentary dispositions as follows: 66 As for what amounts to undue influence in relation to the execution of a will, the decision of Sir J P Wilde inHall v Hall(1868) LR 1 P & D 481 is taken to stand for the following proposition: Persuasion is not unlawful, but pressure of whatever character if so exerted as to overpower the volition without convincing the judgment of the testator, will constitute undue influence, though no force is either used or threatened. 67 InWingrove v Wingrove(1885) 11 PD 81, Sir James Hannen stated at 82 that “[it] is only when the will of the person who becomes a testator is coerced into doing that which he or she does not desire to do, that it is undue influence”. He added, at 83, that if the testator's act is shown to be the result of his wish and will at the material time, then, in the absence of fraud, “though you may condemn any person who has endeavoured to persuade and has succeeded in persuading the testator to adopt that view – still it is not undue influence”.",
        "The issues": "",
        "Issue 1 – Were the necessary formalities complied with?": "Was the August 2012 Will properly executed? 46     The relevant formal requirements which the defendants refer to are those set out in s 6(2) of the Wills Act (Cap 352, 1996 Rev Ed), which states: Every will shall be signed at the foot or end thereof by the testator, or by some other person in his presence and by his direction, and the signature shall be made or acknowledged by the testator as the signature to his will or codicil in the presence of two or more witnesses present at the same time, and those witnesses shall subscribe the will in the presence of the testator, but no form of attestation shall be necessary. [emphasis added] 47     As noted above in [12], two of the Testator’s signatures can be found at the bottom of the August 2012 Will – one next to the date (which had been amended from “10.6.2012” to “10.8.2012”) and the other below it. It is not disputed by the defendants that the Second Signature was made on 10 August 2012 and that the First Signature had been made prior to that on a separate occasion; however, their case is that the signature below the date was merely to initial the amendment to the date. They therefore submit that the August 2012 Will had not been validly executed. 48     The plaintiff, in response, submits that a finding that the Testator had merely initialled the amendment to the date would be “unreasonable and strained”. He points out to the following in support of his submission: (a)     the Testator had initialled the two cancellations in the August 2012 Will but not the addition; (b)     the Testator had not initialled the amendment to the date: he had simply written over the figure “6”, representing the month of June, to make it into an “8”, representing the month of August; (c)     the unchallenged evidence of Mr Goh and Mr Zhu showed that the Testator had made his signature at the foot of the willafterMr Zhu had explained the contents of the August 2012 Will to Mr Goh; and (d)     the fact that the Second Signature was in a different ink from that of the other signatures on the page suggests that the Testator appreciated that the Second Signature was not simply for the purpose of initialling amendments. 49     I agree with the plaintiff for all of the above reasons. The defendants citeBarker v Gribble[1991] Ch 1 (“Barker”) in support of their submission on this point. InBarker, the court held that the testator’s failure to re-execute the will after amendments were made rendered the amendments invalid. However, as the plaintiff submits, the August 2012 Will was not an amendment to a validly executed will and there was no requirement for the Testator to have initialled the amendments to begin with. That is, the present case did not concern the validity of amendments to a validly executed will but the validity of a freshly executed will. Any legal proposition that can be extracted fromBarkeris therefore likely to be of limited applicability here. Was the August 2012 Will intended to be a testamentary disposition? 50     The defendants also submit that the August 2012 Will was not intended to have testamentary effect as the subsequent drafts (ie, drafts dated later than 10 June 2012) showed that the Testator had not made up his mind. They rely on the case ofBoughton-Knight v Wilson(1915) 32 TLR 146 (“Boughton”), where the executors of an officer who was killed in the course of his duties propounded a will and codicil together with a holograph document in the officer’s handwriting. It was submitted that the holograph document was a “soldier’s will”. The court pronounced for the will and codicil against the holograph document as the document consisted of two alternative drafts and was not intended to be testamentary. 51     The present circumstances are clearly distinguishable. The holograph document that the executors propounded inBoughtonwas undated and unsigned. Therefore, the fact that there had been two alternative drafts was critical to the question of whether the document was intended to be the testator’s final testamentary disposition. However, where a document has been properly executed and witnessed and its terms show that the document is testamentary on the face of it (as is the case for the August 2012 Will), the existence of other draft documents cannot be sufficient to show that, on the face of it, it was not made with testamentary intent. 52     Further, I have difficulty with the defendants’ specific submission that the purported revocation of the August 2012 Will in the June 2012 Will shows that the Testator did not want to give effect to it. Whilst on 30 June 2012 the Testator may not have wanted to give effect to the August 2012 Will, it was open to him to change his mind again after 30 June 2012 and go back to the earlier terms. The mere existence of the June 2012 Will cannot in itself evidence the Testator’s intentions on 10 August 2012.",
        "Issue 2 – Did the Testator have testamentary capacity?": "53     To determine whether the Testator had the requisite testamentary capacity to execute the August 2012 Will, it will be necessary to consider whether the will is rational on the face of it and whether the Testator suffered from a mental illness that affected his testamentary capacity. The rationality of the August 2012 Will 54     The plaintiff submits that the test for rationality is better characterised as one of irrationality. That is, the court should not measure the August 2012 Will against an assessment of how the Testator would have disposed of his assets based on the available evidence. Instead, the enquiry should focus on whether the terms of the will are “so odd or inexplicable that it should cast doubt on the testamentary capacity of the testator”. The defendants do not contend otherwise, citing Andrew Ang J inNg Bee Keong v Ng Choon Huay[2013] SGHC 107 at [50] in which it was stated that “[t]he presumption of testamentary capacity willnotarise where the terms of the Will areprima facieirrational” [emphasis in original]. 55     The defendants identified the following features of the August 2012 Will which they submit are irrational: (a)     The Testator appointed the plaintiff as the sole executor of his Estate even though he had not done so previously, had felt that the plaintiff was a man “with no conscience”, and the plaintiff was unfamiliar with the Testator’s charitable activities in China. (b)     No provision was made for Mdm Soh. (c)     There was to be a donation of a television set and a CD player despite the fact that a large television set had already been donated in 2012 pursuant to the Testator’s instructions. (d)     There was no need for the sum of RMB 5m to be donated to No 4 Middle School as it did not need to be rebuilt and had no link to the Testator. (e)     It was not the Testator’s usual practice to donate such large sums to the charitable organisations in Longyan, China. (f)     The multiple amendments to the August 2012 Will were uncharacteristic of the Testator who was a very neat person and would not have wanted his great-grandchildren to know of his change of mind in respect of their beneficial interest in his estate. The Testator’s charitable activities in China 56     It should be pointed out that the factual premise for (a) is not entirely correct – the plaintiff was also named as the sole executor of the Testator’s Estate in the July 2010 Will. In any case, I do not think that the mere fact that the Testator had appointed his son as the executor of his Estate, when he had not previously consistently done so, is so odd or inexplicable as to cast doubt on the Testator’s testamentary capacity. The fact that the plaintiff was unfamiliar with the Testator’s charitable activities in China may be of greater significance in assessing the appointment of the plaintiff as the sole executor of the Estate. It was not seriously disputed by the plaintiff that the first defendant and Ms Lian were conducting the Testator’s charitable activities in China on his behalf prior to his death, and it was clear from the plaintiff’s evidence that he did not have detailed knowledge of such activities, having only a passing knowledge of the Testator’s donation of RMB 500,000 to the Federation of Charities in China. However, the plaintiff is a mature and competent man who runs his own business, fairly successfully from all accounts. He speaks the Longyan dialect and this would help him ascertain the needs of charitable institutions in Xinluo. According to the plaintiff, he had frequently urged the Testator to give his money to charity. If this was indeed the case, the Testator may have considered the plaintiff as completely suited to effecting such a bequest. It cannot be concluded that the plaintiff’s appointment as executor was irrational. 57     The plaintiff sought to downplay the significance of the fact that the Testator had not previously donated such large sums to charitable organisations in China, submitting that the considerations in making aninter vivosdonation differ greatly from that for a testamentary disposition. I agree. As the plaintiff points out, a donor making aninter vivosdonation might be concerned over whether he would have any future need for the money, whereas such concerns would not apply to a testamentary disposition. 58     The defendants urge me to see the bequest of RMB 5m to No 4 Middle School, in a different light. They say the Testator would not, in his right mind, have donated such a large sum to an organisation to which he had no affiliation when he had only previously donated a typewriter to it, particularly in light of his other philanthropic activities in China. The defendants also point out that, while alive, the Testator had preferred to focus on the less fortunate and needy rather than an institute of education. I am not convinced by this argument. Making a large bequest to a school is not irrational simply because one hardly supported it during one’s lifetime. It may be that one feels free to make such a gift only when it is to come out of the estate. 59     The bequest of RMB 5m to No 4 Middle School was for the specific purpose of the “extension of the school and to provide financial assistance”. In this regard, the defendants submit that it was irrational to have made a bequest for the extension of the school when it was geographically restricted and had no plans for expansion. I agree with the plaintiff that irrespective of what the term “extension” was intended to mean in the will, it does not matter whether there was actual space for physical expansion; what matters is the Testator’s subjective knowledge. There was no evidence that his nephew, Mr Lin Man Fung (who lived in Xinluo District), had informed the Testator of this and it is reasonable to infer that he had not, given that Mr Lin did not even know the terms of the August 2012 Will until after the Testator’s passing. 60     The evidence was that although the plaintiff may not have visited the school premises themselves, he had met the headmaster of the school. Mr Lin said that the headmaster had asked the Testator for money to build a grand entrance arch. Further, the first defendant herself had testified that the headmaster had also made a request for money to build an open air running track. In these circumstances, the Testator was aware that the school needed money and although he was not willing to support the building of an arch when he was alive, it does not strike me as irrational that he would later make a specific bequest for the “extension” of the school and “to provide financial assistance” as the latter part of that bequest reads. The plaintiff’s fractured relations with his family members 61     Aside from the plaintiff’s unfamiliarity with the Testator’s charitable activities in China, the defendants argue that the plaintiff’s appointment as the sole executor of the Testator’s estate is at odds with the Testator’s view of the plaintiff. In particular, the defendants point to a video taken of the Testator in April 2012 when he was hospitalised, in which the Testator told Ms Lian that the plaintiff was “someone with no conscience”. The plaintiff submits that the comments, taken in context, did not reflect the Testator’s view on the plaintiff’s suitability to be appointed the executor of his Estate, but were merely an expression of disappointment at the enmity that had developed between the plaintiff and the first defendant. 62     While I do not think it can be said that the Testator was merely expressing his hope that the plaintiff would have a better relationship with the first defendant, I accept that his comments did not relate specifically to the suitability of the plaintiff to be appointed executor. That the Testator was disappointed in the way the plaintiff treated his sister is clear; however, this does not necessarily mean that the Testator had doubts about the plaintiff’s ability to carry out his last wishes faithfully. Indeed, the first defendant candidly admitted that the Testator would have viewed the plaintiff as a filial son, presumably one who would have respected his father’s wishes. At best, as the plaintiff submits, it indicates that the Testator was fully aware and troubled by the fractured relations between him and the first defendant. In these circumstances, it was not irrational for the Testator to have picked the plaintiff as the sole executor of his Estate as opposed to the defendants or a joint executorship between them. The failure to provide adequately for Mdm Soh 63     The defendants also submit that the August 2012 Will was inofficious (ie, irrational) as it did not provide for Mdm Soh. They refer to Mr Tan’s evidence that the Testator had wanted 30 Jedburgh to be given to Mdm Soh, at least at the time the 18 December 2010 Will was made. In her affidavit, Mdm Soh also stated that the Testator had told her just before his death that he would give 30 Jedburgh to her. In response, the plaintiff argues that Mr Tan’s evidence in its full context suggests that the Testator was concerned with ensuring that Mdm Soh would have a place to live in during her lifetime as opposed to her ownership of the property: A.… I recall that the property at 30 Jedburgh Gardens was quite important to the testator, because I think the testator wanted it to be given to the mother.I think primarily probably because he wanted to ensure that Madam Soh has a place to stay after his death. [emphasis added] 64     I am inclined to agree that the italicised part of the above extract modifies the preceding sentence by suggesting that the Testator’s main concern was that Mdm Soh should have a roof over her head until she died. This concern was shown in similar language in his various testamentary documents, both the signed and the unsigned ones, made in 2012. In none of those does he appear to give 30 Jedburgh to Mdm Soh outright; instead he provides for what should be done with the proceeds of sale after his own and her deaths. He might have made her a gift in the December 2010 Will but by 2012, the evidence of his various drafts supports an inference that he changed his decision to giving her only a life interest. This was probably due to his desire to give more money to charity from his Estate, as another common aspect of the 2012 testamentary documents is the expression of the Testator’s charitable intentions. 65     I note that while Mdm Soh is of the view that she is entitled to live in 30 Jedburgh under the terms of the August 2012 Will, the defendants argue that the August 2012 Will simply provides that 30 Jedburgh can be sold only after Mdm Soh’s death and does not set out her right to continue living in that property. I think that the defendants’ interpretation of the August 2012 Will is unduly restrictive and that it does, by implication, provide that Mdm Soh shall be entitled to live in 30 Jedburgh for the rest of her life. It is a well-established principle that in the interpretation of wills one does not look at the words used in isolation but interprets them in the light of the factual matrix that existed and was known to the Testator when the will was drawn. In this case, the relevant circumstances are that Madam Soh had lived in 30 Jedburgh as her matrimonial home for more than 40 years and the Testator had previously expressed his desire that Mdm Soh should have a home after his death. In providing that the house be sold only after her death, the Testator must have intended that she be entitled to live there for the rest of her life. 66     As for the fact that the Testator had not left anything in general to Mdm Soh in the August 2012 Will, the plaintiff points to Mdm Soh’s half-share in the property located at 35 Cheviot Hill (“35 Cheviot”), her ownership of certain stocks and shares, the moneys she holds in her bank account and the fact that she had received a sum of $500,000 from LSPS as its director and shareholder. Therefore, the plaintiff submits, Mdm Soh was already adequately provided for by the Testator in his lifetime. I agree with plaintiff’s submissions. Given her advanced age, it was not so odd or inexplicable that the Testator would have considered that Mdm Soh was already adequately provided for and that he could reasonably bequeath his other assets to other relatives and charitable organisations. 67     The defendants’ arguments are three-fold. First, they allude to the fact that the Testator and Mdm Soh had entered into “mutual wills” on 18 December 2010. I do not understand them to be referring to “mutual wills” as a term of art in that the 18 December 2010 Will should not be revoked without the consent of Mdm Soh (see G Raman,Probate and Administration in Singapore and Malaysia(LexisNexis, 3rd Ed, 2012) at p 36). Their point, as I understand it, is merely that 35 Cheviot did not weigh on the Testator’s mind when he devised 30 Jedburgh to Mdm Soh under the 18 December 2010 Will, and in August 2012 the Testator would have equally wished to ensure that Mdm Soh would be sufficiently provided for, her ownership of 35 Cheviot notwithstanding. I am not persuaded by this argument. It is likely that the Testator had devised 30 Jedburgh to Mdm Soh under the 18 December 2010 Will mainly to ensure she had a place to live in. As I have found above, the August 2012 Will makes a similar provision. 68     Second, they seek to de-emphasise the significance of 35 Cheviot on the grounds that Mdm Soh merely had a half-share and that it was merely a “small old terrace house”. Third, they appear to suggest that the Testator would not have thought that Mdm Soh was adequately provided for as she could require a large sum of money for medical expenses in the future. Neither of these arguments convince me that the threshold of irrationality is crossed by basis of the August 2012 Will’s failure to provide for Mdm Soh. Nothing suggests that the Testator had devised 30 Jedburgh to Mdm Soh as an asset to be liquidated in times of financial need and not as a home to live in. I do not think the failure to provide for Mdm Soh in itself has much bearing on the rationality of the August 2012 Will. There is therefore no need to consider whether the documents in the Plaintiff’s Supplementary Bundle Documents setting out Mdm Soh’s assets should be admitted. In any case, it is not the defendants’ case that Mdm Soh was actually unable to afford her own medical expenses, merely that the Testator would have wanted to provide for her regardless of the extent of her assets. Other incongruities 69     The defendants also submit that the August 2012 Will is irrational due to other incongruities in the will. In particular, the defendants highlight the following: (a)     that the August 20120 Will provides for the donation of a television set and CD player when the Testator had already made such a gift in June 2012, and that it was atypical of the Testator to have mentioned such a trivial asset in the August 2012 Will; (b)     that there were many amendments and cancellations on the August 2012 Will which was uncharacteristic of the Testator who was a very neat person; (c)     that the currency of the “200,000” to be donated to the “poor overseas Chinese returnees in Xinluo District” was not specified and that the August 2012 Will is “garbled, confusing and incomplete”; and (d)     that the term of the August 2012 Will relating to the $780,000 purportedly owed to the Testator by the plaintiff and its distribution to the Testator’s grandchildren is confusing. 70     I do not think much weight can be put on these incongruities. As stated above, the test is whether the August 2012 Will is rational on the face of it. As the plaintiff has observed, there was effectively only one cancellation and one addition to the August 2012 Will, which otherwise appears to be written in a neat and orderly fashion. There is no evidence to suggest that the Testator was someone who did not tolerateanyamendments to his written documents. I also do not think much can be read into the failure to specify the currency of the “200,000” donation, which appears at most to be a careless omission by the Testator that does not come close to crossing the threshold of irrationality. As for the term relating to the $780,000 and its distribution, I agree with the plaintiff that the August 2012 Will can be reasonably construed in a manner that leaves little confusion as to how it should be carried out. No confusion, let alone one capable of evidencing irrationality, arises from this term. 71     I turn to the donation of the television set and CD player. The first defendant testified that it was suspicious that the Testator would have donated a television set and CD player when, in June 2012, he had instructed the first defendant to make that donation to the Dongxing Village, and that he would have removed that gift when he executed the August 2012 Will. This presupposes that the gift was intended to be for that same village to begin with. The plaintiff submits that the items may have been intended for the Shexing Village Activity Centre which is mentioned in the next line of the will. This is a possibility. But even if the bequest was intended for Dongxing Village, there are two difficulties with considering it an irrational provision. The first is that making a gift of two television sets and two CD players to the same village may be thought of as unnecessarily generous but it is hard to term it “irrational”. Was there only one family in the whole village? Where is it written that a family, let alone a village, can only have one such item? Secondly, the first defendant had provided the Dongxing Village with the items in June 2012. There is no evidence that this was done before 10 June or that the Testator knew about it when he wrote the will. In my view this provision does not cast doubt on the rationality of the will though it may have some bearing on the issue of whether the Testator approved the contents of the will. This is an issue I will discuss later. 72     I have come to the conclusion that the August Will is not irrational on the face of it. I turn to the issue of whether the Testator’s testamentary capacity was impaired by reason of his medical condition. The Testator’s alleged mental impairment 73     The defendants submit that the Testator did not have the mental capacity to make the August 2012 Will due to the fact that he had been gravely ill since April 2012. The defendants rely on the evidence given by four doctors who had attended to the Testator: Dr Yeo Chor Tzien (“Dr Yeo”), Dr Yeoh Swee Inn (“Dr S I Yeoh”), Dr Koo Chee Cheong (“Dr Koo”) and Dr Liew. The expert evidence 74     Dr Yeo is a lung specialist and treated the Testator from 2002 until the latter’s death. He testified that the Testator had become considerably more lethargic after April 2012 when he had been put in intensive care for hypothyroidism. According to Dr Yeo, the Testator had again been admitted to hospital on 20 July 2012 for acute breathlessness and low oxygen saturation. The Testator had responded to intranasal oxygen administration and was discharged on 23 July 2012 with home oxygen therapy delivered through an external source. However, the Testator was subsequently observed to be more “tired, lethargic and slow in answering [Dr Yeo’s] questions” during an outpatient visit on 30 July 2012. As a result, Dr Yeo measured the Testator’s oxygen level, which was found to be only 93%. Dr Yeo’s evidence was that an oxygen level below 95% could result in a patient feeling drowsy and confused, or even being irrational and hallucinatory in extreme cases. He also testified that given the Testator’s condition of his lungs then, he would have had to be on continuous oxygen therapy. Without an external oxygen source, the Testator’s oxygen level would drop within two to three minutes, after which he would not be able to think properly and act rationally. Dr Yeo also conjectured that the Testator would not have been able to make any rational decision due to his poor physical state. 75     Dr S I Yeoh is an endocrinologist. She first treated the Testator for his hypothyroidism on 8 May 2012. Subsequently, she saw him on 5 July and 24 August 2012. In her medical report, she stated that the Testator’s free T4 level as at 21 April 2012 was very low and that it was only restored to normal levels in September 2012. She also testified that a low T4 level could result in memory defects, short term memory loss and lack of focus. However, she conceded that different people could react differently to low thyroid levels. As far as her personal observations of the Testator were concerned, Dr S I Yeoh stated that the Testator suffered from cold intolerance, fatigue and lethargy, but his memory was commensurate with his age, albeit a bit slow. She testified that the Testator could answer her questions during the 5 July 2012 consultation and that he was “quite accurate in his description of his symptoms”. She also testified that the Testator was capable of giving clear answers during the 24 August 2012 consultation, even stating that it was possible that he would have been able to answer more complicated questions relating to his testamentary intentions. However, she noted that the Testator had indicated to her that he had been depressed the week before and that he had no interest in doing anything and preferred to stay in bed. 76     Dr Koo practices in the field of cardiology and first treated the Testator on 11 June 2011. He testified that the Testator’s memory could not have been normal in July and September 2012, given his medical condition, and that he had remained supine and communicated in a limited manner during his admissions to hospital in July and September. 77     Dr Liew was the Testator’s family physician who had attended to him since 2003. She saw the Testator on numerous occasions in 2012, the most relevant of which were his consultations with her on 4 and 12 July, and 21 August 2012. Her evidence was that the Testator had not been on an external oxygen source during the 21 August 2012 visit but had nonetheless appeared to her to be behaving normally. Was the Testator suffering from some form of mental impairment that rebuts the presumption of testamentary capacity? 78     As the Court of Appeal stressed inMuriel Cheeat [39], the mental capacity to understand the nature of a will and its consequences is but one element of testamentary capacity, which is not necessarily determined by the existence of some form of mental impairment. Pursuant to the principles set out inVadakathu, it is necessary to first determine whether the “serious mental illness” was sufficient to cause testamentary incapacity, then whether it continued to operate at the relevant time. In my opinion, in the present case no situation of “serious mental illness” has been made out. 79     It is clear from the evidence of Dr S I Yeoh and Dr Liew that the Testator did not display any signs of a mental impairment that could rebut the presumption of testamentary capacity in July and August 2012. The defendants argue that Dr Liew’s evidence should be weighed against the fact that she had only spent a fleeting moment with the Testator on 21 August 2012 and had only taken his blood specimen on that day. Even if that were the case, there is nothing to rebut Dr S I Yeoh’s evidence as to the Testator’s mental state on 24 August 2012. 80     Nevertheless, I note that the medical practitioners who had last seen the Testator prior to the execution of the August 2012 Will were Dr Yeo and Dr Koo. Both doctors attended to the Testator when he was admitted to the hospital on 20 July 2012 with Dr Yeo being the last to see the Testator on 30 July 2012, ten days before the August 2012 Will was executed. Taking into account all of the doctors’ evidence, the collective narrative appears to be that the Testator’s physical state took a turn for the worse on or around 20 July 2012 when he was warded for acute breathlessness and low oxygen saturation and continued at least until 30 July 2012 when his oxygen level had dropped to 93%. By around 21 to 24 August 2012, his condition had improved, at least to the extent that he could answer simple questions without the aid of an external oxygen source. There is also the evidence of Mr Goh and Mr Zhu that when they saw the Testator on 10 August 2012, he was not using his oxygen supply and was able to talk with them rationally. The photographs of that day show the Testator sitting up at his desk and managing without any oxygen mask. 81     In any case, I am of the view that there is insufficient evidence to establish that the condition suffered by the Testator was sufficient to cause testamentary incapacity. With regard to Dr Yeo’s evidence, he was unable to state unequivocally the effect of the reduced oxygen level experienced by the Testator. He agreed that when in November 2012 he recorded the Testator’s oxygen level as being 93, that was only marginally below the average level of 95, though he asserted that even a marginal reduction could affect a person’s mental state. This was far from evidence that such a marginal reduction would, on the balance of probabilities, affect one’s mental state. 82     Little weight must be given to Dr Yeo’s evidence that the Testator might have been too ill to make any rational decision given his concession that it was mere conjecture. As for Dr Koo, his evidence, even taken at its highest, merely shows that the Testator was tired when in hospital and would not talk spontaneously. Even then, the Testator was still able to communicate in a limited manner. Nothing in Dr Koo’s evidence shows that the Testator’s condition affected his ability to fulfil the legal requisites of testamentary capacity as set out inBanks. 83     In response to the plaintiff’s submission that the defendants were unable to point to any instances of the Testator’s delusion or any episode where the Testator was confused, the defendants identified the following as examples of the Testator’s confusion: (a)     the date specified on the December 2012 Will was after the Testator’s death; (b)     the Testator would not have wanted to prevent Mdm Soh from finding out about the August 2012 Will; (c)     the Testator would not have been worried about Mdm Soh going through his documents in his absence; (d)     the Testator would not have voluntarily showed his handwritten will to the plaintiff and asked him to keep it; (e)     the May 2012 Will contains two calculation errors which was uncharacteristic of the Testator; (f)     while in hospital in April 2012, the Testator had stated that the plaintiff owed him $870,000 when the other draft wills refer to $780,000; and (g)     the draft wills showed that the Testator had changed his mind frequently within a short span of time, indicating that his mind may not have been clear. 84     None of the above convinces me that the Testator was suffering from a mental impairment in August 2012. The date on the December 2012 Will is some indication of confusion on the Testator’s part but there is no evidence as to when that will was written, much less that it was written around 10 August 2012. It is more likely that it was written later, perhaps around November 2012 bearing in mind the December dating. The numerical discrepancies also appear to be just slips of the mind which, in any case, do not show the Testator’s testamentary capacity as at 10 August 2012. In respect of the other draft wills, as the plaintiff points out, the broad tenor of the May 2012, August 2012, 30 June and December 2012 Wills are largely similar in providing that 30 Jedburgh would be sold after the Testator’s and Mdm Soh’s deaths, that the grandchildren would each receive a significant bequest and a large sum would go to charity. That is not to say that there are no significant differences; in particular, the June 2012 Will provides that the balance of the sale proceeds of 30 Jedburgh is to be shared amongst the Testator’s three children, unlike the August 2012 Will. It is also noteworthy that all of these wills provide for a bequest of $50,000 to each of the Testator’s great-grandchildren, which was removed from the August 2012 Will. Nevertheless, the variations in the draft wills are not vacillations of such an extreme nature as to cast doubt on the Testator’s mental faculties. 85     As for the remaining reasons, they are consistent with the plaintiff’s case that these acts were designed to evade the notice of the rest of the family pursuant to the Testator’s wishes. Even if the plaintiff was not telling the truth about this and the Testator gave the draft August 2012 Will to the plaintiff at the plaintiff’s request because the plaintiff wanted to find some way to ensure that the document became a valid will, yielding to persuasion from the plaintiff to let him keep the draft will does not show that the Testator was lacking in testamentary capacity.",
        "Issue 3 – Did the Testator know and approve of the contents of the August 2012 Will": "86     Since the August 2012 Will is rational on the face of it and the Testator was not suffering from any mental impairment when he executed it, a rebuttable presumption arises that the testator knew and approved of the contents of the will at the time of its execution. The presumption does not arise where the circumstances surrounding the execution of the will give rise to well-grounded suspicion that it did not express the mind of the testator. This is a point on which the defendants make extensive submissions. 87     As a preliminary point, I note that the Testator’s knowledge and approval of the August 2012 Will is not explicitly challenged in the defendants’ pleadings. However, paragraph 9 of the Defence and Counterclaim states “[the defendants] aver that the Testator was not of sound mind at the material time and [the plaintiff] is put to strict proof of [the Testator’s] state of mind when he executed the [August 2012 Will]”. In light of the contention as to the Testator’s “state of mind”, I am of the view that this point has been sufficiently pleaded. The suspicious circumstances surrounding the execution of the August 2012 Will 88     The defendants highlight the following suspicious circumstances relating to the August 2012 Will: (a)     the plaintiff had frequently pestered the Testator about making a will even when the Testator was in poor physical condition; (b)     the plaintiff had drafted precedent wills for the Testator; (c)     the plaintiff had suggested amendments to, or had actually amended the August 2012 Will; (d)     the plaintiff took pains to conceal the signing of the August 2012 Will from his family members; (e)     the plaintiff did not want the August 2012 Will to be drafted by a lawyer; (f)     the plaintiff took photographs of the Testator signing the August 2012 Will before Mr Goh and Mr Zhu; (g)     the plaintiff kept the August 2012 Will with him; and (h)     more than half of the Estate had not been accounted for in the August 2012 Will. 89     In my opinion, some of the circumstances listed above are more relevant to the rationality of the August 2012 Will and whether the Testator had been unduly influenced in its execution rather than the suspicious circumstances surrounding its execution. To the extent that these have already been considered in respect of these other issues and bear no relevance to the issue at hand, I make no further reference to them in this section. Circumstances relevant to the preparation and execution of the August 2012 Will 90     While I do not agree that all of the circumstances surrounding the execution of the August 2012 Will that the defendants identified above are necessarily suspicious, I am of the view that the events considered as a whole are not ordinary circumstances in which the presumption of knowledge and consent of the Testator arises. The burden of proof therefore remains with the plaintiff, and it is incumbent on him to prove the Testator’s knowledge and approval of the contents of the August 2012 Will at the time of its execution. 91     One oft-cited example of suspicious circumstances, as noted by the Court of Appeal inMuriel Cheeat [48], is where a will was prepared by a substantial beneficiary of the will, or such beneficiary has procured its execution, either by suggesting the terms of the will to the testator or by instructing a solicitor to draft the will. The facts of the present case do not fall neatly within any of these categories. As the plaintiff points out, the defendants do not dispute that the August 2012 Will was drafted by the Testator himself. There is no evidence, save for that in relation to the amendments made, that the terms of the will were suggested to the Testator. Nevertheless, as I have noted earlier, the plaintiff had provided two draft wills to the Testator which appear to have been the working templates for the August 2012 Will, at least in a structural sense. Therefore, while it cannot be said that the plaintiff had drafted the August 2012 Will, he appears to have played at least an ancillary role in its creation by way of the drafts. Critically, one of these documents as originally drafted by the plaintiff provided that he would be responsible for the administration of the estate, as is also provided under August 2012 Will. 92     There is also the question of whether the plaintiff is a “substantial beneficiary” of the August 2012 Will. In this regard, the defendants concede that the August 2012 Will does not ostensibly benefit the plaintiff. However, they submit the plaintiff can benefit indirectly by, in essence, acting in breach of his executorship. There is little merit to this argument. As the plaintiff points out, he would have to account to the beneficiaries as the executor and trustee of the August 2012 Will. The plaintiff cannot be deemed to be a substantial beneficiary simply by virtue of thepossibilitythat he could breach those duties to act in his own interests. 93     For completeness, the plaintiff’s evidence was that the Testator had given him the discretion to distribute the residual estate for charitable purposes. On the other hand, the first defendant had, during her cross-examination, raised the possibility that the August 2012 Will could be construed such that the distribution of the remaining $3.3m of the Estate would be left to the plaintiff’s unfettered discretion. Ultimately, it is a question of law as to how the will is to be interpreted in relation to the residual estate and whether all of the proceeds of the Estate were intended for the charitable fund (as the plaintiff contends) or whether after the specific bequests had been paid, the remainder was to be treated as undistributed by the will and therefore distributed in accordance with the intestate succession laws. This point also applies to the question of how the last sentence “[t]he aforesaid matters and matters not set out above shall all be handled by [the plaintiff]” should be construed. The plaintiff has not attempted (rightly, in my view) to argue that it would be correct to construe the will as bequeathing the residual estate to him solely or to be dealt with as he pleased without regard to the Testator’s charitable intentions. 94     In any case, it is clear that the Court of Appeal did not find that “suspicious circumstances” should be limited to those set out in [91] above. InMuriel Chee, the Court of Appeal held that the circumstances considered did not even need to be restricted to those relating to the preparation and execution of the contended will: 46    ... The circumstances to be considered include only those “attending, or are at least relevant to, the preparation and execution of the will itself” (seeW Scott Fulton, Isabella D Fulton and Margaret Fulton v Charles Batty Andrew and Thomas Wilson(1874–1875) LR 7 HL 448 (“Fulton”) at 471). InMahendran, this court stated at [129] that any circumstance which had nothing to do with the preparation and execution of the will were to be disregarded. However, it may be noted that in the case ofIn the Estate of Musgrove[1927] P 264, Lawrence LJ said at 286 that although the circumstances to be considered would generally comprise contemporaneous events, they might also include events subsequent to the execution of the will.In the present case, the Judge was of the view that all forms of suspicious circumstances ought to be considered. We agreed with the Judge.In the present case the conduct of Muriel in connection with the respective readings of the 1989 Will and the 1996 Will gave the impression, which the Judge took into account, that she herself did not believe that the 1996 Will represented the actual state of mind of Mdm Goh in relation to the disposition of her properties, especially her half-share in the Holland Road House. 47    We agreed with the Judge's observation (see the Judgment at [136]) thatthere is no magical formula (comprising a certain fixed number of factors or criteria) to ascertain whether the circumstances surrounding a Will are suspicious. The degree of suspicion will certainly vary with the circumstances of the case.In the final analysis, the actual determination as to whether the circumstances are suspicious enough so as to shift the burden of adducing affirmative evidence of the testator's knowledge and approval of the contents of the will to the propounder is largely dependent on the factual matrix of the case itself. [emphasis added] 95     It is therefore necessary to examine all of the facts and circumstances, not just in relation to the preparation and execution of the August 2012 Will, but also the factual matrix in which the August 2012 Will was prepared and the events subsequent to its execution. 96     In this regard, I note that the plaintiff had taken a keen interest in the Testator’s will and the disposition of the Testator’s property since 2008. It was his view, which he had told his father, that 30 Jedburgh should be kept in the Lian family. He had assisted (to use a neutral term) in the preparation and execution of two wills in November that year and subsequently, on discovering that even the second one was invalid, had given instructions to Mr Nair for the preparation of the July 2010 Will which indeed kept 30 Jedburgh in the Lian family in that it was bequeathed to the plaintiff’s sons, the only grandchildren who bear the Lian surname. There is some doubt whether the Testator even knew that he was going to execute a will before he arrived at Mr Nair’s office; Mdm Soh’s evidence was that the Testator was under the impression that he was only going out for lunch with the plaintiff. 97     Subsequently, in 2011, Mr Nair prepared the declaration of trust which the Testator signed giving all his shares to the plaintiff’s sons. There is no evidence of the circumstances in which that document was prepared and signed, but I do not think that it would be wrong to infer that the instructions for the document were given by the plaintiff to Mr Nair, even though the Testator probably signed the document willingly. It is noteworthy that the Testator purported to revoke the document shortly thereafter. Then, in 2012 itself, the Testator complained that the plaintiff was always asking him what he was going to do with 30 Jedburgh. The truth of this complaint was supported by the plaintiff’s evidence that the issue of what the Testator was going to do with his assets regularly came up during his visits to the Testator. 98     The events of 10 August 2012 have to be considered in the light of the background described above. In any case, the plaintiff’s account of events is not satisfactory. 99     According to the plaintiff, he had planned for Mr Goh, Mr Zhu and the Remaining Visitors to visit his father on 10 August 2012. The purpose was also to announce that Mr Goh was leaving Prime, not just to the Testator but to the rest of the visitors. On arrival, the plaintiff entered the Testator’s room with the visitors. The Remaining Visitors left after a few minutes, leaving the Testator, the plaintiff, Mr Goh and Mr Zhu in the room. The plaintiff then asked the Testator to ask Mr Zhu and Mr Goh to witness the execution of the August 2012 Will. Subsequently, the plaintiff took out the draft August 2012 Will that the Testator had left in his care and explained to the Testator the amendments that they had discussed on a prior occasion, which the Testator put into effect then. The plaintiff then passed a camera to Mr Zhu and told him to take photos of the Testator executing the August 2012 Will. The plaintiff testified that this was to “reinforce” the handwritten will in case he needed it. 100    To me, the plaintiff’s account has all the hallmarks of a deliberate attempt to set up the execution of the August 2012 Will in such a way that its validity could not be questioned later. The plaintiff had no reasonable explanation as to why the visit was planned for that day, merely noting that it was a coincidence that the original date on the August 2012 Will happened to be 10 June. Planning the visit on this date meant that the plaintiff and the other visitors had to travel from their workplace in Tuas to the Testator’s house in Siglap, which required a 45-minute to one hour’s drive and was a lengthy commute for the Remaining Visitors who, by the plaintiff’s account, only stayed in the Testator’s room for a few minutes. The fact that the plaintiff had informed the Testator on 7 August 2012 that he would be bringing two witnesses on 10 August 2012 shows that the announcement of Mr Goh’s departure from Prime was hardly a genuine reason for the 10 August 2012 visit. There was no reason why that announcement had to be made at that time or by Mr Goh himself – the Testator was not the owner of Prime and did not take any part in its management. 101    More importantly, the plaintiff’s evidence that the Testator had made the amendments himself is directly contradicted by the evidence of Mr Goh, who testified that the amendments had already been made when the August 2012 Will was placed before the Testator. The defendants allege that it was the plaintiff himself who removed the bequest to the great-grandchildren and amended the date. I consider that that was indeed the case: the Testator in his various drafts consistently made gifts to his great-grandchildren (significantly, these gifts also appear in the June 2012 Will) and no reason was given why he would want to change the August 2012 Will in this respect. Even if I accept the plaintiff’s account, the fact that the plaintiff had found it necessary to explain to the Testator the only substantive amendment made to the August 2012 Will, in my opinion, casts serious doubt on the Testator’s knowledge of and consent to the August 2012 Will when he executed it. Further, the plaintiff testified that when the Testator had asked for his opinion as to whether there should be any bequest to the Testator’s great-grandchildren, while he had replied that it was up to the Testator, he had also proposed removing that term. This, as well as the fact that the Testator had worked off a draft will prepared by the plaintiff, suggests that the August 2012 Will may have been a product of their discussion on the terms, not unlike that inMuriel Chee. 102    Further, the photos taken of the Testator on 10 August 2012 and the evidence of the plaintiff and Mr Zhu show that throughout the visit the Testator was not receiving oxygen from the oxygen concentrator in his room. While I do not think that this was sufficient to constitute an “incapacitating mental illness” for the purpose of reversing the burden of proving testamentary capacity, this is one of the factors that contributes to the suspicion that the August 2012 Will did not express the mind of the Testator bearing in mind the possible effects of insufficient oxygen on the Testator’s mental acuity. 103    As the defendants highlight, there were elements of the plaintiff’s account that were either contradictory or hard to believe. The plaintiff stated that on 10 June 2012, the Testator had handed him the draft August 2012 Will in an envelope and he did not look at it until he reached home. This is at odds with his evidence that he had noted that the Testator had signed on the draft August 2012 Will when it was passed to him. He also claimed to have clarified with the Testator what his intentions were in respect of the residual estate but he refrained from clarifying the charitable bequests in the draft August 2012 Will as he was concerned that the Testator would think that the he was interfering. If anything, one would have thought that an inquiry as to how the residual estate was to be disposed of would carry a greater chance of being construed as interference, as opposed to clarifying how the express clauses would be construed. In addition, he first stated that he had not suggested a lawyer to the Testator as the legal process would take too long despite having contemplated that a will prepared and executed without the benefit of legal advice could be invalid. Notwithstanding this, he took two months to arrange for witnesses. He later appeared to resile from his original explanation, eventually stating that he had not arranged for a lawyer as he did not want Mdm Soh to know that the Testator was executing another will. 104    The plaintiff’s account was that when the Testator handed him the draft will on 10 June, he wanted the plaintiff to arrange for its immediate execution. The plaintiff then replied that he could not do it immediately because he needed to arrange for the two witnesses. No doubt that was correct but the plaintiff had a full staff at his disposal – there was no reason he could not have gone back to his father’s home within the next few days, if not the very next day, with his employees and effected his father’s wishes regarding execution. His explanation that Mr Zhu was away between mid-June and early July does not address the point: the will had been fully written out and Mr Zhu’s typewriting skills were not required. Further, Mr Zhu was not needed as a witness; other Prime employees could have performed this function as had indeed happened in November 2008. The Testator was not on oxygen then and was probably in a better physical condition than in August. There was no good reason for the plaintiff, as a filial son, not to immediately assist his father in his alleged desire to have the August 2012 Will properly executed. In my view, the probable explanation for the plaintiff’s conduct in regard to the delayed execution is that the plaintiff took away the draft August 2012 Will to prevent the Testator from making further amendments to the will. Other suspicious circumstances 105    It should be noted that the plaintiff’s act of keeping the August 2012 Will is an act subsequent to its execution by the Testator and it is clear fromMuriel Cheethat that is not a bar to the court’s consideration. This act, as well the fact that the plaintiff had taken pains to conceal the signing of the August 2012 Will from the rest of his family, was explained by the plaintiff as due to the Testator’s desire not to let Mdm Soh find out about the August 2012 Will. I have doubts about the credibility of this testimony. The Testator had not previously shown any reluctance to inform Mdm Soh about any testamentary document executed by him. Indeed, it was the Testator who informed Mdm Soh about the July 2010 Will as he wanted her to be a witness to the cancellation of that will. Mdm Soh also witnessed the Testator’s cancellation of the declaration of trust he had made at the lawyer’s office in May 2011. This evidence indicated that rather than hiding his actions from Mdm Soh, the Testator confided in her. 106    It should be highlighted that the Testator had stated unequivocally in the video taken of him in April 2012 that even if he had written a will, he would not have shown it to the plaintiff as “a will is supposed to be secret”. There is nothing to explain why the Testator had undergone such a major change of heart a mere two months later on 10 June 2012, when he purportedly handed the draft August 2012 Will to the plaintiff for safekeeping. The Testator’s alleged act of handing over the August 2012 Will to the plaintiff for safekeeping before and after its execution and his discussion with the plaintiff over its terms, in my view, adds to the suspicions surrounding the August 2012 Will. 107    The defendants also submit that adverse inferences ought to be drawn against the plaintiff in light of the fact that the plaintiff had not produced the August 2012 Will when the plaintiff and the first defendant had arranged to meet in Mr Tan’s office on 27 March 2013 but had instead produced the July 2010 Will. This meeting was arranged between the plaintiff and the first defendant to determine which will was the Testator’s true and valid will. The plaintiff sought to explain his failure to produce the August 2012 Will at the 27 March 2013 meeting: Q.Mr Lian, you were holding on to the 10 August 2012 will which you took so much pain to extract from your father; correct? Why didn’t you produce that will?A.I did not extract from my father first.Q.Okay.A.Second, I did not produce the will because I still don’t believe it’s 100 per cent legal document.Q.Yes, but you are in the lawyer’s office. You have no reason to doubt or mistrust Mr Warren Tan, the lawyer; correct?A.I cannot mistrust any lawyer, but that’s my thinking.Q.Then why didn’t you give the 30 July 2010 will prepared by Mr Nair and the handwritten will and say, “Look, I have two versions, I’m not sure which one, can the lawyer please advise us”? Why don’t you do that?A.I never thought of anything of this. I just bring the one copy; the other copy, I’m not too sure. I’m seeking Mr Nair for some advice.Q.When?A.About the same time that period.Q.Mr Lian, Ms Leng [sic] Bee Leng asked you, since 2 February, “Let’s deal with the estate matter”, and you took a long time, 27 March. You had ample time to consult lawyers; correct?A.I agreed, but doesn’t mean I have to do it.Q.But it is an important matter. You have to discharge your duty as an executor for your father.A.I cannot answer this question. I only say that I take all my time to finish the thing for him.Court:What do you mean? I don’t understand that answer.A.I just go step-by-step, your Honour. Find out the thing is real -- sorry, is legal, then I go and proceed further, but in the meantime, whatever I have, I just present.   108    In my view, the plaintiff has not satisfactorily accounted for his failure to produce the August 2012 Will at the 27 March 2013 meeting. From the above, it appears that the only reason the plaintiff could proffer was that he had doubts as to the validity of the August 2012 Will at that time. However, as counsel for the defendants pointed out, there was no reason why he could not have produced both the July 2010 Will and the August 2012 Will and leave it for Mr Tan’s determination, or why he could not have been less dilatory in obtaining Mr Nair’s legal opinion on the validity of the August 2012 Will. It is noteworthy, as the plaintiff concedes, that the July 2010 Will was the one most favourable to him. 109    Counsel for the plaintiff disputes the characterisation of the plaintiff’s behaviour as “evasive and deceitful action”. He seeks to explain the plaintiff’s actions in two ways. First, the plaintiff had considered Mr Tan his mother’s lawyer and there was no compelling reason for the plaintiff to take the August 2010 Will to him. Second, there was no obligation for the plaintiff to produce all documents executed by the Testator given the strained relationship between the plaintiff and the first defendant. Neither of these reasons carries much weight. Given that the plaintiff had first been asked whether he was in possession of the Testator’s will and that he was the one who had suggested the meeting on 27 March 2013 to examine the respective wills in the hands of the plaintiff and first defendant, I am not convinced that the strained relations between the plaintiff and his family members are a valid reason for his failure to produce the August 2012 Will at the meeting. On the contrary, the acrimony between the parties and the fact that the meeting was for the sole purpose of determining which of the Testator’s wills was valid were sufficiently compelling reasons for the plaintiff to have produced the August 2012 Will. More importantly, these were not reasons given by the plaintiff during cross-examination. The failure of the plaintiff to produce the August 2012 Will at the 27 March 2013 meeting therefore reinforces the finding that testamentary capacity should not be presumed. Has the plaintiff discharged the evidential burden of showing that the Testator knew and consented to the terms of the August 2012 Will? 110    Having found that the circumstances surrounding the August 2012 Will were sufficiently suspicious, the burden of adducing affirmative evidence of the Testator’s knowledge and approval remains with the plaintiff. The plaintiff says there is sufficient evidence. First, he points to the fact that the Testator had executed the August 2012 Will in the presence of Mr Goh and Mr Zhu. Second, he says that the Testator would have been resting in his room before the visit on 10 August 2012 and that the Testator would not have been affected by the fact that he was not using the oxygen concentrator. Third, he refers to the photographs of the Testator “wearing his glasses and scrutinising the August 2012 Will intensely”. Fourth, he argues that the Testator had only executed the August 2012 Will after it was explained to Mr Goh by Mr Zhu, and the Testator would have heard and understood that explanation. 111    None of the plaintiff’s arguments persuade me. While the due execution of a will of a testator with testamentary capacity in ordinary circumstances would raise a rebuttable presumption of the testator’s knowledge and consent of the contents of the will, it has already been found above that the circumstances are suspicious enough such that the presumption does not arise. As such, the mere execution of the August 2012 Will does not add much to the plaintiff’s discharge of his evidential burden. Neither is the Testator’s physical conditionaffirmativeevidence of his knowledge and consent. As for the photographs, the mere fact that the Testator had been “scrutinising the August 2012 Will intensely” says nothing as to his mental state. Indeed, it cannot even be seen from these photographs if the Testator was actually reading the terms of the August 2012 Will and, if so, whether he understood what he was reading. Finally, the suggestion that he would have overheard Mr Zhu’s explanation of the August 2012 Will to Mr Goh is mere conjecture. There was no evidence to suggest that the Testator had in fact overheard their conversation or had paid any attention to it. 112    In my opinion, it is critical that neither the plaintiff nor the witnesses to the August 2012 Will read, let alone explained, its terms to the Testator on that day, save for the plaintiff explaining theamendmentsmade. Around two months had elapsed since the Testator had last seen the August 2012 Will and he had been in hospital during that period. Even putting aside the possible effects of the Testator not being on the oxygen concentrator at the time he executed the August 2012 Will, there is simply insufficient evidence to conclude that the Testator knew and understood its terms, much less how it varied from the terms of the June 2012 Will which in time of drafting was the most recent of the Testator’s expressions of his testamentary intent. What would be more persuasive but was not put forward by the plaintiff is the argument that the Testator must have had the necessary knowledge and approved of the August 2012 Will simply on the basis that he was the one who had drafted it, assuming that testamentary capacity has been established. The leading textbooks do not deal directly with this point. Regardless, I am of the view that the strength of such an argument would have to be predicated on the fact that a testator drafted a will independently. Even if thedraftAugust 2012 Will satisfied this requirement, the fact that there were amendments which were explained to the Testator by the plaintiff would negate the probative value of the August 2012 Will being drafted by the Testator. Further, the existence of the June 2012 Will is an indication that after drafting the August 2012 Will, the Testator had second thoughts and wanted to modify his bequests.",
        "Issue 4 – Was the Testator unduly influenced by the plaintiff in respect of the August 2012 Will?": "113    What the defendants appear to be arguing is simply that undue influence can be proven from the circumstances surrounding the execution of the will. In this context, they rely onVanessa Schomberg v David Taylor[2013] EWHC 2269 (Ch) (“Schomberg”).Schomberginvolved a challenge to a testatrix’s will by her stepsons, who alleged that the will was executed under the undue influence of the testatrix’s brother-in-law. The stepsons gave evidence that the testatrix and her deceased husband (their father) had told them that everything would be left to them and split evenly upon the testatrix’s and her husband’s death. This was as provided in the immediate will preceding the one that was contested inSchomberg. However, under the contested will, the stepsons would only get £10,000 each with £30,000 going to the carer and the cleaner of the testatrix and the remainder to the brother-in-law’s three children. 114    The court inSchombergheld that the stepsons hadprovedthe undue influence alleged for a number of reasons. First, the judge found that the testatrix had been in a very fragile physical and mental state around the time the will was made. Second, he found that there was cogent evidence that the testatrix’s brother-in-law had subjected her to unwanted pressure in relation to the making of a new will, such that he had indicated to her carer that she did not want to speak to him. Third, the judge was also satisfied that the pressure applied had worn the testatrix down, which was evidenced by her conversations with her nephew and a neighbour who had cared for her, in which she had burst into tears and said that she did not know what to do about her will. Fourth, the judge held that the testatrix’s will had been overborne. The judge was persuaded by the fact that the testatrix’s previous two wills had provided for her stepsons to take the residue of her estate and there was no reason for their virtual exclusion from the contested will. In contrast, the contested will provided extensively for her brother-in-law’s children when there appeared to be no affinity between them and the testatrix. Further, the testatrix’s explanation to the solicitor who drafted the contested will that her stepsons were not close to her was at odds with reality. Fifth, the judge took into account the fact that most of her assets would have come from the matrimonial home which she and her husband shared. 115    The defendants seek to draw an analogy between the factual matrix inSchombergand that in the present case. The defendants allege that the plaintiff had pestered the Testator about his will frequently and point to the Testator’s weakened physical state at that time. They submit that less influence was required in the present case due to the Testator’s weakened physical state, referring to the comments of Kay LJ inHampson v Guy(1891) 64 LT 778 at 780: … the amount of influence which would induce a person of strong mind and in good health to make a will according to the wishes of the persons who were attempting to induce such a testator must be very much greater that the amount of inducement which would improperly influence the mind of a person who was weak partly from mental infirmity and partly from ill-health … 116    In this regard, the comments of the court inWingrove v Wingrove(1885) 11 PD 81 at 82–83 also support the above proposition: The coercion may of course be of different kinds, it may be in the grossest form, such as actual confinement or violence, or a person in the last days or hours of life may have become so week and feeble, that a very little pressure will be sufficient to bring about the desired result, and it may even be, that the mere talking to him at that stage of illness and pressing something upon him may so fatigue the brain, that the sick person may be induced, for quietness’ sake, to do anything. This would equally be coercion, though not actual violence. 117    The defendants further say that the Testator had been pressurised by the plaintiff to make the August 2012 Will and the Testator acquiesced in order to get some “peace and quiet”. They submit that the Testator had executed the August 2012 Will as he had been put on the spot by the plaintiff’s unannounced visit on 10 August 2012 and he did not want to embarrass the plaintiff. With regard to the Testator’s acquiescence in order to get some “peace and quiet”, the defendants citeHall v Hall(1868) LR 1 P & D 481, which states at 482: … Importunity or threats, such as the testator has not the courage to resist, moral command asserted and yielded to for the sake of peace and quiet, or of escaping from distress of mind or social discomfort, these, if carried to a degree in which the free play of the testator’s judgment, discretion or wishes, is overborne, will constitute undue influence, though no force is either used or threatened. In a word, a testator may be led but not driven; and his will must be the offspring of his own volition, and not the record of some one else’s. 118    Considering the facts of the present case in totality, I do not think that they rise to the exceptional circumstances ofSchomberg. As the plaintiff points out, the mental state of the Testator was far from that of the testatrix inSchombergwhich was described as “very fragile”. InSchomberg, the testatrix had burst into tears and was clearly distressed. She had told others that she could not cope and did not know what to do with her will and had also told one of her stepsons that she was being pressured into things. At the time of making her will, the testatrix inSchomberghad been grieving the recent loss of her husband of forty years. The day before she signed the will she had had the flu and was shivery and could not stop shaking. 119    In contrast, there was little evidence to show that the Testator had been operating under such duress or stress. The defendants seek to rely on the following: (a)     The plaintiff had “harassed” the Testator and would ask him frequently as to how 30 Jedburgh would be devised; (b)     The plaintiff had provided the Testator with a draft will and suggested to him how his assets should be distributed; (c)     The Testator looked angry and troubled after the visit on 10 August 2012; and (d)     The Testator would be sad and would lose his appetite after each visit by the plaintiff. 120    The plaintiff disputes that he had pestered or harassed the Testator but otherwise does not contest the above evidence. In any case, the plaintiff submits that the same does not show that the Testator’s will had been overborne. Bearing in mind that it is the defendants who bear the burden of proving that the Testator had been unduly influenced, I am of a similar view. First, it is unclear as to whether and to what extent the plaintiff had been exerting pressure on the Testator in respect of the will. Even though the plaintiff had frequently asked the Testator how 30 Jedburgh would be devised, his queries, without more, are insufficient to support a finding of undue influence. They would at most amount to persuasion. Second, while the Testator may have been upset after the plaintiff’s visits, the Testator did not go so far as to refuse to see the plaintiff and made no mention as to what it was about the visits that troubled him. There is no evidence to show that the Testator had been truly troubled by how his assets would be divided save for the fact that the plaintiff would frequently bring it up. Indeed, he seemed to enjoy the task of distributing the assets, making so many draft wills that it appears to have been somewhat of a hobby in his last months. 121    The third point is that even if the Testator was troubled by the plaintiff’s promptings in respect of how 30 Jedburgh would be devised, the evidence does not support a finding that the Testator’s mental state had descended to that of the testatrix inSchomberg. Fourth, I do not think that the plaintiff’s question as to whether the great-grandchildren should be made beneficiaries is in itself sufficient to found an affirmative case of undue influence. In any case, I have found that the amendment was not made on the day of execution itself and all that happened on that day in relation to the amendment was that the Testator signed against it. He may not have been aware of the significance of the amendment since the will as a whole was not read over or explained to him. As for the suggestion that the Testator had executed the August 2012 Will as he had been put on the spot, there is nothing to refute the plaintiff’s evidence that he had informed the Testator on 7 August 2012 that he would be visiting on 10 August 2012 for that purpose. Further, the Testator was brought out of his room for lunch thereafter and neither then or at any later time did he complain that the plaintiff had put him in the spot regarding the signing of any document.",
        "Conclusion": "122    In the result, I am satisfied that because the Testator did not know of or approve the contents of the August 2012 Will when he signed it, it must be held invalid. The plaintiff’s claim is dismissed with costs and there will be a declaration that the 18 December 2010 Will is the Testator’s last true will and testament."
    }
}