{
    "case_title": "Leong Hin Chuee\n      v\n      Citra Group Pte Ltd and others",
    "ncitation": "[2015] SGHC 30",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1       Leong Hin Chuee (“the plaintiff”)\n                    received a monthly salary of S$25,000 pursuant to an Employment Agreement dated\n                    1 August 2007[note: 1](“the EA”) signed with the\n                    Transpacific Group (a group of companies owned by Suganda Setiadikurnia\n                    (“D7”)) (“the Group”) from 1 August 2007 to July\n                    2010. Under the EA, he was also entitled to bonuses, share rewards and\n                    reimbursements which were due to him if certain conditions were fulfilled. The\n                    plaintiff alleges that he had not been paid these other benefits under the EA.\n                    Thus he sues the defendants in these proceedings for breach of EA. He alleges\n                    that he had not been paid the following sums under the EA:[note: 2] (a)     US$4,663,020 in respect of Project\n                        Gibson being completed, which is the reverse takeover (“RTO”)\n                        of PT Royal Oak Development Asia (”RODA”);[note: 3] (b)     US$4,511,250 in respect of Project MP being completed,\n                        which is the RTO of PT Citra Kebun Raya Agri\n                            (“CKRA”);[note: 4] (c)     US$1,138,315.22 in respect of fund\n                        raising activities for Project Gibson and Project MP; and (d)     S$1,852,000 in respect of fund raising\n                        activities for the acquisition of properties at 21 Anderson Road\n                        (“the 21 Anderson Properties”). 2       In addition, the plaintiff also claims\n                    S$54,004.52 for reimbursements for expenses he incurred in the course of his\n                    employment from 2008 to 2010. Therefore, the plaintiff’s total claim is\n                    for US$10,312,585.22 and S$1,906,004.52. 3       The defendants dispute the plaintiff’s\n                    claims. First, they contend that they were not parties to the EA. According to\n                    the defendants, the plaintiff should have sued PT Transpacific Securindo\n                    (“PT Securindo”) which they say was his official employer.[note: 5]Second, they contend that the\n                    plaintiff was not entitled to the bonuses since the bonuses were not an absolute\n                    entitlement. The plaintiff was also not entitled to the share rewards with\n                    respect to Project Gibson and Project MP as the projects were incomplete.\n                    Finally, they contend that the plaintiff was not entitled to the balance of the\n                    expenses incurred in the execution of his duties as there is no proof that they\n                    were incurred in accordance with the EA’s terms. 4       Besides disputing these claims, Citra Group Pte\n                    Ltd (“D1”), Cozmo Properties Pte Ltd (“D3”), Forever\n                    Prosperous Pte Ltd (“D5”) and Fortune International Trading Pte\n                    Ltd (“D6”) (collectively “the Four\n                    Counterclaimants”) also counterclaim against the plaintiff for his\n                    alleged breach of directors’ duties and breach of\n                        confidentiality.[note: 6]",
        "The background": "5       Prior to his EA with the defendants, the\n                    plaintiff was the Executive Vice-President and Head (Business Development and\n                    Investor Relations)[note: 7]in Lereno Bio-Chem Ltd (“Lereno”),\n                    a Catalist-listed company.[note: 8]It was at Lereno that he met D7, the\n                    Vice-Chairman of Lereno on 20 November 2007, after the latter had subscribed for\n                    a significant number of Lereno shares.[note: 9] 6       Subsequently, D7 resigned from Lereno’s\n                    board when he failed to secure majority control of Lereno. He also fell out with\n                    the other leading shareholders of Lereno.[note: 10]However, as D7 found the\n                    plaintiff to be “shrewd and capable”[note: 11], D7 offered to employ him on a full-time\n                        basis[note: 12]so that the plaintiff could assist him with the RTO of two public-listed\n                    Indonesian companies: RODA, a suspended company listed on the Indonesian Stock\n                    Exchange (“IDX”), and CKRA, another suspended company listed on\n                    the IDX. The plaintiff agreed and resigned from Lereno on 31 August\n                        2007.[note: 13]",
        "The Employment Agreement": "7       The plaintiff entered into the EA after some\n                    negotiations with D7. It was signed by D7 on behalf of the Group, which was\n                    described in the EA as “a Group of companies incorporated in Indonesia\n                    and Singapore with its principal place of business at the 18th floor of Menara\n                    Imperium, Jakarta Indonesia”.[note: 14]Subsequently\n                    and pursuant to the EA’s terms, the plaintiff was appointed to different\n                    positions in the companies controlled by D7.[note: 15]His appointments included,inter alia,:[note: 16] (a)     directorships in Cozmo International\n                        Pte Ltd (“D2”), D3, Fook Yuan International Pte Ltd\n                        (“D4”) and D6; (b)     the Deputy President Director of RODA;\n                    and (c)     the President\n                        Director of CKRA. 8       Under cll 5.3, 5.4, 5.5 and 5.9 of the EA, the\n                    plaintiff is entitled to receive Annual Bonuses, Periodic Bonuses, share rewards\n                    and reimbursement of expenses under cll 5.3, 5.4, 5.5 and 5.9 of the EA. The\n                    relevant clauses are set out as follows:[note: 17] 5.3Variable Performance\n                                Bonuses. The Executive shall be paid anAnnual Bonus(and may be paidPeriodic Bonusessuch as the 0.25% to 0.5% relation to\n                            variousFund Raising Activitiesas verbally expressed by the CEO prior to the signing of\n                                this Agreement) in the form of cash or shares or in a\n                            combination of both, the quantum of which shall be at thesole and absolute discretion of the CEO, and\n                            whichshall depend on the performance of the Company\n                                and the attainment of the objectives as determined by the\n                                CEO. 5.4    Project GibsonStock Earn-out\n                                and Ownership–upon completion of the Project Gibson\n                            RTO/IPO, Executive shall be awarded full title and legal ownership of a\n                            minimum of 12 million shares in the listed company. Executive shall pay\n                            only/earn-out for the Project Gibson shares according to Table 1\n                            Schedule set out below if the Executive Ceases to be employed by the\n                            Company for any reason whatsoever. 5.5    Project MPStock Earn-out and\n                                Ownership–upon completion of the Project MP\n                            RTO/IPO, Executive shall be awarded full title and legal ownership of a\n                            minimum of 12 million shares in the listed company. Executive shall pay\n                            only/earn-out for the Project MP shares according to Table 1 Schedule\n                            set out below if the Executive Ceases to be employed by the Company for\n                            any reason whatsoever. … 5.9Expenses. The\n                            Executive shall be provided with Company Transportation andreasonable Accommodationswhile in Jakarta or\n                            other locations as assigned by the CEO. The Executive shall also be\n                            reimbursed for reasonable traveling, hotel accommodations,\n                            telecommunications and other out-of-pocket expensesincurred in or about the discharge of the Executive’s\n                                duties. [original emphasis in bold, emphasis added in bold italics] It is important to note that with respect to the share\n                        rewards, cll 5.4 and 5.5 were amended by having “1.5% for\n                        100%” scribbled next to them and D7 countersigning at the side\n                        (“the Handwritten Amendments”).[note: 18]In this\n                        regard, the plaintiff also makes reference to Table 1 (exhibited in Annex A\n                        of this judgment) to submit that the share rewards are essentially a\n                        “loyalty device” and the price to be paid for the share\n                        rewards should be in accordance with Table 1.[note: 19]The plaintiff interpreted this to mean that he would get 1.5% of the RODA\n                        and CKRA shares or their cash equivalent when Project Gibson and Project MP\n                        were completed.[note: 20] 9       While it is undisputed that the Handwritten\n                    Amendments were made by D7, the parties disagreed on: (a) when completion took\n                    place; (b) what were the circumstances under which the share rewards were to be\n                    granted; and (c) the implication of the Handwritten Amendments to those clauses.\n                    The plaintiff’s view is that Project Gibson and Project MP were\n                    successfully completed and that he was instrumental to their success. He also\n                    submits that he was instrumental in raising funds successfully for the\n                    acquisition of the 21 Anderson Properties and thus entitled to the sums claimed\n                    for. The defendants’ view is that Project Gibson, Project MP and the\n                    acquisition of the 21 Anderson Properties failed. The plaintiff was merely a\n                    liaison officer to obtain the loans for the various companies from the banks.\n                    For these services, the plaintiff was already paid a salary under the EA.\n                    Therefore, the defendants submit that the plaintiff is not entitled to his\n                    claims. 10     Given the very different interpretation of the\n                    facts taken by the plaintiff and the defendants, it is useful to look at the\n                    three abovementioned fund raising activities and the way the parties viewed\n                    them.",
        "Project MP": "11     Project MP was an initiative under the\n                    Bio-Resources Division of the Group[note: 21]and it involved the RTO of\n                    CKRA. CKRA was a company engaged in the planting, processing, trading and\n                    transportation of agricultural and plantation products and palm oil\n                        processing.[note: 22] 12     Project MP was to be executed in the following\n                        manner:[note: 23] (a)     The first step was to issue CKRA\n                        shares. CKRA would conduct a rights issue and the money raised would be used\n                        to purchase mandatory exchangeable bonds (“MEB”) issued by PT\n                        Kurnia Selaras (“PTKS”). (b)     PTKS would pay 1% interest to CKRA every year for five\n                        years until the bonds matured on 28 January 2013. Upon maturity, the MEB\n                        would be exchanged for 70% equity in PT Transpacific Agro Industry\n                        (“TPAI”) and PT Citra Indoniaga\n                            (“CIN”),[note: 24]two palm oil companies in Indonesia.\n                        Upon the maturity of the MEB, CKRA was envisaged to become the indirect\n                        owner of the palm oil plantations owned by TPAI and CIN. The first rights\n                        issue was conducted in January 2008. (c)     After the first CKRA rights issue was conducted and the\n                        acquisitions made, a second rights issue was conducted with 78% of the\n                        proceeds funding the purchase of PT Horizon Agro Industry\n                        (“HAI”). HAI owned a number of palm oil plantation-owning\n                        subsidiaries. It was also in the process of constructing a starch products\n                        factory. 22% of the proceeds would be used for CKRA’s working capital\n                        needs. (d)     Finally,\n                        D1 would be incorporated as an investment holding company to be the standby\n                        buyer underwriting the second CKRA rights issue. To fulfil its underwriting\n                        obligations, D1 later entered into a loan facility with the Singapore branch\n                        of the Raiffeisen Zentralbank Oesterreich AG (“RZB”) for the\n                        sum of US$111,663,482.44 (“the First RZB\n                Loan”). 13     The plaintiff envisaged that under this plan,\n                    CKRA would become a multi-billion dollar company in three years.[note: 25]There were three eventual\n                    scenarios contemplated by the parties in relation to Project MP: (a)     The best-case scenario envisaged\n                        that up to 300bn rupiah would be raised from interested investors in the\n                        second CKRA rights issue.[note: 26] (b)     The expected scenario was that up to 200bn rupiah would\n                        be raised from interested investors. (c)     The worst-case scenario was that no money would be raised\n                        from interested investors,[note: 27]thus necessitating a pledge of 400bn\n                        rupiah worth of shares to RZB in order to secure 100bn rupiah worth of\n                            loans.[note: 28] 14     As matters transpired, the second CKRA rights\n                    issue was a total failure, necessitating D1’s use of the money raised from\n                    the First RZB Loan to underwrite the share issuances. The plaintiff’s position 15     The plaintiff submits that Project MP was\n                    completed because D1 successfully held 78.76% of CKRA as of 31 December\n                        2010[note: 29]with CKRA’s shares being freely tradable, showing that the asset injection\n                    and monetisation were successfully completed. His role was to raise funds for\n                    the project and[note: 30]through his efforts, RZB was convinced\n                    that the collateral which D1 had in place was acceptable under the proposed\n                    financing structure and it therefore granted D1 credit facilities up to\n                    US$111,663,485.44 for Project MP.[note: 31]Therefore, the\n                    plaintiff alleges that he is entitled to:[note: 32] (a)     the Annual Bonus under cl 5.3 of the\n                            EA;[note: 33] (b)     the Periodic Bonuses under cl 5.3 of the EA\n                        worth 0.5% of the US$111,663,485.44 raised;[note: 34]and (c)     3% of the\n                        CKRA shares under cl 5.4 of the EA in relation to Project MP and pursuant to\n                        an alleged oral agreement by D7 to increase his entitlement from 1.5% to 3%\n                        of the CKRA shares.[note: 35] The defendants’ position 16     The defendants disagree for three reasons.\n                    First, they submit that Project MP was uncompleted as it entailed the completion\n                    of the proposed rights issue and the total divestment of the CKRA shares by D1\n                    to third parties.[note: 36]Since the divestment did not take place\n                    until after some major restructuring which took place after the plaintiff\n                    resigned, Project MP was never completed during the plaintiff’s\n                    tenure. 17     Second, they submit that no fresh funds were\n                    raised for CKRA.[note: 37]In fact, losses were made when the Group\n                    (and/or D7) was unable to pay the interest due on the First RZB Loan, forcing\n                    RZB to sell the shares pledged to it in order to reduce CKRA’s interest\n                        liability.[note: 38]The plaintiff is therefore not entitled to\n                    the bonuses under cl 5.3 of the EA.[note: 39] 18     Third, the defendants submit that the First\n                    RZB Loan was only granted because of a pledge of CKRA shares in RZB’s\n                    favour. The plaintiff had merely liaised with RZB, for which he had been\n                        remunerated.[note: 40]Therefore, the plaintiff was not\n                    instrumental in obtaining the First RZB Loan.",
        "Project Gibson": "19     Project Gibson involved the RTO of RODA, a\n                    company engaged mainly in the building and development of housing projects for\n                    the middle class. It envisaged,inter alia, the\n                    Group and/or D7 injecting assets into RODA and subsequently monetising those\n                    assets so that RODA could take over several companies and stabilise its revenue\n                        stream.[note: 41]Project Gibson was to be executed in the\n                    following manner: (a)     D5 would be incorporated as an\n                        investment holding company.[note: 42]It\n                        would then subscribe for and hold shares in RODA.[note: 43]RODA would also conduct a rights issue in\n                        or around January 2008[note: 44]and the proceeds would be used\n                        as follows: (i)       40% of the proceeds would\n                            go towards acquiring apartment and retail units in a property\n                            development known as the Oakwood Premier Cozmo Jakarto (“the\n                            Oakwood units”) from PT Adhisakti Kreasi Persada\n                            (“AKP”); and (ii)       50% of the proceeds would go towards buying\n                            shares in PT Transpacific Mutual Capita (“TMC”), which in\n                            turn owned other property development\n                    projects. (b)     As\n                        RODA’s rights issue subscription had to be in cash under IDX\n                        regulations and the purchasing parties did not have sufficient cash to\n                        effect the purchase,[note: 45]a loan was taken from the\n                        Development Bank of Singapore (“DBS”) to enable D5 to\n                        subscribe for RODA shares. Eventually, D5’s purchase of RODA’s\n                        shares was done by borrowing US$115,999,561.97 from DBS under a one-day loan\n                        facility agreement.[note: 46] 20     Ultimately, the parties envisioned that RODA\n                    would be relisted, the assets owned by the injecting Indonesian companies would\n                    be monetised, and D5 would prosper from the increase in the value of the RODA\n                    shares. To achieve that goal, it was envisioned that D5 would be able to sell\n                    its RODA shareholding to third parties in the future.[note: 47]That, however, did not materialise.\n                    Additionally, neither AKP nor RODA obtained title to the Oakwood units as (a)\n                    the Oakwood units were earlier pledged to the Hong Kong and Shanghai Banking\n                    Corporation under an earlier financing agreement so that the developers would\n                    finish the property development; and (b) there were insufficient funds to redeem\n                    the Oakwood units from the existing pledge. Consequently, AKP had to cancel its\n                    sale and purchase agreement with RODA.[note: 48] The plaintiff’s position 21     The plaintiff submits that he is entitled to\n                    be remunerated as he was instrumental to Project Gibson’s success since he\n                    had successfully obtained the DBS loan for D5.[note: 49]It was because\n                    of his discussions with DBS that DBS was satisfied with the collateral provided\n                    under the financing structure that he had developed. As a result, funds were\n                    available for purchasing RODA shares. That constituted successful\n                        fundraising[note: 50]as funds were successfully\n                    raised for Project Gibson’s execution. Thus D5 successfully obtained 50.2%\n                    of the RODA shares, with the balance of the freely-tradable shares held by other\n                    entities of the Group.[note: 51]The plaintiff is therefore entitled to\n                    receive: (a)     the Annual Bonus under cl 5.3 of the\n                            EA;[note: 52] (b)     the Periodic Bonuses under cl 5.3 of the EA worth 0.5% of\n                        the US$115,999,561.97 raised;[note: 53]and (c)     3% of the\n                        RODA shares under cl 5.4 of the EA and pursuant to an alleged oral agreement\n                        by D7 to increase his entitlement from 1.5% to 3% of the RODA\n                            shares.[note: 54] The defendants’ position 22     The defendants disagree on three grounds.\n                    First, they submit that Project Gibson had envisaged that property assets would\n                    be injected into RODA. However, the intended property asset injections were\n                    unsuccessful and incurred losses. Therefore, there was neither injection of\n                    assets nor enhancement of RODA’s assets that would have led to an increase\n                    in RODA’s share value. Consequently, no interested parties invested in\n                    RODA and Project Gibson failed.[note: 55] 23     Second, the defendants submit that Project\n                    Gibson was left uncompleted as it entailed the completion of a second rights\n                    issue and the total divestment of the RODA shares by D5 to third\n                        parties.[note: 56]Since no fresh funds were received by RODA\n                    for its working capital and the funds were “round-tripped”, no\n                    real money was received by the injecting companies.[note: 57]Therefore, Project Gibson was incomplete and the plaintiff cannot claim the sums\n                    allegedly owed to him.[note: 58] 24     Third, the defendants disagree that the\n                    plaintiff was instrumental to DBS loan being obtained and assert that the loan\n                    was secured only because the acquired RODA shares were pledged to DBS as\n                        collateral.[note: 59]D7 claims that DBS granted the loan because\n                    of his own good standing and not the plaintiff’s proposed loan\n                        structure.[note: 60]The plaintiff’s task was merely to\n                    liaise with DBS and he had been duly compensated by his monthly remuneration\n                    under cl 5.1 of the EA.[note: 61]Hence, the plaintiff is\n                    not entitled to the sums claimed.",
        "The 21 Anderson Properties": "25     After the EA was signed, the plaintiff submits\n                    that D7 directed him to raise funds for the acquisition of the 21 Anderson\n                    Properties pursuant to the EA’s terms. This was a subsequent addition to\n                    Project Gibson and the plaintiff was appointed as the main liaison with various\n                    banks to raise funds for the acquisition of the 21 Anderson Properties. The plan\n                    was that D6 would secure a loan and it would then lend the sum to D3 and\n                    Springfield Ventures Group Ltd (“Springfield”), another company\n                    used for the acquisition of the 21 Anderson Properties, for them to purchase the\n                    21 Anderson Properties.[note: 62] 26     D6 eventually raised S$170.4m via RZB\n                    (“the Second RZB Loan”) and the purchase of the 21 Anderson\n                    Properties was completed on 15 April 2010 after D6 disbursed the loan to D3 and\n                        Springfield.[note: 63]Here, the plaintiff asserts that he had\n                    played an instrumental role in obtaining the Second RZB loan[note: 64]by\n                    providing a personal guarantee for it. He alleges that D7’s wife, Elsie\n                    Wijaya, was unwilling to give a personal guarantee to RZB, which was a condition\n                    that RZB was not prepared to forego.[note: 65]During cross-examination,\n                    the plaintiff described his guarantee as technically “credit\n                        enhancement”.[note: 66]Hence, the plaintiff claims that funds were\n                    successfully raised and he is entitled to 0.5% of S$170.4m raised.[note: 67] 27     Subsequently, things did not go smoothly for\n                    the 21 Anderson Properties purchase. It is here that material differences in the\n                    events leading up to the eventual sale of the 21 Anderson Properties\n                    manifest. The plaintiff’s position 28     The plaintiff submits that it was a term of\n                    the Second RZB Loan that D6 kept within the maximum loan-to-value ratio which\n                    was approved by the RZB Board, failing which D6 would be deemed to be unable to\n                    repay the loan sum. Since D6 breached the loan-to-value ratio under the loan\n                    agreement, it was deemed to be unable to repay the loan by 31 March 2011. As a\n                    result, RZB decided to sell the 21 Anderson Properties to reduce the interest\n                    payable on the loan by D6 since it was of the view that D6 could not repay the\n                    principal amount together with the accrued interest.[note: 68] 29     As a result, the plaintiff was specifically\n                    assigned to raise more funds.[note: 69]According to him, he\n                    managed to liaise with Arch Capital Management Co Ltd (“Arch\n                    Capital”) and Arch Capital Asian Partners LP (“Arch Asian”)\n                    (collectively “ARCH”), two private equity investors, to obtain\n                    funds to repay the Second RZB loan.[note: 70]This was to be done via\n                    Arch Asian purchasing the Properties for S$200m.[note: 71]This constituted funds\n                    raised for the Group and/or D7.[note: 72]The plaintiff submits\n                    that he is entitled to the 0.5% of S$200m raised.[note: 73] 30     In total, the plaintiff claims 0.5% of\n                    S$370.4m raised, amounting to S$1.852m. The defendants’ position 31     The defendants’ position is that the\n                    fund-raising in respect of the 21 Anderson Properties acquisition was not a\n                    “Fund Raising Activity” as per cl 5.3 of the EA.[note: 74]They\n                    submit that even if it was, the money was obtained due to D7’s good\n                    relationship with his ARCH contact and it was also due to this that the 21\n                    Anderson Properties were sold to Arch Asian at S$200m.[note: 75]Even\n                    though this sum went towards repaying the Second RZB Loan, D3 and Springfield\n                    suffered a total loss of S$20m.[note: 76]Since no funds from\n                    investors had been raised, D7 had no reason to declare any bonus in favour of\n                    the plaintiff.[note: 77] 32     In oral submissions, the plaintiff submitted\n                    that he no longer wanted to pursue his 21 Anderson Properties claim.[note: 78]Nevertheless in the interest of\n                    completeness and in view of the extensive written submissions that have already\n                    been made, I will address this head of the claim in my judgment.",
        "The plaintiff’s resignation": "33     The plaintiff eventually resigned in July 2010\n                    as Project Gibson and Project MP were in a mess. He submits that this was\n                    largely attributable to D7,[note: 79]who had asked him to\n                    “falsify accounts to show that the Transpacific Group was generating\n                    sufficient cashflows and could service the interest payments that were\n                        due.”[note: 80]As he could not take part in such a\n                    morally reprehensible act, he chose to resign. Furthermore, his salary for\n                    December 2009 was unpaid while his 2010 salary was paid late.[note: 81] 34     It was also around this time that the\n                    plaintiff asked DW1, Angel Setiadikurnia, D7’s daughter, to reimburse his\n                    expenses amounting to S$79,113.67. In return, he would waive his claim for the\n                    bonuses and entitlements which according to him totalled more than S$10m.\n                    However, he was only reimbursed S$25,109.15. The plaintiff submits that since he\n                    was not reimbursed in full, he now claims for his bonuses, share rewards\n                    relating to Project MP and Project Gibson, and the balance of the expenses not\n                    reimbursed to him under the EA.",
        "The counterclaims": "35     In response to this suit, the Four\n                    Counterclaimants allege that the plaintiff was in breach of his directors’\n                    duties towards D3 while he was its director. They also allege that the plaintiff\n                    had breached his duty of confidentiality to all of them when he removed\n                    documents belonging to them without their prior approval and subsequently used\n                    those documents to commence the present suit.",
        "The issues": "36     The following issues arise for my\n                    consideration: (a)     are the defendants party to the\n                        EA; (b)     does thecontra proferentemrule apply against the\n                        plaintiff since he admitted that he drafted the EA; (c)     is the plaintiff entitled to be\n                        reimbursed for the balance of his expenses incurred in the discharge of his\n                        duties under cl 5.9 of the EA; (d)     is the plaintiff entitled to the Periodic Bonuses in\n                        relation to “Fund Raising Activities” under cl 5.3 of the EA;\n                        and (e)     is the\n                        plaintiff entitled to the share rewards in relation to Project Gibson and\n                        Project MP under cll 5.4 and 5.5 of the EA. 37     The Four Counterclaimants raise the following\n                    issues: (a)     was the plaintiff in breach of\n                        directors’ duties to D3 under s 157 of the Companies Act (Cap 50, 2006\n                        Rev Ed) (“Companies Act”); and (b)     was the plaintiff in breach of his duty of\n                        confidentiality to the Four Counterclaimants. I shall first deal with the plaintiff’s claims before\n                        addressing the counterclaims.",
        "Who are the parties to the EA?": "38     When an employee contracts with a corporate\n                    group, the legal question that inevitably arises is who he is contracting with:\n                    Ravi Chandran,Employment Law in Singapore(LexisNexis, 3rd Ed, 2011) at para 1.73. In this case, the plaintiff and the\n                    defendants take opposing views as to who are the parties to the EA. At the start\n                    of the proceedings, the plaintiff’s position was that all the defendants\n                    were parties to the EA. At the closing submissions, he submitted that his\n                    counterparty was D7.[note: 82]On the other hand, the defendants submit that\n                    the plaintiff’s counterparty was PT Securindo.[note: 83] 39     It is important to note that the Group is\n                    neither incorporated nor registered in Indonesia or Singapore. Hence, it is not\n                    a legal entity and is non-existent in law, having neither legal rights nor\n                    obligations. This is also why the plaintiff did not sue the Group, although it\n                    isnamedas the counterparty in the\n                EA.",
        "The plaintiff’s case": "40     The plaintiff’s initial case was that\n                    all the seven defendants fell within the scope of the EA. He relied onZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design &\n                        Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”) where the Court of Appeal had\n                    endorsed the contextual approach to contractual interpretation, holding that the\n                    “first and foremost consideration in approaching any written contract\n                    must be the essence and attributes of the document being examined” (at\n                    [110]). Therefore, as long as extrinsic evidence is relevant and reasonably\n                    available to both parties and goes towards showing the parties’ objective\n                    intentions, it should be admitted subject to the requirements under the Evidence\n                    Act (Cap 97, 1997 Rev Ed) (at [125]).[note: 84]It was\n                    pursuant to this that the plaintiff sought to admit extrinsic evidence to prove\n                    which defendants were parties to the EA. The plaintiff’s case in relation to D1 to D6 41     The plaintiff’s case in relation to D1\n                    to D6 is as follows. First, D1 to D6 were incorporated as part of the Group on\n                    D7’s directions for holding various assets and investments belonging to\n                    the Group.[note: 85]Second, the reason why there was no\n                    specific corporate entity with which the plaintiff contracted was because it\n                    would not have been possible to list the names of all the companies forming part\n                    of the Group then.[note: 86]Third, it was the mutual intention of the\n                    plaintiff and D7 that there would be no specific company under which D7 was to\n                    serve. This was evident in cross-examination, where the plaintiff stated\n                        that:[note: 87] … There wereadditional orders and directions to\n                            be provided for. As the employee acting under the terms and\n                        conditions of that [EA], all subsequent orders must fall under the broad\n                        description of Transpacific Group. And it provides in the EA for holding\n                        companies, subsidiary companies, associates as well as other parties [to]\n                        which the seventh defendant may [be assigned] to give such orders. … … [O]rders and specific directions given by the parties authorised\n                        to do so or assigned to do so under the [EA] would then, by such action,\n                        point out the companies which fall under the [EA], as provided in [EA]\n                        itself. [emphasis added] 42     The plaintiff later conceded that his case\n                    against D1 to D6 was weak and his primary case was against D7.[note: 88]Also, he did not pursue his case in\n                    relation to D2, D3, D4 and D6 in his closing submissions, which was built around\n                    negating the defendants’ case that companies under the Group must have the\n                    “Transpacific” pre-fix in their names.[note: 89]. Moreover, he only submitted that D1 and D5 had\n                    ratified the EA by paying the plaintiff’s salary from December\n                        2009.[note: 90]Nevertheless since much time and effort\n                    was spent litigating the matter, I shall still address the parties’\n                    submissions in relation to D1 to D6. The plaintiff’s case in relation to D7 43     With respect to D7, the plaintiff first\n                    submits that D7 was party to the EA based on the indicia inChew Swee Hiang v Attorney-General and another[1990] 2 SLR(R)\n                    215. The question there was whether the employer of a government-aided school\n                    teacher was the government or the school’s management committee. In\n                    arriving at his decision, A P Rajah J held at [43] that the following indicia\n                    were relevant in establishing a contract of service: (a)     the employer’s power of\n                        selection of his employee; (b)     the payment of wages or other\n                    remuneration; (c)     the\n                        employer’s right to control the method of doing the work;\n                    and (d)     the\n                        employer’s right of suspension or dismissal. 44     On those factors, the plaintiff submits that\n                    D7 was party to the EA because healoneexercised\n                    significant power over important aspects of the plaintiff’s employment,viz:[note: 91] (a)     Clause 2.1.1, which states that the\n                        plaintiff’s duties and powers were to be exercised “as directed\n                        by [D7]”; (b)     Clause 2.1.2, which states that the plaintiff’s employment\n                        should accord with “all resolutions, regulations, policies and\n                        directions” given by D7; (c)     Clause 2.1.3, which states that D7 would have sole\n                        direction of the location of the plaintiff’s employment;\n                    and (d)     Clause 5.3,\n                        which allows D7 to decide which fund raising activities applied to the\n                        Periodic Bonuses and gives him “sole and absolute discretion”\n                        over the quantum of the said bonuses.[note: 92] 45     Second, the plaintiff submits that D7 was the\n                    party to the EA as he purported to act as the Group’s agent. 46     In support of his proposition, the plaintiff\n                    citedKelner v Baxter(1866) LR 2 CP 174\n                        (“Kelner”) (endorsed by the\n                    Court of Appeal inQuah Poh Hoe Peter v Probo Pacific Leasing\n                        Pte Ltd[1992] 3 SLR(R) 400 (“Probo\n                        Pacific”) at [18] and the English High Court inCIFAL Groupe SA and others v Meridian Securities (UK) Ltd and\n                        others[2013] EWHC 3553 (Comm) (“CIFAL”)) where the plaintiff had entered into an\n                    agreement with the defendant who had purportedly acted on behalf of an\n                    unincorporated company.[note: 93]It was held that as a matter of\n                    construction, the parties had intended for the defendants in that case to be\n                    personally bound. 47     The plaintiff submits that since the Group was\n                    non-existent and the EA had been performed on the basis that it was binding, a\n                    presumption arose that D7 intended to be personally bound by the EA.[note: 94]The plaintiff\n                    relies on the following facts in support of his position:[note: 95] (a)     the plaintiff had entered into the\n                        EA with D7 who acted on behalf of the Group; (b)     the Group had no legal capacity to enter into\n                        contractual relations; and (c)     the parties were aware that the Group had no legal\n                        capacity. Therefore the plaintiff submits\n                        that the present facts are “on all fours” withProbo Pacificand the presumption has not been\n                        rebutted by D7. Further, any other interpretation would result in the EA\n                        being a nullity.[note: 96]",
        "The defendants’ case": "D1 to D6s’ submissions 48     D1 to D6 submit that they are not party to the\n                        EA.[note: 97]First, they\n                    submit that the plaintiff should not have brought an action against\n                        them.[note: 98]Counsel for D1 to D6, Ms Ho Pei Shien Melanie (“Ms Ho”), submits\n                    that the facts of this case are highly similar toMohamed\n                        Bassatne and Others v Rifaat El Gohary and Others[2004] SGHC 63\n                        (“Mohamed Bassatne”). The\n                    circumstances that point to PT Securindo being the true contracting party under\n                    the EA are:[note: 99] (a)     both DW1 and DW2 understood that the\n                        plaintiff was appointed as a director in various companies and employed by\n                        PT Securindo; (b)     D7subjectivelybelieved that he was signing\n                        the EA on behalf of PT Securindo; and (c)     the objective indicia pointed towards the plaintiff being\n                        employed by PT Securindo:[note: 100] (i)       PT Securindo applied for\n                            the plaintiff’s employment pass;[note: 101] (ii)       PT Securindo paid for the plaintiff’s\n                            salary; (iii)       PT Securindo together with RODA and CKRA reimbursed the plaintiff\n                            for his expenses; (iv)       the plaintiff worked mainly at the premises of\n                            PT Securindo; and (v)       the plaintiff admitted that he was employed by\n                            PT Securindo at least on a temporary basis. 49     Second, the defendants submit that there are\n                    cogent reasons why D1 to D6 were not parties to the EA. With respect to D1, D3\n                    and D5, they were not even incorporated when the EA was signed. The mere fact\n                    that they were parties to the transactions and financing arrangements did not\n                    mean that they were parties to the EA. Also, they had not impliedly ratified the\n                    EA since their directors did not know of the EA’s existence until after\n                    the suit was commenced and no party had entered into the EA on their\n                    behalf. 50     Third, D7 submits that D1 to D6 do not fall\n                    within the Group as the “Transpacific group” refers to a group ofIndonesiancompanies he owned and those\n                    companies have the prefix “Transpacific” in their names.[note: 102]Since D1 to D6 do not bear the name “Transpacific” and are\n                    Singapore-incorporated as opposed to Indonesia-incorporated,[note: 103]they\n                    are not part of the Group. D7’s submissions 51     D7 submits that he is personally not party to\n                    the EA. First, he submits that his being personally liable was not the position\n                    taken by the plaintiff in his Statement of Claim (“SOC”) which had\n                    indicated that the contracting party was the Group.[note: 104]Second, he submits that he had signed the EA on\n                    behalf of the Group, which he claimed was represented by PT\n                        Securindo.[note: 105]Third, he submits that the\n                    correct counterparty to the EA should be PT Securindo due to the reasons given\n                    in [48(c)(i)] to [48(c)(v)].[note: 106]Fourth, D7 submits that the plaintiff had admitted to being employed by PT\n                    Securindo, and the plaintiff’s submission that it was merely on a\n                    temporary basis was just a mere assertion unsupported by the\n                        evidence.[note: 107]",
        "Three significant cases on which the parties’ submissions are\n                based": "52     I shall first discuss three cases which the\n                    parties made extensive submissions on. They areCIFAL,Probo Pacific, andMohamed Bassatne. CIFAL 53     InCIFAL, Groupe\n                    CIFAL and the Meridian Group had signed a high-level Strategic Partnership\n                    Agreement (“SPA”). It was agreed that the Meridian Group would\n                    invest in suitable projects which would provide strong profits and a fast return\n                    on investment (at [29]) and that Groupe CIFAL would provide the expertise in\n                    identifying and developing those projects. The collaboration failed and the\n                    plaintiffs sued the defendants. In addition to three corporate defendants which\n                    formed part of the Meridian Group, the plaintiffs tried to make Meridian\n                    Group’s agent, Mr Feld, personally liable for the claims. They contended\n                    that since Mr Feld had purported to contract on behalf of Meridian Group, a\n                    non-existent principal, he should be made personally liable. They were\n                    unsuccessful. 54     First, the court held that the argument that\n                    Meridian Group was a non-existent entity was flawed as it would mean that the\n                    plaintiffs’ case against the three corporate defendants was misconceived.\n                    Second, the plaintiffs argued that Mr Feld failed to negate his personal\n                    liability as he had represented that the Meridian Group was a corporate entity.\n                    That argument also failed as there was no evidence that Mr Feld had represented\n                    that the Meridian Group was a corporate entity. In the SPA, the Meridian Group\n                    was merely described as having a registered office at the first corporate\n                    defendant’s address. That was insufficient to find that Mr Feld had\n                    represented that the Meridian Group was the name of a corporate entity (at\n                    [94]). Third, the court noted that an Agency Agreement signed prior to the SPA\n                    had identified the three corporate defendants as the entities within the\n                    Meridian Group (at [95]). Hence, Mr Feld had negated his personal liability as\n                    the corporate entities under the Meridian Group could be identified and he was\n                    contracting on their behalf. Probo Pacific 55Probo Pacificconcerned the lease of two yachts to an unincorporated entity, Container\n                    Manufacturing Consultant Services Pte Ltd (“CMCS”). CMCS had\n                    defaulted on its lease payment and when payment was sought, the plaintiff\n                    discovered that it was not an incorporated company. The plaintiff then sought to\n                    make the defendants personally liable. 56     In its judgment, the Court of Appeal\n                    consideredKelnerand held that it did not stand\n                    just for implied ratification, but also the presumption that would arise when\n                    one party contracts as an agent for a non-existent principal and another party\n                    relies on that fact. The Court of Appeal cited the following passage fromBlack v Smallwood(1965–1966) 117 CLR 52\n                        (Probo Pacificat [18]: …Where A, purporting to act as agent for a non-existent\n                            principal, purports to make a binding contract with B, and the\n                            circumstances are such that B would suppose that a binding contract had\n                            been made, there must be a strong presumption that A has meant to bind\n                            himself personally.Where, as inKelner v\n                            Baxter, the consideration on B’s part has been fully\n                        executed in reliance on the existence of a contract binding on somebody, the\n                        presumption could … only be rebutted in very exceptional\n                        circumstances.But the fundamental question in every case\n                            must be what the parties intended or must be fairly understood to have\n                            intended.… [emphasis added] 57     The Court of Appeal held that since the second\n                    defendant had acted as an agent for a non-existent principal, there was an\n                    unrebutted presumption that the second defendant intended to bind himself\n                    personally:Probo Pacificat [19]. Therefore, he\n                    was personally liable for the contractual payment. Mohamed Bassatne 58     The last case isMohamed\n                        Bassatne. The plaintiffs had signed a Memorandum of Understanding\n                    (“MOU”) to establish a joint venture company with a party known as\n                    the “Bakri Group of Companies, Jeddah, Saudi Arabia” (“the\n                    Bakri Group”). It was their case that the second and third defendants,\n                    Bakri International Energy Co Ltd and the third defendant, Bakri Trading Company\n                    Inc, were both part of the Bakri Group and thus parties to the MOU. Similar to\n                    the present case, the plaintiffs inMohamed\n                        Bassatnesubmitted that the Bakri Group referred to all companies\n                    bearing the “Bakri” name, set up by the Bakri family and based in\n                    Jeddah: seeMohamed Bassatneat\n                [134]. 59     Lai Siu Chiu J held that the second defendant\n                    was party to the MOU but not the third defendant. She noted three particular\n                    facts which pointed towards the second defendant being party to the MOU: (a)     an internal memorandum from another\n                        Bakri-related entity to the second defendant referred to a joint venture\n                        between the plaintiffs and the second defendant; (b)     it was the second defendant who\n                        appointed auditors to audit the joint venture company;\n                    and (c)     when a letter\n                        of demand was sent to the second defendant in relation to the joint venture,\n                        there was no attempt made to dissociate the second defendant from the\n                        dispute. 60     Given that the three affirmative factors were\n                    absent where the third defendant was concerned, Lai J held that the plaintiffs\n                    had made out their case only in relation to the second defendant but not the\n                    third.",
        "My decision": "61     It is trite that companies within a group are\n                    separate entities. Judith Prakash J held inWin Line (UK) Ltd\n                        v Masterpart (Singapore) Pte Ltd and another[1999] 2 SLR(R) 24\n                    at [43] that: … In theCape Industriescase ([30]supra), the court considered that the\n                        concept of the group as a single economic entity could not justify any\n                        departure from the normal rule that each “company in a group of\n                        companies …is a separate legal entity possessed of separate legal\n                            right and liabilities”. … [emphasis\n                        added] 62     Therefore, where a contract is signed on\n                    behalf of a corporate group, one should not automatically presume that all the\n                    group companies are jointly and severally liable. Faced with ambiguity, a court\n                    should consider extrinsic evidence in determining who the true contracting\n                    parties are. In my view, D7 was the plaintiff’s counterparty. I shall\n                    first explain why D1 to D6 are not party to the EA before explaining why D7 is\n                    party to it. D1, D3 and D5 were not party to the EA 63     In my view, D1, D3 and D5 were not party to\n                    the EA as they had not been incorporated when the EA was signed on 1 August\n                        2007.[note: 108]They could not have had legal capacity to\n                    contract at that point in time. 64     Second, I am not persuaded that D1 and D5\n                    ratified the EA. The common law position is that,prima\n                        facie, contracts entered into before a company is incorporated\n                    only confer rights on the actual makers of the contract, not the company. A\n                    company cannot ratify or adopt a contract made ostensibly on its behalf before\n                    its incorporation, since a legal person cannot make himself liable as a\n                    principal by a subsequent ratification if it was not in existence at the time of\n                    the original contract: Hugh G Beale,Chitty on\n                        Contractsvol 1 (Sweet & Maxwell, 31st Ed, 2012) at paras\n                    9–012 to 9–014 andWalter Woon on Company\n                        Law(Tan Cheng Han gen ed) (Sweet & Maxwell, 3rd Rev Ed,\n                    2009) (“Walter Woon”) at para 3.56.\n                    That pre-incorporation contracts cannot be ratified under the common law is seen\n                    inKepong Prospecting Ltd and others v Schmidt[1968] 1 AC 810 where Lord Wilberforce held at 824 that: … services “prior to [a company’s] formation”\n                        cannot amount to consideration. No services can be rendered to a\n                        non-existent company, nor can a company bind itself to pay for services\n                        claimed to have been rendered before its incorporation. … 65     Therefore, D1 and D5 did not ratify the EA at\n                    common law. 66     Third, the plaintiff seeks to rely on the\n                    doctrine of implied ratification under s 41 of the Companies Act (Cap 50, 2006\n                    Rev Ed) to show that D1 and D5 impliedly ratified the EA. Section 41 reads as\n                    follows: Ratification by company of\n                            contracts made before incorporation 41.—(1) Any contract or other\n                        transaction purporting to be entered into by a company prior to its\n                        formation or by any person on behalf of a company prior to its formation may\n                        be ratified by the company after its formation and thereupon the company\n                        shall become bound by and entitled to the benefit thereof as if it had been\n                        in existence at the date of the contract or other transaction and had been a\n                        party thereto. (2) Prior to ratification by the company the person or persons who\n                        purported to act in the name or on behalf of the company shall in the\n                        absence of express agreement to the contrary be personally bound by the\n                        contract or other transaction and entitled to the benefit thereof. 67     The plaintiff cites two cases in support of\n                    his submission:Cosmic Insurance Corp Ltd v Khoo Chiang\n                        Poh[1979–1980] SLR(R) 703 (“Cosmic Insurance”) andThe Golf Cheque\n                        Book Sdn Bhd & Anor v Nilai Springs Bhd[2006] 1 MLJ 554\n                        (“Nilai Springs”). He seeks to\n                    show that ratification can be implicit and that s 41 should be construed broadly\n                    since it is intended to be a remedial or saving provision where contracts are\n                    entered into before a company is incorporated.[note: 109]His case is that D1 and D5 impliedly ratified\n                    the EA as they paid for the plaintiff’s salary since December 2009. I do\n                    not agree for the following two reasons. 68     First, the position in s 41 is different from\n                    the common law position inKelner.Cosmic Insurance, which was decided on the then s 35(1)\n                    of the Companies Act (Cap 185, 1970 Rev Ed) (which isin pari\n                        materiawith s 41), shows this difference. There, the Privy\n                    Council appreciated that had the case been decided according to the common law\n                    position, a different conclusion might have been reached. Lord Roskill held (at\n                    [9]) that: … if this appeal fell to be decided in accordance with the\n                        principles established byKelner v Baxter(1866) CP 174 and many subsequent English decisions to the same effect it\n                        could not be successfully contended that the appellants were contractually\n                        bound … . 69     Similarly,Walter\n                        Woonat paras 3.56­­­–3.58 observes that s 41 was enacted\n                    to remedy the common law position such that the persons acting in the\n                    company’s name are bound by and entitled to the benefit of the contract\n                    until the company ratifies it. Two requirements are needed: (a) the contract\n                    must purportedly have been entered into by the company or by any other person on\n                    its behalf before incorporation; and (b) the company must ratify the contract\n                    after its formation:Cosmic Insuranceat [10].\n                    Once the company ratifies the contract, that ratification is effectiveas thoughthe company had existed at the time of the\n                    contract. 70     On the facts, neither requirement was met.\n                    First, there is no evidence that D7 entered into the EA specifically on behalf\n                    of D1 and D5. InCosmic Insurance, the\n                    court’s decision was based on a letter which showed that the\n                    parties’ intention was for the company to be bound post-incorporation.\n                    Also, there was a company resolution which was passed to bind the company to the\n                    pre-incorporation contract (at [13]–[15]). Under those circumstances, it\n                    was clear that the parties intended for the company to be bound upon\n                    incorporation. That is not the case here. 71     Instead, the facts here show that D7 had\n                    signed a contract on behalf of the Group but the plaintiff was unclear which\n                    companies fell within the Group.[note: 110]The\n                    plaintiff was also unsure which companies were bound by the EA and hence there\n                    is no evidence that D7 entered into the EA on behalf of D1 and D5. 72     Second, there is no evidence to suggest that\n                    D1 and D5 had impliedly ratified the EA after their incorporation. Implied\n                    ratification takes place only where the company does anunequivocalact indicating its willingness to be bound by the\n                    contract earlier entered into.Walter Woonat para\n                    3.60 gives the example of a company using goods ordered under the\n                    pre-incorporation contract. 73     InForman & Co\n                        Proprietary, Ltd v The Ship “Liddesdale”[1900] 1\n                    AC 190 at 204, ratification was not found as the company’s conduct was\n                    interpreted in some other way which did not imply ratification. Similarly, it\n                    would be incredible if a finding is made that D1 and D5 impliedly ratified the\n                    EA based on the conduct relied upon by the plaintiff (see [42] above). There\n                    could be numerous reasons why D1 and D5 paid the plaintiff’s salary,\n                    especially in a situation where D7, who ultimately owned all the companies, was\n                    not doing well financially.Ipso facto, such\n                    conduct cannot affirmatively show that D1 and D5 impliedly ratified the\n                    contract. The facts are distinct from the facts inCosmic\n                        Insurance, in which the conduct of the parties pointedunequivocallytowards the contract being ratified.\n                    Therefore, I find that D1, D3 and D5 are not parties to the EA and D1 and D5 did\n                    not impliedly ratify the EA by conduct. D2, D4 and D6 are not party to the EA 74     The plaintiff’s evidence also does not\n                    establish that D2, D4 and D6 were parties to the EA for two\n                reasons. 75     First, the plaintiff submits that D1 to D6\n                    have a common owner,ie, D7.[note: 111]However, having a common owner is not\n                    a basis for binding a party to an agreement as each of the defendants is a\n                    separate legal entity. 76     Second, the plaintiff seeks to defeat the\n                    defendants’ position that the Group only consists of\n                    Indonesian-incorporated companies by relying on an MAS notice filed on MAS.net\n                    by Lereno, announcing D7’s appointment as a director.[note: 112]He\n                    submits that the MAS announcement did not contain the pre-fix\n                        “PT”,[note: 113]the\n                    Indonesian pre-fix for companies referring to Indonesian-incorporated\n                        companies.[note: 114]Since there was no pre-fix\n                    “PT” (which referred to Indonesian-incorporated companies) in the\n                    announcement, it is possible for Singapore-incorporated companies to be part of\n                    the Group[note: 115]and also for D2, D4 and D6\n                    fall within the Group. 77     In my view, the plaintiff’s evidence is\n                    inconsistent. Initially, he insisted that there was no pre-fix\n                    “PT” in the MAS announcement[note: 116]and\n                    took the view that it was possible for Singapore-incorporated companies to be\n                    part of the Group. However, he changed his position when he realised that the\n                    MAS announcement contained the pre-fix “PT”.[note: 117]Once confident that the MAS\n                    announcement did not contain the pre-fix “PT”, he now takes the\n                    position that the MAS announcement is inaccurate[note: 118]and\n                    submits that he was made to believe that many companies under the Group did not\n                    have the “Transpacific” name.[note: 119]With\n                    such material inconsistencies, I find that the plaintiff has failed to prove\n                    that D2, D4 and D6 were parties to the EA. I should also state that I accept the\n                    defendants’ submission that companies which fall within the\n                    “Transpacific Group” will bear the word\n                    “Transpacific” in their names. Since D1 to D6 do not bear the word\n                    “Transpacific” in their names, they are not part of the\n                    “Transpacific Group”. Was D7 the counterparty to the EA? 78     I find that it is more probable that D7 was\n                    the plaintiff’s counterparty. There are two possible interpretations of\n                    the facts: (a)     the plaintiff could have contracted\n                        directly with D7 and PT Securindo used as a means to give effect to the EA;\n                        or (b)     the\n                        plaintiff could have contracted with PT Securindo with D7 contracting on its\n                        behalf. 79     I will first address the plaintiff’s\n                    objection based on the defendants’ failure to plead their case adequately\n                    before giving the reasons why I prefer interpretation (a). (I)   Did the defendants’ plead their case\n                sufficiently? 80     In his submissions, the plaintiff submits that\n                    the defendants did not plead that PT Securindo was the plaintiff’s\n                    counterparty to the EA.[note: 120]Therefore the defendants cannot now seek to prove that PT Securindo was the\n                    plaintiff’s counterparty. I disagree as I find that while the defendants\n                    might have failed to plead the fact that PT Securindo was the plaintiff’s\n                    counterparty, the plaintiff did not appear to have been taken by surprise at\n                    trial and had therefore waived or consented to the defendants’ departure\n                    from their defence. 81     InSheagar s/o T M Veloo v\n                        Belfield International (Hong Kong) Ltd[2014] 3 SLR 524 at [94],\n                    Sundaresh Menon CJ held that in an adversarial system, the general rule is that\n                    parties and the court are bound by the pleadings, which serve the function of\n                    upholding the rules of natural justice. Menon CJ stated at [94]: … [The pleadings] require a party to give his opponent notice of\n                        the case he has to meet toavoid his opponent being taken\n                            by surprise at trial. They also define the matters to be\n                        decided by the court. [emphasis added] 82     InSuperintendent of Lands\n                        and Surveys (4th Div) & Anor v Hamit bin Matusin & Ors[1994] 3 MLJ 185 (which was cited inSingapore Civil\n                        Procedure 2015vol 1 (G P Selvam gen ed) (Sweet & Maxwell,\n                    2015) at para 18/7/12), Peh Swee Chin SCJ held that: If a party is taken by surprise, he must object then and there at the\n                        point of time when such evidence emerges, for such evidence to be\n                        disregarded by the court, and the court will then uphold such timely\n                        objection. The court will generally, however, grant an adjournment if\n                        requested, on suitable terms as to costs, etc, for the pleading to be\n                        amended by the party seeking to adduce such evidence. One must bear in mind\n                        the need for an orderly adversary system of a court trial, not a chaotic\n                        harangue in a market place. A party is not taken by surprise when the circumstances\n                            actually indicate so, eg when such evidence is the very evidence sought\n                            to be relied on by him from the outset, or when he fails to object to\n                            such evidence then and there as this court now seeks to\n                            emphasize. [emphasis added] 83     I find that the defendants merely denied that\n                    they were party to the EA and put the plaintiff to strict proof in their\n                    pleadings. The relevant portions are reproduced as follows: Statement of Claim (Amendment No. 1) 3.    At all material times, the\n                                7thDefendant was thedirect or indirect owner andChief Executive Officer(“CEO”)of the\n                                1stDefendant,\n                                2ndDefendant,\n                                3rdDefendant,\n                                4thDefendant,\n                                5thDefendant and\n                                6thDefendant (which are companies owned\n                            directly or indirectly by the 7thDefendant),\n                            and/or the Transpacific Group, and exercised and continues to exercise\n                            absolute control over the 1stDefendant,\n                                2ndDefendant,\n                                3rdDefendant,\n                                4thDefendant,\n                                5thDefendant and\n                                6thDefendant (which are companies owned\n                            directly or indirectly by the 7thDefendant),\n                            and/or the Transpacific Group. Defence and counterclaim of the 1st to 6th defendants\n                            (Amendment No. 1) 4.    Paragraph 3 of theAmendedStatement of Claim is not admitted andthe Plaintiff is put to strict proofthereof. Defence of the 7th Defendant (Amendment No.\n                            1) 3.    Save that the 7thDefendant has been a director of the 3rdDefendant and the 6thDefendant since 16\n                            October 2007 and 27 January 2010 respectively, paragraph 3 of the\n                            Statement of Claim(Amendment No. 1)isnot admitted and the plaintiff is put to strict\n                                proof. [Original emphasis underlined; emphasis added in italics] 84     It is clear from the above that the\n                    defendants’ pleaded defence is founded on negating the plaintiff’s\n                    claim and not on proof that PT Securindo was the real counterparty under the EA.\n                    Be that as it may, the plaintiff did not object to the adducing of evidence with\n                    respect to PT Securindo being the plaintiff’s counterparty and does not\n                    appear to have been taken by surprise in the proceedings before me. His conduct\n                    suggests that he has waived or consented to the defendants’ departure from\n                    their pleaded defence. Thus, his objection based on the defendant’s\n                    failure to plead cannot succeed. (II)   Do the surrounding circumstances at formation point to the\n                plaintiff’s counterparty being D7? 85     Moving to the issue proper, having gone\n                    through the facts ofCIFAL,Probo PacificandMohamed Bassatne(see [53]–[59] above), the legal position is that a party is presumed to\n                    have contracted personally if the entity he is signing on behalf of is\n                    non-existent or he has not rebutted the presumption that he is personally liable\n                    by showing that he was signing on behalf of corporate entities under an\n                    unincorporated group. Ultimately, the parties’ intentions must be\n                    construed. On the facts, I find that it was D7 who was party to the EA and not\n                    PT Securindo. 86     The evidence indicates that when the plaintiff\n                    entered into the EA, he did not know how many companies were within the\n                    Transpacific Group. Even if he knew, he had no idea which company he was to work\n                        for.[note: 121]He only knew that he was to work\n                    for the Group under D7’s control. In contrast, D7 knew which companies\n                    were within the Group and which company the plaintiff was to work for. In fact,\n                    under cross-examination, D7 admitted that his intention was for the plaintiff to\n                    work in PT Securindo:[note: 122] Er, by knowing [the plaintiff] more, his expertise is a banker. Can I add?\n                        Also into corporate finance. Can I add? The most suitable for him during\n                        that period, er,Transpac Securindois the\n                        vehicle, that investment bank, yah. Can I add? We have experience selling\n                        Indon largest two bank to Temasek. [emphasis added] 87     That being the case, it is surprising that D7\n                    did notspecificallyidentify PT Securindo in the\n                    EA. Instead D7 signed on behalf of the Transpacific Group. Why was it so\n                    difficult for him to name PT Securindo as the entity that he was contracting on\n                    behalf of if it was indeed his intention that the plaintiff was to be employed\n                    by PT Securindo? 88     During oral submissions, the defendants made\n                    continuous reference to the fact that the plaintiff changed his position several\n                    times under cross-examination. They submit that he could not give a clear answer\n                    as to who he was contracting with[note: 123]and\n                    thus that his testimony cannot be believed.[note: 124]However, I find that it was not and would not be easy for the plaintiff, a\n                    non-legally trained person, to respond to a legal issue of legal personality,\n                    especially when he now found out that the entity he had been contracting with\n                    had no legal personality.[note: 125] 89     Ms Ho submits that the plaintiff knew of PT\n                    Securindo’s existence by relying on a document produced by the plaintiff\n                    which referred to D7 as the “founder of the PT Transpacific Group of\n                    companies which includes stock broking, insurance, consumer financing, banking\n                    and property development.”[note: 126]Additionally,\n                    she submits that under cross-examination, the plaintiff admitted to knowing that\n                    PT Securindo formed part of the Group. The relevant portion she relies on are as\n                        follows:[note: 127] Er, the def---definition of Transpacific Group as set out earlier.\n                        Stockbroking would refer to item 34 which is Transpacific Securindo.\n                        Consumer finance, I’m not quite sure which one it is. Banking would be\n                        Bank Multicor which is item 45. S---property development would be\n                        Intermustika Mutiara which is item 36, erm, as well as item 47, Cozmo Bali\n                        Jimbaran. 90     I do not think that the above can be relied on\n                    to show that the plaintiff had knowledge of PT Securindo when the EA was signed.\n                    The plaintiff did not specify whether his knowledge about PT Securindo came\n                    about at the time he signed the EA or after. When he was cross-examined, he\n                    already had the benefit of working in the Group for a substantial period of time\n                    and his knowledge was with the benefit of hindsight. The above passage is\n                    therefore insufficient to warrant a finding that the plaintiff had knowledge of\n                    PT Securindo when the EA was signed. Instead, from the circumstances, I find\n                    that the parties’ intentions must have been for the plaintiff to contract\n                    with D7 and subsequent to the signing of the EA, the plaintiff would be assigned\n                    by D7 to work in one of the Group companies. This interpretation makes sense,\n                    and is corroborated by cl 2.1.1 of the EA, which reads:[note: 128] 2.1.1 [The plaintiff shall] [u]ndertake such duties\n                            and exercise such powers in relation to the Company and its business as\n                            directed bySuganda Setiadikurniaor his\n                            successors or assigns … shall from time to time assign to or vest\n                            in the [the plaintiff]. However, the responsibilities and duties must be\n                            legal and reasonably consistent with the Executive’s designation.\n                            [emphasis in original] (III)   Does the subsequent conduct of the parties’\n                evidentially show that the plaintiff’s counterparty is D7? 91     Next, the parties’ subsequent conduct,\n                    which can be considered if evidentially probative (see V K Rajah,\n                    “Redrawing the Boundaries of Contractual Interpretation” (2010) 22\n                    SAcLJ 513 at para 48),indicatesthat the\n                    plaintiff’s counterparty is D7. 92     First, the plaintiffprimarilytook instructions from D7, who admitted to being the\n                    CEO mentioned in the EA during cross-examination.[note: 129]D7\n                    controlled key aspects of the plaintiff’s employment, including\n                    accommodation, expenses, what he could or could not do, the direction of the\n                    projects, where he was posted to work, determined his bonuses and paid his\n                        salary.[note: 130] 93     Second, although the plaintiff’s work\n                    permit was issued under the name of PT Securindo,in\n                        reality, it was a means by which the plaintiff effected the\n                    implementation of the EA. D7 admitted under cross-examination that at the time\n                    of signing the EA, there were more than ten companies “under the\n                    Transpacific umbrella” and he was not too sure which was the most\n                    applicable to the plaintiff.[note: 131]In\n                    fact, the plaintiff admitted in cross-examination that he was only temporarily\n                    employed by PT Securindo because the parties had to meet regulations set byBadan Pengawas Pasar Modal & Lembaga\n                        Keuangan, also Indonesia’s stock market\n                        regulator.[note: 132]Thereafter, he was deployed\n                    wherever D7 intended for him to be deployed.[note: 133]Eventually, he was placed in\n                    RODA and CKRA, companies which did not exist at the time the EA was\n                        signed.[note: 134]He was also\n                    appointed as the director of D2, D3, D4 and D6.[note: 135]The facts thus\n                    point towards D7 being the party to the EA while the employment pass with PT\n                    Securindo was merely a means to effect the parties’ mutual intention for\n                    the plaintiff to work in Indonesia for various companies under the\n                Group. 94     Therefore I find that while the EA did not\n                    state D7 as the contracting party, he wasin factthe contracting party to the EA. There was no specific identification of the\n                    corporate entities from the Group in the EA when it was signed. For all intents\n                    and purposes, D7 had in his mind the knowledge that he was contracting with the\n                    plaintiff with a view that he would be assigned to work in one of the\n                    Group’s companies. 95     In the premises, I hold that the plaintiff has\n                    no course of action against D1 to D6 in this suit as they are not parties to the\n                    EA. However, I find that D7 is party to the EA. I shall proceed to address\n                    whether D7 is liable to the plaintiff for the various claims sought. I note that\n                    the defendants have raised the issue of whether thecontra\n                        proferentemrule should apply so that the terms of the EA are\n                    construed against the plaintiff. They also raised the issue of whether the\n                    plaintiff had waived his claim for the bonuses and share rewards. I shall first\n                    consider whether thecontra proferentemrule\n                    should apply in interpreting the contractual clauses before proceeding to\n                    consider the plaintiff’s substantive claims.",
        "Should thecontra proferentemrule\n                apply against the plaintiff?": "96     The defendants submit that thecontra proferentemrule should apply against the\n                    plaintiff such that the clauses relied on by the plaintiff are interpreted\n                    against him. They submit that the rationale of the rule supports its application\n                    in the present case as the EA was drafted by the plaintiff and he is now relying\n                    on it to assert his claim against the defendants.[note: 136] 97     The plaintiff opposes the application of thecontra proferentemrule because he says that\n                    the EA was negotiated on an equal footing between himself and D7. His argument\n                    is that the rule does not apply to negotiated contracts and should only apply to\n                    situations where the parties are not of equal bargaining power.[note: 137]The plaintiff’s oral submissions\n                    are as follows:[note: 138] … We submit that the very essence andraison\n                            d’etreof thecontra\n                            proferentemrule,is to protect parties\n                            who are of unequal bargaining power, namely the weaker party. It has no\n                            application in the situation where parties had contracted as equals and\n                            each had the opportunity to advance their respective\n                            interest.… [emphasis added] 98     Two questions must be considered when applying\n                    thecontra proferentemrule: (a) was there any\n                    ambiguity in the EA; and (b) if so, who was the party against whom the clauses\n                    were sought to be interpreted against:LTT Global Consultants\n                        v BMC Academy Pte Ltd[2011] 3 SLR 903 (“LTT Global”) at [56]–[57].Tam Wing Chuen v Bank of Credit and Commerce Hong Kong Ltd (in\n                        liq)[1996] 2 BCLC 69 (“Tam Wing\n                        Chuen”) at 77 gives the rationale for this: … [A] person who puts forward the wording of a proposed agreement\n                        may be assumed to have looked after his own interests so that if the words\n                        leave room for doubt about whether he is intended to have a particular\n                        benefit there is reason to suppose that he is not. … 99     InLTT Globalat\n                    [56], Prakash J held that there must first be an “ambiguity in the\n                    contract which cannot be resolved by interpreting the term in the context of the\n                    overall contract.” It is my finding that certain clauses relied upon by\n                    the plaintiff here are ambiguous for the following reasons: (a)     Clause 5.3 did not make clear the\n                        fund-raising activities which the plaintiff was to undertake. The scope and\n                        context of the activities were also ambiguous. (b)     Clauses 5.4 and 5.5 did not mention what was\n                        meant by and what constituted 1.5% of 100%. 100    The second stage involves identifying the\n                    person against whose interests the ambiguous term should be read:LTT Globalat [57]. In dealing with this issue, I have\n                    to consider which parties were involved in the drafting of the EA. However, the\n                    circumstances leading up to the eventual signing of the EA are\n                disputed. 101    The plaintiff submits that he used the\n                    employment contract of his former university classmate, Mr Wan Kum Tho\n                    (“Mr Wan”), when Mr Wan considered taking up the job offer from\n                    D7, as a template. He also submits that D7 is a “sophisticated corporate\n                    financier well-schooled in the ways of the business world and corporate\n                        finance\".[note: 139]Thus D7 would not sign the EA if he\n                    disagreed with its conditions. 102    On the other hand, the defendants submit\n                    that it was the plaintiff who drafted the EA. They note that the plaintiff had\n                    shifted his position regarding the circumstances leading up to the eventual EA\n                    being signed. Initially, the plaintiff denied that he was involved in the\n                    preparation of the draft EA but later admitted to his involvement in the\n                    drafting and incorporation of amendments to the draft EA based on D7’s\n                        instructions.[note: 140]D7 also testified that it was the\n                    plaintiff who had drafted most of the disputed clauses and he buttressed his\n                    position by saying that (a) the Group did not have the competency to draft such\n                    a detailed EA in English; and (b) he only had a basic command of\n                        English.[note: 141]Since it\n                    was the plaintiff who drafted the clauses in question, D7 submits that the\n                    ambiguities should be construed against the plaintiff as he must be taken to\n                    have looked after his own interests:Tam Wing\n                        Chuenat [77]. 103    It is trite that thecontra proferentemrule serves the basic purpose of protecting\n                    weaker parties faced with an inequality of bargaining power. In Kim Lewison,The Interpretation of Contracts(Sweet &\n                    Maxwell, 5th Ed, 2011) (“The Interpretation of\n                        Contracts”) at p 362, the author comments that\n                    “[t]he origin and first purpose of the principle is to limit the power of\n                    a dominant contractor who is able to deal on its own take-it-or-leave-it terms\n                    with others.” He helpfully points toOxonica Energy\n                        Ltd v Neuftec Ltd[2008] EWHC 2127 (Pat) where Peter Prescott QC\n                    at [90] observed that the principle is one imported from Roman law which sought\n                    to protect parties in situations where they do not have any opportunity to\n                    negotiate the terms of the agreement. It is therefore hard to apply thecontra proferentemwhere contracts are\n                    bilaterally negotiated on an equal footing (LTT\n                        Globalat [58]) and John W Carter,The\n                        Construction of Commercial Contracts(Hart Publishing, 2013) at p\n                    149, comments that the rule should only be relevant in order to keep the clause\n                    from being void for certainty. 104    I do not think that thecontra proferentemrule should be applied against the plaintiff\n                    for the following three reasons. First, I find that the EA wasto some extentbilaterally negotiated. While D7 did not\n                    agree to the terms of the plaintiff, the original EA was modified as evinced by\n                    the Handwritten Amendments. In the words of Prakash J inLTT\n                        Globalat [59], “[t]his was not a case of a standard form\n                    contract which the defendant had no choice but to take or\n                leave.” 105    Second, both the plaintiff and D7 are\n                    commercial men and have the ability to protect their own interests. While\n                    D7’s poor command of English was raised as a reason for why thecontra proferentemrule should be applied against the\n                    plaintiff, I am not convinced. During the course of the court proceedings, D7\n                    was able to testify in English. While not entirely fluent, he was at least\n                    coherent and could understand the questions that were posed to him by counsel.\n                    His language handicap was not as great as he made it seem to be. 106    Third, the plaintiff submits in his reply\n                    submission that:[note: 142] The 7thdefendant is an experienced and\n                        successful businessman, with the commercial nous that these attributes would\n                        entail.That he would helplessly allow a prospective\n                            employee free reign (sic) to dictate the terms of his employment, in\n                            particular clauses that provided for potentially lucrative remuneration,\n                            beggars belief. [emphasis added] If D7 did not understand any of the terms in the EA, I am\n                        confident that being the experienced and successful businessman that he is,\n                        he would have asked or at least sought clarification as to the terms before\n                        he signed the EA. For the foregoing reasons, I hold that thecontra proferentemrule should not be applied\n                        against the plaintiff.",
        "Is the plaintiff entitled to the remainder of his expenses?": "107    Coming to the plaintiff’s claims\n                    proper, the plaintiff first seeks the remainder of his expenses claim on the\n                    basis that they were “incurred in the course of and for the purposes of\n                    the Plaintiff’s employment”.[note: 143]The breakdown of hisfullreimbursement claim is as follows: (a)     telephone bills from March 2008 to\n                        July 2010 amounting to S$29,285.52;[note: 144] (b)     flights from January 2009 to June 2010 amounting to\n                            S$35,470.89;[note: 145] (c)     fees for Indonesian visa applications amounting\n                        to S$860.00;[note: 146] (d)     reimbursement for the purchase of equipment and\n                        payment of intern allowances amounting to S$6,962.50;[note: 147]and (e)     entertainment and other expenses necessarily\n                        incurred amounting to S$6,534.76.[note: 148] 108    Although the plaintiff’s full claim\n                    was for S$79,113.67, he seeks to claim only S$54,004.52 in the present action as\n                    he had already been paid S$25,109.15 in 2010.[note: 149]The claim\n                    process was as follows. First, he submitted his claims to DW1, also D3’s\n                        director.[note: 150]In processing the claims, she would ask the\n                    plaintiff for the invoices and other supporting documents, which were provided\n                    to her. She would then group the documents by year and ascertain whether the\n                    expenses were reasonable.[note: 151]Finally, the Human Resources Department of PT Securindo would decide whether the\n                    claims were work-related before the board gave its approval.[note: 152]Eventually, only\n                    S$25,109.15 of the plaintiff’s total reimbursement claims was approved.\n                    D7’s position is that he had not seen the plaintiff’s claim for the\n                    other expenses and that he should not be liable for them.[note: 153] 109    I find that the plaintiff is not entitled to\n                    the remainder of his expenses claim as he has not proven his case on the balance\n                    of probabilities. The right to reimbursement of the plaintiff’s expenses\n                    is not an unconditional one. According to cl 5.9, they must be “incurred\n                    in or about the discharge of [his] duties” and must be reasonable. While\n                    the plaintiff submits that he incurred the expenses, he did not produce evidence\n                    to show that the expenses were incurred in the discharge of his duties or that\n                    they were reasonable. Furthermore, under normal circumstances, I would have\n                    expected the plaintiff to claim for reimbursement as and when expenses were\n                    incurred. However there is no evidence to indicate whether he had made any claim\n                    for reimbursement in the past. There was also no explanation for why he\n                    accumulated his reimbursement claims over such a prolonged period and only\n                    lodged these claims when he was about to resign. There is also no evidence that\n                    he or his staff kept proper and accurate records of his official expenses in the\n                    course of his employment. 110    I am thus not satisfied that the expenses\n                    were incurred “in or about the discharge of [his] duties”. That\n                    being the case, I hold that the plaintiff is not entitled to claim for the\n                    remainder of his expenses which were not approved by DW1.",
        "Did the plaintiff waive his bonus payment and share rewards\n                claims?": "111    Turning to the plaintiff’s bonus\n                    payment and share rewards claims, the defendants submit that they should not be\n                    allowed because the plaintiff had waived those claims when he accepted his\n                    reimbursement for his expenses.[note: 154]In DW1’s affidavit, she referred\n                    to two emails sent to her by the plaintiff. The first email dated 17 July 2010\n                        reads:[note: 155] I am only prepared to receive payment for the work put in till 30 June\n                        2010 and not a single day more. As for expenses, these were paid by me or\n                        incurred on your dad’s behalf and I must be paid back. As for the numerous fees and free shares due to me contractually plus all\n                        the little bits and pieces your dad also verbally promised me separately,I am prepared to waive entirely. [emphasis added] 112    This was followed by an email on 27 July\n                    2010 which states:[note: 156] Please therefore confirm by email that I would be given a cross check for\n                        S$78,803.29 payable to Leong Hin Chuee which will represent final payment\n                        for all expenses … I am prepared to waive the 1.5% of 100% free\n                        shares (as amended by Bapak in writing) on RODA and CKRA on my contract as\n                        well as the 0.25% to 0.5% fees for net funds raised (which is US$20 million\n                        plus S$170 million for 21 Anderson alone or some S$500k at minimum) also set\n                        out in my contract. 113    Pursuant to these emails, DW1 replied the\n                    plaintiff on 24 October 2010:[note: 157] The cheque has [sic] been prepared since a\n                        month ago and notice ad been given to you for itto [sic] be picked up. As such, Cozmo do not have any\n                        outstanding [sic] with you anymore and legal\n                            [sic] action will thus be not necessary or\n                        valid. 114    This cheque was collected and cashed by the\n                        plaintiff.[note: 158]Thereafter, the defendants\n                    thought that the plaintiff’s claims under the EA had been resolved until\n                    the plaintiff commenced this suit about one and a half years later.[note: 159] 115    In their defence, the defendants submit that\n                    the plaintiff had waived his other claims under the EA.[note: 160]This is\n                    because: (a)     the plaintiff had been (and\n                        acknowledged that he was) well-compensated by his monthly salary and the\n                        perks received,[note: 161]receiving a generous pay package of\n                        S$25,000 per month with a serviced apartment and two company\n                    cars; (b)     the\n                        plaintiff’s claims for performance bonuses and success fees are\n                        unmerited and his lack of belief in his claim of over S$10m can be seen from\n                        how ready he was to waive them;[note: 162]and (c)     the plaintiff accepted the defendant’s\n                        counteroffer of S$25,109.15 for reimbursement of his expenses when he banked\n                        in the cheque for the said amount.[note: 163]Thus the defendants assumed that the\n                        plaintiff had agreed to waive his bonus and success fee\n                    claims. 116    The plaintiff agrees with the defendants to\n                    the extent that he wasinitiallywilling to waive\n                    his other claims when he sought reimbursement of his expenses as he had intended\n                    for a “clean break” from the “mess” so he could\n                    “move on”.[note: 164]However, he now submits that the\n                    defendants had not agreed to this as he was not paid in full for his claim of\n                        reimbursement.[note: 165]Therefore, he now wants to pursue his\n                    claims under the EA. 117    I shall now deal with the three grounds of\n                    waiver raised by the defendants.",
        "The plaintiff’s salary was irrelevant in considering the waiver\n                issue": "118    It is true that the plaintiff’s salary\n                    was very attractive. However, this may not be relevant as to whether he had\n                    waived his other claims. Waiver is premised on totally different grounds and the\n                    fact that he was well-remunerated cannot mean that he had waived his claim via\n                    estoppel or election.",
        "The plaintiff could not have honestly believed in his share rewards\n                and bonus payment claims": "119    I find that it is improbable that the\n                    plaintiff had any honest belief in his share rewards and bonus payment claims.\n                    He was clearly aware that he had sought a total reimbursement of S$79,113.67. In\n                    contrast, his other claims amount to well over S$10m. This was stated in his\n                    email dated 27 July 2010 to DW1 (see [112] above). As a commercial man, what\n                    could have gone through the plaintiff’s mind that caused him to waive such\n                    a huge claim in favour of heavily reduced sum? 120    The plaintiff submits that he chose to waive\n                    the other claims because he wanted a clean break from the defendants (see [114]\n                    above). However, I find it inconceivable that the plaintiff would be so generous\n                    if he genuinely believed that he was entitled to legitimate claims worth over\n                    S$10m. If the plaintiff was confident that his other claims of over S$10m\n                    legally belonged to him, why did he trade this huge sum for only S$79,113.67?\n                    Why was there a need to waive his other entitlements if he was of the opinion\n                    that the expenses incurred were reasonable and supported by documentary\n                    proof? 121    I also find that the plaintiff’s\n                    explanation of wanting a clean break from the defendants unsatisfactory. Giving\n                    up one’s legitimate claim is one thing, but I fail to see how it would\n                    enable him to effect a clean break from the defendants. If he truly wished to\n                    effect a clean break from the defendants, he could have pressed for all his\n                    claims and negotiated for a full settlement instead of waiving a claim of almost\n                    S$10m in favour of a much reduced sum. 122    On the evidence, I find that it is likely\n                    that the plaintiff was using his other claims as a bargaining chip to compel DW1\n                    and D7 to reimburse his expenses. When he submitted his reimbursement claim, his\n                    relationship with D7 was not the best and he must have wanted to claim what he\n                    thought was rightfully his. The claim of S$79,113.67, on its own is a large sum\n                    of money and additionally, the reimbursement claim was for reimbursements\n                    stretching over a period of three years. There would have been issues of\n                    documentation and proof arising and the plaintiff must have known that he would\n                    encounter problems with his large reimbursement claim especially given his\n                    strained relationship with D7 and the fact that he had already indicated his\n                    wish to leave D7’s employment. Thus, it is probable that the plaintiff\n                    purported to waive his huge claims amounting to over S$10m so that his chances\n                    of a full reimbursement would be better. Unfortunately for the plaintiff, DW1\n                    was not intimidated by the veiled threat of a potential huge claim and she\n                    processed his reimbursement claims accordingly. The plaintiff’s lack of\n                    belief in his entitlement to the bonuses and share payments will also be\n                    relevant later at [127] to [197] when I consider his entitlement to them. In the\n                    meantime, I shall focus on whether his offer to waive the other claims was\n                    accepted by D7.",
        "The plaintiff did not waive his share rewards and bonus payment\n                claims": "123    Third, I find that the plaintiff did not\n                    waive his share rewards and bonus payment claims. There are two forms of the\n                    waiver doctrine,viz, waiver by election and\n                    waiver by estoppel. The former arises in the context of a binding contract when\n                    a state of affairs results such that one party becomes entitled under the\n                    contract to exercise a right and he has to choose whether or not to do so. The\n                    latter arises when a person having legal rights against another unequivocally\n                    represents by word or conduct that he does not intend to enforce those legal\n                    rights. The other party acts or refrains from acting in reliance on that\n                    representation such that it would be inequitable for the representor to later\n                    enforce his legal rights inconsistently with his representation. Professor John\n                    W Carter makes this clear in his article “Waiver (of Contractual Rights)\n                    Distributed” (1991) 4 JCL 59 at p 65 where he comments that: In the context of contractual rights, the emphasis on waiver in the sense\n                        of estoppel is on the reaction on the person, against whom the contractual\n                        right may be exercised, to the words or conduct of the other party.The emphasis of waiver in the sense of election is on\n                            the reaction of the promise to the circumstances giving rise to the\n                            inconsistent rights. Out of this difference of focus\n                        important differences of proof arise.Proof of reliance\n                            on the words or conduct, and detriment, although crucial to waiver in\n                            the sense of estoppel are not required for waiver in the sense of\n                            election. Therefore, it is not necessary for a party relying\n                        on waiver in the sense of election to produce evidence of either reliance or\n                        detriment. [emphasis added] 124    The Court of Appeal has also made important\n                    observations regarding the differences between waiver by election and waiver by\n                    estoppel. InChai Cher Watt (trading as Chuang Aik\n                        Engineering Works) v SDL Technologies Pte Ltd and another appeal[2012] 1 SLR 152 at [33], Andrew Phang Boon Leong JA cited Lord Goff of\n                    Chieveley inMotor Oil Hellas (Corinth) Refineries SA v\n                        Shipping Corp of India (The “Kanchenjunga”)[1990]\n                    1 Lloyd’s Rep 391 at 397–399, holding that: … There is an important similarity between the two principles,\n                        election and equitable estoppel, in that each requires an unequivocal\n                        representation, perhaps because each may involve a loss, permanent or\n                        temporary, of the relevant party’s rights. But there are important\n                        differences as well. In the context of a contract, the principle of election\n                        applies when a state of affairs comes into existence in which one party\n                        becomes entitled to exercise a right, and has to choose whether to exercise\n                        the right or not. His election has generally to be an informed choice, made\n                        with knowledge of the facts giving rise to the right. His election once made\n                        is final; it is not dependent upon reliance on it by the other party. On the\n                        other hand, equitable estoppel requires an unequivocal representation by one\n                        party that he that he will not insist upon his legal rights against the\n                        other party, and such reliance by the representee will render it inequitable\n                        for the representor to go back upon his representation. No question arises\n                        of any particular knowledge on the part of the representor, and the estoppel\n                        may be suspensory only.Furthermore, the representation\n                            itself is different in character in the two cases. The party making his\n                            election is communicating his choice whether or not to exercise a right\n                            which has become available to him. The party to an equitable estoppel is\n                            representing that he will not in future enforce his legal\n                            rights. … [emphasis added] 125    The evidence does not suggest a waiver by\n                    election in this case. When the plaintiff elected to waive his other claims by\n                    virtue of his 17 July 2010 email (at [111] above), it seemed to be waiver by\n                    election. However, it was unequivocally clear that the plaintiff’s waiver\n                    wasconditionalon DW1’s reimbursing him\n                    S$78,803.29. This was not done and since the condition was unfulfilled, there\n                    was no waiver by election. 126    An alternative interpretation of the facts\n                    can also be taken where the plaintiff made a representation to DW1 via his email\n                    (at [111] above). DW1, in reliance on that representation, then reimbursed the\n                    plaintiff such that it is now inequitable for the plaintiff to sue for the rest\n                    of his claims. This would seem to be waiver by estoppel. However, I find that\n                    the element of reliance is not made out. The S$25,109.15 reimbursement was not\n                    premised on the plaintiff’s representation but on the fact that DW1 agreed\n                    that the expenses that the sum was based on was incurred by the plaintiff in\n                    accordance with the EA’s terms. Therefore waiver by estoppel cannot be\n                    made out as well.",
        "Is the plaintiff entitled to the Periodic Bonuses?": "127    The plaintiff submits that he is entitled to\n                    the Periodic Bonuses under cl 5.3 of the EA payable in relation to various\n                    “Fund Raising Activities”. He also submits that he has a right to\n                    the Annual Bonus as well as 0.5% of the funds raised for Project Gibson, Project\n                    MP and the acquisition of the 21 Anderson Properties.[note: 166]This claim is essentially an exercise\n                    in contractual interpretation. 128    Before turning to the claim, the parties\n                    made extensive submissions on whether a person can be entitled to bonuses as a\n                    matter of right. I shall address their submissions on this point\n                first.",
        "The law on bonuses": "The plaintiff’s submissions 129    The plaintiff submits thatLatham Scott v Credit Suisse First Boston[2000] 2\n                    SLR(R) 30 (“Latham Scott”) at [57]\n                    makes clear that the matter is one of construction. In his view, this is also\n                    the approach adopted in the United Kingdom (“UK”):Saleem Khatri v Cooperatieve Centrale Raiffeisen-Boerenleenbank\n                        BA[2010] EWCA Civ 397 (“Khatri”) at [22]. Therefore, he submits that the\n                    fundamental duty of the court is to objectively ascertain the parties’\n                    intentions at the time of the contract. 130    In this regard, Ms Dawn Tan Ly-Ru\n                    (“Ms Tan”), the plaintiff’s counsel, submits that the fact\n                    that the word “discretionary” can be found in the bonus clause is\n                    not fatal to the issue of whether the bonus is a contractual entitlement:Mr C Small & Others v The Boots Co Plc and\n                        another[2009] IRLR 328 (“Boots”) at [20]. In his view, while it is true that\n                    Singapore and the UK approach the question as one of construction,Latham Scottis outdated and does not consider legal\n                    developments in the UK.[note: 167]Specifically, she submits that the UK position\n                    is that the employer’s discretion is not an unfettered one and must be\n                    exercised in a genuine and rational as opposed to an empty or irrational manner\n                        (Cantor Fitzgerald International v Horkulak[2004] EWCA Civ 1287 (“Cantor\n                    Fitzgerald”) at [30]) while in Singapore, the employer’s\n                    discretion is unfettered if the decision to grant the bonus is discretionary\n                        (Latham Scottat [72]).[note: 168] 131    In summary, Ms Tan submits that the law\n                    should be developed such that in this case, the use of discretionary language\n                    with respect to the Periodic Bonuses will not preclude the finding of a\n                    contractual right[note: 169]and on a contextual approach,\n                    factors such as the fact that the employee was employed in a lucrative and\n                    competitive industry with a bonus culture to reward productivity and loyalty\n                    will be accounted for.[note: 170] The defendants’ submissions 132    On the other hand, the defendants submit\n                    that the law is trite. They submit that inLatham\n                        Scott, the Court of Appeal held that the bonuses are entirely at\n                    the company’s discretion and employees are usually not entitled to bonus\n                    payments if the bonuses are undeclared.[note: 171]This was the case\n                    inTan Hup Thye v Refco (Singapore) Pte Ltd (in\n                        members’ voluntary liquidation)[2010] 3 SLR 1069\n                        (“Tan Hup Thye”) as well, where\n                    the court found that although there was a bonus payment formula in which the\n                    employer shared profits with its employee in a competitive industry, there was\n                    still no bonus entitlement (at [72]). My views on the law on bonus payments 133    What then, is the correct legal position in\n                    relation to bonus payments under cl 5.3? I note that this issue had previously\n                    been discussed by Lionel Yee JC inBrader Daniel John and\n                        others v Commerzbank AG[2014] 2 SLR 81 at [102]–[106],\n                    although ultimately there was no pronouncement of the law (at [106]). In my\n                    view, fundamentally there is no major difference between the Singapore and the\n                    UK approach,ie, the contractual interpretation\n                    approach as held inZurich Insuranceand\n                    contextual approach in the UK. The facts inLatham\n                        Scottand the UK cases were sufficiently different such that on a\n                    contextual approach, one could arrive at the outcomes reached by the Singapore\n                    and the UK courts. Indeed, Assoc Prof Ravi Chandran (“Prof Ravi”)\n                    comments in his article “Bonuses (and other payments) in\n                    Employment” (2012) 24 SAcLJ 338 (“Bonuses in\n                        Employment”) at para 51 that: In relation to bonuses and other payments in employment, much depends\n                        ultimately on the actual construction of the clause in question.\n                        … I now turn to examine the three UK cases raised by the\n                        plaintiff in support of his case. (I)   Three UK cases:Cantor Fitzgerald,\n                    BootsandKhatri 134    InCantor\n                        Fitzgerald, the court dealt with a derivative trader’s\n                    right to discretionary bonuses. The claimant had occupied a senior management\n                    position working on interest rate swaps in money markets. He was first employed\n                    as a director, and subsequently promoted to Senior Managing Director with a\n                    basic salary of £250,000 per annum. There were three bonus components under\n                    his employment contract, one for a “once only” bonus of\n                    £100,000, one for a guaranteed loyalty bonus of £100,000 and another\n                    for a discretionary bonus. The third clause read (reproduced inCantor Fitzgeraldat [11]): In addition the Company … may in its discretion, pay you an annual\n                        discretionary bonus which will be paid within 90 days of the financial\n                        year-end (30 September) the amount of which shall be mutually agreed by\n                        yourself, the Chief Executive of the Company and the President of Cantor\n                        Fitzgerald Limited Partnership, however the final decision shall be in the\n                        sole discretion of the President of Cantor Fitzgerald L.P. … It is a\n                        condition precedent to any payment hereunder that you shall at all relevant\n                        times exercise best endeavours to maximise the commission revenue of the\n                        Global Interest Rate Derivatives Business and that you shall still be\n                        working for and not have given notice to or attempted to procure your\n                        release from this Agreement nor have given notice to the Company in\n                        accordance with clause 11(h) on the date such bonus is due to be\n                        paid. The issue was whether in the context of a highly competitive\n                        industry, the plaintiff had a contractual right to discretionary bonuses.\n                        The court held that he did not. 135    While the plaintiff was not entitled to the\n                    discretionary bonus, the court however held that he was entitled to abona fideand rational exercise of his employer’s\n                    discretion (at [46]). This was because the clause provided a process by which\n                    the employee, the Chief Executive and the President could attempt to come to a\n                    mutual agreement on the issue and the court emphasised that the employer had to\n                    consider the issue in abona fideand rational\n                    manner as opposed to a manner which was arbitrary. Thus, in order to give\n                    “contractual value or content” to the clause, the court held that\n                    the employer did not have an unqualified right to act in any manner he wanted\n                    but had to act in abona fideand rational manner\n                    (at [47]). 136    The next case isBoots, a case in which a warehouseman was paid performance\n                    related bonuses until the warehouse operations and correspondingly the plaintiff\n                    were transferred from Boots to Unipart. During the period in which the plaintiff\n                    was employed by Unipart, no bonuses were paid to him while his colleagues who\n                    continued working in Boots were paid bonuses. He sued for the bonuses which he\n                    thought he was entitled to. His first ground of appeal was allowed and the\n                    matter was remitted to the Employment Tribunal (at [64]). 137    The grounds of appeal inBootsdealt with which are relevant for our purposes are: (a)\n                    whether the use of the word “discretionary” could answer the\n                    question of the employee’s contractual entitlement to bonuses; (b) whether\n                    a past practice of awarding contractual payments rendered the discretion being\n                    construed as having contractual content; and (c) whether there were fetters on\n                    the way the employer could exercise his discretion. 138    First, it was held that just because the\n                    clause used the term “discretionary” it did not determine the\n                    question of whether the employee had any contractual entitlement to the bonuses:\n                    at [19]. On that basis, the matter was remitted to be heard by the Employment\n                    Tribunal. The court held that: … [T]he use of the term discretionary in a bonus scheme may be\n                        attached to the decision whether to pay a bonus at all, its calculation or\n                        its amount. No doubt there are other factors to which discretion may be\n                        attached.In determining whether the reference to a\n                            discretionary bonus conferred any contractual entitlement, the\n                            Employment Judge should have decided what aspect of the scheme the term\n                            discretionary was attached. … [emphasis added] 139    Second, the course of dealing between the\n                    parties was relevant in determining whether the employer’s discretion can\n                    be construed as having contractual content and the trial judge had failed to\n                    account for this: at [28]– [29]. 140    Third, the court held that the discretion\n                    must be exercised in rationally and in good faith: at [33]. 141    The third case isKhatri, which concerned a summary judgment application by a\n                    derivatives trader seeking to claim bonuses supposedly due under his employment\n                    contract with the bank. The relevant clause read (reproduced at [11] ofKhatri): … PERFORMANCE RELATED BONUS You will also be eligible to receive a performance related bonus from the\n                        Bank, subject to your individual revenue generation. Any payment due will be\n                        made at the time the Bank makes its annual performance bonus payment but in\n                        any event no later than 31 March in the year following the performance year\n                        for which you are being awarded (ie 31 March 2009 in respect of 2008). The\n                        formula used to calculate the bonus due to you will be as follows and will\n                        be calculated for 2008: %ThresholdTotal Revenues (net of brokerage\n                                            fees)0%Eur550,00012%Eur550,000Eur551,000   12% will be linked to your individual performance\n                            providing the individual total revenue threshold of Eur550,000 has been\n                            reached. The above table is applicable to your 2008 bonus. The Bank maintains the\n                        right to review or remove this formula linked bonus arrangement at any\n                        time. [emphasis added] 142    The context of the case was that the\n                    trader’s basic salary was £40,000 per annum with “any future\n                    applicable bonuses made entirely at the discretion of the bank on the basis of\n                    your financial and managerial performance viewed across Rabobank\n                    International”: at [6]. It was also undisputed that he “was good\n                    at his job and regularly made money for the bank”: at [7]. He had\n                    received large amounts as discretionary bonuses in the past (£150,000 in\n                    2007) (at [9]) but wanted a new contract with performance related bonuses as he\n                    considered that he had lost out compared with colleagues who had performance\n                    related bonuses: at [10]. 143    It was against this backdrop that the\n                    employment contract was changed. The trader’s basic salary was increased\n                    to £100,000 with £50,000 as guaranteed bonus and a performance related\n                    bonus linked to his performance. It was acknowledged that the guaranteed bonus\n                    of £50,000 was to make up for the shortfall he had “suffered”\n                    in 2007”: at [12]. As matters transpired, the employee made a profit of\n                    €13,898,066 at the end of 2008. Applying the formula, he claimed for\n                    €1,601,767.62 after being dismissed for redundancy: at\n                [20]–[21]. 144    Adopting a contextual approach, the court\n                    held that the employee had a contractual entitlement to the sum claimed because\n                    (a) the language of the clause contained words of entitlement; and (b) the facts\n                    showed that the clause was replacing a previous discretionary entitlement\n                    clause. The language of the clause meant that the bonus formula applied for 2008\n                    might be different for the following year and if the banks wanted to reward\n                    employees through a purely discretionary bonus, they should seek to say so\n                    openly and not use the language of entitlement and later qualify it (at\n                    [37]–[39]). Moreover, where bonus entitlements are discretionary, the\n                    employer must act in a rational and fair manner, with the test being one ofWednesburyunreasonableness: at\n                [8]. (II)   The construction of bonus clauses adopts a contextual\n                approach and seeks to effect the parties’ mutual intentions 145    The three cases above show that the courts\n                    are ultimately engaged in an exercise of construction of the bonus clauses\n                    throughmainlyinterpretation and implication. A\n                    contextual approach is adopted and that was the basis of the court’s\n                    decision inKhatri, where the court’s\n                    finding that the bonus was a contractual entitlement turned on the language of\n                    the relevant clause in question together with the surrounding context of its\n                    operation. That was also the basis on which I decidedSeow\n                        Hock Hin v MF Global Singapore Pte Ltd[2014] SGHC 42\n                        (“Seow Hock Hin”) – the\n                    approval of the relevant persons was needed for the bonuses to be paid out but\n                    had not been obtained: at [17]. 146Latham Scottalso does not appear to be substantively different from the English position, if\n                    one adopts a contextual approach when viewing that case. InLatham Scott, the issue was whether the plaintiff had lost his\n                    chance to earn his bonus which he alleged he would otherwise have earned if not\n                    for the defendant’s act of wrongfully terminating him: at [54]. The court\n                    held that on the facts of that case, a proper construction indicated that the\n                    clause granted the employer full discretion to decide whether to grant a bonus\n                    to the employee and hence dismissed his claim: at [57]. There is no absolute\n                    rule laid down by the courts that bonuses are discretionary in nature andSeow Hock Hinat [18] states that: ... It must be emphasised that the declaration of bonuses is at the sole\n                        discretion of a company unless guaranteed under a contract of employment. In\n                        many instances, a company may adopt a general guideline as to how to compute\n                        the quantum of bonuses to be declared in the ordinary course of business.\n                        However, a company should not in any way be fettered and bound by such\n                        guidelines. The economic climate is always changing. Sometimes a company may\n                        experience a windfall and sometimes it may face a lack of business. At other\n                        times, a company … may even face financial difficulties of such an\n                        extent that it eventually has to enter into liquidation – a situation\n                        which cannot be described as being in the ordinary course of business. The\n                        amount of bonuses declared by a company would thus inevitably be based on a\n                        consideration of the economic climate and other relevant factors and vary in\n                        the light of such changing circumstances. Therefore, although a guideline as\n                        to bonus computation grants the employee a degree of certainty as to the\n                        quantum of bonus he may receive, it should not tie the hands of the company\n                        such that it can no longer depart from such a guideline if the economic\n                        circumstances demand that it does so. … 147    Finally, I agree with Prof Ravi that both\n                    the UK and Singapore approaches are ultimately similar and focused on theintention of the partiesand I set out the\n                    following passage from Bonuses in Employment (at para 46): 46    It should also be noted that inLatham, the court accepted the principles laid down inAbrahams v Reiach(where the\n                            publishers in breach were held to be liable for damages, on the basis\n                            that a reasonable number of books would have been published) andLee Paula v Robert Zehil & Co Ltd(where the distributors in breach were held to be liable for damages, on\n                            the basis that they would have performed the contract using a reasonable\n                            method), but distinguished them on the ground that those cases involved\n                            situations where there was a breach of contractual obligations to\n                            publish books and order garments, respectively.Thus,\n                                the essential point was that on the facts, the payment of bonus was\n                                not part of the contractual obligation. In this regard, it is\n                                suggested that the mere use of the word ‘discretion’\n                                should mean that the bonus can no longer be a contractual\n                                entitlement. Instead, as is the current position in the UK, all the\n                                relevant circumstances have to be examined to ascertain the true\n                                intention of the parties. [original emphasis omitted;\n                            emphasis added in italics] (III)   The term of mutual trust and confidence can apply in\n                appropriate situations with respect to bonus payment clauses 148    With respect to implication, the courts have\n                    indicated their willingness to imply a term of mutual trust and confidence where\n                    warranted. InJohnson v Unisys Ltd[2003] 1 AC 518\n                        (“Johnson”) at [35]–[37],\n                    Lord Hoffmann observed that: … At common law the contract of employment was regarded by the\n                        courts as a contract like any other. The parties were free to negotiate\n                        whatever terms they liked and no terms would be implied unless they\n                        satisfied the strict test of necessity applied to a commercial contract.\n                        Freedom of contract meant that the stronger party, usually the employer, was\n                        free to impose his terms upon the weaker.But over the\n                            last 30 years or so, the nature of the contract of employment has been\n                            transformed. It has been recognised that a person’s employment is\n                            usually one of the most important things in his or her life. It gives\n                            not only a livelihood but an occupation, an identity and a sense of\n                            self-esteem. The law has changed to recognise this new\n                            reality. … And the common law has adapted itself to\n                        the new attitudes, proceeding sometimes by analogy with statutory\n                        rights. 36The contribution of the common\n                                law to the employment revolution has been by the evolution of\n                                implied terms in the contract of employment. The most far reaching\n                                is theimplied term of trust and\n                                confidence. … … Employment law requires a balancing of the interests of employers\n                        and employees, with proper regard not only to the individual dignity and\n                        worth of the employees but also to the general economic interest. Subject to\n                        observance of fundamental human rights, the point at which this balance\n                        should be struck is a matter for democratic decision. The development of the\n                        common law by the judges plays a subsidiary role. Their traditional function\n                        is to adapt and modernise the common law. But such developments must be\n                        consistent with legislative policy as expressed in statutes. The courts may\n                        proceed in harmony with Parliament but there should be no discord. [emphasis added in italics and bold italics] 149    In this regard, I note Prakash J’s\n                    view inTan Hup Thyewhere it was held that the\n                    position in Singapore is dissimilar to the UK position in so far as the issue\n                    pertained to the employer’s exercise of his discretion. Prakash J’s\n                    view is that the UK authorities appear to lean towards regulating the\n                    employer’sexerciseof their discretion in\n                    relation to bonus payments while the position in Singapore favoured the view\n                    that the employer’s discretion is entirely unfettered: at [69]–[71].\n                    However, the implied term of mutual trust and confidence was not argued before\n                    the court inTan Hup Thyeand since that decision,\n                    the implied term of mutual trust and confidence has been accepted in Singapore\n                    as an implied term in law subject to express terms stating otherwise or the\n                    context implying otherwise (Cheah Peng Hock v Luzhou Bio-Chem\n                        Technology Ltd[2013] 2 SLR 577 at [59]). Indeed, as observed by\n                    Lord Hoffmann inJohnson, the implied term of\n                    mutual trust and confidence could have ramifications on an employer’s\n                    exercise of his discretion with respect to his awarding of bonuses to his\n                    employee and the court should not be hesitant to consider the matter when the\n                    appropriate case arises. 150    Therefore, whether the employee is entitled\n                    to his bonuses must depend on the intention of the parties as reflected in the\n                    employment contract and the circumstances of the case. There can be an\n                    obligation for the employer to exercise his discretion in abona fideand rational manner. There can also be situations in\n                    which the employer reserves an absolute right to declare bonuses in whatever way\n                    he deems fit. Such a clause will arise where clear words such as\n                    “absolute” are used in relation to bonus entitlements (seeBonuses in Employmentat para 50). I turn now\n                    to address the plaintiff’s entitlement to the Periodic\n                Bonuses.",
        "The plaintiff is not contractually entitled to the Periodic\n                Bonuses": "151    It is my view that the plaintiff is not\n                    contractually entitled to the Periodic Bonuses. Under cl 5.3 of the EA, the\n                    plaintiff’s entitlement to the Periodic Bonuses is premised on the\n                    following conditions: (a)     it is to be determined at the\n                        “sole and absolute discretion of the CEO; (b)     it is dependent on the performance of\n                        the company; and (c)     it is dependent on the attainment of the objectives as determined by\n                        the CEO. The plaintiff’s submissions 152    The plaintiff submits that he was\n                    contractually entitled to the Periodic Bonuses on a contextual interpretation of\n                    the EA. First, he submits that both he and D7 were not strangers and had\n                    developed a close working relationship dating back to their days at\n                        Lereno[note: 172]and therefore the present facts are\n                    different fromTan Hup Thye.[note: 173] 153    The plaintiff next submits that the\n                    “fund raising activities” were in relation to funds raised for\n                    Project Gibson, Project MP and the acquisition of the 21 Anderson Properties. He\n                    says that he was entitled to 0.5% of the funds raised as funds were successfully\n                    raised for all three activities and he was instrumental to the raising of those\n                        funds.[note: 174] The defendants’ submissions 154    The defendants disagree. First, they submit\n                    that the term “Fund Raising Activities” referred to\n                    “obtaining monies from third party investors in RODA and CKRA as working\n                    capital to develop and enhance the assets in order for those assets to generate\n                    returns thereby increasing the value of the shares of RODA and\n                        CKRA.”[note: 175]Based on this definition, the plaintiff had\n                    failed to raise any money since the first and second public offerings for RODA\n                    and CKRA had respectively failed to raise funds from the public and other\n                    investors. The credit facilities obtained from DBS and RZB were only designed to\n                    last for one or two business days, providing temporary liquidity.[note: 176]Furthermore, it was undisputed that the\n                    acquisition of the 21 Anderson Properties was a failure and D7 had lost money as\n                    a result of that failed acquisition. 155    Second, the defendants submit that with\n                    respect to the financing of the acquisition of the 21 Anderson Properties, cl\n                    5.3 of the EA referred to “various Fund Raising Activities as verbally\n                    expressed by the CEO prior to the signing of this Agreement” (see [8]\n                    above). Prior to the EA’s signing, there were only two projects verbally\n                    expressed by the CEO as involving fund raising: Project Gibson and Project MP.\n                    Hence, transactions that arose subsequent to the EA’s signing could not\n                    qualify as part of the Periodic Bonuses to be paid. This was admitted by the\n                    plaintiff in cross-examination where he stated:[note: 177] Q.ARCH and the 21 Anderson second RZB facility was\n                            not originally within the scope of your appointment at the time of\n                            signing your employment agreement. You agree? A.That’s correct. Therefore, they submit that cl 5.3 of the EA (see [31] above)\n                        does not encompass the funds raised for acquiring the 21 Anderson\n                            Properties.[note: 178] 156    Third, the defendants submit that the\n                    plaintiff had failed to show that he was instrumental in the fund-raising\n                    activities. D7 had testified that it was he and not the plaintiff who opened the\n                    doors and paved the way for obtaining the facilities and transactions with DBS,\n                    RZB and ARCH. Thereafter, the plaintiff was the liaison officer with those\n                        institutions.[note: 179] 157    The bank officers from DBS and RZB\n                    corroborated D7’s testimony in this respect. These bank officers DW3, Ms\n                    Chan Lie Leng (“Ms Chan”), the General Manager of RZB, and DW4, Ms\n                    Tsng Boon Kiat (“Ms Tsng”), the Managing Director of the\n                    Institutional Banking Group division of DBS testified that the plaintiff was not\n                    instrumental in raising funds for the various companies. They testified that the\n                    facilities would have been granted even without the plaintiff’s\n                        involvement.[note: 180] My decision 158    I reject the plaintiff’s claim for the\n                    following reasons. (I)   The plaintiff does not have any contractualentitlementto the Periodic Bonuses 159    First, the plaintiff does not have any\n                    contractual entitlement to the Periodic Bonuses. It is a principle of\n                    contractual interpretation that the meaning of an unclear word is known by its\n                    context (The Interpretation of Contractsat p\n                    394). The exercise of construction is based on a holistic evaluation of thewhole contract. Courts are not to be\n                    excessively focused on any particular word, phrase, sentence, or clause: see\n                    Gerard McMeel,The Construction of Contracts: Interpretation,\n                        Implication and Rectification(Oxford University Press, 2nd Ed,\n                    2011) (“The Construction of\n                    Contracts”) at para 1.156. 160    Clause 5.3 of the EA states explicitly that\n                    the Periodic Bonusesmay be paidsubject to thesole and absolute discretionof D7. This is in\n                    contrast to the Annual Bonus, whichshallbe paid\n                    depending on the Group’s performance and attainment of objectives as\n                    determined by D7.[note: 181]It is clear therefore from the\n                    EA that the discretionary bonuses cannot amount to an entitlement. There is also\n                    no evidence to suggest that D7 breached any implied term of mutual trust and\n                    confidence or that he exercised his discretion in a manner that was entirely\n                        arbitrary.[note: 182]In any event, that was not the\n                    plaintiff’s case. 161    For the above reason, I hold that the\n                    plaintiff does not have anentitlementto the\n                    Periodic Bonuses. That alone is sufficient to dispose of the plaintiff’s\n                    Periodic Bonuses claim. For completeness, I will proceed to address his other\n                    submissions. (II)   The conditions on which the Periodic Bonuses were premised\n                upon were not met 162    Next, I find that the plaintiff was not\n                    entitled to the Periodic Bonuses as the conditions on which they were premised\n                    were not met. First, a reading of cl 5.3 (see [8] above) shows that it is the\n                    CEO/D7 who decides whether the plaintiff had done well enough to deserve the\n                    Periodic Bonuses. It also provides for a range of periodic bonuses that can be\n                    paid for fund raising activities. The range is from the minimum limit of 0.25%\n                    to the upper limit of 0.5%, with D7 having the power to decide how much to\n                    award. There is no evidence that this was done. 163    There was also no evidence to suggest that\n                    any such bonus entitlements was approved or declared such the plaintiff is now\n                    entitled to Periodic Bonuses for the three fund raising activities. The\n                    plaintiff unilaterally assumed that he would have been awarded the highest\n                    quantum of the bonuses. In other words, he declared his own\n                bonuses. 164    Second, the circumstances did not favour the\n                    plaintiff’s case. Clause 5.3 appears to be performance-based and the three\n                    fund raising projects were unsuccessful and loss-making. Under those\n                    circumstances, it is inconceivable that D7 would have declared any Periodic\n                    Bonuses payable to the plaintiff. (III)   The plaintiff was not instrumental in the\n                fund-raising 165    Finally, the plaintiff’s\n                    instrumentality is irrelevant and in any event, he was not instrumental to the\n                    raising of funds. 166    The plaintiff submits that he was\n                    instrumental in raising funds for Project Gibson, Project MP and the acquisition\n                    of the 21 Anderson Properties. Since he had played a pivotal role in\n                    successfully raising funds for the three projects, he argued that he was\n                    entitled to the Periodic Bonuses.[note: 183]He submits\n                    that without him, DBS and RZB would not have granted funds and the significance\n                    of his role would determine whether he would be given the low end of the range,ie, 0.25%, or the highest range, which is\n                    0.5%. With respect to the acquisition of the 21 Anderson Properties, the\n                    plaintiff contends that even though money was lost, he should still be paid a\n                    bonus because it was a rescue exercise to limit the damage suffered by the Group\n                    and/or D7.[note: 184] (A)   The plaintiff’s account does not make commercial\n                sense 167    In my view, whether the plaintiff was\n                    instrumental in the fund raising projects is irrelevant in cl 5.3 as it is not a\n                    criteria for the awarding of bonuses. I shall first deal with the\n                    plaintiff’s submissions with respect to the funds raised for acquiring the\n                    21 Anderson Properties. I find it hard to believe that the parties intended for\n                    the minimisation of losses to constitute successful fundraising entitling the\n                    plaintiff to such large bonuses. It did not accord with commercial sense. This\n                    also could not have been the intention of the parties under cl 5.3 of the\n                    EA. (B)   The plaintiff did not seem to believe in the truth of his\n                Periodic Bonuses claim 168    Second, the plaintiff did not seem to\n                    believe in the truth of his claims for Project MP and Gibson.. He did not claim\n                    for his entitlements under cl 5.3 during his early days of his employment.\n                    Moreover, in his email to DW1 dated 27 July 2010 when he told her that he was\n                    prepared to waive his claims under the contract on full reimbursement of his\n                    expenses, he did not mention his entitlement for those two projects but only\n                    made specific reference to the 21 Anderson Properties.[note: 185] (c)   The plaintiff’s account went against the accounts of\n                DW3 and DW4 169    Third, I find that the testimonies of DW3\n                    and DW4 went against the plaintiff’s case. These witnesses testified\n                    clearly that the plaintiff was not instrumental in obtaining the\n                loans. 170    DW3 testified that the plaintiff was first\n                    introduced to her around July 2007 by D7.[note: 186]At that time,\n                    RZB already had an existing banking relationship with D7.[note: 187]The loan was granted on the account of D7 and\n                    not the plaintiff, who merely held several meetings with RZB in which\n                    “the details of the transaction were ironed out”.[note: 188]The plaintiff’s role was primarily to be\n                    the contact person for obtaining supporting documents and information regarding\n                    the transactions under the First RZB Loan and he was also the person with whom\n                    DW3 discussed the structure and mechanism of the transactions.[note: 189]This was similarly the case for the Second RZB\n                    Loan taken out with respect to the 21 Anderson Properties.[note: 190] 171    According to DW3, the plaintiff’s\n                    input was irrelevant to RZB’s decision to grant either the First RZB Loan\n                    or the Second RZB Loan. His involvement was not the reason why the First RZB\n                    Loan was granted as the bank had also put in a “fair bit of\n                    effort” to ensure that the security provided was “bankable\n                    credit” and that the credit risk was acceptable to the bank.[note: 191]She also stated in cross-examination\n                    that she disagreed that the Second RZB Loan was granted by RZB because of the\n                    plaintiff’s efforts in structuring and coordinating the\n                        facility,[note: 192]or that his personal guarantee\n                    was a significant reason for why RZB granted the Second RZB Loan to finance the\n                    purchase of the 21 Anderson Properties.[note: 193] 172    DW4’s testimony also went against the\n                    plaintiff’s account. The plaintiff submits that the following factors were\n                    crucial to DBS in its consideration of whether to grant the loan\n                    facility: (a)     the exposure to shares as\n                        collateral for more than ten business days, cross-border risks and\n                        appropriate cost of funds to charge;[note: 194] (b)     the underlying credit risks where the borrower has\n                        regular cashflow generating capability to service and repay the\n                            loan;[note: 195]and (c)     the sell-down of exposure risks by\n                        syndicating risks which requires a structure acceptable to other banks and\n                        financial institutions.[note: 196] 173    DW4’s story was otherwise. She\n                    testified that for Project Gibson, the factors mentioned by the plaintiff that\n                    supported his instrumental role were marginal or irrelevant to DBS’s\n                    eventual approval of the loan facility. In DW4’s view, the first category\n                    of factors were internal considerations considered to be the risk and return\n                    factors while the second and third factors were not applicable to the\n                        transaction.[note: 197] 174    In view of DW3’s and DW4’s\n                    testimonies, I find that the plaintiff had not successfully shown that he was\n                    instrumental to the fund raising activities. The evidence from both DW3 and DW4,\n                    who were independent witnesses, was credible, consistent and it corroborated\n                    D7’s account, which is that the loans were disbursed from RZB and DBS\n                    because of his financial standing and not the plaintiff’s ingenuity in\n                    structuring the facilities. 175    In conclusion, I hold that the\n                    plaintiff’s claim under cl 5.3 cannot succeed.",
        "Is the plaintiff entitled to the share rewards under cll 5.4 and\n                5.5?": "176    The plaintiff’s share rewards claim is\n                    premised on cll 5.4 and 5.5 of the EA in relation to Project Gibson and Project\n                    MP respectively. There are several issues in relation to these clauses. First,\n                    the parties disagree on whether Project Gibson and Project MP were completed,\n                    which is also the premise on which the share rewards were to be granted. Second,\n                    they disagree on what the plaintiff is entitled to. Third, they disagree on\n                    whether the payment of 1.5% or 3% is dependent on the profitability of the two\n                    projects. I shall now deal with these issues in turn.",
        "Were Project Gibson and Project MP completed?": "The plaintiff’s case 177    The plaintiff submits that he is entitled to\n                    the share rewards once the CKRA and RODA RTOs were completed by virtue of cll\n                    5.4 and 5.5 of the EA.[note: 198]In his view, completion entailed\n                    the completion of the RTOs and IPOs of Project Gibson and Project MP. The two\n                    events were the triggers for the accrual of the plaintiff’s\n                        entitlement[note: 199]and the assets had been\n                    monetised because D5 and D1 were able to raise funds from the banks when they\n                    pledged their RODA and CKRA shares. This was consistent with the Group’s\n                    and/or D7’s desire to hold on to the RODA and CKRA shares. Since they were\n                    able to do that, it showed that the assets had been monetised and the projects\n                        completed.[note: 200] 178    Since Project Gibson and Project MP were\n                    completed, the plaintiff submits that he was entitled to 1.5% of 100% of the\n                    RODA and CKRA shares obtained during the RTOs.[note: 201]This\n                    is because the Handwritten Amendments only affect the quantum of the shares to\n                    be awarded but nothing else.[note: 202]It was meant to be a “like for\n                    like” replacement of the term “minimum of 12 million\n                        shares”.[note: 203]The acquisition was to be on terms found\n                    in Table 1 of the EA,[note: 204]which specified the price at which the\n                    shares could be acquired and essentially worked as a “loyalty\n                        device”.[note: 205] The defendant’s case 179    The defendants submit that the plaintiff did\n                    not just fail to raise funds but also caused the failure of both projects.\n                    Successful fund-raising would entail D5 and D1 selling their majority stakes in\n                    RODA and CKRA respectively to third parties after asset injection and\n                    monetisation were complete. That was unsuccessful, so there was no asset\n                    enhancement or any prospect of monetising the assets.[note: 206]Since there was no money raised from\n                    third party investors, the plaintiff was not entitled to anything.[note: 207]Additionally, the defendants allege that the asset injection for RODA and CKRA\n                    was a failure and the transactions had to be unravelled.[note: 208] 180    The defendants also contend that the effect\n                    of the Handwritten Amendments to cll 5.4 and 5.5 totally superseded the original\n                    words of cll 5.4, 5.5 and Table 1 of the EA. Instead, according to D7, the\n                    plaintiff would only be entitled to 1.5% in value of whatever amount that was\n                    obtained on successful divestment.[note: 209] My decision 181    I am not convinced by the plaintiff’s\n                    submission that Project Gibson and Project MP were completed after the asset\n                    injection/monetisation had taken place for the following reasons. (I)   The plaintiff is unsure of his case 182    First, the plaintiff is unsure of his case.\n                    Ms Ho pointed out that the plaintiff appeared to be unsure about what\n                    constituted completion in his amended SOC. With respect to Project MP, the\n                    plaintiff initially stated that “Project MP was successfully completed\n                    with the initial listing of [CKRA] on 17 January 2008”.[note: 210]Later, he amended\n                    that portion of his SOC to read, “Project MP was successfully concluded\n                    with the injection and/or monetisation of assets belonging to the Transpacific\n                    Group and/or D7.” When questioned, the plaintiff explained that he had\n                    made a “typographical error”.[note: 211]I find his\n                    explanation unconvincing in light of the significant differences between the\n                    original completion event and the subsequent amendment. Additionally, I find\n                    that his original position was untenable because CKRA was already a listed\n                    entity on the IDX even before Project MP was implemented.[note: 212]Therefore CKRA could not be listed on\n                    17 January 2008. 183    Moreover, the plaintiff’s claim rests\n                    on D1 and D5 holding onto the CKRA and RODA shares for 100% of their value.\n                    However, there was no evidence given as to the value of those shares at the time\n                    the projects were completed. The plaintiff’s counsel was also unable to\n                    give a convincing explanation when pressed for the value of those\n                        shares:[note: 213] Tan:… So, at the end of the day, what\n                                            you have, if you look at it shorn of the issues …\n                                            what happened was that you have Citra and Forever\n                                            Prosperous holding the CKRA and RODA shares for 100% of\n                                            their value. And that, surely, must be the definition of\n                                            success for the RTO. In that sense, Your Honour,\n                                            I’m not sure that it would be appropriate for me\n                                            to answer the question, was there a profit made. It\n                                            wasn’t the objective to make a\n                                        profit.Court:You can hold the share, but the\n                                            share---you can hold the share in numerical terms, but\n                                            you must know what is the value of the\n                                        shares.…The value of a share is determined by the\n                                            market forces.Tan:Indeed.Court:It can go up, it can come\n                                        down.Tan:Yes,Court:So if the share goes down, it means you\n                                            have suffered a loss.Tan:Yes.Court:If the share goes up, it means you make\n                                            money out of the whole\n                                    transaction.Tan:Well, if it helps, Your Honour, at that\n                                            point in time---of course, share prices go up and down\n                                            … but at the end of the day, the CKRA shares were\n                                            later sold off for US$1290 million.\n                                        …Court:At what point---at what point in\n                                            time?…Tan:This would have been a few years down the\n                                            road.Court:After the\n                                    transaction---Tan:That’s\n                                    right.Court:---after this\n                                    episode.Tan:That’s\n                                    right.Court:After this episode is none of our\n                                            concern.…So we are talking about that point in\n                                            time.…Tan:At that point in time,I’m not able to give Your Honour an easy\n                                                answer to the\n                                    question---   [emphasis added] 184    The plaintiff’s testimony reveals his\n                    uncertainty with respect to the quantification and calculation of his\n                    entitlement. He vacillated between being entitled to the shares and the value of\n                    the shares.[note: 214]If I accept the\n                    plaintiff’s view that he is entitled to the share rewards under cll 5.4\n                    and 5.5 upon the issuance of the rights issue at the RTO taking place, then the\n                    date on which the rights issue and the RTO took place would also be the date on\n                    which the shares would be vested in the plaintiff. That would also be the\n                    cash-out date of the plaintiff’s entitlement to his shares. Hence the\n                    value of RODA and CKRA would have been zero as there were no third party\n                    investors who invested in them. Correspondingly, his entitlement of 1.5% or 3%\n                    of 100% of the RODA and CKRA profits would also be zero. 185    In my view, the operative date on which the\n                    plaintiff’s entitlement under cll 5.4 and 5.5 is triggered must be when\n                    the plaintiff ceased his employment with D7. This was clearly stated in cll 5.4\n                    and 5.5, which refer to Table 1 of the Schedule in the EA. Table 1 refers to the\n                    cessation of employment as the operative date on which the shares should be\n                    cashed out and there was no evidence provided as to what was the value of CKRA\n                    and RODA shares when the plaintiff left D7’s employment on 1 September\n                        2010.[note: 215]It is most probable that the shares were\n                    worthless at that point in time as there were no third party investors who\n                    invested in them. 186    The plaintiff commenced legal proceedings to\n                    claim under both clauses about two years after his resignation. It is also\n                    pertinent to note that the action was taken after CKRA and RODA had undergone\n                    major restructurings which resulted in the enhancement of the valuation of these\n                    entities. For Project Gibson, the plaintiff bases his claim on the net equity\n                    value of RODA as of 30 December 2011 and he claims for US$4,663,020. As for\n                    Project MP, the plaintiff’s claim of US$4,511,250 is based on the net\n                    equity value of CKRA as of 2 April 2012. However, those dates could not be the\n                    cash-out dates as the plaintiff had left the employment in September\n                    2010. (II)   The plaintiff’s evidence is inconsistent 187    Second, cross-examination revealed\n                    inconsistencies in the plaintiff’s position that the asset\n                    injection/monetisation into RODA and CKRA were successful. With respect to\n                    Project Gibson, the plaintiff admitted that the asset injection into RODA was a\n                    failure and had to be reversed.[note: 216]Neither was money raised from\n                    third parties, as DW7, Tan Ting Yong, the director of the second defendant from\n                    8 May 2009, said that D5 was a standby buyer and it was only if there were no\n                    third parties who bought the RODA shares in the second rights issue that D5\n                    would subscribe for the RODA shares.[note: 217]As things turned out, no third\n                    parties subscribed for the second rights issue and D5 was forced to purchase the\n                    RODA shares on offer. There was therefore no successful\n                completion. 188    With respect to Project MP, no money was\n                    raised for CKRA from third parties. This was because D7 was arrested and unable\n                    to travel out of Indonesia, causing investors to be spooked and\n                        afraid.[note: 218]Later, the plaintiff tried to\n                    salvage his case by saying that there were a few individual shareholders who\n                    took part in the second CKRA rights issue to raise funds from third\n                        parties.[note: 219]However he could not escape from\n                    the fact that D1 had bought more than 99.99% of the entire share\n                        subscription,[note: 220]akin to the worst-case scenario predicted by\n                    the parties.[note: 221]Yet his case was that the projects\n                    were complete because the assets had been successfully monetised. I find this\n                    unconvincing. 189    Moreover, the plaintiff’s evidence\n                    went against the intended project timeline.[note: 222]In his reply submissions, the plaintiff admitted that:[note: 223] Project Gibson and Project MP refers to two large scale projects involving\n                        RODA and CKRA respectively. These Projects were to becompleted over the long term, beginning with the RTO of RODA\n                        and CKRA respectively, followed by the development of RODA and CKRA’s\n                        assets to enhance their value,and culminating in the\n                            successful divestment of the RODA and CKRA shares to third parties at a\n                            profit. [emphasis added] 190    From his reply submissions, the plaintiff\n                    appears to take the view that Project Gibson and Project MP were large-scale,\n                    long-term projects that would eventually be monetised by selling the RODA and\n                    CKRA shares to third parties at a profit. There was no distinct stage mentioned.\n                    Yet, he submits that cll 5.4 and 5.5 draw a clear distinction between the\n                    projects as a whole and a specific stage of the projects and the clauses\n                    referred to “RTO/IPO” in the context of gaining control of the\n                    target listed companies in Indonesia, which could be effected by: (a) listing a\n                    private company by way of an IPO; or (b) doing a RTO of an already listed\n                        company.[note: 224]His view is that the\n                    “RTO/IPO” referred to was confined to the RTOs of CKRA and RODA,\n                    which werelimitedpublic offering shares fully\n                    underwritten by the intended controlling parties rather than public offerings in\n                    the true sense.[note: 225]His evidence appeared\n                    contradictory. 191    For the above reasons, I find that the\n                    plaintiff had not established his case that the completion of Project Gibson and\n                    Project MP was at the point of asset injection. It is undisputed that both these\n                    projects failed to secure third party investors. In other words, the plaintiff\n                    admitted that the worst-case scenario happened and the projects failed. It is\n                    inconceivable that the parties would have included in the EA clauses that would\n                    reward the plaintiff even when he failed to attain the objectives in Project\n                    Gibson and Project MP and therefore I find that the plaintiff was not entitled\n                    to the share rewards.",
        "What was the plaintiff entitled to?": "Has the plaintiff shown that the parties’ intentions are for\n                cll 5.4 and 5.5 to apply in tandem with the Handwritten Amendments? 192    The next issue that I shall deal with is in\n                    relation to the intention of the parties when D7 amended cll 5.4 and 5.5 by\n                    inserting the Handwritten Amendments “1.5% for 100%” against the\n                    margin of these clauses. The parties’ views on this diverged greatly and\n                    they will be addressed below. 193    The starting point is that the law on\n                    contractual interpretation is clear. It is concerned about the interpretation of\n                    the parties’ intentions objectively ascertained (Sembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another\n                        appeal[2013] 4 SLR 193 at [28]) and the question is what would\n                    the express terms of the contract convey to a reasonable person with all the\n                    background knowledge which would reasonably have been available to the parties\n                    at the time of the contract (at [33]). On that basis, I find that it is unclear\n                    whether the Handwritten Amendments were made in substitution of the phrase\n                    “a minimum of 12 million shares” which were not cancelled out in\n                    cll 5.4 and 5.5. That was also the argument of the plaintiff. On the other hand,\n                    D7 submits that cll 5.4 and 5.5 were too complicated for him and he made the\n                    amendments in order to substitute cll 5.4 and 5.5 as well as Table 1 – in\n                    his view, it was intended that if there were profits made from Project MP and\n                    Project Gibson, he would give the plaintiff 1.5% of the profit. 194    In my view, the burden is on the plaintiff\n                    to prove on a balance of probabilities that the Handwritten Amendments were\n                    merely to substitute the phrase “a minimum of 12 million shares”\n                    with the other aspects of the two clauses remaining binding on the parties.\n                    Clauses 5.4 and 5.5 by themselves may not be helpful in ascertaining the\n                    parties’ intentions. In this regard, the subsequent actions of the parties\n                    in effecting the EAcanhave probative value in\n                    helping the court to ascertain the parties’ intentions when they entered\n                    into the EA. I find that if the plaintiff’s version was the true intention\n                    of the parties at the time when the EA was signed, there should be evidence of\n                    him asserting his rights under cll 5.4 and 5.5 of the EA. Unfortunately, there\n                    was no indication from the plaintiff or the defendants that the plaintiff was\n                    entitled to 1.5% of the profit with respect to Project MP and Gibson. The\n                    earliest indication of that was when the plaintiff sent an email to DW1 in July\n                    2010 to seek reimbursement of his expenses and where in return he was prepared\n                    to waive his huge claims under cll 5.3, 5.4 and 5.5. As I have explained earlier\n                    at [119]–[122], if the plaintiff truly believed at that point in time that\n                    he was entitled under the EA to those claims, he would not have waived them for\n                    the expenses. Between the plaintiff’s version and D7’s version I am\n                    of the view that D7’s version is more probable as it accords with\n                    commercial sense. Is the plaintiff entitled to 1.5% or 3% of the RODA and CKRA shares\n                if his account was true? 195    For completeness, I shall consider the\n                    plaintiff’s claim that although the Handwritten Amendments were made, he\n                    was promised 3% of the RODA and CKRA shares because of his good performance. The\n                    plaintiff submits that while his original entitlement to the share rewards was\n                    1.5% of the RODA and CKRA shares or their cash equivalent, the percentage was\n                    later increased to 3%. He claims that this is because D7 was pleased with his\n                    performance, especially in relation to the completion of Project Gibson, Project\n                    MP and the Group’s property investments.[note: 226]Pursuant to\n                    this, the plaintiff seeks 3% of the RODA and CKRA shares or their cash\n                        equivalent.[note: 227]As he had served 35 months from 1 August\n                    2007, he claims to be entitled to the shares for free.[note: 228]This is with reference to Table 1 in the\n                        EA.[note: 229] 196    The defendants submit that if the court\n                    finds that the plaintiff was indeed entitled to the share rewards, he should\n                    only be entitled to 1.5% as there was never any agreement to increase his reward\n                    to 3% of the shares.[note: 230]Additionally, D7 testified that when he\n                    wrote 1.5% of 100% against cll 5.4 and 5.5, he had explained to the plaintiff\n                    that he would share with him 1.5% of the profit made from the two projects from\n                    the divestment of the shares and if D7 did not make money, the plaintiff would\n                    not be entitled to anything. My decision 197    I am unconvinced by the plaintiff in this\n                    respect. First, the plaintiff did not plead this extra 1.5% in his original\n                        SOC.[note: 231]He only mentioned it when it\n                    was amended more than a year later.[note: 232]When\n                    questioned about why he failed to include this in his SOC, he explained that he\n                    had forgotten about it.[note: 233]The\n                    plaintiff also agreed that he had not provided any documentary evidence\n                    regarding the notes leading up to the extra 1.5%. All there was to his claim was that D7 was happy with\n                    his performance on the successful completion of Project MP and Project Gibson\n                    and D7 promised to increase his share rewards from 1.5% to 3%.[note: 234]However, that was unconvincing –\n                    why would D7 be happy with the outcome of Project MP and Project Gibson when\n                    they failed to attain the objective of attracting third party\n                investors? 198    Second, in the plaintiff’s email in\n                    July 2010 to DW1 purporting to waive his other claims, he mentioned 1.5% and not\n                    3% in relation to the share rewards. The July 2010 email would have been much\n                    closer to the occasions when D7 had allegedly increased his share reward to 3%,ie, in October 2008, October/November 2009 and\n                    March/April 2010, but it only indicated 1.5% instead of 3% when it was only\n                    about three or four months from the last occasion when D7 allegedly promised him\n                    3%. 199    For the above two reasons, I am not\n                    convinced of the plaintiff’s claim of his entitlement to 3% based on the\n                    oral agreement asserted.",
        "Are the share rewards independent of RODA and CKRA’s success\n                and profitability?": "200    Finally, the plaintiff submits that he is\n                    entitled to the share rewards under cll 5.4 and 5.5 upon the issuance of shares\n                    to D1 and D5 and subsequent monetisation of those shares for the two projects as\n                    it is a loyalty scheme. This implied that his entitlement was regardless of the\n                    success and profitability of these projects. 201    Was this the intention of the parties\n                    vis-à-vis those clauses when they signed the EA? I find that when D7 amended\n                    them by making the Handwritten Amendments, ambiguity resulted as those clauses\n                    became open to different interpretations. On a contextual reading of the\n                    clauses, I note that they are housed under the heading “Salary, bonuses,\n                    stock earn-outs and benefits”, which deals with the plaintiff’s\n                    remuneration, bonuses, benefits,etc. Generally,\n                    they are provisions to reward the plaintiff when the Group did well and it would\n                    seem logical that for the plaintiff to be entitled under cll 5.4 and 5.5, the\n                    projects must be successful and it was only then that the plaintiff would be\n                    given a share of the success. 202    For the above reasons, I reject the\n                    plaintiff’s share rewards claim under cll 5.4 and 5.5 of the EA. I shall\n                    now proceed to consider the counterclaims.",
        "Is the plaintiff in breach of his directors’ duties?": "",
        "D3’s position": "203    D3 submits that the plaintiff breached his\n                    directors’ duties when he performed his duties under the EA. The plaintiff\n                    had been appointed as the President Director because of his financial expertise.\n                    His role was to: (a) manage the day to day affairs of D3; (b) mentor DW1 such\n                    that she was taught about property, banking and financing matters;[note: 235]and\n                    (c) ensure that the necessary financing arrangements were in place so that D3\n                    could successfully complete its purchase of the 21 Anderson\n                        Properties.[note: 236]However, he failed to raise the\n                    necessary financing which resulted in the failure to acquire the 21 Anderson\n                        Properties[note: 237]and led to the seller of the 21\n                    Anderson Properties commencing legal action against D3 to compel the completion\n                    of the sale. 204    In order to raise sufficient funds, the\n                    Second RZB Loan facility was entered into by D6, D3, Springfield and RZB in\n                    order to finance the purchase of the 21 Anderson Properties.[note: 238]Despite the Second RZB Loan facility being obtained, issues arose and RZB called\n                    on the loan, causing D6, D3 and Springfield to sell the 21 Anderson Properties\n                    to ARCH at a loss.[note: 239]Hence it was necessary to raise money\n                    to repay the Second RZB Loan by 8 July 2010.[note: 240] 205    To effect the sale of the 21 Anderson\n                    Properties to ARCH, D3 and Springfield entered into the ARCH MOU. This was to be\n                    signed on 5 July 2010. However, DW1 submits that the plaintiff failed to turn up\n                    for the signing of the ARCH MOU and was uncontactable for the next few days,\n                    thus jeopardising the conclusion of the transaction.[note: 241]After that, the\n                    plaintiff did not do a proper handover of the 21 Anderson Properties project and\n                    left her to pick up the pieces with limited information and\n                        assistance.[note: 242]Therefore, the plaintiff breached his directors’ duties to\n                D3. The plaintiff’s position 206    The plaintiff first submits that D1 to D6\n                    were mistaken about the circumstances surrounding the completion of the ARCH\n                    MOU. It was to be executed in counterparts.[note: 243]Hence, there was\n                    neither need for the signatories to be physically present at the same location\n                    nor need for a “signing ceremony” that would have required the\n                    plaintiff’s or ARCH’s representative’s attendance.[note: 244] 207    Second, the plaintiff submits that his\n                    resignation was not a surprise. He had indicated as early as December 2009 that\n                    he would resign if the starch factories owned by CKRA were not operational by\n                    the end of July 2010.[note: 245]It was also untrue that he was\n                    intentionally uncontactable before tendering his resignation on 27 August 2010.\n                    He had tendered his resignation to Dr Patrick Loh (“Dr Loh”), the\n                    Chairman of RODA and CKRA, on 5 July 2010 with the resignation embargoed till 16\n                    July 2010.[note: 246]He had emailed D7 and DW1 on 5 July 2010\n                    at 2.49pm with the final ARCH document and an explanation that the deal was to\n                    be signed in counterparts.[note: 247] 208    Third, the plaintiff submits that it is also\n                    untrue that the plaintiff had failed to handover the project properly as he\n                    continued to provide assistance to D7 and his companies.[note: 248]Additionally, the plaintiff alleged that the resignation letters dated 27 August\n                    2010 had been forged and falsified since he had resigned on 5 July\n                        2010[note: 249]with the letters of resignation\n                    dated 1 July 2010.[note: 250]However, DW1’s hypothesis for the\n                    discrepancy was that while the plaintiff had resigned in July, Dr Loh had\n                    requested the plaintiff to post-date the letters of resignation to August 2010\n                    as it reflected badly on RODA and CKRA should they not have a President\n                    Director. Therefore, the letters of resignation dated August 2010 were to give\n                    the regulators some semblance of a proper handing over.[note: 251]In this regard, I should mention that\n                    I prefer DW1’s account as the plaintiff’s case is premised on\n                    fraudulent behaviour and he has to provide cogent evidence to prove his\n                    claim. 209    The plaintiff denies these allegations. He\n                    submits that D1, D3, D5 and D6 were in breach of the EA and had therefore come\n                    to court with unclean hands. I shall now address D3’s\n                allegations. The plaintiff did not breach his duty to act honestly 210    First, I find that the plaintiff had acted\n                    honestly. The circumstances showed that he was honestly mistaken regarding the\n                    need for his presence at the ARCH MOU signing. While he had thought that the\n                    agreement was to be executed in counterparts, the other parties did not think so\n                    and therefore they arranged for a meeting to sign the ARCH MOU on the morning of\n                    5 July 2010.[note: 252]On 5 July 2010 at 11.09am, Arch Capital\n                    sent the following email to the plaintiff: Andrew [the plaintiff]/Charles, Attached execution version of MOU based on agreed points in last\n                        week’s conference call. Please arrange for Bapak [D7] to sign in his\n                        personal capacity and an authorised signatory to sign for Cozmo and\n                        Springfield. Charles will sign for Arch Capital.For\n                            logistical purposes, it will be fine to have the document signed in\n                            counterpart.Please sign/arrange for signing and scan back to\n                        me the signed document with original by courier… . [emphasis added in bold italics] This was followed by an email from the plaintiff to D7 and DW1\n                        setting out the ARCH MOU’s terms.[note: 253]Subsequently, Arch Capital replied the plaintiff on 6 July 2010 at 7.19pm\n                        stating that D7 had signed the ARCH MOU and giving instructions for\n                        follow-up action.[note: 254]This probably explains why the\n                        plaintiff embarked on his own course of action to sign the documents in\n                        counterparts with no knowledge that there was a meeting fixed for D7 to sign\n                        the ARCH MOU on the morning of 5 July 2010.[note: 255] 211    That being the case, there is no basis to\n                    find the plaintiff dishonest if he was acting in the company’s best\n                    interests:Walter Woonat para 8.10. In fact, the\n                    plaintiff sent an email to DW3 disclaiming responsibility for any of D7 or\n                    DW1’s acts. The email reads:[note: 256] Hi Andrew [the plaintiff], Is MOU with ARCH executed? Please provide us a copy if it is. Dear [DW3], As [D7] himself disclosed, there are some significant familial\n                        repositioning, andI am unable to accept responsibility\n                            or act for any of them until they make a clear cut and irrevocable\n                            decision.… [emphasis added in bold italics] 212    In the circumstances, I find that the\n                    plaintiff was not in breach of his directors’ duty. The plaintiff did not breach his duty of care, skill and\n                diligence 213    Second, the plaintiff did not breach his\n                    duty of care, skill and diligence. This duty arises under common law and in\n                    equity (Andrew Keay,Directors’ Duties(Jordan Publishing Limited, 2nd Ed, 2014) (“Directors’ Duties”) at para 8.1). The standards to\n                    which a director is held to may not necessarily be the same in all cases and\n                    there are two different thresholds in determining whether a director has acted\n                    with skill and whether he has acted with diligence. The former necessitates a\n                    factual enquiry into his position and any special skill possessed by the\n                    director while the latter involves conscientiousness, energy and attentiveness\n                    that is required to ensure the company’s affairs are managed carefully:Directors’ Dutiesat paras 8.127 and\n                    8.135. (I)   The plaintiff did not breach his duty to act with reasonable\n                care and diligence 214    It is trite that directors owe a duty to the\n                    company to take reasonable care and diligence in the performance of their\n                    duties. InLim Weng Kee v Public Prosecutor[2002]\n                    2 SLR(R) 848 at [26]–[28], Yong Pung How CJ held that: … The policy under this modern approach is clear: a person who\n                        accepts the office of director undertakes the responsibility that he\n                        understands the nature of the duty required of that office. That duty will\n                        vary depending on the circumstances, the size and the business of the\n                        particular company and the experience or skills that the director held\n                        himself out to possess in support of appointment to that office. 27    A similar view was held by Hoffman J inRe D’Jan of London Ltd[1994] 1 BCLC 561\n                            (Chancery Division) where he decided that the duty of care owed by a\n                            director at common law is the conduct of a reasonably diligent person\n                            having both (a) the general knowledge, skill and experience that may\n                            reasonably be expected of a person carrying out the same functions as\n                            are carried out by that director in relation to the company; and (b) the\n                            genral knowledge, skill and experience which that director has. As\n                            pointed out by Professor Davis inGower’s\n                                Principles of Modern Company Law(sixth Ed) at p 642, the\n                            crucial difference with the traditional approach is that limb (b) adds a\n                            subjective standard which can operate only to increase, and not decrease\n                            the level of care and diligence required by the director. 28The law hence stands as thus:\n                                the civil standard of care\n                                and diligence expected of a director is\n                                objective, namely, whether he has exercised the same degree of care\n                                and diligence as a reasonable director found in\n                                his position. This standard is not fixed but a continuum depending\n                                on various factors such as the individual's role in the company, the\n                                type of decision being made, the size and the business of the\n                                company. However, it is important to note that, unlike the\n                                traditional approach, this standard will not be lowered to\n                                accommodate any inadequacies in the individual's knowledge or\n                                experience. The standard will however be raised if he held himself\n                                out to possess or in fact possesses some special knowledge or\n                                experience. [original emphasis omitted; emphasis added in italics] 215    I find that the plaintiff is not in breach\n                    of his duty to act with reasonable care and diligence. He was genuinely of the\n                    view that the ARCH MOU was to be signed in counterparts as per the Arch Capital\n                    email. I also disbelieve the allegation that he was uncontactable as he had sent\n                    several emails out on 5 July 2010[note: 257]and\n                    while he did not contest DW1’s evidence that he did not answer his phone\n                    even though they sought to call him many times,[note: 258]he\n                    might not have seen the need to return DW1’s calls bearing in mind that\n                    his relationship with DW1’s father, D7, was not the best at that time. He\n                    had also tendered his resignation around that time and to his mind, the ARCH MOU\n                    was completed and he had done his part to achieve its completion. 216    In addition, the plaintiff was a liaison\n                    officer who assisted in the fundraising efforts. When he was assigned to raise\n                    the necessary funds for D3’s acquisition of the 21 Anderson Properties, he\n                    sent DW1 the necessary documents with the necessary instructions to effect the\n                    acquisition. In spite of their deteriorating relationship, the plaintiff took\n                    the effort to explain to D7 and DW1 in details the terms of ARCH MOU. Given\n                    these circumstances, I find that the plaintiff did not breach his duty of\n                    reasonable care and diligence. (II)   The plaintiff did not breach his duty to act\n                skilfully 217    Second, directors are under a duty to\n                    discharge their duties skilfully. In the words of Clarke and Sheller JJA inDaniels and others (formerly practising as Deloitte\n                        Haskins & Sells) v Anderson and others(1995) 16 ACSR 607 at\n                    667: … Skill is that special competence which is not part of the\n                        ordinary equipment of the reasonable man but the result of aptitude\n                        developed by special training and experience which requires those who\n                        undertake work calling for special skill not only to exercise reasonable\n                        care but measure up to the standard of proficiency that can be expected from\n                        persons undertaking such work. … 218    The standard to which directors are held to\n                    varies according to whether they are in an executive position, whether they have\n                    specific managerial responsibilities and whether they have a contract of\n                    employment with the company and the duty of skill owed must be referenced to the\n                    objective body of knowledge and expertise possessed by those in the same\n                    calling:Walter Woonat para 8.107. 219    I hold that the plaintiff did not breach his\n                    duty to act with skill. The plaintiff was hired,inter\n                        alia, to assist in obtaining the necessary financing for the\n                    acquisition of the 21 Anderson Properties (see [203] above) and it was\n                    D3’s position that the plaintiff was just a liaison between D3 and the\n                    financiers, RZB and ARCH. In such circumstances, I find that the plaintiff did\n                    not breach of any duty of skill as it is not disputed that he did the necessary\n                    to ensure that the ARCH MOU documents were in place for the parties to sign in\n                    counterparts as requested by Arch Capital. The plaintiff did not misuse the defendants’ documents by using\n                them in these proceedings 220    Third, the plaintiff did not breach his duty\n                    by using documents belonging to the defendants. The law is that directors have a\n                    duty not to place themselves in situations where the interests of the company\n                    which he is bound to protect comes into conflict with either his personal\n                    interest or the interests of a third party for whom he acts:Walter Woonat para 8.40. It is undisputed that the information\n                    and documents were acquired as a result of the plaintiff’s directorship in\n                    D3 and the question is whether the plaintiff’s use of the documents in the\n                    present proceedings is improper. The no-conflict rule extends to refraining from\n                    using information and documents acquired by virtue of his position to make an\n                    improper profit for himself:Walter Woonat para\n                    8.45. 221    InEs-me Pty Ltd v\n                        Parker[1972] WAR 52, a director was alleged to have committed a\n                    breach of s 124(2) of the Companies Act 1961 (No 6839 of 1961) (Aust) in that he\n                    improperly used secret or confidential information for his own personal gain. In\n                    interpreting that section, Burt J held at 55 that for confidentiality to be made\n                    out, information need not be secret but must be confidential in the sense that\n                    apart from the statute, it would be a breach of the officer’s fiduciary\n                    duty to use that information to gain an advantage for himself. While this\n                    definition does not assist on what use of information amounts to a breach of\n                    fiduciary duty,Walter Woonat para 8.45 suggests\n                    that the use of information acquired by a director to make a profit for himself\n                    without disclosing that profit to the company would amount to a breach of a\n                    director’s fiduciary duty. Whether the use of information acquired by a\n                    director is improper must then be judged with reference to the director’s\n                    duty to act in the company’s interests and that would in turn depend on\n                    the nature and scope of the fiduciary relationship owed to the company:Tay Choo Wah v Public Prosecutor[1974–1976] SLR(R) 725 andSelangor United Rubber\n                        Estates Ltd v Craddock (No 3)[1968] 1 WLR 1555. 222    In this case, the plaintiff did not use the\n                    information and documents for any other purpose other than to gain access to\n                    justice in his claim against his former employer. There was no evidence to\n                    suggest that he misused his access to documents and used them for profit or to\n                    his advantage. Therefore, I hold that this counterclaim fails.",
        "Is the plaintiff in breach of confidence?": "223    The Four Counterclaimants also claim that\n                    the plaintiff was in breach of confidence because he had access to confidential\n                    information belonging to them in the course of his work.[note: 259]They submit\n                    that the plaintiff’s duty of confidentiality arises at common law since\n                    they are owners of the confidential documents and the plaintiff misused those\n                    documents for his own benefit at their expense in breach of his contractual\n                    obligations. Moreover, the plaintiff also had a duty of confidentiality to D1\n                    and D3 under s 157(2) of the Companies Act as he was the secretary and a\n                    director of D1 and D3 respectively. 224    Clause 3.1 of the EA is the confidentiality\n                    clause that governs the contracting parties. It is not applicable here as the EA\n                    is between the plaintiff and D7. 225    The plaintiff denies that he is in breach of\n                    his confidentiality obligations by wrongfully retaining and taking confidential\n                    documents relating to Project Gibson and Project MP in both in his pleaded case\n                    and under cross-examination.[note: 260]He also submits that the defendants\n                    are unable to show any loss or damage suffered as a result of the\n                    plaintiff’s alleged breaches and thus even if he was in breach of\n                    confidence, any damages awarded against him should be nominal.[note: 261] 226    It is trite that a duty of confidentiality\n                    can arise either from the express or implied terms of a contract. It can also\n                    arise out of a relationship under which information is imparted: R G Toulson\n                    & C M Phipps,Confidentiality(Sweet &\n                    Maxwell, 3rd Ed, 2012) (“Toulson &\n                        Phipps”) at para 2–018. As the types of\n                    relationships in which a duty of confidentiality can arise are manifold, the\n                    test is whether “a reasonable person would understand [the information]\n                    as involving an obligation of confidentiality”:Toulson & Phippsat para 3–008. 227    It is undisputed that the plaintiff had\n                    obtained the documents through his employment under the EA and through his\n                    directorship with D3. The Four Counterclaimants submit that the confidential\n                    documents obtained by the plaintiff contain sensitive internal correspondence,\n                    sensitive information relating to correspondence with banks on the provision of\n                    loan facilities, Project MP, Project Gibson and the acquisition of the 21\n                    Anderson Properties. They are not freely accessible to the public and should\n                    therefore not be used for any other purpose other than for one’s duties\n                    with the relevant companies.[note: 262] 228    I find that while the information and\n                    documents are confidential, there was no breach of confidence by the plaintiff.\n                    The duty to maintain confidentiality is not an unqualified one and the scope of\n                    confidence is not so wide such that the confidential information cannot be used\n                    for the purposes of establishing one’s claim. InEsso\n                        Australia Resources Ltd v Plowman(1995) 128 ALR 391 at 406, such\n                    an exception was recognised in the context of arbitration agreements, where\n                    Brennan J held that where there is no provision for confidentiality under an\n                    arbitration agreement, a term would be implied that the other party will keep\n                    the documents produced and the information disclosed confidential unless\n                    disclosure is fairly required for the protection of the party’s legitimate\n                    interests.Toulson & Phippsat paras\n                    3–175 and 3–179 to 3–180 comments that: 3–175 Another purpose for which it may be\n                            necessary for a party to refer to information otherwise confidential is\n                            in order to establish or protect his legal rights against other parties\n                            or to defend himself. … 3–179 It is\n                            suggested that the legitimate interests of the confidant may in\n                            appropriate cases include disclosure to another party who has a\n                            legitimate interest in the matter, for example, disclosure by a wholly\n                            owned subsidiary to a holding\n                            company. 3–180 A possible\n                            approach is to say that it is all a matter for the court’s\n                            discretion. InWebster v James Chapman &\n                                CoScott J. said: “The court must, in each case where protection of confidential\n                            information is sought, balance on the one hand the legitimate interests\n                            of the plaintiff in seeking to keep the confidential information\n                            suppressed and on the other hand the legitimate interests of the\n                            defendant in seeking to make use of the information. There is never any\n                            question of an absolute right to have the confidential information\n                            protected. The protection is the consequence of the balance to which I\n                            have referred coming down in favour of the plaintiff.” 229    Balancing the rights of the plaintiff and\n                    Four Counterclaimants, I find that the balance lies with the plaintiff.\n                    Disclosing the confidential information for the purposes of legal proceedings is\n                    necessary for the plaintiff to have access to justice and establish his legal\n                    rights. They were disclosed in the interests of justice and to enable the truth\n                    to be elucidated, facilitating the litigation process. Therefore, there was no\n                    breach of confidentiality by the plaintiff.",
        "Conclusion": "230    As this has been a long judgment, my\n                    findings with respect to the plaintiff’s claims are summarised as\n                    follows: (a)     D7 was the plaintiff’s\n                        counterparty to the EA. (b)     Thecontra proferentemrule should not be applied against the plaintiff. (c)     The plaintiff is not entitled to the\n                        remainder of his expenses claimed for. (d)     The plaintiff did not waive his claims to the bonus\n                        payment and share rewards. (e)     The plaintiff is not entitled to the Periodic\n                        Bonuses. (f)     The\n                        plaintiff is not entitled to the share rewards under cll 5.4 and 5.5 of the\n                        EA. 231    I also dismiss the counterclaims of D1, D3,\n                    D5 and D6 entirely. 232    Therefore, I dismissed both the\n                    plaintiff’s claim and counterclaims. I shall hear the parties with regards\n                    to costs.",
        "Annex A": "Table 1: Payment/Earn-out Schedule for Stock\n                                    Earn-out and Ownership AwardsCessation of Employment (based on last\n                                    day)Maximum Project Gibson Stock Price\n                                    PaymentMaximum Project MP Stock Price\n                                    Payment6 months after\n                                            1stAugust\n                                2007100% of Project Gibson Stock\n                                        Price at RTO/IPO100% of Project MP Stock Price at\n                                        RTO/IPO7 months after\n                                            1stAugust\n                                200796% of Project Gibson Stock Price\n                                        at RTO/IPO96% of Project MP Stock Price at\n                                        RTO/IPO8 months after\n                                            1stAugust\n                                200792% of Project Gibson Stock Price\n                                        at RTO/IPO92% of Project MP Stock Price at\n                                        RTO/IPO9 months after\n                                            1stAugust\n                                200788% of Project Gibson Stock Price\n                                        at RTO/IPO88% of Project MP Stock Price at\n                                        RTO/IPO10 months after\n                                            1stAugust\n                                200784% of Project Gibson Stock Price\n                                        at RTO/IPO84% of Project MP Stock Price at\n                                        RTO/IPO11 months after\n                                            1stAugust\n                                200780% of Project Gibson Stock Price\n                                        at RTO/IPO80% of Project MP Stock Price at\n                                        RTO/IPO12 months after\n                                            1stAugust\n                                200776% of Project Gibson Stock Price\n                                        at RTO/IPO76% of Project MP Stock Price at\n                                        RTO/IPO13 months after\n                                            1stAugust\n                                200772% of Project Gibson Stock Price\n                                        at RTO/IPO72% of Project MP Stock Price at\n                                        RTO/IPO14 months after\n                                            1stAugust\n                                200768% of Project Gibson Stock Price\n                                        at RTO/IPO68% of Project MP Stock Price at\n                                        RTO/IPO15 months after\n                                            1stAugust\n                                200764% of Project Gibson Stock Price\n                                        at RTO/IPO64% of Project MP Stock Price at\n                                        RTO/IPO16 months after\n                                            1stAugust\n                                200760% of Project Gibson Stock Price\n                                        at RTO/IPO60% of Project MP Stock Price at\n                                        RTO/IPO    17 months after\n                                            1stAugust\n                                200756% of Project Gibson Stock Price\n                                        at RTO/IPO56% of Project MP Stock Price at\n                                        RTO/IPO18 months after\n                                            1stAugust\n                                200752% of Project Gibson Stock Price\n                                        at RTO/IPO52% of Project MP Stock Price at\n                                        RTO/IPO19 months after\n                                            1stAugust\n                                200748% of Project Gibson Stock Price\n                                        at RTO/IPO48% of Project MP Stock Price at\n                                        RTO/IPO20 months after\n                                            1stAugust\n                                200744% of Project Gibson Stock Price\n                                        at RTO/IPO44% of Project MP Stock Price at\n                                        RTO/IPO21 months after\n                                            1stAugust\n                                200740% of Project Gibson Stock Price\n                                        at RTO/IPO40% of Project MP Stock Price at\n                                        RTO/IPO22 months after\n                                            1stAugust\n                                200736% of Project Gibson Stock Price\n                                        at RTO/IPO36% of Project MP Stock Price at\n                                        RTO/IPO23 months after\n                                            1stAugust\n                                200732% of Project Gibson Stock Price\n                                        at RTO/IPO32% of Project MP Stock Price at\n                                        RTO/IPO24 months after\n                                            1stAugust\n                                200728% of Project Gibson Stock Price\n                                        at RTO/IPO28% of Project MP Stock Price at\n                                        RTO/IPO25 months after\n                                            1stAugust\n                                200724% of Project Gibson Stock Price\n                                        at RTO/IPO24% of Project MP Stock Price at\n                                        RTO/IPO26 months after\n                                            1stAugust\n                                200720% of Project Gibson Stock Price\n                                        at RTO/IPO20% of Project MP Stock Price at\n                                        RTO/IPO27 months after\n                                            1stAugust\n                                200716% of Project Gibson Stock Price\n                                        at RTO/IPO16% of Project MP Stock Price at\n                                        RTO/IPO28 months after\n                                            1stAugust\n                                200712% of Project Gibson Stock Price\n                                        at RTO/IPO12% of Project MP Stock Price at\n                                        RTO/IPO29 months after\n                                            1stAugust\n                                20078% of Project Gibson Stock Price\n                                        at RTO/IPO8% of Project MP Stock Price at\n                                        RTO/IPO30 months after\n                                            1stAugust\n                                20074% of Project Gibson Stock Price\n                                        at RTO/IPO4% of Project MP Stock Price at\n                                        RTO/IPO    Thereafter0% of Project Gibson Stock Price\n                                        at RTO/IPO0% of Project MP Stock Price at\n                                        RTO/IPO     [note: 1]Pf’s Affidavit of\n                                Evidence-in-Chief (“AEIC”) at para\n                        3. [note: 2]Statement of Claim (“SOC”) at paras 12, 15, 18\n                                and 20. [note: 3]SDB at p 64 at para\n                    19. [note: 4]SDB at p\n                                    64 at para 19. [note: 5]D7’s AEIC at paras 16, 17, 26 and Exhibit\n                                SS-3. [note: 6]SDB at pp 80 –\n                        84. [note: 7]Pf’s AEIC at para\n                        7. [note: 8]Pf’s AEIC at para\n                        7. [note: 9]Pf’s\n                                AEIC at para 7. [note: 10]Pf’s\n                                AEIC at [17]. [note: 11]Pf’s\n                                AEIC at paras 17–18; D7’s AEIC at para\n                        8. [note: 12]Pf’s AEIC at para 17. [note: 13]Pf’s AEIC at para\n                    19. [note: 14]D1 to\n                                D6’s core bundle at p 1. [note: 15]D7’s\n                                AEIC at para 19. [note: 16]Pf’s\n                                AEIC at para 51(3). [note: 17]D1 to\n                                D6’s CB at pp 3–4. [note: 18]D7’s AEIC at p 39. [note: 19]Pf’s oral submissions at p 8. [note: 20]Pf’s AEIC at para\n                                27. [note: 21]Pf’s\n                                AEIC at para 25. [note: 22]Pf’s AEIC at para\n                            105. [note: 23]Annex to closing submissions of 1st to\n                                6th defendants, Tab 1, Agreed Statement of Facts\n                                (“ASOF”) at paras\n                    5–21. [note: 24]Chart\n                                    of RTO of CKRA by Citra Group (2nd Rights\n                            Issue). [note: 25]Annex to closing submissions of 1st to 6th defendants, Tab 1,\n                                ASOF at para 21. [note: 26]Pf’s AEIC vol 6 at p\n                        1825. [note: 27]Pf’s AEIC vol 6 at pp 1824 &\n                            1826. [note: 28]Pf’s AEIC vol 6 at p\n                                    1826. [note: 29]Pf’s AEIC at para 121. [note: 30]Pf’s AEIC at para\n                            106. [note: 31]Pf’s\n                                AEIC at paras 110–112. [note: 32]Pf’s\n                                AEIC at para 130. [note: 33]Pf’s AEIC at para\n                                    130. [note: 34]Pf’s AEIC at para 130. [note: 35]Pf’s AEIC at para\n                                    130. [note: 36]Pf’s AEIC at para\n                            122. [note: 37]D7’s AEIC at para\n                            46. [note: 38]Pf’s AEIC at para\n                            131. [note: 39]D7’s\n                                AEIC at para 56. [note: 40]D7’s AEIC at para\n                            40. [note: 41]Pf’s AEIC at para\n                            76. [note: 42]Tan\n                                    Ting Yong’s AEIC at para 20. [note: 43]Pf’s AEIC at paras 76 &\n                            77. [note: 44]Annex\n                                    to closing submissions of 1st to 6th defendants, Tab 1, ASOF at\n                                    para 28. [note: 45]Pf’s AEIC at paras 75 &\n                                    77. [note: 46]Pf’s AEIC at [82]; Tan Ting\n                                    Yong’s AEIC at para\n                    23. [note: 47]Tan Ting Yong’s AEIC at para\n                        21. [note: 48]Annex to\n                                closing submissions of 1st to 6th defendants, Tab 1, ASOF, at para\n                                32. [note: 49]Pf’s\n                                AEIC at paras 81–85. [note: 50]Pf’s AEIC at paras\n                                81–84. [note: 51]Pf’s AEIC at para\n                            94. [note: 52]Pf’s AEIC at para 104\n                                    . [note: 53]Pf’s AEIC at para 104. [note: 54]Pf’s AEIC at para\n                                    104. [note: 55]D7’s\n                                AEIC at [60]–[61]. [note: 56]Pf’s AEIC at para\n                            102. [note: 57]D7’s AEIC at para 49. [note: 58]D7’s AEIC at para\n                            56. [note: 59]Pf’s AEIC at para\n                            85. [note: 60]D7’s AEIC at para\n                            40. [note: 61]Pf’s AEIC at para 88; D7’s\n                                AEIC at para 40. [note: 62]D7’s AEIC at para\n                            52. [note: 63]Pf’s AEIC at para\n                            167. [note: 64]Pf’s AEIC at para 153. [note: 65]Pf’s\n                                AEIC at para 165. [note: 66]NE 4/6/2014 at p 66, line\n                            27. [note: 67]Pf’s AEIC at para\n                168. [note: 68]Pf’s AEIC at para\n                169. [note: 69]Pf’s\n                                AEIC at para 171. [note: 70]Pf’s\n                                AEIC at para 176. [note: 71]D7’s\n                                AEIC at p 346. [note: 72]Pf’s\n                                AEIC at para 185. [note: 73]Pf’s\n                                AEIC at para 186. [note: 74]Pf’s AEIC at para 178. [note: 75]D7’s AEIC at para 54. [note: 76]D7’s\n                                AEIC at para 54. [note: 77]D7’s AEIC at para\n                            58. [note: 78]NE 16/10/2014 at p 124, lines\n                        5–7. [note: 79]Pf’s\n                                AEIC at para 230. [note: 80]Pf’s AEIC at para\n                            232. [note: 81]Pf’s AEIC at para\n                        233–234. [note: 82]Pf’s closing submissions at para\n                                138; pf’s reply submissions at par a\n                        10. [note: 83]D1 to D6’s closing submissions at para 48; D7’s\n                                closing submissions at para\n                5. [note: 84]Pf’s\n                                closing submissions at para 70. [note: 85]Pf’s AEIC at para\n                            51(1). [note: 86]Pf’s AEIC at para\n                            52. [note: 87]NE 3/6/2014 at p 41, lines 9–14,\n                                29–32. [note: 88]NE 16/10/2014 at p 27, lines\n                        17–19. [note: 89]Pf’s closing submissions at para\n                        86. [note: 90]Pf’s closing submissions at para\n                            141. [note: 91]Pf’s\n                                closing submissions at para 90. [note: 92]Pf’s closing submissions at para\n                            92. [note: 93]Pf’s reply submissions at para\n                                13. [note: 94]Pf’s reply submissions at para 14; pf’s oral\n                                submission at pp 3–4. [note: 95]Pf’s oral submissions at p\n                    4. [note: 96]Pf’s reply submissions at\n                                    para 16 & 19; pf’s oral submissions at p\n                                5. [note: 97]SDB at p 87. [note: 98]Pf’s closing submissions at para 80; D1 to\n                                D6’s closing submissions at para 14. [note: 99]Df’s closing submissions at para\n                                44–47. [note: 100]Df’s closing submissions at para\n                            47. [note: 101]D7’s AEIC at paras 16, 17 and\n                                26. [note: 102]D7’s AEIC at para 4. [note: 103]D7’s AEIC at para 5. [note: 104]D7’s oral submissions at para\n                        13. [note: 105]D1 to D6’s closing submissions\n                                at para 33. [note: 106]D7’s oral submissions at para 18. [note: 107]D7’s oral submissions at para\n                                20. [note: 108]Pf’s AEIC at para\n                            52. [note: 109]Pf’s closing submissions at para\n                        149. [note: 110]NE\n                                2/7/2014 at p 50, lines 5–10. [note: 111]NE 3/6/2014 at p 32, lines\n                        15–16. [note: 112]Pf’s AEIC at p 137. [note: 113]NE\n                                3/6/2014 at p 37, lines 7–8. [note: 114]NE 3/6/2014 at p 38, lines\n                                12–14. [note: 115]NE 3/6/2014 at p 38, lines\n                                12–20. [note: 116]NE\n                                3/6/2014 at p 38, lines 18–20. [note: 117]NE 5/6/2014 at p 4, lines 27–29; see Exhibit\n                                P1. [note: 118]NE\n                                3/6/2014 at p 39, lines 20–22. [note: 119]NE\n                                3/6/2014 at p 42, lines 3–6. [note: 120]NE\n                                16/10/2014 p 28 at lines 12–22. [note: 121]NE 16/10/2014 at p 103, lines\n                                2–3. [note: 122]NE 2/7/2014 at p 50, lines\n                                31–32 to p 51, lines\n                    1–2. [note: 123]NE\n                                16/10/2014 at p 66, lines 28–29. [note: 124]NE\n                                16/10/2014 at p 67, lines 17–26. [note: 125]NE\n                                16/10/2014 at p 99, lines\n                    18–30. [note: 126]Pf’s AEIC at p 137. [note: 127]NE 3/6/2014 at p 45, lines\n                                12–16. [note: 128]D1 to D6’s CB at p 1. [note: 129]NE\n                                2/7/2014 at p 84, lines 5–6. [note: 130]NE 16/10/2014 at p 101, lines\n                                12–25. [note: 131]NE\n                                2/7/2014 at p 50, lines 5–10. [note: 132]NE 3/6/2014 at p 56, lines\n                                11–15. [note: 133]Pf’s AEIC at para 54; NE 3/6/2014 at p 47, lines\n                                2–5. [note: 134]NE 2/7/2014 at p 50, lines\n                                19–20, 25–26. [note: 135]Pf’s AEIC at para 54. [note: 136]NE 16/10/2014 at p 58, lines\n                        2–14. [note: 137]NE 16/10/2014 at p 7, lines\n                        13–15. [note: 138]NE 16/10/2014 at p 7, lines\n                                13–18. [note: 139]Pf’s AEIC at para\n                            45. [note: 140]Pf’s closing submission at\n                                para 74. [note: 141]Pf’s AEIC at paras\n                                46–47; D7’s AEIC at paras 17 & 36; D7’s\n                                closing submissions at para 48. [note: 142]Pf’s reply submissions at para\n                                97. [note: 143]Pf’s closing submissions at para\n                        181. [note: 144]Pf’s AEIC at para\n                    258(1). [note: 145]Pf’s AEIC at para\n                                    258(2). [note: 146]Pf’s AEIC at para\n                                    258(3). [note: 147]Pf’s AEIC at para\n                            258(4). [note: 148]Pf’s AEIC at para\n                    258(5). [note: 149]NE\n                                24/6/2014 at p 66, line 14; [note: 150]Angel’s AEIC at para\n                            1. [note: 151]NE\n                                24/6/2014 at p 66, lines 19–28. [note: 152]NE 25/6/2014 at p 77, lines 11–25; NE 25/6/2014 at p\n                                80, lines 1–7. [note: 153]D7’s AEIC at paras\n                        69–70. [note: 154]SDB at p\n                                79. [note: 155]Angel’s AEIC at\n                            AS-9. [note: 156]Angel’s AEIC at\n                            AS-10. [note: 157]30AB at\n                                p 8706. [note: 158]NE 24/6/2014 at p 78, lines\n                                13–23. [note: 159]30AB at p 8706; SDB at p\n                1. [note: 160]NE 24/6/2014 at p 7, lines 10–20; D7’s closing\n                                submissions at para 195. [note: 161]D1 to D6’s closing\n                                    submissions at para 94; D1 to D6’s CB at p\n                                380. [note: 162]D1\n                                    to D6’s closing submissions at para\n                            102. [note: 163]D1\n                                    to D6’s closing submissions at para\n                            105. [note: 164]Pf’s AEIC at para 261; NE 4/6/2014 at p 38, lines\n                                3–5. [note: 165]Pf’s AEIC at para\n                            262. [note: 166]Pf’s AEIC at para 23; SDB at paras 15, 19 &\n                                21. [note: 167]Pf’s closing submissions at para\n                        154. [note: 168]Pfs closing submissions at paras\n                            155–159. [note: 169]NE 16/10/2014 at p 120, lines\n                                4–7. [note: 170]D1 to D6’s closing submissions\n                                at par a 107. [note: 171]D1 to\n                                D6’s closing submissions at para 115; D7’s closing\n                                submissions at para 69. [note: 172]Pf’s closing submissions at\n                                paras 75–77; pf’s reply submissions at para\n                            56. [note: 173]Pf’s reply submissions at para\n                        56. [note: 174]Pf’s AEIC at paras 104, 130\n                                and 168; pf’s closing submissions at para\n                        161. [note: 175]D7’s AEIC at para\n                            56. [note: 176]D1 to D6’s closing submissions at paras 127 &\n                                135 [note: 177]D1 to\n                                D6’s closing submissions at paras 122 & 156; NE 4/6/2014\n                                at p 75, lines 25 – 28. [note: 178]D7’s closing submissions\n                                    at para 83. [note: 179]D1 to D6’s closing submissions\n                                at para 160; pf’s AEIC at paras 82, 110 and\n                        153. [note: 180]D1 to D6’s closing submissions\n                                at para 167; NE 27/6/2014 at p 8, lines 1 – 10, p 11, lines 20\n                                – 23, p 72, lines 3 – 6, p 78, lines 9 – 13, p 81,\n                                lines 10 – 12. [note: 181]D1 to D6’s CB at pp\n                                3–4. [note: 182]NE 6/6/2014 at p 44, lines\n                                11–22. [note: 183]D1 to\n                                D6’s core bundle at p 3. [note: 184]NE 4/6/2014 at p 78, line\n                            31. [note: 185]ABOD vol 29 at p\n                8639. [note: 186]Chan Lie\n                                Leng’s AEIC at para 3. [note: 187]Chan Lie Leng’s AEIC at para\n                        4. [note: 188]Chan Lie Leng’s AEIC at para\n                        7. [note: 189]Chan Lie Leng’s AEIC at para\n                        10. [note: 190]Chan Lie Leng’s AEIC at para\n                        17. [note: 191]NE 27/6/2014 at p 8, lines\n                        8–10. [note: 192]NE 27/6/2014 at p 11, lines\n                                20–23. [note: 193]NE\n                                27/6/2014 at p 12, lines\n                4–5. [note: 194]NE\n                                    27/6/2014 at p 79, lines 31–32, p 80, line\n                                1. [note: 195]NE 27/6/2014 at p 80, lines\n                                    9–14. [note: 196]NE\n                                    27/6/2014 at p 80, lines\n                        20–23. [note: 197]NE 27/6/2014 at p 80, lines\n                                4–7, 15–18 and\n                        24–25. [note: 198]Pf’s closing submission at\n                                para 116. [note: 199]NE 16/10/2014 at p 110, lines\n                                29–30. [note: 200]Pf’s AEIC at para\n                            140. [note: 201]Pf’s oral submissions at p 7. [note: 202]Pf’s closing submissions at paras 119 &\n                            126. [note: 203]Pf’s oral submissions at p\n                                8. [note: 204]Pf’s oral submissions at p\n                                7. [note: 205]Pf’s oral submissions at p 8;\n                                NE 16/10/2014 at p 111, line\n                20. [note: 206]D7’s AEIC at paras\n                        59–61. [note: 207]NE 16/10/2014 at p 143, line 13. [note: 208]NE 2/7/2014 at p 79, lines 22–24; 16/10/2014 at p\n                                151, para 25–31. [note: 209]D1 to\n                                D7’s closing submissions at para 197; NE 16/10/2014 at p 132,\n                                lines 5–7. [note: 210]SDB at p 61. [note: 211]NE\n                                5/6/2014 at p 26, line 24. [note: 212]NE 5/6/2014 at p 25, lines\n                        11–12. [note: 213]NE 16/10/2014 at p 162, lines\n                                5–32 to p 163, lines\n                    1–13. [note: 214]NE 16/10/2014 at p 211, line 29 to p\n                                213, line 18. [note: 215]D7’s AEIC at p\n                            355. [note: 216]NE\n                                5/6/2014 at p 49, lines 1–20; p 44, lines\n                            17–25. [note: 217]NE\n                                2/7/2014 at p 16, lines 23–32; NE 1/7/2014 at p 10, lines\n                                21–22. [note: 218]NE 6/6/2014 at p 7, lines\n                                25–31. [note: 219]NE 6/6/2014 at p 10, lines\n                                6–8. [note: 220]NE 6/6/2014 at p 16, line\n                            8. [note: 221]Pf’s AEIC vol 6 at p\n                                1826. [note: 222]Annexes\n                                to closing submissions of D1 to D6, Tab F. [note: 223]Pf’s reply submissions at\n                        [63]. [note: 224]Pf’s reply submissions at\n                                [68]. [note: 225]Pf’s reply submissions at\n                                [72]. [note: 226]Pf’s AEIC at para 27. [note: 227]Pf’s AEIC at para\n                            130. [note: 228]Pf’s AEIC at para 139 &\n                        104. [note: 229]D1 to D6’s core bundle at pp\n                                4–5. [note: 230]D7’s AEIC at para\n                            23. [note: 231]NE 4/6/2014 at p 3, lines\n                                22–32. [note: 232]NE\n                                4/6/2014 at p 7, lines 1–8. [note: 233]NE\n                                4/6/2014 at p 4, lines 29–32. [note: 234]Pf’s AEIC at paras\n                        28–31. [note: 235]Angel’s AEIC at para 9. [note: 236]Angel’s AEIC at para\n                                14. [note: 237]Angel’s AEIC at para\n                                16. [note: 238]Angel’s AEIC at p 127. [note: 239]Angel’s AEIC at para\n                                20. [note: 240]Angel’s AEIC at para\n                20. [note: 241]Angel’s AEIC at para 23; D1 to D6’s closing\n                                submissions at para 454. [note: 242]Angel’s AEIC at para 23;\n                                pf’s closing submissions at para 185. [note: 243]SDB at\n                                pp 133 – 134. [note: 244]29AB at p 8607. [note: 245]Pf’s AEIC at para\n                            234. [note: 246]Pf’s AEIC at para\n                            235. [note: 247]29AB at\n                                p 8615. [note: 248]Pf’s AEIC at para 236. [note: 249]NE 24/6/2014 at p 80, lines\n                                6–7. [note: 250]Pf’s AEIC at para\n                            244. [note: 251]NE 24/6/2014 at p 86, lines\n                        16–18. [note: 252]NE 4/4/2014 at p 74, line 19 to p\n                                75, line 12; 29AB at pp 8612 – 8613; CB at p\n                            690. [note: 253]Pf’s AEIC at p 8615. [note: 254]Pf’s AEIC at p\n                                    8617. [note: 255]NE\n                                    4/6/2014 at p 51, lines 27 –\n                        28. [note: 256]Pf’s AEIC vol 29 at p 8612. [note: 257]See NE\n                                4/6/2014 at p 56, lines 3–5. [note: 258]NE\n                                25/6/2014 at p 45, lines 27–30. [note: 259]SDB at pp 82–83. [note: 260]SDB at p\n                                153; NE 5/6/2014 at p 97, lines\n                        16–19. [note: 261]Pf’s closing submissions at\n                        [193]. [note: 262]D1 to\n                                D6’s closing submissions at\n                    [466]."
    }
}