{
    "case_title": "Lee Chuan Meng\n      v\n      Public Prosecutor",
    "ncitation": "[2015] SGHC 37",
    "coram": "See Kee Oon JC",
    "sections": {
        "The facts": "3       Statements of agreed facts were tendered below at the trial. I shall paraphrase the parts that are material. On 9 April 2013, the appellant was arrested on suspicion of having committed drug-related offences. He was searched and a number of items were recovered, including a sachet containing a crystalline substance. The appellant was duly arrested. The following day, two samples of the appellant’s urine were sent to the Health Sciences Authority for analysis. Both samples were found to contain methamphetamine. Subsequently, the crystalline substance found on the appellant was also sent for analysis. The substance was likewise found to contain methamphetamine. 4       The appellant had previously been admitted to approved institutions twice, the details of which are as follows. On 28 October 2002, he was admitted to the Sembawang Drug Rehabilitation Centre (“DRC”) following his consumption of the specified drug, morphine, and on 3 June 2011 he was admitted to the DRC at Changi Prison following his consumption of methamphetamine. On 3 November 2011, five months after his admission to the Changi Prison DRC, he was removed from there and was taken to the District Court, where he was convicted of a number of moneylending and customs offences. 5       What happened next is not in the statement of agreed facts but it does not appear to be disputed. Having been convicted of these moneylending and customs offences, the appellant was sentenced to a term of imprisonment and was fined. Thus, he did not return to the DRC but proceeded instead to serve his sentence at Admiralty West Prison. He was released from prison in March 2012. Just over a year later, he was arrested on 9 April 2013 as described above.",
        "The proceedings below": "6       The appellant faced two charges in the court below, involving the consumption and possession of methamphetamine. He pleaded guilty to the possession charge and for that offence a sentence of four years’ imprisonment was imposed. In contrast, he claimed trial to the consumption charge. He conceded that he had committed the offence of consuming methamphetamine. But he contested the prosecution’s position that, by reason of his previous admissions to the Sembawang and Changi DRCs, he was liable to be sentenced under the LT1 scheme of enhanced punishments under the Act – a scheme I shall shortly describe. 7       The District Judge rejected the appellant’s contentions and accepted the prosecution’s position. This meant that the conviction on the consumption charge carried a mandatory minimum sentence. The District Judge imposed a term of imprisonment of five years and two months and ordered three strokes of the cane. The terms of imprisonment imposed for the consumption and possession charges were ordered to run concurrently, making a total sentence of imprisonment for five years and two months and three strokes of the cane. The District Judge’s grounds of decision are published asPP v Lee Chuan Meng[2014] SGDC 281 (“the GD”).",
        "The LT1 scheme of enhanced punishments for drug consumption": "8       Under s 8(b)(ii) of the Act, it is an offence to consume a specified drug. In the instant case it is not controversial that the appellant committed the offence of consumption. A person convicted of this offence faces a maximum sentence of 10 years’ imprisonment and a fine of $20,000, pursuant to s 33(1) of the Act read with the Second Schedule. There is no minimum sentence if the person is a first-time offender. But that may not be so if he has a history of drug abuse. 9       In particular, what is relevant to the instant case is that s 33A(1)(a) of the Act provides that if he “has not less than 2 previous admissions” he shall be punished with not less than five years’ imprisonment and three strokes of the cane. An “admission” is defined in s 33A(5)(c) as an admission to an approved institution by a written order of the Director of the Central Narcotics Bureau (“the CNB”; and I shall refer to the Director of the CNB simply as “the Director”) in the exercise of his powers under s 34(2) of the Act. 10     The relevant statutory provisions in s 33A are as follows: Punishment for repeat consumption of specified drugs 33A.—(1) Where a person who has not less than — (a)    2 previous admissions; (b)    2 previous convictions for consumption of a specified drug under section 8(b); (c)    2 previous convictions for an offence of failure to provide a urine specimen under section 31(2); (d)    one previous admission and one previous conviction for consumption of a specified drug under section 8(b); (e)    one previous admission and one previous conviction for an offence of failure to provide a urine specimen under section 31(2); or (f)    one previous conviction for consumption of a specified drug under section 8(b) and one previous conviction for an offence of failure to provide a urine specimen under section 31(2), is convicted of an offence under section 8(b) for consumption of a specified drug or an offence of failure to provide a urine specimen under section 31(2), he shall on conviction be punished with — (i)    imprisonment for a term of not less than 5 years and not more than 7 years; and (ii)   not less than 3 strokes and not more than 6 strokes of the cane. … (5)    For the purposes of this section — … (c)    “admission” means an admission under section 34(2) to an approved institution … 11     I will now turn to examine how an “admission” to an approved institution comes about because that furnishes the context within which the appellant’s arguments must be considered. Under s 34(2)(b) of the Act, the Director may order that a person be admitted to an approved institution if he is satisfied that it is “necessary” for that person to undergo “treatment or rehabilitation or both” at the institution. The Director’s assessment of whether it is necessary to take such a course is based on either one of two things. The first is a medical examination or observation of the person thatthe Director may order if he reasonably suspects that person to be a “drug addict”: s 34(1) of the Act. The second is the result of urine tests that any CNB officer, immigration officer or police officer of requisite seniority may order if he reasonably suspects that the person concerned has committed the offence of consuming controlled or specified drugs: s 31(1). 12     Thus the Director decides whether to admit a person to an approved institution on the basis of medical or scientific evidence that the person is a drug addict, or has at least consumed controlled or specified drugs. It was in the light of this that Chan Sek Keong CJ (as he then was) said inMohammad Faizal bin Sabtu v Public Prosecutor[2012] 4 SLR 947 that prior to the making of an order for admission to an approved institution “the fact that the individual concerned is a drug addict would have been conclusively determined by scientific evidence” (at [49]). It might be pointed out parenthetically that “drug addict” is a phrase defined by s 2 of the Act; it refers to a person “who, through the use of any controlled drug, has developed a desire or need to continue to take that controlled drug” or has developed “a psychological or physical dependence upon the effect of that controlled drug”. I would perhaps venture to qualify the words of Chan CJ by saying that what is “conclusively determined by scientific evidence” may not so much be that the person is a “drug addict” within the strict meaning of s 2 of the Act, but merely that he has consumed drugs. Having said that, if the Director then deems it necessary to admit the person to an approved institution for treatment or rehabilitation, it means for all practical purposes that the Director has determined that this person is indeed a “drug addict”. 13     When the Director has decided that a person should be admitted to an approved institution, the duration of that person’s stint in the institution is governed by a number of sub-sections under s 34 of the Act. In particular, s 34(3) provides that the person shall be detained for six months unless he is discharged earlier by either the Director or the Review Committee of the institution. I note at this juncture that the appellant relies on this provision in support of his case. The Act goes on to state in ss 34(4) and (5) that the Review Committee may extend a person’s detention in an institution for further periods not exceeding six months at a time, subject to an overall maximum detention period of three years. 14     Again I reproduce the relevant statutory provisions for convenient reference: Urine tests 31.—(1) Any officer of the [CNB], immigration officer or police officer not below the rank of sergeant may, if he reasonably suspects any person to have committed an offence under section 8(b), require that person to provide a specimen of his urine for urine tests to be conducted under this section. ... (4) A specimen of urine provided under this section shall be divided into 3 parts and dealt with, in such manner and in accordance with such procedure as may be prescribed, as follows: (a)    … (b)    each of the remaining 2 parts of the urine specimen shall be marked and sealed and a urine test shall be conducted on each part by a different person, being either an analyst employed by the Health Sciences Authority or any person as the Minister may, by notification in theGazette, appoint for such purpose. … Supervision, treatment and rehabilitation of drug addicts 34.—(1) The Director may require any person whom he reasonably suspects to be a drug addict to be medically examined or observed by a Government medical officer or medical practitioner. (2) If, as a result of such medical examination or observation under subsection (1) or both the urine tests conducted under section 31(4)(b), it appears to the Director that it is necessary for any person examined or observed, or who supplied the urine specimen for the urine tests — (a)    … (b)    to undergo treatment or rehabilitation or both at an approved institution, the Director may make an order in writing requiring that person to be admitted for that purpose to an approved institution. … (3) Every person who is admitted to an approved institution under this section shall be detained in the institution for a period of 6 months unless he is discharged earlier by the Director or Review Committee of the institution. (4) If the Review Committee of an approved institution is of the opinion that an inmate of that institution whose period of detention therein is about to expire requires further treatment or rehabilitation or both, the Committee may by order in writing direct that the inmate be detained in the institution for a further period or periods not exceeding 6 months at any one time. … (5) No person in respect of whom an order has been made under subsection (2)(b) shall be detained in an approved institution or institutions for a period of more than 3 years after his admission to any approved institution pursuant to that order.",
        "The appellant’s arguments": "15     The essence of the appellant’s arguments, as I understand it, is this. The LT1 scheme was intended to apply only to truly recalcitrant and hardcore drug abusers. Before a drug user can be considered to be truly recalcitrant or hardcore, he must have been given every opportunity to be treated or rehabilitated. The objective of admitting drug users to approved institutions is to ensure that they are treated and/or rehabilitated. If a person is not given adequate treatment or rehabilitation during his stint at the institution, and he thereafter returns to drugs, it would be unfair and unjust to treat him as a recalcitrant or hardcore drug abuser when he has not had the opportunity to be rehabilitated. Furthermore, it would render the rehabilitation regime meaningless. Therefore the LT1 regime should not apply to drug users who have been admitted to approved institutions but who have not received the requisite treatment or rehabilitation. 16     This essential argument manifests itself in two, more specific contentions. The first has to do with whether there has to be a minimum duration for a person’s stint in an approved institution. Under s 34(3) of the Act a person is to be detained for not less than six months in the institution unless discharged earlier by the Director or Review Committee. According to the appellant, this six-month period is mandated as being the least amount of time needed to properly treat and rehabilitate a drug user; hence, if a person does not spend at least six months there, he cannot be said to have received the requisite treatment and rehabilitation, and if he subsequently re-offends he cannot be considered to be a recalcitrant or hardcore drug abuser for whom the LT1 regime was intended. In the present case, the appellant’s second stint in an approved institution,ie, his detention in the DRC at Changi Prison from 3 June to 3 November 2011, lasted five months and one day and so fell short of the six-month minimum. 17     The second specific contention advanced by the appellant has to do with what happened during that second stint in Changi Prison DRC. He alleges that he received no treatment or rehabilitation during his time there – in particular, there was no counselling provided. In the appellant’s words he was “only inside, doing nothing”. This was to be contrasted with his first stint in an approved institution, at Sembawang DRC, during which he attended courses, received counselling, and was placed on a halfway house programme and on drug supervision. The appellant’s point is that, given these circumstances, it cannot be said that he has been given a proper chance to rehabilitate himself and thus he should not be treated as a truly recalcitrant or hardcore drug abuser, such that he must be punished more severely.",
        "Analysis of the appellant’s arguments": "18     In my judgment, the appellant’s arguments have no merit. It is true, of course, that the LT1 regime is designed to meet the problem of recalcitrant or hardcore drug abusers, and in this regard I need only point to the passages from the Parliamentary Debates quoted by the District Judge in the GD at [29]–[31]. It is also true that the purpose or objective of admitting drug users to approved institutions is to treat and rehabilitate them. But it does not follow that the LT1 regime is meant to apply only to drug users who fail to rehabilitate themselves despite having been given every opportunity to do so. That, I think, would be to confuse the rehabilitative aim of approved institutions with the reason why the LT1 regime is premised,inter alia, on the existence of prior admissions to those institutions. 19     The fact is that the LT1 regime is not triggered only by prior admissions to approved institutions. As is clear from s 33A(1)(b), two prior convictions for consumption of specified drugs will also render an accused liable to the enhanced punishments; likewise, one prior admission together with one prior conviction will, under s 33A(1)(d), attract the operation of the LT1 regime. When a person is convicted of the offence of consuming a specified drug, the ordinary consequence is that if he is a first-time offender, he is sentenced to a term of imprisonment and/or a fine. In those circumstances, there may not be an institutional or systematic attempt to treat or rehabilitate the drug user. This is particularly so when fines or short imprisonment terms are imposed. Yet this absence of institutional treatment or rehabilitation does not preclude the drug user from subsequently being considered to be a recalcitrant or hardcore abuser, such as to warrant the imposition of the LT1 enhanced punishments. Hence it cannot be that coming within the LT1 regime is contingent on the drug user having been given full opportunity to undergo treatment and rehabilitation in an institution. 20     The basic precondition, in my opinion, is the mere fact of having consumed drugs on at least two previous occasions; this is what causes a person to be considered a recalcitrant or hardcore drug abuser for the purposes of the LT1 regime. As I mentioned earlier, for a person to be admitted to an approved institution, it would have been established by medical or scientific means that the person has consumed controlled or specified drugs. It is the act of consumption, not the subsequent admission to an institution, that is critical; for purposes of the LT1 regime it does not matter whether that act of consumption results in an admission to DRC or a term of imprisonment or a fine. 21     A slightly different but equally valid way of looking at the matter is that the mere fact of drug consumption on at least two previous occasions counts as an aggravating factor that renders the person liable to enhanced punishment under the LT1 regime. In this regard I endorse the views of the District Judge as expressed in the GD at [22]: … [E]very person who has been sent to [an approved institution] has beenclinically and factually establishedto have taken drugs. Upon establishing this practical equivalency between a drug consumer who is sent to prison and another who is sent to [an approved institution], the court’s focus must be squarely on the fact that an accused person who is sent to [an approved institution] has in fact consumed drugs, as established under Section 34 of the [Act]. This established fact of drug consumption, whether by an imprisoned offender or [approved institution] detainee, is the precise aggravating factor which would justify the imposition of enhanced punishment under Section 33A(1) of the [Act]. [emphasis in original] 22     With this in mind the appellant’s two, more specific contentions also fall away. As to the first, which has to do with the duration of the appellant’s stint in the DRC at Changi Prison, I accept that six months is presumptively considered to be the minimum period needed for effective treatment and rehabilitation – I say presumptively because the Director or Review Committee may, pursuant to s 34(3) of the Act, discharge a person from an approved institution before the six months is up. It is not in doubt that the appellant was taken out of an approved institution less than six months after his admission there, nor is it disputed that this was not the early discharge by the Director or Review Committee envisaged by s 34(3). However, it does not follow that the admission therefore cannot or ought not to be taken into account under the LT1 regime. So long as it remains a fact that the admission was occasioned by the appellant’s consumption of a specified drug or a drug that was a controlled drug at the time of his consumption but was subsequently specified in the Fourth Schedule of the Act (this covers both situations provided for in s 33A(5)(c)), he may be subject to the LT1 enhanced punishments. 23     I turn to the appellant’s second specific contention, namely his complaint that he received no counselling or any semblance of rehabilitation while at the DRC at Changi Prison. Just as the duration of a person’s stint in an approved institution is irrelevant for purposes of the LT1 regime as long as it remains a fact that he consumed drugs, the quality or nature of his detention in the institution is also not relevant for these purposes. After all, as I have observed, a person who is imprisoned or fined following a conviction on a consumption charge may not be afforded counselling or other rehabilitative programmes, yet that does not prevent the conviction from being taken into account as a “previous conviction” under the LT1 regime. In the same way, a perceived inadequacy or lack of treatment or rehabilitation in an approved institution to which a person has been admitted is no bar to the admission qualifying as a “previous admission” in the LT1 scheme of enhanced punishments. This is so however much one may sympathise with the appellant’s plight if indeed he did not receive any meaningful treatment or rehabilitation in Changi. 24     Finally, contrary to the appellant’s argument, I do not think that taking this view of the rationale behind the LT1 scheme of enhanced punishments renders the drug rehabilitation regime meaningless. I cannot see how that follows; they are two quite separate things. There are clear statutory preconditions that the LT1 scheme is premised on, and the fact remains that there exist “approved institutions” the purpose of which is to treat and rehabilitate drug addicts.",
        "Conclusion": "25     I am of the view that the appellant’s arguments are not meritorious and his appeal is therefore dismissed. The District Judge was correct to hold that the appellant had to be sentenced according to the LT1 regime under s 33A(1) of the Act. The sentence handed down by the District Judge was not in any way excessive. In the premises, I affirm his decision to impose a term of imprisonment of five years and two months and to order three strokes of the cane. I affirm also his order that this term of imprisonment is to run concurrently with the four years’ imprisonment imposed on the possession charge."
    }
}