{
    "case_title": "Han’s (F & B) Pte Ltd\n      v\n      Gusttimo World Pte Ltd",
    "ncitation": "[2015] SGHC 39",
    "coram": "George Wei JC",
    "sections": {
        "The Plaintiff’s restaurants and its registered marks": "2       The first Han’s restaurant opened its doors in 1980. Then, the Han’s restaurant sold mainly confectionaries. Business has grown steadily over the years, and the Plaintiff now runs 21 Han’s Café outlets island-wide.[note: 1]The moving spirit behind the Plaintiff is Han Choon Fook (“Mr Han”). Mr Han is from the Han family that founded the first Han’s restaurant. Mr Han is a director of the Plaintiff. 3       The Plaintiff’s restaurants specialise in serving quality food and beverages at affordable prices.[note: 2]They serve a mixture of local fare, Hainanese-style western sets and pastries. The Plaintiff has also ventured into the Halal food and beverage market with the creation of a sister chain, Hanis Café, in 2006. Both Han’s Café and Mr Han have received numerous local awards and certificates representing business excellence and entrepreneurship.[note: 3] 4       The Plaintiff is the registered proprietor of four marks under the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the TMA”). The marks may be found in the annexure to this judgment. The four marks were registered on 1 June 2005 in relation to class 43 of the Nice Classification of Goods and Services. The trade marks are specified to cover:[note: 4] Bar; bistro; cafe; cafeteria; canteens; take-away restaurant services; catering services; coffee bar and coffee house; coffee supply services for offices; contract food cooking services; food preparation; preparation of take-away foods and beverages; restaurant; self-service cafeteria services; self-service restaurants; snack bar. 5       The first two registered marks are the word marks, “Han’s” and “HAN’S”. I shall refer to them collectively as the “Han’s word marks”. The other two marks are composite marks of “Han’s” in a stylised font. By composite, I mean that the word “Han’s” is depicted within a frame that approximately outlines the lettering. The two composite marks are identical save that one is red (“the red Han’s composite mark”) and the other is black. Registration of the red Han’s composite mark is limited to the depiction in red. The Plaintiff does not specify in either its pleadings or its submissions which registered mark it relies on for its infringement claim against the Defendant.",
        "The Defendant’s restaurant and the allegedly infringing sign": "6       The Defendant’s restaurant, HAN Cuisine of Naniwa, is located at Odeon Towers and commenced business in June 2012. The restaurant offers traditional Naniwa cuisine (Naniwa was the name used until the 16th century for what is now Osaka, Japan). Its specialities include meat and vegetable skewers—also known asKushikatsu—that originate from Osaka. The restaurant also serves sushi, sashimi and other Japanese dishes. 7       The kitchen of the Defendant’s restaurant is helmed by Chef Seiichiro Arakawa. Chef Arakawa is a Japanese chef who was mentored by a chef of a Michelin-starred restaurant in Kobe, Japan. Dinner sets at the Defendant’s restaurant start at upwards of $100.[note: 5]The Defendant’s restaurant also has a fairly extensive alcohol menu.[note: 6] 8       The Defendant’s restaurant, HAN Cuisine of Naniwa, trades under a sign (“the HAN sign”) which forms the basis of the Plaintiff’s infringement action. The HAN sign may be found in the annexure to this judgment. 9       The HAN sign is a composite sign comprising three elements: (a)     The word “HAN”, which is depicted in a muted gold colour and in a prominent position in the centre of the sign. (b)     The phrase “Cuisine of Naniwa” depicted in black, and in a smaller font and subsidiary position to “HAN”. Both “HAN” and “Cuisine of Naniwa” are in a similar typeface—a modified version of the Helvetica font. (c)     TheKushikatsudevice that encircles the sign. TheKushikatsudevice is a stylised depiction of the Japanese meat and vegetable skewers that the Defendant’s restaurant serves. It is styled in a manner that resembles a calligraphy brush-stroke. TheKushikatsudevice is said to be in a deep brown colour, but the deep brown is imperceptible and it appears black. 10     The Defendant displays the sign at the restaurant front, various locations in and outside the restaurant, and on its menus and tablemats. The Defendant has also registered and maintains a website at the domain http://www.han.com.sg. 11     The Defendant is majority-owned by Dr Lee Se Heon. Dr Lee is also a director of the Defendant. Dr Lee began running the Defendant as a food and beverage business in 2008. The Defendant operates other restaurants, which are said to be trendy and serve high-end cuisine. 12     Prior to 2008, Dr Lee was involved in very different fields of business. In 1957, Dr Lee’s father founded Hankuk Glass Industries Inc (“Hankuk”) in Korea, which dealt in the production of fine glass products.  Dr Lee eventually became the chief executive officer in the company which had evolved into the HanGlas group. In 2001, Dr Lee moved to Singapore and incorporated an information technology startup named SL Interactive Pte Ltd. 13     In 2007, a French company acquired an interest in the HanGlas group. It was about then that Dr Lee decided to refocus his Singapore business from information technology to food and beverage. SL Interactive Pte Ltd was renamed Gusttimo World Pte Ltd, which is the defendant in this action. In 2011, the Defendant decided to open a high-end restaurant in Singapore specialising in Osaka cuisine that incorporated Korean and Chinese elements. 14     The reasons why the name HAN Cuisine of Naniwa was chosen are discussed in greater detail later. But I would point out at this juncture that the word “HAN” had a long association with Dr Lee’s family. It formed part of the name of Dr Lee’s family company. It was also part of a registered trademark, “HANGLAS” with a square device, that Hankuk registered in Singapore in 2004.",
        "The arguments": "15     The Plaintiff claims that the HAN sign infringes the Han’s trade marks. The Plaintiff claims in addition that the Defendant is passing off its business as the Plaintiff’s, and that the use of the sign was calculated to deceive and with the deliberate objective of passing off. 16     The Plaintiff seeks an injunction restraining the Defendant from trading under the HAN sign, and an inquiry to damages or an account of profits. It also seeks an order for full discovery of the infringing materials and articles, and an order that the Defendant transfers the domain, http://www.han.com.sg, to the Plaintiff. 17     The Defendant denies the allegations of infringement and passing off. The Defendant counterclaims against the Plaintiff for groundless threats of infringement proceedings. The Defendant also seeks a declaration that the Plaintiff’s registered marks are invalid because they are devoid of distinctiveness, or alternatively, because the Plaintiff obtained the registration of the marks through misrepresentations and in bad faith.  While invalidity because of misrepresentation and bad faith was pleaded, these points were not argued in submissions, and rightly so. I will therefore not address them.",
        "The issues": "18     The issues that arise fall broadly into four categories: validity, infringement, passing off and groundless threat. 19     The first issue is whether the Han’s trade marks are invalid under s 23 of the TMA because they do not satisfy the definition of a trade mark or are devoid of any distinctive character. 20     The second issue is whether the Defendant’s use of the HAN sign infringes the Han’s trade marks under s 27 of the TMA. This raises the following subsidiary issues: (a)     whether the HAN sign is similar to the Han’s trade marks; (b)     whether the HAN sign is used in relation to goods or services identical with or similar to those for which the Han’s trade marks are registered; and (c)     whether on account of the presence of the first two conditions, there exists a likelihood of confusion on the part of the relevant public. 21     The third issue is whether the Defendant is liable for passing off its business as being connected to or associated with the Plaintiff’s. This raises the following subsidiary issues: (a)     whether the Plaintiff has goodwill in the trade marks attached to the goods and services that it supplies; (b)     whether the Defendant made a misrepresentation that will lead to a likelihood of confusion; and (c)     whether the Plaintiff has or is likely to have suffered damage as a consequence. 22     The fourth issue is whether the Plaintiff is liable for making a groundless threat of infringement proceedings against the Defendant under s 35 of the TMA.",
        "The witnesses and evidence": "23     Both the Plaintiff and the Defendant called a factual and expert witness each. Mr Han was the Plaintiff’s factual witness. He gave evidence on the history of the Plaintiff and its business model and strategies. He also gave some evidence on the future plans of the Plaintiff, in particular, the possibility of the Plaintiff expanding into a more upmarket food and beverage market segment. 24     Dr Lee was the Defendant’s factual witness. Dr Lee gave evidence of the business of the Defendant’s restaurant. He also gave evidence on how the restaurant came into being, in particular, how he settled on the name HAN Cuisine of Naniwa. 25     The Plaintiff called Shinde Prasad Vasantrao as its expert. Mr Prasad was a director at the marketing branch of Ipsos ASI (“Ipsos Marketing”), a French advertising research firm. He presented findings of a telephone survey that his team conducted on consumer perceptions of “H.A.N.S” and “H.A.N”. Mr Prasad and his team surveyed a sample size of 1,001 respondents aged 15­ to 64-years old. The survey involved asking respondents a series of four questions. The conclusions of the survey were that: (a)     79.4% of respondents were aware of “HANS” while 29.6% of respondents were aware of “HAN”; (b)     52.3% of respondents found that “HANS” and “HAN” sound very similar; (c)     29.8% of respondents thought that “HANS” and “HAN” belong to the same management; and (d)     27.6% of respondents said they do not differentiate “HANS” from “HAN” when performing an online search. 26     The Defendant called See Toh Kok Fye (“Mr See Toh”), who is more widely known as KF Seetoh, as its expert. Mr See Toh is an acclaimed food critic and the founder and a director of Makansutra (S) Pte Ltd. Mr See Toh’s expert report was prepared in the form of answers to six questions that were posed to him. It traversed the ground of his views on the visual and conceptual similarities between the HAN sign and the Han’s trade marks, and his views on the public perception of the same. The report also dealt with the psychology of food or restaurant choice of the general public in Singapore, and the similarities and dissimilarities between the cuisine and services offered by the Plaintiff’s and the Defendant’s respective establishments. The report finally addressed whether there was the possibility that confusion may arise on the part of the general public. 27     Mr See Toh’s views were, in short, that there would be no confusion. He thought that the signs were sufficiently visually and conceptually dissimilar to each other. Further, the cuisine and dining experience in the Plaintiff’s and the Defendant’s respective establishments were vastly different. He arrived at this conclusion after having a meal at one of the Plaintiff’s restaurants and at the Defendant’s restaurant. Both the evidence of Mr Prasad and Mr See Toh will be scrutinised in greater detail in the course of addressing the issues to which they relate. 28     The use of expert or survey evidence in intellectual property litigation has become relatively commonplace. In trade mark actions, this often takes the form of survey evidence. I will, therefore, set out some general observations on the relevance or usefulness of such survey evidence. 29     The survey is usually intended to obtain evidence on distinctiveness, reputation and similarity, and often includes: (a) the degree to which the public recognise the plaintiff’s marks; (b) the degree to which the public recognise the defendant’s marks; (c) the key features of the marks which stand out in the mind of the member of the public; (d) the degree of similarity between the marks; and (e) the degree to which the public are confused by the rival marks. After conducting the survey, the expert normally compiles the survey findings into tables or charts. A report is usually also produced that sets out the expert’s analysis and conclusions. 30     Expert or survey evidence when properly conducted can be helpful. But the expert report should, at the very least, set out: (a) the purpose of the survey; (b) details on the methodology, including the instructions given to the interviewers and the questions posed to them; and (c) the full results of the survey and the statistical analysis. 31     If meaningful results are to be generated, the questions should not be leading, or designed in such a way as to amount to a cross-examination of the persons surveyed. The comments of Professor David Llewelyn inThe Use of Experts in Legal Proceedings in Singapore Involving Intellectual Property Rights[2013] 25 SAcLJ 480 (“The Use of Experts in Legal Proceedings”) at para 54 are apposite: Where it is intended to carry out a survey, it is advisable to have it done by an independent organisation experienced in devising and carrying out surveys. The lead person from that organisation should present the survey results in an expert report, which should also contain full details of the instructions given to the individual interviewers. It is important to emphasise to the surveying team the need to record everything that is said, and even not said, by both the interviewers and interviewees involved, including prompting remarks that may indicate a less certain response than may be recorded. Leaving aside the common problem of surveys that contain leading questions, a failure to record responses and other reactions in full will often provide opposing counsel fertile ground on which to build an attack on the weight and credence to be given to the survey evidence. … 32     The questions asked should take into account the fact that a trade mark is intended to act as an indicium of origin in the course of trade. The definition of what is a sign capable of acting as a trade mark has expanded. Trade marks are no longer confined to signs that are visually perceptible. They can include sound marks, smell marks and more. While a trade mark must still be capable of graphic representation, shapes are also, in appropriate cases, registrable as a trade mark (see, for example, the recent decision of Chan Seng Onn J concerning the registrability of the shape of “Kit Kat” chocolate-coated wafer bars inSociete Des Produits Nestlé and another v Petra Foods Ltd and another[2014] SGHC 252). 33     Some trade marks carry out their role as indicia of origin by speaking to just one of the human senses. A sound trade mark performs its role by impacting the ear of the customer. Other trade marks interact with members of the public in a multi-sensory manner. Take, for example, a composite mark that comprises words written in a stylised form and set out within a logo or pictorial device. The words interact with the customer visually and phonetically. The device or logo will interact with the customer visually: in an artistic as opposed to a literary form. Even a simple word mark interacts with customers visually and aurally, often at the same time. 34     It follows that surveys should strive to obtain evidence that is meaningful, bearing in mind the different ways in which a customer comes across and interacts with the trade mark in the marketplace. For example, where the plaintiff’s trade mark is a simple word mark and the defendant’s trade mark a composite mark where the visual appearance of the device is properly and fairly regarded as part of the trade mark. A simple aural comparison of the words may not be that helpful. 35     In the present case, the Defendant’s expert evidence did not take the form of survey evidence. It came in the form of testimony from an acclaimed food critic, Mr See Toh. Without going into the details, his evidence concerned his view on whether the Defendant’s trade mark was similar to the Plaintiff’s such as to cause confusion. He also gave some evidence as to the restaurant industry in Singapore. While some parts of the latter may be relevant in setting out the context of restaurant trade in Singapore, I do not find his evidence that there would be no confusion in the marketplace helpful. This is a question for the court which can and should be answered without resorting to expert opinion. 36     Professor Llewelyn makes some other helpful observations at para 40 ofThe Use of Experts in Legal Proceedings in Singapore: Given that the test for infringement of a trade mark ‘has to be looked at globally taking into account all the circumstances’ through the eyes of the average consumer of the goods or services in question, it can be questioned how much expert witnesses can and should assist the court in that assessment, particularly in cases where the goods or services are ones that are come across frequently in daily life. … This must be correct. After all, in trade mark infringement actions, the absence of evidence of actual confusion in the marketplace is not fatal to the claim. Where there is no evidence that customers have been confused, the court will have to examine the marks and decide on the evidence as a whole whether confusion is likely. The comments of Millett LJ inThe European Ltd v The Economist Newspaper Ltd[1998] FSR 283 at 291, which were also cited by Professor Llewelyn in his article at para 43, are instructive: … It is legitimate to call evidence from persons skilled in a particular market to explain any special features of that market of which the judge may otherwise be ignorant and which may be relevant to the likelihood of confusion. It is not legitimate to call such witnesses merely in order to give their opinions whether the two signs are confusingly similar. They are experts in the market, not on confusing similarity. I have set out my broad observations on the evidence. I will examine it in greater detail in the course of my analysis of the various issues.",
        "Whether the Han’s trade marks should be declared invalid under s 23 of the TMA": "37     The first issue that arises concerns the validity of the Han’s trade marks. Section 23(1) of the TMA states that the registration of a trade mark may be declared invalid if it was registered in breach of s 7 of the TMA. Two of the grounds found in s 7 are relevant to these proceedings. 38     First, under s 7(1)(a) of the TMA, a mark shall not be registered if it does not satisfy the definition of a trade mark in s 2(1) the TMA. Section 2(1) of the TMA defines a trade mark as: [A]ny sign capable of being represented graphically and which is capable of distinguishing goods or services dealt with or provided in the course of trade by a person from goods or services so dealt with or provided by any other person. 39     Second, under s 7(1)(b) of the TMA, a mark shall not be registered if it is devoid of any distinctive character. An exception to s 7(1)(b) is where the mark in question has acquired a distinctive character as a result of the use made of it: s 7(2) of the TMA. 40     The Defendant argues that the Han’s trade marks were registered in breach of these two grounds for three reasons. First, the Han’s trade marks are incapable of distinguishing the Plaintiff’s goods and services from those of other traders. Second, the Han’s trade marks are not distinctive because they merely make use of a common surname. Further, “Han” bears multiple meanings in different languages. 41     Under s 101 of the TMA, the registration of the Han’s trade marks isprima facieevidence of the validity of the original registration. The burden is thus on the Defendant to establish the invalidity of the Han’s trade marks.",
        "Whether the Han’s trade marks are capable of distinguishing goods or services": "42     There is no dispute that the Han’s trade marks are capable of being represented graphically, and therefore fall within the definition of a “sign”. The attack under s 7(1)(a) of the TMA is that the Han’s trade marks are incapable of distinguishing goods and services and therefore fall outside of the definition of a trade mark. 43     The Defendant asserts that “Han” is a common surname in Singapore. No further explanation is given as to how or why the fact that “Han” is a common surname renders it incapable of distinguishing the Plaintiff’s goods or services in the course of trade. The Plaintiff, on the other hand, asserts that surnames are capable of distinguishing services provided under the mark from services provided by another person. 44     The Plaintiff relies on the decision inNichols plc v Registrar of Trade Marks[2005] RPC 12 (“Nichols v RTM”) in support of its argument. In that case, the applicant sought to register the word mark “NICHOLS”. There was no claim that the mark had acquired distinctive character through use. It was accepted that “NICHOLS”, together with phonetically similar variants like “Nicholls” and “Nichol” were common surnames in the United Kingdom. The European Court of Justice (“ECJ”) accepted at [32] that “a surname fulfils the minimum requirements to constitute a trade mark ... since it is capable of distinguishing the products or services of one undertaking from those of others”. 45     The definition of trade mark in s 2(1) of the TMA makes it clear that the main purpose of trade mark registration is to safeguard signs which can serve to indicate the origin or source of goods in the marketplace. The requirement that the sign is capable of distinguishing the goods or services in the course of trade underscores the central function of a trade mark. The principle is of such great importance that it finds expression in the TMA in numerous ways: (a)     First, s 2(1) of the TMA requires a sign to be capable of distinguishing the goods or services in the course of trade. If it cannot play this role then it is not even a trade mark. (b)     Second, s 7(1) of the TMA prescribes an absolute ground for refusing registration of a trade mark that is devoid of any distinctive character. (c)     Third, s 22(1) of the TMA provides that a trade mark may be revoked where it has become the common name in trade for the product or service for which it is registered. In short, where a registered trade mark has become generic and lost the ability to distinguish goods from a particular trade origin. 46     The requirement in s 2(1) of the TMA that the sign must have the capability of distinguishing goods or services in the course of trade is therefore best treated as a threshold requirement. Signs which do not meet the threshold requirement are not registrable. There is no further need to examine other requirements, such as whether the sign has been used in the trade so as to indicate trade origin. Indeed, this is irrelevant since the question is whether the sign has thecapabilityof distinguishing goods and services. That is largely a question of law which requires the court to determine whether the sign has any ability to serve as an indicium of trade origin. The fact that the trade mark is new and has not yet been used on the goods or services is irrelevant. 47     A finding that a sign lacks any capability to distinguish goods or services usually means that the sign is so descriptive that it cannot serve this most basic trade mark function. The requirement of capability to distinguish is not difficult to satisfy:Nation Fittings (M) Sdn Bhd v Oystertec plc and another suit[2006] 1 SLR(R) 712 (“Nation Fittings v Oystertec”) at [133]–[136]. Professor Ng-Loy Wee Loon has rightly observed inLaw of Intellectual Property of Singapore(Sweet & Maxwell, 2nd Ed, 2014) at para 21.3.15 that most cases where the trade mark has been held to fall foul of the threshold requirement were so decided because the sign was nothing more than a generic description of the product or service. 48Nation Fittings v Oystertecconcerned a sign consisting of a drawing of the two-dimensional shape of a pipe fitting. The shape was considered to be nothing more than the generic shape. It lacked any capability to serve as a trade mark for the product in question. The English High Court case ofPhilips Electronics NV v Remington Consumer Products Ltd (No 1)[1998] RPC 283 is to the same effect. There, an application was made to register a trade mark comprising a graphic representation of the shape of the head of a shaver. The graphic representation comprised three rotary circular heads set out in the shape of an equilateral triangle. Jacob J held that the representation lacked any capability to distinguish the goods. The shape was essentially the shape of the product itself. Jacob J also expressed the view at 300–301 (citing his earlier decision inBritish Sugar Plc v James Robertson & Sons Ltd[1996] RPC 281 at 305) that the word “soap” could not be registered as a trade mark for soaps. The word was entirely descriptive of the product such that it was incapable of serving a trade mark function. 49     Likewise, inLove & Co Pte Ltd v The Carat Club Pte Ltd[2009] 1 SLR(R) 561, Chan J held that a sign would not cross the threshold if it was so descriptive as to be synonymous with the product itself. One example given by Chan J was “jewellery” for jewellery products. On the actual facts, the court found that the word “love” did not fall into this category. It was not generic of jewellery. 50     Most of the cases have been concerned with signs that are descriptive of the product or services. But there may also be situations where the sign lacks any capability to distinguish goods or services for other reasons. Consider, for example, an application to register the words “Best Quality” for leather goods including hand bags and belts. The words do not describe the product, leather hand bags and leather belts. They are words of high praise. It seems that arguments, at the very least, may be raised, as to whether commonplace laudatory epithets have any capacity to function as a trade mark. But that question is not before me and I make no further remarks on it. 51     In the present case, I am of the view that a surname, even a common one, possesses the capability to distinguish the goods and services of a trader from those of others. The ECJ inNichols v RTMaccepted at [32] that this was so without hesitation. As in many other jurisdictions, the TMA also contains provisions to the effect that infringement does not arise where the defendant uses his own name, provided that the use is in accordance with honest practices in industry and commerce: see s 28(1)(a) of the TMA. It follows that the possibility that a name, or part of it, may be registered as a trade mark is recognised.",
        "Whether the Han’s trade marks are distinctive": "52     The next issue is whether the Han’s trade marks satisfy the requirement of distinctiveness. The more pertinent difficulty with using a common surname as a trade mark lies in whether it possesses any distinctive character at all. That was the issue that preoccupied the ECJ inNichols v RTM. That too forms the gravamen of the Defendant’s complaint against the validity of the Han’s trade marks. The requirement of distinctiveness is relevant to the registrability of a trade mark, as well as to a challenge to a registered mark’s registration, but in slightly different ways. 53     At the registration stage, a trade mark which is devoid of any distinctive character shall not be registered: s 7(1)(b) of the TMA. However, for a trade mark that lacked distinctiveness at the time when it was chosen, its registrability can still be saved if it has in fact acquired a distinctive character through use: s 7(2) of the TMA. The critical date here is the date of application for registration. 54     A challenge to a registered mark’s validity may be made on the ground that the trade mark was registered in breach of s 7 of the TMA: s 23(1) of the TMA. Where the registered trade mark was registered in breach of s 7 because it is devoid of a distinctive character, its registration may be saved if it has through use acquired a distinctive character in relation to the goods or services for which it is registered: s 23(2) of the TMA. In short, in deciding whether to grant an application for invalidity, the court is to take into account the use of the trade mark subsequent to registration in deciding whether the trade mark has a distinctive character. 55     In addressing the question as to what distinctiveness means in trade mark law, it is suggested that three related questions must be borne in mind. First, what is the essential function or purpose behind registration of a trade mark? Second, what is the purpose of the threshold requirement that a sign must be capable of distinguishing goods or services dealt with or provided in the course of trade? Third, what is the meaning and purpose behind the requirement of a distinctive character? 56     The history behind trade mark law strongly supports the view that a trade mark serves the main purpose of indicating the trade origin of goods or services in the marketplace. This is still the essential function of a trade mark, even though a trade mark can also serve as an indicator of quality. Indeed, it has been suggested by William Cornish, David Llewelyn & Tanya Aplin,Intellectual Property: Patents, Copyrights, Trademarks & Allied Rights(2013, 8th Ed, Sweet & Maxwell) (“Cornish, Llewelyn & Aplin”) at para 16–22 that trade marks can also act as the symbol around which investment in promotion of a product is built. That said,Cornish, Llewelyn & Aplinrightly question at para 16–28 how realistic it is to distinguish between the origin, quality and investment functions of a trade mark. Much may depend on how broadly or narrowly the origin function is construed. 57     Nevertheless, whatever the outer limits of trade mark function are, few will doubt that the most basic function of a trade mark is to enable a trader to distinguish his goods or services from those of his competitors in the marketplace. That is the plank on which all else stands. The law, by protecting the origin function of a trade mark, helps to promote inter-brand competition. By doing this, the law also assists consumer choice between alternative products and services in the marketplace. It follows that the threshold requirement that the sign must be capable of distinguishing goods or services of rival traders in the market is nothing more than an expression of the underlying policy behind trade mark protection. 58     This is the context in which the TMA requires an examination as to whether a trade mark possesses a distinctive character. Did the trade mark possess a distinctive character when it was chosen? Did it acquire and develop a distinctive character as a result of use by the time of the application to register? Did it develop and acquire a distinctive character at the time when application was made to declare the registration invalid? 59     Section 7(1) of the TMA sets out four grounds for refusal of registration. The grounds in s 7(1)(b), (c) and (d), while listed as distinct grounds, are in reality connected. The grounds set out in s 7(1)(c) and (d) are particular examples of the objection in s 7(1)(b). Take, for example, a trade mark comprising the words “Romantic Heart” for jewellery. Leaving aside an attack on the basis that it has no capability to distinguish, objection may be taken under s 7(1)(c), on the ground that it comprises a sign that designates a particular characteristic of the goods or its intended purpose. Such a phrase might also be said to be devoid of a distinctive character for that very same reason. The phrase is not ordinarily used or perceived as a trade mark to indicate the origin of goods (jewellery) in the marketplace. But through use, marketing or advertising, the public may be taught to recognise the phrase as an indicator of a particular trade origin when used in respect of jewellery. The public or relevant sector of the public has been taught to recognise the phrase as a trade mark. 60     Thus it may be that by the time the applicant makes the application to register the phrase as a trade mark, he has spent several years developing the trade mark message to the public. Even though the phrase may have been devoid of a distinctive character when it was first conceived, it has, by the time of the application, in fact acquired a distinctive character. Acquiring a distinctive character under s 7(2) of the TMA sidesteps the grounds for refusal found in s 7(1)(b), (c) and (d) of the TMA. It must follow that the objections in s 7(1)(c) and (d) are essentially particular aspects of section 7(1)(b). 61     Returning to the meaning of distinctiveness, the trade mark must necessarily, either inherently or as a result of use, perform the most basic function of distinguishing the goods of the trader from those of his competitors in the marketplace. Some trade marks carry a high level of “inherent distinctiveness” in the sense that these marks will be understood by the public as bearing a trade mark meaning, even if they have not yet been used or promoted to the public. Invented words are classic examples of such trade marks. Take, for example, a manufacturer of sailing boats who decides to market the boats under a new trade mark which he has invented. The mark is “ADOGSTY”. It has no meaning at all. Such an invented word mark has a high level of inherent distinctiveness and ability to serve as a trade mark. After all, what else could the word “ADOGSTY” mean when used in relation to the sailing boats? 62     Another example is a manufacturer who decides to use the markfor a range of running shoes that he is about to launch. Even though the words and phrase are not newly coined, the meaning has little bearing on the product to which it is to be applied. Nonsensical phrases may also bear a relatively high level of inherent distinctiveness in the sense that, even without extended advertising or marketing, consumers are likely to view the phrase as a trade mark. Even if there is a possibility that some persons may view the nonsensical phrase as part of the product design such as a visual embellishment or decoration, it may not take much use and marketing to develop the trade mark message. Much of course will depend on how the nonsensical phrase is used on or in relation to the product. 63     Other marks, on the other hand, while possessing the capability to distinguish goods or services in the course of trade, may have low levels of inherent distinctiveness. Often this will be because the mark includes a word or symbol or device that is at least partially descriptive of the goods or service. Alternatively, it may be that the word chosen has a laudatory meaning or some meaning that captures a mood or image of some relevance to the product or service in question.  The phrase, for example, when used as a trade mark for diamond wedding rings, arguably possesses a low level of inherent distinctiveness, since it captures the idea of the sparkle of the gemstone. In other cases, it may be because a word with some desirable descriptive meaning is deliberately misspelt. Consider, for examplefor ice-cream.  Where a desirable descriptive word or phrase is misspelt, it is still possible, depending on the facts, that an obvious misspelling will not even avoid a conclusion that the sign lacks the basic capability to distinguish. 64     In cases where a sign possesses a capability to distinguish but is regarded as not possessing distinctiveness, at the time when chosen and first used, members of the public may over a period of time be taught, through advertising and brand promotion exercises, to recognise the trade mark as performing a trade mark function, namely indicating the trade origin of the goods or services in question. In this way, the trade mark has acquired distinctiveness through use. The investment of time and money to teach the trade mark meaning to the public is the justification for allowing protection by registration. 65     Allowing a trader to register and obtain a monopoly on words and phrases which other traders may wish to use in respect of their goods and services for entirely legitimate purposes (including competition) is clearly not in the public interest. For example, under the Trade Marks Act 1938 (c 22) (UK) (“UK TMA 1938”), Gibson J held inSmith Kline & French Laboratories Ltd’s Cimetidine Trade Mark[1991] RPC 17 at 34 that in deciding whether a claimed trade mark was inherently adapted to distinguish: [T]he court takes account of the likelihood that other traders may, without improper motive, desire to use the trade mark in relation to their own goods. On grounds of public policy a trader will not be allowed to obtain by a trade mark registration, a monopoly in what other traders may legitimately wish to use … While these observations were in relation to the now repealed UK TMA 1938, the general sentiments expressed by Gibson J remain relevant. 66     This is why the law shies away from granting rights over descriptive phrases and words of praise. This is also why the law is careful about granting rights too readily over common words, geographical expressions and place names. A trader in Singapore who wants to establish a business in pre-independence memorabilia may conceive the idea of using the phrase. Assuming that the phrase is thought to pass the threshold test of having some capability to distinguish, the level of inherent distinctiveness may still be regarded as falling at the lower end of the spectrum such that it lacks distinctiveness. 67     The question as to whether there is sufficient use and brand development such that ordinary consumers in Singapore recognise the expression as an indicator of trade origin, as opposed to a description of the nature of the business, will require careful examination of the evidence. It is obvious that, all things being equal, many traders who wish to develop a business dealing in Singapore or Straits Settlements memorabilia may wish to use the words in the phrase in connection with their goods or services for entirely legitimate reasons. Whether the use of the phrase has reached the point where the balance has tipped in favour of the applicant turns on whether, despite the descriptive connotations, the public recognise the phrase (especially if it is set out and limited to a particular font or style) as performing the basic function of a trade mark. 68     Bearing in mind the above summary of the law and the principles that shape it, I turn to address the issues that have been raised in the Defendant’s attack on the Han’s trade marks. The Defendant argues that the Han’s trade marks are devoid of any distinctive character as they consist only of the surname “Han” with a possessive modifier,ie, the addition of an apostrophe and an “s”. That is said to only denote ownership to a family with a common surname “Han”. 69     The Defendant further argues that “Han” has multiple meanings in different languages. In Japanese, it can refer to Osaka. In Korean or Chinese, it can refer to Korea or Korean people. In Chinese, it can refer to the Han Chinese, an ethnic group from East Asia. To allow the Plaintiff’s registration of the mark would allow it to exercise its rights of monopoly over the use of “Han”. It would prevent the use of “Han” by anyone with the surname or family name Han, or prevent “any description of Korea (Han), Chinese people (Han) and Osaka (Han) in any restaurant business”.[note: 7] 70     The Defendant relies on the English decision ofFrank Yu Kwan Yuen v McDonald’s Corporation, McDonald’s Restaurants LimitedCH/2001/APP No 183 (“Frank Yu v McDonald’s”). This is a decision of Neuberger J (as he then was) on an appeal against a decision of the hearing officer at the UK Trade Marks Registry. 71     The applicant sought to register the trade mark “McCHINA”. The application met with opposition from McDonald’s. The hearing officer did not allow the registration of the mark. Neuberger J allowed the appeal against the hearing officer’s decision. The Defendant relies on a particular passage at [37] of Neuberger J’s decision in support its position: ... [T]he opponents advance the contention that, in the context of fast food businesses, the prefix “Mc” would tend to suggest a connection with the opponents, both now and as at 1992, bearing in mind the extent and reputation of their business and the fact that their name is very well known[.] While this is a fair point as far as it goes, any tribunal must obviously be careful before reaching a conclusion which involves giving an effective monopoly to a common prefix to a surname, in the context of a common type of business. 72     The Plaintiff, on the other hand, argues that the Han’s trade marks possess both inherent and acquired distinctiveness. First, “Han’s” is not descriptive or referential to the goods and services provided by the Plaintiff. Rather, it has been used in a manner that is arbitrary in relation to the goods.[note: 8]Second, it is said that the Han’s trade marks have acquired distinctiveness through use. The Plaintiff’s restaurants have been in the food and beverage business for over 20 years. Han’s is a widely-known and reputed brand. 73     I start by considering the position of the two word marks. The fact that Han is a surname does not mean that, as a matter of principle, it must be treated as being devoid of a distinctive character. Whether or not it meets the requirements for registration depends on the same principle of distinctiveness that applies to any trade mark. There are no special rules for surnames, irrespective of how commonplace the surname is or how persons bear that surname in the phone directory. Indeed,Cornish, Llewelyn & Aplinat para 18–30 are rightly of the view that even if the surname appears hundreds of times in the phone directory, that is not, on its own, a ground to refuse registration. It is a matter of evaluating the surname and the goods and services in question to determine distinctiveness. 74     In its submissions, the Plaintiff draws a dichotomy between descriptive words and words used arbitrarily in relation to the goods concerned. That dichotomy is a false one, as there is athirdcategory (leaving aside inventive words, which are not in issue here): commonly-used words that have some nexus to the goods concerned, yet are neither descriptive of the goods nor arbitrary in relation to them.Cornish, Llewelyn & Aplingive as an example at para 18–31 words which promote the image of a product, however imprecisely, such as “The Perfectionists” for women’s underwear. 75     The Court of Appeal decision inThe Polo/Lauren Co, LP v Shop In Department Store Pte Ltd[2006] 2 SLR(R) 690 (“Polo v Shop In”) is instructive. There, the plaintiff was the registered proprietor of six trade marks, including the “POLO” word mark. An action for trade mark infringement was brought against the defendant in respect of the use of the sign “POLO PACIFIC”. WhilePolo v Shop Indid not concern the registrability of trade marks, the Court of Appeal, in upholding the finding of no infringement, commented at [23] that the word “polo” was an ordinary English word meaning a game played on horseback. It was also a word used to describe a type of collared t-shirt. 76     Examples of word marks that were inherently distinctive were said to include inventive words “without any notional or allusive quality”. The Court of Appeal was of the view that the word “polo”, not being an invented word, could not claim inherent distinctiveness. The Court of Appeal further remarked at [23] that “[w]here common words are included in a registered mark, the courts should be wary of granting a monopoly in their use”. For this reason, the Court of Appeal stated that in such cases any alleged distinctiveness must be acquired through use and determined in light of all the circumstances of the case. 77     The Court of Appeal’s decision inPolo v Shop Inultimately turned on whether the defendant’s sign, “POLO PACIFIC” was similar, and confusingly so to the plaintiff’s registered mark. The comments made in that case must therefore be viewed in that context. The Court of Appeal’s word of caution against granting monopolies over common words is, with respect, understandable. But it is also equally important to recognise that many registered trade marks comprise common words either on their own or in combination with other features such as devices. 78     Even where a common word is used on its own, it may meet the distinctiveness requirement. When the law addresses the question posed by s 7(1)(b) of the TMA—whether the trade mark is devoid of any distinctive character—the question is not to be answered in the abstract. The definition of trade mark relates to the use of the sign in the course of trade on goods or services in circumstances where the sign has a capability of distinguishing those goods or services. The goods or services in issue are those in respect of which the applicant is seeking registration. The question to be answered is whether the trade mark is devoid of any distinctive character in terms of its ability to distinguish those goods or services in the course of trade. 79     Take, for example, the word “Poison”. It is an ordinary English word. Suppose that manufacturer decides to enter the mobile phone market by producing his own range of mobile phones under the mark “Poison”. The sign (or trade mark) does not describe the nature of the product or its qualities or attributes. It may even be thought that the use of such a word as the trade mark is incongruous given the product that it is to be used on. Yet, it is that very incongruity which suggests that use of this word in this context is distinctive in the trade mark sense. To put the matter the other way round (as is hinted at byCornish, Llewelyn & Aplinat para 18–31), is this a word that other honest traders may wish to use for this class or range of goods or services? 80     I note also in passing that the TMA does not actually refer to the term “inherent distinctiveness”. The question asked by s 7(1)(b) of the TMA is whether the trade mark is devoid of any distinctive character. As noted, this means in relation to the goods or services on which it is to be applied. Under the TMA, brand new trade marks can be registered. There is no requirement that the applicant has already applied the trade mark to the intended goods or services and to have made these available to the public. There is, unlike in passing off, no need to establish an existing business and use of the trade mark. 81     It follows that in the right circumstances, a brand new trade mark which comprises ordinary words can be registered even if there has been no actual use at the time of the application.  In such a case, the applicant will not be able to rely on evidence of use to make out a case that the trade mark is or has become distinctive. But this does not mean that the trade mark cannot be registered. Even without actual use, the intended use of the trade mark (which must bebona fide) may possess a distinctive character bearing in mind the character of the trade mark and the nature of the goods or services to which it is to be applied. To the extent that modern case law refers loosely to the concept of inherent distinctiveness, it is suggested that this refers to the character and nature of the trade mark in the context of the goods or services for which registration is sought.  I pause here to comment on terminology.  What the TMA requires is that the trade mark is distinctive.  Once a trade mark is found to be distinctive, it meets the requirement of distinctiveness.  There is no requirement that the trade mark reach a “high” standard or level of distinctiveness.  A trade mark may be distinctive at the outset or after a period of use.  To the extent that the law refers to “inherent distinctiveness” in contradistinction to distinctiveness generated by use, the expression best refers to distinctiveness arising from the trade mark alone without reliance on use. 82     That said, I note that inherent distinctiveness is also sometimes used in a manner that is closer to the idea of a “capability to distinguish”.  Some trade marks may have a low level of inherent distinctiveness such that the trade mark does not yet possess a distinctivecharacter. If so, proof of actual use of the trade mark together with branding promotion exercises may be sufficient to save the trade mark under s 7(2) of the TMA. 83     One problem with a common surname is that the surname may well be a name which honest traders may also wish to use on the goods and services. The same may also be true for geographical names. InNichols v RTM, the Advocate-General in presenting his opinion to the ECJ noted at [18] the comment of Jacob J (the English judge who referred the question of registrability of common surnames to the ECJ) that the problem with use of a surname as a trade mark is the risk of monopolisation deriving from the registration of a common surname to cover a wide range of goods and services. For that reason, Jacob J questioned whether the fact that the registration might be challenged after five years of non-use was an insufficient safeguard in respect of that risk. 84     The concern over registration of surnames involves a broad question of policy: what is the role of trade mark law and to what extent is there a risk that the trader who registers first gains an unfair advantage? This is not a policy concern that can be easily addressed in the courts. It may nonetheless be helpful to point out that the ECJ in its judgment responded in robust terms at [31] that “[t]he registration of a trade mark constituted by a surname cannot be refused in order to ensure that no advantage is afforded to the first applicant”. There was simply no provision in the Council Directive 89/104/EEC which had that effect. Susanna H S Leong,Intellectual Property Law of Singapore(Academy Publishing, 2013) (“Susanna Leong”) observes at para 28.142(c) that: There is no general public interest objective in keeping names or surnames free for all to use [and] a trader who wishes to register a name sign to gain a “first–mover” advantage is not prohibited from doing so. … 85     InNichols v RTM, the ECJ held at [30] that, just as a term used in everyday language, “a common surname may serve the trade mark function of indicating origin and therefore distinguish products or services concerned”. The exception was where it is caught by a ground for refusal such as being generic or descriptive or because of conflict with an earlier trade mark. 86     Of even greater significance is the finding of the ECJ at [34] that in assessing the existence or otherwise of the distinctive character of a trade mark constituted by a surname, even a common surname, this must be done specifically in accordance with the criteria applicable to any sign. The fact that the effects of registration of a trade mark may be limited under art 6(1)(a) of the Council Directive 89/104/EEC was irrelevant. 87     Council Directive 89/104/EEC referred to inNichols v RTMwas a directive concerned with harmonisation of trade mark laws amongst the Member States of the European Economic Community. (It has since been replaced by European Union Directive 2008/95/EC.) Article 6(1)(a) of Council Directive 89/104/EEC sets out a limitation on the effect of a registered trade mark. Registration will not prevent a third party from using in the course of trade his own name or address, provided he does so in accordance with honest practices in industrial or commercial matters. The point made by the ECJ was that in deciding whether a surname is registrable (distinctive) it was not proper to have regard to the fact that there is a defence which allows third party use of his own name (subject to the conditions and requirements of the defence). 88     Section 28(1)(a) of the TMA sets out a similar provision permitting the use of a person’s own name where the use is in accordance with honest practices in industrial or commercial matters. While I am not bound by decisions of the ECJ, I agree that in deciding whether a surname possesses a distinctive character in the trade mark sense, it is incorrect to take account of the existence of the defensive limitation.  The fact that there is a defensive limitation which may mitigate some of the effects of registration does not mean that the Registry of Trade Marks or courts are to lean in favour of registration. However, what it does mean is that parliament is cognisant of the likelihood that surnames, even common surnames can be found to possess the required distinctiveness for registration. At the very least, it means that there is no automatic bias against a surname even a common surname as a registered trade mark. 89     Coming back to the facts of the present case, “Han” is capable of taking on a number of meanings in plain usage (see above at [69]), quite apart from it also being a surname. The addition of a possessive modifier can produce different permutations of meaning. None of those permutations are descriptive of the goods and services that the Plaintiff provides—pastries, local food and Hainanese-style western food. 90     But the fact remains that “Han” is a relatively common surname. If I am right in thinking that one guide in assessing distinctiveness is the question of whether the sign is one which other honest traders may wish to use on goods or services, the consequence is that the level of inherent distinctiveness falls towards the lower end of the spectrum. While the mark in question is “Han’s” (as opposed to “Han”) I doubt that the addition of the possessive modifier is enough to enable a finding that “Han’s” possesses a distinctive character for the goods or services. 91     Reference may be made to the decision of the Court of Appeal inThe Singapore Professional Golfers’ Association v Chen Eng Waye and others[2013] 2 SLR 495 at [29] where it was said that a name or a choice of words that is either meaningless or has no discernible correlation to the product or service (a fancy word) generally serves no purpose other than as a mark or badge of origin or source of that product or service. Examples given (citing Christopher Wadlow,The Law of Passing-Off: Unfair Competition by Misrepresentation(Sweet & Maxwell, 4th Ed, 2011) (“Wadlow’s Law of Passing-Off”) at para 8–075) were “Eureka” for shirts, “June” for toiletries, or “Puffin” or “Penguin” for chocolate-coated sandwich biscuits. It is interesting to note that the comment inWadlow’s Law of Passing Offon the latter two word marks was that they were “names of unpalatable seabirds both”. For this reason, it appears the word marks were regarded as arbitrary and fanciful in nature. 92     Take, for example, the word “June”. It is ordinarily either a personal name or the sixth month in the calendar year. While “June” is unlikely to be a surname, it is a well-known forename or personal name. “Han”, on the other hand, is a surname and also has allusions to Chinese and Korean people. Indeed, the evidence is that the word “Han” in Japanese can also be taken as a reference to Osaka. Does this mean that as a whole, “Han” or “Han’s” is inherently relatively less distinctive for restaurant services than “June” is for toiletries?Susanna Leongcomments at para 28.143 that, in general, a full name is better able to serve the function of a trade mark as compared to a name or surname (although I note that problems may arise where the full name is the name of a celebrity and the goods or services are connected with memorabilia). Signatures, depending on all the circumstances, may also meet the requirements of distinctiveness. 93     Han does appear to be a fairly common surname and the allusions to China, Japan and Korea are not inconsistent with the registration for restaurant services (especially so given that the food is a mixture of local fare and western sets). In the present case, I am of the view that the Han’s word marks, while possessing a low level of inherent distinctiveness, do not meet the criteria of distinctive character as set by s 7(1)(b) of the TMA. In coming to this conclusion. it must be accepted that there is no easy answer to the question of how much distinctive character there must be to constitute a registrable mark. 94     On this, James Melloret al,Kerly’s Law of Trade Marks and Trade Names(Sweet & Maxwell, 15th Ed, 2011) (“Kerly’s Law of Trade Marks”) at para 8–042 responds: “[a]part from enough, there is no easy answer to this question.” The learned authors continue that not even the ECJ has been able to provide a concrete answer. The reason being: … Assessment of distinctive character is not an exact science, it requires a judgment to be made based on all relevant factors. It is the type of multi-factorial assessment which is not susceptible of an appeal unless the assessment displays an error of principle. 95     However, “Han’s” as a word not possessing a distinctive character on its own (in the trade mark sense), is no impediment to the Han’s composite marks (both the red and black) from possessing a much higher level of inherent distinctiveness which provide the Han’s composite marks with a distinctive character. In my view, the unique stylisation and typeface of the Han’s composite marks (within the framed outline) are sufficient to support the conclusion that the Han’s composite marks possess a distinctive character. 96     In any event,allof the Han’s trade marks would satisfy the distinctiveness requirement by acquisition through use under s 7(2) of the TMA. In invalidation proceedings, the use of the registered mark subsequent to registration can contribute to it acquiring distinctiveness under s 23(1) of the TMA. 97     The report produced by Ipsos Marketing indicated that 79.4% of the 1,001 respondents surveyed had heard of “H.A.N.S”.[note: 9]Mr See Toh, the Defendant’s expert, agreed that “Han’s” was a Singapore brand familiar to many Singaporeans.[note: 10]“Han’s” has been used in conjunction with the cafés in question since 1980. The Plaintiff now operates 21 Han’s Café outlets island-wide. Indeed, the Defendant did not argue that the Han’s trade marks had not acquired distinctiveness through use. 98     I, therefore, hold that the Han’s trade marks are capable of distinguishing the goods and services of the Plaintiff from that of other traders. While the Han’s word marks are not sufficiently inherently distinctive on their own to meet the requirement of distinctive character, the Han’s composite marks, satisfy the requirements set out in section 7(1)(b). All the Han’s trade marks have, in any event, acquired distinctiveness through use. There are, therefore, no grounds for invalidating any of the Han’s trade marks under s 23 of the TMA.",
        "Whether the Defendant’s use of the HAN sign infringes the Han’s trade marks under s 27 of the TMA": "99     Leaving aside the case where the Defendant has used an identical sign on identical goods or services, the test for trade mark infringement is found in s 27(2) of the TMA. Section 27(2) states that: (2) A person infringes a registered trade mark if, without the consent of the proprietor of the trade mark, he uses in the course of trade a sign where because ­— (a)    the sign is identical with the trade mark and is used in relation to goods or services similar to those for which the trade mark is registered; or (b)the sign is similar to the trade markand is used in relation togoods or services identical with or similar to those for which the trade mark is registered, there exists alikelihood of confusion on the part of the public. [emphasis added] 100    In the case where the Defendant has used an identical sign on identical goods or services s 27(1) of the TMA applies—there is no need to prove any likelihood of confusion. The TMA, therefore, provides for sliding scale of protection: the strongest protection is conferred in cases where the defendant has used an identical mark on identical goods or services. Where a similar mark is used on identical or similar goods or services, there is an added requirement of likelihood of confusion. In the present case, infringement is founded on the use of a similar mark on identical or similar goods and services. 101    Where the claim is advanced under s 27(2) of the TMA, our courts have applied the statutory formulation in three steps: (a)     First, the allegedly infringing sign must be similar to the registered mark. (b)     Second, both the sign and the mark must be used in relation to similar or identical goods or services. (c)     Third, there must exist a likelihood of confusion on the part of the public on account of the preceding two factors. 102    I mention in passing that the ECJ takes a slightly different approach under their equivalent provisions. The current European approach as set out inSabel BV v Puma AG, Rudolf Dassler Sport[1998] RPC 199 andCanon Kabushiki Kaisha v Metro-Goldwyn-Mayer Inc (formerly Pathé Communications Corporation)[1999] RPC 117 has been described as the “global assessment” method. 103    Under this approach, the first two steps are considered as part of and within the question of whether there is a likelihood of confusion on the facts and circumstances as a whole. InPolo v Shop In, the Court of Appeal agreed with the judge at first instance, Lai Kew Chai J, that a three-step test was preferable given the language and structure of s 27(2) of the TMA. The Court of Appeal accepted at [8] that while the first and third steps were different, there was some overlap between both. After all, the greater the similarity between the mark and the sign, the greater the likelihood of confusion. The important point, however, is that the court cannot assume that just because the mark and sign are virtually identical, there must be a likelihood of confusion. 104    Whether the court applies the three-step approach or the global assessment approach, it is clear that there is no presumption that there must be a likelihood of confusion just because an even identical sign has been applied to similar goods or services. It is for this reason that the Court of Appeal observed that in practice, the end result of the two approaches was not likely to differ. Similarly, Andrew Phang Boon Leong J (as he then was) inNation Fittings v Oystertecobserved at [95] that there was no inherent contradiction between the two approaches. Under both approaches, attention must be paid to the specific factors set out in the first and second steps.",
        "Whether the HAN sign is similar to the Han’s trade marks": "105    There are three aspects to the mark-similarity analytical framework: visual, phonetic and conceptual similarity. In determining whether the allegedly infringing sign is similar to the registered mark, both the mark and the sign will be considered as a whole. The comparison is mark-for-mark: similarity is determined on the face of the marks, without consideration of any factors extrinsic to the marks. The analysis is not to be carried out in a mechanistic or formulaic manner. There is also no requirement for all three aspects of similarity to be present before the court concludes that the allegedly infringing sign and the registered mark are similar. 106    The similarity of the marks is assessed from the perspective of an average consumer, who would exercise some care and a measure of good sense in making his or her purchases. Leeway must also be given for the imperfect recollection of the average consumer. These general principles were summarised by the Court of Appeal inHai Tong Co (Pte) Ltd v Ventree Singapore Pte Ltd and another and another appeal[2013] 2 SLR 941 (“Hai Tong v Ventree”) at [40]. 107    In considering the mark as a whole, however, there is no contradiction if the court places especial emphasis on dominant or impactful components of the mark. InHai Tong v Ventreeat [40(a)], the Court of Appeal made the point that not every aspect of similarity will be of equal importance. The court is concerned with the overall impression created in the mind of the average consumer, and in certain circumstances, that impression may be dominated by one or more of the mark’s components:Staywell Hospitality Group Pty Ltd v Starwood Hotels & Resorts Worldwide, Inc and another and another appeal[2014] 1 SLR 911 (“Staywell v Starwood”) at [27] citing the European Court of First Instance inMatratzen Concord GmbH v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)[2002] ECR II-4335 at [34]. 108    The idea of distinctiveness is also embedded in the mark-similarity inquiry. I have discussed distinctiveness above at [52]­–[98] in the context of the registrability of a trade mark. While the distinctiveness test at the registrability stage leads to a binary outcome (ie, registrable or not registrable), it plays a more nuanced role at the marks-similarity stage. 109    In general, it appears that the more distinctive a mark, then the more compelling the degree of dissimilarity the defendant will have to demonstrate between his sign and the registered mark. Or to put the matter the other way round, the more distinctive the registered trade mark, the easier it will be to demonstrate the defendant’s use of similar elements in his sign amounts to use of a similar sign. Conversely, “the more descriptive a mark, the greater the latitude afforded to the defendant in using words or ideas of a generic nature, even if these have some similarity to what is found in the registered mark”:Hai Tong v Ventreeat [30]. See alsoSusanna Leongat para 28.353 citingFerrero SpA v Sarika Connoisseur Cafe Pte Ltd[2011] SGHC 176 for the proposition that where distinctiveness is low, less alteration is necessary to ensure that the defendant’s mark is dissimilar. A similar approach was also taken by the High Court inIntuition Publishing Ltd v Intuition Consulting Pte Ltd[2012] SGHC 149 (“Intuition Publishing”) at [41]. 110    The Court of Appeal inPolo v Shop Inat [23] was amenable to taking into account distinctiveness acquired through use (as well as inherent distinctiveness) in deciding whether the defendant’s sign was similar to the mark. This makes sense as similarity is examined from the perspective of the average customer. 111Kerly’s Law of Trade Marksat para 9–093 also importantly observes that it is not appropriate to concentrate on similarities to the exclusion of differences. As has been said, albeit in a different context, differences are the shadow of similarities andvice versa. This may be a reason why the ECJ prefers to assess similarity of the mark/sign and goods/services as part of the overall assessment of the likelihood of confusion. Similar or different in what context or for what purpose? Even though Singapore takes a step-by-step approach to s 27(2)(b) of the TMA, a common sense approach should be taken when assessing whether the mark and sign in issue are similar or different. There should be no automatic bias for phonetic similarity over visual similarity or indeed an assumption that there is a dominant feature. This may or may not be the case.  In the case of composite marks, it is also wrong to assume that word elements are always dominant over graphic elements. 112    The Plaintiff’s argument on similarity rides on the back of its assertion that the dominant element of the HAN sign is the word “HAN”.[note: 11]The Plaintiff asserts that for the purpose of assessing marks-similarity, only “HAN” should be used. The phrase “Cuisine of Naniwa” and theKushikatsudevice (described at [9] above) should be disregarded. 113    The Plaintiff’s dominant element argument is based on three interrelated claims. First, the word “HAN” is written in a large and bold font. It, therefore, stands out against the white background of the Defendant’s sign. Second, the “Cuisine of Naniwa” element is significantly smaller and in a subsidiary position below the large capital “HAN” letters. Third, theKushikatsudevice is not part of the sign, and even if it is, it is purely decorative and devoid of distinctiveness. The Plaintiff also says that consumers, food reviewers, and even the employees of the Defendant, refer to the Defendant’s restaurant as HAN. The Plaintiff relies on the decision of the ECJ inOyster Cosmetics SpA v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)[2011] ETMR 26 (“Oyster Cosmetics”) in support of its argument. 114    While I accept that the word “HAN” is the most prominent element of the Defendant’s HAN sign, I do not agree that the court should disregard the other elements of the HAN sign in the marks-similarity analysis. In my view, the HAN sign must be considered in its entirety. That is what the average consumer would regard as the sign that the Defendant’s restaurant is trading under.  In my view, the Han sign comprises the word, phrase andKushikatsudevice. 115    I deal first with the Plaintiff’s reliance onOyster Cosmetics. In that case, the ECJ compared two marks. One contained the word “oystra” and the other, the word “oyster”. Both marks had some wording in subtext, in a significantly smaller font. The “oyster” mark additionally had an oyster device next to the word “oyster”. The ECJ did not disturb the conclusion of the court below that the words “oystra” and “oyster” dominated the overall impression that would be produced in the memory of the relevant public. 116    The persuasiveness ofOyster Cosmeticsis doubtful to the extent that it relied on the rule that in a composite mark “words talk” (Oyster Cosmeticsat [36]): … When a mark is composed of word elements and figurative elements, the former are, as a rule, more distinctive than the latter, since the average consumer will more easily refer to the goods in question by citing the name rather than describing the figurative element of the mark … This rule was considered and squarely rejected by the Court of Appeal inHai Tong v Ventreeat [41]. The mark in question must be looked at as a whole, without placing undue emphasis on any particular component of the mark unless it is warranted on the facts. 117    Second, and more importantly, the ECJ was of the view that, on the facts ofOyster Cosmetics(at [33] and [37]) the “other word and figurative elements were negligible [to the relevant] public”, such that the analysis could proceed simply on a comparison of “oystra” with “oyster”. Whether or not a court will do so necessarily depends on the facts of the case and the marks that are placed before it. 118    While I agree that the textual “HAN” component is prominent in the HAN sign, I do not agree that the rest of the components are negligible to the extent that they can be disregarded. In my view, the phrase “Cuisine of Naniwa” and theKushikatsudevice both play essential parts in the overall impression conveyed by the HAN sign. 119    The phrase “Cuisine of Naniwa” is significantly smaller than the “HAN” text but is important because it puts in context the manner in which “HAN” is used. I have alluded to the multiple meanings the word “HAN” is capable of bearing. The inclusion of “Cuisine of Naniwa” suggests that “HAN” is used in its ethnic or geographical sense: to refer to food originating from a particular place or of a particular people. While this bears a descriptive connotation, the phrase is encircled by theKushikatsudevice to form a unitary whole.  The imperfect recollection of the average consumer may mean that he does not necessarily recall the phrase “Cuisine of Naniwa” but the phrase would, nonetheless, have affected his perception of “HAN” and his recollection of it. 120    TheKushikatsudevice is prominent because it encircles the “HAN” and “Cuisine of Naniwa” elements in their entirety. It is not merely badge or graphic placed next to the dominant text in question, as was the case inOyster Cosmetics. TheKushikatsudevice is also crucial to the HAN sign because of the dissonance it creates when used in conjunction with the otherwise inconspicuous text of “HAN” and “Cuisine of Naniwa”. The impression created by the HAN sign emanates from the juxtaposition of the brusque, free-hand brush strokes of theKushikatsudevice with the precise and neat typeface of the “HAN” and “Cuisine of Naniwa” text. The obvious asymmetry of theKushikatsudevice contrasts with the apparent symmetry of the minimalist “HAN” and “Cuisine of Naniwa” text, which adds to the overall “feel” of the sign. 121    I am, therefore, of the view that the “Cuisine of Naniwa” text and theKushikatsudevice are not negligible such that they can be disregarded from the marks-similarity comparison, as was done inOyster Cosmetics. Visual similarity 122    The Plaintiff argues that the HAN sign and the Han’s trade marks are similar because they share a common denominator, the alphabets H, A and N.[note: 12]Further, the difference in typeface and colours used in the HAN sign and the Han’s trade marks are irrelevant. The Han’s trade marks are registered as word marks as well as a device mark. The Plaintiff argues that the TMA only allows the registration of a word mark in block letters and in one font. Therefore, trade mark protection may not be circumscribed simply by changing the font or style of the lettering of the word mark.[note: 13] 123    The Plaintiff relies on the High Court decision ofDoctor’s Associates Inc v Lim Eng Wah (trading as SUBWAY NICHE)[2012] 3 SLR 193 (“Doctor’s Associates v Lim Eng Wah”) andIntuition Publishing. In the latter case, Judith Prakash J held at [24] that the sign “intuition” was identical to the registered trade mark “INTUITION” since a mark registered in upper case in plain font covers all stylistic permutations. 124    The Defendant, on the other hand, argues that there is no visual similarity between the HAN sign and the Han’s trade marks. The Defendant relies on the evidence of its expert, Mr See Toh. Mr See Toh’s views were that the visual presentation of the HAN sign was distinct from that of the Han’s trade marks. That said, I will not repeat my earlier comments on the rationale and value of expert evidence on infringement issues. 125    It is trite, and I accept as a general proposition, that registration of a word in block capital letters should cover use of the word in every font or style possible:Sarika Connoisseur Cafe Pte Ltd v Ferrero SpA(“Sarika v Ferrero”) [2013] 1 SLR 531 at [24]. To keep the same alphabets of a word mark and merely to change the font does not mean that the defendant’s sign ceases to be identical. Slightly trickier is a case where the defendant changes a few alphabets in the word mark as well as the font such as where the offending sign isand the registered mark, “NUTELLA”. The mere change of font is irrelevant (in deciding whether the defendant has used the same or similar mark). The change in letters (or even a single one) clearly means thatis not identical but arguably similar. 126    I will address the similarity between the HAN sign and the Han’s word marks first, before turning to the Han’s composite marks. Comparing the HAN sign with the Han’s word marks presents an immediate methodological difficulty. As I mentioned above, word marks are said to transcend differentiation that may arise from “tweaking the font or style of the lettering of the word mark”:Doctor’s Associates v Lim Eng Wahat [34]. One is concerned only with the sequence and arrangement of the characters that give rise to the word or phrase in question. 127    Composite marks, on the other hand, incorporate a dynamic range of visual elements, from graphics to colour to text. The words in a composite mark are but one of the numerous other elements that come together to produce the impression conveyed by the mark. Comparing a word mark with a composite mark is, in some senses, comparing apples with oranges. 128    The case law has taken two differing approaches to this comparison exercise. The first is where the court focusesonlyon the textual component of the composite mark and compares it against the word mark. This approach was adopted inDoctor’s Associates v Lim Eng Wah. There, the court was comparing a registered word mark, “SUBWAY”, with an allegedly infringing composite mark that incorporated the words “SUBWAY NICHE” as well as a graphic. For the purpose of determining visual similarity, the court appeared to consideronlythe textual components of the composite mark, “SUBWAY NICHE”, with the registered word mark, “SUBWAY”. The court concluded at [34] that both shared a common denominator in the word “SUBWAY” and were, therefore, similar. Further, the addition of the word “NICHE” made no difference to the question of similarity because of the distinctiveness of the “SUBWAY” mark. The court went on to say that the differences in font were irrelevant, for the reason mentioned above. 129    InDoctor’s Associates v Lim Eng Wah, there was no express consideration of the graphical component of the “SUBWAY NICHE” composite mark, and whether that affected the similarity between the word mark and the composite mark. 130    A contrasting approach is seen inPolo v Shop In, where the court was comparing the registered word mark “POLO”, with an allegedly infringing composite mark that was a stylised depiction of the words “POLO PACIFIC”. The court took into account the “special font anddesign” [emphasis added] of the “POLO PACIFIC” composite sign in determining whether or not it was similar to the “POLO” word mark:Polo v Shop Inat [24]. The court did not confine itself to a strictly textual analysis of the composite sign, as was done inDoctor’s Associates v Lim Eng Wah. 131    I should also point out that the Court of Appeal eventually came to its decision on the back of the finding that the “POLO” trade mark comprised a common word that was lacking in inherent distinctiveness. Further, it was said that there was no evidence that distinctiveness had been acquired through use. It appears that it was the “low level” of distinctiveness in the “POLO” word mark that lay behind the Court of Appeal’s conclusion that the sign “POLO PACIFIC” in its special font and design was different from “POLO”. 132    In my view, what is required in carrying out the marks-similarity comparison is an assessment ofall aspectsof alleged similarities (aural, visual and conceptual) bearing in mind that the addressee is the reasonable or average consumer. In making the comparison, it is important to bear in mind the scope of the mark for which protection is claimed (is it a simple word mark or a mark comprising several words, are there visual elements built into the mark such as a logo or other device) and the scope of the defendant’s alleged sign. Is the sign simply a word or a word and a sentence or does it comprise design over and above typographical font such that it takes the form of a logo? Does the sign include a device of some sort, not by way of description, decoration or ornamentation but as part of the trade mark message of the sign­—to indicate origin? Where the mark and sign comprises nothing more than a word with the only difference being that the font in the sign is different, then the difference is immaterial given the holding that a mark registered in plain upper case text covers all stylistic permutations to the lettering. 133    Returning to the facts of this case, I am of the view that the HAN sign is visually similar to the Han’s word marks. The shared common denominator “HAN” in both the HAN sign and the Han’s word marks is substantial. The only feature that separates them is the lack of a possessive modifier in the HAN sign. Further, the “HAN” word is a prominent part of the HAN sign. While the inclusion of “Cuisine of Naniwa” in the subtext and theKushikatsudevice decreases the similarity between the HAN sign and the Han’s word marks, I do not think they are sufficient to render the HAN sign visually dissimilar from the Han’s word marks. 134    In relation to the Han’s composite marks, however, my conclusion is different. The composite marks depict the “Han’s” lettering with considerable visual stylisation or embellishment that goes beyond mere font design. This is not a case where the word is expressed in plain block capitals. Indeed, one composite mark is limited to presentation in red colour. The addition of the stylisation has two effects. First, it decreases the similarity between the “HAN” text in the HAN sign, which is in a plain and minimalist font, and the “Han’s” words, which are set out with considerable stylisation. Second, it emphasises the presence of the other visual elements in the HAN sign—theKushikatsudevice and “HAN” in gold lettering which add to the visual sophistication of the sign, as opposed to the Han’s composite marks, which are simple, prominent and eye-catching. Phonetic similarity 135    The Plaintiff submits that there is phonetic similarity between the Han’s trade marks and the HAN sign because they share a nearly identical pronunciation. The Plaintiff relies on the “first syllable principle” enunciated in the High Court decision ofValentino Globe BV v Pacific Rim Industries Inc[2009] 4 SLR(R) 577 at [34]. The Plaintiff says that the additional “s” at the end of “Han’s” is an “unvoiced sound, meaning it does not use the vocal cords during its production”.[note: 14] 136    The Defendant argues that the Han’s trade marks contain only a single syllable. The HAN sign, on the other hand, consists of seven syllables (“HAN Cuisine of Naniwa”). The Defendant argues, in any event, that it is incorrect to place undue emphasis on phonetic similarity.[note: 15] 137    In my view, there is phonetic similarity between the HAN sign and the Han’s trade marks. The main phonetic component of the HAN sign is “HAN”. “Cuisine of Naniwa” is subsidiary. It is doubtful that the average consumer would make constant reference to the seven-syllable “HAN Cuisine of Naniwa” phrase every time he refers to it. “HAN” and “Han’s” are both single-syllable words which share similar pronunciations. Adequate allowance must be made for imperfect recollection and careless pronunciation and speech:Future Enterprises Pte Ltd v McDonald’s Corp[2006] 4 SLR(R) 629 at [12]. The slightest mispronunciation would result in complete identity. There is, therefore, phonetic similarity between the HAN sign and the Han’s trade marks. Conceptual similarity 138    The Plaintiff submits that the Han’s trade marks and the HAN sign share conceptual similarity. Both connote the class of people behind the name, be it Japanese, Korean, Chinese or German.[note: 16] 139    The Defendant argues that the Han’s trade marks are a “possessive noun derived from the common family surnameHan” and denote ownership. On the other hand, the HAN sign represents groups of people, the “bite-sized skewered ingredient”, and the unique and little-known genre of “culinary genius” that originates from Japan.[note: 17] 140    The Defendant relies on the three cases ofStaywell v Starwood,Kenzo v Tsujimoto Kenzo[2013] SGIPOS 2 andCardinal Place Trade MarkBL 0/339/04 (28 October 2004). In each of these cases, the court or tribunal came to the conclusion that there was conceptual dissimilarity despite the fact that the allegedly infringing sign shared a same distinctive word (albeit modified by a prefix or a preceding or succeeding word) as the registered mark. 141    It is well-established that conceptual similarity involves the consideration of the ideas that lie behind or inform the earlier mark:Sarika v Ferreroat [34]. In comparing the visual and phonetic similarity of “HAN” with “Han’s”, the effect of the possessive modifier is minor. But, in my view, the significance of a possessive modifier is greatly amplified where conceptual similarity is concerned. HAN evokes a reference to a group of people or a cuisine in a cultural or geographical sense. “Han’s”, on the other hand, causes the concept of possession or ownership to spring to mind. The immediate impression is of a house or a restaurant owned by a person named “Han” (be it his (Dutch) first name or his (Chinese) surname). This conceptual distinction is reinforced by the inclusion of the phrase “Cuisine of Naniwa” in the subtext of the HAN sign, which suggests that “HAN” is being used in its geographical and cultural form. As between the HAN sign and the Han’s word marks, I am of the view that there is conceptual dissimilarity. 142    In relation to the Han’s composite marks, the conceptual dissimilarity is even more pronounced. The HAN sign evokes a sense of simple sophistication, or as the Defendant submits, a “Zen concept”. This sophistication is created by the juxtaposition of the phrase “HAN Cuisine of Naniwa” in a plain typeface against theKushikatsudevice (see [120] above). The muted gold and black colour scheme adds to the sense of simple sophistication. The Han’s composite marks, on the other hand, in their loud and eye-catching style, coupled with the possessive modifier, evoke a sense of warmth, comfort and familiarity. The conceptual dissimilarity is further heightened with the red Han’s composite mark. Conclusion on whether the HAN sign is similar to the Han’s trade marks 143    Viewing the HAN sign and the Han’s word marks and composite marks in the round, I am of the view that the HAN sign is similar to the Han’s word marks. This arises from the weak visual similarity and strong phonetic similarity, notwithstanding the conceptual dissimilarity. On the other hand, the Han’s composite marks are dissimilar to the HAN sign.",
        "Whether the HAN sign is used in relation to goods or services identical with or similar to those for which the Han’s trade marks are registered": "144    The Plaintiff argues that the Han’s trade marks are registered in Class 43, and its specification covers a wide range of food and beverage applications (listed at [4] above). The Plaintiff argues that regardless of the specific market segment that its restaurants or the Defendant’s restaurant targets, the goods and services will be similar as long as they fall within the same class. The Plaintiff cites the Court of Appeal’s observations inSarika v Ferreroat [46], where the Court of Appeal stated: … [U]nder the express terms of [s 27(2)(b) of the TMA] … the comparison to be made is not between the alleged infringing goods and the actual goods of the trade mark owner but between the alleged infringing goods and the products in respect of which the trade mark is registered for … To say that in determining similarity one should only look at the alleged infringing goods and the actual goods of the trade mark owner and not at the specifications would be to take a view inconsistent with the express terms of the provision. … 145    The Plaintiff argues that the Defendant’s restaurant would necessarily fall within one of the registered specifications for the Han’s trade marks. Even though they compete in slightly different markets, they are nonetheless used in an identical class and also an identical description. 146    The Defendant, on the other hand, relies onStaywell v Starwood. It submits that the Court of Appeal stated at [42] that in cases of opposition, where a good or service for which registration was sought fell within the ambit of a specification which an incumbent mark had been registered for, the goods or services in question were to be regarded asprima facieidentical. Theprima facieidentity can be displaced byqualitative differencesbetween the goods and services. 147    The Defendant argues that the goods and services of the Plaintiff’s restaurants are that of a “self-service low cost Hainanese Western cuisine restaurant”, while those of the Restaurant are a “full service fine dining Japanese cuisine restaurant which sells champagne for [$780] per bottle … andAmaronefor [$1,350] per bottle”. The cuisine is also vastly different. The Defendant, therefore, submits that theprima facieidentity of the goods has been sufficiently displaced. 148    In my view, the Defendant’s submission is misplaced. The passage that it cites fromStaywell v Starwoodis taken out of context. Just one paragraph earlier, at [41], the Court of Appeal stated that “hotel services are hotel services whether these concern a luxury hotel or a modest one”. The Court of Appeal continued at [42] that as long as the goods and services to which the infringing sign was applied fell into one of the specifications for which the registered mark covered, there would be aprima faciecase of identity of goods and services. The market segment the goods and services are targeted at is not a relevant consideration: [R]egistration in the same specification within a class establishes aprima faciecase foridentity. This is because it is not within the scheme of the classification systemto make distinctions within a specification based on whether the particular product is targeted at one or another market segment. [emphasis in original in italics; emphasis added in bold italics] 149    The Han’s trade marks are registered to cover the specification of “food preparation” and “restaurants”. In view of the fact that the goods and services are identical, there is no need to consider the degree of similarity between the goods and services:Susanna Leongat para 28.354 andStaywell v Starwoodat [42].",
        "Whether, on account of the presence of the first two conditions, there exists a likelihood of confusion on the part of the public": "150    In view of my earlier finding that the HAN sign is not similar to the Han’s composite marks, the question of confusion is only a live one with respect to the Han’s word marks. I will nonetheless consider the question of confusion in relation to all four registered marks in case my holding on similarity is incorrect. 151    The Plaintiff submits that there is a likelihood of confusion. The Plaintiff relies on the survey evidence presented by its expert witness, Mr Prasad. The Plaintiff submits that it is irrelevant that the Plaintiff and Defendant target different ends of the spectrum in the food and beverage market. The Plaintiff’s registration and use of the Han’s trade marks are protected in respect of similar goods and services, whether or not the Plaintiff has actually ventured into that area. 152    The Defendant, on the other hand, attacks the impartiality and reliability of the report produced by Mr Prasad. The Defendant argues that there is no confusion because there are “vast differences” between the Plaintiff’s and the Defendant’s establishments, be it in price, menu or dining experience. The Defendant also argues that there is no evidence that the Plaintiff intends to expand into the market segment of high-end Japanese food. 153    In order to succeed, the plaintiff must show that there is a likelihood of confusion on account of the similarity in marks and goods and services. Confusion in this sense refers to the origin function of a trade mark. Trade mark protection concerns the right of a trade mark owner to use a species of property as an “exclusive badge of origin”:Hai Tong v Ventreeat [72]. 154    Confusion extends to the situation where the consumer “mistakenly assumes some kind of economic link or connection between goods bearing the registered mark and those bearing the allegedly infringing sign”:Hai Tong v Ventreeat [73]. The Court of Appeal, nonetheless, recognised at [75] that confusion in the sense of “mere association” is not enough. This means that “it is not sufficient that the relevant segment of the public would recognise or recollect similarities between the contesting marks if there is no likelihood of confusion as to origin ensuing”. Similar views were also expressed by the Court of Appeal inCity Chain Stores (S) Pte Ltd v Louis Vuitton Malletier[2010] 1 SLR 382 (“City Chain v Louis Vuitton”) at [58]. 155    The question of likelihood of confusion is one of law. But evidence of actual confusion, though not necessary, is helpful to the resolution of the legal issue:Hai Tong v Ventreeat [100]. What is required is that a substantial portion of the relevant segment of the public are likely to be confused, but this does not mean that there must be a finding that the majority will be confused. The likelihood of confusion must be more than ade minimislevel:Hai Tong v Ventreeat [78(e)]. 156    It is permissible to take into account extraneous factors at the confusion stage, unlike at the marks-similarity stage. Previous cases have taken a liberal approach to the consideration extraneous factors. These include the price of the goods, where they are sold, the consumers the goods are targeted at, the packaging of the goods, and the steps taken by the defendant to differentiate his goods from those of the registered trade mark proprietor:Hai Tong v Ventreeat [85] and [94]–[95];Sarika v Ferreroat [66];City Chain v Louis Vuittonat [59];Polo v Shop Inat [34]. 157    The Court of Appeal inStaywell v Starwoodhas, however, reigned in the extent of extraneous factors that may be permissibly considered. While the Court of Appeal affirmed that extraneous factors were relevant at the confusion inquiry, it purported to make “significant refinements” to the principles which “previous case law ... should be understood in the light of”. It will therefore be helpful to state in brief, salient points of the Court of Appeal’s holding inStaywell v Starwoodin relation to the permissibility of recourse to extraneous factors: (a)     In opposition proceedings, the court should consider all actual and notional fair uses of the registered mark against all actual and notional fair uses to which the applicant mark can be put in respect of the goods or services in the class: at [60]. (b)     In infringement proceedings, the court should consider all actual and notional fair uses of the registered mark against actual uses to which the allegedly infringing mark has been put to: at [61]. (c)     When considering the effect of similarity of marks and goods and services on the relevant segment of the public, extraneous factors may be considered to the extent that they inform the court as to how the similarity of marks and goods will likely affect the consumer’s perception as to the source of the goods: at [83]. (d)     The permissible factors are those which: (i) are intrinsic to the very nature of the goods; and/or (ii) affect the impact that the similarity of marks and goods has on the consumer: at [95]. Extraneous factors that relate to the purchasing practices and degree of care paid by the consumer when acquiring goods of the sort in question can be considered without descending into the differentiating steps which the trader might choose to take in relation to the goods and services falling within the specification: at [95]. (e)     Based on these considerations, extraneous factors that may be examined include: (i)       Factors relating to the impact ofmarks-similarityon consumer perception. These include the degree of similarity, the reputation of the marks, the impression given by the marks and the possibility of imperfect recollection: at [96(a)]. (ii)       Factors relating to the impact ofgoods-similarityon consumer perception. These include: (A)       the nature of the goods; (B)       the normal way or circumstances under which consumers would purchase goods of that type; (C)       whether the goods are expensive or inexpensive items; (D)       whether the goods would tend to command fastidiousness and attention on the part of prospective purchasers; and (E)       the characteristics of the consumer and whether they are likely to be specialists: at [96(b)]. (f)     The impermissible factors are those differences between the competing marks and goods which are created by a trader’s differentiating steps, in particular, pricing differentials, packaging and other superficial marketing choices which could possibly be made by the trader: at [95]. 158    Recourse to extraneous factors is limited to those listed above because of the proprietary nature of the rights of the registered mark owner. Otherwise, the subsequent trader would be able to enter the market using a trade mark that was very similar to the senior mark, applied to similar if not identical goods. All he would have to do to avoid confusion would be to include an express disclaimer, or by using cheaper materials and selling his goods at a much lower price:Staywell v Starwoodat [90]. 159    Clara Tung, “Staying Well out of Confusion:Staywell Hospitality Group Pty Ltd v Starwood Hotels & Resorts Worldwide” [2014] 26 SAcLJ 309, commenting onStaywell v Starwood, at para 15 citesMaier v Asos plc[2014] FSR 16 (“Maier”) as an example of a case where the court recognised the principle nevertheless placed emphasis on the present actual use of the trade mark (expensive products) as there was no indication that they intended to move into cheaper products. 160    InMaier, the learned judge recognised at [91] that the assessment was from the perspective of the average consumer of the actual products to which the plaintiff affixed its mark as well as notional fair use. Nevertheless, the learned judge held at [92] that most of the goods to which the plaintiff was likely to attach its mark are expensive and stylish. Although they could attach its mark to mass market cheap t-shirts, there was no suggestion that they intended to expand beyond the premium clothing sector. The question of what amounts to a notional fair use within a specification depends on a careful appraisal of the facts. 161    On the facts of the present case, it is my view that there is no likelihood of confusion, for three reasons. First, in determining the likelihood of confusion, a holistic approach is required. All relevant factors are to be considered, including the extraneous factors mentioned above that impact on the marks- and goods-similarity. In the case of marks similarity, while I accept that there is phonetic similarity, it is my view that the more important aspects of similarity in the present case are visual and conceptual similarity. 162    Both the Plaintiff’s restaurants and the Defendant’s restaurant are brick-and-mortar establishments. The visual and conceptual aspects of the marks in question will therefore have a significant impact on customers. Potential patrons, who will be physically present at the establishments, will have direct perception of the respective marks as they are displayed. They will likely glance at the menu and the fare on offer, both of which are likely to be adorned by the respective marks, before deciding to patronise the establishment. Phonetic similarity, while present, plays only a diminished role in assessing the likelihood of confusion. I have considered the three aspects of similarity above (at [122]–[142]), and have concluded that there is conceptual dissimilarity and slight visual similarity between the marks and the sign. 163    Second, I place no weight on the survey results that the Plaintiff relies on to prove confusion. The Plaintiff relies on responses elicited to the second and fourth out of four questions, which formed part of the telephone survey conducted by Mr Prasad’s team. The second question was: When you hear the names of Hans, spelled as H.A.N.S, and Han, spelled as H.A.N, which of these statements best describes your opinion of these [two] names? (a)    Sound [sic] very similar (b)    Sound [sic] somewhat similar (c)    Sound [sic] not similar at all 52.3% of the respondents surveyed answered that they “sound very similar”; 35.4% answered that they “sound somewhat similar”. 164    The fourth question was: In your opinion, do [sic] Hans, spelled as H.A.N.S, and Han, spelled as H.A.N, belong to the same management? (a)    Yes (b)    No (c)    Not sure (DO NOT PROMPT) 29.8% of the respondents surveyed answered “yes”, while 19.8% of the respondents surveyed answered “not sure”. 165    There are four deficiencies in the survey methodology that limit the usefulness of the data collected. The first deficiency is that the survey was conducted over the telephone. No visual or conceptual representation was given of the HAN sign and the Han’s trademarks. The results would only be relevant, if at all, to establishing confusion arising from phonetic similarity, which I have concluded above is of diminished significance. 166    The second deficiency is that the survey questions did not even include an apostrophe in the spelling of “Han’s”. The respondents were simply asked if “H-A-N-S” sounded similar to “H-A-N”. The omission of the apostrophe is a crucial one, because, as I have discussed above (at [141]), it changes the entire complexion of the word and the context in which it is used. Mr Prasad himself admitted that the inclusion of the apostrophe may have altered the results of the survey.[note: 18] 167    The third deficiency is that there was no reference whatsoever to the phrase “Cuisine of Naniwa”. While I have accepted that “HAN” is prominent component of the HAN sign, it does not render the phrase “Cuisine of Naniwa” in the subtext, and theKushikatsudevice irrelevant. Neither of these components feature in the survey. Mr Prasad admitted in cross-examination that he was not even aware that the name of the Defendant’s restaurant was HAN Cuisine of Naniwa.[note: 19] 168    These first three deficiencies strike at the manner in which the survey was conducted and the premises on which the survey was based. They therefore compromise the reliability of the survey results as a whole. 169    There is a fourth deficiency that is directed at the data obtained from the fourth question, which is perhaps the most relevant survey question to establishing actual confusion. 170    The deficiency arises from the manner in which the fourth question is phrased. Whitford J inImperial v Philip Morris[1984] RPC 293 at 302–303 considered the requirements for a survey to be probative of confusion or deception. Two of the factors he considered are of particular relevance here. First, the questions asked in the survey must not be leading. Second, the questions asked must not lead the interviewee into a field of speculation upon which he would not otherwise have embarked. Questions have been found to be leading where they “[put] in the respondent’s mind [an] idea ... which might otherwise not have occurred to him” (Frank Yu v McDonaldsat [51]) or where they “[introduce an idea] ... that would [not] have occurred spontaneously to the interviewee” (Weight Watchers (UK) Ltd & Others v Tescos Stores Ltd[2003] EWHC 1109 (Ch) at [25]–[26]). 171    In my view, the fourth survey question is rather infelicitous. It is positioned conveniently after the first and third questions, which are targeted at the similarity between “H-A-N” and “H-A-N-S”. It also bluntly introduces the possibility that “H-A-N” and “H-A-N-S” might be under the same management, when it might not have reasonably occurred to the respondent that that was the case. 172    In the light of these deficiencies, I place no weight on the survey findings in so far as they are said to show actual or the likelihood of confusion. 173    My third and final reason for saying that there is no likelihood of confusion is that there is established authority that the reputation of the mark does not necessarily equate to a higher likelihood of confusion. Instead, it can have quite the contrary effect:Staywell v Starwoodat [96] citingMobil Petroleum Co, Inc v Hyundai Mobis[2010] 1 SLR 512 at [74] andMcDonald’s Corp v Future Enterprises Pte Ltd[2005] 1 SLR(R) 177 (“McDonald’s Corp v Future Enterprises”) at [64]. InMcDonald’s Corp v Future Enterprises, McDonald’s opposed the registration of three composite marks which had an elaborate device depicting an eagle in flight, with the words “MacNoodles”, “MacTea” and “MacChocolate” in a plain bold font beneath the device. The Court of Appeal found that there was no likelihood of confusion between the marks registered by McDonald’s and the marks that were sought to be registered. The Court of Appeal observed at [64] that: … [T]he very success of [McDonald’s], which is inseparable from its logo, is also the very reason why confusion is unlikely. We would stress that the things that lead a consumer to a [McDonald’s] restaurant ... and its products are its unique logo and its main mark “McDonald’s”. 174    While I would not go so far as to say that, as inMcDonald’s v Future Enterprises, the Han’s trade marks are the things that would lead a consumer to a Han’s Café outlet, it is my view that the success of the Han’s chain is bound up with the success and prominence of the Han’s trade marks. These militate against confusion especially where, as I have found above, the similarity between the HAN sign and the Han’s trade marks is marginal when due weight is placed on each aspect of similarity. 175    These three reasons lead me to conclude that there is no likelihood of confusion from the Defendant’s use of the HAN sign. There is only slight visual similarity. The conceptual dissimilarity is manifest. Further, the reputable Han’s trade marks militate against confusion. The average consumer who approaches the Defendant’s restaurant, and observes the HAN sign that is applied at various positions in and around the restaurant, would be disabused of any notion that there is an economic connection between the Plaintiff’s goods and services and those of the Defendant. 176    I accept that the strong phonetic similarity between the Han’s trade marks and the HAN sign may cause the public to associate the marks with each other. But that in itself is not a sufficient basis for concluding that there is a likelihood of confusion in the absence of any possibility of misapprehension as to the origin of the goods and services concerned:Hai Tong v Ventreeat [75]. In coming to this conclusion I note that while the Plaintiff’s restaurants offer good quality affordable local and western food, the Defendant’s restaurant serves high end expensive Japanese food. 177    I have also considered the English case ofWagamama Ltd v City Centre Restaurants Plc and Another[1995] FSR 713 (“Wagamama”). In that case, the plaintiff owned and operated a successful inexpensive Japanese noodle bar and restaurant with minimalist décor under the brand “Wagamama”. The restaurant was very successful and had received widespread press coverage and awards. The defendant opened an American-themed restaurant with Indian décor and food called “Rajamama”. 178    Laddie J held that there was a likelihood of confusion. The trade mark was a meaningless word and the marks were being used for comparatively inexpensive restaurants. On the facts, imperfect recollection was likely and customers might either think the registered mark and the sign was the same, or that they were derived from the same source or an extension of the other. In reaching his decision, Laddie J commented that the task of deciding whether there was a likelihood of confusion was more a matter of feel than science and that the issue of infringement was for the judge alone. Key points in the Laddie J’s analysis were: (a) the mark was meaningless, an invented word that would be seen by the public as another artificial mark; (b) a significant reputation had been developed by the plaintiff; and (c) both restaurants were relatively inexpensive. 179    In the case at hand, “Han” bears a number of possible meanings. While the Plaintiff and Defendant are both in the food and beverage business, the Plaintiff’s restaurants are relatively inexpensive. The same is not true of the Defendant’s restaurant, which serves fine-dining Japanese food. 180    I recognise that inStaywell v Starwood, the Court of Appeal held at [95] that it was not permissible to take account of pricing differentials, packaging and other superficial marketing choices which could be made by a trader. The Court of Appeal, however, also accepted at [94] and [96] that it was permissible to have regard to whether the items were expensive or inexpensive and whether the item was the sort that was usually purchased on impulse with fleeting attention. The Court of Appeal cited the English case ofReed Executive Plc v Reed Business Information Ltd[2003] RPC 12 (“Reed Executive”) at [103] and stated that a 50 pence purchase in a station kiosk involves different considerations from a once-in-a-lifetime expenditure of 50,000 pounds. 181    While I am not saying that the difference in prices between the items offered at the Plaintiff’s restaurants and Defendant’s restaurant is as great as the example in theReed Executivecase, the point is that the Court of Appeal’s remarks inStaywell v Starwoodwere targeted at “superficial price disparity between competing goods”. Restaurant services embrace a broad range of different types of food outlets. In the present case, I am of the view that the significant difference in style, price, range and type of food and services offered are relevant. This is not a case where the differences can be ignored as being “superficial marketing choices.” 182    Further, inWagamama, both the mark and sign comprised a word or words with no stylistic embellishment such as a device. In the case at hand, the Defendant’s sign as a whole (including the device and phrase) is a composite mark. While there are similarities with the Plaintiff’s marks (especially the plain word marks), these are not so great as to lead to the view that there will likely be a substantial number of customers who will be confused over origin. 183    Accordingly, while I have concluded that the HAN sign is similar to the Han’s word marks, it is not confusingly so. The Plaintiff’s claim for trade mark infringement is dismissed.",
        "Whether the Defendant is liable for passing off its business as being connected to or associated with the Plaintiff’s": "184    In order to succeed in a claim in passing off, the “classical trinity” of goodwill, misrepresentation and damage must be present:Novelty Pte Ltd v Amanresorts Ltd and another[2009] 3 SLR(R) 216 at [36] (“Novelty v Amanresorts”). I will address each of these in turn.",
        "Whether the Plaintiff has goodwill attached to the goods and services that it supplies": "185    Goodwill consists of two essential features:Novelty v Amanresortsat [39] citingThe Commissioners of Inland Revenue v Muller & Co’s Margarine, Limited[1901] AC 217 at 223–224. The first is the association of a business on which a mark has been applied with a particular source. The second is an attractive force arising from that association which brings in custom. 186    I accept that there is goodwill in the Han’s trade marks amongst the general public, although I should point out that of the four registered trade marks, the only trade mark that has been used is the red Han’s composite mark. Han’s has been in business since 1980.[note: 20]The reported revenue of Han’s Group was about $33,702,690 for the financial year ended June 2012.[note: 21]The large revenue and volume of sales evidence the goodwill in the Han’s trade marks. The Plaintiff’s restaurants also have wide exposure with the chain of 21 outlets operating throughout Singapore.[note: 22]All this is evidence that the general public in Singapore has come to associate the chains which trade under Han’s trade marks as emanating from the same source. Indeed, the Defendant does not contest that there would have been goodwill attached to the Han’s mark. 187    Instead, the Defendant’s objection is of a more technical nature. The Defendant argues that the Plaintiff does not and has never traded or conducted the business of the Han’s restaurants. The Defendant argues that the Plaintiff’s principal activity is investment holding. The business of the Han’s restaurants is actually undertaken by aseparateentity to the Plaintiff, Han’s Café and Cake House Pte Ltd (“the Subsidiary”), which is a wholly-owned subsidiary of the Plaintiff. Further, the Subsidiary is not the owner of either the Han’s trade marks or the “Han’s Café” trade mark. The Defendant, therefore, submits that since goodwill is not in the mark, logo or get-up, but in the carrying on of a business, and since the Plaintiff has never carried on the business of the Han’s restaurants, then the Plaintiff can have no goodwill to speak of. 188    The certificate of registration of the four Han’s trade marks states that the applicant and registered proprietor of the Han’s trade marks is the Plaintiff.[note: 23]The Plaintiff, the Subsidiary, and a second wholly-owned subsidiary of the Plaintiff, Han’s Bakery & Confectionary Pte Ltd, are related companies.[note: 24]The Plaintiff is the parent company. The actual business of running restaurants is conducted by the Subsidiary.[note: 25]While the evidence as to the contractual arrangement between the Plaintiff and the Subsidiary was thin in terms of the licensing of the use of the registered marks, there can be no doubt that the registered marks were used with the consent of the Plaintiff. 189Wadlow’s Law of Passing-Offat paras 3–167 to 3­–168, citingScandecor Development v Scandecor Marketing[1999] FSR 26, observes that ownership of goodwill as between a parent and subsidiary can give rise to problems. In some cases, the trading activity of the subsidiary will belong to the parent. In other cases, it may belong to the subsidiary. Professor Christopher Wadlow rightly states that a proper determination will require an examination of all relevant facts including the terms of any licensing arrangement. 190    On the facts before me, it is apparent that the Han’s trade marks were used by the Subsidiary forthe benefit of the Han’s Group. The group is headed by and under the control of the Plaintiff.  In these circumstances, I am of the view that the goodwill generated by use of the trade marks attaches to the Plaintiff. 191    In coming to this view, the decision of the English Court of Appeal inRevlon Inc and Others v Cripps & Lee Ltd and Others[1980] FSR 85, while not on all fours, is of some help. This was a case where the plaintiffs were members of an international group engaged in making and selling cosmetics and toiletries. The first plaintiff, Revlon Inc, was a Delaware parent company. It made and sold Revlon products in the United States (“USA”). The fourth plaintiff (Revlon International) was a wholly-owned New York company which marketed Revlon products in the United Kingdom (“UK”). The UK Revlon products were manufactured in Wales by the third plaintiff, Revlon Overseas.  Revlon Overseas was a Venezuelan company that was a wholly-owned subsidiary of Revlon Inc. The second plaintiff, Revlon Suisse SA was a wholly-owned subsidiary of Revlon International and was the registered proprietor of the UK Revlon marks. 192    The defendants parallel imported Revlon products (that were made in the USA) into the UK. An action was brought for passing off in the UK. In proceedings for an interlocutory injunction, the main issue before the court was whether there was a serious issue that passing off had been committed in respect of the parallel imports. This depended, in part, on whether the goodwill (reputation) in the Revlon marks was associated with individual members of the Revlon group or the Revlon group as a whole. In the High Court, Dillon J held that while subsidiaries were separate legal entities, in appropriate cases, the law was able to look at the separate legal entities within a group as a single economic entity. At 95, Dillon J cited Lord Denning MR inDHN Food Distributors Ltd v Tower Hamlets London Borough Council[1976] 1 WLR 852, who at 860 said that: This is especially the case when a parent company owns all the shares of the subsidiaries—so much so that it can control every movement of the subsidiaries. These subsidiaries are bound hand and foot to the parent company and must do just what the parent company says. 193    Dillon J’s decision was upheld on appeal, with Templeman LJ commenting at 116 that: … In a group such as the Revlon group, the legal ownership of the trade marks and the registration of users are mere instruments. Revlon Inc orchestrates the business of the group through Revlon Inc subsidiaries for the benefit of Revlon Inc itself. 194    Returning to the case at hand, I am of the view that the goodwill residing in the Han’s trade marks is connected to the Han’s group and is in any case enjoyed by both the Plaintiff and the Subsidiary. In this sense, the goodwill is jointly and severally owned by the Plaintiff and the Subsidiary. 195    This conclusion will not be the first that recognises joint ownership of goodwill in a mark.Wadlow’s Law of Passing-Offdiscusses numerous cases on shared goodwill at para 3–190. These cases deal with the scenario where a product with known defined characteristics are made and sold by a number of traders under a common mark such as Champagne or Advocaat. In these cases, each trader selling goods under that mark has been held to enjoy the several right to sue for passing off. See, for example,J Bollinger v Costa Brava Wine Co Ltd (No 2)[1961] WLR 277 at 281 andErven Warnink BV v J Townend & Sons (Hull) Ltd[1979] AC 731 at 744. While these cases are not on all fours with the matter at hand, they support the view that a “joint” owner of goodwill enjoys the joint and several right to sue for infringement. 196    Establishing ownership of the goodwill, however, is only the first of three requirements for a successful claim in passing off. The Plaintiff must also demonstrate a misrepresentation that creates a likelihood of confusion. As will be seen, I am of the view that the claim for passing off fails on this ground.",
        "Whether the Defendant has made a misrepresentation that creates a likelihood of confusion": "197    The second element of passing off is a misrepresentation by the defendant through use of a similar mark or get-up to that used by the plaintiff and in which goodwill is enjoyed. The misrepresentation must also give rise to the likelihood of confusion that the goods and services of the defendant originate from the same source or are somehow connected to the source of the plaintiff’s goods and services:Novelty v Amanresortsat [77]–[78]. These collectively make up the requirement of deception or its likelihood, that lies “[a]t the heart of passing off”:Kerly’s Law of Trade Marksat para 18–195. 198    I have found above (at [150]–[183]) that there is no likelihood of confusion in respect of registered trade mark infringement. The analysis of confusion in respect of a passing off action, however, is not entirely similar to that in an action for trade mark infringement. This stems from the different interests that the respective claims protect. In the former, the law seeks to protect a trader from the use of deceptive business practices:Susanna Leongat para 35.005. In the latter, the law seeks to protect the proprietary rights conferred on a trader by virtue of the registration of his mark:Staywell v Starwoodat [90]. 199    The court is entitled to take a broader view of the context within which the respective marks are employed in ascertaining whether a likelihood of confusion exists for the passing off tort. It is not constrained to considering factors relating to the similarity of the marks or goods and services. The court is entitled to consider factors extraneous to the marks that would be impermissible in an action for infringement of a registered mark. For example, in a passing off action, a properly worded and prominently displayed disclaimer as to trade connection may protect against a finding of passing off, although the courts may well be suspicious: seeReckitt & Colman Products Ltd v Borden Inc (No 3)[1990] 1 WLR 491 especially at 508–509 per Lord Oliver of Aylmerton, andCornish, Llewelyn & Aplinat para 17–24. 200    In my view, the additional extraneous factors that become relevant in the confusion analysis for passing off reinforce my conclusion above that there is no sufficient likelihood of confusion. 201    First, I accept Dr Lee’s unchallenged evidence that there was no deliberate deception. He explained in his affidavit of evidence-in-chief that he chose the name “HAN” because there was a “long association with [his] family”. HAN was a name used by his father’s Korean electronics company, which Dr Lee was part of the management prior to becoming a restaurateur.[note: 26]HAN was also a good match with the cuisine that the restaurant served—Japanese food with Chinese and Korean elements.[note: 27] 202    Second, only one of the four Han’s trade marks has actually been used as an indicator of origin for the Plaintiff’s goods and services. This is the red Han’s composite mark.[note: 28]I have concluded that of the four registered Han’s trade marks, this composite mark is the least similar, to the point of being dissimilar, to the HAN sign. The fact that the Plaintiff has only carried on business under the red Han’s composite mark, and its marked dissimilarity with the HAN sign, both militate against confusion. 203    Third, the stark difference in the market segments targeted by the Plaintiff and the Defendant is a factor that militates against the likelihood of confusion. The Han’s restaurants are known for being “value for money”, and “affordable and good”; Han’s “price has always been a powerful lure thus making the chain almost unbeatable and recession-proof”.[note: 29]The most expensive item on the Han’s menu in the material placed before the court is the $16.80 “NZ Prime Sirloin Steak with Black Pepper Sause [sic]”.[note: 30]The Defendant’s restaurant, on the other hand, servesomakase- andkaiseki-style sets which are the Japanese equivalents of western fine dining.[note: 31]The Defendant’s restaurant also has a substantial wine and alcohol menu that includes sake, shochu, beer, champagne, and a sizeable selection of red and white wines. 204    Fourth, and this point is closely related to the one above, the fare and dining experience provided by the Plaintiff’s restaurants and the Defendant’s restaurant are very different. This is a factor that reduces the likelihood of confusion. The Plaintiff’s restaurants serve western-influenced Hainanese cuisine and local Chinese “tze char” fare. They also serve sandwiches and pastries. They run on a semi-self-serve model, where a patron places his order and pays, as well as collects his beverages at the till, with his main course brought to him by a server.[note: 32]The Defendant’s restaurant, on the other hand, serves Japanese cuisine that incorporates Chinese and Korean elements. It is built around the qualification, experience and creativity of Chef Arakawa.[note: 33]The dishes are created by Chef Arakawa with an emphasis on taste, texture and presentation, and prepared using choice ingredients from various parts of Japan and other parts of the world.[note: 34] 205    The Plaintiff submits that the Defendant has misrepresented that there is a connection or association between the Plaintiff and the Defendant by using the name “HAN”. The Plaintiff submits that in the food and beverage industry, it is common for investment holding companies like the Plaintiff to provide a wide range of goods and services under different brands which target and cater to different market segments. The Plaintiff says that an average Singaporean will believe that the Plaintiff’s and the Defendant’s establishments are managed by the same corporate group. 206    This argument misses the point. There are many corporate groups (for example, Crystal Jade Culinary Concepts, the Paradise Group and the Privé Group) which own different restaurants with similar names. There are also many corporate groups (for example, the Breadtalk group, the Les Amis group and Unlisted Collection) that own restaurants with vastly different names, concepts and cuisines. The fact that it may be one or the other does not affect the likelihood of confusion. 207    I accordingly conclude that the Defendant, in using the HAN Cuisine of Naniwa name and the HAN sign, did not make a misrepresentation that gave rise to the confusion that the goods and services of the Defendant originate from the same source or are connected to the source of the Plaintiff’s goods and services. 208    In theWagamamacase I discussed earlier, Laddie J also found in favour of passing off. He held that the offending sign, “RAJAMAMA”, bore a strong similarity to “WAGAMAMA”, especially so given the possibility of imperfect recollection. In Laddie J’s view, there was real likelihood that customers would think that RAJAMAMA was an Indian restaurant created by or connected to WAGAMAMA. Even though the décor and food type was very different, the learned judge was of the view that a customer who had not patronised either restaurant before but who had heard of WAGAMAMA might not realise that WAGAMAMA did not provide exotic Indian food when they patronised RAJAMAMA. 209    The facts of the present case, however, are different. The similarity between the red Han’s composite mark and the Defendant’s sign is not as great as inWagamamacase. Not only is the HAN sign a composite mark with a different conceptual feel, I note that the word “Han” was several well-known meanings including as a surname. This, coupled with the significant difference in décor and price, leads me to the conclusion that there is no substantial likelihood of confusion.",
        "Whether the Plaintiff has or is likely to have suffered damage as a consequence of the Defendant’s misrepresentation": "210    In view of my finding above on the misrepresentation issue, the question of damage becomes academic. I will, nonetheless, consider the arguments raised by the Plaintiff for the sake of completeness. The Plaintiff submits that it suffered damage because the Defendant’s restaurant under the name “HAN” has placed a restriction on the Plaintiff’s expansion into the “same high-end market”.[note: 35]It argues that the “notional fair use” of the Plaintiff’s mark extends to the possibility of running a high-class restaurant similar to “HAN”.[note: 36] 211    In my view, the basis of the Plaintiff’s submission is misplaced in principle, and in any event, unsupported by evidence. InNovelty v Amanresorts, the Court of Appeal recognised the head of damage that the Plaintiff is relying on (at [117]): … [A] plaintiff who has established goodwill in one form of commercial activity ... may be entitled to protection from passing offvis-à-visanother form of commercial activity which is a natural expansion of the first. The Court of Appeal nonetheless stressed at [118] the importance of “the close connection which must exist between the established activity and the extended activity”. The Court of Appeal also cautioned at [113] that recognition of loss of licensing opportunity or licensing income should be approached conservatively. 212    Damage to goodwill in a passing off action can arise in a number of ways. Inevitably, the type of damage will depend on the nature of the misrepresentation and resulting likelihood of confusion. In the present case, the Plaintiff’s claim appears to be founded on the view that the misrepresentation has led to confusion such that the public are led to believe there is trade connection between the Plaintiff’s and the Defendant’s establishments. While the damage alleged is unclear, it appears to be founded on the premise that the ability of the Plaintiff to use his own marks in the fine dining field has been adversely affected. 213    There have been cases, such asLego System Aktieselskab and Another v Lego M Lemelstrich Ltd[1983] FSR 155 (“Lego”), where a claim for damage in the sense of loss of licensing opportunity has succeeded. In theLegocase, the plaintiff was the manufacturer of LEGO toy brick construction sets. The defendant manufactured garden equipment and sprinklers under the LEGO brand. In finding that passing off had been committed, Falconer J noted that the plaintiff’s mark was a household name and was widely known for its brightly coloured plastic brick construction sets. The defendant’s garden sprinklers were also brightly coloured. Falconer J held at 194 that the effect of the defendant’s continued use of LEGO in relation to plastic garden equipment would be to destroy that part of the plaintiff’s reputation in its LEGO mark, and the goodwill attached to it for those goods. 214    In deciding whether this form of damage has been suffered as a consequence of passing, followingNovelty v Amanresorts, it is necessary to take into account, amongst others: (a)     the closeness of the fields of activity; (b)     how well-known the plaintiff’s mark has become, whether it is a household name or equivalent; and (c)     whether the Plaintiff has started to use, licence or endorse the use of its marks on other goods or services and the degree of similarity between the plaintiff’s and defendant’s marks. In theLegocase, the plaintiff’s mark and products (brightly coloured plastic toy bricks) were very well known. Even though the fields of activity were different, both concerned use of plastics. The marks were the same. 215    In the present case, the Plaintiff and Defendant both deal in the food and beverage industry. Even though there is a connection between the goods and services (viewed broadly), the market segments provided by the Plaintiff’s restaurants and the Defendant’s restaurant, they are far apart. The HAN sign, while bearing some similarity to the Plaintiff’s marks, is not the same. Indeed, as compared to the Plaintiff’s composite marks (especially the red Han’s composite mark), the marks are so far apart as to be virtually different. At most, as discussed earlier, a customer on seeing the Defendant’s mark might be loosely reminded of the Plaintiff’s mark. It follows that even if the Plaintiff decides to expand into the fine dining sector, it is not immediately apparent why he cannot do so under its own Han’s trade marks in general and the red Han’s composite mark in particular. 216    Further, I am not satisfied that the Plaintiff has proven evidentially that it has suffered damage in the form of being deprived of a real opportunity of moving into the market segment targeted by the Defendant’s restaurant. Mr Han attempted to suggest in cross-examination that the Plaintiff had plans to “go up to ... [a] higher market” in the near future.[note: 37]This appears to me to be an afterthought. It was not pleaded. There was no further elaboration as to how or when this was intended. Mr Han’s bare assertion was uncorroborated by any other evidence. 217    In fact, the evidence placed before the court shows quite the opposite. In the Plaintiff’s “5-year Business Plan” dated 23 August 2013,[note: 38]there is no mention of any plan or intention to expand into a different market segment. Rather, the thrust of the Plaintiff’s plan appears to be an expansion of operations and improvement of efficiency in itsexistingcore competencies: bakery and confectionery production, catering, affordable restaurants, and a training school. There is also mention of overseas expansion into the Southeast Asian market. 218    Mr Han also admitted in cross-examination, albeit rather cryptically, that “at this moment ... I cannot feel the damages”.[note: 39]Although he later qualified his position in re-examination by saying “[a]t this moment, I don’t feel that damages ... are so serious. But ... my concern is ... in the nearer future”, my view is that his evidence is unsatisfactory.[note: 40] 219    I therefore find that, even if there was a misrepresentation resulting in confusion, the Plaintiff has failed to prove that they have, or are likely to suffer any loss. The Plaintiff’s claim in passing off is, therefore, dismissed.",
        "Whether the Plaintiff is liable for making a groundless threat of infringement proceedings against the defendant under s 35 of the TMA": "220    The Defendant counterclaims for damages under s 35 of the TMA, which provides remedies for groundless threats of infringement proceedings. Section 35 applies where a person threatens another with proceedings for infringement of a registered trade mark on groundsother than: (a)     the application of the mark to goods or to material used or intended to be used for labelling or packaging goods; (b)     the importation of goods to which, or to the packaging of which, the mark has been applied; or (c)     the supply of services under the mark. 221    The rationale for the limitation of this provision has been explained as an attempt “to strike a balance between the legitimate interests of the ... trade mark owner in warning infringers, and the right of others not to be vexed by threats without actually being sued”:Kerly’s Law of Trade Marksat para 19–108. The distinction is between a direct warning to the source of infringing goods as opposed to a threat to his customers. 222    The groundless threat that the Defendant relies on is a letter from the Plaintiff’s solicitors to the Defendant’s solicitors dated 5 September 2012. In it, the Plaintiff’s solicitors allege that the Defendant had infringed the Plaintiff’s registered marks. I reproduce the relevant portions of the letter below: [U]sed a ... mark ... similar to our client’s registered trademark and have used the same in relation to goods or services identical with or similar to those for which the trade mark is registered. In doing so, there is a likelihood of confusion on the part of the public. In doing so, you have infringed our Client’s trademark. In the interest of resolving this matter amicably, our clients are requesting that you change the name of Han restaurant and immediately cease and desist from using the name HAN for your food and beverage business. We hope to receive a favourable reply from you within 7 days from the date of this letter failing which our client will have no choice but to avail themselves to the remedies available under the law. ... 223    The threat of proceedings, if any at all, is in relation to infringement arising from the application of the mark to the goods and the supply of services under the mark. Since s 35 of the TMA may only be invoked if the threat of proceedings is for infringement is on groundsother thanthe application of the mark to goods or the supply of services under the mark, the requirements for invoking s 35 are not satisfied on the present facts. The Defendant’s counterclaim is dismissed.",
        "Conclusion": "224    There are no grounds for invalidating the registration of the Han’s trade marks. The Plaintiff’s claim against the Defendant is dismissed. The Defendant’s counterclaim against the Plaintiff is dismissed. I will hear the parties on costs unless they come to an agreement.",
        "ANNEXURE": "[note: 1]Han Choon Fook’s affidavit of evidence-in-chief at paragraph 7. [note: 2]2 AB at 414. [note: 3]Han Choon Fook’s affidavit of evidence-in-chief at paragraph 6. [note: 4]Statement of Claim, Annex A. [note: 5]2 AB at 380–384. [note: 6]2 AB at 388–392. [note: 7]Defendant’s closing submissions at paragraphs 22–23. [note: 8]Plaintiff’s closing submissions at paragraph 50. [note: 9]Shinde Prasad Vasantrao’s expert report at page 12. [note: 10]Notes of Evidence 9 April 2014 at page 28 lines 19–21. [note: 11]Plaintiff’s closing submissions at paragraphs 35–45. [note: 12]Plaintiff’s closing submissions at paragraph 59. [note: 13]Plaintiff’s closing submissions at paragraph 65. [note: 14]Plaintiff’s closing submissions at paragraph 70. [note: 15]Defendant’s closing submissions at paragraphs 40–42. [note: 16]Plaintiff’s closing submissions at paragraphs 76–77. [note: 17]Defendant’s closing submissions at paragraphs 46–47. [note: 18]Notes of Evidence 8 April 2014 at page 127 lines 7–18. [note: 19]Notes of Evidence 8 April 2014 at page 130 lines 18–31. [note: 20]Han Choon Fook’s affidavit of evidence-in-chief at paragraph 6. [note: 21]1 AB at 95. [note: 22]Han Choon Fook’s affidavit of evidence-in-chief at paragraph 7. [note: 23]ABD 32. [note: 24]See Affidavit Han Choon Fook, 26 March 2014. [note: 25]ABD 59. [note: 26]Lee Se Heon’s affidavit of evidence-in-chief at paragraph 32. [note: 27]Lee Se Heon’s affidavit of evidence-in-chief at paragraph 33. [note: 28]Notes of Evidence 8 April 2014 at page 44 line 13–page 45 line 12. [note: 29]Notes of evidence 8 April 2014 at page 40 line 14–page 41 line 15. [note: 30]Notes of Evidence 8 April 2014 at page 95 line 12–page 96 line 4. [note: 31]Affidavit of evidence-in-chief of See Toh Kok Fye at page 21; 2 AB at 377 and 382–383. [note: 32]Affidavit of evidence-in-chief of See Toh Kok Fye at page 24. [note: 33]Affidavit of evidence-in-chief of Lee Se Heon at paragraph 47. [note: 34]Affidavit of evidence-in-chief of See Toh Kok Fye at page 21. [note: 35]Plaintiff’s closing submissions at paragraph 134. [note: 36]Plaintiff’s closing submissions at paragraph 133. [note: 37]Notes of Evidence 8 April 2014 at page 40 lines 31–32. [note: 38]2 AB at 323. [note: 39]Notes of Evidence 8 April 2014 at page 113 line 32. [note: 40]Notes of Evidence 8 April 2014 at page 115 lines 11–14."
    }
}