{
    "case_title": "Haneda Construction & Machinery Pte Ltd\n      v\n      Huttons Asia Pte Ltd and another",
    "ncitation": "[2015] SGHC 294",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "1       This case concerns a somewhat unique commercial warehouse development, Novelty Bizcentre (“the Development”). Not only does it come with freehold title, it is also equipped with facilities such as a swimming pool, a gymnasium, a “chill-out lounge”, an “aromatic garden”, a sun deck, and other attractions which are typically found in high end condominiums. The purchase of warehouse units in the Development was made even more attractive to Haneda Construction & Machinery Pte Ltd (“the plaintiff”) when it was offered a developer discount of 16%. 2       As things transpired, the plaintiff purchased not one, but all the eight remaining warehouse units in the Development. It claimed that it did so not because of the Development’s unique features and discounted price, but because its property agent, T Tanabakiyam (“the 2nd defendant”), had represented to its directors Punitha d/o Vasu Kalingarayar (“Punitha”) and Gopal s/o Muniandy (“Gopal”) on more than one occasion that ready sub-purchasers had been lined up to purchase the eight units from the plaintiff at a premium of at least 19% above the plaintiff’s purchase price. If true, this would have translated into a very handsome profit for the plaintiff, and the 2nd defendant would have earned two rounds of commission from the sale to the plaintiff and the consequent sub-sales. 3       Unfortunately for the plaintiff, one day after it exercised the options to purchase, the Government announced new cooling measures to discourage short-term speculation in properties. These measures included the implementation of seller’s stamp duty payable on all industrial properties which were resold within three years of purchase. While the 2nd defendant did find sub-purchasers who paid the option fees for four of the plaintiff’s warehouse units before the cooling measures were announced, only one of the sub-purchasers eventually completed the sub-sale. In the end, the plaintiff only managed to sub-sell one unit and obtain financing to complete the purchase of two other units. It had to forfeit the monies it paid for the balance five units to the developer. 4       The total potential outlay for the purchase of the eight units was about $10.2m. If the alleged representations made by the 2nd defendant were true, the plaintiff would have made a tidy profit of at least $2m from the sub-sales within a space of less than a month. Despite the significant financial repercussions either way, the alleged representations were not documented in writingat all. Instead, the plaintiff’s case is based solely on oral representations allegedly made by the 2nd defendant. Not unexpectedly, this was hotly contested at the trial. 5       The case started off as a claim in fraudulent misrepresentation. It became somewhat complicated when new lawyers engaged by the plaintiff introduced an additional claim based on an alleged oral contract. What was not appreciated by the plaintiff when the contractual claim was added was that both claims were, at least in part, premised on thesamediscussions which took placed at thesameinitial meeting. Problematically, the terms pleaded in support of the alternative claims narrated different and inconsistent accounts of what was said at thesamediscussion during thesamemeeting. The plaintiff eventually abandoned the contractual claim after the close of the trial. Apart from the self-induced contradictions between the terms of the alleged oral contract and the alleged misrepresentations, this case is unusual in that the plaintiff is relying ondifferent misrepresentationsallegedly made ondifferent occasionswhich, if true, would also have contradicted each other. 6       What then is the effect of the plaintiff’s account of the contradictory representations? Does it prove that the representations were unlikely to have been made, or does it only have a bearing on the question of reliance? Given the conduct of the parties before and after the alleged representations, as well as the various twists, turns and U-turns in the plaintiff’s pleaded case, was it likely, on a balance of probabilities, that the alleged representations were made by the 2nd defendant? The plaintiff also seeks to recover several atypical heads of damages. Can the plaintiff recover the profits it would have earnedifthe fraudulent misrepresentations were true? Can it recover the losses it incurred as a result of the sub-purchasers’ lawful exercise of their rights not to complete the sub-purchases? 7       The alleged representations certainly invite probing questions. If there were truly ready sub-purchasers, why were the sales not concluded directly with the sub-purchasers? Punitha claims that thespecialdeal was offered to her because she had previously helped the 2nd defendant. Furthermore, according to the plaintiff, the 2nd defendant had a financial interest in proceeding on this basis as she would earn two sets of commission. Although it appears that Punitha and the 2nd defendant were once friends, the one, and perhaps only thing that is clear about this case, is that their relationship has since irretrievably broken down.",
        "The parties": "8       The plaintiff is a company in the business of logistics and transportation services. At the material time, Gopal and Punitha, who are husband and wife, were the plaintiff’s directors.[note: 1] 9       The 2nd defendant is a registered real estate salesperson with Huttons Asia Pte Ltd (“the 1st defendant”). The plaintiff’s claim against the 1st defendant is for vicarious liability in respect of the 2nd defendant’s fraudulent misrepresentations. Whilst scant evidence was adduced as to the precise employment relationship between the 1st and 2nd defendant, it is undisputed that on each sale the 2nd defendant transacts, she keeps 90% of the commission earned, while the 1st defendant retains the balance 10%.[note: 2] 10     It is also undisputed that Punitha and the 2nd defendant were socially acquainted since 2005.[note: 3]The evidence suggests that they became rather good friends over time. Prior to the purchase of the eight warehouse units which are the subject of the present dispute, Punitha and Gopal had purchased a number of properties through the 2nd defendant. These included four units at Nusajaya Square in Iskandar, Johor Bahru, Malaysia bought in mid-2012[note: 4], and four units at Encorp Marina @ Puteri Harbour in Malaysia bought in August 2012[note: 5]. At trial, evidence was given that of the eight units in Nusajaya Square and Encorp Marina @ Puteri Harbour, four were held in Punitha’s or Gopal’s names on trust for the 2nd defendant.[note: 6]The exact trust arrangement between the parties was not explained during the trial probably because it is strictly not relevant to the present dispute. However, it is at least clear that it is not uncommon for Punitha and Gopal to purchase multiple units in the same development.",
        "The plaintiff’s claim": "11     When the statement of claim was first filed on 28 January 2014, the plaintiff’s claim was only in tort for the losses it suffered as a result of its reliance on the 2nd defendant’s fraudulent misrepresentations. The plaintiff alleged that on 12 December 2012, the 2nd defendant represented that she “had ready sub-purchasers for all 8 warehouse properties” and that “the sub-sale price would be at least S$1,193.00 per square feet” (“the initial representations”).[note: 7]Subsequently, on or about 24 December 2012, the 2nd defendant allegedly produced four cheques from sub-purchasers for four of the eight warehouse units and further represented at the same time that she “would procure sub-purchasers” for the remaining four warehouse units (“the further representations”). 12     The statement of claim was amended on 18 February 2014, but the amendments only pertained to correcting the identity of the parties referred to in the statement of claim where necessary. 13     On 12 January 2015, the statement of claim was significantly revised and a whole new cause of action in contract was introduced. The contractual claim became theprimarycause of action. The plaintiff had then just instructed new lawyers. Substantial changes to the plaintiff’s account of the events were made in Statement of Claim (Amendment No 2): (a)     First, in addition to claiming that the initial representations about “ready sub-purchasers” were made on 12 December 2012, the plaintiff claimed that an oral agreement was reached on thesame date(ie, 12 December 2012) where the 2nd defendant allegedly promised that she “will procuresub-purchasers for the 8 warehouse properties at the price of, at least, S$1,193/- per square footby the time the Options to Purchase were to be exercised” [emphasis added] if the plaintiff agreed to purchase the said units (“the agreement”).[note: 8] (b)     Second, while the plaintiff maintained that the further representations were made on 24 December 2012, the plaintiff added that on or about 8 January 2013[note: 9], a further agreement was entered into under which the 2nd defendant allegedly agreed that she “will procuresub-purchasers for the 8 warehouse properties at the price of, at least, S$1,193/- per square footby the time the purchase of the 8 warehouse properties was to be completed” [emphasis added] (“further agreement”).[note: 10] 14     The plaintiff made a further revision to its statement of claim on 27 March 2015. In Statement of Claim (Amendment No 3), the plaintiff maintained its separate causes of action in tort and contract. However, perhaps recognising (belatedly) the inconsistencies in its pleaded claims, the plaintiff replaced all references to the 2nd defendant stating that she “will procure” sub-purchasers with an assertion that the 2nd defendant had represented that she had “ready sub-purchasers”. The terms of the agreement, further representations, and further agreement respectively were likewise amended to reflect the same amendment. 15     New details were also added in Statement of Claim (Amendment No 3). The plaintiff added that as part of the initial representations, the 2nd defendant had also said that the warehouse units were to be sold to the sub-purchasersby the time the options to purchase were to be exercised.[note: 11]This detail was not part of the initial representations in the earlier versions of the statement of claim. The plaintiff also added that the 2nd defendant had on 24 December 2012 represented (as part of the further representations) that the plaintiff had “no choice but to exercise the Options to Purchase” since Punitha and Gopal had, by then, accepted the four cheques from the sub-purchasers.[note: 12] 16     On the first day of trial, I asked Mr Christopher Daniel (“Mr Daniel”), counsel for the plaintiff, to identify the date of completion, which was pleaded as part of the further agreement (see [13(b)] above). When Mr Daniel informed the court that the date of completion is 1 September 2018, it became apparent to the plaintiff that there were serious problems with its contractual claim given that on its own pleaded case, performance was not due until 1 September 2018. Eventually, after the close of the trial, Mr Daniel informed the court by letter dated 12 August 2015 that the plaintiff had decided to abandon its contractual claim. 17     While the plaintiff might well have abandoned its contractual claim, the pleaded oral agreement and further agreement nonetheless represent the plaintiff’s version of the facts, and must be taken into account in assessing the overall credibility of the plaintiff’s case. 18     As it stands, the only claim before the court is the plaintiff’s claim in fraudulent misrepresentation, which was the original claim brought by the plaintiff. Therefore, after several rounds of amendments, the plaintiff is back to square one, or perhapsminus onegiven the several rounds of inconsistent amendments to its statement of claim. 19     The plaintiff pleads that it relied on the initial representationsto pay the option feesfor the eight warehouse units and it relied on the further representationsto exercise the options to purchase. Although its reliance on the initial and further representations was ostensibly for different purposes, they ultimately related to the same transactions,ie, the purchase of the eight warehouse units. As such, I will examine them collectively and draw distinctions between them where appropriate. 20     The plaintiff’s claim for damages falls under several heads.[note: 13] (a)     In respect of the five units that the plaintiff forfeited, the plaintiff claims: (i)       $1,244,376 being the sum forfeited by the developer; (ii)       $76,099.69 for interest charged by the developer for late settlement; (iii)       Loss of profit of $1,224,826; and (iv)       $10,613.50 for legal fees incurred; (v)       Less the sum of $227,350 forfeited by the plaintiff from the three sub-purchasers who decided not to exercise the options to purchase. (b)     In respect of the two units which the plaintiff completed the purchase, it claims: (i)       Interest of $5,335.59 charged by the developer for late settlement; (ii)       Loss of profit of $513,241; and (iii)       Loss of alternative use of money and loss of anticipated profits (to be quantified). (c)     The plaintiff also claims for the losses arising from payments made towards loans and mortgages taken out to finance the purchase of the warehouse units, and for the late interest charges of RM14,423.60 incurred on Punitha and/or Gopal’s Malaysian properties. It claims that these charges were incurred because of the financial difficulties caused by its purchase of the eight warehouse units.[note: 14] These heads of claim will be separately examined below. 21     The plaintiff also claimed damages pursuant to s 2 of the Misrepresentation Act (Cap 390, 1994 Rev Ed). However, Mr Daniel did not pursue this in his oral closing submissions. 22     Before examining the issues that arise for consideration, a few observations about the plaintiff’s pleaded claim are apposite to set the context for a proper assessment of its claim. It is clear that the plaintiff’s case on the precise content of the representations allegedly made by the 2nd defendant has evolved quite significantly. While it is understandable and not unusual for amendments to be introduced to pleadings following a change of lawyers, the factual substratum of the oral representations alleged by the plaintiff should remain largely unchanged. Here, it underwent quite significant and contradictory changes on a number of occasions. 23     First, based on the plaintiff’s evolving case, it is uncertain whether the 2nd defendant had represented that she had “ready sub-purchasers” or that she “will procure” sub-purchasers. 24     The distinction between these two representations is plain and obvious – the former is a representation of an existing fact, while the latter is a promise of future conduct which is not actionable under the tort of misrepresentation (seeTan Chin Seng and others v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [20] and [21]). The fact that constant references were made to the latter account of the representations in previous versions of the statement of claim castsseriousdoubt on the veracity of the plaintiff’s case as set out in Statement of Claim (Amendment No 3) that the 2nd defendant had consistently represented that she had “ready sub-purchasers”. 25     Second, it is also troubling, particularly in the context of a case based on oral representations, that key details of the alleged representations were not pleaded from the start but were instead successively added by way of a series of amendments to the statement of claim. 26     In my view, in assessing the factual veracity of a plaintiff’s claim, particularly one based on oral representations, the court is entitled to examine the previous versions of the pleadings, and draw the necessary inferences, if any, from the significant shifts in or additions to the factual accounts narrated therein. The implications of this will be explored in greater detail below. 27     In this case, it is common ground thatifthe initial and/or further representations were in fact made by the 2nd defendant, there is no question that they were false and fraudulent, at least in relation to the four units for which sub-purchasers were never found. Their alleged falsity in relation to the four units for which sub-purchasers were found but who subsequently elected lawfully not to exercise the options to purchase will be examined in relation to the losses allegedly suffered by the plaintiff.",
        "Representations – were they made?": "28     InGoldrich Venture Pte Ltd and another v Halcyon Offshore Pte Ltd[2015] 3 SLR 990 at [84] (“Goldrich Venture”), I considered the proper approach in assessing the veracity of a claim based on alleged oral representations in circumstances where the main (if not only) evidence of such oral representations is the testimony of the plaintiff to whom the oral representations were allegedly made. In my view, a witness’s account of the alleged oral representations may be evaluated for itsinternal consistency(ie, the coherence of his testimony throughout trial) and itsexternal consistency(ie, the consistency between his evidence and extrinsic evidence such as the behaviour of the parties and the documentary evidence on record). Needless to say, due consideration should also be given to a witness’s behaviour and demeanour on the witness stand (Sandz Solutions (Singapore) Pte Ltd and others v Strategic Worldwide Assets Ltd and others[2014] 3 SLR 562 at [46]). 29     It also bears mention that a more rigorous forensic lens should be applied to claims grounded in fraudulent misrepresentation (Tang Yoke Kheng (trading as Niklex Supply Co) v Lek Benedict and others[2005] 3 SLR(R) 263 at [14] andGoldrich Ventureat [82] and [83]). Given the gravity of both the nature and consequences of an allegation of fraud, a relatively high standard of proof is imposed on the party alleging fraud (Wee Chiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 at [30] and [31]). 30     In the present case, the key factual claim that underpins the plaintiff’s case is that the oral representations about ready sub-purchasers were made fraudulently by the 2nd defendant to Punitha and/or Gopal. Consequently, the plaintiff’s case largely rests on the testimony of Punitha and Gopal. Notably, as Mr K Anparasan (“Mr Anparasan”), counsel for the defendants, submits, there is apaucity of documentary evidenceto prove the representations.[note: 15]As I observed inGoldrich Ventureat [90], where the subject matter was “neither trivial nor casual in nature such that written communication is not usually expected … the absence of documentary evidence to support the alleged representations [would] be a glaring omission”. In the present case, the plaintiff’s investment in the eight warehouse units would have amounted to more than $10m if the purchases were completed. The absence of anywritten evidence or correspondencesupporting the representations or promises by the 2nd defendant about ready sub-purchasers is inexplicable, to say the least. 31     The gravity of the absence of written evidence must be viewed with reference to the impact of the representations on the plaintiff – in general, the greater the impact, the more inexplicable will be the absence of written evidence to support the alleged representations. It is important to bear in mind that according to the plaintiff, it was induced by the initial representations to pay the option fees for the eight warehouse units. The plaintiff’s financial exposure was then only $512,022. However, the further representations allegedly induced the plaintiff toexercisethe eight options, which exposed the plaintiff to a financial commitment in excess of $10m. Viewed in this light, it is inconceivable that the plaintiff would have proceeded to exercise the eight options on the basis of the 2nd defendant’s oral representations without obtaining anything in writing from her particularly since, by then, according to the plaintiff’s case, she had already failed to deliver on both the initial and further representations. 32     It bears mention that it is Gopal’s own evidence that the plaintiff “would not have entered into any such transactionwithout being surethat there would have been ready sub-purchasers for the properties” [emphasis added]. Yet, the plaintiff did precisely the contrary. When the plaintiff exercised the options to purchase all eight units on 10 January 2013, if the plaintiff’s case is to be believed, the 2nd defendant hadalready failedto deliver on both the initial and further representations. Therefore, when the plaintiff exercised the options to purchase, it would be fair to say that it must have beenfar from being surethat the 2nd defendant’s representations were true. Moreover, given that the 2nd defendant had only given the plaintiff cheques for four of the warehouse units, it would have been illogical for the 2nd defendant to have said, and for the plaintiff to have believed, that it had no choice but to exercise theeightoptions to purchase. In my view, the fact that the plaintiff nonetheless exercised all eight options irresistibly suggests that it was motivated to do so by its own investment decision. The incoherence of the plaintiff’s account, as demonstrated by the points made above, strongly suggests that the alleged representations were not in fact made by the 2nd defendant. This becomes clearer when the objective evidence is examined below. 33     It is also telling that there was no written protest whatsoever from the plaintiff, Punitha or Gopal about the failure of the 2nd defendant to deliver on either the initial or the further representations until the commencement of the present suit on 28 January 2014, more than a year after the representations were allegedly made.",
        "Content and nature of the representations": "34     I begin by expressing some misgivings about the content and nature of the alleged initial and further representations. Taking the initial representations at face value, the representations do not make sense. The 2nd defendant is alleged to have represented to Punitha and/or Gopal on 12 December 2012 that shehad ready sub-purchasersfor the plaintiff. However, as at 12 December 2012, the plaintiff had not yet decided to purchase the warehouse units. So, who were the “ready sub-purchasers” buying from? According to Punitha, the 2nd defendant provided the names of some of the sub-purchasers on 12 December 2012.[note: 16]But Gopal, whose attendance at this meeting is disputed, denies that the identities of the sub-purchasers were revealed.[note: 17]Punitha’s evidence, which is at odds with Gopal’s, still does not address the fundamental gap – who were the sub-purchasers buying from? They certainly could not have agreed to buy the warehouse units from theplaintiffas at 12 December 2012, and it is unlikely that a buyer would have committed to sub-purchasing the warehouse units without knowing the identity of the seller. 35     The plaintiff also claims that the further representations were made on or about 24 December 2012. The 2nd defendant allegedly represented that shehadready sub-purchasers for the remaining four warehouse units (by then, the 2nd defendant had delivered four cheques for the sub-purchase of four of the eight warehouse units). In Punitha’s affidavit of evidence in chief (“AEIC”)[note: 18], she provided more details of the further representations. She asserted that the 2nd defendant had represented that shewould procurethe remaining sub-purchasers “within the next few days”. This is in line with the further and better particulars (“F&BPs”) initially provided by the plaintiff in respect of the further representations, wherein it was stated,inter alia, that the 2nd defendant had said “give me [a] few more days to give you the balance cheques for the other units”.[note: 19] 36     Again, the further representations do not appear to make any sense. First, if the 2nd defendant alreadyhadsub-purchasers for the remaining warehouse units by 24 December 2012, why were the options fees from those sub-purchasers not produced to the plaintiff since, by definition, the sub-purchasers would already have agreed to buy the warehouse units? No reason has been offered. More significantly, on their own account of events, neither Punitha nor Gopal sought any such obvious clarification from the 2nd defendant. I would have expected them to do so if indeed the further representations were made. Second, according to Punitha’s evidence and the plaintiff’s pleaded case, the option fees from the remaining sub-purchasers were supposed to be delivered “within the next few days”from 24 December 2012. Even allowing for one week, which is a generous view of “a few days”, the option fees from the sub-purchasers should have been delivered to the plaintiff latest by the end of the yearie, 31 December 2012. Yet, when that date came and left, not only did the plaintiff not complain in writing, it proceeded to exercise the options to purchaseall eightwarehouse units on 10 January 2013, thereby committing itself to a financial obligation in excess of $10m. Initially, Punitha claimed to have issued anoralultimatum to the 2nd defendant on 8 January 2013, which is already a curious way to provide an ultimatum given the seriousness of the fraudulent misrepresentations both in terms of its nature and impact on the plaintiff. However, Punitha eventually conceded on the stand that no such ultimatum was in fact issued contrary to her initial oral testimony and AEIC (see [40(b)] below). 37     So, even before examining the internal and external inconsistencies of the plaintiff’s evidence, at face value, the plaintiff’s account of the events surrounding the initial and further representations does not make any sense. Punitha and Gopal are both savvy and experienced property investors. They are also both well-educated with university degrees. I find it incredulous that they would have relied on such contradictory and meaningless representations without seeking any substantiation and without any written protest when the representations did not hold true. Just to be clear, these observations are not made to show that there was no reliance on the representations by the plaintiffper se, but rather to demonstrate that in all likelihood, the representations were not made at all. 38     Looking at the evidence as a whole, it is unlikely that the 2nd defendant would have represented that she had secured ready sub-purchasers to buy the warehouse units from the plaintiff should the plaintiff decide to buy the units. It is more likely that the plaintiff wasencouragedto purchase the warehouse units given the unique features and its discounted price. Indeed, it is telling that when giving evidence, Punitha had, on one occasion, described the sub-purchasers as “interestedbuyers” rather than “ready buyers”.[note: 20]At most, the 2nd defendant’s representations would have related to an event in the future,ie, that the 2nd defendantwill assistin procuring sub-purchasers for the plaintiffs in the event the plaintiff decides to go ahead with the purchases. After all, this is entirely in line with Punitha’s police report against the 2nd defendant (which will be examined at [42] and [43] below) as well as the plaintiff’s initial pleaded case which was swiftly amended upon the plaintiff’s realisation that it would undermine its claim.",
        "Internal consistency": "39     In my view, both the plaintiff’s case as a whole, as well as Punitha’s own testimony, reveals a substantial degree ofinternal inconsistency. The plaintiff’s evolving pleadings is an obvious starting point. While the statement of claimas it stands nowasserts that the 2nd defendant had represented that she hadready sub-purchasers, I have already highlighted the fact that the plaintiff’s pleadings, as it evolved, had at several points asserted a representation which was quite different,ie, that the 2nd defendant had instead said that she “will procure” sub-purchasers (see [13], [14] and [23] above). It bears mentioning that, at the very least, if the 2nd defendant had stated at any point that she “will procure” sub-purchasers, Punitha and Gopal must have been alerted to the fact that her representation that she “had ready sub-purchasers” could not have been true or accurate. It will also cast doubt on whether the representation that she had “ready sub-purchasers” was ever made. 40     Apart from the seriously inconsistent pleadings, there are several internal inconsistencies in Punitha’s evidence: (a)     In her AEIC (at para 9), Punitha asserts that the initial representations made on 12 December 2012 were partly in writing and partly oral. However this contradicts the F&BPs filed by the plaintiff on 25 March 2015, where the plaintiff states without qualification that the representations were made orally, and not in writing. This is also inconsistent with Punitha’s testimony at trial that the representations were never reduced into writing.[note: 21] (b)     In her AEICs and initial oral testimony, Punitha claimed to have issuedtwoultimatums to the 2nd defendant sometime on 20 December 2012 and sometime on 8 January 2013 demanding that she produced the sub-purchasers as represented.[note: 22]However, the statement of claim only referred to one ultimatum.[note: 23]When further questioned about the alleged ultimatums, Punitha changed her narrative and claimed that the ultimatum was never given on 8 January 2013.[note: 24] (c)     While Punitha initially stated in her AEIC that a friendly loan of $50,000 was extended to the 2nd defendant sometime in May 2013[note: 25], she subsequently amended her evidence at trial and explained that the loan was extended sometime between 10 and 15 January 2013.[note: 26]Irrespective of which of the two dates the loan was extended, it is clear that either date would have post-dated the representations. More importantly, by either of the two dates, the plaintiff would have known that the 2nd defendant had failed to deliver on her representations, if they were made. In such circumstances, it is indeed incongruous that Punitha would have extended a friendly loan of $50,000 to the 2nd defendant, someone who had misled the plaintiff into a potentially financially ruinous transaction. This loan was also the subject matter of Punitha’s complaint to a manager of the 1st defendant, Mr Lim Keng Chiang (also known as “Casey Lim”), which will be separately examined below as it has a material bearing on the credibility of the plaintiff’s case.",
        "External consistency": "41     Next, I examine whether the extrinsic evidence supports or contradicts the plaintiff’s case. Police report 42     First, a police report was filed by Punitha on 12 August 2013. In the report, Punitha complained about the 2nd defendant harassing her for the commission from the sub-sale of unit #02-05 to Shark Engineering Pte Ltd (one of the eight warehouse units).[note: 27]In the police report, Punitha stated that “[a]s an agreement for purchasing the units [in the Development] through her, [the 2nd defendant] wouldassist meto sell of [sic] the units” [emphasis added]. When Punitha was confronted with her police report in cross-examination, she testified “I would have … used the wrong word because I was---at that time, I was not consulting any lawyers or whatever”.[note: 28]Punitha claimed that she “was not really concentrating on the top portion [ie, the portion where she described the agreement to assist] because [her] main concern was to … get a report that [the 2nd defendant] was threatening [her]”.[note: 29]Mr Daniel’s only submission on this apparent inconsistency is that lay people may not be clear in their choice of words. 43     In my view, if the 2nd defendant had indeed misrepresented to Punitha that she had “ready sub-purchasers” for the eight warehouse units, it would be entirely inconsistent for Punitha to describe her “agreement” as an agreement for the 2nd defendant to renderassistanceto sell off the warehouse units. Punitha would have taken advantage of the opportunity to also complain about the 2nd defendant’smisrepresentations. Punitha appeared to me to be a self-assured person who would not hesitate to speak her mind if something was not properly done. In a much less serious circumstance, she rebuked the 2nd defendant for banking in certain cheques for the Nusajaya units despite her instructions to the contrary.[note: 30]If the misrepresentations were in fact made, they would have been fraudulent. In other words, by the plaintiff’s case, the 2nd defendant had blatantly lied to Punitha and Gopal to earn commission for herself. Yet, there was no mention of these blatant lies at all in the police report. Even without the assistance of a lawyer, it is clear to me that Punitha appreciates the patent difference between an agreement to “assist” in selling the warehouse units, and a misrepresentation or promise that the 2nd defendant had “ready sub-purchasers”. Meeting with Casey Lim 44     Second, Punitha contacted Casey Lim to complain about the 2nd defendant. Although there is no dispute that a meeting did take place at Punitha’s home on 19 June 2013 and that the 2nd defendant and Casey Lim were present, thepurposeof the meeting was disputed. Punitha claims that she called the meeting to complain about the misrepresentations made by the 2nd defendant in relation to the ready sub-purchasers, but according to both the 2nd defendant and Casey Lim, Punitha called the meeting to complain about the outstanding loan owing by the 2nd defendant. After examining the evidence, it is clear that the meeting had nothing to do with the alleged misrepresentations. As Mr Anparasan points out, it is very telling that the meeting was not pleaded in the statement of claim. If Punitha did indeed call the meeting to complain about the 2nd defendant’s alleged misrepresentations, I would have expected it to be pleaded. This seems to me to be yet another afterthought of the plaintiff to shore up an ill-conceived claim. 45     It is undisputed that at the end of the meeting, the following note, at the suggestion of Casey Lim, was handwritten and signed by the 2nd defendant: 19/06/03 Attn: Mdm Punitha D/o Vasu Kalingarayar 1C Haig Avenue I have only received 3 signed copies of option to purchase for Novelty Bizcentre units #02-05, #02-04 and #03-07. There are no other options holding in my possession from Punitha D/o Vasu Kalingarajar. Yours faithfully, <2nd Defendant signed> T. Tanabakiyam SXXXXXXXF  Witnessed by Casey Lim <Casey Lim signed> 46     The note only refers to the 2nd defendant’s confirmation that she “only received 3 signed copies of option to purchase for Novelty Bizcentre units #02-05, #02-04 and #03-07”. I agree with Mr Anparasan that Punitha would have insisted on some mention of the 2nd defendant’s misrepresentations about the ready sub-purchasers for alleightwarehouse units if Punitha’s primary grievance at the meeting was the alleged misrepresentations.[note: 31]The impression conveyed by the note is that all parties were content to conclude the meeting on the basis of the 2nd defendant’s confirmation that she had only received “3 signed copies of option to purchase for Novelty Bizcentre units #02-05, #02-04 and #03-07”. Indeed, nowhere does Punitha assert otherwise. It is also worth mentioning that this note was exhibited in Punitha’s own AEIC without any qualification or protest that it did not accurately reflect the discussions at the meeting. Email and text messages 47     Email and text messages that Punitha had sent to Casey Lim shortly after the meeting are also inconsistent with the plaintiff’s case that Punitha had complained about the misrepresentations allegedly made by the 2nd defendant. (a)     On 20 June 2013 at 4.14pm, a day after the meeting, Punitha sent Casey Lim an email which I reproduce in full: Dear Mr. Casey, Thank you very much for your time spent at my home from 11.30am to 2pm together with your fellow agent Ms. Shanti. Indeed, appreciate your involvement to settle the issues between your fellow agent Ms. Shanti and myself amicably. I hope your effort will not go in vein. The issue which was still unsettled is date of exercise of the option to purchase for unit number #02-04 and #03-07 of Novelty Biz Centre. After the discussion with my husband the best we could extend the exercise date is on or by 31st August 2013 with the clause mentioning unless the developer does not call for/take back the units for non payment. Please prepare the OTP accordingly and return the others as discussed yesterday. (b)     On 24 and 25 July 2013, there was an exchange of Short Message Service (“SMS”) correspondence between the parties[note: 32]: Punitha:Hi Casey, just to confirm you Shanti’s cheque of $30k was cleared on Monday. Thank youMr Lim:Welcome. I presume everything settled right?Punitha:YesMr Lim:Thank you.   48     The reference to “Shanti’s cheque of $30k” concerned the outstanding loan due from the 2nd defendant to Punitha. This clearly supports the defendants’ case that Punitha called the meeting to complain about the loan. I note that while this SMS exchange was exhibited in Punitha’s AEIC, only the first two messages quoted above were reproduced. Her confirmation that everything was settled was left out.[note: 33]No reasonable explanation was offered to explain why Punitha only exhibited the first half of the SMS exchange in her AEIC. In my view, it is likely that the second half of the SMS exchange was deliberately omitted as it would severely undermine the plaintiff’s case. Even if the omission was not deliberate, Punitha nonethelesspositively confirmedto Casey Lim that everything with the 2nd defendant had been settled and expressed gratitude rather than unhappiness for his assistance in resolving the issues with the 2nd defendant. I therefore find that contrary to the plaintiff’s case, the purpose of the meeting was not to discuss the 2nd defendant’s misrepresentations, but rather, to discuss the outstanding loan the 2nd defendant owed Punitha and to sort out the sub-purchasers which the 2nd defendant had already procured for the plaintiff. Plaintiff sourcing for financing 49     Further, it is not disputed that Punitha began sourcing for financing in late December 2012.[note: 34]According to the plaintiff, the 2nd defendant had represented that the eight warehouse units would be sold to the sub-purchasers “by the time the Options to Purchase were to be exercised”,ie, 10 January 2013.[note: 35]If this were true, it would make no sense for the plaintiff to have been looking for financing in late December 2012 because it would still have been operating under the belief that the units would be sub-sold by the time the next stage of payment was due. In fact, Punitha’s evidence is that the 2nd defendant had told her that she would get back all her money by the time the options were to be exercised and hence she “[did] not think about finding out from any banks or any financial institute or getting funds prepared”.[note: 36]The fact that financing was being sourced from late December 2012, even before the 2nd defendant was expected to deliver on her representations, suggests that the plaintiff contemplated that it may have to exercise the options to preserve its investment in the eight warehouse units. Such a step is plainly inconsistent with the pleaded representations. When questioned, Punitha claims that the 2nd defendant had told her that there may be some delay in getting the other four cheques, and that she therefore had to prepare funds to exercise the options.[note: 37]Not only was this alleged delay not pleaded, it is plainly inconsistent with the pleaded representations. Appointing other property agents 50     Finally, it is undisputed that sometime in February 2013, Punitha had asked the 2nd defendant for permission to approach another property agent of the 1st defendant, Anna, to sell the warehouse units, and that the 2nd defendant did not object to this.[note: 38]In my view, this fact does not sit comfortably with the plaintiff’s allegations about the 2nd defendant’s misrepresentations. If the 2nd defendant had indeed promised but failed to deliver the “ready sub-purchasers” to the plaintiff, there is no conceivable reason for Punitha to seek the 2nd defendant’sconsentbefore approaching another property agent within the same company. I would have expected the plaintiff to put the 2nd defendant on notice for failing to deliver on her representations instead. Evidence the plaintiff relies on 51     The plaintiff sought to rely on several purported pieces of objective evidence to prove its case: (a) a handwritten note by the 2nd defendant; (b) the advertisements placed in the Strait Times and Tamil Murasu for sale of some units in the Development; (c) an SMS from Punitha dated 12 July 2013 to the 2nd defendant; and (d) the four cheques from sub-purchasers which the 2nd defendant managed to obtain for the plaintiff within a short span of time (on or about 24 or 26 December 2012). 52     In my view, none of them furthers the plaintiff’s case. In its closing submissions, the plaintiff ranked the handwritten note as its main supporting evidence. The plaintiff’s criticism that the 2nd defendant did not address the handwritten note in her AEIC is completely misplaced. Not only was the handwritten note not pleaded to support the plaintiff’s case, its pleadings were in fact to the contrary. The plaintiff categorically asserted in its F&BPs that the representations were made “orally”. If it was evidenced in writing by the handwritten note, it would and should have been pleaded. Moreover, while the handwritten note was exhibited in Punitha’s AEIC, it was never expressly referred to and discussed in the main body of the AEIC. As such, little, if anything at all, can be made of the fact that the 2nd defendant did not comment on the handwritten note in her AEIC until it was raised in cross-examination. 53     The handwritten note contained various scribbles and is, unsurprisingly, not dated. On its face, it does not contain any representation that the 2nd defendant hasready sub-purchasersfor the plaintiff’s eight warehouse units. Instead, the handwritten note only mentionsfourunits and therefore cannot possibly support the plaintiff’s allegation that representations about ready sub-purchasers for alleightunits were made. Further, Punitha’s and Gopal’s evidence that the handwritten note was written at the 12 December 2012 meeting is not borne out by the handwritten note itself. Significantly, the handwritten note referred to unit “02-05”, alongside the figure “1250”. This is consistent with the fact that unit #02-05 was sold to Shark Engineering Pte Ltd at $1,250 per square foot, while the other three units were sold at $1,193 per square foot. Precise knowledge of such figures would only have been available to the partiesafterthe sub-sale cheques for four of the warehouse units were obtained on or about 24 or 26 December 2012. The listing of the four units (though I note that one was stated as “03-03” rather than “03-05” which I accept was a mistake) and their corresponding sub-sale price is consistent with the 2nd defendant’s account that she was recapping what had taken place so far as at mid to end February 2013.[note: 39]Gopal sought to address these observations by suggesting that the same handwritten note (which was allegedly first written on 12 December 2012) was used in subsequent meetings when additional updated comments were added. Not only is this a contrived explanation, it seeks to elevate the status of this otherwise innocuous note to a key document to support the initial representations. If so, there would be no reason why it was not referred to in the statement of claim, especially since the plaintiff is not averse to amending its claimrepeatedly. 54     The plaintiff also relied on the advertisements to support its case.[note: 40]Mr Daniel did identify some inconsistencies in the 2nd defendant’s evidence on the advertisements – the advertisement in the Strait Times included factory units which the plaintiff did not buy, and the advertisement in the Tamil Murasu was only fortwowarehouse units even though the plaintiff hadfourunsold units. From this, it seems clear that the advertisements are unlikely to have been placed at the request of Punitha for the plaintiff’s four warehouse units contrary to the 2nd defendant’s evidence. However, I do not see how this helps the plaintiff. The fact that I reject the 2nd defendant’s assertion that the advertisements were placed on behalf of Punitha does not help to prove the plaintiff’s case. 55     Mr Daniel also relied on an SMS which Punitha sent to the 2nd defendant on 12 July 2013 in which she enquired – “what is happening to yr buyers”. The 2nd defendant testified that she did not reply to PunithaviaSMS, but called her instead to clarify what she was talking about. Under cross-examination, the 2nd defendant claimed that Punitha was referring to Shark Engineering Pte Ltd, one of the four sub-purchasers.[note: 41]However, this is inconsistent with para 60 of the 2nd defendant’s AEIC where she stated that she did not reply to the SMS and that the SMS was a reference to “the Selvakumars and Dr Raj”, the other sub-purchasers.[note: 42]In my view, while the 2nd defendant may have provided inconsistent evidence in relation to the SMS, this does not further the plaintiff’s case that the 2nd defendant had made the initial representations to Punitha and Gopal. It should be borne in mind that by 12 July 2013, the 2nd defendant had already found a few sub-purchasers for the plaintiff. Therefore, the fact that Punitha had asked the 2nd defendant about “[her] buyers” could be explained as a query about the status of the sub-purchasers which the 2nd defendant had already found for the plaintiff. It should be borne in mind that at this time, the sub-purchasers were still considering whether to exercise the options.[note: 43]Hence, Punitha’s query about the status of these sub-purchasers is understandable. 56     Finally, the fact that the 2nd defendant produced four cheques in a span of two weeks (either on 24 or 26 December 2012 – nothing turns on the different dates) does not in any way prove that she had made the initial representations to Punitha and/or Gopal on 10 or 12 December 2012. If anything, it might actually undermine the plaintiff’s case. First, it feeds into my earlier observation that the sub-purchasers could not have beenreadyto buy the units from the plaintiff before the plaintiff had decided to purchase the eight warehouse units. Hence, it would make no sense for the 2nd defendant to represent that shehad ready sub-purchasersto buy the same warehouse units from the plaintiff when the parties met on 10 or 12 December 2012. Second, it supports the 2nd defendant’s evidence that she started looking for sub-purchasersafterthe plaintiff had paid the option fees. According to the 2nd defendant, she met Mrs Kumar, one of the sub-purchasers, on 19 December 2012 after the plaintiff had decided to proceed with the purchase of the eight warehouse units.[note: 44]Mr Daniel submits this is not true since the 2nd defendant did not mention this meeting with Mrs Kumar in her AEIC. But this is amply supported by the fact that the cheques from the sub-purchasers (including Mrs Kumar’s) allpost-datedthe meeting of 12 December 2012. The plaintiff’s submission that assertions made by the 2nd defendant under cross-examination cannot be true since they were not stated in the AEIC is a very feeble one (which features regularly and prominently in the plaintiff’s closing submissions) especially since there are numerous glaring gaps, contradictions and inexplicable deficiencies in the plaintiff’s own evidence. It must not be overlooked that the plaintiff bears the burden of proof and in that respect, I find the plaintiff to be woefully off the mark. 57     The speed at which the 2nd defendant was able to find four sub-purchasers does not prove or support the plaintiff’s case. After all, this is a unique commercial development and all the remaining eight warehouse units had been snapped by the plaintiff. In any event, the 2nd defendant has every financial incentive to secure sub-purchasers since she earns a commission on every sale she makes. While it may be unusual that the 2nd defendant managed to sub-sell the four units so quickly, and while it may even be possible that the 2nd defendant had sub-purchasers in mind before meeting Punitha and Gopal on 10 or 12 December 2012, this does not prove that she had made the initial representations to Punitha and Gopal that shehad ready sub-purchasersforalleight warehouse units when they met on 10 or 12 December 2012.",
        "Conclusion": "58     I therefore find that the plaintiff has failed to discharge its burden of proving that the 2nd defendant had made either the initial or further representations as pleaded in Statement of Claim (Amendment No 3). Not only are there several contradictory inconsistencies in the plaintiff’s pleaded case as it evolved, the plaintiff’s case is also entirely inconsistent with the objective evidence before the court. Indeed, by one version of the plaintiff’s case, though it has since been amended, it admits as much that what was said by the 2nd defendant was, at best, that she “will procure” sub-purchasers orwill assistto procure (as stated in the police report), rather than that she had “ready sub-purchasers” for the plaintiff. 59     I should add that even if I had found the 2nd defendant to be liable for the misrepresentations, I would have dismissed the claim against the 1st defendant. There is simply insufficient evidence before the court to show that the 1st defendant had exercised the requisite control over the 2nd defendant such that an employer-employee relationship exists for the purposes of vicarious liability. All that is adduced by the plaintiff is that for each sale transacted by the 2nd defendant, the 1st defendant takes 10% of the commission while the 2nd defendant takes the balance 90%. This is manifestly insufficient to establish vicarious liability. 60     For the above reasons, the plaintiff’s claim is dismissed with costs which I fix at $120,000, plus disbursements fixed at $13,100. 61     It is worth mentioning that at the time the Development was introduced to Punitha (on 10 or 12 December 2012), there were only eight warehouse units left in the Development. Given the 16% discount offered to Punitha, as well as the uniquely attractive features of the Development, it is understandable for Punitha to have believed that the units could be “flipped” for a quick and handsome profit and that this was a risk worth taking particularly since the 2nd defendant had managed within a short time to find four sub-purchasers. What she did not and could not have anticipated was the implementation of the cooling measures which reduced the marketability of the warehouse units. That this is so is evidently borne out by the fact that three out of the four sub-purchasers forfeited their option fees to the plaintiff after the implementation of the cooling measures.",
        "Losses": "62     Notwithstanding the dismissal of the plaintiff’s claim, it is perhaps useful to provide some views in relation to several of the unusual heads of damages the plaintiff is claiming for. 63     The full details of the plaintiff’s claim are set out at [20] above. In short, the plaintiff is claiming for all the monies it had expended and/or forfeited arising from the purchase of the eight warehouse units, as well as for the loss of profits it would have earned if the 2nd defendant’s representations had beentrue. It should be noted that no claim is made in respect of the unit which has since been sold to Shark Engineering Pte Ltd. That unit was sold at $1,250 per square foot which was above the price of $1,193 allegedly promised by the 2nd defendant. 64     The general rule in awarding damages in tort is to “put the victim into the position in which he would have been, if the tort had not been committed”:Wishing Star Ltd v Jurong Town Corp[2008] 2 SLR(R) 909 (“Wishing Star”) at [28]. 65     Mr Anparasan raises,inter alia, the following objections to the plaintiff’s claim for damages: (a)     The defendants cannot be liable for the losses arising from the three units (#02-04, #03-05 and #03-07) for which the 2nd defendant managed to procure sub-purchasers. These three sub-purchasers paid the option fees and were entitled as of right not to exercise the options which were extended to them.[note: 45] (b)     Any loss incurred by Punitha and/or Gopal personally (eg, on the UOB re-mortgage loan they took up) cannot be claimed by the plaintiff because it is not the plaintiff’s loss.[note: 46] (c)     The plaintiff cannot claim for loss of profits.[note: 47]",
        "Losses arising from the sub-purchasers’ failure to complete the sub-sale": "66     Mr Anparasan submits that even on the plaintiff’s own pleaded case, the 2nd defendant did not owe the plaintiff a duty to ensure that the sub-purchasers wouldcompletethe purchase. Therefore, since the 2nd defendant did find sub-purchasers who paid the plaintiff option fees for three of the warehouse units, the plaintiff cannot claim for any losses arising from the sub-purchasers’ exercise of their right not to complete their purchase of those three units. The effect of Mr Anparasan’s submission appears to be that even if the alleged representations were made, they were notfalsein relation to those three warehouse units because the 2nd defendant did have ready sub-purchasers for those units. 67     Mr Daniel submits that the 2nd defendant at least implicitly represented that the sub-sales would be completed.[note: 48]He reasoned that it would otherwise not have made sense for the plaintiff to exercise the options to purchase the eight units as it could then end up bearing the risk of purchasing the eight units with no assurance that the sub-sales would go through.[note: 49] 68     This issue ultimately turns on the scope and meaning of the pleaded representations. Even if the 2nd defendant did represent that she had ready sub-purchasers who would purchase the warehouse units at a price of at least $1,193 per square foot, did this entail a representation that the “ready sub-purchasers” wouldcompletethe sub-sale? 69     In my view, the parties must have understood “ready sub-purchasers” to mean buyers who are prepared to buy the warehouse units by paying the option fees, and no more. Whether these ready sub-purchasers would subsequently exercise the options and complete the sub-sales is a matter which would beentirelyout of the 2nd defendant’s knowledge and control. It follows that it is unlikely for the 2nd defendant’s representations to include (or to be understood to include) a guarantee in relation to the future conduct of the sub-purchasers. Therefore, unless the 2nd defendantexpresslyrepresented that her “ready sub-purchasers” would alsocompletethe sub-sale, I am of the view that a reasonable interpretation of the pleaded representations, if made, should be construed to mean sub-purchasers who would be willing to pay the option fee for the right to purchase the units. It would not make any commercial sense for the 2nd defendant to provide such an open-ended guarantee to earn a modest commission.",
        "Punitha and Gopal’s personal loss": "70     Mr Daniel accepts that some of the losses claimed by the plaintiff in the present suit are Punitha’s and Gopal’spersonallosses. These include the interest which the developer of Punitha’s Malaysian properties had charged her due to delays in her completion of those properties[note: 50], as well as expenses that Punitha and Gopal might have incurred on loans they took out in their own name to finance the purchase of the properties (eg, the UOB remortgage loan[note: 51]). However, he submits that because the loss flows directly from the plaintiff’s reliance on the 2nd defendant’s fraudulent misrepresentation, the plaintiff’s claim for recovery of these losses should be allowed.[note: 52] 71     Mr Daniel has cited no authority for the proposition that the plaintiff company, which is aseparate legal entityfrom its shareholders and/or directors (ie, Punitha and Gopal), can commence an action in its own name and claim the losses that its shareholders and directors havepersonallysuffered. In my view, the plaintiff cannot claim the losses which were incurred personally by Punitha and Gopal. In addition, it seems to me that this claim might be too remote to be recoverable as they related to different transactions from the present case. However, since no submission was made on this point, I shall say no more.",
        "Loss of profits": "72     The plaintiff also claims for profits that it would have earned if the 2nd defendant’s representations were true. I agree with Mr Anparasan that the plaintiff’s claim for loss of profits must fail. In support of his submission, Mr Anparasan relies on the decision of the Court of Appeal inWishing Starat [28], quoting with approval Edwin Peel,Treitel on The Law of Contract(Sweet & Maxwell, 12th Ed, 2007): Tortious misrepresentation does, indeed, create new expectations, but the purpose of damages even for that tort is to put the victim into the position in which he would have been, if the misrepresentation had not been made,and not to protect his expectations by putting him into the position in which he would have been, if the representation had been true. [emphasis added] In short, the plaintiff cannot have its cake and eat it too. It cannot, on the one hand, claim that but for the misrepresentation, it would not have obtained and exercised the options to purchase the warehouse units and claim losses arising therefrom, and on the other hand,additionallyclaim for loss of the profits it would have made if the representations were true. It appears that the plaintiff’s introduction of the contractual claim was targeted at achieving recovery of the loss of profits, but that claim has since been abandoned. In the circumstances, it is disappointing that the claim for loss of profits continues to feature in the plaintiff’s closing submissions. 73     Nevertheless, Mr Daniel relies onWishing Staras well asVita Health Laboratories Pte Ltd and others v Pang Seng Meng[2004] 4 SLR(R) 162 (“Vita Health”) in support of his submission that in the case offraudulentmisrepresentations, a more generous approach to the quantification of damages should be taken. As stated above,Wishing Stardoes not assist the plaintiff. While Mr Daniel is not incorrect in submitting thatWishing Stardoes affirm a more generous approach in the quantification of damages for fraudulent misrepresentation, it does not extend to putting the plaintiff into the position which it would be have been inif the representations were true. This much is made clear from the passage quoted above. AllWishing Starpermits is for the court to award all damages flowing directly from the plaintiff’s reliance on the defendant’s fraudulent misrepresentation,whether or not such loss was foreseeable(see alsoVita Healthat [91]). 74     InVita Health, the plaintiffs were a group of related companies who sued the defendant, the group’s previous managing director, for the losses they suffered arising,inter alia, from the defendant’s fraudulent accounting. The Vita Health brand started out as the defendant’s family business. However, when the defendant took over, he had aspirations to expand the business. In a bid to do so, the defendant falsified the accounts of two of his companies – Vita Health Laboratories Pte Ltd (the first plaintiff, referred to as “VHLS” inVita Health) and Vita Health Laboratories (Hong Kong) Ltd (the second plaintiff, referred to as “VHLHK” inVita Health) – to give investors the false impression that the Vita Health business was enjoying strong revenue flow from an Indonesian company (referred to as “Vitaton” inVita Health) and a Philippines company (referred to as “VHLP” inVita Health). VHLS and VHLHK were subsequently bought over by Vita Life Sciences Limited (the fourth plaintiff, referred to as “VLS” inVita Health) pursuant to a share sale agreement. When the irregular accounting was discovered, the plaintiffs forced the defendant to step down from all management positions, and eventually commenced an action against the defendant for the fraudulent accounting. 75     In determining the quantum of damages that should be awarded, V K Rajah JC (as he then was) made the following observations (Vita Healthat [94]–[98]), which Mr Daniel has sought to rely on in his closing submissions: 94    When accounts are falsified there will necessarily be different approaches in measuring the loss. … There is no universal test in view of the many imponderables competing for primacy; an inflexible approach cannot achieve justice. It should also be noted that s 157(3)(a) of the CA appears to accepta broad test of liability against a director who,inter alia, fails to act honestly. The director is responsible for “anydamage suffered by the company as a result of the breach”. 95In the present circumstances, where the defendant caused VHLS’s accounts to inaccurately portray transactions between VHLS and Vitaton/VHLP, it appears appropriate to conclude that VHLS and the other interested plaintiffs had alegitimate expectation and belief that its accounts were correctand that they would receive the amounts represented therein as genuine receivables due from Vitaton/VHLP. … 97    …Another dimension pertaining to this issue may help place matters in perspective. There is no gainsaying that the defendant was a fiduciary.Directors who cause company funds to be misplaced are liable to make good the misapplication with interest:In re Duckwari Plc[1998] Ch 253 at 262. This rule applies even if the director does not personally benefit from the misapplication. 98    It is only appropriate in the present factual matrix, that the defendant bears the difference between what he led VHLS to believe it would recover and what it actually recovered. The wrong here is deceiving VHLS and the plaintiffs that the accounts represented the true financial relationship VHLS had with, what in truth was, itsde factosubsidiaries in Indonesia and Philippines. The plaintiffs believed this. …The true loss he caused is captured in this case by pinning the defendant personally to the false picture he painted.… [emphasis in italics in original, emphasis added in bold] 76     Rajah JC awarded VHLS and VHLHK,inter alia, damages in terms of the outstanding sums due to it from Vitaton, the Indonesian company, and VSLP, the Philippines company, under the falsified accounts (Vita Healthat [99] and [105]). In other words, Rajah JC seemingly awarded the companies whose accounts had been falsified by the defendant the receivables that would have been due to themon the basis that the accounts had been true. However, it is important to bear in mind that this basis of computation wasnotused to quantify the damages forfraudulent misrepresentation. In fact, the claim for damages for misrepresentation was dismissed since the loss was not pleaded and no evidence was adduced to prove the true financial position of the Vita Health group of companies had the accounts of VHLS and VHLHK not been falsified (Vita Healthat [76]). VLS was eventually awarded damages for the defendant’s breach of the warranties in the share sale agreement rather than for misrepresentation (Vita Healthat [66]–[68]). Rajah JC went on to observe at [77] that the court was “not satisfied that having recovered their losses under the indemnity, VLS can really mount a further claim for misrepresentation”. 77     It is therefore plainly incorrect for Mr Daniel to rely onVita Healthto ground the plaintiff’s claim for loss of profits purportedly arising from the misrepresentations.Vita Healthactually decided to the contrary. In my view, the court inVita Healthdid not intend to alter the conventional basis in awarding damages for fraudulent misrepresentation. This is evident from the fact that the court demanded strict proof of the losses VLS suffered in reliance on the misrepresentations. 78     Therefore, I find that the plaintiff’s claim for loss of profits has no basis in law and would have failed in any event.  [note: 1]Punitha’s AEIC at para 3, Gopal’s AEIC at para 1 [note: 2]NE 5 August 2015, p61 lines 14 – 18 [note: 3]2nd Defendant’s AEIC at para 4, NE 3 August 2015, p16 lines 29 – 32 [note: 4]2nd Defendant’s AEIC at para 6 [note: 5]2nd Defendant’s AEIC at para 7 [note: 6]NE 4 August 2015, p66 line 17 – p67 line 27, NE 5 August 2015, p122 [note: 7]Statement of Claim at para 5 [note: 8]Statement of Claim (Amendment No 2) at para 5 [note: 9]F & BPs from the Plaintiff dated 25 March 2015 at para 3(1) [note: 10]Statement of Claim (Amendment No 2) at para 11 [note: 11]Statement of Claim (Amendment No 3) at para 7(3) [note: 12]Statement of Claim (Amendment No 3) at para 16(3) [note: 13]Statement of Claim (Amendment No 3) at para 21 [note: 14]Punitha’s AEIC at para 31 [note: 15]Defendant’s closing submissions at para 113 [note: 16]NE 3 Aug 2015 p43 lines 17 – 21 [note: 17]NE 4 August 2015 p86 lines 19 – 29 [note: 18]Punitha’s AEIC at para 15(b) [note: 19]F&BPs dated 31 March 2014 at para 3(e) [note: 20]NE 3 August 2015 p34 line 29 – p35 line 17 [note: 21]NE 3 August 2015 p63 lines 23 – 27, p108 lines 5 – 11 [note: 22]Punitha’s Supplementary AEIC at para 11 and 15, NE 3 August 2015 p99 line 16 – p100 line 26 [note: 23]Statement of Claim (Amendment No 3) at para 10 [note: 24]NE 3 August 2015 p117 lines 21 – 26 [note: 25]Punitha’s AEIC at para 17 [note: 26]NE 3 August 2015 p69 lines 30-31, p70 lines 12 – 15 [note: 27]Punitha’s AEIC at paras 23 – 25 [note: 28]NE 3 August 2015 p52 lines 15 – 16 [note: 29]NE 3 August 2015 p54 lines 5 – 6 [note: 30]Defendant’s closing submissions at para 119(1) [note: 31]Defendant’s closing submissions at para 179 – 180 [note: 32]Lim Keng Chiang’s AEIC at p13 [note: 33]Punitha’s AEIC at p 79 [note: 34]NE 4 August p 28 lines 15 – 20 [note: 35]Punitha’s Supplementary AEIC at para 8 [note: 36]NE 3 August 2015 p44 line 29 – p46 line 13 [note: 37]NE 4 August 2015 p29 line 24 – p30 line 2 [note: 38]NE 4 August 2015 p41 – 43; Defendant’s closing submissions at paras 160 and 161 [note: 39]NE 5 August 2015 p1 lines 29 – 31 [note: 40]Plaintiff’s closing submissions at paras 71-83 [note: 41]Defendant’s closing submissions at para 117 [note: 42]Defendant’s closing submissions at para 120 [note: 43]NE 5 August 2015 p104 line 26 – p106 line 9 [note: 44]NE 5 August 2015 p13 line 24 – p14 line 10 [note: 45]Defendant’s closing submissions at paras 229 – 231 [note: 46]Defendant’s closing submissions at para 241 [note: 47]Defendant’s closing submissions at paras 243 – 249 [note: 48]Plaintiff’s closing submissions at para 126 [note: 49]Plaintiff’s closing submissions at para 128 [note: 50]Punitha’s AEIC at para 31 [note: 51]Punitha’s AEIC at pp 37 – 44 [note: 52]Plaintiff’s closing submissions at para 164"
    }
}