{
    "case_title": "Re Conchubar Aromatics Ltd and other\n                matters",
    "ncitation": "[2015] SGHC 322",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1       The three applicant companies applied for and\n                    were granted interim stay of proceedings under s 210(10) of the Companies Act\n                    (Cap 50, 2006 Rev Ed) (“the Companies Act”) for 10 weeks or until\n                    earlier discharged, ahead of any application for the calling of a\n                    creditors’ meeting under s 210(1). A Malaysian decision,Re Kuala Lumpur Industries Bhd[1990] 2 MLJ 180\n                        (“Re KL Industries”) is\n                    authority that this can be done. Apparently, although similar orders have been\n                    made in Singapore (see for instance the commentary inWoon’s Corporations Law(LexisNexis, Looseleaf Ed, 2005,\n                    July 2012 Release) (“Woon’s Corporations\n                        Law”) at para L [152]), the matter has not been addressed\n                    in written grounds. As the commercial discussions were still being pursued, the\n                    commercially sensitive details have been omitted.",
        "Brief Background": "2       The three applicant companies, Shefford\n                    Investments Holding Limited, UVM Investment Corporation, and Conchubar Aromatics\n                    Limited, were shareholders in Jurong Aromatics Corporation Pte Ltd\n                    (‘JAC”). These shareholdings, as well as shareholdings in SK\n                    E&C Jurong Investment Pte Ltd, were the primary assets of the\n                    applicants. 3       JAC ran into difficulties, eventually being put\n                    into receivership in September 2015. The Applicants themselves were similarly in\n                    some difficulty. While JAC and the Applicants faced difficulties, the Applicants\n                    hoped that a restructuring proposal would rehabilitate their\n                position.",
        "The Application": "4       As matters were still being negotiated and\n                    discussed among various parties, a moratorium was necessary to protect the\n                    Applicants’ ability to continue their efforts at restructuring. The\n                    Applicants argued that a restraint order under s 210(10) of the Companies Act\n                    could be granted independent of the calling of a meeting under 210(1), citingRe KL Industries. It is authority for the\n                    proposition that a restraint order may be issued if there is a proposal which\n                    gives more than a general layout of the scheme and the applicant was actingbona fide. The fact that the applicants were\n                    foreign companies would not obstruct the granting of a moratorium, as there was\n                    sufficient nexus to Singapore such that these companies were liable to be wound\n                    up under the Act: ReTPC Korea Co Ltd[2010] 2 SLR\n                    617 (“Re TPC”) at\n                [12]. 5       In the present case the restructuring proposal\n                    put forward to the Court was sufficiently particularised to merit due\n                    consideration by the creditors. The restructuring would confer some benefit to\n                    the Applicants' creditors, who would otherwise obtain nothing.Bona fideswas shown by the fact that the restraint was\n                    to be operative for as short a period as possible to allow discussions to be\n                    finalised as to the proposal and the s 210(1) application to be filed and heard.\n                    No prejudice would occur to the Applicants' creditors if the order was\n                    granted. 6       A creditor, SK Engineering & Construction\n                    Co, Ltd appeared, but did not contest the application for the moratorium at this\n                    time.",
        "The Decision": "7       I granted a restraint order in respect of each\n                    of the three applications, operative for 10 weeks, unless discharged earlier,\n                    with a status conference fixed for an update on the situation. Further status\n                    conferences will be ordered as needed. I was satisfied that a restraint order\n                    could be granted under s 210(10) even if no application had yet been made\n                    under s 210(1), provided that there was a proposal sufficiently detailed as to\n                    indicate there was something definitive that could be put to the creditors\n                    shortly, and the application was madebona\n                    fides.",
        "Analysis": "",
        "The ambit of s 210(10)": "8       Section 210(10) of the Companies Act\n                    reads: Power of Court to restrain\n                        proceedings (10) Where no order has been made or resolution passed for the winding up\n                        of a company and any such compromise or arrangement has been proposed\n                        between the company and its creditors or any class of such creditors, the\n                        Court may, in addition to any of its powers, on the application in a summary\n                        way of the company or of any member or creditor of the company restrain\n                        further proceedings in any action or proceeding against the company except\n                        by leave of the Court and subject to such terms as the Court imposes. The provision, in so far as the present circumstances apply,\n                        thus permits, the Court to order the restraining of further proceedings,\n                        if: (i)     There has\n                        been no order or resolution for the winding up of the company;\n                    and (ii)     An arrangement\n                        has been proposed between the company and its creditors. Section 210(10) does not expressly require that there be any\n                        application under s 210(1) – it only refers to the proposal of an\n                        arrangement, not its actual presentation at a meeting of creditors or\n                        approval by that meeting. 9       Section 210(1) itself distinguishes the proposal\n                    of a compromise or arrangement from the convening of a meeting: Where a compromise or arrangement is proposed between a company and its\n                        creditors or any class of them or between the company and its members or any\n                        class of them, the Court may, on the application in a summary way of the\n                        company or of any creditor or member of the company, or, in the case of a\n                        company being wound up, of the liquidator, order a meeting of the creditors\n                        or class of creditors or of the members of the company or class of members\n                        to be summoned in such manner as the Court directs. There is nothing in the language of s 210(1) and s 210(10)\n                        which indicates that s 210(10) is to be dependent or contingent on\n                        s 210(1). What each does require is that there be a proposal of a\n                        compromise or arrangement only. 10     Therefore, while there does not appear to be\n                    anything in our Parliamentary Debates or committee reports that would shed light\n                    on how the provisions are to be interpreted, the plain words of the provision\n                    contemplate an application for a restraint order being made independent of an\n                    application under s 210(1). 11     The conclusion reached here is thus the same\n                    as that inRe KL Industries, which interpreted ss\n                    176(1) and 176(10) of the Companies Act 1965 (No 79 of 1965) (M’sia),\n                    provisionsin pari materiawith ss 210(1) and\n                    210(10) of the Companies Act respectively. In that case, it was argued by a\n                    creditor of a group of companies that had obtained a s 176(10) order that\n                    the court had no jurisdiction to do unless a s 176(1) application had been\n                    made. VC George J concluded that applications under the two subsections could be\n                    made independent of each other. What was required, followingRe GAE Pty Ltd[1962] VR 252 (“Re\n                        GAE”), was that the particulars of the scheme gave more\n                    than a general layout, so that the court would be able to determine if the\n                    scheme was feasible, and that the intention to invoke the section wasbona fide.",
        "Particularity of the proposal": "12     It is only necessary that the proposal is\n                    detailed enough to allow the Court to consider its feasibility. As noted inRe GAE, completeness is not required. It is to\n                    be expected that refinements and modifications will be needed before any meeting\n                    is sought. Further, I did not think that feasibility had to be decided\n                    conclusively: close scrutiny of the merits of the proposal or its viability and\n                    likely acceptance by the creditors should not be carried out at this stage. The\n                    Court would otherwise need to place itself in the shoes of different creditors\n                    with different exposures, commercial motivations and appetites for risks.\n                    Instead, what the Court needed to assess was whether on the face of the proposal\n                    the Court could conclude that there was a reasonable prospect of the scheme\n                    working and being acceptable to the general run of creditors. So long as the\n                    court could make this broad brush assessment, sufficient particularity would\n                    have been given. 13     I was satisfied that the proposal put forward\n                    by the Applicants was sufficiently detailed and particularised, showing how\n                    greater benefit could potentially be derived by the creditors than if the\n                    Applicants were to be wound up. On the surface of things, the proposal appeared\n                    viable. For these reasons, it would seem that the proposal had a reasonable\n                    prospect of working and benefiting the creditors.",
        "Bona fide proposal": "14     The court should be careful to ensure that\n                    there is no attempt to game the system by companies seeking the benefit of s\n                    210(10) restraint orders without putting forward a serious proposal. The need to\n                    ensurebona fideswas clearly laid out inRe KL Industries.Bona\n                        fidesis not mentioned in s 210(10), but ensuring it is an\n                    integral part of the court’s inherent jurisdiction to prevent abuses of\n                    its processes. 15     It should also be clear that an application\n                    under s 210(1) should be made shortly thereafter and if not, a sufficient\n                    explanation and proposed timelines should be given. Here, the Applicants\n                    committed to a 10 week timeline, and volunteered to appear in court on a regular\n                    basis to provide updates. 16     In the present case, there was nothing that\n                    would indicate that the proposal was notbona\n                    fide. The particularisation has been examined above. Sufficient\n                    particularisation is relevant to the assessment ofbona\n                        fides, as it shows that there is serious intent and thought.\n                    There was nothing either that indicated that the proposal was so bad that it\n                    would likely be rejected outright.",
        "Application to foreign companies": "17     I accepted the arguments by the Applicants\n                    that the protection of s 210(10) of the Companies Act and indeed, the whole\n                    of s 210, could be obtained by companies incorporated overseas. Section 210(11)\n                    defines the term ‘company’ in s 210 to mean ‘any corporation\n                    or society liable to be wound up under this Act’. InRe\n                        TPC, Philip Pillai JC accepted that a s 210(10) restraining\n                    order is available to foreign companies, as a foreign company could be wound up\n                    in Singapore if its assets are in Singapore or there is sufficient connection. I\n                    agree with that analysis.",
        "Miscellaneous issues": "18     While this was not raised specifically in the\n                    present case, I note that there is commentary inWoon’s\n                        Corporations Lawreferring toRe Reid Murray\n                        Acceptance Ltd[1964] VR 82 that an application should not be\n                    madeex partebutinter\n                        partesin a pending action. It would seem that this is premised\n                    on fairness to persons affected by a restraint order, as they would otherwise\n                    need to take the initiative and expense to set aside anex\n                        parterestraint order. With respect, there is no requirement of\n                    that nature specified by the statute. It may be that the best forum to hear a\n                    restraint order may be the one hearing an on-going proceeding, but in other\n                    situations, especially when there are many creditors and proceedings or\n                    potential creditors and potential proceedings, anex\n                        parteapplication followed by appropriate setting aside hearings\n                    before a single judge also exercising case management functions may be the best\n                    way to deal with a complex situation. 19     The need for proper case management would also\n                    be a matter that would influence the Court’s determination of whether\n                    there are terms that should be further imposed. The issue did not arise in the\n                    present case as the Applicants volunteered a specified timeline and to appear in\n                    court for status updates. In appropriate situations the Court may possibly take\n                    proactive measures for better case management and coordination, either under\n                    s 210(10) or any of the other possible orders under s 210(1) or\n                    s 210(3) read with s 210(4).",
        "Orders made": "20     In the circumstances of this case, the\n                    restraint order was granted for 10 weeks, unless discharged earlier. By the end\n                    of the 10 weeks, an application under s 210(1) for a meeting of creditors should\n                    have been made. A status conference has been ordered, which may be followed by\n                    other status conferences as necessary."
    }
}