{
    "case_title": "Timor Global, LDA\n      v\n      Equatorial Group Pte Ltd and others",
    "ncitation": "[2015] SGHC 203",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       This action was commenced by the plaintiff for the sum of US$1,270,369.59, being the balance price of coffee beans sold and delivered. The plaintiff sought a declaration that either the first defendant or the second to fourth defendants collectively were liable to pay this balance price.",
        "Parties": "2       The third defendant, Tan Tjo Tek (“Bill”), was the main protagonist in the dispute. Bill was an experienced coffee trader who had been actively involved in the coffee trade for more than 40 years. He played a crucial role in setting up the plaintiff company, Timor Global, LDA (“TG”). 3       TG was incorporated in Timor-Leste and was in the business of,inter alia, coffee trading. Bill served as its chief executive officer from incorporation until his resignation on 3 June 2013. During his term, Bill was the main person running TG’s business and its operations. After his resignation, TG was managed by its remaining directors, Bobby Lay Ni Sing and Jannie Chan Siew Lee. 4       The first defendant, Equatorial Group Pte Ltd (“EG”), was set up in 2010 and its primary business was in the wholesale trade of coffee beans. EG’s directors, Au John Martins (“John”) and Jarle Aakermann (“Jarle”), were interested in venturing into the coffee business in Timor-Leste. 5       The fourth defendant, Tan Ling Ling, Natalie (“Natalie”), is Bill’s daughter and the sole director of the second defendant, Agri-Commodity Resources (International) Pte Ltd (“ACRI”). ACRI was in the business of,inter alia, marketing coffee beans to end buyers.",
        "Events that led to the conclusion of the S&P Agreement": "6       In early 2012, TG had reached the limit of its financing facility with Australia & New Zealand Bank (“ANZ Bank”). In order to be able to trade during the upcoming coffee harvest, TG sought a fresh credit line but ANZ Bank required a US$600,000 injection in shareholder capital for an increase in facility. TG was unable to raise the requisite amount from shareholders and decided to source for funds from EG by way of a creative structure. 7       Bill, TG’s CEO and director at that time, approached EG’s John with the following proposal. EG would advance US$600,000 to TG, in exchange for 3,000 metric ton (“MT”) of coffee beans to be supplied by TG. To account for the advance payment, there would be a price reduction of US$200/MT which would come to US$600,000 when the 3,000MT of coffee beans were supplied. 8       The arrangement was effected by a sale and purchase agreement dated 31 May 2012 (“the S&P Agreement”). The salient features of the S&P Agreement were as follows: (a)     TG would sell 3,000MT of coffee beans to the EG in 2012. (b)     The coffee beans would be supplied FOB to the port at Timor-Leste. (c)     EG would provide an advance payment of US$600,000 to TG which would be offset by a discount of US$200/MT of coffee beans (up to a total of 3,000MT). 9       The sale of the coffee beans was in six tranches, each governed by a separate sales contract. The following table summarises the quantity of coffee beans to be sold under each sales contract. Price per metric ton (in US$)Quantity (in MT)Time of Delivery13,100576Jul/Aug 201223,100348Aug/Sep 201233,100576Sep/Oct 20124To be fixed576Oct/Nov 20125To be fixed348Sep/Oct 20126To be fixed576Nov/Dec 2012   Jute and PP bags 10     In or around mid-2012, Bill informed John that TG required jute bags and PP bags and requested for those bags to be transported to TG’s office in Timor-Leste through Troy Logistics Services, a transportation company. EG proceeded to make the necessary arrangements and issued an invoice for the bags in January 2013. Coffee shipments 11     Unfortunately, the financing from ANZ Bank was delayed and the letter of offer was only given in September 2012. By then, the coffee season in Timor-Leste was close to its tail-end and TG was unable to purchase sufficient coffee beans to meet its contractual obligations. Consequently, TG only managed to deliver 1,929.54MT of coffee beans over the course of August to December 2012. The quantity of coffee beans shipped under each contract was as follows: (a)     August 2012 – 242.34MT; (b)     September 2012 – 37.20MT; (c)     October 2012 – 403.20MT; (d)     November 2012 – 518.40MT; and (e)     December 2012 – 728.40MT. 12     It was undisputed that ACRI took delivery of and sold all of the above shipments. This was achieved by a switch of bills of lading for coffee shipments that was done under Natalie’s instructions. 13     This dispute centred primarily on the final shipment of the coffee beans. On 26 December 2012, the final shipment from TG, comprising 728.40MT of coffee beans in 38 containers, was shipped out from Timor-Leste. On Natalie’s instructions, this shipment was sent to a bonded warehouse in Hamburg, Germany. ACRI faced difficulties marketing and selling the final shipment due to the poor quality of the coffee beans and the declining coffee market. 14     Between February and April 2013, ACRI received feedback from potential buyers that TG’s coffee beans were not up to industry standards. This was communicated to Bill who in turn informed John about the same. After negotiation, an agreement was reached between Bill and John on behalf of TG and EG respectively. Under this agreement, the sales contract for the last shipment was nullified and TG would take back the final shipment of coffee beans. However TG’s Jannie was unhappy with Bill’s decision to take back the final shipment of coffee beans and stated that the agreement was invalid since Bill did not consult TG’s other directors. Subsequently, Bill informed John of Jannie’s disapproval and then John eventually agreed to rescind that agreement. 15     ACRI proceeded to market, and eventually sold off the final shipment of coffee beans. Due to the poor quality of coffee beans, ACRI suffered losses and was liable for quality claims from some buyers. Payments for the coffee shipments 16     Themodus operandibetween the parties in relation to the sale of beans and payment was as follows. ACRI would periodically transfer to EG sums obtained from the coffee sales and EG would pay TG upon the receipt of these sums. From August 2012 to May 2013, ACRI paid a total of US$4,040,160 to EG. On top of these sums, ACRI made direct payments to TG on two occasions in September 2012 and May 2013, and these payments amounted to US$393,600. 17     In April 2013, EG stopped forwarding payments to TG and started withholding the funds transferred by ACRI. By then, EG had only paid over to TG a total of US$3,553,749.88. ACRI was concerned that funds transferred to EG would not be paid over to TG. Thus, it stopped paying EG and held on to a sum of about US$300,000. 18     The payments to TG accounted for the contract price of all the coffee beans delivered except for those in the December shipment. The balance payment for the December shipment of coffee beans forms the main subject matter of TG’s claim. Demands for payment 19     On 1 March 2013, TG’s former solicitors M/s Engelin Teh Practice LLC (“ETP”) sent a letter of demand to EG, demanding payment of the then-outstanding sum of US$2,036,893.34 within seven days from the date thereof. Another demand letter was sent to EG on 13 March 2013, statinginter aliathat TG would commence legal action if there was no payment or proposal from EG that was satisfactory to TG within the next two days. 20     On 15 March 2013, EG’s John sent an email to TG’s Kelly Chen (“Kelly”), asking for an extension of time to 12 April 2013. ETP replied on 18 March 2013 stating that TG would consider an extension of time provided EG made an interim partial repayment of US$500,000 before 30 March 2013. Following that EG made partial payments of US$444,233.02 and US$49,825.39 respectively on 9 April 2013 and 18 April 2013. 21     On 14 May 2013, ETP sent a further letter of demand to EG demanding payment of the outstanding sum but there was no response or payment from EG. On 23 May 2013, TG commenced this action against EG for recovery of the outstanding sums.",
        "The claims": "TG’s claim against EG 22     TG’s case against EG was essentially in breach of contract. Pursuant to cl 9 of the S&P Agreement, EG was required to pay TG 100% of the invoice value by direct remittance to TG’s account against presentation of the necessary documents. EG failed to pay for the December shipment even though the necessary documents were duly presented. On this basis, TG claimed US$1,270,369.59 for the balance outstanding sum owing in respect of the said 1,929.54MT of coffee beans. This balance took into account,inter alia, the balance of the upfront payment made by EG. EG’s defence and counterclaim 23     EG disputed the claims made against it. It denied receiving the coffee beans and claimed that it was not liable to pay the balance price of the coffee beans. It further averred that ACRI had intercepted the coffee beans shipments and denied any agency relationship with ACRI. This eventually led to TG adding the second to fourth defendants to this suit. 24     Meanwhile, EG also commenced a counterclaim against TG in relation to the following: (a)     short delivery of coffee beans; (b)     proportionate repayment of the US$600,000 advance payment; and (c)     payment for jute bags and PP bags supplied to TG. 25     I should highlight at the outset that the counterclaim for proportionate repayment of the US$600,000 advance payment has been accounted for in TG’s claim. Therefore if TG’s claim succeeds, it would follow that the counterclaim for this item would fail. TG’s claim against the second to fourth defendants 26     In the light of EG’s assertions, TG mounted two claims against the second to fourth defendants. First, it claimed that the second to fourth defendants had wrongfully and without TG’s and/or EG’s consent taken the said 1,929.54MT of coffee beans and/or delivered them to unknown third parties, and were liable in conversion.Further, and in the alternative, TG claimed that the second to fourth defendants had wrongfully and with intent to injure TG and/or cause loss to TG by unlawful means conspired and combined together to defraud TG by the fraudulent misappropriation of the said 1,929.54MT of coffee beans owned by TG and intended for sale to EG. The second to fourth defendants’ defence 27     In a nutshell, the second to fourth defendants took the position that ACRI, acting through Natalie, was authorised, pursuant to a verbal agreement, to sell the coffee beans on behalf of EG. This agreement was reached between EG’s John and ACRI’s Natalie before the S&P Agreement was signed. ACRI eventually sold all 1,929.54MT of coffee beans and had paid over to EG a total of US$4,040,160. 28     Due to quality issues in the December shipment and the declining coffee market, the final shipment of coffee beans was sold at a loss. ACRI was also liable for quality claims from some buyers. On top of that, ACRI also averred that it was entitled to claim freight and warehousing costs from EG pursuant to the agency agreement. 29     The delay in payments by ACRI to EG was due to the difficulty in marketing and selling the final shipment of coffee to end buyers. This difficulty was mainly caused by quality issues in the December shipment coupled with the declining coffee market at that time. 30     As regards the sum of US$300,000 that was withheld from EG, ACRI was ready and willing to pay the sum into court or to either TG’s or EG’s solicitors as stakeholders pending resolution of this dispute",
        "Issues before this court": "31     This suit presents the following issues for determination: (a)     Whether ACRI, acting through Natalie, was authorised by EG to take delivery of and sell all 1,929.54MT of coffee beans to final buyers worldwide, and if not, whether the conversion and conspiracy claims was made out. (b)     Whether EG has a valid counterclaim against TG for the cost of jute bags and PP bags. (c)     Whether EG has a valid counterclaim against TG for damages for failing to deliver the contracted 3,000MT of coffee beans pursuant to the S&P Agreement and the sales contracts.",
        "My decision": "32     From the evidence before me it was clear that the transaction between TG and EG was, in essence, a financing cum investment arrangement whereby EG would advance US$600,000 to TG which would make use of the funds to secure financing from ANZ Bank. TG would then procure coffee beans from farmers in Timor-Leste to sell to EG at prices determined under the sales contracts. EG had an agreement with ACRI for the latter to sell the coffee beans to buyers around the world. It was envisaged to be a mutually beneficial arrangement under which TG would be able to obtain finance for coffee trading during the coffee season in Timor-Leste and EG would have the opportunity to trade in coffee. It was also clear from the evidence that it was due to the delay in funding from ANZ Bank that caused the venture to run into problems in relation to the last shipment.",
        "Whether ACRI was EG’s agent": "33     This was essentially a tussle between EG and the second to fourth defendants as to who was liable to pay the balance contract price of the coffee beans. The focal point of the dispute was whether ACRI was EG’s agent for the purposes of selling coffee beans to third party buyers. If answered in the affirmative, EG as the principal would be liable to pay the balance contract price and it would no longer be necessary for me to decide on the conversion and conspiracy claims against the second to fourth defendants. The first defendant’s submissions 34     EG’s case shifted considerably as the trial progressed. It first denied that it was liable for the balance price for the 1,929.54MT of coffee beans sold and delivered by TG, on the ground that it had never received any coffee beans. EG was also adamant that it shared no agency relationship with ACRI. In a nutshell, EG sought to portray itself as a bystander that played a nominal role in the entire transaction. According to EG, Bill had orchestrated the entire transaction and the on-going theme was that many things would be done purportedly on its behalf but it was never kept in the loop. 35     At the close of trial, EG conceded that it had received 1,201.14MT of coffee beans. However, it maintained that ACRI was not its agent and made the following arguments: (a)     It was not possible for EG to have appointed ACRI as its agent because EG’s directors had always believed that Bill, Natalie and Conrad Tan Yong Kiat were part of TG and operated as one entity. (b)     The switch of bill of ladings was done without EG’s knowledge. (c)     ACRI’s actions were contrary to that of an alleged agent of EG as it failed to discharge the ordinary duties of an agent. 36     In the alternative, EG submitted that ACRI had limited authority and was not authorised to take delivery of all or a part of the disputed coffee beans. EG argued that ACRI was merely an agent for sales and consequently, that it was not authorised to take delivery of coffee beans when there was no available purchaser. On this basis, EG contended that ACRI was not entitled to take delivery of the disputed coffee beans since it had no buyer for the coffee beans when the December shipment was delivered. The second to fourth defendants’ submissions 37     The second to fourth defendants took the position that EG was the party liable to pay the balance contract price. According to them, ACRI was appointed as EG’s agent for the purpose of selling the coffee beans that TG had contracted to sell. Before the S&P Agreement was even concluded, EG and ACRI agreed to equally market and sell the 3,000MT of coffee beans that EG intended to purchase from TG. Following that, Natalie as director of ACRI, instructed the shipping company, Perkins Shipping (Singapore) Pte Ltd to switch the Bills of Lading such that ACRI would be reflected as the consignor instead of EG. This was done to facilitate the ACRI’s sale of coffee beans to end buyers. 38     The second to fourth defendants averred that the agency relationship was borne out by the parties’ course of conduct as well as the available documentary evidence. They submitted that the parties had conducted themselves in a way that reflected this agency relationship. After ACRI had sold the coffee beans on behalf of EG, ACRI would pay EG the invoice value of the coffee beans sold by TG to EG. ACRI regularly kept EG informed of the payments made to EG and also reminded EG to pay TG for the invoices rendered by TG to EG. Besides, the documents evidencing the telegraphic transfers supported the finding of an agency relationship between TG and EG. My findings 39     The law governing an agency relationship is not in dispute. It is trite that the relationship of principal and agent may be constituted by the conferring of authority by the principal on the agent, which may be express, or implied from the conduct or situation of the parties (Peter Watts, Francis M B Reynolds,Bowstead & Reynolds on Agency(Sweet & Maxwell, 19th Ed, 2010) at para 2-001). There is no requirement that an agency must be in writing; an agent may be appointed orally (Chitty on Contractsvol 2 (H. Beale gen ed) (Sweet & Maxwell, 31st Ed, 2012) at paras 31-020 and 31-022). 40     With the above legal principles in mind, it was clear from the evidence that ACRI was acting as EG’s agent in dealings with TG as well as with third party buyers. There was a verbal agreement between EG’s John and ACRI’s Natalie which conferred upon ACRI, the requisite authority to take possession of and to sell the coffee beans to end buyers. This is consistent with John’s concession under cross-examination that Natalie had offered to sell the coffee beans that were to be delivered by TG and he had agreed to let her sell the said coffee beans. 41     Since ACRI was selling the coffee beans on EG’s behalf, EG as the principal would remain liable to TG for the balance contract price. EG’s admission of its liability to pay was further evidenced in a series of events that unfolded after TG started pressing for payment. When pressed for payment, John did not dispute EG’s liability to pay but rather, sought an extension of time to pay. This was documented in John’s email to TG’s Kelly on 15 March 2013 in which he statedinter alia: Equatorial Group request [sic] an extension for the completion of the contracts until 12thApril 2013. 42     In response to the request for extension of time, TG’s former solicitors stated that TG was prepared to consider the request if EG made an interim partial payment of US$500,000 on or before March 2013. EG subsequently complied, albeit making the said payment only in April 2013. 43     Under cross-examination, John agreed that his email of 15 March 2013 suggested EG was ultimately liable for the contracts. He also agreed that EG would have responded in a completely different way if he had thought that EG was not liable for the contracts. This must be correct. It seemed to me hardly conceivable that EG would have made the partial payment in April 2013 if it had genuinely thought that it was not liable to pay for the coffee beans. 44     Furthermore, EG’s argument that it derived no benefit from the entire transaction was unmeritorious. EG clearly stood to benefit from ACRI’s experience in the trade. EG was a relatively new start-up and its directors were new to the coffee business. It had only one other contract prior to entering into the S&P Agreement with TG. Although John claimed that EG had potential buyers for the 3,000MT of coffee beans that it had contracted to purchase from TG, there was no evidence adduced to support his claim. In fact, it appeared that EG was content to leave the business of marketing and selling the coffee beans to ACRI. This arrangement was unsurprising given EG’s relative lack of experience in the trade. 45     EG’s submission that it did not appoint ACRI as its agent was premised on Jarle’s alleged objection to the arrangement and refusal to provide Natalie with a formal letter of authorisation. This position, in my view, flies in the face of logic and common sense. First and most importantly, if EG had seriously objected to ACRI selling coffee beans on its behalf, it had more than enough time to communicate these objections to the second to fourth defendants. It did not. Even when EG learnt that Bill had informed TG’s other directors that ACRI had been appointed as EG’s agent, it remained silent and continued to receive and forward payments in a manner that was consistent with EG’s appointment of ACRI as its agent. As I have held at [41] above, the lack of a letter of authorisation in itself does not preclude the existence of an agency relationship. 46     I was similarly unconvinced by EG’s alternative submission that ACRI only had authority to take delivery of coffee beans that it had ready buyers for. There was nothing in the evidence that suggested that ACRI’s authority to take delivery of the coffee beans hinged on whether it had buyers on hand. 47     For completeness, I will also address the other peripheral arguments raised by EG. 48First, EG’s contention that it was kept in the dark with respect to the delivery and sale of the coffee beans is not supported by the evidence which clearly showed that EG knew ACRI was selling coffee beans on its behalf. 49     The email correspondence between the parties showed that ACRI had kept EG updated about the coffee sales. For instance, on 28 August 2012, EG’s John sent an email to Natalie requesting for an update on the coffee sales. ACRI replied on 31 August 2012 with a document titled “coffee sales info” that updated EG on the sales that had been made by ACRI. ACRI sent another email update on 14 September 2012 which included a document titled “coffee sales info for Equatorial (2012)”. It was thus patently clear that EG not was “kept in the dark” about the coffee sales made by ACRI. 50     Furthermore, the fund transfer activity between ACRI, EG and TG showed that EG was fully aware of ACRI’s coffee sales on its behalf. After ACRI sold the coffee beans, it would forward to EG the payments it received and EG would in turn pay TG for the supply of coffee beans. Although EG may not have been privy to the specifics of ACRI’s sale of coffee beans to third party buyers, at the very least EG knew that ACRI was selling the coffee beans on its behalf. Indeed John’s evidence at trial was that he had allowed Natalie to sell the coffee beans on EG’s behalf and that he would look at the profit figures at the end of the day. 51Second, EG contended that it could not have appointed ACRI as its agent since it was under the impression that Natalie represented TG, not ACRI. This argument was demolished by John’s concession that he knew Natalie was not working for TG. 52Finally, EG argued that ACRI could not have been EG’s agent since “ACRI’s conduct in the whole matter had always been diametrically opposed to the duties of an agent”. There was nothing in the evidence that supported this contention. Although the personalities were linked in that Bill, representing TG, was Natalie’s father and the latter was ACRI’s agent, there was no evidence that their relationship had in any way caused any disadvantage of losses to EG. 53     In view of the above, I found that the evidence presented by witnesses on behalf of the second to fourth defendants was the most compelling in terms of its consistency with the contemporary documents and surrounding circumstances. On the other hand, EG’s version of events were unsupported by cogent evidence and shifted constantly in the course of the proceedings. 54     In the light of my finding that ACRI was EG’s agent, it was unnecessary for me to examine the conversion and conspiracy claims brought against the second to fourth defendants. This leaves the question of whether EG should succeed in its counterclaims against TG.",
        "Whether EG had a valid counterclaim for the contract price of jute and PP bags": "55     It was undisputed that Bill had placed an order for jute and PP bags and TG had in fact received those bags. What was in dispute, however, was whether Bill’s action bound TG. Furthermore, it later transpired that the jute and PP bags were supplied by ACRI, not EG. 56     TG took the position that Bill had no authority to place the order because he did not comply with TG’s internal procurement process. After it was revealed that ACRI was the supplier of the jute and PP bags, TG further argued that it was not liable to EG for the cost of the bags since EG did not provide those bags. 57     On this issue, I found that TG had contracted with EG for the jute and PP bags.First, the evidence showed that Bill had the authority to purchase the jute and PP bags. Under cross-examination, TG’s Victor Chan Wee Seng (“Victor”) stated that the procurement process was implemented sometime towards the end of 2012. When it was pointed out that the jute and PP bags were ordered by Bill sometime in May or June 2012, Victor admitted that Bill, as TG’s CEO, did have the authority to order jute and PP bags on behalf of TG.Second, I failed to see the relevance of ACRI’s provision of the jute and PP bags. TG was contractually liable to pay EG for the jute and PP bags regardless of who provided those bags and it was up to EG to reimburse ACRI for the cost of those bags eventually. 58     Therefore, I found that TG was liable to pay to EG the invoiced amount of US$205,674.07.",
        "Whether EG had a valid counterclaim for the short delivery of coffee beans": "59     Under cl. 8 of the S&P Agreement, which was further particularised by the sales contracts, TG was contractually bound to supply 3,000MT of coffee beans to EG. TG was in breach of this obligation since it only managed to supply 1,929.54MT of coffee beans between August and December 2012. However, EG only managed to adduce evidence of loss in relation to the first and second sales contracts. There was no evidence of loss in relation to the remaining sales contracts. There was some evidence that the world prices for coffee was falling in the later part of the year. 60     The shortfall in the first sales contract was 333.66MT. Based on Natalie’s evidence, the average selling price of the first shipment of coffee beans amounted to US$3,601/MT. As the cost price of the coffee was US$3,100/MT, the gross margin for coffee beans under the first sales contract was US$501/MT. The shortfall for the second sales contract amounted to 310.8MT and the contemporaneous market price was US$3,450/MT. Therefore, the gross margin for the second shipment of coffee was US$350/MT. 61     I was mindful that freight costs should be deducted from the respective gross margins since the coffee beans were sold to third party buyers on a cost & freight basis. Based on Natalie’s evidence, the average freight in July-September 2012 was US$100.60/MT. Consequently, I found that EG’s loss of profits in relation to the first and second sales contracts were US$400.40/MT and US$249.40/MT respectively. Thus, EG’s lost profits amounted to US$133,597.46 for the first sales contract and US$77,513.52 for the second sales contract. On this basis, I awarded the sum of US$211,110.98 to EG for the shortfall in coffee beans delivered.",
        "Conclusion": "62     In summary, I determined that: (a)     EG was liable to TG for the sum of US$1,270,369.59, being the balance contract price of coffee beans sold and delivered. (b)     TG was liable to EG for the sum of US$205,674.07, being the contract price for the jute and PP bags. (c)     TG was liable to EG for the sum of US$211,110.98, being the lost profits due to shortfall in coffee beans delivered under the first and second sales contracts. 63     In awarding costs, I was mindful that TG had succeeded in its claim for $1.20m and EG in its counterclaim for more than US$400,000. As between TG and EG, I ordered EG to pay TG costs fixed at $80,000 and two-thirds of TG’s disbursements. 64     Since the claims against the second to fourth defendants were dismissed, I awarded costs to them fixed at $132,000 plus disbursements of $5,800. I ordered these costs to be borne by TG and EG equally since both played a part in joining the second to fourth defendants to the suit. The costs awarded to the second to fourth defendants were apportioned in the ratio 50:25:25 for second defendant, third defendant and fourth defendant respectively. 65     On top of the above cost orders, I made a further order for the $40,000 held by the TG’s solicitors to be released to the solicitors for second to fourth defendants."
    }
}