{
    "case_title": "Foo Jong Long Dennis\n      v\n      Ang Yee Lim and another",
    "ncitation": "[2015] SGHC 23",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       The matter before me concerned an issue of law\n                    not hitherto considered by any court in Singapore. It was raised as a\n                    preliminary issue on the first day of trial by counsel for the first and second\n                    defendants (“the Defendants), Mr Harry Elias SC. In a nutshell, it\n                    pertained to whether a document disclosed during discovery in a prior suit\n                    – and that is thus subject to an implied undertaking not to be used for\n                    any collateral or ulterior purpose (the “Riddickprinciple”) – ceased to be subject to that\n                    undertaking once it had been used in open court in the prior suit.",
        "The Parties": "2       The relationship of the parties was not relevant\n                    to the specific question of law that was before the court. However, for\n                    completeness, I would briefly describe the history of their relationship. The\n                    plaintiff and the Defendants were shareholders of Raffles Town Club Pte Ltd\n                    (“RTC”), ABR Holdings Limited (“ABR”) and Europa\n                    Holdings Pte Ltd (“EH”). Their holdings in ABR were through two\n                    companies which were incorporated in the British Virgin Islands, namely,\n                    Goldhurst Properties Limited and Sullivan Developments Limited. 3       The plaintiff and the first defendant were\n                    directors of RTC, ABR and EH. The second defendant was also a director of RTC,\n                    ABR and EH, although he ceased to be a director before the plaintiff and\n                        1stdefendant did.",
        "Background": "4       In 2000, the following suits involving the\n                    parties were instituted (collectively referred to as “the Year 2000\n                    Suits”): (a)     Suit No 742 of 2000 involved a third\n                        party, Peter Lim Eng Hock (“Peter Lim”), suing the plaintiff\n                        and the Defendants in this case for the specific performance of an oral\n                        agreement involving the shares of RTC. According to Peter Lim, the oral\n                        agreement involved a promise to him of 40% of the shareholding of\n                        RTC. (b)     Suit No 782\n                        of 2000 involved a claim by RTC against the first defendant and Peter Lim\n                        for a sum in excess of $51 million. (c)     Suit No 905 of 2000 involved a claim by RTC against the\n                        second defendant for a sum of almost $6 million. (d)     Suit No 1000 of 2000 involved a suit in\n                        which the Defendants sued the plaintiff and Peter Lim, alleging them of the\n                        wrongful conversion of certain bearer share\n                certificates. 5       The trial for the Year 2000 Suits commenced in\n                    2001. The trial had been partially heard when the matters were referred to\n                    mediation. The mediation sessions at the Singapore Mediation Centre were\n                    attended by the plaintiff, the Defendants and Peter Lim, all of whom were\n                    involved in the Year 2000 Suits. 6       An agreement was finally reached and a Deed of\n                    Settlement was eventually executed by the plaintiff, the Defendants, Peter Lim\n                    and one Ricky Goh Hoon Kan on 19 April 2001. 7       The matter did not end there. In 2006, RTC\n                    instituted Suit No 46 of 2006 (“the Year 2006 Suit”) against Peter\n                    Lim, the plaintiff and the Defendants for breach of directors’ duties owed\n                    to RTC. 8       Pursuant to discovery obligations in the Year\n                    2006 Suit, the Defendants furnished a handwritten document in the Chinese\n                    language. This document was titled “Minutes of Meeting” and dated\n                    14 April 2001 (“the 14 April Minutes”). The 14 April Minutes had\n                    not been disclosed during the mediation process and negotiations leading up to\n                    the execution of the Deed of Settlement in 2001. 9       During the course of the trial for the Year 2006\n                    Suit, counsel for Peter Lim referred to the 14 April Minutes during his\n                    cross-examination of the first defendant and second defendant. The 14 April\n                    Minutes was also referred to during the cross-examination of the second\n                    defendant by counsel for one Margaret Tung (who was added as a third party in\n                    the Year 2006 Suit). Parts of the official translation into English of the 14\n                    April Minutes were read out during the cross-examination mentioned above. All of\n                    these were recorded in the verbatim transcripts of the trial proceedings. It was\n                    therefore not disputed that the 14 April Minutes was referred to and used in\n                    open court. 10     The Year 2006 suit ended with a dismissal of\n                    both the claim and the counterclaims by the High Court. On appeal, RTC’s\n                    appeal was dismissed but the appeal by the Defendants was allowed in\n                    part. 11     One would not be faulted for thinking that was\n                    the end of the saga. It was not to be. The plaintiff instituted this suit\n                    against the Defendants for damages for,inter\n                    alia, deceit, misrepresentation, conspiracy and for breach of the\n                    Memorandum and Articles of Association (“M&A”) of RTC and EH\n                    and for breach of the Singapore Exchange Trading Limited Listing Manual\n                    (“SGX Rules”). 12     According to the plaintiff, the 14 April\n                    Minutes constituted evidence of an agreement (“the Agreement”)\n                    between the Defendants and third parties which provided,inter alia, that the Defendants agreed to sell their shares in\n                    RTC, ABR and EH to the third parties for $36 million. The plaintiff claimed,inter alia, that the Agreement was in breach\n                    of the M&A of RTC and EH, and by failing to disclose the Agreement during\n                    the mediation and negotiations leading up to the execution of the Deed of\n                    Settlement in 2001, the Defendants had acted fraudulently. The plaintiff also\n                    claimed damages for misrepresentation and conspiracy. In addition to the above,\n                    the plaintiff claimed that the failure to disclose the Agreement was a breach of\n                    the SGX Rules on public disclosure to shareholders since ABR was a listed\n                    company. 13     The 14 April Minutes became crucial to the\n                    plaintiff’s claim. It was the main piece of evidence that the plaintiff\n                    was relying on to establish the Agreement. 14     One of the defences raised by the Defendants\n                    was that the use of the 14 April Minutes was a breach of theRiddickprinciple. According to the Defendants, the 14 April\n                    Minutes obtained by the plaintiff through discovery in the Year 2006 Suit had to\n                    be used only for purposes relating to the Year 2006 Suit. The use of the 14\n                    April Minutes in this suit was thus for an improper or collateral purpose and in\n                    breach of theRiddickprinciple. 15     On the other hand, the plaintiff’s\n                    position was that theRiddickprinciple was not\n                    breached because it ceased to apply to the 14 April Minutes once it had been\n                    used in open court. 16     Prior to trial, the Defendants took out an\n                    application in Summons No 2757 of 2013 to strike out the plaintiff’s\n                    statement of claim pursuant to O 18 r 19 of the Rules of Court\n                    (Cap 332, R 5, 2006 Rev Ed) on the basis that the use of the 14 April Minutes\n                    was a breach of theRiddickprinciple. The\n                    application to strike out was not granted. 17     On the first day of trial, Mr Harry Elias SC\n                    raised this same issue as a preliminary point for determination. As mentioned\n                    above (at [13]), the 14 April Minutes was central to the plaintiff’s case.\n                    In fact, had I found that theRiddickprinciple\n                    applied to prevent the plaintiff from using the 14 April Minutes, that would\n                    have been fatal to the plaintiff’s case. This much was conceded by counsel\n                    for the plaintiff, Mr Tan Chuan Thye. 18     After hearing both parties, I decided that theRiddickprinciple did not apply to the April\n                    14 Minutes. Accordingly, I ordered the trial to continue. The trial is presently\n                    part-heard. As the Defendants appealed against my ruling on the preliminary\n                    issue, I now give my reasons.",
        "The Issue": "19     The sole preliminary issue which concerned the\n                    court was whether theRiddickprinciple ceased to\n                    apply once the 14 April Minutes had been used in open court.",
        "My Decision": "",
        "The Riddick principle in Singapore": "20     It was not disputed that a party to litigation\n                    who had obtained discovery of a document owed an implied undertaking to the\n                    court not to use that document for any collateral or ulterior purpose. The\n                    principal question concerned the nature of the exceptions (if any) to the\n                    generalRiddickprinciple. InRiddick v Thames Board Mills Ltd[1977] QB 881\n                        (“Riddick”), an issue arose as\n                    to whether the staff report prepared by the defendant on Riddick, which was\n                    disclosed during discovery in an action brought by Riddick for wrongful\n                    dismissal, could be used in a subsequent defamation suit that was based on the\n                    very report disclosed in the first suit (which was eventually settled before\n                    trial). The Court of Appeal held that Riddick was not entitled to use the\n                    report. Lord Denning MR explained as follows at 895: Discovery of documents is a most valuable aid in the doing of justice. The\n                        court orders the parties to a suit - both of them - to disclose on oath all\n                        documents in their possession or power relating to the matters in issue in\n                        the action. Many litigants feel that this is unfair… The reason for compelling discovery of documents in\n                            this way lies in the public interest in discovering the truth so that\n                            justice may be done between the parties. That public interest is to be\n                            put into the scales against the public interest in preserving privacy\n                            and protecting confidential information.The balance comes\n                        down in the ordinary way in favour of the public interest of discovering the\n                        truth,i.e.in making full disclosure. This\n                        balancing act – of weighing the competing public interests – is\n                        what I advocated in my judgment inD. v. National Society\n                            for the Prevention of Cruelty to Children… The thing\n                        to do in every case is to weigh the competing public interests and see which\n                        way the scales come down… I proceed to hold the balance in the present case. On the one hand\n                        discovery has been had in the first action. It enabled that action to be\n                        disposed of. The public interest there has served its purpose. Should it go\n                        further so as to enable the memorandum of 16 April, 1969, to be used for\n                        this libel action? I think not. The memorandum was obtained by compulsion.\n                        Compulsion is an invasion of a private right to keep one’s documents\n                        to oneself. The public interest in privacy and confidence demands that this\n                        compulsion should not be pressed further than the course of justice\n                        requires. The courts should, therefore, not allow the other party – or\n                        anyone else – to use the documents for any ulterior or alien purpose.\n                        Otherwise the courts themselves would be doing injustice. Very often a party\n                        may disclose documents, such as inter-departmental memoranda, containing\n                        criticisms of other people or suggestions of negligence or misconduct. If\n                        these were permitted to found actions of libel, you would find that an order\n                        for discovery would be counter-productive. The inter-departmental memoranda\n                        would be lost or destroyed or said never to have existed. In order to\n                        encourage openness and fairness, the public interest requires that documents\n                        disclosed on discovery are not to be made use of except for the purposes of\n                        the action in which they are disclosed. … [emphasis added] 21     TheRiddickprinciple has been accepted and applied locally (see,eg,Sim Leng Chua v Manghardt[1987] SLR(R) 52 (“Manghardt”);Stansfield Business International Pte Ltd and another v V\n                        C S Vardan[1997] 3 SLR(R) 857 andBusiness\n                        Software Alliance and others v SM Summit Holdings Ltd and another and other\n                        appeals[2000] 1 SLR(R) 819). 22     The following passage from the Court of Appeal\n                    inPertamina Energy Trading Ltd v Karaha Bodas Co LLC and\n                        others[2007] 2 SLR(R) 518 (“Pertamina”) is instructive: 38    Such an implied\n                            undertaking is owed tothe court, and abreachof such an undertaking is acontempt of court, and punishable\n                            accordingly. The following elaboration by Hobhouse J (as he then was) in\n                            the English High Court decision ofPrudential\n                                Assurance Co Ltd v Fountain Page Ltd[1991] 1 WLR 756 (at\n                            764-765) is illuminating: This undertaking is implied whether the court\n                                expressly requires it or not. The expression of the obligation as an\n                                implied undertaking given to the court derives from the historical\n                                origin of the principle. It is now in reality a legal obligation\n                                which arises by operation of law by virtue of the circumstances\n                                under which the relevant person obtained the documents or\n                                information. However treating it as having the character of an\n                                implied undertaking continues to serve a useful purpose in that it\n                                confirms that the obligation is one which is owed to the court for\n                                the benefit of the parties, not one which is owed simply to the\n                                parties; likewise, it is an obligation which the court has the right\n                                to control and can modify or release a party from. It is an\n                                obligation which arises from legal process and therefore is within\n                                the control of the court, gives rise to direct sanctions which the\n                                court may impose (viz. contempt of court) and can be relieved or\n                                modified by an order of the court.It is thus a\n                            formulation of the obligation which has merit and convenience and\n                            enables it to be treated flexibly having regard to the circumstances of\n                            any particular case. Treating the duty as one which is owed to the court\n                            and breach of which is contempt of court also involves the principle\n                            that such contempts of court can be restrained by injunction and that\n                            any person who knowingly aids a contempt or does acts which are\n                            inconsistent with the undertaking is himself in contempt and liable to\n                            sanctions: seeDistillers Co. (Biochemicals) Ltd. v.\n                                Times Newspapers Ltd. [1975] Q.B. 613. The rational basis for the rule is that where one\n                                party compels another, either by the enforcement of a rule of court\n                                or a specific order of the court, to disclose documents or\n                                information whether that other wishes to or not, the party obtaining\n                                the disclosure is given this power because the invasion of the other\n                                party's rights has to give way to the need to do justice between\n                                those parties in the pending litigation between them; it follows\n                                from this that the results of such compulsion should likewise be\n                                limited to the purpose for which the order was made, namely, the\n                                purposes of that litigation then before the court between those\n                                parties and not for any other litigation or matter or any collateral\n                                purpose... Reference may also be made toMicrosoft Corp([36]supra, especially at [23]-[24] and\n                        [36]). 39    Theoppositeof compulsion is, of course,voluntariness. Hence, inHong\n                                Lam Marine([36]supra), it\n                            was held (at [21]) that: [T]heRiddickprinciple applies to\n                            documents disclosed under compulsion of court process, whether by virtue\n                            of the enforcement of the rules of the court or by a specific court\n                            order. It has no application to documents voluntarily disclosed in legal\n                            proceedings; the implied undertaking does not apply to such documents.\n                            ... [emphasis in original] 23     A few local cases would require more\n                    attention. InManghardt(see [21] above), the\n                    plaintiff had initially instituted a suit against a company, Interfood Ltd, for\n                    damages for breach of contract and for procuring another party (Khee San Food\n                    Industries Sdn Bhd) to breach its contract with the plaintiff. However, the\n                    plaintiff also started a fresh suit for defamation against the defendant, who\n                    was Interfood Ltd’s “director-general adjoint”. The latter\n                    case arose as in the course of discovery for the initial suit, Interfood Ltd\n                    disclosed a letter that was addressed to the managing director of Khee San. The\n                    letter, which contained allegedly defamatory statements, had been signed by the\n                    defendant (although it did not indicate if he had written it in his personal\n                    capacity). Chan Sek Keong JC (as he then was) struck out the plaintiff’s\n                    defamation action on the ground of abuse of the process of court. He based this\n                    on theRiddickprinciple. Counsel for the\n                    plaintiff contended that theRiddickprinciple\n                    only applied to limit the use of a disclosed document against the same party or\n                    parties to the action where discovery of it had been given. After surveying the\n                    relevant authorities, Chan JC rejected her argument, citingSybron Corp v Barclays Bank Plc[1985] Ch 299 (“Sybron”) (at 328): There are two additional matters that I would refer to. Mr Brodie\n                        suggested that, since the implied undertaking was imposed for the benefit of\n                        the party giving discovery, the bank ought not to be allowed to inhibit use\n                        of the documents against third parties, the employees. I do not accept that.\n                        It is, in my view, an understandable and legitimate object of the bank that\n                        its discovered document should not be used to base actions against its\n                        staff. The decision in theRiddickcase [1977]\n                        QB 881 would surely have been the same if the person sued for defamation had\n                        been the employee who drafted the memorandum rather than the employer\n                        itself. … It must be noted that no reference was made to the manner in which\n                    the document was used in the prior suit. Chan JC was merely dealing with the\n                    argument raised by counsel, that theRiddickprinciple only applied between parties to the suit in which discovery had been\n                    ordered. Chan JC was not required to consider the effect of using the document\n                    in open court on theRiddickprinciple. 24     The second local case was that ofReebok International Ltd v Royal Corp and another action[1991] 2 SLR(R) 688. The plaintiff in the main action, Reebok, sued the\n                    defendant, Royal, for trademark infringement by importing shoes bearing the\n                    “REEBOK” trade mark into Singapore. An Anton Piller order was\n                    granted in favour of Reebok, resulting in some 35,832 pairs of shoes in four\n                    different models being taken into safe custody. Pursuant to an order of court, a\n                    random sample of the seized shoes was selected to be preserved until trial.\n                    While the main action was pending, Reebok applied for,inter\n                        alia, liberty to send ten pairs of each of the four models of\n                    shoes to Japan, Taiwan, and the USA. Reebok wanted to use them as evidence in\n                    the foreign legal proceedings it was involved in. Chan Sek Keong J (as he then\n                    was) dismissed the immediate application before him. In considering theRiddickprinciple, Chan J observed as follows\n                    (at [16]): TheRiddickprinciple is not an absolute\n                        principle. The court has a discretion to release or modify the undertaking,\n                        whether express or implied. … 25     I turn next to the case ofBeckkett Pte Ltd v Deutsche Bank AG[2005] 3 SLR(R) 555. In that\n                    case, Beckkett applied to be released from its implied undertaking not to use\n                    the documents obtained through discovery in its on-going suit with the bank. It\n                    sought leave to use the documents to apply for an injunction in Indonesia\n                    against a third party, which it had also added as a defendant in the on-going\n                    suit. In the High Court, Woo Bih Li J reversed the assistant registrar’s\n                    decision to grant leave, mainly for the reason that disclosing the documents in\n                    Indonesia would render the defendant bank liable to criminal prosecution in\n                    Indonesia. Beckkett appealed. The Court of Appeal, in dismissing the appeal,\n                    made the following observations (at [19]): … It seems to us that, generally, before leave to be released from\n                        the implied undertaking is given, two conditions must be satisfied. First,\n                        cogent and persuasive reasons must be furnished for the request. Second, it\n                        must not give rise to any injustice or prejudice to the party who had given\n                        discovery. It is clear that the court may, in the appropriate circumstances,\n                    give leave in order for a party to be released from the implied undertaking.\n                    Even though theRiddickprinciple was initially\n                    stated in absolute terms, the court can modify the undertaking and grant leave\n                    in order for a party to be released from the undertaking. However, the\n                    contention by Mr Tan Chuan Thye went even further. He submitted that leave was\n                    not required because the implied undertaking ceased once the document had been\n                    used in open court. 26     The following observations can be distilled\n                    from the discussion above. TheRiddickprinciple,\n                    as it was originally espoused, comes about as a result of a balancing exercise\n                    (see emphasis in [20] above). On one side of the scale is the public interest in\n                    the administration of justice while on the other, there is the need to protect\n                    privacy and confidential information. Next, the Court of Appeal pointed out inPertamina(see [22] above) that the\n                    undertaking is owed to the Court, not to the party against whom discovery is\n                    ordered. Therefore, it is not an absolute principle and the court has the\n                    discretion to release or modify the undertaking (seeReebokat [24] above). 27     Finally, none of the local cases have decided\n                    on the specific issue that was before me. In the light of this, the task fell on\n                    me to determine where the appropriate balance should be struck in Singapore. In\n                    arriving at my decision, I first considered the positions in other common law\n                    jurisdictions.",
        "England": "Common law position 28     InHarman v Secretary of\n                        State for the Home Department[1983] 1 AC 280 (“Harman”), the House of Lords, by a bare majority\n                    of 3-2, decided that theRiddickprinciple\n                    continues to apply even to documents which had been used in open court. InHarman, the plaintiff’s solicitor passed\n                    to a journalist documents which had been obtained through discovery in a suit in\n                    which she was acting as solicitor for the plaintiff. These documents had already\n                    been read out in open court in the course of the hearing. The majority (Lord\n                    Diplock, Lord Keith of Kinkel and Lord Roskill) held that the solicitor was\n                    nevertheless guilty of contempt for having disclosed the document in breach of\n                    theRiddickprinciple. 29     Lord Scarman (with whom Lord Simon of\n                    Glaisdale agreed), in delivering a speech disagreeing with the majority, said\n                    (at 313): … A balance has to be struck between two interests of the law - on\n                        the one hand, the protection of a litigant's private right to keep his\n                        documents to himself notwithstanding his duty to disclose them to the other\n                        side in the litigation, and, on the other, the protection of the right,\n                        which the law recognises, subject to certain exceptions, as the right of\n                        everyone, to speak freely, and to impart information and ideas, upon matters\n                        of public knowledge. In our view, a just balance is struck if the obligation endures only so\n                        long as the documents themselves are private and confidential. Once the\n                        litigant's private right to keep his documents to himself has been overtaken\n                        by their becoming public knowledge, we can see no reason why the undertaking\n                        given when they were confidential should continue to apply to them. Later in his speech, Lord Scarman said (at 316): To sum up this part of the argument, the common law by its recognition of\n                        the principle of open justice ensures that the public administration of\n                        justice will be subject to public scrutiny. Such scrutiny serves no purpose\n                        unless it is accompanied by the rights of free speech, i.e. the right\n                        publicly to report, to discuss, to comment, to criticise, to impart and to\n                        receive ideas and information on the matters subjected to scrutiny. Justice\n                        is done in public so that it may be discussed and criticised in public.\n                        Moreover, trials will sometimes expose matters of public interest worthy of\n                        discussion other than the judicial task of doing justice between the parties\n                        in the particular case. It cannot be desirable that public discussion of\n                        such matters is to be discouraged or obstructed by refusing to allow a\n                        litigant and his advisers, who learnt of them through the discovery of\n                        documents in their action, to use the documents in public discussion after\n                        they have become public knowledge. 30     The difference between the majority and\n                    minority lies in the latter’s recognition of the place of the principle of\n                    open justice in the balancing exercise. The principle of open justice is\n                    traceable to the seminal House of Lords decision inScott v\n                        Scott[1913] AC 417. Moore-Bick J provided the following summary\n                    of the principle of open justice inDian AO v Davis Frankel\n                        & Mead (a firm) and another (OOO Alfa-Eco and another\n                        intervening)[2005] 1 WLR 2951 (at [28]): 28    … For the reasons set out in the speech of\n                            Lord Shaw inScott v Scott… it has\n                            long been recognised that if justice is to be properly administered it\n                            is essential that the decisions of the courts and the decision making\n                            process itself be open to public scrutiny. It is for that reason that in\n                            all but exceptional cases hearings are conducted in public, judgment is\n                            delivered in public and proceedings can be freely\n                        reported. 31     The majority inHarmanwas of the opinion that the principle of open justice did\n                    not feature in the balancing exercise. Lord Diplock (who formed part of the\n                    majority) said at the very beginning of his speech (at 299): My Lords, in a case which has attracted a good deal of publicity it may\n                        assist in clearing up misconceptions if I start by saying what the case isnotabout. It isnotabout freedom of speech, freedom of the press, openness\n                        of justice or documents coming into “the public domain”; nor,\n                        with all respect to those of your Lordships who think the contrary, does it\n                        in my opinion call for consideration of any of those human rights and\n                        fundamental freedoms which in the European Convention on Human Rights are\n                        contained in separate articles each starting with a statement in absolute\n                        terms but followed immediately by very broadly stated exceptions. [emphasis in original] The majority then reasoned that theRiddickprinciple did not terminate even when the documents had\n                    been used and read in open court as holding otherwise would discourage full and\n                    frank discovery of documents and thus impede the proper administration of\n                    justice (eg,perLord Keith at 308–309). The minority, on the other hand, was of the view\n                    that allowing such an exception to theRiddickprinciple would not impede discovery proceedings and the administration of\n                    justice because litigants would be aware of the risk produced by public trial\n                        (ie, the near certainty that their documents\n                    would be produced and read in the course of proceedings, thus entering the\n                    public domain) and such an exception would not diminish that risk (perLord Scarman at 315–316). 32     A difficulty faced by the majority inHarmanwas the treatment of transcripts of\n                    court proceedings. Transcripts are clearly not subject to any implied\n                    undertaking because of the principle of open justice. Therefore, had the\n                    solicitor disclosed to the journalist transcripts (which captured the entire\n                    document since it had been assumed that the entire document was read out in\n                    court), she would not have been in contempt. Yet by disclosing the document\n                    itself, she would be in contempt. Lord Diplock said that this was a hypothetical\n                    in the extreme (at 305). Lord Keith said that whatever the position might have\n                    been with transcripts, the solicitor was not in a position to disclose the\n                    documents and save the journalist time (by not having to wait for the\n                    transcripts) (at 309). Lord Roskill noted the strength of these arguments.\n                    However, he also pointed out at 324 that as it might be a matter of chance\n                    whether the document was actually read in court, the exception, in whatever way\n                    crafted, might operate capriciously. 33     The House of Lords also took judicial notice\n                    of a common practice, which involved counsel in civil litigation allowing\n                    reporters present at the hearing to view the copies of documents disclosed by\n                    either party and read out in court to allow the reporters to check the accuracy\n                    of the reports of the proceedings that they were preparing. Lord Diplock dealt\n                    with the practice as follows(at 307): Whether this be so or whether, as Dunn L.J. preferred to put it in the\n                        Court of Appeal, any contempt of court that might be involved, if not\n                        excluded under the de minimis rule, would at most be only technical is not,\n                        however, of any practical importance. As was held inScott v. Scottany contempt of court of this kind would be\n                        civil. The court would not have jurisdiction to deal with it except on\n                        motion by the other party to the action and if the person showing the\n                        document to the reporter had no reason to suppose that the party whose\n                        document it was would object to his doing so, the court in the proper\n                        exercise of its discretion could dismiss the motion with costs. Lord Keith, though, was of the view that there were hazards in the\n                    practice. If there was doubt as to whether the party who had disclosed the\n                    documents would approve of it being shown, the documents should not be disclosed\n                    to journalists without approval (see 309). Lord Roskill, on the other hand, was\n                    of the view that such a practice was not in contempt of court and admitted an\n                    exception “in favour of those who engage in day-by-day reporting”\n                    (at 327). 34     InSybron, Scott\n                    J added a further gloss on the holding ofHarman.\n                    He said (at 321–322): Mr. Brodie accepts that these three attendance notes, each of which was\n                        contained in a document produced by the bank in the main action pursuant to\n                        the subpoena, were together with all the other documents so produced or\n                        subsequently discovered protected by the implied undertaking. He submits,\n                        however, that once documents have been incorporated into a judgment of which\n                        there is a written record, such as a transcript, the undertaking does not\n                        prevent information being obtained from that record and used for any purpose\n                        the extractor of the information may wish. The undertaking, he submits,\n                        prevents the use of information obtained directly from the discovered\n                        documents but it does not, he says, prevent the use of information if the\n                        information is obtained from some other source. In the instant case the\n                        other source is the transcript of Walton J.'s judgment. The source might\n                        equally well, in another case, take the form of counsel's or a journalist's\n                        notes of an extempore judgment. The principle would, if Mr. Brodie is right,\n                        apply also to written records of counsel's speeches or witnesses' testimony.\n                        If in the course of such speeches or such testimony the contents of a\n                        discovered document were read, the undertaking would not, submits Mr.\n                        Brodie, prevent the use of information about the documents derived from a\n                        written record of the speech or testimony. And the same would presumably be\n                        said to be the case if reliance were placed on the memory rather than on a\n                        written record of what has been said in open court. I am unable to accept\n                        the submission. It is necessary, in my judgment, to distinguish between the\n                        party on whom the undertaking is imposed on the one hand and third parties\n                        on the other hand. The undertaking binds the former, it does not bind the\n                        latter, who have given no undertaking. … Mr. Brodie seeks from this\n                        premise to argue that if the solicitor had obtained a transcript of the\n                        proceedings she could have used such information about the documents as\n                        could be derived from the transcript without regard to the undertaking that\n                        she had given. It is correct that nothing inHome Office\n                            v. Harmanexpressly states the contrary. Mr. Brodie's\n                        proposition was not in point in that case. But his proposition does not, in\n                        my judgment, follow from his premise. The reason why the journalist or any\n                        third party could have used information derived from a transcript is that\n                        third parties have not given and are not bound by any undertaking. If\n                        proceedings are held in open court information derived from any record of\n                        those proceedings can be used by third parties without regard to\n                        undertakings which may bind the parties thereto or their solicitors. But the\n                        position of the parties themselves depends not on what third parties may be\n                        able to do but on the scope of the undertaking that binds them. The purpose\n                        of the undertaking is to protect, so far as is consistent with the proper\n                        prosecution of the action, the confidentiality of the party's private\n                        documents, and thereby to encourage the full and proper disclosure of\n                        documents that the administration of justice requires. It seems to me\n                        unacceptably inconsistent with that purpose that the protection of the\n                        undertaking should be lost on account of the fortuitous reading in open\n                        court of the document. The effect ofSybronwas that court\n                    transcripts could be used by third parties but not by the party who had obtained\n                    discovery of the document. Statutory change in England 35     The position inHarmanandSybronno longer\n                    represents the position in England. The impetus for the change was neatly\n                    summarised inSmithKline Beecham Biologicals SA v Connaught\n                        Laboratories Inc[1999] 4 All ER 498: The law as established inHome Office v\n                            Harmanwas challenged before the European Commission of Human\n                        Rights, and the challenge was amicably settled on an undertaking by Her\n                        Majesty’s Government to seek to change the law so that it would no\n                        longer be a contempt of court to make public material contained in documents\n                        compulsorily disclosed in civil proceedings once those documents had been\n                        read out in open court (seeBibby Bulk Carriers Ltd v\n                            Cansulex Ltd, The Cambridgeshire[1988] 2 All ER 820 at 824,\n                        [1989] QB 155 at 159 per Hirst J). That undertaking was honoured by the\n                        introduction of what is now Ord 24, r 14A, which reads: “Any undertaking, whether express or implied, not to use a\n                            document for any purposes other than those of the proceedings in which\n                            it is disclosed shall cease to apply to such a document after it has\n                            been read to or by the Court, or referred to, in open Court, unless the\n                            court for special reasons has otherwise ordered on the application of a\n                            party or of the person to whom the document belongs”. 36     The English position is now captured in the\n                    Civil Procedure Rules 1998 (SI 1998 No 3132) (UK) (“CPR”) in r\n                    31.22, which reads: (1) A party to whom a document has been disclosed may use the\n                        document only for the purpose of the proceedings in which it is disclosed,\n                        except where – (a) the document has been read to or by the court, or referred to, at\n                            a hearing which has been held in public; (b) the court gives permission; or (c) the party who disclosed the document and the person to whom the\n                            document belongs agree. (2) The court may make an order restricting or prohibiting the use of a\n                        document which has been disclosed, even where the document has been read to\n                        or by the court, or referred to, at a hearing which has been held in\n                        public. (3) An application for such an order may be made\n                        – (a) by a party; or (b) by any person to whom the document belongs. 37     As is immediately evident, Lord\n                    Scarman’s position inHarmanis now the law\n                    in England. Through r 31.22 of the CPR, the English legislature enshrined the\n                    principle of open justice (since documents can be used only if they are read to\n                    or by the court, or referred to, at a hearing which is held inpublic) in the balancing exercise. It must be noted that\n                    an application can still be made to the court - by the party against whom\n                    discovery is ordered or the person to whom the document belongs - to prevent\n                    further use of such documents. It is also worthwhile to note that no reference\n                    has been made to the treatment of transcripts. However, it stands to reason that\n                    if the party who had obtained a document through discovery can use the document\n                    once it is aired in open court, no legitimate reason exists to prevent the use\n                    of transcripts which refer to that document.",
        "Australia": "38     At the federal level, the current position is\n                    similar to the minority position inHarmanand the\n                    current English approach. Rule 20.03 of the Federal Court Rules 2011 (Australia)\n                    reads as follows: (1)    If a document is read or referred to in open court\n                            in a way that discloses its contents, any express order or implied\n                            undertaking not to use the document except in relation to a particular\n                            proceeding no longer applies. (2)    However, a party, or a person to whom the document\n                            belongs, may apply to the Court for an order that the order or\n                            undertaking continue to apply to the document. 39     There are various positions taken among the\n                    Australian states. Rule 21.7 of New South Wales’ Uniform Civil\n                    Procedure Rules 2005 is similar in its effect to the federal legislation. The\n                    positions in Victoria, South Australia and Western Australia are still governed\n                    by common law. 40     InBritish American Tobacco\n                        Australian Services Ltd v Cowell(No\n                        2) (2003) 8 VR 571 (“British American\n                        Tobacco”), the Victorian Court of Appeal followed and\n                    applied the majority approach inHarman. The court\n                    found no reason why a party would be freed of the implied undertaking only\n                    because the document had been used in open court (at [48]). The court at [36]\n                    also agreed with Lord Roskill’s criticism inHarmanof the concept of “public domain” as\n                    “of doubtful precision”. However, the court inBritish American Tobaccoexpressed doubt as to the correctness\n                    of the proposition inSybronthat the party under\n                    the implied undertaking was prevented from even making use of transcripts of\n                    proceedings (at [28]). 41     On the other hand, inK\n                        & S Corporation Ltd & Anor v Number 1 Betting Shop Ltd &\n                        Ors[2005] SASC 228 (“K & S\n                        Corporation”), the Supreme Court of South Australia, after\n                    considering the position taken inBritish American\n                        Tobacco, declined to follow the majority approach inHarmanand instead adopted Lord Scarman’s approach\n                    (at [68]). The court was persuaded that the majority approach inHarmancreated a rule which operated unequally between\n                    the person who had obtained the document through discovery and third parties;\n                    this would be “likely to erode confidence in [the rule]” (at\n                    [65]). The court opined that Lord Scarman’s approach was more consistent\n                    with the principle of open justice (at [66]). 42     InUniflex (Australia) Pty\n                        Ltd v Hanneybel[2001] WASC 138, the Supreme Court of Western\n                    Australia cited Lord Scarman’s approach inHarmanwith approval (at [144]–[149]). However, the court\n                    was not required to decide the issue or to adopt Lord Scarman’s approach\n                    as it decided that “the information reflected in the document was not\n                    brought to light as a consequence of the requirements of the Court concerning\n                    discovery” and thus the principle had no application in the case (at\n                    [148]–[149]).",
        "Canada": "43     InSuzette F Juman v Jade\n                        Kathleen Ledenko Doucette[2008] 1 SCR 157, the Supreme Court of\n                    Canada (hearing an appeal from the Court of Appeal for British Columbia)\n                    declined to follow the majority inHarman.\n                    According to the Supreme Court, the undertaking is spent when “an adverse\n                    party incorporates the answers or documents obtained on discovery as part of the\n                    court record at trial…” (at [51]). 44     In Ontario, the position is governed by\n                    legislation. Rules 30.1.01(3)–(8) of the Rules of Civil Procedure (O Reg\n                    575/07, s 6(1)) (Canada) read as follows: Deemed\n                        Undertaking (3) All parties and their lawyers are deemed to undertake not to use\n                        evidence or information to which this Rule applies for any purposes other\n                        than those of the proceeding in which the evidence was obtained. Exceptions (4) Subrule (3) does not prohibit a use to which the person who disclosed\n                        the evidence consents. (5) Subrule (3) does not prohibit the use, for any purpose, of, (a) evidence that is filed with the court; (b) evidence that is given or referred to during a hearing; (c) information obtained from evidence referred to in clause (a) or\n                        (b). (6) Subrule (3) does not prohibit the use of evidence obtained in one\n                        proceeding, or information obtained from such evidence, to impeach the\n                        testimony of a witness in another proceeding. (7) Subrule (3) does not prohibit the use of evidence or information in\n                        accordance with subrule 31.11 (8) (subsequent action). Order that Undertaking does not\n                            Apply (8) If satisfied that the interest of justice outweighs any prejudice that\n                        would result to a party who disclosed evidence, the court may order that\n                        subrule (3) does not apply to the evidence or to information obtained from\n                        it, and may impose such terms and give such directions as are just. The Ontario position is broader than the English position since in\n                    the former, the implied undertaking ceases the moment the document isfiledin court or given or referred to during a hearing.\n                    In the latter, the document must have actually been used in open court. This\n                    difference, however, was not material to the issue that was before me since the\n                    14 April Minutes had been referred to in open court (see [9]\n                above).",
        "Hong Kong": "45     In Hong Kong, O 24 r 14A of the Rules of the\n                    High Court (Chapter 4A, GN 25/1998) provides the following: Use of Documents(O. 24, r. 14A) Any undertaking, whether express or implied, not to use a document for any\n                        purposes other than those of the proceedings in which it is disclosed shall\n                        cease to apply to such document after it has been read to or by the Court,\n                        or referred to, in open court, unless the Court for special reasons has\n                        otherwise ordered on the application of a party or of the person to whom the\n                        document belongs. This provision was modelled after the previous versions of the\n                    current English statute. Furthermore, inAllied Group Ltd v\n                        Secretary for Justice[2003] HKEC 1221 (at [38]), the Hong Kong\n                    Court of Appeal criticised the decision ofSybronin deciding that a party could only be prevented from using “unused\n                    material” of a prior proceeding but could not be prevented from making\n                    use of transcripts of the prior proceeding.",
        "New Zealand": "46     In New Zealand, the position is similar to the\n                    current position in England. Rule 8.30(4) of the Rules of High Court (New\n                    Zealand) provides as follows: (4) A party who obtains a document by way of inspection or who makes a\n                        copy of a document under this rule— (a) may use that document or copy only for the purposes of the proceeding;\n                        and (b) except for the purposes of the proceeding, must not make it available\n                        to any other person (unless it has been read out in open court). 47     The parenthesis in sub-r (b), which\n                    establishes the minority position inHarman, was\n                    introduced on 1 February 2012. However, even before this, New Zealand’s\n                    Court of Appeal, inWilson v White[2005] 3 NZLR\n                    619 (“Wilson”), had declined to\n                    follow the majority approach inHarman. Instead,\n                    the court adopted Lord Scarman’s minority approach inHarman(at [48]). This was despite the absence of the\n                    parenthesis in sub-r (b) above, which in effect almost created a statutory\n                    prohibition (the provision then in force was reproduced inWilsonat [23]). The court adopted the current English position\n                    because it gave greater priority to the principle of open justice (at\n                    [49]).",
        "The appropriate balance in Singapore": "48     Before me, considerable arguments were made\n                    based on these sections of the Application of English Law Act (Chapter 7A, 1994\n                    Rev Ed) (“AELA”): Application of common law and\n                            equity 3.—(1) The common law of England\n                        (including the principles and rules of equity), so far as it was part of the\n                        law of Singapore immediately before 12th November 1993, shall continue to be\n                        part of the law of Singapore. (2) The common law shall continue to be in force in Singapore, as provided\n                        by subsection (1), so far as it is applicable to the circumstances of\n                        Singapore and its inhabitants and subject to such modifications as those\n                        circumstances may require. … Other enactments not part of law\n                            of Singapore 5.—(1) Except as provided in this Act,\n                        no English enactment shall be part of the law of Singapore. 49     Mr Harry Elias SC submitted thatHarmanandSybronrepresented the common law position before 1993. He further submitted that, by\n                    virtue of s 3(1) of the AELA, I was therefore bound to apply the positions\n                    established by those cases. He further submitted that s 5(1) precluded the court\n                    from considering the legislative changes that had occurred in England followingHarman. Mr Tan Chuan Thye, on the other hand,\n                    submitted that s 3(1) only applied to import substantive common law and equity\n                    principles and not procedural rules of the common law. According to him, since\n                    theRiddickprinciple was procedural in nature, s\n                    3(1) had no effect. In the alternative, he submitted that s 3(2) nevertheless\n                    provided an avenue for the court to modify the common law principles in their\n                    application to Singapore. 50     To me, the correct position is that s 3(1)\n                    read with s 3(2) declare that all of the common law of England (including the\n                    principles and rules of equity, and other substantive and procedural rules that\n                    have become part of the common law of England) in so far as it was part of the\n                    law of Singapore immediately before 12th November 1993, shall continue to be\n                    part of the law of Singapore subject to such modifications that are required to\n                    make it applicable to the circumstances of Singapore and its inhabitants. The\n                    effect of s 5(1) is to make clear that English enactments are not automatically\n                    part of our law, but it does not prohibit the court from considering the effect\n                    of those enactments when developing our own common law and when determining what\n                    modifications pursuant to s 3(2) are applicable having regard to the\n                    circumstances of Singapore and its inhabitants. 51     This reading of the AELA is consistent with\n                    the speech of the then Minister for Law, Prof S Jayakumar (“the\n                    Minister”), in the second reading of the Application of English Law Bill\n                        (Singapore Parliamentary Debates, Official\n                        Report(12 October 1993) vol 61 at cols 611–613)\n                    (“the Second Reading Speech”): Let me now deal with the specific provisions of the Bill. Clause 3 is a\n                        declaratory provision of the existing legal position.It\n                            preserves the corpus of English common law (including the principles and\n                            rules of equity) that now applies or has been received in Singapore as\n                            part of the law of Singapore.It is not intended to change\n                        the legal position as regards the applicability of the common law of\n                        England, which to the extent that it continues to apply, is subject to such\n                        modifications as the circumstances may require. … … Let me now deal with clause 5 of the Bill, which is also a key provision.\n                        Under this clause, no English enactment shall be part of the law of\n                        Singapore except as provided in the Bill. The effect is that no pre-1826\n                        English statute and no Imperial Act (other than the three Imperial Acts\n                        preserved in the First Schedule) will haveany force of\n                            law in Singapore. This clause will remove once and for all\n                        the possibility of some obscure English statute which no one in Singapore is\n                        aware of being one day held to be applicable here. [emphasis added] Furthermore, the Court of Appeal inReview\n                        Publishing Co Ltd and another v Lee Hsien Loong and another\n                        appeal[2010] 1 SLR 52 (“Review\n                        Publishing”) explained the effect of s 3 of the AELA as\n                    follows (at [247]): Implicit in s 3(1) of the AELA is the principle that thebody of English common lawwhich was part of the law\n                        of Singapore immediately before the cut-off date of 12 November 1993\n                        (“pre-AELA English common law”) continues to be the law of\n                        Singapore,but not otherwise. After that\n                        cut-off date, the common law of Singapore would be the common law as\n                        declared and developed by our courts. Furthermore, it should be noted that,\n                        although pre-AELA English common law continues to be part of our law today\n                        by virtue of s 3(1) of the AELA, it continues to be in force here only\n                        “[in] so far as it is applicable to the circumstances of Singapore\n                        and its inhabitants and subject to such modifications as those circumstances\n                        may require” (see s 3(2) of the AELA). In other words, the\n                        application of pre-AELA English common law in Singaporeboth before and afterthe cut-off date of 12 November 1993\n                        is subject to local circumstances (see the Second Charter of Justicevis-à-visthe position prior to 12\n                        November 1993 and s 3(2) of the AELAvis-à-visthe position after that date). [emphasis in original in italics; emphasis added in bold] 52     Neither the Minister nor the Court of Appeal\n                    made any distinction between the substantive and procedural rules of the common\n                    law. In fact, the Minister referred to the “corpusof English common law” while the Court of Appeal\n                    referred to the “bodyof English common\n                    law”. If it was indeed the intention of s 3 to exclude the procedural\n                    rules of the English common law and include only the substantive rules of the\n                    English common law, I would imagine that it would be made clearer either in the\n                    express words of the statute, the Second Reading Speech of the Minister or even\n                    by the Court of Appeal inReview Publishing. With\n                    regards to s 5(1), the Minister in the Second Reading Speech clarified that no\n                    English statute would have anyforce of law in\n                        Singapore(other than the three Imperial Acts preserved in the\n                    First Schedule). As further explained, this was to “remove the\n                    possibility of some obscure English statute which no one in Singapore is aware\n                    of being one day held to be applicable here” (see [51] above). However,\n                    there is no indication that s 5(1) operates to prevent the court from even\n                    considering English enactments when developing the common law in Singapore and\n                    when determining what modifications pursuant to s 3(2) are applicable having\n                    regard to the particular circumstances of Singapore and its inhabitants. If this\n                    was indeed the case, an untenable position would ensue since s 5(1) only refers\n                    to English statutes and therefore the court would only be precluded from\n                    considering English statutes but not statutes from other jurisdictions besides\n                    England when developing our common law in a manner that would be applicable to\n                    the circumstances of Singapore and its inhabitants. 53     Therefore, in the circumstances of the present\n                    case, I may adopt either the majority or minority approach inHarmandepending on which is applicable and more appropriate to\n                    the circumstances of Singapore. In doing so, I may consider any English\n                    enactments post-1993 including any other enactments and the common law in other\n                    jurisdictions in so far as they are relevant. 54     After careful consideration, I found that theRiddickprinciple ceased to apply once a\n                    document had been used in open court. I adopted Lord Scarman’s approach\n                    for three reasons. Firstly, it gives greater priority to the principle of open\n                    justice in the balancing exercise. Secondly, it is not beset with the same\n                    difficulties and anomalies as the majority approach inHarman. Thirdly, it is the route by which most common law\n                    jurisdictions have gone down, either through the common law or by statutory\n                    changes. I thus considered Lord Scarman’s approach to be applicable to the\n                    circumstances of Singapore as a progressive common law\n                jurisdiction. The principle of open justice 55     As mentioned above at [26], theRiddickprinciple and its boundaries are determined by a\n                    balancing exercise which requires the consideration of two factors that are on\n                    either side of the scale—the administration of justice and the right to\n                    privacy and confidentiality. 56     The administration of justice is what compels\n                    discovery since it allows the court to ascertain the truth and do justice\n                    between the parties. To this end, those who advocate the majority position inHarmanclaim that holding that theRiddickprinciple ceases when a document is used in open\n                    court undermines the administration of justice because it impedes proper\n                    discovery, as parties would not be forthcoming during the discovery process. I\n                    think this argument is misplaced. 57     Firstly, discovery is not a voluntary process.\n                    Rather, it is an obligation since it a court-ordered process under O 24 r 1 of\n                    the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“ROC”). In fact,\n                    the significance of the obligation is demonstrated in the consequences of\n                    non-compliance. The court, under O 24 r 16, has a whole host of sanctions which\n                    include committal proceedings or even the dismissal of the claim or striking out\n                    of a defence and entering of judgment. In this regard, it is also pertinent to\n                    note that a solicitor under the Legal Profession (Professional Conduct) Rules\n                    (Cap 161, R 1, 2010 Rev Ed) has an ethical duty to cease to act if he becomes\n                    aware of the existence of a document which should have been but has not been\n                    disclosed on discovery and the client fails forthwith to disclose it (r\n                        58(b)). Therefore, whatever concern that the\n                    administration of justice may be impeded because discovery may be discouraged,\n                    should theRiddickprinciple no longer apply once\n                    the document is used in open court, would be adequately addressed by the\n                    sanctions which may be imposed on the non-complying party or even the errant\n                    solicitor. 58     Secondly, even though theRiddickprinciple ceases once the document has been used in open\n                    court, it does not prevent a party from applying to court in order for the\n                    undertaking to continue. As mentioned above at [26], the court has the\n                    discretion to release or modify the undertaking. In England, the current\n                    position is that a party who discloses or owns the document can apply to court\n                    for an order restricting or prohibiting the use of a document which has been\n                    disclosed even where the document has been read to or by the court, or referred\n                    to, at the hearing which has been held in public (see [36] above). Since theRiddickprinciple has its juridical\n                    foundations in the common law and the court can modify the undertaking, I see no\n                    reason why such an approach cannot be adopted in Singapore. Therefore, any fear\n                    that discovery might be discouraged evaporates once a party realises that it may\n                    apply to court for theRiddickprinciple (and thus\n                    the implied undertaking) to continue despite the document being used in open\n                    court. 59     The crucial question that remains is whether\n                    the principle of open justice is engaged and so, whether it features in the\n                    balancing exercise under the rubric of administration of justice. This is to me,\n                    the nub of the disagreement inHarman(see above\n                    at [30]). In Singapore, the principle of open justice is given statutory\n                    recognition in s 8(1) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev\n                    Ed) which provides the following: 8.—(1) The place in which any court is\n                        held for the purpose of trying any cause or matter, civil or criminal, shall\n                        be deemed an open and public court to which the public generally may have\n                        access. The principle of open justice was also discussed inTan Chi Min v The Royal Bank of Scotland plc[2013] 4\n                    SLR 529. There the main question was when court documents, such as affidavits\n                    filed pursuant to interlocutory applications, should be made available for\n                    public access and inspection. Lee Seiu Kin J observed (at [14]): 14    In sum, the principle of open justice requires that\n                            decisions by judges (and Registrars) in court proceedings be amenable to\n                            scrutiny by members of the public through the inspection of documents\n                            filed in court that were considered in the decision-making process. This\n                            serves to promote public confidence in the administration of justice.\n                            However, it does not mean that all court documents are open to\n                            inspection by members of the public the moment they are filed in court,\n                            for the principle of open justice is engaged only when a court has made\n                            a decision involving the consideration of those documents. 60     In the present case, the document in question\n                    had been used in open court in a prior hearing. The principle of open justice is\n                    clearly engaged. Therefore, by holding that theRiddickprinciple ceases once a document is used in open court,\n                    proper deference and recognition is given to the principle of open\n                    justice. Difficulties with the majority approach inHarman 61     Another reason for holding that the minority\n                    approach inHarmanshould be adopted was the\n                    difficulties the majority approach was fraught with. As seen above at [32], the\n                    majority approach draws a distinction between the document itself and the\n                    transcripts (which may contain the entire document if it is read in court). The\n                    former is subject to theRiddickprinciple but not\n                    the latter. I, for much the same reasons as the judge inK\n                        & S Corporation, find such a distinction between the document\n                    disclosed and the transcripts to be untenable. The absurdity of this situation\n                    is further shown bySybron(see [34] above) which\n                    held that the party to whom the document was disclosed cannot make use of even\n                    the transcripts while third parties may avail themselves of them. Apart from\n                    ignoring the principle of open justice, this holding creates an unjustifiable\n                    distinction between the party to whom the document was disclosed and third\n                    parties when it comes to the use of transcripts. It is also worthwhile to note\n                    that even inBritish American Tobacco(at [40]),\n                    where the majority position was preferred, the court criticised the decision ofSybron. 62     The difficulty with theHarmanmajority approach is also highlighted by the three\n                    different approaches each of the law Lords took with regards to the common\n                    practice mentioned at [33]. The minority approach is not beset with such\n                    difficulties. 63     A criticism levelled at the minority approach\n                    is that the concept of “public domain” is “of doubtful\n                    precision” (see [40] above). I do not share these misgivings. As\n                    explained by Debelle J inK & S Corporationat\n                    [67], it is simply “used to describe that which was once confidential but\n                    which has become public knowledge.” Debelle J further explained that the\n                    difficulty lies mainly with deciding, as a question of fact, when the document\n                    has become public knowledge. To me, there is sufficient clarity in the view that\n                    a document is used in open court if it is read to or by the court, or referred\n                    to in the course of a hearing. 64     Mr Harry Elias SC also directed me to the\n                    following passage from the Court of Appeal inPertamina: 40    The principles embodied inRiddickare straightforward enough, and its rationale\n                            equally clear (and for a comprehensive and relatively recent summary,\n                            see the English High Court decision ofCobra Golf Inc\n                                v Rata[1996] FSR 819 at 830-832). There are occasional\n                            difficulties surrounding the precise parameters of the principle (see,\n                            for example, the House of Lords decision ofHarman v\n                                Secretary of State for the Home Department[1983] 1 AC\n                            280, although the statutory changes effected thereafter (in the UK\n                            context) appear to have generated separate difficulties (seeGee([19]supra) at\n                            paras 24.002-24.003)). Fortunately, they do not arise on the facts of\n                            the present proceedings. The main difficulty referred to in Steven Gee,Commercial Injunctions(Sweet & Maxwell, 5thEd, 2004) at paras 24.002–24.003 was the width of the\n                    release of the undertaking, specifically, whether it went so far “as\n                    enabling a person to commence new proceedings based on previously protected\n                    information”. InTaylor and Another v Director of the\n                        Serious Fraud Office and Others[1999] 2 AC 177\n                        (“Taylor”), the House of Lords\n                    held that in the context of criminal proceedings, there was an implied\n                    undertaking by the defendant not to use the materials disclosed other than for\n                    purposes of the defence since allowing otherwise would have a chilling effect on\n                    investigative processes. Lord Hoffmann, in accepting the possibility that the\n                    new English position might have been drawn too widely, considered at 212 that\n                    there was “much force” in the view that the court “should\n                    nevertheless retain control over certain collateral uses of the documents,\n                    including the bringing of libel proceedings.”Taylorwas of limited application in the current\n                    case because of the different regimes in place for disclosure of documents in\n                    criminal proceedings in England and Singapore. With reference to Lord\n                    Hoffmann’s point, I was cognisant of the fact thatHarmaninvolved disclosure to a journalist, who subsequently\n                    wrote a scathing article, while the situation here was slightly different in\n                    that the plaintiff wished to institute a fresh suit based on matters disclosed\n                    in the 14 April Minutes. However, I did not believe this difference was\n                    significant enough to warrant a different approach. The position taken in other jurisdictions 65     The third and final reason why I favour the\n                    minority approach inHarmanis that it has been\n                    the preferred approach around most of the common law world. Courts in New\n                    Zealand, South Australia, Western Australia and the Supreme Court of Canada have\n                    taken it upon themselves to develop the common law along the lines of the\n                    minority inHarman. In addition to this,\n                    legislatures in Australia (both at the federal level and in New South Wales),\n                    Hong Kong, Ontario and New Zealand have made changes modelling the current\n                    English approach.",
        "Conclusion": "66     To summarise, theRiddickprinciple ceases to apply once a document is used in\n                    open court. However, the party who discloses the document or a party who owns\n                    the document may apply to the court for the implied undertaking to\n                    continue. 67     The Defendants, who disclosed the 14 April\n                    Minutes pursuant to their discovery obligations in the Year 2006 Suit, made no\n                    application to the judge during the open court hearing in which the document in\n                    question was used to order the continuation of the undertaking so that no party\n                    could use that document subsequently in other court proceedings. 68     Since the 14 April Minutes was used in open\n                    court and the court had not made any order for the undertaking to continue, I\n                    accordingly held that the plaintiff could use the document in the current suit\n                    and ordered the trial to continue."
    }
}