{
    "case_title": "Kao Chai-Chau Linda\n      v\n      Fong Wai Lyn Carolyn and others",
    "ncitation": "[2015] SGHC 260",
    "coram": "Steven Chong J",
    "sections": {
        "Introduction": "A.1    As professionals, all insolvency practitioners need to be “fairly, reasonably, and adequately remunerated” (seeRe Econat [74]). This is a matter not just of fairness, but also of sound commercial practice. As observed inRe Independent Insurance (No 2)at 654a–c, it is in the interest of the persons whose assets are being administered (and, by extension, the public at large) that persons with the proper qualifications, experience, skill, and integrity be available to assume office as insolvency practitioners. Unfortunately, the present regime — where the work is performed first in thehope or expectationthat remuneration or a substantial part thereof will later be approved — only sets the stage for future disagreement. Whenever the fees proposed by the insolvency practitioners are slashed by the courts (as they almost invariably are), it only serves to give accountants the impression that such appointments may not ultimately be worth their time, discouraging the very best from taking up office. This is to the detriment of all. A.2    For this reason, I believe that the establishment of a more stable and predictable remuneration regime for insolvency practitioners is a matter of the public interest. The central problem, as I see it, is the lack of certainty. Insolvency practitioners often wade into the murky waters of an assignment without knowing precisely what is expected of them., They do not know what matters are within their remit and what falls outside; they are not sure of the size of the team they ought to bring; they do not know what matters should be left to the lawyers and what matters they should take charge of. A.3    This is where I believe that a system of costs scheduling can come in useful. I propose to examine this proposal in four parts: first, I will briefly survey the experience of other jurisdictions; second, I will present the case for the introduction of costs scheduling; third, I will set out a proposed framework for the costs schedule; and last, I will cover issues which may arise after a costs schedule is introduced.",
        "The facts": "7       Airtrust was set up by the late Mr Peter Fong in 1972. The plaintiff is a shareholder of Airtrust and was its managing director. The first and second defendants, Carolyn Fong Wai Lyn (Mr Peter Fong’s eldest daughter) and Anthony Craig Stiefel, are both directors of Airtrust. The third defendant, Mr Alvin Hong, is a minority shareholder with a 2% stake in Airtrust. For ease of reference, I will refer to them collectively as “the respondents” since they were all united in opposition to the application filed by the R&M. 8       Following Mr Fong’s passing in 2008, a number of legal actions were commenced against members of the late Mr Fong’s family, against Airtrust, and also by Airtrust against others (see,eg,Airtrust (Singapore) Pte Ltd v Kao Chai-Chau Linda and another suit[2014] 2 SLR 673;Fong Wai Lyn Carolyn v Airtrust (Singapore) Pte Ltd and another[2011] 3 SLR 980). One of these proceedings is the present suit — Suit No 428 of 2010 — wherein the plaintiff sought to restrain the defendants from holding an Extraordinary General Meeting to remove her from her position as managing director and director of Airtrust. 9       On 17 January 2012, the parties to the present action reached an agreement to place Airtrust into receivership pending a negotiated settlement of the outstanding legal suits in which Airtrust was involved. This was achieved by way of a consent order dated the same day. The R&M were to “manage and carry on the business of [Airtrust] in place of its Board of Directors until further order” and their terms of reference included, but were not limited to, the management of Airtrust’s bank account and its existing employment contracts.",
        "The previous bills of costs": "10     Since their appointment, the R&M have filed several summonses to seek approval for their bills of costs. (a)     On 8 June 2012, they filed Summons No 2855 of 2012 to seek remuneration of $2.1m for three months’ work performed between 17 January 2012 and 13 April 2012 (“the First Bill”). The R&M offered a discount of 30%. When the matter came before Choo Han Teck J on 4 September 2012, he applied a further 12% reduction on top of the 30% discount offered (making for a final reduction of 42% from the original figure) and approved a sum of $1.21m. (b)     On 8 February 2013, they filed Summons No 760 of 2013 in respect of the bill of costs for three months’ work performed between 14 April 2012 and 20 July 2012 (“the Second Bill”). The proposed remuneration was again $2m but no discount was offered in this instance. Lee Seiu Kin J awarded a sum of $1.24m, a reduction of 38% from the initial sum proposed. (c)     On 18 September 2013, they filed Summons No 6009 of 2013 to seek a sum of $1.6m for six months’ work performed between 1 July 2012 and 31 December 2012 (“the Third Bill”). A discount of 10% was offered at the time of the hearing. Lee Kim Shin JC applied a further discount and approved a final sum of $1m (a total reduction of 38% from the initial figure proposed). 11     I note that the reductions were applied to the professional fees charged, and not the disbursements (which, in any case, only made up a small fraction of the total bills). This approach is correct. A claim for disbursements is a claim to be reimbursed for expenses reasonably incurred in the performance of a stipulated task. As long as they were reasonably incurred (and there was no suggestion that they were not), there should be no reason that the R&M should not be reimbursed in full.",
        "The present application": "12     On 12 August 2014, the R&M’s solicitors wrote to the respondents to inform them that professional fees and disbursements in the sum of $3.1m had been incurred for work done between 1 January 2013 and 31 December 2013 (“the Applicable Period”). The R&M offered a discount of 30% on the professional fees (taking the final figure down to $2.18m) and proposed that this revised figure be presented to court for approval by agreement. The respondents replied separately, each taking issue both with the quantum of the fees and with the level of detail provided in support of the fees claimed. 13     Despite being unable to secure the respondents’ agreement, the R&M went ahead and filed Summons No 4976 of 2014 on 3 October 2014 seeking approval for a sum of $3.1m. Accompanying the application was an affidavit sworn by Mr Aaron Loh Cheng Lee (one of the R&M) which contained (a) the accounts of Airtrust for the applicable period and (b) a spreadsheet detailing the hours logged by the R&M for the applicable period. 14     Parties first attended before me on 12 January 2015. On that occasion, the third defendant and the plaintiff both argued that the supporting affidavit did not contain an adequate level of detail, leaving them “handicapped” and unable to properly assess whether the quantum of fees claimed was reasonable. The plaintiff pointed out that the supporting affidavit for the Third Bill contained a detailed breakdown of the time spent by each fee earner for each category of work claimed and requested that a similar level of detail be provided here. I agreed that this was sensible and adjourned the application to allow a supplementary affidavit to be filed. 15     On 2 February 2015, Mr Aaron Loh filed a supplementary affidavit containing the requested information. Following that, each of the respondents wrote to the R&M, taking issue with specific items in the timesheets and requested for further information. The additional information was duly provided by way of yet another affidavit filed by Mr Aaron Loh on 4 March 2015 wherein he provided responses to each of the queries raised. 16     When the parties attended before me on 9 March 2015, the respondents continued to indicate their unease with the level of fees charged and pointed to perceived inefficiencies in the R&M’s work processes and the possibility of a duplication of work. The R&M responded to each of the respondent’s arguments and contended that their offer of a 30% discount ought to be sufficient to deal with any concerns over inefficiencies in their work. 17     After hearing the parties, I reduced the quantum of professional fees sought by 40% (ie, a further 10% above the 30% discount offered) to $1.8m but allowed the disbursements of $30,000 as charged.",
        "The law on the remuneration of court-appointed receivers": "18     Before I give the detailed reasons for my decision, I think it is useful to set out the principles which guide the exercise of the court’s discretion in this area. This section will be divided into three parts. First, I will begin with the role and function of court-appointed receivers. Second, I will examine the principles that guide the court in its determination of a receiver’s remuneration. Third, I will explain the methodology applied by the courts in assessing what the appropriate remuneration ought to be. Before going further, I make three important clarifications. 19     First, I note that, historically, there was a distinction made between “receivers” on the one hand and “managers” on the other. The former were confined only to the collection and securing of the rents, income and profits whereas the latter were empowered also to buy, sell, and manage the business as a going concern (seeRe Manchester and Milford Railway Company ex parte Cambrian Railway Company(1880) 14 Ch D 645 at 653). However, it appears that this distinction is not often drawn today (see Hubert Picarda,The Law Relating To Receivers, Managers and Administrators, (Tottel Publishing, 4th Ed, 2006) (“Picarda”) at pp 5 and 6). Order 1 r 4(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”) explicitly provides that any reference to “’receiver’ includes a manager or consignee.” For the remainder of this judgment, therefore, I will refer to both receivers and managers as “receivers”simpliciterand to the law governing their appointment, duties, and remuneration as the “law of receivership”. 20     Second, the law of receivership may be divided into that pertaining to privately appointed and court-appointed receivers (seePicardaat p 1). The appointment of a private receiver flows from the exercise of a creditor’s contractual powers (usually under the terms of a debenture) granted by a company. Thus, the grant of remuneration to private receivers falls to be governed by the terms of the contract which forms the basis of their appointment (see Saheran Suhendran bin Abdullah, Lim Tian Huat, and Edwin Chew,Corporate Receivership: The Law and Practice in Malaysia and Singapore(Butterworths, 1997) (“Corporate Receivership in Malaysia and Singapore”) at p 327). By contrast, curial receivership traces its origins to the practice of the Court of Chancery where a receiver was appointed in a wide variety of situations where the interim protection of property was required (seeCapewell v Revenue and Customs Comrs and another[2007] 1 WLR 386 at [19] per Lord Walker). Thus, the principles governing the remuneration of court-appointed receivers still bear an equitable accent. It is the latter — the remuneration of court-appointed receivers — which will be the focus of this decision. 21     Third, even though the specific issue which is before this court is the remuneration of receivers, the general principles are equally applicable to the remuneration of other insolvency practitioners whose offices also have a fiduciary character (seeRe Econ Corp Ltd (in provisional liquidation) [2004] 2 SLR(R) 264 (“Re Econ”) at [45]). Thus, I will draw liberally from cases dealing with the remuneration of other insolvency practitioners (eg, liquidators, judicial managers, trustees/nominees in bankruptcy) where they are relevant, bearing in mind the subtle differences that may exist as a result of differences in the relevant statutory provisions.",
        "The nature, function, and purpose of curial receivership": "22     The appointment of receivers was the exclusive preserve of the Court of Chancery until the fusion of law and equity through the passage of the Judicature acts. Section 25(8) of the Supreme Court of Judicature Act 1873 (c 66) (UK) conferred all divisions of the High Court with the power to appoint a receiver where it appeared to the court to be “just and convenient” to do so (seeCorporate Receivership in Malaysia and Singapore atpp 377 and 378). 23     In Singapore, the power of the High Court to appoint a receiver is statutorily conferred by s 4(10) of the Civil Law Act (Cap 43, 1999 Rev Ed), which provides that a receiver may be appointed “by an interlocutory order of the court, either unconditionally or upon such terms and conditions as the court thinks just, in all cases in which it appears to the court to be just or convenient that such order should be made.” Section 18(2) of the Supreme Court of Judicature Act (Cap 322, 2007) (“SCJA”), read with para 5 of the First Schedule, provides that the High Court has the “[p]ower before or after any proceedings are commenced to provide for — (a) theinterim preservation of property which is the subject-matter of the proceedingsby sale or by injunction or the appointment of receiver … or in any manner whatsoever” [emphasis added]. 24     Despite the differences in wording, the purport of the legislation is clear: the central purpose of receivership is the interim preservation of disputed property pending its final resolution in the main action (seeLee Kuan Yew v Tang Liang Hong and another and other suits[1997] 1 SLR(R) 328 (“LKY v TLH”) at [7]). In discharging this role, receivers act as officers of the court. InMirror Group Newspapers plc v Maxwell and others (No 2)[1998] 1 BCLC 638 (“Mirror Group”), Ferris J described it the following way (at 648a–c). The essential point which requires constantly to be borne in mind is thatoffice-holders are fiduciariescharged with the duty of protecting, getting in, realising and ultimately passing on to others assets and property which belong not to themselves but to creditors or beneficiaries of one kind or another. They are appointed because of their professional skills and experience and they are expected to exercise proper commercial judgment in the carrying out of their duties.Their fundamental obligation is, however, a duty to account, both for the way in which they exercise their powers and for the property which they deal with. [emphasis added in italics and bold italics] 25     This notion of a “duty to account” has both a narrow and a wider dimension. In its narrow sense, it means that receivers must stand ready to explain, in some detail, the actions that they undertook in the discharge of their office. This principle is also embodied in statute. For example, O 30 r 4 of the ROC imposes a duty on receivers to submit accounts on a regular basis. In the wider sense, this duty to account behoves receivers to explain and, if necessary, to account for any reduction in the value of the subject matter of the appointment. This includes sums paid out to them as remuneration, which will necessarily be taken out of the assets of the company they are managing. This has two important implications. Burden of proof on receivers to justify their remuneration 26     The first is that the burden of proof falls on the receiver to justify the quantum of his fees. As explained by Ferris J inMirror Groupat 648c–f, this implication flows as a corollary of the duty to account. Office-holders are nowadays not normally expected to act gratuitously. It is salutary to remember, however, thatthe rule that a trustee must not profit from his trust is a rule that applies to all kinds of person who are in a fiduciary position(seeSnell's Equity(28th edn, 1982) pp 249–252).The allowance of remuneration in particular cases represents an exception to this rule, but it inevitably involves a conflict between the interest of the fiduciary who is to receive such remuneration and the interests of those to whom the fiduciary duties are owed, who will bear whatever remuneration is allowed.A consequence of this is that it must be for the office-holder who seeks to be remunerated at a particular level to justify his claim.As I see it this is simply one aspect of his obligation to account. What he retains for himself out of the property which comes into his hands as office-holder is not available for those towards whom he is a fiduciary.He cannot therefore account for it by paying it over. The only other way in which he can account for it is by showing that he ought to be allowed to retain it for himself. But this is necessarily a matter for him to establish. [emphasis added in italics and bold italics] 27     To that end, the receiver must provide full particulars (supported by proper records) to justify his entitlement to be paid the sum sought. Chiefly, this involves explaining (a)whatwas done; (b)whyit had to be done; and (c) why it had to be donein the manner as employed. The level of detail required will be proportionate to the complexity of the receivership (seeMirror Groupat 648h). An excellent non-exhaustive list of matters which should be included in any remuneration application may be found at para 21.4.2 of thePractice Direction (Insolvency Proceedings) 2014[2014] BCC 502 (“UK Insolvency PD 2014”). Some of the important areas of information that must be covered include: the profile and qualifications of the team, the areas of work performed and the time spent, and the receivers’ general policyvis-à-visthe capture of value (eg, steps taken to avoid duplication of work or the steps taken to ensure that work is performed by persons of an appropriate seniority). 28     As a practical matter, one difficulty that is often encountered is that the information (particularly where time-based costing is used, since a greater level of information is required) is often presented in a haphazard and unhelpful manner. I am glad to state, however, that this was not my experience in this summons. I found the bills of costs tendered by the R&M to be clear and very helpful and I commend the approach they took for general adoption. In gist, what they did was provide the relevant information at three different levels of detail, starting with the most general and moving to the more specific. (a)     “Level 1” — The first spreadsheet was a succinct summary of the work performed by the entire team for the period of assessment presented in a single page. The names of each member of the team were found in separate rows. In respect of each team member, the following information was provided: (i) the period of engagement; (ii) the total number of billable hours spent; (iii) the charge-out rate; and (iv) the total time-cost. LEVEL 1NameTitlePeriod of engagementTime spentCharge out rateTime-cost (% of total)APartner1 year1001000100000 (36%)BManager1 year200500100000 (36%)CAssociate1 year30025075000 (28%)Total----275000   (b)     “Level 2” — The second set of spreadsheets focused on the general categories of work done. Each category of work occupied a separate row and for each category of work, the following information was provided in separate columns: (i) a brief description of the work; and (ii) the total time spent on each category by each team member on that category of work. LEVEL 2Classification of workDescriptionTime spentABCManagementOperations of businesses.3010070ComplianceFiling of GST returns; annual returns.2030100LegalManagement of suit XX/2014; YY/2013.302050HRRetrenchment of staff; hiring.205080Total-100200300   (c)     “Level 3” — The third set of spreadsheets focused on individual tasks. Each task occupied a separate row and for each task, the following information was provided: (i) a brief description of what the task entailed; (ii) whether it was complex or urgent; (iii) detailed comments on problems faced or general remarks on the nature of the task; and (iv) the time spent by each team-member on the task. LEVEL 3TaskDetailsABCTotalManagement (200h)Finalisation of sale of company vehicleNegotiated with buyers. Tight timelines due to urgency of sale.5101025Ongoing bank reconciliationsSeven accounts across three banks.-204060Reviewing renovation quotationsRenovations scheduled to commence in middle of the year. Received quotations from three bidders10301050Organisation of AGMSourced for venue, prepared statutory accounts. Prepared notice of meeting.15401065Sub-Total3010070-Total200   29     I do not expect that every engagement will require this level of detail. The guiding principle is always one of proportionality: the level of detail should be commensurate with the complexity of the task (see [27] above). I also accept that adopting this method entails an inevitable duplication in the information presented since the information in Levels 1 and 2 are simply derivations of the information presented at Level 3. However, to my mind, that is precisely the point: it facilitates both a macroscopic as well as a microscopic examination of the bill, as the situation requires. Doubts resolved against the receivers 30     The second implication of the duty to account is that any element of doubt as to the propriety of remuneration should be resolved against the receivers (seeMirror Groupat 649b). This is because the award of remuneration to fiduciaries is an exception to the general rule that they are not to make a profit out of their office. Thus, if the receivers do not discharge the burden of proving their case for the remuneration as claimed, they ought not to be entitled to it.",
        "Remuneration must be “proper”": "31     Order 30 r 3(3) of the ROC provides that “[a] person appointed receiver shall be allowed suchproper remuneration, if any, as may be fixed by the Court” [emphasis added]. The trouble, however, is that the expression “proper” is the statement of a legal conclusion rather than an aid to analysis. It still begs the question: what is “proper”? In my judgment, “proper” remuneration is one which is afair,reasonable, andproportionatereflection of thevalueof the services rendered. Remuneration is a fair reward of value, not an indemnity against cost 32     The starting point for any inquiry into proper remuneration is the oft-cited dictum of Ferris J inMirror Groupat 652a, that “remuneration should be fixed so as to reward value, not so as to indemnify against cost” (approved of inRe Econat [50]). The reason for this emphasis on value-based remuneration is that, as fiduciaries, receivers are entitled to receive fair recompense which reflects the value of their stewardship but no more. They do not even have an automatic right to recover all expenses incurred (not even if these expenses were incurred in good faith) unless they can show that these expenses were reasonably incurred in the discharge of their stewardship (see [11] above). 33     How, then, is “value” to be measured? InRe Econat [50], V K Rajah JC (as he then was) wrote that the “value” of an insolvency practitioner’s contribution was to be measured in terms of “the difference the insolvency practitioner has made to the matter”. This “difference”, it seems to me, must be assessed in relation to the purpose of the receiver’s appointment. The central inquiry is whether the objectives of the receivership (which are contained in his terms of reference) have been attained. At its core, this means the preservation of the assets of the company (see [24] above). However, where the receivers’ terms of reference provide for broader objectives (as it does in the present), the remit of the inquiry of “value” will concomitantly be wider. Several further useful guiding propositions can be distilled from the cases. 34     First, the fact that the receivers have performed work that benefits the company is not a sufficient basis for remuneration if the work done is outside the remit of the receivership (seeIde v Ide and others(2004) 50 ASCR 324 (“Ide”) at [47]). Since the question of “value” is to be measured by a receiver’s success in achieving the objects of the receivership, it follows that he should not ordinarily be remunerated for performing work which isultra vireshis terms of reference, even if such work furthered the company’s interests. For example, inVenetian Nominees Pty Ltd v Conlan(1998) WASC 273 (“Venetian Nominees”), the Supreme Court of Western Australia affirmed the decision of the Master to disallow the provisional liquidator’s claim for the costs of preparing statutory returns on the financial health of the company because that task (while “valuable” in a general sense) was the duty of the directors and not the provisional liquidator. 35     Second, in assessing whether a particular act ought to have been performed, some margin of appreciation should also be extended. While the general principle is that the court will not permit recovery of services which have been performed without prior sanction (seeBristowe v Needham(1847) 2 Ph 190), one should not expect a receiver caught up in the flurry of activity in the marketplace to have the same luxury of calm and dispassionate analysis that is afforded to those called on to assess his actsex post factoin the confines of the courtroom. As explained by V K Rajah JC (as he then was) inRe Econat [58]): …In determining whether particular tasks are within the insolvency practitioner’s mandate, the courts ought to take a practical approach. In the heat of urgent decision-making, insolvency practitioners may make decisions or take steps which may, in retrospect, prove to be unnecessary or ineffective. They should not be penalised for such decisions. If an impractical standard is set, insolvency practitioners will be crushed between the upper and nether millstones. The test postulated by Ferris J in theMirrorcase at 649 seems a just one: [T]he test of whether office-holders have acted properly in undertaking particular tasks at a particular cost in expenses or time spent must bewhether a reasonably prudent man, faced with the same circumstances in relation to his own affairs, would lay out or hazard his own money in doing what the office-holders have done.… [emphasis in original omitted; emphasis added in italics] 36     For example, inDovechem, the liquidators had spent a substantial amount of time pursuing a claim in China which eventually turned out to be time-barred. At first instance, the Assistant Registrar disallowed the claim on the basis that this suit should not have been commenced in the first place, ruling that the liquidators ought to have appreciated that it was doomed to fail from the start. On appeal, Judith Prakash J disagreed with the Assistant Registrar’s decision (at [55]–[57]). She found that the liquidators, though familiar with Chinese business regulations, could not reasonably be expected to have beenau faitwith Chinese laws on limitation periods. Further, she also observed that it was somewhat unfair for the majority shareholders to now oppose the liquidators’ entitlement to be remunerated for this service since they were the ones who had pressed the liquidators to commence the claim in the first place. The majority shareholders had likewise failed to spot the time-bar issue despite being in possession of the loan documents (which formed the basis of the claim) from the outset. In the circumstances, it could not be said that the work done in relation to the matter was wasted and therefore should not be remunerated. 37     Third, the notion of “value” cannot be construed only in monetary terms (seeDovechemat [33]). The generation of financial benefit is not the only index of value. In many cases, the contributions of a receiver will not manifest in a direct financial benefit to the company and may not easily be quantified (eg, where the objective of receivership is not the generation of profit but, as in the present, the management of the company pending the resolution of its legal disputes). However, it may still be of value and can properly be the subject of a claim for remuneration. The remuneration must be fair, reasonable and proportionate 38     The expression “fair, reasonable and proportionate” should not be read disjunctively but must instead be understood holistically. In essence, it means that the remuneration awarded must be commensurate with the nature, complexity, and extent of work which had to be undertaken (seeUK Insolvency PD 2014at paras 21.2.3(5) and (6)). Underlying this principle, I think, is a simple point: receivers, like all insolvency practitioners, function in an environment of scarcity. The reality is that all choices involve trade-offs and, sometimes, the cost of rendering a particular service is just too high (when compared to the benefits which accrue) such that a receiver cannot justifiably be allowed to claim for the cost of rendering that service. As explained by Ferris J inMirror Groupat 649c–d, insolvency practitioners are “expected to deploy commercial judgment, not to act regardless of expense.” It is therefore wholly insufficient to state that what they have done is within their terms of reference. They must also demonstrate that the cost of paying them for their service can be justified by the benefits that have accrued for the company. 39     In the most general sense, this means that the total sum awarded cannot be out of proportion with the value of the company’s estate. InMirror Group, for example, the receivers were tasked with asset recovery. They succeeded in realising a sum of £1.6m. However, they then claimed a sum of £745,000 in professional fees and a further £705,000 in legal fees and other disbursements, leaving only a scant £43,428 for the estate. Ferris J found the figures “profoundly shocking” and observed that “[i]f the amounts claimed are allowed in full this receivership will have produced substantial rewards for the receivers and their lawyers and nothing at all for creditors of the estate” (at 645c). Similarly, inRe Peregrine Investments Holdings Ltd & Ors[1998] 3 HKC 1, the provisional liquidators put up a bill of HK$76m for 63 days of work — a sum achieved, in part, because many individuals in the provisional liquidators’ teams had apparently clocked daily billable averages “well into” the double digits on a sustained basis over 30 days and more. Le Pichon J said, with no small amount of understatement, that the overall size of the bill and the sheer number of billable hours involved (which she described at [6] as the product of “apparent marathon feats”) left her “greatly troubled” (at [14]). It goes without saying that bills of this sort must almost certainly be impugned on the basis that they are neither fair nor reasonable nor proportionate when assessed against the benefits obtained. 40     In assessing whether the sum claimed is a fair, reasonable and proportionate one, I think a good starting point would be the list of factors found at r 69.7 of the English Civil Procedure Rules 1998 (SI 1998 No 3132) (UK), which English courts are required to take into account when determining an appropriate quantum of remuneration: (a) the time properly given by him and his staff to the receivership; (b) the complexity of the receivership; (c) any responsibility of an exceptional kind or degree which falls on the receiver in consequence of the receivership; (d) the effectiveness with which the receiver appears to be carrying out, or to have carried out, his duties; and (e) the value and nature of the subject matter of the receivership. I observe, parenthetically, that this list is similar to that found in the Insolvency Rules 1986 (SI 1986 No 1925) (UK), which apply to other insolvency practitioners.",
        "The role of the court": "41     The role of the reviewing court is not to scrutinise the minutiae of the bill, but to consider matters of principle (seeIdeat [39]). This is a concession both to resource constraints as well as limited institutional competence of the courts in this area. As observed by Hoffmann J inIn re Potters Oils Ltd[1986] 1 WLR 201 at 207, “the court is ill-equipped to conduct a detailed investigation of receivers’ charges on an itemised basis. A judge could not do so without being expensively educated by expert evidence”. In other words, the function of the court is to examine the bill to determine if there are material flaws in the methodology of its preparation or any incorrect premises which have been adopted which can properly justify an adjustment of the figures presented. 42     It is well established that in performing its task, the court’s inquiry is not limited only to matters over which queries have been raised. As explained by the Supreme Court of Western Australia inVenetian Nomineesat 14, the absence of dissentients does not absolve the court of the duty of scrutinising the bills closely. At the end of the day, it is the function of the court to arrive at a determination of what the proper quantum of remuneration ought to be after “considering the material proffered and bringing an independent mind to bear on the relevant issues.” 43     InRe Stockford Ltd (subject to deed of company arrangement); Korda and Another (as joint and several deed administrators)(2004) ACSR 279 (“Re Korda”), Finkelstein J adopted a two stage approach towards the determination of the appropriate quantum to be awarded (at [47]): (a)     At the first stage, the court has to arrive at a working figure (which he, following the terminology applied in the United States, calls a “lodestar” amount). This figure is usually calculated on a time cost basis (ie, the “number of hours reasonably spent by the insolvency practitioner multiplied by a reasonable hourly rate”). In arriving at this figure, the court is not limited to accepting the figures provided by the applicants at face value. Instead, it has to make necessary adjustments to account for its assessment of whether the hourly rates levied are reasonable, having regard to such information it may have on the standard rates levied by the industry or with reference to previous rates levied by the same professionals. The court should determine whether the hours claimed for were reasonably spent and subtract claims for billable hours which have not been adequately supported by evidence. (b)     At the second stage, the court should adjust this provisional figure. To the extent that any quantifiable adjustments can be made (eg, where specific quantified heads of claim are disallowed), these should first be factored in before a further percentage reduction is applied (once again, applying the usual “broad brush”: seeDovechemat [81] and [84])) to reflect the court’s assessment of what a fair and reasonable sum ought to be. 44     It seems to me that the two-stage approach articulated by Finkelstein J has much to commend it and I respectfully agree that this is an appropriate approach to be employed in the circumstances. I must stress, however, that the broad brush approach is not a charter for unfettered discretion. Instead, the court must exercise its discretion judicially, with reference to the principles articulated in the preceding paragraphs, taking into account all relevant information that have been presented by the parties and requesting for further particulars if need be (seeRe Roslea Path Ltd (in liquidation)[2013] 1 NZLR 207 (“Re Roslea Path”) at [141] and [142]). InConlan as liquidator of ROWENA NOMINEES PTY LTD (rec and mngr apt) (in liq) (CAN 008 818 273) v Adams and Others(2008) ACSR 521 (“Conlan”) at [92], McLure JA criticised the approach taken by the taxing Master in the court below on the basis that he had adopted an uncritical and impressionistic use of the “broad brush” approach. In that case, the Master had held that the costs associated with four heads of claim ought to be disallowed but then went on to opine that it would be impossible to sieve out the costs associated with that action with those for the insolvency in general. Thus, he taxed the bill downin totowithout considering the fact that the claimed costs of the relevant litigation was clearly listed in an annexure to the application. The Court of Appeal cautioned that an omission to make out aprima faciecase in relation to particular discrete parts of the claim does not support the inference of a systemic problem that justifies a reduction in other (unconnected) parts of the claim and varied the Master’s orders accordingly. 45     A further point I will mention is that the courts in other jurisdictions have accepted that it is appropriate, in some cases, for the courts to be assisted by assessors, particularly where the bill is very large and the issues very complex. This was done inRe Independent Insurance Co Ltd (in provisional liquidation) (No 2)[2003] 1 BCLC 640 (“Re Independent Insurance (No 2)” where the appointment of an assessor there was hailed as a “progressive step forward” that provided creditors with a “reliable independent quantification of the office holder remuneration” (see Michael Mulligan and John Tribe, “the remuneration of office holders in corporate insolvency – liquidators, administrators and administrative receivers” (2003) Insolv L 101 at pp 104 and 117). 46     Our courts also have the power to appoint an assessor under s 10A(1) of the SCJA and I would agree that, in an appropriate case, assessors could be appointed to assist the court by providing the court with a neutral evaluation of the propriety of the claims presented. One point I will mention, however, is that the court should always be mindful that the appointment of an assessor would necessarily entail a further layer of costs. Therefore, the benefit of appointing an assessor must always be balanced against the costs which will be incurred. The assessors’ reports should, of course, be made available to the parties for comment and critique and it also goes without saying that the ultimate decision still lies with the court (seeRe Roslea Pathat [160]).",
        "The key areas of dispute in relation to the remuneration of insolvency practitioners": "47     Before turning to my decision in relation to the present bill, I want to spend some time examining some of the persistent problems that constantly plague this area of law. The purpose of this exercise is two-fold: first, it will explain how the general principles set out above (while easy enough to articulate) are not always easily applied in practice; second, it will demonstrate that this is an area of law which is in urgent need of reform. Given that the law reports are rife with cases featuring disagreements over the remuneration of insolvency practitioners, I will just highlight three of the most intractable points of disagreement.",
        "Time based costing": "48     The issue of time-costing is one which has received much attention in the case-law, with the chief criticism being that it is a poor measure of what an appropriate sum of remuneration should be. In order to understand the nature of the problem, it is important to understand how hourly rates are calculated. As explained inRe Independent Insurance (No 2)at 653b–d, professional firms — when calculating the appropriate hourly rate to apply — proceed in the following sequence: (a)     First, the firm will calculate the level of profit it has to achieve in a particular year. This figure is calculated chiefly with reference to: (i) the level of remuneration it wishes to give to its partners and staff; (ii) the overheads and other operating expenses of the firm; and (iii) the rates levied by its competitors. (b)     Second, it then decides how much each fee earner has to charge per hour (commensurate with their level of experience) in order that the firm may achieve its targeted level of profit. In deriving this figure, the firm first has to ascertain the total number of chargeable hours each fee earner is capable of billing. The total number of chargeable hours is always a fraction of the total hours that each fee earner can be expected to work (this figure, which is usually 70%, is known as the “utilisation rate”). The use of a percentage reflects the reality that not every working hour will be billable: professionals will need to spend time on non-billable work and, further, they are often involved in several briefs at the same time so inevitable inefficiencies are to be expected as they transition from one task to the next. 49     As is clear from the foregoing, the hourly rates charged are really a function of the insolvency practitioner’s internal profitability targets and do not reflect the value that the work generates for their clients. This is the central problem with time-based costing as diagnosed by Ferris J, which is that “time spent represents a measure not of the value of the service rendered but of the cost of rendering it” (seeMirror Groupat 652a). It seems to me, however, that the problem is even worse than that. I think that time-costs only represent, at best, aputativemeasure of the cost of the service rendered, rather than its actual cost. Time-based costing assumes: (a) that the time spent on a particular task was necessarily and properly spent by a person of the appropriate seniority and experience; (b) that the hourly rates charged reflect the true cost of performing that activity; and (c) that the hours charged were all productively spent. However, even at the best of times, none of these assumptions are always tenable. As observed by Lawrence J inRe Carton Ltd[1923] All ER Rep 622 at 627, even the very best accountants might spend their time unproductively and on unnecessary work which adds little or no value to the company. 50     Of particular concern is (b) — the propriety of the hourly rates levied. It is important to remember that what is relevant is not the charge-out rate of the practitioner in question but the general rate levied by a person of the equivalent status and experience (seeJones v Secretary of State for Wales[1997] 1 WLR 1008, which makes this point, albeit in the context of solicitors’ fees). However, the court has no basis for gauging if the charge-out rates represent fair market value since there are no fee guidelines issued by local professional bodies against which the rates charged by individual practitioners may be measured. This problem is exacerbated in long engagements. As explained inRe Independent Insurance (No 2)at [18]–[22], staff members in long term engagements are more akin to persons on long-term secondments and will hence be able to achieve higher utilisation rates (because they will not suffer from the inefficiencies attendant with having to switch from working on one brief to another). Thus, the estimate of a 70% utilisation rate may be too conservative. 51     I note that it is common for “voluntary” discounts to be offered in long engagements, as was done in the present case (see [12] above). However, it is often the case that the mere offer of a discount without an explanation (as was done in the present case) only serves to cloud the issue rather than clarify it (seeRe Econat [18]). At the end of the day, the principle of the matter is that if the sum claimed is “proper”, there is no reason why the insolvency practitioner should not be entitled to it. Conversely, if the sum claimed was not “proper” to begin with, the offer of a deduction is not a “voluntary discount” in the true sense. The expression suggests that the offer represents a voluntary reduction from an amount which would otherwise rightfully be due. However, if the sum claimed is not “proper” in the first place, then the insolvency practitioner is not even entitled to be paid that sum and the reduction was not his to give. 52     However, despite its many problems (which are endemic to the system of time-based costing) the courts appear not to haveany choicebut to use time-based costs as a starting point for its assessment. This is because the general principles set out in the previous section only afford the court with the tools to conduct aqualitativereview of the bills of costs but no tools to independently arrive at aquantum. Thus, the courts have to work with the figures provided and apply an appropriate discount on the final figure to reflect its concerns over the propriety of the hourly rates charged. However, it seems to me that the application of any such reduction is a hopelessly difficult and speculative exercise. At the end of the day, if it is acknowledged that the quantum produced by time-based costing has little to do with the actual value of the service rendered then it seems to me that the court should jettison it entirely and cease to use it as a basis for calculating how much the receivers should be paid. However, this will not be possible unless there is a better and more objective alternative.",
        "Over-servicing": "65     As noted at para 21.4.2(9) of theUK Insolvency PD 2014, the court should have regard to the past billing practices of the receivers (and the level of remuneration fixed by the court). Therefore, I will begin with a longitudinal comparison of the present bill against the previous ones along several indices: 1st2nd3rd4thPeriod of assessment3 months3 months6 months1 yearInitial sum$2.1m$2.0m$1.6m$3.1mAwarded sum$1.21$1.24m$1m-% reduction42%38%38%-Size of team36392714Total number of hours4075424634025035.5   66     Several general points stand out for comment: (a)     This was the first time that a bill had been presented in respect of a full year’s worth of work, the previous bills having been put up for either three or six months’ worth of work. (b)     The size of the team had decreased steadily from a high of nearly 40 (in the first year of work) to the present size of 14. Throughout this period, there had also been a concomitant decrease in the amount of time spent on the matter. A total of 8321 hours was spent by the R&M in the first six months of their engagement (the first two bills) but this decreased significantly to 3402 hours (for the second half of 2012). This trend continued in 2013, where 5035 hours of work was recorded for one full year’s worth of work (ie, an average of about 2518 hours for half a year). (c)     The bills of costs were reduced by 35–45% on each occasion by the court. Was work performed by persons of appropriate seniority? 67     The R&M pointed out that the third bill of costs was for six months’ worth of work and the initial figure proposed then — S$1.6m (a monthly average of about $267,000) – compares favourably with the initial figure of $3.1m (a monthly average of about $258,000) proposed by the R&M in this bill.Prima facie, it would appear that the costs incurred, measured against the time-period of assessment, are similar. 68     However, the use of a monthly average threatens to obscure an important detail: the reduction in time spent. The R&M spent, on average, 567 hours per month in the third period of assessment but a much lower average figure of 442 hours in the present period of assessment. Taking this into account, it is curious that the average monthly fees have not gone down. The reason, I think, can be found in the overall increase in the seniority of the persons involved in the matter. The following table, which sets out the proportion of time spent by each grade of employee in respect of each period of assessment, is illustrative: 1st2nd3rd4thPartners’ hours as % of total11%14%11%17%Managers’ hours as % of total28%21%22%27%Associates’ involvement as % of total61%65%67%56%   69     The present period of assessment is unique in that there had been an overall increase in the seniority of the persons handling the matter (though, in line with the total reduction in the time spent, the more senior members of the team also spent less time, in absolute terms, on the engagement in 2013 than they did in 2012). The time spent by associates fell (as a percentage of the total) from 67% in the previous period of assessment to 56% in the present. When you consider that the higher ranking members of the team command a substantially higher charge-out rate (for example, the partners bill $1,300 per hour), this explains why the costs have not gone down despite the substantial reduction in the size of the team. 70     It seemed to me that there were two reasons for the increase in the seniority of the persons handling the matter. The first was the reduction in the size of the team. In the second half of 2012, the team comprised 27 persons; in 2013, there were only 14 persons in the team (a reduction of more than half). If there is a reduction in manpower one can expect that many of the cuts will take place amongst the more junior members of the team. The essential tasks would then fall to be performed by persons who are more senior. The second reason was the greater devotion of partner time to the Suits. For example, Mr Loh spent 194 hours on the company’s matters in the second half of 2012 but billed for a total of 614 hours in the present period of assessment (of which a large part — 270.5 hours — was spent on the Suits). I will deal with the matter of the Suits later but it suffices to say for now that the general impression I had at the hearing was that the composition of the team was perhaps not ideal. At the end of the day, the goal is not a simple reduction of manpower, but an increase incost-efficiency. If a quest for a lean team results in an increase in cost but no proportionate increase in value, then it is not a move which the court should give sanction to in its decision on remuneration. Should some of the work have been performed by administrative staff? 71     Without delving into too much detail, my overall impression was that there was some degree of over-servicing. One particular area of concern related to matters which ought to have been performed by administrative or secretarial staff, and not by professionals commanding substantial hourly rates. For example, 207.5 hours were devoted to “indexing and sending ATS documents in the office to store” and on “maintaining records for the R&Ms”. Other examples include the 12.5 hours of a senior associate’s time expended on the “review and renewal (and termination) of insurance policies” and the 19.5 hours spent on the finalisation of sale in respect of a company vehicle. 72     When queried, the R&M replied that it was “important… to ensure proper record keeping” and that the tasks ­were “delegated mainly to junior staff (approximately 2 hours a week)”. The R&M also clarified that their associates did not handle theactual scanningof the documents (which they outsourced), but were involved in the retrieval and identification of the documents which were sent out. With respect, I found this argument unpersuasive. The retrieval and identification of these documents could easily have been performed by administrative staff, perhaps with the supervision or guidance of an associate. I did not see any need for the associates to do it themselves. If they elected to do so, they ought not to expect that this court will later give sanction to their claims. While I accepted that some degree of latitude must be afforded to insolvency practitioners (see [35] above), it appeared to me that substantial cost-savings could have been reaped in many areas. In my judgment, the court could not accept that it was “proper” to be remunerated to the tune of several hundred dollars an hour for the performance of administrative tasks.",
        "Duplication of work": "56     Another common complaint concerns the duplication of work. This problem is particularly acute in situations in which there are multiple sets of professionals (usually lawyers and insolvency practitioners) engaged in the same matter. This problem typically manifests in two different scenarios. 57     The first is where the costs of the other professionals are being claimed as part of the insolvency practitioner’s disbursements. This was the case, for example, inMirror Groupwhere the receivers had engaged lawyers and later included the legal fees thatthey had been chargedin their bills of costs (as a claim for disbursements). In such a situation, the onus lies first on the receivers, as the paying party, to decide whether they want to accept the bill put forward by the lawyersbeforethey come to court to make a claim (seeMirror Groupat 662d–g). After all, the insolvency practitioners are hired for their commercial judgment, part of which encompasses the independent evaluation of the propriety of bills put up by service providers they hire. This acts as a preliminary filter. It is only after the insolvency practitioners have finalised their position on the bill that the court will consider whether the expenditure was reasonably incurred and therefore should be allowed. 58     I pause to observe that this preliminary filter is often of limited utility because of the incentives at play. It must be remembered that insolvency practitioners and lawyers often develop a durable working relationship over time. In one case, it might be the insolvency practitioner who owes his appointment to the lawyer; in another case, it might be the lawyer who proposes a particular insolvency practitioner for appointment. In a situation where neither has to bear the costs of the other directly (since the remuneration will come out of the company’s funds), there is little incentive for either to dispute the sums claimed in the other’s bills of costs. 59     The second scenario is where the costs of the other professionals are not claimed as disbursements incurred by the insolvency practitionerper se, but have been separately billed to the company. In such a situation, the court can and should still take cognisance of the possibility that the work performed by the insolvency practitioner in relation to matters within the other professional’s (usually a lawyer) scope of responsibility is unnecessary and his contribution redundant. The onus lies on the insolvency practitioner to justify his involvement when there are other professionals instructed on the same matter. InDovechem, for example, the court permitted the liquidators to recover the costs they incurred in relation to the prosecution of a suit because the liquidators were able to demonstrate that their roles and responsibilities differed from that done by the lawyers (at [46]). In that case, the liquidators had to spend an extensive amount of time going through the primary source documents in order to give proper instructions to their lawyers. Their work, in other words, wasanterior to and distinct fromthe work performed by the lawyers. 60     The observation I made in the previous section on over-servicing applies with equal force here. It seems to me that a more sensible approach would be to secure the agreement of relevant stakeholders, at the time of the receivers’ appointment, on the proper division of work between the insolvency practitioners and the other professionals engaged on the task.",
        "My decision": "61     Having set out the law in some detail, I now turn to the precise matters which were in dispute. I will first summarise the details of the bill. The R&M practised time-cost billing and they assessed their remuneration by a simple arithmetical formula: (time spent on work) x (hourly rate) = (remuneration). For the applicable period, there were a total of 14 persons in the team comprising three partners, four managers of varying levels of seniority, six associates, and one administrative assistant who spent a total of 5053.5 hours on the file. Their work spanned four broad categories: (a) operations and management (including the management of subsidiaries and associate companies); (b) compliance; (c) the conduct of the legal suits; and (d) human resource issues. A summary of the time spent by each member of the team for each category of work may be found in the following table: Time spent in hoursPosition (rate)(a)(b)(c)(d)Partner 1($1300/h)247.553.5270.542.5Partner 2($1300/h)150.520.56416Partner 3($1300/h)103--Senior Manager 1($900/h)1421052718Senior Manager 2($670/h)--23.5-Manager 1($600-650/h443.5190.58272Manager 2($450/h)--15.5-Senior associates($210–365/h)134144.5405-Associates($250/h)758.5387703.5101Administrative staff ($250/h)189--Sub-total (all)20759041865239.5Total5053.5",
        "The parties’ arguments": "62     The respondents pointed chiefly to perceived inefficiencies in the manner in which the R&M carried out their work and argued that there was a possible duplication of work. Their arguments may be divided into two broad categories. (a)     First, they questioned the necessity of certain expenditure. Their principal complaint concerned the R&M’s excessive involvement in Suit No 523 of 2011 and Suit No 1015 of 2012 (“Suit 523” and “Suit 1015” respectively and, collectively, “the Suits”), in which Airtrust is the defendant. They pointed out that the bulk of the work would have been done by Airtrust’s solicitors (for which Airtrust would be separately billed) and that the intimate involvement of the R&M raised the possibility of a duplication of labour. (b)     Second, they questioned the efficiency of the R&M’s work processes. The respondents pointed out that the R&M had devoted large amounts of professional time to simple administrative tasks like the performance of keyword searches and the indexing of documents. They argued that these tasks could have been more cost-effectively performed by administrative staff instead of being performed by fee earning associates charging hundreds of dollars an hour. 63     However, none of the respondents offered any proposal as to what an acceptable quantum of fees ought to be. It is also notable that the plaintiff, who was initially the most trenchant of the objectors, subsequently indicated her acceptance of the discounted fees though she stated that she would leave the question of whether any further discount ought to be applied to the Court. 64     In reply, the R&M raised three principal points. (a)     First, the offer of a global discount of 30% would more than adequately address any concerns over perceived inefficiencies in their work processes. They pointed out that the total number of hours in dispute (ie, 2,726.75 hours) only represented 54% of the total time costs which were being claimed but that the offer of a discount would be applied on the bill as a whole (ie, 5035.5 hours). They therefore highlighted that, mathematically speaking, the 30% discount offer is equivalent to the R&M foregoing more than 50% of the disputed hours. (b)     Second, the quantum of fees claimed compares favourably with the historical staff costs incurred by Airtrust. It was noted that the staff costs for the financial years ending 2008/2009 came up to more than S$2m, which is the same sum (following the 30% discount) that they sought in this application. (c)     Third, there was a need for them to be actively involved in the conduct of the ongoing suits. Not only did this fall within their terms of reference (which was to manage the company’s daily affairs and to recover its assets), the substance of the Suits also necessitated an analysis of the company’s financial records, which was an area that they would be equipped to assist.",
        "The R&M’s involvement in the Suits": "73     Moving on to the Suits, it is notable that a total of 1865 hours (or 37% of the total time on the matter amounting to time-costs of nearly $1m) was spent on the Suits (see [61] above). A summary of the Suits and the work done in respect of each is as follows: (a)     Suit 1015 is a claim for,inter alia, misrepresentation and conspiracy brought by Airtrust against sixteen parties. A total of 1089.5 hours was spent on Suit 1015 to deal with a number of interlocutory applications which arose in connection with the suit. These included applications for service out of jurisdiction and requests for further and better particulars. A large amount of time was spent on preparatory matters in advance of the trial of Suit 1015 (eg, e-discovery matters and keyword searches). (b)     Suit 523 is an action brought against Airtrust by two of its shareholders in which the repayment of several purported loans were sought. A total of 664.5 hours was spent,inter alia, on the review of the pleadings and trial documents, preparation for the trial, and on post-judgment follow-up work. Was there duplication of work? 74     The respondents raised a number of concerns over the unnecessary duplication of work in relation to the Suits, given that WongPartnership LLP (“WongP”) had conduct of the Suits. I agreed with those concerns. Many of the tasks listed appeared to be matters within the exclusive domain of their lawyers’ expertise. They included: review of the pleadings (211 hours), strategy in respect of overseas defendant service, review of further and better particulars (160.5 hours), preparation of possible cross-examination questions, review of transcripts during the trial, and discussions with witnesses (93 hours collectively). It did not appear to me that the R&M, with respect, could orwould have been able tooffer any meaningful contribution to these matters. As explained at [59] above, if there are several sets of professionals engaged for the same task or scope of work, the onus lies on the R&M to justify that the work they performed was distinct and separate from that performed by the other professionals. 75     It seemed that the R&M had anticipated this criticism. In his supporting affidavit, Mr Loh had deposed that even though the bulk of the work in relation to the Suits was done by WongP, the R&M still had to review the documents (which were voluminous) in order to give them proper instructions. He explained that, given the R&M’s familiarity with the source documents, it was necessary for them to work “in tandem” with WongP in the prosecution of the Suits since they were ultimately responsible for the conduct of the Suits. When more specific questions were raised in relation to particular items in the spreadsheets, the R&M followed up with somewhat banal responses which included “it is not uncommon for a litigant to work closely with its lawyer in complex litigation” and “the Receivers and Managers were ultimately responsible for the conduct of the suit and therefore had to ensure that the suit was properly conducted.” 76     I did not find these responses particularly helpful. The problem, it seemed to me, was that there was no clear demarcation of the relative roles and responsibilities between the lawyers and the R&M. This is quite unlike the situation inDovechem. In that case, the suit was already proceeding to trial when it was held in abeyance due to the entry of the company into liquidation. When the liquidators took conduct of the matter, they discharged the previous counsel and instructed new ones, who had to work closely with the liquidators to amend the statement of claim in short time before the trial. The urgency of the matter (due to the impending hearing) and the fact that the liquidators were far more familiar with the matter necessitated their intimate involvement in the legal proceedings. On our facts, WongP had been acting for Airtrust for at least two years so it cannot be said that either of these conditions obtained. 77     At the end of the day, the company still has to pay both sets of professionals their respective sets of fees. In my judgment, the court could not classify the significant devotion of the R&M’s resources to litigation as “proper” when the evidence was that lawyers had been instructed and were capable of managing the cases. Was the work efficiently performed? 78     One point which received much attention during the hearings was the staggering amount of time spent by the R&M on e-discovery. In total, nearly 1000 hours were devoted to this task, of which 860 hours were devoted to the performance and review of keyword searches while the remainder was spent in relation to discussions pertaining to the e-discovery protocol to be applied. I stated at the hearing that I was not convinced that it ought properly to be the responsibility of the R&M to perform these tasks and I remain of that view today. In the main, matters relating to discovery should be performed by lawyers, and not their accountants. Furthermore, even if it were accepted that this task ought to be undertaken or assisted by the R&M, it seemed to me that this was work whichmustbe capable of being performed by administrative staff (perhaps with supervision), instead of being performed by the insolvency professionals themselves. 79     When queried, the R&M replied that these tasks were performed largely by “junior staff” (ie, associates and senior associates) with supervision from the managers and partners. It was not clear to me how this sufficed as an explanation. Even “junior staff” on the R&M’s payroll command charge-out rates ranging from $250 to $365 an hour. Even by the most conservative of estimates, these e-discovery matters would have cost Airtrust at least $300,000. In my judgment, the significant devotion of professional time (and company resources) to such tasks fell far beyond the realm of what could be said to be fair, reasonable, or proportionate.",
        "Hourly charge for administrative staff": "80     One discrete point which can quickly be dealt with concerns the 189 hours of work clocked by Ms Damiri at a charge-out rate of $250 per hour (for a total time cost of $47,500). In the Bill, Ms Damiri’s title is listed as “administrative intermediate” and she was categorised as a member of the “administrative staff” by Mr Loh in his affidavit. InDovechemat [65] and [66], it was held that insolvency practitioners should not be allowed to include time charges for work done by administrative staff in their bills. The assistance rendered by administrative staff should be treated as part of the receivers’ overheads and cannot be the subject matter of a separate claim unless it is an exceptional case (see [53(c)] above). No evidence was presented to show that this was such a case.",
        "Comparisons with the company as a going concern": "81     In justifying the reasonableness of the Bill, the R&M drew two analogies. They argued that the total number of hours spent — 5035.5 hours — was the equivalent of 2.39 persons working as full time employees, which was reasonable for a company of the size and complexity of Airtrust. Further, they also argued that the discounted sum of remuneration sought at $2.2m was comparable to the historic manpower costs of the company (when it had between 18 and 25 members of staff on its payroll), which ranged from $1.3m to $2.4m. 82     I did not find either of these comparisons apposite. First, the inquiries are completely different. In deciding on the remuneration of the R&M, this court has to consider the question of fair value. By contrast, in deciding on how much to pay its staff, a company has to consider the question of profitability. Second, the character of the company has obviously changed significantly since the days when it was a going concern. Thus, the historic manpower costs of the company when it was still active is not an appropriate comparator for the costs which should be awarded to the R&M in its current, straitened, circumstances. 83     By the same token, however, I also rejected the attempt of the respondents to assess the value of the R&M’s contributions purely in terms of the monetary returns it generated. For example, the respondents had argued that the 219.25 hours spent on the filing of returns for Goods and Services Tax was excessive, considering that Airtrust only obtained $71,000 in refunds. I agreed with the R&M when they pointed out that the filing of these returns is a statutory requirement so the reasonableness of the time expended on this issue cannot be crudely benchmarked against the quantum of refunds obtained alone (see [37] above).",
        "The quantum": "84     Having conducted a general qualitative review of the bill, I now turn to the question of the quantum. As a preliminary point, I rejected the R&M’s argument that the 30% discount offered should be sufficient to take care of any inefficiency that might have been present in respect of the R&M’s handling of the disputed matters, which pertained to only 54% of the total time-costs claimed (see [64(a)] above). The assumption in this argument is that the remit of the court was limited only to the matters over which queries have been raised. This is incorrect. As I pointed out at [42] above, the remit of this Court, insofar as the question of remuneration is concerned, is more wide-ranging and is not limited only to the matters over which the parties have disputed. Thus, I considered that it was appropriate for me to consider the question of quantum more critically. I now explain my decision with reference to the two-stage approach as set out at [43] and [44] above. 85     I begin at stage one. The R&Ms had initially presented a bill of $2.9m for their professional fees, derived from a calculation of the time expended by each individual multiplied by their respective charge-out rates. However, I was mindful that in a long insolvency like the present case, a broad discount on the hourly rate is usually warranted. I also noted that there has been a general upward lift in the charge-out rates applied by the practitioners. The charge-out rate for the partners has remained constant (at $1,300 per hour) since the start of the insolvency. However, the managers and associates now charge figures which are, on average, 10% higher than they did in the previous bill (eg, Ms Jotangia, who spent a total of 788 hours on this matter, used to charge between $550 and $600 per hour but now charged $600 to $650 per hour; in a similar vein, the associates, who used to command between $210 to $250 per hour, now billed at a flat rate of $250). I am not saying that charge-out rates have to stay static throughout the length of the engagement but increases have to be justified and no reasons were furnished in this case. 86     That being said, however, I was mindful that it is not the role of this court to prescribe, in intimate detail, the appropriate charge-out rates for each practitioner. Thus, I used the discounted figure of $2m supplied by the R&M as a working figure for analysis. 87     At stage two, I first disallowed the claim for $47,250 for Ms Damiri’s time-costsin toto. This left me with a figure of about $1.95m. I then considered the impact of my observations about the unnecessary use of the R&M’s time on the Suits, the concerns in respect of over-management, and the fact that many tasks could and ought to have been performed more cost-efficiently (perhaps by administrative staff instead of insolvency practitioners). I was mindful of the fact that many of the concerns I had articulated are not new. Several of them had been articulated by Lee JC at the hearing of the Third Bill. For example, at that time, there was also fractious disagreement regarding matters such as the devotion of the R&M’s time (chargeable at $400/h) to matters such as the relocation of the office and there was also concern over a possible duplication of work between the lawyers and the R&M in relation to Suit 1015. At the end, Lee JC reduced the sum claimed by 38%, which was a further 28% reduction on top of the 10% discount that the R&M had offered at the time of the hearing. With those points in mind, I was of the view that a further adjustment (on top of the 30% discount already offered and applied at stage one) was warranted. 88     After reviewing the facts and circumstances in their totality, I reduced the quantum of the professional fees charged by a further 10% to $1.8m (ie, a 40% reduction from the original figure claimed).",
        "Conclusion": "89     At the end of the hearing, I clarified that my decision ought not to be seen as a critique of the work of the R&M. I have no doubt that they are consummate professionals who sincerely believe that they are entitled to be remunerated as charged. However, the problem here is one of mismatched expectations. This court is not here to grant remuneration on market principles. Instead, its duty is to award a “proper” sum which is a fair, reasonable, and proportionate reflection of the value of the services rendered. The market price for their services is but a component of the court’s all-encompassing analysis of what “proper” remuneration ought to consist of. 90     All the Judges who have heard the matter before me expressed the hope that this matter would proceed forward in a more orderly fashion. That is also my wish and the primary motivation for my decision to issue full written grounds on this matter to explore the possibility of setting up a system of costs scheduling in this area. It is certainly of no profit to anyone for the company to be bled dry through collateral litigation of this sort. I hope that the insolvency Bar will take guidance from the points covered in these grounds as well as the annex on “costs scheduling” which is to follow.",
        "Costs scheduling for insolvency practitioners": "",
        "The experience of other jurisdictions in costs scheduling": "A.4    When our courts last surveyed the position in other jurisdictions on the subject of remuneration (seeRe Econat [20]–[37]), the focus was on distilling criteria and principles to be applied in the retrospective approval of a practitioner’s fees. The focus of this section will be different. It will cover prospective approvals of insolvency practitioners’ remuneration and focus not just on points of principle, but also on practical points which might be of use in the development of a similar practice in Singapore. For convenience, I will focus primarily on the rules governing the remuneration of liquidators, for they have received most treatment in the case-law. However, given the commonalities in the principles governing the remuneration of all insolvency practitioners (see [21] above), I believe that any regime applicable to liquidators should, by and large, be applicable to other insolvency practitioners. England and Wales A.5    The law in England and Wales is on the cusp of change. The principal rules for assessing and determining the remuneration of insolvency practitioners are contained in the Insolvency Act 1986 (c 45) (UK) (“UK IA 1986”) and the Insolvency Rules 1986 (SI 1986 No 1925) (UK) (“UK IR 1986”). In 2016, the UK IR 1986 will undergo a comprehensive overhaul and will be re-enacted as a comprehensive and modernised set of rules. In anticipation of this change, the Insolvency (Amendment) Rules 2015 (SI 2015 No 443) (“2015 Amendment”) was passed on 2 March 2015 to provide for a system of costs scheduling for administrators, liquidators, and trustees in bankruptcy. This new regime (which very recently came into force on 1 October 2015) will be the focus of this section. A.6    As a starting point, I think it is useful to understand how the UK regime is presently structured. Presently, insolvency practitioners are already required to obtain upfront approval of thebasisof their remuneration within 18 months of their appointment (see r 4.127 UK IR 1986). The bases of remuneration are limited to the three set out in statute: (a) as a percentage of the value of assets realised; (b) by reference to time spent; or (c) by agreement (see r 4.127(2)). Approval is to be obtained, at first instance, from a liquidation committee or by way of a resolution at a creditors meeting (r 4.127(6)). Failing that, the basis of remuneration will be fixed by the court. Rule 4.127(4) of the UK IR 1986 specifically provides for a list of criteria that must be taken into account when deciding whether or not to approve the remuneration application. This system is supplemented by a system of progress reporting. Even after approval, insolvency practitioners are required to submit progress reports at regular intervals (administrators must do so biannually — r 2.47(3) UK IR 1986; liquidators annually — r 4.49B(4) UK IR 1986) containing information as to,inter alia, the remuneration charged during the period of the report. The progress reports are designed to provide for some continuing oversight over the conduct of the insolvency. A.7    The new regime introduced by the 2015 Amendment strengthens this process by requiring insolvency practitioners who intend to charge on a time-cost basis to provide a pre-estimate of their remuneration (a “fees estimate”) together with a statement of the expenses (ie, disbursements) which insolvency practitioner considers will be, or are likely to be, incurred during the term of his office (see rr 4.127(2A) and 4.127(2B) UK IR 1986). A “fees estimate” is a written report stating: (a) the details of the work the insolvency practitioner and his staff propose to undertake; (b) the hourly rate or rates he and his staff propose to charge for each part; (c) the estimated time that will be spent in respect of each part of that work; (d) whether it is anticipated that the future remuneration that will be sought will exceed the amount stated in the fee estimate; and (e) the reasons why its remuneration is likely to exceed the amount in the fees estimate (see r 13.13(18A) UK IR 1986). A.8    The fees estimate is subject to approval and it must be submitted to the relevant approving body (eg, the liquidation committee or the body of creditors at a creditors meeting) at same time that upfront approval for the basis of the insolvency practitioner’s remuneration is sought (ie, within 18 months). Once approved, an insolvency practitioner’s remuneration cannot exceed the total amount in the fees estimate unless further approval is obtained from the relevant approving body (see r 4.131AB UK IR 1986). Even if the insolvency practitioner does not intend to charge on a time-cost basis (but instead wants his remuneration to be fixed or pegged to an agreed percentage of the realisable assets) he must still furnish information as to: (a) the work it proposes to undertake; and (b) the expenses that it is likely to incur. A.9    The significance of this change cannot be understated. Given the ubiquity of time-costing as a basis for calculating the remuneration of insolvency practitioners, it will probably affect most, if not all, future insolvency engagements. At present, the UK IR 1986 only requires the prospective approval of thebasisof remuneration, but not itsquantum. This will change with the introduction of the new regime, which will subject the quantum of fees itself to prior approval. Paragraphs 7.3–7.6 of the Explanatory Memorandum to the 2015 Amendment provide a helpful summary of the policy impetus underlying the new changes: 7.3    … Currently, there is no statutory obligation on the IP to provide information about the likely level of the total fees charged, what work the creditors can expect the IP to do, or details of likely expenses.Creditors will generally find out about the costs of a case (both in terms of fees and expenses) at the end, by which time a creditor’s only route of appeal is to the court, which case be both expensive and time-consuming. 7.4    There islittle effective oversight by unsecured creditors of the work undertaken by IPs. At worst this can result in over-charging by the IP and at best can result in inefficiencies, which leads to remuneration being higher than they might otherwise have been. This has been a concern for Ministers. 7.5    Stakeholder consultation has revealed that creditors believethe key issue is the need for meaningful information at an early stage about how much a case is likely to cost and therefore, whether they are likely to get any money back. The Amendment Rules therefore seek to address this by requiring an IP to provide an estimate of his/her fees and the costs of a case at an early stage and certainly prior to any fees being taken. 7.6The provision of this willgive creditors a better and earlier idea of the cost of dealing with an insolvency and allow them to exercise greater influence over the IP’s remuneration. [emphasis added in italics and bold italics] A.10       As can be seen, many of the concerns articulated are similar to those that have been raised here and elsewhere. It appears that the experience in England has been that the prior fixing of thebasisof remuneration has not done much to reduce the incidence of disagreement over the actual sum of remuneration sought. The main problem is that the approving bodies have little idea of how much the insolvency willactually cost. Thus, it was thought that it was necessary to introduce a system that would promote greater transparency and certainty in this area and allow stakeholders to have input (and at an earlier stage) in the conduct of the insolvency. Australia A.11       In Australia, like in England, there has been great angst over the subject of the remuneration of insolvency practitioners. This led the Parliamentary Joint Committee on Corporations and Financial Services to publish a report following an extensive review of Australia’s insolvency and voluntary administration laws (see Parliamentary Joint Committee on Corporations and Financial Services,Corporate Insolvency Laws: a Stocktake(June 2004) (Chairman: Senator Grant Chapman)). This report, together with the decision of Finkelstein J inRe Korda, precipitated an extensive review of the existing law, culminating in the passage of the Corporations Amendment (Insolvency) Act 2007 (No 132 of 2007) (Cth). In 2008, the Insolvency Practitioners Association of Australia (now known as the Australian Restructuring Insolvency & Turnaround Association or “ARITA”) issued the first edition of its Code of Professional Ethics. For convenience, I will refer to past and present versions of this simply as the “ARITA Code”, notwithstanding the change in nomenclature. The ARITA Codes deal extensively with the subject of remuneration and any understanding of the Australian position must account for both the statutory rules as well as the system of self-regulation instituted by the ARITA Code. A.12       I begin with the statutory position. The provisions governing the remuneration of liquidators may be found in the Corporations Act 2001 (Cth) (“Australian Corporations Act”), which provides that a liquidator is “entitled to receive such remuneration by way of percentage or otherwise” which is to be determined, at first instance, by agreement with a committee of inspection (see s 473(3)). If no such committee exists or if no agreement can be reached, approval may be sought either by way of a resolution of the creditors or from the court. It has been observed that, in general, the Australian courts are “reluctant to fix the liquidator’s remuneration and the other avenues should be pursued first” (see Christopher Symes and John Duns,Australian Insolvency Law(LexisNexis, 2nd Ed, 2012) at para 11.9)). Prior to approval, the liquidator is required to produce a report setting out “such matters as will enable the committee of inspection to make an informed assessment as to whether the proposed remuneration is reasonable” (s 473(11)(a)(i)). Even if remuneration were determined by agreement or at a creditors’ meeting, the court still has the residual power to review the sum awarded (ss 473(5) and (6)). A.13       As can be seen, the statutory scheme does not provide for the prospective approval of feesper se, but encourages fees to be settled by way of agreement, rather than being subject to curial determination. This is where the ARITA Code (the third edition of which was released in 2014) comes in. Before discussing the provisions of the ARITA Code which deal with prospective applications, I think it is first useful to begin with what the ARITA Code has to say on the subject of disclosure. The introductory paragraph of cl 15 of the ARITA Code reads: Principle 11: A claim by a Practitioner for Remuneration must provide sufficient, meaningful, open and clear disclosure to the Approving body so as to allow that body to make an informed decision as to whether the proposed Remuneration is reasonable. A.14       In other words, the core principle which undergirds the remuneration process is transparency, which behoves disclosure, and the central objective of disclosure is to allow an informed decision to be made. This is not a novel concept. Our Court of Appeal has, in the context of schemes of arrangement, stressed that “transparency in the affairs of a distressed company through making available all material information that could impinge on the financial interests of creditors [is] essential” (seeThe Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others v TT International Ltd and another appeal[2012] 4 SLR 1182 (“TT International”) at [16]). I regard this as an important statement of principle that is applicable to insolvency practice generally. In the ARITA Code, this principle finds expression in many places. Just to take one example, cl 15.3.2 requires all insolvency practitioners to provide, at the time of their first communication with the creditors, information on (a) the basis upon which they will calculate their remuneration; (b) the particular method which the insolvency practitioner intends to use to calculate its remuneration; (c) why this method is thought to be most suitable; and (d) if time-based costing is used, the scale of rates that will be used and a best estimate of the costs which will be incurred to completion or to a specific milestone. A.15       Returning to the subject of prospective applications for approval, the ARITA Code does not mandate that all insolvency practitioners seek prospective approval for their fees. Instead, cl 15.2 lists several bases by which remuneration may be approved and calculated, one of which isviaa system of prospective fee approval. Clause 15.2.2 provides: A Practitioner may seek approval from creditors for time based Remuneration to be determined in advance of the work to be performed. The approved amount must have a Cap to a nominated limit. The claim for Remuneration will subsequently be calculated on a time basis for necessary work properly performedand can be drawn without further approval of creditors up to the Cap. The hourly rates to be applied may be increased by an agreed formula where the escalation factors are objectively and independently determinable. If a Practitioner wants to be able to increase hourly rates that are charged on an Administration in the future without having to obtain creditor approval, a specific formula must be included in the resolution for the approval of the prospective Remuneration (for example, rates are increased annually by the CPI [Core Price Index] amount). A reference to changes in rates from time to time (or similar) must not be included in resolutions to approve prospective fees. Any increase approved does not apply to the capped total, only to the hourly charge rate. If a Practitioner wishes to change the capped amount, or the hourly rate scale other than as agreed, a Practitioner will need to seek Approving body approval (refer section 15.3.2 for reporting obligations). [emphasis added] A.16       The broad contours of this approval scheme resemble that which has just been introduced in England: (a) pre-approval is calculated on a time-cost basis; and (b) the insolvency practitioner has to seek fresh approval if he wishes to make a claim for an amount above the pre-approved total. Two points should be noted. First, the ARITA Code specifically provides that remuneration may be drawn for work already performed, without the need for regular approval by the creditors. Ultimately, the caps agreed to are still subject to review by the court although the presence of informed and free consent to remuneration to a particular quantum is a factor that militates against curial review (seePaul’s Retail Pty Ltd and Another v Morgan[2009] NSWSC 1222 (“Paul’s Retail”)). Second, provision is made for agreed increases to be applied to the hourly rates. This will be particularly important in long insolvencies where the hourly rate may have to be adjusted to keep up with rising costs. New Zealand A.17       New Zealand is a particularly helpful jurisdiction to learn from because a scheme for the prospective approval of remuneration applications was developed, not by legislative intervention, but through judicial practice. The position in New Zealand was set out at length in the illuminating judgment of the High Court of New Zealand inRe Roslea Path. The scheme set up by the Companies Act 1993 (NZ) (“NZ Companies Act 1993”) is dichotomised between that dealing with the remuneration of private liquidators and that dealing with liquidators who have been appointed by the court. (a)     Private receivers are entitled to charge “reasonable remuneration” (see s 276(1) NZ Companies Act 1993). This sum will usually be the subject of agreement between the company and the liquidator. However, the fees charged are subject to review by the court on an application under s 284(1)(e), which provides that the court may, on application, and “[i]n respect of any period, review or fix the remuneration of the liquidator at a level which is reasonable in the circumstances.” (b)     Court-appointed receivers (and the official assignee)mustchargeeither(i) a flat fee of NZ$2,000;or(ii) a fee calculated at an hourly rate of NZ$200 an hour or part thereof. New Zealand is unique in that the rates of remuneration are legislatively determined by the Governor-General, through an Order in Council (see reg 28 of the Liquidation Regulations 1994 (SR 1994/130) (NZ)), pursuant to powers conferred on him by s 277 of the NZ Companies Act 1993. The rate of NZ$200/hour was set in 2007, following judicial criticism that the previous rates (which were first determined in 1994) had failed to keep up with the times (seeMedforce Healthcare Services Ltd (in liq), Re[2001] 3 NZLR 145 (HC);Medforce Healthcare Services Ltd (in liq) (No 2), Re[2001] 3 NZLR 158 (HC)). Court-appointed liquidators do not require the approval of court to be paid according to the aforementioned rates. However, if they desire to be remunerated at higher rates, then aprospectiveapplication for remuneration must be made and granted (seeRe Roslea Pathat [41]). InRe Roslea Pathat [125], it was confirmed that the court had the power to prospectively fix the remuneration of liquidator on terms, though final approval would still have to be sought at the finalisation of the administration and it was only then that the remuneration would be considered “fixed” within the meaning of s 284(1)(e) of the NZ Companies Act 1993. A.18       From the foregoing, it can be seen that prospective applications are usually brought by a court-appointed liquidators who seek to be remunerated at a rate higher than that statutorily prescribed (seeRe Roslea Pathat [121]). The principles governing such an application, and the information that must be furnished when seeking such approval were helpfully summarised in the headnote toRe Roslea Path(numbers in square brackets are references to paragraphs in the body of the judgment): (a) an application to the court to approve the liquidators’ remuneration prospectively may be made at the time the company is put into liquidation (see [124]); (b) the applicant should include in the document evidencing the liquidator’s “consent to act”, the proposed charges of the intended liquidator and his or her staff. If the person nominated to be the liquidator is regularly appointed by the court, it is sufficient for the consent to act to include a section indicating the rates that were previously approved by the court within the previous six months, so that the court is assured that the rates have previously been considered (see [125], [126], [129], [132]); (c) if the person nominated to be the liquidator is not known to the court, the court may require the person nominated to be the liquidator to provide with his or her consent to act, a brief resume confirming the nominee’s independence and outlining the nominee’s relevant prior experience. The nominee is also be [sic] required to provide some evidence of the hourly rates to be charged having regard to his or her experience and competence as disclosed in the resume presented to the Court (see [130], [133]); (d) if it is apparent that the liquidation will be complex, special terms can be crafted to ensure issues of remuneration are reviewed on a continuing basis to foreclose the possibility of a major dispute being raised at the end of the liquidation (see [134]); (e) this approach is consistent with the principles of proportionality and professional integrity. Creditors are not prejudiced by the process because the court retains the right to fix the final remuneration at the time the liquidation is finalised (see [122]). A.19       As can be seen from the foregoing, the system of prospective applications grew out of a need to supplement the restrictive strictures of the statutory scheme. The usual bases and quanta of remuneration set out in statute provide a “floor” which will be suitable for the majority of insolvencies. However, the statutory rate will usually be insufficient recompense if the engagement is complex and it is in such cases that prospective applications will be brought. This is why inRe Roslea Path(at [124]), the court anticipated that with the statutory rate having been revised in 2007 to better reflect market rates, there would be a reduction in the number of prospective applications. The only final point I will note is that any sum approved in a prospective application is still subject to final approval and that it is only upon final approval that the remuneration is considered to be “fixed” within the meaning of s 284(1)(e) of the NZ Companies Act 1993 (see [A.17(b)] above). The court also retains the power, under s 284(1)(f), to order that any amounts provisionally paid out to a liquidator be refunded if the amounts paid are eventually found to be unreasonable.",
        "Should a system of costs scheduling be introduced?": "A.20       Having considered the experience of other jurisdictions (in addition to my reflections on the situation in Singapore), it is my view that the case for the introduction of a system of costs scheduling is a compelling one. It is driven by two broad policy imperatives: (a) cost control; and (b) transparency and fairness in the award of remuneration (see, generally, Gary Lightman, “Office holders’ charges– cost control and transparency” (1998) 14 IL&P 193). Cost control — control and supervision A.21       It seems to me that much of the dissatisfaction with the present regime can be attributed to the absence of control and oversight. Creditors are extremely hesitant of paying (albeit indirectly) for work which they did not specifically request to be done and to persons whose performance they were unable to oversee. Lightman J, speaking extra-judicially (see Gary Lightman, “The Challenges Ahead: Address to the Insolvency Lawyers' Association” [1996] JBL 113 at 115, cited with approval inRe Econat [21]), placed his finger on the pulse of the problem when he identified the source of the disquiet as follows: … There is perceived to be a particular mindframe towards costs referable to the open unguarded pocket from which the costs are paid and the absence of effective monitoring – a mindframe careless of the consequences for unsecured creditors and others. His observations highlight the stark reality that there is a certain price-insensitivity that is associated with insolvency practice because of the absence of direct client accountability. This raises concerns about whether sufficient effort had been devoted towards keeping costs within reasonable bounds. Thus framed, it is clear that the problem of excessive billing is but a symptom of the underlying problem, which is that the incentives at play are improperly structured. A.22       A system of costs scheduling would instil a sense of cost-awareness into insolvency practice. Parties would be required to address their minds towards the subject of costs from an early stage and be expected to address their minds towards the question of cost at every stage of the insolvency. They would constantly have to think of ways in which things can be done most cost-effectively or decide if a particular task is simply too expensive and should not be performed at all. For creditors, it will give them some forewarning of what the insolvency will cost, minimising the phenomenon of “bill shock” at the time the final bill is presented. A.23       To be fair, the problem of costs is not confined only to insolvency practitioners. On this issue, I think a useful parallel can be drawn with the legal profession where two important initiatives were introduced at the start of this year: (a) a system of costs scheduling for party and party costs (see para 99A of the Supreme Court Practice Directions (“PD”)); and (b) a pilot “costs budgeting” programme. I will examine each in turn. (a)     The object of the former is chiefly to deal with the problem of satellite litigation over the subject of party and party costs. The problem, as Sundaresh Menon CJ observed in his response at the Opening of the Legal Year 2014 (3 January 2014), is that there is a “tendency for successful parties to inflate their cost claims even as losing parties object vehemently to sums that they themselves might not have hesitated to claim had the shoe been on the other foot” (at para 33). Once again, the problem lies with the incentive structures of the actors involved — when costs are dealt with after the fact, there is no incentive to be temperate with one’s costs submissions. The victor seeks to recover as much as he possibly can while the unsuccessful party seeks to keep party and party costs at a minimum. A system of costs scheduling addresses this because the estimates are given before the parties are aware of the eventual outcome of the case and it incentivises parties to be reasonable with their estimates, lest they end up footing the bill. (b)     The system of costs budgeting will require parties to furnish costs estimates that will be incurred at each stage of a legal matter. Cases will also be overseen by a designated docketed judge who will be familiar with the conduct of the matter and the behaviour of the parties. The hope, as explained by Menon CJ in his speech at the Opening of the Legal Year 2015 (5 January 2015), is to “ensure proportionality” and keep the cost of litigation “within a sensible budget” (at para 44(b)). A.24       There are useful lessons to be learnt here, chief of which is that a system of costs scheduling is an important policy lever which alters the incentive structures of the actors at play. In the context of insolvency practitioners, it will facilitate the transition towards a more participatory model which brings creditors and other interested stakeholders from the side lines and involves them in the on-going dialogue about how best the insolvency should be managed. This process begins at the time of first submission and continues (depending on how the costs schedule is structured) throughout the lifespan of the engagement. Transparency and fairness A.25       I now turn to the closely allied notions of transparency and fairness. Another key problem with the present regime lies in its opacity: creditors are extremely leery of forking out sums (albeit indirectly) for work whose scope they do not fully understand. This was the case in the present summons, where the respondents sent lengthy letters scrutinising the minutiae of the bill demanding answers to such questions as why a particular task was classified “urgent”, why a decision was made to perform a task when the return on investment appeared to be poor, and whether there had been any duplication of work. It is not enough to say that these details are contained in the bills of costs which are submitted for approval. For a start, the details provided in these bills are necessarily very brief (given the number of tasks undertaken throughout the period of assessment, it cannot be expected that the details of each task will be exhaustively listed) and will vary from practitioner to practitioner, since the information is often drawn from the particular timekeeping/billing software installed by the practitioners in question. A.26       A deeper problem, as I perceive it, is that it matters not justwhatinformation is presented butwhenit is given. Interested stakeholders want to have a clear indication of the anticipated fees and costs in dealing with the insolvency from the outset. Often, the difficulty that creditors have is that the bills are presented almost as afait accompli, leading parties to distrust the explanations proffered by the insolvency practitioners asex post factorationalisations tendered only to justify their claim to remuneration. With a costs schedule, creditors will be provided with the requisite information they need to evaluate the reasonableness of a bill from an early stage, strengthening their confidence in the transparency and integrity of the insolvency regime and minimising the impulse to reject bills out of hand where the sum claimed appears to be substantial. A.27       I would also like to stress that this principle cuts both ways. Much attention has been devoted to the protection of creditors and their interests (and rightly so) but I think an oft-neglected dimension of this is the importance of fairness to insolvency practitioners. There is something perverse and capricious about a system that expects persons to work without a precise definition of their scope of their responsibilities (and without the assurance or security of payment) and then denies them remuneration for the work that is performed on the basis that the work done was unnecessary or too expensive and ought not to have been done. A.28       A system of costs scheduling would go a long way towards addressing this problem. Parties would be driven to examine what the objects of the liquidation/receivership/management are and to define the scope of the insolvency practitioner’s work at an early stage. This way, practitioners will know what they have to do and what they can expect to be paid for doing it; and stakeholders will know where their money is going and exactly how much of it will be spent. This will lend more fairness and transparency to the process for practitioners and for stakeholders alike.",
        "The costs schedule": "A.29       Having made the case for the introduction of such a system, I will spend the remainder of this judgment discussing how a costs scheduling scheme might look like. I propose to cover the following matters: (a)whata costs schedule should contain; (b)whoshould submit one; (c)whenit should be submitted; (d)to whomit should be submitted andwhatfactors should be taken into account in its approval; and (e)howit should be submitted. What should the costs schedule contain? A.30       The expression “costs schedule” is a bit of a misnomer. While the focus is on costs, in order to be truly useful, a costs schedule must contain more than just a number. Instead, it should function as a road map that sketches out the steps that the insolvency practitioner proposes to take and the resources that he will devote to the task because these are critical matters which will affect the amount he will eventually be paid for his services. A.31       Drawing primarily on the ARITA Code, the UK Insolvency PD 2014, and the 2015 Amendment, I believe that any costs schedule should contain the following matters: (a)     details of the work that is likely to be undertaken; (b)     the anticipated time that each category of work will take; (c)     the anticipated size of the team, with brief descriptions of the seniority of each team member and their areas of responsibility; (d)     the proposed basis of remuneration, together with the reasons why it is thought that this is the most suitable method for the calculation of remuneration in this case; (e)     the hourly rate or rates that the insolvency practitioners propose to charge (if time-based costing is employed) and, if available, the rates which were charged and approved for similar appointments in the past; (f)     a fee estimate for the relevant period of assessment; (g)     a list of anticipated disbursements and the costs that will be incurred in respect of them; (h)     the sum of fees which have already been incurred or billed for work done for the company between the time of appointment and the submission of the costs schedule; and (i)     whether any other professionals (eg, lawyers) have also been engaged by the company and the proposed division of responsibility between the insolvency practitioner and such other professionals. A.32       The general principle is that there should be full disclosure of all relevant information (see [A.13] above), but disclosure should be tempered by the principle of proportionality (see [27] of the main judgment above). The costs schedule should contain all the information that is necessary for the court (and the relevant stakeholders) to make an informed decision as to whether the fee estimates represent fair, reasonable, and proportionate value. However, that level of detail will, of course, vary depending on the complexity of the engagement. A.33       It goes without saying that any special fee arrangements (eg, the payment of a “value-added fee” as inTT International) must also be disclosed. It does not matter, for this purpose, whether the amount due under the special fee arrangement is to be paid out of the assets of the company or by a third party (and on this point I disagree with the submissions of the R&M). The point of the matter is that the court (and the relevant stakeholders) should be apprised of any and all information that might affect their assessment of the reasonableness of the sums sought to be approved. The propriety of these extra-appointment payments is relevant and must be subject to scrutiny as it is likely to have a bearing on the overall reasonableness of the fees. A.34       As a final point, I note that while it would be ideal for the costs schedule to cover the entire period of the engagement, this will not always be possible, particularly in complex cases (such as the present, where the R&M have been on the file for several years). In such a situation, the costs schedule should cover a meaningful period of assessment (at least six months, if not a year). Supplemental costs schedules should be submitted for approval at later junctures when more information is available. Who should submit a costs schedule? A.35       It is my view that the practice of costs scheduling should apply to all classes of practitioners who owe their offices to curial appointment, and consequently, whose remuneration is subject to curial approval. This would include: (a) provisional liquidators; (b) liquidators; (c) judicial managers; and (d) receivers and managers etc. I have deliberately left scheme managers out of this list because their fees ought already to have been disclosed to creditors and the court prior to the sanction of the scheme (seeTT Internationalat [28] and [29]). There is therefore no need for a separate approval process for their remuneration. A.36       Out of court appointments fall outside the ambit of the costs schedule regime entirely, even if their remuneration is subject to curial review (for example, s 219 of the CA permits the court to review the remuneration of private receivers as well as curial receivers upon application). This is so for two reasons. First, there is less of a fiduciary character to their office. Private appointments are more a matter of contract and private negotiation. Private appointees are better seen as service providers rather than fiduciaries. That being the case, there is less of a need for intrusive supervision of their remuneration. Second, market forces play an important role in holding down fees in this area. As observed by the Law Reform Committee of the Singapore Academy of Law in their 2005 discussion paper on this subject (see Law Reform Committee, Singapore Academy of Law,The Remuneration of Corporate Insolvency Practitioners and Certain Related Matters: A Law Reform Discussion Paper(October 2005) (Chairman: Alvin Yeo SC) at para 40), the entities who appoint private practitioners tend to be commercially savvy operators (usually banks exercising their powers under a debenture) with considerable experience and market power. There is therefore little need for the court to step in. A.37       Generally, the touchstone to be applied is whether the Singapore courts have primary jurisdiction over the appointment and remuneration of the insolvency practitioner — if the answer is yes, then a costs schedule should generally be submitted. This, I think, provides the answer to the query raised by the first and second defendants on when practitioners involved in cross-border insolvencies should be required to submit a costs schedule. If a practitioner were appointed by a foreign court then he has to comply with the legal requirements set by the foreign court — it does not matter that his engagement involves the restructuring of a Singapore subsidiary of a foreign company. Conversely, if the practitioner in question were appointed by a Singapore court (and subject to its control) then he should be required to submit a costs schedule, even though his appointment might require him to deal with the restructuring of the foreign subsidiaries of a Singapore company. A.38       In their submissions, IPAS argued that the system of costs scheduling should not apply either (a) to engagements where sum of fees is estimated to exceed $200,000; or (b) to solvent companies. In respect of (a), they submit that where the fees do not exceed $200,000 it would not be reasonable to expect the insolvency practitioner to expend the requisite time and costs involved in the preparation of a costs schedule. They argue that it would suffice for the insolvency practitioner to seek retrospective approval (under the existing regime) for his fees on a periodic basis or at the end of his engagement. In respect of (b), they submit that “there are no external parties’ interests to be protected” so the fees “should be solely a matter of contract between [the insolvency practitioner] and the company.” However, they caveat this by adding that they agree with the fourth defendant’s submissions that a costs schedule should still be tendered if receivers are appointed against the wishes of the directors of a solvent company because in such a situation, it cannot be said that the company had agreed to the appointment of the receiver, let alone the terms of the appointment. A.39       When my Grounds of Decision was circulated to the parties in draft for comment, their attention was specifically directed to the two carve-outs suggested by IPAS. The first was readily accepted by the parties. As for the second, the first and second defendants pointed out that where the board of a solvent company resolves to appoint receivers, this is akin to a private appointment, which would fall outside the scope of the present proposal anyway (see [A.36] above). They pointed out that a solvent company would usually only have cause to resort tocourt-appointedreceivers where the board of directors is deadlocked and it is precisely in such cases where greater curial oversight is required since the board would probably be in no position to exercise effective oversight and hold down fees. Thus, practitioners working on curial engagements in respect of solvent companies should also be required to submit a costs schedule even if their appointment were expressed as being “by consent”, as was the case in the present (see [9] of the main judgment above). A.40       I gratefully receive the comments raised by the parties. The ideal would be for costs schedules to be submitted by all court-appointed practitioners. However, I accept that this is not possible. It is obvious that there are delicate policy considerations which apply in this area. The desire for greater supervision and control must be balanced against the need for economy and expedition. For this reason, I accept that the first carve out — to require costs schedules only where fees are expected to be above $200,000 — is sensible. However, I do not accept the second carve-out. As the present case amply demonstrates, appointments made in respect of solvent companies can also generate acrimonious disputes over fees, particularly if the shareholders themselves are deadlocked and have used the appointment of a receiver as a “holding measure” to maintain the status quo while they attempt to sort out their disputes. The point made by the first and second defendants is insightful: solvent companies which need the help of the court in appointing receivers over their affairs are often those that are most dysfunctional and hence those that require greater curial supervision. A.41       For this reason, I am content to summarise the position as follows: all classes of insolvency practitioners who owe their offices to curial appointment and whose fees are subject to curial approval should be required to submit a costs schedule if their fees are expected to exceed $200,000, irrespective of whether they are working on a solvent or insolvent company. That being said, I appreciate that the carve-outs I have suggested are always subject to review, particularly if they are formally adopted in legislation. When should a costs schedule be submitted? A.42       The position in other jurisdictions varies. In England, the “fees estimate” has to be submitted at the same time that approval for the basis of remuneration is sought:ie, within 18 months of appointment (see [A.8] above). In Australia, the ARITA Code does not stipulate when prospective approval for fees should be sought, but it stipulates that insolvency practitioners intending to bill on a time cost basis furnish creditors with an estimate of the fees that will be charged at the time of their first communication (usually at the first meeting of creditors — see [A.14] above). In New Zealand, the default position seems to be that approval will be sought at the time of appointment (see [A.18] above). A.43       IPAS proposes that a costs schedule should be submitted within a month of appointment. It seems to me that this suggestion is eminently reasonable. While it would be ideal for the costs schedule to be submitted at the time of appointment, I accept IPAS’s submission that this is not always practicable since time is needed for the insolvency practitioner to familiarise himself with the nature of the task in order that a meaningful costs schedule can be prepared. Furthermore, prior to appointment, the insolvency practitioner may not have the necessary access to the company’s records or other relevant information that he would require in order to prepare a useful costs schedule. A.44       The R&M submits that, in the case of court-ordered liquidations, a costs schedule should be presented at the time of the first meeting of creditors and contributories, which must take place within 21 days of the date of the winding up order (or one month where a special manager is appointed — r 106 of the CWUR). While this would be ideal (since the creditors would be able to approve the costs schedule at the meeting), I am not sure that it would be possible in all situations. I am therefore content to propose that the default time limit be one month in all cases subject to any reasonable application for an extension of time. To whom should a costs schedule be submitted and what principles should be applied in deciding whether to approve it? A.45       Following the lead of other jurisdictions, the costs schedule should be submitted to whichever approving body has jurisdiction over the subject of the insolvency practitioner’s fees. In the main, this will be the court, although it will not invariably be the case. In the case of a liquidation, for example, the costs schedule will have to be submitted to a committee of inspection (if one was appointed) or to the body of creditors at a meeting for approval. If no agreement can be secured then, as under the present regime, approval will have to be secured from the court (see s 268 CA). A.46       In deciding whether or not to approve the costs schedule, the same principles which apply to the retrospective applications ought also to apply to prospective applications:viz, the quantum of remuneration sought must represent a fair, reasonable, and proportionate reflection of thevalueof the services to be rendered (see [31]–[40]; [47]–[60] of the main judgment above). How should the costs schedule be submitted? A.47       The form of the submission should be similar to that currently practised for retrospective approvals of remuneration. For applications to the court, this will take the form of aninter partessummons supported by an affidavit annexing the costs schedule. In suitable situations, necessary steps can be taken to preserve the confidentiality of the information contained inside (for example, leave of court may be sought for the court file in respect of the approval application to be sealed after its conclusion). This would be particularly important in cases, as pointed out by the R&M, where the insolvency practitioner anticipates performing work in relation to legal action to be taken against a director or contributory of the company.",
        "What happens once the costs schedule is submitted?": "Payments out A.48       Once the costs schedule has been approved, the main question which has to be answered is whether the sums approved can be drawn down without further approval of court. Broadly speaking, there are three possibilities. (a)     The first is the “automatic payment” model. Under this approach, the sums contained within the costs schedule would be treated as having been “fixed” or “determined” within the meaning of the respective statutory provisions. Thus, all sums approved can be drawn down without further approval and there is alsono need to seek retrospective final approval of the sums paid outunless the insolvency practitioners or the company (or its creditors) so desire. This is the approach suggested in the ARITA Code (see [A.15] above). (b)     The second is the “periodic payment” model. Under this approach, the costs schedule is treated as an ordernisi: the payments made out are provisional and not final. The insolvency practitioner is entitled to interim payments on account provided the total sum claimed under these periodic payments falls under the pre-approved cap and adheres to the conditions set out in the costs schedule. However, there is still an obligation to seek retrospective validation of all sums paid at the end of the engagement and it is only then that the remuneration is deemed to have been “fixed” or “determined” within the meaning of the statute. If the total sum paid out exceeds the global sum fixed by the court for the engagement as a whole (in other words, if the court decides at the end that the sum approved in the costs schedule was too high but the full amount has already been drawn down through the interim payments), then the insolvency practitioner may be obliged to refund the difference. This is similar to the statutory model which currently exists in New Zealand in respect of payments made to court-appointed liquidators who seek to be remunerated according to the statutory rate (see [A.17(b)] above). (c)     The third is the “final payment” model. Under this approach, the purpose of the costs schedule is purely informational and any sums approved would not be treated as having been “fixed” by the relevant approving body. Thus, there is no automatic right to payments on account and the insolvency practitioner must seek retrospective approval in order to be granted a sum in remuneration (either periodically or at the end of the engagement as a whole). This is perhaps closest to the system presently in place in England and Wales (see [A.7]–[A.9] above), though I would note that the “fees estimate” also acts as a “fee cap” and no sum can be claimed in excess of it unless express approval is sought. A.49       As can be seen, the difference between the three models lies in their treatment of the jurisprudential effect of the costs schedule. In practice, the difference between the “periodic payment” and “final payment” models may not be very significant. Even under the “final payment” model, an insolvency practitioner may seek approval for interim payments to be made out to him on account even though no formal application for remuneration to be fixed is made to the court. For example, inRe Independent Insurance Co Ltd (in provisional liquidation)[2002] BCLC 709, the provisional liquidators of the company had applied for and been granted permission for monthly interim payments to be made out to them on account. The registrar ordered that these payments be fixed with reference to the provisional liquidator’s usual hourly rates and were made subject to two undertakings: (a) the provisional liquidators would regularly notify an informal creditors’ committee of the amounts paid; and (b) they would apply, on a quarterly basis, for retrospective approval of their remuneration. The order of the registrar was upheld by Ferris J on appeal, subject only to a variation to the effect that only 80% of the estimated remuneration would be paid out monthly, instead of the full sum (seeRe Independent Insurance (No 2)at [35]–[36]). A.50       At the end of the day, it is my view that the “periodic payment” model is the best approach to take. If the system of costs scheduling is to be taken seriously, parties must treat it as an exercise in “fixing” the remuneration of the insolvency practitioner within the meaning of the statutory scheme. This way, effort will be made to ensure that adequate thought is given to its preparation and to its approval. However, I still believe that a final review of the total sum paid out is valuable because any estimate provided at the start of the engagement will necessarily be provisional and tentative so it will be useful, for good order, for the total sum paid out to be adjusted at the end to ensure there is no over or under-payment. Furthermore, it is important to maintain curial supervision of the entire process since it might not always be sufficient to leave the matter to the initiative of the parties. A.51       With that being said, once adequate scrutiny is given to the costs schedule at the pre-approval stage, I do not think it will ordinarily be necessary to devote large amounts of time to examining the bills of costsde novoat the stage of final approval. In the main, sums which fall within the pre-approved limit should be approved as a matter of course. If the insolvency practitioner claims a sum which is greater than the pre-approved limit but the deviation is minor (eg, less than 15%), then some degree of latitude should be afforded and it should not ordinarily be necessary for an intensive review to be undertaken, so long as a reasonable explanation is proffered. It is only where there is a 15% or greater discrepancy between the quantum of remuneration sought and approved, or if there are particular matters which call out for attention, that a more intrusive review is warranted. A.52       I think it is important to note that this principle cuts both ways. Arguments (perhaps mounted by creditors or other stakeholders) that the final sum ought to fall more than 15% below the pre-approved total will also be met with more intensive scrutiny. For this reason, I believe that it would be rare that the final sum that is approved will fall under the pre-approved sum (necessitating a clawback of interim payments). This should assuage the concern raised by the third defendant that there would be a risk that “urgency and necessity of work done… may be unfairly downplayed in hindsight” by the approving body reviewing the matter many months (or even years) after the fact. In any event, it is also entirely open for parties to agree that only a portion, instead of the whole, of the estimated sum will be paid out periodically as was the case inRe Independent Insurance (No 2), where the court ordered that only 80% of the estimated sum would be paid out each month, instead of the whole (see [A.49] above), reducing the likelihood that there will need for a clawback of any sums paid out. This is an option that is open to the court approving the interim payments. I would expect that the exercise of this discretion would largely depend on the size of the interim payment. A.53       I note that this stands in contrast with the positions in England and Australia where the costs schedule functions as a “hard cap” — no sum may be claimed in excess of that which was pre-approved unless further approval is sought. This difference is the result of a deliberate policy choice. In my view (and on this point I agree with the submissions of IPAS), that the practice of producing a costs schedule is necessarily an imprecise one. It would be prepared on the basis of the best-available information at the time but things can and very often do change. If an insolvency practitioner were strictly prohibited from claiming any sum above that which was pre-approved then this might produce some unintended and undesirable consequences. For example, it might encourage insolvency practitioners to submit unrealistically high costs estimates or it result in the filing of multiple summonses for amendments for minor alterations to be made, wasting costs in the process. A.54       Before I leave this point, I should mention that when my Grounds of Decision was circulated to the parties in draft, the first and second defendants were concerned that r 173 of the CWUR might preclude payments from being made on a periodic basis (at least where the insolvency practitioner in question is a liquidator). Rule 173 reads: No payments in respect of bills of costs, charges or expenses of solicitors, managers, accountants, brokers or other persons, other than payments for costs and expenses incurred and sanctioned under rule 45 and payments for bills which have been taxed and allowed under orders made for the taxation thereof, shall be allowed out of the assets of the company without proof that the same have been duly taxed and allowed by the Taxing Master. … They also drew my attention to the decision of this court inRe Micropolis (S) Ltd[1998] 3 SLR(R) 265 (“Re Micropolis”). In that case, the liquidators had received various bills of costs from persons engaged by them on behalf of the company to perform various services in connection with the insolvency. The liquidators accepted that they were contractually bound to pay these sums but feared that they would fall foul of r 173 if they did so before first having the bills taxed. Thus, they filed an originating summons to this court to determine whether payments may be made out to the persons hired by them out of the assets of the company before taxation. G P Selvam J held that the wording of r 173 was unambiguous and required that the liquidators insist on a taxed bill before payments could be made out of the assets of the company. A.55       With respect, I do not share their concern as regards their interpretation of r 173. Rule 173 does not apply to the remuneration of the liquidator himself but to payments made topersons employed by the liquidator. Rule 173 finds its place in a section (rr 165–174) of the CWUR that is titled “TAXATION OF COSTS.” Rule 165, which is the first rule in this section, reads, “[e]very solicitor, manager, accountant, auctioneer, broker or other personemployed by a liquidatorin a winding up by the Court shall on request … deliver his bill of costs or charges to the Taxing Master …” [emphasis added]. By contrast, the remuneration of the liquidator himself is governed by a different set of rules (see rr 142 and 143 of the CWUR), which make no mention of the necessity for taxation to take place before the liquidator can be paid. Furthermore, s 268(3) of the CA, provides that a liquidator’s remuneration shall be determined either by agreement between the liquidator and the committee of inspection, at a meeting of creditors, or, failing either of those options, by the court (see [A.45] above). There is no mention in s 268(3) that the liquidator’s bill must be taxed before payment can be made. A.56       With that being said, the third defendant is correct in pointing out that r 173 would preclude periodic payments from being made to solicitors or other professionalshired bythe insolvency practitioners out of the assets of the company without taxation. I appreciate that this might cause the liquidators some inconvenience, particularly in long insolvencies. In this regard, I can only echo the words of Selvam J inRe Micropolis(at [6]) where he described the present situation in characteristically forthright terms: I must, nonetheless, hasten to add that my decision leads to absurd and unfair results because it places the liquidators in an invidious and untrustworthy position of not honouring his word and having to ask all those whom he engaged to go through the charade of taxation and increases the drain on the assets of the company. With the implementation of the costs schedule, I hope that it would provide the impetus for timely legislative intervention to examine appropriate amendments to address this issue. Amendments of costs schedule A.57       Any costs schedule tendered to court is subject to amendment. The insolvency practitioner would be expected to submit an updated costs schedule as soon as it becomes clear that the sum of remuneration claimed will exceed the pre-approved sum by 15%. In seeking further approval, the insolvency practitioner has to explain the following (see, generally, r 4.127AB(3) UK IR 1986): (a)     the reason why he has exceeded, or is likely to exceed, the previous estimate; (b)     the additional work he intends to undertake, the time taken or expected to be taken for the additional work; and (c)     the persons who will be assigned to the task and the rates they will charge. A.58       It may be queried why an amendment is even necessary at all if the final sum of fees claimed is still subject to a final review when a greater sum than that which had previously been approved may be claimed. The short answer, I think, lies in the character of the insolvency practitioner’s office: he is a fiduciary and must do all he can to serve the interests of the creditors (and other stakeholders). If he expects the sum of remuneration claimed to exceed the pre-approved amount appreciably, he should be expected to inform all parties of this, explain why, and seek further approval. After all, theraison d’êtreof a costs schedule is to reduce “bill shock” and to give stakeholders an opportunity to exercise some supervision over the insolvency practitioner’s work. In order for this objective to be achieved, the costs schedule must be as accurate as practicable. While it is accepted that the pre-approval of the estimate was made on the basis of the best-available information at the time, if material information has come to light (eg, a task proves to be more time-consuming than expected or if additional items of work need to be undertaken) then this information should be placed before the parties and an amendment should be tabled. In this connection, the court will be astute to inquire why amendments to the costs schedules were not taken out when it wasclearthat the insolvency practitioner in question both knew that the pre-approved sum was too low and when he had ample time to make the application. The court can and will draw the necessary adverse inferences at the time of the final review. Declining an appointment A.59       Should court approval for the initial costs schedule be withheld when first submitted, the insolvency practitioner should be at liberty to decline the appointment. There is neither any sound reason in principle nor in policy for this court to compel an insolvency practitioner to take up office on terms which are against his will. However, should it be the case that approval for anamendmentis declined, leave of court should be sought for the termination of the appointment (just as in the case of solicitors).",
        "Summary": "A.60       In this decision, I have sought to explain the background which inspired the costs schedule and how it is intended to work in practice. In so doing, I have surveyed the experiences in other jurisdictions and crafted a proposal which I believe will assist insolvency practitioners and ultimately the court in assessing the appropriate quantum of the fees. I believe it would be helpful at this juncture to summarise the core features of the costs schedule. (a)     The costs schedule is a summary of the estimated costs of an appointment that is supported by details of the work expected to be undertaken and the resources that will be devoted to each task. It is designed to strengthen confidence in the insolvency process by allowing for greater control and supervision over the conduct of an insolvency and by making decisions on the remuneration of insolvency practitioners fairer and more transparent. In preparing the costs schedule, practitioners should note the following: (i)       All classes of insolvency practitioners (save for scheme managers) who owe their offices to curial appointment and whose fees are subject to curial approval should be required to submit a costs schedule if their fees are expected to exceed $200,000, irrespective of whether they are working on a solvent or insolvent company. (ii)       The costs schedule should contain all the information that is necessary for the court (and the relevant stakeholders) to make an informed decision as to whether the estimates of fees prescribed represent fair, reasonable, and proportionate value. While the general principle is one of full disclosure, the level of detail required will be proportionate to the complexity of the engagement. (iii)       The costs schedule should be submitted to the relevant approving bodies within a month of appointment in the usual way that retrospective approval for remuneration would have to be sought. In deciding whether to approve the costs schedule, the approving bodies should have regard to the same principles which apply to retrospective reviews of bills of costs. (b)     The approval of a costs schedule is to be treated as the provisional “fixing” of the insolvency practitioners’ remuneration within the meaning of the relevant statutory scheme. However, there is still a need to seek retrospective validation of all sums paid at the end of the engagement and it is only then that the remuneration is deemed to have been finally “fixed”. After approval of the costs schedule, the following consequences follow: (i)       At the time of the final review, sums claimed which fall under the fee cap will usually be approved as a matter of course. Minor deviations (of less than 15%) will ordinarily not necessitate any intrusive review unless there are particular matters which call out for attention. (ii)       Interim payments can be made on account on a periodic basis, provided the total sum paid out does not exceed the pre-approved cap. If the total sum paid out in interim payments exceeds the final quantum fixed by the approving body, the insolvency practitioner may be required to account for the difference. (iii)       The costs schedule is subject to amendment. Amendments should be made where deviations of more than 15% from the pre-approved sum are expected. Should approval for an amendment be declined and the insolvency practitioner desires to terminate his appointment, he has to seek leave from the approving body.",
        "Future directions": "A.61       I am optimistic that the costs schedule will achieve its intended objectives because of the considerable input and support I have received from the parties (who comprised a representative cross section of the insolvency practice) and, perhaps most significantly, IPAS, which represents the interests of the professionals who work in this area. Ultimately, the response from most jurisdictions to the vexed question of insolvency practitioners’ fees has been largely through the legislative route. As I had alluded earlier, this would be certainly desirable but that would take some time. In the interim, I will be recommending to the Chief Justice to refer this matter to the Rules Committee for further study and, if thought fit, implementation either through incorporation in a new Practice Direction or by way of suitable amendments to the Rules of Court. A.62       Pending the formal institution of such a system, I would invite members of the insolvency Bar to adopt the practice of submitting a costs schedule. It is my hope that this will provide some interim relief to the problems that have plagued this area of practice. In the event that the costs schedule is refined or improved upon by subsequent legislation, I believe it would be most welcome by all stakeholders who will view it positively as progressive step in the right direction. A.63       It leaves me now to thank all the parties for their helpful contributions over and beyond the scope of the matter before me in assisting the court to craft a proposal of costs scheduling which, hopefully, will benefit the insolvency practice in Singapore."
    }
}