{
    "case_title": "The Bank of East Asia Limited\n      v\n      Sudha Natrajan",
    "ncitation": "[2015] SGHC 328",
    "coram": "Kannan Ramesh JC",
    "sections": {
        "Introduction": "1       Did the Defendant execute a Deed of Assignment of Proceeds (“the Deed”) in duplicate on 10 January 2014? This is the central issue in this case. Bank of East Asia Limited, the Plaintiff, asserted that the Defendant signed the Deed in duplicate on 10 January 2014. The Defendant, Sudha Natrajan, emphatically denied that she had penned her signature on the Deed on that day, or at all. Pertinently, the person who was the source of the Defendant’s travails, her husband, Rajan Natrajan (“Rajan”), was not called by the Defendant as a witness to cast light on the facts and circumstances surrounding the execution of the Deed. I find this omission jarring given that Rajan was a co-signatory of the Deed and a central figure in these events. Rajan was a major shareholder and principal director of Tecnomic Processors Pte Ltd (“Tecnomic”) in whose favour the Plaintiff had granted certain banking facilities (“the Banking Facilities”). It was in respect of Tecnomic's liabilities under the Banking Facilities that the Deed was executed. Tecnomic was placed in compulsory liquidation on 10 January 2014 and Rajan was adjudicated a bankrupt on 12 June 2014, prior to the commencement of this action. That explained why they were not parties before me",
        "The Plaintiff’s claim": "2       The Plaintiff’s claim against the Defendant is for the sum of US$1,789,398.56, and interest on this sum from 13 June 2014 until the date of full payment at the rate of 6% per annum above the Plaintiff’s Base Lending Rate, and costs on a full indemnity basis. 3       The cause of action is based on the Deed. The Defendant, as well as Rajan, were alleged to have covenanted to be jointly and severally liable for sums due and owing by Tecnomic to the Plaintiff under the Banking Facilities.",
        "The Defence": "4       The principal defence is that the Defendant was not a party to the Deed because she did not sign the same. The Defendant initially ran another substantive defence,viz, the Deed was not supported by consideration. The nub of that defence was that the Plaintiff was not in a position to make or continue to make loans and advances or otherwise give or continue to give credit or accommodation or time to Tecnomic because it was ordered to be wound up on the day when the Deed was allegedly signed. The Defendant argued that there was therefore no consideration to support the Deed. No dispute was raised as regards the quantification of the Plaintiff’s claim and the claim for interest and costs. 5       While the defence of absence of consideration was also pursued in the Defendant’s written submissions, counsel for the Defendant conceded the defence, and rightly so in my view, in the course of oral submissions, given that the Deed was executed as a deed (therefore obviating the need for consideration). Accordingly, if I find that the Defendant had signed the Deed, judgment against her in terms of the Plaintiff’s claim must be entered.",
        "The background facts": "6       The Plaintiff was a bank registered in the Hong Kong SAR and carried on business in Singapore at its local branch. 7       The Defendant and Rajan were joint owners of a property situated at 41 Eng Kong Place, Singapore 599113 (“the Property”). The Property was the matrimonial home of the Defendant and Rajan. The Defendant was also an employee of Tecnomic between April 2007 and September 2013, during which time she held the position of Human Resource Manager. She ceased employment shortly before Tecnomic defaulted on payment under the Banking Facilities. 8       The Plaintiff granted the Banking Facilities to Tecnomic pursuant to a letter of offer dated 6 September 2012. The letter of offer incorporated the Plaintiff’s Standard Terms and Conditions Governing Banking Facilities. 9       By a guarantee dated 7 September 2012 (“the Guarantee”) executed by Rajan and one Sarada Devi Krishna Pillai Suresh Kumar (“Suresh”), Rajan and Suresh jointly and severally agreed to pay on demand all sums owed by Tecnomic to the Plaintiff under the Banking Facilities. At all material times, Rajan was a significant shareholder of Tecnomic and one of its two directors. 10     Tecnomic defaulted on two payments that were due under the Banking Facilities on 18 October 2013 and 21 November 2013 respectively. A letter of demand dated 22 November 2013 (“the 22 November 2013 Letter”) was sent to Tecnomic demanding payment of the sums that had fallen due. This letter was copied to both Rajan and Suresh. Pertinently, the copy to Rajan was sent to the Property. 11     The demand in the 22 November 2013 Letter was unsatisfied resulting in the termination of the Banking Facilities by a letter dated 2 December 2013. That letter was sent to Tecnomic at its registered address. 12     It would appear that discussions took place in December 2013 between Rajan and the Plaintiff to examine how best to address the situation. The Plaintiff suggested that the Property be taken as collateral in return for forbearance on its part in instituting proceedings under the Banking Facilities. Upon Rajan agreeing to the suggestion, the Deed was drawn up in duplicate by the Plaintiff’s solicitors and handed to Rajan for execution. The Deed was to be signed by Rajan, the officers of Tecnomic (on its behalf), and the Defendant given that she was a joint owner of the Property. Under cl 2 of the Deed, Rajan, the Defendant, and Tecnomic jointly and severally covenanted to pay all sums owed by Tecnomic to the Plaintiff under the Banking Facilities. 13     Both copies of the Deed were returned by Rajan to the Plaintiff on 3 January 2014. It was noticed that although the Deed had been signed, it had not been witnessed. It is unclear whether the Defendant had also signed the Deed at that time though the Plaintiff’s Deputy General Manager, Mr Heng Juay Yong (“Mr Heng”), testified that he believed that she had. A fresh set of the Deed was prepared (in duplicate) and given to Rajan for re-execution, this time with instructions to have the signatures witnessed by a solicitor. 14     On 10 January 2014, Rajan handed two copies of the Deed to the Plaintiff. The two copies of the Deed that were returned were introduced in evidence as “D1” and “D2”. D1 and D2 carried the signatures of Rajan, the Defendant, and that of Rajan and one Ravi Krishnamurthy (both of whom signed on behalf of Tecnomic). It was affixed with the common seal of Tecnomic. D1 and D2 also bore the signature of Mr Johnny Cheo (“Mr Cheo”), a solicitor, as a witness to the signatures of Rajan (in his personal capacity only) and the Defendant. It was the Plaintiff’s position that these signatures and Tecnomic’s seal were on D1 and D2 when Rajan returned them on 10 January 2014. Mr Cheo was retained by Rajan, not the Plaintiff, for the purpose of witnessing Rajan and the Defendant’s signatures. Up to this time, the Plaintiff’s representatives had no interaction with the Defendant. In fact, the Plaintiff’s interaction with regard to the Deed was only with Rajan. 15     The Deed was then dated 10 January 2014 by the Plaintiff’s solicitors. A caveat was lodged by the Plaintiff against the Property on 20 January 2014 on the basis of the interest that was created under the Deed in favour of the Plaintiff (“the Caveat”). 16     Separately, on 20 December 2013, a creditor of Tecnomic, Taiyo Enterprise Inc, commenced winding-up proceedings against the company. On 10 January 2014, Tecnomic was ordered to be wound up. The Plaintiff asserted that it only became aware of the winding up proceedings against Tecnomic on 28 January 2014 when it was notified of the same by the liquidator of Tecnomic pursuant to a notice dated 23 January 2014. The Defendant did not accept that the Plaintiff was, as at 10 January 2014, unaware of the winding-up proceedings against Tecnomic. However, there was no evidence to suggest that the Plaintiff knew of the proceedings. In particular, there was no evidence that the officers of Tecnomic specifically Rajan or Suresh, or the Defendant notified the Plaintiff of the winding up proceedings. That the Plaintiff required Tecnomic to be a party to the Deed would suggest that it was not in fact aware of the winding-up proceedings at the material time. 17     On 10 February 2014, the Australia and New Zealand Banking Group Limited filed a bankruptcy application against Rajan. Rajan was made a bankrupt pursuant to that application on 12 June 2014. 18     By a letter dated 17 March 2014 from the Plaintiff’s solicitors to the Defendant (“the 17 March 2014 Letter”), the Plaintiff demanded payment under the Deed of the sums due and owing by Tecnomic. The letter was sent by registered post to the Property. The Defendant denied receiving the 17 March 2014 Letter. 19     This action was commenced on 16 July 2014, and service of process was effected on the Defendant at the Property on 19 July 2014. Following service, the Defendant, through her then solicitors, Messrs C.M. Sum & Company, sought a copy of the Deed from the Plaintiff’s solicitors. For the first time, the Defendant alleged that she had not signed the Deed. Following receipt of copies of the Deed, the Defendant filed a police report on 4 August 2014 (“the Police Report”) alleging that her signatures on D1 and D2 (collectively, “the Signatures”) had been forged. The Police Report is of significance in the evidential matrix.",
        "The Issue – did the Defendant sign the Deed on 10 January 2014?": "20     The pleadings frame two issues for my consideration. As a consequence of the concession by counsel for the Defendant that consideration was not required (see [5] above), there is really only one issue left for me to consider. This is what I described at the outset as the central issue: did the Defendant execute the Deed in duplicate on 10 January 2014 before Mr Cheo or at all? 21     The Plaintiff called Mr Heng and Mr Cheo as its witnesses. The Defendant also testified. In addition, she called a handwriting expert, Mr Yap Bei Sing (“Mr Yap”), to prove that the Signatures were not penned by her. 22     Having heard and reviewed the evidence and the submissions of counsel, I have difficulty accepting the Defendant’s assertion that she did not sign D1 and D2 on 10 January 2014 before Mr Cheo. The picture that she painted stretched the limits of credibility. Consequently, I harbour significant doubt that she is a truthful witness. Also, I am extremely troubled by her failure to call Rajan as a witness to corroborate her evidence on the events leading up to and surrounding the execution of D1 and D2. The Defendant and Rajan were living under one roof. That is clear. In these circumstances, and given that it was Rajan’s conduct that had caused the Defendant’s misfortunes, I find it inexplicable that he was not called as a witness by the Defendant. To compound my doubt, no explanation was offered by the Defendant for his absence. I will now set out my reasons.",
        "Is the Defendant’s testimony credible?": "23     Several points must be noted. First, it was not the Defendant’s position that Rajan did not sign D1 and D2 on 10 January 2014 before Mr Cheo. There was no police report filed by Rajan that his signatures were forged. In fact, the Police Report stated clearly that Rajan had signed the Deed on 10 January 2014. It would therefore follow that on the Defendant’s case, Rajan intended the Deed to bind. There was every reason for Rajan to have wanted the Deed to bind. After all, he was one of the primary beneficiaries of the moratorium under the Deed. 24     Secondly, if Rajan intended the Deed to bind, all the parties to the same would have to sign it. This would include the Defendant. Being a joint owner of the Property, the Defendant would have to execute the Deed in order for the Plaintiff to take security over the Property. Rajan must have been fully aware of this. 25     Thirdly, it was not the Defendant’s position that Rajan had forged the Signatures. Nor was it her position that the Plaintiff’s representatives had forged the Signatures. She testified that when she asked Rajan whether he forged the Signatures, she was told that he did not. She seemed to have accepted that as she did not allege that Rajan had forged the Signatures. Indeed, if her position in fact was that Rajan had been responsible for the forgery, Rajan would surely have been called as a witness. 26     Fourthly, it would be reasonable to surmise that Rajan would have procured or persuaded the Defendant to execute the Deed. This must be the logical conclusion arising from Rajan’s desire to have the Deed bind. Rajan would have wanted and expected the Defendant to execute the Deed. Without the Defendant executing the Deed, the Plaintiff would not hold its hands and theraison d’êtrefor the Deed would be lost. 27     Fifthly, and as a consequence, Rajan would have told the Defendant prior to 10 January 2014 that she needed to execute the Deed. Seen in this light, the Defendant’s testimony that she was not told by Rajan about the Deed until after she had been served with process in this action on 19 July 2014 is not at all credible. There are further reasons in this regard which I will set out below (see [31] – [35] below). 28     Sixthly, Rajan would have made arrangements for the Defendant to execute the Deed, and, upon executing the same, he would have told the Defendant to follow suit. 29     In conclusion, flowing logically from the first to the sixth points above, the Defendant must have signed the Deed on 10 January 2014. 30     It is pertinent to observe that the only party who had control of D1 and D2 until it was delivered to the Plaintiff on 10 January 2014 was Rajan. D1 and D2 bore the signatures of Rajan and the Signatures. If Rajan did not forge the Signatures, which is the Defendant’s position, it must surely then have been the Defendant who was responsible for them. 31     The Defendant steadfastly maintained that she only became aware of the Deed when she was served with process on 19 July 2014. It must therefore follow that Rajan did not tell her about the Deed until on or after 19 July 2014. There are two key points that make the Defendant’s evidence in this regard difficult to accept. 32     First, the 17 March 2014 Letter. This letter was sent to the Defendant at the Property by registered post. The acknowledgement receipts produced by the Plaintiff show that the letter had been delivered in the mode indicated. The Defendant testified under cross-examination that she had received all her letters other than this one letter. That just seems too convenient an answer. There is conceivably no reason why only the 17 March 2014 Letter did not reach the Defendant. It is more reasonable to conclude that it in fact did reach her. If it did, she would have been aware of the Deed as the letter made clear reference to it as the basis for the demand by the Plaintiff. I believe the Defendant had to take this position because she asserted that she only became aware of the alleged forgery on 19 July 2014. 33     Secondly, the Caveat, which was lodged on 20 January 2014 (see [15] above). It described in clear language that the ground for the claim was: [A] Deed of Assignment of Sale Proceeds of [the Property] dated 10 January 2014 executed by the Registered Proprietorin favour of the Caveator as security for the repayment of all sums owing to the Caveator by the Registered Properietor and/or the Borrower, Tecnomic Processors Pte Ltd. [emphasis added] 34     Under s 117 of the Land Titles Act (Cap 157, 2004 Rev Ed), the Registrar of Titles is under a duty to give notice of lodgement of a caveat on a caveatee in order for the caveatee to decide if an application to remove the caveat ought to be made. Rajan and the Defendant were caveatees under the Caveat. Therefore, the Defendant would have received notice of the Caveat and, by extension, have known of the Deed shortly after 20 January 2014, at the latest. 35     I should add that when the Defendant was confronted with the Caveat by counsel for the Plaintiff, in a vain attempt to extricate herself, she said that Rajan might have mentioned it to her but she did not have a clear recollection. Subsequently, she changed her position and said that Rajan only mentioned the Caveat to her after she had been served with process in this action. I see this as nothing but a contrived attempt to re-assert her position that she did not know about the Deed until 19 July 2014. She was vainly trying to create distance between herself and the Deed. 36     Faced with this sea of doubt, the Defendant attempted to offer an explanation as to why Rajan purportedly did not tell her about the Deed. She testified that Rajan did not do so because he was under the impression the Plaintiff did not intend to use the Deed. Putting aside the fact that this was hearsay evidence, the following should be noted: (a)     This explanation had never been proffered by the Defendant before the trial, particularly in the Police Report or the Defendant’s Affidavit of Evidence-in-Chief. (b)     It is difficult to conceive why the Plaintiff, a bank, would procure a document such as the Deed without any real intention of using it. (c)     There is no documentary evidence to even remotely suggest that the Plaintiff had indeed given Rajan this impression. (d)     Even if this was true, it did not offer a good reason as to why Rajan would not have told the Defendant about the Deed. 37     The explanation borders on the absurd. The fact that the Defendant resorted to it reinforces my assessment that little credit should be given to her testimony. 38     There were other facets of her evidence that make me doubt the Defendant’s credibility. 39     First, the Defendant stated in the Police Report that Rajan told her that D1 and D2 did not carry the Signatures when he handed them over to the Plaintiff. I find this to be contrived. In this regard, I am cognisant of Mr Heng’s evidence that the Deed was returned to the Plaintiff with the Signatures. Rajan must have known that handing D1 and D2 to the Plaintiff unsigned by the Defendant would result in the Plaintiff rejecting them and telling him to have her sign them. I note that the Plaintiff’s interaction as regards the Deed was solely with Rajan and not the Defendant. Surely, Rajan would not have expected the Plaintiff to secure the Defendant’s signature. The expectation must have been that the Plaintiff would require Rajan to secure the Defendant’s signature. Therefore, Rajan must have requested the Defendant to sign the Deed. 40     Secondly, the Defendant attempted to explain the deficit in logic by introducing a third person into the equation — Suresh. She testified that Rajan had told her that: (a) he was forced to sign the Deed by Suresh; (b) he had passed the Deed to Suresh after he had signed it; and, (c) Suresh had thereafter passed the Deed to the Plaintiff. It is notable that notwithstanding the obvious relevance of this information, it was not mentioned in the Police Report. Also, it did not find its way into the Defendant’s Affidavit of Evidence-in-Chief. This raises significant doubts as to its veracity. 41     In fact, the Defendant’s testimony is inconsistent to a material extent with the Police Report. There, the Defendant said it was Rajan who had handed the Deed to the Plaintiff after he had signed it. Mr Heng’s testimony was also along the same vein — that it was Rajan who had handed over the Deed. When this contradiction was pointed out, the Defendant was not able to offer an explanation for the inconsistency. The Defendant’s testimony in this regard, this contradiction apart, is not credible. How was Suresh able to force Rajan to sign the Deed? What was his leverage? Why would Suresh need to force Rajan to sign the Deed in the first place? Why would Rajan have passed the Deed to Suresh without having first obtained the Defendant’s signature? Why could Rajan not have handed the Deed over to the Plaintiff himself particularly since he had been the one interacting with the Plaintiff? What purpose was served by handing the Deed to Suresh instead of the Plaintiff? Why would Suresh hand over the Deed to the Plaintiff without first obtaining the Defendant’s signature? These are searching questions that have not been answered. A pall is cast over the Defendant’s testimony as a result. 42     Thirdly, the Defendant testimony that she was unaware of the Banking Facilities and Guarantee is difficult to accept. The sum available for drawdown under the Banking Facilities was S$3,500,000. This was not an insignificant amount. In the circumstances, it is inconceivable that Rajan would not have told the Defendant, his wife, of his significant financial exposure. 43     Fourthly, the Defendant testified that she only became aware of Rajan’s financial difficulties sometime in February 2014 when issues arose in servicing the residential property loan on the Property. However, Tecnomic was in default by November 2013 resulting in the 22 November 2013 Letter being sent. A copy of the said letter was also sent to Rajan, as the Guarantor, at the Property. On 2 December 2013, the Banking Facilities were recalled and on 20 December 2013, winding-up proceedings had been commenced against Tecnomic. The upshot of all this is that by late November 2013 or at the very latest early December 2013, there was a real possibility of Rajan’s contingent liability under the Guarantee becoming due and payable. In this regard, I note again Mr Heng’s testimony that discussions with Rajan on the Deed had started in December 2013. I therefore find it difficult to accept that Rajan would not have disclosed his circumstances to the Defendant at latest by early December 2013. I conclude that the reason for the Defendant’s insistence that she was not aware of Rajan’s financial difficulties until February 2014, and indeed her evidence that she was not aware of the Banking Facilities and the Guarantee, was to distance herself from the Deed. 44     Fifthly, returning to the Defendant’s steadfast refrain that she only became aware of the Deed on 19 July 2014, I make three observations: (a)     Having signed the Deed, it was inconceivable that Rajan would not have followed up with the Defendant to ascertain whether she had signed it. Self-interest and self-preservation alone would have motivated him. (b)     With Tecnomic being wound up on 10 January 2014, Rajan’s liability under the Guarantee would have become immediate and real. It is therefore inconceivable that he would not have disclosed his situation and the Deed to the Defendant. (c)     Bankruptcy proceedings had been commenced against Rajan on 10 February 2014. As a prelude to that, a statutory demand would have been served at least 21 days before, taking us back to a point in January 2014 close to the date of execution of D1 and D2. It is inconceivable that Rajan would not have disclosed the Deed to the Defendant when disclosing the financial malaise he faced. Certainly, when he was made a bankrupt on 12 June 2014, he must have told her about the Deed. (d)     If Rajan and not the Defendant had received notification of the Caveat and the 17 March 2014 Letter, Rajan would surely have queried the Defendant on whether she had signed the Deed and under what circumstances given that both documents made clear reference to the Deed. 45     In the round, that the Defendant resorted to an obviously contrived position leads me to believe that the Defendant was not being truthful when she testified that: (a)     she was not aware of the Deed until 19 July 2014; and (b)     she did not sign D1 and D2 on 10 January 2014 before Mr Cheo. The inference was strong that the Defendant did in fact sign D1 and D2 on 10 January 2014 before Mr Cheo.",
        "Mr Cheo’s evidence": "46     The seeds of doubt I harbour over the Defendant’s testimony are fortified by the evidence of Mr Cheo. Mr Cheo testified under subpoena that he witnessed the execution of D1 and D2 by Rajan and the Defendant in his office on the morning and the afternoon respectively of 10 January 2014. I find Mr Cheo’s evidence to be clear and cogent. There is nothing in the surrounding circumstances that shook it. I highlight three points that illustrate to me the credibility of his testimony. 47     First, Mr Cheo testified that when he witnessed Rajan’s signatures and the Signatures, he took photocopies of the identity cards of Rajan and the Defendant. These were produced in evidence and annexed to a statutory declaration he tendered to this court. He also testified that those copies were kept in a file marked “Miscellaneous” in his office. Counsel for the Defendant did not challenge Mr Cheo’s evidence in this regard. Nor did he ask for production of the “Miscellaneous” file. Surely the Defendant would have asked for the file to be produced if it was her position that Mr Cheo was not telling the truth. If a photocopy of her identity card was missing from the file, there would be a sound basis to question Mr Cheo’s testimony. Indeed, there was nothing to suggest that photocopies were not taken. I therefore find that the photocopies were taken. That being the case, it would be reasonable to conclude that the Defendant did execute D1 and D2 before Mr Cheo. 48     Secondly, Mr Cheo did not witness the signatures of the officers of Tecnomic on D1 and D2. His signature did not appear in the “witness portion” for those signatures in both documents. His evidence was that the signatures of the officers were already on D1 and D2 when Rajan brought the documents to his office. He declined to witness them as they were not signed before him. If indeed Mr Cheo had ‘blind signed” D1 and D2 as regards the Signatures, as the Defendant seemed to suggest, it is difficult to understand why he would not have purported to witness the signatures of the officers of Tecnomic. This suggests that he did not “blind sign” D1 and D2. 49     Thirdly, I find no compelling reason why Mr Cheo would have been prepared to accept any request from Rajan to “blind sign” D1 and D2 as regards the Signatures. If the Defendant’s allegation is to be accepted, Rajan must have made and Mr Cheo must have accepted that request. I note that: (a) Mr Cheo’s past interactions with Tecnomic were primarily to witness documents; (b) his point of contact was one Anand Subramaniam and not Rajan; (c) his familiarity with Rajan was limited to the exchange of courtesies along the corridor as Tecnomic’s and Mr Cheo’s offices were on the same floor; and, (d) he had not been instructed on any substantive matter by Tecnomic. There was therefore no reason why he would have accepted a request from Rajan to “blind sign” D1 and D2 as regards the Signatures. 50     For completeness, I should add that there were aspects of D1 and D2 which counsel for the Defendant probed in cross-examination and highlighted in submissions as suggesting that Mr Cheo did not witness the Signatures. I highlight the more salient; that: (a)     The date “10 January 2014” (found on page 15 of both documents) was stamped on D1, but it was written by hand on D2. This was the page where Rajan had signed. (b)     From a visual inspection, the Signatures appeared to be different. (c)     The Signatures differed in colour appearing to be darker in tone than the other. 51     The Defendant’s case was that Mr Cheo was not telling the truth when he testified that he had witnessed the Signatures. This was a serious allegation. Complaints of the type outlined above would hardly be sufficient to impugn the credibility of Mr Cheo. 52     There are therefore compelling reasons to accept Mr Cheo’s evidence. Acceptance of Mr Cheo’s evidence that he had witnessed the Signatures on the afternoon of 10 January 2014 would be fatal to the Defendant’s case. Not only would it drive a stake through her testimony, it would also put paid to her defence that she was not a party to the Deed because the Signatures were forgeries. The Defendant turned to the evidence of Mr Yap hoping that it would be the silver bullet to Mr Cheo’s testimony.",
        "The Defendant’s handwriting expert": "53     Mr Yap, a Consultant Forensic Scientist from the Health Sciences Authority, was called to prove that the Signatures were forgeries. Mr Yap’s evidence was that it was unlikely that the Signatures were signed by the Defendant. He arrived at this conclusion by comparing the Signatures with specimen and request signatures of the Defendant described as S1 to S9, and S10 respectively in his report (collectively, “the Specimen Signatures”). I reproduce below the Signatures and the Specimen Signatures: The SignaturesThe Specimen SignaturesD1D2   54     If the Defendant’s objective was to establish that the Signatures were not penned by her, surely it would have been more relevant to have called Rajan rather than Mr Yap as a witness. Rajan would have offered direct evidence that the Defendant did not sign D1 and D2 before Mr Cheo. Indeed, if the assertions in the Police Report are to be accepted, that was exactly what Rajan was supposed to have told the Defendant. Mr Yap’s evidence is hardly direct evidence that the Signatures were not the Defendant’s. 55     It is indisputable that both Rajan and Mr Cheo signed D1 and D2. Mr Cheo’s signature could logically only have been procured by Rajan. Though the Defendant did not make the submission, her case must be that Rajan procured Mr Cheo to “blind sign” D1 and D2 as regards the Signatures at the request of Rajan when he attended Mr Cheo’s office. I had said earlier that it was difficult to accept why Mr Cheo would have acceded to the request (see [48] – [49] above). But if he did, and that must be the Defendant’s case, Rajan’s evidence would have been absolutely critical to establish that Mr Cheo signed D1 and D2 without witnessing the Defendant append her signatures to the documents. It is therefore inexplicable that the Defendant did not call Rajan to testify to this effect. The rather convoluted effort to establish through Mr Yap a fact on which there was direct and relevant evidence readily available raises the question of the inference that I should draw from Rajan’s absence as a witness. I will address this issue later in this judgment (see [67] – [76] below). 56     The bar to proving forgery is high (see the judgment of the Court of Appeal inYogambikai Nagarajah v Indian Overseas Bank and another appeal[1997] 2 SLR(R) 774 (“Yogambikai”) (see alsoBayerische Landesbank Girozentrale v Khaw Hock Seang[2003] SGHC 42 at [14] applyingYogambikai). 57     The Court of Appeal inR Mahendran and another v R Arumuganathan[1999] 2 SLR(R) 166 stated the approach to be adopted in assessing the opinions of handwriting experts (at [16]): … It seems to us that the learned district judge paid undue attention and was influenced by the testimony of the handwriting experts.In our judgmentopinions of handwriting experts in particular should be approached with extreme caution and relied on to decide an issue of this importance only in the absence of other credible evidence.It is worth recalling the words of Sir John Nicholl in Robson andWakefield v Rocke(1824) 2 Add 53 at 79–80; 162 ER 215 at 225: But such evidence is peculiarly fallacious, where the dissimilarity relied upon is not that of a general character, but merely particular letters; for the slightest [peculiarities] of circumstance or position, as for instance, the writer sitting up or reclining, or the paper being placed upon a harder or softer substance, or on a place more or less inclined — nay, the materials, as pen, ink, etc being different at different times are amply sufficient to account for the letters being made variously at different times by the same individual.Independently, however, of anything of this sort, few individuals, it is apprehended write so uniformly that dissimilar formations of peculiar letters are grounds for concluding them not to have been made by the same person. [emphasis added in italics and bold italics] 58     The opinions of handwriting experts should only be resorted to in the absence of credible and direct evidence. From the Defendant’s perspective, there was direct evidence at hand in the form of Rajan’s testimony that she could have deployed to advance her case. Given the high standard of proof required to prove forgery, the Defendant’s failure to take the obvious path is difficult to understand. 59     I make several further observations. First, on a visual comparison of the Signatures with the Specimen Signatures, it is quite evident that they are markedly different. The Specimen Signatures show that the Defendant signed as “Sudha Natrajan”. However, the Signatures were simply signed “Sudha”. I do not require the assistance of a handwriting expert to tell me that the two are palpably different. That being the case, the utility of Mr Yap’s evidence insofar as it sought to establish that the Signatures were different from the Specimen Signatures is questionable. 60     Secondly, the conclusion that the Signatures and the Specimen Signatures were different did not necessarily mean that the former were not signed by the Defendant. If I am to accept Mr Cheo’s evidence, it must follow that the Defendant would have deliberately altered her signature when signing D1 and D2. 61     My Yap testified that it was very unlikely the Defendant could have markedly departed from the Specimen Signatures even if she was attempting to fake her signature. His view rested on the assumption that a person’s signature was coded in the brain through years of use and practice. Any effort to depart from the same would instinctively be met with psychological resistance 62     I am not convinced that Mr Yap’s view fell within the realm of expert testimony. While Mr Yap might be an expert on handwriting analysis, there is nothing in his qualifications or experience which suggests that his competence as an expert extended to the area of neuromuscular programming or psychology, which are fields of learning he purports to draw from in offering the opinion that it was very unlikely the Defendant could have markedly departed from the Specimen Signatures even if she was attempting to fake her signature. In this regard, I must caution that the qualifications of an expert witness have to be taken into account in ascertaining whether he is competent to testify on each precise area of inquiry he purports to give expert evidence on. This point has been noted by the Court of Appeal inPacific Recreation Pte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 at [67] in the following manner: … In addition, the expert’s report should state the precise manner, and not merely the general area of inquiry, in which the witness would be of use to the court. As stated inSaid Ajami v Comptroller of Customs[1954] 1 WLR 1405 at 1408: [N]ot only the general nature, but also the precise character of the question upon which expert evidence is required, have to be taken into account when deciding whether the qualifications of a person entitle him to be regarded as a competent expert. I am not at all convinced that the precise question of whether the Defendant could have forged her own signatures is something within the province of Mr Yap’s expertise. 63     Quite apart from whether Mr Yap was qualified to opine on this question, I find Mr Yap’s testimony quite untenable. It seems to significantly underplay the ability of a person to consciously and deliberately fake his signature by signing in an entirely different fashion. In such a situation, any subliminal resistance must surely succumb and be subordinate to the deliberate conduct of that person particularly when the motivations for doing so were less thanbona fide. This seems more a matter of common sense rather than expert testimony. Mr Yap’s reluctance to accept what seemed to be obvious is not entirely satisfactory. 64     To fortify my conclusion, I approach the analysis from the opposite end of the spectrum. In response to my question on whether the Signatures were good forgeries, Mr Yap candidly conceded that they were poor jobs. When asked what a forger would or could do if he were intent on achieving a good forgery, Mr Yap said that practising a signature multiple times or tracing a specimen signature on tracing paper could be effective options. Given how poor a reproduction the Signatures were of the Specimen Signatures — epitomised by the missing “Natrajan” — it would follow that the person who signed the Signatures had no desire at all to make them convincing. In this regard, Mr Yap’s testimony that the person who signed the Signatures was attempting to copy the Specimen Signatures is difficult to accept. Such a person would at the very least have signed “Sudha Natrajan”. 65     Why then would a third party forger intend such a poor reproduction? Or perhaps more fundamentally, was the forger really a third party forger? It seems to me that the second question is the more pertinent one. The obvious departure of the Signatures from the Specimen Signatures could very well be explained by the Defendant deliberately changing her signature. I do not wish to speculate as to why she would have done that. But her defence in this action that she was not a party to the Deed because the Signatures were forged, and the deafening absence of Rajan as a witness makes me think deeply as to her motivations at the material time. I shall say no more. 66     Therefore, while I am prepared to accept Mr Yap’s testimony that the Signatures were different from the Specimen Signatures, I am not prepared to accept his testimony that the Signatures were not signed by the Defendant. I saw nothing in Mr Yap’s evidence to displace my assessment of the credibility of Mr Cheo’s evidence.",
        "Should an adverse inference be drawn?": "67     Given my acceptance of Mr Cheo’s evidence, it must follow that the Defendant’s testimony that she did not sign D1 and D2 is not credible. It would also follow that the other aspects of her testimony, which were nothing more than efforts to distance herself from the Deed, are also cast in doubt. 68     However, there is another reason — and a compelling one — that leads me to reject the Defendant’s evidence generally and specifically, her evidence that the Signatures were penned by her. That is the conspicuous absence of Rajan as a witness and the inexplicable failure of the Defendant to offer an explanation for his absence. 69     From whatever angle one approaches the central issue, it seems crystal clear that Rajan is a critical witness to the Defendant’s defence. Much of the Defendant’s case theory centred around Rajan. Her consistent refrain that she was unaware of the Banking Facilities and the Guarantee, the demands by the Plaintiff on Tecnomic and Rajan, the existence of the Deed (at least until 19 July 2014) would have been best supported by testimony from Rajan. Moreover, on the central issue of whether the Signatures were hers and were signed before Mr Cheo on 10 January 2014, Rajan’s evidence would have been vital. 70     I had observed at the outset that I found the Defendant’s failure to call Rajan a jarring omission. His importance as a witness to the Defendant was plain and obvious. Equally, the fact that the Defendant had access to Rajan — they were living under one roof in the Property and were communicating — further compounded matters. Surely, if all that the Defendant had said were true, the Defendant’s predicament would have made it absolutely necessary for Rajan to have been called as a witness by the Defendant. 71     In fact, I am not able to fathom why Rajan did not voluntarily come forward to testify in an effort to exonerate the Defendant. The facts as sketched made it evident that Rajan was the cause of or at least a primary contributor to the Defendant’s travails. Not only did his conduct expose the Defendant to financial risk, it also put at risk the Property which was the matrimonial home of Rajan, the Defendant, and their children. His interest in salvaging the situation is to me readily apparent. His absence therefore startling. 72     The Plaintiff invited me to draw an adverse inference against the Defendant under illustration (g) of s 116 of the Evidence Act (Cap 97, 1997 Rev Ed) (“s 116(g)”) for her failure to call Rajan as a witness. 73     InCheong Ghim Fah and another v Murugian s/o Rangasamy[2004] 1 SLR(R) 628 (“Cheong Ghim Fah”) at [42] – [43], the court outlined the circumstances when an adverse inference might be drawn under s 116(g).Cheong Ghim Fahwas approved by the Court of Appeal inThio Keng Poon v Thio Syn Pyn and others and another appeal[2010] 3 SLR 143 at [44]. For an adverse inference to be drawn, the court must be first satisfied of the availability and materiality of the evidence in question (seeCheong Ghim Fahat [39]). That is a bridge which has been crossed here as regards Rajan. The court inCheong Ghim Fah(at [43]) then approved the principles set out in the English decision ofWisniewski v Central Manchester Health Authority[1998] 5 PIQR P324. It would be helpful to set out those principles: (a)     In certain circumstances a court may be entitled to draw adverse inferences from the absence or silence of a witness who might be expected to have material evidence to give on an issue in an action. (b)     If a court is willing to draw such inferences, they may go to strengthen the evidence adduced on that issue by the other party or to weaken the evidence, if any, adduced by the party who might reasonably have been expected to call the witness. (c)     There must, however, have been some evidence, however weak, adduced by the former on the matter in question before the court is entitled to draw the desired inference: in other words, there must be a case to answer on that issue. (d)     If the reason for the witness’s absence or silence satisfies the court, then no such adverse inference may be drawn. If, on the other hand, there is some credible explanation given, even if it is not wholly satisfactory, the potentially detrimental effect of his/her absence or silence may be reduced or nullified. 74     Applying the above principles approved inCheong Ghim Fahto the present facts, the following may be said: (a)     The Plaintiff has led evidence from Mr Cheo to show that Defendant did sign D1 and D2 before him on 10 January 2014. (b)     Mr Cheo’s evidence raised aprima faciecase against the Defendant that she did sign D1 and D2 on 10 January 2014 before Mr Cheo. (c)     It was evident that Rajan was a source of not just material but vital evidence on the central issue. (d)     The Defendant clearly had access to Rajan and he was, based on the Defendant’s evidence, aware of this action. (e)     Notwithstanding that, the Defendant did not call Rajan as her witness nor offer an explanation for his absence. Rajan too appeared to be not willing to come forward to give testimony. 75     For these reasons, the Defendant’s failure to call Rajan as her witness made this an appropriate case for drawing an adverse inference against her under s 116(g) on the issue of whether she did sign D1 and D2 on 10 January 2014 before Mr Cheo. I therefore accept the Plaintiff’s invitation to draw an adverse inference. It seems evident that Rajan’s evidence could have been produced and if produced would have been unfavourable to the Defendant. This explains why Rajan did not testify. Given the central role that Rajan played in the Defendant’s defence, the adverse inference drawn goes to the very core of the Defendant’s case. It is an additional string to the Plaintiff’s evidential bow that leads to the conclusion that the Defendant did sign D1 and D2 before Mr Cheo on 10 January 2014. Arising from this, the other aspects of the Defendant’s testimony where she sought to distance herself from the Banking Facilities and the Guarantee, the demands thereunder and the Deed are shrouded in doubt. 76     For these reasons, I do not find the Defendant or her testimony credible.",
        "Conclusion": "77     Given these reasons, I find that the Defendant signed D1 and D2 on 10 January 2014 before Mr Cheo and is therefore a party to the Deed. The Signatures were penned by her. She is thus liable under the Deed for sums due and owing by Tecnomic to the Plaintiff given that Tecnomic was in default by not satisfying the demand for payment made by the Plaintiff. 78     Accordingly, I allow the Plaintiff’s claim. On costs, the Plaintiff sought costs on an indemnity basis relying on cl 11.2 of the Deed. Clause 11.2 provides as follows: The Assignee shall be indemnified by the Assignor and the Borrower from and against all action, losses, claims, proceedings, costs, demands or liabilities which may be suffered by the Assignee by reason of any failure of the Assignor and/or the Borrower to perform its obligations under this Assignment or in the execution or purported execution of any of the rights, powers, remedies, authorities or discretion vested in the Assignee pursuant to this Assignment. I am of the view that the Plaintiff is entitled to costs on an indemnity basis on the foundation of cl 11.2. 79     The Plaintiff is therefore entitled to judgment for the following: (a)     the sum of US$1,154,414.65; (b)     the sum of US$634,983.91; (c)     interest on the sums of US$1,154,414.65 and US$634,983.91 at the Plaintiff’s prevailing Base Lending Rate plus 6% per annum from 13 June 2014 until the date of full payment; and (d)     costs on an indemnity basis, to be taxed."
    }
}