{
    "case_title": "Ship’s Equipment Centre Bremen GmbH\n      v\n      Fuji Trading (Singapore) Pte Ltd and others and another suit",
    "ncitation": "[2015] SGHC 159",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       This case concerns patents for a coupling device used to secure shipping containers and commonly known as a twistlock. In Suit No 315 of 2010 (“S 315/2010”) and Suit No 738 of 2011 (“S 738/2011”), the plaintiff commenced proceedings against two sets of defendants for alleged infringement of the patents. The defendants denied any infringement of the patents and counterclaimed to invalidate them for lack of novelty. Subsequently, the plaintiff applied under s 83(1) of the Patents Act (Cap 221, 2005 Rev Ed) for leave to amend the claims of the patents. The issue before me is whether the plaintiff should be allowed to amend the patents. 2       For the reasons set out in this judgment, I dismiss the plaintiff’s applications to amend the patents.",
        "Facts": "",
        "The plaintiff and its patents": "3       The plaintiff, Ship’s Equipment Centre Bremen GmbH (“the Plaintiff”), is the proprietor of two Singapore patents (collectively referred to as “the Plaintiff’s Patents”)[note: 1]: (a)     Singapore Patent SG110370 (“the 370 Patent”); and (b)     Singapore Patent SG129978 (“the 978 Patent”). 4       The Plaintiff obtained the 370 Patent pursuant to the Singapore patent application number 200500741-4 (“the 370 Patent Application”), which was based on PCT application number PCT/EP2003/004162 filed on 22 April 2003 (“the PCT Application).[note: 2]The Plaintiff also filed the European patent application EP 03727334.9 (“the European Patent Application”) based on the PCT Application. The European Patent Application was subsequently granted as European Patent EP 1534612 B1 (“the European Patent”).[note: 3]",
        "Suit No 315 of 2010": "5       On 5 May 2010, the Plaintiff commenced S 315/2010 against Fuji Trading (Singapore) Pte Ltd for infringing the Plaintiff’s Patents by an offer of sale of a freight container coupling device known as FA-8.[note: 4]On 26 November 2010, the Plaintiff amended its statement of claim and joined Fuji Transport Systems Co Ltd and Taiyo Seiki Iron Works Co Ltd, as the second and third defendants in S 315/2010.[note: 5]It was alleged that the defendants in S 315/2010 had acted with a common design to infringe the Plaintiff’s Patents.[note: 6]The second and third defendants denied the allegation of infringement. Among other things, they challenged the validity of the Plaintiff’s Patents.[note: 7]",
        "Suit No 738 of 2011": "6       On 19 October 2011, the Plaintiff commenced S 738/2011 against Moby Dick Supplies Pte Ltd and ISS Equipment Pte Ltd for infringing the Plaintiff’s Patents.[note: 8]Like the second and third defendants in S 315/2010, the defendants in S 738/2011 also challenged the validity of the Plaintiff’s Patents.[note: 9]",
        "Amendment of the 370 Patent": "7       On 18 December 2012, the Plaintiff gave notice to the Registrar of Patents of its intention to amend the 370 Patent in S 315/2010.[note: 10]On 3 January 2013, the Plaintiff gave notice to the Registrar of Patents of its intention to amend the 370 Patent in S 738/2011.[note: 11]On 28 December 2012 and 30 January 2013, the Registrar of Patents published the advertisement for the Plaintiff’s proposed amendments to the 370 Patent in the Patents Journal.[note: 12] 8       The proposed amendments to the 370 Patent, marked up against the claims of the patent as granted, are as follows:[note: 13] 1.    A coupling piece forjoiningconnectingtwo containers (35, 36) that are stacked oneatopon top ofthe other, particularly on board ships, at theirsaidcorner fittings,comprisinghavinga stop plate (21) and a coupling projection (22, 23) on each side of thesaidstop plate (21), of which the first said coupling projection (22) can be placed on the corner fitting of one said container (36) and theothersecond saidcoupling projection (23) is provided with a locking catch (28,46,54) for locking inside a corner fitting of thesaidother container (35), wherein the locking catch (28,46, 54), when viewed in the longitudinal direction of the said containers (35, 36), is arranged laterally on thesecondsaidothercoupling projection (23),characterized in thatthe locking catch (28, 54) has a sloping shoulder (34) on its top side,so that the coupling piece (20) when only the upper container is lifted during unloading of the same is shifted in a direction opposite to the direction where the locking catch (28, 54) points and gets disengaged from the corner fitting of the other container (35), when the sloping shoulder (34), during lifting of the upper container, abuts the corner fitting. 2.    A coupling piecein accordance withaccording toclaim 1,characterized in thatwhereinthe length (l) of thesecondsaidothercoupling projection (23) is slightly shorter than the length of an elongated hole (33) of the associated corner fitting of thesaidother container (35)and/or the maximum width (b) of said locking catch (28, 54) is slightly less than the width of said elongated hole (33) of the associated corner fitting of the other container (35). 3. A coupling piece in accordance with claim 1 or 2,characterized in thatthe maximum width (b) of the said locking catch (28, 46, 54) is slightly less than the width of the said elongated hole (33) of the associated corner fitting of the said other container (35). 4. A coupling piece in accordance with any one of claims 1 to 3,characterized in thatleading edges (39) of the said other coupling projection (23) have a contour corresponding to the contour of the said elongated hole (33), and particularly an arc-shaped contour portion. 56. A coupling piecein accordance withaccording toany one of claims 1 to45,characterized in thatwhereinthesaidcoupling projection (23) has a lead-in taper (29)underbelowthesaidlocking catch (28,46, 54). 63. A coupling piecein accordance with any one of claims 1 to 5according to claim 1 or claim 2,characterized in thatwhereina lead-in chamfer (30)with an angle corresponding to a chamfer (32) on the elongated hole (33) of the container corner fittingis arranged on the long side (L) facing away fromthesaid locking catch (28,46,54) at the junction betweenthesaid coupling projection (23) andthesaid stop plate (21). 7. A coupling piece in accordance with any one of claims 1 to 5,characterized in thatlead-in chamfer (30) has an angle corresponding to the said chamfer (32) at the said elongated hole (33) of the container corner fitting. 84. A coupling piecein accordance withaccording to claim63,characterized in thatwhereinthe said lead-in chamfer (30) isfirst providedformedwith afirstchamfer (52) corresponding to the chamfer(32)atthesaid elongated hole (33) and, underthesaid elongated hole (33), asecondchamfer (53) having an angle that is flatter compared tothesaidfirstchamfer (52). 9. A coupling piece in accordance with any one of claims 1 to 8,characterized in thatthe said locking catch (46) is provided with a side wall (48) directed sloping inwardly. 10. A coupling piece in accordance with any one of claims 1 to 9,characterized in thatthe said locking catch (54) is designed as movable against the said coupling projection (23). 115. A coupling piecein accordance with claim10according to any one of claims 1 to 4,characterized in thatwhereinthesaidlocking catch (54) is designedsuch that it is cross-to beslidable againstthe coupling projection (23), in particular againstthe force of a spring (55). 127. An arrangement of containers (35, 36) stacked oneatopon top ofthe other,andparticularly onboard ships,which aresaid containers beingjoinedwith one anothertogetherwith coupling pieces (20, 45) at their corner fittings,characterized in thatwhereinthesaid containers (35, 36) are joinedwith one anothertogetherat least at the corner fittings of a front side of said containers (35, 36)eachwith a coupling piece (20, 45)in accordance withaccording toany one of claims 1 to86, in particular according to any one of claims 1 to 5. 13. An arrangement in accordance with claim 13,characterized in thatthe said containers (35, 36) are joined with one another at all their corner fittings with a coupling piece (20) in accordance with any one of claims 1 to 7. 148. An arrangementin accordance with claim 15,characterized in thataccording to claim 7 whereinthesaid locking catches (28) of saidAcoupling pieces (20), which are assigned to the (front) corner fittings (43) on one of the front walls ofthesaid containers (35, 36), when viewed in the longitudinal direction ofthesaid containers (35, 36), point in a lateral direction, and said locking catches (28) of saidAcoupling pieces (20), which are assigned to the said (rear) corner fittings (44) on the other of the front walls ofthesaid containers (35, 36), point in the opposite direction. 159. A method for joining said containers (35, 36) stacked oneatopon top ofthe other, particularly onboard ships, with coupling pieces (20, 45)in accordance withaccording toany one of claims 1 to86,characterized in thatwhereinthe said upper container (36) is rotated about its vertical axisor offset laterallyduring the coupling and/or uncoupling with the lower container, by means of the shape of the coupling pieces (20, 45). 16. A method in accordance with claim 15, wherein the said upper container (36) is rotated about its vertical axis during the coupling and/or uncoupling by means of the shape of the coupling pieces (20, 45). 17. A method for joining said containers (35, 36) stacked one atop the other, particularly onboard ships, with said coupling pieces (20, 45) in accordance with any one of claims 1 to 8,characterized in thatthe said upper container (36) is offset laterally during the coupling and/or uncoupling with the lower container. 18. A method in accordance with claim 17, wherein the said upper container (36) is offset laterally during the coupling and/or uncoupling due to the shape of said coupling pieces (28, 45).” [emphasis in original] For convenience, I shall refer to the proposed amendments individually as “Proposed Amended Claim” followed by the corresponding paragraph number, and collectively as “the Proposed Amendments”. 9       It was stated in the statement of reasons attached to the two notices to the Registrar of Patents that the Proposed Amendments were “to amend the claims in the Patent to correspond to the allowed claims of the corresponding [European Patent]”.[note: 14]By way of background, the European Patent was amended in the course of opposition proceedings before the Opposition Division of the European Patent Office (“EPO”).[note: 15]The amendments were allowed on 10 November 2010.[note: 16]The Proposed Amendments in the present case are identical to the amendments that were allowed by the Opposition Division of the EPO.[note: 17] 10     On 25 January 2013, the Plaintiff was served with a statement of opposition by the second and third defendants in S 315/2010 and the first and second defendants in S 738/2011 (collectively known as “the Defendants”).[note: 18] 11     On 10 May 2013, the Plaintiff filed summons no 2458 of 2013 (“SUM 2458/2013”) in S 315/2010 and summons no 2455 of 2013 (“SUM 2455/2013”) in S 738/2011 to apply for leave under O 87A r 11 of the Rules of Court (Cap 332, R 5, 2006 Rev Ed) and s 83 of the Patents Act to amend the 370 Patent.",
        "The parties’ cases": "12     The Defendants take the view that the Proposed Amendments do not comply with the requirements of the Patents Act because they lack clarity and conciseness, are not supported by the description, and disclose additional matter and/or extend the protection of the patent.[note: 19]The Defendants also submit that the Proposed Amended Claim 1 should not be allowed because “the EPO has determined [the Plaintiff’s] equivalent claim to be invalid, and no amendment should be allowed if it leads to an invalid patent”.[note: 20]Alternatively, the Defendants contend that even if the Proposed Amendments comply with the requirements under the Patents Act, the Court should nevertheless exercise its discretion to reject the Proposed Amendments on the following grounds: (a)     The Plaintiff had made incomplete disclosure in relation to the Proposed Amendments. (b)     There had been undue delay on the part of the Plaintiff in applying for the Proposed Amendments. (c)     The Plaintiff had sought and obtained an unfair advantage during the period of undue delay.[note: 21] 13     The Plaintiff disagrees. Among other things, the Plaintiff claims that the Defendant’s objection to the Proposed Amendments “turns on the interpretation and construction of English terms used in the [Proposed Amendments]”.[note: 22]",
        "Issues before this Court": "14     The issues are as follows: (a)     Whether the amendments to Proposed Amended Claim 1 should be allowed if the 370 Patent would nevertheless be invalid. (b)     Whether the Proposed Amendments meet the requirements under the Patent Act. (c)     Whether the Court should exercise its discretion to reject the Proposed Amendments even though the requirements under the Patents Act were met. 15     I will address these issues in turn.",
        "First issue: Whether the amendments to Proposed Amended Claim 1 should be allowed if the 370 Patent would nevertheless be invalid": "16     The Defendants contend that the amendments to Proposed Amended Claim 1 should not be allowed because the 370 Patent would still be invalid even if the amendments were allowed.[note: 23]The Defendants’ contention is based on the decision of the Appeal Board of the EPO dated 26 November 2014 that the equivalent of the Proposed Amended Claim 1 under the European Patent is not patentable due to lack of inventive step.[note: 24]The Defendants submit that the outcome and reasoning of a post-grant proceedings before the EPO in respect of an European patent that corresponds to a Singapore patent is persuasive, and this is especially so where subject matter in both cases are identical.[note: 25]In this regard, the Defendants point out that the European Patent and the 370 Patent were derived from the same PCT Application ([4] above), and the Proposed Amendments were identical to the amendments that were allowed by the EPO ([9] above).[note: 26]Accordingly, the Defendants argue that the amendments to the Proposed Amended Claim 1 should not be allowed. 17     I do not agree with the Defendants’ contention. The EPO decisions only are of persuasive value before the Singapore courts, and we are not bound by them, even if they pertain to the same issue. The court inMain-Line Corporate Holdings Ltd v DBS Bank Ltd[2012] 4 SLR 147 (“Main-Line”) at [52] held that: ... not being party to the European Patent Convention (“EPC”), our courts, unlike the English courts, are not bound to give consideration to EPO decisions.At best, the reasons of the EPO for coming to a particular conclusion may only be said to be of persuasive value to our courts. [emphasis added] 18     On a more general note, the Court of Appeal inFirst Currency Choice Pte Ltd v Main-Line Corporate Holdings Ltd and another appeal[2008] 1 SLR(R) 335 (“First Currency”) at [2] observed that different jurisdictions may well have different views on the same issue: The present legal skirmish between the principal parties is but part of a wider legal feud now taking place in a number of different jurisdictions. This is not unusual in today's “flat” world, where businesses have similar interests and rights to protect in several different jurisdictions. A “flat” world is, however, far from being an “ideal” world, where the outcome would be similar regardless of where the legal jousting takes place. In a “flat” world, the outcomes of the parties' legal differences may not, eventually, be the same in each jurisdiction because of varying statutory matrices and prevailing administrative practices.Ultimately, it must also be acknowledged that an adjudication on patent rights is predicated upon not only the applicable regulatory framework and practices, but also the evidence presented as well as the submissions made to the tribunal concerned. Care must therefore be taken by counsel when referring to and/or relying on another apparently similar decision on the “same” issue from another jurisdiction. ... [emphasis added] 19     With respect, no matter how persuasive one might consider an EPO decision to be, the validity of a Singapore patent is ultimately a question for the Singapore courts to decide. The Defendants’ contention would inevitably require that this Court decide on the validity of the 370 Patent before it can determine whether the Proposed Amended Claim 1 should be allowed. This puts the proverbial cart before the horse. Such an approach should not be accepted in the present case where the issue of validity is scheduled to be heard after SUM 2455/2013 and SUM 2458/2013 have been decided. As such, it is necessary to proceed with the examination of the validity of the Proposed Amendments.",
        "Second issue: Whether the Proposed Amendments meet the requirements under the Patent Act": "20     As an alternative argument, the Defendants submit that the Proposed Amendments should not be allowed because they do not comply with the requirements under the Patents Act, in particular: (a)     The Proposed Amendments lack clarity, conciseness and the support of the description (see ss 25(5)(b) and (c) of the Patents Act). (b)     The Proposed Amendments disclose additional matter (see s 84(3)(a) of the Patents Act). (c)     The Proposed Amendments extend the protection of the patent (see s 84(3)(b) of the Patents Act). 21     I will set out the relevant legal principles before I proceed to consider whether the Proposed Amendments comply with the requirements under the Patents Act.",
        "Law on patent amendments": "22     Under s 84(3)(a) of the Patents Act, the amendment of the specification of a patent would be allowed only if it does not result in the specification “disclosing any additional matter”. The test to be applied in determining whether the amendments to a patent’s specification would disclose additional matter (under s 84(3)(a) of the Patents Act) has been laid down inBonzel (T) v Intervention Limited (No 3)[1991] RPC 553 (“Bonzel”) as follows: (a)     To ascertain through the eyes of the skilled addressee what is disclosed, both explicitly and implicitly, in the patent application as filed. (b)     To do the same in respect of the patent as proposed to be amended. (c)     To compare the two disclosures and decide whether any subject matter relevant to the invention has been added whether by deletion or addition. The comparison is strict in the sense that subject matter will be added unless such matter is clearly and unambiguously disclosed in the application either explicitly or implicitly. 23     TheBonzeltest has been endorsed by the Court of Appeal inFE Global Electronics Pte Ltd and others v Trek Technology (Singapore) Pte Ltd and another appeal[2006] 1 SLR(R) 874 (“FE Global (CA)”) at [24], and applied by subsequent High Court cases, includingMartek Biosciences Corp v Cargill International Trading Pte Ltd[2011] 4 SLR 429 at [81],Main-Lineat [73] andNovartis AG and another v Ranbaxy (Malaysia) Sdn Bhd[2013] 2 SLR 117 (“Novartis”) at [8]. As the court inNovartispointed out at [8], the test inBonzelhas been further elaborated upon inEuropean Central Bank v Document Security Systems Incorporated[2007] EWHC 600 (Pat) at [97]–[102]: 97    A number of points emerge from [theBonzel] formulation which have a particular bearing on the present case and merit a little elaboration. First, it requires the court to construe both theoriginal application and specification to determine what they disclose. For this purpose the claims form part of the disclosure ... though clearly not everything which falls within the scope of the claims is necessarily disclosed. 98    Second, it is the court which must carry out the exercise and it must do sothrough the eyes of the skilled addressee.Such a person will approach the documents with the benefit of the common general knowledge. 99    Third, thetwo disclosures must be compared to see whether any subject matter relevant to the invention has been added.This comparison is a strict one. Subject matter will be added unless it is clearly and unambiguously disclosed in the application as filed. 100    Fourth, it is appropriate to consider what has been disclosed both expressly and implicitly. Thus the addition of a reference to that which the skilled person would take for granted does not matter:DSM NV’s Patent[2001] R.P.C. 25 at [195]-[202]. On the other hand, it is to be emphasised that this is not an obviousness test. A patentee is not permitted to add matter by amendment which would have been obvious to the skilled person from the application. 101    Fifth, the issue is whether subject matter relevant to the invention has been added. In caseG1/93, Advanced Semiconductor Products, the Enlarged Board of Appeal of the EPO stated (at paragraph [9] of its reasons) that the idea underlying Art. 123(2) is that that an applicantshould not be allowed to improve his position by adding subject matter not disclosed in the application as filed, which would give him an unwarranted advantage and could be damaging to the legal security of third parties relying on the content of the original application.At paragraph [16] it explained that whether an added feature which limits the scope of protection is contrary to Art 123(2) must be determined from all the circumstances.If it provides a technical contribution to the subject matter of the claimed invention then it would give an unwarranted advantage to the patentee. If, on the other hand, the feature merely excludes protection for part of the subject matter of the claimed invention as covered by the application as filed, the adding of such a feature cannot reasonably be considered to give any unwarranted advantage to the applicant.Nor does it adversely affect the interests of third parties. 102    Sixth,it is important to avoid hindsight. Care must be taken to consider the disclosure of the application through the eyes of a skilled person who has not seen the amended specification and consequently does not know what he is looking for. This is particularly important where the subject matter is said to be implicitly disclosed in the original specification. [emphasis added] 24     Section 84(3)(b) of the Patents Act mandates that the amendment of the specification of a patent shall not be allowed if it “extends the protection conferred by the patent”. In order to determine if the scope of protection of the patent has been extended, one must examine and compare the totality of the claims before and after the proposed amendments. The extension of the scope of an individual claimper seis not objectionable if it does not result in the extension of the protection of the patent: Richard Milleret al,Terrell on the Law of Patents(Sweet & Maxwell, 17th Ed, 2011) (“Terrell”) at para 15-41, citingSiegfried Demel v Jefferson[1999] FSR 204 at 213. 25     Apart from s 84(3) of the Patents Act, the proposed amendments must also satisfy the requirements under ss 25(5)(b) and (c) of the Patents Act,ie, the claim or claims must be “clear and concise” and “supported by the description”. These are the “base-line criteria” for which any amendments must satisfy:Trek Technology (Singapore) Pte Ltd v FE Global Electronics Pte Ltd and others and other suits[2005] 3 SLR(R) 389 (“FE Global (HC)”) at [52]. I agree with the observations of Kitchin LJ inSudarshan Chemical Industries Ltd v Clariant Produkte (Deutschland) GmbH[2014] RPC 6 (“Sudarshan”) at [77]: The requirement that the claims must be clear and concise is a fundamental one and necessary to provide legal certainty. The purpose of the claims is to define the monopoly and so they must be drawn in terms which aresufficiently clear for the skilled addressee to determine their scope. That does not mean that it is never permissible to use relative terms in a claim. Such terms may be used provided that their meaning is clear to the skilled addressee who reads them with the benefit of the common general knowledge in the field of the invention. [emphasis added] Further, the learned authors inTerrellobserved at para 15-43 that “[w]here an amendment is of a vague nature and would create uncertainty as to what the new claim really means, it will be refused”. In the same vein, any proposed amendment that introduces uncertainty would fall foul of s 25(5)(b) of the Patents Act and must accordingly be rejected.",
        "General principles of patent construction": "26     The Court of Appeal inFirst Currencybegan its discussions on the general principles of patent construction by observing at [22] that: As emphasised in Simon Thorleyet al,Terrell on The Law of Patents(Sweet & Maxwell, 16th Ed, 2006) … at para 6-01, one of the most significant issues in patent litigation is the determination of the true construction of a patent specification, and, in particular, its claims. This is because the monopoly and scope of protection granted by a patent is defined by its claims (seeElectric & Musical Industries Ld v Lissen Ld(1938) 56 RPC 23 … at 39, which was followed inBean Innovations Pte Ltd v Flexon (Pte) Ltd[2001] 2 SLR(R) 116 …) WhileFirst Currencywas concerned with patent construction in relation to the question of infringement, there can be no doubt that the same exercise is relevant when a court has to decide whether a set of proposed amendments comply with the requirements under the Patents Act. Accordingly, I find it apposite to consider some of the principles of patent construction. 27     I start with s 113(1) of the Patents Act, which reads: For the purposes of this Act, an invention for a patent for which an application has been made or for which a patent has been granted shall, unless the context otherwise requires, be taken to be that specified in a claim of the specification of the application or patent, as the case may be, as interpreted by the description and any drawings contained in that specification, and the extent of the protection conferred by a patent or application for a patent shall be determined accordingly. 28     It is well accepted in Singapore that a purposive construction should be adopted when construing a patent specification. In the seminal House of Lords decision ofCatnic Components Limited and another v Hill and Smith Limited[1982] RPC 183, Lord Diplock said at 242–243: My Lords, a patent specification is a unilateral statement by the patentee, in words of his own choosing, addressed to those likely to have a practical interest in the subject matter of his invention (ie “skilled in the art”), by which he informs them what he claims to be the essential features of the new product or process for which the letters patent grant him a monopoly. It is those novel features only that he claims to be essential that constitute the so-called “pith and marrow” of the claim. A patent specification should be given a purposive construction rather than a purely literal one derived from applying to it the kind of meticulous verbal analysis in which lawyers are too often tempted by their training to indulge. This has been endorsed by the Court of Appeal inFE Global (CA)at [14], where it commented that the purposive approach was preferred because it “balance[d] the rights of the patentee and those of third parties”. The Court of Appeal reaffirmed this inFirst Currencyat [26], where it added that: A purposive construction of the claims would give the patentee the full extent, but no more than the full extent, of the monopoly which a reasonable person skilled in the art, reading the claims in context, would think that he (the patentee) was intending to claim. 29     According to M P H Rubin J inV-Pile Technology (Luxembourg) SA and others v Peck Brothers Construction Pte Ltd[1997] 3 SLR(R) 981 at [63], the purposive approach towards patent construction would allow one to refer to the description and the drawings when interpreting the claims. Indeed, s 113(1) of the Patents Act specifically states so. Judith Prakash J inNg Kok Cheng v Chua Say Tiong[2001] 2 SLR(R) 326 at [87] explained that it is legitimate in approaching the construction of the claims to read the specification as a whole because it “provides the necessary background and in some cases the meaning of the words used in the claims may be affected by or defined by what is said in the body of the specification”. 30     While the other parts of a patent specification may be helpful in the construction of the claims, it would not be permissible to rely on them to narrow or expand the claims (which define the boundaries of the monopoly). InBean Innovations Pte Ltd and another v Flexon (Pte) Ltd[2001] 2 SLR(R) 116 (“Bean Innovations”), the Court of Appeal at [16] explained that: ... the claims as stated in the specification of the patent are the principal determinant of the scope of the monopoly for which protection is provided. InElectric & Musical Industries Ltd v Lissen Ltd[1938] 4 All ER 221 at 224-227; 56 RPC 23 at 39, Lord Russell of Killowen said: The function of the claims is to define clearly and with precision the monopoly claimed, so that others may know the exact boundaries of the area within which they will be trespassers. Their primary object is to limit, and not to extend, the monopoly. What is not claimed is disclaimed... It is not permissible, in my opinion, by reference to some language used in the earlier part of the specification, to change a claim which by its own language is a claim for one subject-matter into a claim for another and a different subject-matter, which is what you do when you alter the boundaries of the forbidden territory. A patentee who describes an invention in the body of a specification obtains no monopoly unless it is claimed in the claims. As Lord Cairns, L.C., said, there is no such thing as infringement of the equity of a patent ...I know of no canon or principle which will justify one in departing from the unambiguous and grammatical meaning of a claim and narrowing or extending its scope by reading into it words which are not in it, or which will justify one in using stray phrases in the body of the specification for the purpose of narrowing or widening the boundaries of the monopoly fixed by the plain words of a claim. [emphasis added] and said ([1938] 4 All ER 221 at 227; 56 RPC 23 at 41): A claim is a portion of the specification which fulfils a separate and distinct function. It, and it alone, defines the monopoly, and the patentee is under a statutory obligation to state in the claims clearly and distinctly what is the invention which he desires to protect. [emphasis in original] 31     The Court of Appeal also acknowledged at [18] that the “words and terms [in a claim] must be given their reasonable and sensible meaning” and that a purposive construction must be adopted. However, the Court of Appeal cautioned at [27] that the purposive construction would not entitle the courts to disregard the clear and unambiguous words used to describe the essential features of a claim and that “one cannot write words into a claim that are not there or give a meaning to a term of a claim that is contrary to its language”. 32     The Court of Appeal inFirst Currencyalso observed at [23]–[24] that: 23    ... In ascertaining the true construction of a patent specification, the claims themselves are the principal determinant, while the description and other parts of the specification may assist in the construction of the claims (seeBean Innovations... at [20]). However, while the claims and the description are to be read together and construed contextually, they are intended to serve different functions. As explained by Laddie J with his customary acuity inMerck & Co Inc v Generics (UK) Ltd[2004] RPC 31 at [38]: The purpose of a patent is to convey to the public what the patentee considers to be his invention and what monopoly he has chosen to obtain. These are not necessarily the same. The former is primarily to be found in the specification [ie, the description] and the latter is primarily to be found in the claims. 24    As the necessary background of the words used in the claims may be affected or defined by what is said in the body of the patent specification, the claims should not be viewed independently, but should instead be construed as part of the whole specification (Rosedale Associated Manufacturers Ld v Carlton Tyre Saving Coy Ld[1960] RPC 59 at 69). However, it is not permissible to put a gloss on or expand the claims by relying on a statement in the specification. If the claims have a plain meaning, then reliance ought not to be placed on the language used in the body of the specification so as to make them mean something different (see[Electric & Musical Industries Ltd v Lissen Ltd[1938] 4 All ER 221]... at 57). Claims must be read and given their ordinary and natural meaning without incorporating extracts from the body of the specification into them. 33     It is also important to bear in mind, when construing claims, not to assume that the scope of the claims is necessarily co-extensive with the teaching of the description:Terrellat para 9-45. InKirin-Amgen Inc v Hoechst Marion Roussel Ltd[2005] RPC 9, Lord Hoffman stated at [33] that: … There is no presumption about the width of the claims. A patent may, for one reason or another, claim less than it teaches or enables. 34     In addition, it should be noted that the reference numerals or signs which appear in a claim are irrelevant to the construction of the claim. It is stated inTerrellat para 9-119 that: Reference numerals appearing in a claim, while helpful, are irrelevant to construction. Rule 29(7) of the Implementing Regulations to the [European Patent Convention] provides that if the application contains drawings: “... the technical features mentioned in the claim shall preferably, if the intelligibility of the claim can thereby be increased, be followed by reference signs relating to these features and placed between parentheses. These reference signs shall not be construed as limiting the claim.” InVirgin v Premium Aircraft Interiors[[2010] RPC 8 at [17]], the Court of Appeal held that: “... we do not think that numerals should influence the construction of the claim at all—they do not illustrate whether the inventor intended a wide or narrow meaning. The patentee is told by the rule that if he puts numerals into his claim they will not be used to limit it. If the court subsequently pays attention to the numbers to limit the claim that is simply not fair. And patentees would wisely refrain from inserting numbers in case they were used against them. That is not to say that numbers are pointless. They help a real reader orient himself at the stage when he is trying to get the general notion of what the patent is about. He can see where in the specific embodiment a particular claim element is, but no more. Once one comes to construe the claim, it must be construed as if the numbers were not part of it. To give an analogy, the numbers help you get the map the right way up, they do not help you to read it to find out exactly where you are.” The reasoning of Jacob LJ inVirgin Atlantic Airways Ltd v Premium Aircraft Interiors UK Ltd[2010] RPC 8 applies in Singapore as well. In particular, I note that the examination guidelines for Patent Applications at the Intellectual Property Office of Singapore (14 February 2014) at para 2.64 states that: Claims may refer to reference signs used in drawings, if a specification contains drawings.Reference signs do not limit the scope of the claims to the particular drawing, but merely assist the reader to understand the definition (Virgin Atlantic Airways Ltd v Premium Aircraft Interiors UK Ltd[2010] RPC 8). ... [emphasis added] 35     With these general principles of patent construction in mind, I turn now to consider if the Proposed Amendments meet the requirements under the Patents Act.",
        "Application to the Proposed Amendments": "36     At the start of the hearing, counsel for the Defendants state that his objections were confined to the Proposed Amended Claims 1, 4, 5, 7 and 9.[note: 27]This is a different position from that taken in the written submissions, in which every single one of the nine Proposed Amended Claims was contested. For completeness, I shall address all of the Defendants’ arguments notwithstanding the oral concession at the hearing. 37     At this juncture, I should also clarify that the decision of the EPO to allow the amendments (which were, as I understand, the same as the Proposed Amendments[note: 28]) should not in any way affect the outcome of these proceedings. I have explained my reasons above at [17]–[18]. In any event, I should add that there was no evidence adduced to show the reasoning of the EPO in relation to the amendments with regard to the European Patent.[note: 29] 38     I will now consider Proposed Amended Claim 1. Proposed Amended Claim 1 39     The Proposed Amended Claim 1 reads as follows: 1.    A coupling piece forjoiningconnectingtwo containers (35, 36) that are stacked oneatopon top ofthe other, particularly on board ships, at theirsaidcorner fittings,comprisinghavinga stop plate (21) and a coupling projection (22, 23) on each side of thesaidstop plate (21), of which the first said coupling projection (22) can be placed on the corner fitting of one said container (36) and theothersecond saidcoupling projection (23) is provided with a locking catch (28,46,54) for locking inside a corner fitting of thesaidother container (35), wherein the locking catch (28,46,54), when viewed in the longitudinal direction of the said containers (35, 36), is arranged laterally on thesecondsaidothercoupling projection (23),characterized in thatthe locking catch (28, 54) has a sloping shoulder (34) on its top side,so that the coupling piece (20) when only the upper container is lifted during unloading of the same is shifted in a direction opposite to the direction where the locking catch (28, 54) points and gets disengaged from the corner fitting of the other container (35), when the sloping shoulder (34), during lifting of the upper container, abuts the corner fitting. [emphasis in original] 40     The Defendants object to Proposed Amended Claim 1 on the basis that it discloses additional matter, extends the protection of the patent and is not clear, concise or supported by the description.[note: 30] 41     The subject matter of the objection is the locking catch (which is circled in the left diagram below),[note: 31]and the sloping shoulder (which is marked out with an “X” in the right diagram below):[note: 32] 42     It is also important to understand what the corner fitting of a container looks like and a diagram is reproduced below:[note: 33]43     Figure 13 in the 370 Patent (reproduced below) shows the coupling device in a corner fitting (which has been shaded), when viewed from the longitudinal direction of the containers:[note: 34](1)   Discloses additional matter44     The Defendants submit that the Proposed Amended Claim 1 results in the following instances of added subject matter:(a)     An “unwarranted generalisation” based on a specific disclosure in the 370 Patent Application.(b)     An inclusion of at least three additional embodiments not previously disclosed in the 370 Patent Application.(A)   Unwarranted generalisation45     According to the Defendants, the wording “... the upper container is lifted during unloading of the same is shifted in a direction opposite to the direction where the locking catch points”, as used in the Proposed Amended Claim 1, is an “unwarranted generalisation” that discloses additional matter.[note: 35]The Plaintiff, on the other hand, claims that the 370 Patent Application already disclosed that the coupling device shifts in a direction opposite to the direction where the locking catch points.[note: 36]46     To support its contention, the Defendants referred toNovartisat [36], where the High Court considered the concept of intermediate generalisation and accepted that the narrowing of claims may, in certain cases, add matter.[note: 37]However, I do not think that intermediate generalisation captures what the Defendants are trying to say in the present case. In Cornish, Llewelyn and Aplin,Intellectual Property Patents, Copyright, Trade Marks and Allied Rights(Sweet & Maxwell, 7th Ed, 2010) (“Cornish”) at paras 4-32 and 4-33, the learned authors explain the concept of intermediate generalisation as follows:In many cases the aim of an amendment is to cut down the scope of what is claimed, because a piece of prior art is discovered which makes the original claim cover unjustifiably broad territory ... In a classic example, the broadest claim originally related to a tool for crimping together electrical wires and connectors, which had a ratchet and pawl device to prevent premature release of the tool before crimping was complete. In order to side-step prior art, the patentee was allowed to add to this a device that was mentioned in the description incidentally as an additional feature—a stop designed to prevent crimping from going too far. Within this general principle, it is permissible to change a product claim to a claim to its use.… In the crimping tool case, if the stop device had not originally been mentioned, to add it by amendment would in most circumstances be barred as “extending” the matter disclosed. The same would probably apply if originally a particular kind of stop was mentioned and the amendment sought to refer to all kinds of stop.Again, suppose that stops were mentioned in general and the amendment sought to refer to one particular kind of stop. It may be objected that this is to give prominence to something not previously pointed up in the description. If so the proposed amendment will be classed as an “intermediate generalisation”and disallowed as a departure from the governing principle that the patentee must disclose the essential features of his invention from the application onwards.The test overall is whether the skilled man would learn from the amended specification anything about the invention which he could not learn from the unamended specification.[emphasis added]47     To illustrate using the crimping tool inCornish, there are at least three possible ways in which proposed amendments could disclose additional matter, namely:(a)     If no stop device was disclosed in the patent application, but the proposed amendments disclose a stop device.(b)     If a particular kind of stop device was disclosed in the patent application, but the proposed amendments disclose all kinds of stop devices.(c)     If stop devices in general was disclosed in the patent application, but the proposed amendments disclose a particular kind of stop device.It appears from the passage inCornishthat only the third example would constitute intermediate generalisation.48     However, not all intermediate generalisations are inherently objectionable. To explain this point, I rely on the illustration found in the United Kingdom Intellectual Property Office decision ofClear Focus Imaging Inc v Contra Vision Ltd(10 April 2003, unreported) at [24]–[26]. I find the illustration in the case exceptionally helpful and I gratefully adopt it. If a patentee discloses apples, oranges and bananas and claims “fruit”, but he discovers after the grant that apples are old, he can amend to have two claims, one for oranges and one for bananas (assuming that they have been described in the specification). To amend the claim to “fruit having an inedible rind”, which teaches something that had not been taught before, would constitute intermediate generalisation which discloses additional matter. The generalisation is “intermediate” insofar as it is broader than the specific embodiments,ie, oranges or bananas, but not as broad as the original claim,ie, fruits. This also explains why the first and second examples in the crimping tool illustration would not fall within the concept of intermediate generalisation.49     This is not a case of intermediate generalisation. As I understand it, the Defendants’ contention is that the Proposed Amended Claim 1 discloses additional matter because the Proposed Amended Claim 1 discloses the general concept that the coupling device always moves in a direction opposite to the direction where the locking catch points,[note: 38]even though the 370 Patent Application only discloses that the coupling device moves to theleftwhen the locking catch, which points to theright, abuts the bottom of the corner fitting.[note: 39]The Defendants’ real complaint, it seems to me, is that the Proposed Amended Claim 1 is not supported by the description in the 370 Patent Application (and this will be addressed separately later). If there is nothing in the patent application to support a proposed amendment to the claim, then the proposed amendment would also be considered as having disclosed additional matter:B & R Relays Ltd’s Application[1985] RPC 1 at 7;Raychem Ltd’s Application[1986] RPC 547 at 555.50     As mentioned earlier ([45] above), the Plaintiff takes the position that the 370 Patent Application discloses that the coupling device moves in a direction opposite to the direction where the locking catch points.[note: 40]In particular, the Plaintiff refers to the 370 Patent Application which states:[note: 41]... This coupling projection has a projecting locking catch. As can be seen in Figures 1 and 2,the locking catch is assigned to one of the two long sides, especially the right-hand long side according to the view in Figure 2. ......... When the upper container and thus the fully automatic device are raised, the shoulder abuts against the bottom of the container corner fitting, so that the fully automatic device is pressed to theleftin the view according to Figure 2 and is thus disengaged from the elongated hole.[emphasis added]I should add that the locking catch in Figure 2 ([41] above) points to the right.[note: 42]51     I find that the 370 Patent Application shows that the coupling device “shift[s] in a direction opposite to the direction where the locking catch points”.[note: 43]The wording must be read in the context of the Proposed Amended Claim 1 which states that the locking catch is “arranged laterally” when the coupling device is viewed from the longitudinal direction of the containers.[note: 44]In other words, with reference to Figure 2, the locking catch would either point to the right or the left. The Plaintiff argues that the two passages in the description ([50] above), when read together, would disclose that the coupling device moves in a direction opposite to the direction of the locking catch when the sloping shoulder abuts the corner fitting.[note: 45]I agree with this. The first passage makes it quite clear that the locking catch can be either on the right or the left side of the coupling device, and Figure 2 merely shows one of the possible embodiments of the coupling device with the locking catch pointing to the right.[note: 46]It would also be clear to a person skilled in the art that the coupling device, by virtue of the upward lifting force during the unloading process and abutment of the sloping shoulder to the corner fitting, would move in the direction opposite to the direction where the locking catch points. In this respect, it should be noted that the Defendants’ expert witness, Erik Elof Mellberg (“Mellberg”) had, in his first affidavit of evidence-in-chief (“AEIC”), accepted that:[note: 47]Upon abutment and continued lifting of the upper container, the sloping shoulder slides relative to the corner fitting such that the coupling piece is shifted to the left (or generally, in a direction opposite to the direction in which the locking catch points). ... [emphasis added]Accordingly, I find that the Proposed Amended Claim 1 does not disclose additional matter.(B)   Additional embodiments52     The Defendants argue that the Proposed Amended Claim 1 discloses three additional embodiments, namely:(a)     First, an embodiment where the locking catch points to theleftinstead of the right (“the First Additional Embodiment”).[note: 48](b)     Second, an embodiment where the locking catch may contact any point of the corner fitting, instead of the bottom of the corner fitting, in order to give rise to the necessary motion to disengage (“the Second Additional Embodiment”).[note: 49](c)     Third, an embodiment where the sliding locking catch retracts into the coupling device, against the force of the spring, when it abuts the corner fitting (“the Third Additional Embodiment”).[note: 50]53     For the purposes of the hearing, Mellberg had helpfully prepared a diagram to illustrate the First Additional Embodiment, which I reproduce here:[note: 51]54     For the same reasons set out at [51], the First Additional Embodiment which has been disclosed in the 370 Patent Application, would not be considered as added matter. I should add that Mellberg had confirmed that the First Additional Embodiment is “a twistlock that will not function in reality”.[note: 52]55     I move on to the Second Additional Embodiment. According to Mellberg, the Proposed Amended Claim 1 does not describe where the locking catch abuts the corner fitting and would cover a coupling device where the locking catch abuts atanypoint in the corner fitting.[note: 53]He claims that the Proposed Amended Claim 1 would disclose additional matter when compared to the 370 Patent Application, which merely describes that the locking catch “abuts against thebottomof the container corner fitting”.[note: 54]This cannot be correct. The words “abuts the corner fitting” in the Proposed Amended Claim 1 would not disclose the Second Additional Embodiment. Mellberg’s view results from a literal consideration of the words “abuts the corner fitting” without regard to the rest of the specification. It is quite clear that one must be allowed to refer to the description and the drawings when construing the claims ([29] above). InStrix Ltd v Otter Controls Ltd[1995] RPC 607 at 650–651, Ferris J accepted that an amendment would not disclose additional matter where a feature is evident from the reading of the specification in conjunction with the drawings included in the patent. It is also not wrong to rely on reference numerals or signs to “see where in the specific embodiment a particular claim element is”, even though they may not be relevant to the construction of a patent ([34] above). As such, I prefer the evidence of the Plaintiff’s expert witness, Johan Marinus Huisman (“Huisman”), that the Proposed Amended Claim 1, when read in conjunction with Figure 2 ([41] above), would not disclose additional matter in the form of the Second Additional Embodiment.[note: 55]56     Next, I shall consider the Third Additional Embodiment which, according to the Defendants, is disclosed by the wording “gets disengaged from the corner fitting of the container, when the sloping shoulder ... abuts the corner fitting” in Proposed Amended Claim 1.[note: 56]The Third Additional Embodiment has been illustrated by Mellberg in the diagram below:[note: 57]57     Mellberg takes the view that the Third Additional Embodiment is disclosed by the Proposed Amended Claim 1 but not the 370 Patent Application.[note: 58]In his opinion, the additional matter is that the coupling device will be disengaged when the locking catch abuts the corner fitting without the need for movement to the left.[note: 59]Huisman disagrees and claims that the Third Additional Embodiment is not disclosed by,inter alia, the Proposed Amended Claim 1.[note: 60]I do not think that the Proposed Amended Claim 1 would, as suggested by Mellberg, disclose the Third Additional Embodiment. The Proposed Amended Claim 1 states:... so that the coupling piece when only the upper container is lifted during unloading of the sameis shifted in a direction opposite to the direction where the locking catch pointsand gets disengaged from the corner fitting of the other container, when the sloping shoulder, during lifting of the upper container, abuts the corner fitting. [emphasis added]A purposive reading of the Proposed Amended Claim 1 would show that it could not possibly disclose an embodiment which wouldnotshift to the left when the upper container is lifted and the locking catch (which points to the right) abuts the corner fitting. It explicitly states that the coupling device would shift in the direction opposite to the direction in which the locking catch points. Accordingly, I find that the Proposed Amended Claim 1 would not disclose the Third Additional Embodiment.58     To summarise, I find that:(a)     The First Additional Embodiment is not added matter given that it has been disclosed in the 370 Patent Application.(b)     The Proposed Amended Claim 1 would not disclose the Second Additional Embodiment and Third Additional Embodiment.(2)   Extends protection59     I move on to consider the Defendants’ next argument, that is, the Proposed Amended Claim 1 extends the protection of the 370 Patent.60     The Defendants claim that the Proposed Amended Claim 1 extends the protection of the 370 Patent because it now confers protection to a number of embodiments which have not been protected by the 370 Patent.[note: 61]The Plaintiff denies this.[note: 62]In particular, the Plaintiff submits that the 370 Patent discloses that the locking catch can be assigned to either side of the coupling device.[note: 63]61     The starting point is to ask: what is the scope of protection under the 370 Patent? The Defendants argue that the term “sloping shoulder” in claim 1 of the 370 Patent is ambiguous and a person skilled in the art would refer to the rest of the specification to resolve the ambiguity.[note: 64]In particular, the Defendants highlight the following passage:[note: 65]To make unlocking easier, the locking catch is provided with a sloping shoulder. When the upper container and thus the fully automatic device are raised,the shoulder abuts againstthe bottom of the container corner fitting, so that the fully automatic device is pressed to theleft... and is thus disengaged from the elongated hole. [emphasis in original]The Defendants argue that the person skilled in the art, having read the specification, would understand the sloping shoulder to have a “functional element which is determined by a very specific interaction with the ... corner fitting ... such that the coupling [device] is shifted to theleft”.[note: 66]However, I note that the description of the 370 Patent also states that:[note: 67]... This coupling projection has a projecting locking catch. As can be seen in Figures 1 and 2,the locking catch is assigned to one of the two long sides, especially the right-hand long side according to the view in Figure 2. ... [emphasis added]62     I therefore do not agree that a person skilled in the art would come to the conclusion suggested by the Defendants. The more likely view is that a person skilled in the art would understand that the locking catch can be on either the right or the left long sides of the coupling device, and this is consistent with the claim which states the locking catch as being “arranged laterally” when the coupling device is viewed from the longitudinal direction of the containers.[note: 68]63     In any event, the Defendants’ contention would, in effect, result in the use of the other parts of the specification to narrow the scope of the protection in the claims. It is trite law that the description cannot be used to narrow the scope of the claims ([30] above). Claim 1 of the 370 Patent only states that the locking catch is “arranged laterally” when the coupling device is viewed from the longitudinal direction of the containers. The language in the claim is wide enough to encompass coupling devices with the locking catch on either side, and it is supported by the description ([61] above). It would therefore be inappropriate for the Defendants to rely on the references to one specific embodiment where the locking catch is pointed to the right to narrow the scope of the claims.64     The next step in the inquiry is to consider the scope of protection under Proposed Amended Claim 1. I have found earlier at [54]–[57] that the First Additional Embodiment is not considered an added matter, and that the Second and Third Additional Embodiment are not disclosed by the Proposed Amended Claim 1. Since the Second and Third Additional Embodiment are not disclosed by the Proposed Amended Claim 1, they would not be relevant to the issue of whether the scope of protection has been extended by the Proposed Amended Claim 1. Given that the 370 Patent and the Proposed Amended Claim 1 would both disclose the First Additional Embodiment, it follows that there is no basis for the Defendants’ contention that the Proposed Amended Claim 1 extends the scope of protection of the 370 Patent.65     I proceed to the Defendants’ third and final argument in relation to the Proposed Amended Claim 1.(3)   Not clear, concise or supported by the description66     The Defendants’ contention is, in essence, that the Proposed Amended Claim 1 is unsupported by the description which only discloses a specific embodiment where the coupling device (with a locking catch pointing to the right) shifts to the left when the upper container is lifted and the sloping shoulder abuts the corner fitting. I have considered the issue, albeit for a related but distinct point, above at [49] and [51]. For the same reasons stated there, I find that the Proposed Amended Claim 1 is supported by the description.Proposed Amended Claim 267     The Proposed Amended Claim 2 reads as follows:2.    A coupling piecein accordance withaccording toclaim 1,characterized in thatwhereinthe length (l) of thesecondsaidothercoupling projection (23) is slightly shorter than the length of an elongated hole (33) of the associated corner fitting of thesaidother container (35)and/or the maximum width (b) of said locking catch (28, 54) is slightly less than the width of said elongated hole (33) of the associated corner fitting of the other container (35). [emphasis in original]68     This is one of the Proposed Amendments which has not been addressed during the hearing.69     In their submissions, the Defendants contend that Proposed Amended Claim 2 should be rejected for disclosing additional matter, extending protection of the 370 Patent and lacking in clarity, conciseness and unsupported by the description.[note: 69]The Defendants’ objection, as I understand from their submissions and Mellberg’s evidence, is that Proposed Amended Claim 2 refers to and is dependent on Proposed Amended Claim 1.[note: 70]Since the Defendants’ submission in relation to Proposed Amended Claim 1 had been rejected earlier, there is nothing left for the Defendants to base their objection for Proposed Amended Claim 2. In addition, the Proposed Amended Claim 2, on its own, would not fall foul of the requirements under the Patents Act. Accordingly, there is no basis for the Defendants’ objection to Proposed Amended Claim 2.Proposed Amended Claim 370     The Proposed Amended Claim 3 reads as follows:63. A coupling piecein accordance with any one of claims 1 to 5according to claim 1 or claim 2,characterized in thatwhereina lead-in chamfer (30)with an angle corresponding to a chamfer (32) on the elongated hole (33) of the container corner fittingis arranged on the long side (L) facing away fromthesaid locking catch (28,46,54) at the junction betweenthesaid coupling projection (23) andthesaid stop plate (21). [emphasis in original]71     Like Proposed Amended Claim 2, this is also one of the Proposed Amendments which has not been addressed during the hearing.72     The Defendants’ objection to Proposed Amended Claim 3 is substantially similar to Proposed Amended Claim 2,ie, that the Proposed Amended Claim 3 refers to and is dependent on Proposed Amended Claims 1 and 2.[note: 71]I have considered Mellberg’s evidence, but for the reasons above ([69] above), I find no basis for the Defendants’ objection to Proposed Amended Claim 3.Proposed Amended Claim 473     The Proposed Amended Claim 4 reads as follows:84. A coupling piecein accordance withaccordingto claim63,characterized in thatwhereinthe said lead-in chamfer (30) isfirst providedformedwith afirstchamfer (52) corresponding to the chamfer(32)atthesaid elongated hole (33) and, underthesaid elongated hole (33), asecondchamfer (53) having an angle that is flatter compared tothesaidfirstchamfer (52). [emphasis in original]74     There are two alternative limbs to the Defendants’ objection to Proposed Amended Claim 4, namely:(a)     The Proposed Amended Claim 4 refers to and is dependent on Proposed Amended Claims 1 to 3, and they disclose additional matter, extend protection and/or lack clarity, conciseness and support of the description.(b)     The Proposed Amended Claim 4, on its own, discloses additional matter, extends the protection and lacks clarity, conciseness and support of the description.75     The objection relates, in essence, to the lead-in chamfer (which is circled in Figure 2 below):[note: 72]76     Figure 15 below provides an alternative embodiment of the coupling device where the lead-in chamfer has two gradients:77     As regards the first limb of the objection, the same reasons that I have given earlier (at [69] and [72]) apply equally here. With that, I move on to the second limb of the objection with regard to Proposed Amended Claim 4.(1)   Discloses additional matter78     The Defendants argue that Proposed Amended Claim 4, which replaces the term “provided” for the term “formed”, would result in a materially different technical understanding by the person skilled in the art,[note: 73]and hence, discloses additional matter. The Plaintiff takes the view that the word “formed” only serves to clarify what was already disclosed in the 370 Patent Application,[note: 74]and it follows that no additional matter is disclosed.79     Mellberg’s evidence on this issue is inconsistent. He initially took the position in his first AEIC that the replacement of the term “provided” with the term “formed” only serves to clarify what was already disclosed in the Patent Application.[note: 75]Later, he changed his view in his second AEIC to say that the term “provided” which was used in the 370 Patent Application would convey a meaning different from the term “formed” in Proposed Amended Claim 4.[note: 76]He explained that the term “provided” was used throughout the 370 Patent Application in respect of defining or describing various features of the coupling device, and in contrast, the term “formed” was not used even at all.[note: 77]Mellberg changed his position once more when he confirmed during cross-examination that he is still of the opinion as stated in his first AEIC,ie, the proposed amendment only serves to clarify what was already disclosed in the 370 Patent Application.[note: 78]The Defendants submit that it was not specifically put to Mellberg that he stood by his initial opinion in respect of the replacement of the term “provided” with the term “formed”.[note: 79]However, there is no merit to the Defendants’ submission. In particular, Mellberg confirmed that he stands by para 142 of his first AEIC, which contains,inter alia, his initial opinion that the replacement of the term “provided” with the term “formed” only serves to clarify what was already disclosed in the Patent Application. In my view, it is immaterial that para 142 of his first AEIC contained more than one proposed amendment given that Mellberg’s confirmation during the cross-examination was clear and unconditional. The Defendants also point out that Mellberg came to a different view in his second AEIC after having considered Huisman’s first AEIC where, as I shall elaborate later, Huisman accepts that the two words are different.[note: 80]Again, I do not see how that advances the Defendants’ case especially in light of Mellberg’s confirmation that he stands by his initial opinion.80     I turn to consider Huisman’s evidence. In his first AEIC, he stated that the term “formed” was a “better technical word”, taking into consideration the casting process which was used to construct the coupling piece, and this has been disclosed in the Patent Application.[note: 81]However, Huisman’s position was less clear during the hearing. On the one hand, it appears that he maintains his view in the first AEIC.[note: 82]On the other hand, however, he considers that the replacement of the term “provided” with the term “formed” was unnecessary from a technical point of view.[note: 83]In addition, the Defendants point out that the term “provided” was used in the 370 Patent Application in relation to other features of the coupling piece that also underwent the casting process (eg, the locking catch), but the Plaintiff had not sought to amend those other instances.[note: 84]Despite that, Huisman sought to explain the term “formed” on the basis of the casting process.[note: 85]This, the Defendant argues, casts a doubt on the objectivity of Huisman.[note: 86]However, as the Court of Appeal observed inMühlbauer AG v Manufacturing Integration Technology Ltd[2010] 2 SLR 724 (“Mühlbauer”) at [47], the relevant test is one ofactualas oppose to appearance of partiality. I do not think that the threshold has been met; no evidence was adduced to show that Huisman wasactuallybiased.81     Given the state of evidence before this Court, I should start by stating that while expert evidence may be helpful, it is ultimately for the court to decide whether the requisite legal criteria have (or have not) been met:Mühlbauerat [47]. As noted inContour Optik Inc and others v Pearl’s Optical Co Pte Ltd and another[2002] SGHC 238 at [35], “the construction of a patent is a matter for the court and not the expert witness”.82     Applying theBonzeltest ([22] above), I find that the replacement of the term “provided” with the term “formed” would disclose additional matter. Nowhere in the 370 Patent Application was the term “formed” used in relation to the chamfer labelled as 52. In fact, the term “formed” does not appear at all. Instead, the description in the Patent Application states that “... the lead-in chamfer isfirst providedwith a steeper chamfer [labelled as] 52”.[note: 87]This was precisely what the Plaintiff is seeking to replace in Proposed Amended Claim 4. In my view, a person skilled in the art would understand the term “formed” to connote a different meaning from that of the term “provided”. The difference is not merely one of linguistic clarity. The evidence of the experts supports this. Huisman’s evidence is that the term “formed” means that the feature is an integral part of the coupling piece as a result of the casting process whereas the term “provided” indicates something more.[note: 88]Likewise, Mellberg considers that the term “provided” may be understood to mean that the feature “may not be integral with the coupling piece”, while the term “formed” would suggest that it is.[note: 89]Therefore the replacement of the term “provided” for the term “formed” as in Proposed Amended Claim 4 would result in a different understanding of the casting process, specifically for the chamfer labelled as 52, and this was not disclosed in the 370 Patent Application.83     My finding that Proposed Amended Claim 4 discloses additional matter would suffice for this Court to reject Proposed Amended Claim 4. For completeness, however, I shall proceed to consider the Defendants’ alternative arguments with regard to Proposed Amended Claim 4.(2)   Extends protection84     The Defendants submit that the Proposed Amended Claim 4 would extend the protection of the 370 Patent because it does not cover an embodiment of the coupling device where the lead-in chamfer is “formed with a first chamfer ...”[note: 90]I do not agree with the Defendants’ submission. The claims in the 370 Patent are wide enough to cover an embodiment where the lead-in chamfer is “formedwith a first chamfer ...” The term “provided” has been used in the 370 Patent to describe features that may or may not be integral with the coupling piece as a result of the casting process. For instance, Figure 15 shows an exemplary embodiment of the coupling device with a movable locking catch (which, thus, would not be integral with the coupling piece), and the description states:[note: 91]Figure 15 shows an exemplary embodiment, in which the lead-in chamferis first providedwith a steeper chamfer [labelled as 52] ... [emphasis added]At the same time, the term “provided” has been used throughout the 370 Patent to refer to features that are integral with the coupling piece as a result of the casting process.[note: 92]As a result of the manner in which the term “provided” has been used in the 370 Patent, a person skilled in the art would not consider the term “provided” to exclusively refer to features that are not integral to the coupling piece as a result of the construction method,ie, the casting process. Therefore, I find that the Proposed Amended Claim 4 would not extend the scope of protection of the 370 Patent.(3)   Not clear, concise or supported by the description85     The Defendants submit that the Proposed Amended Claim 4 is neither clear nor supported by the description. Specifically, the Defendants reiterate the point that the term “formed” is not used in the 370 Patent Application or the 370 Patent, and that the term “provided” has been used for features which may or may not be integral with the coupling piece as a result of the casting process.[note: 93]86     I agree with the Defendants on this point. The Proposed Amended Claim 4 would result in a lack of clarity because it would result in inconsistency in the description of the features which are integral with the coupling piece as a result of the casting process. If Proposed Amended Claim 4 were allowed, then some features which are integral to the coupling piece would be described as “provided” whereas chamfer labelled as 52 (which is also integral to the coupling piece) would be described as “formed”. The discrepancy would render the scope of the protection under the 370 Patent unclear. This is one of those amendments which, in the words of the learned authors inTerrellat para 15-43 ([25] above), would “create uncertainty as to what the new claim really means”. Therefore I find the Proposed Amended Claim 4 to be unclear and that it should be rejected under s 25(5)(b) of the Patents Act.87     Also, for the reasons that I have stated earlier at [82], I find that the Proposed Amended Claim 4 is not supported by the description and should be rejected under s 25(5)(c) of the Patents Act.Proposed Amended Claim 588     The Proposed Amended Claim 5 reads as follows:115. A coupling piecein accordance with claim10according to any one of claims 1 to 4,characterized in thatwhereinthesaidlocking catch (54) is designedsuch that it is cross-to beslidable againstthe coupling projection (23), in particular againstthe force of a spring (55). [emphasis in original]89     The Defendants’ objection in relation to Proposed Amended Claim 5 can be divided into two parts, namely:(a)     The Proposed Amended Claim 5 refers to and is dependent on Proposed Amended Claims 1 to 4, and they disclose additional matter, extend protection and/or lack clarity, conciseness and support of the description.(b)     The Proposed Amended Claim 5 would, on its own, disclose additional matter and extends the scope of protection.90     In relation to the first part of the contention, having rejected Proposed Amended Claim 4, it follows that I should also reject Proposed Amended Claim 5.91     As for the second part of the contention, the gist of it lies with the wording “the locking catch is designed to beslidableagainst the coupling projection” in the Proposed Amended Claim 5. The original claim in the 370 Patent Application states that it is “cross-slidable” against the force of a spring.[note: 94]An example of a coupling device with such a locking catch would be Figure 16:[note: 95]92     As mentioned earlier, the Defendants say that Proposed Amended Claim 5 discloses additional matter and extends the protection of the 370 Patent. I discuss both points below.(1)   Discloses additional matter93     The Defendants take the view that the replacement of the term “cross-slidable” with the term “slidable” would disclose additional matter. In particular, the Defendants submit that the term “cross-slidable” connotes linear motion while the term “slidable” includes linear as well as rotational motion.[note: 96]The Defendants argue that since the 370 Patent Application only discloses linear and not rotational motion, the Proposed Amended Claim 5 would disclose additional matter.[note: 97]The Plaintiff’s response is that no additional matter was disclosed as the term “slidable” restricts the sliding to the direction of the locking catch.[note: 98]94     The evidence of the experts on this point is clear. Mellberg says that the term “cross-sliding” refers to a linear motion while the term “sliding” can include both linear and rotational motion.[note: 99]Huisman, on the other hand, considers that the original wording “cross-slidable against the force of a spring” is vague and can be in “any direction”, whereas the Proposed Amended Claim 5 restricts the “sliding direction against the coupling projection”.[note: 100]95     In my view, the Proposed Amended Claim 5 does not disclose additional matter. I disagree with Mellberg that the term “sliding” would include a rotational motion. In my view, the wording “the locking catch is designed to be slidableagainst the coupling projection, in particular against the force of a spring” (emphasis added) in the Proposed Amended Claim 5, read in its proper context, would disclose that the locking catch has only one axis of movement, that is, in the direction of the spring. Further, this has been disclosed in the 370 Patent Application in the following manner:[note: 101]According to an alternative exemplary embodiment of the coupling piece according to the present invention,the locking catch is designed such that it is cross slidable in relation to the lower coupling projection. When the lower coupling projection is inserted into the upper elongated hole of the upper corner fitting of the container,the locking catch is pushed back against the lower coupling projectionand then, after insertion in the elongated hole, ispushed back again into the locking position by means of the force of a spring....In the exemplary embodiment shown in Figure 16the locking catch is displaceable against the lower coupling projection. Concretely, the locking catch can be moved slightly sloping upwards in the direction of the lead-in chamfer. ... As a result of this,the locking catch is pressed backwards against the force of a springand comes into the position shown by broken lines in Figure 16. The lower coupling projection can now slide into the elongated hole. The locking catch is thenpushed back again by means of the force of the spring into the starting position. ...[emphasis added]These two passages, when read in conjunction with Figure 16 ([91] above), would show that the sliding of the locking catch against a single axis has been disclosed in the 370 Patent Application. Accordingly, the replacement of the term “cross-sliding” for the term “sliding”, in this context, would not disclose additional matter.(2)   Extends protection96     The Defendants contend, in the alternative, that the Proposed Amended Claim 5, with the replacement of the term “cross-slidable” for the term “slidable”, would extend the scope of protection to cover an embodiment where the locking catch moves in a rotational (as opposed to linear) motion.[note: 102]The Defendants claim that it would disclose an embodiment of the coupling device that is “distinct” from the embodiments covered by the 370 Patent and thus extends the scope of protection.[note: 103]97     I do not agree with the Defendants’ contention. As mentioned earlier ([95] above), the Proposed Amended Claim 5 would not disclose an embodiment where the locking catch moves in a rotational motion. Further, the claims in the 370 Patent, when read in light of Figure 16 and the description ([91] and [88] above), would disclose an embodiment where the locking catch moves along a single axis of movement, that is, in the direction of the spring. Hence, the Proposed Amended Claim 5 would not, in any way, extend the protection of the 370 Patent.Proposed Amended Claim 698     The Proposed Amended Claim 6 reads as follows:56. A coupling piecein accordance withaccording toany one of claims 1 to45,characterized in thatwhereinthesaidcoupling projection (23) has a lead-in taper (29)underbelowthesaidlocking catch (28,46,54). [emphasis in original]99     This is another one of the Proposed Amendments that has not been addressed during the hearing.100    The Defendants’ objection to Proposed Amended Claim 6 is that it refers to and is dependent on Proposed Amended Claims 1 to 5, and that they disclose additional matter, extend protection and/or lack clarity, conciseness and support of the description. Given that Proposed Amended Claim 4 has been rejected, I find that Proposed Amended Claim 6 should likewise be rejected.Proposed Amended Claim 7101    The Proposed Amended Claim 7 reads as follows:127. An arrangement of containers (35, 36) stacked oneatopon top ofthe other,andparticularly onboard ships,which aresaid containers beingjoinedwith one anothertogetherwith coupling pieces (20, 45) at their corner fittings,characterized in thatwhereinthesaid containers (35, 36) are joinedwith one anothertogetherat least at the corner fittings of a front side of said containers (35, 36)eachwith a coupling piece (20, 45)in accordance withaccording toany one of claims 1 to86, in particular according to any one of claims 1 to 5.[emphasis in original]102    The Defendants object to Proposed Amended Claim 7 on two grounds, namely:[note: 104](a)     The Proposed Amended Claim 7 refers to and is dependent on Proposed Amended Claims 1 to 6, and they disclose additional matter, extend protection and/or lack clarity, conciseness and support of the description.(b)     The Proposed Amended Claim 7 would, on its own, lack clarity and conciseness.103    I begin with the first ground. For the same reasons articulated above at [90] and [100], Proposed Amended Claim 7 should be rejected. In any event, I proceed to consider the second ground of objection.104    For the second ground, the Defendants argue that Proposed Amended Claim 7, which introduces the wording “in particular according to any one of claims 1 to 5”, is not clear and concise.[note: 105]It is pertinent to note that if the amendments were allowed, the claim would read as “according to any one of claims 1 to 6,in particularaccording to any one of claims 1 to 5”. Mellberg’s evidence is that this renders the Proposed Amended Claim 7 unclear.[note: 106]The Plaintiff’s explanation is that this is the way that a patent writer would write it in light of Proposed Amended Claim 6,[note: 107]and that it does not offend any rules.[note: 108]105    The meaning of the wording “according to any one of claims 1 to 6,in particularaccording to any one of claims 1 to 5” is clear. It refers to a set of claims (ie, claims 1 to 6) and emphasis is placed on a sub-set thereof (ie, claims 1 to 5). However, the problem is redundancy. In spite of the Plaintiff’s purported explanation, there is no apparent reason for the emphasis on “claims 1 to 5”. This redundancy, in my view, introduces uncertainty as to thescopeof Proposed Amended Claim 7. Claims must be “drawn in terms which are sufficiently clear for the skilled addressee to determine their scope”:Sudarshanat [77]. As a result of the redundant words “in particular according to any one of claims 1 to 5”, the scope of the Proposed Amended Claim 7 would not be clear. Even if the wording in Proposed Amended Claim 7 would not introduce uncertainty as to the scope of the claim, I find that it is not concise given that the emphasis on “claims 1 to 5” is redundant and adds nothing but meaningless words. The Plaintiff’s explanation as set out above simply does not clarify why the emphasis on “claims 1 to 5” is necessary, and the reason is not in any way apparent on its face. Accordingly, I reject Proposed Claim 7 under s 25(5)(b) of the Patents Act.Proposed Amended Claim 8106    The Proposed Amended Claim 8 reads as follows:148. An arrangementin accordance with claim 15,characterized in thataccording to claim 7 whereinthesaid locking catches (28) of saidAcoupling pieces (20), which are assigned to the (front) corner fittings (43) on one of the front walls ofthesaid containers (35, 36), when viewed in the longitudinal direction ofthesaid containers (35, 36), point in a lateral direction, and said locking catches (28) of saidAcoupling pieces (20), which are assigned to the said (rear) corner fittings (44) on the other of the front walls ofthesaid containers (35, 36), point in the opposite direction. [emphasis in original]107    This is the last of the Proposed Amendments that have not been addressed during the hearing. Like the others, the Defendants object to it in their written submissions.108    The Defendants object to Proposed Amended Claim 8 because it refers to and is dependent on Proposed Amended Claim 7, which in turn refers to and is dependent on Proposed Amended Claims 1 to 6.[note: 109]As I had found Proposed Amended Claims 4 to 7 to be invalid, I reject Proposed Amended Claim 8 as well.Proposed Amended Claim 9109    The Proposed Amended Claim 9 reads as follows:159. A method for joining said containers (35, 36) stacked oneatopon top ofthe other, particularly onboard ships, with coupling pieces (20, 45)in accordance withaccording toany one of claims 1 to86,characterized in thatwhereinthe said upper container (36) is rotated about its vertical axisor offset laterallyduring the coupling and/or uncoupling with the lower container, by means of the shape of the coupling pieces (20, 45). [emphasis in original]110    The Defendants contend that Proposed Amended Claim 9 should be rejected for disclosing additional matter, extending protection of the 370 Patent and lacking in clarity, conciseness and unsupported by the description.[note: 110]111    Proposed Amended Claim 9 concerns the movement of the upper container when the coupling and/or the uncoupling with the lower container. Depending on the shape and arrangement of the coupling devices, the upper container would either rotate about its vertical axis (see diagram below, which shows the upper container from the top view) or offset laterally during the process of loading (ie, coupling) and/or unloading (ie, uncoupling):(1)   Discloses additional matter112    The Defendants contend that the 370 Patent Application does not disclose any lateral offset or rotation of the upper container during theloadingprocess (ie, during the coupling with the lower container) when coupling devices with movable locking catch (reflected in the embodiment in Figure 16 ([91] above)) are used.[note: 111]Since the Proposed Amended Claim 9 would cover coupling devices which would rotate about its vertical axis or offset laterally “during the couplingand/oruncoupling with the lower container”, it would disclose additional matter.[note: 112]The Plaintiff appears to contend that Proposed Amended Claim 9 has already been disclosed in the Patent Application.[note: 113]113    The Defendants claim that the 370 Patent Application discloses the expected movement of the upper container during the loading and/or unloading based on the arrangement of the coupling devices as follows:[note: 114]Type of coupling devicesArrangement of coupling devices on upper containerExpected movement (coupling)Expected movement (uncoupling)Figure 2 (fixed locking catch)Locking catch of the front pair and rear pair of coupling devices point inopposite directionsRotationalRotationalFigure 2 (fixed locking catch)Locking catch of the front pair and rear pair of coupling devices point in thesame directionLateral offsetLateral offsetFigure 16 (moveable locking catch)Locking catch of the front pair and rear pair of coupling devices point inopposite directionsNilRotationalFigure 16 (moveable locking catch)Locking catch of the front pair and rear pair of coupling devices point in thesame directionNilLateral offset114    It is undisputed that the Proposed Amended Claim 9 would cover the rotational or lateral offset of the upper container during loading and/or unloading. The question lies with what was disclosed in the 370 Patent Application, and specifically, in relation to the movement of the upper container duringloadingusing coupling devices withmovablelocking catch.[note: 115]The area of contention is emphasised with bold italics in the table above (at [113]). The relevant part of the specifications states:[note: 116]In the exemplary embodiment shown in Figure 16the locking catch is displaceableagainst the lower coupling projection. Concretely, the locking catch can be moved slightly sloping upwards in the direction of the lead-in chamfer. This variant is advantageous if the containers stacked one atop the other areso close to one another onboard ships that they cannot be rotated about their vertical axisfor the joining and/or separating of the containers during the loading and/or unloading of the containers. When the upper container is placed on the lower container, as before, the lead-in taper on the lower coupling projection is first inserted into the elongated hole. Then, a lower slope sets down on the chamfer at the elongated hole.As a result of this, the locking catch is pressed backwards against the force of a spring and comes into the position shown by broken lines in Figure 16. The lower coupling projection can now slide into the elongated hole. The locking catch is then pushed back again by means of the force of the spring into the starting position. The coupling piece is locked.... it can be seen that the course of the lower slope compared to the direction of displacement of the locking catch is slightly greater than a right angle. Consequently, an optimal force on the locking catch is reached for pushing back during the loading.[emphasis added]115    The Defendants rely on Mellberg’s evidence that the 370 Patent Application does not disclose that there will be a lateral offset during loading when coupling devices with moveable locking catch are used.[note: 117]116    Huisman’s evidence is that there might be rotational or lateral offset of the upper container when coupling devices with movable locking catch are used. This depends on “how the container is dropped on top of the lower one and what is the strength of the spring”.[note: 118]Huisman added that it is “only theoretical” to say that there will be no movement at all.[note: 119]In response to the question of whether the 370 Patent Application states that there would be no rotational movement when coupling devices with movable locking catch are used, Huisman answered:[note: 120]It is not the intention of the locking piece to introduce a rotational movement. However, where is the container exactly touching the lower container when it is loaded? Is it on the left side of the ISO hole? Is it on the right side of the ISO hole?And what are the forces of the spring in relation to the brutal force the crane driver sometimes uses to load containers? So, that there will beno movement at allis highly unlikely....... the intention of this locking catch as drawn in figure 16 is toreduce the movement.[emphasis added]I understand Huisman to mean that while there may be situations where there is no rotation about the vertical axis by the upper container when loading (eg, when the container is “jammed against a container next to it”),[note: 121]it is not necessarily so. It depends on,inter alia, the force of the spring and the downward force of the upper container.117    Therefore Huisman’s view is that it depends on the circumstances (eg, the proximity of the containers, force of the spring and the downward force of the upper container). In other words, the rotational or lateral offset of the upper container as a result of the movable locking catch would, in the eyes of a person skilled in the art, be a possible albeit unintended result. The question, therefore, is: would such a disclosure suffice?118    In my view, it would not. The specification in the 370 Patent Application makes it clear that the movable locking catch is meant to eliminate any rotation about the vertical axis or lateral offset of the upper container caused by a fixed locking catch during loading. It specifically states that the advantage of a movable locking catch is that it does not involve any rotation of the upper container about its vertical axis. It also explains that this is achieved by the design of the lower slope such that it is “slightly greater than a right angle” so that an “optimal force” is reached to push the locking catch back during the loading process. In this respect, it refers to Figure 16 to show that the locking catch would “come into the position shown by broken lines in Figure 16” ([91] above) during the loading process, and the broken lines in Figure 16 shows the movable locking catch as flushed against the lower coupling projection. There is no reference to any rotation about the vertical axis or lateral offset of the upper container when using coupling devices with movable locking catch. For these reasons, I do not find that the 370 Patent Application has disclosed that the use of coupling devices with movable locking catch would result in the rotation about the vertical axis or lateral offset of the upper container during the loading process. This is therefore not clearly and unambiguously disclosed in the 370 Patent Application. I find that a person skilled in the art would not have understood the 370 Patent Application as having disclosed any rotation about the vertical axis or lateral offset of the upper container as a result of using coupling devices with movable locking catch. Accordingly, the Proposed Amended Claim 9 is invalid for having disclosed additional matter.119    The Defendants also argue, in the alternative, that Proposed Amended Claim 9 would extend the protection of the 370 Patent. I turn now to address it.(2)   Extends protection120    The Defendants submit that the Proposed Amended Claim 9 would extend the protection of the 370 Patent to cover the rotation about the vertical axis and lateral offset during the coupling and/or uncoupling of the upper container using coupling devices with a movable locking catch.[note: 122]It appears that the Proposed Amended Claim 9 seeks to amalgamate the original claims 17 to 20 of the 370 Patent, which read:17.    A method for joining said containers stacked one atop the other, particularly onboard ships, with said coupling piecesin accordance with one of the claims 1 through 9, characterized in that the said upper container is rotated about its vertical axis during the coupling and/or uncoupling with the lower container.18.    A method in accordance with claim 17, characterized in that the said upper container is rotated about its vertical axis during the coupling and/or uncoupling by means of the shape of the said coupling pieces.19.    A method for joining said containers stacked one atop the other, particularly onboard ships, with said coupling piecesin accordance with one of the claims 1 through 9, characterized in that the said upper container is offset laterally during the coupling and/or uncoupling with the lower container.20.    A method in accordance with claim 19, characterized in that the said upper container is offset laterally during the coupling and/or uncoupling due to the shape of the said coupling pieces.[emphasis added]121    The Defendants highlight that the original claims 17 to 20 did not cover a coupling device with movable locking catch, which is provided under the original claims 12 and 13, as follows:12.    A coupling piece in accordance with one of the claims 1 through 11, characterized in that the said locking catch is designed as movable against the said coupling projection.13.    A coupling piece in accordance with claim 12, characterized in that the said locking catch is designed such that it is cross-slidable against the force of a spring.Instead, the original claims 17 to 20 only covered a coupling device with a fixed locking catch as illustrated by Figure 2 ([41] above).122    Since the claims of the 370 Patent do not cover the movements caused by the shape of a coupling device with movable locking catch, the Defendants submit that the Proposed Amended Claim 9 would extend the protection of the 370 Patent. I accept the Defendants’ argument on this point. A plain reading of the original claims 17 to 20 would reveal that they do not cover the rotation about the vertical axis or lateral offset of the upper container as a result of using coupling devices with a movable locking catch. However, the Proposed Amended Claim 9 would cover such movements. Accordingly, I find that the Proposed Amended Claim 9 would extend the protection of the 370 Patent and accordingly reject it under s 84(3)(b) of the Patents Act.123    I next consider the Defendants’ third argument.(3)   Not clear, concise or supported by the description124    The Defendants claim that the Proposed Amended Claim 9 is not supported by the description.[note: 123]The Defendants’ argument, as discussed earlier, is that the 370 Patent Application discloses that there isnorotation about the vertical axis or lateral offset of the upper container during theloadingprocess when coupling devices with movable locking catch are used.[note: 124]In light of the earlier discussion ([118] above), I also find that the Proposed Amended Claim 9 is not supported by the description and reject it under s 25(5)(c) of the Patents Act.Third issue: Whether the Court should exercise its discretion to reject the Proposed Amendments even though the requirements under the Patents Act were met?125    The power of the Court to amend the specification of the patent is discretionary, and this is clear from the language of s 83(1) of the Patents Act. The sub-section reads:Amendment of patent in infringement or revocation proceedings83.—(1) In any proceedings before the court or the Registrar in which the validity of a patent is put in issue, the court or, as the case may be, the Registrarmay, subject to section 84, allow the proprietor of the patent to amend the specification of the patent in such manner, and subject to such terms as to the publication and advertisement of the proposed amendment and as to costs, expenses or otherwise, as the court or Registrar thinks fit.[emphasis added]126    I will first examine the principles on which discretion is to be exercised.Factors to be taken into account127    The analysis begins with the English case ofSmith Kline and French Laboratories Limited v Evans Medical Limited[1989] FSR 561 (“SKF Laboratories”), where Aldous J, at 569, set out the guidelines as to the exercise of the discretion concerning patent amendment as follows:First, the onus to establish that amendment should be allowed is upon the patentee and full disclosure must be made of all relevant matters. If there is a failure to disclose all the relevant matters, amendment will be refused. Secondly, amendment will be allowed provided the amendments are permitted under the Act and no circumstances arise which would lead the court to refuse the amendment. Thirdly, it is in the public interest that amendment is sought promptly. Thus, in cases where a patentee delays for an unreasonable period before seeking amendments, it will not be allowed unless the patentee shows reasonable grounds for his delay. Such includes cases where a patentee believed that amendment was not necessary and had reasonable grounds for that belief. Fourthly, a patentee who seeks to obtain an unfair advantage from a patent, which he knows or should have known should be amended, will not be allowed to amend. Such a case is where a patentee threatens an infringer with his unamended patent after he knows or should have known of the need to amend. Fifthly, the court is concerned with the conduct of the patentee and not with the merit of the invention.128    This has been endorsed in Singapore by the Court of Appeal inFE Global (CA), and applied inNovartis. In this respect, however, it is necessary to bear in mind the remarks of the Court of Appeal inFE Global (CA)at [31] on the “lenient approach” towards amendments.129    In relation to the third factor,ie, whether the patentee delayed in seeking the amendments (and, if so, whether there were reasonable grounds for such delay), it was observed inNovartisat [10] that:In determining whether the court ought to exercise its discretion against the grant of leave to amend on ground of undue delay, it was held inMatbro Limited v Michigan (Great Britain) Limited[1973] RPC 823 at 833, lines 30-34 (“Matbro”) that:... mere delay is not, of itself, necessarily sufficient to justify refusal of amendment. There must have been or be likely to be some detriment to the respondents or to the general public caused by such delay before it can be an effective bar to relief.Thus, where there is undue delay on the part of the plaintiff in applying to amend the patent specifications, the court may decide in the circumstances, to exercise its discretion against the grant of leave to amend. It has been accepted in the local case ofTrek Technology (Singapore) Pte Ltd v FE Global Electronics Pte Ltd[2005] 3 SLR(R) 389 at [76]-[77], by Lai Kew Chai J, that a patentee ought to act expeditiously from the time he discovers the relevant prior art. The patentee seeking leave to amend must satisfy the court, based on the facts and circumstances, that the patentee acted reasonably and without undue delay. It was held that mere knowledge of some prior art did not mean that the plaintiff ought to amend its patent, but was entitled to take the advice of patent agents on whether amendment was necessary, and if so, the form of amendment required.130    Further, it was noted inNovartisat [48] that:At the end of the day, it must be emphasised that a patentee must act expeditiously in taking out an application to amend its patent claims upon discovering relevant prior art. Any delay in taking out an application to amend must be capable of explanation, and the patentee cannot persist in refusing to amend its patent specifications in an unamended and suspect form despite becoming aware of prior art. However, the court ought to bear in mind, as stated by the English High Court in the case ofMatbro([10]supraat 834 lines 5-16), that it is necessary to:... draw a clear distinction between instances where a patentee knows of prior art which he genuinely, and quite properly in the circumstances, thinks is irrelevant, and other instances where, though he learns of or has been warned of objections which are available against his patent as a result of prior art, yet he takes no steps to put his specification right by way of amendment, or still worse, knowingly persists in retaining it in the unamended and suspect form. In the latter cases delay is culpable because potential defendants and the general public are entitled to plan their activities on the assumption that the patentee, though warned, has decided not to amend. If the patentee, by his conduct, lulls the public into a false sense of security he cannot thereafter be allowed to change his mind and ask for amendment, or at any rate without adequate protection being granted to the public.131    It is also pertinent to consider the decision of Pumfrey J inInstance v CCL Label Inc[2002] FSR 27 (“Instance”). There, the patentee applied to amend claim 8 of its European patent in infringement proceedings. It was contended that the patentee knew or ought to have known that claim 8 was anticipated by prior art since the allegation had been made during the prosecution of the corresponding domestic British application. At around the same time, the patentee commenced infringement proceedings against various parties and sought a Europe-wide injunction. The patentee’s case was that he relied on the advice of his patent agent that claim 8 was not anticipated by prior art. Pumfrey J refused the amendments. He considered that a patentee could not normally be criticised for making decisions on the need to amend his patent on the basis of the advice received from a competent patent agent. In such a case, the patentee could not be considered as guilty of culpable delay. Even though the application to amend was made shortly after the patentee found out that claim 8 was invalid, Pumfrey J found that there was no satisfactory explanation for it. In addition, the infringement proceedings were commenced even though the patentee thought that amendment for claim 8 was required. As a result, Pumfrey J decided to refuse the patentee’s application to amend.132    As for the fourth factor,ie, whether the patentee had sought to obtain an unfair advantage from the patent, Aldous J inSKF Laboratoriesconsidered at 569 that it encompasses a case “where a patentee threatens an infringer with his unamended patent after he knows or should have known of the need to amend”. InSKF Laboratories, Aldous J referred to,inter alia, the case ofAutoliv Development AB’s Patent[1988] RPC 425. In that case, the patentees knew that amendment was necessary to avoid prior art, but delayed amending their patent for four years, and in the meantime, sent out threatening letters to alleged infringers. Falconer J refused to allow the amendment. He found that the delay of four years was unreasonably long in light of the circumstances, and the sending out of the threatening letters after they knew that the patent should be amended would amount to seeking an unfair advantage.133    To sum up, it is important to bear in mind the underlying rationale of the discretion to refuse an application to amend. This is well explained by Aldous LJ inKimberly-Clark Worldwide Inc v Procter & Gamble Limited and another[2000] FSR 235 at 248 as the “desire to protect the public against abuse of monopoly”. Pumfrey J inInstanceat [37] described it as “a desire to ensure that patentees do not obtain an advantage which is unfair from their failure to amend” and went further to consider that it may be “to punish patentees for the unreasonableness of their conduct even when no advantage has in fact been gained”.134    With these principles in mind, I now turn to address the present case.Application to the facts135    For convenience, I shall set out the chronology of relevant events below:DateEvent5.5.10Plaintiff commenced infringement proceedings in S 315/2010[note: 125]10.11.10Plaintiff filed amendments for European Patent[note: 126]25.11.10Opposition Division of EPO found European Patent to be invalid[note: 127]26.11.10Plaintiff joined the second and third defendants in S 315/2010[note: 128]21.1.11Plaintiff filed notice of appeal with EPO[note: 129]21.10.11Plaintiff obtained search order against defendants of S 738/2011[note: 130]19.10.11Plaintiff commenced infringement proceedings in S 738/2011[note: 131]18.12.12Plaintiff filed statement of reasons[note: 132]28.12.1230.1.13Proposed Amendments published in Patents Journal[note: 133]17.2.14Quentin Loh J (“Loh J”) directed issue of amendment to be heard as preliminary issue[note: 134]136    In light of these circumstances, the Defendants submit that this Court should not allow the Proposed Amendments given that:(a)     The Plaintiff has not disclosed all the relevant information with regard to the Proposed Amendments.[note: 135](b)     The Plaintiff has no reasonable grounds for the delay in seeking the Proposed Amendments.[note: 136](c)     The Plaintiff has obtained an unfair advantage from the delay in seeking the Proposed Amendments despite having reasonable grounds to believe that the 370 Patent is invalid.[note: 137]137    The Plaintiff denies the Defendants’ allegations of delay and unfair advantage.[note: 138]Non-disclosure138    The Defendants contend that the Plaintiff had not disclosed the relevant findings of the EPO that have a material impact on the circumstances surrounding these applications, as well as the evidence to explain the circumstances of its delay in filing these applications.[note: 139]139    For a start, I note that, pursuant to the Convention of the Grant of European Patents (“the European Patent Convention”), the EPO would have, as it appears, no discretion over whether an amendment should be granted based on the conduct of the patentee. This is observed by Floyd J inZipher Ltd v Markem Systems Ltd[2009] FSR 1 at [197]–[219]:197    For many years prior to the coming into force of the Patents Act 2004, courts and tribunals in this country have exercised a very wide discretion over whether to allow a party to amend the scope of the monopoly granted by a patent following its grant. ......200    Following the United Kingdom’s ratification of the European Patent Convention and the passing of the Patents Act 1977, it was doubted in a number of first instance cases whether the discretion was consistent with the Treaty and the Act, at least when there were concurrent proceedings before the court and in the EPO. ......205    Section 75, as it now stands, requires the court to “have regard to any relevant principles applicable under the European Patent Convention”. Accordingly, one should turn to the Convention to see what principles are applied to considering whether or not to allow amendments....206    There is very little by way of express guidance in the European Patent Convention. ......216Neither Art.105b nor the Implementing Regulations (rr.90–96) appear to give the EPO a discretion to reject a limitation request which complies with the formalities prescribed in r.92 and with Arts 84 and 123(2) and (3).217    The position under the EPC would therefore appear to be that:i) in opposition proceedings, appropriateness of the amendments to the proceedings, their necessity and procedural fairness are the main, perhaps only, factors considered relevant to the discretion to allow amendment;ii) in central amendment proceedings, compliance with the procedural requirements gives rise to a right to have the patent limited in accordance with the request.218    If a proper amendment is now brought forward in opposition proceedings in good time and which is necessary and appropriate to meeting the opposition, it seems inescapable that it will be allowed. It would, it seems to me, be an odd result if an amendment which would be available as of right under the central amendment procedure was refused simply because the patent was under opposition. Such a result would only be justified if either (a) the amendments would have no effect on the opposition and could accordingly be made after its conclusion if the patent survives or (b) procedural fairness to the opponents meant that it could not be considered. I appreciate that (b) might result in a patent being revoked before it could be amended: but if it were not so, the patentee could derail the proceedings by claiming the right to amend at the last moment.219    I think what I have derived so far can fairly be described as the principles on which in future, if not in the past, the power to allow amendment will be exercised in the EPO under the EPC. It follows that if I am to have regard to the principles applicable under the EPC, the discretion which I have to refuse amendments which comply with the Act has been limited.Considerations such as those formerly considered relevant to the discretion, such as the conduct of the patentee, are no longer relevant.[emphasis added]140    The learned authors ofTerrellat para 15-69 noted that Floyd J’s view “appears consistent with the policy intention as expressed in thetravaux preparatoires” of the European Patent Convention.141    In light of this, it appears to me that the findings of the EPO on the issue of amendment would have no bearing on whether the discretion ought to be exercised in the present case. The Defendants have not shown otherwise. It follows that there appears to be no reason to find that the Plaintiff had failed to make full and frank disclosure on the findings of the EPO in relation to the issue of amendment.142    As for the circumstances surrounding the alleged delay, it is not true that the Plaintiff had not adduced any evidence as the Defendants claim. In particular, the Plaintiff had called Detlef Von Ahsen (“Detlef”), who is the “overall coordinating counsel” for S 315/2010 and S 738/2011, to give evidence. The burden lies with the Plaintiff to show that the discretion should be exercised and the Plaintiff’s case would turn on the evidence it seeks to adduce. The Defendants undoubtedly take the view that Detlef’s evidence is inadequate. This does not mean, however, that this Court should draw an inference that the Plaintiff has failed to make full and frank disclosure.143    I therefore do not find that the Plaintiff had failed to make full and frank disclosure.Undue delay144    The Defendants contend that the Plaintiff knew that claim 1 of the 370 Patent, which corresponds with claim 1 of the European Patent, might be invalid as early as November 2010 when the decision of the Opposition Division was released.[note: 140]Notwithstanding that, the Plaintiff only published its intention to amend the 370 Patent on 28 December 2012 and 30 January 2013, more than two years later.[note: 141]The Defendants submit that there was no reasonable explanation for the delay.[note: 142]In response, the Plaintiff denies that there was a delay in applying to amend the 370 Patent, and submit that they were entitled to wait for the final outcome of the appeal in the EPO before deciding whether to amend the 370 Patent.[note: 143]The Plaintiff also explained that it had gone ahead with the amendment application before the release of the decision of the Appeals Board of the EPO as a result of Loh J’s directions for the issue of validity to be heard first.[note: 144]145    Detlef accepts that the Plaintiff knew as of 25 November 2010 that the 370 Patent corresponds to the European Patent and the Opposition Division of the EPO had found the European Patent to be invalid.[note: 145]He also accepts that there was “a potential risk” that the Singapore court might come to the same view as the Opposition Division of the EPO.[note: 146]However, Detlef insists that he disagrees with the decision of the Opposition Division of the EPO,[note: 147]and in all likelihood, he would have advised the Plaintiff as such. Notwithstanding that, the Plaintiff eventually decided to amend the 370 Patentbeforethe decision of the Appeal Board of the EPO was released,[note: 148]contrary to the earlier view taken by Detlef and presumably the Plaintiff. Pertinently, it appears that the Plaintiff had decided to go ahead with the Proposed Amendments as a result of the decision of the Opposition Division of the EPO. This was precisely what Detlef said he did not agree with. The statement of reasons filed by the Plaintiff on 18 December 2012 reads:[note: 149]20.    The amendments are to amend the claims in the Patent to correspond to allowed claims of the corresponding European patent application no. 03727334.9 (granted EP Patent No. EP 1534612 B1) which were deemed by the Opposition Division of the European Patent Office to distinguish over the following references, some of which have also been cited by the Defendant in the Particulars of Objection ...146    This volte-face by the Plaintiff casts a serious doubt on the words of Detlef, and, unless adequately explained, it would suggest either (a) the Plaintiff, on the advice of Detlef, had never genuinely intended to wait for the decision of the Appeal Board of the EPO or (b) the Plaintiff had such serious concerns about the validity of the 370 Patent that it preferred to act contrary to Detlef’s advice. Detlef’s evidence is that the Plaintiff had decided to amend the 370 Patentbeforethe decision of the Appeal Board of the EPO was released, as originally intended, after having “assessed the strength of its chances of success in the corresponding European proceedings”.[note: 150]Nonetheless, on cross-examination, Detlef concedes that it was based on “gut feeling”.[note: 151]Detlef also testifies that it was triggered by Loh J’s direction for the issue of validity of the 370 Patent to be heard first.[note: 152]However, the records show otherwise. In fact, directions were only given by Loh J on 17 February 2014. This was more than a year after the Plaintiff had given notice of its intention to amend the 370 Patent. Even on the Plaintiff’s account (ie, 22 April 2013),[note: 153]it would have been several months later. For completeness, I should add that Loh J indicated to counsel on 3 May 2012 that he was minded to hear both issues of validity and infringement as preliminary issues; he did not say to hear the issue of validity first. In other words, Loh J’s direction could not have been, as suggested by Detlef, the “trigger” for the volte-face. In any event, even if that was true, it would appear that the Plaintiff was motivated to amend the 370 Patent when it found out that the issue of validity was going to be heard, and this must suggest that the Plaintiff was, contrary to Detlef’s evidence, doubtful of the validity of the 370 Patent.147    I find no reasonable explanation for the Plaintiff’s delay in seeking to amend the 370 Patent. If it were true that the Plaintiff, on advice of Detlef, had genuinely considered that no amendment was necessary, then it is difficult to see why the Plaintiff eventually decided to proceed with the amendment of the 370 Patent. As shown above at [146], Detlef could not point to anything that would justify the change in the Plaintiff’s view. The proper inference to be drawn from the evidence before me is that Detlef’s explanation that the Plaintiff was waiting for the final outcome of the appeal in the EPO before deciding whether to amend the 370 Patent was purely an afterthought. It follows that there is no reasonable explanation for the delay.148    The Singapore cases ofNovartisandFE Global (HC)where the patentee had been allowed to amend their patents can be distinguished from the present case. InNovartis, the plaintiffs genuinely believed that they would prevail before the EPO in 2006 and therefore did not amend the Singapore patent. Later, in 2009, when the EPO proceedings raised prior art which necessitated an application to amend the European patent, the Court found that it was “perfectly reasonable” for the plaintiffs to proceed with the amendment in Europe, and then apply in Singapore “after obtaining the ruling upon its amendment application, when the necessity arose”. This is different from the present case where the Plaintiff had sought andobtainedthe amendments to the European Patent as early as 10 November 2010, but having done so, took no steps to amend the corresponding 370 Patent in Singapore. It is also apparent that the Plaintiff did not genuinely think that they would prevail without the amendments to the 370 Patent for they would have otherwise proceeded without applying for the Proposed Amendments. Further,FE Global (HC)can also be distinguished on the facts. There, the delay was justified by the time taken for the consultation with the patent agents from the various jurisdictions. That was not the case here.149    Accordingly, I find that there was an undue delay on the part of the Plaintiff in applying to amend the 370 Patent despite having reasonable grounds to believe that it might be anticipated by prior art.Unfair advantage150    The Defendants claim that the Plaintiff had obtained an unfair advantage in S 738/2011 by litigating on the basis of a patent which it knew had a risk of being invalidated in light of the prior art cited against it.[note: 154]151    As discussed earlier, the Plaintiff knew since 10 November 2010 that the European Patent, which corresponds to the 370 Patent, might be anticipated by prior art and sought to avoid invalidity by making amendments to its claims. On 25 November 2010, the Opposition Division of the EPO found the European Patent to be invalid, notwithstanding the amendments. In light of these developments, the Plaintiff proceeded on the very next day to join the second and third defendants in S 315/2010. The Plaintiff commenced infringement proceedings against the defendants in S 738/2011 on or about 19 October 2011.[note: 155]On 21 October 2011, the Plaintiff obtained anex partesearch order on the basis of alleged infringement of the 370 Patent.[note: 156]The search order was eventually set aside for the Plaintiff’s failure to give full and frank disclosure.[note: 157]The affidavit filed in support of the search order did not state that amendments had been made to the corresponding European Patent which was eventually found to be invalid.[note: 158]According to the Defendants, the Plaintiff had commenced infringement proceedings and obtained the search order despite knowing that there was a risk that the 370 Patent might be invalid.152    The Plaintiff, on the other hand, gives four reasons why it had not obtained or sought to obtain any unfair advantage:(a)     First, the Plaintiff denies that it knows or ought to know that the 370 Patent should be amended and claims that it was entitled to presume that the 370 Patent was valid given that it was granted pursuant to a rigorous search and examination process.[note: 159](b)     Second, the Plaintiff is entitled to wait for the decision of the Appeal Board of the EPO with regard to the European Patent, while at the same time take immediate action against the defendants in S 738/2011 for infringement of the 370 Patent.[note: 160](c)     Third, the Plaintiff filed the application to amend the 370 Patent in order to correspond to the allowed claims of the corresponding European Patent and not to overcome any piece of prior art.[note: 161](d)     Fourth, the Plaintiff did not obtain or seek to obtain any unfair advantage in enforcing the search order in 2011 as the automatic twistlocks seized from the defendants in S 738/2011 would still fall within the claims of the 370 Patent even after the Proposed Amendments.[note: 162]153    However, the Plaintiff’s reasons do not hold water. I begin with the third reason. The Plaintiff claims that it “remains convinced” that the 370 Patent is valid and had applied to amend the 370 Patent out of an abundance of caution.[note: 163]The Plaintiff adds that the Proposed Amendments were not to overcome any piece of prior art.[note: 164]However, this explanation rings hollow in light of the statement of reasons filed in support of the application, which states:[note: 165]20.    The amendments are to amend the claims in the Patent to correspond to allowed claims of the corresponding European patent application no. 03727334.9 (granted EP Patent No. EP 1534612 B1) which were deemed by the Opposition Division of the European Patent Office to distinguish over the following references,some of which have also been cited by the Defendant in the Particulars of Objection... [emphasis added]It is apparent that the real reason behind why the Plaintiff had decided to amend the 370 Patent to correspond with the European Patent was because similar prior art had been cited against the 370 Patent.154    This leads us to the first and second reasons. The statement of reasons clearly indicates that the Plaintiff had doubts as to the validity of the 370 Patent. This is plainly inconsistent with the Plaintiff’s assertion that it was convinced that the 370 Patent was valid. As mentioned earlier, the Plaintiff’s claim that it was waiting for the decision of the Appeal Board of the EPO was merely an afterthought. If the Plaintiff was genuinely confident about the validity of the 370 Patent as a result of the search and examination report as well as Detlef’s advice, then there would be no reason for the Plaintiff to amend the 370 Patent to narrow the scope of the claims.155    As for the fourth reason, I find the Plaintiff’s explanation to be misconceived. It should be borne in mind that the inquiry concerns the conduct of the patentee and not the merits of the patent. As stated earlier ([151] above), the Plaintiff knew, at the time the affidavit in support of the search order was made, that the corresponding European Patent had been found to be invalid notwithstanding the amendments. On this basis, the Plaintiff must have known that there was a risk that the 370 Patent, like the corresponding European Patent, might be found to be invalid as well. Despite that, the Plaintiff commenced proceedings and obtained a search order against the defendants in S 738/2011 on the basis of the 370 Patent. The Plaintiff is, in essence, asserting that the 370 Patent is a valid one, even though it has reasons to believe that it might not be. In fact, the Plaintiff’s concerns were strong enough for it to decide to amend the 370 Patent even though (a) Detlef was of the strong view that the EPO was wrong and (b) the search and examination report suggested that the 370 Patent was valid. The Plaintiff’s actions under these circumstances could be considered as covetous conduct. In any event, Pumfrey J inInstanceat [37] accepted that the rationale of the discretion may extend “to punish patentees for the unreasonableness of their conducteven when no advantage has in fact been gained”. This is certainly one of those cases which would warrant the refusal to exercise the discretion to allow the amendments.156    I find that the undue delay was aggravated by the fact that the Plaintiff had sought to obtain unfair advantage from the 370 Patent which it knows should be amended to avoid prior art. Therefore, even if the requirements under the Patents Act are met, I would have exercised the discretion under s 83(1) of the Patents Act to refuse amendment.Conclusion157    For the foregoing reasons, I dismiss SUM 2455/2013 and SUM 2458/2013.158    I will hear counsel on the issue of costs.[note: 1]Bundle of defendant’s AEIC (“DA”), Tab 2 at para 5 and MS-2; Bundle of plaintiff’s AEIC (“PA”), Tab 4 at para 4.[note: 2]DA, Tab 2 at para 18.[note: 3]DA, Tab 2 at para 19.[note: 4]DA, Tab 2 at para 5; PA, Tab 4 at para 6.[note: 5]DA, Tab 2 at para 7; PA, Tab 4 at para 6.[note: 6]DA, Tab 2 at para 8; PA, Tab 4 at para 6.[note: 7]DA, Tab 2 at para 9.[note: 8]DA, Tab 2 at para 11; PA, Tab 4 at para 7.[note: 9]DA, Tab 2 at para 11.[note: 10]DA, Tab 2 at para 12; PA, Tab 4 at para 8.[note: 11]DA, Tab 2 at para 13; PA, Tab 4 at para 9.[note: 12]DA, Tab 2 at para 14; PA, Tab 4 at para 11.[note: 13]AB 222–224.[note: 14]PA, Tab 4 at para 20. See also Plaintiff’s written submissions (“PWS”) at para 4.[note: 15]NE, 30.10.14, p 4 line 23; p 15 line 1.[note: 16]NE, 30.10.14, p 14 line 21p 15 line 1.[note: 17]NE, 30.10.14, p 5 line 4.[note: 18]DA, Tab 2 at para 15.[note: 19]Defendant’s written submissions (“DWS”) at para 13.[note: 20]DWS at paras 15–24.[note: 21]DWS at para 14.[note: 22]PWS at para 9.[note: 23]DWS at para 22.[note: 24]DWS at para 21.[note: 25]DWS at para 17.[note: 26]DWS at para 18.[note: 27]PWS at para 6; NE, 30.10.14, p 9 line 18; NE, 31.10.14, p 2 line 14; p 2 line 21.[note: 28]NE, 30.10.14, p 5 line 4.[note: 29]NE, 30.10.14, p 86 line 11; p 86 line 24; p 87 line 13.[note: 30]DWS at para 47.[note: 31]DA, Tab 1, EOM-2 at p 46.[note: 32]DA, Tab 1, EOM-2 at p 53.[note: 33]DA, Tab 1, EOM-2 at p 303.[note: 34]AB 200.[note: 35]DWS at para 49.[note: 36]PWS at paras 81–82.[note: 37]DWS at paras 50–51.[note: 38]DWS at para 49.[note: 39]DWS at para 52.[note: 40]PWS at para 81.[note: 41]PWS at para 81. See AB 153154.[note: 42]AB 166.[note: 43]AB 222.[note: 44]AB 222.[note: 45]PWS at para 8081[note: 46]AB 166.[note: 47]DA, Tab 1, EOM-2 at para 89(c).[note: 48]DWS at para 65.[note: 49]DWS at para 73.[note: 50]DWS at para 76; DA, Tab 1, EOM-2 at paras 124–126.[note: 51]DA, Tab 4, EOM-3 at p 11.[note: 52]NE, 31.10.14, p 40 line 23.[note: 53]NE, 31.10.14, p 11 line 16; p 12 line 20; p 36 line 16.[note: 54]NE, 31.10.14, p 11 line 16; p 12 line 14.[note: 55]NE, 31.10.14, p 22 line 13; p 23 line 1; p 57 line 17.[note: 56]DWS at para 75.[note: 57]DA, Tab 1, EOM-2 at p 75.[note: 58]NE, 31.10.14, p 43 line 20.[note: 59]NE, 31.10.14, p 45 line 22.[note: 60]PA, Tab 3 para 9.[note: 61]DWS at paras 89 and 91.[note: 62]PWS at para 101.[note: 63]PWS at para 99.[note: 64]DWS at para 84.[note: 65]DWS at para 84; AB 184.[note: 66]DWS at para 85.[note: 67]AB 183.[note: 68]AB 192.[note: 69]DWS at para 93.[note: 70]DWS at para 93; DA, Tab 1, EOM-2 at p 82.[note: 71]DWS at para 94; DA, Tab 1, EOM-2 at paras 138–140.[note: 72]DA, Tab 1, EOM-2 at p 48.[note: 73]DWS at para 99.[note: 74]PWS at paras 88–89.[note: 75]DA, Tab 1, EOM-2 at para 142. See also NE, 31.10.14, p 91 line 1; p 91 line 22.[note: 76]DA, Tab 4, EOM-3 at paras 3036.[note: 77]DA, Tab 4, EOM-3 at paras 32–33.[note: 78]NE, 31.10.14, p 91 lines 4 – 21.[note: 79]DWS at para 101.[note: 80]DWS at para 102.[note: 81]PA, Tab 2 at pp 15–16 (4.2).[note: 82]NE, 31.10.14, p 92 line 6.[note: 83]NE, 31.10.14, p 94 line 8.[note: 84]DWS at para 107. See also NE, 31.10.14, p 95 line19; p 96 line 1.[note: 85]DWS at para 108.[note: 86]DWS at para 108.[note: 87]AB 158.[note: 88]NE, 31.10.14, p 88 line 20 – p 89 line 10.[note: 89]DA, Tab 4 at para 34.[note: 90]DWS at para 110.[note: 91]AB 188.[note: 92]AB 182–189, 192–195.[note: 93]DWS at para 92.[note: 94]AB 164.[note: 95]AB 171.[note: 96]DWS at paras 128–129.[note: 97]DWS at para 129.[note: 98]PWS at paras 94–95. See also NE, 31.10.14, p 100 line 7.[note: 99]DA, Tab 1, EOM-2 at para 148; DA, Tab 4, EOM-3 at paras 47–49; NE, 31.10.14, p 105 line 20; p 106 line 16.[note: 100]PA, Tab 2 at p 17 (5.2). See also NE, 31.10.14, p 100 line 18; p 103 line 11.[note: 101]AB 150, 158.[note: 102]DWS at paras 131–132.[note: 103]DWS at paras 131–132.[note: 104]DWS at paras 135–139.[note: 105]DWS at paras 136–139.[note: 106]NE, 31.10.14, p 114 line 8.[note: 107]DA, Tab 1, EOM-2 at para 161; NE, 31.10.14, p 112 line 22.[note: 108]NE, 31.10.14, p 113 line 21.[note: 109]DWS at para 140.[note: 110]DWS at paras 142–152.[note: 111]DWS at para 143.[note: 112]DWS at paras 141 and 146.[note: 113]PWS at para 96.[note: 114]DWS at para 143.[note: 115]NE, 31.10.14, p 119 line 13.[note: 116]AB 158–159.[note: 117]NE, 31.10.14, p 121 line 18.[note: 118]NE, 31.10.14, p 122 line 9.[note: 119]NE, 31.10.14, p 122 line 17.[note: 120]NE, 31.10.14, p 124 line 4.[note: 121]NE, 31.10.14, p 125 line 11.[note: 122]DWS at para 150.[note: 123]DWS at paras 151–152.[note: 124]DWS at para 151.[note: 125]DA, Tab 2 at para 5; PA, Tab 4 at para 6.[note: 126]NE, 30.10.14, p 14 line 21.[note: 127]DA, Tab 2 at para 29.[note: 128]DA, Tab 2 at para 7; PA, Tab 4 at para 6.[note: 129]PA, Tab 1 at para 8.[note: 130]DA, Tab 2 at para 33.[note: 131]PA, Tab 4 at para 7.[note: 132]DA, Tab 2 at para 12.[note: 133]DA, Tab 2 at para 14; PA, Tab 4 at para 11.[note: 134]DA, Tab 2 at para 16.[note: 135]DWS at paras 155–156.[note: 136]DWS at paras 157–170.[note: 137]DWS at paras 171–178.[note: 138]PWS at paras 105–135.[note: 139]DWS at paras 155–156.[note: 140]DWS at para 161.[note: 141]DA, Tab 2 at para 14; PA, Tab 4 at para 11.[note: 142]DWS at para 167.[note: 143]PWS at para 115.[note: 144]PWS at para 114.[note: 145]NE, 30.10.14, p 43 line 17.[note: 146]NE, 30.10.14, p 59 line 9.[note: 147]NE, 30.10.14, p 42 line 24; p 44 line 11; p 48 line 8; p 57 line 1.[note: 148]NE, 30.10.14, p 73 line 9.[note: 149]AB 84, 92.[note: 150]PA, Tab 1 at para 11.[note: 151]NE, 30.10.14, p 78 line 1.[note: 152]NE, 30.10.14, p 73 line 16; p 78 line 14.[note: 153]PWS at para 114.[note: 154]DWS at para 178.[note: 155]PA, Tab 4 at para 7.[note: 156]DA, Tab 2 at para 33.[note: 157]DA, Tab 2 at para 33.[note: 158]NE, 30.10.14, p 67 line 6; p 67 line 16; p 69 line 1.[note: 159]PWS at paras 120–121.[note: 160]PWS at para 122.[note: 161]PWS at paras 123–124.[note: 162]PWS at para 125.[note: 163]PWS at para 124.[note: 164]PWS at para 124.[note: 165]AB 84, 92.",
        "Third issue: Whether the Court should exercise its discretion to reject the Proposed Amendments even though the requirements under the Patents Act were met?": "125    The power of the Court to amend the specification of the patent is discretionary, and this is clear from the language of s 83(1) of the Patents Act. The sub-section reads: Amendment of patent in infringement or revocation proceedings 83.—(1) In any proceedings before the court or the Registrar in which the validity of a patent is put in issue, the court or, as the case may be, the Registrarmay, subject to section 84, allow the proprietor of the patent to amend the specification of the patent in such manner, and subject to such terms as to the publication and advertisement of the proposed amendment and as to costs, expenses or otherwise, as the court or Registrar thinks fit. [emphasis added] 126    I will first examine the principles on which discretion is to be exercised.",
        "Factors to be taken into account": "127    The analysis begins with the English case ofSmith Kline and French Laboratories Limited v Evans Medical Limited[1989] FSR 561 (“SKF Laboratories”), where Aldous J, at 569, set out the guidelines as to the exercise of the discretion concerning patent amendment as follows: First, the onus to establish that amendment should be allowed is upon the patentee and full disclosure must be made of all relevant matters. If there is a failure to disclose all the relevant matters, amendment will be refused. Secondly, amendment will be allowed provided the amendments are permitted under the Act and no circumstances arise which would lead the court to refuse the amendment. Thirdly, it is in the public interest that amendment is sought promptly. Thus, in cases where a patentee delays for an unreasonable period before seeking amendments, it will not be allowed unless the patentee shows reasonable grounds for his delay. Such includes cases where a patentee believed that amendment was not necessary and had reasonable grounds for that belief. Fourthly, a patentee who seeks to obtain an unfair advantage from a patent, which he knows or should have known should be amended, will not be allowed to amend. Such a case is where a patentee threatens an infringer with his unamended patent after he knows or should have known of the need to amend. Fifthly, the court is concerned with the conduct of the patentee and not with the merit of the invention. 128    This has been endorsed in Singapore by the Court of Appeal inFE Global (CA), and applied inNovartis. In this respect, however, it is necessary to bear in mind the remarks of the Court of Appeal inFE Global (CA)at [31] on the “lenient approach” towards amendments. 129    In relation to the third factor,ie, whether the patentee delayed in seeking the amendments (and, if so, whether there were reasonable grounds for such delay), it was observed inNovartisat [10] that: In determining whether the court ought to exercise its discretion against the grant of leave to amend on ground of undue delay, it was held inMatbro Limited v Michigan (Great Britain) Limited[1973] RPC 823 at 833, lines 30-34 (“Matbro”) that: ... mere delay is not, of itself, necessarily sufficient to justify refusal of amendment. There must have been or be likely to be some detriment to the respondents or to the general public caused by such delay before it can be an effective bar to relief. Thus, where there is undue delay on the part of the plaintiff in applying to amend the patent specifications, the court may decide in the circumstances, to exercise its discretion against the grant of leave to amend. It has been accepted in the local case ofTrek Technology (Singapore) Pte Ltd v FE Global Electronics Pte Ltd[2005] 3 SLR(R) 389 at [76]-[77], by Lai Kew Chai J, that a patentee ought to act expeditiously from the time he discovers the relevant prior art. The patentee seeking leave to amend must satisfy the court, based on the facts and circumstances, that the patentee acted reasonably and without undue delay. It was held that mere knowledge of some prior art did not mean that the plaintiff ought to amend its patent, but was entitled to take the advice of patent agents on whether amendment was necessary, and if so, the form of amendment required. 130    Further, it was noted inNovartisat [48] that: At the end of the day, it must be emphasised that a patentee must act expeditiously in taking out an application to amend its patent claims upon discovering relevant prior art. Any delay in taking out an application to amend must be capable of explanation, and the patentee cannot persist in refusing to amend its patent specifications in an unamended and suspect form despite becoming aware of prior art. However, the court ought to bear in mind, as stated by the English High Court in the case ofMatbro([10]supraat 834 lines 5-16), that it is necessary to: ... draw a clear distinction between instances where a patentee knows of prior art which he genuinely, and quite properly in the circumstances, thinks is irrelevant, and other instances where, though he learns of or has been warned of objections which are available against his patent as a result of prior art, yet he takes no steps to put his specification right by way of amendment, or still worse, knowingly persists in retaining it in the unamended and suspect form. In the latter cases delay is culpable because potential defendants and the general public are entitled to plan their activities on the assumption that the patentee, though warned, has decided not to amend. If the patentee, by his conduct, lulls the public into a false sense of security he cannot thereafter be allowed to change his mind and ask for amendment, or at any rate without adequate protection being granted to the public. 131    It is also pertinent to consider the decision of Pumfrey J inInstance v CCL Label Inc[2002] FSR 27 (“Instance”). There, the patentee applied to amend claim 8 of its European patent in infringement proceedings. It was contended that the patentee knew or ought to have known that claim 8 was anticipated by prior art since the allegation had been made during the prosecution of the corresponding domestic British application. At around the same time, the patentee commenced infringement proceedings against various parties and sought a Europe-wide injunction. The patentee’s case was that he relied on the advice of his patent agent that claim 8 was not anticipated by prior art. Pumfrey J refused the amendments. He considered that a patentee could not normally be criticised for making decisions on the need to amend his patent on the basis of the advice received from a competent patent agent. In such a case, the patentee could not be considered as guilty of culpable delay. Even though the application to amend was made shortly after the patentee found out that claim 8 was invalid, Pumfrey J found that there was no satisfactory explanation for it. In addition, the infringement proceedings were commenced even though the patentee thought that amendment for claim 8 was required. As a result, Pumfrey J decided to refuse the patentee’s application to amend. 132    As for the fourth factor,ie, whether the patentee had sought to obtain an unfair advantage from the patent, Aldous J inSKF Laboratoriesconsidered at 569 that it encompasses a case “where a patentee threatens an infringer with his unamended patent after he knows or should have known of the need to amend”. InSKF Laboratories, Aldous J referred to,inter alia, the case ofAutoliv Development AB’s Patent[1988] RPC 425. In that case, the patentees knew that amendment was necessary to avoid prior art, but delayed amending their patent for four years, and in the meantime, sent out threatening letters to alleged infringers. Falconer J refused to allow the amendment. He found that the delay of four years was unreasonably long in light of the circumstances, and the sending out of the threatening letters after they knew that the patent should be amended would amount to seeking an unfair advantage. 133    To sum up, it is important to bear in mind the underlying rationale of the discretion to refuse an application to amend. This is well explained by Aldous LJ inKimberly-Clark Worldwide Inc v Procter & Gamble Limited and another[2000] FSR 235 at 248 as the “desire to protect the public against abuse of monopoly”. Pumfrey J inInstanceat [37] described it as “a desire to ensure that patentees do not obtain an advantage which is unfair from their failure to amend” and went further to consider that it may be “to punish patentees for the unreasonableness of their conduct even when no advantage has in fact been gained”. 134    With these principles in mind, I now turn to address the present case.",
        "Application to the facts": "135    For convenience, I shall set out the chronology of relevant events below: DateEvent5.5.10Plaintiff commenced infringement proceedings in S 315/2010[note: 125]10.11.10Plaintiff filed amendments for European Patent[note: 126]25.11.10Opposition Division of EPO found European Patent to be invalid[note: 127]26.11.10Plaintiff joined the second and third defendants in S 315/2010[note: 128]21.1.11Plaintiff filed notice of appeal with EPO[note: 129]21.10.11Plaintiff obtained search order against defendants of S 738/2011[note: 130]19.10.11Plaintiff commenced infringement proceedings in S 738/2011[note: 131]18.12.12Plaintiff filed statement of reasons[note: 132]28.12.1230.1.13Proposed Amendments published in Patents Journal[note: 133]17.2.14Quentin Loh J (“Loh J”) directed issue of amendment to be heard as preliminary issue[note: 134]   136    In light of these circumstances, the Defendants submit that this Court should not allow the Proposed Amendments given that: (a)     The Plaintiff has not disclosed all the relevant information with regard to the Proposed Amendments.[note: 135] (b)     The Plaintiff has no reasonable grounds for the delay in seeking the Proposed Amendments.[note: 136] (c)     The Plaintiff has obtained an unfair advantage from the delay in seeking the Proposed Amendments despite having reasonable grounds to believe that the 370 Patent is invalid.[note: 137] 137    The Plaintiff denies the Defendants’ allegations of delay and unfair advantage.[note: 138] Non-disclosure 138    The Defendants contend that the Plaintiff had not disclosed the relevant findings of the EPO that have a material impact on the circumstances surrounding these applications, as well as the evidence to explain the circumstances of its delay in filing these applications.[note: 139] 139    For a start, I note that, pursuant to the Convention of the Grant of European Patents (“the European Patent Convention”), the EPO would have, as it appears, no discretion over whether an amendment should be granted based on the conduct of the patentee. This is observed by Floyd J inZipher Ltd v Markem Systems Ltd[2009] FSR 1 at [197]–[219]: 197    For many years prior to the coming into force of the Patents Act 2004, courts and tribunals in this country have exercised a very wide discretion over whether to allow a party to amend the scope of the monopoly granted by a patent following its grant. ... ... 200    Following the United Kingdom’s ratification of the European Patent Convention and the passing of the Patents Act 1977, it was doubted in a number of first instance cases whether the discretion was consistent with the Treaty and the Act, at least when there were concurrent proceedings before the court and in the EPO. ... ... 205    Section 75, as it now stands, requires the court to “have regard to any relevant principles applicable under the European Patent Convention”. Accordingly, one should turn to the Convention to see what principles are applied to considering whether or not to allow amendments. ... 206    There is very little by way of express guidance in the European Patent Convention. ... ... 216Neither Art.105b nor the Implementing Regulations (rr.90–96) appear to give the EPO a discretion to reject a limitation request which complies with the formalities prescribed in r.92 and with Arts 84 and 123(2) and (3). 217    The position under the EPC would therefore appear to be that: i) in opposition proceedings, appropriateness of the amendments to the proceedings, their necessity and procedural fairness are the main, perhaps only, factors considered relevant to the discretion to allow amendment; ii) in central amendment proceedings, compliance with the procedural requirements gives rise to a right to have the patent limited in accordance with the request. 218    If a proper amendment is now brought forward in opposition proceedings in good time and which is necessary and appropriate to meeting the opposition, it seems inescapable that it will be allowed. It would, it seems to me, be an odd result if an amendment which would be available as of right under the central amendment procedure was refused simply because the patent was under opposition. Such a result would only be justified if either (a) the amendments would have no effect on the opposition and could accordingly be made after its conclusion if the patent survives or (b) procedural fairness to the opponents meant that it could not be considered. I appreciate that (b) might result in a patent being revoked before it could be amended: but if it were not so, the patentee could derail the proceedings by claiming the right to amend at the last moment. 219    I think what I have derived so far can fairly be described as the principles on which in future, if not in the past, the power to allow amendment will be exercised in the EPO under the EPC. It follows that if I am to have regard to the principles applicable under the EPC, the discretion which I have to refuse amendments which comply with the Act has been limited.Considerations such as those formerly considered relevant to the discretion, such as the conduct of the patentee, are no longer relevant. [emphasis added] 140    The learned authors ofTerrellat para 15-69 noted that Floyd J’s view “appears consistent with the policy intention as expressed in thetravaux preparatoires” of the European Patent Convention. 141    In light of this, it appears to me that the findings of the EPO on the issue of amendment would have no bearing on whether the discretion ought to be exercised in the present case. The Defendants have not shown otherwise. It follows that there appears to be no reason to find that the Plaintiff had failed to make full and frank disclosure on the findings of the EPO in relation to the issue of amendment. 142    As for the circumstances surrounding the alleged delay, it is not true that the Plaintiff had not adduced any evidence as the Defendants claim. In particular, the Plaintiff had called Detlef Von Ahsen (“Detlef”), who is the “overall coordinating counsel” for S 315/2010 and S 738/2011, to give evidence. The burden lies with the Plaintiff to show that the discretion should be exercised and the Plaintiff’s case would turn on the evidence it seeks to adduce. The Defendants undoubtedly take the view that Detlef’s evidence is inadequate. This does not mean, however, that this Court should draw an inference that the Plaintiff has failed to make full and frank disclosure. 143    I therefore do not find that the Plaintiff had failed to make full and frank disclosure. Undue delay 144    The Defendants contend that the Plaintiff knew that claim 1 of the 370 Patent, which corresponds with claim 1 of the European Patent, might be invalid as early as November 2010 when the decision of the Opposition Division was released.[note: 140]Notwithstanding that, the Plaintiff only published its intention to amend the 370 Patent on 28 December 2012 and 30 January 2013, more than two years later.[note: 141]The Defendants submit that there was no reasonable explanation for the delay.[note: 142]In response, the Plaintiff denies that there was a delay in applying to amend the 370 Patent, and submit that they were entitled to wait for the final outcome of the appeal in the EPO before deciding whether to amend the 370 Patent.[note: 143]The Plaintiff also explained that it had gone ahead with the amendment application before the release of the decision of the Appeals Board of the EPO as a result of Loh J’s directions for the issue of validity to be heard first.[note: 144] 145    Detlef accepts that the Plaintiff knew as of 25 November 2010 that the 370 Patent corresponds to the European Patent and the Opposition Division of the EPO had found the European Patent to be invalid.[note: 145]He also accepts that there was “a potential risk” that the Singapore court might come to the same view as the Opposition Division of the EPO.[note: 146]However, Detlef insists that he disagrees with the decision of the Opposition Division of the EPO,[note: 147]and in all likelihood, he would have advised the Plaintiff as such. Notwithstanding that, the Plaintiff eventually decided to amend the 370 Patentbeforethe decision of the Appeal Board of the EPO was released,[note: 148]contrary to the earlier view taken by Detlef and presumably the Plaintiff. Pertinently, it appears that the Plaintiff had decided to go ahead with the Proposed Amendments as a result of the decision of the Opposition Division of the EPO. This was precisely what Detlef said he did not agree with. The statement of reasons filed by the Plaintiff on 18 December 2012 reads:[note: 149] 20.    The amendments are to amend the claims in the Patent to correspond to allowed claims of the corresponding European patent application no. 03727334.9 (granted EP Patent No. EP 1534612 B1) which were deemed by the Opposition Division of the European Patent Office to distinguish over the following references, some of which have also been cited by the Defendant in the Particulars of Objection ... 146    This volte-face by the Plaintiff casts a serious doubt on the words of Detlef, and, unless adequately explained, it would suggest either (a) the Plaintiff, on the advice of Detlef, had never genuinely intended to wait for the decision of the Appeal Board of the EPO or (b) the Plaintiff had such serious concerns about the validity of the 370 Patent that it preferred to act contrary to Detlef’s advice. Detlef’s evidence is that the Plaintiff had decided to amend the 370 Patentbeforethe decision of the Appeal Board of the EPO was released, as originally intended, after having “assessed the strength of its chances of success in the corresponding European proceedings”.[note: 150]Nonetheless, on cross-examination, Detlef concedes that it was based on “gut feeling”.[note: 151]Detlef also testifies that it was triggered by Loh J’s direction for the issue of validity of the 370 Patent to be heard first.[note: 152]However, the records show otherwise. In fact, directions were only given by Loh J on 17 February 2014. This was more than a year after the Plaintiff had given notice of its intention to amend the 370 Patent. Even on the Plaintiff’s account (ie, 22 April 2013),[note: 153]it would have been several months later. For completeness, I should add that Loh J indicated to counsel on 3 May 2012 that he was minded to hear both issues of validity and infringement as preliminary issues; he did not say to hear the issue of validity first. In other words, Loh J’s direction could not have been, as suggested by Detlef, the “trigger” for the volte-face. In any event, even if that was true, it would appear that the Plaintiff was motivated to amend the 370 Patent when it found out that the issue of validity was going to be heard, and this must suggest that the Plaintiff was, contrary to Detlef’s evidence, doubtful of the validity of the 370 Patent. 147    I find no reasonable explanation for the Plaintiff’s delay in seeking to amend the 370 Patent. If it were true that the Plaintiff, on advice of Detlef, had genuinely considered that no amendment was necessary, then it is difficult to see why the Plaintiff eventually decided to proceed with the amendment of the 370 Patent. As shown above at [146], Detlef could not point to anything that would justify the change in the Plaintiff’s view. The proper inference to be drawn from the evidence before me is that Detlef’s explanation that the Plaintiff was waiting for the final outcome of the appeal in the EPO before deciding whether to amend the 370 Patent was purely an afterthought. It follows that there is no reasonable explanation for the delay. 148    The Singapore cases ofNovartisandFE Global (HC)where the patentee had been allowed to amend their patents can be distinguished from the present case. InNovartis, the plaintiffs genuinely believed that they would prevail before the EPO in 2006 and therefore did not amend the Singapore patent. Later, in 2009, when the EPO proceedings raised prior art which necessitated an application to amend the European patent, the Court found that it was “perfectly reasonable” for the plaintiffs to proceed with the amendment in Europe, and then apply in Singapore “after obtaining the ruling upon its amendment application, when the necessity arose”. This is different from the present case where the Plaintiff had sought andobtainedthe amendments to the European Patent as early as 10 November 2010, but having done so, took no steps to amend the corresponding 370 Patent in Singapore. It is also apparent that the Plaintiff did not genuinely think that they would prevail without the amendments to the 370 Patent for they would have otherwise proceeded without applying for the Proposed Amendments. Further,FE Global (HC)can also be distinguished on the facts. There, the delay was justified by the time taken for the consultation with the patent agents from the various jurisdictions. That was not the case here. 149    Accordingly, I find that there was an undue delay on the part of the Plaintiff in applying to amend the 370 Patent despite having reasonable grounds to believe that it might be anticipated by prior art. Unfair advantage 150    The Defendants claim that the Plaintiff had obtained an unfair advantage in S 738/2011 by litigating on the basis of a patent which it knew had a risk of being invalidated in light of the prior art cited against it.[note: 154] 151    As discussed earlier, the Plaintiff knew since 10 November 2010 that the European Patent, which corresponds to the 370 Patent, might be anticipated by prior art and sought to avoid invalidity by making amendments to its claims. On 25 November 2010, the Opposition Division of the EPO found the European Patent to be invalid, notwithstanding the amendments. In light of these developments, the Plaintiff proceeded on the very next day to join the second and third defendants in S 315/2010. The Plaintiff commenced infringement proceedings against the defendants in S 738/2011 on or about 19 October 2011.[note: 155]On 21 October 2011, the Plaintiff obtained anex partesearch order on the basis of alleged infringement of the 370 Patent.[note: 156]The search order was eventually set aside for the Plaintiff’s failure to give full and frank disclosure.[note: 157]The affidavit filed in support of the search order did not state that amendments had been made to the corresponding European Patent which was eventually found to be invalid.[note: 158]According to the Defendants, the Plaintiff had commenced infringement proceedings and obtained the search order despite knowing that there was a risk that the 370 Patent might be invalid. 152    The Plaintiff, on the other hand, gives four reasons why it had not obtained or sought to obtain any unfair advantage: (a)     First, the Plaintiff denies that it knows or ought to know that the 370 Patent should be amended and claims that it was entitled to presume that the 370 Patent was valid given that it was granted pursuant to a rigorous search and examination process.[note: 159] (b)     Second, the Plaintiff is entitled to wait for the decision of the Appeal Board of the EPO with regard to the European Patent, while at the same time take immediate action against the defendants in S 738/2011 for infringement of the 370 Patent.[note: 160] (c)     Third, the Plaintiff filed the application to amend the 370 Patent in order to correspond to the allowed claims of the corresponding European Patent and not to overcome any piece of prior art.[note: 161] (d)     Fourth, the Plaintiff did not obtain or seek to obtain any unfair advantage in enforcing the search order in 2011 as the automatic twistlocks seized from the defendants in S 738/2011 would still fall within the claims of the 370 Patent even after the Proposed Amendments.[note: 162] 153    However, the Plaintiff’s reasons do not hold water. I begin with the third reason. The Plaintiff claims that it “remains convinced” that the 370 Patent is valid and had applied to amend the 370 Patent out of an abundance of caution.[note: 163]The Plaintiff adds that the Proposed Amendments were not to overcome any piece of prior art.[note: 164]However, this explanation rings hollow in light of the statement of reasons filed in support of the application, which states:[note: 165] 20.    The amendments are to amend the claims in the Patent to correspond to allowed claims of the corresponding European patent application no. 03727334.9 (granted EP Patent No. EP 1534612 B1) which were deemed by the Opposition Division of the European Patent Office to distinguish over the following references,some of which have also been cited by the Defendant in the Particulars of Objection... [emphasis added] It is apparent that the real reason behind why the Plaintiff had decided to amend the 370 Patent to correspond with the European Patent was because similar prior art had been cited against the 370 Patent. 154    This leads us to the first and second reasons. The statement of reasons clearly indicates that the Plaintiff had doubts as to the validity of the 370 Patent. This is plainly inconsistent with the Plaintiff’s assertion that it was convinced that the 370 Patent was valid. As mentioned earlier, the Plaintiff’s claim that it was waiting for the decision of the Appeal Board of the EPO was merely an afterthought. If the Plaintiff was genuinely confident about the validity of the 370 Patent as a result of the search and examination report as well as Detlef’s advice, then there would be no reason for the Plaintiff to amend the 370 Patent to narrow the scope of the claims. 155    As for the fourth reason, I find the Plaintiff’s explanation to be misconceived. It should be borne in mind that the inquiry concerns the conduct of the patentee and not the merits of the patent. As stated earlier ([151] above), the Plaintiff knew, at the time the affidavit in support of the search order was made, that the corresponding European Patent had been found to be invalid notwithstanding the amendments. On this basis, the Plaintiff must have known that there was a risk that the 370 Patent, like the corresponding European Patent, might be found to be invalid as well. Despite that, the Plaintiff commenced proceedings and obtained a search order against the defendants in S 738/2011 on the basis of the 370 Patent. The Plaintiff is, in essence, asserting that the 370 Patent is a valid one, even though it has reasons to believe that it might not be. In fact, the Plaintiff’s concerns were strong enough for it to decide to amend the 370 Patent even though (a) Detlef was of the strong view that the EPO was wrong and (b) the search and examination report suggested that the 370 Patent was valid. The Plaintiff’s actions under these circumstances could be considered as covetous conduct. In any event, Pumfrey J inInstanceat [37] accepted that the rationale of the discretion may extend “to punish patentees for the unreasonableness of their conducteven when no advantage has in fact been gained”. This is certainly one of those cases which would warrant the refusal to exercise the discretion to allow the amendments. 156    I find that the undue delay was aggravated by the fact that the Plaintiff had sought to obtain unfair advantage from the 370 Patent which it knows should be amended to avoid prior art. Therefore, even if the requirements under the Patents Act are met, I would have exercised the discretion under s 83(1) of the Patents Act to refuse amendment.",
        "Conclusion": "157    For the foregoing reasons, I dismiss SUM 2455/2013 and SUM 2458/2013. 158    I will hear counsel on the issue of costs.  [note: 1]Bundle of defendant’s AEIC (“DA”), Tab 2 at para 5 and MS-2; Bundle of plaintiff’s AEIC (“PA”), Tab 4 at para 4. [note: 2]DA, Tab 2 at para 18. [note: 3]DA, Tab 2 at para 19. [note: 4]DA, Tab 2 at para 5; PA, Tab 4 at para 6. [note: 5]DA, Tab 2 at para 7; PA, Tab 4 at para 6. [note: 6]DA, Tab 2 at para 8; PA, Tab 4 at para 6. [note: 7]DA, Tab 2 at para 9. [note: 8]DA, Tab 2 at para 11; PA, Tab 4 at para 7. [note: 9]DA, Tab 2 at para 11. [note: 10]DA, Tab 2 at para 12; PA, Tab 4 at para 8. [note: 11]DA, Tab 2 at para 13; PA, Tab 4 at para 9. [note: 12]DA, Tab 2 at para 14; PA, Tab 4 at para 11. [note: 13]AB 222–224. [note: 14]PA, Tab 4 at para 20. See also Plaintiff’s written submissions (“PWS”) at para 4. [note: 15]NE, 30.10.14, p 4 line 23; p 15 line 1. [note: 16]NE, 30.10.14, p 14 line 21p 15 line 1. [note: 17]NE, 30.10.14, p 5 line 4. [note: 18]DA, Tab 2 at para 15. [note: 19]Defendant’s written submissions (“DWS”) at para 13. [note: 20]DWS at paras 15–24. [note: 21]DWS at para 14. [note: 22]PWS at para 9. [note: 23]DWS at para 22. [note: 24]DWS at para 21. [note: 25]DWS at para 17. [note: 26]DWS at para 18. [note: 27]PWS at para 6; NE, 30.10.14, p 9 line 18; NE, 31.10.14, p 2 line 14; p 2 line 21. [note: 28]NE, 30.10.14, p 5 line 4. [note: 29]NE, 30.10.14, p 86 line 11; p 86 line 24; p 87 line 13. [note: 30]DWS at para 47. [note: 31]DA, Tab 1, EOM-2 at p 46. [note: 32]DA, Tab 1, EOM-2 at p 53. [note: 33]DA, Tab 1, EOM-2 at p 303. [note: 34]AB 200. [note: 35]DWS at para 49. [note: 36]PWS at paras 81–82. [note: 37]DWS at paras 50–51. [note: 38]DWS at para 49. [note: 39]DWS at para 52. [note: 40]PWS at para 81. [note: 41]PWS at para 81. See AB 153154. [note: 42]AB 166. [note: 43]AB 222. [note: 44]AB 222. [note: 45]PWS at para 8081 [note: 46]AB 166. [note: 47]DA, Tab 1, EOM-2 at para 89(c). [note: 48]DWS at para 65. [note: 49]DWS at para 73. [note: 50]DWS at para 76; DA, Tab 1, EOM-2 at paras 124–126. [note: 51]DA, Tab 4, EOM-3 at p 11. [note: 52]NE, 31.10.14, p 40 line 23. [note: 53]NE, 31.10.14, p 11 line 16; p 12 line 20; p 36 line 16. [note: 54]NE, 31.10.14, p 11 line 16; p 12 line 14. [note: 55]NE, 31.10.14, p 22 line 13; p 23 line 1; p 57 line 17. [note: 56]DWS at para 75. [note: 57]DA, Tab 1, EOM-2 at p 75. [note: 58]NE, 31.10.14, p 43 line 20. [note: 59]NE, 31.10.14, p 45 line 22. [note: 60]PA, Tab 3 para 9. [note: 61]DWS at paras 89 and 91. [note: 62]PWS at para 101. [note: 63]PWS at para 99. [note: 64]DWS at para 84. [note: 65]DWS at para 84; AB 184. [note: 66]DWS at para 85. [note: 67]AB 183. [note: 68]AB 192. [note: 69]DWS at para 93. [note: 70]DWS at para 93; DA, Tab 1, EOM-2 at p 82. [note: 71]DWS at para 94; DA, Tab 1, EOM-2 at paras 138–140. [note: 72]DA, Tab 1, EOM-2 at p 48. [note: 73]DWS at para 99. [note: 74]PWS at paras 88–89. [note: 75]DA, Tab 1, EOM-2 at para 142. See also NE, 31.10.14, p 91 line 1; p 91 line 22. [note: 76]DA, Tab 4, EOM-3 at paras 3036. [note: 77]DA, Tab 4, EOM-3 at paras 32–33. [note: 78]NE, 31.10.14, p 91 lines 4 – 21. [note: 79]DWS at para 101. [note: 80]DWS at para 102. [note: 81]PA, Tab 2 at pp 15–16 (4.2). [note: 82]NE, 31.10.14, p 92 line 6. [note: 83]NE, 31.10.14, p 94 line 8. [note: 84]DWS at para 107. See also NE, 31.10.14, p 95 line19; p 96 line 1. [note: 85]DWS at para 108. [note: 86]DWS at para 108. [note: 87]AB 158. [note: 88]NE, 31.10.14, p 88 line 20 – p 89 line 10. [note: 89]DA, Tab 4 at para 34. [note: 90]DWS at para 110. [note: 91]AB 188. [note: 92]AB 182–189, 192–195. [note: 93]DWS at para 92. [note: 94]AB 164. [note: 95]AB 171. [note: 96]DWS at paras 128–129. [note: 97]DWS at para 129. [note: 98]PWS at paras 94–95. See also NE, 31.10.14, p 100 line 7. [note: 99]DA, Tab 1, EOM-2 at para 148; DA, Tab 4, EOM-3 at paras 47–49; NE, 31.10.14, p 105 line 20; p 106 line 16. [note: 100]PA, Tab 2 at p 17 (5.2). See also NE, 31.10.14, p 100 line 18; p 103 line 11. [note: 101]AB 150, 158. [note: 102]DWS at paras 131–132. [note: 103]DWS at paras 131–132. [note: 104]DWS at paras 135–139. [note: 105]DWS at paras 136–139. [note: 106]NE, 31.10.14, p 114 line 8. [note: 107]DA, Tab 1, EOM-2 at para 161; NE, 31.10.14, p 112 line 22. [note: 108]NE, 31.10.14, p 113 line 21. [note: 109]DWS at para 140. [note: 110]DWS at paras 142–152. [note: 111]DWS at para 143. [note: 112]DWS at paras 141 and 146. [note: 113]PWS at para 96. [note: 114]DWS at para 143. [note: 115]NE, 31.10.14, p 119 line 13. [note: 116]AB 158–159. [note: 117]NE, 31.10.14, p 121 line 18. [note: 118]NE, 31.10.14, p 122 line 9. [note: 119]NE, 31.10.14, p 122 line 17. [note: 120]NE, 31.10.14, p 124 line 4. [note: 121]NE, 31.10.14, p 125 line 11. [note: 122]DWS at para 150. [note: 123]DWS at paras 151–152. [note: 124]DWS at para 151. [note: 125]DA, Tab 2 at para 5; PA, Tab 4 at para 6. [note: 126]NE, 30.10.14, p 14 line 21. [note: 127]DA, Tab 2 at para 29. [note: 128]DA, Tab 2 at para 7; PA, Tab 4 at para 6. [note: 129]PA, Tab 1 at para 8. [note: 130]DA, Tab 2 at para 33. [note: 131]PA, Tab 4 at para 7. [note: 132]DA, Tab 2 at para 12. [note: 133]DA, Tab 2 at para 14; PA, Tab 4 at para 11. [note: 134]DA, Tab 2 at para 16. [note: 135]DWS at paras 155–156. [note: 136]DWS at paras 157–170. [note: 137]DWS at paras 171–178. [note: 138]PWS at paras 105–135. [note: 139]DWS at paras 155–156. [note: 140]DWS at para 161. [note: 141]DA, Tab 2 at para 14; PA, Tab 4 at para 11. [note: 142]DWS at para 167. [note: 143]PWS at para 115. [note: 144]PWS at para 114. [note: 145]NE, 30.10.14, p 43 line 17. [note: 146]NE, 30.10.14, p 59 line 9. [note: 147]NE, 30.10.14, p 42 line 24; p 44 line 11; p 48 line 8; p 57 line 1. [note: 148]NE, 30.10.14, p 73 line 9. [note: 149]AB 84, 92. [note: 150]PA, Tab 1 at para 11. [note: 151]NE, 30.10.14, p 78 line 1. [note: 152]NE, 30.10.14, p 73 line 16; p 78 line 14. [note: 153]PWS at para 114. [note: 154]DWS at para 178. [note: 155]PA, Tab 4 at para 7. [note: 156]DA, Tab 2 at para 33. [note: 157]DA, Tab 2 at para 33. [note: 158]NE, 30.10.14, p 67 line 6; p 67 line 16; p 69 line 1. [note: 159]PWS at paras 120–121. [note: 160]PWS at para 122. [note: 161]PWS at paras 123–124. [note: 162]PWS at para 125. [note: 163]PWS at para 124. [note: 164]PWS at para 124. [note: 165]AB 84, 92."
    }
}