{
    "case_title": "Chan Siew Lee Jannie\n      v\n      Australia and New Zealand Banking Group Ltd",
    "ncitation": "[2015] SGHC 157",
    "coram": "Kan Ting Chiu SJ",
    "sections": {
        "Background": "1       The Plaintiff, Jannie Chan Siew Lee (“the\n                    Plaintiff”), is a debtor to the Defendant, Australia and New Zealand\n                    Banking Corporation Group Limited (“the Defendant”). The Defendant\n                    is a bank incorporated in Australia. The Defendant had, in the course of its\n                    business, made a loan (“the loan’) to Timor Global LDA\n                    (“TGL”), a company incorporated in Timor-Leste. Pursuant to the\n                    terms of the loan, TGL pledged its assets to the Defendant. The Plaintiff is a\n                    shareholder and director of TGL and she executed a personal guarantee with the\n                    other directors of TGL in favour of the Defendant. 2       TGL defaulted on the loan and the Defendant\n                    commenced legal action against the guarantors and obtained judgment against the\n                    Plaintiff. When the Plaintiff did not satisfy the judgment, the Defendant served\n                    a Statutory Demand (“SD”) issued under r 94 of the Bankruptcy\n                    Rules (Cap 20, R 1, 2006 Rev Ed) (“BR”) on the Plaintiff on 15\n                    October 2014. On 8 January 2015, the Plaintiff instituted these proceedings\n                    against the Defendant to obtain an extension in time for her to apply to set\n                    aside the SD under r 97 of the BR and to set aside the SD under r 98 of the BR.\n                    I dismissed both applications.",
        "The grounds for the application": "3       The Plaintiff’s case was that the SD\n                    should be set aside as it was defective because the security offered by TGL was\n                    not listed in the SD. Her explanation for not filing the application to set\n                    aside the SD on time was that she had been negotiating with the Defendant\n                    through her solicitors for the Defendant to forebear from presenting a\n                    bankruptcy petition against her. However, the negotiations broke down on 7\n                    January 2015, and she filed the application on the following day. As the main\n                    focus of the submissions from the parties was whether the SD should be set\n                    aside, I dealt with this issue first.",
        "Setting aside the SD": "4       The application is grounded on rr 94(5) and\n                    98(2) of the BR. They read as follows: 94(5) If the creditor\n                            holds any property of the debtor orany security for\n                                the debt, there shall be specified in the demand\n                            — (a) the full amount of the debt; and (b) the nature and value of the security or the assets. … 98(2) The court shall\n                            set aside the statutory demand if — … (c)    it appears that the creditor holds assets of\n                                the debtor orsecurity in respect of the\n                                    debtclaimed by the demand, and either rule 94(5) has\n                                not been complied with, or the court is satisfied that the value of\n                                the assets or security is equivalent to or exceeds the full amount\n                                of the debt … [emphasis added] 5       Mr Thuraisingam, counsel for the Plaintiff,\n                    contended that the word “security” in the phrases in italics\n                    refers to all security held by the creditor in relation to the debt (“the\n                    all-security construction”). The Defendant took the position that the\n                    word “security” refers only to security provided by the debtor to\n                    whom the SD was issued (“the debtor’s-security\n                    construction”). This issue arose because the assets pledged by TGL were\n                    not specified in the SD. 6       The proper meaning of “security”\n                    in rr 94(5) and 98(2) had been dealt with and settled in two cases, namely,Re Loh Lee Keow and another, ex parte Keppel TatLee Bank\n                        Ltd[2000] 3 SLR(R) 283 (“Re Low Lee\n                        Keow”) andSia Leng Yuen v HKR\n                        Properties Ltd[2001] 3 SLR(R) 587 (“Sia Leng Yuen”). InRe Loh Lee\n                        Keow, Woo Bih Li JC (as he then was) undertook a careful analysis\n                    of rr 94(5), 98(2)(c), 101(2), and Form 2 of the BR, and ss 63(1) and (2) of the\n                    Bankruptcy Act (Cap 20, 2000 Rev Ed) (“BA”). His conclusion was\n                    that the word “security” in rr 94(5) and 98(2) means security on\n                    the property of the debtor in the bankruptcy proceedings. He explained (at [33])\n                    that: It does not make sense that while the creditor’s petition does not\n                        have to mention a security on the property of a third party, the court\n                        should be obliged to take the third party’s security into account in\n                        deciding whether to make a bankruptcy order on hearing the petition. 7       InSia Leng Yuen,\n                    Lee Seiu Kin JC (as he then was) was urged to find thatRe\n                        Loh Lee Keowwas wrongly decided and that the security offered by\n                    parties other than the debtor who was the subject of the bankruptcy proceedings\n                    had to be disclosed and taken into account in an SD. Lee JC declined to do that,\n                    and agreed with Woo JC’s construction because “in a very\n                    tightly-argued judgment, the judge had demonstrated that the view which he held\n                    was the only one possible.” 8       Rule 98(2)(c) is not unique to Singapore. It is\n                    virtually identical to r 6.5(4)(c) of the Insolvency Rules 1986 (SI 1986 No\n                    1925) (UK), which provides that a court may set a statutory demand aside\n                    if: [I]t appears that the creditor holds some security in respect of the debt\n                        claimed by the demand, and either Rule 6.1(5) is not complied with in\n                        respect of it, or the court is satisfied that the value of the security\n                        equals or exceeds the full amount of the debt … 9       InWhite v Davenham Trust\n                        Ltd[2011] EWCA Civ 747 (“White v\n                        Davenham”), the English Court of Appeal held that the\n                    security contemplated by r 6.5(4)(c)was the\n                    security provided by the debtor. Lloyd LJ, in delivering the judgment of the\n                    Court, explained at [35] that: … If… the security which the creditor holds is given not by\n                        the particular debtor but by a third party, whoever that third party may be,\n                        that security is not over an asset which can have any effect on the bankrupt\n                        estate of the particular debtor and it is accordingly irrelevant for the\n                        purposes of rule 6.1(5) and correspondingly for the purposes of rule\n                        6.5(4)(c). … 10     Mr Thuraisingam, however, disagreed. He\n                    contended that Woo JC was wrong in two ways and Lee JC was also wrong for\n                    agreeing with him as: (a)     Woo JC had failed to identify the\n                        objects underlying the BA and the BR and failed to take a purposive\n                        interpretation of them when determining the meaning of “\n                        security”; and (b)     Woo JC had failed to give adequate weight to the “unfair\n                        consequence” of applying the debtor’s-security construction in\n                        that a guarantor can end up being in worse-off than the principal because,\n                        if both the guarantor and the borrower came under the bankruptcy regime, the\n                        creditor has to take into account the assets pledged by the borrower in\n                        bankruptcy proceedings against the borrower but does not have to do that in\n                        bankruptcy proceedings against the guarantor. 11     If Mr Thuraisingam had given proper\n                    consideration to Lloyd LJ’s explanation quoted in [9] above, he would have\n                    realised that the debtor’s-security construction is not unfair because if\n                    the positions were reversed and the guarantor had provided the security, the\n                    security would not be taken into account in bankruptcy proceedings against the\n                    borrower. 12     Mr Thuraisingam referred to and relied on s\n                    9A(1) of the Interpretation Act (Cap 1, 2002 Rev Ed (“IA”)), which\n                    stipulates that: In the interpretation of a provision of a written law, an interpretation\n                        that would promote the purpose or object underlying the written law (whether\n                        that purpose or object is expressly stated in the written law or not) shall\n                        be preferred to an interpretation that would not promote that purpose or\n                        object. Mr Thuraisingam then referred toDorsey James\n                        Michael v World Sport Group Pte Ltd[2013] 3 SLR 354, in which\n                    the Court of Appeal confirmed at [18] that the purposive approach mandated by s\n                    9A(1) takes precedence over any other common law principle of statutory\n                    interpretation, and argued that the “overarching object” of the BA\n                    and BR is to give debtors “an opportunity to make a fresh start in their\n                    financial matters while recognizing the rights of the creditors.”\n                    However, he did not provide any support for that construction. 13     The Defendant, on the other hand, contended\n                    that Parliament’s intention was to arrive at a proper balance between the\n                    interests of the debtor, the creditor and society in bankruptcy proceedings. The\n                    Defendant referred to the speech of Minister of Law Prof S Jayakumar at the\n                    Second Reading of the Bankruptcy Bill (Bill 16 of 1994) in the lead up to the\n                    enactment of the BA (Singapore Parliamentary\n                        Debates,Official Report(25 August\n                    1994) vol 63 at col 399) where he said that the proposed act was intended\n                    to: … improve administration of the affairs of bankrupts and protect\n                        creditors’ interests without stifling entrepreneurship. We will strike\n                        a balance between the interest of the debtor, the creditor and society.\n                        There will be greater accountability of bankrupts in the administration of\n                        their estates on the one hand, and speedier discharge of bankrupts on the\n                        other. 14     More recently, Senior Minister of State for\n                    Law Assoc Prof Ho Peng Kee said at the Second Reading of the Bankruptcy\n                    (Amendment) Bill 2008 (Bill 39 of 2008) (Singapore\n                        Parliamentary Debates,Official\n                        Report(19 January 2009) vol 85 at col 1144) that: In 1995, we enacted the present Bankruptcy Act to protect creditor\n                        interests without stifling entrepreneurship and enterprise, and to improve\n                        the administration of the affairs of bankrupts. 15     Such statements may be taken into\n                    consideration in the interpretation of statutory provisions pursuant to ss\n                        9A(3)(c) and (d)\n                    of the IA. The two statements quoted, which are the clearest expressions of the\n                    intent and purpose of the BA available, must be given due\n                consideration. 16     It hardly needs saying that the correctness of\n                    a purported purposive interpretation of a written law is only as good as the\n                    correctness of the identification of the purpose or object of that law. While\n                    the bankrupts’ recovery of their financial status is one of the objects of\n                    the BA, it is not the overarching object. The BA aims to balance and protect the\n                    interests of debtors, bankrupts, creditors and society. A construction that\n                    enables the debtor to rely on security which he has not provided, but has been\n                    provided by another party, to lower his indebtedness does not promote a proper\n                    balance of the interests of the debtor, the party which provided the security,\n                    and the creditor. This is a major flaw in Mr Thuraisingam’s reading of the\n                    purpose and object of the BA and BR. 17     The all-security construction proposed by Mr\n                    Thuraisingam runs into further difficulty in the face of the judicial finding\n                    that it does not make sense when examined against the provisions of the BA and\n                    BR (Re Loh Lee Keowat [33]) and that the\n                    debtor’s-security construction was the only possible construction\n                        (Sia Leng Yuenat [9]). There must be strong\n                    and compelling reasons for a statutory rule to be given a construction which is\n                    at variance with the provisions of its parent legislation, and there are no such\n                    reasons here. Mr Thuraisingam’s argument ignores the clear logic behind\n                    the debtor’s-security construction set out at [6] and [9]\n                above. 18     Next, I addressed the complaint that Woo JC\n                    did not give proper consideration to the fact that the construction he adopted\n                    was unfair in that it put the Plaintiff in a less favourable position than TGL.\n                    InRe Loh Lee Keowat [35], Woo JC noted that\n                    while it may seem unfair, that was clearly the intention of the legislation. Woo\n                    JC’s construction is consistent with the Minister’s statement that\n                    the legislation was intended to strike a balance between the interests of the\n                    debtor, the creditor, and society. Rules which ensure that assets pledged to\n                    creditors to secure loans are reserved to reduce the pledgors’\n                    indebtedness, and not the indebtedness of other parties would reflect such a\n                    balance. While a party in the Plaintiff’s position may consider that to be\n                    unfair, it is really not unfair that a debtor is not permitted to rely on\n                    security put up by another party. In any event, the legislature is empowered to\n                    protect pledgors’ assets in that way, and Woo JC was right to accept and\n                    uphold that. Consequently, I reject the Plaintiff’s two grounds for\n                    setting aside the SD.",
        "The application to extend time": "19     Rule 97(1)(a) of\n                    the BR states that an application to set aside SD may be made within 14 days\n                    from the date the SD is served. As the SD was served on the Plaintiff on 15\n                    October 2014, the application should have been made by 30 October 2014. That\n                    being the case, the Plaintiff was 70 days late when she filed her application on\n                    8 January 2015. 20     The Plaintiff deposed in her supporting\n                    affidavit to her application that: 10    The main reason why I had not applied to set aside\n                            the Statutory Demand earlier was because my solicitors, M/s Eugene\n                            Thuraisingam, have been in without prejudice negotiations with the\n                            Creditor’s solicitors, M/s WongPartnership LLP, with a view of the\n                            Creditor forbearing to present a bankruptcy petition against\n                        me. 11    Unfortunately, these negotiations broke down on 7\n                            January 2014 and I have immediately taken steps to set aside the\n                            Statutory Demand … There were no other reasons offered for the delay. 21     The Plaintiff can apply for an extension of\n                    time to apply to set aside the SD. Rule 97(3) provides that: The court may, upon the application of the debtor, allow the debtor an\n                        extension of time to make his application to set aside the statutory\n                        demand. 22     The BR do not provide any guidelines for the\n                    exercise of the court’s discretion, and there is no reported decision on\n                    this provision. However, I considered this question inRafat\n                        Ali Rizvi v Ing Bank Hong Kong Branch[2011] SGHC 114 and held at\n                    [32] that: Rule 97(1)(a) provides that the application was to be filed within 14 days from the service of the statutory demand. Rule\n                        97(3) empowers a court to extend the period the period. When an application\n                        is made for an extension of time, a court would have to take into\n                        consideration: (a) the period of the delay; (b) the reasons for the delay; (c) the grounds for setting aside the statutory demand; and (d) the prejudice that may result from an extension of time; but the weightage of each factor has to be determined on the facts. 23     I took the same approach here. A delay of 70\n                    days was substantial as the application should have been made within 14 days.\n                    The reason for the delay was unsatisfactory because there was no agreement that\n                    there would be no need to apply to set aside the SD while negotiations were\n                    on-going. The grounds for setting aside the SD were, for the reasons given in\n                    the foregoing paragraphs, unsound. While it appeared that little or no prejudice\n                    would result if time were extended, I placed greater weight on factors (a), (b)\n                    and (c), and found that the Plaintiff had not made out a case for time to be\n                    extended.",
        "Conclusion": "24     The Plaintiff’s applications were\n                    dismissed with costs fixed at $3000 plus reasonable disbursements to be paid by\n                    the Plaintiff to the Defendant."
    }
}