{
    "case_title": "Soh Lay Lian Cherlyn\n      v\n      Kok Mui Eng",
    "ncitation": "[2015] SGHC 196",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "The facts": "3       The Accident occurred at about 12.15pm–12.25pm at the traffic light controlled junction of Havelock Road, Clemenceau Avenue and Upper Cross Street (“the Junction”). The Plaintiff was then at the wheel of vehicle no SFU9453K (“the Plaintiff’s vehicle”) while the Defendant was driving vehicle no SJT5369E (“the Defendant’s vehicle”). When the green turning arrow came on in the Defendant’s favour, the Defendant’s vehicle made a right turn from Upper Cross Street into Clemenceau Avenue. At the same time, the Plaintiff’s car coming from Havelock Road in the opposite direction (travelling in the extreme left lane) crossed the Junction with the result that the Defendant’s vehicle collided into the Plaintiff’s car on its right side. 4       On 5 January 2011, the Plaintiff pleaded guilty to a charge of inconsiderate driving under s 65(a) of the Road Traffic Act (Cap 276, 2004 Rev Ed) (“the RTA”) and was fined $800.00 as well as disqualified from driving for two months. 5       On 21 March 2011, the Defendant commenced Suit No 189 of 2011 (“the Defendant’s suit”) against the Plaintiff claiming damages for personal injuries and loss arising out of the Accident. Following negotiations between the parties’ motor insurers (who had conduct of the Defendant’s suit), the proceedings were settled between the parties on the basis of 90%-10% liability on the part of the Plaintiff and Defendant respectively. On 14 February 2012, consent interlocutory judgment (“the Consent Judgment”) was entered in favour of the Defendant on the basis of the Plaintiff bearing 90% liability for the Accident. On 1 July 2013, the Defendant obtained final judgment against the Plaintiff by consent in the global sum of $82,000; there was no apportionment of liability for the Accident in the final judgment. 6       On 31 August 2012, the Plaintiff commenced DC Suit No 2484 of 2012 (“the Plaintiff’s suit”) against the Defendant seeking compensation for injuries sustained by the Plaintiff arising out of the Accident. The Plaintiff did not, in her statement of claim refer to the Consent Judgment. 7       The Plaintiff’s suit was bifurcated and trial on liability took place on 26 June 2014. At the conclusion of the trial, the district judge felt he was bound by the High Court’s decision inJaidin’scase. He opined that the Consent Judgment in the Defendant’s suit operated to bind the Defendant (as the Plaintiff had submitted) and the Defendant was therefore held to be 10% liable for the Accident.",
        "The issues": "8       The issues this court had to determine at the Appeal hearing were: (a)     whether the principles inJaidin’scase apply to the Plaintiff’s suit; (b)     whetherres judicata(as the court below held) precludes the Defendant from denying she was 10% liable for the Accident. 9       Counsel for the Defendant had submitted to this court that: (a)Jaidin’scase was wrongly decided; (b)Jaidin’scase was distinguishable from the facts of this case; and (c)     ifres judicatawas indeed to apply, then the Plaintiff’s claim should no longer be sustainable once final judgment had been entered in the Defendant’s suit.",
        "Jaidin’scase": "10     At this juncture, it would be appropriate to refer toJaidin’scase. In that case, the plaintiff was a pillion rider on a motorcycle which collided with a car. Both the motorcyclist and pillion rider were injured. The pillion rider claimed damages from both the motorcyclist and the driver for injuries sustained from the accident. However, the motorcyclist had earlier filed a claim against the driver in the District Court in respect of the same accident; that claim proceeded for court dispute resolution where the settlement judge indicated preliminary liability apportionment to be 80% as against the driver. The issue inJaidin’scase, therefore, was whether the consent judgment between the driver and motorcyclist wasres judicataor whether apportionment could be determined afresh. At [4], the High Court held: The relevant principle ofres judicatain this suit is issue estoppel … InLee Tat Development Pte Ltd v MSCT Plan No 301[2005] 3 SLR (R) 157 (“Lee Tat”) at [14]–[15], the Court of Appeal held that the following requirements are necessary to establish issue estoppel: (a)    there must be a final and conclusive judgment on the merits; (b)    the judgment must be by a court of competent jurisdiction; (c)    there must be identity between the parties to the two actions that are being compared; and (d)    there must be an identity of the subject matter in the two proceedings. 11     As stated earlier at [7], the court below held it was bound by the decision inJaidin’scase and awarded judgment at 10% liability in favour of the Plaintiff against the Defendant, on the basisres judicataapplied to preclude the Defendant from raising any fresh defences to defeat the Plaintiff’s suit. As stated at [2], this court declined to followJaidin’scase. This is because two of the four requirements inLee Tatto found issue estoppel were missing—there was neither a final and conclusive judgment on the merits nor identity of parties. The pillion-rider/plaintiff inJaidin’scase was not involved in, and was not a party to, the suit or the settlement agreement between the motorcyclist and the car driver. 12     The court inJaidin’scase had failed to give due regard to the Court of Appeal’s pronouncement inLee Tat Development Pte Ltd v Management Corporation Strata Title Plan No 301[2009] 1 SLR(R) 875 on what constitutes issue estoppel. The appellate court there said (at [82]); … It must be remembered that the doctrine of issue estoppel is predicated upon (inter alia) the basis that the issue which is said to be the subject matter of the estoppelhas been decided on the merits.To hold that issue estoppel applies to an issue which has never been decided on the merits is not only a contradiction of the legal basis underlying the doctrine of issue estoppel, but also a travesty of justice and a denial of the right to be heard that is fundamental to the legal process. In our view, where the issue which is said to be the subject matter of the alleged estoppel has not in fact been decided on the merits, this factor alone entails that issue estoppel should not apply. … [emphasis in original]",
        "The evidence": "13     It is clear from the facts here that the Defendant’s suit was not concluded with a judgment that was made on the merits of the case. That suit never proceeded to trial as the counsel for the parties’ insurers settled the claim by negotiation, including the consent final judgment for $82,000 where no mention was made of any apportionment of liability. As counsel for the Defendant pointed out in his submissions, there are any number of reasons why insurers for motor accident claims choose to settle claims of and against their insured, rather than proceed to trial. This was confirmed by the testimony of counsel for the Plaintiff. 14     In the court below, the lawyers who acted in the Defendant’s suit namely Teo Weng Kie (“Teo”) and Cosmas Stephen Gomez (“Cosmas”) were witnesses. Teo testified for the Plaintiff while Cosmas was the Defendant’s witness. (Teo had filed a defence for the Plaintiff in the Defendant’s suit wherein she denied liability for the Accident). It was clear from the following extracts from Teo’s cross-examination[note: 1]that the Plaintiff’s 90% liability was not meant to bind her subsequent claims: Q:Could I also suggest that there was no intention on the part of you as conducting solicitor for the Defendant in the High Court that that suit at 90% interlocutory judgment against the Defendant was intended to bind the Defendant’s subsequent claims if any---in any fur---other Court? A:Your Honour, it was not my intention. If you look at PB, page 49. This was in response to my letter on page 48. So if I can bring you to page 48 Your Honour for the chronological order, that may be more helpful. On page 48, I had made an offer of 80, 20, in favour of the Plaintiff and on page 49, Mr. Cosmas wrote back to me, to say that it is---uh, he is making an offer of 95, 5, purely to settle the matter amicably, and on page 50 I then referred to his letter on page 49 and I made a counter offer of 90, 10. It was in my mind, Your Honour, that the matter would be settled on an amicable resolution basis and as solicitors, both Mr. Cosmas and I would have dealt with many such matters. … 15     In his evidence-in-chief, Cosmas confirmed that the consent (interlocutory) judgment was entered into on a “without prejudice” basis with no admission of liability on the part of the Defendant (who was then the Plaintiff), as can be seen from the following extract[note: 2]of the notes of evidence: Q:So you confirm that your agreement into---to enter into the consent interlocutory judgment was done so with no admission of liability on the part of your client? A:Um, what do you mean? Whether I communicated this to the--- Q:No---no---no. Do you confirm that when this consent interlocutory judgment was entered--- A:Yah. Q:it was on the basis that it was with no admission on liability on the part of your client? A:Yes, as far as my client is concerned, as far as I am concerned there was---she was not liable, that’s---that’s what I meant. Q:Grateful. And if I have to ask you to turn to page 29, the next page. Can I ask---can I also get you to agree with me that this judgment sets out no apportionment liability against your client? A:On the face of it, it does not. 16     Not only did the evidence of counsel who acted for both parties in the Defendant’s suit rebut the finding that there was issue estoppel, it was also the finding of the court below that the Plaintiff, but not the Defendant, was negligent. This can be seen from [45] to [46] of the grounds of decision where the judge said: 45    Based on the evidence before me, I found, on a balance of probabilities, that when the Plaintiff entered the junction, the traffic lights had already turned red against her. I took into account the following: a    the Plaintiff had admitted to such fact when she pleaded guilty to the traffic charge. Under Section 45A of the Evidence Act (Cap 97), evidence of the plaintiff’s plea of guilt in the criminal proceedings is admissible as evidence in the present proceedings, though it is not conclusive in and of itself; and b    the Plaintiff’s in court testimony also suggested that at the time she moved into the junction, all the vehicles in the opposite side had stopped. This rendered it likely that the traffic lights for straight going vehicles in both directions had turned red when the Plaintiff entered the junction. 46    Correspondingly, I believed the Defendant when she said that the right turning arrow had turned green at the material time, giving her the right of way to turn right into the junction. 17     Despite the fact he found the Plaintiff had beaten the red light and the Defendant had the right of way (because the green turning light was in her favour), the court below proceeded (at [51]) to find that one of the reasons that the Defendant was contributorily negligent was that, on a balance of probabilities, she had sped into the Junction right after the green right turning arrow came on. The judge said (at [54]): The Defendant stated that the right turning arrow was red when she first arrived at the junction. She was thefirstvehicle waiting to turn. Being the first vehicle to turn after the right green arrow appeared, the Defendant ought to have contemplated the possibility that vehicles in the opposite direction might have, for some reason, failed to stop when their red light came on. The Defendant should have adjusted her speed to make allowance for such an eventuality (which is not out of the course of normal human experience). Instead, as I have found, she sped into the junction after the right turning arrow came on. [emphasis in original] 18     The DC’s above findings overlooked a crucial fact—the Defendant had successfullycrossedthree lanes of Havelock Road before her vehicle collided into the Plaintiff’s vehicle travelling in the extreme left (fourth) lane. That being the case, would any reasonable motorist in the position of the Defendant have expected an on-coming vehicle to still beat the red light? Surely not. The fact that the Defendant managed to cross three out of four lanes at that very wide junction would also mean that the red light for Havelock Road traffic must have come on for some time; yet the Plaintiff still beat the red light. 19     The DC was wrong to have attributed contributory negligence even at 10% to the Defendant. Why could she not cross the last lane of the Junction even at speed when the green turning arrow had been in her favourfor the previous three laneswhich she crossed without incident? Even a reasonably cautious motorist would not have expected the Plaintiff to beat the red light in those circumstances which she did. 20     Counsel for the Defendant had referred toOng Bee Nah v Won Siew Wan (Yong Tian Choy, third party)[2005] 2 SLR (R) 455. The facts in that case were similar to our case. The third party was driving the vehicle in which the plaintiff (his wife) was the front seat passenger; it collided with the defendant’s car at a junction. The third party had been driving straight along the road while the defendant was in the process of making a right turn. The third party admitted he had his car radio turned on and was conversing with the plaintiff at the material time. The defendant seized upon the third party’s admission to argue that the third party had been distracted from his driving in general and had filed to keep a lookout for the defendant’s car in particular. 21     The court awarded judgment to the plaintiff and dismissed the defendant’s action against the third party. The court stated (at [92]–[95], [100], [103] and [104]) that there is no general duty on a driver to slow down automatically, sound the horn or flash the headlights of his vehicle when approaching a traffic junction if there was no stop sign or where the traffic lights were in his or her favour. Imposing such a blanket rule would be impractical and inefficient where there was otherwise no reasonable apprehension of danger. What people had to guard against were reasonable probabilities, not fantastic possibilities. In the third party’s situation, there was no reasonable probability of any danger occurring such that the third party should have acted to guard against it byinter aliaslowing down his vehicle. Slowing down one’s vehicle for no apparent reason would not have fulfilled any practical purpose and might have also inconvenienced other vehicles following behind. 22     The Plaintiff had in the Defendant’s suit similarly pleaded that the Defendant had failed to slow down or sound her horn or flash her headlights when she proceeded into the Junction. Such defences were completely unmeritorious in the light of my observations in [18] and [19]. As the Accident took place in broad daylight (at noon), was there a need for the Defendant to flash her vehicle’s headlights? Certainly not.",
        "The decision": "23     I was of the view that the court below erred in its finding that the Defendant was partly responsible for the Accident. My view is reinforced by the fact that the Plaintiff was charged with, and pleaded guilty to, inconsiderate driving (see [4]) but the police took no action against the Defendant over the Accident. 24     Moreover, in Carolyn Wooet al,Motor Accident Guide: A guide on the assessment of liability in motor accident cases(Mighty Minds Publishing, 2014) (“the Guide”), issued by the State Courts, there is a scenario (No 7, at pp 34–35) which governs (controlled) cross-junctions. In situations where the driver of a vehicle is turning right at a cross-junction (as the Defendant’s vehicle did [referred to as X in the scenario] with the green light in her favour and the red light showing against the Plaintiff’s vehicle (referred to as Y), the Guide stated driver Y would bear 100% liability for the accident for the following reason: Driver X turning right when the “green arrow” is lit up has right of way. Driver Y moving straight across the junction must stop in compliance with the “red” light. 25     It is a fundamental principle of the law of torts that unless there is a finding of negligence and causation, there can be no liability on the part of the tortfeasor. There was no evidence in the court below (apart from the court’s surmise that she was speeding) that the Defendant caused or partly contributed to the Accident in any way.",
        "Conclusion": "26     In summary, there was no issue estoppelvis-à-visthe Defendant as the Defendant’s suit was amicably settled between the insurers for the parties for the reasons given by Teo in the court below. That being the case, the Defendant was not precluded from raising defences afresh to resist the Plaintiff’s claim that she should be held 10% liable for the Accident. For that reason, I allowed the Appeal with costs and dismissed the Plaintiff’s claim also with costs.  [note: 1]Record of Appeal, p 46 (Notes of Evidence, 26 June 2014, p 14 lines 15–31). [note: 2]Record of Appeal, p 56 (Notes of Evidence, 26 June 2014, p 24 lines 12–29)."
    }
}