{
    "case_title": "M+W Singapore Pte Ltd\n      v\n      Leow Tet Sin and another",
    "ncitation": "[2015] SGHC 10",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff, M+W Singapore Pte Ltd, is a\n                    construction company. In February 2009, it was appointed by Jurong Data\n                    Centre Development Pte Ltd (“JDD”) to design and build a high-tech\n                    data centre (“the Data Centre”). The first defendant, Leow Tet\n                    Sin, and the second defendant, Yukiyasu Nakagawa, were at all material times the\n                    only directors of JDD and the joint signatories of its bank\n                accounts. 2       In October 2009, JDD, having failed to make\n                    certain payments due to the plaintiff under the construction agreement signed\n                    between them on 19 February 2009 (“the Construction\n                    Contract”), executed a debenture in favour of the plaintiff. The security\n                    was given in order to induce the plaintiff to continue work on the Data Centre.\n                    By the terms of the debenture, JDD agreed that all “Monetary\n                    Claims” would be charged to the plaintiff by way of a first fixed\n                    charge. 3       In January 2010, the Inland Revenue Authority of\n                    Singapore (“IRAS”) refunded a sum of $6,456,230.09 (“the\n                    GST Refund”) to JDD. Subsequently, JDD spent amounts totalling\n                    $5,348,413.51 out of the GST Refund. The plaintiff’s position is that the\n                    GST Refund was a Monetary Claim and therefore subject to the charge in its\n                    favour. Accordingly, JDD should not have spent any part of the same. In this\n                    action, the plaintiff seeks to recover the said sum of $5,348,413.51 from the\n                    defendants, jointly and severally, on the basis that: (a)     they dishonestly assisted in a breach\n                        of trust; or (b)     they induced a breach of contract; or (c)     they were engaged in fraudulent trading in respect of JDD\n                        within the terms of s 340 of the Companies Act (Cap 50, 2006 Rev Ed)\n                        (“the Act”).",
        "Background": "4       At the material time, the JL Group of companies\n                    comprised Japan Land Ltd (“Japan Land”), a listed company\n                    incorporated in Singapore, Japan Asia Land Ltd (“Japan Asia”), a\n                    company incorporated in Japan and JDD. Japan Asia is a subsidiary of Japan Land\n                    but operates as the headquarters of the JL Group. In 2008, JDD was incorporated\n                    in Singapore as a special purpose vehicle to develop the Data Centre. JDD was\n                    wholly reliant on Japan Land and Japan Asia for funding as it had no other\n                    business apart from the development (and subsequent operation) of the Data\n                    Centre. During most of the material period, the president of Japan Land, and\n                    head of the JL Group, was one Mitsutoshi Ono (“Mr\n                Ono”). 5       The first defendant is a certified public\n                    accountant who obtained his accountancy degree in 1970. In 2005, he was employed\n                    as the deputy managing director of Japan Land. He was promoted to the post of\n                    executive director in 2007 and when JDD was incorporated, the first defendant\n                    was made one of its directors. He continued to be the executive director of\n                    Japan Land and did not receive any extra remuneration for his position in\n                    JDD. 6       The second defendant is a construction engineer\n                    by training and experience. In 2007, after working in construction engineering\n                    companies for about 40 years, he joined Japan Land as a director. The second\n                    defendant was appointed a director of JDD because of his construction\n                    engineering experience and he held this appointment in JDD concurrently with his\n                    position as director of Japan Land. Like the first defendant, he did not receive\n                    extra remuneration for the new post.",
        "The Construction Contract and the search for investors": "7       In April 2008, JDD invited tenderers to quote\n                    for the construction of the Data Centre. The plaintiff was the successful\n                    tenderer. Under the Construction Contract, JDD agreed to pay the plaintiff\n                    $213,458,436.03 to design and complete the Data Centre on a turnkey basis. The\n                    Construction Contract provided for the plaintiff to be paid by way of progress\n                    payments. In mid-August 2009, JDD began to default on prompt payment of the\n                    progress payments and by October 2009, it owed the plaintiff about\n                $60m. 8       Meanwhile, Japan Land had been looking for a new\n                    investor to help with the financing of the Data Centre. In June 2009, it was\n                    approached by one Ang Chee Seng (“Mr Ang”) the chief executive\n                    officer of a Singapore company, Elchemi Group Ltd (“Elchemi”),\n                    which was interested in investing in the Data Centre through its subsidiary\n                    ConnectedPlanet Holdings Ltd (“CPH”). A Memorandum of\n                    Understanding was signed between Elchemi, Japan Land and Japan Asia on 21 August\n                    2009 and in order to facilitate the negotiations between the JL Group and\n                    Elchemi, work on the Data Centre had to continue uninterrupted. During the\n                    relevant period, the plaintiff was aware that there were negotiations taking\n                    place between JDD and Elchemi/CPH for the latter to make a substantial\n                    investment in JDD. 9       On 24 October 2009, a meeting was held in Tokyo\n                    to discuss the indebtedness owing to the plaintiff. This meeting was attended by\n                    the second defendant and Mr Ono on behalf of the JL Group. The plaintiff\n                    was represented by its chief executive officer, one Helmut Kurzboeck\n                    (“Mr Kurzboeck”). During the meeting, Mr Kurzboeck stated\n                    that work would not continue on the Data Centre unless payment or security was\n                    obtained from JDD. Since JDD could not pay, it agreed to provide a charge over\n                    its assets to the plaintiff – this was to prevent the plaintiff from\n                    proceeding with legal action against JDD under the Building and Construction\n                    Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (“SOPA”)\n                    to recover the outstanding amounts. 10     Pierre Crisantha Dedigama (“Mr\n                    Dedigama”), the plaintiff’s then managing director, contacted the\n                    first defendant on 27 October 2009 regarding the signing of a debenture and a\n                    security undertaking document. According to the first defendant, Mr Dedigama\n                    pressed for both documents to be executed by 9am on 28 October 2009. He\n                    threatened JDD, saying that if the documents were not signed by the deadline,\n                    the plaintiff would take legal action against JDD for the sums owed to the\n                    plaintiff. At the same time, according to the first defendant, he assured JDD\n                    that the documents were just to satisfy the plaintiff’s head office in\n                    Vienna and enable the plaintiff to get continued funding to work on the Data\n                    Centre. They were not to take effect while negotiations were being carried out\n                    with Elchemi. JDD’s lawyers, Rodyk & Davidson LLP\n                    (“Rodyk”), were given just one day to review the\n                documents. 11     After this assurance was allegedly given, a\n                    Japan Land board meeting was held on 28 October 2009 to approve the giving of\n                    security to the plaintiff by JDD. Mr Ang also gave his approval, via a written\n                    confirmation, that Elchemi was aware of the Debenture and Security Undertaking\n                    and that the two documents would not impede ongoing negotiations between JLL and\n                    Elchemi.",
        "The Debenture": "12     Pursuant to the resolutions passed on 28\n                    October 2009, JDD executed a debenture dated 28 October 2009 (“the\n                    Debenture”) in favour of the plaintiff and an agreement entitled\n                    “Security Undertaking” also dated 28 October 2009 (“the\n                    Security Undertaking”). These documents were registered with the\n                    Accounting and Corporate Regulatory Authority (“ACRA”) on 25\n                    November 2009. 13     By the Debenture, JDD acknowledged the debt\n                    owed to the plaintiff and agreed to secure the same by granting to the\n                    plaintiff, among other things, a fixed charge over all Monetary Claims. The\n                    following provisions of the Debenture are relevant (JDD being the Chargor and\n                    the plaintiff being the Chargee): 1.1Definitions … “Claims Account” means an\n                        Account to be identified by the Chargee (and any renewal or re-designation\n                        of such account) maintained by the Chargor with any bank in Singapore into\n                        which,inter alia, the proceeds of the getting\n                        in or realisation of the Monetary Claims and the dividends, interest and\n                        other monies arising from the Shares are to be paid. … “Monetary Claims” means any\n                        book and other debts, monetary claims, credit sales, receivables and other\n                        receivables owing to the Chargor and any proceeds thereof (including any\n                        claims or sums of money deriving from or in relation to any Intellectual\n                        Property, any Investment, the proceeds of any Insurance Policy, any court\n                        order, award or judgment, any contract or agreement to which the Chargor is\n                        a party and any other assets, property, rights or undertaking of the\n                        Chargor). 3.1Fixed charges: The\n                            Chargor as beneficial owner hereby charges in favour of the Chargee, as\n                            security for the payment and discharge of the Secured Obligations, by\n                            way of first fixed charge (which so far as it relates to land in\n                            Singapore vested in the Chargor at the date hereof shall, if reasonably\n                            required by the Chargee, be perfected by the execution of a legal\n                            mortgage in the prescribed form) all the Chargor’s right, title\n                            and interest from time to time in and to each of the following\n                            assets: … (h)all Monetary\n                                    Claimsother than any claims which are otherwise\n                                subject to a fixed charge or assignment (at law or in equity)\n                                pursuant to this Debenture and all Related Rights;\n                            … 10.1Dealing with Monetary Claims:The Chargor shall not at any time during the\n                            subsistence of the Debenture, without the prior written consent of the\n                            Chargee: (a)deal with the Monetary Claims except by\n                                getting in and realising them in a prudent manner (on behalf of the\n                                Chargee) and paying the proceeds of those Monetary Claims promptly\n                                into the Claims Account or as the Chargee may require (and such\n                                proceeds shall be held upon trust by the Chargor for the Chargee\n                                prior to such payment in); or (b)factor or discount any of the Monetary Claims\n                                or enter into any agreement for such factoring or discounting;\n                                or (c)be entitled to withdraw or otherwise transfer\n                                the proceeds of the realisation of any Monetary Claims standing to\n                                the credit of any Claims Account. [bold underline in original; emphasis added in italics and bold\n                        italics] 14     Under cl 10.1 of the Debenture, JDD was\n                    obliged to pay all Monetary Claims into the Claims Account and hold the proceeds\n                    on trust for the plaintiff. The Claims Account was never identified by the\n                    plaintiff. Under the Security Undertaking, JDD agreed make a payment of at least\n                    $24m to the plaintiff by 2 November 2009 to show its goodwill in continuing with\n                    the project. It further undertook to procure the written consent of Jurong Town\n                    Corporation (“JTC”) for a mortgage of the land on which the Data\n                    Centre was being erected being Lot 8441A of Mukim 5 (“the\n                    Property”) in favour of the plaintiff. In return, the plaintiff agreed\n                    under the Security Undertaking not to stop performing its obligations under the\n                    Construction Contract. 15     The defendants’ position is that at the\n                    time the security documents in favour of the plaintiff were executed, the\n                    plaintiff had agreed, as a collateral agreement, that it would not enforce the\n                    Debenture until the Data Centre had been completed and an investment agreement\n                    between the JL Group and Elchemi had been concluded. The defendants contend that\n                    the documents were provided to reassure the plaintiff’s head office so\n                    that the plaintiff could continue to obtain funding from the head office and\n                    work on the Data Centre could continue. It was intended that they were not to\n                    take effect according to their terms and conditions and were not to be\n                    registered. The plaintiff disputes this and alleges that there was no such\n                    agreement in place. The dispute over the existence of the collateral agreement\n                    is reflected in correspondence between JDD and the plaintiff from 6 November\n                    2009 to 10 November 2009.",
        "The Investment Agreement": "16     On 3 November 2009, Japan Land and CPH entered\n                    into an agreement (“the Investment Agreement”) pursuant to which\n                    Japan Land agreed to sell shares in JDD to CPH and CPH was to invest $71m in\n                    JDD. The deadline for the fulfilment of the parties’ obligations under the\n                    Investment Agreement was 31 January 2010.",
        "The SOPA proceedings": "17     JDD did not make payment as promised (see [14]\n                    above) on 2 November 2009. The next day, the plaintiff commenced\n                    proceedings under SOPA against JDD. On 10 December 2009, an adjudication order\n                    was made ordering JDD to pay the plaintiff $29,086,796.35 together with interest\n                    and costs as specified. The plaintiff did not extract this order immediately as\n                    it did not want to jeopardise the efforts being made to obtain the investment\n                    from CPH.",
        "The Refinancing Agreement": "18     On 18 November 2009, JDD, the plaintiff and\n                    Elchemi met with JTC officers to explain what was happening with the Data Centre\n                    and to obtain JTC’s consent for a grant of a mortgage over the Property to\n                    the plaintiff pursuant to cl 4.2(a) of the Security Undertaking. The first\n                    defendant explained that pending the investment by CPH, the mortgage would\n                    provide security to the plaintiff so that the plaintiff could complete the Data\n                    Centre. On 25 November 2009, the plaintiff, JDD and CPH entered into a\n                    Refinancing Agreement. Under the Refinancing Agreement, the parties undertook\n                    the following obligations: (a)     JDD was to obtain JTC’s\n                        approval and do all things necessary for the creation of a deed of\n                        assignment of the building agreement (“the Assignment of\n                        Building Agreement”) between JDD and JTC and also execute a mortgage\n                        in favour of the plaintiff. (b)     CPH was to provide the Investment Amount (defined as the\n                        amount due from JDD to the plaintiff together with another $5m for costs of\n                        variation works, legal and other costs associated with interim financing and\n                        contingencies) by 31 January 2010. The Investment Amount was to be paid into\n                        an Escrow Account by JDD within three days of receiving the money and the\n                        money was to be applied in paying off JDD’s indebtedness to the\n                        plaintiff. (c)     Once\n                        the above had been performed, the plaintiff would withdraw all adjudication\n                        proceedings that were still pending. It also agreed not to start legal\n                        proceedings against JDD for outstanding sums not paid. It would continue\n                        construction of the Data Centre unless JDD defaulted on its obligations\n                        under cl 1(c) of the Refinancing Agreement. The plaintiff agreed to obtain\n                        an extension of the adjudication process begun under the SOPA until the date\n                        of the JLL Extraordinary General Meeting (“EGM”) or 31 January\n                        2010, whichever date was earlier. This was subject to JDD performing its\n                        obligations under cl 1(c) of the Refinancing Agreement. 19     On 11 December 2009, JDD executed the\n                    Assignment of Building Agreement in favour of the plaintiff. This document\n                    created a security interest in the Property in favour of the plaintiff. At the\n                    same time, JDD executed a mortgage in escrow over the Property in favour of the\n                    plaintiff.",
        "The Assignment Agreement": "20     On 12 January 2010, the plaintiff entered into\n                    an agreement with CPH as assignee, Elchemi as guarantor and JDD as debtor. The\n                    recitals to this Agreement stated that JDD was in default of its payment\n                    obligations under the Construction Contract and that in connection with the\n                    investment that CPH intended to make in JDD, CPH was willing to undertake the\n                    payment obligations of JDD to the plaintiff, in return for an assignment by the\n                    plaintiff of its rights, title and benefits in and to the Construction Contract.\n                    By cl 2.1 of this Agreement (“the CPH Assignment”), CPH undertook\n                    to pay the plaintiff the sum of $154,984,800.40 on or before 28 January 2010. It\n                    also undertook certain other payment obligations in cll 2.2 and 2.3. By cl 4, in\n                    consideration of the various payments under cl 2, the plaintiff assigned to CPH\n                    from the date of payment, among other things, its rights and interest in the\n                    Construction Contract, and further agreed that upon receipt of certain payments\n                    it would execute a Deed of Discharge, Re-assignment and Release in respect of\n                    the Debenture, the Assignment of Building Agreement and the mortgage in\n                    escrow. 21     The plaintiff’s witnesses, Mr Kurzboeck\n                    and Mr Dedigama, did not explain in their affidavits of evidence-in-chief\n                    (“AEIC”) what the plaintiff’s reasons for entering into the\n                    CPH Assignment had been. Mr Ang explained in his AEIC that the plaintiff was\n                    concerned that the board of Japan Land might reject the Investment Agreement and\n                    frustrate the efforts to bring CPH into JDD. The point of the CPH Assignment was\n                    to allow CPH to pay the plaintiff and then obtain a right to claim payment from\n                    JDD under the Construction Contract. 22     CPH did not pay the plaintiff any money on 28\n                    January 2010. However, at that time the plaintiff took no action to terminate\n                    the CPH Assignment or the Investment Agreement. According to Mr Ang, this was\n                    because Elchemi was working closely with its strategic partner and also\n                    DBS Ltd to obtain financing for the investment. Everyone was optimistic\n                    that DBS Ltd would finance JDD, and the plaintiff and JDD were kept informed of\n                    the negotiations between Mr Ang and DBS Ltd.",
        "The GST refund": "23     On 23 December 2009, JDD had filed a claim for\n                    a GST refund in the amount of $6,456,230.09. This amount was received from IRAS\n                    on 15 January 2010 and was paid into JDD’s bank account with DBS\n                    Bank, Account No 003xxx (“the DBS Account”). The money was\n                    subsequently used to make various payments including: (a)     $388,920.01 to Japan Asia being an\n                        interest payment on a loan of $12m which Japan Asia had made to\n                    JDD; (b)     $151,377.41\n                        being utility charges incurred by JDD; (c)     $82,600 being property tax for the Data\n                    Centre; (d)     $34,891\n                        being salary for the staff of JDD; (e)     $38,520 being payment to one of the consultants working\n                        on the Data Centre; (f)     $334,478 to Japan Land in relation to a redemption of JDD’s\n                        preferential shares. 24     The plaintiff was unaware of the GST refund.\n                    It was not asked for its permission for the various payments that were made from\n                    the GST Refund and only found out about these much later.",
        "Enforcement of the Debenture": "25     On 9 March 2010, DBS Ltd made a formal offer\n                    to JDD of a loan facility of up to $227m. Mr Ang found some of the terms of that\n                    offer to be unacceptable and he rejected it. As a result, CPH was unable to fund\n                    the Investment Amount and the Refinancing Agreement between JDD and the\n                    plaintiff collapsed. The plaintiff then gave JDD notice that the CPH Assignment\n                    would be terminated with immediate effect unless CPH or Elchemi met their\n                    obligations under it. No payment was made by either CPH or Elchemi. On 12 March\n                    2010, the plaintiff terminated the Refinancing Agreement. On 16 March 2010, the\n                    CPH Assignment was also terminated. The plaintiff then proceeded to extract the\n                    adjudication order it had obtained earlier under the SOPA and, on 22 March 2010,\n                    it issued JDD with a notice of default. Shortly thereafter, the plaintiff\n                    appointed receivers and managers pursuant to the Debenture. On 8 April 2010, at\n                    the instance of other creditors, the court appointed provisional liquidators for\n                    JDD. 26     After their appointment, the receivers and\n                    managers took control of all JDD’s assets including the Data Centre and\n                    the DBS Account. At that time, there was only $1,107,816.58 left in the DBS\n                    Account. The receivers and managers subsequently found out about the GST refund\n                    and the payments made from these funds. 27     The receivers and managers sold the Data\n                    Centre by auction. The plaintiff was the sole bidder at the auction and bought\n                    the Data Centre for $145m. This amount was insufficient to settle the\n                    indebtedness of JDD to the plaintiff. 28     At about the same time, the liquidators of JDD\n                    commenced OS 389 of 2010 (“OS 389”) in which JDD was the\n                    plaintiff and M+W Singapore Pte Ltd, the plaintiff here, was the defendant. By\n                    OS 389, JDD challenged the validity of the Debenture and the appointment of\n                    the receivers and managers by the plaintiff. JDD sought to recover the Data\n                    Centre/its proceeds and the balance standing to the credit of the DBS Account. I\n                    heard OS 389 and delivered judgment in March 2011. I dismissed JDD’s\n                    claims and held, amongst other things, that the Debenture was valid and\n                    enforceable.",
        "Causes of action": "29     The plaintiff seeks to recover the moneys\n                    spent from the GST Refund on the basis of three distinct and alternative causes\n                    of action: (a)     dishonest assistance in a breach of\n                        trust; (b)     inducement of breach of contract; and (c)     fraudulent trading. I\n                        will take these in turn.",
        "Dishonest assistance": "30     The elements of a claim in dishonest\n                    assistance are: (a)     The existence of a\n                    trust; (b)     A breach of\n                        that trust; (c)     Assistance rendered by the defendant towards the breach; (d)     A finding that the assistance rendered\n                        by the defendant was dishonest. Thus, the\n                        issues that have to be determined in relation to this cause of action are\n                        related to the satisfaction of the foregoing elements. Was there a trust? 31     The plaintiff’s position is that because\n                    of the provisions of the Debenture, a trust existed over the Monetary Claims\n                    (including the GST Refund) in favour of the plaintiff. Further, by reason of my\n                    judgment in OS 389, this court has confirmed this trust and the defendants\n                    are estopped by the principles ofres judicatafrom contesting those findings. 32     In OS 389, I held that: (a)     the GST Refund clearly fell within\n                        the definition of a Monetary Claim in the Debenture (at\n                    [80]); (b)     under cl\n                        10.1(a) of the Debenture, JDD was obliged, on receipt of the Monetary Claim,\n                        to pay the same into the Claims Account and to use the same for the purpose\n                        of repaying the plaintiff only. JDD had no authority to use such Monetary\n                        Claim for any other purpose whatsoever (at [81]); and (c)     JDD’s action in paying the GST\n                        Refund into the DBS Account was a breach of the Debenture and did not\n                        convert the fixed charge over the GST Refund into a floating charge.\n                        Instead, because the GST Refund was utilised in a manner contrary to the\n                        fixed charge, at law it was held on a constructive trust for the plaintiff.\n                        In addition, under cl 10.1(a) of the Debenture, a Monetary Claim that\n                        was received by the plaintiff was to be held on trust by it for the\n                        plaintiff until it was paid into the Claims Account. Thus, whilst it was in\n                        the DBS Account, the GST Refund was still held on trust for the\n                        plaintiff. 33     If the holdings above are binding on the\n                    defendants in this case, then the first two elements of the cause of action\n                    would be met: there would be a trust over the GST Refund in favour of the\n                    plaintiff and there would have been a breach of that trust by JDD in so far as a\n                    substantial portion of the GST Refund was spent to settle claims of parties\n                    other than the plaintiff without the plaintiff’s consent. The defendants,\n                    however, submit thatres judicatais not\n                    applicable and that the plaintiff cannot prove its case by pointing to\n                    OS 389 or the evidence in that suit. 34     As enunciated inGoh Nellie\n                        v Goh Lian Teck[2007] 1 SLR(R) 453 (“Nellie Goh”) at [17]–[24], the doctrine ofres judicataencompasses three distinct but\n                    inter-related principles: cause of action estoppel, issue estoppel and abuse of\n                    process. The first prevents a party from asserting or denying against the other\n                    party the existence of a cause of action. The second allows a previous decision\n                    to be invoked as having determined an essential step in a separate issue so that\n                    further consideration of that issue is foreclosed. The third prevents parties\n                    from changing the form of the proceedings in a bid to re-litigate issues\n                    previously decided. The second and third principles apply in this\n                case. 35     In its statement of claim, the plaintiff\n                    stated that it intended to rely on the judgment in OS 389 to show\n                    that: (a)     the payment of the GST Refund into\n                        the DBS Account was a breach of the terms of the Debenture and resulted in\n                        JDD holding the moneys on a constructive trust for the plaintiff;\n                    and (b)     JDD had spent\n                        at least $5,348,413.55 out of the GST Refund in breach of contract and/or in\n                        breach of trust. 36     The defendant says that the plaintiff cannot\n                    prove its case by pointing to OS 389 or the contents of the affidavit in\n                    OS 389 and had failed to show how the judgment in OS 389 is relevant\n                    to this action. However, asNellie Gohitself\n                    holds, findings of fact in a previous decision can be relied on when the\n                    judgment is final and conclusive on the merits; the judgment is from a court of\n                    competent jurisdiction; there is identity between the parties to the two\n                    actions; and there is identity of subject matter in the two proceedings. These\n                    elements are substantially fulfilled: the judgment in OS 389 is final and\n                    conclusive on the merits, it is from a court of competent jurisdiction and in\n                    relation to the subject matter of the GST Refund and the nature of the charge of\n                    the GST Refund, there is an identity of subject matter between OS 389 and\n                    the present action. The main difference between the two is that there is no\n                    identity of parties in that although the plaintiff here was a party to\n                    OS 389, the defendants here were not. However, the defendants here could be\n                    said to be the privies of the defendant in OS 389, being the directors of\n                    JDD. Further, the first defendant gave evidence on behalf of JDD in OS 389\n                    and was aware of the arguments made there in relation to the nature of the\n                    charge created by the Debenture over the Monetary Claims and the GST Refund. It\n                    was argued there that the Monetary Claims were not subject to a fixed charge and\n                    that GST Refund was not a Monetary Claim. Similar arguments have been made\n                    here. 37     I am of the opinion that because of the\n                    identity of the subject matter in the two proceedings and the part that the\n                    defendants here played as directors of the defendant in OS 389, there is\n                    issue estoppel in relation to the holdings cited in [32] above. This is\n                    notwithstanding the fact that the defendants here were not direct parties to\n                    OS 389. Even if this determination is incorrect, the defendants are still\n                    unable to dispute those holdings because my decision in OS 389 operates as\n                    a judgmentin remand as a resultres judicatawould still apply. A judgmentin remis one that declares the rights and title to a\n                    property to all the world. Every judgmentin remis conclusive and binding upon the world at large and is not limited in its\n                    binding effect to those who were parties to the proceedings and their privies\n                    (seeKwa Ban Cheong v Kuah Boon Sek[2003] 3\n                    SLR(R) 644 at [38]). In this case, the judgment in OS 389 determined, as\n                    against all the world, the rights and interests of the plaintiff in Monetary\n                    Claims, which included the GST Refund, as vested in it by the\n                Debenture. 38     Accordingly, I hold that the defendants here\n                    are estopped from denying that the GST Refund was a Monetary Claim or that as\n                    such it was subject to a fixed charge in favour of the plaintiff and that JDD\n                    held it on trust for the plaintiff. This trust was a trust that arose on the\n                    terms of the Debenture itself (ie, cl 10.1(a)) and\n                    also by law. Was there a breach of trust and did the defendants render\n                assistance? 39     These two elements can be dealt with briefly.\n                    The answer to the first question is plain: the Debenture provided a fixed charge\n                    over the GST Refund and therefore the money had to be kept for the plaintiff and\n                    could not be paid to a third party without the plaintiff’s consent. The\n                    plaintiff had no prior knowledge of the various payments made by JDD from the\n                    GST Refund and did not consent to them. Such payments were, thus, in breach of\n                    trust by JDD. As for the second question, the only way that the payment in\n                    breach of trust could be made was if they were authorised by the defendants who\n                    were the sole directors of JDD and, more to the point here, the operators of the\n                    DBS Account. The defendants signed the cheques and authorised the remittances\n                    that were made from the DBS Account and resulted in payment of money from the\n                    GST Refund to parties other than the plaintiff. Thus, they assisted in the\n                    breach of trust committed by JDD. Was the assistance rendered by the defendants dishonest? 40     There are a number of points that arise in\n                    relation to this question. First, however, it may be helpful to briefly set out\n                    the law on how dishonesty is assessed in connection with this cause of\n                    action. The law 41     InGeorge Raymond Zage III\n                        v Ho Chi Kwong[2010] 2 SLR 589 (“Zage”) at [22], it was held by the Court of Appeal that\n                    for a defendant to be liable for dishonest assistance, he must have such\n                    knowledge of the irregular shortcomings of the transaction that ordinary honest\n                    people would consider it to be a breach of standards of honest conduct if he\n                    failed to adequately query them. In formulating this principle, the Court of\n                    Appeal accepted Lord Hoffmann’s statement of the law inBarlow Clowes International Ltd (in liquidation) v Eurotrust\n                        International Ltd[2006] 1 WLR 1476 (“Barlow Clowes”).Barlow\n                        Cloweswas a decision of the Privy Council and there Lord\n                    Hoffmann clarified previous authority in relation to whether the test of\n                    dishonesty should be objective or subjective. At [10], Lord Hoffmann stated\n                    that: … Although a dishonest state of mind is a subjective mental state,\n                        the standard by which the law determines whether it is dishonest is\n                        objective. If by ordinary standards a defendant’s mental state would\n                        be characterised as dishonest, it is irrelevant that the defendant judges by\n                        different standards. … 42     Therefore, the analysis is a two-stage one,\n                    the first being subjective and the second objective (Susan Barkehall Thomas,\n                    “Defining (Or Refining) The Meaning Of Dishonesty AfterTwinsectra” [2006] SJLS 459 at p 462). Two\n                    questions must be asked: (a)     What did the defendant know of the\n                        transaction? (b)     Does participation in the transaction with this knowledge offend ordinary\n                        standards? It is only when both limbs are\n                        satisfied that the defendant’s dishonesty will be\n                    established. 43     Further, accessory liability can still be\n                    found even though the assisting third party did not obtain any benefit himself:Royal Brunei Airlines Sdn Bhd v Philip Tan Kok\n                        Ming[1995] 2 AC 378 (“Royal\n                        Brunei”) at 382. 44     The facts ofRoyal\n                        Bruneiare relevant because of their similarity to those of the\n                    current case. In this respect, I cannot accept the defendants’ submission\n                    that they are too different to be used as a comparison. 45     InRoyal Brunei,\n                    Royal Brunei Airlines Sdn Bhd appointed Borneo Leisure Travel Sdn Bhd\n                    (“BLT”) as its agent for selling passenger and cargo\n                    transportation. BLT was owned by Philip Tan Kok Ming (“Philip\n                    Tan”) and his wife, who were the sole directors and shareholders of the\n                    company. Under the terms of its appointment, BLT was to account to the airline\n                    for the sale receipts and would be paid a sales commission for its\n                    services. 46     Subsequently, it was discovered that the sales\n                    proceeds were not deposited into a separate account but paid into BLT’s\n                    ordinary current account with its bank. When the airline demanded payment of the\n                    money, BLT could not pay. The airline sued Philip Tan for the sums owed because\n                    he knew that there was an express trust of the money and yet had authorised the\n                    use of the money for BLT’s ordinary business purposes, paying salaries,\n                    overheads and other expenses, and keeping down its bank overdraft. He was found\n                    liable for dishonest assistance because he caused or permitted the company to\n                    use the money, of which it was trustee, in a manner he knew was unauthorised.\n                    The Privy Council held that “[t]he defendant was the company, and his\n                    state of mind is to be imputed to the company”. In the present case, the\n                    plaintiff seeks to draw a parallel regarding the use of the GST Refund by\n                    JDD. The defendants’ knowledge 47     The first inquiry therefore must be as to what\n                    each of the defendants knew about JDD’s obligations to the plaintiff and\n                    the status of Monetary Claims under the Debenture. These are factual issues and\n                    they are hotly contested by the parties. 48     The plaintiff submits that: (a)     the defendants knew or ought to have\n                        known that the Debenture secured all present and future assets of JDD for\n                        the benefit of the plaintiff; and (b)     the defendants knew or ought to have known that they were\n                        spending an asset of JDD in breach of the Debenture. 49     The defendants submit that: (a)     both of them were salaried\n                        employees, they were not paid additional remuneration for the work and\n                        responsibilities they had undertaken for JDD and received no benefit from\n                        any of the payments made; (b)     they were not aware of cl 10 of the Debenture at the time\n                        they signed it on behalf of JDD; (c)     after the signing of the Debenture, all parties had\n                        agreed not to enforce it, or at least the evidence showed that there was no\n                        attempt to enforce it and it remained in the background with no one being\n                        concerned about its terms and conditions; (d)     no reasonable director would have given much\n                        importance to the Debenture because of the events that took place after it\n                        was signed; (e)     there was a collateral understanding that the Debenture was not to be\n                        enforced and that it was provided so that the plaintiff would continue\n                        construction work without resorting to SOPA; and (f)     at all material times after the\n                        signing of the Debenture, they were trying their best to get CPH involved as\n                        an investor and always obtain approval from Mr Ang on behalf of CPH before\n                        making any payment from the DBS Account. 50     Before I deal with the defendants’\n                    knowledge, I observe that the fact that the defendants were salaried employees\n                    who received no additional remuneration for acting as directors of JDD is not\n                    relevant to the consideration of their liability. AsRoyal\n                        Bruneimakes clear, it is equally irrelevant that they received\n                    no personal benefit from any of the payments made. 51     I now turn to what exactly the defendants knew\n                    about the contents and effect of the Debenture. Their alleged ignorance of its\n                    contents at the time it was executed is supported by the fact that JDD was\n                    supplied with that document (together with the Security Undertaking) on 27\n                    October 2008, just a day before it was signed. The plaintiff, through Mr\n                    Dedigama, insisted that it be signed the next day despite the first defendant\n                    informing him that JDD’s lawyers could not review the document in such a\n                    short space of time. The second defendant was flying back from Japan to\n                    Singapore at the time the document was sent over and had no opportunity to read\n                    the Debenture and the Security Undertaking before they were signed. Both the\n                    defendants were, however, aware that the documentation they were signing was\n                    intended to create security over the assets of JDD in favour of the\n                    plaintiff. 52     Dealing with the first defendant, he is a\n                    qualified and very experienced accountant. He testified that it was\n                    “common knowledge” that a debenture creates a fixed and floating\n                    charge over the assets of the company that executes it. Further, according to\n                    the minutes of the board meeting of Japan Land held on 28 October 2009, the\n                    first defendant, as chairman of the meeting, explained to board members that it\n                    had been convened to seek the board’s approval for JDD, Japan Land’s\n                    wholly-owned subsidiary, to enter into the Debenture and Security Undertaking in\n                    favour of the plaintiff. He also briefed the board on the key terms of the\n                    documents and in this connection stated that the Debenture created a fixed and\n                    floating charge over all the present and future assets of JDD in favour of the\n                    plaintiff. Whilst the first defendant did not draft these minutes, he confirmed\n                    in court that he had read, checked and signed them subsequently. He confirmed\n                    that they were a correct record of what was discussed at the meeting although\n                    later he resiled somewhat from that admission. In relation to his knowledge, the\n                    first defendant came across as evasive and untruthful. 53     The first defendant’s evidence during\n                    the trial was that he had received drafts of the Debenture and the Security\n                    Undertaking on 27 October 2008 and had read them “very very\n                    briefly”. He was asked if he had been able to understand the terms of the\n                    documents and his reply was “I don’t think so”. This reply\n                    was inconsistent with his evidence that it was common knowledge that a debenture\n                    creates a fixed and floating charge over assets and he knew this before the\n                    board meeting. He subsequently clarified that in this case he understood the\n                    Debenture created a fixed and floating charge over the Data Centre only. He\n                    specifically said he was not aware that it created such charges over the present\n                    and future assets of JDD. However, when he was pressed on the point, he admitted\n                    that at the time he signed the Debenture he understood that it created a fixed\n                    and floating charge over all the present and future assets of JDD. 54     This knowledge of the extent of the Debenture\n                    must have been reinforced after its execution. First, Rodyk acted for JDD in\n                    relation to the Debenture and although Rodyk was not able to advise JDD on the\n                    contents of the documents before they were executed, the firm was available\n                    thereafter to answer any questions the directors might have had on the\n                    documents. Secondly, the plaintiff’s lawyers prepared a “Statement\n                    Containing Particulars of Charge” (“the Statement”) in\n                    respect of the Debenture for filing with the relevant authority and sent the\n                    same to Rodyk. The first defendant admitted in court that he had received\n                    e-mails from Rodyk attaching a copy of the draft Statement. The particulars in\n                    the Statement referring to the charges created include “a charge on book\n                    debts of the company”. The first defendant said that he did not recall\n                    discussing the draft particulars of the Statement with Rodyk and also claimed\n                    that he did not ask Rodyk for any advice on the terms of the\n                Debenture. 55     I find it difficult to believe that with all\n                    the documents before him and the part that he played in their approval and\n                    execution, the first defendant, a qualified accountant with many years of\n                    experience in the business world, did not know or understand the contents of the\n                    Debenture or appreciate that it created a fixed charge on the book debts of JDD.\n                    The fact that he did not seek any advice from Rodyk on the terms of the\n                    document, even after executing it, indicates to me that he must have understood\n                    what he had signed, albeit perhaps after he did so. In his AEIC, the first\n                    defendant claimed that he had always been aware of his duty as a director of JDD\n                    and had taken care to seek legal advice on all important affairs of JDD. I do\n                    not accept that an experienced director like the first defendant would have\n                    failed to ask for advice had he not understood what the Debenture\n                    provided. 56     As for the second defendant, he had attended\n                    the meeting in Japan at which Mr Kurzboeck demanded security in return for the\n                    plaintiff continuing to carry on work on the Data Centre. Therefore he was aware\n                    of the plaintiff’s position. While he did not see the draft documents\n                    which detailed the security required, Mr Kobayashi who was an executive of Japan\n                    Land, sent an e-mail to the second defendant and to Mr Ono after sighting a copy\n                    of the Debenture. This e-mail said: I have read it. The draft done by the lawyer is legally sound but we need\n                        to adjust the interests of the parties as follows. The problems in the\n                        contract for the security interests are that Zander [i.e. M+W] wished to add\n                        everything (refer to Clause 3.1) and I am wondering if this will infringe on\n                        the Elchemi’s security interest creation. 57     During cross-examination, the second defendant\n                    claimed that while he did read the e-mail from Mr Kobayashi, he did not bother\n                    to give it any thought or seek any clarification from Mr Kobayashi or the first\n                    defendant as to what it meant. The second defendant did, however, concede that\n                    he should have understood that by the phrase “Zander wished to add\n                    everything” that the plaintiff wanted security over all JDD’s\n                    assets. More significantly, the second defendant admitted that by the time the\n                    Refinancing Agreement was signed on 25 November 2009, he would have read the\n                    terms of the Debenture. He did not confirm that he understood it, saying that he\n                    was no lawyer and did not know certain words. However, the second defendant\n                    conceded that he had a “general understanding” but not each word\n                    or each sentence. In his affidavit, he had stated that the Refinancing Agreement\n                    was to secure the Debenture (because it had been hurriedly executed by JDD) and\n                    that therefore the very first clause of the Refinancing Agreement was\n                    “the clause to secure the Debenture”. It should be noted that cl\n                    1(a) of the Refinancing Agreement states that JDD acknowledged and agreed that\n                    the bizfiling of the Debenture was lawfully and properly carried out and that\n                    the Debenture was kept at the registered office of JDD and was open to the\n                    inspection of any creditor or member of JDD. The second defendant therefore was\n                    fully aware by 25 November 2009 that the Debenture was a valid document and\n                    that its clauses bound the company. This being the case, he had a duty as a\n                    director of JDD to acquaint himself with its terms and to understand its full\n                    import. As in the case of the first defendant, he had every opportunity to ask\n                    Rodyk for advice on its terms if he did not understand them. 58     Apart from the Refinancing Agreement, the\n                    defendants also executed other documents which confirmed the enforceability of\n                    the Debenture. On 3 November 2009, the Investment Agreement was signed\n                    between JDD, Japan Land and CPH. In cl 3.1.10, completion of the investment by\n                    CPH was expressly made subject to the plaintiff having agreed to the termination\n                    of the Debenture, the security undertaking and all other security and other\n                    agreements granted in relation thereto. On 12 January 2010, JDD signed the\n                    Assignment Agreement with the plaintiff, CPH and Elchemi. In this document, CPH\n                    agreed to undertake the payment obligations of JDD to the plaintiff in return\n                    for, amongst other things, an agreement on the part of JDD to execute a deed of\n                    discharge, reassignment and release in respect of,inter alia, the Debenture. 59     Thus, during the period from 28 October 2009\n                    up to 12 January 2010, both the defendants signed, on behalf of JDD, documents\n                    which referred to the Debenture in terms that made it plain that this was a\n                    valid and enforceable obligation of JDD which would have to be discharged for\n                    the investment by CPH to take place. The defendants admitted that they took\n                    advice from Rodyk on the terms of each of those documents. They would therefore\n                    have understood the implications of the documents. 60     On the evidence, I find that the first\n                    defendant knew, at all material times, and definitely before the receipt by JDD\n                    of the GST Refund, that the Debenture covered all book debts belonging to JDD\n                    and that the same were subject to a fixed charge. As for the second defendant,\n                    he was aware that the Debenture covered all assets of JDD and, if he had taken\n                    advice in relation to clauses that were unclear to him as he should have, would\n                    have been informed and known that book debts formed part of the assets of JDD\n                    and were subject to a charge in favour of the plaintiff. 61     The plaintiff submits that on the facts of\n                    this case there are only two possibilities. Either: (a)     the defendants were well aware that\n                        the Debenture created a trust over the GST Refund in favour of the plaintiff\n                        and prevented them from disposing of the GST Refund for purposes other than\n                        repaying the plaintiff, but proceeded regardless; or (b)     they had good grounds to suspect that\n                        the expenditure was not permitted or at least that they were not permitted\n                        to freely dispose JDD’s assets, given that the plaintiff had security\n                        over all of JDD’s assets, such that ordinary honest people would\n                        consider it to be a breach of standards of honest conduct if the defendants\n                        failed to make further adequate queries before disposing of the\n                        funds. The plaintiff further says that in\n                        both cases the defendants’ conduct would be\n                dishonest. 62     In my view, the first defendant fell within\n                    the first category. However, even if this is not completely supported by the\n                    evidence, there is no doubt in my mind that he fell within the second category\n                    as well. As for the second defendant, in my judgment his failure (if indeed he\n                    was telling the truth) to obtain an explanation for those parts of the Debenture\n                    which he did not understand, was reckless. He therefore fell within the second\n                    category in that he had good grounds to believe that JDD was not able to freely\n                    dispose of all of its assets. I go on to consider whether the inference of\n                    dishonesty that I have drawn can be displaced by certain matters on which the\n                    defendants rely in answer to the plaintiff’s case. The defendants’ rebuttals 63     The defendants have made two types of\n                    submissions as to why they should not be considered dishonest in any event. The\n                    first category is set out at [49(c)]–[49(e)] above and the second is set\n                    out at [49(f)] above. 64     The first category pertains to the\n                    enforceability of the Debenture and consists of the allegations that: (a) that\n                    the parties had agreed not to enforce the Debenture; (b) there was a collateral\n                    understanding that it was not to be enforced; (c) no one was concerned about its\n                    terms and conditions; and (d) no reasonable director would have given much\n                    importance to it because of the events that took place after it was\n                    signed. 65     The defendants pleaded that there was a\n                    collateral agreement between JDD and the plaintiff that the Debenture would not\n                    be enforced by the plaintiff until the completion of the Data Centre and the\n                    completion of the Investment Agreement. This was an oral agreement that arose\n                    from an assurance by Mr Dedigama on 28 October 2009 that there would be no\n                    enforcement of the Debenture and Security Undertaking. According to the first\n                    defendant, Mr Dedigama said that he only needed the security to reassure\n                    his head office in Vienna. On 6 November 2009, the plaintiff received a letter\n                    from Rodyk (“Rodyk’s 6 November letter”) which stated that\n                    the basis on which the documents were executed by JDD were: (a) to allow the\n                    plaintiff to receive continued funding from its head office for the Data Centre;\n                    and (b) it was never the intent of JDD, and Mr Dedigama was aware of this, for\n                    the documents to take full effect in accordance with their terms pending\n                    JDD’s negotiations with the plaintiff and Elchemi for a final resolution\n                    of the funding issues for the Data Centre. 66     The plaintiff’s position, naturally, is\n                    that no collateral agreement existed and that at all material times it was\n                    intended that the Debenture would be a legally effective and enforcement\n                    security and would be discharged only when payment was received from\n                JDD. 67     The plaintiff also points out that the\n                    defendants’ explanation of their understanding of the collateral agreement\n                    shifted many times: (a)     In their Defences, both defendants\n                        pleaded that the plaintiff would not enforce the Debenture pending\n                        completion of the Data Centre and completion of the Investment\n                        Agreement. (b)     In\n                        their AEICs, both defendants assert that they were assured by Mr Dedigama\n                        “that there would be no enforcement of the Debenture and [Security\n                        Undertaking]” (the implication of this was that there would be no\n                        enforcement at all). (c)     In the Rodyk 6 November letter, it was said that the security\n                        documents were “not meant to be registered nor enforced against our\n                        client. Once executed the two documents were not meant to take effect\n                        pending our client’s negotiations with your client and a potential\n                        investor, Elchemi Group, for a final resolution of the funding issues for\n                        the [Data Centre]”. It should be noted that this was also the\n                        description of the alleged collateral agreement which was asserted in\n                        OS 389. In court, Mr Ang acknowledged that JDD’s negotiations\n                        with Elchemi had reached their conclusion on 3 November 2009. This would\n                        have meant that after 3 November 2009, the documents could be registered and\n                        enforced, and therefore the Rodyk version was at odds with the versions put\n                        forward by the defendants in their pleadings and AEICs. (d)     In court, the defendants refused to\n                        acknowledge inconsistencies between the three versions of the collateral\n                        agreement. However, they conceded in cross-examination that the Debenture\n                        was enforceable even if the Investment Agreement was not completed. Thus,\n                        they expressly disavowed on the stand the purported collateral agreement\n                        that they had pleaded and also asserted in their AEICs. 68     I am satisfied that no collateral agreement\n                    existed in the terms as pleaded. It would not be logical to have an agreement\n                    not to enforce the Debenture until both the Data Centre and the Investment\n                    Agreement had been completed because the completion of the latter document would\n                    have meant that the plaintiff had been paid off and once this happened there\n                    would be nothing to enforce. It must have been this recognition that impelled\n                    the defendants when questioned in court to resile from that part of their\n                    pleadings. I am, however, also satisfied that there was no general agreement not\n                    to enforce the security documents at all. 69     It should be noted that on 27 October 2009 Mr\n                    Dedigama sent an e-mail to the first defendant regarding the execution of the\n                    documents in which he said: Please note that the debenture and security undertaking agreement are\n                        purely there to ensure that we do not proceed with the issuance of a notice\n                        as we are entitled to under the Security of Payment Act. The documents are\n                        there only to protect us in the event you do not make the payments as\n                        agreed. It can be seen from this that the plaintiff’s main\n                        intention in procuring the security from JDD was to have protection in the\n                        event that JDD did not make payment to the plaintiff as agreed. This\n                        sentence can by no means be read as an agreement not to enforce and, having\n                        put the plaintiff’s position so clearly on paper, I do not accept that\n                        on 28 October 2009 Mr Dedigama said anything to contradict or adversely\n                        affect that position. I note that in court the second defendant confirmed\n                        that what Mr Dedigama had said on 28 October 2009 was that the Debenture\n                        would not take effect if the investors’ money came in. Such a\n                        statement was consistent with the email indicating the Debenture was\n                        required as protection in the event of non-payment. 70     The Rodyk 6 November letter did provide some\n                    support to the defendants but its weight was undermined by JDD’s failure\n                    to respond to the plaintiff’s solicitors’ strong rebuttal dated 10\n                    November 2009. This was a four-page letter setting out the parties’\n                    actions and discussions in some detail and asserting that: (a) none of the\n                    alleged representations had been made by Mr Dedigama; (b) there was no\n                    understanding that the security documents were not meant to be registered or to\n                    take effect; (c) the security documents reflected the full understanding of the\n                    parties; and (d) JDD knew and accepted that the Debenture was intended to be\n                    registered and take full effect as security for the plaintiff’s benefit.\n                    The first defendant testified that he had instructed Rodyk to respond to the 10\n                    November 2009 letter but when Rodyk’s draft reply was received by him, Mr\n                    Ang did not want it sent out because he did not want to upset the plaintiff for\n                    fear doing so would jeopardise the Investment Agreement. This testimony was at\n                    odds with what the first defendant had said in OS 389 which was to the\n                    effect that he had been of the opinion that there was no need to respond to the\n                    10 November 2009 letter as JDD had consistently maintained that the security\n                    documents were never meant to take full effect and this position had been set\n                    out clearly in Rodyk’s 6 November letter. When the first defendant was\n                    asked why he had given different evidence in OS 389, he said that he did\n                    not find it necessary then to mention that Mr Ang had told him not to send out\n                    the reply and the position then had been different because he was just a witness\n                    in OS 389. If the first defendant’s evidence in this case was the\n                    truth, then it shows that he was aware that the plaintiff did not accept\n                    JDD’s position on the enforceability of the documents but, nevertheless,\n                    kept his peace instead of setting the record straight and protecting JDD’s\n                    position. This does not inspire confidence in the strength of his\n                belief. 71     It is also worth pointing out that in the\n                    Security Undertaking JDD agreed to pay the plaintiff, on or before 2 November\n                    2009 or such later date as the plaintiff may agree to, at least $24m as part\n                    payment of the “Overdue Amounts” which JDD acknowledged as being\n                    $59,382,895.95 (excluding GST) as at 27 October 2009. The Security Undertaking\n                    also provided that if such payment was not made, the plaintiff would be entitled\n                    to stop work on the Data Centre and this would be without prejudice to its\n                    rights to take any legal action or enforce any of its rights under the\n                    Construction Contract. No payment was made on 2 November 2009. On the same\n                    evening, one of Mr Dedigama’s colleagues sent JDD an e-mail demanding\n                    payment of the outstanding sums due. The very next day, as alluded to earlier,\n                    the plaintiff commenced action under SOPA. In my judgment, the plaintiff’s\n                    actions demonstrated to JDD its intention that the Debenture should secure\n                    JDD’s payment obligations and that if JDD did not meet those obligations,\n                    the plaintiff would be entitled to take whatever action it deemed fit to protect\n                    itself. 72     Whilst the plaintiff did not take any drastic\n                    steps to enforce the Debenture in November 2009 or thereafter, it must be\n                    remembered that it was working to protect its security by obtaining JTC’s\n                    consent to the mortgage and Assignment of Building Agreement. More generally,\n                    from a commercial point of view, to the extent that the plaintiff saw the\n                    potential for CPH to complete its investment and pay off the debt owed to it,\n                    the plaintiff must have seen this as a better option than enforcement. In this\n                    connection, the plaintiff procured the registration of the charges with ACRA.\n                    Such registration was not challenged by JDD after it signed the Refinancing\n                    Agreement on 25 November 2009. As mentioned earlier, this document\n                    expressly provided that bilateral agreements between the plaintiff and JDD\n                    including the Debenture would remain fully binding and enforceable. Thus, even\n                    if there had been an oral collateral agreement in October 2009, such agreement\n                    would have been superseded by the terms of the Refinancing\n                Agreement. 73     In this connection, I observe that the only\n                    agreement which the plaintiff entered in relation to enforcement was that\n                    contained in and conditioned by the terms of the Refinancing Agreement. This\n                    agreement contained three sets of obligations as follows: (a)     JDD agreed, amongst other things,\n                        that the registration of the Statement with ACRA was lawful, that it would\n                        obtain JDD’s approval for the mortgage and Assignment of Building\n                        Agreement, that within three days of receipt (and in any event no later than\n                        31 January 2010) of the Investment Amount (basically the amount owing from\n                        JDD plus an extra $5m) from CPH it would place this in an escrow account and\n                        execute a charge over the escrow account in favour of the plaintiff, and\n                        that the money in the escrow account would only be used to discharge its\n                        payment obligations to the plaintiff. (b)     CPH represented and warranted that it had the capacity to\n                        raise the Investment Amount and would use the same to fulfil its obligations\n                        to JDD pursuant to the Investment Agreement. It would do so by\n                        31 January 2010 by,inter alia,\n                        transferring such sums of money to JDD as would be sufficient for JDD to\n                        repay the plaintiff. (c)     The plaintiff agreed that when all moneys due to it under the\n                        Construction Contract had been paid, it would withdraw pending adjudication\n                        proceedings and release and terminate the Debenture, discharge the\n                        Assignment of Building Agreement and mortgage, and withdraw the caveats\n                        lodged against the Property. It also agreed to approach the adjudicator\n                        appointed for the SOPA proceedings to request an extension of the\n                        adjudication process up to 31 January 2010 or the date of the Japan Land EGM\n                        to approve the investment by CPH, whichever was\n                earlier. 74     It would be noted that the plaintiff was\n                    willing to allow time for the terms of the Investment Agreement to be\n                    accomplished and in that respect was willing to suspend the adjudication\n                    proceedings that were pending then. The cut-off date for achievement of the\n                    Investment Agreement was 31 January 2010. Until then, although it was not stated\n                    expressly, it could be implied that as long as JDD complied with its obligations\n                    to get JTC’s approval for the mortgage and Assignment of Building\n                    Agreement, the plaintiff would not take enforcement action under the Debenture\n                    or any other security document. This agreement to withhold enforcement action\n                    did not, however, mean that the Debenture was not a valid and enforceable\n                    document. Further, it did not mean that the plaintiff had agreed that JDD need\n                    not comply with its obligations under the Debenture in respect of the assets\n                    charged by that document. 75     I therefore reject the defendants’\n                    submission that the parties had orally agreed not to enforce the Debenture and\n                    that no one was concerned about its terms and conditions. The defendants did not\n                    give a specific date for the conclusion of the oral agreement but, in view of\n                    the evidence, such agreement could not have come about after 6 November 2009\n                    since it was contradicted by the plaintiff’s solicitors’ letter of\n                    10 November 2009. Any oral agreement concluded before the signing of the\n                    Refinancing Agreement on 25 November 2009 would then have been totally\n                    superseded. 76     I accept that from November 2009 until March\n                    2010 there was no attempt to enforce the Debenture but that is a neutral fact\n                    which does not of itself imply that there was an agreement not to enforce the\n                    Debenture at all. The evidence shows that the plaintiff was keen to be paid off\n                    and was convinced that the most efficient route to achieving this aim was to\n                    work with CPH and JDD. That was a commercial decision that the plaintiff was\n                    entitled to make and it did so in the knowledge that it had enforceable security\n                    should payment eventually not be made. The Assignment Agreement 77     The defendants also pleaded that the plaintiff\n                    did not have any right or interest under the Debenture from 12 January 2010,\n                    when the Assignment Agreement was signed, to 17 March 2010 when the Assignment\n                    Agreement was terminated, and therefore was not entitled to any money received\n                    by JDD during that period. The particulars of this pleading stated that the\n                    plaintiff had assigned its rights under the Construction Contract to CPH and the\n                    obligation of the defendants, as JDD directors, were therefore to CPH and not to\n                    the plaintiff. 78     I do not accept this point. It is clear from a\n                    proper reading of the Assignment Agreement that the assignment it contained only\n                    took effect from the date of receipt by the plaintiff of various payments to be\n                    made by CPH as the assignee under cl 2 of the Assignment Agreement. Among these\n                    payment obligations was the liability to pay the plaintiff $154,984,800.40 on or\n                    before 28 January 2010. This sum was not paid on 28 January 2010 or on any date\n                    thereafter. CPH also undertook to deposit $50m in an escrow account by\n                    28 January 2010. This was not done either. The Assignment Agreement\n                    provided that upon the receipt of the sum of $154,984,800.40 and a charge over\n                    the escrow account, the plaintiff would execute a deed of discharge,\n                    reassignment and release in respect of “the Debtor Security\n                    Documents” which included the Debenture. Pending execution of this deed,\n                    nothing in the Assignment Agreement was to “confer on JDD, CPH or Elchemi\n                    any rights to require [the plaintiff] to refrain from exercising any of its\n                    rights under the Debtor Security Documents or be construed as a waiver of any of\n                    [the plaintiff’s] rights under the Debtor Security Documents” (cl\n                    4.3). 79     Therefore, pursuant to the Assignment\n                    Agreement, JDD remained bound by all the security obligations under the\n                    Debenture until and unless CPH made payment as obliged and the plaintiff\n                    executed a deed of reassignment, release and discharge. 80     In court, the defendants submitted that they\n                    were informed of the principal terms of the Assignment Agreement in December\n                    2009 by way of a term sheet circulated by the plaintiff’s in-house\n                    counsel. The second defendant admitted that he had understood from the term\n                    sheet that CPH was to make payment for the assignment. The first defendant,\n                    after quite a bit of prevarication, also admitted that his understanding of the\n                    term sheet was that the assignment was to become effective when CPH paid the\n                    outstanding amount due to the plaintiff. JDD itself received legal advice on the\n                    Debenture and the first defendant was the one who was in contact with the\n                    lawyers. If he did not understand the terms, they would have explained the same\n                    to him. 81     I am satisfied that in fact both defendants\n                    knew and understood that any transfer of interest from the plaintiff to CPH\n                    would only occur when CPH made payment of the outstanding amount of\n                    $154,984,800.40. They were also aware that no payment had been made by CPH up to\n                    17 March 2010. Therefore, they could not have honestly believed during the\n                    relevant period between 12 January 2010 and 17 March 2010 that the plaintiff had\n                    no rights under the Debenture at that time. Belief in CPH 82     This argument is foreshadowed in [49(f)]\n                    above. The defendants submit that they honestly believed that CPH would be able\n                    to provide funding and repay the plaintiff. I accept that submission to a\n                    certain extent. It was clear from the conduct of CPH and its director, Mr Ang,\n                    that CPH was very keen to invest in JDD. This was shown not only by the various\n                    documents that CPH signed but also by Mr Ang’s conduct and assurances.\n                    However, CPH did fail to come up with the amount it had promised to pay the\n                    plaintiff in November 2009 and the defendants must have realised that\n                    CPH’s ability to invest was contingent on it obtaining funding and that\n                    its own resources were not vast. As experienced businessmen, the defendants must\n                    have realised by 31 January 2010, at the latest, when CPH failed to meet its\n                    obligations under the Refinancing Agreement and did not come up with the funds\n                    needed to repay the plaintiff, that CPH was having difficulty and the Investment\n                    Agreement might not be completed. This should have engendered more caution on\n                    their part with respect to the propriety of acting on Mr Ang’s\n                    instructions. In any case, the fact that the defendants always obtained Mr\n                    Ang’s approval prior to making any payment from the DBS Account is\n                    immaterial. Mr Ang was not authorised to approve the expenditure of money that\n                    was held on trust for the plaintiff. 83     Further, even if the defendants were entitled\n                    to believe completely in CPH’s ability to undertake the investment and\n                    repay the plaintiff, this does not absolve the defendants from the consequences\n                    of using the charged moneys to pay third parties. InRoyal\n                        Brunei, Lord Nicholls observed at 393 that: The Court of Appeal held that it was not established that B.L.T. was\n                        guilty of fraud or dishonesty in relation to the amounts it held for the\n                        airline. Their Lordships understand that by this the Court of Appeal meant\n                        that it was not established that the defendant intended to defraud the\n                        airline. The defendant hoped, maybe expected, to be able to pay the airline,\n                        but the money was lost in the ordinary course of a poorly-run business with\n                        heavy overhead expenses. These facts are beside the point.The defendant had no right to employ the money in the business\n                            at all. That was the breach of trust. The company’s inability to\n                            pay the airline was the consequence of that breach of trust.[emphasis added] Honest belief 84     The defendants also argue that the various\n                    expenses that JDD paid with funds from the DBS Account were either for the\n                    benefit of the Data Centre and required to preserve the security under the\n                    Debenture, or were necessary for other reasons. As a general observation, this\n                    argument does not excuse the unauthorised application of funds. Where payments\n                    were necessary to preserve the security under the Debenture, the defendants\n                    could have notified the plaintiff of the same and obtained the plaintiff’s\n                    approval for payment. It is highly unlikely that the plaintiff would have\n                    refused to authorise payment for items like property tax and insurance premiums.\n                    Where the payments related to JDD’s other obligations, the plaintiff\n                    should still have been notified and if it had refused authorisation, such\n                    refusal would have had to be obeyed. 85     Quite apart from the question of authority\n                    from the plaintiff, in my view, there are a number of items which an objective\n                    person would have realised had nothing to do with the security and that the\n                    plaintiff was very likely to refuse to agree to payment of the same. In those\n                    cases especially, on the objective standard, the defendants were acting\n                    dishonestly in authorising payment without reference to the plaintiff. Many of\n                    these payments were made after 31 January 2010 when CPH was in default of its\n                    obligations under the Refinancing Agreement and the prospects of completion of\n                    the Investment Agreement were more uncertain. 86     The particular payments which I consider the\n                    defendants could not honestly have believed to be in the interest of preserving\n                    the security are the following: (a)     Payment of $300,000 on 14 January\n                        2010 to CPH as 10% of its management fee payable for managing the Data\n                        Centre. (b)     $2.98m\n                        paid on 25 January 2010 for fitting out works in the Data Centre (these were\n                        needed for future business of the Data Centre, not its physical condition as\n                        security). (c)     $334,478.69 paid to Japan Land on 4 February 2010 in relation to interest\n                        due on some preference shares. The second defendant’s explanation was\n                        that this was done so that the Investment Agreement was not held up but the\n                        necessity for this payment at that time is not obvious. The first defendant\n                        had testified that Japan Land was not demanding payment. (d)     $300,000 paid to Japan Land in respect\n                        of interest on a loan given to JDD by Japan Land. CPH had taken over the\n                        debt and payment was allegedly needed to prevent Japan Land from suing CPH\n                        and upsetting the investment. Again, this payment had nothing to do with the\n                        Data Centreper seand there was no evidence\n                        that there was a serious likelihood of CPH actually being sued. In any case,\n                        at the time payment was made, CPH was already in default of its obligations\n                        under the Refinancing Agreement and, had they thought about it, the\n                        defendants would have realised that the plaintiff was unlikely to authorise\n                        such payment. (e)     The sum of $200,000 paid to DBS Bank as a fund-raising fee on 23 February\n                        2010. This fee was payable by CPH and there was no legal obligation on JDD\n                        to pay it. The payment was not necessary to safeguard the Data\n                        Centre. (f)     Substantial payments were made to JDD’s consultants for services that\n                        had already been rendered. These companies could have sued JDD but they had\n                        no claim against the Data Centre and it was therefore wrong, in the light of\n                        the security given to the plaintiff, for JDD to prefer these consultants\n                        over its obligations to the plaintiff by using the plaintiff’s money\n                        to settle their bills. Summary 87     For the reasons given above, I have come to\n                    the conclusion that the defendants dishonestly assisted JDD in its breach of\n                    trust when it applied moneys from the DBS Account towards payment of JDD’s\n                    obligations without the prior consent of the plaintiff. I also find that the\n                    defendants are not entitled to defend the claim on the basis of the defences\n                    pleaded. Accordingly, I hold the defendants liable jointly and severally for the\n                    plaintiff’s claim.",
        "Inducement of breach of contract": "88     For the defendants to be liable for inducing a\n                    breach of contract between JDD and the plaintiff, the plaintiff must show\n                    that: (a)     the defendants knew of the contract\n                        and intended for it to be breached; (b)     the defendants induced the breach; and (c)     the contract was breached and damage\n                        was suffered. Did the defendants know of the contract and intend for it to be\n                breached? 89     There is no dispute that as JDD’s\n                    directors, the defendants knew about the Debenture and Security Undertaking. I\n                    have also found that they knew or were in a position to know the import of the\n                    Debenture in relation to Monetary Claims. The dispute is whether the defendants\n                    intended for the Debenture to be breached. 90     On intention,Tribune\n                        Investment Trust Inc v Soosan Trading Co Ltd[2000] 2 SLR(R) 407\n                        (“Tribune Investment Trust”) at\n                    [17] held that the inquiry into the procurer’s intention was an objective\n                    determination and the defendant must be found to have intended to interfere with\n                    the plaintiff’s contractual rights knowingly. Normally, this would involve\n                    some deliberate conduct by the defendant in order for the action to succeed. The\n                    state of mind needed for intention to be found was stated by Lord Hoffmann inOBG Ltd and another v Allan and others[2008]\n                    1 AC 1 (“OBG Ltd”) at\n                    [42]–[43] in the following terms: 42    … It is necessary for this purpose to\n                            distinguish between ends, means and consequences. If someone knowingly\n                            causes a breach of contract, it does not normally matter that it is the\n                            means by which he intends to achieve some further end or even that he\n                            would rather have been able to achieve that end without causing a\n                            breach. … 43    On the other hand, if the breach of contract is\n                            neither an end in itself nor a means to an end, but merely a foreseeable\n                            consequence, then in my opinion it cannot for this purpose be said to\n                            have been intended. … 91Zim Integrated Shipping\n                        Services Ltd v Dafni Igal[2010] 2 SLR 426 at [19] supports the\n                    above proposition. It would be insufficient if the acts committed merely had the\n                    effect of breaching the contract. It was thus stated in Gary Chan Kok Yew and\n                    Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2011) at para 15.009 that the requisite intention is only\n                    satisfied if the inducer has intended the breach of contract as an end in\n                    itself, or as a means to a desired end. The authors appear to viewTribune Investment Trustas being consistent withOBG Ltdand the authorities cited inTribune Investment Trustappear to agree with the view\n                    that the breach must have been intended. This is so even in the case where two\n                    parties enter into a contract which is incompatible with the contract that one\n                    party had with a third party: seeBritish Motor Trade\n                        Association v Salvadori and others[1949] 1 Ch 556. 92     Here, it is perhaps possible to argue that\n                    although the defendants knew about the terms of the Debenture or were reckless\n                    in making the various payments, they did not have any intention of inducing a\n                    breach of contract between JDD and the plaintiff. Most of the payments were to\n                    meet the ordinary expenses of the Data Centre like the utility bills or so as to\n                    get CPH on board. The latter aim was to be accomplished by ensuring that no\n                    unfavourable developments took place during the period in which the parties were\n                    awaiting completion of the Investment Agreement. However, I think this argument\n                    fails. I have held that the defendants dishonestly assisted JDD in a breach of\n                    trust. It must follow that they intended to breach the terms of the Debenture\n                    when they used the plaintiff’s money to pay third parties. The breach of\n                    contract here was “a means to an end” in Lord Hoffmann’s\n                    words and, objectively, established an intention to knowingly interfere with the\n                    plaintiff’s rights. Are the defendants protected by “Said v\n                    Butt”? 93     In their defence, the defendants relied on the\n                    rule inSaid v Butt[1920] 3 KB 497\n                        (“Said v Butt”) which states\n                    that agents are not liable if it can be shown that they had actedbona fidein the circumstances and within the scope of\n                    their authority. The plaintiff’s view is that the defendants cannot have\n                    actedbona fidebecause they disregarded the terms\n                    of the Debenture which prohibited JDD from spending the GST Refund moneys other\n                    than to repay the plaintiff. The question here is whether theSaid v Buttrule applies on the facts. 94Said v Buttwas\n                    a case of contract formation. In that case, the plaintiff had obtained a ticket\n                    for a theatre play via a friend’s agency because he knew that if he\n                    applied for a ticket directly, he would be refused. His friend did not disclose\n                    that the ticket was for the plaintiff. On the day of the performance, the\n                    defendant, a director of the theatre, refused to let the plaintiff into the\n                    theatre and the plaintiff sued the defendant for procuring a breach of contract\n                    between the theatre and him. The court held, first, that no valid contract had\n                    been formed because the plaintiff’s identity was material to the formation\n                    of the contract formation and it had not been disclosed. Second, if a valid\n                    contract had been formed, the defendant was not liable to the plaintiff because\n                    he had actedbona fidewithin the scope of his\n                    authority. The court held (at 506) that: … if a servant actingbona fidewithin the scope of his authority procures or causes the breach of a\n                        contract between his employer and a third person, he does not thereby become\n                        liable to an action of tort at the suit of the person whose contract has\n                        thereby been broken. … 95Said v Buttwas\n                    followed inChong Hon Kum Ivan v Levy Maurice[2004] 4 SLR(R) 801 (“Ivan Chong”).\n                    Woo Bih Li J noted (at [26]) that subsequent toSaid v\n                        Butt, the Supreme Court of New South Wales had endorsed the\n                    principle that a director is not liable in tort for a company’s breach of\n                    contract if the director was acting within the scope of his authority. InNagase Singapore Pte Ltd v Ching Kai Huat[2008] 1 SLR(R) 80 (“Nagase”) at\n                    [9], I made the observation that the rule inSaid v\n                        Buttwas meant to “protect persons in\n                        authority within corporate entities who genuinely and honestly endeavoured\n                        to act in the company’s best interests.” [emphasis\n                    added]. On the facts inNagase, I held that the\n                    rule therefore did not apply to a person who wrongfully and dishonestly caused\n                    his employer to overcharge its customers. I should add that the facts inNagasewere quite different in that the\n                    defendant there was the owner and controlling mind of the company and stood to\n                    gain personally from his actions in relation to the company. Here, it is\n                    certainly arguable that, focussed as they were on achieving the continued\n                    existence of JDD through the completion of the Investment Agreement, the\n                    defendants considered that paying JDD’s other liabilities was the right\n                    thing to do. After all, the plaintiff had additional security in the form of the\n                    Data Centre and CPH would have to fully discharge JDD”s liabilities to\n                    the plaintiff on completion of the investment. The difficulty here arises from\n                    the fact that JDD was in a situation where a choice had to be made between\n                    creditors. On the one hand, it was in JDD’s interest to pay various\n                    obligations to third parties, any of whom could have brought action against JDD.\n                    On the other hand, it was also in its interest to abide by the terms of the\n                    Debenture. 96     The facts inNg Joo Soon v\n                        Dovechem Holdings Pte Ltd and another suit[2011] 1 SLR 1155\n                        (“Ng Joo Soon”) address theSaid v Buttrule as well. In that case, the\n                    plaintiff was removed as a director of the defendant company when he reached 70\n                    years of age. He sought a declaration that he was wrongfully removed and an\n                    order that he be allowed to inspect certain company records. He also claimed\n                    against the other directors (who were his family members) for inducing breach of\n                    agreements between him and the defendant company. Philip Pillai J held that the\n                    fact that the persons sued were directors of the company would not,ipso facto, give rise to a separate personal cause of\n                    action of inducing breach of contract. They might have been mistaken with\n                    respect to their contractual obligations towards the plaintiff, but that would\n                    not mean that they had acted withoutbona fides.\n                    It would not put them beyond theSaid v Buttrule\n                    (at [77]). The difference between that case and this is the presence of\n                    dishonesty here. 97     The evidence here pointed towards the\n                    defendants doing everything they could to carry on the business of JDD normally\n                    so as to cooperate with CPH and keep it on board. They did put the interests of\n                    CPH as the potential new owner of JDD ahead of those of the plaintiff but that\n                    was because they were hopeful that CPH would pay the plaintiff off. Also,\n                    perhaps there is a distinction between defendants who act beyond their scope of\n                    authority and those who actwronglywithin the\n                    scope of their authority. The facts show that the defendants here fall within\n                    the latter category as it was within their authority to approve and make payment\n                    of JDD’s various debts but they did so wrongfully and in breach of\n                    JDD’s obligations under the Debenture. The question is whether they can be\n                    said to have actedbona fidein the interests of\n                    JDD when they knew their actions would cause JDD to breach the Debenture. I\n                    have, somewhat reluctantly, come to the conclusion that on balance they were not\n                    actingbona fidein these circumstances. I\n                    conclude, albeit with some hesitation, that they fall outside theSaid v Buttrule. They must, therefore, also be held\n                    liable for inducing a breach of contract.",
        "Fraudulent trading": "Was the allegation of fraud sufficiently pleaded? 98     The defendants object to this cause of action\n                    on the basis that the allegation of fraud was not sufficiently\n                pleaded. 99     Order 18, r 12(1)(a) of the Rules of Court\n                    (Cap 322, r 5, 2006 Rev Ed) reads: 12.—(1) Subject to\n                        paragraph (2), every pleading must contain the necessary particulars of any\n                        claim, defence or other matter pleaded including, without prejudice to the\n                        generality of the foregoing words — (a) particulars of any\n                                misrepresentation, fraud, breach of trust, wilful default or undue\n                                influence on which the party pleading relies; … 100    It is clear that an allegation of fraud must\n                    be distinctly alleged and proved and cannot be inferred from the facts. InTan Boon Hock v Aero Supplies Systems Engineering Pte\n                        Ltd[1993] SGHC 237, L P Thean JA held that in an action\n                    based on the tort of deceit, there were certain essential elements that had to\n                    be specifically pleaded which had not been pleaded by the plaintiff. On that\n                    basis, he held that the claim based on fraud could not be\n                sustained. 101    Here, the plaintiff’s pleadings were\n                    sufficiently detailed to sustain an action of fraudulent trading. In its\n                    statement of claim, it had referred to the material acts of the defendants that\n                    it intended to rely on to sustain its case based on fraudulent trading. Given\n                    that the objective of pleadings is to enable the other side to prepare his case\n                    so he can meet the case against him and to facilitate trial proceedings by\n                    limiting the issues to be tried and for which discovery is required (Singapore Civil Procedure 2015, vol 1 (G P Selvam gen\n                    ed) (Sweet & Maxwell Asia, 2015) at para 18/12/2), I consider that the\n                    pleadings here were adequate. Are the ingredients of s 340 of the Companies Act met? 102    Section 340(1) of the Act reads: 340.—(1) If, in the course of the\n                        winding up of a company or in any proceedings against a company,it appears that any business of the company has been carried on\n                            with intent to defraud creditors of the company or creditors of any\n                            other person or for any fraudulent purpose, the Court, on the\n                        application of the liquidator or any creditor or contributory of the\n                        company, may, if it thinks proper to do so, declare thatany person who was knowingly a party to the carrying on of the business\n                            in that manner shall be personally responsible, without any\n                        limitation of liability, for all or any of the debts or other liabilities of\n                        the company as the Court directs. [emphasis added] A plain reading of the provision shows that there are two\n                        limbs that the plaintiff has to prove in order to succeed in its case of\n                        fraudulent trading. First, the plaintiff has to show that the business of\n                        the company had been carried on with the intention of defrauding the\n                        company’s creditors or any other person or for any fraudulent purpose.\n                        Next, it has to show that the defendants were knowingly parties to the\n                        business being carried out in that manner. Was the company’s business carried out with intent to defraud\n                creditors? 103    InTang Yoke Kheng\n                        (trading as Niklex Supply Co) v Lek Benedict[2005] 3 SLR(R) 263\n                        (“Tang Yoke Kheng”), the Court\n                    of Appeal held at [7] in relation to fraud that: … To defraud someone is to cheat him, but what is cheating? The\n                        best that one can say is that it is an act or omission in which the\n                        fraudster deceives the innocent party so as to enrich the fraudster, or\n                        cause the innocent party to suffer a loss or detriment. But the fraudster or\n                        cheat may achieve his objective in any number of ways. The only invariable\n                        element is the element of dishonesty on the part of the fraudster or cheat.\n                        Whether any given circumstances amount to fraud is a question of fact to be\n                        determined by the court … Whilst the definition of fraud is somewhat open-ended, it is\n                        clear that for it to exist there must be an element of dishonesty which\n                        results in deception of an innocent party. The Court of Appeal also held\n                        that the objective standard of what an honest person would have done in the\n                        circumstances was not the sole test of dishonesty because it meant that the\n                        court had to be convinced that the negative answer in the circumstances\n                        would amount to fraud:Tang Yoke Khengat\n                        [9]. 104    Belinda Ang Saw Ean J decided inLiquidator of Leong Seng Hin Piling Pte Ltd v Chan Ah\n                        Lek[2007] 2 SLR(R) 77 (“Leong Seng Hin\n                        Piling”) that the subjective intention of the defendant\n                    that he had acted in good faith constituted evidence which the court evaluated\n                    and tested against the weight of the other objective facts available and, if\n                    required, the objective standard of the reasonable man. In this light, the\n                    defendants’ submission that “fraud has to be looked at\n                    subjectively” must be rejected. 105    The standard of proof was also established\n                    inTang Yoke Khengat [14] to be one on a balance\n                    of probabilities. However, the more serious the allegation, the more the\n                    plaintiff would have to do to establish his case. 106    The defendants raised two other cases in\n                    their submissions:Welham v Director of Public\n                        Prosecutions[1961] 1 AC 103 (“Welham”) at 123 andIn Re London and\n                        Globe Finance Corporation, Limited[1903] 1 Ch 728\n                        (“London and Globe Finance\n                    Corporation”) at 733. However, these were not referred to in\n                    the Singapore decisions on s 340 of the Act. In any case, the two cases pertain\n                    to very different facts.Welhaminvolved a case of\n                    forgery andLondon and Globe Finance Corporationinvolved the issue of whether leave should be given to institute criminal\n                    proceedings against the directors of a company and whether the costs of\n                    prosecution should be paid out of the company’s assets. As such, they are\n                    immaterial to the outcome of this case. 107    Here, in my judgement, the plaintiff has not\n                    proved that JDD was carrying on business with a fraudulent purpose to deceive\n                    its creditors. All the plaintiff relied on to prove its case was that the\n                    defendants expected to receive the GST Refund and that they knew JDD’s\n                    assets were subject to a fixed charge in favour of the plaintiff. However, the\n                    Debenture and the other security documents, including the Refinancing Agreement,\n                    were entered into specifically to allow JDD to carry on the business of building\n                    the Data Centre and readying it for occupation while attempting to raise funds\n                    to pay off the plaintiff. While the parties envisaged that the funds would come\n                    from CPH, it was not inconceivable that if CPH could not perform another buyer\n                    could be found on completion of the Data Centre. To get a good price, it was\n                    essential that the Data Centre be completed and the plaintiff knew this. The\n                    plaintiff knew, or must have known, that JDD would continue to incur some\n                    indebtedness in the course of completing the project. The plaintiff did not\n                    object to this happening as long as, to its knowledge, its money was not used to\n                    pay such expenses. The plaintiff may have thought that JDD was paying for its\n                    expenses by other means instead of using the GST Refund moneys. In any case, it\n                    did not ask about this and was content to rest on its security\n                    documentation. 108    As stated earlier, the more serious the\n                    allegation, the more convincing the proof must be for a finding of liability.\n                    Ang J held inLeong Seng Hin Pilingat [17] that\n                    “[t]he emphasis is on the need for convincing evidence” and the\n                    section is not engaged in every case where an individual creditor has been\n                    defrauded in the course of the carrying on of the business of the company. The\n                    section requires carrying on business with an intent to defraud. As I mentioned\n                    above, it was the intention of all the parties including the plaintiff that the\n                    business of JDD should be carried on. No doubt the plaintiff did not expect\n                    money charged to it to be used to pay other debts but such payments were not\n                    made by the defendants with a general intention to defraud JDD’s\n                    creditors. In my judgment, the plaintiff has not discharged its burden of\n                    proof here and, on this limb, the plaintiff’s case under s 340(1) must\n                    fail.",
        "Conclusion": "109    For the reasons given above, the plaintiff\n                    has succeeded in its claim against the defendants. I therefore order the\n                    defendants jointly and severally to pay the plaintiff the sum of $5,348,413.51\n                    together with interest at the court rate from the date of the writ. The\n                    plaintiff is entitled to costs. I will hear the parties on the quantum of costs\n                    and on whether any orders for an account need to be made in respect of other\n                    sums that may have been paid by JDD from Monetary Claims between 28 October 2009\n                    and the end of March 2010. I am not sure that there are such sums and hence am\n                    not making any order for an account yet."
    }
}