{
    "case_title": "Kori Construction (S) Pte Ltd\n      v\n      Nam Hong Construction & Engineering Pte Ltd",
    "ncitation": "[2015] SGHC 25",
    "coram": "Hoo Sheau Peng JC",
    "sections": {
        "Background facts": "3       The brief facts are as follows. Kori was a sub-contractor for the MRT Downtown Line project. In turn, the respondent, Nam Hong Construction & Engineering Pte Ltd (“Nam Hong”), was Kori’s sub-contractor for the scope of works set out under Clause 2 of a Letter of Award dated 23 January 2013: 2. SCOPE OF SUB-CONTRACT WORKS [Nam Hong’s] scope of works shall consist of fabrication, loading and unloading of steel strutting works including connection plates and stiffeners as per specification. [Nam Hong is] required to provide sufficient qualified personnel and equipment to carry out the works according to the schedule. 4       For these works, Nam Hong issued 11 invoices to Kori. Kori paid the amounts due for the first ten invoices, but did not do so for the 11th invoice. Nam Hong sued Kori in the District Court for the amount of $147,538.39 due under the 11th invoice. 5       At this juncture, it is appropriate to set out the licensing regime under Part VA of the BCA. Section 29B(2) requires any person who carries on the business of a general builder or specialist builder to be in possession of a general builder’s licence or specialist builder’s licence respectively. Section 29B(3) makes it an offence to carry on the business of a general builder or specialist builder without the appropriate licence. Section 29B(4) then states: Subject to the provisions of this Act, a person who carries out any general building works orspecialist building worksin contravention of subsection (2) shall not be entitled to recover in any court any charge, fee or remuneration for the general building works or specialist building works so carried out. [emphasis added] 6       At the relevant time, Nam Hong did not hold a general builder’s licence or a specialist builder’s licence from the Building and Construction Authority (“the Authority”). Before the District Judge, Kori raised a preliminary question of law,viz, whether Nam Hong is prevented by s 29B(4) of the BCA from pursuing its claim on the basis that Nam Hong had carried out specialist building works without a licence as required under the BCA. The issue in dispute was whether Nam Hong had carried out “structural steelwork” being a type of “specialist building works”. 7       “Specialist building works” is defined under s 2 of the BCA. There are seven different types of “specialist building works” listed under seven sub-paragraphs, but only the interpretation of sub-para (d) is relevant in the present case. The relevant portion of s 2 of the BCA reads as follows: 2.—(1)  In this Act, unless the context otherwise requires — ... “specialist building works” means the following types of building works: … (d) structural steelworkcomprising— (i) fabrication of structural elements; (ii) erection work like site cutting, site welding and site bolting;and (iii) installation of steel supports forgeotechnical building works [“Sub-paragraph (d)”] [emphasis added] 8       Before the District Court, it was taken as an undisputed fact that Nam Hong carried out both fabrication of structural elements and erection work, falling within limbs (i) and (ii) of Sub-paragraph (d). It was Nam Hong’s case that the three limbs of Sub-paragraph (d) ought to be read conjunctively. By only carrying out two of the three types of work specified, Nam Hong did not carry out “structural steelwork”, and thus did not require a specialist builder’s licence. Kori contended that the three limbs of Sub-paragraph (d) ought to be read disjunctively, and therefore, that Nam Hong carried out “structural steelwork”.",
        "The decision below": "9       The District Judge agreed with Nam Hong and held that the limbs of Sub-paragraph (d) were to be read conjunctively. While the District Judge accepted that the word “and” may be used in a disjunctive sense, he was of the view that this would depend on the context in which “and” is used. The District Judge referred to the definition of “specialist building works” under s 2 of the BCA as an example of a disjunctive use of the word “and”. To him, the word “and” in that context was used to link different activities listed together which formed part of the same list. The seven sub-paragraphs of the definition listed disparate building works, ranging from piling works to site investigations, as well as “any other building works” which the Minister might declare to be specialist works. In that context, the word “and” was therefore surely intended to be disjunctive ([14] of the Judgment). 10     In relation to Sub-paragraph (d) however, the District Judge held that “structural steelwork” consisted of the three elements listed out therein. In his view, these three elements were not disparate items, but were related and all connected to structural steelwork, forming a set of associated activities ([16] of the Judgment). Hence, in order for a given building work to qualify as “structural steelwork” under the BCA, it had to encompass all three elements under Sub-paragraph (d). 11     As the works carried out by Nam Hong did not satisfy all three elements of Sub-paragraph (d), they were not “specialist building works”, and Nam Hong did not require a specialist builder’s licence. The District Judge therefore found that Nam Hong was not barred by s 29B(4) of the BCA from bringing a claim under the 11th invoice.",
        "The issue in this appeal": "12     In this appeal, parties proceeded on the basis that the question whether Nam Hong carried out “structural steelwork” (“the narrow issue”) would determine the broader issue whether Nam Hong is precluded by s 29B(4) of the BCA from pursuing its claim against Kori under the 11th invoice. 13     As stated above at [8], Nam Hong had accepted in the proceedings below that it performed both fabrication and erection work within the meaning of limbs (i) and (ii) of Sub-paragraph (d). However, before me, Nam Hong took the position that it did not perform erection work under limb (ii), as those works were done off-site, and not on-site. This contention however is immaterial. Since it was not disputed that Nam Hong did perform fabrication under limb (i), the parties accepted that if I found that Sub-paragraph (d) should be read disjunctively, Nam Hong would be precluded by s 29B(4) of the BCA from pursuing a claim under the 11th invoice. As such, I did not separately consider whether it would be open to Nam Hong to dispute Kori’s reliance on s 29B(4) of the BCA on any other ground. I was only required to consider the narrow issue of whether the three limbs of Sub-paragraph (d) should be read conjunctively or disjunctively. With that, I turn to the parties’ respective arguments.",
        "Kori’s case": "14     Before me, Mr Twang, counsel for Kori, argued that Sub-paragraph (d) should be construed disjunctively. In support of this argument, Mr Twang relied on the case ofLim Lye Hiang v Official Assignee[2012] 1 SLR 228 (“Lim Lye Hiang”). There, the Court of Appeal read the two limbs of s 78(1) of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“Bankruptcy Act”) disjunctively even though the word “and” was used to connect both limbs. The relevant provision reads as follows: 78.—(1) The property of the bankrupt divisible among his creditors (referred to in this Act as the bankrupt's estate)shall comprise- (a)    all such property as belongs to or is vested in the bankrupt at the commencement of his bankruptcy or is acquired by or devolves on him before his discharge;and (b)    the capacity to exercise and to take proceedings for exercising all such powers in or over or in respect of property as might have been exercised by the bankrupt for his own benefit at the commencement of his bankruptcy or before his discharge. [emphasis added] 15     The Court of Appeal inLim Lye Hiangalso noted that the word “and” may be used in a disjunctive sense where various paragraphs which are joined by the word merely set out a list of different objects or classes of objects, related only by the fact that they qualify to be in that list (at [35]). Mr Twang argued that the wording of Sub-paragraph (d) was directly analogous to that of s 78(1) of the Bankruptcy Act, as in both cases the word “comprise” (or related forms thereof) was used in conjunction with “and”. Mr Twang argued that the phrasing of Sub-paragraph (d) was precisely the situation contemplated by the Court of Appeal inLim Lye Hiang, and Sub-paragraph (d) should therefore be interpreted disjunctively. 16     Mr Twang also highlighted the fact that structural steelwork which qualified as “minor specialist building works” under s 29A(1)(b) of the BCA included only structural steelwork comprising “fabrication and erection work” for structures below certain specified dimensions. Mr Twang argued that as “minor specialist building works” are by definition a sub-set of “specialist building works”, the fact that s 29A(1)(b) did not include “installation of steel supports for geotechnical building works” – limb (iii) of Sub-paragraph (d) – showed that Sub-paragraph (d) ought to be read disjunctively in order to avoid inconsistency between the two provisions.",
        "Nam Hong’s case": "17     Counsel for Nam Hong, Mr Hanam, did not dispute that the word “and” could be read disjunctively. However, he submitted that whether “and” ought to be read disjunctively or conjunctively depends on the overall context of the statute and parliamentary intention. In the context of Sub-paragraph (d), Mr Hanam argued that the three limbs therein should be read conjunctively for a number of reasons. 18     First, the object of the licensing regime was to ensure that contractors who performed high risk work had the requisite competence. A conjunctive reading of Sub-paragraph (d) was thus appropriate as Parliament had intended for “structural steelwork” to only catch geotechnical building works which were high risk and inherently dangerous. Fabrication of structural elements and erection work, by themselves, were not such high risk and dangerous works. There was therefore no reason to require Nam Hong, which only carried out the cutting and welding of beams and the drilling of holes in connection plates, to be licensed as the works carried out by Nam Hong were not inherently dangerous. If the limbs of Sub-paragraph (d) were read disjunctively, nearly every contractor would have to be licensed. 19     Second, given the linguistic cannon of construction that Parliament does nothing in vain, the court must endeavour to give significance to every word in an Act of Parliament. The word “and” in Sub-paragraph (d) was used for a purpose and thus should not be disregarded. Mr Hanam also argued that the word “comprise” in Sub-paragraph (d) should be read to mean “consisting of” or “composed of”. This, together with the word “and”, reinforced his point that the limbs of Sub-paragraph (d) should be read conjunctively. 20     Third, Mr Hanam submitted that in order for criminal sanctions to be imposed on parties, the law should clearly specify the acts (or omissions) which would constitute an offence. Hence, a strict (ie, conjunctive) reading of “structural steelwork” is warranted because of the penal consequences for carrying on the business of a specialist builder without a licence under s 29B(3) of the BCA. 21     Fourth, it was also argued that Nam Hong did not fall under the definition of “builder” under s 2 of the BCA. The definition of “builder” under s 2 of the BCA is set out as follows: … [A]ny person who undertakes, whether exclusively or in conjunction with any other business, to carry out any building works for his own account or for or on behalf of another person (referred to in this definition as A),but does not include any person who contracts with a builder for the execution by that person of the whole or any part of any building works undertaken by the builder for or on behalf of A under a contract entered into by the builder with A. [emphasis added] 22     The definition of “builder” excludes “any person who contracts with a builder for the execution by that person of the whole or any part of any building works undertaken by the builder”. Therefore, a sub-contractor would not be considered a “builder” under s 2 of the BCA. On this basis, Mr Hanam argued that the BCA did not apply to Nam Hong as Nam Hong was only a sub-contractor for Kori. 23     In response to Mr Twang’s reliance on the definition of “minor specialist building works” under s 29A(1)(b), Mr Hanam essentially argued that there would be no inconsistency between that provision and Sub-paragraph (d)  if the limbs of Sub-paragraph (d) were read conjunctively. Mr Hanam submitted that Parliament did not include the requirement of “installing steel supports for geotechnical works” into s 29A(1)(b) because such installation works could not be regarded as “minor”. Accordingly, he submitted that the definition of “minor specialist building works” under s 29A(1)(b) should not affect the interpretation of Sub-paragraph (d) as being conjunctive.",
        "My decision": "24     It was not in contention that the word “and” may be used in a disjunctive sense. This was accepted by Nam Hong. Indeed, in the context of the definition of “specialist building works” itself, Nam Hong accepted that the word “and” must be read disjunctively,ie, that satisfying any one of the seven sub-paragraphs under the definition of “specialist building works” would be sufficient to constitute “specialist building works”. Nam Hong also accepted that “ground support and stabilisation” under sub-para (b) of the definition of “specialist building works” under s 2 of the BCA includes different activities such as installation and testing of ground anchors to ground treatment like chemical grouting, and that the word “and” under sub-para (b) is used in a disjunctive manner. 25     Here, I would highlight that sub-para (c) is also likely to be read disjunctively. “Site investigation work” under sub-para (c) comprises different activities such as field investigations, logging and geological mapping. It is clear to me that not all these activities have to be done for one to have carried out “site investigation work”. 26     What then of the interpretation of Sub-paragraph (d)? I noted that s 9A of the Interpretation Act (Cap 1, 2002 Rev Ed) (“Interpretation Act”) required me to interpret the BCA in a manner which would promote its purpose or object. InDorsey James Michael v World Sport Group Pte Ltd[2013] 3 SLR 354 at [18], the Court of Appeal held that s 9A of the Interpretation Act mandates a purposive approach to be taken in statutory interpretation. The purposive approach is paramount, and takes precedence over any other common law principle of statutory interpretation, including the principle advanced by Nam Hong that penal statutes should be construed strictly. 27     The remarks of V K Rajah JA, as he then was, inPublic Prosecutor v Low Kok Heng[2007] 4 SLR(R) 183 at [57] are apposite: … s 9A of the Interpretation Act mandates that a purposive approach be adopted in the construction of all statutory provisions, and allows extrinsic material to be referred to, even where, on a plain reading, the words of a statute are clear and unambiguous. The purposive approach takes precedence over all other common law principles of interpretation. However, construction of a statutory provision pursuant to the purposive approach stipulated by s 9A is constrained by the parameters set by the literal text of the provision. … The general position in Singapore with respect to the construction of written law should be the same whether the provision is a penal or civil one.Purposive interpretation in accordance with s 9A(1) of the Interpretation Act is the paramount principle of interpretation even with respect to penal statutes; it is only in cases where penal provisions remaining ambiguousnotwithstandingall attempts at purposive interpretation that the common law strict construction rule may be invoked.[emphasis in italics in original; emphasis in bold added] 28     Hence, in the context of Sub-paragraph (d), the questions which I had to answer were what the purpose and object of the licensing regime within the BCA is, and whether that purpose and object would be promoted by a conjunctive or disjunctive interpretation of Sub-paragraph (d). The fact that there are penal consequences involved is not a relevant consideration unless Sub-paragraph (d) remains ambiguous despite exhausting attempts at a purposive interpretation of the provision.",
        "The purpose and object of the licensing regime under the BCA": "29     The BCA was passed in 1989 to ensure the safety of building works in Singapore. The Nicoll Highway collapse in 2004 due to the failure of underground retainer walls used in the construction of the MRT Circle Line was a further wake-up call for the construction industry. This spurred the Ministry of National Development and the Ministry of Manpower to establish a Joint Review Committee on Construction Safety to examine the then existing regulatory framework and how construction safety could be improved. Pursuant to the review, the BCA was amended in 2008 to put in place measures to enhance professionalism and safety standards in the construction industry, including the regulation of underground building works and a regime to license builders. In 2012, the BCA was also amended to replace the term “underground building works” with “geotechnical building works”. 30     Given that the licensing regime was enacted in the aftermath of the Nicoll Highway collapse, one might argue, as Mr Hanam did, that both the licensing regime and the definition of “structural steelwork” should be confined to geotechnical works, and therefore a conjunctive reading be taken of Sub-paragraph (d). However, the Parliamentary reports in respect of the amendments show that the Minister of State, in moving the Bill, clearly dealt with the topic of regulation of underground building works and the new licensing regime under Part VA separately (Singapore Parliamentary Report,Official Report(20 September 2007), vol 83 at cols 2055–2062 (Grace Fu Hai Yien, Minister of State for National Development)). Given the importance of Parliament’s intention to this interpretative exercise, the Minister of State’s comments in moving the new licensing regime under Part VA are set out in full below: New Part VA on licensing of builders Sir, thebuildersare key players in ensuring construction andbuildingsafety. Clause 9 of the Bill has added a new Part VA to put in place a licensing scheme to set minimum standards of professionalism forbuilders. We will licence general builders and specialist builders engaged in six categories of specialist building works. To be licensed, firms must be financially sound and have good safety records as well. They must also appoint key personnel with suitable qualifications and experience to be responsible for managing the firm and supervising the execution of construction works. The proposed licensing scheme will ensure that our builders are professionally qualified and competent. It will also spur firms to upgrade themselves and, as a result of that, raise the overall competency of the industry. There will be two classes of licence for the general builders.  A licensed Class 1 general builder will be allowed to participate in all projects, while a licensed Class 2 general builder is restricted to projects of value not more than $3 million. For specialist builders, there will be different types of licence,each authorising a specific area of specialist building works to be carried out as a business.  These include specialist works in piling, ground support and stabilisation, site investigation, structural steel, pre-cast concrete and on-site post-tensioning. The intention is to ensure that only competent licensees are allowed to execute these specialist works, given the inherently high risks associated with such works.  A general builder's licence or a specialist builder's licence will be valid for up to three years and is renewable. [emphasis added] 31     From the above, it is evident that the purpose and object of the licensing scheme is to set standards for builders, enhance professionalism and competency, and ensure safety in building and construction.  In dealing with the licensing regime, the Minister of State referred generally to builders and not only to builders dealing with geotechnical works. There is nothing in the Parliamentary debate to suggest that the licensing regime in relation to structural steelwork should be confined only to geotechnical or underground works. It is clear that Parliament’s intention was for the licensing regime to apply to building works generally.",
        "A disjunctive reading of Sub-paragraph (d) would promote the purpose and object of the licensing regime": "32     Taking a purposive approach, I was satisfied that a disjunctive reading would promote the purpose and object of the licensing regime. First, a disjunctive reading of the three limbs would enhance professionalism and safety in construction and building. The fabrication of structural elements, erection work, and installation of steel supports for geotechnical works relate to three distinct activities at different stages of the construction and building process. Each of these activities is highly important. They should each therefore be regulated in the interest of public safety. 33     In contrast, reading all three limbs conjunctively does not accord with Parliament’s intention behind the licensing scheme. There are two ways of reading Sub-paragraph (d) conjunctively, and both interpretations lead to absurd results. The first interpretation (“conjunctive interpretation 1”) entails that one would only carry out “structural steelwork” under Sub-paragraph (d) where all three elements of fabrication of structural elements, erection work, and installation of steel supports in geotechnical building works are present. Under conjunctive interpretation 1, a builder would not have carried out “structural steelwork” under Sub-paragraph (d) if the builder carried out fabrication of structural elements and erection work, but did not carry out installation of steel supports for geotechnical building works. It does not seem likely that Parliament would, in an Act intended to regulate the construction standards of buildings generally, confine the licensing requirements in respect of “structural steelwork” only to the narrow situation where a portion of such work is carried out underground. 34     The second interpretation (“conjunctive interpretation 2”) requires reading the phrase “geotechnical building works” at the end of limb (iii) of Sub-paragraph (d) to apply to limbs (i) and (ii) as well. Conjunctive interpretation 2 leads to the result that only fabrication, erection and installation work ingeotechnicalbuilding works would form “structural steelwork” under Sub-paragraph (d). This was the interpretation that Nam Hong proffered before this Court. Nam Hong argued that Sub-paragraph (d) should be read conjunctively as it was Parliament’s intention for “structural steelwork” to apply only to geotechnical building works. This was not persuasive. 35     Under s 2 of the BCA, “geotechnical building works” are defined as: (a) any excavation or other building works to make — (i) a tunnel with a diameter, width or height of more than 2 metres; or (ii) a caisson, cofferdam, trench, ditch, shaft or well with a depth of more than 6 metres; (b) any building works for constructing, altering or repairing any earth retaining structure in or for a trench, ditch, shaft or well with a depth or height of more than 6 metres; (c) any earthworks or other building works for constructing or stabilising a slope with a height of more than 6 metres (measured as the vertical distance between the highest level and lowest level of the slope); (d) such type of foundation works as the Minister may prescribe in the building regulations for buildings of 30 storeys or more. 36     There are many building works which do not include geotechnical works. Again, similar to the objection to conjunctive interpretation 1 set out at [33] above, the licensing scheme under Part VA of the BCA was intended to regulate the construction of buildingsgenerally. It should not be interpreted to be restricted only to “structural steelwork” carried out underground. In this regard, I noted that the words “geotechnical building works” only appears at the end of the definition of “structural steelwork”. The provision would have been drafted differently if Parliament had intended for only geotechnical building works to be covered. More logically, the words “geotechnical building works” would have appeared at the start, rather than at the end of the definition. 37     Next, the purpose behind the licensing regime may be stultified with a conjunctive reading, since it would be possible to easily avoid the licensing requirements by employing separate contractors to perform separate functions under Sub-paragraph (d). Nam Hong argued that this problem may be resolved by placing the onus to be licensed on the main or supervisory contractor. Further, Nam Hong used the definition of “builder” under s 2 of the BCA to argue that sub-contractors need not be licensed. These arguments were misconceived. 38     While Nam Hong was right in pointing out that a sub-contractor is not defined as a “builder” under s 2 of the BCA, this argument ignored the more specific definition of “builder” under Part VA of the BCA. The legal maximlex specialis derogate legi generaliapplies here. Furthermore, s 2 of the BCA is expressly stated to be subject to situations where the “context otherwise requires”. Clearly, the specific definitions of terms found in s 29A under Part VA of the BCA titled “Interpretation of this Part” govern the interpretation of the provisions found under Part VA. 39     The definition of “builder” for the purposes of Part VA is found in s 29A(1) of the BCA, which provides that a builder is “a general builder or a specialist builder”. Section 29A(2)(a) states that: (a) a person carries on the business of a general builder if the person carries out, or undertakes to carry out, (whether exclusively or in conjunction with any other business) general building works for or on behalf of another person for a fixed sum, percentage, or valuable consideration, or reward other than wages,but not if the person carries out, or undertakes to carry out, general building works only as a sub-contractor[emphasis added]. Hence, a sub-contractor who carries outgeneralbuilding works need not be licensed. 40     In contrast, s 29A(2)(b) states that: (b) a person carries on the business of a specialist builder if the person carries out, or undertakes to carry out, (whether exclusively or in conjunction with any other business) any specialist building works for or on behalf of another person for a fixed sum, percentage, or valuable consideration, or reward other than wages. Crucially, there isno exclusionin s 29A(2)(b) of sub-contractors carrying outspecialistbuilding works from the licensing regime. The BCA makes it clear thatall builders, whether the main contractor or sub-contractor,who carry on specialist building works, must be licensed. The fact that the general definition provides otherwise did not assist Nam Hong’s case. 41     I considered also that the term “structural steelwork” should be read in harmony with the rest of the BCA, specifically, the definition of “minor specialist building works” under s 29A(1) of the BCA. Under s 29A(1)(b) of the BCA, structural steelwork comprising fabrication and erection work for structuresbelow certain specified dimensionsfalls within “minor specialist building works”. This definition does not include installing steel supports for geotechnical building works. Pursuant to s 29B(2)(b), a builder need not possess a specialist builder’s license to carry out “minor specialist building works”. Builders must however possess a specialist builder’s license before they carry out all other “specialist building works”. 42     If the limbs of Sub-paragraph (d) are read conjunctively, this would mean that works which comprise purely of fabrication and erection works would fall outside the ambit of “specialist building works”, regardless of the dimensions of the works. If this were the case, there would have been no need to exclude such works below certain dimensions from the licensing regime (pursuant to s 29A(1)(b)), since such works would already be excluded under a conjunctive interpretation of Sub-paragraph (d). This would effectively render this part of the definition of “minor specialist building works” under s 29A(1)(b) otiose and unnecessary. This could not have been Parliament’s intention. Indeed, the principle of statutory interpretation advanced by Nam Hong, that everywordin an Act of Parliament should be given significance and ought not to be disregarded, was applicable here.A fortori, noprovisionin an Act of Parliament should be interpreted in such a way which would render it otiose. Indeed, Nam Hong’s submission on this point of principle supported the disjunctive interpretation. 43     As a minor point, I noted that the three limbs of “structural steelwork” are split into three sub-paragraphs with each sub-paragraph numbered. This may suggest that the word “and” bears significance and that therefore, the three limbs should be read conjunctively. In my view, the separate sub-numbering was equivocal and did not show that the three limbs should be read conjunctively. Regulation 4(1)(c)(iv) of the Building Control (Licensing of Builders) Regulations 2008 (Cap 29, No S 641) has the same definition for “structural steelwork”, albeit one without separate sub-paragraphs. This point was therefore not helpful.",
        "Conclusion": "44     On the narrow issue, I therefore found that the three limbs of Sub-paragraph (d) should be read disjunctively. Given the concession by Nam Hong that it carried out fabrication work within limb (i), and the further concession by parties that s 29B(4) of the BCA would then be applicable to bar Nam Hong from pursuing the claim, I allowed the appeal. I also ordered the costs of the appeal to be fixed at $8,000 and the costs of the hearing below fixed at $8,000 to be paid by Nam Hong to Kori. 45     As this appeal related only to the determination of the preliminary issue of law, I also ordered the matter to be fixed before the District Judge for the appropriate orders in relation to the action and the costs of the action to be made."
    }
}