{
    "case_title": "AVM\n      v\n      AWH",
    "ncitation": "[2015] SGHC 194",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1       The wife commenced these proceedings on 27\n                    January 2011 seeking divorce on grounds of the husband’s unreasonable\n                    behaviour. The husband initially defended the proceedings but withdrew his\n                    defence in exchange for the wife’s agreement to remove by amendment\n                    certain allegations in her statement of particulars. The wife amended her\n                    particulars as agreed and secured an uncontested interim judgment on 25 October\n                        2011.[note: 1] 2       I now have to determine the ancillary matters.\n                    They comprise: (i) division of the parties’ matrimonial assets; (ii)\n                    maintenance for the wife and for the triplets; and (iii) custody of and access\n                    to the triplets. No issue arises as to care and control of the triplets: it is\n                    common ground that their care and control should rest with the\n                wife. 3       Having considered all of the evidence and\n                    submissions, I have decided: (a)     That a just and equitable division of\n                        the matrimonial assets is to award 60% to the wife and 40% to the\n                        husband; (b)     That\n                        the wife should receive no maintenance for herself but shall be given\n                        liberty to apply in the future for maintenance if circumstances\n                        change; (c)     That the\n                        husband shall pay lump sum maintenance to the wife for the triplets which I\n                        have fixed at a little over $325,000, to be paid to the wife out of the\n                        husband’s share of matrimonial assets; (d)     That the wife shall have sole custody of the\n                        triplets; and (e)     That the husband shall have only supervised access to the triplets, limited\n                        to two hours a week. 4       The husband has appealed against my decision. I\n                    now give my reasons.",
        "The history of the marriage": "5       The husband and the wife married on 9 April\n                    1996. Soon after they married, the husband invited the wife to join his\n                    family’s packaging business. She did so.[note: 2]The husband and wife subsequently left the\n                    husband’s family’s business and set up their own sole proprietorship\n                    known as [P]. They subsequently transferred ownership of [P] to a company known\n                    as [Q] Pte Ltd. The husband and the wife each control 50% of the shares in [Q]\n                    Pte Ltd, but the husband is the sole director.[note: 3]In addition to carrying on business in\n                    its own right, [Q] Pte Ltd was also the holding company for the couple’s\n                    other businesses which included a piano shop and a spa.",
        "April 2009 – the husband discloses his homosexuality to the\n                wife": "6       Sometime in 2008, the wife noticed that the\n                    husband was acting odd and had withdrawn from the family. He would go out alone\n                    and return home drunk, late at night. He began sleeping separately from the\n                        wife.[note: 4] 7       The wife was concerned about the change in the\n                    husband’s behaviour. In January 2009, she engaged a private investigator\n                    to conduct surveillance on the husband. The investigator’s report revealed\n                    that, unknown completely to the wife, the husband was actively and promiscuously\n                    pursuing homosexual liaisons. The wife confronted the husband with the evidence.\n                    He revealed that he was homosexual and admitted that he was engaging in\n                    homosexual liaisons.[note: 5] 8       The wife and the husband agreed to undergo\n                    counselling in order to try to save their marriage. In April 2009, at the first\n                    counselling session, the husband disclosed to the wife that he was HIV\n                        positive.[note: 6] 9       From the last quarter of 2009, the husband began\n                    spending weekends and other stretches of a few days away from his wife and\n                    family. He did so without informing the wife where he was or what he was doing\n                    during these absences.[note: 7]The husband’s conduct naturally caused the wife distress.",
        "January 2010 – the wife moves out of the matrimonial\n                home": "10     In January 2010, the wife concluded that the\n                    husband was not serious about trying to salvage their marriage. She moved out of\n                    the matrimonial home in Sembawang, taking the triplets with her.[note: 8]",
        "February 2010 – personal protection order": "11     In February 2010, the wife sought a personal\n                    protection order against the husband to restrain the husband from committing\n                    family violence on her and on the triplets.[note: 9]The wife’s application was based on three\n                    grounds: (i) battery committed by the husband on the wife in March 2004 and\n                    in February 2010; (ii) the husband’s use of physical force on one of the\n                    triplets in May 2010;[note: 10]and (iii) the\n                    husband’s screaming rages against the other two of the triplets which had\n                    put them in serious fear of him.[note: 11] 12     On 24 February 2010, the wife secured an\n                    expedited order under s 66 of the Women’s Charter (Cap 353, 2009 Rev Ed)\n                    (“Women’s Charter”) restraining the husband from committing\n                    family violence on her and on the triplets.[note: 12]The personal protection proceedings then\n                    went on to a full hearing which took place in October 2010. Witnesses on both\n                    sides were examined and cross-examined. The wife relied on her own evidence. She\n                    also relied on the evidence of four of her colleagues. They all gave evidence of\n                    the husband’s battery of the wife in February 2010. The battery took place\n                    at the parties’ workplace in Serangoon, at a time when she had already\n                    left the matrimonial home. On that day, the wife returned to the workplace\n                    against the husband’s wishes. The husband attempted to remove her by\n                    force, in the presence of several others including the four colleagues who gave\n                    evidence. 13     The husband’s battery of the wife was\n                    real in that the husband applied physical force to the wife’s person\n                    without her consent. It was not, however, serious in that it did not cause the\n                    wife serious physical injuries. Nevertheless, there is no doubt that she was\n                    distressed by the battery and deeply humiliated by the circumstances in which it\n                    took place. 14     The husband all but admitted his battery. In\n                    his written submission to the District Judge – written personally by the\n                    husband as he was then, as now, acting in person – the husband explained\n                    that he had been provoked.[note: 13]The husband’s explanation to the\n                    District Judge, in words unmediated by a lawyer, is as follows:[note: 14] …the occurrence …happened naturally as a result of the\n                        necessity to enforce order in the discharge of office and family duty. As\n                        head of the family, submission is expected in those 2 situations when the\n                        incidence [sic] [of force used against the\n                        wife] occurred. And as head of family business, it is difficult to accept\n                        public display of insubordination or challenge of command and control. It\n                        would not be practical to always enlist the assistance of police to vacate a\n                        family member to settle domestic [and] business affairs which are also\n                        domestic in nature for affairs relating [to] husband and wife. 15     To support her case in the personal protection\n                    proceedings, the wife relied also on the evidence of the triplets. But to spare\n                    them the trauma of cross-examination, she invited the District Judge to speak to\n                    the triplets in chambers. At the husband’s insistence, however, the\n                    triplets were compelled to give evidence formally and were subjected to the\n                    ordeal of cross-examination, albeit by video-link. The husband was, as I have\n                    said, acting in person in the personal protection proceedings. His decision\n                    therefore deliberately put his young children in a position where they would\n                    have to be subjected to cross-examination by their own father. 16     After hearing all the evidence, the District\n                    Judge granted the wife a personal protection order against the\n                        husband.[note: 15]The District Judge, however, declined to grant the triplets a personal\n                    protection order against the husband. He held that such an order was not\n                    necessary for their protection within the meaning of s 65 of the\n                    Women’s Charter.[note: 16]The factual basis for an\n                    order protecting the children, however, was largely undisputed. 17     The District Judge also ordered the husband to\n                    pay to the wife the costs of the personal protection proceedings fixed at\n                        $15,000.[note: 17]The husband has yet to\n                    pay these costs.",
        "March 2010 – the wife sets up her own business": "18     In March 2010, after leaving the matrimonial\n                    home, the wife set up her own business known as [R] Pte Ltd. This is a company\n                    with a paid up share capital of $100,000 out of which the wife owns 99,000\n                    shares of $1 each. [R] Pte Ltd is in the business of packaging\n                    activities.",
        "June 2010 – the wife applies for custody of the\n                triplets": "19     After the wife left the matrimonial home in\n                    January 2010 with the triplets, she allowed the husband to continue to have\n                    access to the triplets. In June 2010, however, the wife applied under the\n                    Guardianship of Infants Act (Cap 122, 1985 Rev Ed) for sole custody, care and\n                    control of the triplets, with the husband to have only supervised and limited\n                    access. She relied on two grounds to support her application. First, she relied\n                    on the same history of family violence against herself and the triplets that she\n                    had relied on in the personal protection proceedings. Second, she relied on the\n                    fact that the husband was in an intimate homosexual relationship with another\n                    man and that the two men had slept together on the same bed with the triplets\n                    while the triplets were in the husband’s care and control.[note: 18] 20     Having heard the parties’ submissions,\n                    the District Judge ordered that the wife have sole custody, care and control of\n                    the triplets with supervised access to the husband and no overnight access. The\n                    order fixed the husband’s access for two hours a week: on Saturdays from\n                    12.00 noon to 2.00 pm at Woodlands Civic Centre.[note: 19] 21     The District Judge also ordered the husband to\n                    pay to the wife the costs of the custody proceedings fixed at\n                        $14,000.[note: 20]The husband has yet to\n                    pay these costs.",
        "2011 – the husband is charged under the Misuse of Drugs\n                Act": "22     In 2011, the husband was charged with five\n                    offences under the Misuse of Drugs Act (Cap 185, 2008 Rev Ed). Two of the\n                    charges accused him of consuming methamphetamines and phenethylamine, both of\n                    those proscribed by the Fourth Schedule to that Act.[note: 21]Three of the charges accused him of\n                    being in possession of ketamine, methamphetamine and utensils for the\n                    consumption of methamphetamine.[note: 22]On the four most serious charges, the\n                    husband faced a maximum penalty of 10 years’ imprisonment, a $20,000 fine\n                    or both. On the least serious charge, he faced a maximum penalty of 3\n                    years’ imprisonment or a $10,000 fine or both. 23     The husband claimed trial to all five charges.\n                    In an affidavit filed in these proceedings, he described his defence as\n                        follows:[note: 23] As regards the alleged drug related offences, I am claiming trial as I did\n                        not commit the offence. The charges related to offences committed abroad and\n                        I have instructed my solicitors to claim trial as the alleged drugs belonged\n                        to my friend and not me. 24     The husband was found guilty on all charges.\n                    He was jailed from April 2013 to September 2013.[note: 24]",
        "2012 – the husband is adjudicated bankrupt": "25     In November 2012, the husband was adjudicated\n                    a bankrupt on the application of the United Overseas Bank Ltd. The debt arose\n                    from the husband’s liability as a guarantor for a loan taken out by one of\n                    the couple’s businesses to purchase a car.[note: 25] 26     A bankruptcy has the potential to exercise a\n                    profound effect on the division of matrimonial assets under s 112 of the\n                    Women’s Charter. I analyse these effects in detail at [108]–[126]\n                    below. My conclusion there is that, on the facts of this case, the\n                    husband’s bankruptcy does not prevent me from exercising my jurisdiction\n                    to divide in a just and equitable manner the couple’s matrimonial assets.\n                    I therefore now consider what such a division would entail.",
        "Division of matrimonial assets": "",
        "The parties’ assets": "27     The parties have disclosed in their affidavits\n                    of assets and means total assets worth $2,650,747.54 falling into three parts:\n                    (i) jointly-held assets worth $1,298,491.94; (ii) assets in the wife’s\n                    name worth $767,805.94; and (ii) assets in the husband’s name worth\n                    $584,449.66. Assets in joint names 28     The jointly-held assets comprise the\n                    following: (a)     The sum of $298,491.94 held by\n                        Mallal & Namazie as stakeholders. This sum represents the net proceeds\n                        of the sale of the parties’ co-owned matrimonial home in Sembawang\n                        which they sold in 2011. (b)     A landed property in Serangoon. The husband values this\n                        property at $1m.[note: 26]The wife\n                        does not give it a value but does not dispute the husband’s\n                        value. (c)     A joint\n                        account with OCBC.[note: 27]There is no evidence of the\n                        balance in this account. I have therefore ascribed it a nil value in the\n                        division of matrimonial assets. To the extent that there are any funds in\n                        this account, the parties are to divide the funds between themselves in the\n                        same proportion as I have ordered them to divide the remainder of the\n                        matrimonial assets. Assets in the sole name of the wife 29     The assets in the sole name of the wife\n                    comprise the following: (a)     An NTUC Income life insurance policy\n                        with a face value of $40,000 and a surrender value of\n                            $30,313.96;[note: 28] (b)     An NTUC Income life insurance policy with a face value of\n                        $46,000 and a bonus sum assured of $7,850;[note: 29] (c)     An MSIG Insurance life insurance policy with a face value\n                        of $75,000 and no surrender value;[note: 30] (d)     30% of the issued and paid-up share capital of [Q] Pte\n                            Ltd.[note: 31]The\n                        husband’s evidence is that these shares have no value;[note: 32] (e)     99% of the issued and paid up share capital of\n                        [R] Pte Ltd valued at $99,000;[note: 33] (f)     20,000 shares in ABR Holdings Ltd valued at\n                            $11,300;[note: 34] (g)     1,836 units in Schroders Global High Yield Fund valued at\n                            $1,509.19;[note: 35] (h)     A current account with DBS with a balance of\n                            $10,037.86;[note: 36] (i)     Cash in hand of about $25,000;[note: 37] (j)     A receivable of $36,000 due from her\n                            brother;[note: 38] (k)     A safe deposit box said to contain nothing of significant\n                            value;[note: 39]and (l)     $546,794.93\n                        in all three sub-accounts of her CPF account.[note: 40] Assets in the sole name of the husband 30     The assets in the sole name of the husband\n                    comprise the following: (a)     Two cars on hire-purchase, a Lexus\n                        350 with an estimated value of $80,000 and a Toyota RAV4, with an estimated\n                        value of $50,000.[note: 41]Both cars have outstanding loans.\n                        The Lexus has since been repossessed for default in payment. The wife has\n                        attributed no value to the remaining car[note: 42]and I attribute nil value to it\n                        in the division of matrimonial assets. (b)     Two NTUC Income life insurance policies with combined\n                        face values of $100,200 and combined surrender values of\n                            $59,592.48;[note: 43] (c)     Shares in a public company and holdings in three\n                        unit trusts valued at $42,496.23;[note: 44] (d)     Three bank accounts with a combined estimated balance of\n                            $4,000;[note: 45]and (e)     $478,360.95 in all three sub-accounts of his CPF\n                            account.[note: 46]",
        "The parties’ positions": "The wife’s position 31     The wife asks that the entirety of the\n                    Serangoon property[note: 47]and of the\n                    net proceeds of sale of the Sembawang property be transferred to her[note: 48]together with a further $200,000\n                    from the husband’s CPF account.[note: 49]She seeks these transfers not only to\n                    resolve the division of matrimonial assets but also to resolve, as a lump sum\n                    award, her claims for maintenance for herself and for the triplets as well as\n                    various other claims she has arising from assets which the husband is alleged to\n                    have dissipated or hidden.[note: 50] The husband’s position 32     The husband asks that the entire Serangoon\n                    property be transferred to him and that the net proceeds of sale of the\n                    Sembawang property be divided equally between the parties.[note: 51]He offers the wife no maintenance at all and proposes that he pay in all $900\n                    per month as maintenance for the triplets.[note: 52]",
        "The law": "33     The court’s duty under s 112 of the\n                    Women’s Charter is to divide the parties’ matrimonial assets\n                    “in such proportion as the court thinks just and\n                    equitable”. 34     The Court of Appeal inBCB\n                        v BCC[2013] 2 SLR 324 (“BCB”) set out the following principles which I bear in\n                    mind: (a)     It is fundamental to the proper\n                        exercise of the power under s 112 of the Women’s Charter that the\n                        court use a broad-brush approach (at [7]). (b)     It is wrong in principle to emphasise unduly or\n                        to focus inordinately on each spouse’s direct contributions (at [8]).\n                        That is only one of the many factors to be considered as part of all the\n                        circumstances of the case in exercising the power to arrive at the just and\n                        equitable division mandated by s 112(1). (c)     The court should not adopt the approach taken\n                        under the predecessor of s 112 by treating the spouses’ direct\n                        contributions as the starting point for a just and equitable division, and\n                        then making adjustments to account for the spouses’ non-financial\n                        contributions (at [9]). (d)     The modern broad-brush approach ensures that the division\n                        arrived at by the court gives effect to the important principle that the\n                        court must take fully into account all indirect contributions of every type\n                        (at [11]) and made by each spouse (at [12] and [34]). 35     The Court of Appeal has more recently made\n                    more explicitly the break with the previous approach to the division of\n                    matrimonial assets. In its very recent decision inANJ v\n                        ANK[2015] SGCA 34 (“ANJ”), the Court of Appeal cautioned – once again\n                    – against the approach of taking the parties’ direct contributions\n                    as the starting point and adding an uplift to account for their respective\n                    indirect contributions. Adopting that approach carries the risk both of\n                    undervaluing and of overvaluing non-financial contributions:ANJat [19] and [20]. Both outcomes are contrary to the duty\n                    under s 112 of the Women’s Charter to arrive at a just and equitable\n                    division of the matrimonial assets. 36     The Court of Appeal suggested instead adopting\n                    the following structured four-step approach (at [22] to [29]): (a)     First, derive a ratio which\n                        represents the relationship between the direct financial contributions of\n                        each party towards the acquisition or improvement of matrimonial assets.\n                        Where all necessary evidence is available, this is an arithmetical exercise.\n                        Where all necessary evidence is not available, the court must use a broad\n                        brush to make approximations based on the available documentary evidence and\n                        on the parties’ own evidence assessed in the light of their\n                        veracity. (b)     Next,\n                        derive a second ratio which represents the relationship between the\n                        non-financial and indirect financial contributions of each party towards the\n                        welfare of the family. This is necessarily a matter of impression and\n                        judgment to be approached in broad strokes. (c)     Then, average the two ratios to derive each\n                        party’s overall contribution to the family. This average forms the\n                        basis for the division of the matrimonial assets. (d)     Finally, make any adjustments which\n                        are necessary to arrive at a just and equitable division of the matrimonial\n                        assets. The necessary adjustment can be made either by increasing or\n                        decreasing the average ratio derived in the third step or by attaching\n                        greater weight to one of the component ratios derived in the first step or\n                        the second step. The adjustment in this final step is a qualitative\n                        adjustment based on the court’s sense of what is fair and just. It is\n                        made to recognise that, in certain cases and on certain facts, one type of\n                        contribution may carry greater importance than the other. It is also the\n                        opportunity to take into account all the circumstances of the case as well\n                        as the factors enumerated in s 112(2) of the Women's Charter other than in\n                            s 112(2)(a) and (d). 37ANJis a\n                    decision which was handed down by the Court of Appeal after I had made my\n                    decision in this case. I do not, however, see any impediment to my explaining my\n                    reasons for my decision by adopting the structured four step approach set out in\n                    it. First, that approach approximates the approach which I actually applied in\n                    arriving at my decision. Second, althoughANJ’s structured four-step approach is new, the policy,\n                    principle and precedent underlying it is not new.ANJis entirely consistent with the case law which precedes it\n                    and, in particular, with the principles which I have distilled fromBCBand set out above, all of which I applied in\n                    arriving at my decision. 38     Applying the approach set out inBCBand inANJ, it is my\n                    view that it would be just and equitable to divide the matrimonial assets so as\n                    to award the wife 60% and to award the husband 40%. I arrive at this decision\n                    for the following reasons.",
        "Direct contributions": "39     Section 112(2)(a) of the Women’s Charter provides that one of the\n                    circumstances of the case which a court has a duty to have regard to in arriving\n                    at a just and equitable division of matrimonial assets is “the extent of\n                    the contributions made by each party in money, property or work toward\n                    acquiring, improving or maintaining the matrimonial\n                assets”. 40     I start by attributing to each spouse, as that\n                    spouse’s direct contributions, the full value of the assets held in that\n                    spouse’s name. It therefore remains only for me to assess each\n                    spouse’s direct contributions to the jointly-owned matrimonial\n                    assets. 41     Having attributed a nil value to the\n                    parties’ joint OCBC account (see [28(c)] above), there are only two\n                    jointly-owned matrimonial assets which I need to analyse: (a)     The fund of $298,491.94 held by the\n                        law firm of Mallal & Namazie representing the net proceeds of sale of\n                        the matrimonial home in Sembawang; and (b)     The property in Serangoon owned jointly by the two\n                        spouses. 42     In order to assess each spouse’s direct\n                    contributions to the Sembawang property, it is necessary to start the analysis\n                    with the couple’s first matrimonial home: an HDB flat in Jalan\n                    Bahagia. Jalan Bahagia 43     The flat in Jalan Bahagia was purchased for\n                    $227,000 in 1995[note: 53]and sold for $550,000 in\n                    late 1997 or early 1998.[note: 54]The husband’s\n                    account of the acquisition and sale of Jalan Bahagia is as follows:[note: 55] ... we co-habited at a HDB flat at ... Jalan Bahagia ... which was bought\n                        in the joint names of [my] mother and me. Upon our marriage in 1996, the\n                        Plaintiff insisted on adding her name to the flat and I removed [my]\n                        mother’s name from the flat as I was very much in love with [the\n                        plaintiff]. The Plaintiff never contributed towards the purchase or\n                        maintenance of the flat. Subsequently, the flat was sold and I purchased\n                        [the Serangoon property] in 2003. I paid 20% of the purchase price in cash\n                        and took a loan from Hong Leong Finance. The loan has been fully repaid by\n                        me since 2006. 44     The wife’s version is quite different.\n                    She says as follows: 12.    ... I wish to say that upon our marriage, we lived\n                            and cohabited first at ... Jalan Bahagia ... Singapore (“the HDB\n                            flat”) and thereafter at the matrimonial home [in Sembawang]. The\n                            Defendant...volunteered to include me as joint owner of the HDB flat\n                            upon our marriage; accordingly contrary to the Defendant’s claim,\n                            I did not insist on the inclusion of my name as joint owner of the HDB\n                            flat. Copies of the Transfer and the title search on the HDB flat\n                            exhibited at pages 40 to 47 of this Affidavit directly contradicts\n                                [sic] the Defendant’s claim that\n                            the HDB flat was bought in the joint names of his mother and himself.\n                            The title search in fact shows that the HDB flat was purchased by the\n                            Defendant in his sole name sometime in or about April 1994 with the\n                            transfer to his sole name being registered on 21 June 1995. Following\n                            our marriage on 9 April 1996, the Defendant voluntarily and of his own\n                            free will on 4 June 1997 transferred the HDB flat in his sole name to\n                            our joint names as joint tenants, the transfer to me being by way of\n                            gift. 13.    The aforesaid title search further shows that the\n                            HDB flat was sold sometime at the end of 1997 or the beginning of 1998.\n                            Further ... the Defendant allude to the fact that the proceed [sic] from the sale of the HDB flat was utilised\n                            towards payment of 20% of the purchase price for [the Serangoon\n                            property]. This cannot be true bearing in mind that the HDB flat was\n                            sold way back at the end of 1997 or the beginning of 1998 whereas [the\n                            Serangoon property] was purchased some 5 or 6 years later in 2003\n                            ... 45     On every contentious point in these two\n                    accounts of the relevant events, the wife’s account is amply supported by\n                    contemporaneous and independent documentary evidence while the husband’s\n                    account is based solely on his word. Indeed, the husband’s account of\n                    these events is so devoid of evidential support and is so diametrically\n                    inconsistent with the contemporaneous and independent documentary evidence\n                    produced by the wife that I am driven to the conclusion that the husband is\n                    either a self-deluded fantasist or an unabashed liar. 46     I therefore have no hesitation in accepting\n                    the wife’s account in relation to Jalan Bahagia. The consequences are\n                    twofold. First, I find that the husband voluntarily made a gift to the wife of\n                    an equal interest in Jalan Bahagia before it was sold. Indeed, his intention to\n                    make a gift to her is expressly recorded in the endorsement of the transfer from\n                    his sole name to their joint names on the land register.[note: 56]Second, I find that the wife’s\n                    half-interest in Jalan Bahagia translates into a direct contribution by the wife\n                    towards the acquisition of the Sembawang property which is equal to the\n                    husband’s direct contribution. Sembawang property 47     The Sembawang property was purchased in 1997\n                    for $1.68m.[note: 57]It was\n                    purchased with three co-owners holding the property as tenants in common in\n                    equal shares.[note: 58]The\n                    three co-owners were the wife, the husband and the husband’s mother. The\n                    property was sold in June 2011 for $2.3m by agreement of the three co-owners in\n                    order to facilitate its division as a matrimonial asset, after accounting for\n                    the husband’s mother’s interest in it. 48     It is not disputed that the husband’s\n                    mother paid $450,000 towards the purchase price of the Sembawang property and\n                    the stamp duty payable upon the transfer. The remaining $1.23m of the purchase\n                    price was financed by OCBC in three parts:[note: 59](i) a bridging loan of $200,000; (ii) a\n                    housing loan of $730,000; and (iii) an overdraft facility of\n                $300,000. 49     The bridging loan of $200,000 was in due\n                    course discharged using the proceeds of sale of Jalan Bahagia. The husband\n                    submits that this sum of $200,000 should be attributed entirely to him as he was\n                    the sole owner of Jalan Bahagia.[note: 60]As I have found, that is not the true position:\n                    the husband made a gift to the wife of a half-interest in Jalan Bahagia shortly\n                    before it was sold. I therefore attribute this $200,000 direct contribution to\n                    the acquisition of the Sembawang property equally to the husband and the\n                    wife. 50     The husband’s and the wife’s\n                    remaining direct contributions to the acquisition of the Sembawang property came\n                    through monthly deductions from their respective CPF accounts to service the\n                    housing loan from OCBC. In all, $300,082.40 was deducted from the\n                    husband’s CPF account whereas $307,413.03[note: 61]was deducted from the\n                    wife’s CPF account. The cash component of each month’s instalment\n                    was paid out of funds provided by the husband’s mother.[note: 62]Her evidence is that from 1997 to 2011,\n                    she paid $280,413.01 to the husband which he used for this purpose.[note: 63] 51     When the Sembawang property was sold in 2011,\n                    the net proceeds of sale amounted to $928,008.36.[note: 64]The three co-owners agreed that the\n                    husband’s mother’s share of the net proceeds of sale should be fixed\n                    at $621,703.88[note: 65]and should be released to her. Separately, the husband and the wife agreed that\n                    the sum remaining after releasing the agreed share to the husband’s mother\n                    should be held by Mallal & Namazie as stakeholders and be divided as a\n                    matrimonial asset in these proceedings.[note: 66] 52     The sum released to the husband’s mother\n                    as her share of the Sembawang property must be taken to represent the entirety\n                    of her interest in that property arising not only from the $450,000 which she\n                    paid at the time of acquisition but also from her contribution towards the stamp\n                    duty and the sums she furnished to the husband to pay the cash portion of the\n                    monthly instalments. The only direct contributions to the acquisition of the\n                    Sembawang property which remain to be accounted for out of the sum held by\n                    Mallal & Namazie are therefore the direct contributions made by each spouse,\n                    all of which came by way of deduction from each spouse’s CPF\n                    account. 53     The stakeholding sum held by Mallal &\n                    Namazie was further reduced by a deduction of $13,118.91. That sum was a\n                    deduction which Mallal & Namazie was compelled to make from the net proceeds\n                    of sale and to pay over to the Comptroller of Income Tax pursuant to\n                    s 57(5A) of the Income Tax Act[note: 67]in order to discharge the husband’s\n                    unpaid liability for income tax. 54     The result is that the entirety of the\n                    spouses’ joint interest in the Sembawang property is now represented by\n                    the stakeholding sum of $298,491.94[note: 68]with Mallal & Namazie. I have found that the husband has paid $400,082.40\n                    towards the Sembawang property whereas the wife has paid $407,413.03 (see [49]\n                    and [50] above).[note: 69]Taking the sum of those two figures as the\n                    denominator, the husband’s and the wife’s direct contributions to\n                    this property are therefore 49.55% and 50.45% respectively. Serangoon property 55     The spouses own the Serangoon property as\n                    joint tenants on a 99-year lease which commenced on 28 June 1951 and expires on\n                    27 June 2050.[note: 70]The husband\n                    and wife conducted their businesses from these premises. From 2011, after the\n                    Sembawang property was sold, the husband resided in the Serangoon property. This\n                    property is by now unencumbered by a mortgage.[note: 71] 56     The husband claims that he paid entirely for\n                    the Serangoon property. He says:[note: 72] As regards [the Serangoon property], although it was purchased in joint\n                        names, it was financed entirely by me and the loan with Hong Leong Finance\n                        has been fully settled since 2006, not 2007 as alleged. The mortgage\n                        payments were paid by me by debiting my personal bank account. I am in the\n                        process of procuring the bank statements to show the same and will disclose\n                        the same in due course. 57     Once again, the wife’s account is quite\n                    different. She says this:[note: 73] It is also untrue that [the Serangoon property] was paid for by the\n                        Defendant. The truth as the Defendant well knew was that $450,000 being the\n                        purchase price of [the Serangoon property] was paid as follows:- -    Cash $90,000; -    Balance $360,000 was from Hong Leong Finance\n                            Ltd’s mortgage loan. The cash as well as the monthly mortgage was paid for by the Defendant and\n                        I [sic] equally notwithstanding that in the\n                        mortgage document, the Borrower was the Defendant and the Mortgagors were\n                        the Defendant and I [sic] ... The mortgage on [the Serangoon property] was redeemed in May 2007 where\n                        the Defendant issued a company’s ([Q] Pte Ltd where as would be\n                        recalled, I owned and still own 50% of the share capital) DBS cheque for\n                        $320,088.98 being the redemption sum. The aforesaid cheque was returned by\n                        Hong Leong Finance Ltd which requested that a personal and not\n                        company’s cheque be issued for the said redemption. The Defendant\n                        subsequently issued his UOB cheque for the said sum which I verily believe\n                        was through monies credited by [Q] Pte Ltd via [Q] Pte Ltd’s DBS\n                        cheque… dated 8 May 2007 for the said sum of $320,088.98. ... 58     As in the case of Jalan Bahagia and the\n                    Sembawang property, the wife’s account on the Serangoon property is\n                    supported by particulars and by contemporaneous and independent documentary\n                    evidence. The husband’s account, yet again, is not. I therefore again have\n                    no hesitation in accepting the wife’s account. I find that the parties\n                    contributed equally to the acquisition of the Serangoon property and equally to\n                    servicing the loan taken out to finance its acquisition.[note: 74] 59     I therefore hold that each spouse made a\n                    direct contribution of 50% to the acquisition of the Serangoon\n                property. Conclusion on direct contributions 60     The result is that the wife’s direct\n                    contribution to the total pool of matrimonial assets stands at 53.51% and the\n                    husband’s direct contributions stands at 46.49%. I have arrived at those\n                    percentages in this way: Wife's direct\n                                    contributionsPercentage attributedValueAssets in own\n                                        name100%$767,805.94Share of the Serangoon\n                                            property50.00%$500,000.00Share of the Sembawang\n                                            property50.45%$150,600.86Total53.51%$1,418,406.80    Husband's direct\n                                    contributionsPercentage attributedValueAssets in own\n                                        name100%$584,449.66Share of the Serangoon\n                                            property50.00%$500,000.00Share of the Sembawang\n                                            property49.55%$147,891.08Total46.49%$1,232,343.74",
        "Indirect contributions": "61     Section 112(2)(d) of the Women’s Charter provides that one of the\n                    circumstances of the case which a court has a duty to have regard to in arriving\n                    at a just and equitable division of matrimonial assets is “the extent of\n                    the contributions made by each party to the welfare of the family, including\n                    looking after the home or caring for the family”. This provision covers\n                    both non-financial contributions to the welfare of the family as well as\n                    indirect financial contributions to the welfare of the family,iefinancial contributions to the family’s welfare\n                    which cannot be attributed to a tangible matrimonial asset. 62     Having considered all of the evidence and the\n                    submissions, and applying broad strokes, I find that the wife has made\n                    contributions to the welfare of the family which are equivalent to double those\n                    of the husband’s contributions,iein a 2:1\n                    ratio in her favour. I have arrived at this finding for the following\n                    reasons. The wife’s indirect contributions 63     The wife has been the primary caregiver of the\n                    triplets since their birth.[note: 75]Her evidence is that she devoted all of her\n                    free time and effort to raising the triplets, focusing on their physical,\n                    emotional and academic needs and well-being.[note: 76]The husband attempts to\n                    minimise her efforts by pointing out that the wife returned to work soon after\n                    giving birth and left the care of the triplets to his mother and the\n                    parties’ maids.[note: 77]It is true:\n                    (i) that the wife returned to work after two months’ maternity leave;\n                    (ii) that the couple had two maids until the triplets turned five years of age;\n                    and (iii) that the husband’s mother lived with them in the matrimonial\n                    home and assisted in supervising the maids and in childcare.[note: 78]But I accept the wife’s evidence\n                    that she returned to work for the overall economic benefit of the family and\n                    that, after she returned to work, any time which she did not spend on the family\n                    business, she spent on looking after the triplets.[note: 79]Further, on the facts of this case, I allocate\n                    the time which the husband’s mother spent on childcare to compensate for\n                    the husband’s failure to contribute to childcare and not to reduce the\n                    wife’s contribution to childcare. 64     I also attach importance to the fact that the\n                    triplets were born throughin vitrofertilisation.\n                    Assisted reproduction techniques such asin vitrofertilisation typically exact a high toll on the mother, physically, emotionally\n                    and psychologically. That was the case here. The wife had to undergo many\n                    stressful and painful procedures, several unsuccessful attempts and much anxiety\n                    in trying to conceive.[note: 80]I also take into account\n                    the additional physical and psychological stress arising from a multiple\n                    pregnancy. All of this has the effect of increasing the wife’s indirect\n                    contributions as compared to the husband’s. The husband’s indirect contributions (i)   Financial indirect contribution 65     The husband’s evidence is that he\n                    provided amply for the financial needs of the family.[note: 81]Although the wife disputes this, she\n                    does so only in relation to the period after she left the matrimonial home with\n                    the triplets in January 2010.[note: 82]For the period from the birth of the triplets in\n                    2003 until she left the matrimonial home, it is the wife’s own evidence\n                    that the husband provided $14,000 every month to maintain the wife and the\n                        triplets.[note: 83]That is, by any\n                    measure, a generous sum, sufficient to cater for all of the triplets’\n                    material needs. 66     In assessing the husband’s indirect\n                    contributions, I therefore give him full credit for his substantial indirect\n                    financial contribution. Unfortunately, this is virtually the husband’s\n                    only indirect contribution to the welfare of the family. (ii)   Lack of emotional support for wife and children 67     Although the wife’s statement of\n                    particulars was amended by agreement,[note: 84]the\n                    uncontested particulars of the husband’s unreasonable behaviour which\n                    remain after amendment are serious. These uncontested particulars include the\n                        following:[note: 85] (a)     Throughout the marriage, the husband\n                        displayed a foul temper against the wife and the\n                    triplets; (b)     The\n                        husband treated the wife since 2004 with complete lack of affection and\n                        without any consideration for her feelings or emotional\n                    well-being; (c)     The\n                        husband engaged in the behaviour set out at [6] and [9] above;\n                    and (d)     The husband\n                        committed a battery on the wife in the circumstances set out at\n                        [12]–[14] above. (iii)   Decision to cut off financial support from January\n                2010 68     Further, the husband cut off all maintenance\n                    for the wife and triplets after the wife left the matrimonial home with the\n                        triplets.[note: 86]He cancelled the\n                    wife’s supplementary credit cards.[note: 87]He did all this even though he remained under a legal obligation to maintain the\n                    wife and triplets and even though his financial position at that time, in\n                    January 2010, had not yet undergone any material change. I can only presume that\n                    the husband acted out of vindictiveness. (iv)   Domineering nature 69     The husband was, by all accounts, a\n                    domineering husband. I rely for this finding on his own explanation of his\n                    battery on the wife set out at [14] above. That extract, set in the\n                    husband’s own words, shows an utter lack of self-awareness and of remorse\n                    for his actions. The wife’s evidence is that this was his typical of\n                    attitude throughout the marriage. As she says:[note: 88] The Defendant was the dominant party in respect of both the marriage and\n                        our businesses. Further, in respect of the business, although we were\n                        supposed to be partners, the Defendant by his words and conduct always\n                        treated me as a subordinate or staff much to my distress – the\n                        Defendant having said to me on more than once that there can only be one\n                        leader, referring to himself, and that I must give him complete or 100%\n                        support, no question asked otherwise I am not a supportive wife. To please\n                        the Defendant and so as not to jeopardise the marriage, I invariably gave in\n                        to the Defendant. (v)   Homosexuality 70     I do not count the husband’s sexual\n                    orientation in itself against him in assessing his indirect contributions to the\n                    welfare of the family. But there are, on the facts of this case, aspects of how\n                    the husband has dealt with his homosexuality which I find to have detracted\n                    significantly from the welfare of the family. 71     First, the husband dishonestly concealed his\n                    sexual orientation from the wife. I reject his evidence that he disclosed it to\n                    her before their marriage.[note: 89]The wife denies this allegation. Her evidence\n                    is that she became aware of his sexual orientation for the first time after she\n                    saw the private investigators’ reports in 2009.[note: 90] 72     I accept the wife’s evidence. It is\n                    consistent with the husband’s own conduct in the various litigation that\n                    the parties have been involved in. In the personal protection proceedings\n                    commenced by the wife in 2010, the husband deposed on oath that his homosexual\n                    lover was just a friend. Further, the first time that the husband alleged that\n                    the wife knew of his homosexuality before the marriage was in these proceedings,\n                    and even then only at a late stage, on 27 March 2012. He had never asserted such\n                    knowledge on the part of the wife during the earlier personal protection\n                    proceedings or during the guardianship proceedings. In the latter proceedings,\n                    that knowledge would have been a material fact.[note: 91]Once again, I am unimpressed by the\n                    husband’s capacity for truth-telling. 73     Second, the wife has adduced evidence that the\n                    husband leads a particularly dissolute and reckless lifestyle.[note: 92]The wife has put in evidence a profile\n                    posted by the husband on a website known as “Manjam”. Manjam\n                    appears to be a social media platform catering to homosexuals. The\n                    husband’s profile on Manjam includes a slide show of photographs of\n                    himself clad only in his underwear accompanied by text in lurid terms soliciting\n                    other male homosexuals for short-term sexual trysts. 74     Significantly, the husband is dishonest in the\n                    personal profile he has posted on this website. He gives his age dishonestly as\n                    35 when he is in fact almost ten years older.[note: 93]He says dishonestly that he has no children when\n                    in fact he is the father of triplets. Most importantly, he says dishonestly that\n                    he is HIV negative when he is in fact HIV positive. The dishonesty displayed by\n                    the husband in this profile coupled with his dishonesty in the affidavits he has\n                    filed in these proceedings suggests a pattern of dishonest conduct. This is yet\n                    another reason I have for doubting the veracity of the husband’s evidence\n                    and for preferring the wife’s evidence on all contentious\n                matters. 75     Although the husband posted this profile on\n                    Manjam in 2012, there is every reason to believe that this sort of conduct\n                    underlay the change in his behaviour observed by the wife during the marriage\n                    and which led to the divorce. 76     Third, the husband is involved with a\n                    homosexual partner who also leads a particularly reckless and dissolute\n                    lifestyle. The wife has placed before me evidence[note: 94]that the partner was found in September 2009 unconscious under the bed of his\n                    then homosexual lover, whose dead body was in the bed. The partner has also\n                    admitted to using drugs such as Ecstasy and ketamine. 77     Fourth, the husband is HIV positive. Again, I\n                    do not hold that fact against him in itself. Being HIV positive is today more in\n                    the nature of a medical condition to be managed than the death sentence which it\n                    once was. It is the circumstances in which the husband became HIV positive which\n                    I take into account. It is the case that men who have sex with men can\n                    drastically reduce their risk of acquiring HIV by the consistent exercise of\n                    personal responsibility in their liaisons. The fact that the husband is now HIV\n                    positive coupled with the evidence of his solicitation of sexual partners\n                    suggests to me that his HIV status has arisen from promiscuous sexual behaviour,\n                    a reckless failure to exercise personal responsibility or both. This is all the\n                    more reckless given that he apparently lies to his homosexual partners about his\n                    HIV positive status. I also bear in mind that the husband did not disclose his\n                    HIV positive status to the wife until after she confronted him about his\n                    behaviour in 2009. There is therefore every possibility that the husband exposed\n                    the wife to a real risk of herself acquiring the virus during unprotected\n                    heterosexual sex with the husband. Conclusion on indirect contributions 78     Bearing all of the above in mind, in my view\n                    the wife has made double the indirect contributions to the welfare of the family\n                    that the husband has made. I therefore apportion the indirect contributions at\n                    66.67% to the wife and 33.33% to the husband. If anything, I consider that\n                    assessment overly generous to the husband.",
        "Just and equitable proportion of matrimonial assets": "79     I have found that the husband has made direct\n                    contributions to the matrimonial assets of 46.49% and indirect contributions to\n                    the welfare of the family of 33.33%. I have also found that the wife has made\n                    direct contributions to the matrimonial assets of 53.51% and indirect\n                    contributions to the welfare of the family of 66.67%. Averaging the two\n                    percentages for each spouse and rounding off the result to the nearest whole\n                    percentage point, I conclude that a just and equitable division of the\n                    matrimonial assets would be to award the wife 60% of the matrimonial assets and\n                    to award the husband 40%. The result in absolute terms is that, out of a pool of\n                    matrimonial assets worth $2,650,747.54, the wife is entitled to $1,590,448.52\n                    and the husband to $1,060,299.02. 80     UnderANJ’s structured approach, I do not consider that any further\n                    adjustment needs to be made to those figures in the fourth step in order to\n                    account for the remaining factors under s 112 of the Women’s Charter.\n                    Stepping back and looking at the matter with a degree of perspective, a division\n                    of 60% to the wife and 40% to the husband appears to me to be broadly fair\n                    bearing in mind that this was a 15 year marriage and that I make separate\n                    provision for the needs of the triplets. It is true that the husband has been\n                    residing rent-free in matrimonial property – first in the Sembawang\n                    property and then in the Serangoon property – since the wife left the\n                    matrimonial home in January 2010 whereas the wife has been paying rent from her\n                    own resources throughout that period. However, it appears to me that adjusting\n                    the wife’s percentage upwards would be somewhat unfair to the husband,\n                    particularly bearing in mind that he must be left with sufficient funds to house\n                    himself and that his share is reduced further by the provision I make for lump\n                    sum maintenance for the triplets.",
        "Deductions proposed by each party": "81     Each party asks me to make certain deductions\n                    from the other party’s share of the matrimonial assets. I consider these\n                    deductions in turn. The wife’s proposed deductions 82     The wife points out that the net proceeds of\n                    the sale of the Sembawang property account not only for the sum of $414,539.16\n                    paid to OCBC to redeem the mortgage of the property (including all accrued\n                    interest and late charges) but for the sum of $152,742.00[note: 95]due to OCBC on the overdraft account\n                    secured against the property. This overdraft indebtedness to OCBC was incurred\n                    by the husband in December 2010. This was after the marriage had broken down.\n                    The wife had by then left the matrimonial home and had commenced and concluded\n                    both the personal protection proceedings and the guardianship proceedings. The\n                    withdrawal took place without the knowledge or consent of the wife.[note: 96] 83     Despite all that, I decline to make any\n                    adjustment for this sum. Although this withdrawal took place after the marriage\n                    had broken down, it took place before the wife commenced divorce proceedings and\n                    before the date of interlocutory judgment. It is that date which I use as the\n                    cut-off date to ascertain the pool of matrimonial assets. There is no reason,\n                    therefore, not to treat this overdraft liability as a matrimonial liability. In\n                    addition, adding back the husband’s 40% share of this liability would\n                    further reduce the sum awarded to him, an outcome which I do not consider would\n                    be fair to him. 84     Second, the wife submits that she should not\n                    bear any part of the husband’s income tax liability of $13,118.91 which\n                    was deducted from the net proceeds of sale of the Sembawang property. I do not\n                    accept this submission either. To the extent that the income on which this\n                    income tax was levied is a matrimonial asset, the tax on that income is also a\n                    matrimonial liability. I see no reason again to attribute this debt entirely to\n                    the husband. 85     Finally, the wife draws my attention to the\n                    sum of $29,500 remaining due from the husband to the wife arising from the costs\n                    orders in the personal protection proceedings, in the custody proceedings and in\n                    these proceedings. This is an undisputed and indisputable debt. In my view, it\n                    is just and equitable that a sum of $29,500 should be deducted from the\n                    husband’s share and added to the wife’s share, thereby extinguishing\n                    the husband’s liability to the wife for these costs. The husband’s proposed deduction 86     The husband asks that I require the wife to\n                    bring into account the sum of $95,527.25 which the wife withdrew from the\n                    account of [Q] Pte Ltd in February 2010.[note: 97]The wife’s position is that this was a\n                    part-payment to herself of unpaid salary amounting to $117,600 which was due to\n                    her from the couple’s various businesses. Once again, the wife is able to\n                    produce independent, contemporaneous documentary evidence to support her\n                        assertion.[note: 98]This\n                    evidence comprises internal accounting documents from [P], [Q] Pte Ltd and the\n                    couple’s spa business which she was able to obtain from a sympathetic\n                        employee.[note: 99]These documents confirm\n                    the wife’s evidence about the undrawn salary which had accrued due to her.\n                    I therefore accept her evidence and reject the husband’s submission. It\n                    also appears to me that this sum is accounted for by the share capital of [R]\n                    Pte Ltd, also formed in February 2010. I have treated the wife’s interest\n                    in [R] Pte Ltd as a matrimonial asset. I therefore decline to make any deduction\n                    from the wife’s share of the matrimonial assets to account for this\n                    amount.",
        "Conclusion on division of matrimonial assets": "87     The result of considering these deductions is\n                    that the wife’s share of the matrimonial assets ought to be enhanced by a\n                    further $29,500, with a corresponding reduction in the husband’s share.\n                    Following this adjustment, the wife’s share of the matrimonial assets in\n                    absolute terms is $1,619,948.52 and the husband’s is\n                $1,030,799.02. 88     Before considering how that division ought to\n                    be effected, I turn to consider the issue of maintenance.",
        "Maintenance": "89     The wife’s primary position on\n                    maintenance is that lump sum maintenance for herself and the triplets is\n                    incorporated in her submission on the division of the matrimonial assets set out\n                    at [31] above. Alternatively, if I am not minded to grant lump sum maintenance\n                    for the wife and the triplets, the wife asks for maintenance for herself in the\n                    sum of $7,000 a month and maintenance for the triplets in the total sum of\n                    $7,094 a month.[note: 100]",
        "Maintenance for the wife": "90     The wife estimates her own monthly expenses at\n                    $13,826.42 per month.[note: 101]Almost one-third of this sum comprises a lump sum of $4,000 per month sought for\n                    “personal maintenance per month – health, medical, clothing, shoes,\n                    cosmetics, facial, eating, family outings, insurance in the process of being\n                    arranged, [handphone] bills, etc”. A further $2,800 per month is sought\n                    for the wife’s rent. The wife also lists her aged mother as a financial\n                    dependent to the extent of $800 per month.[note: 102] 91     The list of factors I am obliged to have\n                    regard to in determining the amount of maintenance to be paid by the husband to\n                    the wife are set out in s 114(1) of the Women’s Charter. I consider\n                    all of these factors in the round. 92     The wife is 49 years old. She has been\n                    employed since 1 March 2010 by her own company, [R] Pte Ltd. Her starting salary\n                    was $3,500 per month with a fixed transportation allowance of $1,000 per\n                        month.[note: 103]That was\n                    increased with effect from 2011 to $4,000 per month plus the fixed transport\n                    allowance of $1,000 per month.[note: 104]Her income tax notices of assessment show\n                    that she earned $68,022 in 2007, $116,001.40 in 2008 and $102,601 in\n                        2009.[note: 105] 93     The husband is 48 years old. He is\n                        unemployed.[note: 106]His income tax\n                    notices of assessment show that he earned $67,024 in 2005, had no income in\n                    2008, earned $151,830 in 2009 and had no income in 2010.[note: 107]As I have mentioned, he is an\n                    undischarged bankrupt. 94     The marriage is a long one, lasting 15 years.\n                    As I have found, the wife made twice the contributions to the welfare of the\n                    family that the husband did. 95     It appears to me that it is not appropriate in\n                    all the circumstances of the case to order the husband to pay maintenance to the\n                    wife. I say that for two reasons. 96     First, the husband has no capacity to pay\n                    maintenance. He is unemployed and an undischarged bankrupt. It is the\n                    wife’s submission that his status both as unemployed and as a bankrupt is\n                    a ploy by him to evade his obligations to his wife and family upon divorce. I\n                    have no basis on which to find that that is true. 97     Second, the wife has shown herself to be a\n                    resourceful businesswoman, capable of achieving economic independence both\n                    during the marriage and after it. Her need for maintenance is correspondingly\n                    reduced. I bear in mind also that although her current income appears modest,\n                    she is in fact not just an employee of [R] Pte Ltd but a 99% owner of it as\n                    well. She is therefore entitled to receive not just a salary from [R] Pte Ltd as\n                    its employee but also virtually all of its profits as its proprietor. It\n                    therefore appears to me that the wife is capable, subject to receiving\n                    maintenance for the triplets, of maintaining after the divorce the same standard\n                    of living enjoyed by the family during the marriage. 98     However, in case the circumstances of either\n                    spouse or of both spouses change to warrant a reconsideration of the issue of\n                    maintenance, I grant the wife liberty to apply for maintenance. 99     In declining to award the wife substantive\n                    maintenance for herself at this stage, I express no view on the reasonableness\n                    or otherwise of the components of her monthly expenses on which she bases her\n                    claim for monthly maintenance of $7,000 per month. That will have to be\n                    determined separately if and when it arises.",
        "Maintenance for the triplets": "100    The wife seeks maintenance of $7,094 per\n                    month for the triplets. Rounded off, this sum amounts to an average of $2,365\n                    per child. The breakdown provided by the wife for each child shows nothing\n                    exceptional. She has made provision for typical and reasonable sums for the\n                    triplets’ clothing, medical costs, school fees, tuition and related\n                    expenses, extra-curricular activities and transportation. I therefore find that\n                    $7,094 per month is a reasonable amount for the maintenance of the\n                    triplets. 101    The triplets are approximately 11½\n                    years of age. They will achieve majority in another 9½ years. The cost of\n                    maintaining them until they reach majority, on the figures put forward by the\n                    wife, will be $808,716. 102    That sum of $808,716 is not the correct\n                    measure of the husband's liability for maintenance. First, under s 68 of the\n                    Women’s Charter, the obligation to maintain the triplets is an obligation\n                    of both parents. The husband and wife are both of equal earning capacity. I\n                    therefore hold that they should each bear equally the cost of maintaining the\n                    triplets until they attain majority. The husband’s 50% share of the\n                    triplets’ maintenance is $404,358. 103    Second, the liability of the husband to pay\n                    lump sum maintenance for the triplets must be discounted to account for the time\n                    value of money. The wife will receive the maintenance as a lump sum now but will\n                    spend it only at the rate of $3,547 per month over the coming 9½ years. I\n                    consider that an appropriate discount rate to apply would be 4.25% per annum,\n                    representing a realistically achievable rate of return in the current investment\n                    environment. That annual discount rate over 9½ years is equivalent to a\n                    flat discount of 19%. I therefore discount the sum of $404,358 by 19% to account\n                    for the time value of money. 104    The result is that I hold that the husband\n                    shall pay lump sum maintenance to the wife for the triplets in the sum of\n                    $327,529.98.",
        "Mode of payment": "105    I summarise my holdings so far. I have held\n                    that the wife is entitled to receive $1,619,948.52 as her share of the\n                    matrimonial assets under s 112 of the Women’s Charter and in extinction of\n                    the husband’s existing liability to her for unpaid legal costs. I have\n                    further held that the wife should receive the sum of $327,529.98 as lump sum\n                    maintenance for the triplets. The total sum payable to the wife is therefore\n                    $1,947,478.50. 106    That sum of $1,947,478.50 shall be paid to\n                    the wife as follows: (a)Assets in her own\n                                        name$767,805.94(b)60% of the sum held by Mallal\n                                            & Namazie$179,095.16(c)Entire interest in the\n                                            Serangoon property$1,000,000Total$1,946,901.10   107    The transfer of 60% of the sum held by\n                    Mallal & Namazie awards the wife not only her 49.55% interest in that sum\n                    but an additional 10.45% of that sum which is to be deducted from the\n                    husband’s 50.45% interest in that sum. That brings their respective\n                    percentages to 60% and 40% in that asset. Although the resulting total is\n                    $577.40 short of $1,947,478.50, that is a variance of only 0.03%. It isde minimisand can be ignored.",
        "The effect of bankruptcy": "108    Having arrived at a just and equitable\n                    division of the matrimonial property, I now consider the effect of the\n                    husband’s bankruptcy. I first set out again the chronology of relevant\n                    events. The wife commenced these proceedings on 27 January 2011. She secured\n                    interim judgment on 25 October 2011. A creditor of the husband presented its\n                    bankruptcy application against him on 4 April 2012. The husband was adjudged\n                    bankrupt on 29 November 2012. 109    Two consequences followed upon the husband\n                    being adjudged bankrupt. First, under s 76(1)(c) of the Bankruptcy Act, a statutory moratorium came into force\n                    preventing all of the husband’s creditors from pursuing any remedy, action\n                    or proceedings against him in respect of any debt provable in his bankruptcy.\n                    Second, under s 76(1)(a) of the Bankruptcy Act\n                    (Cap 20, 2009 Rev Ed) (“Bankruptcy Act”), the husband’s\n                    property vested in the Official Assignee immediately and became divisible\n                    amongst his creditors, subject only to the exceptions set out in s 78(2) of\n                    the Bankruptcy Act. The only assets of the husband which fall within s 78(2) are\n                    the credit balances in his CPF account. 110    The statutory moratorium under s\n                        76(1)(c) of the Bankruptcy Act is no obstacle\n                    to these divorce proceedings continuing against the husband or to my dividing\n                    the matrimonial assets under s 112 of the Women’s Charter. A wife pursuing\n                    divorce proceedings against a husband and seeking a just and equitable division\n                    of the matrimonial assets under s 112 of the Women’s Charter is\n                    outside s 76(1)(c) of the Bankruptcy Act. She is\n                    not a creditor of the husband in any sense of the word and is not seeking to\n                    pursue any remedy, action or proceeding against the husband in respect of any\n                    debt provable in the husband’s bankruptcy. InJA v\n                        JB[2005] SGDC 104 (“JA v\n                    JB”), it was held that the court may hear and determine a\n                    wife's application to divide the parties' matrimonial assets under s 112 of\n                    the Women’s Charter and award maintenance for her and the children of the\n                    marriage notwithstanding the husband's bankruptcy because that application, not\n                    being in respect of a debt provable in bankruptcy, is outside the prohibition in\n                        s 76(1)(c) of the Bankruptcy Act. I\n                    accept that proposition as correct. 111JA v JBdoes\n                    not, however, consider the interaction between the statutory vesting of the\n                    bankrupt’s property in the Official Assignee under s 76(1)(a) of the Bankruptcy Act, and the court’s power to\n                    divide matrimonial assets under s 112 of the Women’s Charter. This\n                    interaction is of some importance. A bankruptcy can be used tactically to\n                    obstruct or delay the court exercising its jurisdiction under s 112. Likewise,\n                    divorce proceedings can be brought collusively to put the assets of an insolvent\n                    or near insolvent spouse beyond the reach of his creditors through a transfer of\n                    property sought and made under s 112 of the Women’s\n                Charter. 112    Where a spouse is adjudged bankrupt before\n                    the matrimonial assets can be divided under s 112 of the Women’s Charter,\n                    the bankruptcy creates a fundamental difficulty. The vesting of the bankrupt\n                    spouse’s assets in the Official Assignee under s 76(1)(c) of the Bankruptcy Act prevents a court which is exercising\n                    matrimonial jurisdiction from making any order under s 112 which affects\n                    the vested assets. That is the case for two reasons. 113    First, s 112 is predicated on title to the\n                    matrimonial assets which are to be divided being vested in the spouses. That is\n                    no longer the case when a spouse has been adjudicated bankrupt. Subject only to\n                    the provisions of s 78(2) of the Bankruptcy Act, the simple position is\n                    that the bankrupt spouse no longer owns any matrimonial assets: his interest in\n                    those assets is vested in the Official Assignee. That includes the bankrupt\n                    spouse’s title to jointly-held matrimonial assets. There is nothing in\n                    s 112 which allows the court in its matrimonial jurisdiction to disregard\n                    this statutory divesting of the bankrupt spouse’s assets or to engineer a\n                    re-vesting of those assets in the bankrupt spouse so that they become available\n                    for division under s 112. The general power to set aside a disposition by a\n                    husband under s 132 of the Women’s Charter applies only to a\n                    disposition by the husband which is voluntary, and not to the disposition which\n                    take place by operation of law upon a bankruptcy order being made, even if the\n                    husband commenced the bankruptcy proceedings himself: seeWoodley v Woodley (No. 2)[1993] 2 FLR 477. 114    The second reason that a bankruptcy order\n                    prevents the court from dividing matrimonial assets under s 112 of the\n                    Women’s Charter is that the court’s power under that section permits\n                    the court to divide matrimonial assets and order the transfer of matrimonial\n                    assets only as between the parties to the marriage. The Official Assignee, quite\n                    obviously, is not a party to the marriage. The court therefore has no power,\n                    under s 112, to affect the Official Assignee’s title to the assets vested\n                    in him by operation of law under s 76(1)(a) of the\n                    Bankruptcy Act or to order the Official Assignee to transfer or sell any of\n                    those assets:In Re Holliday[1981] 1 Ch 405 at\n                    421D per Goff LJ. 115    The court’s powers under s 112 of the\n                    Women’s Charter can be exercised against a bankruptcy spouse only in\n                    respect of those of his assets which have not vested in the Official Assignee\n                    because they are excluded from the vesting under s 76(1)(a) by s 78(2) of the Bankruptcy Act. These assets include those\n                    specifically enumerated in s 78(2) of the Bankruptcy Act as well as those\n                    protected by other written law. Most notable in the latter category is HDB\n                    property, which is protected by s 51(5) of the Housing and Development Act\n                    (Cap 129, 2004 Rev Ed), and CPF money, which is protected by\n                        s 24(2)(c) of the Central Provident Fund\n                    Act (Cap 36, 2013 Rev Ed). 116    With respect to assets which have vested in\n                    the Official Assignee, the most that a court can do under s 112 of the\n                    Women’s Charter is to take the value of those divested assets into account\n                    by notionally adding them back to the pool of matrimonial assets and dividing\n                    the enlarged pool in accordance with s 112, but without encroaching on the\n                    assets vested in the Official Assignee. That, of course, is no solution where\n                    the non-bankrupt spouse lays claim to some or all of the matrimonial assets now\n                    vested in the OA or where the bankrupt spouse claims that some of the debts\n                    provable in his bankruptcy are matrimonial debts. 117    A non-bankrupt spouse who seeks a transfer\n                    of assets which have vested in the Official Assignee under s 76(1)(a) of the Bankruptcy Act must first effect a re-vesting\n                    of those assets in the bankrupt spouse. Section 132 of the Women’s\n                    Charter is unavailable to effect this re-vesting (see [113] above). Further,\n                    although the bankruptcy court has a general discretion to rescind its orders,\n                    including bankruptcy orders, under s 7 of the Bankruptcy Act, that discretion is\n                    to be exercised with caution and only in exceptional circumstances: seeFitch v Fitch[1996] 1 WLR 242 andPapanicola v Humphreys[2005] 2 All ER\n                418. 118    The only practicable way for the\n                    non-bankrupt spouse to achieve that re-vesting is by securing the annulment of\n                    the bankruptcy order. There are two ways in which she can secure that annulment.\n                    First, she can apply for an annulment of the bankruptcy under\n                        s 123(1)(a) of the Bankruptcy Act on the\n                    grounds that the bankruptcy order ought not to have been made,egby showing that the bankrupt spouse was not in fact\n                    insolvent at that time: seeWhig v Whig[2008] 1\n                    FLR 453 andPaulin v Paulin[2010] 1 WLR 1057.\n                    Second, the non-bankrupt spouse can take it upon herself to pay off all of the\n                    bankrupt spouse's debts and thereafter seek an annulment of the bankruptcy order\n                    either by the court under s 123(1)(b) of the\n                    Bankruptcy Act or by certificate of the Official Assignee under s 123A(1)\n                    Bankruptcy Act. Both of these courses of action, unfortunately, require\n                    significant financial risk and expenditure, whether in costs or in repayments,\n                    by the non-bankrupt spouse. 119    If the non-bankrupt spouse is unable or\n                    unwilling to secure a re-vesting of the bankrupt’s spouse’s property\n                    in him through either of these approaches, she has no alternative but to defer\n                    the resolution of the ancillary matters until the bankruptcy order is annulled\n                    either upon the application of the bankrupt spouse or by or upon the application\n                    of the OA. So long as the bankruptcy order remains in effect, only the assets\n                    excluded from the operation of the vesting order by s 78(2) of the Bankruptcy\n                    Act remain vested in the bankrupt spouse and available for division under\n                    s 112 of the Women’s Charter. 120    In this case, I have held that a just and\n                    equitable division of the matrimonial assets requires the husband to transfer to\n                    the wife his entire interest in the Serangoon property and 10.45% of the\n                    stakeholding sum with Mallal & Namazie out of his 50.45% share of that sum.\n                    But both these assets of the husband vested in the Official Assignee when the\n                    husband was made bankrupt. The Official Assignee is beyond the reach of any\n                    order I can make under s 112 of the Women’s Charter. The husband’s\n                    bankruptcy would therefore ordinarily have made it impossible for me to order\n                    the transfer necessary to bring about the division of the matrimonial assets\n                    which I have found to be just and equitable. 121    In those circumstances, I would ordinarily\n                    have adjourned these ancillary proceedings to permit the wife to consider\n                    whether she wished to take the necessary steps to have the husband’s\n                    bankruptcy annulled under either limb of s 123 of the Bankruptcy\n                    Act. 122    This case is not, however, the ordinary\n                    case. At my request, a representative of the Official Assignee’s office\n                    attended the hearing of this matter to assist the court. I considered it\n                    important to hear from the Official Assignee as the voice of the husband’s\n                    creditors. Once a spouse has been made bankrupt, third party interests intrude\n                    on the division of matrimonial assets. Every dollar of matrimonial assets\n                    transferred away from the bankrupt spouse under s 112 of the Women’s\n                    Charter is one fewer dollar available to pay the bankrupt spouse’s\n                    creditors. There is no reason in principle why the creditors’ interests\n                    should inevitably and in every case be subordinated to the non-bankrupt\n                    spouse’s interest. Indeed, the Bankruptcy Act prioritises the rights of\n                    creditors over the rights of a non-bankrupt spouse on at least two occasions:\n                    see s 53 and s 55 of the Women’s Charter. There is also English authority\n                    that in the absence of exceptional circumstances, creditors’ rights ought\n                    ordinarily to prevail over the non-bankrupt spouse’s rights:In Re Citro (Domenico) (A Bankrupt)[1991] Ch 142 at\n                    157A. In those circumstances, it is important that all three sets of competing\n                    interests be actively represented before the matrimonial court, even if there is\n                    no basis to suspect collusion between husband and wife. 123    I ascertained from the Official Assignee\n                    that the debts proved in the husband’s bankruptcy amount to $123,391.44.\n                    That is very close to the value of the 40% share which I have found the husband\n                    is entitled to out of the net proceeds of sale of the Sembawang property. That\n                    is why this is not the ordinary case. 124    It would not ordinarily be appropriate for a\n                    court hearing ancillary proceedings in its matrimonial jurisdiction to make\n                    orders which have the potential to affect the rights of creditors in an ongoing\n                    bankruptcy. But where the share of the matrimonial assets which a court\n                    exercising matrimonial jurisdiction has determined it is just and equitable for\n                    the bankrupt spouse to receive suffices to repay all of his creditors in full,\n                    as in the present case, the creditors’ interests recede from view: seeHellyer v Hellyer[1996] 2 FLR 579. I\n                    therefore consider it just and convenient to exercise my power under s 112 to\n                    effect a just and equitable division of the matrimonial assets, but to do so, in\n                    the unusual circumstances of this case, subject to a condition precedent which I\n                    attach pursuant to my powers under s 112(5)(e) and s 112(8) of the Women’s Charter. That condition\n                    precedent is the annulment of the husband’s bankruptcy. 125    I have therefore ordered as follows: (a)     Mallal & Namazie shall release\n                        to the Official Assignee from the stakeholding sum which they hold an amount\n                        sufficient to secure the annulment of the husband’s bankruptcy by\n                        certificate of the Official Assignee under s 123A of the Bankruptcy\n                        Act; (b)     Subject\n                        to the bankruptcy of the husband being annulled under s 123A, and\n                        immediately thereupon without need for further order, the following\n                        ancillary orders shall take effect: (i)       The husband shall deliver\n                            to the wife vacant possession of the Serangoon property within two\n                            months of the annulment. (ii)       The husband shall transfer to the wife the\n                            entirety of his right, title and interest in the Serangoon\n                            property. (iii)       Mallal & Namazie shall release to the\n                            wife the balance of the stakeholding money which they\n                        hold. (iv)       The wife shall have no further claim against the husband for any unpaid\n                            costs orders in these or any other proceedings. (v)       Each party shall retain the\n                            assets in his or her sole name. (vi)       The wife shall transfer to the husband all the\n                            shares registered in her name in [Q] Pte Ltd and renounce any interest,\n                            legal or beneficial, therein. These steps, once taken, will discharge entirely the husband’s\n                        obligations towards the wife arising from my division of the spouse’s\n                        matrimonial assets. I have given the parties and the Official Assignee\n                        liberty to apply in relation to matters arising from the implementation of\n                        this order or arising from unforeseen contingencies. 126    I now turn to consider the issue of custody\n                    of the triplets.",
        "Custody and access": "127    As I have mentioned, the wife has had sole\n                    custody, care and control of the triplets since 2010, with the husband having\n                    supervised access to the triplets for two hours every Saturday at the Woodlands\n                    Civic Centre, together with reasonable telephone access. The wife asks that\n                    those orders continue without variation. 128    The husband asks that I order joint custody\n                    of the triplets with care and control to the wife and liberal access to the\n                    husband. He asks for access to the triplets: (i) from 10.00 am to 8.00 pm on\n                    alternate Saturdays; (ii) overnight from 10.00 am on Saturday to 6.00 pm on\n                    Sunday on alternate weekends; (iii) from 10.00 am to 6.00 pm on alternate public\n                    holidays; (iv) half of the school holidays; (v) for the triplets’\n                    birthdays in alternate years, if he does not otherwise have access on that day;\n                    (vi) for his own birthday; and (vii) over the Lunar New Year holiday period\n                    every year, to be divided between himself and the wife.[note: 108] 129    It being common ground that the wife is to\n                    have care and control of the triplets, the only issues I have to decide are\n                    custody of and access to them.",
        "Custody": "130    As the Court of Appeal pointed out inCX v CY(minor: custody and access) [2005] 3\n                    SLR(R) 690 (“CX”) at [31], the\n                    distinction between “custody” and “care and control”\n                    in the context of divorcing parents is that: ... “care and control” concerns day-to-day decision-making,\n                        while residual “custody” concerns the long-term\n                        decision-making for the welfare of the child. The result of the order in the guardianship proceedings in\n                        2010 was to remove from the husband any right to be involved in the\n                        long-term decision-making for the welfare of the triplets. I am not, of\n                        course, bound in any way by that decision. I therefore consider afresh\n                        whether it is right in the circumstances prevailing today for the husband to\n                        be granted joint custody of the triplets with the wife. 131    It is by now well-established that making an\n                    order for joint custody of a child of a marriage is the norm with an order for\n                    sole custody being exceptional:CXat [24]. The\n                    reason for this is that ordinarily, it is in the best interests of a child and\n                    promotes the child’s welfare for the child to have the direct involvement\n                    of both parents in his life:CXat [26] and [27].\n                    The making of a joint custody order also “reminds the parents that the\n                    law expects both of them to co-operate to promote the child’s best\n                    interest”:CXat [28]. 132    The Court of Appeal made clear inCXthat subsisting acrimony between the parents or a\n                    demonstrated inability to co-operate in decision-making affecting the child are\n                    not, in themselves, sufficiently exceptional circumstances to warrant a sole\n                    custody order. A sole custody order is warranted only where there are\n                    circumstances which indicate that a joint custody order would not be in the best\n                    interests of the child. The Court of Appeal (at [38]) gave the following as\n                    examples of such circumstances: We agree with Assoc Prof Debbie Ong that the exceptional circumstances\n                        where sole custody orders are made may be where one parent physically,\n                        sexually or emotionally abuses the child ... or where the relationship of\n                        the parties is such that co-operation is impossible even after avenues of\n                        mediation and counselling have been explored, and the lack of cooperation is\n                        harmful to the child. ... 133    I do not consider it in the triplets’\n                    best interests for the husband to be involved in long-term decision-making for\n                    their welfare. I say that because the husband has, at least since 2008,\n                    demonstrated a very poor ability to make decisions even for his own welfare.\n                    Indeed, what he has shown is an ability to make decisions which are positively\n                    detrimental to his own welfare. I rely for this on: (i) his convictions for\n                    possession and consumption of illegal drugs; (ii) his promiscuous lifestyle\n                    (see [73] above); and (iii) the recklessness by which he is likely to have\n                    acquired his HIV positive status. When the husband has restored some order to\n                    his life and is able once again to demonstrate an ability to make long-term\n                    decisions for his own welfare over an extended period of time, the question of\n                    whether he should have an involvement in the long-term decision-making for the\n                    welfare of his triplets can be revisited. 134    In denying the husband’s request for\n                    joint custody, I bear in mind also that the husband has committed a battery upon\n                    the wife. Although the battery did not cause her serious injuries and has not\n                    been repeated, his aggressive behaviour towards her continued even after 2010.\n                    All of this has combined to leave the wife in fear of having to deal with the\n                        husband,[note: 109]as she would have to if I\n                    were to order joint custody. 135    I should make it clear that I do not rely\n                    either on the husband’s sexual orientation or on his HIV positive status\n                    as reasons in themselves for excluding him from custody of the triplets. The\n                    husband is in the same position as any parent, whatever the gender or sexual\n                    orientation, who has displayed the appallingly poor decision-making ability that\n                    the husband has in the recent past.",
        "Access": "136    I also decline to order any access for the\n                    husband which is more liberal than the two hours a week supervised access and\n                    the telephone access that is now in place. I have two reasons. First, the\n                    husband has not sought access to the triplets since June 2010 and only\n                    infrequently exercised the access which the wife voluntarily offered him before\n                        then.[note: 110]This was the\n                    case quite apart from his inability to take access during his imprisonment in\n                    2013. There is also no evidence that he has been taking his supervised access\n                    with the triplets regularly after his release from prison in September 2013.\n                    Second, I do not consider it in the triplets’ best interests to be exposed\n                    to the husband’s reckless and dissolute lifestyle so long as that\n                    lifestyle continues. 137    It is also my view that the husband’s\n                    existing access should continue to be supervised. First, the husband has on\n                    previous occasions deliberately failed to return the triplets to the wife after\n                    unsupervised access.[note: 111]In his oral submissions\n                    before me, without a trace of irony, the husband himself used the term\n                    “kidnap” to refer to his actions. Second, the father has shown a\n                    propensity not to act in the triplets’ best interests when unsupervised. I\n                    have in mind the displays of temper towards the triplets and the use of physical\n                    force against one of the triplets which the wife relied upon in the personal\n                    protection proceedings and which the husband effectively admitted.",
        "Costs": "138    This being an uncontested divorce, I made no\n                    order as to costs.  [note: 1]IJ [Y] filed on 16 November\n                        2011. [note: 2]2nd Affidavit\n                                of AVM filed on 27 March 2012, paragraph\n                        18. [note: 3]2nd Affidavit\n                                of AVM filed on 27 March 2012, paragraph 5(b)(vi) and\n                            (viii). [note: 4]Statement of Particulars (Amendment No. 1) filed on 4\n                                October 2011, paragraph 1(c). [note: 5]Statement of Particulars filed on 27\n                                January 2011, paragraph 1(c). [note: 6]3rd Affidavit of AVM filed on 20\n                                November 2012, paragraph 14; Statement of Particulars filed on 27\n                                January 2011, paragraph 1(f). [note: 7]Statement of Particulars (Amendment No.\n                                1) filed on 4 October 2011, paragraph 1(d). [note: 8]2nd Affidavit of AVM filed on 27 March 2012, pages 115 to\n                                116. [note: 9]2nd Affidavit\n                                of AVM filed on 27 March 2012, pages 89 to\n                        99. [note: 10]2nd Affidavit of AVM filed on 27 March\n                                2012, pages 116. [note: 11]2nd\n                                Affidavit of AVM filed on 27 March 2012, pages 113 to\n                            114. [note: 12]Statement\n                                of Particulars (Amendment No. 1) filed on 4 October 2011, Exhibit\n                                2. [note: 13]2nd\n                                Affidavit of AVM filed on 27 March 2012, page\n                        100. [note: 14]2nd Affidavit of AVM filed on 27 March 2012, page\n                            101. [note: 15]Statement of Particulars (Amendment\n                                No. 1) filed on 4 October 2011, Exhibit 3. [note: 16]2nd Affidavit of AVM filed on 27 March\n                                2012, page 109. [note: 17]2nd Affidavit of AVM filed on 27 March\n                                2012, paragraph 8. [note: 18]Affidavit of AVM filed on 20 November 2012, paragraph\n                                9. [note: 19]Statement\n                                of Particulars (Amendment No. 1) filed on 4 October 2011, Exhibit\n                                5. [note: 20]2nd Affidavit of AVM filed on 27 March\n                                2012, paragraph 8. [note: 21]2nd Affidavit of AVM filed on 27 March 2012, pages 84 and\n                                85. [note: 22]2nd\n                                Affidavit of AVM filed on 27 March 2012, pages 86 to\n                            88. [note: 23]3rd Affidavit of AWH filed on 26\n                                December 2012, paragraph 21. [note: 24]Notes of\n                                Argument, 1 October 2014, page\n                11. [note: 25]Affidavit\n                                of AWH filed on 8 October 2013, paragraph\n                        6. [note: 26]Husband’s AAM filed on 6\n                                    February 2012, paragraph 4(e). [note: 27]Husband’s AAM, paragraph\n                                    9(4). [note: 28]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph\n                    10. [note: 29]1st\n                                    Affidavit of AVM filed on 15 February 2012, paragraph 10.\n                                    Wife’s Affidavit of 4 November 2013, paragraph\n                                4. [note: 30]1st\n                                    Affidavit of AVM filed on 15 February 2012, paragraph\n                                10. [note: 31]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph 11(a). [note: 32]Affidavit of AWH filed on 19 April 2012, paragraph\n                                    7. [note: 33]1st\n                                    Affidavit of AVM filed on 15 February 2012, paragraph\n                                    11(a). [note: 34]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph\n                    11(a). [note: 35]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph\n                    11(b). [note: 36]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph\n                    12. [note: 37]1st Affidavit of AVM filed on 15 February 2012,\n                                    paragraph 26(a). [note: 38]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph\n                    26(b). [note: 39]1st Affidavit of AVM filed on 15\n                                    February 2012, paragraph 26(c). [note: 40]1st\n                                    Affidavit of AVM filed on 15 February 2012, paragraph\n                                13. [note: 41]Husband’s AAM paragraph\n                                    5. [note: 42]Affidavit of AVM filed on 4 November 2013, paragraph 5(b);\n                                    Plaintiff’s submissions dated 16 March 2014 at paragraph\n                                    14(b). [note: 43]Husband’s AAM, paragraph\n                                    7. [note: 44]Husband’s AAM, paragraph\n                        8. [note: 45]Husband's AAM, paragraph\n                                9. [note: 46]Husband’s AAM, paragraph 1,\n                                    pages 26 to 33. [note: 47]1st Affidavit of AVM filed on 15\n                                February 2012, paragraph 24(a). [note: 48]1st Affidavit of AVM filed on 15 February 2012, paragraph\n                                24(b). [note: 49]1st\n                                Affidavit of AVM filed on 15 February 2012, paragraph\n                            24(c). [note: 50]1st\n                                Affidavit of AVM filed on 15 February 2012, paragraph\n                            24(d). [note: 51]Husband’s AAM, paragraph 35. [note: 52]Husband’s AAM, paragraph\n                36. [note: 53]2nd Affidavit of AVM filed on 27 March\n                                2012, page 40. [note: 54]2nd Affidavit of AVM filed on 27 March\n                                2012, paragraph 13. [note: 55]1st Affidavit of AWH filed on 6 February 2012, paragraph\n                                17. [note: 56]2nd Affidavit of AVM filed on 27 March 2012, page\n                            46. [note: 57]1st Affidavit of AWH filed on 6\n                                February 2012, page 37, paragraph 2. [note: 58]1st Affidavit of AWH filed on 6\n                                February 2012, page 42, paragraph 16. [note: 59]1st\n                                Affidavit of AWH filed on 6 February 2012, page 39, paragraph\n                                6. [note: 60]Affidavit\n                                of AWH filed on 8 October 2013, paragraph\n                        4. [note: 61]1st\n                                Affidavit of AWH filed on 6 February 2012, page 42, paragraph 15 and\n                                page 109. [note: 62]1st Affidavit of AWH filed on 6 February 2012, paragraph\n                                34. [note: 63]1st Affidavit of AWH filed on 6 February 2012, page 41,\n                                paragraph 14(b) and (d). [note: 64]1st\n                                Affidavit of AWH filed on 6 February 2012, page\n                        106. [note: 65]Affidavit of AVM filed on 15 February\n                                2012, paragraph 15(c) and pages 96 to 100. [note: 66]Affidavit\n                                of AVM filed on 15 February 2012, page\n                    96. [note: 67]Affidavit\n                                of AVM filed on 15 February 2012, paragraph\n                        15(e). [note: 68]Affidavit\n                                of AVM filed on 15 February 2012, page 100. [note: 69]1st Affidavit of AWH filed on 6\n                                February 2012, page 42, paragraph 15 and page\n                        109. [note: 70]1st Affidavit of AVM filed on 15\n                                February 2012, paragraph 7(b). [note: 71]1st\n                                Affidavit of AVM filed on 15 February 2012, paragraph\n                            7(d). [note: 72]Affidavit\n                                of AWH filed on 19 April 2012, paragraph\n                    6. [note: 73]2nd\n                                Affidavit of AVM filed on 27 March 2012, paragraph\n                        13. [note: 74]1st Affidavit of AVM filed on 15 February 2012, paragraph\n                                21. [note: 75]Affidavit\n                                of AVM filed on 15 February 2012, paragraph\n                        22(a). [note: 76]Affidavit\n                                of AVM filed on 15 February 2012, paragraphs 22(b) and\n                                24(e)(iii). [note: 77]Affidavit of AWH filed on 6 February\n                                2012, paragraph 18. [note: 78]2nd Affidavit of AVM filed on 27 March 2012, paragraph\n                                14. [note: 79]2nd\n                                Affidavit of AVM filed on 27 March 2012, paragraph\n                        14. [note: 80]2nd Affidavit of AVM filed on 27 March\n                                2012, paragraph 8. [note: 81]Affidavit of AWH filed on 6 February 2012, paragraph\n                                15. [note: 82]Affidavit\n                                of AVM filed on 27 March 2012, paragraphs 8 and\n                        9. [note: 83]Affidavit of AVM filed on 27 March\n                                2012, paragraph 5(c). [note: 84]Affidavit\n                                of AVM filed on 27 March 2012, page 38. [note: 85]Statement of Particulars (Amendment\n                                No. 1) filed on 4 October 2011. [note: 86]Affidavit of AVM filed on 27 March\n                                2012, paragraph 8. [note: 87]Affidavit\n                                of AVM filed on 27 March 2012, paragraph 8. [note: 88]Affidavit\n                                of AVM filed on 27 March 2012, paragraph\n                        20. [note: 89]Affidavit\n                                of AWH filed on 6 February 2012, paragraph\n                        16. [note: 90]Affidavit of AVM filed on 27 March 2012, paragraph\n                            10. [note: 91]Affidavit\n                                of AVM filed on 27 March 2012, paragraph\n                        10. [note: 92]Affidavit of AVM filed on 20 November 2012, pages 32 to\n                                47. [note: 93]Affidavit\n                                of AWH filed on 6 February 2012, paragraph A, page\n                        1. [note: 94]Affidavit\n                                of AVM filed on 20 November 2012, page 54. [note: 95]1st Affidavit of AWH filed on 6 February 2012, page\n                                107. [note: 96]Affidavit of AVM filed on 27 March 2012, paragraph 8, page\n                                9. [note: 97]2nd\n                                Affidavit of AVM filed on 27 March 2012, paragraph\n                        20. [note: 98]2nd Affidavit of AVM filed on 27 March\n                                2012, paragraph 21 and pages 52 to 60. [note: 99]Affidavit of AVM filed on 22 June\n                                2012, paragraph 12. [note: 100]1st Affidavit of AVM filed on 15\n                                February 2012, paragraph 25. [note: 101]1st Affidavit of AVM filed on 15\n                                February 2012, paragraph 16 and page 89. [note: 102]1st\n                                Affidavit of AVM filed on 15 February 2012, page\n                        20. [note: 103]1st Affidavit of AVM filed on 15\n                                February 2012, paragraph 25. [note: 104]1st\n                                Affidavit of AVM filed on 15 February 2012, paragraph\n                            3(c). [note: 105]1st Affidavit of AVM filed on 15\n                                February 2012, pages 25 to\n                29. [note: 106]1st Affidavit of AWH filed on 6\n                                February 2012, paragraph 2. [note: 107]1st Affidavit of AWH filed on 6 February 2012, pages 15 to\n                                20. [note: 108]Husband’s AAM, paragraph\n                    38. [note: 109]Affidavit of AVM filed on 27 March\n                                2012, page 118. [note: 110]Affidavit of AVM filed on 20\n                                November 2012, paragraph 21. [note: 111]Affidavit of AVM filed on 27 March\n                                2012, page 116."
    }
}