{
    "case_title": "Pittis Stavros\n      v\n      Public\nProsecutor",
    "ncitation": "[2015] SGHC 67",
    "coram": "See Kee Oon JC",
    "sections": {
        "Undisputed facts": "4       I\nshall set out first the facts which do not appear to be in dispute.\nThe Vessel is a large cargo ship owned by Universal Reserve SA.\nThe operators of the Vessel – also known as the technical managers\n– were Tsakos Columbia Shipmanagement SA (“Tsakos”). As operators,\nTsakos provided the Vessel with its officers and crew, including\nthe chief engineer: hence the appellant was an employee of Tsakos.\nAt the material time, the Vessel was chartered by V8 Pool Inc (“V8\nPool”) under a time charter. 5       On\n8 January 2013, the Vessel entered Singapore waters after a journey\nof almost a month that commenced on 12 December 2012 from the port\nof Nikiski in Alaska. The long voyage had depleted the Vessel’s\nfuel reserves and so the charterers, V8 Pool, made arrangements\nfor the Vessel to be supplied with 1,800 MT of MFO. The supplier\nof MFO was to be a company called Costank Singapore Pte Ltd (“Costank”). 6       On\n10 January 2013, the Vessel entered the port for bunkering,ie, refuelling. The plan was to supply\nthe Vessel with 500 MT of MFO that afternoon, with the remaining\n1,300 MT to be supplied later. In order to deliver the MFO to the\nVessel, Costank chartered a bunker barge called the “Coastal Saturn”\n– which I shall refer to as “the Barge” – from Heng Tong Fuels and\nShipping Pte Ltd (“Heng Tong”). 7       In\nthe early afternoon of 10 January 2013, one Seah Seng Chuan (“Seah”)\nwent on board the Vessel. Seah was the bunker surveyor and his role\nwas to check the amount of MFO on board the Vessel and the Barge before\nand after the bunkering process, so as to ascertain that the correct amount\nof MFO had been transferred between the two. He would check the amount\nof MFO in the various fuel tanks on board the two vessels by dropping\na sounding tape into each tank to measure the height of the empty space,ie, the space not filled by MFO, in that\ntank. Each vessel would have its own unique calibration table that\nwould tell him how to calculate the volume of MFO from this measurement.\nWith the volume of MFO having been derived, Seah would be able to\ncalculate the weight of the MFO in MT. The measurement taken before\nthe commencement of the bunkering process is called the “opening\nsounding”, and the one taken after its conclusion is the “closing\nsounding”. 8       I\nshould mention at this juncture that this method of using a sounding\ntape is not the only way in which the amount of fuel in the fuel tanks\nmay be ascertained. The appellant explained that in his office on board\nthe Vessel, there are computers that provide a reading of the amount of\nMFO in the Vessel’s fuel tanks. He said that he would check the\nsounding measurements and the computer readings against each other. 9       Sometime\nbetween 1.00pm and 2.00pm, the Barge came up alongside the Vessel.\nIn the Barge was one Tan Shin Yam Tommy (“Tommy”) who was employed\nby Heng Tong as a bunker clerk. His job was to take care of the\ndocumentation involved in the bunkering process. Tommy went over from\nthe Barge to the Vessel, where he met the appellant and Seah. They spoke,\nand Seah then left the appellant and Tommy to carry out his opening sounding\nmeasurements on the seven fuel tanks within the Vessel. 10     At\nsome point before Seah went to do his opening sounding measurements\non the Vessel, the appellant had given him a document, marked as\nexhibit P17 in the court below. This document was a bunker survey\nreport signed by the appellant, and it contained a table showing\nthe amounts of MFO in each of the seven fuel tanks on the Vessel.\nSuch bunker survey reports were prepared by the appellant on a daily\nbasis for transmission to the Vessel’s charterers so that they would\nbe able to keep track of the fuel levels on board. P17 was the bunker\nsurvey report for that day, 10 January 2013, and according to the\ntime stated thereon it had been prepared at 1.00pm. The report stated\nthat there was a total of just under 146 MT of MFO in all of the\nVessel’s fuel tanks. After Seah had taken his measurements and done\nhis calculations, he wrote in his own report that there was a total\nof about 143 MT of MFO in the Vessel’s fuel tanks. Thus his numbers\nroughly tallied with those in P17. 11     Subsequently,\nSeah went over with Tommy to the Barge to carry out the opening\nsounding measurements on the tanks on board the Barge. The appellant\nremained on board the Vessel. Tommy had written in his report that\nthere was about 786 MT of MFO on board the Barge; having taken his measurements,\nSeah then wrote in his own report that there was about 777 MT of\nMFO on board the Barge. Thus these figures also roughly tallied. 12     The\nactual bunkering commenced around 3.00pm and ceased sometime before\n5.00pm. At some point, one Wu Yi Peng (“Wu”) came on board the Vessel\nfrom a small boat having taken that boat from shore. Wu was employed\nas a “checker” by Heng Tong; he testified that his job was to take\nmeasurements of MFO on board Heng Tong’s vessels. Wu’s involvement\nin these events will be elaborated on later. 13     On\ncompletion of the bunkering process, Seah did his rounds taking the\nclosing sounding measurements on board the Vessel and the Barge.\nHe wrote in his report that the Vessel had 495 MT more MFO than\nit did at the beginning. As for the amount of MFO on board the Barge,\nSeah wrote that the Barge had about 283 MT left; Tommy’s figure\nin his own report was 285 MT. Comparing these numbers with the pre-bunkering\nfigures, between 494 and 500 MT of MFO had been transferred out\nof the Barge. Hence all the documents showed that close to 500 MT\nof MFO had been transferred from the Barge to the Vessel – exactly\nas had been arranged. 14     In\na sudden turn of events, officers from the Maritime Port Authority and\nthe Corrupt Practices Investigation Bureau (“CPIB”) came on board the\nVessel and took a number of its occupants into custody, including\nthe appellant, Seah, Tommy and Wu. As it turned out, the authorities\nwere not satisfied that the Barge had in fact supplied the Vessel\nwith approximately 500 MT of MFO.",
        "The competing versions of events": "",
        "Prosecution’s case": "15     At\nthe trial below, Seah, Tommy and Wu all testified for the prosecution.\nThe common story put forward by Seah and Tommy was that the Barge\nhad supplied the Vessel with 300 MT of MFO rather than 500 MT. They\nsaid that they had “doctored” the documentation and adjusted the\nfigures therein to create the impression that 500 MT had been supplied. 16     Seah\nand Tommy both implicated the appellant. They pointed to him as\nthe one who had initiated the short supply of MFO by telling Seah\n“I want business”, and asking Tommy “Do you make business [sic]”, or something along those lines.\nSeah testified that the amount of MFO stated on P17, the bunker\nsurvey report which the appellant had given him before the opening\nsounding measurements were made, was significantly less than the\ntrue amount of MFO in the Vessel’s fuel tanks. P17 recorded that\nthere was about 146 MT of MFO on board, but Seah said that when\nhe did his measurements, the actual figure he obtained exceeded\nthat number by more than 170 MT. He added that he wrote down the\nactual measurements on a piece of rough paper but subsequently threw\nthat piece of paper away. 17     Seah\nfurther said that upon completion of the bunkering process, the appellant\ngave him another document, which was marked as exhibit P11 in the\ncourt below. P11 was ostensibly also a bunker survey report, and\nit resembled P17 in many respects,eg,\nit contained a table setting out the amounts of fuel in each of\nthe Vessel’s seven fuel tanks. The total amount of fuel in all the\ntanks as recorded in P11 was 630 MT. But whereas P17 was dated 10 January\n2013 and stated to have been prepared while the Vessel was in Singapore,\nP11 was dated 12 December 2012 and stated to have been prepared\nwhile the Vessel was in Nikiski. Also, P11 was not signed by the appellant.\nSeah testified that P11 was given to him to facilitate his adjustment\nof the closing sounding measurements. That is, he was to ensure\nthat those measurements produced a number that was close to the 630 MT\nstated in P11. Seah said that P11 was subsequently seized from him by\nthe CPIB. 18     Seah\ntestified that it was eventually agreed that the appellant would receive\nUS$130 per MT of short-supplied MFO – Tommy put the agreed sum at\nUS$130 or US$140 per MT – meaning that the appellant would receive\na total of US$26,000 for his part in the scheme. Seah also said\nthat he himself was to receive US$60 per MT for a total of US$12,000. 19     Thereafter,\nwhile Seah and Tommy were on board the Barge, Tommy spoke on the\nphone to a man working for Costank known as Ryan Lim Tion Choon\n(“Ryan”) and apprised him of the short-supply and buy-back arrangement\nthat had just been agreed. The purpose of this call was to seek Ryan’s\napproval to the arrangement because Ryan would ultimately be providing\nthe money that was to be paid to the appellant and the other participants\nin the scheme. On the prosecution’s case, Wu was the person tasked\nto deliver the money, and that was how he came to be present on board.\nIn Wu’s statement to the CPIB – which the prosecution relied on having\nimpeached Wu’s credit on the stand – he said that he was carrying US$40,000\nin cash.",
        "Defence’s case": "20     The\nappellant testified that, as far as he knew, the Vessel had indeed been\nsupplied with 500 MT of MFO. He denied that he had given Seah false information\nin P17, insisting that, as stated in P17, there had been only 146 MT\nof MFO in the Vessel’s fuel tanks prior to the commencement of the\nbunkering – contrary to Seah’s account that the actual amount of\nMFO at this time was around 320 MT. The appellant explained that\nhe could not have been mistaken because he had had to calculate\nthe amount of MFO every day. 21     The\nappellant also denied having given P11 to Seah upon completion of\nthe bunkering process so that Seah would adjust his closing figures according\nto the document. He maintained that P11 had not actually been seized\nfrom Seah and that it must have been seized from him instead. He initially\ntestified that P11 was a record of the amount of MFO in the Vessel’s fuel\ntanks as at 12 December 2012 while the Vessel was in Nikiski. But\nhe was subsequently shown another bunker survey report, also dated 12 December\n2012 and stated to have been prepared in Nikiski. Unlike P11, this\nreport had been signed by him; he acknowledged that the figure of 1,386 MT\nin this report accurately recorded the amount of MFO actually in the\nVessel’s fuel tanks at that point. He then gave a different explanation\nfor P11, saying that the numbers therein were his calculations as\nto how much MFO would remain in the fuel tanks after 15 days of\ntravelling. He said that P11 had been prepared for the Vessel’s\ncaptain and himself and for no one else, and that the purpose of\npreparing it was to confirm that the Vessel had enough MFO to last\nit for the entire voyage. 22     The\nappellant flatly rejected any notion that he had agreed to receive US$130\nper MT or any sum in return for his alleged participation in the buy-back\nand short-supply scheme. He said that if Seah and Tommy had indeed\ncolluded to supply 200 MT less of MFO to the Vessel than should have\nbeen supplied, he had not been a part of the scheme at all.",
        "The law": "23     The\noffence for which the appellant was charged is defined in s 408\nof the Penal Code and it may be called CBT by clerk or servant.\nIt is an aggravated form of CBT, which is defined in s 405, and\naccordingly carries harsher punishments – the maximum term of imprisonment\nfor CBT is 7 years, as provided for in s 406, but for CBT by clerk\nor servant it is 15 years. CBT itself may be considered to be an\naggravated form of the offence of dishonest misappropriation of\nproperty defined in s 403. For convenience I shall set out the relevant\nparts of these provisions: Criminal\nmisappropriation of property Dishonest\nmisappropriation of property 403.    Whoever\ndishonestly misappropriates or converts to his own use movable property,\nshall be punished with imprisonment for a term which may extend\nto 2 years, or with fine, or with both. … Criminal breach\nof trust 405.    Whoever,\nbeing in any manner entrusted with property, or with any dominion\nover property, dishonestly misappropriates or converts to his own use\nthat property, …, commits “criminal breach of trust”. ... Punishment\nof criminal breach of trust 406.    Whoever\ncommits criminal breach of trust shall be punished with imprisonment\nfor a term which may extend to 7 years, or with fine, or with both. … Criminal breach\nof trust by clerk or servant 408.    Whoever,\nbeing a clerk or servant, or employed as a clerk or servant, and\nbeing in any manner entrusted in such capacity with property, or\nwith any dominion over property, commits criminal breach of trust\nin respect of that property, shall be punished with imprisonment\nfor a term which may extend to 15 years, and shall also be liable\nto fine. 24     Among\nthe contentions advanced by the appellant was that, even if the\nDistrict Judge’s findings of fact are upheld entirely, the legal requirements\nfor the offence under s 408 of the Penal Code are not met. I turn\nnow to summarise the arguments that the appellant made before me.",
        "The appellant’s contentions": "25     First,\nthe appellant continues to deny having been part of a buy-back or\nshort-supply arrangement whereby the Vessel would receive 200 MT\nless MFO than it was supposed to. He argues that the District Judge\ndid not give sufficient weight to various inconsistencies and contradictions\nin the evidence of the prosecution witnesses, in particular Seah\nand Tommy. He contends that the District Judge wrongly ascribed\nreliability to Seah’s and Tommy’s testimonies just because they\nwere self-incriminating, and did not adequately consider the possibility\nthat they might have motives to implicate him falsely. He also says\nthat the District Judge erred in finding that his explanation of\na key document, P11, was a lie. 26     In\naddition to this, the appellant has two fall-back arguments. First,\nhe was at no point entrusted with dominion over the 200 MT of MFO\nthat had allegedly been misappropriated. That 200 MT of MFO never\nactually came on board the Vessel and remained at all times on the\nBarge, meaning that it was the crew of the Barge and not the Vessel\nwho exercised physical control over it. Moreover, he could not possibly\nhave had dominion over the MFO since it did not even belong to V8\nPool throughout the bunkering process – title to the MFO would pass\nonly when V8 Pool made payment, and V8 Pool had not made payment\nat the time. Should I accept this argument but not the appellant’s\nother arguments, his conviction under s 408 of the Penal Code must\nbe set aside, but he may still be liable to a conviction under s 403 for\ndishonest misappropriation of property. 27     The\nappellant’s other fall-back argument is that, even if he had been entrusted\ndominion over the 200 MT of MFO by V8 Pool, he was at no point a\n“clerk or servant” of V8 Pool. Therefore an element of s 408 of\nthe Penal Code is not met and he cannot be convicted of CBT by clerk\nor servant. If this argument is the only one that is accepted, he\nremains liable to be convicted of CBTsimpliciterunder\ns 405 which is an offence punishable under s 406.",
        "Whether the appellant participated\nin a buy-back or short-supply scheme": "28     It\nis not disputed that there is no documentary proof that there was\na short supply of 200 MT of MFO to the Vessel on 10 January 2013. According\nto the documents in evidence, close to 500 MT was supplied. The\nonly evidence that there is more – or less – than meets the eye\nis the testimony of Seah and Tommy to that effect. The allegation\nof a short supply hinges entirely on their oral evidence, and hence\nit is of the highest importance to assess their credibility and\nthe reliability of their accounts. 29     The\nappellant argues that Seah and Tommy’s evidence is unreliable because\nit is replete with inconsistencies and contradictions, and because\nit conflicts in material aspects with the oral evidence of their\nfellow prosecution witness, Wu. The problematic parts of their evidence\nare as follows: (a)     Seah\ntestified that only he and Tommy were present on the Barge when\nthey spoke to Ryan on the phone about the alleged buy-back arrangement\nand how much each participant should be paid, but Tommy testified\nthat the appellant was also present at this discussion. (b)     Seah\ntestified that he, the appellant and Tommy would all be paid for\ntheir part in the scheme, in the amounts of US$60, US$130 and US$30\nper MT respectively, but Tommy testified that only Seah and the\nappellant would be paid, with the former receiving US$70 per MT\nand the latter something between US$130 and US$140 per MT. (c)     Seah\ntestified that the agreement reached was that a total of US$44,000\nwould be paid to all the people involved in the scheme, but Tommy\nsaid that it was US$40,000, and this might be contrasted with Wu’s\nevidence on the stand – he initially said that he brought only US$30,000\non board the Vessel but later testified that it was “not more than\nUS$40,000”. (d)     Tommy\ntestified that the money to be paid to the scheme’s participants\ncame from Ryan, but Wu testified that it was partly his own money\nand partly money that had been obtained from embezzling the wages\nof crew from a company related to Heng Tong. (e)     Tommy\ntestified that Wu passed him the money in two bundles of US currency\nnotes, but Wu said in his statement to the CPIB that the money was\nbundled into four stacks. (f)     Tommy\ntestified that prior to the events in this case he had never accepted\nany offers to participate in buy-back or short-supply schemes, but\nhe later testified that he had doctored figures and received monetary\ngratification pursuant to other such schemes. 30     Most\nof these inconsistencies were brought to the attention of the District\nJudge and were expressly noted in his GD. Ultimately the District Judge\nthought that these discrepancies were minor and not particularly significant\n(see the GD at[47]–[50]and [89]–[95]).\nThe “most significant fact”, according to him, was that “both Tommy\nand Seah had given clearly incriminating evidence against themselves\nknowing full well that their admission would expose them to being\nprosecuted in court” (at[51]). 31     In\nmy judgment, the approach of the District Judge cannot be faulted. He\nwas entirely correct not to place too much emphasis on the minute details\nof the evidence and instead to consider the broad possibilities\nand the likelihood of each possibility being true. It appears that\nthere are three broad and distinct possibilities: (i) there was\nin fact no short supply of fuel, (ii) there was a short supply but\nthe appellant was not aware of it, and (iii) there was a short supply\nand the appellant was aware of it. Like the District Judge, I am\nof the view that the first possibility is not at all likely. It must\nbe remembered that there was no documentary evidence of any short supply;\nif there had indeed been no short supply, I agree that it would\nhave been “befuddling and wholly senseless” (see the GD at[46]) for Seah and Tommy\nto assert otherwise against their own interests. 32     The\nappellant then suggests that Seah and/or Tommy might have short-supplied\nother ships earlier in the day on 10 January 2013, or perhaps in\nthe few days before that, and that they might have decided to implicate the\nappellant to direct attention away from their other misdeeds. But\nif indeed Seah and/or Tommy had feared that their past wrongdoing\nwould soon come to light, it is difficult to understand how it would\nmitigate matters to drag the appellant in. The hypothesis must be\nthat Seah and/or Tommy sought to escape sanction for their earlier\nmisdeeds by giving the authorities a bigger fish to fry, so to speak,\nin the shape of the appellant. However, the general consistency\nbetween the accounts of Seah and Tommy makes this highly implausible\n– given that the authorities took them into custody on board the\nVessel, it is hardly probable that they would have had time to agree\non a common fictitious story. 33     As\nfor the second possibility, which is that Seah and Tommy conspired\nwithout the appellant’s knowledge to supply only 300 MT of MFO to\nthe Vessel, the District Judge gave this short shrift (at[36]–[38]of the GD).\nIn my view the District Judge’s reasoning on this point is beyond reproach\nand I too would reject that possibility. Therefore the most likely possibility\nis that there was indeed a short supply and that the appellant was aware\nof it. 34     The\nconclusion is buttressed by the appellant’s own performance on the\nstand, which did not show him to be a credible witness. The District Judge\nthought that the appellant’s explanations for the document P11 were wholly\nunconvincing (at[61]–[69]of the GD).\nI agree with his reasoning. As the District Judge rightly noted,\nthe appellant furnished one explanation for it in evidence-in-chief\nbefore changing his tune completely when shown another document\nin cross-examination, and the explanation that he eventually settled\non does not make much sense for the reasons given by the District\nJudge. 35     Finally,\nthere was the fact that when surveyors commissioned by the port\nauthorities measured the amount of MFO in the various fuel tanks\nof the Vessel in the evening of 10 January 2013, their measurements\nwere strikingly similar to the numbers in P11, as shown in the GD\nat[57]. It\nis thus a strong inference that, upon the completion of the bunkering\nprocess, the MFO in the Vessel was distributed among the Vessel’s\nseven fuel tanks so that the final amounts in each tank would roughly\nfollow the figures in P11. This yields some insight into the nature\nof P11 and what sort of document it is. It is likely that Seah was\ntruthful in testifying that the numbers in P11 represented the amounts\nof MFO in each fuel tank that were to be achieved in order to avert\nany suspicion of short supply; in contrast, it is unlikely that\nP11 contained the appellant’s calculations as to how much MFO would\nbe left in the tanks after 15 days of travelling, as he claimed. 36     Before\nme, the defence mounted an attack on the measurements of the surveyors,\nsaying that the surveyors’ report containing those measurements\nhad been put into evidence without the maker of the report having\nbeen called. But I do not see where the defence could be going with this\nbecause it was the defence which had sought admission of the surveyors’\nreport in the first place – it was marked as defence exhibit D3. Absent\nany cogent evidence that the surveyors’ measurements were somehow\nerroneous, I can see no basis to impugn them at this stage. 37     For\nthese reasons, I am satisfied that there is no warrant for me to disturb\nthe District Judge’s finding that there had been a short-supply scheme\nand that the appellant had participated in it. Accordingly I affirm his\nholding that the appellant had dishonestly misappropriated 200 MT\nof MFO.",
        "Whether the appellant was entrusted\nwith dominion over the MFO": "38     The\nappellant’s next argument is that he had not been entrusted with dominion\nover the misappropriated 200 MT of MFO at any time. It is not controverted\nthat this 200 MT of MFO remained at all times on the Barge. The\nappellant’s point is that as chief engineer of the Vessel, his dominion was,\nat best, over the Vessel and its contents and not the Barge. Hence, anything\non the Barge, including the misappropriated 200 MT of MFO, would\nnot have been within his dominion. After all, he says, the crew\nof the Barge could have unilaterally ceased transferring MFO to\nthe Vessel at any time, and he would not have been able to do anything\nabout it. 39     It\nis established law that the question of whether a person has dominion\nover property is a matter of the degree of control exercised by\nthe person over the property: see the decision of Yong Pung How\nCJ inHon Chi Wan Colman v Public Prosecutor[2002]\n2 SLR(R) 821 at[48].\nYong CJ also said that a “general degree of control” can amount\nto the requisite dominion (at[50]).\nThus the question is whether the appellant in the present case had\ncontrol over the MFO on the Barge. In my view, the clear answer\nis yes. Although Tommy undoubtedly had control over the MFO in that\nhe could have physically stopped the transfer of MFO to the Vessel,\nthis does not mean that the appellant did not also have control\nover the MFO. The appellant’s control stemmed not from any physical\nmastery over the MFO, but from his having been empowered to receive\nthe MFO on behalf of a party legally entitled to receive it,viz, V8 Pool. 40     It\nwould appear that there are two assumptions in the appellant’s arguments.\nThe first is that dominion is constituted exclusively byphysicalcontrol. The second is that only\none person may have control and dominion over any given property.\nNeither of these limitations exist in the language of the relevant\nPenal Code provisions, and in the absence of any supporting authority,\nI do not see any basis for departing from the common-sense view\nthat (i) dominion may be constituted by non-physical control, and\n(ii) more than one person may have dominion over the same property\nat the same time. Indeed, I would say that the facts of this case illustrate\nhow insensible it would be to confine the concept of dominion in the\nmanner urged by the appellant. 41     The\nappellant’s next contention in this regard is that V8 Pool could not\npossibly have entrusted him with dominion over the MFO because V8 Pool\ndid not have any dominion over the MFO to begin with. At the time the\nMFO was being transferred to the Vessel, V8 Pool had yet to pay\nfor it and hence did not own it, meaning that the MFO was not V8\nPool’s “property”. 42     I\ndo not accept this contention. A person does not have to be the owner\nof property in order to have a right to take possession of it. There\nis no requirement in the provisions of the Penal Code that the property\nin question must be owned by the person from whom it is misappropriated. So\nlong as that person has some sort of right to the property, which\nright he then delegates to or confers upon someone else, there has\nin my opinion been an entrustment of dominion over the property\nby the first person to the second. This is precisely what happened\nin the present case. 43     As\nthe deputy public prosecutor Mr Sanjiv Vaswani pointed out in oral\nsubmissions, questions of title and ownership may often be the subject of\nprivate arrangements that are outside the knowledge of the accused.\nHe put forward the following illustration: suppose an employee is\ngiven a work laptop by his employer and he misappropriates it or\nconverts it to his own use. It may well be that, unknown to the\nemployee, the employer is not in fact the owner of the laptop because\nit was purchased on credit terms and title would pass only upon\nfull payment. I find that Mr Vaswani’s illustration is a helpful\nand compelling one; it is not easy to see why the mere fact that\nthe employer does not own the laptop should make any difference\nto the employee’s criminal liability. 44     I\nmight add that, if there were a requirement of ownership as the appellant\nsuggests, it would not be possible to commit CBT in respect of bank\naccounts, as where, for instance, an employee wrongfully withdraws money\nfrom his employer’s bank account and uses that money as his own. This\nis because the monies in the account are owned by the bank and not the\nemployer. In my view, it cannot be that for this reason alone the employee\nwould not have committed CBT. 45     Therefore,\nI am satisfied that the District Judge was right to hold that the\nappellant had been entrusted by V8 Pool with dominion over the misappropriated\n200 MT of MFO, even though V8 Pool might not have been the owner\nof the MFO at the relevant time. I note that the charge formulated\nagainst the appellant states that the MFO was property “belonging\nto V8 Pool Inc”. For the reasons given by the appellant I am not sure\nthat statement is accurate. However, I do not think that this is\nfatal to the prosecution’s case; it can be rectified simply by deleting\nthe words “belonging to V8 Pool Inc”.",
        "Whether the appellant was a\nservant of V8 Pool": "46     The\nresult of the foregoing analysis is that the appellant is guilty\nof at least CBTsimpliciteras defined\nby s 405 of the Penal Code. The final issue is whether the appellant\nwas a servant of V8 Pool and entrusted with dominion over the MFO\nin that capacity – if so, he would be guilty of CBT by clerk or\nservant under s 408. 47     The\nappellant’s contention is a simple one. The factual premise is that the\ncharter which V8 Pool had over the Vessel was a time charter, as opposed\nto a “demise” or “bareboat” charter. In time charters, the officers and\ncrew on board the Vessel are provided by the owners and not the charterers;\nby way of comparison, in demise or bareboat charters it is the charterers\nwho provide their own manpower. In the instant case, it was the operators\nor technical managers, Tsakos, which provided the officers and crew,\nand at all times the appellant was employee of Tsakos and not V8 Pool.\nIn these circumstances, it is urged that the appellant cannot have\nbeen a servant of V8 Pool. 48     The\nrespondent’s argument – on the authority of an English case of some\nvintage,viz,The\nQueen v Negus(1873) LR 2 CCR 34 (“Negus”)\n– was that the test was simply whether the appellant was “under\nthe control and bound to obey the orders of his master”, V8 Pool.\nIn the instant case, said the respondent, the appellant was certainly\nunder the control of V8 Pool and bound to obey its orders. There\nwas uncontested evidence that V8 Pool would give instructions to\nthe officers and crew of the Vessel which they were bound to comply\nwith. The appellant was one such officer and accordingly he was\na servant of V8 Pool. 49     Before\nI address the substantive merits of the arguments, I should note\nas a preliminary point that this contention that the appellant was\nnot a “servant” was not made in the court below. It was not accurate\nfor counsel for the appellant to state at[53]of the appellant’s skeletal\nsubmissions that this point “was not fully ventilated during submissions\nin the Court below”; in fact, the point was not taken at all. There\nwas no indication at all that it was a point of dispute between\nthe parties at any time during the trial. I do not understand Mr\nVaswani to have suggested that the appellant was precluded or estopped\nfrom making this new argument on appeal, and that is to his credit.\nThe prosecution ultimately and invariably bears the burden of proving\nthe elements of the offence beyond a reasonable doubt, and a conviction\nmust be set aside so long as there is reasonable doubt as to the existence\nany one of those elements, even if there was no contest on it at first\ninstance. 50     In\nmy judgment, there is merit in the appellant’s arguments. Absent from\nthe relationship between V8 Pool and the Vessel’s officers and crew are\nwhat might be thought to be the usual incidents of a master-servant relationship.\nThese include: (i) legal obligations owed by the servant to the master,\n(ii) legal rights or recourse that the master has against the servant, and\n(iii) the master’s provision of the servant’s salaries and other\njob-related benefits or necessities. 51     As\nto the first aspect, a reading of the terms and conditions of the\ntime charter reveals that there is no contemplation of legal obligations\nbeing owed directly to V8 Pool by the Vessel’s officers and crew.\nAny obedience due from the Vessel’s working personnel to V8 Pool\nwas a result of legal obligations owed by theownersto\nV8 Pool. For instance, under the time charter between the owners\nand V8 Pool, the owners guaranteed that the officers and crew of\nthe Vessel would “load and discharge cargo as rapidly as possible\nwhen required by [V8 Pool] or their agents to do so”. 52     As\nto the second aspect, there was a lack of direct legal recourse available\nto V8 Pool against the Vessel’s working personnel. One of the clauses\nin the time charter provided that, should V8 Pool “complain of the conduct\nof the master or any of the officers or crew”, it was the owners’ obligation\nimmediately to “investigate the complaint”, and should the complaint\nprove to be well-founded, it was the owners who would “make a change\nin the appointments”. 53     As\nto the third aspect, the Vessel’s working personnel did not receive their\nsalaries and job-related benefits from V8 Pool. Rather, it was the owners\nwho were obliged to “provide and to pay for all provisions, wages and\nshipping and discharging fees and all other expenses of the master, officers\nand crew”. 54     The\npicture that emerges is that the officers and crew on the Vessel would\nanswer not to V8 Pool but to their employers Tsakos and, through Tsakos,\nto the owners. There was some reciprocity to this in that the owners and\nTsakos and not V8 Pool were the ones responsible for the Vessel’s working\npersonnel. Given these circumstances, unless compelled to a different\nconclusion by authority, I find that the appellant was not a servant of\nV8 Pool. 55     I\ndo not think that the respondent can derive much assistance fromNegus, the case which it cited. The facts\nof that case are very briefly stated in the report, but they are\nsufficient to ascertain that the accused there “was engaged by the\nprosecutors to solicit orders for them, and he was to be paid by\na commission on the sums received through his means”. Thus it seems that\nthe accused there was undoubtedly employed or “engaged” directly\nby the person of whom he was said to be a “servant”. It was in this\ncontext that Blackburn J (at 37) held that the test of whether the\naccused was a servant was whether he is “under the control and bound\nto obey the orders of his master”. 56     In\nmy view, given the factual context inNegus,\nthe enquiry posed by Blackburn Jpresupposesthe\nexistence of a relationship characterised by reciprocal legal obligations\nto and rights against each other. It is only when this has been\nestablished that Blackburn J’s test kicks in and the focus shifts to\nthe extent of the control that the one has over the other. Where,\nhowever, that relationship has not even been established, I do not\nthink that the test laid down by Blackburn J has any application. 57     In\nthe present case, even though the appellant and the other officers and\ncrew of the Vessel might have been bound to obey the orders of V8 Pool,\nin my opinion it makes all the difference that this obligation to\nobey was not an obligation owed directly to V8 Pool, but one owed\nto the owners of the Vessel. More broadly, I do not see a reciprocity\nof legal obligations and rights between the appellant and V8 Pool.\nIn these circumstances, I am satisfied that the appellant was not\na “servant” of V8 Pool.",
        "Conclusion on the appeal against\nconviction": "58     I\ntherefore allow in part the appeal against conviction. I shall set\naside the conviction under s 408 of the Penal Code, but on the evidence\nI am satisfied beyond a reasonable doubt that the legal conditions\nfor the offence of CBTsimpliciterunder\ns 405 of the Penal Code have all been established. Accordingly I\nshall substitute a conviction under s 406 of the Penal Code, and\nI turn now to consider the appropriate sentence in this case.",
        "The appeal against sentence": "59     The\nprosecution’s arguments in the appeal against sentence were, for the\nmost part, premised on my affirming the appellant’s conviction for\nCBT by clerk or servant under s 408 of the Penal Code. Almost all\nof the precedents cited were s 408 cases. It goes without saying\nthat these precedents are not very helpful given my decision to\nset aside the appellant’s s 408 conviction and to substitute a conviction\nfor CBTsimpliciter. 60     The\nappellant did highlight for my consideration two precedents involving\nCBTsimpliciter. These cases pre-date\nthe 2008 amendments to the Penal Code and should be viewed in the\nlight of the lower maximum imprisonment term of 3 years for such\noffences under the Penal Code which was then in force. In the prevailing\nversion of the Penal Code which the appellant is to be sentenced\nunder, the maximum imprisonment term for CBTsimpliciterunder\ns 406 is 7 years. 61     In\nthe High Court decision ofOng Chee Eng v PP[2012]\n3 SLR 776 at[24],\nChao Hick Tin JA had observed that “where Parliament has enacted\na range of possible sentences, it is the duty of the court to ensure\nthat the full spectrum is carefully explored in determining the\nappropriate sentence”. This was cited with approval by Sundaresh\nMenon CJ inPoh Boon Kiat v PP[2014]\n4 SLR 892 at[60].\nMenon CJ further noted, citingAngliss Singapore\nPte Ltd v PP[2006] 4 SLR(R) 653  at [86], that the statutory maximum\nsentence signals the gravity with which Parliament views any individual\noffence and that the sentencing judge “ought to note the maximum\npenalty imposed and then apply his mind to determine precisely where\nthe offender’s conduct falls within the entire range of punishment devised\nby Parliament”. 62     Since\nthe full range of sentencing options ought to be considered, it would\nfollow that the same criminal conduct could attract a higher sentence where\nthe maximum was 7 years’ as compared to 3 years’ imprisonment. But\nultimately whether a higher sentence is warranted must still depend\non a careful consideration of the gravity of the offending conduct\nin each case. In this regard, the following observations of the\nSenior Minister of State for Law and Home Affairs, Associate Professor\nHo Peng Kee, during the Second Reading of the Penal Code (Amendment)\nBill are apposite. He explained that “it does not mean that automatically\nwhen the maximum punishment is raised, the punishment will go up”:\nsee theSingapore Parliamentary Debates, Official\nReport(23 October 2007) vol 83 at col 2439. At the Opening\nof the Legal Year 2008, the Public Prosecutor similarly noted that\nthe prosecution “will not automatically press for higher sentences\nmerely because the maximum penalties have been increased”. 63     The\nprosecution did bring to my attention two s 406 precedents. The first\nwas the case ofSoh Wei Siang(DAC047766/2013\nand others, unreported) in which the offender rented four vehicles\nwhich he then drove into Malaysia and did not return to the rental\ncompanies. He was eventually arrested in Malaysia. The vehicles\nwere not recovered and no restitution was made. The offender pleaded\nguilty to two charges – each charge was for CBT in respect of one\nof the cars. The two cars which were the subject-matter of these\ncharges were worth $228,000 and $155,000. Two other charges, for\nCBT in respect of the remaining two cars which were worth $150,000\nand $98,000, were taken into consideration. The offender was sentenced\nto 20 months’ imprisonment on each of the two charges to which he\npleaded guilty, and these terms of imprisonment were ordered to\nrun consecutively for a total sentence of 40 months’ imprisonment. 64     The\nprosecution candidly acknowledged that, since the appellant in this\ncase had been sentenced to 18 months’ imprisonment on a charge under\ns 408 of the Penal Code, should the charge be reduced to one  punishable\nunder s 406, the sentence should logically be less than 18 months’\nimprisonment. Hence, the prosecution accepted that the imprisonment\nterm of 20 months imposed inSoh Wei Siangwould\nbe inapt in the instant case. In my view this point was correctly\nconceded by the prosecution. 65     The\nother s 406 precedent mentioned by the prosecution was the case ofKaren Teo(DAC902611/2014 and others,\nunreported). The offender there was an executive assistant who had\nbeen entrusted with dominion over her boss’s pre-signed cheques.\nShe misappropriated a cheque worth $138,491.75. She pleaded guilty\nto one charge of CBT in respect of that cheque; taken into consideration\nwere a few other CBT charges. She was sentenced to 9 months’ imprisonment. 66     For\nCBT offences, the value of the property misappropriated is a very significant\nfactor in sentencing, as the District Judge rightly noted at [99]–[100]\nof the GD. The two precedents highlighted by the prosecution were\nundoubtedly chosen with that in mind because the amount misappropriated\nin this case, $153,358.51 – which was how much V8 Pool paid for\nthe short-supplied 200 MT of MFO – was not far from the amounts misappropriated\nin those precedents. Having said that, as the District Judge observed\nat [112] of the GD, in this case the loss caused to V8 Pool was\nnot equivalent to the gain which the appellant stood to enjoy, which\nwas US$26,000. In fact, it is possible that the appellant did not\nin fact enjoy any gain: the evidence is that the money, which the\nauthorities did not manage to recover, was last seen in the hands\nof an unidentified colleague of the appellant. In those circumstances\nthe District Judge thought that a downward adjustment in sentence\nwas warranted (at [113] of the GD) and I am inclined to agree. 67     Another\nimportant consideration in sentencing is whether the offender made\nrestitution. That tends to demonstrate genuine remorse – although\nI might add that restitution does notnecessarilyimply\nremorse – and genuine remorse does call for a lower sentence. In\nthe case ofKaren Teo, the offender\nmade restitution even before she was charged and she also pleaded\nguilty, and in my opinion the relatively lenient sentence of 9 months’\nimprisonment has to be seen in that light. In contrast, there was\nin the present case no attempt at restitution, and hence the appellant\ncannot claim the benefit of that particular mitigating factor. Moreover,\nas the District Judge noted at [110] of the GD, the fact that the\nappellant claimed trial shows an absence of remorse on his part. 68     The\nDistrict Judge seemed to think it an aggravating factor that the appellant\nhad “abused his senior position as the Chief Engineer and betrayed\nthe trust reposed in him” (at [110] of the GD). In the same vein, based\non the prosecution’s summary of the case ofKaren\nTeo, the judge there thought that the offender’s “abuse\nof trust” was an aggravating factor. With respect, I would caution\nagainst placing too much emphasis on this notion of “abuse of trust”.\nAbuse of trustper seis inherent\nin the offence of CBT; to put it another way, it is a constitutive\nelement of the offence. To say that abuse of trust is, over and\nabove that, an aggravating factor is, in my view, an error of double-counting. 69     That\nsaid, I think that the District Judge in this case was not wrong\nin so far as he implied that the seniority of an offender’s position\nis a factor to be taken into account in sentencing. It is a sensible\nproposition that the greater the trust reposed in an offender that\nis subsequently betrayed, the higher the sentence ought to be. Thus\na chief executive officer entrusted with the affairs of an entire\ncompany who commits CBT is more culpable than an administrative\nassistant entrusted with less extensive matters. Similarly, a ship’s\nchief engineer who commits CBT is more culpable than a junior officer\nor crew member. It is difficult, however, to draw comparisons between\na chief engineer and an administrative assistant (as inKaren Teo) or a customer of a car rental\ncompany (as inSoh Wei Siang) and\nso I shall not make use of the seniority of the appellant’s office\nas a basis to add to or subtract from the sentences imposed in the\ntwo precedents. 70     Finally,\nI agree with the District Judge’s view (at [109] of the GD) that such\nbunkering offences as the appellant’s are difficult to detect because there\nwould be doctoring of documents so as not to leave any paper trail that\nmight reveal the criminality, and that these offences threaten Singapore’s\neconomic interests. Hence I also agree that these considerations call\nfor an appropriate sentence on the ground of general deterrence. 71     Taking\nall these factors in the round, I am of the view that the sentence\nought to fall somewhere between the 9 months’ imprisonment inKaren Teoand the 20 months’ imprisonment\ninSoh Wei Siang. I would impose\na sentence of 14 months’ imprisonment.",
        "Order": "72     For\nthe above reasons, I set aside the appellant’s conviction under s 408\nof the Penal Code. I order that the words “belonging to V8 Pool\nInc.” be deleted from the charge and that the reference therein\nto “Section 408 of the Penal Code, Chapter 224” be replaced by a\nreference to “Section 406” of the same. I convict him on that amended\ncharge. It follows that the sentence imposed by the District Judge\nshould be reduced and so I sentence the appellant to 14 months’\nimprisonment."
    }
}