{
    "case_title": "ATU and others\n      v\n      ATY",
    "ncitation": "[2015] SGHC 184",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1       This is a defamation action arising out of the alleged sexual abuse of children by staff in an international school in Jakarta, Indonesia. The matter came before me for damages to be assessed after judgment in default of appearance was entered against the defendant.",
        "Facts": "",
        "The parties to the dispute": "2       ATU, the first plaintiff, is a private, non-profit international school that serves, in the main, the expatriate community in Jakarta. The school has three campuses: two for elementary students, and another for junior high and high school students in Cilandak. ATV, the second plaintiff, is the principal of one of the campuses for elementary students (“the Campus”). ATW, the third plaintiff, was a school administrator while ATX, the fourth plaintiff, was a teacher’s aide. 3       The defendant is the mother of B, who was a student of the Campus.",
        "The background to the dispute": "4       As the defendant did not participate in the suit, the facts set out below are all obtained from the affidavits of the plaintiffs. They disclose as follows. 5       Sometime in March 2014, the parents of C complained that their son was assaulted by people in blue uniforms. On 24 March 2014, C’s parents lodged a police report. On 3 April 2014, the police arrested three cleaners employed by a cleaning company engaged by ATU. 6       On 14 April 2014, C’s mother called for a press conference at which she alleged that C had been sexually assaulted by cleaners working at ATU. The press conference appeared on television and other media. At the same time, C’s mother also called for a parents’ meeting to be held on 15 April 2014. At that meeting, the defendant claimed that B, was the victim of an attempted assault but had managed to get away in time. After the defendant’s allegation at the parents’ meeting of 15 April 2014, ATU engaged (on 16 April 2014) an expert in the area of clinical social work and child counselling, to interview B to find out what happened. 7       On 25 April 2014, the defendant and her husband met with representatives of ATU as well as a representative from the Spanish embassy. At that meeting, the defendant and her husband repeated their allegation that B was the victim of an attempted assault and further alleged that B had witnessed C being abused. They claimed that the attackers were the fourth plaintiff and a security guard. 8       Around this time, the defendant told at least one of her friends that B had not been sexually assaulted. In a statutory declaration made pursuant to the Oaths and Declarations Act (Cap 211, 2001 Rev Ed), the defendant’s friend (“D”) stated: Sometime in late April, whilst [the defendant] and I were sitting and talking at the cafeteria at [the Campus] and we were discussing [B], [the defendant] said very clearly that her son [B] had not been sexually assaulted. 9       In an email dated 29 April 2014, B’s father wrote: We will like to share with you that we had to perform another deep “interrogation” session with our son today (we know this may not be the best manner, but we had to know!) about what happened. He did not add any new details, and he confirmed that he was physically assaulted 3 times and that he saw his best friend being raped by the cleaning staff, but he ran away in the four occasions.He sticks to his initial positioning that he always escaped and that no sexual assault ever happened to him… [emphasis in original] 10     The above statements were corroborated by the results of a physical examination conducted on B at KK Women’s and Children’s Hospital. There was no sign of any trauma to B’s anus – no fissures or evidence of healed fissures. The clinical notes concluded that either there was a previous injury that had healed or there was no significant injury to begin with. 11     After the physical examination at KK Women’s and Children’s Hospital, the defendant sent a text message to an ATU parent saying that everything was okay. The translation of the message is set out below: May 9.. Thank God everything is okay. Not sure what happened in the school but the doctor didn’t find anything – not even wounds or scars, not sure whether it’s because they are fully recovered or as per his confession that he has never been sodomized. It is weird that after the endoscopy he didn’t feel anything although the doctor said it should be painful, either he is already immune or he endures it :(, but we’re more than happy because at least we can close this chapter and start a new chapter in Singapore^_^. 12     Later in May 2014, the defendant continued to maintain that B had never been sexually assaulted. In her statutory declaration, D said: I later heard reports about a second child being a victim of sexual abuse at [the Campus]. [The defendant] told me that the child being referred to was [B]. However, this contradicted what [the defendant] had said earlier to me which was that [B] had not been sexually assaulted. [The defendant] explained this inconsistency in a WhatsApp message to me saying that “the news exaggerate[d] too much” and that she never said that her son had been raped. 13     Up to this point, it appeared that the defendant had taken the position that B had not been sexually assaulted. 14     However the defendant’s story changed soon after. In a series of emails and WhatsApp messages to various parents of students at ATU, the defendant claimed that B was sexually assaulted. 15     On 28 May 2014, the defendant sent an email to three ATU parents (“the 28 May Email”) alleging,inter alia, that B was raped more than 20 times and that the recipient’s son was also a victim. These emails did not identify any of the plaintiffs save that the purported abuse had taken place at ATU. The emails were almost identical; only the addressees were changed. One of these emails read: Dear [E], Sorry to disturb you this night, [B] just wake me up with his weird dream again calling your son’s name. Sorry that I didn’t reach you earlier as I should, it’s just I don’t want you to get panic only because ‘the suspect’ recognise your son as one of their victim too. But the truth, [B] is another victim of the sexual scandal at the school-he’s been rape for over 20 times (recognising the perpetrator by picture!!!) and last friday he was questioned/interviewed by the police and yet again your son’s name also come as ‘one of another’ victim (he named around 8 friends-5 of them from his class, one of the other three also already confess to his parents that it had happened to him too). When I asked him how do you know about the other children-he told me that some of them share/talking the same topic during lunch, but in your son’s case he said he saw him being attacked by ‘those bad guys’ and [F] also told [B] the story too. The police investigator came to our place with one class photo, in that photo your son’s face was one of 5 faces that had been circled by pen a couple times. The police asked me to get in touch with the parents of all those kids (they ask the school already to help but refused). I didn’t want to alarm any parents only because ‘the suspects’ recognise their children’s faces, but in you son’s case there are to many coincidences supporting it. Please talk to him about it and in case also check him medically to make sure about this. I’d like to share one other detail to you, in [C], [B] and one more boy testimony there are other persons implicated to this-not only the cleaner but also security personal and ‘important’ person in that team. Ibegyou for more discretion, since police and FBI (national police already ask FBI a help to investigate the possible involvement of the others-even foreigner in this). If you don’t know where to start the conversation with your kid, just tell him about [B] testimony (lunchtime story sharing too). False he recognise something, show him the year book (some of the perpetrator are in the last year yearbook) and also all the [ATU] personal from [ATU]NET. [B] recognise all the perpetrator from 2 sources+ police picture too. I hope all this about your son was just a bad dream, but it’s better you now all by now if that is true or not so he can get professional help and not waiting until it was to late to get any help. After telling all the truth, [B] is much reliever than before, and now with outside psychological treatment he is recuperating pretty well and start to cope with this tragedy significantly. I don’t hate [ATU] and I’m not agree if the government need to close the school,but I want all the ‘perpetrator’ to be caught and bring to justice and also to prevent of any further attack. If you need any more info please do not hesitate to email me (my phone doesn’t work any longer). [The defendant] Sent from my iPhone [emphasis in original] 16     On 5 June 2014, the defendant sent another email to the parents of six ATU students alleging that her son, together with their children, were victims of sexual assault (“the 5 June Email”). In the same email, the defendant also claimed that the incidents of sexual assaults had been filmed and recorded. The email included,inter alia, photos of the third and fourth plaintiffs. The text of the email reads: These are the persons that hurting the children (so far 3 already confess and make a police report). All of the cleaners-actual suspects- confessing and circling The picture of your children!! and the 3 victims (one of them is [B]) also confessing that they know, saw and hear about your boys too. I’m soo sorry to come to you this way but, the 3 boys confess after they saw this pictures. The main perpetrator are the two first person!!!! Yes difficult to believe but they had been abusing our children badly and threatening all of them with I’m going to kill your mum or dad or … If you tell them what happen here!!! Thats why the children never speak out!! They are scared to death that their love one will be hurt by those guys!! This is not an easy step!!!! My husband almost kill me because of this story!! He doesn’t want to heard anything about this at the beginning. Now he regretted so much that he didn’t want to do the step in questioning my boy. As you all know [B] confess that he had been attack physically, but once I show all this picture, he started speaking all the real story. I started asking names of other children, and as I said yours children are in their list of victims too (either [B] saw it or even heard it from your own children on lunch time talk). They recorded all the act by phone or even video camera. Every time the first guy do his job he always wear his skeleton t-shirt. Do your self a big favour for the sake of your own children, show them this pictures, if they recognise (watch their face reaction!!!!) and confess then find some help asap. If they don’t recognise those picture (no changes in face expression) than you are the lucky one. The person in the middle He suicide. [The defendant] Sent from my iPhone 17     On 6 June 2014, the defendant sent a WhatsApp message (“the 6 June WhatsApp”) to the parent of a ATU student, alleging that the third and fourth plaintiffs had brutally violated children. She further alleged that the second plaintiff participated in the abuse by taking the children to places where they were raped and filming the rapes. She also claimed that the school was aware of the abuse but wanted to wash “their hands off this” by claiming that the perpetrators had already been deported. The message which was originally written in Spanish was forwarded to the Deputy Head of School of ATU. The following translation was provided by the recipient of the message: XXXX, Good Morning, how are you. I’m in jakarta again and now I’m on my way to the police. I do not need to tell you what’s happened to us and I think you know very well who I’m talking about I send this message as your friend, mom of two children and victims also. [B], [D], [C] and probably a lot more children-which of they can be your boys also have been violated brutally at the hands of [ATW], [ATX], security and cleaning; it was more [ATX] [ATW]!! Worse, [ATV] is fully involved in these, taking the children to places where the children could be raped and then recording it with her camera! We know that school knows this too and that is why they want to their hands off this and clean the names by saying that hey are already deported! If this had happened to your children, would you leave it alone?? You who are a Catholic woman, would you hide all of these sins? Because knowing something and doing nothing or even worse, covering it, is a sin. They have ‘killed’ the future of our children, perhaps even creating other ‘beasts’ of them in the future! You allow this?? If they do leave ATU, they will start again elsewhere and will have more victim, just like [G]. [ATV] is sick! She has always told us that her sister was raped when she was 15 years in the hand of her driver! But what I know is that this was not her sister but she was the victim! My maternal instinct tells me that, and it was the same instinct that warned me about [B]. I believe in God Almighty! In the end they will have their punishment but please don’t punish our children more by protecting [ATU]. If they are really innocent then they don;t have to go so fast. Protecting [ATU] now is not to your best interest, it is only going to destroy you. And God sees everything, XXXX! Help us. May the virgin enlighten you. Kisses… 18     On 6 June 2014, the defendant filed a police report alleging that the third and fourth plaintiffs, among others, had participated in the sexual abuse of B. She alleged that the third plaintiff had sexually abused B five times prior to Christmas 2013. She also claimed that the fourth plaintiff had been sexually assaulting B since August 2013. In her words, “[a]ll incidents started with abuse by hitting the abdomen and the back part of the body”. 19     The defendant continued to repeat her allegations against the first, third and fourth plaintiffs even after they commenced the present action on 23 July 2014. In a Jakarta Post article of 2 September 2014 (“the Jakarta Post Article”), the defendant, together with the parents of two other students who were allegedly sexually assaulted, were reported to be jointly accusing ATU of “covering up systematic sexual abuse on its premises”. The relevant parts of the article read: The parents of the three kindergarten students who were allegedly sexually assaulted at the [ATU] have accused the school of covering up systematic child sexual abuse on its premises. “We are grateful that two of the teachers have been arrested as suspects, but there are so many facts that point toward the involvement of more staff. Have you seen [ATU’] security? It would have been impossible for our sons to be abused without anyone knowing about it,” DR, the mother of one of the victims, told The Jakarta Post on Monday. … DR added that ATU staffers had also filed a lawsuit against her in Singapore for defamation, “I don’t understand why they had to file the lawsuit in Singapore: Is it to stop me from testifying [in ATW and ATX’s trial]? I am asking this because if the lawsuit against me is successful, the Singaporean authorities can confiscate my passport and I won’t be able to travel to Indonesia to testify.” 20     An article by The Independent dated 7 November 2014 (“the Independent (UK) Article”) further reproduced allegations made by the defendant to Australia’s Fairfax Media. The salient parts of the article are reproduced below: A few weeks after the first claim, a second family came forward. “They were concerned their child had been physically, not sexually, abused,” the head of school Tim Carr says. The second mother later claimed her son was regularly raped during morning breaks over a seven month period of time. “They were anal rapes, plus physical abuse and hurting until he can’t scream any more, then raping him,” she told Australia’s Fairfax Media. She believed he had been raped at least 20 times, sometimes by six people in a row. She also said he was threatened with death if he told anyone. Aside from the cleaners, she alleged teachers were also involved in the abuse. British-Canadian school coordinator [ATW] and Indonesian teacher-assistant [ATX] had raped her son, as well as other children, she claimed. She believed the primary school principal [ATV], an American, was also involved in the abuse. Each of the allegations are vigorously denied by all three accused. … 21     At this juncture, I pause to take stock of the defendant’s allegations which may be classified as follows: (a)     ATU attempted to cover-up the purported child abuse that allegedly occurred on its premises. (b)     ATV actively participated in the sexual abuse of children by “taking [them] to places where [they] could be raped and then recording it with her camera”. (c)     ATW and ATX, who were all members of staff, sexually abused children under their care.",
        "The present action": "22     The defendant did not enter appearance in the present suit and on 9 September 2014, the plaintiffs obtained a judgment in default of appearance. Since the issue of liability has been settled, it leaves the determination of an appropriate quantum of damages that should be awarded. In this regard, the plaintiffs seek the following reliefs: (a)     ATU – S$50,000 in general damages, S$50,000 in aggravated damages and US$2,985,400 in special damages. (b)     ATV – S$300,000 in general damages, S$300,000 in aggravated damages and US$944,240.60 in special damages. (c)     ATW – S$300,000 in general damages, S$300,000 in aggravated damages and US$515,020.85 in special damages. (d)     ATX – S$300,000 in general damages, S$300,000 in aggravated damages and S$41,400 in special damages.",
        "General damages": "23     The first plaintiff accepts that, as a corporate claimant, it may not claim significant damages for distress or a loss of reputation separate from economic loss. Thus, it submits that a sum of S$50,000 would be appropriate. 24     According to the second to fourth plaintiffs, the defendant’s accusations struck at the heart of their integrity and character. On this basis, they contend that the quantum of damages ought to reflect the gravity of the libel. They rely primarily on the English Court of Appeal decision ofRantzen v Mirror Group Newspapers (1986) Ltd[1994] 1 QB 670 (“Rantzen”) in which £110,000 was awarded to the plaintiff, a successful television presenter, to compensate her for an allegation that she had helped to protect the identity of a purported child abuser. However, the plaintiffs submit that the award should be adjusted upwards becauseRantzenwas decided in 1993 and the allegations in that case had a lesser impact on the victim’s career and reputation.",
        "The applicable law": "69     I accept that, as a general proposition, the tort of defamation allows the recovery of economic loss as special damages if such loss is referable to the harm to the plaintiff’s reputation. To recover special damages, the plaintiff has to prove ‘actual temporal loss’; the loss of some ‘material’ or ‘temporal advantage’ which is ‘pecuniary’ or ‘capable of being estimated in money’ (Halsburyat para 240.186). InRatcliffe v Evans[1892] 2 QB 524 at 528, Bowen LJ explained that the term “special damage” is used to denote the particular damage which a claimant suffers beyond general damage: At times (both in the law of tort and of contract) it is employed to denote that damage arising out of the special circumstances of the case which, if properly pleaded, may be superadded to the general damage which the law implies in every breach of contract and every infringement of an absolute right: seeAshby v. White. In all such cases the law presumes thatsomedamage will flow in the ordinary course of things from the mere invasion of the plaintiff’s rights, and calls it general damage.Special damage in such a context means the particular damage (beyond the general damage), which results from the particular circumstances of the case, and of the plaintiff’s claim to be compensated, for which he ought to give warning in his pleadings in order that there may be no surprise at the trial. … [emphasis in italics in original, emphasis in bold italics added] 70     Actual pecuniary loss must be pleaded and proved. It is insufficient to plead the broad conventional allegation that by reason of the pleaded facts, damage has been suffered (see for exampleLonrho plc and others v Fayed and others (No 5)[1993] 1 WLR 1489 at 1494). The level of particularity required is illustrated by the observation in Harvey McGregor,McGregor on Damages(Sweet & Maxwell, 18th Ed, 2009) (“McGregor on Damages”) at para 39-034: … [M]ore specific losses, as of particular contracts, particular employments, particular hospitality may also be allowed if properly pleaded and proved. … 71     It must also be borne in mind that not all manner of pecuniary losses fall within the scope of special damage. InLow Tuck Kwong v Sukamto Sia[2014] 1 SLR 639, the Court of Appeal clarified that the scope of special damage in the context of defamation suits had to be loss referable to the damage to reputation. The Court stated at [98]: … The tort of defamation primarily protects a person’s reputation (seeGatley([44]supra) at para 1.1) and so grants relief for damage to a plaintiff’s reputation, the injury to his feelings and also provides a vindicatory effect. Where therefore the loss resulting from the publication of the words complained of is not referable to such protected interests, such loss is not claimable even if the publication was factually causative of it; it therefore does not includeallconsequential pecuniary loss. [emphasis in original]",
        "My decision": "The first plaintiff 45     Bearing in mind the discussion above at [28], the first plaintiff may not recover damages for injury to feelings. According to George Wei JC inGolden Seasonat [134], much will depend on whether the defamation has injured the business goodwill of the company such that the business reputation of the company can only be vindicated by a “really substantial award”. 46     In the present action, it is likely that the gravity and the extent of circulation of the defamatory statements had a substantial impact on the business reputation of the school. This was borne out in the evidence adduced by the first plaintiff. Therefore, I consider it fair and appropriate to award the first plaintiff S$30,000 in general damages. The second to fourth plaintiffs 47     Although the sexual abuse allegations were undoubtedly serious attacks on the plaintiffs’ character and integrity, such severity does not justify an award of S$300,000 which belongs to the scale of awards to public leaders in Singapore (see for exampleGoh Chok Tong v Chee Soon Juan[2005] 1 SLR(R) 573). Furthermore, I note that none of the plaintiffs in the present suit enjoy a reputation as formidable as that enjoyed by the plaintiffs inPeter LimorEi-Nets. 48     Counsel for the plaintiffs has referred me to the decision inRantzenwhere £110,000 was awarded by the jury for allegations of child sexual abuse. However, I am mindful of the caution issued by the Court of Appeal inTang Liang Hong v Lee Kuan Yew and another and other appeals[1997] 3 SLR(R) 576. L P Thean JA, delivering the judgment of the Court of Appeal, said: 124    … First, in England, defamation actions are tried by a judge with a jury, and assessment of damages is the exclusive preserve of the jury with the benefit of direction from the trial judge. Until the decision in this case, the trial judge in giving direction to the jury on the damages was precluded from referring, among other things, to scales of damages in personal injury cases or giving some guidance as to the appropriate brackets for the damages. Nor was counsel permitted to submit to the jury the appropriate award to be made. The absence of guidelines to the jury had sometimes led to awards being made which were grossly excessive and divorced from reality. Such wildly disproportionate awards had attracted serious and justified criticisms of the procedure involved resulting in such awards. Juries were likened, in the words of Sir Thomas Bingham MR, to “sheep loosed on an unfenced common, with no shepherd”. 125 The position in Singapore is different. We do not have a jury system, and like any other actions, defamation actions are heard by judges sitting alone and damages are normally assessed by the judges themselves (in other cases, such as personal injury cases damages are often assessed by [an] assistant registrar) - with the result that a “coherent framework of awards” has emerged from a body of cases developed over the years which enables the courts to pitch their awards on an informed and coherent basis. This is an advantage which the other jurisdictions, eg England, do not enjoy. … 49     I therefore find greater guidance in the awards given by our courts than the English courts. Taking into account the awards that have been given in those cases, the standing of the plaintiffs, the gravity of the libel, the extent of the publication and other relevant factors, I consider it fair and appropriate to award general damages of S$50,000 to the second and third plaintiffs and S$40,000 to the fourth plaintiff.",
        "Aggravated damages": "50     The plaintiffs’ claims in aggravated damages were premised on the following.First, the plaintiffs submitted that the defendant acted with malice because she either knew that the defamatory statements were false or was reckless as to their truth.Second, the plaintiffs contend that their injury has been aggravated by the way the defendant had conducted these proceedings. According to the plaintiffs, the defendant and her husband had actively sought to evade service, and at the same time, giving the impression that (a) they were in the dark about the action; and (b) the action was an attempt by ATU to pervert the course of justice of proceedings in Indonesia.Third, the plaintiffs argued that the defendant’s failure to retract her statements or apologise had similarly increased the plaintiffs’ injury.",
        "The first plaintiff": "72     I am of the view that the first plaintiff has failed to prove its claim for special damages. Although evidence was adduced to prove the shortfall in enrolment, the question is whether such shortfall was wholly caused by the defendant in publishing the libel. The scandal started in March 2014, approximately two months before the defendant claimed that B was sexually assaulted. It may very well be that the defendant had contributed to the damage caused to the school’s reputation. However, the first plaintiff had endeavoured to pin the entire blame on her and as a consequence, did not prove the extent of the defendant’s contribution. Therefore, the first plaintiff’s claim for special damages must fail.",
        "The second to fourth plaintiffs": "73     In my judgment, the second to fourth plaintiffs’ claim for special damages is misconceived. As was discussed above at [70], actual pecuniary loss must be pleaded and proven. The second to fourth plaintiffs have not done so. At the time of this hearing, they remained on the payroll of the first plaintiff and had not suffered any financial loss. That their teaching careers have been wrecked by the defamation is but a bare assertion that is unsupported by proof of the loss of any particular employments or contracts. Thus, without proof of actual loss, the general harm caused to their teaching careers should fall within the scope of general damages, not special damages.",
        "Special damages": "66     The first plaintiff claims US$2,985,400 in special damages for the shortfall in enrolment for certain grades at the Campus. The second to fourth plaintiffs claim US$944,240.60, US$515,020.85 and S$41,400 respectively for the wreckage of their careers. 67     The first plaintiff seeks to recover losses representing the shortfall in enrolment at ATU. B was enrolled in Kindergarten in academic year 2013/2014. In academic year 2014/2015, there was a marked shortfall in the actual intake for the grade directly below (iejunior to) Kindergarten, Kindergarten and the grade directly above (iesenior to) Kindergarten. The shortfall in enrolment translated to a loss of US$1,492,700 for that academic year. The first plaintiff expects this shortfall in enrolment to persist for the next few years. Thus, the first plaintiff seeks to have a multiplier of two years applied to the loss incurred in academic year 2014/2015. 68     The second to fourth plaintiffs seek special damages for their alleged loss of employability. Although they concede that they remain on the payroll of ATU, they claim that they would be unable to find alternative employment elsewhere.",
        "Conclusion": "74     For the reasons set out above, I make the following awards: (a)     ATU – S$30,000 in general damages; (b)     ATV – S$50,000 in general damages and S$20,000 in aggravated damages; (c)     ATW – S$50,000 in general damages and S$20,000 in aggravated damages; and (d)     ATX – S$40,000 in general damages and S$20,000 in aggravated damages."
    }
}