{
    "case_title": "Chai Yew Cian\n      v\n      Yeoh Yeow Yee and others",
    "ncitation": "[2015] SGHC 124",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       This claim arises out of a road traffic\n                    accident. The plaintiff was a pillion rider on a motor-cycle ridden by her\n                    husband, the first defendant. The motor-cycle was, unfortunately, involved\n                    in a collision with a bus driven by the second defendant, an employee of the\n                    third defendant. The plaintiff and the first defendant were both flung off the\n                    motor-cycle and sustained injuries. The plaintiff’s case is that both the\n                    first defendant and the second defendant were negligent and therefore they (and\n                    the third defendant vicariously) are liable to her. The first and second\n                    defendants blame each other. 2       Accordingly, the issue to be decided is whether\n                    the accident was caused solely by the first defendant or solely by the second\n                    defendant or whether both of them contributed to it. If both are found to have\n                    been negligent, then the subsidiary issue would be how liability between them is\n                    to be apportioned.",
        "The background": "3       The accident took place at about 8.45am on 12\n                    July 2012. It took place inside the traffic-light controlled cross-junction of\n                    Jurong Town Hall Road and Gateway Link. The third defendant’s bus No\n                    SBS3059M (“the Bus”) was then being driven by the second defendant\n                    along Jurong Town Hall Road in the direction of Ayer Rajah Expressway and was\n                    proceeding straight across the junction. The first defendant was riding\n                    motor-cycle No JNS1170 (“the Motor-cycle”) with his wife, the\n                    plaintiff, riding pillion. The Motor-cycle had come from the opposite direction\n                    along Jurong Town Hall Road and was making a right turn into Gateway Link in the\n                    direction of Boon Lay. 4       The collision occurred inside the junction while\n                    the Bus was proceeding across it and the Motor-cycle was making a right turn.\n                    The point of impact was within the junction and along the extreme left lane\n                    which was the bus lane being used by the Bus at the time. The traffic lights\n                    were green in favour of the Bus at the time the Bus entered the\n                junction. 5       Entering the junction from the direction of the\n                    second defendant driving the Bus, there were five lanes on Jurong Town Hall Road\n                    towards Ayer Rajah Expressway. The right-most lane was exclusively for vehicles\n                    turning right. The remaining four lanes were for vehicles proceeding straight\n                    only. About 30m or so before the junction, the left-most lane led to a slip road\n                    for vehicles turning left into Gateway Link. 6       In the opposite direction and heading towards\n                    the Pan Island Expressway, which was the direction the first defendant had been\n                    riding in prior to the turn, there were also five lanes. The right-most lane was\n                    exclusively for vehicles turning right. There was no turning pocket along the\n                    right-most lane. The remaining four lanes were for vehicles proceeding straight\n                    only. About 30m or so before the junction, the left-most lane led to a slip road\n                    for vehicles turning left into Gateway Link.",
        "The parties’ accounts": "",
        "The plaintiff": "7       The plaintiff and the first defendant are\n                    Malaysians living in Johor Bahru who travel to work in Singapore every day. At\n                    the material time, it was the couple’s usual routine to enter Singapore on\n                    the Motor-cycle and for the first defendant to drop the plaintiff off at her\n                    place of work in Jurong East, before proceeding to his own office in Kallang\n                    Way. 8       The route taken by the first defendant on 12\n                    July 2012 was the usual route taken in the mornings when he took the plaintiff\n                    to work. The plaintiff rode pillion and wore a crash helmet. In her affidavit,\n                    she said that they were travelling along Jurong Town Hall Road when they reached\n                    the junction with Gateway Link. The first defendant stopped his Motor-cycle to\n                    check for the traffic lights and oncoming vehicles. After ensuring that the\n                    lights were green in his favour and that there were no oncoming vehicles, the\n                    first defendant turned right into Gateway Link with his signal on. The Bus,\n                    travelling from the opposite direction, collided into the Motor-cycle when the\n                    first defendant had almost completed making his right turn. The plaintiff and\n                    the first defendant were flung off the Motor-cycle and the plaintiff landed on\n                    the road and lost consciousness. 9       In court the plaintiff admitted that she had no\n                    memory of the accident and all that she had said in paragraphs 4, 5 and 6 of her\n                    affidavit, being the facts I have summarised above, had been told to her by the\n                    first defendant. Accordingly, the plaintiff’s evidence about the first\n                    defendant having stopped at the junction and ensuring that there were no\n                    oncoming vehicles before he made his right-turn cannot serve as corroboration of\n                    the first defendant’s similar account. 10     From the plaintiff’s point of view, her\n                    lack of memory is not fatal or even very significant. She was an innocent party\n                    injured by events caused by the first and/or the second defendant. In this\n                    situation, the law is that the proper inference to be drawn is that the\n                    collision was caused either by the negligence of both the first and second\n                    defendants or by the negligence of the first defendant or of the second\n                    defendant and it is for the defendants to rebut the inference of negligence on\n                    their part and show that they were blameless (seeTan Eng Bok\n                        v Kim Meng Kok[1988] 1 SLR(R) 554).",
        "The defendants": "11     The first defendant in his affidavit gave an\n                    account similar to that given by the plaintiff in her affidavit. He said that at\n                    about 8.45am that day he was travelling along Jurong Town Hall Road in the\n                    extreme right lane. When he reached the junction of Jurong Town Hall Road and\n                    Gateway Link, he stopped to check and to ensure that the traffic lights were\n                    green in his favour. As they were green and as the traffic opposite to him along\n                    Jurong Town Hall Road was clear, he started to make the right turn slowly with\n                    his indicator turned on. Just as he was about to complete the turn into Gateway\n                    Link, the second defendant, driving the Bus which was travelling from the\n                    opposite direction along Jurong Town Hall Road, collided into the rear of the\n                    Motor-cycle. 12     In court, the first defendant said that at the\n                    time of impact he was travelling at 40km/h and that he had reached this speed\n                    from a stopped position. He also agreed that the distance between the point\n                    where he had stopped and the point of impact was quite short. Further, he\n                    testified that whilst the plaintiff started work at 9.30am, he was supposed to\n                    start work at 9am every day. He indicated that it took between 35 and 45 minutes\n                    to travel from the plaintiff’s work place to his own and agreed that,\n                    therefore, on the morning in question he was late. He denied that he was in a\n                    hurry and had not stopped at the junction because he was late for work. His\n                    position was that he was late for work every day and that his employer did not\n                    mind. 13     The first defendant was charged under s\n                        65(b) of the Road Traffic Act (Cap 276, 2004\n                    Rev Ed) for inconsiderate driving. He stated that purely for the purpose of\n                    resolving the matter quickly, he compounded the offence by paying a fine of $200\n                    and accepting nine demerit points. 14     The second defendant stated that at the\n                    material time he was driving the Bus, which was plying the SBS service route 78,\n                    along the bus lane of Jurong Town Hall Road from Jurong East Interchange towards\n                    Gateway Link. In court, the second defendant said that he had been driving this\n                    route for about a year. 15     At the material time the weather was clear,\n                    the road surface was dry and the traffic volume was moderate. The second\n                    defendant intended to cross the junction and proceed along Jurong Town Hall\n                    Road. As he approached the junction, he noticed that the traffic lights were\n                    showing green in his favour. As such, he continued to drive the Bus forward at a\n                    speed of about 20 to 25 km/h. Suddenly, the Motor-cycle which was coming from\n                    the opposite direction made a right turn into Gateway Link. As a result, the Bus\n                    hit the rear portion of the Motor-cycle and both the first defendant and the\n                    plaintiff fell onto the road. There were about ten passengers in the Bus at that\n                    time. None of them was injured as a result of the accident. 16     Contrary to the impression given by his\n                    affidavit, the second defendant admitted in court that he had not seen the\n                    Motor-cycle prior to the accident. The first time he saw it was after the Bus\n                    hit the Motor-cycle and he stopped.",
        "Analysis": "17     The Bus was equipped with a CCTV system which\n                    recorded events both inside and outside the Bus. During the trial, relevant\n                    video footage from various cameras was shown and I was able to view the second\n                    defendant at the wheel of the Bus from shortly before it entered the bus-stop\n                    before the junction until the Bus stopped almost immediately after hitting the\n                    Motor-cycle. I was also able to see the left-hand side of the road as the Bus\n                    moved along and the view directly in front of the Bus. However, there was no\n                    footage showing the right-hand side of the Bus and therefore the recording did\n                    not capture the movement of the Motor-cycle across the junction or the collision\n                    itself although the audio portion of the recording reproduced the sound of the\n                    impact. I have found the video footage very helpful. 18     The first defendant submitted that there was\n                    something suspect about the fact that the CCTV recording did not reflect the\n                    most crucial part of the incident,ie, the\n                    Motor-cycle travelling across the junction. He says that this view would have\n                    reflected the manner in which he rode, the estimated speed he was travelling at\n                    and whether the second defendant could have avoided the accident. The first\n                    defendant wants me to infer that a part of the CCTV recording has been\n                    deliberately suppressed. 19     The first defendant has put forward nothing to\n                    substantiate his suspicion. There is no evidence that the Bus had another camera\n                    in a position from which it could have captured the first defendant travelling\n                    across the junction. The third defendant’s position was that it had\n                    disclosed footage from all cameras mounted in and on the Bus and that it had not\n                    suppressed any footage. If counsel wishes to make a submission of suppression of\n                    evidence, he has to have more basis to do so than an insinuation that such\n                    evidence would have been adverse to the other party. I have no reason to doubt\n                    that the full video footage has been disclosed. 20     It is indisputable in this case that the Bus\n                    that was proceeding straight across the junction had the right of way since the\n                    traffic light was showing green to oncoming traffic. The first defendant who\n                    wanted to turn right across the junction therefore had to give way to oncoming\n                    traffic and make sure that the road was clear before he made the turn.Prima facie, in an accident of this kind, the turning\n                    vehicle is more likely to be the primary cause of the accident. This does not\n                    mean, however, that the vehicle that is proceeding straight can go on its merry\n                    way without regard to the possibility of turning traffic. 21     It is well established that the law requires a\n                    motorist to act on the basis that there may be negligence and incompetence on\n                    the part of other road users and to make allowance for them, but without having\n                    to contemplate possibilities that are remote. SeeSBS Transit\n                        Ltd v Stafford Rosemary Anne Jane[2007] 2 SLR(R) 211 at [33]\n                        (“Stafford”). As Lee Seiu Kin J\n                    observed inStafford, the crux of the issue is\n                    what a reasonable person would apprehend in a particular set of circumstances.\n                    Whilst the facts of that case are somewhat different from the one before me, in\n                    that there a turning bus collided with a pedestrian who was moving straight, the\n                    court made useful observations regarding how motorists should act when\n                    approaching intersections. At [37] the court stated: … An intersection is that part of the road where a vehicle may cut\n                        across the path of other vehicles. When a motorist approaching an\n                        intersection sees a vehicle poised to make a turn across his path, the first\n                        thing that he must prepare for is the possibility that the other driver will\n                        make the turn before he clears the intersection. He must watch out for any\n                        indication that the driver might do so. Above all, he must drive his vehicle\n                        at a speed that enables him to react appropriately should this occur. The\n                        last thing that he should assume is that the vehicle will definitely wait\n                        for him to pass merely because he has the right of way according to road\n                        traffic rules. One must bear in mind that these rules are enacted for\n                        reasons of safety and to facilitate the smooth flow of traffic. Road users\n                        are entitled to assume that such rules will generally be followed, and\n                        indeed any person who fails to comply with any of these rules and breaches\n                        the law as a result may find himself charged with an offence and punished\n                        accordingly. But this assumption must be tempered with the realisation that,\n                        as in any activity, human failings and weaknesses always exist.\n                        … 22     Accordingly, while the first defendant who was\n                    going to make a turn across the path of oncoming traffic had the duty give way\n                    to such traffic, the second defendant was required to keep a good lookout and\n                    drive in such fashion when crossing the junction that he would be able to avoid\n                    or mitigate a dangerous situation that might be created by other road\n                    users. 23     The first defendant, obviously recognising\n                    that he did not have the right of way, contended that he had taken all\n                    reasonable care because he had stopped in the junction and had then made sure\n                    that the oncoming traffic had cleared the junction before he started the\n                    crossing. His story was that he was stationary for about 15 seconds and moved\n                    off slowly and gradually after the oncoming vehicles had cleared the junction.\n                    He was not speeding. He was not in a rush because he was always late for work\n                    and his employer did not mind. When he first saw the Bus it was at the bus-stop\n                    and later, after some vehicles had passed, he noticed that the Bus had left the\n                    bus-stop. 24     The first defendant’s story is not\n                    believable. According to him, he was able to accelerate from 0 km/h to 40 km/h\n                    in a very short space of time and over a very short distance, being the distance\n                    between the point at which he stopped for oncoming traffic and the point of\n                    impact. The distance could not have been very much more than 15m because he\n                    crossed four traffic lanes before hitting the Bus and each lane was around 3 to\n                    3.5m wide. The first defendant was not riding a powerful vehicle – the\n                    Motor-cycle had an engine capacity of only 125cc – and bearing in mind\n                    that it was carrying two persons it is unlikely that he could have accelerated\n                    to a speed of 40 km/h from a stationary position in that distance. 25     The first defendant was late for work. He\n                    admitted that his working hours started at 9am. Since it would take him at least\n                    35 minutes to get to his work place from the junction, he must have known at\n                    that point (8.45am) that he would be at least 20 minutes late for work. The\n                    first defendant said that his employer did not mind him being late because he\n                    lived in Johor Bahru but that assertion is not convincing. If the first\n                    defendant’s employer was amenable to the first defendant coming in later\n                    on a regular basis, he would surely have changed the first defendant’s\n                    working hours and would not have required him to be there by 9am every day. To\n                    me it seems more probable than not that the first defendant was in a rush that\n                    morning. That the first defendant had not called his employer as a witness does\n                    not assist his case. 26     The first defendant said that he started\n                    making the right turn only when there was no traffic coming from the other side\n                    and the only approaching vehicles that he could see were very far away. He also\n                    said that at this point the Bus was at the bus-stop. It should be noted that the\n                    bus-stop was about 50m away from the junction. The first defendant also said\n                    that when he started moving to make the right turn, the Bus also started\n                    moving. 27     The first defendant’s evidence is\n                    contradicted by the video footage. The footage shows that just as the Bus was\n                    about to leave the bus-stop, there were at least three vehicles approaching the\n                    junction to the right of the Bus and in front of it. One of these vehicles was a\n                    fairly large van or truck. These would have been the oncoming vehicles that the\n                    first defendant referred to and if the first defendant was indeed waiting at the\n                    junction, they would have blocked his view of the Bus starting to move off. In\n                    fact, the first defendant himself would not have been starting to move then\n                    because of the presence of these vehicles approaching the junction. At the time\n                    when the Bus started to leave the bus-stop, the path for the first defendant to\n                    turn right was not clear, contrary to his assertion. 28     Secondly, based on the video footage, from the\n                    time the Bus exited the bus-stop, it was accelerating slowly and reached a speed\n                    of about 23 km/h just before it reached the junction. Considering the distance\n                    between the bus-stop and the junction (50m) and the speed at which the second\n                    defendant was going, it would have been impossible for the Bus to collide with\n                    the Motor-cycle if they had both left their stationary positions at the same\n                    time, as the first defendant insisted. Even if the first defendant travelled\n                    more than 15m because he was travelling in a curve, considering that he had got\n                    up to a speed of 40 km/h by the time of the accident, if indeed he had left the\n                    stationary spot in the junction when he said he did, he would have been clear of\n                    the junction when the Bus arrived there. 29     I conclude that the first defendant was not at\n                    the junction when the Bus was at the bus-stop. Instead, as the second and third\n                    defendants submit, the Bus was already approaching the junction when the first\n                    defendant made the right turn without stopping first and without keeping a good\n                    lookout. The objective evidence supports the proposition put forward by the\n                    second and third defendants that the first defendant assumed that there were no\n                    other vehicles coming after the vehicles along lanes one to four (which passed\n                    the Bus at the station) had cleared the junction. He failed to notice the Bus\n                    approaching in the extreme left lane. The Bus was a big bus, being a\n                    double-decker, and if the first defendant had been stationary and keeping a\n                    proper lookout, he would have seen it approaching. 30     I am satisfied that the first defendant was\n                    negligent. Because he was in a hurry to get to work, he did not stop at the\n                    junction but, having seen the other vehicles cross it, he assumed all was clear\n                    and made the right turn without noticing the Bus. 31     This conclusion does not mean that the second\n                    defendant was not negligent. The first defendant says that he should have kept a\n                    proper lookout as well and points out that the Bus was equipped with a very long\n                    and wide windscreen and there was also a side window on the driver’s\n                    right-hand side. Accordingly, if the second defendant had just turned his head\n                    to the right when approaching the junction, he would have seen the Motor-cycle\n                    and been able to either slow down or stop to avoid the accident. There is some\n                    force in this argument: the video footage shows clearly that from the time he\n                    left the bus-stop, the second defendant looked either straight ahead or to his\n                    left; he does not appear to have glanced to the right at all. 32     The second defendant says that he was not\n                    negligent because: (a)     he was travelling at a reasonable\n                        speed in the circumstances; (b)     the speed limit along Jurong Town Hall Road is 70 km/h\n                        but the speed of the Bus was not more than 23 km/h; (c)     there was no legal duty on him to slow\n                        down automatically when he approached the junction; and (d)     the second defendant’s view of\n                        the junction was obstructed by vehicles on the right-hand\n                    side. 33     I accept that the second defendant was\n                    travelling suitably slowly and that that he did not need to slow down\n                    automatically as he approached the junction. I do not accept, however, that\n                    there was any evidence that as he approached the junction his view was\n                    obstructed. The vehicles that were travelling along the road in front of the Bus\n                    were a distance in front of him and would have crossed the junction before he\n                    reached it. There is no footage showing that there were vehicles on his\n                    right-hand side just as the second defendant reached the junction or when he\n                    entered it. The fact that the left-hand front portion of the Bus hit the rear of\n                    the Motor-cycle shows clearly that the Motor-cycle had almost completed the turn\n                    when the collision took place. In the circumstances, I think it more likely than\n                    not that if the second defendant had been looking to his right he would have\n                    seen the Motor-cycle as it began its turn and would have been able to warn it or\n                    brake or try and take evasive action. It is clear from the video footage that\n                    the second defendant was completely shocked by the accident and only became\n                    aware of the Motor-cycle’s presence after impact. 34     The second defendant had the right of way but\n                    he also had a duty to take care so as to avoid or mitigate the consequences of\n                    the mistakes of other road users. An experienced driver, he should have known of\n                    the possibility that another motorist might try to cross the junction too early.\n                    He should have kept a better lookout so that he would have been prepared to deal\n                    with such a situation. I find that the second defendant was negligent as\n                    well. 35     Having found both the first and second\n                    defendants to have contributed to the accident by their negligence, the question\n                    that remains is how, between themselves, liability should be apportioned. In my\n                    judgment, the first defendant was definitely more to blame than the second\n                    defendant because he crossed the junction when he should not have without regard\n                    to the presence of oncoming traffic. If the second defendant had seen the\n                    Motor-cycle, he may have been able to avoid the accident but that is not\n                    certain. His responsibility must be less. I consider that as between the\n                    defendants, liability should be apportioned 85% to the first defendant and 15%\n                    to the second defendant and consequently to the third defendant as\n                well.",
        "Conclusion": "36     For the reasons given above, there will be\n                    judgment for the plaintiff against all the defendants for damages to be\n                    assessed. As between the defendants themselves, their liability is fixed at\n                    85:15 in favour of the second and third defendants. The parties have given me\n                    their submissions on costs. I fix the costs payable to the plaintiff up to\n                    the end of trial at $17,000 plus reasonable disbursements. The sum of $17,000\n                    takes into account the fact that there were three defendants, that the trial\n                    took one full day and that parties put in written closing submissions.Vis-à-visthe plaintiff, the defendants shall be jointly\n                    and severally liable to pay, but between themselves liability for costs shall be\n                    apportioned in the same ratio as damages."
    }
}