{
    "case_title": "Public Prosecutor vLee Ah Choy",
    "ncitation": "[2016] SGHC 154",
    "coram": "Hoo Sheau Peng JC",
    "sections": {
        "Introduction": "1 The accused, Lee Ah Choy, pleaded guilty and was convicted of the following three charges: That you,LEE AH CHOY, 1ST CHARGE on the 18th day of October 2002, at about 6.40am, on the 4th floor of [address redacted], did commit rape by having sexual intercourse with [the victim] (femaleIthen 12 years of age) ([D.O.B. redacted]), then a woman under 14 years of age, without her consent, and you have thereby committed an offence punishable under section 376(2) of the Penal Code (Cap 224, 1985 Rev Ed). 2ND CHARGE on the 18th day of October 2002, at about 6.40am, on the 4th floor of [address redacted], did use criminal force to [the victim] (female / then 12 years of age) ([D.O.B. redacted]), intending to outrage her modesty, to wit, by using your finger to penetrate the vagina of [the victim], and you have thereby committed an offence under section 354 of the Penal Code (Cap 224, 1985 Rev Ed), and in order to commit the said offence, you voluntarily caused wrongful restraint to [the victim], then a person under 14 years of age, to wit, by using your arm and leg to pin her down on a piece of cardboard on the ground, and you shall be punished under section 354A(2)(b) of the Penal Code (Cap 224, 1985 Rev Ed). 3RD CHARGE on the 18th day of October 2002, at about 6.40am, on the 4th floor of [address redacted], did commit criminal intimidation, to wit, by holding a paper cutter and pointing it at [the victim] (female / then 12 years of age) while threatening to cut her if she did not stop crying, with intent to cause alarm to [the victim], and you have thereby committed an offence punishable under section 506 (1st limb) of the Penal Code (Cap 224,1985 Rev Ed). 2 Pursuant to s 148 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”), the Prosecution indicated that parties consent to have the following charge be taken into consideration for the purpose of sentencing (“the abduction charge”): 4TH CHARGE on the 18th day of October 2002, at about 6.40am, at the void deck of [address redacted], did abduct [the victim] (female / then 12 years of age), to wit, by putting your arm around her shoulders and pulling her away, and by such force, compelling her to go from the said location to the 4th floor of [address redacted], in order that [the victim] may be forced to have illicit intercourse with you, and you have thereby committed an offence punishable under section 366 of the Penal Code (Cap 224, 1985 Rev Ed). The accused admitted to committing the offence, and confirmed his consent to have it be taken into consideration for the purpose of sentencing. 3 I sentenced the accused as follows: (a) 16 years of imprisonment and 12 strokes of the cane for the first charge (“the rape charge”).(b) Four years of imprisonment and six strokes of the cane for the second charge (“the aggravated outrage of modesty charge”).(c) Six months of imprisonment for the third charge (“the criminal intimidation charge”). I ordered the imprisonment term for the criminal intimidation charge to run consecutively with that for the rape charge. The imprisonment term for the aggravated outrage of modesty charge is to run concurrently with that for the rape charge. The total sentence imposed is 16½ years of imprisonment (backdated to 23 January 2015) and 18 strokes of the cane. 4 The accused has filed an appeal against sentence on the ground that “[t]he sentence is excessive”. I now provide my reasons.",
        "The statement of facts": "5 Upon the accused pleading guilty to the three charges, the Prosecution tendered a statement of facts (“the SOF”), the contents of which I substantially reproduce below.",
        "The parties": "6 The accused, a Malaysian citizen, is 37 years old. In 2002, the accused was 23 years old. He was working as a carpenter in Singapore. 7 A Malaysian citizen, the victim is now 26 years old, and working in Singapore. In 2002, she was a 12-year-old secondary one student, living in Singapore on a student pass.",
        "Arrest of the accused": "8 On the morning of 18 October 2002, the victim’s father called the police to lodge a report about the case. Pursuant to the report, the police conducted investigations. Swabs were taken of the scene and of the victim’s genital area, and the DNA analysis returned positive for semen belonging to an unidentified male subject. However, the accused’s identity was not established. 9 More than 12 years later, on 18 December 2014, the accused was arrested by the police for an unrelated matter. Following his arrest, a blood sample was collected from the accused. His DNA profile was found to match that of the unidentified male subject. This led to the arrest of the accused for an offence under s 376(2) of the Penal Code (Cap 224, 1985 Rev Ed) (“the Penal Code”).",
        "Background facts": "10 In 2002, the accused worked and lived in a factory, which was located about 1.3 kilometres away from the victim’s home. 11 The victim lived in a Housing and Development Board (“HDB”) flat with her parents and her two brothers. She attended a nearby secondary school. Every day, she would leave home at about 6.40am to go to school. In 2002, the neighbourhood was relatively new. Many of the HDB flats were yet to be occupied or were undergoing renovation works. 12 On five separate occasions before the offences, the victim saw the accused loitering at the void deck of her HDB block in the morning when she left for school. On the first four occasions, the accused would smile at her or greet her. On each occasion, the victim ignored him. 13 On the fifth occasion, on the morning of 17 October 2002, the victim saw the accused again at the void deck on her way to school. As she walked past him, he suddenly blocked her way and asked if he could take her out. The victim continued walking and firmly rebuffed his advances. The accused walked alongside the victim but did not say anything else. On reaching the bus stop, the victim saw that the bus had arrived and quickly boarded the bus. The accused did not follow her. 14 On the morning of 18 October 2002, the victim left home for school as usual at about 6.40am. She was dressed in her school uniform consisting of a blouse and a skirt. Beneath her school uniform, she wore a T-shirt, a pair of shorts, a training bra and a pair of panties. At the void deck of her block, she saw the accused again. The accused smiled at the victim. The victim then decided to take a different route to the bus stop. As she was walking, the accused blocked her path. He told the victim not to go to school. The victim declined and quickly walked off. 15 The accused followed the victim and told her to help him hand over some money to his “god-sister” who was living in a nearby block. The victim declined yet again. This time, the accused grabbed hold of her left arm, demanding that she follow him. The victim managed to swing her arm free but the accused put his arm around the victim’s shoulder and pulled her away towards a nearby block (“the nearby HDB block”). The accused told the victim that she would be allowed to go to school after she had helped to hand the money over to his “god-sister”. 16 Upon reaching the nearby HDB block, the accused pulled the victim into the lift. He pressed the button for the fourth floor and removed his arm from the victim’s shoulder. He held onto the victim’s elbow firmly. When the lift door opened on the fourth floor, the accused pulled the victim out and walked along a corridor towards a flight of stairs. At the end of the corridor lay a piece of cardboard on the floor with some magazines on top.",
        "Facts pertaining to the criminal intimidation charge": "17 The accused told the victim to sit down on a flight of stairs between the fourth and fifth floors of the block but she refused. The accused pressed onto her shoulders, forcing her to be seated. The accused proceeded to sit on the stairs beside the victim. The victim asked the accused why they were sitting at the stairs but he did not answer her. Then, the victim started crying. At this point, the accused brandished an orange-coloured paper-cutter. He pointed it at the victim while threatening to cut her if she did not stop crying. 18 By holding the paper-cutter and pointing it at the victim while threatening to cut her if she did not stop crying, with intent to cause alarm to her, the accused committed the offence of criminal intimidation under s 506 (first limb) of the Penal Code. 19 The victim did not stop crying as she was frightened. The accused placed the paper-cutter on the floor and looked at the victim. The victim seized this opportunity and grabbed the paper-cutter, and pointed it at the accused. He looked at her and calmly told her that if she cut him once, he would cut her thrice in return. The accused then reached out and grabbed the paper-cutter back from the victim before placing it on the floor again.",
        "Facts pertaining to the aggravated outrage of modesty charge": "20 The accused brought the victim to sit on the piece of cardboard. The victim stood up and tried to run away but the accused pulled her haversack and dragged her to the cardboard. In the process, the victim’s shoes came off. The accused pressed onto the victim’s shoulders and forced her to sit on the cardboard. The victim sat down, cross-legged, with her haversack still on her back. The accused sat down in front of the victim and uncrossed her legs. He sat between her legs and reached out under her skirt to pull her shorts. The victim kicked out and thrashed about wildly but the accused used his legs to pin her left leg down. The accused managed to pull down the victim’s shorts and panties and left these dangling by her right leg. 21 The victim struggled and tried to fight the accused but he pinned her down in a seated position on the cardboard with his right arm over her shoulder and his leg over hers. The victim felt the accused’s hand go under her skirt, touching her vagina. The accused then used his finger to penetrate the victim’s vagina. The victim felt pain instantly and started crying. She also felt the accused’s finger moving within her vagina. She tugged at his arm in a bid to get the accused to stop but he told her that if she pulled his finger out, she will suffer a miscarriage in the future. Out of fear, the victim stopped tugging at the accused. The accused started kissing the victim on her cheek and lips while his finger was still in the victim’s vagina. 22 By using his arm and leg to pin the victim down on the cardboard and thereafter using his finger to penetrate the victim’s vagina, the accused committed the offence of aggravated outrage of modesty under s 354A(2)(b) of the Penal Code.",
        "Facts pertaining to the rape charge": "23 After kissing the victim, the accused started to unbutton the victim’s school blouse and managed to do so despite her struggles. The victim then held her blouse together against her body with her hands. The accused then stood up. He told the victim that he needed to urinate. The accused turned his back on the victim and walked a couple of steps away from the cardboard and urinated on the floor. 24 Meanwhile, the victim stood up and tried to pick up her shorts and panties. She did not dare to try to run away as the accused constantly turned to look at her. After the accused finished urinating, he walked quickly towards the victim, with his penis exposed. The victim stood against a wall with her legs closed as tightly as she could. She felt the accused push his penis onto her vagina. 25 The accused used his hands to press onto the victim’s shoulders, forcing her to be seated on the cardboard. He then knelt down in front of her, spread the victim’s legs and placed them on his thighs. The victim tried to push the accused away but was unable to do so. The accused then used his penis to penetrate the victim’s vagina, causing much pain to the victim. The accused had sexual intercourse with the victim for a short while before ejaculating into her vagina. 26 After having sexual intercourse with the victim, the accused got up and pulled up his underwear and pants. The victim quickly got dressed and walked to the lift. The accused followed her into the lift. When the lift door opened on the ground floor, the victim hurried out towards her block, with the accused following a distance behind her. The victim lost sight of the accused when she took a lift up to her floor. 27 Upon reaching home, the victim called her mother and told her what had happened. The victim’s father was subsequently informed and he called for the police. By having sexual intercourse with the victim without her consent, the accused committed the offence of rape under s 376(2) of the Penal Code.",
        "Conviction": "28 The accused admitted to the facts stated in the SOF without qualifications. Accordingly, I convicted the accused of the criminal intimation charge, the aggravated outrage of modesty charge and the rape charge.",
        "Sentencing": "29 With that, I turn to the relevant punishment provisions. For the rape charge, s 376(2)ofthe Penal Code provides that an offender who rapes a woman under 14 years of age without her consent shall be punished with imprisonment for a term of not less than eight years and not more than 20 years and with caning of not less than 12 strokes. As for the aggravated outrage of modesty charge, s 354A(2) of the Penal Code provides for punishment in the form of imprisonment for a term of not less than three years and not more than 10 years and with caning. Turning to the criminal intimidation charge, the first limb of s 506 of the Penal Code states that an offender shall be punished with imprisonment for a term which may extend to two years, or with fine, or with both. For completeness, under s 366 of the Penal Code, the abduction charge is punishable with imprisonment for a term which may extend to 10 years, and the offender shall also be liable to fine or to caning.",
        "The Prosecution’s submissions": "30 I move on to the Prosecution’s submissions. The Prosecution pressed for a severe sentence to be imposed on the accused, taking into account the following aggravating factors: (a) the young age of the victim; (b) the degree of planning and premeditation in the commission of the offences; (c) the use of a weapon; (d) the exposure of the victim to possible unwanted pregnancy; and (e) the physical and psychological harm caused to the victim. In this regard, a victim impact statement was adduced and I shall turn to this later. 31 In relation to the rape charge, the Prosecution highlighted the case ofPublic Prosecutor v NF[2006] 4 SLR(R) 849 (“NF”). In this case, the High Court at [19] – [38] adopted the framework setting out four categories of rape found in the English Court of Appeal decision ofR v William ChristopherMillberry[2003] 2 Cr App R (S) 31 (“Millberry”).  The High Court also laid down the benchmark sentences in Singapore for each of the four categories. In particular, a “Category 2” rape involves the exploitation of particularly vulnerable victims or the presence of any of the other aggravating factors listed inMillberry(such as where the offender abducted the victim and held her captive). The starting point for a sentence for a “Category 2” rape is 15 years’ imprisonment and 12 strokes of the cane. The Prosecution submitted that in abducting the then 12-year-old victim and thereafter raping her, the rape committed by the accused fell squarely within a “Category 2” rape situation. The Prosecution submitted that 15 years’ imprisonment and 12 strokes of the cane should be imposed. 32 As for the aggravated outrage of modesty charge, the Prosecution relied on two precedent cases. First, inPublic Prosecutor v HuangShiyou[2010] 1 SLR 417 (“HuangShiyou”), a 22-year-old accused committed a series of sexual offences against two young victims (aged 14 and nine years old) with a penknife. He was sentenced to five years of imprisonment and eight strokes of the cane for touching and sucking the breasts and touching the vagina of the 14-year-old victim (pursuant to a charge under s 354A(1) of the Penal Code (Cap 224, 2008 Rev Ed)), and six years of imprisonment and eight strokes of the cane for touching the vulva of the nine-year-old victim (pursuant to a charge under s 354A(2)(b) of the Penal Code (Cap 224, 2008 Rev Ed)). Next, inPublic Prosecutor vThangavelu Tamilsevam(“ThangaveluTamilsevam”) [2010] SGDC 479, a 23-year-old accused pleaded guilty to two charges of aggravated outrage of modesty under s 354A(2)(b) and s 354(2)(a) of the Penal Code (Cap 224, 2008 Rev Ed) respectively, and one charge of outrage of modesty under s 354(1) of the Penal Code (Cap 224, 2008 Rev Ed) against three victims (aged 10, 15 and 17 years old), with two other charges taken into consideration for the purpose of sentencing. In respect of the s 354A(2)(b) charge, the particulars were that the accused waited for a lift with the 10-year-old victim, and then entered the lift with her. In the lift, he used his hands to cover her mouth, shoved her against the wall of the lift, and hugged and kissed her. For this, the accused was sentenced to four years’ imprisonment and six strokes of the cane. 33 Turning to the criminal intimidation charge, the Prosecution cited the cases ofTan KayBeng v Public Prosecutor[2006] 4 SLR(R) 10 (“Tan KayBeng”) (where a sentence of three months’ imprisonment was imposed on an accused who confronted the victim to repay a debt, together with a friend who was wielding a bread knife at the victim’s neck), andPublic Prosecutor v MohammedLiton Mohammed Syeed Mallik[2008] 1 SLR(R) 601(“MohammedLiton”) (where a sentence of two months’ imprisonment was imposed on an accused who twice pointed a knife at the victim threatening to cut her, once before the first incident of rape and once after the first incident of sodomy). 34 While the Prosecution provided the ranges for the aggravated outrage of modesty charge and the criminal intimidation charge as set out in the precedent cases, the Prosecution did not submit on the individual sentences sought. By virtue of s 307(1) of the CPC, at least two of the sentences imposed in this case must be ordered to run consecutively. The Prosecution contended that the sentence for the rape charge and that for the aggravated outrage of modesty charge should be made to run consecutively, so as to arrive at a global sentence of 16 to 18 years of imprisonment and 18 strokes of the cane. 35 Given that the aggravated outrage of modesty charge carried a minimum term of imprisonment of three years, and that the precedent cases cited by the Prosecution provided for a range of four to six years of imprisonment, it appeared to me that by running a sentence of three to six years’ imprisonment (in respect of the aggravated outrage of modesty charge) consecutively with a sentence of 15 years’ imprisonment (in respect of the rape charge), the total sentence would range from 18 to 21 years, and not 16 to 18 years. Therefore, I pause here to observe that there seemed to be some inconsistency between the Prosecution’s submission on running the sentences for the rape charge and the aggravated outrage of modesty charge consecutively, on the one hand, and the total sentence of 16 to 18 years of imprisonment sought, on the other. 36 In any event, in support of their position of a total sentence of 16 to 18 years of imprisonment, the Prosecution urged the court to take into account the sentencing principles of general deterrence and retribution. Specifically, the Prosecution highlighted that the present grave offences were committed on a young victim, and general deterrence warranted a stiff sentence that “would send a strong signal” that “such offences against young victims will be dealt with in the harshest manner”.",
        "The mitigation plea": "37 In mitigation, Defence Counsel set out four main factors for consideration. First, save for a conviction for drug consumption in Malaysia about 16 years ago, he has a clean record. 38 Second, the accused had elected to plead guilty. He had also been cooperative and candid with the police. He was deeply remorseful, and was “determined not to put the victim and her family through another round of trauma” of giving evidence at a trial. It was the accused’s sincere plea that the victim would find closure to the ordeal she suffered more than a decade ago. 39 Third, Defence Counsel submitted that the offences were committed when the accused was only 23 years old and that there wasnopremeditation involved. The accused was young, immature, single and working alone away from home. When he saw the victim on one of his morning jogs, he “took an instant liking for her”, and decided to “befriend” her and “have [a] sexual relationship with her”. The accused’s offences were described by Defence Counsel as “nothing more than a senseless and rash act” committed in “a moment of folly” when “his hormones got the better of him” and he acted on his “ill-fated attraction”. 40 Fourth, since then, the accused has been married for about 11 years. He has a 10-year-old son. The accused did not imagine that the acts he committed 13 years ago would return to haunt him, and to “cause indelible and grave harm to his love[d] ones”. If he had been caught at or soon after the commission of the offences, the accused would have served his time, and would have started a new life. With this twist, he has inflicted harm not only on the victim and her family, but he would also bring untold hardship and shame to his family. At the time of the hearing, he had not informed his wife and young son of his misdeeds. He faced the “serious prospect of losing his wife and son” during his incarceration. In itself, this pain would be a severe form of punishment. 41 In relation to the rape charge, Defence Counsel agreed that the present facts fell within “Category 2” of the framework set out inNF, and that the appropriate starting point was 15 years’ imprisonment and 12 strokes of the cane. Defence Counsel submitted that the benchmark sentence should be imposed, and no more. As for the aggravated outrage of modesty charge, Defence Counsel submitted that the minimum of three years’ imprisonment should be imposed, with three strokes of the cane. In this regard, Defence Counsel only relied on precedents involving outrage of modesty, rather than any cases involvingaggravatedoutrage of modesty. Finally, for the criminal intimidation charge, Defence Counsel also citedMohammedLitonwhere a sentence of two months’ imprisonment was imposed.Nonetheless, Defence Counsel conceded that the victim was a young person, and that a sentence of four to six months’ imprisonment would be appropriate. 42 By the above, Defence Counsel contended that a global sentence of imprisonment for 15 years and four to six months would be appropriate. The sentences for the rape charge and the criminal intimidation charge should be made to run consecutively, with the sentence for the aggravated outrage of modesty charge running concurrently. Turning to the caning to be imposed, Defence Counsel submitted for 15 strokes in total for the offences.",
        "Decision": "43 Turning to the matters raised in mitigation, I acknowledged that the accused did not have any previous antecedents, which carried some mitigating value. I also appreciated that the accused had cooperated with the police and pleaded guilty, thus saving the victim and the family the trauma of a trial. It is trite that in general, a guilty plea which isa genuine act of contritionand which would save resources which would otherwise be expended at trial merits a discount in sentence:Tan KayBengat [36]. The circumstances in which the value of a guilty plea will be “substantially attenuated” include circumstances where (a) “the plea is tactical” or (b) “there is no other choice but to plead guilty”:Tan KayBengat [37]. 44 On the present facts, I was of the view that the accused had little practical choice but to plead guilty. Admittedly, this was not a case where the accused was caught red-handed at the scene. However, it was also not a case where the Prosecution’s case would rest solely on the victim’s evidence. There was DNA evidence from semen found at the scene and in the genital area of the victim identifying the accused as the perpetrator of the offences. Also, there was objective medical evidence of the physical injuries suffered by the victim at the material time. In my view, the accused would have been hard-pressed to explain away such cogent evidence at trial, and the realistic option was to plead guilty. 45 It was also clear to me that the accused’s guilty plea was “tactical”, as opposed to one demonstrating genuine contrition on his part. In this regard, I disagreed with Defence Counsel’s submission that the accused was truly remorseful. The accused had many years to reflect on his heinous acts and to act on his conscience. Instead of giving himself up, he continued to evade the law, and it was fortuitous that he was eventually apprehended (see further discussion at [47]–[48] below). In mitigation, his actions were described as mere youthful follies which he could not control (see [39] above). In my view, there was a continuing attempt by the accused to downplay the gravity of his actions. As discussed below at [51], I rejected the contention that these offences were committed out of impulse. Such a position demonstrated a lack of true remorse. For the reasons in this and the preceding paragraph, I considered that little weight should be accorded to the accused’s plea of guilt and his cooperation with the police. 46 Turning to Defence Counsel’s contention that the accused did not plan the offences at all, I did not accept that the accused committed the offences purely on impulse. There was some significant degree of premeditation. On this point, I set out my views in greater detail at [51] below. 47 As for the submission that substantial hardship would be caused to his family, the cases are clear that little, if any, weight should be placed on this even if the accused person is a sole breadwinner:NFat [60]. Based on the rather unusual facts of the present case, Defence Counsel went further, and submitted that if the accused had been arrested earlier, he would, by now, have paid for his crimes, and would have had a chance to start afresh. In other words, the submission seemed to be that some consideration should be given to the fact that the accused was arrested after such a long lapse of time, and to the consequential impact on the accused and his newly-formed family arising from this delay. 48 In my opinion, this was a wholly unmeritorious argument. This was a case where the accused managed to evade detection and arrest, and was then brought to justice. After the intervening years, it was commendable that the police managed to connect him to the offences through DNA identification after his arrest for an unrelated matter. There can be no suggestion that there was any delay in the investigations or the prosecution. All this while, for all intents and purposes, the accused managed to carry on normally with his life. He continued to work in Singapore, and then went on to marry and start a family. During this time, there was no sign of any contrition, remorse or regret. Indeed, he appeared to have conveniently put his misdeeds behind him. In sharp contrast, the victim has had to endure the lasting trauma caused by her abduction and rape and the added fear and uncertainty of not knowing if the accused would return to look for her. In these circumstances, I failed to see how or why his present plight and predicament warranted any consideration in his favour in sentencing. 49 Against the mitigating factors of his clean record, cooperation with the police and guilty plea, I weighed the many aggravating factors in the present case which the Prosecution brought to my attention, and to which I now turn. 50 First, the victim was but a young 12-year-old student and a virgin at the time. The accused had unprotected sex with her, exposing her to a risk of unwanted pregnancy. Indeed, he acted in complete disregard for the consequences of his acts towards her. 51  Second, there was a certain degree of premeditation and planning involved. From the previous occasions on which the victim noticed the accused, it seemed clear that the accused had come to know and understand the victim’s morning routine, and had set out to waylay her on 18 October 2002 while she was on her way to school. On that day itself, the accused brought the victim to the nearby HDB block, and then took the lift directly to the fourth floor. It was evident that he knew where he was going. Also, the accused was armed with a paper-cutter, which he showed no hesitation in using. Further, the accused’s threat to cut the victim thrice for each time she cut him, which he made when the victim managed to get hold of the paper-cutter (see [19] above), was particularly telling and demonstrated his resolve to see his plan through to completion. In my view, that the accused was prepared to use force, threats and a weapon to get his way showed that he did not commit the offences merely on the spur of the moment. 52 Third, the use of a weapon capable of causing injury and harm was, in and of itself, an aggravating factor. 53 Fourth, the victim suffered physical harm. In a medical report dated 27 May 2015 setting out the injuries suffered at the material time, it was stated that the victim suffered a superficial tear of the left labia minora, a tear between the right labia minor and majora which was identified as a site of bleeding, and erythema and tenderness at the posterior fouchette. 54 Finally, and most importantly, what weighed heavily on my mind was the psychological and emotional harm inflicted on the victim, as well as the impact on her parents. In the victim impact statement, the victim described how she was “shocked” and “disgusted” during the incident. She dared not “resist” the action of “a total stranger” who was “bigger in size than [her]”. Thereafter, she lived in fear, “scared that he [would] come and look for [her] again”. As she had to continue living at the same place, she “tried [her] best to avoid the incident location and take other alternate routes”. She would be reminded of the incident if she walked past the place. After the incident, she did not do well in school. She stayed at home more often, and avoided going out. She “had to trouble [her] parents greatly”. After trying very hard, “about one year later”, she started taking the lift on her own, but only in the day. She avoided taking the lift at night. She used to have nightmares, and sometimes still has flashbacks. When she has “thoughts about the incident”, she would “feel very sad and angry”. She used to be a happy girl, but felt humiliated, shameful and degraded after the incident. Till now, she avoids the attention of men. Her parents are “very worried” about her. 55 With these factors in mind, I turned to consider the sentence for the rape charge. I accepted the parties’ position that the rape fell within “Category 2” of the framework set out inNF.I came to this view because of the young age of the victim and the force used to bring the victim to the location where the offences were committed (which formed the subject matter of the abduction charge which was to be taken into consideration for the purpose of sentencing). The starting point, therefore, was 15 years of imprisonment and 12 strokes of the cane. Taking into account the aggravating factors set out above, which clearly outweighed the mitigating value of his clean record, his plea of guilt and his cooperation with the police, I was of the opinion that the starting point was inadequate. In particular, as I observed above, there was clear psychological and emotional harm inflicted on the victim, as well as a substantial impact on her family. Therefore, I imposed a sentence of 16 years of imprisonment and 12 strokes of the cane. 56 As for the aggravated outrage of modesty charge, digital penetration of the vagina is surely one of the worst acts of outrage of modesty. At the material time, the accused was also kissing the victim, and frightening her with the claim that she might suffer a miscarriage in the future if she were to pull his finger out. The minimum term of three years’ imprisonment was clearly not appropriate. Compared to the acts performed by the accused persons for the aggravated outrage of modesty charges inHuangShiyouandThangaveluTamilsevam, the accused’s conduct was far more serious. Nonetheless, I noted that in the precedent cases, the accused persons faced more charges and acted against multiple victims. As discussed above, the precedent cases set out a range of four to six years of imprisonment, and six to eight strokes of the cane. Thus guided, I imposed a sentence of four years of imprisonment and six strokes of the cane. I should add that Defence Counsel cited cases involving simple outrage of modesty charges. These were not helpful. 57 Turning to the criminal intimidation charge, the precedent cases provided for sentences of two to three months. However, as conceded by Defence Counsel, the victim was young, and a sentence of four to six months would be appropriate. I imposed the sentence of six months of imprisonment. 58 In determining the total sentence, the overall egregious conduct of the accused should be considered. I have set out the SOF in detail above, which described the ordeal of the victim. Apart from the specific acts particularised in the abduction charge, the criminal intimidation charge and the aggravated outrage of modesty charge which were in and of themselves deplorable, I should highlight that in the course of the events, the accused used force to make the victim sit down at the stairs (see [17]), overcame her resistance by grabbing the paper-cutter back from her after making a threat to cut her thrice for every time she were to cut him (see [19]), prevented her attempt to run away by using force (see [20]), and then urinated in her presence (see [23]). Subsequent to all these acts, which must have already caused the victim considerable alarm, distress and harm, the offence of rape was committed. Considered in totality, the accused’s conduct was reprehensible. Applying the principle of retribution, the global sentence must reflect the accused’s high degree of culpability. 59 Further, I also agreed with the Prosecution that the principle of general deterrence was applicable. As set out above, these were offences of a serious nature committed against a young person, and committed with a high degree of culpability. A stiff sentence was warranted to deter the commission of such offences by other would-be offenders against young victims. 60 In all these circumstances, I agreed with the Prosecution that a total sentence of at least 16 years’ imprisonment would be warranted. To this end, I ordered the imprisonment term for the criminal intimidation charge to run consecutively with that for the rape charge, with the imprisonment term for the aggravated outrage of modesty charge to run concurrently with that for the rape charge. In my view, in totality, the sentence of 16½ years of imprisonment and 18 strokes of the cane is appropriate. This is backdated to 23 January 2015, being the date of remand. Hoo Sheau PengJudicial Commissioner Shahla Iqbal and Dillon Kok(Attorney-General’s Chambers) for the prosecution;Siaw Kin Yeow, Richard (JusEquity Law Corporation) for the accused."
    }
}