{
    "case_title": "Public ProsecutorvMohamad Yazid Bin Md Yusof and others",
    "ncitation": "[2016] SGHC 102",
    "coram": "Choo Han Teck J",
    "sections": {
        "Yazid’s Case": "6 Yazid does not dispute that he had received from Kalwant the 12 packets of substances that were subsequently found to contain not less than 120.90g of diamorphine. He admits that he had the packets in his possession for the purpose of trafficking, and that he knew that the packets contained diamorphine. The elements of the charge against him are therefore made out beyond a reasonable doubt. 7 Yazid claims that in committing the offence, he was merely acting as a courier for his boss “Boy Ayie”. He had helped “Boy Ayie” to receive and deliver drugs on multiple occasions prior to his arrest. He says that “Boy Ayie” or his partner, one “Bujang Hawk”, placed their orders for diamorphine from Kalwant’s boss in Malaysia. “Boy Ayie” would then instruct Yazid to receive the drugs from the sender from Malaysia. On each occasion, Yazid would hold on to the drugs received, until further instructions from “Boy Ayie” for him to deliver the drugs to specific customers of “Boy Ayie” or “Bujang Hawk”. Yazid claims that he had never collected any payment from the customers of “Boy Ayie” or “Bujang Hawk”; the customers would only pay “Boy Ayie” or “Bujang Hawk”. “Boy Ayie” would then give Yazid between $100 and $200 for every packet of drugs that Yazid collected and delivered. Usually, “Boy Ayie” would meet up with Yazid on the same night after Yazid delivered the drugs to pass him the payment. Yazid’s testimony is that for the particular transaction for which he was arrested, “Boy Ayie” met him on 23 October 2013 and instructed him to collect the drugs from a Malaysian courier (proved to be Kalwant) on the following day. 8 I accept that Yazid’s role in the commission of the offence for which he has been charged was restricted to the activities listed in s 33B(2)(a)of the MDA, namely transporting, sending or delivering drugs and/or offering to transport, send or deliver drugs and/or doing or offering to do any act preparatory to or for the purpose of transporting, sending or delivering drugs. In other words, he was acting no more than as a courier. There is no evidence showing that he did more than that.",
        "Kalwant’s Case": "9 Kalwant does not deny that he had delivered to Yazid the 12 packets (six bundles) of substances that were subsequently found to contain not less than 120.90g of diamorphine. He also admits that the 6 packets (three bundles) recovered from his haversack on 24 October 2013 were meant to be delivered to another recipient who drove a white Honda Integra (“the Integra driver”) in Toh Guan area. He says that all the packets belonged to “Anna”, who was his boss in Malaysia, and who worked as an illegal money lender as well as an illegal bookie for football betting. Kalwant owed “Anna” a sum of RM 44,000 from betting on football online. When Kalwant told “Anna” that he could not pay the debts, “Anna” threatened to beat him up, but later told Kalwant that he could repay the debt by working for him. In the one month prior to Kalwant’s arrest, “Anna” instructed him to come into Singapore on several occasions. On each occasion, Kalwant would ride Anna’s motorcycle (which bore the licence plate number JPH 6854) from his place of residence in Johor into Singapore. Upon reaching Singapore, Kalwant would, as per “Anna’s” instructions, first travel to Kranji where he would receive bundles from various persons at an Esso petrol kiosk. Thereafter, “Anna” would send text messages to mobile phones that he had given to Kalwant, for Kalwant to deliver different numbers of the bundles to different recipients in Singapore. According to Kalwant, he had always delivered the bundles to Yazid as well as to the Integra driver. 10 According to Kalwant’s statements, the bundles that he collected from Kranji were always wrapped in black tape. However, on the day of his arrest, the man he met in Kranji not only passed to him six bundles wrapped in black tape but also another six transparent packets containing brown granular substance. The man told him that he had not had time to wrap these six transparent packets in black tape. Together with the man and following his instructions, Kalwant then helped to package the six transparent packets into three black bundles by wrapping every two of the transparent packets in newspaper and going over the newspaper with black tape. 11 Theactus reusof both charges against Kalwant are thus not in dispute. From the evidence, Kalwant’s involvement did not extend to that beyond a courier’s. However, Kalwant claims that he did not have themens reafor the offences as he did not know that the packets contained diamorphine. The Prosecution contended that Kalwant had actual knowledge that the packets contained diamorphine or that, alternatively, the presumption of knowledge under s 18(2) of the MDA applies and Kalwant is not able to rebut that presumption “as he was wilfully blind”.",
        "Whether Kalwant had actual knowledge that the packets contained diamorphine": "12 The Prosecution’s case that Kalwant had actual knowledge that the packets in both charges against him contained diamorphine is largely based on statements made by Yazid. According to Yazid, prior to their arrest, Kalwant had told him at the carpark after he (Kalwant) had placed the six bundles in the motor box of Yazid’s motorcycle that the bundles contained “chocolate colour from pandan”. When asked by the CNB to explain what “chocolate colour from pandan” meant, Yazid said that he was not sure but assumed that it meant that the heroin was brown in colour and came from a place called Pandan. Given the lack of evidence that when Kalwant mentioned “chocolate colour from pandan” he meant heroin, the statement on its own is insufficient to prove that Kalwant had actual knowledge that the bundles contained diamorphine, assuming in the first place that I accept that Kalwant did make the statement as alleged while at the carpark. 13 However, Yazid also claims he had a conversation with Kalwant when they were kept in the same cell at the Cantonment Police Complex following their arrest. In a statement recorded on 29 October 2013, Yazid said that Kalwant informed him that: [Kalwant’s] boss loves him and that was why he was made to only deliver the obat from Singapore to [Yazid] and another person in Singapore, and he is not made to bring the obat from Malaysia to Singapore. Burn used the word “obat” and spoke to me in English and Malay. Burn also shared with me that once he was sending drug to Singapore on motorcycle and he saw his friend being arrested at Woodlands Checkpoint and he thinks that it may be a capital case that his friend is facing…After that occasion, Burn told me he stopped for a while until the boss called him back and asked him how he wanted it to be done. Burn told his boss that he did not want to bring in anymore. He told his boss that bring in let other people do and he just pick up and deliver in Singapore. Burn also told me to make sure to tell the IO that what we were doing was tobacco…[he] insisted that I tell the IO that it is tobacco and panparak. Burn told me that actually the nine bundles were packed by him and another friend of his and out of the nine bundles he had done four of the bundles without using gloves…Burn told me that after he was arrested, Steven called him…Burn told me that he was allowed to answer the call. When Burn answered the call, Burn told me that he spoke to his boss in Tamil…Burn told me that he led the CNB to Toh Guan but of course they did not manage to catch anyone. Burn also told me that he had told the IO that his boss name is called “Anna”… By “Burn” and “Steven”, Yazid was referring to Kalwant and Kalwant’s boss in Malaysia respectively. “Obat” is the street name for diamorphine. Kalwant, by his own evidence, was aware that “obat” means “narcotic drugs”. Hence, if Yazid was speaking the truth when he made the above statement, it would follow that Kalwant had actual knowledge that he was carrying diamorphine. 14 Kalwant denies that he had ever told Yazid any of the above. His counsel submitted that Yazid had fabricated the entire account as he wanted to give the CNB the impression that he could give them a lot of information, so as to secure the certificate of substantive assistance which could spare him from the death penalty pursuant to s 33B(1)(a)of the MDA. I accept that a person in Yazid’s position may have the incentive to lie or embellish evidence to implicate a co-accused. In a case such as the present,illustration (b)to s 116 of the Evidence Act (Cap 97, 1997 Rev Ed), which provides that the court may presume that an accomplice is unworthy of credit and that his evidence needs to be treated with caution, serves as a reminder that the court ought to be alive to the possibility that a person facing a capital drug offence may falsely implicate his co-accused so as to save himself from the gallows. His evidence must be scrutinised for signs of unreliability. It has to be considered against all the other evidence. 15 I believe that Yazid, and not Kalwant, had spoken the truth. First, Yazid’s account that Kalwant had told him that he had packed all nine of the bundles (each consisting of two packets) out of which four were done without using gloves was corroborated by objective evidence; forensic laboratory analysis detected Kalwant’s DNA on four of the bundles seized. Kalwant maintains that he never told Yazid how many bundles he had packed and insists that he had only packed three bundles. When he was asked at trial how it was possible that his DNA was found on four bundles if he had only packed three, Kalwant’s answer was that in one of these four bundles (marked “B1A”), DNA was only found at one place. He said that as this bundle was kept in his haversack (just as the rest of the bundles were also kept), he could have touched the bundle and left his DNA on it. When Kalwant was reminded that his DNA was found on the interior surface of “B1A” and not the exterior surface, he had no reply. Secondly, although Yazid had stated in his contemporaneous statement recorded on 24 October 2013 that Kalwant told him at the carpark before they were arrested that he (Kalwant) had passed to him “six packets of Beh Hoon”, Yazid clarified in a statement recorded on 30 October 2013 that Kalwant did not mention “Beh Hoon”, “drugs”, “obat” or “heroin” on that particular occasion, although he (Kalwant) did mention that he was carrying “chocolate colour from pandan”. Yazid explained that he had mistakenly told the officer who was recording his statement on 24 October 2013 that Kalwant had used the word “Beh Hoon” because he (Yazid) was nervous then. If Yazid was indeed fabricating lies to falsely implicate Kalwant so as to secure a certificate of substantive assistance, he would not have retracted that portion of his 24 October 2013 statement inculpating Kalwant. Thirdly, it was not disputed at trial that after Kalwant’s arrest, he received calls from his boss “Anna” and the CNB officers allowed him to answer the calls. He spoke to “Anna” in Tamil, and then led the CNB officers to Toh Guan where he said he was supposed to deliver the remaining bundles to another intended recipient although that recipient did not turn up in the end. These facts could not have been known to Yazid at the time that he was recording his statement on 29 October 2013, unless Kalwant told all that to him as Yazid claims. Yet, Kalwant maintains that he had never spoken to Yazid about anything relating to the case, except to ask Yazid whether he knew what was in the bundles, how long he thought they would be remanded, as well as arrangement for lawyers. When the CNB asked Kalwant during the recording of a statement on 30 October 2013 whether he had told Yazid that he was allowed to pick up a call from his boss after his arrest and that he had conversed with his boss in Tamil, Kalwant denied that he did. This cannot be true. Otherwise Yazid would not have been privy to the call and the follow-up operation at Toh Guan when he recorded his statement on 29 October 2013. In the circumstances, I believe Yazid when he said in his statement of 29 October 2013 that a conversation did take place between Kalwant and him at the lock-up in the Cantonment Police Complex, and that during this conversation, Kalwant did inform Yazid, among other things, that he knew that he was delivering “obat” (see [13] above). Kalwant sought to downplay what he discussed about the case with Yazid in the lock-up because he wanted to conceal the fact that he revealed to Yazid that he knew that he was carrying “obat”. 16 For the reasons above, I find that Kalwant did have actual knowledge that the bundles contained diamorphine. In coming to this conclusion, I considered Kalwant’s statement recorded on 24 October 2013 when he said that for about one month prior to his arrest, he had been helping his boss by “com[ing] in to Singapore, collect[ing] the drugs at Kranji and pass[ing] [them] to someone else at a different place” against his testimony at trial. Kalwant had spoken in Tamil and given that statement through an interpreter (“PW35”). At trial, counsel for Kalwant contended that Kalwant had not mentioned the word “drugs” in Tamil, but had instead used the word “porul” which translates to “things”. During his evidence-in-chief, Kalwant said that by “porul”, he was referring to packets of tobacco which he thought he was helping to deliver and not drugs. PW35 testified under cross-examination that she could not remember whether Kalwant had used the word “drugs” in Tamil when he had his statement recorded on 24 October 2013, but maintained that normally, she would translate the same word that the accused person used in English. Although I do not entirely believe Kalwant, I am giving him the benefit of the doubt on this point and disregard the portion of the statement which states that he was collecting the “drugs”. In other parts of the same statement, Kalwant maintained that he did not know that the bundles contained drugs. 17 Counsel made it an issue during the trial as to whether Kalwant was known as “Burn” to Yazid. I make no finding on whether Kalwant’s nickname was “Burn”. It is not material to the case. But it is not in dispute that when Yazid referred to “Burn”, he was referring to Kalwant. His evidence on what Kalwant said or did does not change whether he referred to Kalwant as “Burn” or some other nickname. I have explained above why I accept that Yazid had spoken the truth, and that conclusion remains whether or not Kalwant is known to others by a nickname other than “Burn”. 18 Finally, the question as to whether Kalwant had deliberately tipped his boss off in his telephone conversations with the latter became an issue at trial. Kalwant had spoken to his boss in Tamil but none of the CNB officers present then could understand the language. The Prosecution contended that the alleged tip-off led to the failure of the follow-up operation at Toh Guan. Kalwant denied the tip-off, and his counsel said that the Prosecution had made a serious allegation which, if left unaddressed, may cause the court to draw an inference that Kalwant had “instigated an obstruction of justice”. In the present case, it is not necessary for me to make a finding on whether Kalwant had tipped his boss off. I make no such finding and draw no inference on whether Kalwant had instigated an obstruction of justice.",
        "Whether Kalwant can rebut the presumption of knowledge under s 18(2) of the MDA": "19 Apart from seeking to prove that Kalwant had actual knowledge, the Prosecution relies, in the alternative, on the presumption of knowledge under s 18(2) of the MDA. The Prosecution contends that Kalwant has not rebutted that presumption “as he was wilfully blind”. In answering the question of whether an accused person has rebutted the presumption of knowledge under s 18(2) of the MDA on a balance of probabilities, the material issue is not the existence of the accused’s knowledge of the controlled drug but the non-existence of such knowledge on his part. The necessary inquiry is to determine whether Kalwant has rebutted the presumption that he knew that the bundles contained diamorphine. 20 Kalwant claims that he did not know that the bundles contained diamorphine. He thought that he was merely helping to collect and deliver “panparak”, which he says was a kind of “Indian betel nut mixed with tobacco” commonly consumed by foreign workers from India, Myanmar and Bangladesh. He admits that initially he was suspicions about “Anna’s” request. He asked “Anna” what was inside the bundles, and “Anna” told him that the bundles contained tobacco and that he was trying to evade tax. “Anna” also told him to just do his job and not ask any more questions. Kalwant was not satisfied with the answer and he remained suspicious. Hence, on the fourth occasion or so when “Anna” asked him to collect and deliver the bundles, Kalwant decided to peel open one bundle to see what was inside. He described what he saw as “broken pieces” “like grains of sand” or “grains of rice” but in “whitish brown” colour. He says that he has never abused any drugs before, and did not know how diamorphine looks like. However, he had seen “panparak” before and to him, what he saw in the bundle on that occasion looked like “panparak”. As it became clear to him that he was not delivering tobacco, he decided to confront “Anna”. In his statement recorded on 24 October 2013, he said that he called “Anna” immediately after he saw the contents of the bundle on that occasion. In his later statement recorded on 26 October 2013, he said that he called “Anna” only after he returned to Malaysia after delivering all the bundles in Singapore. What is consistent in Kalwant’s evidence is that “Anna”, on being confronted, confirmed that the bundles contained “panparak” and not tobacco. According to Kalwant, “Anna” told him that he had changed “the stuff” in the bundles from tobacco to “panparak” as tobacco was not in demand, but that he had forgotten to inform Kalwant. As “panparak” was more expensive, “Anna” told Kalwant that he would increase Kalwant’s pay from RM 50 for every packet delivered to RM 100. Kalwant says that he was satisfied with the new pay and that his original suspicions on the contents of the bundles were allayed after that incident which convinced him that he was carrying “panparak”. 21 At trial, the Defence tendered to the court coloured printouts of scanned photographs of what it claims to be “panparak”. No original photographs were produced. The resolution of the images is not ideal, and it is possible that the exact shade of colour of “panparak” has not been accurately depicted in the printouts. From what I see, “panparak” consists of small, broken bits of light-brown substances that seem to have a powdery texture. While this is not that far off from Kalwant’s description of “panparak”, the “panparak” I see looks quite different from the diamorphine that was recovered from Kalwant on 24 October 2013, which took the form of regularly-shaped dark brown cubes. It is Kalwant’s own evidence that he had seen the substances that turned out to be diamorphine on the day of his arrest when the man in Kranji passed the substances to him in transparent packets, and that he had even helped the man to pack the diamorphine into black-taped bundles (see [10] above). In his statements to the CNB, he described what he saw as “brown granular substance” or “light brown chocolate cubes”. In his statements as well as during cross-examination at trial, Kalwant concedes that the substances he saw on the date of his arrest looked different from the “panparak” that he had seen earlier. Despite the differences in physical appearances however, he insists that he thought that the diamorphine that he was arrested with on 24 October 2013 was “panparak”. He concedes under cross-examination that the diamorphine cubes and “panparak” were different in shape, but says that he thought that the diamorphine was “panparak” for which “the panparak betel leaves were not broken into pieces yet”. I do not see any resemblance between the diamorphine cubes and “unbroken pieces of betel leaves”. Furthermore, Kalwant also agrees that the brown colour of the diamorphine cubes was much darker than the “whitish brown” “panparak”. However, he says that white lime powder is usually added to “panparak” and he believes that the diamorphine he saw on 24 October 2013 was “panparak” for which the white lime powder had not yet been added. 22 I am not convinced by Kalwant’s account. I do not believe that he genuinely thought that the diamorphine that he had seen on 24 October 2013 was “panparak”. The differences in physical appearances of the two types of substances are significant. Counsel for Kalwant suggested that as Kalwant had met up with the man in Kranji in the early hours of the morning (at around 6am), he might not have been able to see the diamorphine cubes clearly. This was not mentioned anywhere in Kalwant’s evidence. On the contrary, Kalwant admitted that the diamorphine cubes looked different from “panparak”. However, instead of calling “Anna” to confront him on what he was making him carry on 24 October 2013, just as what he had done on the previous occasion, Kalwant disregarded the differences in physical appearances between the diamorphine cubes and “panparak”. He merely says that he trusted “Anna”. However, this relationship of trust between Kalwant and “Anna” is not credible, given Kalwant’s evidence that “Anna” was a gangster who was involved in various illegal businesses, and he (“Anna”) had previously threatened to beat Kalwant up when Kalwant could not pay his debts. It is also Kalwant’s own evidence that “Anna” lied to him previously that he was carrying tobacco when he was actually carrying “panparak”. 23 Even if Kalwant did not have actual knowledge that the bundles contained diamorphine, the presumption of knowledge under s 18(2) of the MDA applies, and he is unable to rebut that presumption. A person is not penalised under the MDA for the reason that he had neglected to inspect and determine what he was carrying but if the accused person had reason to be suspicious and enquire further, then the court may not believe him when he claims that he thought that the drug was something else. 24 For the above reasons, both charges against Kalwant are proved. I find that in the commission of the offences, Kalwant, like Yazid, was acting as no more than a courier, as there is no evidence to the contrary.",
        "Norasharee’s Case": "25 The Prosecution’s case against Norasharee depends almost entirely on Yazid’s testimony. The mobile phone linked to “Eye’s” number (“98615496”) was never recovered by the CNB. Norasharee denies that that was his phone number. He says that his nickname is “Budak Jahat” and not “Eye” or “Boy Ayie”, that he was not Yazid’s boss and that he was not involved in any drug trafficking activities. Through his counsel, he asserts that Yazid lied to falsely implicate him, so as to improve his own chances of securing the certificate of substantive assistance under s 33B(2)(b)of the MDA. Further, counsel for Norasharee asserted that Yazid and Norasharee were members of rival gangs and that Yazid is making use of the opportunity to frame Norasharee and rid himself of an enemy. 26 At trial, Norasharee told the court that he and Yazid are members of the rival “369” and “Omega” gangs respectively. Norasharee related that in 1998, he got into a fight with one “Sum Chartered”, who was an “Omega” headman, at a club at the basement of the Telok Blangah House. He claims that Yazid was present on that occasion as an “Omega” member. Norasharee says that he won that fight, but “Omega” members subsequently took revenge and stabbed him viciously in an attack at Northpoint in 1999. Further, when Norasharee was working as a bouncer at a club called “Club 7” between 2011 and 2013, “Omega” members would frequent the club to cause trouble for him. According to Norasharee, animosity persists between the two gangs till this day and so it is impossible that he and Yazid would jointly engage in an enterprise to traffic drugs. 27 Yazid does not deny that he was a member of “Omega”, but claims that he had left the gang since 2008. He admits that “Omega” and “369” were rival gangs, and that he knows that Norasharee is a “369” member. However, he denies that he was present during the altercation at Telok Blangah House in 1998 and that he in fact did not know “Sum Chartered” until recently when they met in prison. Yazid also says that he was not aware of the attack on Norasharee at Northpoint in 1999. He admits that he had been to “Club 7”, but says that he went with his colleagues at work and not with fellow “Omega” members and that he was not involved even if “Omega” members did cause trouble for Norasharee at “Club 7”. 28 Counsel for Norasharee relied onKhoo Kwoon Hain v Public Prosecutor[1995] 2 SLR(R) 591 (“Khoo Kwoon Hain”) and submitted that the Prosecution has the burden of proving that Yazid has no motive to falsely implicate Norasharee and that the Prosecution failed to discharge this burden. In my view, counsel misunderstoodKhoo Kwoon Hain’s case. The court there held that if the Prosecution wishes to convince the court that a witness has no motive to falsely implicate the accused, the Prosecution has the burden of proving that the witness has no such motive. In the present case it is the Defence that asserts that a witness (Yazid) should not be believed because he has a motive to lie to falsely implicate Norasharee. It is therefore the Defence that has the burden of proving that the witness has such a motive: see s 105 of the EA. He who asserts must prove — that is a basic rule of evidence. 29 I am not convinced that Yazid has any personal vendetta against Norasharee such that he would deliberately lie to frame Norasharee, even though they may have been members of rival gangs. It is Norasharee’s own evidence during cross-examination at trial that he had only met Yazid previously during the Telok Blangah House incident and subsequently at “Club 7”. Yazid denies that he was present during the Telok Blangah House incident but even assuming that he was there, that was a single incident that took place some 18 years ago. As for the subsequent meetings at “Club 7”, it is also Norasharee’s own evidence that he had only seen Yazid there and that they did not talk, much less get into any arguments or fights. Norasharee also said that Yazid was not involved in the attack at Northpoint or in any altercation between Norasharee and members of the “Omega” gang. 30 As for the allegation that Yazid has an incentive to falsely implicate Norasharee so as to secure for himself the certificate of substantive assistance, I accept (as with [14] above) that a person in Yazid’s position may have such an incentive. However, I am of the view that in this case, Yazid’s evidence is reliable. First, Yazid’s testimony that Norasharee had met him in the afternoon of 23 October 2013 in the vicinity of VivoCity to give him instructions to collect drugs on the following day is corroborated by objective evidence. Carpark transaction records show that on 23 October 2013, a car subsequently found to be registered in Norasharee’s name had entered and left the carpark of VivoCity at 1.07pm and 1.40pm respectively. Norasharee does not dispute that he was at VivoCity on 23 October 2013 at the material time but says that he was there with his colleague “Lolo” for lunch. The Defence did not call “Lolo” as a witness. Norasharee denies that he had met Yazid at VivoCity on 23 October 2013, but he was not able to provide any explanation during cross-examination at trial how it was possible that Yazid would know that he had gone to VivoCity on that day if they had indeed not met there on that day. Secondly, I believe that Yazid spoke the truth when he said that Norasharee was “Eye” and “Boy Ayie” since it is Norasharee’s own evidence that he is known as “Ayi” to his family and friends. The words “Eye”, “Ayie” and “Ayi” are aurally similar. 31 Counsel for Norasharee submits that Yazid’s testimony is not credible as he had only mentioned the alleged meeting with Norasharee at VivoCity to the CNB on 22 June 2015, almost two years after his arrest. However, Yazid had in fact given a statement to the CNB about his boss “Boy Ayie” on 29 October 2013 shortly after he was arrested, even though at that time, he said that he did not know “Boy Ayie’s” real name. Further, Yazid gave a physical description of “Boy Ayie” on 30 October 2013 that largely matched with Norasharee (save for “Boy Ayie’s” place of residence which Yazid already said he was not sure of when he recorded the statement). I therefore do not think that Yazid had fabricated his testimony about Norasharee. 32 On the contrary, it seems to me more likely that Norasharee’s defence that Yazid is deliberately trying to frame him is the afterthought. Norasharee was arrested from his flat on 1 July 2015. At trial, he claimed that from the moment he was arrested and shown a picture of Yazid, he recognised Yazid immediately as his enemy and knew that he was being framed by Yazid. However, on 1 July 2015 and 2 July 2015, when Norasharee was shown a photograph of Yazid and asked if he knew the person on the photograph, he maintained on both occasions that he did not know the person. When these statements were shown to Norasharee during cross-examination at trial, he changed his testimony and said that he was “shocked” and “blur” when he was arrested and only recalled that Yazid was his enemy after meeting his lawyer on 3 July 2015. He changed his testimony yet again when DPP Yang Ziliang pointed him to a cautioned statement which was also recorded from him on 1 July 2015, in which he made no mention that he was being framed by Yazid but instead said that he did not know anything and would hand over to his lawyer. This time, Norasharee’s explanation was that he did not tell the CNB about Yazid being his enemy because he was worried that he may say anything “wrong” in his statement and so wanted to consult a lawyer first. I accept that in some circumstances, a person charged with a capital offence may be reluctant to state material facts of his defence to law enforcement officers before seeking legal advice. He may genuinely be unsure of the legal consequences that flow from disclosing those facts and not because his defence at trial is an afterthought. I do not think that such is the case here. Norasharee was repeatedly shown a photograph of Yazid when the CNB officers were recording his statements, and they specifically asked him whether he knew the person in the picture. If, as Norasharee claims, Yazid is really an arch enemy of his, he would at least have mentioned to the CNB that Yazid is his enemy even if he chooses to omit the details until he consults his lawyer. In the circumstances, I do not believe Norasharee’s defence. I accept the Prosecution’s submission that the real reason Norasharee denied knowing Yazid when he gave his statements to the CNB was that he knew that Yazid had been caught for drug trafficking and he did not want to be associated with Yazid for abetting Yazid’s offence. 33 Theactus reusfor the offence of abetment by instigation requires “active suggestion, support, stimulation or encouragement” for the commission of the principal offence on the part of the alleged abettor:Public Prosecutor v Lee Tee Hian[1991] 2 SLR(R) 393 at [51]. For the reasons above, I accept Yazid’s testimony that Norasharee met Yazid on 23 October 2013 to tell Yazid that there was going to be a delivery of drugs from Malaysia on the next day, and instructed Yazid to collect the bundles from the Malaysian courier (who turned out to be Kalwant). Theactus reusof the offence has been made out. As for themens rea, the Prosecution must prove that the alleged abettor had actual knowledge of the circumstances constituting the principle offence. Counsel for Norasharee contended that Norasharee did not have the requisitemens reaas, by Yazid’s evidence, “Boy Ayie” did not inform him how many packets of diamorphine he was supposed to receive from the Malaysian courier but merely told him to collect whatever the Malaysian courier would pass to him, and also did not tell him what time the Malaysian courier would be meeting up with Yazid. This argument has little merit. Yazid merely says that he did not have actual prior knowledge of the quantity of diamorphine that he was supposed to collect from Kalwant. I accept Yazid’s testimony’s that “Boy Ayie” (who is Norasharee) was the person who had ordered the diamorphine from Kalwant’s boss (see [7] above), and it follows that Norasharee must have actual knowledge of the quantity of diamorphine that Yazid was to traffic in on 24 October 2013. There is no requirement in law that the person abetted must have the same knowledge as that of the abettor: seeExplanation3 to s 108 of the Penal Code (Cap 224, 2008 Rev Ed). As for the timing that the Malaysian courier was to meet up with Yazid, although the Prosecution must prove that the alleged abettor has actual knowledge of the circumstances constituting the principle offence, it is not necessary for the Prosecution to prove that he had precise knowledge of all details of the plan: see, e.g. Sinniah Pillay v Public Prosecutor[1991] 2 SLR(R) 704. Even though the principle enunciated in that case relates to the state of mind of the “mastermind” in a case of abetment by conspiracy, it also applies with respect to the state of mind of the instigator in a case of abetment by instigation. 34 There is therefore sufficient evidence that Norasharee had abetted, by instigation, Yazid’s commission of the offence of trafficking in not less than 120.90g of diamorphine. Norasharee’s role was not merely that of a courier, but of an instigator and someone who has control in drug trafficking operations.",
        "Conclusion": "35 Having considered the evidence and the submissions of counsel, I am satisfied that the Prosecution has proven the respective charges against all three accused persons beyond reasonable doubt. I thus find Yazid, Kalwant and Norasharee guilty as charged and convict them accordingly. - Sgd -Choo Han TeckJudge Yang Ziliang and Andrew Low (Attorney-General’s Chambers) for the prosecution.James Bahadur Masih (James Masih & Company) and Mahadevan Luksuhmayeh (S T Chelvan & Company) for the first accused.John Abraham (Crossborders LLP) and Satwant Singh s/o Sarban Singh (Satwant & Associates) for the second accused.Amarick Gill Singh (Amarick Gill LLC) and Mohamed Baiross (IRB Law LLP) for the third accused."
    }
}