{
    "case_title": "Public Prosecutor v Osi Maria Elenora Protacio",
    "ncitation": "[2016] SGHC 78",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 This is an appeal by the Public Prosecutor (“the Prosecution”) against the District Court’s sentence imposed on Osi Maria Elenora Protacio (“the Respondent”) for one charge of committing criminal breach of trust (“CBT”) in respect of cash amounting to $14,089.95 which she was entrusted with dominion over (see the District Judge’s Grounds of Decision (“the GD”) in [2016] SGDC 5). 2 A fine of $4,000 was imposed on the Respondent for the CBT offence. I am of the view that the sentence is manifestly inadequate in light of sentencing precedents. I allow the appeal accordingly, and order the Respondent’s sentence to be enhanced to 15 weeks’ imprisonment. Background and decision below 3 The Respondent is a 41-year-old female working at a dental clinic, Dental Essence at 127 Tanglin Road (“the Clinic”) as a receptionist. Her job responsibilities included, among others, collecting payments from customers and depositing these monies into the Clinic’s bank account. 4 The Respondent pleaded guilty to one charge of CBT under s 406 of the Penal Code (Cap 224, 2008 Rev Ed) for dishonest misappropriation of S$14,089.95 between 4 January 2014 and 24 December 2014 at the Clinic. Another charge of CBT under the same provision in respect of dishonest misappropriation of $12,534.30 between 2 January 2015 and 20 August 2015 was taken into consideration for the purposes of sentencing (“the TIC charge”) with the Respondent’s consent. A total of $26,624.25 (“the Misappropriated Funds”) was misappropriated by the Respondent. 5 The Misappropriated Funds were discovered to be unaccounted for by an external auditor on 7 September 2015. Thereafter, a director at the Clinic interviewed the Respondent and the latter admitted that she had dishonestly misappropriated them. Instead of depositing the Misappropriated Funds into the Clinic’s bank account, she had used them to settle her personal debts. The Respondent is untraced, and has since made full restitution. 6 Despite acknowledging that a sentence of imprisonment would usually be imposed for CBT offences even for first-time offenders unless the property misappropriated was of a low value (and acknowledging that the amount involved in this case was not small), the District Judge concluded that a heavy fine was warranted due to “compassionate grounds” (see [3]–[4] of the GD).",
        "My decision": "7 The Prosecution has provided five reported cases with similar facts for my consideration, and a useful summary in tabular form that encapsulates the relevant comparators for sentencing: Table 1: Relevant Sentencing Precedents CasesTeo Sor Hwee v PP[2007] SGDC 323Tham Whye Tong v PP[2001] SGDC 137PP v Lim Yew Heng[2013] SGDC 104PP v Yaw Kee Shen[2012] SGDC 72PP v Chan King Wui[2013] SGDC 151The Present CaseAmount in proceeded charges$10,984.29$13,547.57$12,332.00$21,739.00$24,527.88$14,089.95Total amount involved$13,498.96$13,547.57$16,482.00$23,939.00$24,527.88$26,624.25Period of offence(s)About 18 monthsAbout 4 monthsAbout 1.5 monthsAbout 9 monthsAbout 11 monthsAbout 19 monthsPleaded guiltyYesFull restitutionYesClean recordYesSentence8 weeks’ imprisonment3 months’ imprisonment3 months’ imprisonment4 months’ imprisonment4 months’ imprisonment$4,000.00 fine"
    }
}