{
    "case_title": "BNP Paribas Wealth Management vJacob Agam and another",
    "ncitation": "[2016] SGHC(I) 5",
    "coram": "Steven Chong J (delivering the judgment of the court)",
    "sections": {
        "Introduction": "1 It is the prerogative of a litigant to decide whom he wishes to sue and where legal proceedings should be commenced to vindicate his claims. Owing to differences in the substantive and procedural laws of various jurisdictions, it is not uncommon for a litigant to “forum shop” – to choose the jurisdiction which is perceived by him to be the most advantageous. Correspondingly, that choice would almost invariably be either adverse or less advantageous from the perspective of his opposing party. 2 The choice of forum can confer substantive advantages in addition to strategic benefits. The law over the years has developed several principles to curtail a litigant’s right to choose a forum. In some instances, the jurisdiction of the court is challenged altogether by the other party. In other situations, the court might be asked to stay the proceedings in favour of another jurisdiction. Such an application can arise in a variety of ways – due to a breach of an exclusive jurisdiction clause or an arbitration agreement,lis alibi pendensorforum non conveniens– and the stay could either be mandatory or discretionary.Each of these doctrines are informed by the overriding principle that the court has to achieve a just outcome by balancing a litigant’s right to choose a forum against the need to hold the parties to their contractual choice, if any, and to ensure that the dispute is heard in the most appropriate forum for the adjudication of the claim. 3 The present case is not a classic stay application. The plaintiff commenced this action against the defendants under two joint personal guarantees (“the Personal Guarantees”) for outstanding loans owed by two of the defendants’ companies. There is no dispute that the action was legitimately commenced by the plaintiff against the defendants in Singapore. As the Personal Guarantees expressly provide for the parties to submit to the jurisdiction of the Singapore court and are governed by Singapore law, not unexpectedly, the defendants are not disputing the jurisdiction of the Singapore court. Neither are the defendants claiming that the Singapore court is not the appropriate forum for the adjudication of the claim. Hence, the usual principles governingforum non conveniensare not directly relevant. 4 The defendants claim that the application is for alimited(ie, temporary) stay of the Singapore proceedings pending the determination of related proceedings in France. The application is ostensibly to avoid the risk of conflicting judgments on account of the multiplicity of proceedings in Singapore and France. The power of the court to grant such a limited stay is firmly grounded in case management considerations and has to be exercised in order to achieve efficiency in the resolution and disposal of disputes. Hence, it is necessary to inquire into the circumstances which brought about the multiplicity of proceedings, in particular the identity of the party responsible for the state of affairs, and whether the parallel foreign proceedings were brought forbona fidepurposes or were contrived in aid of the stay application. 5 Here, the principal reason why there is a multiplicity of proceedings is because of a French action commenced by the defendants against the plaintiff (“the French counter-action”). The French counter-action was not only brought after the commencement of this suit in Singapore, but more significantly after the defendants had already taken steps in the proceedings including the filing of a counterclaim. Further, the French counter-action is substantially a mirror of this action. It includes a claim by the defendants that the Personal Guarantees arenon-existentand therefore unenforceable – the very issue which is before the Singapore court. In essence, the defendants are not applying for a limited stay but are instead seeking for the validity and the enforceability of the Personal Guarantees to be decided in France. Would the grant of such a stay achieve a more efficient management of the dispute before the Singapore court? It appears to us that granting the defendants’ stay application would be the very antithesis of case management. For the reasons elaborated below, in our view, the stay application ought to be dismissed as the multiplicity of proceedings is entirely a result of the defendants’ French counter-action which appears to have been commenced to deliberately stifle the expeditious resolution of the current action.",
        "Background to the dispute": "6 The first and second defendants, Jacob Agam and Ruth Agam respectively, are siblings and Israeli nationals. Prior to 2010, they owned four properties in France and Monaco (“the Agam properties”) through the following companies (collectively “the Agam companies”):1Foot Note 1×First affidavit of Jacob Agam dated 24 May 2016 (“JA affidavit”), para 10. (a) SCI Agam, a real-estate company incorporated in France, through which a penthouse in Paris (“the Paris penthouse property”) was purchased;(b) SCI Ruth Agam, a real-estate company incorporated in France, through which a property in Saint Tropez, France (“the Saint Tropez property”) was purchased;(c) Det Internationale Ejendoms-OG Udviklingsselskab ApS (“Det Internationale”), a private company incorporated in Denmark, through which a property at Villa Saint Pierre in Marnes La Coquette, France (“the Saint Pierre property”) was purchased; and(d) Bronton Assets Inc (“Bronton”), a private company incorporated in Panama, through which a property in a Le Granada, Monaco was purchased. 7 The plaintiff is a multi-national private bank incorporated in France, and acting in Singapore through its local branch. In 2010, the plaintiff and the first defendant entered into discussions to refinance the Agam properties.2Foot Note 2×JA affidavit, para 14.At that time, these properties were mortgaged to various other banks (“the previous banks”).3Foot Note 3×JA affidavit, para 12. 8 Although there is a dispute between the parties over the nature of the initial discussions between the plaintiff and the first defendant, it is common ground that the plaintiff’s proposal to the first defendant was that any loan amounts disbursed in excess of the funds required to repay the previous banks’ outstanding mortgages would be managed by the plaintiff’s Singapore branch on a discretionary basis for the purpose of investment.4Foot Note 4×JA affidavit, paras 15 and 18; affidavit of Charles Merimee dated 4 July 2016 (“CM affidavit”), para 45.",
        "Facility agreements and the Personal Guarantees": "9 Subsequently, four credit facilities were granted by the plaintiff to each of the Agam companies, pursuant to four separate agreements dated 27 May 2010 and signed by both defendants (“the facility agreements”).5Foot Note 5×CM affidavit, para 33 and Exhibit CM-9.The facility agreements were each for the term of five years, and had a total credit limit of €61.7m. 10 The facility agreements were executed on 9 June 2010 at the Paris office of the French notary engaged by the plaintiff.6Foot Note 6×CM affidavit, para 30.The parties differ in their account of the events which occurred at the meeting. In particular, they disagree on whether the second defendant did in fact sign the relevant documents at that meeting and, if so, whether she had sufficient assistance to understand the contents of the documents that she signed. However, for the purposes of this stay application, it is strictly not necessary to delve into this factual dispute. 11 Each of the facility agreements was secured by various securities,7Foot Note 7×CM affidavit, para 34.including the Personal Guarantees dated 1 June 2010 executed by both defendants in favour of the plaintiff.8Foot Note 8×CM affidavit, pp 751–761; 843–853.The Personal Guarantees, including the two relating to the facility agreements granted to SCI Ruth Agam and Det Internationale, are all based on the same standard form. 12 Both the facility agreements and the Personal Guarantees are subject to Singapore law and contain jurisdiction clauses in favour of the Singapore courts. The jurisdiction clauses expressly provide for the jurisdiction of the Singapore courts, but grant the plaintiff the liberty to initiate legal action in any other jurisdiction. Clause 34 of the Personal Guarantees states:9Foot Note 9×CM affidavit, p 760. This Guarantee is governed by, and shall be construed in accordance with, the laws of Singapore but in enforcing this Guarantee, the Bank is at liberty to initiate and take actions or proceedings or otherwise against the Guarantor in Singapore or elsewhere as the Bank may in its absolute discretion deem fit. The Guarantor hereby agrees to submit to the jurisdiction of the courts in Singapore and the courts in such other jurisdiction(s) in which the Bank initiates legal actions or proceedings.",
        "Drawdowns and default of facility agreements": "13 Loans amounting to €61.7m (ie, the total credit limit of the facility agreements) were then drawn down and disbursed to the Agam companies in 2010.10Foot Note 10×CM affidavit, paras 40 to 45.These monies were: (a) used to repay the previous banks’ outstanding mortgages; (b) held as security in a joint account maintained by the defendants with the plaintiff’s Singapore branch (“the Pledged Account”); and (c) the remaining sum of approximately €18.5m was maintained by the defendants with the plaintiff’s Singapore branch, and managed by the plaintiff on a discretionary basis for the purpose of investment. 14 In January 2014, an event extraneous to the facility agreements occurred which ultimately led to the present dispute. TheTribunal de Grande Instanceof Paris(“Paris Court”) ordered the criminal seizure of the Paris penthouse property owned by SCI Agam pursuant to a request by the authorities of the United States of America as part of their money laundering investigations.11Foot Note 11×CM affidavit, para 56.This led to a dispute between the parties as to whether SCI Agam, and consequently the remaining three Agam companies, were in default of the global margin requirement contained in all of the facility agreements.12Foot Note 12×CM affidavit, p 745.The detailed facts of this dispute are not directly material to this application. It suffices to note that the parties subsequently entered into discussions for the settlement of the outstanding monies due under the facility agreements. The facility agreements granted to SCI Agam and Bronton were settled on 10 March 201413Foot Note 13×CM affidavit, para 57; JA affidavit, para 47.and 30 September 2014,14Foot Note 14×CM affidavit, para 65.respectively. In respect of the other two facility agreements extended to SCI Ruth Agam and Det Internationale, the parties continued to negotiate but were unable to reach a compromise. Thus, following the contractual maturity date of 9 June 2015 for the facility agreements, the plaintiff issued formal notices of demand to SCI Ruth Agam and Det Internationale on 11 June 2015 for the repayment of the loans.15Foot Note 15×CM affidavit, pp 1226–1238.It should be highlighted that the notices of demand were not premised on any default by the Agam companies but instead were premised simply upon thematurityof the facility agreements. 15 Following the failure of SCI Ruth Agam and Det Internationale to make payment, the plaintiff issued two letters of demand both dated 15 October 2015 to the defendants,16Foot Note 16×Statement of Claim (Amendment No 1) dated 22 April 2016 (“SOC”), para 23.demanding payment under the Personal Guarantees of the outstanding sums owed by SCI Ruth Agam and Det Internationale.",
        "Set-off and legal proceedings": "16 On 30 October 2015, the plaintiff, in exercise of its rights under the securities granted by the defendants, applied the sum of approximately €9.9m which was remaining in the Pledged Account towards partial satisfaction of the outstanding sums owed under the SCI Ruth Agam and Det Internationale facility agreements.17Foot Note 17×SOC, para 26.It also applied the sum of US$186,257.48 from a separate sole account which the first defendant had with the plaintiff towards part payment of the SCI Ruth Agam facility agreement, in the exercise of its rights of set-off under the Personal Guarantees.18Foot Note 18×SOC, para 25. 17 The plaintiff then commenced the following actions in France:19Foot Note 19×JA affidavit, para 1. (a) On 20 November 2015, the plaintiff applied for conservatory (ie, protective seizure) orders over the defendants’ shares in SCI Ruth Agam and Det Internationale pursuant to the Personal Guarantees. These orders were granted in favour of the plaintiff. (b) On 5 and 7 January 2016, the plaintiff began foreclosure proceedings to enforce the mortgages over the Saint Pierre and Saint Tropez properties (which belong to Det Internationale and SCI Ruth Agam, respectively). 18 The plaintiff, soon after the application for conservatory orders, brought this present action against the defendants in Singapore under the Personal Guarantees on 27 November 2015. 19 In response, the defendants and the Agam companies commenced the following legal actions in France and Singapore: (a) On 17 May 2016, the defendants, SCI Agam, SCI Ruth Agam and Det Internationale brought an application in France to commence the French counter-action in the Paris Court for,inter alia, a declaration of the “l’inexistence”, or non-existence, of the facility agreements and the Personal Guarantees. The summons for the French counter-action was served on the plaintiff on 27 May 2016, and formally filed with the Paris Court on 6 June 2016.20Foot Note 20×CM affidavit, paras 74 and 75. (b) On 25 May 2016, this present application for a limited stay of court proceedings was filed in Singapore. (c) On 24 June 2016, SCI Ruth Agam applied to the French judge presiding over the foreclosure proceedings (“the Enforcement Judge”) to either dismiss or stay the foreclosure proceedings until the determination of the French counter-action.21Foot Note 21×Affidavit of Xavier Boucobza dated 4 July 2016 (“XB affidavit”), Exhibit XB-3 (“XB Expert Report”), Annex 35.The outcome of that application was still pending when we heard the present stay application. (d) Further, on 24 June 2016, the second defendant, SCI Ruth Agam and Det Internationale brought a further application against the plaintiff under Art 145 of the French Civil Procedure Code. This application was for the discovery of certain evidence to aid a claim of damages against the plaintiff. The French court granted the application on anex-partebasis, but the plaintiff has since applied to set aside the order. Hence, these proceedings (“the Art 145 proceedings”) are still ongoing.22Foot Note 22×Second affidavit of Jacob Agam dated 18 August 2016 (“JA second affidavit”), paras 8 and 9.",
        "Parties’ respective cases in the suit": "20 The plaintiff’s claim in the present action is under the Personal Guarantees for the sums of €17,113,889.93 and €12,988,992.66 which it contends remain owing by Det Internationale and SCI Ruth Agam, respectively. 21 The defendants have raised various defences. The main defence relevant to this application is that the SCI Ruth Agam facility is contrary to the laws of France and/or SCI Ruth Agam’s company statutes, and thereforeultra vires, illegal, void and unenforceable against the company. Therefore, the defendants contend that the securities provided pursuant to the SCI Ruth Agam facility, including the Personal Guarantees, are likewise unenforceable against them.23Foot Note 23×Defence and Counterclaim of the first defendant (Amendment No 1) dated 6 May 2016 (“D1 DCC”), para 7.As the pleadings stood at the time we heard the stay application, the defendants did not aver that the same was true for the Det Internationale facility agreement and the Personal Guarantee granted thereunder. This is probably due to the fact that Det Internationale, unlike SCI Ruth Agam, is a Danish company and hence not directly governed by French law. 22 The second defendant also asserts the defence ofnonest factumon the basis that she only understands Hebrew, and not English or French, and was not aware or informed that personal liability will be imposed on her when she signed the Personal Guarantees in Paris on 9 June 2010. In addition, both defendants contend that their liability under the Personal Guarantees is diminished and/or extinguished by various counterclaims which they and the Agam companies have against the plaintiff arising from,inter alia, the plaintiff’s purportedly wrongful declaration that there was a breach of the global margin requirement following the criminal seizure of the Paris penthouse property in 2014. However, as pointed out at [14] above, the plaintiff’s notices of demand were in fact premised only on thematurityof the facility agreements rather than on any prior breaches of the facility agreements by the defendants.",
        "Present application": "23 As we noted in our introduction, the defendants do not challenge the jurisdiction of this court, nor do they contend that Singapore is not an appropriate forum for the resolution of this suit under the doctrine offorum non conveniens. Rather, their application, at least on its face, is for alimitedcase management stay on the basis that there will be a multiplicity of proceedings, with a risk of conflicting judgments, if the proceedings in France and Singapore were to proceed at the same time. 24 The application is for the limited stay until the determination of the related proceedings in France. As outlined above (at [17] and [19]), there are four sets of proceedings in France – (a) the conservatory proceedings, (b) the foreclosure proceedings, (c) the French counter-action, and (d) the Art 145 proceedings. At the hearing of this application, the defendants clarified that the relevant proceedings for the purpose of their stay application are the foreclosure proceedings and the French counter-action. So they accept that the conservatory and Art 145 proceedings do not impinge on this suit. 25 At the outset, it is worth noting that the application for a limited stay was filed by the defendants on 25 May 2016. This was almost six months after the plaintiffs commenced this suit in Singapore on 27 November 2015. It was also filed shortly after the application to commence the French counter-action was brought before the Paris Court on 17 May 2016. The timing of the application is an important factor to which we will return (see [50] below).",
        "Parties’ evidence on French law": "26 At the case management conference heard by us on 17 May 2016, counsel for the second defendant indicated that the defendants would be adducing evidence of French law for the purposes of this application, but only to explain the nature of proceedings in France. He assured us that the evidence of foreign law would not touch on the merits of those proceedings. Despite this assurance, the parties have adduced substantial evidence, in the form of French law expert reports, relating to the merits of the case under the laws of France. 27 Leaving aside the relevance of this evidence, there was a question as to its admissibility because the defendants’ initial pleadings on French law were both extremely brief and inadequate. This deficiency was pointed out by the court at a further interlocutory hearing on 18 July 2016.24Foot Note 24×SICC Summons No 6 of 2016.Five weeks later, on the eve of the hearing of the stay application, the defendants applied to amend their pleadings, ostensibly inspired by the comments made by the court at the interlocutory hearing.25Foot Note 25×SICC Summonses Nos 15 and 16 of 2016. 28 There were three aspects to the amendments sought by the defendants. First, the amendments particularised the doctrines and provisions of French law which the facility agreements and Personal Guarantees purportedly contravene. Second, they introduced an attack on thebona fidesof the choice of law and jurisdiction agreements in the Personal Guarantees. Third, they sought to introduce the second defendant’s denial of having signed the Personal Guarantees at all, in addition to her defence ofnonest factum. As these amendments were substantial, the plaintiff’s counsel required time to take instructions. 29 From the evidence of the defendants filed in support of the amendment applications, it was apparent that their concern was that without the amendments, they would not be able to rely on the experts’ affidavit evidence on French law in aid of this stay application. To give the plaintiff sufficient time to consider the proposed amendments while, at the same time, ensuring that the stay application, which was to be heard by three judges, could proceed, the court inquired from the defendants’ counsel whether he would be prepared to proceed with the stay application on the pleadings as they stood, but with the parties given full liberty to refer to all the affidavits on French law despite the inadequacies in the defendants’ pleadings. The defendants’ counsel agreed to the suggestion and the plaintiff did not object. On this premise, the amendment applications were adjourned to enable the plaintiff’s counsel to take proper instructions, and the stay application was heard on the basis of the pleadings as they then stood with liberty to the parties, in particular, the defendants, to refer to the experts’ affidavit evidence on French law.",
        "Parties’ positions on impact of French proceedings": "30 Although the parties were given liberty to refer to all the French law material tendered, our view is that the evidence on French law is only relevant to this application insofar as it touches on any overlap between this present suit and the French proceedings (see [48] below). On this issue, there are two main areas of contention between the plaintiff and the defendants: (a) First, and significantly, the parties dispute the governing law of the Personal Guarantees. The plaintiff’s case is that thelexcontractusis Singapore law. The defendants acknowledge that there is an express choice of law clause in the Personal Guarantees in favour of Singapore law. But they contend that both the French and Singapore courts ought to apply French law instead as the choice of law agreement is notbonafide. If so, then it is argued that this court would benefit from the findings of the French courts on the validity of the Personal Guarantees under French law. (b) Second, in relation to whether there is an overlap between the foreclosure proceedings and this present suit, the plaintiff’s case is that there is no overlap, or at most a minor and insignificant overlap, because the Personal Guarantees would still be enforceable even if the facility agreements are struck down by the Enforcement Judge, regardless of whether Singapore or French law applies. The defendants’ evidence is that any ruling by the Enforcement Judge on the validity of the facility agreements will affect the enforceability of the Personal Guarantees due to the French doctrine ofl’inexistence. This submission assumes that the Personal Guarantees are governed by French law.",
        "Legal principles governing a limited stay of proceedings": "31 The defendants’ application is based on s 18(2) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”) read with para 9 of the First Schedule of the same Act. Paragraph 9 reads: Stay of proceedings 9.  Power to dismiss or stay proceedings where the matter in question is res judicata between the parties, orwhere by reason of multiplicity of proceedings in any court or courtsor by reason of a court in Singapore not being the appropriate forum the proceedings ought not to be continued. [emphasis added] Alternatively, the defendants rely on the inherent jurisdiction of the court. 32 In either case, the leading authority isChanChin Cheung v Chan Fatt Cheungand others[2010] 1 SLR 1192 (“Chan Chin Cheung”). The Court of Appeal held that the grant of a limited stay order pending the conclusion of other proceedings does not strictly require the application offorum non conveniensprinciples because under s 18 of the SCJA read with para 9 of the First Schedule, or alternatively, under the inherent jurisdiction of the court, the court has the full discretion to stay any proceedings before it until whatever appropriate conditions are met (at [47]). 33Chan Chin Cheungconcerned parallel proceedings in Malaysia and Singapore arising from a dispute over the administration of a will. The proceedings were premised on different causes of action – the Malaysian action sought reliefs against the trustees of the estate for breach of their duties to the beneficiaries while the action in Singapore was for defamation by the trustees. However, the Court of Appeal found that the two actions traversed much of the same grounds, and that there was a considerable overlap in the issues to be determined. Thus, it upheld the High Court’s order that the Singapore action should be stayed on a temporary basis pending the outcome of the Malaysian proceedings. It was held that this was a sensible and practical order which would allow the Singapore court the benefit of the Malaysian court’s findings, and therefore minimise the risk of conflicting judgments. The limited stay was also judged to promote international comity by ensuring that the courts of the two countries would not go on their separate and independent ways (at [46]). 34 The principles laid down inChan Chin Cheunghave been considered in subsequent cases such asRBS Coutts Bank Ltd v Brunner Hans-Peter[2010] SGHC 342 (“RBS Coutts”) andRamParshotam Mittal v Portcullis Trustnet (Singapore) Pte Ltd and others[2014] 3 SLR 1337 (“Ram Mittal”). These cases have expanded onChan Chin Cheungby approving the following factors, identified by the Federal Court of Australia inSterling Pharmaceuticals Pty Limited v The Boots Company (Australia) Pty Limited(1992) 34 FCR 287 at [16], as relevant (RBS Couttsat [26];Ram Mittalat [53]): (a) which proceeding was commenced first;(b) whether the termination of one proceeding is likely to have a material effect on the other;(c) the public interest;(d) the undesirability of two courts competing to see which of them determines common facts first;(e) consideration of circumstances relating to witnesses;(f) whether work done on pleadings, particulars, discovery, interrogatories and preparation might be wasted;(g) the undesirability of substantial waste of time and effort if it becomes a common practice to bring actions in two courts involving substantially the same issues;(h) how far advanced the proceedings are in each court;(i) the law should strive against permitting multiplicity of proceedings in relation to similar issues; and(j) generally balancing the advantages and disadvantages to each party. 35 The above list of factors is not exhaustive. Ultimately, the grant of a limited stay of proceedings is a discretionary exercise of the court’s case management powers. This discretion is triggered when there is a multiplicity of proceedings; and in exercising these powers, the court is entitled to consider all the circumstances of the case. The underlying concern is the need to ensure the efficient and fair resolution of the dispute as a whole. 36 The parties also rely on authorities drawn from the analogous context of overlapping court and arbitration proceedings (seeTomolugen Holdings Ltd and another v Silica Investors Ltd and other appeals[2016] 1 SLR 373 (“TomolugenHoldings Ltd”);MaybankKim Eng Securities Pte Ltd v Lim Keng Yong and another[2016] 3 SLR 431). Although those cases also relate to the court’s case management powers, there are important differences between the exercise of case management powers in the context of overlapping court and arbitration proceedings and in the context of a multiplicity of court proceedings. In the former case, the multiplicity of actions is a result of some, but not all, of the parties and/or claims being subject to an arbitration agreement. Hence, the need to prevent a plaintiff from circumventing the operation of the arbitration clause is an important concern (seeTomolugen Holdings Ltdat [188]). On the other hand, in the latter case (which includes the present application), the overlap between the proceedings in Singapore and in the foreign court is a consequence of the cross-border nature of the dispute. Hence, the principle inTomolugen Holdings Ltdwhich was developed to balance the need for proper case management with the view to prevent a party from circumventing an arbitration clause is not engaged here. Instead, a consideration of private international law factors such as the principles offorum non conveniensand international comity is more germane, although the former doctrine does not strictly need to be applied due to the temporary nature of the stay which preserves the plaintiff’s right to prosecute his claim in Singapore (seeYap ShirleyKathreyn v Tan Peng Quee[2011] SGHC 5 at [7]).",
        "Issues": "37 Following on from the above, the key issues to be determined are: (a) whether there is an overlap of issues between the proceedings in Singapore and France which gives rise to a risk of conflicting judgments; and (b) if so, whether the court should exercise its discretion, under para 9 of the First Schedule to the SCJA and/or under its inherent powers of case management, to order a limited stay of proceedings pending the determination of the proceedings in France.",
        "Do the French proceedings overlap with the current suit?": "38 We start with the inquiry whether there is any overlap of issues between the proceedings in Singapore and France. If not, there would be no multiplicity of proceedings, and the court would have no reason to order a limited stay. An analysis of this issue requires: first, an examination of the relationship between the current suit and the French foreclosure proceedings commenced by the plaintiff; and, second, the overlap between this suit and the defendants’ French counter-action.",
        "Foreclosure proceedings": "39 The defendants concede that the validity of the Personal Guarantees is not directly in issue in the foreclosure proceedings, which are based on the facility agreements and mortgages. In fact, the defendants are not even party to the foreclosure proceedings. But their submission is that any findings by the Enforcement Judge on the legality and enforceability of the facility agreements are likely to have a material impact on the present suit. This submission principally turns on the governing law of the Personal Guarantees, which will determine the relationship between the Personal Guarantees and the facility agreements. 40 As the pleadings stand, there is no doubt that that the Personal Guarantees are governed by Singapore law by virtue of cl 34 (see [12] above). The defendants accept that, on their face, the Personal Guarantees can be enforced as indemnities as a result of cl 17, which provides that “[a]s a separate, additional, independent and continuing obligation”, the defendants undertake to make payment under the Personal Guarantees “as original, primary and independent sole obligor[s]… by way of a full indemnity”.26Foot Note 26×CM affidavit, p 757.It is also common ground that insofar as the Personal Guarantees can be enforced as indemnities, the position under Singapore law is that the defendants’ liability is primary and would survive even if the underlying facility agreements are void or otherwise unenforceable (American Home Assurance Co v Hong Lam Marine Pte Ltd[1999] 2 SLR(R) 992 at [41]). This analysis supports the plaintiff’s case that there is no overlap, or at most a minor and insignificant overlap, between the foreclosure proceedings and this suit. 41 This is the reason why the defendants have sought to amend their pleadings to challenge thebona fidesof the parties’ choice of Singapore law. However, even if the amendments had been allowed, there is no material before the court to support a finding, at this stage, that the choice of law agreement was not genuine. The defendants rely on the case ofPehTeck Quee v Bayerische Landesbank Girozentrale[1999] 3 SLR(R) 842 (“PehTeck Quee”). However the Court of Appeal’s judgment inPehTeck Queeestablishes that where an express choice of law has been made by the parties, it is virtually conclusive of the proper law governing the contract (at [17]). The court also accepted that a choice of law may be held to be notbona fideif theonlypurpose for choosing Singapore law was to evade the operation of a foreign law. It appears to us, at leastprima facie, that there were good reasons for the parties to choose Singapore law as the governing law of the Personal Guarantees. The guaranteed loans were disbursed from and chiefly managed by the plaintiff’s Singapore branch. The first defendant’s own evidence is that the investment proposals which he reviewed before entering into the facility agreements were presented to him by the plaintiff’s executive from Singapore,27Foot Note 27×JA affidavit, para 19.who was the defendants’ relationship manager for the accounts they subsequently opened in Singapore.28Foot Note 28×CM affidavit, para 1.These factors weigh against the defendants’ bare assertion that the entire transaction had been booked through Singapore in order to circumvent the laws of France.29Foot Note 29×JA affidavit, para 76.Certainly, there is no clear evidence, at this interlocutory stage, that the plaintiff had deliberately chosen Singapore law as the governing law of the Personal Guarantees for thesolepurpose of evading the operation of French law (seePehTeck Queeat [17]). Thus the choice of Singapore law isprima facievalid. It is perhaps telling that thebona fidesof the choice of law clause was not even an issue until just before the hearing of the stay application. 42 As the choice of Singapore law isprima facievalid, there is no need for the court to make any finding on the position under French law. Even if Singapore law was found to be inapplicable, there is no evidence that the purported illegality of the facility agreements would affect the enforceability of the Personal Guarantees under French law. The defendants’ French law expert states in his report that the Personal Guarantees would be unenforceable under French law if the facility agreements are found to be illegal; however, this proposition is asserted without any substantiation. Reference is made to the French doctrine ofl’inexistenceor “non-existence” – it appears from the evidence that in French contract law, a finding of non-existence is distinct from a finding that a contract is null or voidable. In particular, the defendants’ expert asserts that if the facility agreements are found to be non-existent, then the defendants and the Agam companies would be completely absolved from all liability, including under the Personal Guarantees.30Foot Note 30×Affidavit of Jean-Clause Fréaud dated 25 May 2016 (“JCF affidavit”), Exhibit JCF-2 (“JCF Expert Report”), para 10.1.1.He does not explain though why, under French Law, such an extraordinary outcome, which would result in the Agam companies not having to repay the loan amountsat alleven though the monies had been used to,inter alia, repay their previous banks, would be reached on the facts of this case. 43 The evidence of the plaintiff’s French law expert that the contracts would, at most, be found to be voidable rather than non-existent is more persuasive. He opines that contracts will only be found to be non-existent in exceptional cases where there has been no effective concurrence of intention (ie, absence of offer and acceptance).31Foot Note 31×XB Expert Report, sections IV.D.2.That is not apparent at this stage of the proceedings. In other cases, where a loan agreement is set aside but not found to be non-existent, his evidence indicates that the borrower would still be obliged to repay the principal sums pursuant to “an obligation to make restitution” under French law.32Foot Note 32×XB Expert Report, section IV.D.4.The plaintiff’s expert also cites numerous French authorities which indicate that, under French law, the obligations of a guarantor continue to exist after the cancellation of a loan agreement.33Foot Note 33×XB Expert Report, sections IV.D.4, IV.E.2.b and V.D.2.Specifically, he relies on Art 1352-9 of the French Civil Code which clearly states that the obligations of a guarantor would be transferred over to the debtor’s obligation to make restitution of the principal sums.34Foot Note 34×XB Expert Report, Annex 32.Therefore, if we had to decide the issue at this stage, we would have preferred the evidence of the plaintiff’s expert that, under French law, the Personal Guarantees are not likely to be affected by the purported illegality of the facility agreements. His evidence is both cogent and well supported by French legal sources. 44 It should also be recalled that SCI Ruth Agam has applied to stay the foreclosure proceedings pending the determination of the French counter-action (see [19(c)] above). Such an application casts further doubt on the relevance of the foreclosure proceedings to the present stay application. Thus we find that the foreclosure proceedings are not likely to have a material impact on the present suit.",
        "French counter-action": "45 By contrast with the foreclosure proceedings brought by the plaintiff, there is a clear overlap between the present suit and the defendants’ French counter-action. The Personal Guarantees are directly in issue in the French counter-action before the Paris Court, and the principal remedy sought by the defendants is a declaration from the court confirming the non-existence of,inter alia, the Personal Guarantees. This remedy is similar to declaration which the first defendant seeks, by way of counterclaim in this suit, that he is discharged from all liability under the Personal Guarantees. The French counter-action is therefore a mirror of this current suit. Therefore, the substantial overlap between both proceedings was entirely brought about by the defendants. Although the plaintiff acknowledges that there is such an overlap, its case is that this overlap should nonetheless be disregarded for present purposes as the French counter-action was strategically commenced after this suit. This is a consideration which is relevant to the court’s exercise of discretion. It does not change the fact that there is a multiplicity of proceedings in this case, with the attendant risk of conflicting judgments if both this suit and the French counter-action were to proceed concurrently.",
        "Exercise of court’s discretion": "46 However, the risk of conflicting judgments is not by itself a sufficient reason for the grant of a limited stay of proceedings. As outlined above, the court, in exercising its discretion, needs to consider all the circumstances of the case, and keep in mind the need to ensure the efficient and fair resolution of the dispute as a whole (see [35] above).",
        "Governing law and relevance of arguments on merits": "47 First, the defendants argue that this court will benefit from the findings of the French court on the validity of the Personal Guarantees as thelexcontractusis French law. This submission falls away in light of our finding (at [40] and [41] above) that the Personal Guarantees areprima faciegoverned by Singapore law. In any event, even if this court should decide otherwise at the trial of this action,ie, that French law applies because the choice of Singapore law is notbona fide, this factor cannot be determinative since this court, which is an international commercial court with an International Judge from France, can apply the laws of France to decide the dispute. 48 Other than expressing aprovisionalpreference for the evidence of the plaintiff’s expert in [43] above, we did not find the evidence tendered by the parties on the merits of the case under the laws of France useful or relevant to the determination of this stay application. Once it is determined that there is ariskof conflicting judgements, there is no further need for the court, at this stage, to make any findings on the merits of the case.",
        "Bona fides of present application and French counter-action": "49 Thebona fidesof this stay application and the defendants’ French counter-action, by contrast, is highly relevant. As analysed above, the foreclosure proceedings are distinct and do not materially overlap with this current suit. Hence the multiplicity of proceedings in this case is entirely a result of the defendants’ commencement of the French counter-action. The French counter-action, however, appears to have been commenced to deliberately stifle the current action. This is borne out by the timing of this application and the scope of the French counter-action. 50 As noted above (at [25]), the application to commence the French counter-action was only brought by the defendants on 17 May 2016, almost six months after this suit was commenced. This application was then brought shortly thereafter. The scope of the French counter-action, which mirrors this suit, is also relevant. Due to the complete overlap between both proceedings, if this suit is stayed pending the determination of the French proceedings, then this action will effectively be rendered otiose, particularly if the Paris Court finds in favour of the defendants. In other words, although the defendants’ application is, on its face, for a limited case management stay, the stay of proceedings granted wouldin substancebe permanent. The defendants accept that this would be the practical consequence of a limited stay order should they prevail in the French counter-action. But they argue that if the plaintiff prevails in France instead, then this suit would still need to be revived as the plaintiff will then need to enforce the Personal Guarantees in Singapore. Even if this is true, it does not undermine the observation that the defendants’ motivation in bringing this application appears to be to derail these proceedings in Singapore in order to embroil the plaintiff in a much wider and protracted dispute in France. 51 This factor clearly distinguishes this case from the precedents on a limited stay of proceedings cited above. In cases such asChan Chin Cheung,Ram MittalandRBS Coutts, there were common issues between the proceedings in Singapore and in the foreign court, but the overlapping proceedings were not identical. This is the reason why the limited stay was granted – it was considered to be a sensible and practical order which would preserve the plaintiff’s right to prosecute its claim in Singapore while minimising the risk of conflicting decisions by allowing the Singapore court to have the benefit of the findings of the foreign court (seeChan Chin Cheungat [46];Ram Mittalat [59]). This reasoning does not apply to the present case, where it is difficult to see how, as a matter of case management, staying this action until the full determination of the French proceedings would allow for a more expedient resolution of the dispute between the parties. InRam Mittal, it was also implicitly accepted that a limited stay application filed for the extraneous purpose of stifling the proceedings in Singapore should not be allowed (at [57]). As a matter of principle, this is patently right.",
        "Forum non conveniens and international comity": "52 Finally, it is useful to consider the principles offorum non conveniensand the argument that these proceedings should be stayed as a matter of international comity. 53 There can be no doubt that Singapore is an appropriate forum for the resolution of this dispute. This is conceded by the defendants who are bound by the jurisdiction agreement in favour of the courts of Singapore in the Personal Guarantees. The defendants have also actively participated in this action,inter alia, by bringing a counterclaim. So the defendants cannot, and more importantly have not, argued that the principles offorum non convenienspoint in favour of the French court. 54 The defendants thus place much reliance on the principle of international comity. But the principle works both ways. Here, Singapore is the appropriate forum and the French court can take cognisance of any Singapore judgment. Further, there is no reason why the defendants cannot amend their pleadings to bring in any additional issues which they have raised in the French counter-action rather than startingde novoin France. This would clearly be, as a matter of case management, the more sensible way to resolve the dispute in an efficient and fair manner especially given that the Singapore proceedings are at a more advanced stage than the French counter-action, which is still in its nascency.",
        "Conclusion": "55 In our view, it is clear that this application is an attempt by the defendants to stifle these proceedings and undermine the proper jurisdiction of this court through the stratagem of a case management stay. If allowed, it would hinder rather than promote the expedient resolution of the dispute between the parties. Therefore we dismiss the application with costs.",
        "Post-script: Defendants’ summonses for amendment of pleadings": "56 As a post-script, we record that the defendants’ applications to amend their pleadings (see [27] above) were heard on 30 September 2016 after the hearing of the stay application. The amendments were allowed, save for those relating to the second defendant’s denial that she had signed the Personal Guarantees. Those proposed amendments contradicted her pleadings on the defence ofnonest factum. The plaintiff did not object to the other amendments. We should make clear that the fact that the other amendments – relating to the particulars of French law and thebona fidesof the jurisdiction and choice of law clauses – were allowed does not change our assessment of the defendants’ stay application. As stated earlier (at [29]), the arguments and evidence sought to be introducedviathese amendments were permitted to be raised at the hearing of the stay application and were therefore fully considered by this court. Steven Chong     Roger Giles     Dominique HascherJudge     International Judge  International Judge K Muralidharan Pillai, Luo Qinghui and Andrea Tan (Rajah & Tann Singapore LLP) for the plaintiff;Sivakumar Murugaiyan and Kyle Gabriel Peters (Straits Law Practice LLC) for the defendants."
    }
}