{
    "case_title": "Public ProsecutorvSyed Suhail bin Syed Zin",
    "ncitation": "[2016] SGHC 08",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The Prosecution’s case": "3 On 3 August 2011 at about 9.45pm, officers from the Central Narcotics Bureau (“the CNB”) arrested the accused near the traffic junction of Choa Chu Kang North 7 and Choa Chu Kang Drive.1Foot Note 1×Prosecution’s submissions at [4].They escorted him to Block 686B Choa Chu Kang Crescent where they searched him and found a set of three keys from his trousers pocket. The accused was then brought up to unit #11-234 (“the flat”) in the same block of flats. 4 The CNB officers gained access into the flat using the accused’s keys. They also opened the door of the master bedroom using those keys. The accused was the tenant of the master bedroom in the flat. He lived in that bedroom with his girlfriend. The bedroom had a walk-in wardrobe where the accused stored his belongings.2Foot Note 2×Prosecution’s submissions at [7].When asked if he had anything to surrender, he pointed to the rightmost shelf above the drawers of the wardrobe,ie, the pigeon hole on the right side of the wardrobe (“the pigeonhole”). The following items were inside the pigeon hole: (a) A shoe bag which contained a stack of white envelopes, numerous empty sachets, the empty box of a digital weighing scale and its instruction manual; (b) A white metal container (“the bowl”) containing brownish granular substance and a metal spoon; (c) A dark blue plastic bag containing four plastic packets of brownish granular substances; and (d) A digital weighing scale, a pair of scissors, a roll of masking tape and a red plastic bag which was empty and folded. 5 In the hanging compartment of the wardrobe above the pigeon hole (ie, the top right section of the wardrobe), there werea red plastic bag which contained one small packet of brownish granular substance, one small packet of brownish powdery substance, one stained metal spoon and four used syringes and their plastic wrappers. A grey plastic bag containing two plastic packets was also found on the floor near the master bedroom door. 6 The substances inside the bowl and the four packets inside the dark blue plastic bag weighed about 2.21kg. They were analysed by the Health Sciences Authority (“HSA”) and found to contain at least 38.84g of diamorphine (hereafter referred to as heroin) in total. The bowl contained at least 7.80g of heroin while the four packets contained at least 10.96g, 8.10g, 4.36g and 7.62g of heroin. The heroin in the five exhibits formed the subject of the trafficking charge. 7 During the trial, a question arose over the weight of the drugs in the bowl. They weighed 456.51g at the CNB but only 442.4g at the HSA. Because of the discrepancy of 14.11g, the accused sought clarification on whether the drugs in the bowl were the same drugs that were subsequently analysed by the HSA and found to contain 7.80g of heroin. The accused claimed that the CNB’s weighing scale was calibrated to start from a negative figure equal to the weight of the plastic bag that the drugs in the bowl were emptied into. The plastic bag containing the drugs was then weighed to arrive at the reading of 456.51g. Therefore, he contended, this amount was that of the drugs alone as the weight of the plastic bag had already been accounted for.3Foot Note 3×NE Day 5 p119. 8 In response, investigation officer Michelle Sim explained that the bowl, the drugs it contained and the spoon were kept inside a Ziploc bag and taken to the CNB. When the exhibits were photographed at the CNB, the bowl and the spoon were removed from the Ziploc bag and placed on a piece of brown paper. The drugs were then poured from the Ziploc bag into the bowl before the photographs were taken.4Foot Note 4×NE Day 6 p5.After that, the drugs were poured back into the Ziploc bag. The Ziploc bag and the drugs it contained were then weighed to arrive at the reading of 456.51g. As there was no prior calibration of the scale, the reading was that of the bagandthe drugs. The bag and the drugs were then put into a larger bag and sent to the HSA. 9 HSA analyst Wendy Lim confirmed that she received the exhibit as packaged by the CNB.5Foot Note 5×Prosecution’s submissions at [13].She removed the larger bag and weighed the Ziploc bag and its contents, which reflected 457.82g (1.31g more than the CNB reading). She then weighed the Ziploc bag alone and noted that its weight was 15.38g. Therefore, the weight of the drugs alone was about 442.44g. Ms Lim said that the 1.31g discrepancy could be due to the fact that the weighing incidents took place at different locations and times and using different weighing instruments. Having heard the explanations, I was satisfied that there was no break in the chain of custody in relation to the drugs in the bowl and that the drugs weighed were those specified in the CNB’s evidence. 10 The prosecution relied on seven statements that were made by the accused.6Foot Note 6×Prosecution’s submissions at [14].In a contemporaneous statement made in the flat on 3 August 2011 at about 10.16pm, he said that he had something to surrender when he was asked if he had anything to surrender. After he pointed to the pigeonhole, he was asked what was there. He replied: “everything inside.” He looked nervous and sweated profusely. He also said that the shoe bag had “always been there” when he was asked who owned the shoe bag. He added that he was not feeling well, was suffering from withdrawal and declined to continue with his statement.7Foot Note 7×AB p252.On 4 August 2011 at about 3.25am (during the photograph-taking of the exhibits),8Foot Note 8×2 AB p4 and p23.Michelle Sim recorded an oral statement from the accused in her field book. He allegedly informed her that the drugs in the bowl were for packing and selling. In the cautioned statement on 4 August 2011 at about 3.28pm, he said: “I disagree with the charge above and find it very inaccurate. I could not think of anything else to say as I am feeling unwell.” The trafficking charge then alleged that he possessed for the purpose of trafficking six packets and one bowl weighing 2,237.97g of granular/powdery substances believed to contain diamorphine. 11 In a long statement recorded on 11 August 2011 at 2.25pm (“the first long statement”), the accused said that he collected two packets of heroin from his drug supplier, Abang. Each packet weighed about one pound. Shortly before his arrest, he sold one packet and poured the second packet of heroin into the bowl with the intention of packing it later. He denied knowledge of the four packets inside the dark blue plastic bag. The two small packets of heroin in the hanging compartment of the wardrobe were for his personal consumption. An extract of the first long statement reads: 3. On 2nd August 2011 at about 7pm or 8pm in the evening, I called my drug supplier Abang on his handphone and ordered 2 ‘batu’ of heroin from him. ‘Batu’ means a packet of heroin which weighs roughly a pound. I told Abang that I would pay him for 1 ‘batu’ of heroin upon the drug collection first and then pay the 2nd ‘batu’ of heroin later in the night. He agreed and we hung up. I did not tell him the price or the location to meet because this is not the first time I had bought drugs from him. 4. On 3rd August 2011 at about 5pm plus in the afternoon, Abang called me on my Nokia handphone and told me that my order is ready for collection. I told him okay and I would proceed to meet him at our usual place. Our usual meet up point for the drug collection would be at the void deck of Blk 687A Choa Chu Kang Drive. I then left my house and walked towards there. Along the way, I saw him driving a car and making a U-turn along Choa Chu Kang Drive. He then stopped along the roadside of Blk 687 Choa Chu Kang Drive which is a multi-storey carpark and I saw that there is a male Indian sitting at the front passenger seat of the car. I have never seen the male Indian before and he never introduced himself at all. He just opened the door and handed over to me a grey plastic bag. 5. When I took over the grey plastic bag, I also handed over S$5,300/- which are in denominations of S$50/- and S$10/-, all rolled and bundled up with a rubber band to the male Indian. I felt that the contents in the grey plastic bag were heavier than usual and I looked at Abang immediately who was at the driver’s seat. He then signaled that he would call me later. I agreed and we parted. Along the way home, I opened up the grey plastic bag and looked inside. I saw the 2 ‘batu’ of heroin which I had ordered from Abang earlier and another dark blue plastic bag which was folded neatly and its content could not be seen. I also received a call from Abang and he told me to hold on to his plastic bag and he would come and collect it later in the night when he collects the remaining money from me. I agreed and proceeded home. 6. After a 5 minutes walk, I reached home and took out the 2 ‘batu’ of heroin from the grey plastic bag and put it aside. I also took out the dark blue plastic bag from the grey plastic bag and put it in one of my cubicles of my wardrobe. I did not open to see the contents but I felt that it was heavy. My first guess of the contents in the dark blue plastic bag was that it could be Abang’s personal belongings. Then I thought it could be a decoy because previously when I bought drugs from him, he wrapped the drugs up in a rice packet along with packets of actual rice and packets of curry as well. I do not think that it was ‘batu’ of heroin because I did not order so many drugs as I could not afford it. I placed the dark blue plastic bag in the cubicle of my wardrobe because I just feel like keeping it there as Abang told me he would collect it back later. 7. I then made a call to one of my drug client Bob who had previously tried to order 1 ‘batu’ of heroin from me. That time, I do not have the drugs with me yet so I told him I would call him once the drugs is here. When he answered his handphone, I told him that the 1 ‘batu’ of heroin is here already and it would cost S$5700. He agreed and we arranged to meet at Hillview area in 30 minutes time. We then hung up the phone. 8. I then immediately repacked 1 ‘batu’ of heroin into a new packet because the existing one was tattered and some of the heroin might have leaked out from the packet. I did not weigh it at all. Therefore, I just pour the heroin from the 1 ‘batu’ of heroin into a new plastic bag and seal it manually using a lighter and my fingers. Then, I placed the ‘batu’ of heroin into a black and gold plastic bag and put it aside to be delivered later. After that, I emptied out the other ‘batu’ of heroin into a white metal bowl and I put it in the cubicle of my wardrobe because I intend to pack it later in the night when I return home. I then threw away the 2 plastic packets and the grey plastic bag but I could not remember if I had put them all together. 9. Shortly after, I left home with the black and gold plastic bag and took a taxi from below my house to the shophouses located at Jalan Remaja in Hillview area. I met up with Bob outside a 7-11 store and handed over to him the black and gold plastic bag which contains the 1 ‘batu’ of heroin. Bob then handed over to me S$5,700/- which are also in denominations of S$50/- and S$10/-, all rolled and bundled up with a rubber band. Bob did not open up to check the contents of the plastic bag because we were in a public place. We then parted and I took a taxi back home. 10. When I reached home, I called Abang on his handphone and told him that I have collected enough money to pay for the rest of my consignment which was the 2nd ‘batu’ of heroin. Abang told me that he is already nearby my house area and he told me to meet him along the main road near Blk 666 Choa Chu Kang Crescent which is in front of a 7-11 store. I agreed and I asked him if he wants to collect back his personal belongings but he say he would call me back later in the night. We then hung up the phone. I then took out S$400/- from the cash bundle that Bob had earlier given me and kept the money in my drawer of my room. That is the place where my girlfriend Sabrena and I would normally keep our money together. A short while later, I left home and walked towards our meeting place. 11. When I reached, Abang was already there along the roadside. This time, he was riding a blue and white scooter with a Malaysia plate which I could not remember the number. However, I could recognize that this was the bike Abang always rode to deliver drugs to me previously. I then passed the S$5300/- of cash to Abang and he left on the motorbike. I proceeded to walk towards Yew Tee MRT station because I wanted to buy dinner for myself. Along the way, I was arrested by a group of plainclothes officers who later identified themselves as CNB officers. 12. The officers then brought me to my flat at Blk 686B Choa Chu Kang Crescent #11-234 and entered the unit using my house keys. They also entered my rented bedroom using the same bunch of keys and a search was conducted. I informed the officers where I kept my drugs which is the ‘batu’ of heroin that had already been poured into the white metal bowl as well as the cubicle where I kept my syringes and paraphernalia as well as the 2 small packets of heroin which is meant for my own drug consumption. While going through my wardrobe, the officers found the dark blue plastic bag in the cubicle and they opened it to look inside. They then showed me the drugs in the dark blue plastic bag and I saw 4 ‘batu’ of heroin in it. It was also the first time that I had seen the contents of the dark blue plastic bag. 12 In the second long statement on 13 August 2011 at 3.45pm (“the second long statement”), the accused confirmed that the first long statement was true and correct. He maintained that he ordered only two packets of heroin and not six. He said that when the CNB officers showed him the four packets of heroin in the blue plastic bag in his bedroom, “I felt very surprised that the dark blue plastic bag actually contains so much heroin as I did not order it at all. Furthermore, I could not even afford to pay for so much drugs.” He went on to say that he worked as a part-time nightclub bouncer, earning $600-$700 a month. Occasionally, he also worked as a freelance odd job labourer earning about $100 per month (which he corrected during oral testimony to $100 per trip on average as it was a delivery job).9Foot Note 9×2AB p50.He rented a master bedroom for $750 a month in Cashew Road from April to June 2011, after which he moved out. He and his girlfriend then rented the master bedroom in the flat. 13 Further in the same statement, the accused said that in 2000, while in prison, he got to know Man. Sometime near the end of 2010, he happened to meet Man. He told Man about his financial difficulties and his drug addiction. Man offered him a solution, which was to sell drugs. That way, the accused could make some money and satisfy his drug habit at the same time. Man then introduced the accused to Abang, Man’s drug supplier, over the telephone. The accused told Abang that he would think about the matter first because he was still working as a part-time bouncer at that time and had an income. 14 The statement also recorded that sometime in May 2011, the accused was desperate for money to pay for his daily expenses and the rental.10Foot Note 10×2AB p51.He “then decided to sell drugs”. He called Abang and told him that he was interested to “find some work”, which meant selling drugs. They met to discuss. The accused described Abang as a short, chubby male Indian Malaysian. They communicated in Malay and agreed on the price of $5,300 for each “batu” (or pound) of heroin. From then until his arrest, the accused met Abang about once or twice a week to collect the drugs he had ordered. He would always order one or two “batu” of heroin on each occasion. Abang would deliver the drugs to him a day after the order near the accused’s home. 15 In the third long statement on 15 August 2011 at 3.10pm (“the third long statement”), the accused confirmed that the second long statement was true and correct. He said that he was feeling unwell and did not want to continue with the statement. He said his mind was not focused. He said he had been taking the medication prescribed by the Institute of Mental Health (“IMH”) doctor regularly but he could feel the onset of a nervous breakdown. Therefore, he declined to say anything else pertaining to the case.11Foot Note 11×2AB p52. 16 In the fourth long statement on 16 August 2011 at 11.05am (fourth long statement), the accused confirmed that the third long statement was true and correct. He said he was still unwell and did not want to continue giving his statement. Michelle Sim informed him that his urine instant test showed positive results for “opiates and benzo”. When asked if he had consumed any controlled drugs, he said that he had “nothing to say”.12Foot Note 12×2AB p53.He said he had “no answer” to many questions that were posed to him, including some about his trafficking of drugs. However, he said that his live-in girlfriend did not know about his drug activities. Asked if he had anything else to say pertaining to the case, he replied, “I was set up.” 17 Several doctors examined the accused after he was remanded. The day after his arrest on 4 August 2011, Dr Ng Yew Yee of Healthway Medical Group examined him at 3pm and 4.45pm (before and after his cautioned statement).13Foot Note 13×AB p99.In his medical report for the first examination, Dr Ng stated that the accused had no complaints and no hallucinations. His pupils were equal and reactive to light. There was no runny nose, tremors or other withdrawal symptoms clinically. In his medical report for the second examination, Dr Ng reported that the accused was alert and well. While he did not state if the accused experienced heroin withdrawal in his second report, he testified that he would have done so if there had been such complaints or the accused showed symptoms.14Foot Note 14×NE Day 2 at p46. 18 On the same day (4 August 2011) at 10.10pm, Dr Lim Hock Hin of Healthway Medical Group saw the accused after he complained of fever. He stated in his report that the accused complained of runny nose associated with abdominal pains and uneasiness.15Foot Note 15×1AB at p96.The accused felt that his withdrawal symptoms were coming. On examination, Dr Lim found that the accused was not feverish. Dr Lim further stated that the accused was suspected of suffering from withdrawal symptoms. He therefore certified him unfit for detention and referred him to the Accident and Emergency Department for further medical management. In court, Dr Lim said that the accused had only one sign of withdrawal, which was runny nose.16Foot Note 16×NE Day 2 p63.Runny nose and uneasiness were non-specific symptoms that could be due to causes other than heroin withdrawal.17Foot Note 17×NE Day 2 p52.He conducted a neurological examination on the accused and found him to be normal. For example, his pupils were not dilated.18Foot Note 18×NE Day 2 p60.He testified that if there were other symptoms and signs, he would have written them down.19Foot Note 19×NE Day 2 p63.He explained that his clinical judgment was that withdrawal was unlikely but he nevertheless erred on the side of caution and gave the accused the benefit of the doubt as the accused had a known case of heroin abuse, last took heroin the previous day, reported non-specific symptoms and claimed that withdrawal was coming.20Foot Note 20×NE Day 2p 60 l26. 19 The accused was examined by Dr Yeo Li Fang at the emergency medicine department of Alexandra Hospital on 5 August 2011 at about 1.37am. In her medical report, Dr Yeo stated that the accused complained of vomiting (which he claimed to be similar to his previous withdrawal) and inability to retain his oral intake. However, he did not have diarrhoea. He also claimed to have runny nose, restlessness and palpitations. There was no pilo-erection (goose bumps or hair standing on end) or sweatiness.21Foot Note 21×NE Day 2 p79.Dr Yeo also stated that the accused was well-hydrated with no tremulousness. His eyes were not red and no runny nose was seen. An electro-cardiogram showed a normal heart rhythm and rate. Dr Yeo made a diagnosis of gastroenteritis or infection of the intestines. There was no obvious clinical evidence of heroin withdrawal.22Foot Note 22×1AB p98.In court, Dr Yeo testified that she did not notice any sweatiness on the accused but she did not actually check for pilo-erection since he said he did not have that symptom. She said that she concluded that there was no obvious clinical evidence of heroin withdrawal because there was no obvious runny nose or restlessness and the electrocardiogram did not show a fast heart rate.23Foot Note 23×NE Day 2 p81.While vomiting is symptomatic of heroin withdrawal, that is a non-specific symptom that was inconclusive on its own.24Foot Note 24×NE Day 2 p83 and Prosecution’s submissions at [22]. 20 On the same day (5 August 2011) at about 6.30pm, the accused was sent to the prison complex’s medical centre for observation for drug withdrawal. On admission, he was examined by Dr Johnny Yeo. In his report, Dr Yeo stated that the accused exhibited signs suggestive of mild drug withdrawal. Dr Yeo testified that during the examination, the accused was quite talkative and had pilo-erection (the hair on the buttocks was erect).25Foot Note 25×NE Day 2 p29.He explained that when he used the word “suggestive” in his report, he meant that the accused could have mild withdrawal or nothing.26Foot Note 26×NE Day 2 p29.To him, the accused did not appear delirious and was quite calm. He appeared to understand what Dr Yeo was saying.27Foot Note 27×NE Day 2 p27.He appeared healthy, rational and sane. His abdomen was soft, which might not be the case if he had abdominal complaints such as diarrhoea or vomiting.28Foot Note 28×NE Day 2 p28.Dr Yeo said that there was not a lot of correlation between the level of drug consumption and the exhibition of distinct withdrawal symptoms because there would always be individual variations.29Foot Note 29×NE Day 2 p34.The variables include the type and amount of drugs taken and the duration of drug use. Individual idiosyncrasies could also come into play. 21 Dr Thevathasan Ivor Gunaseelan, the former Head of the Complex Medical Centre, discharged the accused from the prison medical centre on 8 August 2011 after examining him at about 10.35am. Dr Thevathasan said the accused’s three-day stay was standard practice for the observation of withdrawal symptoms. Not all individuals showed all the symptoms all the time.30Foot Note 30×NE Day 2 at p5.On 8 August 2011, he found no signs of withdrawal in the accused who was as normal as a person could be, with no signs of addiction.31Foot Note 31×NE Day 2 p9.He said that there were 17 observations made by nurses but no signs of any addiction in any of the comments.32Foot Note 32×NE Day 2 p19.The general feeling was that the accused was not in withdrawal during his three-day stay at the medical centre. 22 On 10 August 2011, the accused was examined by Dr Yogaratnam Jegan of the IMH. While he did not attend the trial as he had already left IMH and Singapore, his medical report and case notes were admitted with the defence’s consent.33Foot Note 33×Prosecution’s submissions at [25], AB at p322.The doctor observed that the accused did not exhibit any opioid withdrawal symptoms such as diarrhoea, body aches or runny nose at the time of examination. 23 Dr Kenneth Koh, a senior consultant at IMH, examined the accused on 22 August 2011 and 25 August 2011. Among other things, the accused said that at the time of the alleged offence, he was using 12g of heroin a day via the intravenous route. Dr Koh’s opinion was that the accused had opioid dependence, had a psychotic episode in the past (the accused was treated for possible drug induced psychosis in 2008) but had been free of psychotic symptoms for many years, was not of unsound mind at the time of the offence and was fit to plead.34Foot Note 34×AB p106.Dr Koh provided a further opinion dated 1 August 2014 after reading the report produced by Dr Munidasa Winslow and Dr Julia CY Lam, the accused’s psychiatrist and psychologist who examined him jointly. Dr Koh said that if the accused’s assertions about his drug use of 12g per day and his withdrawal symptoms were accepted, he would concur with Dr Winslow and Dr Lam that he had moderate to severe heroin dependence. However, he noted that the accused’s self-report of his withdrawal symptoms appeared discrepant from what was observed by the various doctors who examined him in the few days after his arrest.35Foot Note 35×2 AB p61.In court, Dr Koh testified that based on the evidence provided by the preceding doctors and assuming that the accused had not been telling the truth about his withdrawal symptoms, the withdrawal was a lot milder than what was asserted by the accused.36Foot Note 36×Prosecution’s submissions at [26]. 24 The accused had two bank accounts. He was the joint account holder of a POSB savings account with his older sister.37Foot Note 37×2AB p62.This account had a balance of $8.24 as of 3 August 2011 (the date of arrest).38Foot Note 38×2AB p69.He was also the joint account holder of a Maybank account with one Nornitan Abdul Ghani which had $12.41 as at 30 April 2011 (there were no transactions by the account holders from 1 January 2011 to 31 August 2011).39Foot Note 39×2AB at p70. 25 During the cross-examination of the accused, the prosecution also produced text messages that the accused sent from his mobile phone between April and June 2011 to his sisters, his step-father and his girlfriend. These messages included: DateRecipientMessage9 AprilSis 2nd lineDesperately in need of $30, can rtn 2nite, getting paid after 7-9pm. How ladies? Any takers?12 AprilSis 2nd lineNd to look for $ too…so many fucking probs..can rtn within 3 days, nd 30$..how? Anyone out there can help?12 AprilSis 2nd lineOk thnks, plse inform her, abt the 40$? That one can help? Pay u back the usual way, cash deposit.12 AprilSis 2nd lineHopefully so..but for now, wanna eat what?..haiz..tried evry1 already, nd a minimum of $40 to tahan me for 3 days till I get $..12 April1altitude-SabrenaIts really ok, don’t hv to, both of us nd to watch our spending. No work today so no $ cos of the changes in plans to take effect gonna take days…so watch yr dollar k love.14 AprilPapaTrip to msia postponed to 23rd but too late for me redo the schedule at work so I won’t b working n wld actually be extending my leave, but i’m a part-timer so it doesn’t count as annual leave, when I come back though, they might b offerring me a full-time position. In the mean time I need some money to survive, tried asking around already but nothing. Could you please loan me $50 till I get another part time job b4 I leave on 23rd. I might b leaving earlier 19th-20th though this is unbeknown to kale sue/ami aziz. Need to visit abah’s grave first as well as get original n official docs. Please help me this last time. Thanks Pa.17 April1altitude-SabrenaYup..won’t disturb u with smses k hun, left with $1+ in my topup, 2moro gonna look for $, like u said, things can’t get worse..1 MaySis 2nd lineSis, nd a favour, can let me use a 100 first, will pay u back end of week latest or 2moro, earliest. Nd it quite urgently to purchase something which is the very last piece n unable to reserve it…2 MaySis 2nd lineCall me back asap pls, nd to borrow 50 very urgently, will rtn it this wkend, payday.2 MaySis 2nd linePls help, nd to topup what I got to buy something I cld use, and it’s the last piece…I can’t reserve. I promise u’ll get back yr $ this wkend, if not Sat, then Sun, i’ll deposit as per usual. Thnks.9 May1altitude-SabrenaJust saw yr missed calls, was out earlier but got back like an hour ago but didn’t check my phone, don’t normally bring it with me when i’m doing short runs, take it u’re bz at the moment, ok, saw yr sms. Abt to leave agn in abt 2 min. What time do u start at 1 altitude, so that I cld give u a call just b4 yr shift starts or something, gonna b bz too. I know u’re kinda strapped for cash otherwise u wldnt b asking for it, is there anyway (i’ll try either to go down 1alt or wait for u to finish n reach BP..). I know u asked for 60, is it ok if pass u 50 first? Cos then that wld leave me with arnd 30+ n that’s enough till I get some more $ in another 4-5 days..leaving soon hun, carrying 2 phones arnd is a dead giveaway if the right kinda ppl r watching u, that’s why I don’t carry 2 or at least try not to.17 May1altitude-SabrenaAt the shop already, just realised got only 2$ left lol, so I bought small carrot juice n apple/cranberry juice, hope that wld do something..3 June1altitude-SabrenaSam said no to Sat..so how sweetie? U ok to lend me 200+ first to top up 1850 from my co.?21 JuneSis 2nd lineHi sis, after doing some calculations, I think I actually might need the $ in the bank for moving..if u really need it (for work) do u think u can use 50 first? Or if u wanna use 100, think u can pass it by end mth? I will b moving out within this week, maybe in the next 2-3 days..25 JuneSharmstersUrgent: Am moving house soon n need additional  $ for it. Not payday yet n can’t ask sis. Need at least 200 more but anything u can help me with is fine. Rtn next sat, payday.29 JuneHamzah-CashewI really need the money, please settle this quickly. Because of you I have spent a lot of money relocating, agents fee and on top of that, had to put up with low water pressure which you did on purpose. Since you are rich enough to rent out a whole executive flat, I am sure you can afford to pay me back my $90. Are you a man of your word? You are a shop owner, and have your own business. What is $90 to you? You agreed to pay this and I really need money to feed myself. Because of this, I don’t have enough to eat.29 JuneSharmstersSharmsters,, don’t forget k, I nd 300, see how much u can help me out with..btw, am staying at blk 686B cck cres30 JuneSis 2nd lineGood morning ladies, forgive me please for bothering you with this. As you both already know I hv shifted and in doing so, have incurred quite a bit of expenses. I still owe agent arnd 300+ (commission). Whatever that you can help contribute is really appreciated..please get back to me asap. Thanks. Syed.29 JulySis 2nd lineSis, nd to purchase something online now, can u trf $70 into posb acct, will trf back in the evening..",
        "The accused’s case": "26 During the trial, the accused did not deny that he was in possession of all the drugs in the trafficking charge. He said that he knew that they were heroin. However, he claimed that he possessed the four packets of drugs in the dark blue plastic bag and the drugs in the bowl for personal consumption.40Foot Note 40×Accused’s submissions at [4(a)]. 27 The accused started consuming heroin in 1999.41Foot Note 41×NE Day 4 p78.He was admitted to the drug rehabilitation centre twice, from 26 June 1999 to 16 August 2000 and from 13 December 2000 to 31 May 2002.42Foot Note 42×AB p331.On his first admission, his urine samples contained 10.97 and 10.69 micrograms of morphine for every five millimetres of urine (or 2.19 and 2.14µg/ml). On his second admission, his urine samples contained 17.23 and 13.94µgfor every five millimetres of urine (or 3.45 and 2.79 µg/ml).43Foot Note 43×AB p332. 28 From 2000, he started taking heroin on a daily basis. He started with straws of heroin but went on to consume in terms of packets. In 2000, one 8g packet lasted him two or three days.44Foot Note 44×NE Day 4 p79.From January to March 2011, he would spend about $1,800 a month on drugs if he was bringing home about $2,000 a month.45Foot Note 45×NE Day 4 p91.He relied on his income to support his habit. He lived simply and whatever money he had, he preferred to spend it on drugs. 29  From April 2011, he gradually increased his intake of heroin until he was taking roughly 12g to 18g of normal grade heroin a day around the time of his arrest on 3 August 2011.46Foot Note 46×NE Day 4 p95.He described the normal grade heroin as “coklat gelap” or dark chocolate, which contained upwards of 25g of heroin in a 442g packet (“the normal grade heroin”).47Foot Note 47×NE Day 4 p29.He clarified that he did not reach this rate of consumption, which would cost an estimated $5,000 a month, overnight.48Foot Note 48×NE Day 4 p95.In August 2011, his dependency level had got to the point where each use of heroin was just to delay the onset of withdrawal symptoms rather than to get high.49Foot Note 49×NE Day 4 p26.He was injecting himself every two or three hours.50Foot Note 50×NE Day 4 p103.When he had to work, he would smoke the heroin. When his urine was tested after his arrest, it contained 33.3µg/mlof morphine.51Foot Note 51×AB p82. 30 The accused claimed that he could afford to splurge on heroin from April 2011 as money was no longer an issue then.52Foot Note 52×NE Day 4 p84.He had obtained a cash advance of about S$20,000 from Ami Aziz, his uncle in Malaysia. The accused explained that he had a beneficial interest in the estate of his biological father, who died in 2006. The estate was yet to be realised but his interest was used as collateral to secure the advance from his uncle, whom he visited on 23 April 2011. He returned with the money – in cash – on 27 April 2011.53Foot Note 53×NE Day 4 p15.Besides the $20,000, he earned about $8,400, or an average of $2,100 a month, from April to July 2011.54Foot Note 54×NE Day 5 p102.After deducting his personal expenses of $500 a month and his share of the monthly rental of $500 a month (total of $4,000 in personal and rental expenses over four months), he had about $24,400 which he earmarked for buying heroin to sustain his addiction.55Foot Note 55×Accused’s submissions at p9, see (v). 31 He did not bank his money into the bank accounts. He preferred to have cash on hand. Despite having received the advance in late April 2011, he continued asking his sisters for money as borrowing was an old habit. He would ask for money using whatever reasons he could think of even if he was not in need of cash. For example, he asked them for money despite having already paid the agent’s commission for the room rental on 24 June 2011.56Foot Note 56×NE Day 4 p116. 32 When he thought that his advance was running out, the accused decided to switch from the normal grade heroin to “barang reject” meaning rejected thing (“low grade heroin”), which was cheaper pound for pound. The low grade heroin was of lower purity and lighter in colour than the normal grade heroin. He informed his drugs dealer, Man, who introduced him to Abang, a drug courier. On 25 July 2011, Abang called him and subsequently updated him regularly on the availability of the low grade heroin, which was hard to come by as it was not marketable. Abang charged $1,500 for a one-pound packet of low grade heroin. However, this price came with two conditions. The accused had to buy five packets of the low grade heroin and an additional one-pound packet of the normal grade heroin which cost $5,300. The accused agreed to buy the six packets, which cost a total of $12,800. That was the first time he acquired such a large quantity of drugs.57Foot Note 57×NE Day 4 p35.He did not know the exact purity of the low grade heroin, which would depend on luck, but thought he was “making a really good deal” at that point in time.58Foot Note 58×NE Day 5 p31. 33 On 3 August 2011, the accused met Abang to collect the six packets of heroin. He checked the plastic bags to ensure that he had all six packets (five light brown and one dark chocolate in colour).59Foot Note 59×NE Day 4 p37.As he only had about $8,000 on him, he paid Abang $7,500 first.60Foot Note 60×NE Day 4 p17.He poured one of the five packets of low grade heroin into the bowl.61Foot Note 61×NE Day 5 p34.To pay Abang the outstanding $5,300, he sold the packet of normal grade heroin to Bob for $5,700. Bob was one of his dealers but he bought the packet from the accused to help him out – they shared a symbiotic relationship.62Foot Note 62×NE Day 5 p5.That was the first occasion that the accused sold heroin to Bob and the only time he was involved in drug distribution.63Foot Note 63×NE Day 5 p7.64Foot Note 64×NE Day 5 p12.The accused then met Abang again to pay the outstanding $5,300. He was subsequently arrested. 34 The accused said that he would empty the low grade heroin into a bowl (as he did for one of the packets). He would use the spoon as a scoop and apportion the drug into small sachets for his own consumption. The weighing scale was for weighing the drugs in order to pack them. He used small packets to regulate his heroin intake.65Foot Note 65×NE Day 4 p19.He also weighed the drugs after receiving them from Abang to ensure that he received the right quantity.66Foot Note 66×NE Day 5 p35. 35  The two small packets of heroin in the hanging compartment of the wardrobe were not part of the accused’s purchase from Abang but leftovers from a purchase from Man which took place before the day of arrest.67Foot Note 67×NE Day 4 p98.They contained normal grade heroin and were part of a set of 10 packets that he had bought. On analysis, the two packets weighed 6.49g and contained only 0.17g of heroin, a lower purity than the alleged purity of normal grade heroin.68Foot Note 68×NE Day 4 p101.He explained that the makers of the product were not scientists. They would not blend and evenly distribute the heroin in each one-pound packet.69Foot Note 69×NE Day 4 p102. 36 The accused did not tell the CNB that the drugs were for his own consumption as he was in a state of panic and confusion, experienced drug withdrawal symptoms and wanted to distance himself from the four packets of low grade heroin. That was the first time that he had ordered so much drugs. When his contemporaneous statement was taken, he was confused, nervous and sweating profusely. He was in shock from the sheer amount of heroin that he was caught with and so had no ready answer for the CNB officer’s questions.70Foot Note 70×NE Day 4 p126.He denied informing Michelle Sim at the CNB that the drugs in the bowl were for packing and selling.71Foot Note 71×Ne Day 4 p104.For the cautioned statement, he was still in a state of confusion and going through drug withdrawal. He was panicking from the amount of heroin that he had been caught with and was trying to avoid giving any other statements.72Foot Note 72×NE Day 4 p128. 37 To distance himself from the four packets of low grade heroin in the blue plastic bag, he fabricated parts of his long statements to put across the story that he ordered only two packets instead of six. In the first long statement, he lied when he said, among other things, that the grey plastic bag felt heavier than usual.73Foot Note 73×NE Day 4 p41.He was fully aware that he was getting six pounds of heroin in total. He lied when he said that he thought the contents of thedarkblue plastic bag were Abang’s personal belongings or a decoy. While he did say that he poured a packet of heroin into a bowl as he intended to pack it later in the night on returning home, he clarified that the packing was for the purpose of consumption.74Foot Note 74×NE Day 4 p105.He also said that he was confused but was trying to conceal his confusion. He felt restless throughout the four hours over which the statement was taken and recalled having chills. He wanted to finish the statement-taking as soon as possible.75Foot Note 75×NE Day 4 p48. 38 For the second long statement, he confirmed that the first long statement was true and correct as he felt he had to maintain his earlier story.76Foot Note 76×NE Day 4 p51.He lied about being in financial difficulties and making arrangements with Abang to sell drugs. He did not meet Abang regularly. His first contact with Abang was on 25 July 2011 when he ordered the low grade heroin. They met only on the day of the accused’s arrest. The accused was not desperate to find money for daily expenses and rental as he had the cash advance from his uncle. When he gave the statement, he was again feeling restless and confused as he was still trying to maintain his earlier story.77Foot Note 77×NE Day 4 p60.For the third long statement, the accused explained that he told the interviewer he felt the onset of a nervous breakdown as his heart was pounding.78Foot Note 78×NE Day 4 p61.He again felt restlessness from on-going drug withdrawal. He still had body aches and was confused. He did not want to continue giving his statement as most parts were fabricated. For the fourth long statement, he did not respond to the question of whether he used controlled drugs as he believed his urine test result (33.3µg/ml) spoke for itselfand showed he was a heavy user.79Foot Note 79×NE Day 4 p134. 39 The accused said that if he was a trafficker, he would be stocking a variety of drugs. His mobile phone would be ringing off the hook and his phone contact list would reveal his activities. No straws of heroin were found on him. The presence of the two small packets of heroin in the hanging compartment, which were clearly for his consumption, supported the fact that the empty sachets were to be used to regulate his own consumption. He also pointed to the presence of drug-taking paraphernalia and the fact that more money would have been found on him if he was involved in trafficking.80Foot Note 80×NE Day 4 p63, NE Day 5 p46.The cash of $1,780.20 found in the computer drawer of the master bedroom and on the accused’s person was too small a sum to be drug trafficking proceeds.81Foot Note 81×Accused’s submissions at p16 – see (vii). 40 Dr Winslow, a senior consultant psychiatrist at Winslow Clinic and an adjunct professor at the National University of Singapore, interviewed the accused on 12 May 2014 for two hours with registered psychologist Dr Lam. They also reviewed the medical reports of the doctors who had seen the accused. In their joint report dated 15 May 2014, they stated that the accused reported being a heavy user of heroin who used about 12g of heroin daily to avoid withdrawal symptoms at the time of his arrest. His last “fix” before his arrest was at about 7-8pm. After his arrest, he experienced the following withdrawal symptoms: restlessness, joint discomfort, vomiting, yawning, anxiety, goose bumps, runny nose, urge to defecate, pain in the soles of the feet and difficulty in sleeping. The withdrawal symptoms lasted about five to six days. When he gave the first long statement, his thinking was “not there”. He felt the normal discomfort of heroin withdrawal, joint and back aches, restlessness and insomnia. The report stated that his “self-reported symptoms of moderate heroin withdrawal symptoms were consistent with his self-reported daily dosage (12g) of heroin consumed during that period”. The reported stated that based on medical literature, the severity and duration of opioid withdrawal were greater in users who injected rather than smoked heroin. However, the dosage and the method of intake, while related significantly to the severity of withdrawal, accounted only for about 50% of variance of withdrawal scores. Other psychological factors such as anxiety also played a role in the overall perceived severity of withdrawal. It was well-documented that there was a poor correlation between the amount of heroin consumed and the severity of withdrawal symptoms. The report concluded that the accused was heroin dependent at the time of his arrest. It was possible that his usage was 12g/day given his history and tolerance due to his daily injecting usage (since mid-2010). They noted the discrepancies between his self-reported symptoms and those observed in the medical reports of the doctors. However, their reading of the raw medical notes indicated “moderately severe withdrawal symptoms”. 41 At the trial, Dr Winslow testified that the accused’s self-reported symptoms put him somewhere between moderate and moderate-severe in terms of withdrawal.82Foot Note 82×NE Day 3 p28.However, based on the previous medical reports as well as the evidence given by the doctors who had testified earlier, Dr Winslow said that the accused would have suffered from mild to mild-moderate withdrawal at the most.83Foot Note 83×NE Day 3 p48.He agreed that mild symptoms such as runny nose were vague and indefinite and possibly due to other medical or physiological conditions. What persuaded him that the accused suffered at least moderate withdrawal symptoms werehisvomiting, nausea and inability to keep down fluids.84Foot Note 84×NE Day 3 p33.It is normal to have discrepancies between self-reported withdrawal signs and observed signs. Most doctors do not look for all the withdrawal symptoms or take into account the subjective symptoms and what they actually mean. For example, there may be no visible watering in milder cases of runny nose. 42 Each person varies in the withdrawal symptoms exhibited. Generally, the longer the period of heroin use and the greater the amount of heroin used, the more likely it is to have withdrawal symptoms.85Foot Note 85×NE Day 3 p7.However, this is not a perfect relationship. The correlation between heroin dosage and withdrawal symptoms is not very clear-cut. More than 50% of variations in symptoms are due to other reasons such as personality or expectations of help (eg, inmates may report fewer symptoms in prison as they know they will not get any medication while detoxifying).86Foot Note 86×NE Day 3p7.There were heavy heroin users with very mild withdrawal symptoms and relatively light users with all kinds of withdrawal symptoms. Those who inject heroin tend to feel the withdrawal symptoms more severely. Withdrawal symptoms generally peak in the first 72 hours after which the symptoms tend to moderate a bit.87Foot Note 87×NE Day 3 p34.Based on the accused’s symptoms, it was not possible to tell if he was taking more or less than 12g/day of heroin. Even if the accused had severe withdrawal symptoms, Dr Winslow would not be able to tell conclusively that he took 12g/day.88Foot Note 88×NE Day 3 p48.It was possible for users to take 12g of heroin a day but such users would be in the top 5% of users that he had seen. The main reason is that heroin is expensive.89Foot Note 89×NE Day 3 p49.Users who inject heroin generally develop tolerance which means they need more of the same drug to obtain an equivalent effect.90Foot Note 90×NE Day 3 p20.The amount of morphine in the accused’s urine sample when he was arrested would make Dr Winslow believe that the accused was consuming more heroin than on the first two occasions when he was caught and sent to the DRC. However, it was quite difficult to tell the correlation between the level of morphine in one’s urine and the level of consumption due to the variables involved. These include, for example, the time period between the last use of heroin and the urine test and the purity of the heroin taken.91Foot Note 91×NE Day 3 p54. 43 Dr Winslow also said that if a heroin user’s source was reliable, he would usually keep about one month’s worth of the drug to ensure that supply did not run out. If the supply line was erratic or he was unsure of his source, he could keep up to three months’ worth of heroin.92Foot Note 92×NE Day 3 p50.Most addicts who consumed heroin at higher levels needed to support their consumption habit by selling a portion of the heroin that they had bought to offset the cost of their own use.",
        "The decision of the court": "44 Under s 17 of the Misuse of Drugs Act (“MDA”), any person who is proved to have in his possession more than 2g of diamorphine is presumed to have had that drug in his possession for the purpose of trafficking unless he proves that his possession was not for that purpose. To rebut the presumption, the accused must prove that the five packets of low grade heroin (in the bowl and the dark blue plastic bag) were for his own consumption. 45 The accused had to show that he had a high level of consumption in order to account for the large amount of heroin in his possession. To do that, he would have to show that he could afford to sustain his alleged pattern of consumption of heroin. The prosecution attempted to show that the accused could not have afforded his alleged consumption level by comparing his income with his drug expenditure and living expenses in 2011. However, those matters happened quite some time ago and in fairness to the accused, he could not be expected to recall them with a great deal of certainty. Nevertheless, the general picture that emerged was that the accused had irregular jobs and was constantly in need of money. He could not therefore have sustained the alleged level of consumption of heroin. 46 Even if the accused was expecting some money from his late father’s estate in Malaysia, there was no evidence that he managed to secure the $20,000 advance from his uncle in late April 2011. His uncle would be able to testify about the alleged advance but he was not called as a witness by the defence. When asked why his uncle could not testify, the accused said that his uncle is a Malaysian and does not reside in Singapore. He said that when his uncle and his aunt visited him after his arrest in 2011, they were surprised and shocked that he had lived so frivolously and squandered his inheritance in such a way. He then said that he attempted to contact his uncle through his sisters but his sisters stopped visiting him since August 2014.93Foot Note 93×NE Day 4 pp 84-85.These explanations were hardly convincing. He could have asked his defence counsel for assistance in contacting his sisters in Singapore or his uncle in Malaysia. After all, he appeared to have no difficulty getting in touch with his uncle earlier in April 2011. The prison authorities here would probably have his uncle’s particulars too since he visited the accused in prison. I therefore accepted the prosecution’s contention that an adverse inference should be drawn against the accused on this point. 47 In any case, the bank account balances and the text messages mentioned earlier showed that the accused’s claim that he had enough money from May to early August 2011 to splurge on drugs was unbelievable. On his evidence, he collected the $20,000 towards the end of April 2011 and started spending the cash advance as he “gradually” increased his heroin intake. His case was not that he spent the whole amount at once. That being so, he would have several thousand dollars with him at any point in time between May and July 2011, especially in the earlier months, since he claimed he did not deposit the $20,000 in the bank accounts. However, the text messages depicted a person who was constantly scrounging for small loans to tide himself over. In April 2011, his text messages show that he was looking to borrow amounts as small as $30. Even after returning from Malaysia on 27 April, the situation did not change. The only inference was that he received no cash advance at all. The accused explained that he had cultivated a habit of asking for money by cooking up all sorts of reasons even if he had no need to borrow. He claimed that he would not mix money that he set aside for drugs with money for other expenses. These explanations were unbelievable given the urgent and even desperate tone of the messages as well as their content. He was practically begging for small amounts of money despite the alleged cash advance and his professed earnings of about $2,000 a month. 48 The accused’s case was that he decided to buy the low grade heroin as he thought he could stretch his dollar. The prosecution calculated that the five packets of low grade heroin would last him only 40 to 45 days despite costing about $167 to $188 a day. In contrast, one packet of normal grade heroin could stretch over 36 to 37 days despite costing $143 to $147 a day (at his professed intake of 12g of heroin a day).94Foot Note 94×Prosecution’s submissions at [49].The accused argued that such calculations could be derived only with the benefit of hindsight since he had no way of knowing the exact purity of the low grade heroin. However, there was no need for him to resort to detailed calculations to figure out that this could not be a good deal. As he said in court, low grade heroin was unmarketable and termed “barang reject”. To a heroin user, what counts is the purity and not mere bulk quantity. As a seasoned addict, the accused would know that if he switched to heroin that was less pure, he would have to consume a higher amount in order to achieve the satisfaction that he was accustomed to. He would be uncertain about how much longer the five packets of low grade heroin would last him compared to one packet of normal grade heroin. Since the accused claimed that he had the windfall from Malaysia, a fairly good income from his work in Singapore and a reliable source of normal grade heroin, it would be completely against common sense for him to think that he had a “good deal”. The accused has shown in court that he is a fairly intelligent person. He would not have made such a foolish deal, particularly when it required him to buy a packet of normal grade heroin anyway which he then had to sell for a profit of $400 in order to pay for the entire deal, thereby making him a trafficker when, as he claimed, he was merely a heavy consumer. 49 If the five packets of heroin were indeed purchased by the accused for his own consumption, why did he not tell the CNB at any point in time? In his CNB statements, the accused maintained that he had no knowledge of the four packets of heroin in the blue plastic bag. At the trial, he claimed to have fabricated material parts of his statements to distance himself from the four packets due to his panic, confusion and drug withdrawal.95Foot Note 95×Prosecution’s submissions at [84].I agreed with the prosecution that these could not account for his failure to mention the consumption defence despite having multiple opportunities to do so.96Foot Note 96×Prosecution’s submissions at [84].He last took heroin at about 7-8pm before his arrest at about 9.45pm on 3 August 2011. He told Dr Winslow that his withdrawal symptoms lasted about five to six days. Under cross-examination, he asserted that his drug withdrawal episode lasted until 9 August. This meant that even if he had suffered from drug withdrawal, the symptoms would have abated by 11 August when the first long statement was taken. Dr Yogaratnam, who examined the accused on 10 August, did not observe any withdrawal symptoms. Dr Winslow also told the court that heroin withdrawal symptoms would peak in the first 72 hours (ie, up to 6 August for the accused). While the accused could perhaps claim to be in shock and panic soon after his arrest, that could not be the case later on. The degree of elaboration in the first and the second long statements, whether fabricated or not, reflected a mental state that was far from confused. When the first long statement was recorded, he was even able to indicate in neat handwriting on the maps provided where he usually met Abang, where he collected the drugs on the day of his arrest and where he paid Abang for the packet of normal grade heroin. In the fourth long statement, he was asked specifically if he consumed drugs. Yet his reply was, “I got nothing to say.” 50 I accepted that the accused consumed heroin on a regular basis but it was certainly not at the level alleged by him. As I held above, he did not have the financial means to sustain that level of addiction. As Dr Winslow said, such a consumer would rank in the top 5% of all heroin addicts he had seen and the main barrier was financing. The accused sought to link his consumption level to his withdrawal symptoms, which he claimed were more severe than observed by the doctors who examined him in remand. Even assuming that the doctors had under-rated his symptoms, this did not necessarily mean that he was a heavy abuser of heroin. As Dr Winslow said, even a light user of heroin could experience all kinds of symptoms. The accused further sought to rely on the spike in morphine levels in his urine to support his claim that his heroin consumption had shot up compared to 1999 and 2000 when he was admitted into the DRC. Here again, the medical evidence was that such a correlation was not an easy one to draw. The interval between the last intake of heroin and the taking of the urine sample could affect the morphine level. Indeed, the accused said his last injection of heroin was at about 7-8pm. He was arrested a short while later at about 9.45pm. The accused also did not state in any of his statements that he was such a heavy heroin abuser. The claim that he injected 12g of heroin a day at the time of his arrest came only when he was examined by Dr Kenneth Koh on 22 August 2011 and 25 August 2011.97Foot Note 97×AB p106.He reported the same to Dr Winslow and Dr Lam close to three years after his arrest. While their report concluded that it was “possible” that the accused did use 12g of heroin daily, Dr Winslow testified that he was unable to conclude that the accused indeed consumed 12g a day. 51 Given that the accused was a heroin abuser, it was likely that part of the heroin that was found in the bedroom would have been used for his personal consumption. The question was how and whether such an apportionment could be made. InFung Choon Kay v Public Prosecutor[1997] 2 SLR(R) 547, the Court of Appeal held (at [19]) that the burden is on the accused to prove on a balance of probabilities that part of the heroin should be apportioned for self-consumption. In order to discharge this burden, he had to adduce credible evidence that part of the heroin was intended for his consumption. There also had to be credible evidence on how many days’ worth of the heroin was meant for his personal consumption as well as his consumption rate. Without such credible evidence, any apportionment would be conjectural and arbitrary. The accused’s case was that all five packets of low grade heroin (in the bowl and in the dark blue plastic bag) were for consumption. As I alluded to above, I did not find his case to be credible at all. The accused also claimed that the weighing scale and the empty sachets were for him to regulate his consumption. In my view, on the totality of the evidence, it was clear that they were used by him to repack the drugs for sale. The big packets of heroin had not been repacked by the accused into sachets at the time of his arrest because he had no time to do so. He was arrested within a few hours after collecting his stock from his supplier. The heroin that could fairly be attributed to the accused’s own use was that contained in the two sachets that were kept separately in the hanging compartment of the wardrobe. These two packets formed the subject of the second charge which was stood down (see [2] above). 52 The prosecution has proved its case beyond a reasonable doubt on the trafficking charge. The accused was unable to rebut the presumption in s 17 of the MDA by proving on a balance of probabilities that he possessed the heroin in the trafficking charge for his consumption. Accordingly, I convicted the accused on the trafficking charge. Upon his conviction on that charge and upon the application of the prosecution, I granted a discharge amounting to an acquittal under s 147 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) for the second, third and fourth charges. 53 If the accused could come within the criteria set out in s 33B of the MDA, he would be eligible for alternative sentencing and not have to suffer the death penalty. The facts showed that he was not a mere courier of drugs. He had the intention and the means of repacking the drugs he had obtained from Abang for sale to third parties. He therefore did not come within the ambit of either s 33B(2)(a) or (3)(a). The prosecution informed the court that the Public Prosecutor would not be issuing a certificate of substantive assistance under s 33B(2)(b). Further, the accused did not claim that he was suffering from such abnormality of mind as would have substantially impaired his mental responsibility at the time of the offence. He therefore could not satisfy the requirement in s 33B(3)(b) as well. As the accused could not meet any of the requirements in s 33B, I had no alternative but to impose the mandatory death penalty on the accused. I did so accordingly. I also ordered the exhibits to be disposed of after any appeal has been dealt with. 54 The accused has appealed to the Court of Appeal against his conviction and sentence.  Tay Yong Kwang Judge Wong Kok Weng and Krystle Chiang (Attorney-General’s Chambers) for the prosecution;Mahendran s/o Mylvaganam and Chitra Balakrishnan (Regency Legal LLP), and Christopher Anand s/o Daniel (Advocatus Law LLP) for the accused."
    }
}