{
    "case_title": "JP Choon Pte Ltd vLal Offshore Marine Pte Ltd",
    "ncitation": "[2016] SGHC 115",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 The plaintiff applied for summary judgment under O 14 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) against the defendant for a claim that arose out of a tenancy agreement. I granted its application in respect of eight of its prayers but granted the defendant unconditional leave to defend the remaining prayer. Being dissatisfied with the orders against him, the defendant has appealed.",
        "Background": "2 The plaintiff, JP Choon Pte Ltd, had been leasing out its premises located at 9A Tech Park Crescent (“the Premises”) to the defendant, Lal Offshore Marine Pte Ltd, a company carrying on the business of the building and repair of ships, tankers and other ocean-going vessels, since 11 September 2009. On 29 August 2013, the parties renewed the lease agreement between them and entered into the tenancy agreement that was central to the present proceedings (“the Tenancy Agreement”). It was agreed under the Tenancy Agreement that the Premises would be leased to the defendant for a term of two years from 15 September 2013 to 14 September 2015. 3 Problems arose in sometime in December 2013 when the defendant started defaulting on the rent and maintenance expenses that became due under the Tenancy Agreement. From August 2014 to May 2015, the plaintiff sent several reminders for payment to the defendant, to which the defendant responded by asking for more time. The plaintiff granted the defendant extensions on a few occasions (although it declined to do so on other occasions), but the latter was still unable to meet the payments. As of April 2015, the defendant owed the plaintiff a total sum of $479,943.75. 4 On 19 May 2015, the plaintiff’s business development manager, Mr Aw Jia Ming Eugene (“Mr Aw”), met with the defendant’s operations manager, Mr Vinod s/o Vijelal (“Mr Vinod”) at the plaintiff’s office. The parties provided different accounts of what transpired at that meeting (“the 19 May Meeting”). 5 The defendant’s account was that the parties reached a compromise agreement (“the alleged Compromise Agreement”) at that meeting, comprising the following terms: (a) the defendant would be allowed to pay the outstanding amount of $479,943.75 through (i) monthly instalment payments of $50,000 from June 2015 to February 2016; (ii) a payment of $14,971.90 in March 2016; and (iii) a payment of $14,971.85 in April 2016; (b)   the defendant would surrender the remaining lease under the Tenancy Agreement to the plaintiff; and (c) the plaintiff would utilise the security deposit of $132,000 that had been given by the defendant for the purposes of the reinstatement of the Premises or any repair or damage to the Premises. 6 The plaintiff, on the other hand, took the position that no agreement was reached at that meeting. Its account was that Mr Vinod had proposed the above terms at the meeting but the parties did not reach an agreement in respect of them. Mr Aw stated that he had explicitly told Mr Vinod (i) that he could not commit to any agreement in respect of the instalment payments without first consulting and seeking the approval of the plaintiff’s management; (ii) that the defendant should formally write to the plaintiff if it intended to terminate the Tenancy Agreement; and (iii) that the security deposit could not be used to offset the outstanding monies as it had to be forfeited under the Tenancy Agreement. 7 Both parties relied on particular pieces of correspondence that they subsequently exchanged to support their respective accounts. The first piece of correspondence was an email sent by Ms Helen Foo from the plaintiff to the defendant on the same day of the meeting to follow up. The plaintiff asserted that this was in line with its practice of documenting its correspondence with the defendant. The email was worded as follows: … During [the 19 May Meeting], Mr Vinod indicated [the defendant’s] intention for early termination of the [Tenancy Agreement] that will only expire on 30th September 2015 and further promised that [the defendant] shall settle all outstanding amount (rent in arrears, services charges and accrued interest) due to [the plaintiff] by instalment payment. Kindly provide us with a formal letter indicating [the defendant’s] intention as mentioned above together with the payment schedule for the suggested instalment payment for our consideration. Please also indicate when [the defendant] intends to hand-over the [Premises]. … 8 The following day (ie, 20 May 2015), the defendant sent a letter informing the plaintiff that it was no longer occupying the Premises and would be formally handing over the Premises at noon. The plaintiff regarded this as a repudiation of the Tenancy Agreement. 9 On 21 May 2015, the defendant sent another letter to the plaintiff, in which it made reference to the agreement that the parties had supposedly reached at the 19 May Meeting that it could pay the outstanding sums in instalments as set out at [5(a)] above. Mr Vinod stated that he did not have sight of the email sent by Ms Foo (at [7] above) before he sent these letters as the email had been addressed to the defendant’s main office email account as opposed to his personal account. 10 On 22 May 2015 (although the letter was dated 21 May 2015),  the plaintiff conveyed though a letter that it accepted the defendant’s repudiation of the Tenancy Agreement and demanded that the defendant pay the arrears, including interest, in full by 28 May 2015 or it would commence legal proceedings. Three days later, on 25 May 2015, the plaintiff sent another letter to the defendant, emphasising that the parties had not reached any agreement at the 19 May Meeting before reiterating its demand for the arrears to be paid before 28 May 2015. The relevant part of the letter read: … We have not agreed to, and are not agreeable to[,] your proposal of settling the outstanding payments by way of monthly instalments. … 11 On 28 May 2015, Mr Vinod handed over a cashier’s order for a sum of $50,000 to Mr Aw at the plaintiff’s office. The defendant argued that this evidenced the existence of the alleged Compromise Agreement, while the plaintiff asserted that it accepted the cashier’s order merely as part-payment of the arrears and stated that its Mr Aw had explicitly told Mr Vinod that the rest of the arrears had to be settled that same day. 12 A week later, on 5 June 2015, the plaintiff commenced the present suit against the defendant, claiming the following: (a) the rent and maintenance expenses that were allegedly owed by the defendant under the Tenancy Agreement, which amounted to $455,869.25 (“Prayer 1”); (b) interest on the sum of $444,340, which was the amount of rent that was allegedly owed by the defendant under the Tenancy Agreement, at a rate of 5.35% per annum, which was the average prime lending rate published by the Monetary Authority of Singapore (“MAS”) at the material time (or at any other rate that the court deemed just) from the date the sum became due and payable to the date of payment (or for any other period that the court deemed just) (“Prayer 2”); (c) interest on the sum of $11,529.25, which was the amount of maintenance expenses that was allegedly owed by the defendant under the Tenancy Agreement, at the rate of 2% per annum as set out in the invoices issued for the payment of the maintenance expenses (“the Invoices for Maintenance Expenses”) (or at any other rate that the court deemed just) from the date the sum became due and payable to the date of payment (or for any other period that the court deemed just) (“Prayer 3”); (d) interest on the sum of $826,820, which was the total monthly rent that the defendant was late in making payment, at the rate of 5.35% per annum for the period that the sum was outstanding (ie, $9,423.53) (“Prayer 4”); (e)    interest on the sum of $2,626.85, which was the total maintenance expenses that the defendant was late in making payment, at the rate of 2% per annum for the period that the sum was outstanding (ie, $11.26) (“Prayer 5”); (f) loss and/or damages arising from the early and/or premature termination of the Tenancy Agreement as a result of the defendant’s breaches and/or repudiation of the Tenancy Agreement, which would amount to $285,625.80 (“Prayer 6”); (g)  the estimated total costs and/or expenses incurred or to be incurred by the plaintiff in respect of reinstatement and/or repair works (“the Reinstatement Works”) to be carried out at the Premises in order to reinstate the Premises and/or repair any damage to the Premises (“Prayer 7”); (h) liquidated damages in the sum of $282,480, which was the total rent that the plaintiff would have received for the estimated duration that the Reinstatement Works would have to be carried out (“Prayer 8”); (i) a declaration that pursuant to cl 2.29 of the Tenancy Agreement, the defendant was liable for and/or under a duty to indemnify or contribute to the plaintiff for any further or additional costs and/or expenses that may be incurred in respect of any reinstatement and/or repair works to be carried out at the Premises and/or for any additional damages or losses that may be consequently incurred (“Prayer 9”); and (j) a declaration that the security deposit in the sum of $132,000 under the Tenancy Agreement was forfeited to the plaintiff and that the plaintiff was not liable and/or under any duty to repay and/or return and/or refund the same to the defendant (“Prayer 10”). 13 The plaintiff applied for summary judgment under O 14 of the Rules of Court on 9 September 2015. Although the plaintiff had applied for summary judgment to be given in relation to all the prayers listed above, it indicated at the hearing on 9 December 2015 that it no longer wanted to pursue this application in respect of Prayer 9 (set out at [12(i)] above). The plaintiff also asked that Prayer 7 (set out at [12(g)] above) be amended to reflect that the actual costs of the Reinstatement Works were $277,114.25.",
        "The law on summary judgment": "14 Under O 14, the court may grant summary judgment where: (a) the plaintiff has shown that he has aprima faciecase; (b) the defendant has failed to show that there is an issue or question in dispute which ought to be tried (ie, failed to show that there are grounds which raise a reasonable probability that he has a real orbona fidedefence in relation to the issues that he says ought to be tried); and (c) there is no other reason for trial of that claim (perO 14 r 3(1)). 15 The court must look at the complete account of events put forth by the parties in deciding whether the defendant has raised a triable issue (seeGohChok Tong v Chee Soon Juan[2003] 3 SLR(R) 32 at [25]). The mere fact that the defendant supports his defence by way of an affidavit does not mean that the court must accept the evidence as if it was probably accurate. The court must instead independently assess, having regard to the evidence as a whole, if the defence is credible and grant summary judgment only if it is satisfied that there is no reasonable probability that the defendant has a real orbona fidedefence in relation to the identified issues (Wee Cheng Swee Henry v Jo BabyKartika Polim[2015] 4 SLR 250 at [38]).",
        "The parties’ cases": "16 The plaintiff argued that summary judgment should be granted as the defendant had nobona fidedefence to its straightforward claim for outstanding monies under the Tenancy Agreement but was merely trying to convolute matters by making wholly untrue and baseless assertions. Its primary case was that the alleged Compromise Agreement did not exist and that the defendant had, by its letter dated 20 May 2015 (see [8] above), repudiated the Tenancy Agreement. It submitted that at best, the defendant might have unilaterally thought that they had entered an agreement but this would not assist the defendant’s case as no agreement could exist given that they were neverad idem. It further argued that in any event, the alleged Compromise Agreement, even if it existed, would be invalid for want of consideration as the promise to perform an existing contractual obligation does not amount to sufficient consideration as the promisee derives no additional benefit in law. 17 The defendant, on the other hand, argued that it had abona fidedefence to the plaintiff’s claim as the terms of the Tenancy Agreement had been superseded by the alleged Compromise Agreement. Its alternative defence was that even if the alleged Compromise Agreement did not exist, the plaintiff was estopped from demanding immediate payment of the sums as the elements of promissory estoppel were made out. The defendant also argued that there was a triable issue in respect of the plaintiff’s claims for interest and disputed the plaintiff’s entitlement to interest as well as the rate at which the plaintiff had computed the interest.",
        "My decision": "",
        "Overview": "18 After hearing the submissions of the parties’ counsel on 9 December 2015 and after considering a further round of written submissions that counsel tendered on my request, I granted summary judgment in respect of eight out of nine of the plaintiff’s prayers (Prayer 9 listed at [12(i)] above had been withdrawn) on 16 December 2015. I declined, however, to grant summary judgment for Prayer 10 (listed at [12(j)] above), where the plaintiff sought a declaration that the security deposit of $132,000 given by the defendant was to be forfeited to the plaintiff, as I was satisfied that the defendant had raised a triable issue that the clause in the Tenancy Agreement that the plaintiff was relying on (ie, cl 2.2.2) could be a penalty clause. 19 On counsel for the defendant’s request, I heard further arguments from both counsel on 21 January 2016 on the following two issues: (i) whether the Prayers 6 and 8 (listed at [12(f)] and [12(h)]) above overlapped as both covered the rent that the plaintiff would have been entitled to receive from the defendant during the period the Reinstatement Works were carried out; and (ii) whether the plaintiff’s submission on the costs of the Reinstatement Works (see [13] above) should be accepted. After hearing counsel’s further arguments, I agreed with the defendant on the first issue and varied my order in respect of Prayer 6 by reducing the amount awarded from $285,625.80 to $2,359.35. I did not accept the defendant’s submission in respect of the second issue. 20  Having set out the overview of my decision, I move on to give my detailed grounds in respect of the respective arguments and issues.",
        "The defendant did not raise a triable issue in respect of the plaintiff’s rights under the Tenancy Agreement": "21 Given that the plaintiff’s claim was entirely premised on the terms of the Tenancy Agreement, the defendant would succeed in resisting the summary judgment application if it successfully raised a triable issue as to whether the plaintiff was entitled to assert its rights under the Tenancy Agreement. As summarised at [17] above, the defendant put forward two alternative arguments in an attempt to show that such a triable issue existed. These were (i) that the alleged Compromise Agreement had superseded the terms of the Tenancy Agreement; and (ii) that the plaintiff was, in any event, estopped from claiming the sums. I was not convinced by either argument. The existence of the alleged Compromise Agreement 22 The defendant’s assertion that the parties had entered into the alleged Compromise Agreement was not reasonably or fairly capable of belief. The evidence put forward in the parties’ affidavits, in particular the series of correspondence exchanged between the parties (as set out at [7] to [10] above), showed instead that the parties’ negotiations did not culminate in an actual agreement. 23 I found it particularly significant that the defendant’s account was inconsistent with, and was contradicted by, a strong piece of contemporaneous evidence — the email that the plaintiff’s Ms Helen Foo sent to the defendant after the 19 May Meeting to record the parties’ discussion and to follow up from the meeting (see [7] above). The contents of the email were telling. It was recorded in this email that Mr Vinod had indicated at the meeting the defendant’sintention(as opposed to the parties’ agreement) for an early termination of the Tenancy Agreement and had promised to settle the outstanding sums through instalment payments. It would only be logical that any agreement reached by the parties at the meeting would have been recorded or at the very least mentioned in this email that was sent hours after the meeting. Yet, nothing in this email evidenced or suggested the existence of such an agreement. On the contrary, the fact that the plaintiff had asked the defendant to send it “a formal letter … together with the payment schedule for the suggested instalment payment for [its] consideration” demonstrated that no such agreement existed. There would be no need to tender a payment schedule if the parties had entered into the alleged Compromise Agreement, which included a detailed instalment plan (see [5(a)] above), and there would certainly be no need or no room for the plaintiff toconsiderany further if the parties had already reached an agreement. The contents of this email was, instead, consistent with the plaintiff’s account that the parties were in the midst of negotiating possible terms that may allow for a resolution of the dispute between them but had yet to settle on those terms or enter into any agreement. This was further supported by the plaintiff’s reiteration and clarification in its letter to the defendant dated 25 May 2015 that it “ha[d] not agreed to, and [were] not agreeable to” the defendant’s proposal to pay the arrears through instalments (see [9] above). 24 I also did not find the evidence relied on by the defendant to support its assertion that the alleged Compromise Agreement had been entered into credible or persuasive. The defendant principally relied on three pieces of evidence: (i) its letter dated 20 May 2015 in which it conveyed that it would be handing over the Premises to the plaintiff and the fact that it eventually handed over the Premises; (ii) its letter dated 21 May 2015 in which it referred to an agreement that the parties had purportedly entered into at the 19 May Meeting for the arrears to be paid through instalments; and (iii) its subsequent payment of $50,000 to the plaintiff on 28 May 2015, which it claimed was the first instalment payment pursuant to the alleged Compromise Agreement. I was not of the view that these pieces of evidence were, separately or collectively, capable of supporting its case that the alleged Compromise Agreement existed. The first and third pieces of evidence (ie, the handing over of the Premises and the payment of $50,000) could equally support the plaintiff’s position that the defendant had unilaterally repudiated the contract and that the payment of $50,000 was not made pursuant to the alleged Compromise Agreement but was made as partial payment of the arrears on the deadline that had been set by the plaintiff (see [11] above). As for the defendant’s reference to an agreed instalment scheme in its letter dated 21 May 2015, I agreed with the plaintiff that this at best indicated that the defendant had unilaterally believed that they had entered into such an agreement at the 19 May Meeting. The plaintiff’s email sent on the same day of the meeting clearly showed that the parties were neverad idemfor any agreement to have arisen. 25 Looking at the parties’ account of events and the affidavit evidence before me in totality, I found that the defendant failed to raise a triable issue that the plaintiff was not entitled to rely on its rights under the Tenancy Agreement for its claim because the parties had entered into the alleged Compromise Agreement. It had not shown that there was a reasonable probability that this could have been a real orbona fidedefence to the plaintiff’s claim. The defence of promissory estoppel 26 For similar reasons, I found that the defendant failed to raise a triable issue that the plaintiff was estopped from bringing the claim. The defendant’s argument in this regard was premised on the basis that the plaintiff had represented, at the 19 May Meeting and again on 28 May 2015 when it received the payment of $50,000, that it would not enforce its strict legal right to full payment. The defendant submitted that it would be inequitable for the plaintiff to go back on its promise, and that promissory estoppel could be invoked. 27 The defendant did not, however, put forward any credible or proper evidence to show that the plaintiff had represented that it would not enforce its legal rights. On the contrary, the evidence that militated against the existence of an alleged Compromise Agreement (as discussed at [23]-[24] above) also contradicted the defendant’s claim that the plaintiff had made such a representation either at the 19 May Meeting or when it received the payment of $50,000 from the defendant on 28 May 2015. At best, the evidence showed that the plaintiff was prepared to negotiate and consider the defendant’s proposal as at the 19 May Meeting. This could not reasonably be taken as a representation by the plaintiff that it would abandon or suspend its legal right to full payment. The defendant’s assertion that the plaintiff had made such a representation on 28 May 2015 by accepting the payment of $50,000 was even less persuasive when seen in the light of the correspondence between the parties, in particular the plaintiff’s emphatic statement in the letter it had sent on 25 May 2015 that it did not agree, and was not agreeable, to the payment of the outstanding sums through instalments (see [9] above). 28 It did not automatically follow from my finding above, that no triable issue had been raised as to whether the plaintiff could exercise its rights under the Tenancy Agreement, that the plaintiff was entitled to summary judgment of the entire claim that it had brought. I still had to be satisfied that the plaintiff had proven aprima faciecase that it was entitled under the Tenancy Agreement to the amounts or declarations claimed in the prayers and that the defendant had failed to raise abona fidedefence or a triable issue in this regard before I could grant the plaintiff’s application for summary judgment. It is to this issue that I now turn.",
        "The respective prayers": "Outstanding rent and maintenance expenses (Prayer 1) 29 It was undisputed that the defendant owed the plaintiff a total of $455,869.25 in rent and maintenance expenses under the Tenancy Agreement. Specifically, the defendant owed the plaintiff a sum of $444,340 for the rent that it had to pay for the Premises from November 2014 to May 2015, and a sum of $11,529.25 for the maintenance expenses that it had to pay from March 2014 to May 2015. It was thus clear that summary judgment should be entered in respect of this prayer. Interest sums (Prayers 2 to 5) 30 The plaintiff additionally claimed for the following interest sums in Prayers 2 to 5: (a) interest on the outstanding rent (ie, on the sum of $444,340) at the rate of 5.35% per annum, which was the average prime lending rate published by MAS at the material time; (b) interest on the outstanding maintenance expenses (ie, on the sum of $11,529.25) at the rate of 2% per annum, which was the rate set out in Note No 2 of the Invoices for Maintenance Expenses; (c) interest on the rent that the defendant was late in paying (ie, on the sum of $826,820) at the rate of 5.35% per annum; and (d) interest on the maintenance expenses that the defendant was late in paying (ie, on the sum of $2,626.85) at the rate of 2% per annum. 31 The plaintiff relied on cl 4.2 of the Tenancy Agreement for its claims for interest for rent in Prayers 2 and 4. Clause 4.2 stated as follows: … the Tenant shall pay to the Landlord on demand interest calculated base[d] on the prime lending rate of local Banks prevailing on the datepayment of any rent or any other monies due under [the Tenancy Agreement]from the date that the same is due up to the actual date of payment if the said monies remain unpaid for more than seven (7) days after the same are due (whether formally demanded or not). [emphasis added] 32 As for its claims in Prayers 3 and 5 for interest for maintenance expenses, the plaintiff relied on Note No 2 of the Invoices for Maintenance Expenses, which read as follows: Please settle the current balance within 7 days from [the] date of this invoice. If payment is not received by the due date a late payment charge of 2% will be levied on the outstanding balance from the due date to the date of receipt. It was not entirely clear from the wording of Note No 2 whether the interest rate was 2% permonthor 2% perannum. Although the plaintiff had taken the position in its earlier demands and reminders for payment of both the rent and maintenance expenses that the rate was 2% per month, its position in these proceedings was that the rate should be the lower (and less advantageous) rate of 2% per annum. 33 The plaintiff argued that the terms in the Invoices for Maintenance Expenses had been incorporated into the Tenancy Agreement by the course of dealings between the parties as the plaintiff had issued at least 30 such invoices to the defendant over a period of around two years and seven months (including a total of 18 invoices issued under the Tenancy Agreement itself). Its alternative argument was that it could, in any event, rely on cl 4.2 of the Tenancy Agreement to claim interest for the maintenance expenses as the words “rent or any other monies” in the clause were broad enough to encompass maintenance expenses. This, it argued, would allow it to claim the even higher interest rate of 5.35% per annum (which it was not seeking unless its argument that the terms of the Invoices for Maintenance Expenses was rejected). 34 The defendant argued that it had abona fidedefence to these claims as the plaintiff should not be allowed to claim interest after it had on numerous previous occasions waived its right to impose interest on the defendant’s late payments. It further contended that the plaintiff was not entitled to impose interest on the maintenance expenses as the terms of the Invoices for Maintenance Expenses had not been incorporated into the Tenancy Agreement. The defendant also took issue with the interest rate and argued that the plaintiff should not be allowed to claim interest at the rate of 5.35%, which was the average prime lending rate published by MAS at the material time. This was because the plaintiff had not used this rate in the past and had instead relied on the rate of 2% stated in its invoices. The defendant therefore argued that the plaintiff’s claim for the interest sums should be dismissed because (i) its claims for interest had been defective; and (ii) the plaintiff had failed to give the defendant sufficient notice of the interest rate that it had to pay. The defendant further argued that interest should only be charged on the base rent or maintenance expenses and not on the Goods and Services Tax (“GST”) component. 35 I was satisfied that the plaintiff had raised aprima faciecase and that the defendant had not raised any triable issue in respect of these four prayers. Clause 4.2 of the Tenancy Agreement entitled the plaintiff to demand interest not only for rent but for maintenance expenses. The clause applied to “rent or any other monies due under [the Tenancy Agreement]”. Maintenance expenses fell within the latter category as they had to be paid pursuant to cl 2.6 of the Tenancy Agreement. There was also nothing to suggest that interest was only to be charged on the base sum and not on the GST component. Without clear words from the clause, there was no reason for the two components to be segregated or distinguished in such a manner. 36 There was no merit to the defendant’s submission that the plaintiff was barred from asserting its rights under cl 4.2 because it had previously waived interest or had charged the wrong rate. The fact that the plaintiff had chosen not to enforce its contractual right to interest on previous occasions or that it had erroneously applied a wrong rate did not mean that it had given up its right or that it could no longer assert such a right in the future. This was also made clear from cl 4.6 of the Tenancy Agreement, which provided that “[n]o waiver whether express [or] implied or due to an oversight by [the Plaintiff] … shall operate as a waiver of any continuing or subsequent breach[es]”. Clause 4.7 further provided that any time or indulgence granted by the plaintiff was without prejudice to, and was not to be taken as a waiver of, its rights. Pursuant to cl 4.2, the plaintiff was thus entitled to interest at a rate of 5.35% forboththe rent and maintenance expenses that were outstanding and that were paid late. 37 I did not, however, consider it appropriate to apply a rate of 5.35% for themaintenance expensesas the plaintiff had claimed interest at the lower rate of 2% per annum (as opposed to the rate of 5.35%) in its statement of claim and in this application for summary judgment (see Prayers 3 and 5). For whatever reason — possibly because of its assessment of the effect of the invoices on such expenses, the plaintiff chose to assert a lower amount in relation to the maintenance expenses. In these circumstances, and given that I have found that the plaintiff had proven aprima faciecase and that the defendant had not raised any triable issue in respect of the four prayers, I granted summary judgment in respect of these prayers. Loss and/or damages arising from the early termination of the Tenancy Agreement (Prayer 6) 38 I also found that the defendant had raised no triable defence against the plaintiff’s claim for loss and/or damages arising out of its repudiation of the Tenancy Agreement. More specifically, the plaintiff was claiming for the rent and maintenance expenses that it would have been entitled to receive for the months of June to September 2015 if not for the defendant’s repudiation. The plaintiff had shown aprima faciecase that it had incurred these losses and that it had tried to find another tenant once it had notice of the defendant’s repudiation, but it was only able to do so in August 2015 and the new tenant was only able to take over in October 2015 after the Reinstatement Works had been completed. 39 Apart from asserting the existence of the alleged Compromise Agreement, the defendant had no other defence against the plaintiff’s claim for this item. I thus granted summary judgment in relation to this prayer. But as I indicated at [19] above, I varied the order of court in respect of this item by amending the quantum from $285,625.80 to $2,359.35 (ie, removing the rent component and awarding only the maintenance expenses for the period). After hearing further arguments from counsel, I accepted the defendant’s submission that this claim overlapped with Prayer 8 (see [42] below) given that both included the amount of rent for the period of June to September 2015. The claim for the Reinstatement Works (Prayer 7 as amended) 40 The defendant did not dispute the plaintiff’s entitlement pursuant to cl 2.29 of the Tenancy Agreement to recover the costs it incurred for the Reinstatement Works, but argued that the quantum submitted by the plaintiff was too high. It argued in further arguments (see [19] above) that it should be given a right to challenge the costs of the Reinstatement Works and that the quotations and invoices prepared by PJ Tech Pte Ltd (“PJ Tech”), the company employed by the plaintiff to carry out the bulk of the Reinstatement Works, should not be taken at face value. This was because PJ Tech and the plaintiff were related companies, with Mr Aw being a shareholder of both. The defendant went as far as to suggest that PJ Tech may not even have carried out any repair works. 41 I was not persuaded by the defendant’s submission and was of the view that it had not raised a triable issue in respect of the quantum that should be awarded for this item. Apart from a plain assertion that the quantum put forward by the plaintiff might have been too high or inaccurate, the defendant did not adduce a single shred of evidence to back its claim or show that it had a real defence in this regard. Its argument, that the quotations and invoices put forward by PJ Tech were not credible as the company was related to the plaintiff, was also not convincing in the light of the objective evidence put forward by the plaintiff. The evidence showed that PJ Tech had given the lowest quotation for the repair of the general damage to the Premises out of the quotations that had been submitted by three contractors. Liquidated damages for the rent during the period the Reinstatement Works were carried out (Prayer 8) 42 The defendant also failed to raise any triable issue in respect of the plaintiff’s claim for liquidated damages for the rent that it would have received for the estimated duration of the Reinstatement Works (ie, June to September 2015). I thus granted summary judgment in respect of Prayer 8. The declaration for the security deposit to be forfeited (Prayer 10) 43 I turn last to Prayer 10. I should state at the outset that this is not part of the appeal as I had decided this in favour of the defendant. 44 The plaintiff argued that it was entitled to forfeit the security deposit in the sum of $132,000 that had been given by the defendant under cl 2.2.2 of the Tenancy Agreement. Clause 2.2.2 provided that: Provided [a]lways the [security deposit] shall not be deemed to be treated by [the defendant] as payment of rent or other charges, andin the event the term hereby created is sooner determined by[the defendant] the said deposit shall be forfeited to [the plaintiff] absolutelybut the above shall not prejudice any right of action or other remedies of [the plaintiff] for the recovery of any rental monies, damages, loss and costs due to [the plaintiff] by [the defendant] for the earlier determination of the term hereby created or in respect of any antecedent breach by [the defendant] of any of the provisions of this tenancy[.] [emphasis added] 45 The defendant resisted the forfeiture of the security deposit on the basis that cl 2.2.2 was unenforceable as it was a penalty clause. The plaintiff argued that cl 2.2.2 was not a penalty clause, but was more akin to a clause requiring a deposit from the defendant to secure its due performance of its obligations under the Tenancy Agreement and could thus be enforced. The plaintiff also submitted that cl 2.2.2 could be distinguished from the clause providing for the forfeiture of the security deposit inLee Tat Realty Pte Ltd vLimco Products Manufacturing Pte Ltd and others and another suit[1998] SGHC 150 (“Lee Tat Realty”). InLee Tat Realty, the court had found that the said clause was a penalty clause because it was invoked as long as there was a breach of any of the covenants under the agreement. In contrast, cl 2.2.2 was far narrower and only catered for the specific situation of early termination by the defendant. 46 Despite the arguments put forward by the plaintiff, I was of the view that the defendant had, at the very least, raised a triable issue that cl 2.2.2 may be a penalty clause and thus could not be enforced. I thus granted unconditional leave for it to defend this claim.",
        "Conclusion": "47 For the reasons above, I granted the plaintiff’s application for summary judgment in respect of eight out of nine of its prayers (ie, Prayers 1, 2, 3, 4, 5, 6, 7 (as amended), and 8), but varied my order in respect of Prayer 6 after hearing further arguments from parties. As for the remaining prayer (ie, Prayer 10), I granted the defendant unconditional leave to defend as there was a triable issue as to whether the clause relied on by the plaintiff for the claim was a penalty clause. 48 I awarded costs fixed at $15,000 (excluding disbursements) to the plaintiff for the application as well as costs (inclusive of disbursements) fixed at $3,500 to thedefendantfor further arguments as it had succeeded in arguing that there was an overlap between the awards in Prayers 6 and 8. Aedit AbdullahJudicial Commissioner Wang Ying Shuang and Wong Jun Ming (Rajah & Tann Singapore LLP) for the plaintiff;Lalwani Anil Mangan & Raina Mohan Chugani (Lalwani Law Chambers) for the defendant."
    }
}