{
    "case_title": "Eastern Resource Management Services Ltd vChiu Teng Construction Co Pte Ltd",
    "ncitation": "[2016] SGHC 114",
    "coram": "Edmund Leow JC",
    "sections": {
        "": "",
        "Factual background": "3 The Plaintiff is Eastern Resource Management Services Ltd, a company incorporated in Bangladesh. It is in the business of training construction workers in Bangladesh to work in Singapore. The Plaintiff’s sole witness at trial was Mr Abul Monsur Ahmad (“Monsur”), a director of the Plaintiff as well as of a joint venture company called CTBF Management Services Pte Ltd (“CTBF”). 4 The Defendant is Chiu Teng Construction Co Pte Ltd, a company incorporated in Singapore. The Defendant is licensed by the Building & Construction Authority (“BCA”) to operate an Overseas Test Centre – CT Test Centre Pvt Ltd – in Dhaka, Bangladesh (“the OTC”). The OTC administers tests on potential workers to determine their fitness to work in the Singapore construction industry. The Defendant’s local partner in Bangladesh, an operational requirement of the OTC, is Bangladesh Foundry and Engineering Works Ltd (“BFEW”). After the BCA imposed quotas on testing of workers, the Plaintiff was the Bangladeshi agent of the Defendant for a time, in charge of managing the Defendant’s allocated quota for testing workers at the OTC on the Defendant’s behalf.1Foot Note 1×Para 14(b) of the Defendant’s closing submissions; para 16(b) of Cedric Ng’s AEICThe Defendant appeared to be affiliated to one CTTC Management Services Pte Ltd (“CTTC”), which was undisputed, though the details of how they were related were not canvassed at trial. The Defendant’s sole witness at trial was Cedric Ng Hark Li (“Cedric Ng”), the administrative manager of the Defendant. 5 In 2008, BFEW, the Plaintiff and the Defendant entered into an agreement2Foot Note 2×Page 3-6 of Agreed Bundle (“AB”)to work together on the testing of workers at the OTC (“the 2008 agreement”). This agreement was put into writing and signed by the Plaintiff and BFEW but not the Defendant. Nevertheless, pursuant to this agreement, the Defendant carried out its obligation and incorporated CTBF in Singapore.3Foot Note 3×Para 3 of SOC (Amendment No. 3)CTBF was incorporated on 4 February 2008 with a paid up capital of $10,000, and it was intended as a joint venture between the three parties regarding the management of the OTC. It was also expressly provided in the 2008 agreement that BFEW was not to have any share of the profits of CTBF.4Foot Note 4×AB 4Since 2009, after BFEW divested its shareholding in CTBF, Monsur held 49% of the shares as the nominee of the Plaintiff, while one Kor Khee Nghee (“Kor”) held 51% of the shares as the nominee of the Defendant.5Foot Note 5×Para 6 and 7 of SOC (Amendment No. 3), undisputedMonsur and Kor were also the directors of CTBF. Under the agreement, the Plaintiff was responsible for liaising with the Building and Construction Authority (“BCA”) on all training and testing matters assist in mobilisation of workers in Singapore.6Foot Note 6×Para 4(b) of SOC (Amendment No. 3), undisputed 6 On or about 17 June 2011, the Plaintiff and the Defendant also entered into another agreement7Foot Note 7×AB 223(“the 2011 Agreement”) where the Plaintiff agreed to forgo its share of the profits from CTBF with effect from the April Test 2011. There was also an agreement8Foot Note 8×AB 224on 6 July 2012 that was made between the parties (“the 2012 agreement”).",
        "Issues in dispute": "7 The parties disputed the material terms of the 2008 agreement, as well as the circumstances under which the 2011 agreement was signed. The key issues before me were as follows: (a) Whether various terms should be implied into the 2008 agreement; (b) Whether the 2008 agreement for splitting the direct testing fees of $345 per worker subsisted in light of the 2011 agreement such that the Plaintiff was entitled to future dividends of CTBF; (c) Whether the Defendant’s nominee director had been allowed to participate in management of CTBF and had been given the accounts and records of CBTF? 8 I note that the terminology used by the Plaintiff and the Defendant in this suit regarding the sharing of CTBF’s profits is not legally accurate as profits of a company are distributed by way of dividends to shareholders (see s 403 of the Companies Act (Cap 50, 2006 Rev Ed) (“the CA”)). It is entirely possible that profitable companies do not declare dividends for a particular year. It is also trite law that a shareholder has no right to the profits of a company (seeWalter Woon on Company Law(Tan Cheng Han SC gen ed) (Sweet & Maxwell, Revised 3rd Ed, 2009) at para 12.87). Having entered into these agreements without legal advice, I infer that the parties must have intended that CTBF and their representatives on the CTBF board would take all steps to realize this profit-sharing intention. Thus, I will take parties’ references to sharing of profits as a reference to payment of dividends.",
        "Whether various terms should implied into the 2008 agreement": "9 For the implication of a term into a contract, the threshold is a high one and the court can only do what is necessary to give effect to business efficacy, or what is so plain and obvious in its necessity that an officious bystander would have no doubt as to the inclusion of the term into the contract. The enquiry is also a highly fact-specific one as the court is only concerned with the presumed intention of the particular contracting parties (seeForefront Medical Technology (Pte) Ltd v Modern-Pak Pte Ltd[2006] 1 SLR(R) 927 in general). 10 The Plaintiff pleaded that it was an implied term of the 2008 agreement that Plaintiff and Defendant would act as equal parties and have equal say in the operation of CTBF. This was notwithstanding the fact that the shareholding structure of CTBF was 51-49 in the Defendant’s favour after BFEW had divested itself of its shares in 2009. I am not inclined to believe the Plaintiff’s account, because the 51-49 shareholding structure reflects the parties’ arrangement both in terms of dividends and voting rights, and this was an arrangement entered into consciously by the parties. The Plaintiff’s claim flies in the face of general company law principles. The Plaintiff has also failed to show the necessity of implying this term to ensure that CTBF can continue its operations. 11 The Plaintiff also pleaded that there was an implied term that the Plaintiff would be able to inspect books and accounts of CTBF, including primary documents such as the ledgers, books, vouchers and invoices.9Foot Note 9×Para 9 of SOC (Amendment No. 3)I agree with the Defendant that the Plaintiff has no such right under the CA by default as it is a mere shareholder of CTBF. It is for the company’s management not its shareholders to operate and manage the company. The general right of access to the company’s “accounting and other records” is thus available to directors, as a corollary of their supervisory role over the company (see s 199(3) of the CA). The shareholders will receive the company’s financial statements and balance sheets (see s 203(3) of the CA) but even then it must be noted that these do not include the items that the Plaintiff was seeking to inspect through implication of a term into the 2008 agreement,i.e., primary documents such as the ledgers, books, vouchers and invoices entitle have.  Again, the Plaintiff has also failed to show the necessity of implying this term into the 2008 agreement to achieve the purpose of the 2008 agreement or to ensure that CTBF’s operations run smoothly, especially when Monsur was already the Plaintiff’s representative on the board of directors and had access to these items. 12 I thus declined to give the Plaintiff an order for future access to books and accounts of CTBF.",
        "Whether the 2008 agreement for dividing the direct testing fees of $345 per worker subsisted in light of the 2011 agreement": "13 Direct testing was the practice of testing workers at the OTC without the workers having undergone training at BFEW’s training centre.10Foot Note 10×Para 17 of Cedric Ng’s AEICIt was undisputed that Clause 8 of the 2008 agreement dictated that out of the $525 direct testing fee paid to CTBF by each worker and/or their agent, $180 would be paid to BFEW as rental and the remainder $345 would be divided between the Plaintiff and the Defendant.11Foot Note 11×AB 5 - 2008 Agreement, Clause 8; Plaintiff’s closing submissions, para 5",
        "Proportion of division of direct testing fees": "14 Clause 8 of the 2008 agreement was silent as to the proportion of division of this $345. Parties disputed the division of this $345 per worker - the Plaintiff claimed that it was to be split equally, while the Defendant claimed that it was in proportion to the parties’ shareholding in CTBF. I note here that during the opening statement the Plaintiff’s counsel appeared to contradict the pleadings when he said that the Plaintiff just wanted the Defendant to pay the49%share of directing testing fees from June 2012 onwards.12Foot Note 12×NE Day 1 Page 39 line 11-15 15 I am of the view that the Plaintiff’s position on equal sharing of the dividends arising out of this $345, as pleaded, is untenable. The Plaintiff’s position was contradicted by firstly, the relative shareholding of the parties which would imply an uneven sharing of dividends (if any), and secondly, it was Monsur’s own admission that the parties intended to share profits in accordance with their relative shareholdings in CTBF:13Foot Note 13×NEs Day 1 Page 63 line 11-20 Q ---Mr Monsur, can I put it to you, therefore, that there was never any agreement, right, to divide the profits equally and they were to be divided, well, let me stop there first. There was never any agreement to divide the profits equally. A It is a CTBF Management Service Ltd. It’s 49% and 51%. Yah, this is the---er, er, profit sharing. Q Yes, okay. Thank you. So Mr Monsur, can I put it---further put it to you that the parties’ intentions at all times was to go in accordance with the shareholdings in CTBF. A Yes. 16 From Monsur’s evidence during cross-examination, it was also clear that at the time of the 2008 agreement, the Plaintiff was in a comfortable position and saw no need to quibble over 1% or 2% differences in dividends:14Foot Note 14×NEs Day 1 pp 58-59 Q So, is it equally, Mr Monsur? Do you have a problem with English? Do you understand what is --- A Well, I’m---I’m not--- Q ---“equally”? A ---no---no problem at, er---at all to understand in English. But I tell you al---all---all the time that, er, we are very---very comfortable position. We not fighting for 1 or 2 percent. But it’s means it’s equally. Q So--- A If it’s 1 or 2 percent but I’m agreed if they want to pay me less 1 or 2 percent, I’m---I’ll---I should not fight for that. 17 The Plaintiff’s claim of equal sharing arose only when the industry circumstances became unfavourable to the Plaintiff. When pressed for documentary proof that the parties were to share profits equally, Monsur was only able to point to Clause 8 of the 2008 agreement, which was silent on the proportion of division.15Foot Note 15×NEs Day 1 Page 60On a balance of probabilities, I find that the sharing of any dividends arising out of the testing fees was to be 49% for the Plaintiff and 51% for the Defendant in line with their respective shareholdings.",
        "Validity of the 2011 agreement": "18 In 2011, there was a significant change to the environment that the Plaintiff and the Defendant operated in – quotas were imposed by the Singapore authorities on the number of Bangladeshi workers that could be tested at OTCs. In turn, this altered the nature of their understanding in 2008, and so in May 2011, the Plaintiff, the Defendant and BFEW agreed on a quota arrangement for each company to test its workers at the OTC. BFEW had 40% of the quota given while the Plaintiff and Defendant each had 30% of the quota.16Foot Note 16×DB 30, NEs Day 1 Page 120Monsur was in charge of getting workers for testing on behalf of the Plaintiff, in order to fulfil the Defendant’s share of the quota.17Foot Note 17×NEs Day 1 Page 120 19 In June 2011, the Plaintiff and the Defendant then entered into another agreement between shareholders regarding CTBF’s profits, and they disputed the effect of this 2011 agreement on the original 2008 agreement in relation to the Plaintiff’s entitlement to CTBF’s dividends. The Plaintiff’s position was that the 2011 agreement was void for economic duress, lack of consideration, or lack of intent to create legal relations, thus the 2008 agreement remained valid and the Defendant had breached it18Foot Note 18×Plaintiff’s closing submissions, para 20. The Defendant’s position was that the 2011 agreement was valid;19Foot Note 19×Defendant’s closing submissions, paras 42-43the Plaintiff was entitled to share in dividends in the company up to the March Test 2011, because from April Test 2011 onwards, in accordance with 2011 agreement, the Plaintiff was no longer entitled to dividends from CTBF. I thus consider the validity of this purported 2011 agreement. 20 According to Monsur, on 17 June 2011, during a short meeting with Cedric Ng and two others representing the Defendant, one Ng Chee Hwa and one Benny Khor,  he was made to sign a document called “Minutes for Meeting on 17 June 2011” (“June 2011 Minute”).20Foot Note 20×Monsur’s AEIC, para 14The June 2011 Minute stated that from the April Test 2011 onwards, the Plaintiff had agreed not to enjoy “any revenue derived from CTBF”, and that the Plaintiff would pay to CTTC, the Defendant’s affiliate, $600for every worker passed.21Foot Note 21×AB 223The key part of the agreement that is crucial to the Plaintiff’s claim is the former part where the Plaintiff effectively agreed to forgo its share of dividends from CTBF, amounting to a variation of the 2008 agreement. This Minute was a record of a previous meeting between the same parties, on or around 15 June 2011.22Foot Note 22×Monsur’s AEIC, para 12It was Monsur’s evidence that the said Ng Chee Hwa had threatened to stop the registration of the Plaintiff’s workers, handled by the Defendant, if the Plaintiff refused to give up half its shares of profits in CTBF.23Foot Note 23×Monsur’s AEIC, para 13Cedric Ng and Benny Khor repeated this threat as well, and Monsur claimed that he felt very pressured as he would incur significant losses in Bangladesh if the Defendant followed through on its threat.24Foot Note 24×Monsur’s AEIC, para 13Monsur thus signed the June 2011 Minute, which was documentary evidence of the 2011 agreement. 21 The Plaintiff thus challenged the 2011 agreement, on the grounds that there was no intent to create legal relations, or that the agreement was void for failure of consideration, or in the alternative, that it was procured by duress. In gist, the Plaintiff is arguing that the 2008 agreement should not be treated as modified. Cedric Ng denied that he had threatened Monsur.25Foot Note 25×Cedric Ng’s AEIC, para 19 22 I note that the arrangement of the Plaintiff agreeing to forgo its dividends from CTBF appears to make no sense legally in the company law context. However, I am aware that parties were dealing with this commercially without the aid of legal advice. I understand the real arrangement to be that CTBF as the joint venture would cease to receive revenue from testing fees under the new 2011 agreement. These fees would be directly paid to the Defendant’s affiliate, CTTC. 23 The 2011 agreement has two clauses, and the one in dispute which is the subject of the Plaintiff’s claim is the first clause. I will thus consider the arguments made in relation to that. I am of the view that the 2011 agreement is valid in that regard, and the Plaintiff is bound by what Monsur had signed. 24 I reject the Plaintiff’s argument on duress. Substantive requirements aside, this defence was not clearly pleaded by the Plaintiff.  MPH Rubin J observed in the High Court decision ofLee Kuan Yew v Chee Soon Juan[2003] 3 SLR(R) 8 that the defence of duress had to be specifically and carefully pleaded. This was certainly not done by the Plaintiff – the material fact of duress was merely alluded to in one line in its Reply. Phillip Pillai J also rejected a suggested defence of economic duress on the basis that it was not pleaded inLim Chin San Contractors Pte Ltd v Shiok Kim Seng (trading as IKO Precision Toolings)[2011] 1 SLR 433. However, the lack of specific pleading is not the main ground on which I reject the Plaintiff’s argument on duress. On the evidence presented before me, I am not convinced that the Plaintiff had proved the fact of duress. Economic duress has been acknowledged as a separate and distinct vitiating factor that could render a contract voidable (seeE C Investment Holding Pte Ltd v Ridout Residence Pte Ltdand another (Orion Oil Ltd and another, interveners)[2011] 2 SLR 232 at [46]) but it must also be noted that the doctrine will be applied only in exceptional situations (see Andrew Phang Boon Leong,The Law of Contract in Singapore(Academy Publishing, 2012) at para 12.020). It has to be shown that there was illegitimate pressure applied by one party, and that it was a but-for reason for the person entering into the contract (seeSharon Global Solutions Pte Ltd v LG International (Singapore) Pte Ltd[2001] 2 SLR(R) 233 in general). The burden is on the party raising it to show that the duress put him in a position where he was compelled to accede to the demand. The threshold for using duress as a defence to a contract is high, and fact-specific, and I am not convinced that the Plaintiff had met it. All we have is Monsur’s bare claim in his AEIC that he was threatened. While Monsur said he regretted signing the June 2011 Minute, he only sent the first email of apparent protest in 22 September 2011, three full months after he signed it. Even then, this email of 22 September 2011 did not mention anything regarding the June 2011 Minute nor were there allegations of duress; it only beseeched Ng Chee Hwa of the Defendant to follow the 2008 agreement, and there was no mention of anything in June 2011. The only inference that could be drawn from that was that Monsur had regretted signing the June 2011 Minute. In the subsequent email exchanges between the parties, there was also no mention of Monsur being coerced in June 2011. I accept that the emails evidenced some kind of disagreement between them, but that is not sufficient to show duress. Disagreement among business partners is not uncommon. Even if threats were made, it was not evident that they sufficiently overborne his will and alone caused Monsur to make the agreement. Monsur had not made much reference to the potentially adverse effects of not agreeing, other than there would be financial consequences in Bangladesh. It is unclear if the Plaintiff would be able to have their workers registered with other companies than with the Defendant,i.e., that the Plaintiff had no alternative but to accede to the Defendant’s demand. The evidence is insufficient to conclude either way. In any case, the Plaintiff appeared to have acquiesced and performed the part of the agreement that required the Plaintiff to pay to the Defendant’s CCTC $600 per worker that passed the test, from the invoices addressed to the Plaintiff, with markings showing “39 x $600” and the description being fees for April 2011 Test.26Foot Note 26×DB 32-39There does not appear to be contemporaneous protest against the invoices, and the first email suggesting so was only on 24 November 2011.27Foot Note 27×AB 134Monsur was unable to give an account of the right sums that should have been invoiced to him either, in response to my questioning:28Foot Note 28×NEs Day 1 pp175-176 Court: ---from the defendant and you don’t agree with it. So what is your version of the correct calculation? I mean, do you---do you have a calculation that you can---that you can produce, that you think is correct? Witness: If you---er, you---Honourable Judge, if you see that---on that performed agreement, up to this, er, $10,000, I never paid any amount. On the $350 sum ac---accounts paid for what, I don’t know, Sir, I forget. Only one amount paid, twenty (indistinct) dollars. After---after that, actually comes on settlement on, er, 2012 May. Court: Okay, but anyway you don’t have a calculation? I mean, you don’t have your version of this? I mean--- Witness: Er, my version was the $300. Court: No, no, no. But your version in a sense of showing the, you know, the correct amounts to be charged, the correct amounts that were paid and so on. Witness: I write email to them, many emails, that, er, co---correct the bill correctly that, er, $600 is not--- Court: No, you asked them to correct it. But you didn’t produce any numbers. Witness: Because the---no, I ne---I never produce. Because the---the tested, er, accounts with them---we---we---which---which---which you think. How many worker we tested, how many worker passed. Actually, based on passed worker. So numbers is belongs to them---with them. Court: So you don’t have any numbers? Witness: Er, we---we don’t have any number. […]  25  I found it difficult to believe that the Plaintiff had not kept track of the amounts that it was purportedly overcharged, if it truly protested the validity of the June 2011 Minute. I accept that Monsur may have regretted entering into the 2011 agreement in face of commercial pressures at the time, and subsequently realized that he struck a poor deal for the Plaintiff, but that alone cannot amount to duress. 26 Secondly, I am unconvinced by the Plaintiff’s claim that there was no intent to create legal relations when the 2011 agreement was made. The test is an objective one when it comes to ascertaining intent to create legal relations (seeChia Ee Lin Evelyn v Teh Guek Ngor Engelin née Tan and others[2004] 4 SLR(R) 330 at [43])– the court has to evaluate this claim against available evidence since it is impossible to ascertain Monsur’s subjective state of mind except by circumstantial evidence. In relation to agreements made in a commercial context, there is a presumption in law that the requisite intention to create legal relations is present unless there is clear evidence to the contrary (Gay Choon Ing v Loh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332 at [72]). On the facts, I am of the view that the Plaintiff has failed to rebut this presumption. Monsur clearly understood the consequences, however unfavourable, of signing the June 2011 Minute, as evidenced by his attempts to renege on it from September 2011 onwards. His claim that he did not think the June 2011 Minute would be binding on the Plaintiff was only made in an email to the Defendant in June 2012, a full year after the Minute was signed.  Another piece of evidence that goes against the Plaintiff’s claim is Monsur’s email dated 12 October 2011 to Cedric Ng stating that since he would not enjoy profits from CTBF from April 2011, he wished to resign from the company.29Foot Note 29×AB 126This shows that Monsur clearly regarded the 2011 agreement as binding. It is unclear why Monsur did not eventually resign from the company. 27 Thirdly, I am not convinced by the Plaintiff’s argument that there was no consideration offered in relation to the 2011 agreement. In June 2011, the 2008 agreement was clearly not as viable as it seemed in 2008; the quota on testing of workers had been imposed by BCA and I infer that the profitability of this arrangement for both parties must have been greatly reduced. I am not convinced by the Defendant’s argument either that the consideration for the 2011 agreement was that the Plaintiff got $100 per worker for the 868 workers tested by the Defendant from April 2011 to May 2012.30Foot Note 30×Plaintiff’s closing submissions, para 55This was the product of the 2012 agreement, which occurred a full year later. Cedric Ng appeared to contradict the Defendant’s position during cross-examination by admitting that when the June 2011 Minute was signed there was no intention to give the Plaintiff consideration.31Foot Note 31×NEs Day 2 Page 51 line 13-32In my opinion, consideration is a legal concept that can be somewhat artificial in the context of businessmen negotiating without legal advice. I am of the view that the 2011 agreement is a variation of the 2008 agreement, and it was made with the 2008 terms in mind. The parties clearly benefited from the 2011 agreement, if not there would be no other reason why they continued to work with each other regarding testing quotas till 2014. Consideration had been given in the sense that the Defendant continued with the arrangement under the 2008 agreement instead of terminating the agreement, which was the Defendant’s right. For reasons which I will explain below, the 2008 agreement was not a perpetual one. Also, the Defendant took over the sourcing of direct testing workers to fulfil its allocated quota for testing at the OTC, from the time of the April 2011 Test.32Foot Note 32×Cedric Ng’s AEIC, para 18; NE Day 2 Page 28 line 11-15The Plaintiff, on the Defendant’s behalf, previously handled this.  In my view, this is sufficient consideration for the 2011 agreement. 28 I also note that parties made reference to an agreement in 6 July 2012, where the Plaintiff and the Defendant reached a compromise agreement over sums owing by BFEW and the Plaintiff to the Defendant for the OTC fees.33Foot Note 33×AB 224To me, it is evidence to me that parties would periodically vary the agreement as the circumstances change. It is obvious that their industry is subject to frequently changing regulatory conditions in Singapore and also possibly in Bangladesh. I am thus unable to accept the Plaintiff’s alternate argument that the 2008 agreement was a perpetual one since it had no termination clause. I am of the view that it could not have been the intention of the parties, because it makes no sense from a commercial perspective. 29 I also find the Plaintiff’s position on the 2008 and 2012 agreement rather contradictory. The Plaintiff claimed that it had been paid half its share of the direct testing fees until May 2012, which leaves the share from June 2012 onwards unpaid.34Foot Note 34×Plaintiff’s closing submissions, para 56Given that the 2012 agreement was made with the 2011 one in mind, for the Plaintiff to accept certain terms and benefits of the 2012 agreement, it would also have to presuppose, to an extent, the validity of the 2011 agreement. It thus makes no sense that the Plaintiff is attacking the validity of the 2011 agreement, when it clearly benefited from and accepted the 2012 agreement which is in effect a variation of the 2011 one. 30 Thus, I decline to find that the Defendant is in breach of the 2008 agreement.",
        "Plaintiff’s entitlement to dividends from 2012 onwards": "31 The Plaintiff’s claim for its share of direct testing fees for 2012 onwards is presumably on the basis of the dividends that it should have received under the 2008 agreement. Insofar as the dividends were issued for 2009 to 2011, they had been paid to the Plaintiff. CTBF had distributed dividends to the Plaintiff by way of cash cheques addressed directly to Monsur in 2009, 2010 and 2012, as proven by the letters addressed to Monsur and the corresponding cheques.35Foot Note 35×AB 32-65The payment in 2012 was for the financial year that ended in January 2012.36Foot Note 36×AB 64-65From 2012 onwards, given my finding that the 2011 agreement stands, the Plaintiff no longer has any entitlement to its share of profits from testing fees. In this aspect I also note that the Plaintiff as shareholder continued to receive CTBF’s annual accounts in 2012 and 2013, and Monsur had signed the 2012 and 2013 reports.37Foot Note 37×AB 42 and AB 70If the Plaintiff did not accept validity of the 2011 agreement regarding the varied profit-sharing arrangement, I find it difficult to believe that Monsur would have signed the reports. 32 In any case, even if the dividends were issued but not paid to the Plaintiff, the right cause of action would not lie in claiming damages, and I note that CTBF is not party to the suit by virtue of the second amendment to the Statement of Claim. The parties did not discuss the company law aspects of the case, and given my finding of the validity of the 2011 agreement, the issue of the correct cause of action falls away. 33 On the whole, I am of the view that both parties were under a certain degree of commercial pressure to re-negotiate certain terms that were agreed to in 2008, before BCA quotas took effect in 2011. I accept that Monsur may have regretted signing the June 2011 Minute, but such is the nature of the bargain that Monsur had struck for the Plaintiff at that juncture, and the Plaintiff is bound. It is not the role of the court to rescue the Plaintiff from poor commercial decisions. 34 Thus, I decline to grant the order sought by the Plaintiff that it is entitled to a 50% share of CTBF’s dividends so long as it remains a shareholder. I also decline to grant an account of profits from the Defendant as to the revenue and profits from 2012 onwards.",
        "Whether Monsur had been allowed to participate in management of CTBF and given the accounts and records of CBTF?": "35 I am of the view that the Plaintiff’s claim that Monsur, as their representative on the board of CTBF, had been excluded from management of CTBF and not given the accounts and records of CTBF cannot stand, having reviewed the evidence. 36 Despite his claim that he had been excluded from management of CTBF since April 2011, Monsur contradicted himself at one point when he admitted that up till July 2012, he had management control over CTBF.38Foot Note 38×NEs Day 1 Page 131 line 5Furthermore, it appeared that Monsur had not asked to see the accounting records39Foot Note 39×NEs Day 1 Page 142 line 17but he signed on CTBF’s financial reports of 2012 and 2013.  From the evidence, the Plaintiff as shareholders continued to receive CTBF’s annual accounts in 2012 and 2013, and Monsur had signed the reports.40Foot Note 40×AB 42 and AB 70The Defendant had also sent the 2014 accounts to the Plaintiff’s solicitors for Monsur’s signature, but it appears from the correspondence that Monsur refused to sign them. In the Defendant solicitor’s letter of 1 December 2014, it was stated that CTBF’s supporting accounting documents would be made available to Monsur as a director of CTBF for his inspection so that he could sign off on the financial statements, but it appears that he did not make such arrangements.41Foot Note 41×AB 221Monsur was unable to offer a plausible explanation for why he had not made such arrangements other than that he thought the lawyers could handle it.",
        "Conclusion": "37 For the reasons given above, I dismiss the Plaintiff’s claim in totality. 38 The Plaintiff is pay the Defendant’s costs. I also note that the Plaintiff amended his Statement of Claim at the end of Day 1 of the hearing. The amendment was to alter the reliefs claimed, and in essence delete some of the previous claims.42Foot Note 42×Compare SOC (Amendment No. 3) to SOC (Amendment No.2)There were effectively withdrawals of claims, and I am of the view the Plaintiff should also pay the Defendant costs thrown away in relation to the deleted claims in the amendment that were not pursued at trial. Edmund Leow Judicial Commissioner  Andrew J Hanam (Andrew LLC) for the plaintiff Chew Yee Teck Eric (ECYT Law LLC) for the defendant"
    }
}