{
    "case_title": "La Dolce Vita Fine Dining Co Ltd and anothervDeutsche Bank AG and another and another matter",
    "ncitation": "[2016] SGHCR 3",
    "coram": "Tan Teck Ping Karen AR",
    "sections": {
        "Introduction": "1 The two Originating Summons (“Applications”) are the plaintiffs’ application for discovery against the respective defendants who are non-parties to the dispute between the plaintiffs and Zhang Lan (“Founder”). 2 The 1st plaintiff (“Buyer”) and the 2nd plaintiff (“Investor”) are majority owned by the CVC Group (a private equity group) which consist of CVC Capital Partners SICAV-FIS S.A. and its subsidiaries (“CVC”). 3 The 1st defendant in OS 305 is Deutsche Bank Aktiengesellschaft (“DB”). The 1st Defendant in OS 307 is Credit Suisse AG (“CS”). Both are banks in Singapore. 4 The 2nd defendant in each of the applications is Success Elegant Trading Limited (“SE”), a company incorporated in the British Virgin Islands. The Founder held the sole share in SE till 4 June 2014 when she transferred this sole share to Asiatrust. 5 The plaintiffs believe that the Founder may have transferred to third parties all or part of funds paid to the Founder arising from transactions which are alleged to be fraudulent. As the plaintiffs believe that SE is owned by the Founder, the plaintiffs seek documents relating to SE’s accounts in the respective banks in the Applications to assist them to trace these funds. 6 As customer information is being sought from the respective banks, the plaintiffs seek an order of the Supreme Court or Judge for disclosure of the documents under one of the exceptions within the Third Schedule of the Banking Act.",
        "Background Facts": "7 The Investor is the majority shareholder of Dolce Vita Fine Dining Holdings Limited (“EquityCo”). 8 The Buyer is owned 100% by EquityCo. 9 The Founder is the 100% owner of Grand Lan Holdings Group (BVI) Limited (”Founder Holdco”) and South Beauty Development Limited (“Management Holdco”). 10 By way of a series of transactions, the plaintiffs acquired shares in a food and beverage business owned by the Founder and other companies owned or controlled by her (“Acquisition”), details of which are as follows: (a) The Buyer purchased all the shares in South Beauty Investment Company Limited (“Company”), a Cayman Islands company which was in the restaurant business in China from Founder Holdco and Management Holdco (collectively “theSellers”) for the total consideration of US$235,066,678 which was paid into the Founder’s Hong Kong Bank Account (“Founder’s Hong Kong Bank Account”) with Bank J. Safra Sarasin, Hong Kong Branch (“Bank Sarasin”). (b) The investor also purchased shares in EquityCo from the Founder Holdco for the total consideration of US$51,784,209 which was paid into the Founder’s Hong Kong Bank Account. (c) It is alleged that the Founder also represented to CVC at a number of meetings prior to the Acquisition that the Company and its subsidiaries (the “Group”) was a thriving and successful brand which was resistant to the economic and consumption slowdown in the People’s Republic of China. 11 After the transactions were completed, the plaintiffs say that in 2015 they discovered what is alleged to be manipulation of the Company’s accounting/financial records by the Founder in 2013 to give a higher valuation which induced the Buyer and Investor to think the Company was more profitable than it really was and to buy into the Company at a higher price than what should have been paid. As a result, it is alleged that the price paid for the Company was grossly and artificially inflated. 12 FTI Consulting was appointed by the plaintiffs to analyse the 2014 records and documents in relation to the Company. It prepared a report dated 25 February 2015 which found,inter alia, that “there was pervasive manipulation of South Beauty’s transaction sales data between January and April 2014 in the form of recognition of fictitious high value transactions paid on account; and manipulation of data in this way is consistent with inflated revenue and a rapidly increasing trade receivables balance, the same patterns [FTI] observed in South Beauty’s financial statements and [FTI] therefore consider it highly likely that similar manipulation took place in 2013.” 13 The 1st and 2nd plaintiff have each commenced separate arbitration proceedings against the Sellers in the China International Economic and Trade Arbitration Commission (“CIETAC”). In essence, the claim in the respective Request for Arbitration asserts that the Sellers fraudulently manipulated the accounting information of the Company, which was relied on by the plaintiffs when deciding whether or not to proceed with the Acquisition. It is also asserted that the Sellers have breached various warranties within the SPA and had made fraudulent misrepresentations in connection with the Acquisition. As such, the plaintiffs seek a rescission of the SPA, return of the purchase price paid to the Sellers under the SPA and damages to be assessed. In the alternative, if rescission is not granted, damages and/or an indemnity for all losses caused by the Sellers’ fraudulent misrepresentation. Orders made by the respective Courts 14 The plaintiffs also filed various applications in the Hong Kong and Singapore courts. 15 On 26 February 2015, the Hong Kong court granted the following orders against the Founder and Founder HoldCo: (a) Injunction orders to restrain them from disposing of their assets worldwide (“Hong Kong Injunctions”); (b) Disclosure of information orders requiring them to disclose all assets worldwide in excess of HK$500,000 (“Hong Kong Disclosure Orders”); (c) Disclosure of information orders against their bank, Bank Sarasin; and (d) Evidence preservation orders. 16 On 2 March 2015, in Originating Summons No. 178 of 2015 and Originating Summons No. 180 of 2015, the Singapore court,inter alia, granted orders prohibiting the Founder from disposing of or dealing with or diminishing the value of her assets in Singapore whether in her name or not and whether solely or jointly owned (“Singapore Injunctions”). 17 Various banks in Singapore were notified of the Singapore Injunctions. 18 As the plaintiffs believed that SE is owned by the Founder and that SE has an account with CS (“CS Account”), confirmation of this was sought from CS on 9 March 2015. On 12 March 2015, Messrs Herbert Smith Freehills in Hong Kong, solicitors for CS, confirmed that steps have been taken to comply with the Singapore Injunctions in particular, to ensure there are no dealings in monies or assets held in the CS Account. 19 On 14 March 2015, the plaintiffs’ solicitors were notified by solicitors for DB, Messrs Allen & Gledhill, that DB believed that SE’s DB account (“DB Account”) is subject to the terms of the Singapore Injunctions. 20 As the plaintiffs believe that the Founder had transferred funds from the Founder’s Hong Kong Bank Account to the CS Account and the DB Account to put the funds out of the reach of the plaintiffs, the plaintiffs filed these applications for the following purposes: (a) To identify third parties for the potential commencement of proceedings against them; (b) To ascertain the full nature of the wrongdoing perpetrated by the Founder and to enable the plaintiffs to plead their case properly; and/or (c) To trace assets in support of the plaintiffs’ proprietary claim against the Founder and third parties.",
        "The issues": "21 The following issues were considered by the Court: (a) Whether the requirements for obtaining an order for pre-discovery pursuant O24 r 6(5) of the Rules of Court (“ROC”) and/or the inherent jurisdiction of the Court have been satisfied (b) Whether the plaintiffs had shown that there was a likely prospect of subsequent proceedings being held in Singapore pursuant to Order 24 rule 6(5) read with Paragraph 12 of the First Schedule of the Supreme Court of Judicature Act (“SCJA”); and (c) Whether the requirements under the Banking Act read together with section 175 of the Evidence Act for discovery of documents from the respective defendant banks have been satisfied.",
        "Decision": "",
        "Pre-Action Discovery": "22 The Court has power to order discovery against a non-party under O 24 r 6(5), which reads as follows: An order for the discovery of documents before the commencement of proceedings or for the discovery of documents by a person who is not a party to the proceedings may be made by the Court for the purpose of orwith a view to identifying possible parties to any proceedings in such circumstances where the Court thinks it just to make such an order, and on such terms as it thinks just. (emphasis added) 23 The words in O 24 r 6(5) give statutory effect to theNorwich Pharmacalorder, which is traditionally sought when it is necessary to obtain information for the purpose of ascertaining the identity of a potential defendant so that proceedings may be commenced against him. SeeSingapore Court Practice 2014 at 24/6/5 and 24/6/6. 24 In addition, the Court also retains its inherent jurisdiction to order disclosure from a non-party. This was recognised by Sundaesh Menon JC (as he then was) inUMCI Ltd v Tokio Marine & Fire Insurance Co (Singapore) Pte Ltd and others[2006] 4 SLR(R) 95 (“Tokio Marine”), where he observed at [91] that the Court’s jurisdiction to order the discovery of documentary samples from non-parties under O 24 r 6(5) overlaps with aNorwich Pharmacalorder which may be made under the Court’s inherent jurisdiction. This was an acknowledgement that the Court had concurrent jurisdiction under O 24 r 6(5) and its inherent jurisdiction to order discovery against a non-party. 25 Before examining the law and facts to determine whether the documents sought  by the plaintiffs should be granted, it is timely at this point to note the Court of Appeal’s caution regarding pre-action disclosure inDorsey James Michael v World Sport Group Pte Ltd[2014] 2 SLR 208 (“Dorsey James”)at [27]: …The utility and benefits of this procedure, however, must be calibrated against the fact that pre-action disclosure of any sort is quintessentially intrusive in nature – especially when it involves individuals who may ultimately not (or cannot) be parties to the litigation. … An application has to be confined to what is strictly necessary for disposing fairly of the cause or matter or for saving costs in the pending or potential proceedings. Deep-sea fishing must be discouraged. Most crucially, in the final analysis, the making of any order must be “just” in all the circumstances. 26 The prescribed test for pre-action discovery is justness and necessity (see O 24 r 6(5) and r 7).",
        "O 24 r 6(5) and Norwich Pharmacal Orders": "27 As O 24 r 6(5) gives statutory effect to aNorwich Pharmacalorder, the principles which guide the Court in granting aNorwich Pharmacalorder are  relevant. 28 The Court of Appeal inDorsey Jamesconsidered the principles which would determine whether pre-action disclosure pursuant toNorwich Pharmacalorders would be made. WhileDorsey Jamesdealt primarily with pre-action interrogatories, the Court of Appeal noted that “the principles underlying both pre-action discovery and pre-action interrogatories (both constituting what [the Court of Appeal] shall henceforth refer to as “pre-action disclosure”) remain broadly thesame” (at [25]). Accordingly, the principles enunciated by the Court of Appeal inDorsey Jamesin respect of pre-action interrogatories would apply equally to my consideration of theNorwich Pharmacalorders (pre-action discovery) which are sought in these proceedings. 29 The Court of Appeal inDorsey Jameslaid out the 3 principles that would guide a court in its decision whether to grant aNorwich Pharmacalorder: (1)  Facilitation of wrongdoing 30 Significantly, the person possessing the information sought must have been involved in the wrongdoing. This presupposes some degree of actual involvement, even if the involvement is completely innocent (Dorsey Jamesat [39]). (2)  Requirement of “real interest” in ascertaining a “source” 31 The Court of Appeal inDorsey Jamesreferred at [40] to the seminal decision ofBritish Steel Corporation v Granada Television Ltd[1981] AC 1096 (“British Steel”) where Lord Wilberforce declared that in compelling disclosure of sources “it is onlyexceptionally, that the aggrieved person would have, and could demonstrate,a real interest in suing the source” [emphasis added in bold and in italics] (at 1173F). 32 The Court of Appeal considered “the practical issue of how clear and obvious it should be that the “source” had committed some wrongdoing before the disclosure would be granted,ie, to what extent must the basis for the alleged impropriety by the ultimate wrongdoer be shown?” and observed that “[i]n essence this is a question of what the required standard of proof is for showing that a wrong had been carried out, or at least arguable carried out, by the wrongdoer (whom information is being soughtof, notfromshould be” (at [42]). 33 Reference was made toUnited Company Rusal plc v HSBC Bank plc[2011] EWHC 404 (QB) (at [50] ) where it was observed: There is no dispute that the standard of proof which an applicant must attain before aNorwich Pharmacalorder may be granted is that he hasat least an arguable case… 34 Considering the above authorities, the Court of Appeal inDorsey Jamesconcluded at [44] that “ordinarily, the claimant must be able to show a reasonableprima faciecase of wrongdoing against the person(s) whom information/identity is soughtof(notfrom)”. 35 Therefore, the applicant has to show an arguable or prima facie case of wrongdoing against the person of whom information is sought. (3) Necessary, Just and convenient 36 The Court of Appeal inDorsey Jamesstated at [45] that A crucial requirement for obtaining aNorwich Pharmacalorder is that the claimants have to show that the disclosure sought is necessary to enable him to take action, or at least that it is just and convenient in the interest of justice to make the order sought. … In other words, the information sought must be shown to benecessary“for the purposes of the claimant asserting his legal rights” … Yet another significant element in this requirement is the consideration of whether there exist analternative and more appropriatemethod to obtain the information sought. In addition, there is the consideration of proportionality, where the court always maintains a residual discretion as to whether the order should be made in all the circumstance.",
        "Should the discovery sought by the plaintiffs be granted?": "(1)  Facilitation of wrongdoing 37 On 3 March 2015, pursuant to the orders made by the Hong Kong Court, Bank Sarasin provided 4 arch lever folders (“Safra Sarasin Documentation”) relating to the Founder’s Hong Kong Bank Account to the plaintiffs’ solicitors in Hong Kong. These documents show that a portion of the Purchase Funds were paid into the Founder’s Hong Kong Bank Account. It also showed that a number of remittances were made out of the Founder’s Hong Kong Bank Account. 38 The Safra Sarasin Documentation also disclosed an email dated 13 March 2014 from the account manager of the Founder’s Hong Kong Account where it was noted that the Founder indicated that she wishes to “transfer the assets to other structure”. It was the account manager’s understanding that this is “not only for tax planning purposes, but her lawyer is helping her to ease the concern on the with-recourse term of her business sold to an PE.” 39 The plaintiffs are of the view that the “with-recourse term” referred to the representations and warranties that the Founder had provided during the Acquisition such that if there was a breach of such representations and warranties, the Founder would be liable to pay damages to the plaintiffs. Therefore, the plaintiffs believe that the email shows the Founder’s intention to transfer her assets to other jurisdictions in order to put them out of the reach of the plaintiffs and to do so using third parties. The Credit Suisse AG account 40 One of the remittances out of the Founder’s Hong Kong Bank account was to the CS Account, which is Success Elegant’s account in Singapore with CS. 41 Documentation relating to the CS Account is the subject matter of the application in OS 307/2015. 42 There is documentation that shows that the Founder had remitted funds from the Founder’s Hong Kong Bank Account to the CS Account and this was allegedly for the purpose of putting the monies out of the reach of the plaintiffs. Therefore, CS and Success Elegant (“SE”) have become involved in the wrongdoing, even if this involvement may be completely innocent. The Deutsche Bank Aktiengesellschaft account 43 The Safra Sarasin Documentation do not show any remittance from the Founder’s Hong Kong Bank Account to the DB Account, Success Elegant’s account in Singapore with DB. 44 Documentation relating to the DB Account is the subject of the application in OS 305/2015. 45 While there is no direct evidence that funds were remitted from the Founder’s Hong Kong Bank Account to the DB account, the intention of the Founder to transfer her assets out of jurisdiction coupled with the fact that funds were actually remitted to the CS account, lead to the conclusion that it would be possible that funds were similarly remitted from the Founder’s Hong Kong Bank Account to the DB account. Therefore, it is highly probably that DB and SE have become involved in the wrongdoing, even if this involvement may be completely innocent. (2)  Requirement of “real interest” in ascertaining a “source” Banker Trust Orders 46 In a series of cases, the English Courts expanded the scope of aNorwich Pharmacalorder under the Court’s equitable jurisdiction to include orders compelling non-parties to provide documents to assist with the applicant’s tracing claim where there is a prima facie case of fraud. These orders have come to be known asBanker Trustorders. 47 InBankers Trust Co v Shapira[1980] 1 WLR 1274 (“Bankers Trust”), two man presented cheques that were purportedly drawn on a bank in Saudi Arabia on the Bankers Trust Co who paid over a million dollars based on the two cheques. When it was discovered that the cheques were forgeries, the Bankers Trust Co reimbursed the bank in Saudi Arabi and issued a writ in London with a statement of claim in action to trace and recover the moneys. A mareva injunction was obtained in respect of the funds in the defendants’ accounts in the bank. Bankers Trust Co sought a further order for discovery of documents relating to the moneys which the bank had, and what happened them so that they could trace and follow the funds which Bankers Trust Co alleged to have been fraudulently deprived of. 48 Lord Denning considered that the scope of aNorwich Pharmacalorder should be extended to allow the discovery sought as “[i]n order for justice to be done – in order to enable these funds to be traced – it is a very important part of the court’s armoury to be able to order discovery.” (at p1281F-G). 49 Lord Denning referred toMediterranea Raffineria Siciliana Petroli S.p.a v Mabanaft G.m.b.HCourt of Appeal (Civil Division) Transcript No. 816 of 1978  (“Mediterranea”) for the rationale for extending theNorwich Pharmacalorder. InMediterranea, owing to a mistake in a commercial transaction, moneys payable to the plaintiffs were paid to other people. There was no fraud involved. Templeman L.J. said : As Lord Denning M.R. said, it is a strong order, but the plaintiffs’ case is that there is a trust fund of $3,500,000. This has disappeared, and the gentlemen against whom orders are sought may be able to give information as to where it is and who is in charge of it.A court of equity has never hesitated to use the strongest powers to protect and preserve a trust fund in interlocutory proceedings on the basis that, if the trust fund disappears by the time the action comes to trial, equity will have been invoked in vain.[Emphasis added] 50 However, this new jurisdiction should be exercised with caution and it is pertinent to note Lord Denning’s caution inBankers Trustat pg 1282B: [this] new jurisdiction must, of course, be carefully exercised. It is a strong thing to order a bank to disclose the state of its customer’s account and the documents and correspondence relating to it. It should be only be done where there is good ground for thinking the money in the bank is the plaintiff’s money – as for instance, when the customer has got the money by fraud – or other wrongdoing - and paid it into his account at the bank. The plaintiff who has been defrauded has a right in equity to follow the money. 51 InA v C[1981] 1 QB 956 (“A v C”), which was referred inBankersTrust, the plaintiffs claimed to be victims of fraud which they say was master-minded by the first defendant but which implicated the second to fifth defendants. The plaintiffs also wished to trace monies which they say was paid under a mistake of fact induced by fraud into the account of the bank. The discovery orders against the bank were granted. Robert Goff J observed at pg 959D: … in an action in which the plaintiff seeks to trace property which in equity belongs to him, the court not only has the jurisdiction to grant an injunction restraining the disposal of that property; it may in addition, at the interlocutory stages of the action, make orders designed to ascertain the whereabouts of that property. In particular, it may order a bank (whether or not party to the proceedings) to give discovery of documents in relation to the bank account of a defendant who is alleged to have defrauded the plaintiff of his assets; … Rescission – standard of proof required before obtaining a Norwich Pharmacal/Bankers Trust order 52 The solicitors for SE pointed out that in the Request for Arbitration, the plaintiffs have merely sought the rescission of the SPA and associated agreements, and in the alternative, damages and/or an indemnity for the losses caused by the Sellers’ fraudulent misrepresentation. As the SPA and associated agreements have not been rescinded, SE say that the plaintiffs do not have a proprietary claim and so are not entitled to seek orders to assist in a tracing claim. 53 The plaintiffs’ solicitors disagree. They say that all the plaintiffs have to show is that there is an arguable case that the SPA and associated agreements may be rescinded due to the Sellers’ fraudulent misrepresentation. 54 I agree with the position taken by the plaintiff’s solicitors. InA v B Co[2002] 3 H.K.I.R.D. 111 (“A v B”) at para 26(2), one of the arguments raised by the defendant in resisting the discovery orders was that the plaintiff does not and cannot assert a proprietary claim over the assets. The Hong Kong Court was of the view that this by itself was not sufficient reason to deny the order sought. Geoffrey Ma J (as he was then) expressed the view that it is not a requirement that the plaintiff must have sufficient information to establish a tracing claim before establishing an entitlement to relief. What is more important is that “there should be sufficiently cogent evidence of wrongdoing”  (at para 27(4)). 55 The Court of Appeal inDorsey Jamesat [43] referred to Paul Matthews and Hodge M Malek QC,Disclosure(Thomas Reuters (Legal) Limited, 4th Ed, 2012) at para 3.06 where it is stated that “[i]t is not necessary for the claimant to establish that there hasin factbeen a wrong, although there must be at leastsome reasonable basisfor contending that a wrong may have been committed” [emphasis added]. The Court of Appeal expressed the view that having a “good arguable case” and “at least some reasonable basis” means not having to enter into speculative territory – there is a difference between trying to identify the wrongdoer and/or his role in the wrongdoing, and attempting to determine whether there has beenanywrongdoing at all. 56 InA vC, the plaintiff placed before the court affidavit evidence which constitutes prima face evidence that a fraud has been committed. The  discovery order against the bank (regardless of whether it was a party to the proceedings) was granted though it was acknowledge that whether such a fraud may hereafter be proved depends upon the effect of the evidence given at the trial of the action (at p957F) . 57 The common thread through all the authorities is that the standard of proof which an applicant must show before obtaining aNorwich Pharmacalorder/Bankers Trustorder is that there is an arguable or prima facie case of fraud or some wrongdoing. The applicant does not have to prove that the actual wrongdoing was committed at the time of the application. 58 Applying these principles to the facts of this case, there is prima facie evidence that there may have been manipulation of the Company’s financial records. This may be seen from the analysis of FTI Consulting which concluded that there was “pervasive manipulation” of the Company’s transaction sales dated between January 2014 and April 2014 in the form of the recognition of “fictitious” high value transactions paid. The plaintiffs also allege that the Founder had manipulated the Company’s accounting/financial records in 2013 to give a higher valuation which induced the Buyer and Investor to purchase the Company which was thought to be more profitable than it really was. 59 Based on the evidence that has been presented, I am satisfied that there is a prima facie and/or an arguable case of fraudulent misrepresentation on behalf of the Founder in respect of the 2013 and 2014 accounts of the Company which may entitle the plaintiffs to rescind the SPA and associated contracts and have a proprietary claim against the Founder. Therefore, the threshold standard of proof required for aNorwich Pharmacal/Banker Trustsorder has been met. The CS Account and the DB Account are in the name of Success Elegant 60 The next string in SE’s bow is that the plaintiffs are not entitled to the discovery as they are seeking information on bank accounts that do not belong to the Founder. 61 It will be recalled that both the CS Account and the DB Account are in the name of SE. They are not the Founder’s bank accounts. As SE was not a party to the SPA and associated agreements and is not involved in the CIETAC arbitration, the issue is whether the plaintiffs are entitled to documents in relation to the CS Account and the DB Account which are in the name of SE, a non-party. 62 SE is a company registered in the British Virgin Islands. At present, its sole director is ATP Directors Limited and its sole shareholder is Asiatrust. The Founder previously owned and had interest in SE until 4 June 2014 when she transferred the sole share in SE to Asiatrust. So SE’s position is that from4 June 2014onwards, the Founder ceased to have any ownership or other interest in SE. 63 SE argued that the plaintiffs have not produced any evidence to show that the Founder has any interest in SE and have only made bare assertions to that effect. 64 The plaintiffs point to various events which they say show that, despite the fact that the Founder had transferred the sole share in SE to Asiatrust on 4 June 2014, the Founder continues to be the beneficial owner of SE. (a) First, there is documentary evidence showing a total of five remittance of a total of USD 117,322,208.46 from the Founder’s Hong Kong Bank Account to the CS Account as follows: RecipientDateAmount(local currency)Amount(appro. USD)Success Elegant Trading Limited10 Mar 2014USD 50,000,000.0050,000,000.0014 Mar 2014USD 2,085,489.462,085,489.4614 Mar 2014HKD 25,005, 779.933,236,719.0024 Mar 2014USD 60,000,000.0060,000,000.0021 Jul 2014USD 2,000,000.002,000,000.00 (i) In the Remittance Instruction Form of Bank Sarasin dated 10 March 2014, a staff of Bank Sarasin spoke with the Founder to confirm her instructions to remit the funds to SE. The Remittance Instruction Form shows that the staff recorded the purpose for the payment as “Asset consolidation” and the Founder’s relationship with SE as “[Founder] owns Success Elegant Trading Limited”. The statement that the Founder owns SE is recorded again in the Remittance Instruction Form dated 24 March 2014. (ii) Most significantly, in the Remittance Instruction Form dated 21 July 2014, it is recorded that the Founder states again that her relationship with SE is that “Success Elegant Trading Ltd is owned by [the Founder]”. This statement was made approximately7 weeks afterthe Founder had allegedly ceased to own and have any interest in SE after having sold the sole share in SE on 4 June 2014. In addition, the Founder transferred the significant amount of USD 2 million to a company which she claims to have no interest in. There has been no explanation as to the reason the Founder continues to claim she is the owner of SE and the reason this amount was transferred to SE by the Founder at a time when SE claims the Founder has no interest in SE. (b) Second, as referred to earlier, when notified of the Singapore Injunctions, the contemporaneous correspondence show that CS treated the CS Account as being subject to the Singapore Injunctions, even though the injunction was only in respect of the Founder’s bank accounts. There was written confirmation on 12 March 2015 from Messrs Herbert Smith Freehills, solicitors for CS, that steps have been taken to comply with the Singapore Injunctions. Messrs Herbert Smith Freehills also sought the plaintiffs’ confirmation that it would be agreeable to CS dealing with the CS Bank Account to meet SE’s obligations in various transactions. 65 The plaintiffs’ solicitor submits that CS on legal advice with full knowledge of who is the beneficial owner of the CS Account treated the CS Account as being subject to the Singapore Injunctions which were granted against the Founder. This shows that the Founder continues to have an interest in SE. 66 Similarly, when notified of the Singapore Injunctions, DB froze the DB Account. The plaintiffs’ solicitor submits that this shows that DB treated the DB Account as an account which is owned by the Founder. Therefore, there are two banks who have treated SE’s accounts as being subject to the Singapore Injunctions. 67 Further, apart from SE’s application to be joined to these proceedings to object to the discovery orders, there is no evidence of SE objecting to or filing any application challenging the freezing of their accounts in CS and DB pursuant to the Singapore injunctions. 68 Taking all the above into account, the plaintiffs submit that SE is beneficially owned by the Founder. 69 I agree with the plaintiffs. If SE takes the position that its bank account should not be subject to the Singapore Injunctions, then I would have expected SE to file an application in court to challenge the freezing of its accounts. SE has not filed any such application. There is also not a single letter of protest from SE to CS and/or DB in respect of the alleged wrongful freezing of SE’s account, especially since it appears that the freezing of the CS Account has caused SE operationally difficulties with the utilisation of its funds as the plaintiffs’ consent is required for the payment of moneys from the CS Account to meet SE’s operational needs. Further, there has been no explanation as to why the Founder transferred USD 2 million dollars to a company she has no interest in. All these contemporaneous evidence taken together lead me to the conclusion that the Founder is the beneficial owner of SE and the fact that the CS Account and the DB Account are in the name of SE would not be a bar to the discovery orders sought. 70 Therefore, I am satisfied that the plaintiffs have shown that they have an arguable case of fraudulent misrepresentation which entitled them to rescind the SPA and associated agreements and that the CS Account and the DB Account are beneficially owned by the Founder. (3)  Necessary, Just and convenient 71 In my view it is necessary and just to order the disclosure of these documents from the banks. The Founder has stated her intention to transfer the funds out of reach of the plaintiffs and has taken steps to transfer the funds to other bank accounts. Without the court’s assistance, the plaintiffs would not know or would not know any information as to what happened to the funds.  It is clear that the documents sought are necessary for the plaintiffs to trace the funds.",
        "Jurisdictional issues": "72 O24 r 6(5) provides that the Court may make the discovery orders “for the purpose of or with a view to identifying possible parties to any proceedings…”. 73 The Court of Appeal inDorsey Jonesheld that discovery orders pursuant to O24 r 6(5) would only be granted if there is a likely prospect of subsequent proceedings being held in Singapore. The Court of Appeal said at [68-69] that the High Court's jurisdiction to order interrogatories is derived from s18(2) of the SCJA, which states that the High Court shall have the powers set out in the First Schedule of the SCJA. The proceedings referred to in paragraph 12 of the First Schedule of the SCJA must refer to proceedings before the Singapore Court. The Court of Appeal was of the view that the applicant had to adduce some credible evidence of a Singapore nexus to the alleged third party wrongdoing. It went on to hold at [70] that that where (1) the specific alleged wrongdoing of leaking information to Dorsey was preceded by what appears to be a rather widespread release of that information worldwide; (2) there was no suggestion that the breach or disclosure took place and/or is actionable in Singapore; and (3) there was no likely prospect of subsequent proceedings being held in Singapore, the requested interrogatories were not allowed. 74 SE’s solicitors point out that, in light ofDorseyJames, the discovery order sought here cannot be granted in support of foreign proceedings. The plaintiffs’ solicitors counter this by arguing thatDorsey Jamesmay be distinguished as it dealt with pre-action interrogatories. Further, the power to grantNorwich Pharmacalorderswould be its power to grant equitable relief under paragraph 14 of the First Schedule of the SCJA which states: Reliefs and remedies 14. Power to grant all reliefs and remedies at law and equity, including damages in addition to, or in substitution for, an injunction or specific performance. 75 My views are as follows. First, paragraph 12 of the 1st Schedule refers to discovery as well as interrogatories. Therefore, the Court of Appeal’s decision that “proceedings” referred to in paragraph 12 of the 1st Schedule must refer to proceedings before the Singapore court applies equally to this application for discovery. 76 Second,Dorsey Jamesmay be distinguished as the Court of Appeal found that in that case there was no credible evidence of a Singapore nexus to the alleged third party wrong doing. In this case, it is clear that the CS Bank Account and the DB Bank Accounts are all located in Singapore. The existence of bank accounts in Singapore coupled with the evidence that monies were transferred to the CS account and an inference that monies may have been transferred to the DB account, lead to a likely prospect that subsequent proceedings may be commenced in Singapore if the monies are still in the Singapore bank accounts or have been transferred to other bank accounts in Singapore. 77 Without the discovery of the documents sought in the applications, the plaintiff simply does not know what happened to the money that was transferred to the Singapore bank accounts. The plaintiff would, therefore, not be able to even consider whether there is any prospect of commencing subsequent proceedings in Singapore. 78 In light of the above, I am of the view that there is credible evidence of a Singapore nexus and paragraph 12 of the First Schedule of the SCJA is not a bar to the discovery orders sought by the plaintiffs. 79 If, the court’s jurisdiction under O 24 r 6(5) does not extend to the discovery orders sought, then I am of the view that the discovery orders sought may be made under the inherent jurisdiction of the Court. 80 The ambit of the court’s inherent jurisdiction was reviewed by Andrew Phang Boon Leong J (as he then was) inWellmix Organics (International) Ptd Ltd v Lau Yu Man[2006] 2 SLR(R) 117 (“Wellmix”) where he held at [81]: …The key criterion justifying invocation of [the court’s inherent jurisdiction] is therefore that of “need” – in order that justice be done and/or that injustice or abuse of process of the court be avoided … 81Wellmixwas referred to by Sundaresh Menon JC (as he then was) inTokio Marinewhere he agreed with the submission that “the touchstone for invoking the court’s inherent jurisdiction is necessity” and specifically, it is the “necessity to prevent injustice or abuse of the process of the court” (at [92]). Menon JC then reviewed cases concerning the court’s inherent power to make orders to facilitate the gathering of evidence by modern means as long as it is reasonably necessary for the cause of justice. He concluded at [96]: I consider that the court’s inherent jurisdiction may be resorted to, to make orders that are reasonable necessary in order for justice to be done in a case or to prevent any abuse of the process of the court. In particular, this extends to the power to make suitable orders and directions that are reasonably required to prepare the way for a just and proper trial of the issues between the parties and for the evidence to be gathered. 82 As stated by Templeman L.J inMediterranea(at paragraph 48 above), a court will grant orders to ascertain the whereabouts of trust property to ensure the trust funds do not disappear by the time the action comes to trial. 83 Simply put, the plaintiffs require the discovery orders to trace and to find out what happened to the funds. If the Court does not go to the plaintiffs’’ aid, the funds may disappeared and be put out of reach of the plaintiffs by the time the final decision in the arbitration is rendered. The discovery orders sought are necessary to ensure justice is done. 84 Therefore, for the reasons set out above, I am of the view that the Court should grant the discovery orders sought by the plaintiffs under O24 r 6(5) and/or the Court’s inherent jurisdiction.",
        "The Banking Act and Part IV of the Evidence Act": "85 As CS and DB are both banks, they are subject to the duty of banking secrecy under s 47 of the Banking Act. However, disclosure of documents by banks is permitted in the circumstances stated in the Third Schedule of the Banking Act. One of the situations where disclosure is permitted is under paragraph 7 of the Third Schedule where disclosure is necessary to comply with an order of the Supreme Court or Judge thereof pursuant to the powers under Part IV of the Evidence Act. 86 Part IV of the Evidence Act was enacted for the benefit of bankers and its object is to relieve bankers of the necessity of actually attending court with their books under a subpoena as that would unduly interfere with the business of the banker. SeeWee Soon Kim Anthony v UBS AG[2003] 2 SLR(R) 91 (“Anthony Wee”)at [17]. 87 The application for discovery of documents from the respective defendant banks is made pursuant to s 175 of the Evidence Act, which is under Part IV of the Evidence Act. 88 S 175 of the Evidence Act provides: Court or Judge may order inspection 175. (1) On the application of any party to a legal proceeding, the court or a Judge may order that such party be at liberty to inspect and take copies of any entries in a banker’s book for any of the purposes of such proceedings. 89 The solicitors for CS submitted that it may not be possible to obtainBanker Trustorders under s 175 of the Evidence Act. They referred toNeate: Bank Confidentiality(4th Ed, Tottel Publishing) which stated at p580: It seems clear from [AnthonyWee] that a disclosure order under s 175 would be necessary before a bank would be exempted under this item from its duty of confidentiality, notwithstanding that an order under some other provision for disclosure had already been obtained. This does, however, create a problem as an additional ‘exempting’ application under s 175 might be difficult to obtain in relation to disclosure orders to trace funds of fraudsters under the principle set out inBankers Trust v Shapira– the scope of such orders are often wider than the orders for inspection of bankers’ books pursuant to s 175. Further, s 175 contemplates an existing legal proceeding and an ‘exempting’ application cannot be brought in a pre-action situation, for instance, in relation to disclosure pursuant to aNorwich Pharmacalorder or even pre-action Mareva injunction orders. 90 In light of the above, parties were directed to provide further submissions on two issues: (a) Do the plaintiffs’ disclosure applications via OS 305 and OS 307 constitute “legal proceedings” within the meaning of s 175 read with s 170 of the Evidence Act? (b) On a related note, does the reference to “arbitration” in s 170 include foreign – seated arbitrations? 91 Having reviewed the submissions of the plaintiffs and SE, I start by noting that it is not disputed that s 175 of the Evidence Act by itself does not give any independent, substantive right to the discovery of documents. The plaintiffs have submitted that the Singapore case ofAnthonyWeeand the Brunei case ofChan Swee Lengv Hong Kong and Shanghai Banking Corp Ltd[1996] 5 MLJ 133 (“Chan Swee Leng”) demonstrate that Part IV of the Evidence Act relates only tohowevidence is to be provided by the banks after the Court decides in an independent legal proceedings that the order for discover against the bank is warranted. Part IV of the Evidence Act has no bearing on the logical prior question ofwhetherdiscovery should be ordered in the first place. SeeAnthonyWeeat [19]. I agree with the plaintiffs. 92 Bearing the above in mind, the following requirements have to be satisfied before inspection may be allowed under s 175 of the Evidence Act: (a) There has to be separate legal proceedings commenced by the applicant; and (b) Inspection of the bankers’ books is for the purposes of such proceedings. Legal Proceedings under s 175 of the Evidence Act 93 InChan Swee Leng, the High Court of Brunei considered the meaning of legal proceedings in the context of s7 of the Brunei Bankers’ Book Evidence Act (1879) (“BBEA”) which is inpari materialwith s 175 of our Evidence Act. It was held that before an order is made in the applicant’s favour pursuant to this section under the Evidence Act, the applicant has to first show that he is a party to separate legal proceedings. 94 What this means for OS 305 and OS 307 is that the plaintiffs have to show that they are a party to separate and independent legal proceedings. 95 s 170 of the Evidence Act provides “legal proceedings” means any civil or criminal proceeding or inquiry in which evidence is or may be given, and includes an arbitration. 96 As the plaintiffs are parties to the CIETAC arbitration and an arbitration falls within the definition of legal proceedings, I am satisfied that the plaintiffs are parties to separate and independent legal proceedings. Inspection of the bankers’ books has to be for the purpose of the CIETAC arbitration 97 The plaintiffs have submitted that the documents are required for the following purposes: (a) To identify third parties for the potential commencement of proceedings against them; (b) To ascertain the full nature of the wrongdoing perpetrated by the Founder and to enable the plaintiffs to plead their case properly; and/or (c) To trace assets in support of the plaintiffs’ proprietary claim against the Founder and third parties. 98 The CIETAC arbitration is only between parties to the Acquisition as they are the only parties to the arbitration agreement. Third parties are not involved in the CIETAC arbitration and so the identification of third parties for the potential commencement of proceedings against them will not be for the purpose of the CIETAC arbitration. 99 The documents sought relate to what the Founder did with the fundsafterthe Acquisition. It will contain no information on the alleged fraudulent misrepresentation by the Founder which the plaintiffs say entitle them to rescind the SPA and related agreements. As such, I do not agree that the documents sought are required to ascertain the full nature of wrongdoing perpetrated by the Founder and will assist the plaintiffs in pleading their case properly at the arbitration. 100 As for the request of the documents for the purpose of tracing, one of the remedies sought by the plaintiffs in the CIETAC arbitration is for the SPA and related agreements to be set aside and rescinded. If this remedy is granted, the plaintiffs may have a proprietary interest in the monies which have been transferred by the Founder which may entitle them to trace the said monies.  Where a plaintiff seeks to trace property which in equity belongs to him, the court not only has jurisdiction to grant an injunction restraining the disposal of that property, it may, in addition, make orders to ascertain the whereabouts of that property. Therefore, I am satisfied that the orders sought to assist with tracing the moneys which were transferred by the Founder to the respective bank accounts would be for the purpose of the CIETAC arbitrations as it would assist with the recovery of an award made in favour of the plaintiffs. Does the International Arbitration Act prohibit the discovery sought by the plaintiffs? 101 SE submitted that, under the International Arbitration Act (“IAA”), the Court’s powers to assist/intervene in international arbitrations (including foreign-seated arbitrations) by way of interim measures are found in s12A, IAA and the Court’s powers do not extend to making orders in respect of discovery of documents and interrogatories. As such, SE submitted that under the IAA and the Model Law, the Court has no power to grant discovery/Norwich Pharmacal/Bankers Trustorders to assist international arbitrations whether seated in Singapore or abroad. 102 As the Court’s power to intervene in arbitrations are found solely in the IAA and Model law, it is SE’s position that the Court may not grant such orders in aid of the CIETAC arbitration, which is a foreign-seated arbitration under s 175 of the Evidence Act or the Court’s inherent jurisdiction. InL W Infrastructure Pte Ltd v Lim Chin San Contractors Pte Ltd and another appeal[2013] 1 SLR 125 (“L W Infrastructure”), the Court of Appeal made it clear at [35-36] that the Court’s power to intervene in arbitrations are found solely in the IAA/Model Law and not elsewhere: Article 5 of the Model Law (found in the First Schedule of the IAA) states; ARTICLE 5 EXTENT OF COURT INTERVENTION In matters governed by this Law, no court shall intervene except where so provided in this Law. The effect of Art 5 of the Model Law is to confine the power of the court to intervene in an arbitration to those instances which are provided for in the Model Law and to “exclude any general or residual powers” arising from sources other than the Model Law 103 Accordingly, it is the SE’s position that s 175 of the Evidence Act does not confer any power on the Court to assist an arbitration (whether a Singapore or foreign-seated arbitration) by way of a document productions/discovery process. It is only if a party to an arbitration seeks to enforce a discovery/document production order made by the tribunal against another party by leave of Court under section 12(6) IAA that s175 of the Evidence Act can be invoked. Even then, s12(6) IAA only pertains to Singapore-seated arbitrations. 104 The plaintiffs’ counters this argument by pointing out that it overlooks the fact that the discovery orders sought are against the banks who are not parties to the CIETAC arbitration. The plaintiffs submit that since the Model Law only govern matters relating to the parties to the arbitration, it does not govern relief sought against non-parties to the arbitration. InChina Ocean Shipping Co. Owners of The M/V Fu Ning Hai v Whistler International Ltd. Charterers of the M/V Fu Ning Hai[1999] HKCFI 693 at pg 8, Findlay J stated: There is nothing in the Model Law that governs the matter of a party giving sufficient details about itself to enable the other party to know who it is and its whereabouts, and, therefore, the restriction in article 5 does not apply in this case.Nor am I not satisfied that an order requiring a party to supply such details is an “interim measure of protection”. As far as I know, there is no express provision of any law that speaks about the situation here. So I am left with a clean slate, and must decide this matter on the basis of the inherent jurisdiction of this court. [emphasis added] 105 I agree with the position taken by the plaintiffs. InTomolugen Holdings Ltd and another v Silicia Investors Ltd and other appeals[2016] 1 SLR 373, the Court of Appeal stated: 81 … Because the source of an arbitral tribunal’s power is contractual, its scope is necessarily limited to making orders which will be binding only upon the contracting parties… … 98 … An arbitrator whose powers are derived from a private agreement between A and B plainly has no jurisdiction to bind anyone else … 106 Therefore, as the orders sought in these applications are against non-parties to the CIETAC arbitration, the Court’s power to grant the relief sought in these applications is not affected by Article 5 of the Model Law and the IAA. It is also not material whether the CIETAC arbitration is a foreign-seated arbitration. 107 Accordingly, the IAA and/or the Model Law do not prohibit the Court from making the discovery orders which are sought. 108 In the premises, I am satisfied that the requirements for discovery to be ordered pursuant to s 175 of the Evidence Act have been satisfied. 109 As I have earlier held that I am prepared to grant the discovery orders sought under O 24 r 6(5) ROC and/or its inherent jurisdiction and as the requirements of s 175 of the Evidence Act are satisfied, for the reasons stated above, I am prepared to grant the discovery orders sought by the plaintiffs.",
        "Scope of the discovery orders": "110 Bearing in mind the Court of Appeal’s caution inDorsey Jamesthat  theNorwich Pharmacal/Bankers Trustorders are intrusive in nature and that the application has to be confined to what is strictly necessary for disposing fairly of the cause or matter, I will confine the discovery sought to the documents which are necessary to trace the funds. 111 As such, the documents which are to be ordered to be disclosed in each respective OS are as follows: (a) The following documents within the 1st defendant’s possession, custody or power relating to any account held in the name of or beneficially owned by Zhang Lan (St Kitts and Nevis Passport No. RE0009358) and/or Success Elegant Trading Limited and or any alias known to the 1st defendant (collectively, the “Account(s)”):(i) The account opening forms and other related documents submitted for the purposes of opening the Account(s);(ii) Bank statements in respect of the Account(s) setting out all transfers into and/or from the Account(s) from and including 13 December 2013 to the date of this Order (“Transfers”); and(iii) Remittance slips, payment instructions and SWIFT instructions relating to the Transfers.(b) The documents to be disclosed herein do not apply to payments made from the Account(s) to the 1st defendant in respect of any fee or charges levied by the 1st defendant, or as payment for transactions entered into. 112 It is also ordered that documents disclosed by DB and CS respectively to the plaintiffs are to be used solely for the purpose of following and tracing the money, and not for any other purpose. 113 I will hear parties on costs. Tan Teck Ping KarenAssistant Registrar Mr Harpreet Singh, S.C., Mr Paul Sandosham, Ms Tan Mingfen, Mr Jerald Foo, Ms Elsa Goh (Cavenagh Law LLP) for the plaintiffs in OS 305/2015 and OS 307/2015; Ms Tan Xeauwei (Allen & Gledhill LLP) for the first defendant in OS 305/2015;Mr Chua Sui Tong and Mr Daniel Chan (WongPartnership LLP) for the first defendant in OS 307/2015;Mr Edmund Kronenburg and Ms Grace Loke (Braddell Brothers LLP) for the second defendant in OS 305/2015 and OS 307/2015."
    }
}