{
    "case_title": "Chng Leng Khim vPublic Prosecutor and another matter",
    "ncitation": "[2016] SGHC 215",
    "coram": "Sundaresh Menon CJ (delivering the judgment of the courtex tempore)",
    "sections": {
        "The background facts": "2 The Appellant kept three dogs—a Bull Mastiff Cross, a Chow Chow and a Poodle. She was charged with various offences pertaining to her custody and treatment of those dogs. The essential allegations against her are that she: (a) kept the dogs without a licence; (b) subjected them to unnecessary suffering by allowing them to become emaciated and by unreasonably failing to take them to the veterinarian for treatment; and (c) later failed to comply with a lawful demand to attend at the Agri-Food and Veterinary Authority (“AVA”) in order to record a statement in connection with her treatment of the three dogs. 3 These matters led the Appellant to face a total of seven charges under the Animals and Birds Act (Cap 7, 2002 Rev Ed) (“ABA”), the Animals and Birds (Dog Licensing and Control) Rules (Cap 7, R 1, 2007 Rev Ed) and the Agri-Food and Veterinary Authority Act (Cap 5, 2012 Rev Ed) (collectively “the Offences”). The Prosecution’s offer, at all material times, was to proceed on five charges and apply to have the two remaining charges taken into consideration for the purpose of sentencing if the Appellant were to plead guilty. Upon pleading guilty, she was convicted of the charges and sentenced accordingly. The DJ’s grounds of decision is published as [2016] SGMC 8. 4 Before the Appellant was convicted and sentenced, the matter had been through a number of pre-trial conferences over the course of several months, before it was fixed for trial on 5, 10 and 11 February 2016. Throughout that time, the Appellant did not appear to have been represented. 5 At about 9.30am on 5 February, Mr Singh informed the Deputy Public Prosecutor having conduct of the matter (“the DPP”) and the court that he had been engaged to act for the Appellant. At Mr Singh’s request, the DPP extended him a copy of the Appellant’s statements and the exhibits which she intended to admit at trial. The matter was stood down. The DC evidently then went through the evidence with the Appellant and later informed the DPP that the Appellant wished to plead guilty. After counsel appeared before the DJ in chambers, the matter was mentioned in open court at 12.10pm and was adjourned (at the DC’s request) to the morning of 10 February to enable a plea to be taken. The Statement of Facts (“SOF”) was prepared and made available to the DC later that night by way of electronic filing through the Integrated Case Management System. However, it should be noted that this was late on the eve of a long weekend, as the Lunar New Year holidays fell on the following Monday and Tuesday. It was not clear to me on the evidence whether the DC accessed the SOF at any time before 10 February. Indeed, Mr Singh has confirmed that he did not. 6 The SDs do not give a perfectly consistent account of what happened on the morning of 10 February, but I gather the following. The matter was stood down in the morning for the Appellant to go through the SOF, a copy of which the DPP had given to the DC at about 9.20am. After the DC had gone through the SOF with the Appellant for about half an hour, the Appellant changed her mind about pleading guilty. There was then a further exchange between the Appellant and the DC, following which the Appellant once again changed her mind and decided that she would plead guilty; the DC informed the DPP of this sometime between 11.00am and 11.30am. After some paperwork had been completed, the matter was mentioned once again in open court commencing at 12.17pm. The plea was taken, the Appellant was convicted and the matter was then adjourned to 19 February for sentencing. I pause to observe and emphasise the following: (a) The Appellant, and Mr Singh, saw the SOF and the annexes for the first time on the morning of 10 February. I stated earlier that I had initially been minded at the first hearing to dismiss the assertion that the plea had been taken when the Appellant was under pressure. That was because I had thought that the Appellant had received and seen the draft SOF on 5 February and therefore would have had ample time to become acquainted with it and to understand what precisely she would be admitting on 10 February. In fact, it has since become evident that, as it turned out, she only saw it on the very day on which her plea was taken even though, as noted above, it had been sent by the Prosecution late on 5 February. (b) It has also now become evident that her immediate reaction on reviewing the SOF was to change her mind about pleading guilty. (c) Between about 10.00am and 11.00am on that morning, Mr Singh and the Appellant had a further discussion, which I will return to shortly because it is a conversation of critical importance. (d) Thereafter, at about 11.00am, she once again changed her mind and agreed to plead guilty. 7 When the parties returned to the court on 19 February, supposedly for sentencing, Mr Singh made an unopposed application to discharge himself. The Appellant then made at least three failed attempts (both in person and through Mr Hassan Almenoar, who appeared as her second defence counsel) to set aside her plea on the basis that she had been pressured to plead guilty. Eventually, the DJ passed sentence on 23 February. The Appellant has appealed against her sentence and more centrally seeks to set aside the conviction.",
        "My decision": "",
        "The applicable principles": "8 In an appeal against sentence imposed consequent upon a plea of guilt, the court may set aside the conviction (s 390(3)(a) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”)). This section was introduced in 2010 by the Criminal Procedure Code (Act 15 of 2010), and mirrors the power of a superior court of record seised of revisionary jurisdiction (The Criminal Procedure Code of Singapore: Annotations and Commentary(Jennifer Marie & Mohamed Faizal Mohamed Abdul Kadir gen eds) (Academy Publishing, 2012) at para 20.102). The power to set aside the conviction is not foreclosed by the fact that the safeguards attending the taking of a plea of guilt have been observed in the lower court (Yunanibin Abdul Hamid v PP[2008] 3 SLR(R) 383 (“Yunani”) at [59]perV K Rajah JA); but there is a high threshold to be met. Such a power may be exercised only sparingly, and only if there is “serious injustice” or a “miscarriage of justice”. In my judgment, this would be the case if, upon application, the court is satisfied either that there were real doubts as to the applicant’s guilt or that the applicant had been pressured to plead guilty in the sense that he or she did not genuinely have the freedom to choose how to plead (Yunaniat [50] and [55]–[56];Thong Sing Hock v Public Prosecutor[2009] 3 SLR(R) 47 at [23] and [27]perRajah JA). 9 It will be helpful to examine once again some of the Canadian cases that were referred to and formed the basis for the decision of the court inYunaniin order to get a sense of the kind of pressure from counsel that would ordinarily vitiate a guilty plea. InR vLamoureux(1984) 13 CCC (3d) 101 (“Lamoureux”), the Quebec Court of Appeal exercised its appellate power to quash a conviction following a guilty plea on the ground of a “miscarriage of justice” (pursuant to s 613(1)(a)(iii) of the Criminal Code (RSC 1970, c C-46) (Canada)), which is one formulation of the threshold to invoke this Court’s revisionary power. The defence counsel who represented the appellant in the lower court in that case admitted that he had pressured his client to plead guilty to a charge of theft, although the court gave no details of that pressure. Rothman JA, delivering the judgment of the court, stated at [22] that “the integrity of the process requires that a change of plea be granted” where “improper pressure from counsel was the reason for the guilty plea”. He also said as follows: 15 This is not one of those cases where an accused, after receiving a sentence that was more severe than he expected, complains that he was misled as to the nature and consequences of the plea of guilty that he had offered. Even the pre-sentence report gives no indication that the accused knew that he could expect a more severe sentence. In this case, the accused tried to change his plea before sentence, contending that he had been subject to pressure from his lawyer and that he did not wish to admit guilt. 16 While there may be some difference between the version of the accused and the version of his counsel as to the reason for the pressure, both versions indicate that the plea of guilty was induced by pressure from counsel and that the accused did not wish to plead guilty. 17 Now, counsel has, not only a right, but a duty to advise an accused as to the weaknesses of his case, as to the probable outcome of the trial and as to the nature and consequences of a plea. Sometimes that advice must be firmly given. But counsel certainly has no right to pressure an accused into anything, least of all into pleading guilty.A plea of guilty must alwaysbe a free and voluntary act by the accused himself, untainted by any threats or promises to induce the accused to admit that he committed the offence when he does not wish or intend to do so.… [emphasis added] 10Lamoureuxwas later applied inR vCeballo(1997) 14 CR (5th) 15. There, the Ontario Court of Justice (Provincial Division) allowed an application by the accused to set aside a plea of guilt to two charges (one of assaulting his ex-girlfriend and one of threatening her with death) on the ground that the plea had been “clouded by other considerations” (at [12]). The accused had consistently intended to claim trial. Apart from his plea of guilt, he had maintained his innocence from the time of arrest until after he pleaded guilty 14 months later. However, he changed his position five days before the trial date, in view of several aspects of his counsel’s conduct and position including his pessimism, dismissal of exculpatory material that had been given to him by the accused, complaints about being retained by way of a legal aid certificate, and comments to the effect that domestic violence was a “hot issue” and the best solution would be to “work out a deal”, which led the accused to believe that he would not get a fair trial (at [14] and [38]). Crucially, on the trial date, the accused changed his mind about pleading guilty and engaged in a heated argument with his counsel, saying that it was unfair that he should have to plead guilty. He was told that the choice to plead guilty or claim trial was ultimately his, but he was terrified because his counsel was unprepared for a trial and had conveyed that fact to him (at [21]). Fairgrieve Prov J essentially found that the counsel’s conduct was unwarranted and that the accused had pleaded guilty only because he had been led to believe that it was “the best way to put the matter behind him and minimize the potential consequences for himself” (at [33]). He said as follows: 35 The evidence called on this application made it apparent that Mr. Ceballo was subjected to pressures that interfered with the exercise of appropriate judgment by him. … I accept that Mr. Ceballo, knowing that [counsel] had not prepared for trial, felt at the climactic moment that there was, as he put it, “no one in [his] corner”. … 37 It may be that from [counsel’s] perspective, there was some frustration at the inability to obtain clear and unequivocal instructions from his client. The failure to prepare for trial, however, although there had been no clear agreement with the Crown as to the charges on which she was requiring guilty pleas, and apparently no concessions as to the Crown’s position on sentence, obviously weakened the defence position during the negotiations which continued on the trial date. Inevitably, it added to the pressures on the accused. 38 I also think it is regrettable that [counsel] managed to convey to his client, again perhaps inadvertently, that because the case involved allegations of domestic violence, he could not expect a fair trial. … If that was the genuine belief of counsel, then it was undoubtedly appropriate for him to advise his client in accordance with it. For these purposes, though, the significant point is that it had the predictable result of increasing the pressure on the accused to resolve the matter by pleading guilty, regardless of the weaknesses of the Crown’s case or the defences potentially available. … 40 In view of the circumstances that led Mr. Ceballo to plead guilty, I am satisfied that he should be permitted to withdraw his pleas.There is reason to believe that his pleas were neither unequivocal nor voluntary in the required sense. While he said nothing in court at the crucial moment to suggest any uncertainty or qualification, the evidence called in support of the application establishes that the accused’s pleas were reluctant and at variance with his own belief concerning the facts and his own responsibility. Moreover, I accept that he felt pressured by his previous counsel, who was unprepared for trial and who had led his client to believe that he could not expect a fair trial. As a result, while Mr. Ceballo understood his options and the consequences of a guilty plea, he made the wrong choice based on the improper pressures that had been placed on him. [emphasis added] 11Lamoureuxwas also applied inR v Sampson(1993) 112 Nfld & PEIR 355. There, the Trial Division of the Newfoundland Supreme Court allowed an application by an accused person to change his plea and set aside his conviction. He had first been represented by a legal aid lawyer who never interviewed him concerning the offences, and who transferred his matter to a second lawyer. The second lawyer met him for just about one and a half hours on the day of trial itself, of which 45 minutes was spent taking substantive instructions while the remainder was spent negotiating the plea. He told his lawyer that the offences never happened, but his lawyer’s understanding was that the accused could not remember the offences and that one of the complainants bore “a grudge” against him. His lawyer urged him to plead guilty to minimise the sentence, but left the decision to him. O’Regan J, allowing the application, observed as follows: Conclusion 13Although I find no improper conduct by his counsel I am satisfied that the accused was under tremendous pressure due to all the circumstances and subjectively believed there was no other way out other than for him to plead guilty and get a short term in jail.Circumstances of each case must determine the outcome and in this case I find that the interests of justice will be best served by permitting the accused to withdraw the plea. … [emphasis added] 12 In my judgment, it is evident from these cases that a court may have regard to a variety of factors in coming to a decision as to whether an offender, who has entered a plea of guilt, has done so under circumstances of such pressure that it was not a truly voluntary decision. This will be a fact-sensitive inquiry and, in that context, it may be relevant to have regard to whether the decision to plead guilty was contrary to a sincere attempt and sustained intention to contest the charges which had been overwhelmed by the pressure of the moment. Notably, in each of the Canadian cases that I have referred to, the application to withdraw the guilty plea was madebeforesentence was passed. This would be relevant to whether the application to retract the guilty plea was genuinely reflective of an underlying unwillingness to plead guilty and was not motivated by receiving a sentence that was different from what the accused had expected or hoped for. I should also state that, in my view, a finding of such pressure does notnecessarilydepend upon a finding that counsel had acted improperly.",
        "Application to the facts": "13 In that light, I turn to the facts before me. The Appellant’s SD was not entirely coherent or consistent. Many of her claims and assertions were inherently hard to believe and most of these were refuted in no uncertain terms by the DC and the court clerk. In particular, I did not believe her claim that on 5 February the DC had said that he would get her a community-based sentence or an order that discharged her with a warning if she pleaded guilty, because I regard it as inherently improbable that an experienced defence counsel would make such a representation when he must have known he simply could not assure this. So too do I reject her claim that on 10 February, the DC said that she “could put [herself], her daughter who [was] still on probation and her youngest son [aged] 15 in trouble with the Ministry of Education” if she persisted in claiming trial. I cannot see why the DC would have said this; nor is it plausible that she would have believed this to be true because it is plainly untenable. I also disbelieved her claim that the court clerk or the DPP had put any pressure on her to plead guilty. These were assertions that were all too easy to make and in my judgment were simply not plausible. 14 It is also now evident, from the SDs filed, that the DC lacked instructions to mount a substantive defence. The Appellant had never attended at the DC’s office or contacted him even to give instructions for him to prepare the mitigation plea, after having indicated on 5 February her willingness to plead guilty. However, I disregard this as a relevant consideration in this case because it was a consequence of matters within the control of the Appellant. If there was pressure on account of these facts, the Appellant was herself responsible for generating it and she cannot now rely on this to set aside an otherwise valid plea. 15 However, I am nonetheless satisfied that the Appellant had been pressured into pleading guilty on the day in question. 16 I base this on the events of the day the plea was taken. I return here to what I have said at [6] above and in particular to what transpired in the period between about 10.00am (when the Appellant changed her mind and said she did not wish to plead guilty) and 11.00am (when, after a further discussion with Mr Singh, she again changed her mind and said she would plead guilty after all). 17 Although the events of this hour were not described with great consistency in the SDs filed by the parties, it is common ground that the Appellant decided to plead guilty after the DC conveyed three things to her. One of those three things (or a combination of them) must have caused her change of mind, given that she had misgivings about pleading guilty all along. The three things are these: (a) First, that the trial would proceed on all the charges, and the DPP had asked the witnesses to stand by and indicated that she was ready to proceed immediately with the trial. (b) Second, the DC would have to discharge himself (without seeking an adjournment, according to the Appellant) as the Appellant had not given him any instructions on her defence. (c) Third, the Appellant could be remanded at the Institute of Mental Health (“IMH”). The Appellant deposed that the DC told her that she “might face being sent to [the IMH] immediately as the Judge [had] inherent rights to do so”. The DC for his part explained that this arose in the context of him saying that he would discharge himself if the matter proceeded to trial as he had not been instructed on the Appellant’s defence. The Appellant had then asked what would happen if she could not give evidence, and the DC had explained in reply that “the Court had the power to have her remanded at [the IMH] and a report would be prepared to ascertain if she was able to give evidence”. 18 In my judgment, the third point is crucial. The power to remand an accused person in the IMH, which is provided for in s 247 of the CPC, arises when the court has reason to think that an accused person may be incapable of making his or her defence owing to unsoundness of mind. The basis on which the question of the Appellant’s mental fitness to stand trial would have arisen is unclear to me because that issue had never been raised up to that stage. For my part, I could see no reason to think that s 247 was likely to be invoked in this case. During the adjourned hearing, Mr Singh explained that the Appellant was stressed and this was why he thought it necessary to convey the possibility of a remand order being made pursuant to s 247. Perhaps something was lost in their exchange. But, the point is this: simply put, the suggestion that one possible consequence of not pleading guilty might be that the Appellant could find herself remanded at the IMH would have been an alarming one to the Appellant. I emphasise that there is no dispute that the suggestion was made. If this was in fact a sufficiently real possibility at that time then counsel would have been entitled and indeed obliged to convey this; but I am not satisfied in the circumstances that it was so because, at least on the evidence before me, there was nothing to suggest that the Appellant was unable to proceed with the trial because of mental unsoundness, rather than that she was simply not ready to do so because she was unprepared despite all the time that had already been expended. In my judgment, this was a sufficiently disturbing prospect and, in the particular circumstances of this case, it did unfairly deprive the Appellant of her freedom to choose between pleading guilty and pleading not guilty. 19 As to the first two points, I take the view that the DC was well within his rights and perhaps even his duty to have made those points. More importantly, I think that neither of these points would or should have surprised the Appellant or caused her to change her mind about pleading guilty. As for the first point, the Appellant would have known full well that going to trial on all the charges was the only alternative to pleading guilty, having been through three mentions and five pre-trial conferences spanning three and a half months. She should also not have been surprised that the trial would proceed immediately, given that it had been set down for hearing on 5, 10 and 11 February in the first place. As for the second point, the Appellant had never given the DC any instructions to prepare a substantive defence or mitigation in the first place and was nonplussed when the DC later discharged himself on 19 February. Therefore, I can only conclude that it was the third point—that the Appellant might be remanded in the IMH—which was the critical point that caused her to change her mind. 20 Finally, it is also significant in my judgment that all this transpired against the backdrop of the Appellant having repeatedly expressed sustained misgivings over pleading guilty, which was reflected also in her vacillation on this issue. 21 To be sure, I do not fault the Prosecution or the DJ. They were not privy to the matters I have discussed, which were private to the Appellant and Mr Singh. Further, I have no reason to doubt that Mr Singh believed that the Appellant was also concerned about her medical fitness to proceed with the matter but, as I have said, something may have been lost in the exchange between the Appellant and Mr Singh. Fault, however, is not the central issue here. That issue is whether the Appellant pleaded guilty under pressure. On balance I think she did. It may be that claiming trial turns out to be a wholly ill-conceived course of action, but ultimately it is the Appellant’s entitlement to claim trial if she wishes to do so. She may succeed at trial or she might fail. If she fails at trial, it might conceivably result in a stiffer sentence being imposed than that which has been meted out. Those are factors she will have considered and, ultimately, they are matters for another day because she is entitled to be tried on the charges that have been brought against her unless she chooses, of her own volition, not to contest the charges. For the reasons I have outlined, I do not think her decision to plead guilty was made in such circumstances. 22 In the circumstances, I allow the appeal in Magistrate’s Appeal No 9031 of 2016. I order that the conviction be set aside and that the matter be remitted for trial in the State Courts. 23 There is also Criminal Revision No 9 of 2016, which the Appellant filed on 3 August 2016, a day before the appeal was fixed for hearing. Her allegations there concerned the circumstances in which the offences were committed and the way in which she had been arrested and her matter had been investigated. However, the relief she sought was unclear. I have set aside the conviction in the appeal in any event. Accordingly, I dismiss the application for revision since it can have no further purpose. Sundaresh MenonChief Justice The appellant in MA 9031/2016 and applicant in CR 9/2016 in person; Ang Feng Qian and Parvathi Menon (Attorney-General’s Chambers) for the respondent in MA 9031/2016 and respondent in CR 9/2016."
    }
}