{
    "case_title": "Public Prosecutor vRosdi Bin Joenet",
    "ncitation": "[2016] SGHC 58",
    "coram": "Foo Chee Hock JC",
    "sections": {
        "The rehabilitative principle – the accused’s need for treatment and risk of reoffending": "13 In examining the above issues, I shall make reference to four psychiatric reports by Dr Bharat Saluja, Consultant, Institute of Mental Health, and will be reproducing extracts from them.  For convenience, they shall be referred to by their location in the SOF as follows: (a) Report dated 10 December 2012 – Tab B of SOF. (b) Report dated 14 March 2014 – Tab C of SOF. (c) Report dated 11 May 2015 – Tab D of SOF. (d) Report dated 12 June 2015 – Tab E of SOF. 14 One main point relied on by Mr Abraham Vergis for the accused was that the risk of reoffending by the accused was low.  If reliance was placed on Tab C of SOF (p 2, the second paragraph), then it should be noted that the assessment was outdated as the “clinical risk factors may have changed” and no formal risk assessment had been done.  However, Dr Saluja did state for the record at Tab D of SOF (p 4, section J, para 2) that the accused’s “risk of committing future violence appears to be low currently despite him continuing to have delusional beliefs against his deceased wife and poor insight regarding his mental disorder.” (See also Tab E of SOF, p1, under “Opinion”.)   Dr Saluja did postulate two possible scenarios where the risk of violence may be increased (at Tab E of SOF, p 1): 1) If he pursues his wife’s alleged lover (which he denied in interviews) or 2) If his delusional system (beliefs that are false, firm and fixed) incorporates other individuals which may happen if his illness remain untreated. 15 That said, it must be noted that the reports had been prepared on the present basis that the accused had not undergone any treatment yet.  This was an important point because we did not have the benefit of a prognosis based on his response to medication or psychotherapy.  So the psychiatric reports had to be considered for what they were saying with that caveat in mind.  The other implication was that we must be sensitive to this dissimilarity with the two precedent cases discussed above. 16 The responsibility that fell on this court was to sentence the accused in his present condition.  He was not well, he was not healed and he had not begun any treatment.  He still “harbour[ed] delusional thoughts against his deceased wife” and the “symptoms of his disorder are still active” (Tab E of SOF, p 1, under “Opinion”).  There was evidence that he was still in denial (see Tab B of SOF, p 3, section D, para 1; and Tab D of SOF, p 2, section C, para 5). 17 I should next deal with the length and prognosis of treatment.  In Tab C of SOF, p 1, under “Treatment Plan” and Tab D of SOF, p 4, section J, para 1, Dr Saluja stated that the delusional disorder – jealousy subtype which the accused was diagnosed with “is typically chronic and lifelong disorder unless treated”.  In Tab E of SOF (p 1), under “Treatment”, Dr Saluja highlighted that the key to success was trust in the therapist. The treatment would comprise medication and psychotherapy, where Cognitive Behavior Therapy had the “best evidence” (Tab E of SOF).  However the doctor qualified his opinion by saying that “[t]his is a successful treatment when done right; however, it is a long and difficult process for both the patient and therapist and can take months (or even years) for progress to be made” (Tab E of SOF, p 2, under “Psychotherapy”).  He concluded by stating that his estimate was that the accused “would require 1 - 2 years of treatment but success of treatment is guarded” (Tab E of SOF, p 2, under “Psychotherapy”). 18 In addition to the delusional disorder, the accused was “exhibiting symptoms of depressive disorder which is a common comorbidity with delusional disorder” (Tab D of SOF, p 4, section J, para 1).  This comorbid depressive disorder carried its own risks and difficulties (see Tab D of SOF, p 4, section J, para 4).  The accused had a heart attack in 2013 and was on medication for his cardiac condition and diabetes (Tab D of SOF, p 3, section C, para 6).  I had also taken note of para 62 of the Plea in Mitigation (“Mitigation”), and the Report at Tab S (at p 232) of the accused’s Bundle of Authorities and Documents (“BOD”). 19 On the point of social and family support for the accused (see paras 51 and 52 of Mitigation), the comforting picture submitted by Mr Vergis must be weighed against the challenges that the accused would face on release from prison (see also para 43(b) of Mitigation).  His mother-in-law had said that she would not be living with him and the children on the accused’s release, leaving him to look after his children (Tab D of SOF, p 3, section G, para 1 and Letter of Appeal at Tab D of the accused’s BOD).  The accused indicated that he wanted to take a course and obtain a licence to be a taxi driver (Tab D of SOF, p 3, section I, para 1).  While his children and extended family may give him the moral support and loving environment, that had to be balanced with his role as provider and head of the family and his motivation to follow through with the treatment. 20 On the material before me, I was sceptical that there would be adequate support for the accused if he had not substantially recovered from his psychological problems upon his release.  The arguments made on behalf of the accused assumed that the threat of a recurrence was non-existent once the object of his delusional disorder was no more (para 63 of Mitigation).  In the light of the above discussion, I could not justify treating the accused as if his mental disorder had distinctly ended (see paras 43(c) and 47 of Mitigation).  Quite apart from the protection of the general public, the court needed to be assured that he would not be a threat to his own support system upon his release. 21 The above, which was explored and argued substantially at the hearing, discussed the application of the rehabilitative principle to our facts.  However, the retributive and protection of the public principles were also relevant for sentencing.",
        "Principles of retribution and protection of the public": "22 The essence of the retributive principle as applied to our facts was that due punishment was required for such a grievous offence, notwithstanding that the accused was suffering from a mental disorder.  The commentary in Kow Keng Siong,Sentencing Principles in Singapore(Academy Publishing, 2009) at para 18.125, which was essentially approved by the Court of Appeal inLimGhim Peow v Public Prosecutor[2014] 4 SLR 1287 at [39], stated the position clearly: The retributive principle features prominently in the sentencing of mentally disordered or intellectually challenged offenders where the offence isparticularly serious or heinous.In such cases, it appears that the retributive principle may even prevail over the rehabilitative principle. 23 The sentence here must also reflect the principle of protection of the public.  The prosecution citedPublic Prosecutor vGoh Lee Yin and another appeal[2008] 1 SLR(R) 824 at [108] in support (see para 9 of Prosecution’s Submissions on Sentence): … [I]n cases involving serious offences, incapacitation would usually form the focus of the sentencing process.  InPP v Lim Ah Liang([94]supra), I noted at [41] that incapacitation aims to deal with severely mentally-ill offenders in such a way as to make them incapable of offending for substantial periods of time.  It is popularly referred to as “public protection” and advocates the imposition of long, incapacitative custodial sentences on “dangerous” offenders when the potential risk to prospective victims is substantial.  In my view, such a consideration would be highly relevant in cases involving serious offences notwithstanding the fact that the offender suffers from an impulse control psychiatric disorder, which causes the commission of the very offence. …  24 There was no doubt that this was a serious and heinous offence, attracting the principles of retribution and incapacitation.  As I stated in open court before passing sentence, the attack by the accused on his wife, leaving her with the 26 injuries noted in the Autopsy Report (see above), was vicious and violent.  The prosecution highlighted para 9 (the weapon used and the deceased screaming from the room) and para 10 (the deceased’s mother demanding that the door be opened and the deceased begging the accused not to kill her) of the SOF. I was prepared to accept that there was no premeditation (see para 56 of Mitigation).  While Mr Vergis pointed out that the catalogue of injuries noted included defensive and superficial injuries (see Official Transcript at p 40), the injuries nonetheless pointed to a savage attack on a defenceless victim.  Although the accused had no history of violence, the effect of his delusional disorder was devastating when triggered.  This allusion to the description inKwokTeng Soon(at [30]) was made with full awareness that the sentencing considerations inKwokTeng Soonmay not be wholly applicable here. 25 I should also make reference to the likelihood of a relapse of the accused’s condition with heinous consequences.  It is sufficient to say that the sentence inHan John Hanwas of limited guidance here.  The court there was confident of Han John Han’s recovery, since he had undergone treatment.  The court was also satisfied that for all practical purposes, he was not a danger to others.  The position of the present accused was clearly distinguishable (see the discussion on the rehabilitative principle above).  In these circumstances, the submission of 6 years’ imprisonment by Mr Vergis could not do justice on the facts here.  There was a need for a more substantial term of imprisonment.",
        "The court’s decision": "26 In assessing the appropriate sentence, I further considered the accused’s plea of guilt and remorse; and his co-operation with the authorities in the investigation of this matter.  The accused had no antecedents which were relevant for sentencing and I accepted that it was his abnormality of mind that caused his actions on that fateful day (see Tab B of SOF, p 10, section M, para 4).  I also considered his personal circumstances, and his family circumstances before and after the tragic event of 17 November 2012.  In this regard, the sentence should express such compassion as was permitted by the law. 27 Considering all relevant matters in the round, I was of the view that the appropriate sentence should be an imprisonment term of 9 years.  In exercise of my discretion, I backdated the sentence imposed to 18 November 2012, the date of remand. Foo Chee HockJudicial Commissioner Wong Kok Weng and Ma Hanfeng (Attorney-General’s Chambers)      for the prosecution;Abraham Vergis (Providence Law Asia LLC) and                                             Nadia Ui Mhuimhneachain (Kalco Law LLC) for the accused."
    }
}