{
    "case_title": "Public Prosecutor vSuventher Shanmugam",
    "ncitation": "[2016] SGHC 178",
    "coram": "Kan Ting Chiu SJ",
    "sections": {
        "The facts": "4 The prosecution tendered a Statement of Facts which was admitted by the Accused without reservation. The key facts were that on 16 May 2015, the Accused entered Singapore at the Woodlands Checkpoint in a bus. While he was going through immigration clearance, he was instructed to remove his sweater. When he did that a bulge was seen in the front of his shirt, and when the shirt was lifted, a block wrapped in plastic was found tucked at the waist of his trousers. A second block similarly wrapped in plastic was tucked at the back of the trousers. 5 The two blocks were subsequently found to be 971.5 grams and 996 grams of vegetable matter. When the blocks were analysed by the Health Sciences Authority, the first block was found to contain not less than 404.7 grams of cannabis and not less than 512.5 grams of cannabis mixture, while the second block was found to contain not less than 431.3 grams of cannabis and not less than 513.2 grams of cannabis mixture. In total, there were not less than 836 grams of cannabis and not less than 1,025.7 grams of cannabis mixture. 6 Subsequent investigations revealed that the Accused had brought the two blocks into Singapore on the instructions of one Bathumalai A/L Veerappen (“Bathumalai”). Bathumalai had handed to the Accused a plastic bag with instructions for him to deliver it to someone at Kampong Arang Block 9, on the promise that Bathumalai will pay the Accused something (which the Accused understood to mean money) upon successful delivery. 7 When the Accused was in a bus on the way to Singapore, he opened the plastic bag that Bathumalai handed to him, and saw the two blocks which he recognised as “ganja” (Malay for cannabis) by the smell. At the Woodlands Checkpoint the Accused took the two blocks out of the plastic bag and hid them under his shirt in the front of his stomach and behind his back, from where they were recovered when he was arrested. 8 Upon the Accused’s admission of the facts, he was convicted on the first charge. At that time, the prosecution applied for the second charge to be taken into consideration for the purpose of sentencing. The effect of the application was explained to the Accused, and he consented to it. He also admitted the facts in the Statement of Facts relating to the cannabis mixture which was the subject of the second charge.",
        "The mitigation plea": "9 The Accused is a Malaysian. He is single and is currently 23 years old. Prior to his arrest, he was working as a cleaning supervisor in Singapore earning S$1,700 a month. He came from a poor family, his father is sick and unemployed and his mother is a housewife. He contributed RM1500 monthly to support his family. 10 He had agreed to carry and deliver the drugs to Singapore for Bathumalai to get some money. He was a mere courier with no interest in the drugs. He is a first offender and he maintained that he had co-operated with the Central Narcotics Bureau (“CNB”) in the investigations. Counsel for the Accused said that the Accused is deeply remorseful for what he had done, and has demonstrated his remorse by pleading guilty. He is not a hardened criminal and is not beyond rehabilitation. Counsel then submitted that the minimum mandatory sentence of 20 years imprisonment should be imposed and be backdated to run from the date of the Accused’s arrest. 11 The prosecution responded to the Accused’s mitigation plea. First, it pointed out that as he had been caught red-handed with the drugs on his body, his admission of guilt is of little or no mitigation value.  Secondly, potential hardship to an accused person’s family normally does not qualify as a mitigating factor save in exceptional circumstances, and there are no such circumstances in the present case. Finally, the prosecution disagreed that the Accused had co-operated fully with the CNB in the investigations. It was disclosed that subsequent to the Accused’s arrest, the CNB conducted a follow-up operation where they instructed the Accused to speak on the telephone with someone to find out who the drugs were intended to be delivered to so that he may be identified and arrested. According to the prosecution, the telephone conversation was recorded and the transcript revealed that the Accused had tipped the person off by telling him that he has been arrested and the Accused did not dispute that, maintained that he did so because the CNB officers specifically instructed him to. 12 The prosecution tendered a table of four cases of sentences imposed where the weight of the cannabis in the charge were reduced from the weight of the drugs actually involved so that the mandatory death sentence did not apply, and where the accused persons had pleaded guilty. Three of these cases also involved offences being taken into consideration for the purpose of sentencing. The four cases are  – i CC 41/2004 Offence – trafficking in 499 g of cannabis (reduced from 749.17 g) Taken into consideration – trafficking in 458.91 g of cannabis mixture Sentence – 26 years imprisonment and 15 strokes of the cane (appeal against the sentence dismissed by the Court of Appeal)  ii CC 17/2007 Offence – trafficking in 499 g of cannabis  (reduced from 5,061.1 g) Second charge – trafficking in 999 g of cannabis mixture (reduced from 2,078.3 g) Special circumstances – the accused had an IQ of 62 and was mildly retarded Sentence – 20 years imprisonment and 15 strokes of the cane for each charge, ordered to run concurrently resulting in a global sentence of 20 years imprisonment and 24 strokes of the cane  iii CC 3/2008 Offence – importing 499 g of cannabis  (reduced from 619.14 g) Taken into consideration – importing 999 g of cannabis mixture (reduced from 1,110.2 g) Sentence – 22 years imprisonment and 15 strokes of the cane  iv CC 26/2012 Offence – trafficking in 499 g of cannabis (reduced from 576.5 g) Taken into consideration – trafficking in 324.4 g of cannabis mixture Special circumstances – the accused had a genetic risk of contracting muscular dystrophy, and had feminine tendencies which would lead to a psychological effect given a period of incarceration in a male institution. Sentence – 20 years imprisonment and 15 strokes of the cane The prosecution drew attention to the fact that in the second case and the fourth case where the minimum custodial sentence was imposed, there were special circumstances relating as the accused persons.",
        "My decision": "13 I agreed with the prosecution that there was little in the way of mitigation. The Accused pleaded guilty after he was arrested in very incriminating circumstances. He is a young adult who was, at the time of his arrest, in gainful employment earning a decent income. He committed the offence for easy money, knowing that he was carrying two blocks of “ganja”, which were cannabis and cannabis mixture. Although he had admitted to the offence, he did not assist the investigators to apprehend the person who was to collect the drugs from him when he was asked to do so in the CNB’s follow-up operation following his arrest. 14 There were two other factors which I took into account in sentencing the Accused – (i) the reduction of the weight of the cannabis in the principal charge; and (ii) the second charge which was to be taken into consideration for the purpose of sentencing.",
        "Reduction in the weight of the cannabis": "15 The sentence prescribed for the offence he was convicted of (importing 499 grams of cannabis) spans a minimum 20 years imprisonment and 15 strokes and a maximum 30 years or life imprisonment and 15 strokes of the cane. If the prosecution, in proceeding with the principal charge against him, had not reduced the weight of the cannabis from 836 grams which he was actually carrying to 499 grams, he could have faced the death penalty. When the weight was brought down to 499 grams, the Accused did not have to fear being sentenced to death. 16 The effect of a reduction from the actual weight of drugs and the avoidance of the death penalty on sentencing has been considered judicially. InPP v Rahmat Bin Abdullah and Another[2003] SGHC 206 Choo Han Teck J stated (at [9]) that: …it would be relevant to take into account the quantity and weight of the drugs seized, but one must not exceed the relevancy of this factor, and regard the DPP’s decision to amend the charge to a non-capital one as justifying a higher sentence in itself. 17 Tay Yong Kwang J (as he then was) added clarity to the issue in two recent judgments. InPP v Kisshahllini a/p Paramesuvaran[2016] 3 SLR 261 he stated (at [13]) that: The accused had admitted to importing 18.03g of diamorphine. The Prosecution exercised its discretion to proceed on a non-capital charge, which is that of the unauthorised importation of not less than 10g but not more than 15g of diamorphine. Both parties agreed that the total amount of diamorphine that was actually imported was relevant to be sentence.I disagreed with the Defence that the minimum sentence of 20 years imprisonment would be adequate.(emphasis added) and inPP v Nguyen Thi Thanh Hai[2016] 3 SLR 347 where the accused person was charged and convicted for importing 249.99 grams of methamphetamine (a weight more than 250 grams would attract the death penalty) when the actual weight of the drug involved was 2,041 grams, Tay J made it clear (at [32]) in passing sentence that: Given that theactual amountof methamphetamine that the accused admitted to importingfar exceeded 250g, a sentenceabove the minimumof 20 years of imprisonmentwas warranted.(emphasis added) 18 There is no question that when the prosecution decides to proceed on a reduced non-capital quantity of drugs, the accused cannot be sentenced on the basis of the actual quantity of drugs involved. However, when it comes to imposing custodial sentence within the prescribed range, it is right that regard be given to the actual amount of drugs involved, and a higher sentence be imposed if the court considers it appropriate.",
        "Charge taken into consideration": "19 The second charge of importing cannabis mixture was not proceeded with. Instead it was dealt with under s 148(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) which provides that: If the accused is found guilty of an offence in any criminal proceedings begun by or on behalf of the Public Prosecutor, the court in determining and passing sentence may, with the consent of the prosecution and the accused, take into consideration any other outstanding offences that the accused admits to have committed. 20 What effect does having an offence taken into consideration have for the purpose of sentencing for the principal charge? One short answer was provided by Yong Pung How CJ at [19] inPP v Mok Ping Wuen Maurice[1998] 3 SLR(R) 439 (“Mok Ping WuenMaurice”), that: The effect of taking into consideration outstanding charges is to enhance the sentence that would otherwise be awarded. 21 This proposition has been refined in subsequent judgments. InNavaseelan Balasingam v PP[2007] 1 SLR(R) 767 (“Navaseelan”), the accused/appellant had pleaded guilty to ten charges (the principal charges): (a) five charges under s 4 of the Computer Misuse Act (Cap 50A, 1998 Rev Ed) (“CMA”) for causing automated teller machines to access data held in the central computer systems of a bank, resulting in unauthorised withdrawals from accounts with the bank; and (b) five charges under s 379 of the Penal Code (“PC”) (Cap 224, 1985 Rev Ed) for theft of money from the bank through those withdrawals. 22 The accused /appellant also consented to have 258 charges (comprising 129 charges under s 4, CMA and 129 charges under s 379, PC) taken into consideration for the purpose of sentencing. On his appeal against sentence imposed by a District Judge, Tay J exercised his powers of revision and increased the sentence imposed by the District Judge. Tay J noted in his judgment at [17] that “the appellant had admitted many moresimilaroffences and that fact mustaggravatethe chargesproceeded with”. (emphasis added) 23 InPP v UI[2008] 4 SLR(R) 500, Chan Sek Keong CJ undertook a review on how charges taken into consideration are to be reflected in the sentences imposed for the offences actually proceeded with. He referred toMok Ping Wuen MauriceandNavaseelan, and surmised at [38] that while there is no hard rule that a court must increase the sentence imposed for offences proceeded with, when offences have been taken into consideration for the purpose of sentencing, a sentencing court would have erred if it “decides not to consider the TIC offences asaggravating the offences proceeded withwhere it is clear that the (TIC) offences should be so considered”. (emphasis added) 24 The references were made to similar and aggravated offences because principal charges and charges taken into consideration are not necessarily similar and aggravating. They may be similar and the offences taken into consideration may aggravate the principal offences, as inNavaseelanand the present case. On the other hand, the offences may be unrelated so that an offence taken into consideration does not aggravate the principal offence, e.g. where the principal offence is of drug trafficking and an offence of illegal moneylending is taken into consideration. A higher sentence would generally be appropriate when the offences taken into consideration are similar to the principal offences and aggravate them, with room for flexibility where that connection is not present. 25 Reverting to the facts of the present case, the Accused’s importation of the cannabis mixture was part of the same transaction as the importation of the cannabis, as the cannabis mixture and the cannabis were parts of the same blocks, and they were both “ganja” to the Accused. In the context of the concurrent sentence/consecutive sentence dichotomy, this can be a good case for a concurrent sentence, if both charges were proceeded upon. 26 That, however, is not the test to be applied in the present situation, since the prosecution had elected to proceed with only one charge. There was a significant amount of cannabis mixture, whether we take the weight of the drug in the charge or the actual weight recovered from the Accused. That aggravated the Accused’s culpability for importing drugs into Singapore, and the sentence for the principal offence should be enhanced on account of that. 27 As I have noted, the Accused had put forward scant mitigation – his plea of guilt and the fact that he is a first offender. Against that, he is an able-bodied young man who was in gainful employment and who had freely and knowingly carried the drugs for reward. He had the benefit of having the weight of the cannabis reduced in the principal charge so that he avoided the death penalty, as well as having the charge of importing a high quantity of cannabis mixture taken into consideration for the purpose of sentencing and not proceeded with as a separate offence. 28 In all the circumstances, I cannot agree with defence counsel’s submission that the Accused should receive the minimum custodial sentence of 20 years imprisonment. The prosecution, on the other hand, had submitted that a term of 23 years imprisonment with the mandatory 15 strokes of the cane should be imposed. I agreed with that, and sentenced him accordingly. I further ordered that the sentence was to be backdated to run from the date of the Accused’s arrest on 16 May 2015. 29 The Accused is appealing against the sentence. Kan Ting ChiuSenior Judge Wong Woon Kwong (Attorney-General’s Chambers) for the Prosecution;Ram Goswami (Ram Goswami) for the Accused."
    }
}