{
    "case_title": "Max Master Holdings Ltd and others vTaufik Surya Dharma and others and another suit",
    "ncitation": "[2016] SGHC 147",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 The two suits before me involved largely the same parties. They were heard together as there was an overlap of facts and issues. What was in contention in the first suit, Suit No 13 of 2014 (“Suit 13”), was essentially the ownership of shares in a holding company. This would then determine the control of other entities, including an Indonesian company which carried out coal mining operations in Indonesia. The outcome turned on what happened in a meeting in Singapore on 1 October 2012. The Plaintiffs in Suit 13 claimed that there was an agreement to transfer their shares in the 3rd Defendant, United Coal Holdings Inc. (“UCHI”), to the 1st and 2nd Defendants to allow the latter to better arrange for the onward sale of PT UCI, by way of the disposal of holding companies, with the proceeds of sale to be distributed in a specific way. The Defendants, on the other hand, claimed that the shares were transferred outright to the 1st and 2nd Defendants with the possibility of repayment of loans owed to the shareholders of UCHI if there was any surplus generated. No minutes were taken of that meeting and no follow-up documentation was created. Thus, much time at trial was spent on the evidence in respect of emails, meetings and discussions in the months after the meeting to enable the court to come to a conclusion about what exactly transpired at the meeting itself, as well as the consequences which flowed from that meeting. 2 The second suit, Suit No 101 of 2014 (“Suit 101”), concerned loans made to some of the companies involved and the liability to repay. Funds were transferred to the 1st Defendant, United Coal Pte. Ltd. (“UCPL”), and the 2nd Defendant, Knightsbridge Global Pte. Ltd. (“KBG”). The Plaintiffs in Suit 101 claimed that the money came from them and was repayable to them by UCPL, KBG as well as UCHI, which received the benefit of these loans. These three companies, who were the Defendants in Suit 101, denied this. Again, the transfer of funds was not accompanied or preceded by much documentation. 3 With respect to Suit 13, I found that the agreement was one for transfer of shares to facilitate the sale of the companies. As regards Suit 101, on the other hand, I found that the loans were not shown to be repayable by the Defendants. The parties have appealed and cross-appealed.",
        "Background": "",
        "Suit 13": "4 The 1st Plaintiff, Max Master Holdings Limited (“Max Master”), is a British Virgin Islands (“BVI”) company whose sole director was Mr Suhadi Zaini (“Suhadi”). Max Master was a shareholder of UCHI. The 2nd Plaintiff, Mr Kow Chee Choy (“Tommy”), was a shareholder of UCHI and a director of both UCHI and UCPL. The 3rd Plaintiff was Mr Sulaiman Leban Koswara (“Sulaiman”), another shareholder of UCHI. 5 The 1st Defendant, Mr Taufik Surya Dharma (“Taufik”), was a shareholder of UCHI through his wife and a director of UCPL and KBG. The 2nd Defendant, Mr Herumanto Zaini (“Heru”), was a shareholder of UCHI and a director of UCPL and KBG. Another shareholder of UCHI was a company, Fahrenheit Assets Co., Inc. (“Fahrenheit”), which was solely owned by one Mr Hendrik Chandra (“Hendrik”). UCHI, in turn, wholly owned UCPL and KBG. UCPL and KBG respectively owned 99% and 1% of PT United Coal Indonesia (“PT UCI”).  6 A simplified diagram setting out the parties’ relationships is below:          7 PT UCI, an Indonesian company, was at the material time engaged in coal mining in Indonesia. Taufik and Heru were the president director and director of PT UCI respectively. Taufik was significantly involved in the day-to-day running of PT UCI. The decision was made to purchase, rather than rent, coal mining equipment. To finance this, loans were taken from a bank by the name of Bank Mandiri. Personal guarantees were asked for by the bank and these were eventually provided by Taufik and Heru in 2011. As it turned out, Taufik and Heru appeared to conclude that their position was exposed and risky. The parties differed as to what transpired at this time: Taufik and Heru contended that the giving of counter-guarantees was discussed. The Plaintiffs denied this. 8  A meeting was eventually held on 1 October 2012. This meeting involved Taufik, Sulaiman, Hendrik, Heru, Tommy, Suhadi and one Mr Sunredi Admadjaja (“Sunredi”). 9 The outcome of this meeting was disputed. According to the Plaintiffs, Taufik proposed a plan to sell PT UCI and its assets. This was to be effected by UCHI selling its shares in UCPL and KBG. To facilitate the sale, the shares in UCHI would be transferred to Taufik and Heru. The Plaintiffs claimed that a time frame of several months in respect of the sale was agreed upon. The Plaintiffs further contended that the agreement also required the maintenance of the status quo of UCHI and the other companies pending the sale. The proceeds of the sale would be used to: (a) repay the loans from Bank Mandiri; (b) repay a S$1 million loan extended by Max Master to KBG to purchase two units at 237 Alexandra Road, The Alexcier (“the premises”); (c) pay a bonus to Taufik and Heru for working on the sale; and (d) repay the creditors of UCHI for loans extended to UCPL and/or on behalf of UCHI. The remaining proceeds would then be distributed to the shareholders of UCHI in proportion to their shareholding. 10 The Defendants, on the other hand, contended that the agreement was instead for the transfer of the other shareholders’ shares to Taufik and Heru, as they had run risks by giving personal guarantees to Bank Mandiri in respect of loans granted to PT UCI. Following such transfer, Taufik and Heru would not have any right to seek contributions for UCHI’s liabilities, while the transferring shareholders would give up their own rights save only for the repayment of any amounts that were outstanding to them by UCHI.",
        "Suit 101": "11 In 2008, money was received by UCPL in various tranches totalling S$2.5 million and US$2.5 million. These were recorded as owing to UCHI, but the Plaintiffs contended that these were really from Max Master, as shown by payment being made directly by Max Master and repayment being effected directly to Max Master. Suhadi also made payments to UCPL totalling about S$1.2 million, though again these were recorded as owing to UCHI. Finally, there was also a loan to KBG for a sum of S$1 million. This was recorded as owing to Colbert Marina Holdings Inc. (“Colbert”), a BVI company. The Plaintiffs claimed that UCHI, UCPL and KBG were jointly and severally liable for the monies loaned to UCPL and KBG, primarily on the basis that the companies were treated as a single economic entity. The Defendants denied any liability for repayment of the money.",
        "The arguments": "",
        "The Plaintiffs’ case in Suit 13": "12 The Plaintiffs argued that at the meeting on 1 October 2012, it was agreed that PT UCI was to be sold. Taufik and Heru were tasked to find a buyer as Taufik was already in contact with potential buyers then. If the sale materialised, the proceeds would be used to: (a) repay the loans from Bank Mandiri; (b) repay a S$1 million loan extended by Max Master to KBG to purchase the premises; (c) pay a bonus to Taufik and Heru for working on the sale; and (d) repay the creditors of UCHI for loans extended to UCPL and/or on behalf of UCHI. The remaining proceeds would then be distributed to the shareholders of UCHI in proportion to their shareholding. The transfer of shares to Taufik and Heru was solely to facilitate the sale by them, so that no further approval by the others needed to be sought. Speed was required as Taufik had told the parties that the sale had to be carried out as soon as possible. 13 On behalf of the Plaintiffs, it was argued that various points went against Taufik and Heru’s contentions that the shares were given to them absolutely. Taufik’s contention that he had taken on the risk of action through taking ownership of the shares ran counter to the position under Indonesian law that the shareholders of UCHI could not be liable for the indebtedness of PT UCI. No counter-guarantee or contribution was to be made to Taufik and Heru. The evidence of the other witnesses went against their contention. The email of 12 December 2011 relied on by Taufik did not support his position, which was also contradicted by other evidence. 14 It was said that no other reason existed for the transfer of shares. Taufik’s contention that the transfer occurred in return for the assumption of personal liability by himself and Heru for the loans from Bank Mandiri could not be sound: the loans were signed before the transfer of shares. The absolute transfer of shares in return for repayment of outstanding amounts of shareholder loans did not make sense for Tommy and Sulaiman, who did not advance any loans to UCHI. 15 Following the transfer of shares, it was contended that there was no change in position by either Taufik or Heru. Any effort expended by the two were part of their effort to reduce their own personal exposures or in the discharge of their duties as president director and director of PT UCI respectively. 16 The Plaintiffs further argued that it was expressly agreed that the sale was to be within six to nine months of the meeting. Alternatively, this was to be implied as a reasonable time, given the circumstances of the coal market, that there were interested buyers and the need to maximise the sale price. Pending such sale, the status quo in the management and property of the various companies, namely, UCPL, KBG, UCHI and PT UCI, had to be preserved, and a term should be implied to this effect. The sale of the premises was part of the sale, but it was implied that Max Master’s consent had to be obtained should the premises be sold separately. 17 In the circumstances, the Plaintiffs alleged that the Defendants breached what had been agreed. No sale occurred within the period and at least one sale was aborted during this time. The status quo in respect of the management and assets of the various companies was changed by the attempted removal of Suhadi as a director of KBG and the attempted sale of the premises without obtaining Max Master’s consent. Moreover, Suhadi, Tommy and Hendrik were removed as directors of UCHI. There was also dissipation of UCHI’s assets by the improper transfer of shares owned by UCHI in United Gold Resources Pte. Ltd., a Singapore company engaged in the gold mining industry, to Artica Development Inc. (“Artica”), a BVI company controlled by Sunredi.",
        "The Plaintiffs’ case in Suit 101": "18 In Suit 101, the Plaintiffs there argued that separate loans were made: (a) by Max Master to UCPL; (b) by Suhadi to UCPL; and (c) by Max Master to KBG. 19 The Plaintiffs argued that Taufik admitted that the money advanced was shareholder loans extended by Suhadi (some of which through Max Master) to UCPL and KBG. Money was also extended to UCPL by Max Master and Suhadi directly. As money was provided by Max Master directly to KBG, this rendered KBG indebted to Max Master. UCHI had taken the benefit of the Max Master and Suhadi loans and thus owed money to Max Master and Suhadi. The loan extended to KBG could only be owed to UCHI: this reflected the parties’ intentions to treat the KBG loan as having been transferred from Colbert to UCHI. This was supported by financial statements and audit working papers. These loans were repayable on demand or, alternatively, within a reasonable time of a request for repayment. Letters of demand had been sent on 15 January 2014. 20 The Plaintiffs further argued that UCHI, UCPL, KBG and PT UCI were not treated as separate legal personalities, and the intention was for them to be treated as a single group of companies. The various cases such asNgKek Wee v Sim City Technology Ltd[2014] 4 SLR 723 (“NgKek Wee”),Lim CheeTwang v Chan Shuk Kuen Helina and others[2010] 2 SLR 209 (“Lim Chee Twang”)andManucharSteel Hong Kong Ltd v Star Pacific Line Pte Ltd[2014] 4 SLR 832 (“Manuchar”) were illustrative of the principle that separate legal personalities should not permit the evasion of legal responsibilities. The companies here used the doctrine to evade their obligations. They had received the benefit of the loans but were pushing responsibility to each other and Colbert. The Defendants had no personal knowledge of the circumstances of the loans, and their evidence was based only on their interpretation of the Defendants’ ledgers. 21 It was further raised by the Plaintiffs that before the transfer of the shares on 2 October 2012, Suhadi was the directing mind and will of the companies. He did not treat them as separate legal personalities. After the transfer of the shares, Taufik and the other parties involved in the management of the companies did not treat the companies as separate legal entities either.",
        "The Defendants’ case in Suit 13: Taufik, Heru, UCHI, and UCPL": "22 KBG, it should be noted, was primarily concerned with Suit 101, and was essentially a nominal defendant in Suit 13, and did not present arguments on Suit 13. 23 In respect of the main set of Defendants in Suit 13, that is Taufik, Heru, UCHI and UCPL, it was argued that the agreement was for the outright transfer of the shares in UCHI. This transfer arose because of the background facts. In 2011, Taufik and Heru decided that it would be an opportune time to start expanding the operations of PT UCI. PT UCI wanted to buy more mining equipment and bank financing was therefore required for this. Eventually, Bank Mandiri agreed to provide two term loans: (a) a working capital loan of up to Rp 85 billion (approximately US$9.4 million); and (b) an investment loan of up to Rp 144 billion (approximately US$16.0 million). Personal guarantees were required by Bank Mandiri. Taufik and Heru approached Suhadi in November 2011 to discuss their concerns over the personal guarantees. Suhadi informed them that he would speak to the other UCHI shareholders to indemnify Taufik and Heru in the proportion of their respective shareholdings. This was supported by an email from Suhadi to the UCHI shareholders. Taufik and Heru had proceeded to provide their personal guarantees without waiting for the counter-guarantees as time was pressing. However, PT UCI got into financial difficulties thereafter. Bank Mandiri agreed to restructure the loans. However, by May 2012, Taufik felt exposed and discussions were held between Taufik and Heru, on the one hand, and Suhadi, on the other. This then led to Suhadi sending an email calling for a meeting on 24 May 2012 to discuss the situation. At a meeting on 30 September 2012, Suhadi proposed leaving PT UCI (by ceasing to be a shareholder of UCHI and transferring his shares to Taufik and Heru), and looking only to PT UCI for repayment of the loans that he had extended to UCPL and KBG. Hendrik was to be persuaded to take the same approach. 24 The Defendants then contended that the agreement reached on 1 October 2012 was for Suhadi, Sulaiman, Hendrik and Tommy to transfer their shareholdings in UCHI to Taufik and Heru in recognition of the risks taken by Taufik and Heru in giving personal guarantees for the loans from Bank Mandiri. Such transfer was for valuable consideration. Following the transfer, Taufik and Heru would then not have any right to seek contribution from Suhadi, Sulaiman, Hendrik and Tommy for UCHI’s liabilities. In return for this, Suhadi, Sulaiman, Hendrik and Tommy would give up their shareholdings in UCHI, leaving them entitled only to the repayment of amounts outstanding to them by UCHI. Such repayment would only be made after the sale of PT UCI. In the meantime, there was no commitment to maintain the status quo in the companies. Neither was there any agreement that Taufik and Heru would be given any reward from surplus proceeds. 25 On behalf of the Defendants, it was argued that the evidence of the Plaintiffs’ witnesses in respect of the 1 October 2012 meeting could not be accepted. The transfer was for valuable consideration and the change in positions by Taufik and Heru occurred thereafter. The Plaintiffs’ version of the agreement was clearly false. Powers of attorney could have been effected if the objective was just to facilitate the sale of PT UCI. There was no basis for the Plaintiffs’ alleged implied terms. 26 It was further argued that the Plaintiffs did not plead the past consideration defence in respect of Taufik and Heru’s standing as personal guarantors for the loans from Bank Mandiri.",
        "The Defendants’ case in Suit 101: UCHI and UCPL": "27 UCHI and UCPL were initially represented separately. However, by the end of the proceedings, they had joint representation. 28 It was submitted by them that there were no loan documents or resolutions passed for the extension of the loans. There was no basis supporting the claim that UCHI was jointly and severally liable with UCPL and KBG for the repayment of these loans. The companies could not be treated as a single economic entity.",
        "The Defendants’ case in Suit 101: KBG": "29 With respect to KBG’s case in Suit 101, it was argued that there was no loan of $1 million from Max Master to KBG. There was no support for any such loan in the audited financial statements and books. Nor would KBG be liable because of the single economic entity doctrine. 30 KBG argued that the audit of accounts was to ensure that the books provide a true and fair view of the position of the company. According to KBG’s auditor, the financial statements of KBG were properly drawn up. In view of this, the fact that the loans were recorded as owing to Colbert and not Max Master was significant. The financial statements for the material years were signed off by Suhadi. Though he tried subsequently to qualify his position by saying that there was an undetected mistake, this turnaround should not be accepted. Furthermore, the 2013 audited statements were not reflective of the true position of KBG. These statements reflected changes made by Ms Shirley Low (“Shirley”), the administrative executive and bookkeeper of KBG. These changes were made without approval by the directors of KBG. A statement indicating that the holding company was Colbert, which was always present before, was omitted from the 2013 financial statements. Shirley had made the amendments without instructions from the directors. Her explanation that the previous statements were incorrect was not acceptable. There was no evidence that the loan was transferred from Colbert to UCHI. 31 It was pointed out by KBG that in the course of proceedings in Suit 13, Max Master accepted that it had given the money to KBG on behalf of Colbert. This was contrary to its pleaded case. 32 KBG argued strongly that the various companies could not be treated as a single economic entity. This doctrine has been rejected in Singapore inManuchar.Other cases such asWin Line (UK) Ltd v Masterpart (Singapore) Pte Ltd and another[1999] 2 SLR(R) 24 (“Win Line”)andPublic Prosecutor v LewSyn Pau and another[2006] 4 SLR(R) 210 (“LewSyn Pau”)havesimilarly rejected the doctrine. There were also significant differences in the characteristics of the various companies, including different business activities, different directors and separate bank accounts. 33 Finally, it was maintained by KBG that no benefit was obtained by it from the loan.",
        "The Decision": "34 In Suit 13, the Plaintiffs’ claim succeeded in part, in that the agreement reached between the parties was found to be one for the transfer of shares to Taufik and Heru to facilitate the sale of PT UCI, which was to be achieved by the disposal of UCPL and KBG. A term was implied that the sale should be completed in six to nine months. However, contrary to the claim by the Plaintiffs, no term could be implied that the status quo in the management and property of the company should be maintained in the interim. 35 As for Suit 101, I found that it was not proven that the money given to UCPL and KBG were loans from Max Master and Suhadi. Additionally, UCHI could not be held liable for any debts owed by UCPL and KBG on the basis that the companies were a single economic entity. That doctrine did not operate to render these companies liable for the debts of one another.",
        "Analysis in Suit 13": "36 The issues that arose related to what was agreed, the terms of that agreement, as well as termination and its consequences. 37 In assessing the evidence, much turned on the testimony of the witnesses as well as the consistency of the subsequent conduct of the parties. No contemporaneous or near-contemporaneous record of the agreement was made. Caution was needed in considering the subsequent conduct of the parties. Subsequent conduct could be referable to the agreement, but could also have occurred because of misapprehension as to what was agreed. It could even have been to undermine the original agreement. The court had to sift through the evidence to consider what was likely the case, bearing in mind the inherent probabilities of the situation. Here, as the parties were seasoned business people, the agreement that the court found would have had to make commercial sense.",
        "What was agreed": "38 The first question was what was actually agreed between the parties. Was the transfer of the shares to facilitate the sale of the business by Taufik and Heru, with the proceeds to be used in a specific manner? Or was the agreement for an outright transfer of the shares to Taufik and Heru, in return for the assumption of all liability and responsibility for the business and debts by them, and with the promise of repayment if there were any loans made? This was a purely evidential question, with no questions of law engaged. 39 The Plaintiffs’ version of the agreement was not a simple proposition: the transfer of shares was only to facilitate the eventual sale, and the proceeds were to be used in a very specific way. It certainly was not the most obvious method of easing the sale process: in Singapore, and in most common law jurisdictions, powers of attorney would be an obvious alternative. It would also be highly likely that there would not be any need for the shareholders to put all their shares in the hands of one of them; share transfers could be effected by the separate shareholders once agreement was reached with a buyer. However, I accepted that in the present case there were various reasons behind the need to transfer the shares to Taufik and Heru ahead of the sale. These included the need for haste, the convenience of having the shares with Taufik and Heru, and concerns over powers of attorney. 40 The Plaintiffs’ version of the agreement involved clear benefit for those involved through the repayment of the various loans incurred by the companies, a bonus to Taufik and Heru for the facilitation of the sale and the sharing of any balance among all the shareholders. 41 In comparison, despite the best efforts of counsel for Taufik and Heru, I did not accept their position that the shares were to be transferred outright. Their position ran into various difficulties which were not overcome: (a) an outright transfer was not commercially sound and did not return any benefit to the other shareholders; (b) the supposed rationale for the outright transfer could not have applied to two of the shareholders affected; and (c) the situation did not compel or require the outright transfer. What supposedly occasioned the outright transfer, namely, the promise of counter-guarantees, never actually came to pass. Taking all of these together, it was the Plaintiffs’ version that was more likely than not and thus established on the balance of probabilities. Transferring to facilitate sale was plausible 42 I accepted the Plaintiffs’ contention that there was an understanding that there was a need for the sale to be completed as promptly as possible, and that powers of attorney were not considered suitable. I also noted from the testimony that the shareholders were occasionally dispersed out of Singapore, or even Jakarta on their travels for work. I did not accept the Defendants’ arguments against the credibility of the Plaintiffs’ witnesses, particularly Suhadi. (1) Need for a prompt sale 43  There was clear evidence that a sale had to occur as soon as possible, with the volatility of the coal market being a significant driver. 44 There were also potential buyers who were said to be interested at the time. Suhadi’s evidence at trial was as follows:1Foot Note 1×Transcript, 6 March 2015, p 71. Q  What did he say to you all? A  He said, er, “You transfer all the shares so I can do it quickly because, er, the buyers”, he told us, “the potential buyers are already waiting and talking. So we need to do it fast. And I trusted him. Unfortunately, it---it---I’m in this position now. (2) Convenience 45 Suhadi’s affidavit evidence that transfer to facilitate a sale was convenient was not controverted or undermined:2Foot Note 2×Suhadi Zaini’s AEIC, para 22.15. In order to facilitate the sale of PT UCI and assets of UCHI, Taufik and Heru asked that all the other shareholders transfer their shares in UCHI to Taufik and Heru. This is because they (Taufik and Heru) did not want to go back and forth to the shareholders to seek their approval when they have secured a buyer for PT UCI and assets of UCHI. It also makes it easier for them to make a decision on the sale of PT UCI and assets of UCHI whereby they will be able to close the deal with the buyer immediately, if the need arises. Convenience thus served the need for haste and efficiency. (3) Discomfort with powers of attorney 46 The fact that powers of attorney could have been used was a matter of some concern. The Defendants said that the failure to make use of such instruments showed that the Plaintiffs’ version could not be accepted. The Plaintiffs, however, brought in the testimony of Suhadi that powers of attorney were not used much in Indonesian transactions because of doubts about their acceptance, at least between those in business:3Foot Note 3×Transcript, 9 March 2015, p 140–141. Q  All right, as of first of October 2012, you also understand what is the power of attorney? A Yes. Q   Now, you said that, you know, Pak Taufik told you, “Well, transfer the shares to me. It’s just going to be more convenient.” … why didn’t you just say, “No. I will just give you a power of attorney instead. Why transfer the shares?” A   In the Indonesia legal system whether you believe it or not ... is that when it involve sales or transaction, they don’t really like power of attorney. Do you know when we buy land from people, not only they have to sign, you know, notarial deeds now in Indonesia? Because of this forgery and everything, you have to put your fingerprint stamp … on the paper. … … A ---power of attorney, especially in a big transaction, Your Honour, nobody likes it. 47 In addition, it was put to Suhadi that a power of attorney was not suggested because Taufik never suggested that the transfer was to facilitate the sale. This was denied by Suhadi. While evidence on this point was only given by Suhadi, it was plausible and also sufficient to give some explanation for why this mechanism was not used. In the end, therefore, I did not count this against the Plaintiffs’ case. (4) The Defendants’ contentions were not made out 48 The Defendants’ attacks against the agreement being one for facilitation were not made out eventually. The Defendants mounted the following two broad contentions: (a) that the behaviour of Suhadi was inconsistent with the transfer of shares being to facilitate the sale only; and (b) that Suhadi should not be believed. 49 I did not find that these contentions should be accepted. I do note that the Plaintiffs’ position was not without difficulty. There were, for instance, other possible mechanisms that could have been adopted to achieve the same result. But at the end of the day, I accepted that, on the balance of probabilities, the Plaintiffs’ position was to be preferred. (a) Suhadi’s behaviour was not inconsistent 50 The Defendants argued that Suhadi’s behaviour and conduct was suspect because: (a) he had not asked about the process of sale; (b) he had put too much trust in Taufik to be believed; (c) his behaviour was that of a creditor as he had said he had wanted to move on; had sought release and discharge one day after the meeting and had asked for the appointment of Taufik and Heru as directors very promptly; and had sent an email saying that he only wanted to recover investment money. 51 One incongruity that the Defendants relied upon was that Suhadi had not asked Taufik about the process of sale, leaving matters entirely to the latter. In cross-examination, it was pointed out that he did not discuss what would happen if there was no sale, or what would occur after the time given. He also seemed to put in too much trust in Taufik. The Plaintiffs argued that Suhadi’s behaviour was understandable, as speed was essential and Taufik had said that he had lined up buyers. The Plaintiffs further argued that there was an inquiry by Suhadi about the new buyers, but his request for information was brushed off by Taufik. 52 I was satisfied that any inaction or failure to inquire could be explained on the facts by Suhadi’s regard for Taufik as the driving force behind the sale. As submitted by the Plaintiffs, Taufik had indicated that he had possible buyers in mind. In light of Taufik’s stance, Suhadi could not have been expected to be insistent on information and updates. There was also the assurance which, according to the Plaintiffs, Taufik gave Suhadi, to the effect that contact had been made with potential buyers. 53 As for the Defendants’ contentions that Suhadi appeared to have trusted Taufik far too much, especially given Suhadi’s treatment of the group of companies as a single economic entity, this trust had to be considered in the context of the prior relationship and dealings between the parties. As noted by the Plaintiffs, Sulaiman testified that Suhadi did trust Taufik deeply. I saw no reason to doubt the high degree of trust as Taufik did appear to have been given much leeway in the running of PT UCI in the period before the 1 October 2012 meeting. There was no serious challenge mounted by Taufik against this picture of trust being reposed in him. 54 The Defendants further alleged that Suhadi’s behaviour was more that of a creditor, because he had testified that he had wanted to move on and go on to other things.4Foot Note 4×Transcript, 6 March 2015, pp 74–77.I could not agree with this submission. At the last part of the transcript highlighted by the Defendants, Suhadi had said: A  … So, it’s much more convenient. He said he has found the buyers. I said, “Let’s move on.” Er, basically, I want to close the episode, Your Honour. 55 The testimony in question was nothing more than a statement that Suhadi wanted to have the situation in the companies resolved so that he could explore other opportunities. It did not point to the agreement being an outright transfer. 56 The Defendants further pointed to Suhadi moving promptly to have a release and discharge just one day after the meeting, and also, by way of an email to Shirley, to have Taufik and Heru appointed as directors. The Plaintiffs assert that these were done to facilitate the sale process. I accept that this was a sufficiently plausible reason. The actions taken by Suhadi in the aftermath of the meeting were not incompatible with the agreement being facilitative of a sale only. 57 Another indicator relied upon by the Defendants to show that Suhadi treated himself as a creditor was an email of 3 December 2012, in which Suhadi stated that he had handed over his shares with the promise of a return of “investments”. The Defendants argued that this showed that following the transfer of shares, Suhadi only expected to get back his loan amounts. I could not see that this was so. The term “investments” was sufficiently broad to cover any interest Suhadi had in the shares, and was thus equally compatible with the Plaintiffs’ version of the agreement. (b) Suhadi’s evidence should be accepted 58 The Defendants relied on a number of arguments to contend that Suhadi’s evidence should not be accepted and that, consequently, his version of events should be rejected entirely. Admittedly, there were areas in which Suhadi’s credibility was doubtful. However, these did not cloak the whole of his testimony with so much doubt that his evidence should be left out of consideration. 59 Firstly, the Defendants took issue with Suhadi’s claim that he was kept in the dark about PT UCI’s operations. They point to his email of 30 July 2012 in which he detailed various issues confronting the company. This, the Defendants said, showed knowledge of what was happening. On the other hand, the Plaintiffs contended that the contents of this email were based on information that had been received by Suhadi, and that there was nothing inconsistent with Suhadi’s claim that he had been kept in the dark. I did not conclude that there was anything here that significantly undermined Suhadi’s credit and credibility. I did not consider that the evidence showed that Suhadi was wholly or substantially ignorant of what was happening in PT UCI. At the same time, however, the operational matters were left to Taufik and there did not appear to be anything in the Defendants’ submissions that went against this. Suhadi was operationally removed as compared to Taufik. In any event, even if Suhadi’s claim of ignorance was to be rejected entirely, this did not automatically mean that I should find that his version of events ought to be rejected. The two areas were distinct and neither depended on the other. 60 A number of other points similarly did not undermine Suhadi’s account concerning the agreement. The Defendants pointed to Suhadi having the ability to go back into running the company again. However, even if Suhadi could have done so, this did not suggest that his version of events should be disbelieved. Suhadi could have simply chosen the sale of the company as he considered it to be the better option. It was also argued that Suhadi was inconsistent concerning the risk involved in the personal guarantees. On the one hand, Suhadi had stated in his affidavit of evidence-in-chief (“AEIC”) that the guarantees were risky and that whoever gave them should be given a reward.5Foot Note 5×Suhadi Zaini’s AEIC, para 22.8.On the other hand, he said in re-examination that there was no risk in the personal guarantee.6Foot Note 6×Transcript, 11 March 2015, p 62.. Suhadi did attempt an explanation that there was a risk only if the companies were not listed,7Foot Note 7×Transcript, 11 March 2015, pp 102–103.but I accept that this was not coherent. However, the inconsistency here was not so great that Suhadi’s credibility was affected in respect of the content of the agreement. The question of risk was not material to the content of the agreement. 61 The Defendants also contended that Suhadi was contradicted by Tommy as regards the structure of the bonus. However, this again did not take the Defendants far. Tommy testified that he recalled only that there would be a bonus, but not at the specific rate of 10% of the sale.8Foot Note 8×Transcript, 13 March 2015, pp 58–59.However, whatever the percentage was, there was an agreement that there would be a bonus on sale. The other point that Tommy was left out in emails subsequently was also neither here nor there, as was the fact that Sulaiman was similarly left out in some emails and a meeting. The Defendants tried to argue that this showed that the agreement was not one for facilitation of sale as otherwise Tommy and Sulaiman should still have been interested and involved. This argument could not succeed as Suhadi was not obliged to act for either Tommy or Sulaiman in respect of their shareholdings. Suhadi’s emails and his pressing for meetings could simply be in furtherance of his own individual interest, and he did not need to cater for Tommy and Sulaiman if he chose not to. In any event, as noted by the Plaintiffs, in one email of 1 November 2013, Suhadi did refer to the fact that Sulaiman, Hendrik and Tommy had not received any further information. 62 The Defendants pointed to the fact that Suhadi did not ask for or know of the details of the sale. On the Plaintiffs’ case, Suhadi was leaving most things in the hands of Taufik. The Defendants contended that Suhadi’s testimony clearly showed that he wanted to move on from the companies, which supported their contention that what was agreed was an outright transfer of the shares. However, none of these undermined the Plaintiffs’ case. It was entirely believable that Suhadi would not have known much or left matters to Taufik. Taufik was apparently the person on the ground. As for Suhadi’s desire to move on, that did not mean that he was willing to leave all his shares to Taufik and Heru. 63 The Defendants also pointed to inaction on the part of Suhadi after the shares were transferred. However, to my mind, that could have pointed in either direction, and such inactivity could likewise be explained by the Plaintiffs’ version of events. Outright transfer was not commercially sound 64 An outright transfer did not seem commercially sound and seemed to have gone against the inherent probabilities of the situation. The business was no doubt in difficulties because of the overall economic situation, as well as issues on the ground at the coal mine. However, an outright transfer did not give any discernible benefit to the transferors. 65 It may be argued that the Plaintiffs had entered a bad bargain and that the court should not be made to rescue them from it. However, this was not the Defendants’ case. Instead, the Defendants had argued that there was indeed some sort of benefit, and I will deal with this point below. Leaving that aside, it is true that the court does not rewrite agreements simply because one side may be hard done by the other. However, that neutrality as to outcome does not mean that the court cannot weigh the probability that the parties had indeed agreed to what was a bad bargain for one of them. The court should consider the likelihood of different events occurring. Coming back to the present case, where the evidence adduced by the Defendants did not disclose a reasonable justification for an outright transfer, the court was entitled to find that such a transfer did not, in fact, take place. 66 In particular, I noted that the Defendants had contended that the transaction excused the transferors from liability for the debts of the company. Unfortunately, this was not supported by any opinion as to Indonesian law. Consequently, I had to take it that Indonesian law was the same as Singapore law, and I could not, as a result, accept the Defendants’ proposition. Additionally, there were two shareholders, namely, Tommy and Sulaiman, who had little to gain from such a transfer. (1) The supposed rationale did not apply to two of the shareholders affected 67 An outright, absolute transfer to Taufik and Heru would not have made any sense for Tommy and Sulaiman, neither of whom had any loans owed by UCHI.9Foot Note 9×Transcript, 23 October 2015, pp 21–22. 68 It is conceivable that in some situations, shareholders may want to drop everything entirely. What was absent in this case, however, was any evidence that things were so dire that the shareholders wanted to walk away from PT UCI and the other companies. Had there been such evidence, then an outright transfer would have been plausible. But it was not the Defendants’ case, in any event, that there was no value in the companies and that there was nothing to hold the shareholders back from walking away. Even on their version, there was still some value and potential in the companies; that would have been the recompense for Taufik and Heru in taking on the risks of the guaranteesvis-à-visBank Mandiri. Since there was at least some potential and possible value in the companies, it made no commercial sense, and it was therefore also highly unlikely, that the shareholders would give up their shares to Taufik and Heru for nothing. 69 This difficulty also cast doubt on Hendrik’s testimony that he thought that there was some benefit from the transaction, in that an outright transfer to Taufik could let Taufik manage the company back to a position where the loans given could be repaid.10Foot Note 10×Transcript, 9 March 2015, pp 67–68. (2) Nothing compelled the outright transfer of the shares 70 The Defendants’ version of events that there was an absolute transfer to Taufik and Heru had the virtue of simplicity. However, it was difficult to conclude that this version was supported by the evidence, especially since it went against the inherent probabilities of the situation as noted above. Additionally, it was never clear on the Defendants’ case what harm the transferors would avoid by giving up their shares entirely to Taufik and Heru. There was no compunction or pressing reason for them to have given the counter-guarantee or to contribute to any call on the guarantee by the bank. They could have sat on their hands and left Taufik and Heru to face the consequences of the personal guarantees they had already given. There was insufficientquid pro quofor the counter-guarantee: the giving up of shares in return for being excluded from giving counter-guarantees seemed disproportionate and thus unlikely. There was also the fact that the Plaintiffs would be giving up their shares in UCHI, while the real difficulty lay in PT UCI. That did not make commercial sense either. (3) No factual support for the outright transfer 71 There was no factual or evidential support for the Defendants’ version. This version was premised on two factual points: (a) that the other shareholders would not then be liable for the debts of the company; and (b) that they would not be required to give a counter-guarantee. 72 As the Defendants did not adduce evidence on what was the law in Indonesia in relation to the liability for shareholders for loans taken out by the company, the position would have to be taken to be the same as that in Singapore,ie, that directors are not, in the absence of any specific guarantee or contract, liable for a loan taken out by the company. What was more in the present case was that the loan in question was taken out by PT UCI, while the shareholding transferred after the 1 October 2012 meeting was in UCHI, which was a holding company of PT UCI. 73 I also found that there was no agreement by the other shareholders to give a counter-guarantee or contribution. The counter-guarantees and contributions were said to have been sought by Taufik and Heru to offset the guarantee that they had given to the bank. However if no counter-guarantee or contribution had in fact been agreed to by the others, it would further undermine Taufik and Heru’s version of events. (a) No evidence of counter-guarantee 74 There was no evidence of any agreement to this effect. The email of 12 December 2011 invoked by Taufik and Heru did not contain anything relating to a counter-guarantee or contribution. What that email did contain was a promise to give more shares to Taufik and Heru. The email reads as follows: … Subject: Personal Guarantee for Loan of Rp. 600 Billion = US$ 67.50 Million from Bank Mandiri for UCI. … Dear Shareholders, As you have known for sometime that our cash position is very short due to very limited capital injection from shareholders while at the same time, we are expanding our business. We need additional funding urgently because our account payable, including for Tamiyang project, the amount is close to USD. 10 million and growing in the amount and worst still the tenor. Sooner or later, we will loose [sic] our credibility in the market and we will have to reduce our operation. Pak Taufik, Pak Heru and Pak Rudy have managed to convince Bank Mandiri to provide a facility for UCI. On Tuesday, 13th December, Pak Taufik and Pak Heru are going to sign a loan facility of Rp. 229 Billion – first tranche, and follow by the second tranche of Rp. 371 Billion. So our total facility will be Rp. 600 Billion = US$. 67.50 Million. For this facility of Rp. 600 Billion, Pak Taufik and Pak Heru have to sign personal guarantee. In our last meeting I did mention about personal guarantee of Shareholders for our outstanding facilities and no solution was mentioned. To be fair to the parties that signed personal guarantee, I am proposing to issue 10 to 15 shares each to Pak Taufik and Pak Heru. The facility from Bank Mandiri will replace all facilities, Danamon, Permata and all the leasing companies, enjoyed by our company. Any inputs from all shareholders will be appreciated and we can always put the motion for voting. Thank you for your kind attention, I remain. … [emphasis in original] 75 Clearly, this email did not contain any mention of a counter-guarantee at all. While there may be compensation and recognition for the guarantees given and the risks ran by Taufik and Heru, the promise of additional shares did not show that there was any move towards giving the two of them counter-guarantees as claimed by Taufik and Heru. 76 In their submissions, the Defendants referred to this email as proposing that Taufik and Heru would be given more shares to compensate them for the risks undertaken. This represented a change in the stance taken by the Defendants as it was different from what Taufik had testified in court. This change cast further doubt on the veracity of the Defendants’ version. 77 The other parties, Suhadi, Tommy and Sulaiman denied ever giving any such counter-guarantee. They maintained their position in cross-examination that there was never any such promise and they remained unshaken on this. (b) The Defendants’ evidence does not support any agreement on counter-guarantees 78 Taufik also referred to a meeting with Suhadi on the evening of 30 September 2012 during which Suhadi said that he had decided that he would want to divorce himself from the affairs of PT UCI (by ceasing to be a shareholder of UCHI and transferring his shares to Taufik and Heru) and simply look to PT UCI for the repayment of the loans that he had extended to UCPL and KBG. Suhadi also said that he would persuade Hendrik to do the same. Taufik’s version of the meeting was denied by Suhadi.11Foot Note 11×Transcript, 6 March 2015, p 60.In any event, even on Taufik’s own evidence, this was not the final agreement – the matter was to be canvassed and discussed at the 1 October 2012 meeting. Consequently, the discussion on 30 September 2012 could not have been the foundation of a finding as to the agreement on the meeting on 1 October 2012. 79 Yet another point against any agreement on counter-guarantees was that Taufik did not press for the counter-guarantee to be given. There was nothing between the supposed agreement in the email of 12 December 2011 and the meeting on 1 October 2012. If the counter-guarantee was that essential, what would have been expected would be timely action on his part and a pressing of the others on this. However, by Taufik’s own account, there had been a failure to do so. The fact that nothing was mentioned undermined his assertion that there was any such promise. (c) Hendrik’s email 80 Hendrik’s email of 26 December 2013, which asserted his 10% shareholding in UCHI after the supposed agreement at the meeting, was further support that there was no agreement that there would be an outright transfer of shares. This email simply reads:12Foot Note 12×Exhibit P8. Dear [Suhadi], Thanks for your email. I just like to clarify that I am reserving my right to make any claim of my 10% share in United Coal Holdings Inc. You are right if I am subpoenaed by any court in Singapore, I shall be telling the fact for the event on 1 October 2012. Thanks for your attention. Sincerely, Hendrik 81  I noted that Hendrik himself asserted that he was only a creditor, and was a witness in support of the Defendants’ position. He explained in further cross-examination that he wanted to stay neutral and thought that a resolution was possible.13Foot Note 13×Transcript, 9 March 2015, p 67 . (d) No mention in injunction application 82 As noted by the Plaintiffs, there was also no mention of any share transfer in an earlier affidavit filed by Sunredi for the purposes of an injunction application taken out against the companies. While the affidavit was deposed by Sunredi, this was in coordination with Taufik. It was telling that there was no mention of the outright transfer of shares, which would have been an important factor in the determination of the injunction. What was mentioned was that there was a sale of the shares to Taufik and Heru, which is of a different character from what Taufik and Heru alleged in the present suit. (e) No mention of time frame 83 I further noted that there was, on the Plaintiffs’ version, some uncertainty about the time required for the sale to be effected by Taufik and Heru: there was no agreement about what was required, and the matter appeared to be left hanging. However, this was not evidence against the Plaintiffs’ version of the agreementper se; the uncertainty over time did not lead to the conclusion that the Defendants’ version was to be preferred. 84 Once the existence of the counter-guarantee was no longer viable, there was no other basis to contend that the shares were transferred absolutely to Taufik and Heru. (f) Counter-guarantee as past consideration 85 The Plaintiffs argued that in any event, the counter-guarantee would not have been on a proper legal basis as it would have been given by the Plaintiffs for what was past consideration. To this, the Defendants responded that the Plaintiffs could not invoke the past consideration defence, as this was not pleaded. 86 In my judgment, this argument could not take the Plaintiffs far. Even if the Plaintiffs were correct that any counter-guarantee would have been given for past consideration, and would therefore be unenforceable, this did not, by itself, mean that the Defendants’ version was to be rejected. This result would only mean that Taufik and Heru would not have been entitled to enforce the counter-guarantee. It would not have been the basis to conclude that the agreement was what the Plaintiffs said it was. Conclusion as to the purpose of the agreement 87 All in all, I accepted that it was more probable than not that the transfer of shares to Taufik and Heru was to facilitate the sale of the shares in PT UCI. The primary motivating factor appeared to be the perception that speed was essential. 88 Admittedly, parties can agree to outcomes that are neither rational nor expected. However, as the court determines a civil dispute on the balance of probabilities, it can look to the inherent probabilities of a situation in order to weigh the competing versions. The less commercially sound an agreement is, the less likely it was the actual agreement reached. Of course, if there is evidence indicating that the parties in question were taking a risk or going headlong into a commercially unsound agreement, then that would be a material matter that could establish such an agreement on the balance of probabilities. 89 In the present case, the Plaintiffs’ version was plausible and, unlike the Defendants’, did not face difficulties which undermined its inherent probabilities. In the circumstances, therefore, I concluded that the Plaintiffs proved on the balance of probabilities that the agreement was for the transfer of shares only to facilitate the onward sale of PT UCI. Change in position 90 The Defendants contended that even if there had been any agreement as the plaintiffs contended, Taufik and Heru had changed their position, and it would be inequitable to require that they return the UCHI shares to the Plaintiffs. In particular: (a) loans were extended from their other companies and associates to PT UCI and UCPL; (b) there was further restructuring of the Bank Mandiri loans; (c) new contracts were obtained for PT UCI; and (d) there were payments made on the Bank Mandiri loans. 91 In the present case, a finding that the agreement was not what the Defendants said it was would mean that the opposing version of events would be accepted as being what was agreed. That being so, there would be no room for the Defendants to claim that they had innocently changed their position. Change of position is a defence to a claim of unjust enrichment. It has no operation where any benefit is obtained under an agreement as, in such a case, the claim is contractual and a breach of contract does not give rise to a restitutionary claim. The alternative way of looking at this is that the defence is not available if it is invoked in bad faith (LipkinGorman (a firm) v Karpnale Ltd.[1991] 2 AC 548). This must follow from the evidential findings here: once it was accepted that there was an agreement to transfer the shares only to facilitate the sale of the company, any transfer in breach of that agreement would most likely have occurred in bad faith. 92 I should note in passing that the law on change of position was not extensively argued in the present case. The scope of the express agreement 93 In addition to the transfer being only to facilitate a sale, the Plaintiffs argued that the parties had expressly agreed to a time frame of six to nine months from the meeting. The Plaintiffs pointed to evidence of discussion about the time frame, with various figures between three to 18 months being suggested. 94 I could not conclude that there was any actual agreement on this issue. Even on the Plaintiffs’ own evidence, there was nothing but discussion. There was no evidence that there was an actual figure agreed upon and none of the Plaintiffs’ witnesses said anything to this effect. What was clear on the evidence was that there was no agreement on the figures mentioned: three months was too short, while 12 to 18 months was too long. Given this lack of agreement, any time frame would thus have to be implied, if at all.",
        "Implied terms": "95 The agreement between the parties was bare. What I found was that there was an oral agreement that the shares were to be transferred to Taufik and Heru to allow them to sell PT UCI to a third party. A specific time frame was not stipulated. Other details, including what was to happen to the business of the companies and their assets, were also not addressed expressly. While I accepted the Plaintiffs’ position as regards the purpose of the agreement, the next question was whether, aside from the terms expressly agreed, any terms should be implied, if at all. I was satisfied that a term as to a time for the performance of the agreement (ie, the sale) should be implied by law. On the other hand, however, I did not agree with the Plaintiffs’ submissions that a term should be implied concerning the maintenance of the status quo, in terms of management and ownership of property. Implication of a time for performance 96 As noted above, the Plaintiffs argued that there was an express agreement as to the time frame, but this was not borne out by the evidence. Their alternative argument was that a reasonable time would be implied at law, with six to nine months being reasonable in the circumstances. 97 The Defendants, in the context of arguing that the agreement was for an outright transfer, cited the fact that Suhadi did demand for the return of the shares after six to nine months. In the context of the implication of a six to nine-month time limit, this behaviour by Suhadi was not significant. The time limit is implied by law, not Suhadi’s behaviour. 98 I accepted the Plaintiffs’ proposition that where a contract does not specify the time for performance by a party that has undertaken to carry out such performance, an obligation to perform within a reasonable time is implied by law (Chitty on Contractsvol 1 (Sweet & Maxwell, 32nd Ed, 2015) (“Chitty on Contracts”) at para 21-021). This implication of a term as to time is not one of fact, and is thus not subject to the framework laid down inSembcorpMarine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp”).In contrast to terms implied in fact, the question of the time required may often be contemplated and discussed between the parties, but without any real or actual agreement reached. 99 As described above, there was a discussion but no agreement between the parties, with a range of 12 to 18 months being considered too long and a period of three months being considered too short. In determining what the length of time should be, all the circumstances are to be taken into account. Where, as usual, the assessment by the court is being done on hindsight, the court may take into account the estimate of the performer of the obligation (Chitty on Contractsat para 21-021). 100 On the facts, time was needed to identify, negotiate with and conclude an agreement with a third party. Due diligence by the purchaser would be needed, with an examination of the business of PT UCI. Taking into account all of this, a period of several months would probably be the minimum. On the other hand, there was some need for movement given that parties were dealing with coal mining, with prices of coal moving at that time [evidence]. Thus, there was a need to consider the usual commercial demands of maximising the sale price. Moreover, possible buyers had been identified. It would be expected that the matter should be concluded in months rather than years. Given these, a period of six to nine months was indeed reasonable. 101 With that in mind, I conclude that a term as to time would be implied, and that the parties would have agreed to a reasonable time for the sale to be carried out. In the circumstances, a time period of six to nine months would be appropriate and can be so implied. The shares in UCHI would need to be returned at the end of that period, at the latest 9 months from the date of the agreement. Implication of a term to maintain the status quo 102 This leaves the other term the Plaintiffs sought to imply, which was a term that the management and property of the companies would be left intact pending the sale. This was not something that could be implied at law. The Plaintiffs had to satisfy the appropriate test for implication in fact. (1) The test for implication of terms in fact 103 The guidance of the Court of Appeal inSembcorpis given (at [101]) as follows: It follows from these points that the implication of terms is to be considered using a three-step process: (a)     The first step is to ascertain how the gap in the contract arises. Implication will be considered only if the court discerns that the gap arose because the parties did not contemplate the gap. (b)     At the second step, the court considers whether it is necessary in the business or commercial sense to imply a term in order to give the contract efficacy. (c)     Finally, the court considers the specific term to be implied. This must be one which the parties, having regard to the need for business efficacy, would have responded “Oh, of course!” had the proposed term been put to them at time of the contract. If it is not possible to find such a clear response, then, the gap persists and the consequences of that gap ensue. 104 Taking the first step, my understanding of what this required was that the parties have not addressed their minds to the issue in question. In other words, they did not make a considered decision to leave the matter unresolved 105 In the present case, implication is important as what was agreed was a bare agreement, with apparently no details specified. As stated inSembcorpand other local cases, the process of implication is not an avenue for the court to rewrite the contract between the parties, however desirable that may be. Bearing in mind the guidance inSembcorp, I needed to consider: (a) whether the problem arose out of the omission to address a specific gap; (b) whether it was necessary in the business or commercial sense to imply a term to give the contract efficacy; and (c) whether the specific term, having regard to the need for business efficacy, was of the sort that the parties would have readily accepted had it been proposed to them. (2) Management and control and sale of premises 106 I could not accept that a term as to the maintenance of what the Plaintiffs considered the status quo could be implied. 107 The Plaintiffs contended that there should be a term implied that the business operations, management and assets of the companies were to be preserved pending the sale. It was pointed out that there was no change to the operations and management of the companies. Suhadi and Tommy continued to manage the day-to-day operations, while Shirley continued to take instructions from Suhadi, Tommy and Hendrik. The premises would also be sold as part of the assets of KBG. 108 On the other hand, the Defendants’ arguments focused on their alternative conception of what the agreement was and did not go into arguments against implication of this term. 109 Applying theSembcorpframework, while the issue was not contemplated by the parties, it could not be inferred that a preservation of the status quo was needed to give efficacy. It may be that, on one view, preserving the affairs of the companies, including their management and properties, would be ideal pending the sale of PT UCI. But it was just as plausible that changes to the companies, affecting the holding of assets and the control and management of the businesses, were needed, whether to facilitate the sale, maintain value in the companies, or respond to external events. There may be situations where either changes in structure or sale of property could be necessary as part of the sale of the business. Given the range of possible actions and outcomes, it could not be said that there was any necessity for a term governing the issue to be implied in order to give efficacy to the contract. Such possibilities were not specifically pleaded by the Defendants, but they flow out of the legal arguments as to implication. 110 The subsequent conduct and actions of the Plaintiffs were irrelevant in determining the question of whether terms should be implied. Such conduct would only be material if the question was what was actually agreed; that is not the point, however, of the exercise in implication. The premise as noted inSembcorpis that there was no agreement and, as I had earlier stated, there was nothing agreed except for the sale of the companies. (3) Max Master’s consent for sale of the premises 111 The Plaintiffs argued that a term should be implied that the premises would be sold as part of the sale of the companies, as it was the main asset of KBG. I have already dealt with this point above. Here, I deal with the Plaintiffs’ related point that as the premises were paid for by Max Master, it was also efficacious to imply that: (a) Max Master (through Suhadi) would have greater decision-making power in the event the premises were to be sold independently; and (b) Max Master’s consent had to be procured in the event of an independent sale of the premises. 112 This argument misapprehended the implication of terms as well. Efficacy would not be served by implying a requirement that the consent of Max Master was to be obtained. Such consent was nothing more than the preference of Max Master or Suhadi; it was not needed to allow the agreement reached between the parties to go forward. Moreover, if asked about the gap, the parties would have given different answers entirely. Consent by Max Master could not therefore be implied.",
        "Termination of the agreement and consequences": "113 Subsequently, termination was indicated by the Plaintiffs’ lawyers on 20 in respect of Max Master and 30 December 2013 in respect of Sulaiman and Kow. The shares should have been returned at the latest 9 months from the date of the agreement. What damages, if any, should flow from the breach would be left to assessment. 114 There was no breach in respect of any attempt to sell the premises or any change of management in so far as any of those occurred during the currency of the agreement. 115 As to the removal of directors by the Defendants as well as the sale of shares to Artica, these occurred after the termination of the agreement. However, there was no amendment of pleadings to take in these facts to establish rights to remedies independent of the agreement. Whether the consequences of these actions after termination could result in additional damages flowing from the breach of the implied term as to the time limit will be left to assessment as well.",
        "Analysis in Suit 101": "116 The Plaintiffs in Suit 101 sought repayment of loans from the Defendants in that case, namely UCPL, KBG and UCHI. The claims made by the Plaintiffs concern: (a) loans made by Max Master to UCPL; (b) loans made by Suhadi to UCPL; and (c) loans made by Max Master to KBG. 117 The Plaintiffs contended that it was undisputed that there were shareholder loans given by Max Master to Suhadi to UCPL and KBG, and that Taufik admitted as much in his testimony. In so far as the loans extended by Max Master and Suhadi to UCPL are concerned, this was also shown in UCPL’s ledgers. 118 UCPL and UCHI argued that there were no loan documents or resolutions passed for the extension of the loans. There was no liability on UCHI’s part for any loan made to UCPL and KBG. KBG argued, on its part, that it did not owe money to Max Master either. 119 The essential point in this case is that the Plaintiffs contended that UCPL and KBG received loans from Max Master and Suhadi, and were thus liable. The Plaintiffs further contended that UCHI received the benefit of the loans and was thus liable as well. This was underlined by the companies being a single economic entity. The Defendants contended that the money that was received came from UCHI and/or another entity called United Coal Holding Ltd in the case of UCPL, and Colbert in the case of KBG, and that UCPL and KBG did not owe anything to Max Master and/or Suhadi. UCHI, on its part, did not owe any money to Max Master or Suhadi, and could not be made liable for any debts owed by UCPL and KBG. 120 The burden lay on the Plaintiffs to show that the loans were loans from them, rather than as recorded in the books. There are two issues which have to be dealt with in turn: (a) proof of the loans having been made and to whom the money was owed; and (b) the liability of the companies for each other’s obligations.",
        "Proof of loans": "121 The Plaintiffs’ claim was that money was extended by Suhadi himself, as well as through Max Master, for the benefit of UCHI, to UCPL and KBG. UCHI was jointly and severally liable with UCPL and KBG for repayment of the loans that were taken. 122 There was an absence of documents recording the various loans and circumstances. I was left with the accounting records as they were, with explanations given as to how certain entries or records were amended or corrected down the years. It is undoubted that money was paid to UCPL and KBG. However, this was not sufficient. There had to be evidence to show that the money was lent by Max Master and/or Suhadi. 123 With respect to UCPL, the records for most years indicated that payments in were made to the account of UCHI; though there were typographical errors making reference to a ‘UCHL’ rather than UCHI. No mention was made in the records of money being owed to Max Master or Suhadi personally. 124 As for KBG, the records showed that the payments were to the account of Colbert. The last available set of records did contain a change, stating that the payments were made by UCHI. The Plaintiffs’ witness, Shirley, sought to explain this by stating that it was an error in description, and that the change in description was meant to rectify the error. 125 There were no other documents evidencing any loans from Max Master and/or Suhadi. There was Taufik’s supposed admission (that the Plaintiffs pointed to) that he knew the money came from Max Master and Suhadi. However, this was not an admission that these were loans from Max Master and Suhadi. Rather, what was admitted was that the ultimate source could be Max Master or Suhadi although the money came through UCHI. Any knowledge of the ultimate source did not mean that there was admission of legal liability to that source. Rather, it was just an acceptance that there was money coming into these accounts, without the acceptance of liability to the Plaintiffs in Suit 101. 126 In the circumstances, given the dearth of evidence that there were payments being made as loans (ie, to be repaid as contractual obligations) to UCPL and KBG coming from the Plaintiffs, I could not find that UCPL and KBG were obliged to repay money to the Plaintiffs. Whatever their liability may be to UCHI or to Colbert was not the issue before the court. Neither was there any claim that UCHI owed money to these Plaintiffs directly; the claim was for liability for the money loaned to UCPL or KBG. Finally, the Plaintiffs did not claim the money as money had and received and did not frame their claim as one of unjust enrichment. It may be that any of the above could have led to liability, but these matters were not pleaded or before the court.",
        "The single economic entity argument": "127 While the Plaintiffs relied on the argument that the Defendants were a single economic entity, I was of the view that there was no reason in this case to disregard the separate corporate identities. As the cases cited in argument have noted, there are occasions when the separate identities are disregarded, particularly if there is an attempt to make use of separate structures to mask fraud. However, the use of different corporations to take on debt does not necessarily indicate fraud. The containment of liability within different companies is part and parcel of normal corporate dealings and separate corporate identities cannot be disregarded simply to facilitate the recovery of money lent. 128 While it may be that the doctrine is either part of the law or part of the currently-accepted wisdom in other areas, such as competition law, revenue law or tort law, each corporate entity is taken as separate in respect of the determination of liability of the entities involved (and their shareholders or members) under company law and contract law. It is only where fraud or something similar is made out that such separation is disregarded. 129 The Plaintiffs referred to a number of cases in which separate corporate identity was disregarded:Ng Kek Wee,LimChee TwangandManuchar. The Defendants, on the other hand, pointed toLewSyn PauandManucharin support of their contention that the single economy entity doctrine did not apply. 130 The cases did not support the Plaintiffs’ arguments. InManuchar, the plaintiff sought pre-action discovery against the defendant company on the basis that the defendant’s group of companies was to be treated as a single economic entity. Lee Kim Shin JC observed that the single economic entity concept was not recognised under Singapore law and in the common law generally.Win Linereiterated the position inAdams and Others v Cape Industries PLC. and Another[1990] Ch 433 (“Adams”)that the rule remained that each company was a separate entity with separate rights and liabilities. InLewSyn Pau, Sundaresh Menon JC (as he then was) accepted the proposition that each company is a separate entity and the acts of the company will not be imputed to the owner as a general rule. As forNgKek Wee,this was not a case concerned with the concept of a single economic entity. That concept was not referred to at all in the judgment, and neither were the leading cases such asAdams.The Court of Appeal was of the view that unfair conduct in respect of a subsidiary could be relevant so long as it affected a holding company, and, in that case, a complaint of oppression was made in respect of a holding company. The Court of Appeal’s holding is unsurprising. Various forms of conduct can be material to an allegation of oppression, wherever the conduct may occur. Reference to such conduct in a subsidiary does not require the invocation of the single economic entity concept. What is at stake is essentially the conduct of one set of persons against another. 131 Going back toAdams, which was thestarting point of attempts to invoke the concept in the corporate law setting, what must be remembered is that the English Court of Appeal in that case rejected the argument that the various companies involved were essentially partners involved in a partnership, with their separate identities disregarded. The Court of Appeal (at 477) cited the statement of Robert Goff LJ inBank of TokyoLtd. v Karoon and Another[1987] AC 45 (at 64) that: … we are concerned not with economics but with law. The distinction between [parent and subsidiary company] is, in law, fundamental and cannot here be bridged. This underlined the Court of Appeal’s own observations (at 532) as regards the “single economic unit” argument: There is no general principle that all companies in a group of companies are to be regarded as one. On the contrary, the fundamental principle is that “each company in a group of companies (a relatively modern concept) is a separate legal entity possessed of separate legal rights and liabilities:”TheAlbazero[1977] A.C. 774, 807,perRoskill L.J. The Court of Appeal noted (at 536) that in the instances where groups were treated as single units, such treatment would be justified as resulting from the wording of specific statutory provisions or contract. 132 What the cases illustrate is that the courts will not allow corporate structures to be used to shield fraud. However, it is an entirely different thing for the very person who set up the various companies to then contend that they should be treated as a single whole. 133 The Plaintiffs tried to bring themselves within the fraud exception to the separate identity of companies by arguing that the Defendants in Suit 101 should not be allowed to evade their liabilities under the loans, and that they were not treated as separate entities by the parties anyway. This argument conflates the single economic entity concept with the fraud exception to separate corporate identity. 134 Specifically, the Plaintiffs alleged that there was evasion of liability through reliance on the separate identities. The simple retort to this is that there is no evasion when one company does not accept liability for the debts of another. This is merely a normal incident of corporate status and it is not improper for someone to incorporate companies to distribute liability. That lies at the heart of special purpose vehicles, such as the one-ship companies which were noted inManuchar. Something other than containment of liability, and which is in the nature of actual fraudulent conduct, is required. 135 I am doubtful that even if a single controlling shareholder or directing mind commingled the money of different companies, or combined their administration and business activities, that would, by itself, be sufficient grounds to ignore the separateness of these companies. What is needed is conduct that renders it unconscionable or fraudulent for the separate identities to be relied upon. The normal separation and segregation of liabilities falls far short of that. 136 In my view, that underlies the approach of the UK Supreme Court, as can be seen in the leading judgment of Lord Sumption JSC inPrestv Petrodel Resources Ltd and others[2013] 2 AC 415 (at [35]): I conclude that there is a limited principle of English law which applies when a person is under an existing legal obligation or liability or subject to an existing legal restriction which he deliberately evades or whose enforcement he deliberately frustrates by interposing a company under his control. The court may then pierce the corporate veil for the purpose, and only for the purpose, of depriving the company or its controller of the advantage that they would otherwise have obtained by the company’s separate legal personality. The principle is properly described as a limited one, because in almost every case where the test is satisfied, the facts will in practice disclose a legal relationship between the company and its controller which will make it unnecessary to pierce the corporate veil. Like Munby J inBenHashem v Al Shayif [2009] 1 FLR 115, I consider that if it is not necessary to pierce the corporate veil, it is not appropriate to do so, because on that footing there is no public policy imperative which justifies that course. I therefore disagree with the Court of Appeal in VTB Capital v Nutritek [2012] 2 Lloyd’s Rep 313 who suggested otherwise at para 79. For all of these reasons, the principle has been recognised far more often than it has been applied. But the recognition of a small residual category of cases where the abuse of the corporate veil to evade or frustrate the law can be addressed only by disregarding the legal personality of the company is, I believe, consistent with authority and with long-standing principles of legal policy. In the present case, there was nothing to show that the conduct of the persons in control of the Defendants amounted to such fraud as to require the piercing of the veil. 137 Returning to the single economic entity argument, what we had additionally in the present case was the very person, Suhadi, who treated the companies as a single economic entity, arguing that because he did so, his treatment of the companies as one should flow through and bind those companies thereafter. That is quite different from the usual cases, where the single economic entity concept is invoked by those alleging prejudice because of the actions of the controlling person. The difficulty with Suhadi invoking the doctrine is that he was the one who disregarded the normal distinction between the companies in the first place. Allowing him to do so would be to reinforce the burying of the distinction between the companies and reward the disregard of the normal incidents of corporatisation. There was nothing exceptional in the arrangements behind the corporate structure here. To allow the distinction to be overridden here would enable persons to gain the benefits of corporatisationvis-à-visthird parties, while at the same time disregard corporate identity when it suits them.",
        "Conclusion as to Suit 101": "138 Thus, UCHI was not liable for the loans of the other entities, UCPL and KBG. Neither UCPL nor KBG was liable either.",
        "Miscellaneous matters": "139 A number of miscellaneous matters should also be addressed before concluding. First, video-conference testimony from overseas was allowed as Taufik and Heru were unable to leave Indonesia at one point. While the Plaintiffs had opposed this, I was ultimately satisfied that it was in the interests of justice to allow this in the present case. Second, a number of technical objections were raised concerning the contents of Taufik and Heru’s AEICs in Suit 13. However, none of these were significant and did not materially affect my decision. Third, it was found in Suit 13 that the agreement was for facilitation of sale of the shares, with one of the agreed uses of the funds being repayment of loans made by shareholders. This may cover, at least partly, the very loans that were sought to be enforced in Suit 101. Thus, the assessment of any damages arising in Suit 13 would one expects have to take into account that part of the finding in Suit 101 that the loans in question were not enforceable as loans against UCHI, UCPL and KBG.",
        "Conclusion": "140 For the reasons above, I allowed Suit 13 in part, but dismissedSuit 101. 141 The question of costs was taken up separately after the main hearing. The Plaintiffs argued for aSandersonorder in respect of the successful Defendants in Suit 101 being left to pursue costs against the unsuccessful ones in Suit 13; I did not think that this was appropriate. It may be thatSandersonv Blyth Theatre Company[1903] 2 KB 533 could be extended to apply to separate suits heard at the same time, but in the present situation, I could not see any reason to impose it, as the subject matter was distinct. On the other hand, I did not accept KBG’s arguments for indemnity costs to be ordered against the Plaintiffs in Suit 101. Costs were ordered in Suit 13 against the 1st and 2nd Defendants, taking into account the fact that the Plaintiffs were not successful on all counts. As the 1st and 2nd Defendants were the active defendants in Suit 13, the costs should be against them, rather than the corporate defendants. In the order for costs in Suit 101 in favour of the Defendants, I took into account the time taken and the arguments in relation to the single economic entity issue. 142 Pending the appeals, orders were made to preserve the position of the parties, particularly in respect of the assets of the companies. Aedit AbdullahJudicial Commissioner Yeoh Kar Hoe & Gina Ng (David Lim & Partners LLP),Daniel Koh, instructed counsel, (Eldan Law LLP) for the plaintiffs in Suit No 13 of 2014 and the plaintiffs in Suit No 101 of 2014;Ng Lip Chih and Tan Jieying (NLC Law Asia LLC) for the first, second, third and fourth defendants in Suit No 13 of 2014 and the first and third defendants in Suit No 101 of 2014;Nicholas Jeyaraj s/o Narayanan (Nicholas & Tan Partnership LLP) for the fifth defendant in Suit No 13 of 2014 and the second defendant in Suit No 101 of 2014."
    }
}