{
    "case_title": "Public ProsecutorvSelamat bin Paki and others",
    "ncitation": "[2016] SGHC 226",
    "coram": "Choo Han Teck J",
    "sections": {
        "Case against Selamat and Ali": "3 The prosecution’s case against Selamat and Ali is that: (a) Ali instructed Selamat to go downstairs to collect the Bundle from Ragunath and provided him with the money to pass to Ragunath for the Bundle; (b) Both Selamat and Ali had actual knowledge that the Bundle received from Ragunath contained heroin; and (c) The bulk of heroin that Selamat received from Ragunath was intended to be repacked into smaller packets for sale although some of the heroin was for Selamat and Ali’s personal consumption. 4 Selamat and Ali admit that they not only consumed heroin but also trafficked in it. Ali admits that on 23 October 2012 he instructed Selamat to collect the Bundle and that he had given Selamat money to pay for it. There is no dispute that Selamat collected the Bundle from Ragunath. Selamat initially denied knowledge of the contents of the Bundle but by the end of the trial he no longer pursued this point. The crux of Selamat and Ali’s defence is that half of the Bundle was for their personal consumption and the other half was for sale. Half of the Bundle would amount to 13.56g (net) of diamorphine, which is below the 15g required for the offence to carry the capital punishment. 5 In a criminal case generally, the prosecution must prove its case beyond a reasonable doubt, but when an accused has to prove a defence or rebut a presumption in law he has to discharge it on a balance of probabilities. Section 17(c) of the Misuse of Drugs Act presumes that a person caught in possession of drugs is in possession of those drugs for the purposes of trafficking unless he can satisfy the court otherwise. Section 17(c) of the Misuse of Drugs Act states that: Presumption concerning trafficking 17.  Any person who is proved to have had in his possession more than — … (c) 2 grammes of diamorphine; whether or not contained in any substance, extract, preparation or mixture shall be presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his possession of that drug was not for that purpose. 6 This provision shifts the burden of proof from the prosecution to the defence, which means that Selamat and Ali must prove on a balance of probabilities that less than 15g of the 27.12g of diamorphine was for sale. The question is whether the two accused persons have discharged this burden. 7 The evidence before me is straightforward. Although Selamat and Ali are charged for trafficking in 27.12g (net) of diamorphine, there was another 12.13g (net) of diamorphine in the Flat. Ali admits to be the owner of those drugs but Selamat denies knowledge of it. Both Selamat and Ali are drug addicts. Selamat has been a drug addict since he was 17 years old and Ali since he was 12 years old. 8 Selamat claims that he met Ali when they were in a drug rehabilitation centre and that he moved into the Flat because Ali provided him with free drugs. It is not clear when Selamat moved into the Flat. Selamat claims that he moved into the Flat sometime in the middle of September 2012 while Ali claims that Selamat moved into the Flat sometime in August or September 2012. In his evidence, Selamat alluded to have some arrangements whereby he let Ali use his name as a co-occupier of the Flat and gives Ali some money in return for staying there. Ali says that he needed to have Selamat’s name in the flat otherwise the Flat would have been repossessed by the HDB. But he denies that Selamat paid him any money for the rental of the Flat. The evidence as to their flat-sharing is unclear but it does not affect the charges against them. 9 Selamat claims to have consumed about 6g (gross weight) of heroin a day before his arrest while Ali claims to have consumed 6g to 8g (gross weight) of heroin a day, in addition to other drugs, namely, opium, ganja and ice. Selamat claims that Ali would give him his daily fix of 6g of heroin (gross weight) a day in a packet and says that he knew that his daily fix was 6g (gross weight) as he had observe Ali weigh and pack the heroin before passing it to him. Ali testifies that he did not weigh and pack Selamat’s daily supply of heroin but would share heroin in a powdery form from a container with Selamat. Ali roughly estimates that Selamat consumes about half a packet of heroin which is about 4g (gross weight) a day. Both Selamat and Ali rely on a report prepared by Dr Winslow Rasaiah Munidasa (“Dr Winslow”) which states that Selamat and Ali were heavy consumers of heroin based on their reported consumption patterns. Dr Winslow also observed that Selamat’s withdrawal symptoms post-arrest was consistent with a 6g to 8g (gross weight) daily dosage of heroin, indicating a moderately heavy or heavy consumer of heroin. The prosecution submits that neither their statements regarding their consumption nor Dr Winslow’s report are credible evidence that corroborate Selamat’s and Ali’s claim as to their rate of consumption. 10 I find that Selamat and Ali have not proved their rate of consumption. Their statements relating to their consumption do not serve as credible evidence to establish their consumption pattern – they are bare assertions. Dr Winslow’s report is mainly based on Selamat and Ali’s uncorroborated evidence. This was conceded by Dr Winslow under cross-examination. Dr Winslow’s findings on Selamat based on his withdrawal symptoms also cannot form a basis for his finding on Selamat’s rate of consumption. Dr Winslow admitted under cross-examination that the correlation between the amount of drugs consumed and withdrawal symptoms is general and could vary between individuals. 11 Selamat and Ali’s claim that only half the Bundle,ie, 27.12g (net) of diamorphine was intended to be sold, suffers from an accounting deficit because the sales would reap less than the cost of purchase. In his evidence, Ali says that a pound of heroin (27.12g of diamorphine in net weight) could be repacked into 58 smaller packets of 8.4g (gross weight) and sold at the price of $180 per packet. Taking Selamat and Ali’s case at its highest,ie, where half the Bundle is sold and the other half consumed, selling half the Bundle,ie, 29 packets of 8.4g (gross weight) would only result in revenue of $5,220. That would have caused a loss to Selamat and Ali as the revenue would be less than the cost price of $5,400 for the pound (gross weight) of heroin. Ali admitted to this loss under cross-examination but said that he manages this loss because he can “roll over the money”. Ali did not explain how this “rolling over” mechanism worked. Neither Ali nor Selamat had any other source of income at the material time to indulge their drug habits. In my view, the evidence shows that both men are drug abusers who pay for their drug use by selling drugs themselves. That means, of course, that there must be profit or else they would have no means of paying for the drugs they consume. On that basis, I find that Selamat and Ali’s claim that only half of the bundle of diamorphine was sold is not proved on a balance of probabilities. 12  I am aware that it is possible that Selamat and Ali’s calculations are wrong because their estimation and recollection may be imperfect since Selamat and Ali did not keep strict account of the amount of drugs that they sold or consumed. But the existence of this possibility is not sufficient. The law requires them to show more than simply circumstances that might create a doubt. The presumption in law which arises in the present instance requires them to prove on a balance of probabilities that they were not trafficking in more than 15g (net) of heroin. This they have not done. 13 The remaining issue is whether in the act of trafficking, they were acting merely as couriers and no more. So far as Selamat is concerned, Ali referred to him as a ‘partner’ and says that Selamat was the one who had all the contacts of and dealt with suppliers and buyers of heroin. In his statement, Ali avers that: My part in selling heroin was to repack the heroin and to provide the capital and [Selamat] was to get customers and also to get the heroin from the supplier. I did not ask [Selamat] about his supplier. I was not concerned about the supplier. As long as I got my heroin supply, I am happy about it. [Selamat] is more like working with me. We are partners. I have never sell heroin to anyone before. It is all done by [Selamat]. 14 Selamat, on the other hand denies this saying that Ali was the one who did the ordering. Selamat’s statement records Ali’s participation to be: Normally [Ali] will use the White ‘Nokia’ phone marked S-HP1 that was seized from me to order the Heroin supply from Malaysia side. I do not know in details how the ordering process goes, as he is the one ordering and not me. I only know he ordered through phone a few times as I overheard his conversation…Previous few occasions [Ali] will go and collect the Heroin himself.Only this time roundhe is asking for my help to collect the Heroin on his behalf as he is very high on drugs. So after he received a call from the delivery man, he passed me the phone and the packet of money and asked me to help him take the Heroin from the delivery man. [emphasis added] The evidence adduced by the prosecution and the testimonies of Selamat and Ali in court shows that on 23 October 2012, Selamat was carrying out instructions given to him by Ali to pick up and pay for the Bundle. Although there is no evidence of how Selamat was paid for his work for Ali, it was clear that for his troubles, Selamat gets free drugs and also gets to stay with Ali in the Flat. Ali also says that whenever Selamat needs money, he would let Selamat take from the money box where the proceeds of drug sales are kept. In his statement Ali stated that: We do not really split the profit that we got from the sale of heroin. What I do is all the profit will be placed in the two bags and when [Selamat] needed money to buy anything, he will just ask me and I will just give him the money. The reason we do not split the profit is that I was the one that came out with the money to buy the heroin and he was also staying in my house. 15 Although Ali alleges that Selamat had the contacts of suppliers and buyers, I am sceptical that that was the truth. Even though I accept that Selamat might know some of the suppliers and buyers through the course of dealings, he was, on this particular occasion, only carrying out Ali’s instructions. The evidence does not show that Selamat contacted Ragunath or Ragunath’s boss, and I think it was likely to be Ali. Selamat also did not know who Ragunath was. I am therefore of the opinion that Selamat was acting only as a courier. The evidence indicates that Ali was the one who had more authority than Selamat. 16 The evidence that shows Selamat to be just a courier also implicates Ali as the person in charge. From the evidence, Ali is the one who controls when and how much drugs to buy. He provides the finances for the purchase of the drugs. He was the one who gave Selamat the instructions to collect the drugs in respect of this transaction. He also admits to repacking the drugs from the Bundle into smaller sachets for the purpose of selling. Most importantly, he retained the profits of the drug sales. There being no evidence against anyone else, including one Azman who had been smoking drugs in the Flat with Selamat and Ali at the time of their arrest, I am of the opinion that Ali was not acting merely as a courier.",
        "The case against Ragunath": "17 Ragunath does not deny that he was the one who delivered the Bundle to Selamat on 23 October 2012. His defence is that he did not have knowledge of the contents of the Bundle and claims that he was only told that the Bundle contained “oral medicine for the elderly”. Ragunath’s story is that he came to Singapore on 23 October 2012 to visit his friend “Sathish” who worked at Changi Airport. On his way to Singapore, Ragunath received a phone call from Hari, a moneylender in Malaysia who Ragunath admits seeking a loan from. Ragunath claims that Hari had asked him for help saying that his friend’s motorbike had broken down at Woodlands and that he needed Ragunath to collect and deliver “medicines for elderly” to a person who would call him. Ragunath claims that he was told by Hari to meet Hari’s friend at the “rail station at Woodlands”. Upon reaching Singapore, Ragunath met Hari’s friend at the rail station at Woodlands where he was passed a plastic bag containing the Bundle. Ragunath claims that Hari’s friend told him that it was “medicines for the elderly”. Ragunath says that he checked the plastic bag and had “opened the bag” and “pressed to see what was the item”. The Bundle was wrapped in “black masking tape” and according to Ragunath, felt like something from “Chinese medical shops”. He did not check further. In his statement, Ragunath stated the following: I then asked Hari what is the thing I was supposed to take. Hari told me that it was medicine for elderly people and he also told me not to open the plastic bag as the oral medicine will be spoiled. Ragunath also stated: I do not feel suspicious as I am in need of money, I just help Hari to deliver the drugs without thinking too much. I was now being asked if I opened the plastic bag which contained the drugs and do I feel suspicious of what is inside. Also did I check what I am delivering at that point in time. I would like to sayI did checked what was inside the plastic bag that I am delivering as I was suspicious. I saw a black bundle. I then pressed to feel what is inside the bundle. It felt like medicine for the elderly just like what Hari had told me. I decided to deliver the drugs. [emphasis added] 18 Ragunath then met Selamat (though he did not know his identity then) and handed the Bundle to Selamat in exchange for a packet of money. Ragunath asked Selamat why he was giving him money, and Selamat told him that “this money is not for you. This money is to be given to the loan shark”. As Ragunath had the Bundle in his possession, he is presumed under s 18(2) of the Misuse of Drugs Act to have known that it contained diamorphine. Section 18(2) of the Misuse of Drugs Act states that Presumption of possession and knowledge of controlled drugs (2)  Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. Where the presumption under s 18(2) of the Misuse of Drugs Act arises, the burden lies with the accused “to prove on a balance of probabilities that he did not know or could not reasonably be expected to have known” that the bundle contained drugs. Has Ragunath rebutted the presumption of knowledge on a balance of probabilities under s 18(2) of the Misuse of Drugs Act? 19 Ragunath’s counsel, Mr Jayakumar Naidu (“Mr Jayakumar”) submitted that Ragunath did not know and could not reasonably be expected to have known that the Bundle contained diamorphine because Ragunath was told by Hari and Hari’s friend that the bundle contained “medicine for the elderly”, and was told not to open the bundle or the contents would spoil. Furthermore, Ragunath checked the Bundle by pressing on the top of it and concluded that its contents felt like medicine found in traditional Chinese medicine shops. 20 In response, the learned Deputy Public Prosecutor (DPP) argued that Ragunath ought to have known that the Bundle contained something illegal. The learned DPP submitted that Ragunath received the bundle in highly suspicious circumstances and should have done more than pressing the Bundle to check. Ragunath should have found it odd for Hari to ask him to make a delivery when, according to him, all he did for Hari previously was to collect money for him. As far as Ragunath was aware, Hari was a moneylender whose business had nothing to do with the delivery of medicine. The learned DPP also submitted that it is difficult to see how Ragunath reached the conclusion that the contents felt like medicine sold in Chinese medical shops simply on the basis that the Bundle contained big pieces because at no point did Hari or Hari’s friend mention that the contents of the Bundle was traditional Chinese medicine. 21 Finally, the learned DPP submitted that Ragunath’s testimony should not be accepted because he was not a truthful witness. The learned DPP argued that Ragunath’s credibility is diminished because: (a) he had sought to downplay his relationship with ‘Hari’. Although he claimed that he was not close to Hari in his investigation statements and only received a commission of RM100 when he recommended borrowers to him, he revealed during cross-examination that he was actively assisting Hari in his illegal moneylending business by collecting money for him in Singapore; (b) he could not explain his activities in Singapore clearly. When confronted with his entry-exit records and his text message records in RN-HP2, Ragunath could only provide vague and evasive answers as to what he was doing in Singapore on 24 September 2012, 29 September 2012, 2 October 2012, and 20 October 2012; (c) he could not provide reasonable explanation for having received text messages containing Singapore addresses on the dates he visited Singapore and merely asserted that he did not go to any of those places. However, he later acknowledged that he had received a text message on 20 October 2012 containing the address of Block 299B because Hari had told him to go there. This contradicts Ragunath’s evidence that he was only informed about the delivery on 23 October 2012; and (d) he did not have a reasonable explanation as to why he had parked his motorcycle at Giant Hypermarket in Tampines before taking a taxi to Block 299B on 23 October 2012. All he said was that he did not know his way to the Block 299B. The learned DPP submits that he had done that to avoid being traced, and not because he did not know the way. 22 Ragunath was young at the time of the offence (22-years old) but he is an intelligent young man. Ragunath was told an implausible story by Hari that his friend’s motorcycle had broken down and asked to help deliver a packet of ‘oral medicine’ wrapped up in black masking tape to another person who would contact him shortly after. These were highly suspicious circumstances and in fact, Ragunath’s suspicions had been aroused when he received the Bundle, which is why he looked into the plastic bag containing the Bundle and pressed on the top of the Bundle before concluding, without any basis, that the Bundle contained traditional Chinese medicine. But poking the Bundle and accepting Hari’s word that it was oral medicine or food is not sufficient to discharge the presumption. Given the circumstances, if Ragunath was unable to see what was wrapped inside the Bundle, he ought to have refused to deliver it. If he did not, and the Bundle turned out to be drugs (as it did in this case), claiming ignorance will not discharge the presumption of law that he knew that the Bundle contained drugs. A claim of ignorance would be a sufficient defence if the evidence corroborates the claim and the testimony is accepted as truthful. 23 I find that Ragunath’s statements and testimony in this case have not been truthful in certain aspects as he had been unable to provide reasonable explanation of the points raised by the learned DPP (see [21] above). In particular, he was not able to provide a reasonable explanation to why there was a text message dated 20 October 2012 on his mobile phone containing the address “Block 299B Tampines St 22”, the place where the Bundle was delivered. Ragunath was also unable to provide a reasonable explanation on why he parked his motorcycle at Giant Hypermarket before taking a taxi to Block 299B Tampines Street 22 to deliver the Bundle to Selamat. 24 On the evidence, I am of the view that Ragunath likely knew that what he was carrying inside the Bundle was illegal, but even if he did not know, the circumstances required him to find out. I therefore find that the prosecution has proved its case against Ragunath. Nonetheless, the evidence shows that Ragunath only acted as a courier and nothing more. All the evidence pointed to his role as a delivery man. 25 I therefore find all three accused guilty as charged and convict them accordingly. The appropriate sentence, depending on the availability of the certificate of substantial assistance, will be passed. - Sgd -Choo Han TeckJudge Eugene Lee, Andrew Low, Lee Zu Zhao and Theong Li Han (Attorney-General’s Chambers) for prosecution;Luke Lee (Luke Lee & Co), Sanjiv Rajan and Cai Cheng Ying (Allen & Gledhill LLP) (17 February to 21 July 2015);First Accused in-person (11–13 August, 22 October 2015);James Masih (James Masih & Company) and Wong Seow Pin (S P Wong & Co) (from 10 August 2016) for the first accused;Mervyn (Eugene Thuraisingam) (17–24 February 2015);Second Accused in-person (7, 21 May, 21 July 2015);Soo, Hany Soh Hui Bin (Chia Thomas Law Chambers LLC) and Sankar s/o Kailasa Thevar Saminathan (Sterling Law Corporation) (11 August to 22 October 2015);Ismail Hamid (Ismail Hamid & Co), Ho Thiam Huat (T H Ho Law Chambers) and Wong Li-Yen Dew (Dew Chambers) (from 10 August 2016) for the second accused;Jayakumar Naidu (Jay Associates) and Nedumaran Muthukrishnan (M Nedumaran & Co) for the third accused."
    }
}