{
    "case_title": "Public Prosecutor vAndrew Koh Weiwen",
    "ncitation": "[2016] SGHC 103",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 This is the Prosecution’s appeal against the sentence of the Respondent in respect of one charge of voluntarily causing hurt under s 323 of the Penal Code (Cap 224, 2008 Rev Ed). Upon his plea of guilt, the Respondent, a 27 year old male Singaporean, was convicted by the District Judge and sentenced to a term of two days’ imprisonment and a fine of $5,000.00 (with four weeks’ imprisonment in default of payment) (see the District Judge’s grounds of decision atPublic Prosecutor v Andrew Koh Weiwen[2015] SGMC 33 (the “GD”)). 2 Although this is a simple offence of voluntarily causing hurt, disputed facts relevant to sentence were inconclusively dealt with at the proceedings below. The admitted Statement of Facts (“SOF”) tendered by the Prosecution provided scant details of the events immediately preceding the physical attack, which allowed room for different versions of facts to emerge. Fortunately, the Prosecution and the Respondent managed to resolve their differences after a short adjournment was granted to them. After considering the submissions of the parties and the precedent cases, I am of the view that the sentence imposed by the District Judge is manifestly inadequate having regard to all the material facts and circumstances of the case. I allow the appeal, and order the Respondent’s sentence to be enhanced to four weeks’ imprisonment instead.",
        "Background": "The facts 3 The victim, Mr Lai Yongwen (“Mr Lai”), was waiting for a taxi with two other friends in the early morning at or around 6 am on 6 July 2014 in front of St James Power Station, a nightlife venue along Sentosa Gateway. The Respondent was in the vicinity with a glass bottle of liquor (the “Martell bottle”) after drinking with his friends at a nightclub in the area. The Respondent approached Mr Lai and suddenly hit him on the head with the Martell bottle. The Respondent also elbowed Mr Lai on the nose in the subsequent fracas while Mr Lai was attempting to stop the Respondent from attacking him further. As a result, Mr Lai sought medical treatment at Singapore General Hospital. His medical report dated 30 July 2014 indicated that he had suffered two superficial lacerations: one over the scalp measuring 3 cm, and the other over his nose measuring 0.5 cm. 4 The Respondent, a first-time offender, pleaded guilty to the offence at an early stage, and had offered compensation to Mr Lai. The proceedings below 5 After the Respondent was convicted, the Prosecution addressed the court on sentence and sought a custodial sentence of four weeks’ imprisonment. The Prosecution pointed out that the glass bottle used was a “dangerous weapon” and opined that it was “fortunate that the victim suffered only lacerations” (see [12] of the GD). In the written mitigation plea, it was brought up that counsel for the Respondent was instructed that the Respondent had witnessed a verbal fracas that morning and had seen his friend surrounded by a group of people, before he had joined in to “help his friend” who was being assaulted by the group. He then used the Martell bottle he had to hit Mr Lai. It was not anticipated that the Respondent would be involved in a fight but he “had used the bottle as he was fighting with the group of people”. As a result, the Respondent “suffered facial cuts and bruises to his face and body with blood streaming down from his face”. In response, the Prosecution stated that the scenario painted by the Respondent where he was there to help a friend being assaulted was not borne out by investigation as there was only a verbal fracas with no physical contact between the parties until the Respondent hit Mr Lai with the Martell bottle. The decision below 6 The District Judge sentenced the Respondent to a very brief term of imprisonment of only two days and a fine of $5,000.00 (with four weeks’ imprisonment in default of payment). He noted the fact-specificity of sentencing under s 323 of the Penal Code and emphasised the norm that where only minor injuries were caused, the offence was dealt with by the imposition of a fine. The District Judge then proceeded to compare Mr Lai’s injuries (of two superficial lacerations) to the victims’ injuries in five cases under s 323 where only fines were imposed, and concluded that Mr Lai’s injuries were much less serious than the victims’ in those five cases (see [33] of the GD). 7 The District Judge also noted that (a) Mr Lai was not a “vulnerable victim”; (b) the Respondent did not have a record of violence and was not in a position of authority; (c) the attack was not racially motivated; (d) the Respondent acted on impulse; and (e) there was no provocation (see [31] of the GD). The District Judge inferred genuine remorse on the part of the Respondent, based on his plea of guilt and his offer of compensation to Mr Lai (which was rejected as Mr Lai’s medical expenses were settled by his insurance). 8 Lastly, the District Judge was of the view that the “singular” aggravating factor in the case was the fact that the Respondent had used a weapon, the Martell bottle, to hit Mr Lai once on the head. The District Judge also apparently disregarded Mr Lai’s second laceration over his nose on the basis that it was not caused by the Martell bottle, but by the Respondent’s elbow (see [35] of the GD). The appeal 9 The crux of the Prosecution’s appeal lies in its case that the present matter involves an unprovoked and unrelenting attack that employed the use of a dangerous weapon on a particularly vulnerable part of the victim’s body. The attack was a continuing one, as evidenced from the fact that the victim had to stop the Respondent from further attacks. The Prosecution submits that the District Judge had wrongly emphasised the absence of certain aggravating factors, as opposed to focusing on the aggravating factors that were in fact present. Further, the Prosecution submits that the District Judge appeared to have aligned the sentencing in this case to other cases that had materially different factual matrices, and ignored other s 323 precedents where substantial imprisonment terms were imposed in cases where weapons had been used, however minor the extent of injuries caused to the victims. Based on the various sentencing precedents, the Prosecution submits that the sentence imposed on the Respondent should be enhanced to four weeks’ imprisonment.",
        "Disputed/unascertained facts relevant to sentence": "10 Despite the SOF having been admitted without qualification by the Respondent before his conviction on his plea of guilt, there were several facts(some disputed)relevant to sentencethat were not ascertained or resolved at the proceedings below as could be seen from a perusal of the GD and notes of evidence: (a) What were the surrounding circumstances immediately prior to the Respondent suddenly approaching Mr Lai and hitting him on the head with the Martell bottle? (b) Were there other people involved? (c) Did the Martell bottle break upon impact? (d) Was the Respondent injured in the incident, and if so, how? 11 From my examination of the proceedings below, I have two observations to make: (i) if the Prosecution objects to or disputes certain factual assertions made in the course of mitigation which have a material impact on sentence, the Defencemusteither withdraw those statements, provide proof or call evidence via aNewtonhearing; and (ii) any aggravating facts that the Prosecution wishes to rely on in its submission on sentence should be included in the SOF to minimise any subsequent dispute and the need for aNewtonhearing. 12 In the mitigation plea at the hearing below, it was asserted by the Respondent that he had joined in to “help his friend” who was being assaulted by the group. However, the Prosecution had objected to this and categorically stated its position that this was not “borne out by investigation”. However, it seems that the Respondent is still taking the position during the appeal before me that he had helped his friend, and that there was aphysicalfracasbeforehe used the Martell bottle to hit the victim. Chan Sek Keong CJ’s comments inPublic Prosecutor vAniza bte Essa[2009] 3 SLR(R) 327 at [61] on the mitigation process in plead guilty proceedings are instructive here: The existing practice of the Prosecution in tendering to the court an agreed statement of facts and of defence counsel in providing the Prosecution with a copy of the mitigation speech before the sentencing hearing has made the mitigation process simple. This practice minimises any dispute between the Prosecution and the Defence on what mitigation statements are to be admitted without proof. This practice has rendered aNewtonhearing (seeR v Robert John Newton(1982) 4 Cr App R (S) 388) a rarity in our courts.Where the Prosecution objects to any unsubstantiated assertions in the mitigation speech, the Defence will either have to withdraw the statements, provide proof acceptable to the Prosecution or call evidence. This may be regarded as an analogous form of theNewtonhearing, which is also rare in our sentencing practice. If the Prosecution does not object to the assertions made by the Defence, the court is entitled to accept them and give such weight to them as it thinks fit. [emphasis added] 13 As the Prosecution had clearly objected to the fact that the Respondent had to help his friend who was already involved in a physical fracas and the Defence had not responded appropriately at the hearing below to back up this assertion not found in the admitted SOF, I am not minded to allow the Respondent to continue asserting this disputed fact at this stage. All disputed facts relevant to sentence should have been resolved at the hearing below. 14 Thus, the SOF tendered by the Prosecution and admitted by an accused person, along with the charge(s), are crucial in setting out the admitted facts for the court’s consideration during sentencing in plead guilty cases. Just as the Prosecution cannot introduce new aggravating factsbeyondthe admitted facts by the back door in its submissions on sentence whether at the hearing below or subsequently at the appeal, the Defence similarly cannot slip in new unsubstantiated mitigating facts by the back door through its submission on sentence at the appeal or by relying on disputed mitigating facts in its mitigation plea which remain unresolved at the hearing below. This point was emphasised by See Kee Oon JC inPublic Prosecutor v Development 26 Pte Ltd[2015] 1 SLR 309 (“Development 26”) at [16]: When accused persons plead guilty, their plea marks their acceptance of the charges against them as well as what is set out in the statement of facts if one is prepared. The charges and the statement of facts constitute thefour corners of the caseagainst them. [emphasis added] 15 InDevelopment 26, no SOF was prepared during the proceedings below and the respondent there had pleaded guilty to facts “as per the charges”. On appeal, the Judicial Commissioner was of the view that the appeal should be confined to the facts that the accused person had admitted to, and that the Prosecution could not seek to alter the entire factual basis for the plea of guilt by adducing additional evidence on appeal. 16 Reverting to the present case, I am of the view that the SOF tendered by the Prosecution and admitted to without qualification by the Respondent below is inadequate and bare. The SOF fails to flesh out adequately all the relevant facts of the case which are material to sentence. If it is part of the plea bargain that certain aggravating facts or disputed facts relevant to sentence are to be omitted, the Prosecution will omit them from the SOF and will not rely on them to address the court on sentence. The other side of the coin is that during mitigation, the Defence should not be addressing the court on the basis that those aggravating facts or disputed mitigating facts omitted from the SOF as part of the plea bargain are absent or present respectively as that would be misleading. I reproduce the short one-page SOF in full: 1. The accused is Andrew Koh Weiwen, a 26 year-old male Singaporean, bearing NRIC No. S8851611G. 2. The victim is Lai Yongwen, a 25 year-old male Singaporean. 3. On 06 July 2014, the police received a call with the following message:Required AB, Someone injured.The incident location was given as Sentosa Gateway, in front of St James Power Station, Singapore. 4. Investigations revealed that on 06 July 2014, at or about 06.00am, at the incident location, the accused was walking with a bottle of liquor. At that point in time, the victim was also there waiting for a taxi with two of his friends. 5. Suddenly, the accused approached the victim and hit him on the head with the bottle that he was holding. The accused then elbowed the victim on the nose while the victim was trying to stop the accused from attacking him further. 6. The victim was subsequently conveyed to Singapore General Hospital and sought medical treatment there. His medical report dated 30 July 2014 indicated that the victim suffered 2 superficial lacerations, one over the scalp measuring 3cm and another over the nose measuring 0.5cm, both as a result of the accused’s attack. 7. By virtue of the above, the accused has thereby committed an offence under s.323 of the Penal Code (Cap 224, 2008 Rev Ed). 8. The accused is thus charged accordingly. 17 It is a basic tenet that the Prosecution is duty-bound to assist the court to make a decision on sentence. As the Prosecution and the Defence may under certain circumstances compromise in terms of what material facts relevant to sentence are to be included or excluded in the SOF and the mitigation plea in the process of achieving a plea bargain, the court is necessarily limited in its consideration to only those material facts that have been presented in the SOF and mitigation plea. However on occasions, prosecutors may simply tender an SOF light in narrative detail to dispose of cases quickly for practical reasons. This case appears to be one such example. The SOF here is very brief. It does not paint a full picture of what had occurred. As a result, it allows room for parties to differ subsequently on what, if anything, had happened immediately preceding the physical attack. The SOF also gives the impression that any fracas that occurred was in fact only between the Respondent and the victim, Mr Lai, and that there were no other persons involved. 18 As the parties initially continued to dispute the facts as to what had happened prior to the physical attack (which I reiterate ought to have been resolved at the hearing below but apparently were not), I instructed counsel for the Respondent to take instructions and then confer with the Prosecution to sort out all disputed facts relevant to sentence to see if they could come to an agreement on what had occurred on that morning of 6 July 2014. I also indicated that I was perplexed as to why the Respondent would suddenly approach the victim and hit the victim on the head with a bottle for no rhyme or reason as the bare SOF appears to suggest at [5]. Was it a sudden random attack in the early hours of the morning on an unsuspecting member of the public waiting for a taxi? Eventually, the parties agreed on the facts and explained to me that: (a) there was only averbal—and not a physical—fracas,beforethe Respondent suddenly hit the victim on the head with the Martell bottle (iethe verbal fracas led to the sudden physical attack on the victim with the Martell bottle and it was not a random attack on a stranger waiting for a taxi, which would have been more aggravating); (b) the Martell bottlebrokeupon impact when the Respondent smashed the bottle on the victim’s head; (c) the Respondent was injured himself and bloodied due to the physical fracas that ensued; and (d) other people then joined in the physical fracas that followed (ieit was the Respondent’s sudden physical attack on the victim that ignited the subsequent physical fracas where several other persons joined in). 19 For the record, had the parties not come to an agreement with respect to the material facts that they wish to rely on for the purpose of  sentence, I would have remitted the case back to the District Judge for aNewtonhearing. AlthoughNewtonhearings are exceptional, the court should hear evidence if facts material to sentence are contested and make a finding to do justice and sentence the offender on the basis of accurate facts (seeNg ChunHian v Public Prosecutor[2014] 2 SLR 783 at [24]).",
        "My decision": "20 Having now established the relevant facts material to sentence (above at [18]), I move on to consider the adequacy of the sentence imposed on the Respondent by the District Judge.",
        "Fact-specificity in hurt offences": "21 The factual matrices in offences of hurt vary considerably. The appropriate sentence for each case must necessarily depend on its specific facts and circumstances. The sentencing judge has to consider all the relevant factors affecting sentence. 22 The Prosecution interprets the District Judge’s emphasis that there were no aggravating factors such as premeditation, group action, a vulnerable victim, racial motivation, a record of violence, etc. (at [31] of the GD) to be a misconstrued placement of mitigating weight on an absence of aggravating factors (seePublic Prosecutor v AOM[2011] 2 SLR 1057 at [37]). However, from the overall reasoning in the GD, I find that the District Judge was not erroneously treating the absence of aggravating factors as mitigating. Instead, he hadstartedfrom the principle that in hurt offences, where minor injury is caused the offence is usually dealt with by the imposition of a fine, unless certain aggravating factors are present to indicate a sufficient level of seriousness to breach the custody threshold. Hence, he was in fact treating the lack of those aggravating factors asnon-factors. On the other hand, the Prosecution is taking the position that where a dangerous weapon is used, the appropriatestarting pointwould be an imprisonment of a few weeks, even if the injuries suffered are not serious. Herein lies the diametrically differentstarting pointsbetween the sentencing analysis of the District Judge and what is being proposed by the Prosecution. 23 In my view,allsentencing factors must be taken into consideration: be it the degree of deliberation, extent and duration of attack, nature of injury, the presence of provocation or the use of a weapon. By taking either the seriousness of the injury or the use of a dangerous weapon as determinative of the sentence would be over-emphasising one factor over others and may not result in individualised justice.",
        "Protecting public transport users": "24 Although the District Judge had concluded that the victim was not a “vulnerable victim” (GD at [31]), the Prosecution is taking the position that the victim was in a “vulnerable position of waiting to use public transport”. In fairness to the District Judge, I should point out that this submission was not made to him below. 25 Vulnerability ought to be analysed in relative terms, and our local case law has considered this factor in instances where victims are public transport workers (Wong Hoi Len v Public Prosecutor[2009] 1 SLR(R) 115;BalbirSingh s/o Amar Singh v Public Prosecutor and another appeal[2010] 3 SLR 784) and children or spouses (Public Prosecutor v LuanYuanxin[2002] 1 SLR(R) 613). The Prosecution cites an Australian criminal state court authority for its proposition that persons waiting for, or using, public transport are vulnerable (Vaeila v The Queen[2010] NSWCCA 113 at [22]–[23]): The Court has, on a number of occasions, made clear that one of the fundamental features of the criminal justice system is to regulate the protection of people, going about their ordinary business, from being attacked or set upon. These principles are fundamental to any system that seeks to regulate society and were summarised by Gleeson CJ inR vRanse(Court of Criminal Appeal, 8 August 1994, unreported) in which his Honour said, at p 8: One of the primary purposes of the system of criminal justice is to keep the peace. In this connection the idea of peace embraces the freedom of ordinary citizens to walk the streets and to go about their daily affairs without fear of physical violence. It also embraces respect for the property of others. The foregoing comments are rendered even more applicable in circumstances where attacks are made on people who are using, or waiting to use, public transport. Such persons are necessarily in an even more vulnerable position and require protection: seeR v Kelly[2005] NSWCCA 280; (2005) 155 A Crim R 499 at [6] and the cases cited therein. 26 Notably, the above proposition quoted fromR vRansehad also been adopted by the same Australian criminal court with respect to the protection of citizens who use public transportlate in the evening, thereby placing themselves in a position of “some vulnerability”: seeR vIbrahimi[2005] NSWCCA 153 at [22]–[24]. Locally, the High Court had also previously observed the need for general deterrence to protect “helpless commuters utilising…transport services” (Public Prosecutor vHeng Swee Weng[2010] 1 SLR 954 at [20]), albeit in a situation where the offender was a public transport service provider. 27 Public transport is an indispensable part of many people’s daily lives, and will be even more so as we move towards a car-lite transport model in Transport 2030 with the rail networkdoublingby then (see Speech by Minister Khaw Boon Wan at the Committee of Supply Debate 2016, on Preparing for 2030, 12 April 2016; and also Fact Sheet on Public Transport Improvements and Future Plans, Ministry of Transport, 26 August 2015). 63 per cent of all trips made during peak periods are now made on public transport, and the aim is to increase this to 75 per cent by 2030 (see the Land Transport Master Plan 2013, Land Transport Authority). Offences against people travelling on, or waiting to use, public transport directly affectpublic safety and security. There is a strong level of public interest in warranting general deterrence in such situations (seePublic Prosecutor v Law Aik Meng[2007] 2 SLR(R) 814at [24(d)]) to send a strong message that people should be able to go about their daily affairs without any fear of physical violence. Therefore, I agree with the Prosecution that attacks and offences against people travelling on or waiting to use public transport should be viewed as an aggravating factor in sentencing.",
        "Analysing comparables in precedents": "28 I also agree with the Prosecution that the five cases where onlyfineswere imposed and which the District Judge relied on as precedents (see the GD at [28]) aremateriallydifferentfrom the present case and should thus be distinguished: (a)Public Prosecutor v AOB[2011] 2 SLR 793: The offender was slapping his daughter’s face at Serangoon Bus Interchange. The victim and his friend witnessed this and the latter intervened and asked the offender to stop. The offender then told the complainant to mind his own business and told the victim that “Malays are bastards, Chinese are good”. The victim told the offender not to say such things and was then punched on the nose by the offender. The offender was fined $3,500 (in default three weeks’ imprisonment). Although the offender had acted on impulse and his attack was not premeditated, hedid not use anyweapon. (b)Sim Yew Thong v Ng Loy Nam Thomas and other appeals[2000] 3 SLR(R) 155: The District Judge referred to only the first offender in this case. Here, the offender was annoyed by the noise made by the victim’s group at the temple. The offender then punched the victim and knocked him to the ground. The offender’s conduct was the result of an impulsive outburst rather than a premeditated attack. The offender was fined $1,000. Although the victim’s injuries were similarly minor with only bruises, abrasions and tenderness,no weapon was usedby the offender. (c)Jewel Shaikh Khorshad Ali v Public Prosecutor(MA 9157/2015/01, unreported) (“JewelShaikh Khorshad Ali”): The offender and victim were co-workers. After a lunch break, the offender brushed past the victim who then confronted the offender with a 1.5 m long metal rod. A scuffle ensued and the victim kicked the offender on his right leg. The offender then picked up the rod the victim had dropped and used it to hit the victim’s head. At first instance, the offender was fined $5,000 (in default, four weeks’ imprisonment). Although a weapon (metal rod) was used and the victim’s injuries were not severe, there wasgraveprovocation(as opposed to an absence of significant provocation in the present case) which was a mitigating factor. The District Judge also took into account the fact that the offender had already spent29 days in remandand was “mindful that the [offender] was not excessively punished”. On appeal, the fine was reduced to $1,000 (in default, one week’s imprisonment). (d)Public Prosecutor v Du Guangwen(DAC 3314/2013, unreported) (“DuGuangwen”): This was a dispute over work matters, during which the offender pulled and tore the victim’s T-shirt. The victim held the offender by the collar of his shirt, thus strangling the offender. The offender then took a metal hammer and struck the victim’s head once. The offender also struck the forearm of the victim when the latter raised his right arm in defence. The offender was fined $5,000 (in default three weeks’ imprisonment). Although a weapon was used (hammer) and the victim’s injuries were similarly minor, there wassignificant provocationas the victim was strangling the offender at the material time before the offender hit the victim with the hammer. (e)Public Prosecutor v Kang Chuan Beng(DAC 18112/2013, unreported) (“KangChuan Beng”): The victim was the offender’s girlfriend. They got into an argument at a casino, and the offender took a ballpoint pen from the game table and used it to stab the victim’s face continuously. The offender was fined $5,000 (in default four weeks’ imprisonment). Although a weapon was used (ballpoint pen) and the victim’s injuries were similarly minor (superficial scratch marks over her right cheek), the ballpoint pen wasnot an inherently dangerous weaponper seand the offence had occurred in the context of a couple having an argument. 29 Counsel for the Respondent has not cited any precedents where a nominal imprisonment term of a few days was imposed in cases where a dangerous weapon was used but the victims suffered only minor injuries. On the other hand, the Prosecution is able to furnish seven sentencing precedents to illustrate the point that even where minor injuries were sustained by the victim, the custody threshold for a s 323 offence was not only likely to be met where there was adeliberate attack witha lethal weapon, but a non-nominal sentence of between one week to a few months was also imposed depending on the extent of the provocation of the offender by the victim (if any): (a)Public Prosecutor v Tan Phui Moi[2002] SGMC 5 (“TanPhui Moi”): The attack occurred in the context of a dispute between the offender and victim in a residential block. This was a sustained attack where a motorcycle helmet was initially used to hit the victim’s head. The victim was also fisted on the face and body. The victim’s injuries were minor: abrasion on the head and rib cage, bruise over the left side of the chest, and a minor cut on the ring finger. The offender was sentenced to three weeks’ imprisonment. The offender’s appeal against her sentence was subsequently withdrawn. (b)Public Prosecutor v Siti Sawiah Binte Osman[2009] SGDC 392: The victim had escalated a hostile situation by choosing to sit next to the offender on the same bench in the lobby of an office building and glancing intermittently at her soon after an earlier dispute had occurred. The offender took a porcelain vase from the table beside her and hit the victim on his head. It was a single attack and not a sustained or premeditated one. The victim’s injuries were minor: a minor head injury and a 3 cm left scalp laceration. The offender was sentenced to six weeks’ imprisonment. The offender’s appeal against her sentence was dismissed. (c)Public Prosecutor v Teo Hee Huat[2009] SGDC 281 (“TeoHee Huat”): The attack occurred in the context of a dispute between one Tan Kim Song (“Tan”) and the victim at a restaurant during which Tan threw a punch at the victim who managed to dodge it. Tan approached the victim with a beer bottle to confront him as he was leaving. When the victim refused to follow Tan, the offender, who was standing beside Tan, suddenly smashed a wine glass onto the victim’s face. The victim’s injuries were minor: 0.5 cm laceration over the right side of his forehead, 3 cm laceration over the nose, and multiple abrasions over the forehead. However, a further medical report noted that the lacerations over the victim’s right eyebrow and nose might give rise to permanent disfigurement. The offender was sentenced to three months’ imprisonment. The offender’s appeal against his sentence was subsequently withdrawn. (d)Public Prosecutor v Bian Yong Liang(DAC 12665/2012, unreported) (“Bian Yong Liang”): The attack occurred in the context of a dispute between the offender and victim in a dormitory, but the victim struck the first blow using a metal bunk bed ladder to hit the offender on the head. The offender retaliated by hitting the victim with a cooking pan. After the fight had broken up, the offender later approached the victim from behind and hit the victim on the head with a hammer. The victim’s injuries were minor: he had sustained a 4 cm laceration on the scalp, and was bleeding and in a drowsy and dizzy state at the time of his medical examination. The offender sustained a 2 cm open wound with depressed skull fracture at the left parietal region, left parietal region haematoma, mild right lateral neck tenderness and mild tenderness over the left shoulder. Both the offender and victim were sentenced to ten weeks’ imprisonment. (e)Kiong Chan KyamvPublic Prosecutor(MA 268/2013/01, unreported): The attack occurred in the context of a dispute between the offender and victim outside a coffee-shop in the early morning at about 1 am. The victim had charged towards the offender with beer bottles in his hand. Upon seeing this, the offender then took a beer bottle from one of the tables nearby and hit the victim on the head. The victim suffered fractures of the right orbit, nasal bone and frontal sinus. The offender’s sentence of three months’ imprisonment was reduced to one month’s imprisonment on appeal. (f)Public Prosecutor v Abdullah Al Imran Sardar Mijanur Rahman(DAC 33466/2013, unreported) (“Abdullah Al Imran”): The attack occurred in the context of a dispute between the offender and victim at a construction site (their workplace). The victim first pushed the offender and punched him on the side of his head. The offender then grabbed a hammer from a toolbox and hit the victim several times on the head with it. The victim suffered minor injuries: a 3 cm laceration on the scalp, left forehead haematoma with 2 superficial lacerations (each about 5 mm), and contusion on the left shoulder. The offender was sentenced to one week’s imprisonment. (g)Public Prosecutor v Li Bo(DAC 924005/2015, unreported): The attack occurred in the context of a dispute between the offender and victim at a worker’s dormitory. Both the offender and victim had continually hit each other until they were separated by their colleagues. Here, the offender used a kettle to hit the victim on the head. The victim also punched the offender’s face. The victim’s injuries were minor: a laceration on the scalp, and a displaced fracture of the proximal phalanx of the right thumb. The offender suffered a fracture on his facial area, haemorrhage on his left eye and a rupture in his pupillary sphincter. The offender was sentenced to six weeks’ imprisonment, while the victim was sentenced to ten days’ imprisonment.",
        "Table of sentencing precedents": "30 For ease of reference, I produce a table of the seven precedents listed above at [29] that analyses the relevant sentencing considerations in each case:",
        "Conclusion": "36 Cases of causing simple hurt under s 323 of the Penal Code may not be so easily dealt with in the absence of all the relevant facts material to sentence. Unless constrained by the plea bargaining process or other valid practical reasons, the SOF tendered by the Prosecution ought to paint a fuller picture and flesh out the relevant facts material tobothguilt and sentence to assist the judge given that the factual circumstances in each case can vary greatly and the sentencing range for the offence is fairly wide. If the Prosecution objects to unsubstantiated assertions in mitigation which are material to sentence, the Defence must either withdraw those assertions, provide proof or call evidence via aNewtonhearing. However, I recognise that there can be instances where the pure elements making out the charge(s) proceeded with by the Prosecution are not disputed and hence, the plea of guilt is taken on that basis with the SOF setting out just those facts sufficient to establish the elements of the offence(s), whilst leaving aside all other disputed matters of fact relevant to sentence to be decided later at a separateNewtonhearing subsequent to a conviction on the charge(s). This will at least save some of the court’s time that would otherwise be needed for a trial on purely matters of guilt. 37 Having said that, when the parties do not contemplate any need for a separateNewtonhearing and they are proceeding on the basis that all matters of conviction and sentence are to be dealt with in one proceeding when the accused pleads guilty, it is necessary for all the parties to agree on the facts relied upon in support of the conviction, including those material facts to be relied upon as aggravating or mitigating facts by the respective parties for the purpose of sentence. 38 Having considered the SOF and the material facts relevant to sentence that the parties have managed to agree on, and after taking into account the various sentencing precedents and the aggravating and mitigating circumstances in the present case, I find the Respondent’s sentence of two days’ imprisonment and a fine of $5,000 to be manifestly inadequate having regard to the unprovoked, sudden and sustained nature of the attack where a dangerous weapon had been directed with considerable force at the head of the victim who was waiting for public transport in the early hours of the morning. Accordingly, I allow the Prosecution’s appeal and enhance the imprisonment to a term of four weeks. The imprisonment term of two days and the fine of $5,000 are set aside. Chan Seng OnnJudge Mohamed Faizal and Ho Lian-Yi (Attorney-General’s Chambers) for the Appellant;Eddie Koh (S H Koh & Co) for the Respondent."
    }
}