{
    "case_title": "Majlis Ugama Islam Singapura vSaeed Salman and another",
    "ncitation": "[2016] SGHC 04",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 In this case, the Plaintiff, the body entrusted with administration of Muslim affairs in Singapore, sought orders that properties bequeathed by a testator in the 1950s was vested in it, and secondly that the Defendants, who were the trustees of such properties, provide an account of the trust proceeds and deliver records. The basis of the Plaintiff’s application was that the properties were the subject to awakaf, and thus were vested in the Plaintiff by virtue of s 59 of the Administration of Muslim Law Act (Cap 3, 2009 Rev Ed) (referred to in this Grounds of Decision as “the Act” or “the AML Act”).",
        "Background": "2 In 1949, Haji Mohamed Amin Bin Fazal Ellahi (“the Testator”) passed away. By a will he had made three years earlier in 1946 (“the Will”), the Testator directed his executors to sell his property, and after paying off his debts and testamentary expenses, to divide the balance into three shares, with one share going to the maintenance and upkeep of a school, the Aminia Muslim Girls’ School, in Delhi, India (“the Delhi school”), and the other two shares going to his heirs under Islamic law. The Delhi school had been established in 1938 by the Testator, who had apparently provided properties in India to generate earnings for the upkeep of the school. For ease of reference, the one-third share of the Testator’s estate that he had willed to the Delhi school will be referred to as “the Donation” in this Grounds of Decision. 3 Subsequently in 1957, the beneficiaries and the executors entered into a Deed of Partition, dividing the property between the beneficiaries. Under this deed, the one-third share going to the Delhi school under the Will was to be shared equally between the Delhi school and its offshoot or branch in Karachi, and that the Delhi school was to take property listed in a schedule to the Deed of Partition, as well as cash. The executors would convey to the trustees of the Delhi school all the property listed in that schedule for the trustees of the Delhi school to hold as joint tenants on trust for the uses and purposes of the Delhi school. The property listed in the schedule included the following properties, which will be hereinafter referred to as “the Trust Properties”: (a) units 1, 3, 5, 7, 9, 11, 13, 15, 17 and 19 of Lorong 18 Geylang Road, Singapore; (b) vacant land at Lorong 18 Geylang Road, Singapore; and (c) 3 Haji Lane Singapore (“the Kampong Glam property”). 4 In 2000, the trustees of the Delhi school instructed their agent in Singapore to register the Trust Properties with the Plaintiff, which under the Act had the responsibility of administeringwakafproperties. The Plaintiff then lodged caveats over the Trust Properties in 2001. 5 The present Defendants were appointed as trustees of the Delhi school in 2001. In 2011, the Defendants requested that the Plaintiff withdraw its caveats over the Trust Properties. The Plaintiff then requested for information about the Trust Properties, but this was refused by the Defendants. Following the Plaintiff’s inquiries through other means, the Plaintiff was concerned that the Trust Properties, which are mostly in the Geylang area were used for either nefarious or suspect businesses. The Plaintiff also discovered that a restaurant and a bar were being operated at the Kampong Glam property. The Plaintiff thus commenced the present application. 6 The matter was set down for cross-examination of the respective experts on Islamic law from both sides. Submissions were filed ahead of the cross-examination of the expert witnesses, with revised submissions tendered after. Below, I set out a summary of each party’s case.",
        "The Plaintiff’s Case": "7 The Plaintiff invoked the statutory provisions of the Act. Section 58(2) specifies that the Plaintiff administers allwakafand charitable Muslim trusts. Section 59 vests all property subject to s 58 in the Plaintiff without conveyance, assignment or transfer. Section 73 also provides that the financial provisions set out in the Second Schedule to the Act shall apply to all properties, investments and assets vested in the Plaintiff, subject to any trust,wakafornazarthat do not form part of the General Endowment Fund established under s 57 of the Act. 8 The Donation of the property to the Delhi school created awakafor a charitable trust over one-third of the Testator’s estate. By s 63 of the Act, the Will was to be interpreted according to Muslim law. It was not necessary for there to be express mention of the creation of awakafin the Donation. The Testator’s intention to create awakafcould be gleaned from these surrounding circumstances: (a) the grant was in favour of a school; (b) that school was founded by the Testator for the purpose of educating of girls in Islamic culture and religion; and (c) there was a prior dedication by the Testator of property under a separatewakafwhich was intended to generate earnings for the expenses of that school, so as to the allow the school to operate in perpetuity. 9 A cash fund, as originally constituted by the Will, may be the valid subject matter of awakaf: see Syed Ameer Ali,Mahommedan Law, Vol 1 (Himalayan Books, 4th Ed, 1985) (“Mahommedan Law”) andSakina Khanumand another v Laddun Sahiba and others[1905] 2 CLJ 218 (“Sakina Khanum”). Furthermore, the required elements of awakafwere fulfilled: (a) thewakafwas for a pious, religious, or charitable purpose; (b) the subject property was inalienable; and (c) the dedication was permanent. A valid purpose existed as endowment for a school was a recognised object for awakaf. The language of the Will also evinced the elements of permanence and inalienability. 10 The Plaintiff argued against the Defendants’ position that the Will was an outright gift of one-third of the Testator’s estate to the Delhi school and did not create awakaf. The Defendants’ arguments misconstrued the Will, and were not supported by the language used. In contrast, it was clear that the proceeds of the Testator’s estate were not given directly to the Delhi school; the executors were to administer and use the funds from the sale proceeds for the maintenance and upkeep of the Delhi school. The setting up of the school satisfied the element of permanence. In this regard, support could also be drawn from the trust deed that the Testator had made in 1938 in relation to the Delhi school (“the 1938 Trust Deed”). The Testator had intended for this trust to generate earnings for the Delhi school’s expenditure. In any event, it is clear from the prior conduct of the Defendants and their predecessors that they had recognised the existence of awakaf. Finally, even if nowakafwas created, it was a charitable trust within the meaning of s 58(2) of the Act. 11 Following on from the existence of awakafor charitable trust, the Trust Properties vested in the Plaintiff by virtue of s 59. The vesting of property in the Plaintiff through the operation of s 59 of the AML Act is not subject to the requirements of registration of land in the Land Titles Act (Cap 157, 2004 Rev Ed) (“Land Titles Act”). No mismanagement in the running of thewakafneed be shown either for vesting to occur. 12 The Deed of Partition did not affect the existence of thewakafor charitable trust. In any event, such a partition could not effect a transfer of the property to the Delhi school, since this would not be legal under Muslim law. 13 Contrary to the contentions of the Defendant, there was no evidence before the court that the Plaintiff had previously regarded the properties as not being subject to awakaf, and the Plaintiff had not so acted. The Plaintiff also emphasised that it was not seeking to interfere with the running of the beneficiary of thewakafor trust,ie, the Delhi school. 14 The Plaintiff obtained the opinion of Mr Pawancheek Marican (“Mr Marican”), a partner of Messrs Wan Marican, Hamzah & Shaik, a Malaysian firm of solicitors. In his report, he laid out the elements needed for awakaf, noting in particular that permanence is necessary and that the equitable rule against perpetuities does not operate in Islamic law. The element of permanence requires that the charity intended for the beneficiaries is perpetual in nature; this does not mean that the property must be unchanging – awakafmay persist though the property subject to thewakafalters in form. Mr Marican was of the view that, by the Will, a validwakafhad been created over the property as the requirements for awakafwere met, including permanence, even if there was no express statement that awakafwas created. Mr Marican was also of the view that the trustees should not have partitioned the properties in question, as the equitable doctrine of conversion was unknown in Islamic law. In any event, even if there was conversion, thewakafcontinued to operate, treating the property as substituted.",
        "The Defendants’ Case": "15 The Defendants argued that the Plaintiff failed to show that the Donation created a charitable trust; indeed, Muslim law did not recognise a charitable trust as such. No common law trust was created either, as there was no certainty of intention, subject matter or beneficiaries. Neither would there be vesting of the property under s 59 or s 58(2) of the Act. Section 58 could not operate in this situation, as it required a separate vesting of property, such as property passing under Muslim Law or where property is vested in the Plaintiff for the purposes of aBaitulmal(ie, a public pool of funds or resources). The Court of Appeal has also noted inAbdul Rahman bin Mohamed Yunoos and another (trustees of the estate of M Haji Meera Hussain, deceased) v Majlis Ugama Islam Singapura[1995] 2 SLR(R) 394 (“Abdul Rahman”) at [26] that s 58(1) only applies where a Muslim person dies without heirs. The interpretation argued for by the Plaintiff, that s 59 applied, was inconsistent with the language of the Will. The Defendants also argued that time bars operated in respect of the claims. 16 In any event, the language of the Will was clear and unambiguous, creating an outright gift or bequest. The conclusion of the Defendant’s expert witness, Dr Badruddin HJ Ibrahim (“Dr Badruddin”), an Associate Professor at the Islamic Laws Department of the International Islamic University of Malaysia, that the Donation to the Delhi school under the Will qualified as a bequest under Muslim law, supported this. In contrast, the approach of the Plaintiff’s expert, Mr Marican, was tantamount to rewriting the Will. Indeed, Mr Marican had at one point accepted that a bequest was made. 17 The Defendants also submitted that the Will did not create awakaf. Even on the Plaintiff’s own understanding of what constituted awakaf, as indicated on their website, there has to be a dedication that is perpetual. Sale of the property, use of the proceeds or investment was not permitted. 18 Neither did the Will create any charitable trust. What the Plaintiff sought to do was to bring up issues in relation to the Will long after probate had been granted. The executors had carried out their obligations under the Will and nothing remained as to the issues under the Will. 19 The Defendants also argued that a number of other issues should also be resolved against the Plaintiff. Firstly, the Plaintiff’s expert was not sufficiently qualified to give his opinion on Islamic Law in this area. Secondly, when the Plaintiff lodged its caveat, it did not do so on the basis of awakaf. The Plaintiff also taken inconsistent stands in respect of the proceedings against the Defendants and on the issue of whether awakafexisted; the Plaintiff attempted to cloak that inconsistency by invoking legal privilege. The Defendant had obtained indefeasibility of title under s 46 of the Land Titles Act. Furthermore, the Plaintiff’s current application was motivated by the increase in value of the property. 20 The Defendant’s expert, Dr Badruddin, gave an opinion that the Donation was an outright bequest. The words used did not contain any ambiguity. Nothing in the Will indicated that the Testator had intended to create awakaf. The Defendant’s expert took the view that the specified purpose in the Will that the one-third share of the Testator’s estate should be applied “for the maintenance and upkeep” of the Delhi school was the means stipulated by the Testator for the spending of the bequeathed property. Otherwise, a bequest to an institution (ie, the Delhi school) would not be valid according to the Hanafi school that the Testator probably belonged to.",
        "The Decision": "21 Bearing in mind the need to find the elements of thewakaf, I found that these were established, and the Donation in the Will was not an out and out gift, with a free hand given to the executors. The relevant clause of the Will referred to the payment and application of a one-third share of the proceeds of the sale of the Testator’s property (“the Proceeds”) for the maintenance and upkeep of the Delhi school. In construing whether this created awakaf, I accepted that I could take a broader view of the evidence then perhaps might be so in respect of a non-Muslim will. On the facts, I found that the Testator’s intention was not for a payment to be made directly to the Delhi school, but for the use of the Proceeds for its upkeep and maintenance, without any limitation of time. It was thus a permanent dedication of property in that the Proceeds had to be used only for the specified purpose. There was for that reason also inalienability in the relevant sense. In this regard, I do find that money is a proper subject matter of awakaf. I prefer the views of Ameer Ali stated inMohammedan Law, and cited by the Plaintiffs, that Islamic law does not place any restrictions on the type of property that may be the subject of awakaf, and that developments in Islamic law accept that money could be properly the subject of awakaf. 22 I also accept that the purposes of the Donation would be recognised as pious, religious or charitable under Islamic law. The Delhi school is involved with both secular education and religious and moral education. The fact that there may be secular elements alone does not detract from the fact that the instruction of the students in the Delhi school would be recognised as religious or charitable under Islamic law. 23 On this approach then, the partition conducted subsequently did not change the position. 24 As awakafexists in respect of property in Singapore, s 59 the AML Act vests that property in the Plaintiff without more. I did not accept the arguments of the Defendants that s 59 did not operate in this instance, or that the operation of the AML Act is subject to indefeasibility of title under the Land Titles Act. 25 I rejected a number of arguments put up by the Defendants which conflated the role of the Plaintiff in administeringwakafsin Singapore with that of an owner of land or administrator of an estate. The vesting ofwakafproperty in the Plaintiff may appear on one level to equate the Plaintiff with a private owner of land or other property; however, such vesting is a mechanism to allow the Plaintiff to discharge its public functions. The Plaintiff is not in the same shoes as a private owner. 26 I note that inLS InvestmentsPte Ltd v Majlis Ugama Islam Singapore[1998] 3 SLR(R) 369 (“LS Investments”) the Court of Appeal observed that in determiningwakafcases under the Act, Islamic law is not treated as foreign law. The Court of Appeal stated (at [38]): At this juncture we should mention that counsel for the appellant made a preliminary point that the learned judge below erred when she appeared to treat Muslim law as a fact to be proved by evidence like foreign law. He said this could be seen from the statement of the learned judge where she stated that “the plaintiffs [the appellant] did not produce any evidence on Muslim law” …  We accept the submission that Muslim law need not be proved like foreign law. Muslim law is part of the law of the land which the court would take cognisance of. … The court thus interprets Islamic law as part of the law of the land. Arguments on Islamic law should be presented as submissions on law rather than on facts. Strictly speaking then, expert opinion on Islamic law should not be addressed to the court by way of reports or affidavits.  Nonetheless, as Islamic law is a very specialised area, and expertise in specific areas difficult to find in Singapore, the views of the experts such as those adduced in the present case were useful. I was careful to treat their views as arguments only. In reaching my conclusions, I have generally preferred the opinion evidence of the Plaintiff’s expert rather than the Defendants’. 27 Finally, a note about orthography: in this Grounds of Decision, I have generally used “wakaf” following the Act. However, it should be mentioned that various authorities cited used “waqf”, “wakf” or other variants of the term.",
        "Whether the donation in the Will created awakaf": "28 As submitted by the Plaintiff, in respect of whether awakafis created, the Will is to be interpreted according to Muslim law. Section 63 of AML Act reads: 63.—(1)  Where any question arises as to the validity of a Muslim charitable trust or as to the meaning or effect of any instrument or declaration creating or affecting any Muslim charitable trust, such question shall be determined in accordance with the provisions of the Muslim law. 29 The Court of Appeal stated this clearly inAbdul Rahman(at [13]): … We have no hesitation in applying s 63 to construe cl 15 of the testator’s will for surely the testator would have intended to give expression to the tenets of his religion and to the Muslim law and if it was struck down because at that time his will would have been construed by the principles of the common law, he would have said, so be it. While this statement was made in the context of whether the Act applied to a will made before the enactment of the Act, it is pertinent that the Court of Appeal did apply Muslim law to construe the gift. 30 There is a logically prior question before the question of the validity of awakafis determined, that is, whether the Donation indeed purports to create awakaf. It is possible in theory for a different system of law to apply to that question, such as the common law. However, doing so slices the matter too finely, and introduces too much intricacy into the question. It is artificial to apply one law to the question of existence of a legal act, and another to its validity and effect. A single system of law should generally govern both issues. For that reason, the whole question of the effect of a will by a Muslim testator has to be determined by Muslim law even if there is a question whether it does in fact purport to create awakaf. 31 The other point decided inAbdul Rahmanwas that even if the testator had passed away before the enactment of the Act, the provisions of the Act, in particular s 63, would be applicable (at [12] and [13]): 12 The fact that the testator died before 1 July 1968 is irrelevant. What, in our judgment, is relevant is that the question of construing cl 15 of the testator’s will arises only now, after 1 July 1968, and therefore s 63 of the Act applies to its construction. … 13     We do not find any limitation in s 63 or anywhere else in the Act confining the application of s 63(1) only to instruments or declarations executed or made after the commencement of the Act. The material words of s 63(1) are “any instrument or declaration creating or affecting any Muslim charitable trust”. [emphasis in original] The further import of the above holding inAbdul Rahmanthus is that Muslim law will apply to the construction of instrument or declarations whenever the matter comes up in court – it does not matter that the will may have been made or the gift effected much earlier. The existence of awakaf 32 The factors pointing to the donation in the Will being awakafwere that (a) the donation operated indefinitely, indicating its permanence; (b) it was for charitable purpose recognized as such by Islamic law; and (c) the subject matter was not alienable. 33 As noted by the Plaintiff, the use of express words is not necessary to create awakaf. The intention to create awakafcan be inferred from the setting aside of specific property in perpetuity for the support or maintenance of a pious object:Piran v Abdool Karimand others(1891) ILR 19 Cal 203. This also is the view of Ameer Ali (seeMohammedan Lawat p 217): When the wordwakf, or any of its synonyms in vogue, is used in making the consecration, the law fixes upon it all the legal incidents of a permanent and valid dedication. It is only when such words are not used that reference is made to the intention of the donor. But when the intention to make awakfis apparent, or can be inferred from the general tenor of the deed, or from the conduct of the donor, or from the nature of the object in favour of which a grant is made, or from the surrounding circumstances at large, it will constitute a valid and bindingwakf, though the wordwakfmight not have been used. Thus, what matters is whether it can be discerned by looking at the Will, whether the Testator had set aside property in perpetuity for recognised objects. 34 There was no dispute between the parties as to what is needed for awakaf. Rather, what was in contention was whether those elements were made out in the present case. The elements required for awakafto be created are: (a) a dedication of property for pious, religious or charitable purposes; (b) inalienability of subject matter; and (c) a permanent dedication. That these elements are required for the creation of awakafis made clear in the following extract ofOutlines of Muhammadan Lawby AA Fyzee (4th Ed) (“Outlines of Muhammadan Law”) at pp 280–281. It should be pointed out thatOutlines of Muhammadan Lawis one of the seven authorities on Muslim law set out at s 114 of the Act. The passage, which was also cited inLS Investmentsat [21], reads: The essentials ofwakfmay now be summarized. The motive inwakfis always religious; in trust, it is generally temporal; this is the first characteristic. Secondly,wakfis a foundation endowed in perpetuity. In the eye of the law the property belongs to God, and as such, the dedication is both permanent and irrevocable. The property itself is ‘detained’ or, to use the expressive language of French lawyers, it is ‘immobilized’ and no further transfers can be effected. In a trust, permanency is not an essential condition; a trust of property for the benefit of A and thereafter absolutely to B is a valid trust terminable on the death of A. In Islamic law, awakfis not terminable; it is God’s property and should be as permanent as human ingenuity can make it. Permanency is ensured by the legal fiction that the property is transferred to the ownership of Almighty God. The learned author ofOutlines of Muhammadan Lawthen goes on to consider other characteristics, especially in contradistinction to a trust, which are not relevant at this point. 35 Ameer Ali also stated as follows (Mohammedan Lawat pp 234): .. according to all the jurists, “perpetuity is a necessary condition,” … [T]he property should be dedicated permanently and the right of the donor therein parted with for ever… 36 In the present case, the Will read; I direct my Executors to sell all my property whatsoever and theresoever situate, in Malaya as well as in India or elsewhere (with power in their discretion to postpone such sale calling in and conversion) and to pay my debts and testamentary expenses and to divide the balance intoTHREE (3)equal parts or shares and to pay and apply and pay such shares as follows: (a) To pay and applyONE (1)out of suchTHREE (3)shares for the maintenance and upkeep of AMINIA MUSLIM GIRLS’ SCHOOL, of Ahata Kale Sahib, Ballimanan Street, Delhi and I declare that my Executors shall not be accountable to any person or persons whomsoever for the paidONE(1)share … [emphasis in original] 37 The Donation was one which dedicated the Proceeds permanently, for a charitable or pious purpose, and for which the property in question was not alienable. In the present case, the Testator had in fact set up the very school that was to receive the one-third share. The elements for the creation of awakafwere indeed established. (1) Pious, religious or charitable purposes 38 The Will stated that the Proceeds was to be for the maintenance and upkeep of the Delhi school. That purpose links the Donation to education, which is generally a valid and recognised charitable purpose under Islamic law. The Plaintiff cited a line inOutlines of Muhammadan Lawat p 276, which noted that among the most common objects were endowments of schools. While the issue has not been expressly argued in Singapore, as cited by the Plaintiffs, in decisions such asRe Settlement of Shaik Salleh bin Obeid Bin Abdat & Anor[1954] MLJ 8, no issue was taken with the establishment of awakaffor,interalia,schools or other places of education, whether religious or otherwise. Ameer Ali states (seeMohammedan Lawat p 273): “Every ‘good purpose’ … which God approves, or by which approach … is attained to the Deity, is a fitting purpose for a valid and lawfulwakf”. He added subsequently (seeMohammedan Lawat p 274): Another point worthy of attention in the Mussulman Law is that every trust for whatever purpose created isreallyand in fact for the benefit of human beings.The religious and legal system of Islam is founded essentially on the service andwell-being of humanity.A dedication may be made for a mosque,– but the mosque is intended for human beings to pray in; it may be for a school, intended for the instruction of students … [emphasis in original] This showed that the dedication of awakaffor a school would be valid. 39 It is true that beyond religious and moral education, the Delhi school would also be involved in secular training and education, with specific reference to instruction in industries and handicraft. The combination of secular and religious educational aims does not defeat the existence of awakaf. I cannot see anything in secular education of the nature identified as part of the school’s curriculum that would be inimical to the teachings of the Islamic religion. Such a combination of secular and religious education would beneficial to the students, and thus would be a good purpose, which would be recognised as the object of awakaf. As Ameer Ali noted inMohammedan Lawat p 273, the test of what is “good, pious or charitable” is “the approval of the Almighty”. (2) Inalienable subject matter 40 The primary issue in this case is whether funds or cash would be an appropriate subject matter of awakaf. This takes the operation of the Will as the intended inception of thewakaf. As it was expressed in the Will, the subject matter of the Donation to the Delhi school was a one-third share of the proceeds of sale of the Testator’s properties. While presently the Trust Property is in the form of real property, following the Deed of Partition, the measure of validity of thewakafshould be at the point of the Donation taking effect,ie, on the Testator’s passing. 41 I was satisfied that funds or money could be a valid subject matter of awakaf. Despite some authorities concluding that funds could not be a valid subject matter, the preponderance of authority, in both case law and commentary, show that a fund of money and moveables could be validly brought under awakaf. 42 A number of cases have held that moveables cannot be a valid subject of awakaf. The leading decision of this line isFatima Bibee v Ariff Ismailjee Bhamand others[1881] 9 CLR 66. A number of propositions were made in that case, but for purposes of the present case, what is material is the holding that awakafcould not be created over shares in a company. Wilson J held (at 74–75): … The property consists of shares in two limited Companies at Rangoon … For the present purpose I think the right of a shareholder in such Companies is a right to share, in the form of dividends, in the profits of the business carried on by the Company. Property of this nature is modern in its origin.  And the old texts can only be applied by way of analogy. But there does not seem to me much difficulty in arriving at a conclusion. Land, according to all the authorities may be appropriated. And the power has been, it is universally agreed, extended to certain other kinds of property, though the exact degree of the extension is a matter in difference among the authorities. But it is agreed that it does not apply to such things as perish in the using, under which head money appears to be included. And, if money cannot be appropriated, it seems to me clear that the possibility of receiving money hereafter in the form of dividends cannot be. Wilson J thus was of the view that Islamic jurisprudence excluded money and other movables which may be used up. The primary basis of reasoning appeared to be that moveables, including money, could not be the subject matter of awakafbecause it could not be appropriated and would be consumed over time. This would then limitwakafsto real property only. 43 Subsequent case law moved away from that position. Thus inSakina Khanum, the Bengal High Court, citing Ameer Ali, noted that awakafof movables, including money, is valid, and thus awakafof securities would be lawful and valid. The court inSakina Khanumat 224 noted that various Islamic authorities were not put before Wilson J in the above case. 44 The case ofAbu Sayid Khan v Bakar Aliand another[1901] IL 23 All 190 also supports this view. The jurist and commentator, Ameer Ali, also took the view that it was possible for funds to be the subject matter of awakaf. Ameer Ali recognised that awakafmay be constituted out of actual cash giving the examples ofdirhamanddinar:Mohammedan Lawat p 246. This is further underlined by his subsequent example, citing Imam Zuffar (at p 249–250): If a man makes awakfofdirhems[here used generally for money] or food or whatever is weighed or measured, according to Imam Zuffar it is lawful. When asked how such things can be madewakf, he answered the money should be invested inmuzaribat, and whatever profit is derived therefrom will be devoted to the purposes of thewakf… 45 Ameer Ali also endorsed the view of another jurist, Imam Mohammed, that any moveable property that is usually the subject of transactions or which in practice be the subject matter of awakaf, would be a valid subject matter.    This is emphasised as well at another passage, where Ameer Ali stated (seeMohammedan Lawat p 246): … [T]here is absolutely no restriction on the dedication of any kind of property so long as it admits of yielding permanent benefit either in itself or by renewal from time to time or by conversion into something else which admits of the same possibility. 46 The Plaintiff’s expert’s opinion also supports this. Mr Marican accepted that the Proceeds, had the terms of the Will been fully complied with, would sufficiently constitute the subject matter of thewakaf, and any income from investment of the Proceeds would have been income of the property. 47 Islamic jurisprudence also accepts that there may be developments in terms of assets and subject matter ofwakaf: Securities Commission Malaysia,Waqf Assets: Development, Governance and the Role of Islamic Capital Market(Securities Commission Malaysia, 2014). The recognition that cash may be invested in capital market products indicates that Islamic jurisprudence recognises changes in the range of asset types. The Plaintiff’s expert expanded on this in cross-examination, stating that new juristic views have come into play, including the use of income from investments. The Plaintiff’s expert further gave the opinion that income generation, and thus the preservation of capital, could be implied. (3) Permanent dedication 48 The Defendants’ expert contended that in this specific case since there was no direction on the retention of the Proceeds and the use of the income for maintenance of the Delhi school, there was nowakaf. I would take this as an argument that there was no inalienability or permanence. 49 The Plaintiff relied on the case ofLS Investmentsfor the proposition that even where there is no express dedication in perpetuity, this can be inferred from the dedication of income to property for the various objects identified. However, that decision was concerned with whether there was a permanent dedication of the capital in the absence of express language. In that case, it was not surprising that the Court of Appeal found that there was permanent dedication of the capital, because the income had been dedicated perpetually. Where one part of a gift is perpetual, there is a ready inference that the other is also perpetual. In the present case, though, no such inference could be made: the capital and income were not split in the same way as inLS Investments. 50 What mattered ultimately was that the Donation was irrevocable and inalienable –ie, that it does not revert to the donor, or in this case to the Testator, or pass on to his estate. Such irrevocability can be inferred. Ameer Alistates it thus (Mohammedan Lawat p 228): Perpetuity is a necessary conditionto the constitution of a validwakf, but it is not necessary that it should be expressly mentioned. In other words, the intention must be, either by implication or by express declaration, to dedicate the property permanently, but that it is not necessary that the dedication should be primarily or expressly for a continuing object. [emphasis in original] In the present case, the Donation of the Proceeds was irrevocable – there was no mechanism for the return of the Proceeds to the estate or for these to be passed on to someone else. 51 Another point that arose in this regard was whether it mattered that the subject matter could be consumed. That has been dealt with above at [42]–[47]. Not an outright gift 52 I did not accept the Defendants’ arguments that the Donation was an outright gift. Aside from the factors pointing to the existence of a validwakafabove, there were a number of other reasons for the conclusion that it was not an outright gift. The construction of the Donation showed that as originally intended, the Proceeds were not to be given directly to the Delhi school. 53 While the Will referred to the payment and application of the share for the Delhi school’s maintenance and upkeep, this did not mean that that share was to go absolutely to the Delhi school. The language of the Will is clear that the obligation rested on the executors to pay and apply that share of the proceeds for maintenance and upkeep of the school. That clearly went against the notion of the Donation being absolute, and kept the executors (and their successors) in control. It was crucial that the Proceeds were not given directly to the Delhi school. As argued by the Plaintiffs, the language used indicated the continuous application of the Proceeds towards the maintenance and upkeep of the school. 54 What the Delhi school was not to be given was the Proceeds as a lump sum, to do it as it wished, for any other purpose, or even to manage the funds directly for its own upkeep and maintenance. This indicated that the Testator intended to maintain a high element of control and restriction over the use of the Proceeds, pointing against the construction that this was an outright gift to the Delhi school. 55 The Testator’s establishment of the Delhi school indicated that he was concerned with the continued maintenance and upkeep of the school. Such upkeep and maintenance carries with it the connotation that it should be on an ongoing and continuous basis, rather than a one-off event. 56 All of this pointed against the Defendants’ contentions that the Donation was made outright to the school without anywakafsuperimposed. The Defendants argued that construing the Donation as involving awakafwas tantamount to rewriting the Will. While it is true as noted above that there was no express mention of awakafin the Will, this did not disqualify the Donation from being awakaf. The Will must be construed as a whole in light of the very language used by the Testator, and the reading I have taken does not impose an interpretation that is at odds with the plain words of the Will. 57 While my conclusion based on the construction of the Will was that the Donation was not an outright gift, I did not accept the other arguments raised by the Plaintiff in favour of the same conclusion. The first of these was the Plaintiff’s argument relying on the 1938 Trust Deed specifying that income from another property was to be used for, among other things, the maintenance of the Delhi school. The Memorandum of Association of the managing committee of the Delhi school which was dated 1939 also stated that one of the managing committee’s objectives was the acquisition of otherwakafproperties for the Delhi school’s benefit, spending the income from such properties for expenses, and receiving subscriptions and donations for the maintenance and upkeep of the Delhi school. I was doubtful that so much weight could be placed on the construction of these documents. It was entirely feasible and possible for the Testator in one document to have established the Delhi school with mechanisms for continued payment and maintenance, and to provide in another document for an outright gift to the school. The Plaintiff argued that such construction was in accordance with interpretation under Islamic law, which allowed the surrounding circumstances to be taken into account. It is true that such an interpretative approach is the position under Islamic law. However, considering surrounding circumstances in the interpretative exercise does not mean that in this case, a specific circumstance necessarily leads to the interpretation that the Plaintiff argues for. There still needs to be a weighing of relevance, cogency and coherence – on all these scores, the fact that the Delhi school as established needed maintenance did not necessarily mean that the Testator meant to provide such maintenance through a subsequent bequest. 58 It is significant that the Defendants put forward a similar argument, pointing in the other direction. It was argued that the 1938 Trust Deed indicated the use of specific language to be used in the creation of awakaf. The absence of such language in the Will meant, it was argued, that the Donation was not intended to create awakaf. Again, while surrounding circumstances could be used in interpretation, I was doubtful that there was sufficient cogency in this argument to conclude that the prior use of express words to create awakafin a different instrument meant that the latter absence of such words signified that awakafwas not intended. The fact of the matter is that the 1938 Trust Deed could be construed in favour of either the Plaintiff’s or the Defendants’ case; for that reason, I gave it little weight. 59 Another argument by the Plaintiff that I rejected was the argument that the Court could look at the fact that the donation to the Delhi school was the largest disposition that could be made to a party other than an heir. To my mind, this fact was again equivocal as to whether the donation was meant as an absolute gift or subject to a trust orwakaf. 60 Finally, I would note that the actions taken by the Defendants’ predecessors in respect of the Proceeds went somewhat against the position that the gift was absolute. The executors decided to partition the subject matter of the Will, such that the Delhi school took a one-third share of the Testator’s property. If indeed there was an absolute gift, one wonders if a partition in favour of the Delhi school was at all necessary. Be that as it may, as I had stated earlier, the prior conduct of the parties was not of much weight in considering the validity and construction of the donation. Effect of the Deed of Partition 61 The Deed of Partition allowed the trustees to treat each part of the property distinctly for each set of legatees under the Will. If anywakafwas in existence beforehand, the Deed of Partition could not have terminated thewakafsince awakaf, by definition, cannot be terminated. Even if the existence of awakafwas to be measured after the Deed of Partition, the analysis would not differ significantly, save that there would be no question of the subject matter being inappropriate as real property is accepted as a form ofwakafproperty.",
        "Charitable Trust": "62 Even if there was nowakaf, the Donation bequeathed by the Testator was subject to a charitable trust for the purposes of s 58 of the Act. Section 58(2) charges the Plaintiff with the administration of: … all trusts of every description creating any charitable trust for the support and promotion of the Muslim religion or for the benefit of Muslims in accordance with the Muslim law to the extent of any property affected thereby and situate in Singapore. What amounts to an Islamic charitable trust is not delineated by the Act. The Defendant’s expert noted that the term is unknown in Islamic law. The Plaintiff’s expert considered that a charitable trust had elements consistent withwakafsin so far as a charitable trust would have a charitable element and a third party is entrusted or charged with carrying out the terms of the trust.   He reiterated this view when he was questioned in court. 63 I do note that an Islamic charitable trust was the subject of the decision inRe Haji Meera Hussain’s Will’s Trust[1994] 3 SLR(R) 748, but the nature of the trust was not in issue in that case. 64 I would be hesitant to import the equitable concept of a charitable trust into the Act: there are concepts such as the rule against perpetuities that would go against Islamic jurisprudence. I suspect that the rules on certainty of subject matter may also be difficult to import. On the other hand, there was nothing before me as to the legislative intention that would have given guidance. However, I am satisfied that it can be discerned from the Act that the notion of a charitable trust, being put into juxtaposition with awakafandnazar am(ie, the dedication of property for a specific purpose benefiting the Muslim community), was intended to be a back stop concept to capture dispositions of property or gifts that may not qualify fully aswakafsornazar am, for whatever reason, but which still import a concept of benefit for another, and an element of trust being placed in a third party to manage and administer the property. I thus reach the same conclusion as the Plaintiff’s expert as to the construction of the phrase “charitable trust”: it is sufficient that there be a charitable object, and that the property is under the control or management of another person for that object.",
        "Effect of creation of awakaforcharitable trust": "65 Once awakafor charitable trust is found to have been established, the consequences under Singapore law are clear: the properties vest in the Plaintiff automatically, and the Defendants have no further role as trustees. 66 Vesting in the Plaintiff occurs automatically under s 59 of the Act.  Section 59 reads: 59.All property subject to section 58 shall if situate in Singapore vest in the Majlis, without any conveyance, assignment or transfer whatever, for the purpose of the Baitulmal, wakaf or nazar am affecting the same. The objective and intention of s 59 is clear:wakafsare vested in the Plaintiff for the purposes of thewakaf,ie, its administration and management. 67 The Defendants argued that s 59 operated only in respect of  s 58(1) and not section 58(2). The reasoning was that vesting only arose in respect of property on which s 58(1) operated; s 58(2) was only concerned with administration and not vesting. The Plaintiffs argued, correctly in my view, that this interpretation went against the plain words of both ss 58 and 59. Section 59 is not limited at all in its scope to s 58(1); it refers to s 58 as a whole. The point has also been conclusively determined by the Court of Appeal inAbdul RahmanandLS Investments. The upshot of these cases is thatwakafproperty vests in the Plaintiff. 68 The Defendants had a further argument, contending that the Land Titles Act operated to preserve their title, which was to be unimpeachable under s 46 of that Act. That argument misapprehended the objective of indefeasibility of title under the Land Titles Act. 69 Section 46(1) firstly specifies that the proprietor of registered land holds that land free from encumbrances, liens, estates and interests, even if there was any other estate or interest in the land, failure to comply with the procedure specified under the Land Titles Act, or the lack of good faith in the chain of proprietors. An “interest in land” is defined in s 2 of the Land Titles Act as follows: “interest”, in relation to land, means any interest in land recognized as such by law, and includes an estate in land[.] The term “estate” is not defined under the Land Titles Act. Megarry & Wade,The Law of Real Property(Sweet & Maxwell, 8th Ed, 2012) at para 2-005 defines it as the holding of interests in land for different periods of time: life, in tail or in fee simple. 70 The language of the Land Titles Act shows that indefeasibility is granted to a holder of an estate or interest in land who has that estate or interest registered under that Act. Section 46 does not purport to affect any other statute or provision. While the remaining part of s 46(1) does carve out of indefeasibility a specific set of categories of interests and rights, I did not read this express carving out for specific circumstances as implying that s 46(1) of the Land Titles Act is to override all other statutory provisions not specifically saved by the carve out. Whether or not another section is to be read subject to s 46(1) will depend on the words used, and the object or purpose of the respective statutes. 71 Section 46 of the Land Titles Act and s 59 of the AML Act are silent as to their relationship. As for the object, it is noteworthy that s 59 of the AML Act operates not on land as such but on any property subject to awakafornazar am. Section 59 of the AML Act also expressly operates to vest property subject to s 58 of the same Act without any need for any conveyance, assignment or transfer. Such vesting under s 59 operates for the purposes of thewakafornazar amaffecting the property. In comparison, indefeasibility under s 46 of the Land Titles Act protects the legal title that appears on the land titles register from claims to ownership that may be asserted by other claimants on whatever basis. Section 46 of the Land Titles Act thus allows for certainty and predictability in land transactions, obviating the need for extensive title and deed searches that were necessary under the common law system and which to a great extent still plagues conveyancing under the Registration of Deeds system. Indefeasibly is thus concerned with title to the land as a landholder. Indefeasibility under the Land Titles Act has nothing to do with the operation of statute law imposing other obligations or affecting the property in any other way. What s 59 of the AML Act appears to contemplate is that the vesting of thewakafneed not necessarily affect the land title registry. 72 Aside from the different objects, in the absence of any express limitation in the statutory provisions, the two sections are to be read harmoniously as far as possible. The courts should not be ready to find conflict in legislation. 73 The Plaintiff cited the maximsgeneralia specialibus non derogantandgeneralibus specialia derogant. As noted inBennionon Statutory Interpretation(LexisNexis, 6th Ed, 2013) (“Bennion”), the maximgeneralibus specialibus non derogant, or that a general provision does not derogate from a special one, concerns a situation in which the general provision is enacted after the specific. In such a situation, the earlier specific provision is not to be treated as impliedly repealed: seeBennionat p 281. The AML Act, which contains the specific provision, was enacted in 1968. The Land Titles Ordinance, with the general provision, was enacted in 1956. The maxim would therefore be inapplicable. As for the other maxim,generalia specialia derogant(in the learned author’s translation, general provisions override special ones), this would seem to apply primarily where the general and specific provisions are within the same statute. I am doubtful that this maxim would operate at the same strength in respect of different statutes. What matters in such situations is whether the provisions are to be construed harmoniously; in considering that issue it may be that on occasion the best reading would indeed be to find that in a particular instance, the specific provision overrides the general provision.",
        "The limitation issue": "74 The Defendants contended that ss 9, 10(2) and 19 of the Limitation Act (Cap 163, 1996 Rev Ed) (“Limitation Act”) apply to bar the Plaintiff’s claim as the estate proceedings took place in the 1950s. This argument was not made out. The provisions in the Limitation Act are concerned with the recovery of land. There is no recovery action in the present case: the declarations sought by the Plaintiff are concerned with the statutory vesting ofwakafproperties in the Plaintiff, which is of a different nature.  Section 19 of the Limitation Act is concerned with administration actions, and similarly does not apply to the Plaintiff. 75 The Defendants raised an argument that ss 9 and 10 of the Limitation Act barred the Plaintiff’s actions by this time. This misapprehended the operation of the AML Act – by virtue of s 59, the property is vested in the Plaintiff by the operation of law. No action need be taken to effect the vesting. The Plaintiff’s action is thus not an action to recover property that would come within ss 9 or 10 of the Limitation Act. 76 On the other hand, I could not accept the Plaintiff’s arguments against the Defendants’ position. The Plaintiff firstly contended that it could not have been intended for that the Limitation Act would affect the Plaintiffs’ duties under the AML Act, and secondly that time started ticking only when a dispute arose between the Plaintiff and Defendants,ie, in 2011. Neither argument to my mind was sound. It is possible, for instance, for the Legislature to intend the Plaintiff or similar agencies to be bound by limitation periods in some situations; that would be a matter of interpretation of the relevant provisions. As for the commencement of the time period, if indeed the time bar operated, it would be at the point of purported vesting, which presumably in this case would be once the requirements of ss 58 and 59 operated, and not necessarily when a dispute arose.",
        "Other Issues": "77 A number of other issues may be dealt with briefly. I did not find that any of these were particularly material or determinative.",
        "Expert qualifications": "78 The Defendants took issue with the qualification of Mr Marican, the Plaintiff’s expert. Mr Marican is not an academic, but his qualifications in respect of Islamic law were sufficiently sound, and he had experience in litigation in respect of Islamic Law. Mr Marican had more than 36 years’ standing, having dealt with many cases involving Sharia law, andwakafsornazarsin particular. He was also the author of a book on the Islamic law of inheritance, and had written many articles. In comparison, the Defendant’s expert, Dr Badruddin, was primarily an academic, with little experience in litigation matters concerningwakafs.",
        "Mismanagement not necessary": "79 At various points, the Defendants argued against the existence of any mismanagement on their part. Mismanagement was not a necessary element of the Plaintiff’s claim. It may be that the Plaintiff may seek remedies for any mismanagement that occurred, but that is a matter for another day.",
        "Supposed concessions by the Plaintiff’s expert": "80 The Defendant argued that the Plaintiff’s expert had accepted that the Donation was an out and out bequest. I did note that Mr Marican had used the word “bequest” at some points, but I did not read this as acceptance that the Donation was an outright gift. To my mind, Mr Marican was merely referring to the Donation and was using the term “bequest” more broadly than the Defendant was. In other words, Mr Marican did not mean to say that he accepted that it was an outright gift. 81 At this juncture, I note that Mr Marican was of the view that conversion was not permitted under Islamic law, meaning, as I understood his opinion, that Islamic law did not treat the interest in immovable property as moveable when the immoveable property was subject to sale. It is to be noted though that the Will did expressly reserve a power of conversion. That would seem to be a reference to the ability of the administrators or trustees to dispose of the property and bring in money into the estate. This language used in the Will is common. Be that as it may, its inclusion in the Will did not invalidate the Donation, since in the Will the reference to conversion would seem to be permissive only.",
        "Previous arguments and proceedings": "82 The Defendants referred to matters that arose in previous proceedings. As noted by the Plaintiff, these were immaterial to the proceedings that were before me, including whether the matter should have proceeded by way of writ action.",
        "Exhaustion of the Will": "83 The Defendants argued that the Plaintiff could not raise issues pertaining to the Will after the administration had been completed. The short answer is that the Plaintiff’s claim was not based on the Will as such but on statute, requiring interpretation to be made of the Donation in the Will. The present action did not purport to wind back or affect the administration of the Will at all. 84 Similarly, the Defendants sought to rely on the fact that an order for sale of the properties had been obtained in the 1950s, before partition was obtained. The Defendants tried to argue that this meant that the court had no jurisdiction to interfere in favour of the Plaintiff. However, the fact that a court order had been granted authorising a sale did not affect the operation of s 59 in any way; what mattered was whether s 59 was engaged. So long as it was, the Plaintiff had every right to come to court to vindicate its rights. Whether or not s 59 came into play depended on whether awakafexisted; any order of court authorising a sale that did not take place was neither here nor there.",
        "Standing of the Plaintiff": "85 Section 59 of the AML Act applies to property which the Plaintiff, under s 58(2), has the responsibility to administer. Contrary to the arguments of the Defendant, s 59 was not limited to property described by s 58(1),ie, property subject toBaitulmal. The operation of s 59 was conclusively explained by the Court of Appeal inLS Investmentsafter the court had considered ss 58, 59, 60 and 62 (at [36]): The net effect of these provisions is that legal title towakafproperties vests in the Majlis; that the Majlis shall hold the documents of title relating towakafproperties; that it is for the Majlis to prepare anycy prèsscheme; and that it is for the Majlis to refer to court for an opinion if the meaning or effect of any instrument creating awakafis obscure or uncertain. … The trustees did not hold the title to thewakafproperty. They were no longer trustees in the English law sense,viz, someone who holds the legal title for the benefit of another or for certain specified objects. As managers, the trustees’ (in Muslim law they are called “mutawallis”) functions are only to manage thewakafproperty and to apply the income as directed in the trust instrument. Under AMLA, control of allwakafsvests with the Majlis….",
        "School of Islamic law": "86 While it appeared that the Testator was of the Hanafi School, nothing much turned on this in the present case.",
        "Res judicata": "87 The Defendants argued thatres judicataarose from the estate action for sale of the property in the 1950s. But whether the property was subject to awakafwas not in issue then, and thus nores judicatacould arise: the issues and the cause of action were entirely different.",
        "No conflict": "88 An issue was also raised in respect of the conduct of the Plaintiff’s solicitors, Messrs Allen & Gledhill LLP (“A&G”) as they had acted previously in 1956 and 1957 in respect of the Deed of Partition. I could not see how matters dating back more than 50 years could give rise to any risk of conflict or harm to the interests of the Defendants, particularly as there was no allegation that there was any confidential matter that A&G remained in knowledge of. Another allegation of conflict against another set of solicitors was also not material to the present proceedings.",
        "Conclusion": "89 Accordingly, I found in favour of the Plaintiff, and granted the orders sought, namely: (a) a declaration that the Trust Properties are vested in the Plaintiff; (b) orders in respect of accounting by the Defendants and for the delivery of financial statements and other records; and (c) costs, charges and expenses of administering the Trust Properties to be paid out of the Trust Properties. Time for compliance of the accounting and delivery of financial statements and other records and liberty to apply were also given.   Aedit AbdullahJudicial Commissioner Edwin Tong SC, Aaron Lee, Fay Fong, Jasmine Tham (Allen & Gledhill LLP) for the plaintiff;Dr G Rahman (KhattarWong LLP) (instructed) and Chishty Syed Ahmed Jamal (A C Syed & Partners) for the first and second defendants."
    }
}