{
    "case_title": "Re Opti-Medix Ltd (in liquidation) and another matter",
    "ncitation": "[2016] SGHC 108",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 Applications were madeex partein two related cases for the recognition of foreign insolvency proceedings in respect of Medical Trend Limited (“MTL”) and Opti-Medix Limited (“OPL”) (collectively, the “Companies”) and for the appointment of a foreign bankruptcy trustee pursuant to those foreign proceedings. After consideration of the affidavits filed as well as the submissions made by Counsel for the Applicant, I granted the orders sought. These grounds are issued as there has apparently been no written decision on the recognition of foreign liquidators (or bankruptcy trustees as in this case) from jurisdictions other than the place of incorporation of the companies concerned.",
        "Background": "2  The Companies were incorporated in the British Virgin Islands (the “BVI”). Their main business was factoring receivables from medical institutions in Japan. Such factoring was funded by non-recourse notes issued by the Companies. These notes were governed by Singapore law, with a Singapore address for service of notices, but were marketed only in Japan using Japanese brokers. The proceeds were transferred to Singapore bank accounts. 3 The Companies could not sustain their businesses, as there was insufficient profit to meet coupon and principal payments under the notes. New notes were issued to pay previous ones. Eventually, the Securities and Surveillance Commission of Japan suspended the issuing of new notes by the Companies in 2015. Default followed. Adopting the terminology used in translation of the Japanese documents, bankruptcy proceedings were commenced against the Companies. On 13 November 2015, bankruptcy orders were granted by the Tokyo District Court, and the Applicant was appointed as their Bankruptcy Trustee. 4 The Companies had primarily Japanese creditors. MTL had an unsecured debt of about ¥5.7 billion. Its ten largest creditors, each of whom held debts of between ¥44 million–351 million, all appeared to be Japanese entities or individuals. There were two Singapore creditors, who were owed about ¥1.6 million and ¥9.6 million respectively. The general debt could not be ascertained by the time of the application to the court. 5 OPM had a debt of almost ¥13 billion in respect of the loan notes that it had issued. Its ten largest creditors, each of whom held debts of between ¥100 million–341 million, again all appeared to be Japanese entities or individuals. An unknown amount was owed to one Singapore creditor for service fees. And again, the total amount of general debt could not be ascertained. 6 The Companies appear to have held some balance monies in various Singapore bank accounts. These accounts possibly held several hundred millions of Yen. 7 The Applicant sought to exercise his powers under the Japanese bankruptcy orders to ascertain, administer, and dispose of the Companies’ assets. It was recognised that as the Companies were possibly under an obligation to register as foreign companies conducting business in Singapore, preferential debts and debts incurred in Singapore would have to be paid before remitting the surplus out of Singapore.",
        "Applicant’s case": "8  The Applicant sought the recognition in Singapore of his appointment as the Bankruptcy Trustee of the Companies. He cited a decision of the Court of Appeal inBelugaChartering GmbH (in liquidation) and others v Beluga Projects (Singapore) Pte Ltd (in liquidation) and another (Deugro (Singapore) Pte Ltd, non-party)[2014] 2 SLR 815 (“Beluga”), which in turn referred to a decision of Chan Seng Onn J inReCosimo BorrelliOriginating Summons No 762 of 2010 (“ReCosimo Borrelli”),granting a declaration that a provisional liquidator of a Cayman company was authorised to recover and take possession of assets in Singapore. He added that Singapore courts have recognised a liquidator appointed by a jurisdiction other the place of incorporation, citing an old case,Re LeeWah Bank Ltd[1958] 2 MC 81 (“Re LeeWah Bank”). 9 The Applicant-Trustee argued that since there were no competing claims by liquidators from different jurisdictions, the Singapore court should recognise his appointment. No prejudice would be suffered as there were only three Singapore creditors, the notes were sold only in Japan, and any debts in Singapore were incurred only for administrative services. Notice of the liquidation had also been advertised in Singapore, and no one had contacted the Applicant’s solicitors. 10 The Applicant submitted that his appointment should be recognised even though he was not a liquidator appointed in the place of incorporation of the Companies (ie, the BVI), because there was no likelihood of insolvency proceedings in the BVI. He cited three authorities in support: an old Hong Kong case,Re Russo-Asiatic Bank[1929] HKCU 8 (“Re Russo-Asiatic Bank”), Rule 166 ofDicey, Morris and Collinson The Conflict of Lawsvol 2 (Sweet & Maxwell, 14th Ed, 2006) at para 30-101, and Tom Smith QC, “Recognition of Foreign Corporate Insolvency Proceedings at Common Law” inCross Border Insolvency(Richard Sheldon QC gen ed) (Bloomsbury Professional, 4th Ed, 2014) (“Cross Border Insolvency”) at para 6.81. 11 The Applicant added that the Japanese court should be considered the principal court of liquidation as there was no liquidation elsewhere. Even if it were not the principal court, it was the only court involved in the liquidation of the Companies while the Applicant was their only authorised representative. Liquidation in the BVI was unlikely given that the Companies had no operations there, and no liquidation had been instituted there. Forcing the creditors to commence liquidation in the BVI would only be a waste of resources. 12 The Applicant highlighted that there was also growing acceptance of the idea of locating the primary place of insolvency proceedings at the centre of main interest (“COMI”) of the company concerned. He cited a speech by Kannan Ramesh JC, “The cross-border project – a ‘dual track’ approach”(accessed 10 November 2016). In the present case, there could be no doubt, whatever the content of the COMI test, that Japan was the only possible COMI for the Companies. 13 Finally, the Applicant emphasised that an undertaking had been given to pay all preferential debts and other debts in Singapore before remitting any funds out of Singapore.",
        "Decision": "14  I allowed the application, and granted recognition of the bankruptcy orders of the Tokyo District Court and of the appointment of the Applicant as the Bankruptcy Trustee of the Companies. In particular, I ordered that all moveable assets and records be vested in the Applicant as Bankruptcy Trustee, and that he be empowered to collect and recover those assets and records. This entitled him to,inter alia, stop payments and request information in respect of accounts held in the names of the Companies.",
        "Analysis": "15 The recognition of foreign liquidators in Singapore proceedings is not a novel matter, as seen in the decision of Murison CJ inRe LeeWah Bank. That case was apparently decided in 1926, but was reported in Mallal’s Cases only 32 years later. As noted inBelugaat [87], a foreign liquidator will be recognised as the representative of the company, and his claims will generally be accepted. InReCosimo Borelli¸as noted by Counsel in the present case, the High Court granted a declaration recognising the authority and power of provisional liquidators appointed by the Grand Court of the Cayman Islands, from the Cayman Islands in respect of a Cayman Islands company. The orders applied for here were apparently inspired by those made there. 16 The primary issue in this case was whether liquidation in a jurisdiction other than that of the place of incorporation should be recognised. The fact that a company is in liquidation in a particular country does not by itself give rise to a basis to recognise that liquidation in Singapore. Something more has to be shown. In this case, that was the fact that the jurisdiction in question was where the bulk of the business and transactions of the Companies occurred. 17 In cross-border insolvency, there has been a general movement away from the traditional, territorial focus on the interests of the local creditors, towards recognition that universal cooperation between jurisdictions is a necessary part of the contemporary world. Under a Universalist approach, one court takes the lead while other courts assist in administering the liquidation. This is the most conductive to the orderly conduct of business and resolution of business failures across jurisdictions. The tone of the approach inBelugaand the telegraphed adoption of the UNCITRAL Model Law on Cross-Border Insolvency (30 May 1997) (the “Model Law”) in Singapore are indicators that Singapore is warming to Universalist notions in its insolvency regime. 18 A consequence of a greater sensitivity to Universalist notions in insolvency is a greater readiness to go beyond traditional bases for recognising foreign insolvency proceedings. As the winding-up of a company by the court of the place of incorporation accords with legal logic, there may be a natural tendency to regard a liquidator appointed by that court as having primacy or legitimacy. However, the place of incorporation may be an accident of many factors, and may be far removed from the actual place of business. The approach of identifying the COMI has much to commend it as a matter of practicality. The COMI will likely be the place where most dealings occur, most money is paid in and out, and most decisions are made. It is thus the place where the bulk of the business is carried out, and for that reason, provides a strong connecting factor to the courts there. 19 I note that inReHIH Casualty and General Insurance Ltd[2008] 1 WLR 852 at [31], Lord Hoffman indicated that the COMI test was a basis for the recognition at common law of foreign insolvency proceedings: … In some cases there may be some doubt about how to determine the appropriate jurisdiction which should be regarded as the seat of the principal liquidation. I have spoken in a rather old-fashioned way of the company’s domicile because that is the term used in the old cases, but I do not claim it is necessarily the best one. Usually it means the place where the company is incorporated but that may be some offshore island with which the company’s business has no real connection. The Council Regulation on insolvency proceedings (Council Regulation (EC) No 1346/2000 of 29 May 2000) uses the concept of the “centre of a debtor’s main interests” as a test, with a presumption that it is the place where the registered office is situated: see article 3(1). That may be more appropriate. With respect, I agree with this approach. 20 InRubinv Eurofinance SA[2013] 1 AC 236, however, Lord Collins, writing for the majority, doubted that it was open to the courts to introduce a new basis for recognition in relation to insolvency proceedings. Such a matter was to be left to the Legislature: 129 A change in the settled law of the recognition and enforcement of judgments, and in particular the formulation of a rule for the identification of those courts which are to be regarded as courts of competent jurisdiction (such as the country where the insolvent entity has its centre of interests and the country with which the judgment debtor has a sufficient or substantial connection), has all the hallmarks of legislation, and is a matter for the legislature and not for judicial innovation. The law relating to the enforcement of foreign judgments and the law relating to international insolvency are not areas of law which have in recent times been left to be developed by judge-made law. As Lord Bridge of Harwich put it in relation to a proposed change in the common law rule relating to fraud as a defence to the enforcement of a foreign judgment, “if the law is now in need of reform, it is for the legislature, not the judiciary, to effect it”:Owens Bank Ltd vBracco[1992] 2 AC 443, 489. 130 Furthermore, the introduction of judge-made law extending the recognition and enforcement of foreign judgments would be only to the detriment of United Kingdom businesses without any corresponding benefit. I accept the appellants’ point that if recognition and enforcement were simply left to the discretion of the court, based on a factor like “sufficient connection,” a person in England who might have connections with a foreign territory which were only arguably “sufficient” would have to actively defend foreign proceedings which could result in an in personam judgment against him, only because the proceedings are incidental to bankruptcy proceedings in the courts of that territory. Although I say nothing about the facts of the Madoff case, it might suggest that foreigners who have bona fide dealings with the United States might have to face the dilemma of the expense of defending enormous claims in the United States or not defending them and being at risk of having a default judgment enforced abroad. 21 With respect, as noted by Mr Tom Smith, QC, inCross Border Insolvencyat para 6.80, the development of the common law should not be so constrained: .. there is a measure of authority that the law of the place of incorporation does not occupy an exclusive position: other foreign insolvency proceedings may also be grated recognition in the English Court. However, the issues which arise in light of the comments of Lord Collins inRubinare first, whether the existing authorities do provide sufficient support for a test of recognition based on factors other than the place of incorporation; and secondly, whether there is any ability for the common law to develop in this area without legislative intervention. As to the first issue, it is suggested that Lord Collins inRubinmay well have overstated the extent to which the existing common law authorities give an exclusive role to the place of incorporation in determining whether foreign insolvency proceedings should be recognised. As to the second issue, it is difficult to see why the common law could not develop a broader test based on the concept of ‘centre of main interests’ as envisaged by Lord Hoffmann inHIH. 22 I share these sentiments. Presently, the legislative regime is silent on the recognition of foreign insolvency proceedings. Even if the Model Law is adopted in Singapore, such adoption does not in any way preclude the adoption of a common law COMI test. That Parliament has adopted it in one context does not mean that it has decided against it in other circumstances. 23 I do note that inBelugaat [86], the Court of Appeal stated that a liquidator properly appointed under the law of incorporation would be recognised by the Singapore court. However, I did not see anything in that judgment that precluded recognition of such a liquidator on other grounds, such as COMI. 24  Here, it was significant that Japan was essentially the sole place where actual business was carried on. Singapore was primarily a centre for managing funds received in the first instance in Japan. That carrying on of business thus provided a basis for recognition of the Applicant’s appointment as Bankruptcy Trustee of the Companies, even if Japan was not their place of incorporation. 25 I would note that on a common law adoption of the COMI test, there need not necessarily be a presumption in favour of the registered office, as there is under the Model Law or the EU Insolvency Regulation. However, such a presumption provides a sound default rule in the absence of evidence to the contrary, and provides certainty and regularity. The adoption of such a presumption would also harmonise the results on common law and statutory applications of the COMI test. In the present case however, any such presumption was rebutted by the clear objective and ascertainable evidence (applying an approach akin to that inIn reEurofood IFSC Ltd[2006] 1 Ch 508) that the COMI of the Companies was Japan. 26 Aside from a common law COMI test, the recognition of the Tokyo order could also be justified on practical grounds. Where the interests of the forum are not adversely affected by a foreign order, the courts should lean towards recognition. This approach could be justified on the bases of not only comity but also of business practicality. In the present case, the interests of Singapore creditors were protected by the undertaking (at [13]supra), and there was no competing jurisdiction interested in the winding-up of the Companies. On the other hand, the jurisdiction which had the greatest interest, Japan, had moved in favour of liquidation. To hinder the orderly dissolution of the Companies in this situation would serve no purpose. The decisions in bothRe LeeWah BankandReRusso-Asiatic Bankcould perhaps be explained on this practical basis. 27 As to the orders sought, there were alternative prayers in respect of the date of the vesting of the Companies’ assets and records in the Bankruptcy Trustee: whether as of the Bankruptcy Court order or only as of my order in these applications. In the circumstances, particularly the absence of any competing applications, as well as the limited nature of the Companies’ activity in Singapore, and the undertaking to preserve the position of Singapore creditors, I concluded that it was appropriate to have the assets and records vest as of the date of the Japanese order (ie, 13 November 2015). In other situations a different result may apply. 28 I also noted that there was no supporting affidavit from the Singapore solicitors. It may be better to have such a supporting affidavit when certain assertions are made, such as that there is an absence of prejudice in Singapore. A mere statement to such an effect by a foreign liquidator (or bankruptcy trustee as in this case) would not carry as much weight. Aedit AbdullahJudicial Commissioner Stephanie Yeo Xiu Wen (WongPartnership LLP) for the Applicant"
    }
}