{
    "case_title": "ATS vATT",
    "ncitation": "[2016] SGHC 196",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1 This applicationvideSummons No 1173 of 2014 (“SUM 1173”) was the third time the defendant, ATT (“the Husband”), had gone to court to reduce the total amount of maintenance ordered on 22 March 2011 (“the 2011 Maintenance Order”). In this latest round of protracted litigation with the plaintiff wife, ATS (“the Wife”), the Husband’s supporting affidavit touched on what he considered were material changes in circumstances to warrant a reduction of the monthly maintenance to his son and Wife. To the Wife, the Husband’s application was unmeritorious since the circumstances identified were hardly changes, let alone material in nature. 2 SUM 1173 was dismissed save for a prayer concerning an insurance policy. The Husband has since filed an appeal against the whole of my decision. I now set out the grounds of my decision.",
        "Background facts": "3 The Husband and Wife were divorced on 6 October 2009. Ancillary orders relating to custody, care and control of and access to their three children were made on 6 August 2010, and those relating to maintenance for the Wife and children and division of matrimonial assets were made on 22 March 2011 (ie, the “2011 Maintenance Order” and “the 2011 Property Order” respectively) (seeATS v ATT[2011] SGHC 213). The Husband appealed against the 2011 Maintenance Order and 2011 Property Order in Civil Appeal No 51 of 2011 (“CA 51”). The Court of Appeal on 6 February 2012 partially allowed the appeal against the 2011 Property Order, but disallowed the Husband’s appeal against the 2011 Maintenance Order. The written grounds of decision for CA 51 is reported inATT v ATS[2012] 2 SLR 859. I will refer to the appellate court’s adjustment of the 2011 Property Order as “the 2012 Property Order (CA)”. 4 The Husband had also sought a variation of the 2011 Maintenance Order in Summons No 1613 of 2012 (“SUM 1613”) which was dismissed on 18 March 2013. The neutral citation for the written grounds of decision isATS v ATT[2013] SGHC 156. The Husband filed his Notice of Appeal, but he later did not proceed with the same. 5 The three children are presently aged 21, 18 and 13 years old, based on their birthdates. At the time SUM 1173 was filed, the eldest child, the son, was 19 years old and was a full time national serviceman. After national service, the son enrolled as a student in the Singapore Institute of Management. The two daughters are still schooling; one is in junior college and the other in secondary school. The three children continue to reside with the Wife who remains a homemaker. 6 Before turning to examine the allegations and evidence in support of SUM 1173, I should mention the relevant principles applicable to a variation application.",
        "Law on variation of maintenance orders": "7 The statutory provision governing the variation of maintenance orders for former wives (s 118 of the Women’s Charter (Cap 353, 2009 Rev Ed)) provides for three situations when a court may vary or rescind such maintenance orders: Power of court to vary orders for maintenance 118.  The court may at any time vary or rescind any subsisting order for maintenance, whether secured or unsecured, on the application of the person in whose favour or of the person against whom the order was made, or, in respect of secured maintenance, of the legal personal representatives of the latter, where it is satisfied that the order was based on anymisrepresentationormistake of factor where there has been anymaterial changein the circumstances. [emphasis in italics added] 8 In addition, the court has a wide discretion under s 72 of the Women’s Charter to rescind or vary a maintenance order for children “as it thinks fit” if it is shown to the satisfaction of the court “proof of a change in the circumstances” of that person, that person’s wife, incapacitated husband (after the recent updates to the Women’s Charter) or the children or for “other good cause being shown”. Further, the court may take into account “any change in the general cost of living” that may have occurred between the final maintenance order and the date of the hearing of the variation application (see generallyAYM v AYL and another appeal[2014] 4 SLR 559 (“AYM v AYL(CA)”) at [15]). 9 I pause here to mention that the Husband in this case did not rely on s 72 which is applicable to any application for varying the maintenance for children by virtue of s 127(2) of the Women’s Charter. From the respective submissions, the parties were focused on “material change in circumstances” in s 118 as a ground for variation. Notably, the powers of the court to vary maintenance of children as noted by the Court of Appeal inAXM v AXO[2014] 2 SLR 705 (“AXM v AXO (CA)”) (at [33] and [34]) under s 72 are framed in broader terms and not limited to situations where there has been misrepresentation, mistake of fact or a material change of circumstances. In that case, as the Court of Appeal noted, the parties did not seek to invoke the court’s broader powers under s 72 to vary an order for maintenance of the children and on the facts, s 118 did not apply. The Court of Appeal was not required to discuss s 72, but it observed in passing that despite the broader language in which s 72 is framed (as compared to s 118), in practice, there would be little difference between the two provisions since the three conditions in s 118 would probably cover the vast majority of the potential situations that could come before the court (see [31] read with [24] of the report). 10 I now turn to the condition of “material change in circumstances” in s 118 as a ground (as was the case in SUM 1173). As a starting point, the material changes in question must relate to the circumstances prevailing at the time the 2011 Maintenance Order was granted. This approach is no different from applications to vary consent orders or agreements for maintenance as the material changes that have allegedly arisen must relate to those circumstances prevailing at the time the agreement for maintenance was entered into (see generallyAYM v AYL (CA)at [14];Tan Sue-Ann Melissa v Lim Siang Bok Dennis[2004] 3 SLR(R) 376 at [26] (“Tan Sue-Ann Melissa”)). 11 A variation application that seeks to rely on circumstancespriorto the order for maintenance should be rejected. Put simply, the court must be vigilant to sieve out unmeritorious applications and to ensure finality in the judicial process. No applicant should be allowed to have another bite at the cherry merely because he or she is displeased with the outcome of court proceedings. On this point, the comments of two District Judges are apposite. The first case isTDU v TDV[2015] SGFC 33 where the District Judge rejected the argument that evidence of changes in circumstancespriorto the order sought to be varied by the applicant could be relied on under ss 72 and 118 of the Women’s Charter. Admitting the same evidence in a variation application would effectively require the court to revisit the earlier decision of the court hearing the ancillary matter. The second case isTanHuan Eng Agnes Florence v Trevor Symes[2005] SGDC 83 (“TanHuan Eng”) where the District Judge cautioned against back-door appeals that are disguised as variation applications and emphasised that if the change is alleged to be material, the evidence of change must have arisenafterthe maintenance order (at [11]): It is important that the process of applying to vary a maintenance ordershould not be used as aback-door way to appealthe ancillary matters order, as this would subvert the whole court system. … After the ancillary matters are heard, it would be inappropriate for them to file a variation application in order to bring up submissions and evidence which they could have brought up at the ancillary matters stage. If such a situation were allowed to arise, there would beno finalityin the ancillary matters, and little incentive for parties to prepare their cases thoroughly, as they would know that they can always have multiple bites of the cherry. … The court will also be vigilant in ensuring thatany alleged material change in circumstances clearly aroseafterthe ancillary matters hearing, and was not something which could have been brought to the attention of the ancillary matters court. [emphasis added] 12 A variation application under s 72 and/or s 118 is not ade novoapplication; the variation court decides from the vantage point that presumes the final maintenance order to be appropriate (when made at that time) and examines whether the evidence demonstrates a change in circumstances has occurred since then to justify a variation or rescission of the final maintenance order made at the ancillary hearing. If the requisite condition relied upon is established on the evidence, the variation court should itself make an appropriatevariationin light of the requisite change’s impact on the final maintenance order; it should not approach the issue as if it were making an final maintenance order. 13 Generally, when the “change in circumstances” condition in s 72 and/or s 118 is invoked, the variation court strictly decides from the time-point post-ancillary order. The court should thus examine whether: (a) such change being alleged is achangefrom circumstances prevailing during the ancillary matters hearing; (b) such change being alleged aroseafterthe ancillary matters hearing; and (c) such change being alleged is sufficient enough to satisfy the court that a variation or rescission of maintenance is necessitated (in light of the factors that determined the final maintenance order made at the ancillary hearing (Tan Sue-Ann Melissaat [26])). 14 To summarise, what can qualify asmaterialchange within the meaning of s 118 would thus depend on the facts in light of the factors that informed the final maintenance order for the former wife (Tan Sue-Ann Melissaat [26]). As a parallel to this, a “change in the circumstances” that would necessitate a variation of a child’s maintenance under s 72 would depend on the facts in light of factors that informed the final maintenance award to the child. 15 Does the express requirement of materiality in s 118 invoke a more stringent standard than the mere “change in circumstances” of the father, wife or child in s 72? This has not been conclusively settled yet. There is the Court of Appeal’s passing comment inAXM v AXO (CA)that, in practice, there is possibly no difference in approach. Arguably, there could be a difference and this leads to the question as to where does the difference lie: whether the difference is really one of threshold and standard, or merely one of nuanced variance in considerations. As this was not a live issue in the present case, and in the absence of any debate, I shall say no more on this matter. 16 For completeness, I should mention the other condition “for other good cause” in s 72. This condition is wider − the Court of Appeal inAXM v AXO (CA)recognised it. As stated, the Husband did not invoke s 72 in SUM 1173; it is therefore proper to leave it to another forum to deal with the question of what constitutes “other good cause”. The situations that can amount to “other good cause” would be derived from the sort of evidence that is “shown to the satisfaction of the court” in order for the court to exercise its discretion. Put simply, the situations are examples of the circumstances in which the court may exercise its discretion to vary or rescind a maintenance order. The situations are fact-specific and each case must be decided on its particular facts.",
        "No changes in circumstances demonstrated": "17 I now turn to the merits of the Husband’s present application. I found that the basis of most of his allegations to be unfounded and not made out. The son’s circumstances as presented were overtaken by developments after SUM 1173 was filed. Above all, the change in circumstances being relied on to vary the 2011 Maintenance Order lacked a degree of continuity; it was a temporary state of affairs that would not amount to a change in circumstances. Let me elaborate.",
        "Son’s circumstances did not necessitate variation of para 5(7)(ii) of the 2011 Maintenance Order": "18 I refer to para 5(7) of the 2011 Maintenance Order. It provided in part (ii) for $900 per month being the personal expenses of the three children whilst they resided with the Wife. The Husband wanted to stop paying the monthly sum of $300 for the son’s personal expenses (“Children’s Expenses Issue”). He argued that the son was paid as a full time national serviceman and had income from private tuition. In addition, the son lived with him since 26 December 2013. As such, the Wife no longer incurred expenses for the son. Accordingly, the Husband’s obligation for the children’s monthly personal expenses should be proportionately reduced by one-third from $900 to $600. The Husband stopped the son’s personal expenses since January 2014, and this unilateral deduction was before SUM 1173 was filed. 19 As regards the son’s change of place of residence, the Husband submitted that the son had decided to stay with him after living with the Wife for 6 years, and thus circumstances had changed and naturally the 2011 Maintenance Order needed to be varied. This switch of abode was recorded on the son’s National Registration Identity Card. The Husband himself confirmed that the son was no longer living with him since 4 December 2015. By the time of the adjourned hearing on 13 April 2016, the son was living with his mother. 20 In contrast, the Wife explained that the son was not residing with the Husband as he had claimed. During national service, the son had spent weekends at the Husband’s place as it was nearer to the son’s army camp. Even so, there were times when the son would spend some weekends with the Wife and his sisters at the Wife’s residence. 21  More to the point, the son’s living arrangement with the Husband during national service was not a permanent one; it was an arrangement of convenience. The son’s “book out drop-off point” during his Basic Military Training was in Pasir Ris, which was closer to the Husband’s residence as compared to the Wife’s. Considering the fact that the access order made on 6 August 2010 (“the 2010 Access Order”) already provided that the Husband was to have overnight access to the son on “alternate weekends overnight from Friday 6 pm to Sunday 6pm”, I agreed with the Wife that the arrangement to stay with the Husband on some weekends was hardly a change in circumstances. Weekends with the Husband would be in line with the 2010 Access Order that gave the Husband liberal access to the children. Nonetheless, the son completed his national service on 4 December 2015, and no longer resided with the Husband. 22 As for income from tuition, the Wife explained that the tuition was a short term pursuit and the son was no longer giving tuition. I also agreed that the son’s pursuit of tertiary education meant that he would still require maintenance for the next few years. The son had accepted the unconditional offer from Singapore Institute of Management to pursue a Bachelor of Science (Honours) in Banking and Finance degree awarded by the University of London (“SIM (UOL)”). 23 Separately, I noted that the children’s personal expenses in the total sum of $900 per month had remained the same since 2011 and the Wife had not sought an upward revision for the children despite the higher cost of living affecting the children’s personal expenses now that they are older. I am also informed that the Husband had been in arrears of maintenance and the Wife’s application to recover the arrears was adjourned pending the outcome of SUM 1173. 24 For the reasons stated, I concluded that the monthly sum of $300 being the son’s share of the maintenance ordered for his personal expenses in para 5(7)(ii) of the 2011 Maintenance Order should not be varied. 25 I should also mention that as regards the variation of the son’s monthly maintenance, the parties had not argued or submitted on the limb of “any other good cause being shown” in s 72 of the Women’s Charter. I would not have thought that the Husband’s evidence would have satisfied that particular ground.",
        "Son’s education policy": "26 Next, there was the matter of the education policy that was purchased when the son was one year old. The Husband’s application was for him to stop paying the premiums on his son’s education policy (“Insurance Policy Issue”). At the adjourned hearing on 4 May 2016, the Husband’s position was that the education policy would mature in 2017 and he wanted the insurance proceeds to be used to finance the son’s tertiary education. 27 I was satisfied that the education policy was for the son’s tertiary education, and that it was the Husband who had all these years been paying the premiums to maintain the education policy. With the son’s enrolment at SIM (UOL), there was no good reason why the policy proceeds should not be used to finance the son’s tertiary education. The Wife’s objection was misplaced. There was no basis for her suggestion that the insurance proceeds upon maturity be utilised to buy accident and hospitalisation insurance plans for all three children. In my view, the Husband should be allowed to make use of the policy proceeds to help defray the son’s course fees at SIM (UOL), which was estimated to be in the region of $27,800.00. 28 By the adjourned hearing on 12 July 2016, both parties informed me that they had agreed to surrender the policy earlier and for the proceeds to be used for the son’s tertiary education.",
        "Reduction of household expenses in para 5(7)(iii) of the 2011 Maintenance Order": "29 The Husband had also wanted a reduction of the “household expenses, which include the purchase of groceries, expenses for the maid and the car” under para 5(7)(iii) of the 2011 Maintenance Order, from the monthly figure of $5,000 to $2,250 (“Household Expenses Issue”). He apportioned the amount of $5,000 among four people (the Wife and the three children) and arrived at the sum of $1,250 for each of them. He also claimed to be willing to compromise by ignoring in the apportionment: (a) the domestic helper; and (b) the fact that the son would “consume a lot more than the females”. 30 The main plank of the Husband’s contention was premised on the son’s change of abode as justification for the Household Expenses Issue. As stated, it was a temporary arrangement and in line with the 2010 Access Order. There was thus no evidence to support a reduction in the Household Expenses.",
        "Wife’s maintenance under para 5(7)(i) of the 2011 Maintenance Order": "31 The Husband applied for a reduction of “[the Wife’s] personal expenses” that was provided for in para 5(7)(i) of the 2011 Maintenance Order, from the monthly figure of $2,500 to $1,000 (“Wife’s Expenses Issue”). The Husband relied on two purported material changes in circumstances to seek a reduction in the maintenance for the Wife’s personal expenses: (a) the Wife bought a HDB flat in her sole name; and (b) the Wife could work and should be gainfully employed. No material change in financial circumstances 32 I agreed with the general principle that a positive change in financial circumstances of the former wife could satisfy the court that a downward variation of maintenance of a former wife was necessary under s 118 of the Women’s Charter. However, in the present case, the purchase of her HDB flat wasnota change in circumstances contrary to what the Husband submitted. The Husband claimed that the Wife’s purchase of the HDB flat meant that she “obviously [had] the financial means to purchase a property”. In 2013, she used the cash proceeds from the sale of a matrimonial property, together with her CPF monies, to buy the HDB flat that she now resides at with the children. The acquisition of the HDB flat was not evidence of a material change in the financial circumstances of the Wife that would affect the 2011 Maintenance Order. No material change in circumstances necessitating the Wife to seek employment 33 The next purported material change in circumstances the Husband raised was the fact that the Wife could and should go out to work. His contention was that with the passage of time (about two years had passed since the Court of Appeal upheld the 2011 Maintenance Order to the time he filed the variation application in SUM 1173), the daughters no longer required the Wife’s attention as they were older and less dependent on the Wife. Hence, there was no need for the Wife to remain unemployed. The Husband claimed that she had “plenty of free time” and deliberately did not work so that she could continue receiving maintenance from him. 34 It is not controversial that the law of maintenance does not seek to create situations of life-long dependency by former wives on maintenance from their former husbands; former wives where reasonable would be expected to regain some level of financial self-sufficiency:QuekLee Tiam v Ho Kim Swee (alias Ho Kian Guan)[1995] SGHC 23 (“QuekLee Tiam”) (at [21]–[22]). This was reiterated inNI v NJ[2007] 1 SLR(R) 75 (at [11]) that the former wife should “exert herself, [to] secure a gainful employment, and earn as much as reasonably possible.” The Court of Appeal inARY v ARX andanother appeal[2016] SGCA 13 (at [98]) also commented that the “question is not whether the wife will be able to find her ideal employment, but rather, whether she can be gainfully employed, and thus defray her personal expenses instead of being entirely dependent on the husband.” The Husband was thus rightly advised that the Wife could not “expect a meal ticket for life”. However, this expectation had to be considered in light of each case’s circumstances. InNI v NJ, it was noted by V K Rajah J (as he then was) that “every case will have to be assessed in its proper context”. 35 This present case was unlike some of the decided cases where former wives were required to seek employment. The facts of this case are different and I shall explain. 36 SUM 1173 was clearly the Husband’s attempt to have another bite at the cherry and revisit the same issue of the Wife’s employment. This was at least thefourth timehe had canvassed this same point in court: he had previously raised the Wife’s earning capacity and her need to seek employment in: (a) the ancillary matter hearing before the 2011 Maintenance Order was made on 22 March 2011; (b) before the Court of Appeal in CA 51 where the 2011 Maintenance Order was upheld; (iii) before this court in his first variation application in SUM 1613; and (iv) now again in the present SUM 1173. This court had previously pointed out that SUM 1613 was “yet another instance of the Husband’s illicit attempt to revisit an issue” (at [23] of [2013] SGHC 156) that the Court of Appeal had specifically addressed and refuted when it decided (at [28] of [2012] 2 SLR 859) that: …it would probably have made aninsignificant differencein the maintenance sum ordered,at least for the near to middle term. While the Wife is a diploma-holder in her 40’s, she hascare and control of three school-going children, especially the two younger ones who are aged 13 and 9. Moreover, the Wife has beenout of the job market for some 13 years, making itunrealisticorimpracticalto expect her to immediately pick up from where she left off before she became a homemaker, even with the assistance of a maid. [emphasis added] 37 When the Husband filed SUM 1173 on 5 March 2014, it was nearly two years after the Court of Appeal in CA 51 upheld the 2011 Maintenance Order on 3 April 2012 (and just about six and a half months after the grounds of decision for SUM 1613 were released on 20 August 2013) that the Husband was seeking to re-argue the same point for the fourth time before the courts. SUM 1173 was decided on 24 May 2016, and by then it was just slightly over four years since the Court of Appeal decision in CA 51. 38 Above all, there was no evidence of any material change in circumstances in the last few years. Thesameconsiderations expressed by the Court of Appeal in CA 51 still remained nonetheless; the wife’s potential future earnings then made and now still made aninsignificance difference. Put simply, four years ago, the Court of Appeal found it “unrealistic or impractical” to expect the Wife to get back to the workforce having been out of the job market for 13 years and as she had care and control of the three children (the youngest was then 9 years old); the Court of Appeal was of the view that “at least for the near to middle term”, the expectation of self-sufficiency would make only an “insignificant difference”.A fortiori, the Wife was now almost in her 50’s and even though she holds a diploma in Quantity Surveying, she had been out of the work force for an even longer period of some 17 years. The Husband’s assertion that she could earn $3000 per month was a bald one. Besides, the two daughters werestillschool-going and the Wife was still needed to see to the daughters’ welfare (with the youngest daughter still being tutored by the Wife). There was thus no material change in circumstances to warrant a variation of para 5(7)(i) of the 2011 Maintenance Order with regard to the Wife’s maintenance. 39 Returning to the point on the Husband’s attempt to “re-litigate” the exact same point, I noted that his appeal against the 2011 Maintenance Order and his first variation application in SUM 1613 were dismissed, where he had already sought to insist that the Wife gain employment in both instances and had sought thesameamount of reduction in the Wife’s Expenses from $2,500 to $1,000 (see [2013] SGHC 156 at [21]). Somesixand a half monthsafter the grounds of decision were issued for SUM 1613, the Husband filed SUM 1173 and the same amount of reduction was sought. His behaviour clearly evinced his insistence on a position that had already been repeatedly rejected by the courts given the trifle evidence adduced on each occasion.",
        "No basis to subject payment of the children’s expenses in para 5(8) of the 2011 Maintenance Order to Husband’s consent": "40 The Husband took issue with various miscellaneous personal and education expenses under para 5(8) of the 2011 Maintenance Order (“the last paragraph”) which read: In addition, the [Husband] shall pay to the [Wife] (and not on a reimbursement basis) the children’s expenses in relation to their education, insurance policies and weekly pocket money. 41 I will refer to this area of dispute as the “Consent Issue”. The Husband complained about tuition fees, overseas school trips, pocket money during school holiday periods, and the children’s mobile phone bills. He said that pocket money “is meant for school”, and thus he should not be forking out money during school holidays. He claimed that school trips were optionaland he objected to paying the children’s phone bills as he felt that the Wife did not control their phone usage and thus allowed them to rack up high phone bills, and that these expenses should already be included under Household Expenses. He also complained that the Wife was sending him invoices and expected him to pay, which was not according to the 2011 Maintenance Order which stipulated that the expenses were to be paid “not on a reimbursement basis”. He reasoned that he should be consulted prior to incurring any expense; it was not for the Wife to make a unilateral decision to incur expenses and then seek reimbursement from him thereafter. The Husband thus, in the Consent Issue, wanted to vary the last paragraph of the 2011 Maintenance Order to make all payment thereunder subject to his prior consent. 42 There was some force in the Wife’s contention that the Consent Issue ought to have been the subject of an appeal in CA 51 and a variation application was not appropriate. I noted that the first reason the Husband gave was that the Wife now had a capital sum that she did not have when the 2011 Maintenance Order was made. This reason was argumentative and not evidence of a change in circumstances; the capital sums represented the division of matrimonial assets derived from the 2012 Property Order (CA). 43 The second reason the Husband gave was that the last paragraph of the 2011 Maintenance Order under discussion was “too widely phrased” as the Wife now expected him to pay for expenses such as overseas trips for extra-curricular activities that might cost several thousand dollars. The variation that was sought was for the payment of the children’s expenses to be made subject to the Husband’s consent. As stated, it was not an issue that was raised in CA 51. In any case, I found the Husband’s arguments on this point unmeritorious. The ground in the Husband’s affidavit and written submissions was expressed to be on the condition of a “material change in circumstances”. 44 First, the Husband’s unhappiness with the overseas school trips was unwarranted. It was clear that the last paragraph of the 2011 Maintenance Order was expressly contemplated by this court to include such expenses. This can be seen from [46] of [2011] SGHC 213 which laid out the grounds of decision for the 2011 Maintenance Order: [For the children’s maintenance, the Wife’s] claim for “holidays/ travel” also amounted to $1,500 a month which I believe is excessive for school going Children. Simply because the Husband spent $500 per month for his personal travel was no justification for insisting on the same amount for the Children and herself. Iftravel expenses were for school trips such as for sports, exchange programmes, and learning programmes, they would be borne separately by the Husband under the Order of 22 March 2011. For the above reasons I thought it fair that the Husband should bear the Children’s monthly expenses (not on a reimbursement basis) relating to their education, insurance policies and weekly pocket money. [emphasis added] 45 Second, the Wife stated that this point on the pocket money had already been decided by a District Judge in the Family Court who held that the maintenance order did not exclude payment of weekly pocket money during school holidays. Despite this, the Husband was plainly rehashing this point again here, as he had rehashed his contention that the Wife should gain employment. The order referring to “weekly pocket money” was not qualified in any way with a reference to either the nature of activities the pocket money was for or the period of the year the pocket money was to be given. 46 Third, even if I had interpreted the Husband’s case that variation was necessary because of the way the Wife had been claiming the children’s expenses on a reimbursement basis without first seeking his consent to incur the expenditure, there was evidence to demonstrate that he had in fact known about at least some of those expenses before they were incurred. This was based on conversations that had been going on between the children and the Husband. They had in fact asked for the Husband’s permission or informed him about them, such as tuition fees and an overseas trip, before expenses for them were incurred. 47 Fourth, the phrase “not on a reimbursement basis” did not mean that the Husband’s prior consent was required before the relevant expenses were incurred (which included expenses relating to education, insurance policies and weekly pocket money). In fact, the order provided that the Husband had to pay those heads of expenditureas they were incurred, as opposed to a reimbursement basis. To reimburse was to repay money first spent by a payee, while the former meant that the Husband was to pay the expenses as they incurred, without the Wife having to fork out money herself and then claim from the Husband thereafter. There was no requirement of the Husband’s consent in the 2011 Maintenance Order. Implying a requirement of consent into the phrase “not on a reimbursement basis” which also applied to expenses relating to insurance policies and weekly pocket money did not make sense in the context of how the last paragraph of the 2011 Maintenance Order was phrased. Of course, the last paragraph was neither a license nor a blank cheque for the children to chalk up unreasonably exorbitant and unnecessary education expenses and treat their father as an unlimited automated teller machine, but the expenses (tuition fees and overseas school trips) that the Husband were complaining of in the present case were not of such nature (see above at [44]). 48 I was reminded that acceding to the Husband’s application would exacerbate the family’s stress. The Husband had unilaterally reduced the maintenance sumbeforeeven filing the present SUM 1173. To date, the Wife had taken out four maintenance enforcement applications, with three of them being concluded against the Husband and the latest pending SUM 1173. The Husband had repeatedly defaulted on his maintenance payments despite having the ability to pay. 49 For the reasons stated, I ruled against the Husband on the Consent Issue. There was no merit in the Husband’s arguments on this point to necessitate the variation sought under this Consent Issue.",
        "Husband’s ability to pay had in fact increased": "50 It is settled law that an inability to pay could justify a downward adjustment to maintenance (AYM v AYLat [23]). Conversely, an increase in the earnings of the payer could be a material change in circumstances and a ground for upward variation (Koo Shirley vMok Kong Chua Kenneth[1989] 1 SLR(R) 244 (at [12]–[13]), cited inTanHuan Eng(at [14])). In deciding against a downward variation of maintenance, an increase in the ability of the payer’s financial abilities would be a relevant factor. 51 The Husband argued that his declared average monthly net salary was $10,189.81 over the four years from 2010 to 2013, with a monthly deficit (after deducting his declared monthly expenses) of almost $13,000. He claimed that if not for the proceeds of the sale of a matrimonial property, he would have had to file for bankruptcy or would have been sent to jail for failing to pay maintenance. The Husband’s use of an average monthly income base over a period of four years (that begun frombeforethe 2011 Maintenance Order) was unhelpful. A variation application was concerned with a change in circumstances between then and now. 52 I noted that the Husband’s declared salary was $9,100 at the time of the 2011 Maintenance Order, and this court as well as the Court of Appeal in CA 51 had both held that the Husband had failed to make full and frank disclosure of his income (see [9] of [2011] SGHC 213; [24] of [2012] 2 SLR 859). It appeared that the Husband’s gross monthly income (as evinced from income tax notices of assessment) hadincreasedsince the 2011 Maintenance Order was upheld in 2012 (from $8737.66 in year of assessment (“YA”) 2012, to $18,233.92 in YA 2013 and $12,713.75 in YA 2015), while his monthly expenses asdeclared(that I took at face value without examining their accuracy) had actuallydecreased(from $23,517 in 2011 to $15,589 now).Prima faciethen, his ability to pay would in fact have improved. 53 All in all, the Husband was unable to dispel the impression that SUM 1173 was taken out because of his perceived view that the Wife’s financial circumstances had improved due to the receipt of money from the division of matrimonial assets. However, as I mentioned above, this did not amount to a change in financial circumstances on the part of the Wife. The division of matrimonial assets was orderedat the same timeas the 2011 Maintenance Order, and as the Court of Appeal affirmed inBG v BF[2007] 3 SLR(R) 233 (at [75]), the power to order maintenance is exercised in a mannersupplementaryto the power to divide matrimonial assets. The court’s order for maintenance complements and takes into account the order for assets.",
        "Conclusion": "54 Having examined and dismissed the bulk of the arguments put forward by the Husband in SUM 1173, save for the Insurance Policy Issue, the application was unmeritorious and was no different from the earlier times the Husband had come to court to attempt to do his level best to argue out of the 2011 Maintenance Order. In summary, I dismissed SUM 1173 but I ordered that the son’s policy numbered [redacted] be surrendered by 31 July 2016 and the surrender value to be utilised towards the costs of the son’s tertiary education at SIM (UOL), which would help defray this larger expenditure. 55 For completeness, I should explain why SUM 1173 was decided in May 2016. I started hearing parties proper regarding the variation of maintenance application in SUM 1173 on 13 April 2016, slightly over two years after it was filed by the Husband on 5 March 2014. SUM 1173 was adjourned several times for the following reasons: (a) Parties first appeared before me for SUM 1173 on 18 August 2014, and the hearing was adjourned for parties to attempt mediation and for the Wife to file and serve an affidavit in reply. Mediation was not successful and when the matter came up for hearing, it was again adjourned on 13 November 2014 for the Wife to obtain assistance of counsel. (b) On 8 January 2015, I indicated to parties that the sale of the matrimonial property, a semi-detached house (“the DDD property”) as directed in CA 51 was long outstanding and that it would have to be resolved first before the main hearing of SUM 1173. By that time, the Wife had taken out several applications in relation to the sale of the DDD property having waited almost three years after CA 51 was decided. (c) A chronology of the applications taken out in relation to the sale of the DDD property are as follows: (i) Summons No 5404 of 2012 (“SUM 5404”) was filed by the Wife to deal with the sale of the DDD property as directed in CA 51. I allowed SUM 5404 in part, and initially gave a timeline on 14 January 2013 for parties to exercise options to buy over the other’s share in the property (failing which for the property to be sold in the open market) (“the SUM 5404 Order”). (ii) The Husband was thereafter uncooperative and the Wife thus sought a variation of the SUM 5404 Order on 18 March 2013. I ordered the DDD property to be sold in the open market on 18 March 2013. (iii) The Husband subsequently filed a Notice of Appeal on 15 April 2013 against the whole of my decision in SUM 1613 and SUM 5404, but this appeal was eventually deemed to be withdrawn as the Husband did not file his appellant’s case. (iv) Amidst all these proceedings, the Wife also brought four enforcement applications due to the Husband’s persistent failure to pay maintenance over the years since May 2011, which necessitated 28 court attendances by the Wife. Three of them were enforced in the Wife’s favour, with the last pending this decision in SUM 1173. (v) There were several occasions when the Wife complained that the Husband was not cooperating in the sale. She was not able to gain access to the DDD property for viewing by interested buyers. (vi) Parties informed me on 13 February 2015 that they were since co-operating. On 1 July 2015, the Wife informed me that she had accepted the Husband’s offer to purchase the DDD property from her at the value of $3.71 million after she was exhausted from dealing with the difficulties surrounding the sale and viewings. Belinda Ang Saw EanJudge Alagappan Arunasalam (A Alagappan Law Corporation) for the plaintiff;Yap Teong Liang (T L Yap & Associates) for the defendant."
    }
}