{
    "case_title": "Caesarstone Sdot-Yam Ltd vCeramiche Caesar SpA",
    "ncitation": "[2016] SGHC 45",
    "coram": "George Wei J",
    "sections": {
        "Introduction": "2 The applicant, Caesarstone Sdot-Yam Ltd, is an Israeli company that was founded in 1987.1Foot Note 1×PAR’s Grounds of Decision, para 18.The company is a worldwide manufacturer of engineered quartz and stone surface products for various applications including kitchen and bathroom countertops, back splash surfaces for the kitchen, wall claddings and floor tiles for kitchens and bathrooms, and so on. Its slabs are used in a variety of residential and non-residential applications. 3 The opponent, Ceramiche Caesar SpA, is an international manufacturer of porcelain stoneware tiles for indoor and outdoor use, both for flooring and cladding installations with more than 20 years of corporate history.2Foot Note 2×PAR’s Grounds of Decision, para 16.It is incorporated in Italy and its range of porcelain stoneware tiles is marketed in many countries including Singapore. 4 The opponent is the registered proprietor of the following trade mark in Singapore (“the CAESAR Mark”).  5 The CAESAR Mark is a composite mark comprising a word with the letters “A” and “E” being ligated. The word is placed between two small diamond-shaped dot devices. The CAESAR Mark was registered for goods in: Class 19 Non-metallic building materials, especially tiles for covering, floor coverings, tiles for gutters, cove moldings, corner beads not of metal, protruding wedges, stilted modular floors, special parts for finishing, stair treads. 6 The applicant applied to register the following mark (“the CAESARSTONE Mark”) in Singapore:   The CAESARSTONE Mark is also a composite mark comprising a word and a graphic device placed at the beginning of the word element. The application was specifiedfor the following classes of goods and services: Class 19 Non-metallic tiles, panels for floors, floor coverings, wall cladding, flooring, and ceilings; non-metallic covers for use with floors and parts thereof; non-metallic profiles and floor skirting boards; slabs and tiles formed of composite stone for building panels, counter tops, vanity tops, floors, stairs, and walls. Class 20 Worktops, sinktops [kitchen furniture]; work surfaces and surrounds [furniture] for kitchens, bathrooms, vanity units and offices, counter tops; table tops; bar tops [furniture]; non-metallic work surfaces for furniture, fixtures or surrounds [furniture] used in reception areas. Class 35 The bringing together, for the benefit of others, of a variety of goods such as tops and facing surfaces (excluding the transport thereof), enabling customers to conveniently view and purchase those goods from wholesale and retail outlets; wholesale and retail services in relation to tops and facing surfaces, work surfaces, surrounds, tiles, panels, floor coverings, wall cladding, flooring, ceilings, slabs and tiles formed of composite stone for building panels, counter tops, vanity tops, floors, ceilings, stairs, and walls; provision of commercial information relating to the aforesaid goods; provision of business consultancy, marketing services, promotional services and business assistance in the establishment and operation of, dealership, franchising, wholesale and retail services that feature tops and facing surfaces, work surfaces and surrounds, tiles, panels, floor coverings, wall cladding, flooring, ceilings, slabs and tiles formed of composite stone for building panels, counter tops, vanity tops, floors, ceilings, stairs, and walls. Class 37 Installation, maintenance and repair services of worktops, sinktops, work surfaces and surrounds for kitchens, bathrooms, vanity units and offices, counter tops, table tops, bar tops, tops and facing surfaces for furniture, reception desks and reception areas, tiles, panels for floors, floor coverings, wall cladding, flooring, ceilings, non-metallic covers for use with floors and parts thereof, profiles and floor skirting boards, slabs and tiles formed of composite stone. 7 The opponent objected to the application in Class 19 and commenced the present opposition proceedings against the applicant. No objection was raised against the applicant in respect of Classes 20, 35 and 37.It bears noting that similar opposition proceedings have been brought against the CAESARSTONE Mark in other jurisdictions including Australia and Canada. Reference will be made to some of these cases where relevant later in this judgment. That said, it is critical to bear in mind that the specifications, facts, submissions, statutory provisions and evidence behind the relevant applications vary from jurisdiction to jurisdiction.",
        "The opposition proceedings": "8 Before the PAR, the opponent advanced the following objections to the registration of the CAESARSTONE Mark in Class 19, namely that: (a) the CAESARSTONE Mark was similar to the CAESAR Mark in respect of identical or similar goods, and there existed a likelihood of confusion (pursuant to s 8(2)(b) of the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the TMA”)); (b) the CAESARSTONE Mark was similar to the opponent’s earlier well-known trade mark and indicated a connection in the course of trade with the likelihood of causing damage to the interests of the opponent (s 8(4)(a) read with s 8(4)(b)(i) of the TMA); and (c) the CAESARSTONE Mark was similar to the opponent’s earlier well-known trade mark, the use of which would cause dilution or take unfair advantage of the earlier well-known trade mark (s 8(4)(a) read with s 8(4)(b)(ii) of the TMA); and (d) the application for the CAESARSTONE Mark was made in bad faith (s 7(6) of the TMA). 9 Having considered the evidence and submissions presented by both parties, the PAR allowed the opposition on the first two grounds,viz,the ground of opposition premised on s 8(2)(b) as well as that of s 8(4)(a) read together with s 8(4)(b)(ii). However, the PAR determined that the opponent was only entitled to 60% of its costs considering that it had failed on two grounds of opposition. Briefly, the PAR’s decision may be summarised as follows: (a) On the ground of opposition under s 8(2)(b) of the TMA, the marks were similar on the whole, there was a clear similarity of the goods in question and there was a likelihood of confusion on the part of the public. Therefore, the opposition under s 8(2)(b) succeeded.3Foot Note 3×PAR’s Grounds of Decision, paras 20 to 96. (b) On the ground of opposition under s 8(4)(a) read with s 8(4)(b)(i) of the TMA, the marks were similar on the whole, the CAESAR Mark was well-known in Singapore as at 21 November 2007 and there was a confusing connection that caused blurring in that consumers may be led to believe there is an economic connection such as to divert sales away from the opponent. Therefore, the opposition under s 8(4)(a) read with s 8(4)(b)(i) succeeded.4Foot Note 4×PAR’s Grounds of Decision, paras 98 to 111. (c) On the ground of opposition under s 8(4)(a) read with s 8(4)(b)(ii) of the TMA, the CAESAR Mark was not well-known to the public at large in Singapore. Therefore, the opposition under s 8(4)(a) read with s 8(4)(b)(ii) failed.5Foot Note 5×PAR’s Grounds of Decision, paras 112 to 127. (d) On the ground of opposition under s 7(6) of the TMA, there was insufficient evidence to show how the applicant had fallen short of some acceptable standard of commercial behaviour by reasonable and experienced men in the particular area of trade. Therefore, the opposition under s 7(6) failed.6Foot Note 6×PAR’s Grounds of Decision, paras 128 to 140. Where relevant and necessary, I will refer to the PAR’s analysis in greater detail in the discussion that will follow.",
        "This appeal": "10 The applicant urges this court to re-examine the PAR’s decision in relation to the grounds on which the opponent succeeded, namely those concerning: (a) s 8(2)(b) of the TMA; and (b) s 8(4)(a) read with 8(4)(b)(i) of the TMA. 11  The first broad issue is whether the PAR erred in allowing the opposition under s 8(2)(b) of the TMA. In this regard, the following sub-issues arise for consideration: (a) whether the CAESARSTONE Mark and the CAESAR Mark are similar; (b) whether the applicant’s goods are the same or similar to those of the opponent; and (c) if so, whether there is a likelihood of confusion arising from the similarity of the marks and the parties’ goods. 12 The second broad issue is whether the PAR erred in allowing the opposition under s 8(4)(b)(i) of the TMA. In this regard, the following sub-issues arise for consideration: (a) whether the CAESARSTONE Mark is similar to the CAESAR Mark; (b) whether the CAESAR Mark is well-known in Singapore and was well-known at the date of application of the CAESARSTONE Mark; (c) whether the applicant’s use of its mark in relation to the goods for which the CAESARSTONE Mark is sought to be registered would indicate a connection between those goods for which the CAESARSTONE Mark is registered and the applicant’s goods; and (d) whether the applicant’s use of its mark in relation to the goods for which the CAESARSTONE Mark is sought to be registered is likely to damage the interests of the opponent. 13 I pause to briefly note that the common thread that runs through both grounds of opposition is the element of confusing similarity between the respective marks. It follows that both grounds of opposition would failin limineif the marks are held not to be confusingly similar.",
        "The court’s role in an appeal": "14 It is apposite to begin the legal analysis with the observation that there appears to be some uncertainty over the threshold for appellate intervention in an appeal against the PAR’s decision. 15 On one view, this appeal operates by way of a rehearing and that the court may consider afresh all the evidence adduced at the hearing below but the decision of the PAR ought not to be disturbed unless there has been a “material error of fact or law”:Rovio Entertainment Ltd v Kimanis Food Industries Sdn Bhd[2015] 5 SLR 618 (“Rovio”) at [80]. On another view, the threshold for appellate intervention may be lower in view of O 87 r 4(2) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) which provides that “an appeal shall be by way of rehearing and the evidence used on appeal shall be the same as that used before the Registrar and, except with the leave of the Court, no further evidence shall be given”:Polo/Lauren Co LP v United States Polo Association[2016] SGHC 32 at [6]–[8]. 16 In the present case, for reasons which will become apparent, nothing turns on the threshold for appellate intervention.",
        "The ground of opposition under s 8(2)(b) of the TMA": "17 Whether an earlier trade mark is similar to a later trade mark that is sought to be registered for the purposes of thwarting the registration of the later mark is a question of fact: Tan TeeJim,Law of Trade Marks and Passing Off in Singapore(Sweet & Maxwell, 3rd Ed, 2014) (“Tan Tee Jim”) at para 8.058. It is undisputed that the CAESAR Mark is valid and subsisting, and constitutes an earlier trade mark as defined in s 2 of the TMA. 18 Section 8(2)(b) of the TMA provides: (2)    A trade mark shall not be registered if because — (a) … (b) it is similar to an earlier trade mark and is to be registered for goods or services identical with or similar to those for which the earlier trade mark is protected, there exists a likelihood of confusion on the part of the public. 19 The broad principles governing the analysis of mark similarity have been authoritatively and compendiously set out inStaywell Hospitality Group Pty Ltd v Starwood Hotels & Resorts Worldwide, Inc and another and another appeal[2014] 1 SLR 911 (“Staywell”). InStaywell, the Court of Appeal laid down the step-by-step approach under which the three requirements of similarity of marks, similarity of goods or services and likelihood of confusion arising from the two similarities are assessed systematically (at [15]). 20 Accordingly, there arethree elements to be satisfied in order for this ground of opposition to succeed: (a) the CAESARSTONE Mark is similar to the CAESAR Mark (“the first element”); (b) the CAESARSTONE Mark is to be registered for goods or services identical with or similar to those for which the earlier trade mark is protected (“the second element”); and (c) there exists a likelihood of confusion on the part of the public (“the third element”). 21 The applicant does not challenge the PAR’s finding on the second element,ie,that the CAESARSTONE Mark is to be registered for goods or services similar to those for which the CAESAR Mark is protected. Nevertheless, it is still necessary to refer to the nature of the goods in determining the likelihood of confusion and I will return to this point at the appropriate juncture.",
        "First element: similarity of marks": "22 The competing marks in the present appeal are set out below: Caesarstone MarkCaesar Mark 23 Before delving into the legal analysis, it will be useful to keep in mind the PAR’s preliminary observations about the competing marks. In the PAR’s Grounds of Decision (“PAR’s Grounds of Decision”), she noted at [24] that both marks were composite marks: the CAESARSTONE Mark consisted of a device as well as the word “caesarstone” whereas the CAESAR Mark consisted of the word “CAESAR” encased within two dots, with the letters “A” and “E” being ligated. The PAR commented, however, that the two dots and the ligature used in the CAESAR Mark were rather subtle in nature. Applicable legal principles 24 There is now a considerable body of case law in Singapore on the principles governing mark similarity. The over-arching question is whether the marks, when observed in their totality, are similar rather than dissimilar:Staywellat [17]. It is the totality that is important: points of similarity must be looked at together with points of departure (ie, differences)in coming to the decision. Whether the points of similarity or points of difference dominate as a whole is a matter which must depend on the facts of each case. The viewpoint to be taken is that of the ordinary consumer or customer. 25 It is well-established that there are three aspects of similarity in the inquiry that the court is required to pay attention to: aural, visual and conceptual. InStaywellat [18], the Court of Appeal stressed that these three aspects of similarity are not to be considered in a formulaic manner, but are to be applied as signposts towards answering the question of whether or not the marks as a whole were similar. There is no requirement for all three aspects to be made out before the marks can be found to be similar and trade-offs can occur between the three aspects of similarity. 26 In assessing mark similarity, it is clear lawthat the court may have regard to the technical and non-technical distinctiveness of the marks. Technical distinctiveness is usually used in contradistinction to “descriptiveness”:Staywellat [24]. A newly invented word which has no meaning will carry a high degree of technical (or what is sometimes called inherent) distinctiveness when it is used as a trade mark. The newly coined and meaningless word says nothing about the goods or services and its use in relation to the goods or services is much more likely to be taken as use for trade mark purposes. This observation dovetails nicely into Lord Parker’s oft cited comment inW & G Du Cros Ld’s Application, Re(1913) 30 RPC 660 at 672that the right to register a trade mark should “largely depend on whether other traders are likely, in the ordinary course of their business and without any improper motive, to desire to use the same mark, or some mark nearly resembling it, upon or in connection with their own goods”. William Cornish, David Llewelyn & Tanya Aplin,Intellectual Property: Patents, Copyrights, Trademarks & Allied Rights(Sweet & Maxwell, 8th Ed, 2013) (“Cornish, Llewelyn & Aplin”)at para 18-26 also cite in this context the comment of Robin Jacob QC (as he then was) inColorcoatTrade Mark[1990] RPC 511 at  517 that “the power of a trade mark monopoly should not be granted where it would require honest men to look for a defence to an infringement action”.Whilst these remarks pertain to different (and older) trade mark legislation, the sentiments expressed bear repeating today.Many a trader may wish to use the words “Best Quality” for perfectly proper purposes in relation to their own goods or services. 27 By “ordinary” or “non-technical distinctiveness”, the Court of Appeal inStaywellat [23] explained that this simply refers to what is “outstanding” and “memorable” about the mark. In short, features that would catch the eye of the average customer. These features will tend to stand out in the average customer’s mind and imperfect recollection. Ordinary distinctiveness, thus defined, is clearly different from technical distinctiveness. Technical distinctiveness as clarified by the Court of Appeal relates closely to the core function of a trade mark which is to distinguish the goods or services of one trader from those of another trader. The Court of Appeal rightly underscored at [25] that the ability of a mark “to function as a strong badge of origin” must be assessed by looking at the mark as a whole. Distinctiveness in this sense does not just mean “standing out” or “likely to catch attention.” A feature which has nothing to do with distinctiveness may stand out and attract the eye of a customer; what is important is whether the customer’s attention is “attracted in the right trade-origin manner”: James Melloretal,Kerly’sLaw of Trade Marks and Trade Names(Sweet & Maxwell, 15th Ed, 2011) (“Kerly’sLaw of Trade Marks and Trade Names”) at para 8-034. 28 The bar in s 7(1)(b) of the TMA against non-distinctive marks does not prevent registration where the trade mark has “acquired a distinctive character as a result of the use made of it”: s 7(2) of the TMA. Such acquired distinctiveness arises where the words which say something about the goods or services acquire the capacity to act as a badge of origin through long-standing or widespread use. It will be useful, however, to bear in mind that “technical distinctiveness” and “inherent distinctiveness” are not statutory terms:Rovioat [75]. What s 7(1)(b) states is that “trade marks which are devoid of any distinctive character” are not registrable. Nonetheless, the concepts of technical, inherent and acquired distinctiveness have proved helpful in developing the principles to be applied. 29 I stress, however, that the question before me is not whether the CAESAR Mark possessed a distinctive character for registration. There is no attack on the registration of the opponent’s trade mark. What is in issue is whether the applicant’s CAESARSTONE Mark is asimilarmark. This is a question of comparison and judgment. The perspective to be taken is that of the ordinary customer with imperfect recollection. In making the comparison, it stands to reason that a mark which possesses greater technical distinctiveness will tend to enjoy a higher threshold (that must be crossed) before a competing sign will be considered dissimilar:Staywellat [25]. It follows that where the opponent’s mark has a feature that is clearly dominant and distinctive, the fact that this feature is also found in the applicant’s mark will naturally tend to support a finding of overall similarity even if some other features are different: seeRovioat [76]. 30 I pause to comment that it cannot and must not be assumed that there will always be a feature of the mark which dominates the mark’s landscape. In many cases, no particular feature will stand out. Micro-analysing a mark for particular distinctive features in such cases is unhelpful. Whether the PAR had erred in finding that the competing marks were similar 31 I turn now to consider the appeal against the PAR’s finding that the competing marks were similar. There is no suggestion or claim that the CAESAR Mark lacks distinctiveness for registration, and I appreciate that distinctiveness of a mark is to be integrated within the assessment of mark similarity. However, for clarity and with due deference to the submissions made by the respective counsel, I will discuss them separately before applying my findings to the assessment of mark similarity. (1) Inherent distinctiveness 32 The PAR held that the CAESAR Mark was of a medium level of inherent distinctiveness. Whilst the main component of the CAESAR Mark, “Caesar”, was not an invented word, it did not have any direct reference to the goods in Class 19. It is apparent that the PAR was of the view that the word “Caesar” would likely be understood by the average consumer to be a reference to the Roman statesman Julius Caesar, and the word or name thus said nothing about any characteristic of non-metallic building materials.7Foot Note 7×PAR’s Grounds of Decision, paras 36 and 37. 33 Before the PAR, the applicant argued that “Caesar” was a commonly used name and that greater latitude should be given to the use of a common name. To that end, the applicant relied on the decision inTaylor, Fladgate & Yeatman Limited v Taylor Wines Pty Ltd[2014] SGIPOS 11 (“Taylor”) to submit that “Caesar” is not particularly distinctive. InTaylor, the PAR found that there were eight live business entities using the name “Taylor” in Singapore (and not 69 as contended for by the applicant). This was sufficient to support the finding that the name “Taylor” was not uncommonly used in Singapore, and that the opponent’s mark was not particularly distinctive since it had been used as the trading name of a number of live business entities in Singapore.There was, therefore, no reason that it should be granted any additional layer of protection that is usually reserved for marks that are inventive words (at [54]). 34 FollowingTaylor, the applicant tendered an Accounting and Corporate Regulatory Authority (“ACRA”) search report (“the ACRA Report”) that showed the use of Caesar by at least 45 different Singapore corporate entities whose names contain the common denominator “Caesar”.8Foot Note 8×Applicant’s 2nd Supplemental Bundle of Documents, pp 8-15.The ACRA Report was not tendered as evidence but the applicant contended that such information is in the public domain and the court could take judicial notice thereof. It does not appear that the opponent objected to this. 35 The PAR took the view thatTaylorcould be distinguished on the basis that the marks inTaylorrelate to Class 33 goods and that there is a common tendency to use personal names within the wine industry (PAR’s Grounds of Decision at [38]). Further, the PAR considered that even if she were to take judicial notice of the ACRA Report, only 15 out of 45 of the entities which contained the common denominator “Caesar” were “live”. The rest of the businesses had been terminated, struck off or cancelled. For these reasons, the PAR rejected the applicant’s submission that the CAESAR Mark tended towards a low level of distinctiveness. 36 In this appeal, the applicant’s submission centres on the use of “Caesar” as a name. More specifically, it contends that the PAR had erred in analysing the significance of the number of entities which include “Caesar” in their name as found in the ACRA Report.First, it submits that the PAR erred in considering whether the entities in question were “live” because the fact remains that a significant number of different entities shared the common element “Caesar”.Second, the applicant argues that even if only the “live” entities were to be taken into consideration, the PAR was wrong in concluding that the existence of 15 entities did not constitute a significant number. 37 First and foremost, it must be appreciated that a word may have several meanings of which only one carries the surname or personal name meaning. The word may also refer to a particular characteristic or quality or status. “Gold” refers to the precious metal. It is also a surname. Likewise, the word “Caesar” may be used in its surname signification,Julius Caesar, Gaius.It may also be used as a noun: Roman Emperor. Either way, the word may even serve as some form of desirable laudatory epithet (conjuring the power and image of the majesty of Rome and Roman Emperors) in a manner similar to the desirable image associated with the words “Imperial” or “Gold”. 38 Second, I am satisfied that the court is entitled to take judicial notice of the ACRA Report in ascertaining how commonly “Caesar” is used in business names. Judicial notice dispenses with the need for proof of facts that are clearly uncontroversial or beyond reasonable dispute: s 58 of the Evidence Act (Cap 97, 1997 Rev Ed);R v Find[2001] 1 SCR 863 at [48]. Section 59 of the Evidence Act sets out specific facts of which the court must take judicial notice. The usage of personal/corporate names is not a matter that falls within the categories laid out in s 59. But that is not the end of the matter. InZheng Yu Shan v Lian Beng Construction (1988) Pte Ltd[2009] 2 SLR(R) 587 (“Zheng Yu Shan”), V K Rajah JA (as he then was) held that it was not inconsistent with the relevant provisions of the Evidence Act or their underlying rationale to apply the common law doctrine of judicial notice in determining which matters outside the confines of ss 59(1) and 59(2) of the Evidence Act were judicially noticeable (at [24]).  As held inZheng Yu Shanat [27], there are two categories of facts of which judicial notice may be taken at common law: (a) facts which are so notorious or so clearly established that they are beyond the subject of reasonable dispute; and (b) facts which are capable of being immediately and accurately shown to exist by authoritative sources. 39 In my view, how commonly or rarely “Caesar” is used as a corporate name is a matter that falls within the ambit of the latter category. ACRA is the national regulator of business entities and one of its functions is “[t]o establish and administer a repository of documents and information relating to business entities and public accountants and to provide access to the public to such documents and information”.9Foot Note 9×https://www.acra.gov.sg/About_ACRA/What_We_Do/ (accessed 13 March 2016)It stands to reason that the records of ACRA would be an authoritative source of the names of business entities, past and present, and recourse may be had to the ACRA Report to find out how commonly “Caesar” is used in business names. 40 Returning to the present case, I do not see any reason to disturb the PAR’s findingsvis-à-visthe distinctiveness of the name “Caesar”. The question of whether a term is commonly used is only relevant to showing that consumers of the relevant goods are so accustomed to seeing that term in the market that they would pay more attention to other features of the mark: seeHai Tong Co (Pte) Ltd v Ventree Singapore Pte Ltdand another and another appeal[2013] 2 SLR 941(“Hai Tong”) at [48]–[49]. In particular, I agree with the PAR’s finding, at [41] of the PAR’s Grounds of Decision, that even if we were to accept the proposition, followingTaylor, that “Caesar” is a “personal name not uncommonly used in Singapore”, the CAESAR Mark was notso commonthat the CAESARSTONE Mark was entitled to cross a lower level of alteration to show that it is dissimilar to the opponent’s mark: seeTaylorat [54]. 41 First, there is no evidence that “Caesar” is a common or popular surname for individuals in Singapore. The CAESAR Mark comprises the word “Caesar” with a ligature between the “A” and “E”. Typographic ligatures are not commonly used in modern English. Such ligatures can be used to achieve a certain desired visual effect. The problem is that there is no evidence or submission as to how typographical ligatures and the word “Caesar” are perceived by the average Singaporean. That said, I accept that “Caesar” in this context is likely to be seen as a name and to embody a reference to the idea of a Roman emperor. 42 Moreover, even if one were to take into account all 45 of the entities reflected in the ACRA Report as including “Caesar” in their name, it would not render “Caesar” a name so common that the applicant is entitled to cross a lower level of alteration to show that its mark is dissimilar to the opponent’s earlier mark.First, there is no suggestion that the CAESAR Mark was improperly registered on the basis that it lacked distinctiveness, and there are no special rules or distinctiveness criteria applying to names. So the standard principles on distinctiveness apply.Second, I note that these 45 entities are spread out over many industries and this number is not especially significant when one compares it against the number of corporate entities that exist (or have at one point existed) across all industries in Singapore. There is no reason to disturb the PAR’s holding that the CAESAR Mark’s degree of distinctiveness was of a “medium” level, especially since the remark was made in the context of the backdrop against which the key issue of mark similarity was to be decided. (2) Acquired distinctiveness 43 For completeness, I observe that the PAR considered the following evidence tendered by the opponent in relation to acquired orde factodistinctiveness: (a) the opponent’s sales figures in Singapore for the years 2002 to 2007; (b) a list tendered by the opponent of its clients in Singapore; (c) the promotional efforts that some of the opponent’s clients have undertaken in relation to the opponent’s products; and (d) the opponent’s promotional figures worldwide. 44 As the CAESAR Mark was applied for on 21 November 2007, the PAR considered the evidence of its use prior to that date. She found that the evidence was plagued with problems (PAR’s Grounds of Decision at [29]-[32]). (a) The invoices tendered by the opponent to support its sales figures did not reflect the use of the CAESAR Mark, but rather “Ceramiche Caesar” as shown below:  (b) The opponent’s list of its supposed clients in Singapore was bare and did not support any sale of goods under the CAESAR Mark in Singapore. (c) There was no probative value in the documents that allegedly evidenced the promotional efforts that some of the opponent’s clients have undertaken. These clients were not included in the list of clients provided by the opponent, the source of those documents was not provided and their contents could not be verified. (d) The marketing materials tendered by the opponent did not reflect use of the CAESAR Mark, but either “Ceramiche Caesar” (as depicted above) or “Ceramiche Caesar La Cultura Della Materia” as follows:  Nevertheless, the PAR accorded some weight to these materials since “Caesar” remained the dominant component in the two images. 45 Finally, the extent to which the opponent’s promotional figures relate to Singapore was unclear. Despite according some weight to the marketing materials tendered by the opponent as tending to showde factodistinctiveness, the PAR ultimately stressed, at [34] of the PAR’s Grounds of Decision, that the opponent is relying on the inherent distinctiveness of the mark as opposed to any acquired distinctiveness. 46 In concluding this point, a brief summary may be helpful. I stress that the issue before me concerns opposition proceedings brought by the proprietor of an earlier (registered) trade mark. There is no attempt to revoke registration of the earlier trade mark on the grounds of lack of distinctiveness. In deciding these opposition proceedings, a key question is whether the applicant’s trade mark is similar to the earlier trade mark. It is in this context only that the relative degree of technical distinctiveness of the earlier trade mark is relevant. After considering the submissions, I find no reason to disagree with the PAR’s decision on this point, namely that the CAESAR trade mark enjoyed a “medium” level of distinctiveness. This then forms the backdrop for the following discussion on whether the applicant’s trade mark is similar to the opponent’s earlier trade mark. (3) Visual similarity 47 The marks share a common denominator, specifically the word “Caesar”. The nub of the dispute on visual similarity is whether the addition of the device and the word “stone” sufficiently distinguishes the CAESARSTONE Mark from the CAESAR Mark. 48 The PAR held that the additional elements were insufficient to distinguish the CAESARSTONE Mark from the CAESAR Mark. She took the view that the device (whilst fancy and distinctive) was only a small part of the CAESARSTONE Mark when it was viewed as a whole. Further, the PAR found that the word “stone” in the CAESARSTONE Mark was descriptive of the type of goods in question since Class 19, according to the Nice Classification, includes stone products. 49 The applicant submits that the PAR had erred in concluding that the marks were visually similar. Its reasons are as follows.First, the PAR had overlooked the significance of the fact that the CAESARSTONE Mark consists of a single word, which contains letters of equal size and prominence. The word “Caesar” is an inseparable part of the whole invented word “caesarstone” and hence the “Caesar” element should not be severed from the whole. Thus, the applicant argues that the words “Caesar” and “stone” should be evaluated as a combination because the unique combination of these words is not likely to be dismissed from the minds of the consumer.Second, the PAR also failed to consider the impact that the device added to the distinctiveness of the CAESARSTONE Mark as a whole. In the applicant’s view, the device constitutes a prominent component of the CAESARSTONE Mark given that: (a) the device is of a large size, being bigger than the font of the word element; (b) the device attracts attention with its deep gold colour and its smooth, curving strokes; (c) the device appears at the beginning of the CAESARSTONE Mark; and (d) the PAR agreed that the device is distinctive. 50 The opponent, on the other hand, contends that the PAR gave adequate weight to the other elements in the competing marks and was entitled to conclude that the word “Caesar” nonetheless dominates the impression of both marks.First, the opponent contends that the device used in the CAESARSTONE Mark, whilst distinctive, is not the kind of device that would draw significant attention away from the distinctive text in the mark. It does not represent any readily identifiable object and therefore does not evoke any particular concept for the average consumer.Second, the opponent contends that whilst “caesarstone” is a novel and invented word, the PAR was entitled to focus on the word “Caesar” and conclude that consumers are likely to focus on and remember that word. Consumers will note the presence of the word “stone” but they are unlikely to give it much attention or weight because of its descriptive significance in relation to Class 19 goods. A search on the Register of Trade Marks reveals several trade mark applications and registrations containing the word “stone” in Class 19, including “Craftstone”, “Alliedstone”, “The Stone Story” and “Cultured Stone”. In contrast, a search of “Caesar” only discloses two marks incorporating the word,viz., the two competing marks in the present dispute. 51 The starting point of the analysis is whether the common element of the competing marks is so dominant as to render the differing elements ineffective to obscure the similarity between them: seeThe Polo/Lauren Co, LP v Shop In Department Store Pte Ltd[2005] 4 SLR(R) 816at [26]-[27]. It bears recalling that the CAESARSTONE Mark is a composite of the device and the word “caesarstone” in lowercase. On the other hand, the CAESAR Mark consists of the word “CAESAR” in uppercase, encased within two dots, with a ligature between the letters “A” and “E”. 52 The requirement to assess each mark as a whole merits some further discussion in the context of composite marks. In such cases, whilst it is permissible to examine the constituent elements of the composite mark as a step in the analysis, it is rightly stressed that the mark must ultimately be assessed as a whole:Kerly’sLaw of Trade Marks and Trade Namesat para 8-072. 53 Where, however, all the other components are negligible, an assessment may be carried out solely on the basis of the dominant elements. It is, however, possible, as noted already, for a composite mark to not have any dominant feature. InFerreroSpA v Dochirnie Pidpryiemstvo \"Kondyterska Korporatsiia \"Roshen\"[2015] SGIPOS 14, for instance, it was held at [41]: Where both elements are equally dominant or significant in relation to each other, it will not be possible to compare just one of these elements (ie. \"ROCHER\") against the Applicants' ROSHEN Mark.In order for me to do so, the element \"ROCHER\" must be considered to be dominant relative to the other elements in the mark as a whole. Only then can \"special regard\" be paid to it in determining similarity.In the present case, the Opponents themselves do not draw this distinction between \"ROCHER\" and the other elements within the Opponents’ Word Mark, or any of the other Opponents’ Marks for that matter. In view of the foregoing, I find that there is no dominant component in the Opponents' Word Mark. [emphasis added] 54 Particularly, in relation to a composite mark consisting of a word and a device, there is no presumption that the word speaks louder. Whether words do “talk” or indeed “shout” will depend ultimately on whether the words are the dominant element in the particular case in question: seeHai Tongat [62]. 55 InHai Tong, the Court of Appealheld that the textual component of a composite mark or sign could, but will not necessarily or always, be the dominant component of the mark or sign. It will be helpful to take a closer look at the case, in which the relative significance of the device and word elements of the following composite mark was considered:  56 The Court of Appeal set out a non-exhaustive list of principles that apply when assessing the visual similarity of composite marks (at [62]). In doing so, the Court of Appeal recognised that the device component of a mark may be of equal significance as the text or dominant where: (i) the device is significant and large; (ii) the text is devoid of any distinctive character or purely descriptive of the device component; or (iii) the device component is complicated. However, such dominance or co-dominance would not be found in cases where: (a) the device is simple and will not evoke any particular concept for the average consumer; (b) the device is commonly used in relation to the goods or services claimed; or (c) the device is more likely to be perceived as a decorative element than as an element indicating commercial origin. 57 InHaiTong, the Court of Appeal found the rose device in the mark to be relatively insignificant for a few reasons (at [65]). First, the text was distinctive as the words “Lady Rose” conveyed no meaning and had no notional or allusive quality. The device, if anything, underscored the textual component by emphasising the “Rose” portion of “Lady Rose”. Second, the simple stylized rose did not draw any significant attention away from the text, and consumers would be far more likely to recall the text than the device. Moreover, the device was likely to be perceived as a decorative element as opposed to an indicator of origin. (A) The device 58 In this case, the PAR found that the device in the CAESARSTONE Mark is, on its own, quite fancy and could possibly be regarded as distinctive. However, little weight was ultimately accorded to the device as the PAR found that it constituted only a small part of the CAESARSTONE Mark. 59 I am, with respect, unable to agree with the PAR’s conclusion in this regard. Instead, I am of the view that the visual impact of the device should not be discounted as it is visually rather prominent. The device appears just at the beginning of the word “caesarstone”. It is not a small add-on, especially if one contrasts this device with the CAESAR Mark which contains two rather visually insignificant dots and a ligature. 60 Further, the device in the CAESARSTONE Mark is not in any way allusive or descriptive of the textual component of the mark or the goods in question. The opponent contends that the device does not represent any readily identifiable object and, consequently, the average consumer is unlikely to give it much attention. I cannot accept this contention. In fact, the converse may well be true.The more meaningless a sign, the greater may be its inherent capacity to distinguish the goods and services of one undertaking from those of other undertakings. In other words, a sign would possess greater inherent distinctiveness when it is neither descriptive of the characteristics of the goods or services,norgeneric in the language or established practices of the trade. Indeed, it has been noted that fancy words such as “Kodak”, “Pepsi”, “Canon”, “Volvo” and “Nutella”, which do not convey any meaning at all, inherently possess a distinctive character in the sense that they  are  capable of distinguishing the goods or services of a trader from those of another trader:Tan Tee Jimat para 3.019. This is further supported by the Court of Appeal’s comments inStaywellat [24] that: …Distinctiveness can be inherent, usually where the words comprising the mark are meaningless and can say nothing about the goods or services; or acquired, where words that do have a meaning and might well say something about the good or services, yet come to acquire the capacity to act as a badge of origin through long-standing or widespread use. [emphasis added in bold italics] (B) The word “stone” 61 Where textual components are concerned, although it has been said that consumers pay more attention to the existence of a common prefix in the marks being compared, it is generally more important to have regard to the nature of such a prefix: Christopher Morcom, Ashley Roughton and & Thomas St Quintin,The Modern Law of Trade Marks(LexisNexis, 4th Ed, 2012) at para 6.56. It has been said that consumers are likely to take greater notice of a word placed at the beginning of a sign, and that the first part of the mark tends to have a greater visual impact than the final part:Beyond Retro Ltd v Office for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)(T-170/12)[2014] ETMR 54 at [31]. This principle though is not absolute. Ultimately, the mark similarity analysis turns on the nature of the prefix/suffix and the facts of each case. The presence of a common descriptive prefix will not necessarily demonstrate sufficient similarity: see, for example,Madaus AG vOffice for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM), Optima Healthcare Ltd(T-202/04) [2006] ETMR 76. In essence, to avoid a finding of similarity, the differences between the marks must be sufficient so that the later mark does not capture the distinctiveness of the registered mark:Ozone Community Corp v Advance Magazine PublishersInc[2010] 2 SLR 459 (“Ozone Community”)at [43]-[47]. 62 It is also useful to note that the average consumer perceives the mark as a whole and does notnecessarilyanalyse (in the sense of dissection)its various details. InWilliam Bailey’s Application[1935] 52 RPC 136 at 151–152, Farwell J remarked: I do not think it is right to take part of the word and compare it with a part of the other word; one word must be considered as a whole and compared with the other word as a whole. In my judgment, it is quite wrong to take a portion of the word and say that, because that portion of the word differs from the corresponding portion of the word in the other case, there is no sufficient similarity to cause confusion. There may be two words which in their component parts are widely different but which, when read or spoken together, do represent something which is so similar as to lead inevitably to confusion. 63 In the same tenor, it was stated in the opinion of Advocate-General Trstenjak (dated 8 November 2008) inEurohypo AG vOffice for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)(C-304/06 P)[2008] ECR I-03297, at [34]: It should also be borne in mind that, as regards a trade mark comprising words, the possible distinctiveness of each of its terms or elements, taken separately, may be assessed, in part, but must, in any event, depend on an appraisal of the whole which they comprise. Indeed, the mere fact that each of those elements, considered separately, is devoid of any distinctive character does not mean that their combination cannot present a distinctive character. 64 Returning to the case at hand, I agree with the applicant that “caesarstone” should be examined as a single word as opposed to its constituent components, namely “Caesar” and “stone”. I note first that the word “caesarstone” is presented as a single word, containing letters of equal size and prominence. Further, the word “caesarstone” is noticeably longer than “Caesar” and the visual impact of the added length is clear. InOzone Community, the GLAMOUR mark was compared with the HYSTERIC GLAMOUR mark. One of the noteworthy visual differences was the length of the marks: GLAMOUR had seven letters whilst HYSTERIC GLAMOUR had 15 (Ozone Communityat [53]). 65 Further, I add that whilst the word “stone” on its own may be descriptive of the goods in Class 19 of the Nice Classification, the single word “caesarstone” is not a familiar expression that alludes to or designates the essential characteristics of the type of products falling within the Class. Given the unique juxtaposition of the constituent words, the word “caesarstone” is distinctiveas a whole. It logically follows that the significance of the word “stone” should not be disregarded for the purposes of assessing visual similarity as it plays an essential part in the overall impression conveyed by the CAESARSTONE Mark.  Again, in the words of Harman LJ, “it is not right to pull the words to pieces, ACCU- for one part and -IST and -LARM for the other part, next to argue that ACCU reminds you of ‘accurate’, no matter what the suffix, and to conclude that the upshot will be a monopoly in the natural word”:Accutron[1966] RPC 152 at 158. 66 To conclude this discussion, I am of the view that the PAR erred in her conclusion that the marks are on the whole more visually similar than dissimilar. I am instead of the view that the marks, when evaluated in their entirety, are visually dissimilar. (4) Aural similarity 67 There are two approaches that could be taken in respect of aural similarity: one approach is to consider the dominant component of the mark and the other is to undertake a quantitative assessment as to whether the competing marks have more syllables in common than not (Staywellat [31] and [32]). Applying these approaches, the PAR found that there was some aural similarity between the marks (PAR’s Grounds of Decision at [53]). (a) The CAESAR Mark consists of two syllables (ie, “Cae-sar”) while the CAESARSTONE Mark consists of three syllables (i.e., “Cae-sar-stone”). (b) The attention of the consumers will be directed at the first two syllables of the marks (ie, “Cae-sar”, the dominant component of the marks). 68 The applicant submits that the PAR had erred in finding that there was aural similarity between the competing marks on the basis of the common “Caesar” and by disregarding the additional characters in the CAESARSTONE Mark. In its view, there is no reason why consumers would choose to disregard the word “stone” in the CAESARSTONE Mark. To this end, the applicant draws a distinction between the marks at hand and the observation inHan’s (F & B) Pte Ltd v Gusttimo World Pte Ltd[2015] 2 SLR 825 that the average consumer is unlikely to make constant reference to the “seven syllable ‘HAN Cuisine of Naniwa’ phrase every time he refers to it” (at [137]). 69 The opponent submits that the competing marks are aurally similar because the competing marks have more syllables in common than not. Moreover, it is the dominant component of the marks that constitutes the common syllables. The different syllable (ie, “stone”) may simply be perceived as a description of the product. The conclusion is reinforced by considering that the first two syllables “Cae-sar” are likely to be emphasised by the average Singaporean consumer. Further, the device is unlikely to have any aural significance and consumers are unlikely to refer to it when verbalising the CAESARSTONE Mark. 70  The CAESAR Mark consists of two syllables (ie, “Cae-sar”) while the CAESARSTONE Mark consists of three syllables (ie, “Cae-sar-stone”). It may well be said that even if the word “Caesarstone” is pronounced in full, the two competing marks would still have more syllables in common than not. The device components of the two marks are of course irrelevant when making an aural comparison. 71 In my view, however, this is not a case where a forensic dissection of the length of the words and the number of syllables provides much assistance. “Caesar”, it will be recalled, carries a surname meaning and/or reference to the Roman emperors. “Caesar” is not an invented word. Whilst it may not be a common surname, it appears that the parties accept that Singaporeans will be aware of its use as a name. “Caesarstone”, on the other hand, is not a surname or name. Indeed,prima facie, it does not have any meaning at all although, as will be seen, it has been suggested that it may evoke the image of stonemasonry. Either way, for the purpose of assessing aural similarity, the Court of Appeal inStaywellheld at [35] that aural analysis involved the utterance of syllables without exploring the composite meaning embodied by the words. 72 The PAR’s finding was that there was “some aural similarity” between the competing marks. On balance, and bearing in mind aural similarity is determined without reference to the meaning of the words, I agree that there is some aural similarity.  I would add, however, that the similarity lies toward the lower end of the spectrum. (5) Conceptual similarity 73 In considering whether there is conceptual similarity, the inquiry is directed at the ideas which lie behind or inform the marks or signs in question. The PAR found that the CAESAR Mark, comprising the sole word “Caesar” would be commonly understood to refer to the Roman general, Gaius Julius Caesar. The word might thus convey the idea of supremacy, power and authority (PAR’s Grounds of Decision at [56]). 74 On the other hand, the PAR found that the device in the CAESARSTONE Mark did not convey any particular idea. In respect of the word component in the CAESARSTONE Mark, the PAR similarly took the view that the word “Caesar” would be understood to refer to the Roman general, and might similarly convey the idea of supremacy, power and authority. However, she held that the addition of the word “stone” colours the CAESARSTONE Mark to the effect of referring to the style of masonry practiced during the reign of Julius Caesar (PAR’s Grounds of Decision at [57]). 75 To this, I would add that the CAESAR trade mark, from a visual perspective, is minimalist in its design, comprising a single word placed between small diamond dots and with a ligature between the A and E. On the other hand, the CAESARSTONE trade mark is more visually complex. The word is longer and there is a prominent device placed at the beginning of the word that cannot help but catch the eye. 76 The applicant submits that the PAR had erred in her finding that the marks were conceptually similar to a small degree.First, the applicant argues that “Caesar” not only refers to Julius Caesar, but also to the ancient city of Caesarea, the birthplace of the applicant in Israel. The addition of the word “stone” further evokes the image of stonemasonry of a venerable, age-old heritage (“the Stonemasonry Image”) which is far removed from the concept of Julius Caesar.Second, the applicant argues that the PAR failed to consider the significance of the device and font in the context of the Stonemasonry Image. The deep gold colour of the device, coupled with its smooth curves and strokes, adds the ideas of prestige, class and refinement to the applicant’s mark in line with the Stonemasonry Image. The effect is further heightened by the smooth, flowing and uniform nature of the font. Thus when the CAESARSTONE Mark is considered as a whole, the image which emerges is that of Israeli stonemasonry of class and refinement, which is part of a well-established and historic heritage. This concept is entirely different from that of a Roman emperor. 77 Whether or not the Singaporean customer will associate the device with the Stonemasonry Image, in respect of which there is no evidence, it is clear the device is prominently placed in close association with the word. In my view, the device cannot be seen as mere decoration. 78 The opponent agrees with the PAR that the marks are conceptually similar, but submits that the degree of similarity is higher than what the PAR held to exist.  In particular, the opponent submits it is unlikely that the image of “Israeli stonemasonry of a venerable, age-old heritage” would be created from the combination of the words “Caesar” and “stone”. To begin with, the word in the mark is not “Caesarea”. Further, it is unlikely that the average consumer of Class 19 goods in Singapore would be familiar with a city in Israel that is not particularly prominent. Moreover, since the actual word used, “Caesar”, has a more well-known association with Julius Caesar, the average consumer is unlikely to search for a more obscure meaning behind the mark. In any case, even if the smooth curves and strokes of the device evoke the idea of prestige, class and refinement, the applicant submits that this is consistent with the idea behind the name “Caesar”, which is also associated with the upper echelons of society. 79 In my view, there is little conceptual similarity between the CAESARSTONE Mark and the CAESAR Mark. It may be that the dominant idea underpinning the CAESAR Mark is that of the Roman statesman Julius Caesar. I do not think that the same idea underlies the CAESARSTONE Mark. I would, however, hesitate to find that the average consumer would associate the CAESARSTONE Mark with Caesarea, the Israeli city. In determining whether there is similarity in the underlying concepts, it is not helpful to over analyse or to focus on subtle nuances. The word “caesarstone” together with the device element is a relatively complex composite trade mark that does not offer a clear concept. Even if this is wrong and the CAESARSTONE Mark evokes the image or idea of stonemasonry, this is a concept which sets it apart from the idea of power, supremacy and authority emanating from a Roman imperial statesman. From a different perspective, the CAESAR Mark is minimalist in its design as compared to the design of the CAESARSTONE Mark which is more complex. Accordingly in my view there is little if any conceptual similarity between the marks. 80 To conclude briefly, I find that the competing marks are visually dissimilar. There is some aural similarity. There is little or no conceptual similarity. Bearing in mind that similarity/dissimilarity is a matter of degree, I am of the view that the marks when examined in their totality, are dissimilar. This is enough to dispose of the matter in favour of the applicant. Nevertheless, in the event that the matter is taken further and I am wrong on the question of similarity, I turn now to consider whether there is a likelihood of confusion arising from the similarity of goods and marks.",
        "Third element: likelihood of confusion": "81 The PAR found the evidence submitted by the opponent in relation to local sales and promotion to be problematic, and did not accord these much weight. She also noted that the opponents thus resorted to relying on the inherent distinctiveness of the CAESAR Mark. 82 The PAR went on to identify the relevant target audience for the products and their normal mode of purchase. In this regard, the PAR held that when a consumer views both marks together, they are likely to believe that the marks either come from the same source or are economically linked. This was premised on her view that the average consumer would focus on the “Caesar” component of the CAESARSTONE Mark, and the consumer’s impression of the marks would be that they are both “Caesar” marks. 83 In this appeal, the applicant submits that the PAR erred in concluding that consumers would assume that the applicant’s products are connected with the opponent’s business. To this end, the applicant urges the court to take into account the following factors in assessing the likelihood of confusion. (a)Mode of purchase and the nature of goods: According to the applicant, given that consumers often consult designers when purchasing its goods, they would receive in-depth advice as to the source of the goods.10Foot Note 10×Bundle of Documents (Vol II), pp 346–347 at [7].Further, the applicant argues that the goods in question fall into a category where considerable time and effort, as well as a high degree of care, would be taken by consumers in the purchase process. (b)Distinctiveness of the CAESARSTONE Mark: Even with an imperfect recollection, consumers would easily be able to differentiate the applicant’s goods from the opponent’s goods. (c)Co-existence of the competing marks in the United States: The applicant contends that the PAR erred in failing to accord due weight to the co-existence of the competing marks for over 15 years in the United States. The CAESAR Mark was registered there in 199711Foot Note 11×Bundle of Documents (Vol II), p 52.whereas the CAESARSTONE mark was registered in 1999.12Foot Note 12×Bundle of Documents (Vol IV), p 903.The applicant submits that the fact that not a single instance of actual confusion has arisen despite the years of co-existence, as well as the lack of evidence to suggest a likelihood of confusion shows that there is no likelihood of confusion. 84 The opponent, on the other hand, asks the court to affirm the PAR’s finding that there was a likelihood of confusion and its arguments are as follows. (a) First, the opponent submits that the CAESAR Mark is likely to have enjoyed a greater reputation than the CAESARSTONE Mark at the relevant date. Consequently, the average consumer seeing the CAESARSTONE Mark would think that it denotes goods of the opponent. Taking into account the possibility of imperfect recollection, the consumer would remember both marks as “Caesar” marks given theineffectiveness of the device and the suffix “stone’ to distinguish the marks. (b) Further, the opponent submits that the consumer would focus on the dominant “Caesar” component of both marks and would recall them as Caesar marks; he or she is thus likely to believe that the marks either come from the same source or economically linked sources. According to the opponent, the confusion will not be dispelled even if the consumer is given the chance to see the products and discuss the matter with professionals before buying the product. Moreover, the opponent contends that the relevant goods are likely to command a lesser degree of attention from the consumer who is likely to be unfamiliar with the different brands and traders in the market. (c) Finally, the opponent stresses that actual confusion need not be shown for the court to find a likelihood of confusion. There may be many reasons why the parties have not adduced evidence of actual confusion. Consumers may not have appreciated that confusion had taken place and, even if they did, they may not have brought it to the parties’ attention. Further, the nature of the parties’ businesses was different. The applicant’s core business is the sale of Class 20 goods, which are not in competition with or substitutable for the opponent’s Class 19 goods. As a result, the lack of evidence of actual confusion in relation to Class 19 goods is not significant. In this regard, the opponent highlights that the confusion is likely to arise between the parties’ Class 19 goods, which does not affect the applicant’s ability to use its marks on goods in Class 20. Decision (1) Date of assessment 85 A preliminary question arose as to the relevant date for determining the likelihood of confusion or deception. As at the date of hearing of this appeal, almost eight years had elapsed since the application of the CAESARSTONE Mark was first lodged on 21 November 2007. The delay was a result of the opposition proceedings, which took two to three years before it was finally heard, and the greater leeway in terms of timelines given by IPOS as the parties were in negotiations. 86 There was some evidence before the PAR that the applicant had managed to develop a considerable business starting in 2007. The applicant asserted sales of $362,000 in 2007 which increased to S$4.9m in 2011. The applicant also claimed to have spent significant sums promoting its goods and trade mark. This included $79,300 in 2009 and $544,050 in 2013. These figures were relied on by the applicant to show that it managed to develop a reputation in Singapore for its own CAESARSTONE Mark by the time the opposition proceedings were finally heard. 87 In the proceedings below, the PAR rejected the applicant’s evidence as to its sales and promotional figures on the basis that all the figures pertained to events after the relevant date of 21 November 2007 (apart from the sales figures for 2007). She took the view that where the mark “is used onlyafterthe relevant date in the local context, then there is no reputation in this regard when considering the likelihood of confusion since the relevant date for the purposes of analysis is 21 November 2007” (PAR’s Grounds of Decision at [75]). I note also the PAR’s comments at [76] on the inadequacy of the evidence submitted to support the figures. For example, the invoices, bills of lading and other documents tendered to support the applicant’s sales figure did not demonstrate the sale of goods bearing the CAESARSTONE Mark. The PAR also noted that the marketing material appeared to be mainly directed at Class 20 goods, namely kitchen work tops. 88 In this appeal, the applicant contends that the PAR had erred in rejecting its sales and promotional evidence. To this end, it argues that the court should not shut its mind to the state of play as it exists today especially since the case took eight years to come to hearing. In particular, the applicant also cites as example survey evidence which is clearly post-application date. It appears that the applicant’s position is that by the time the opposition proceedings were actually heard by the PAR in 2015, the sales and promotional efforts of the applicant had generated a reputation within the public in Singapore. In light of this reputation, the likelihood of confusion, if any, was much reduced. 89 The judicial authorities appear to take the view that the court may take into account, in appropriate cases, matters arising after the date of the application to register the mark in question. The first case on which the applicant relies isCampomar SL v Nike International Ltd[2011] 2 SLR 846 (“Nike”) in which the Court of Appeal held that the appropriate moment to determine the existence of an “earlier trade mark” for the purpose of s 8(1) read with s 2(1) of the TMA is the date when the mark was to be entered on the register, and not the date of the registration application. In the court’s view, it is sensible, pragmatic and realistic to take into account events which occurred between the date of application for registration and the date on which the decision on the registration application was made (at [18]-[40]). 90 In that case, Campomar, a Spanish company, had registered the NIKE mark in Class 3, which includes perfumeryetc,on 30 December 1989 with the registration taking effect as from 2 April 1986. Subsequently, on 20 November 2001, Nike applied to register its mark in Class 3. Campomar opposed Nike’s application based on its earlier mark. Nike applied on 21 January 2002 to revoke Campomar registration on the basis of five years of non-use. Nike’s application was held in abeyance until after determination of the application to revoke the Campomar registration for non-use. 91 The Campomar registration was eventually revoked, but only after an appeal to the Court of Appeal. Following the revocation of the Campomar registration, Nike’s application to register its mark in Class 3 resumed. Campomar filed a notice of opposition against Nike’s application on the basis that its rights only ceased from the date of the revocation application (that is, 21 January 2002) and its mark was alive and well on 20 November 2001, the date on which Nike applied for registration in Class 3. 92 The PAR held that the relevant date to consider if there was an earlier trade mark was the date on which the Registrar decides if the later mark could be registered: in this case, the hearing of the opposition proceedings. The hearing date was 16 September 2009. At that date, Campomar’s mark was no longer a registered mark and could no longer be regarded as an earlier trade mark for opposition purposes. 93 The High Court affirmed the decision of the PAR. On further appeal, the Court of Appeal agreed that the PAR in considering opposition to an application for registration of a mark, should view the matter as at the date of the hearing of the opposition, instead of the date of the registration application. The appeal was, however, allowed because permitting the registration would lead to the existence of two similar or identical marks, belonging to different parties, on the register for a period of two months. 94 The problem was that under the TMA, a mark accepted for registration takes effect from the date of application. This was 20 November 2001 for Nike’s mark. The revocation of Campomar’s mark, on the other hand, only took effect from 21 January 2002. The result was that, for a short two-month period, Campomar’s mark and Nike’s mark would both be validly on the register in the same Class if Nike’s application was allowed. At the date of the hearing before the PAR, the Campomar’s mark was validly in the register up to 21 January 2002. The effective date of registration of the Nike International mark was 20 November 2001. On this basis and to this extent, the Court of Appeal held that permitting registration of Nike’s mark would run counter to the TMA. Nike should have requested that the earlier Campomar’s mark be revoked retrospectively to a date which preceded the date of its own application under s 22(7)(b) of the TMA. 95Nikewas concerned with the date at which the determination was to be made as to whether there was an earlier registered trade mark. The case did not expressly deal with the question of whether the development of a reputation in the market after the date of application is relevant in countering opposition by an earlier trade mark. 96 The applicant also referred toTiffany & Co v Fabriques de Tabac Reunies SA[1999] 2 SLR(R) 541 (“Tiffany”), an earlier Court of Appeal decision which was cited with approval inNike. The case was decided under the Trade Marks Act (Cap 332, 1999 Rev Ed) (“TMA 1999”). In 1989, the respondent had applied to register the mark “Tiffany” in respect of cigarettes in Singapore. The appellant filed their opposition on 23 December 1991. On 11 November 1997, the appellant’s opposition was overruled and the mark was registered. The decision was affirmed by the High Court but reversed on further appeal. The appellant opposed the respondent’s trade mark application on the basis of s 15 of the TMA 1999 which provided: It shall not be lawful to register as a trade mark or part of a trade mark any matter the use of which would, by reason its being likely todeceive or cause confusionor otherwise, be disentitled to protection in a court of justice or would be contrary to law or morality, or any scandalous design. [emphasis added in bold italics] 97 The Court of Appeal opined that the appropriate time to consider if the public is likely to be confused by an applicant’s mark is the time at which the opposition proceedings were heard. The court held that since the purpose of s 15 was the protection of the public from deceptive and confusing marks, if the mark was confusing at the date of the decision to register, registration should be refused. By November 1997, when the decision to register the mark was made, the appellant had built up a reputation in the goods in question. Thus, the likelihood of confusion and deception was significantly stronger at the date of registration than at the time of application in November 1989. In any case, inTiffany, nothing turned on the choice between the application date and the registration date because it was decided that there was a likelihood of deception or confusion between the marks on the earlier date. The Court of Appeal also commented that whether or not a court should take into account facts occurring after the date of application had to depend on each unique set of facts, and the court had to be aware of the realities of the situation at the date that the opposition proceedings were heard (at [57]). 98 It bears noting thatTiffanywas decided under different statutory provisions under the TMA 1999. The case also concerned post-application evidence whichincreasedthe likelihood of confusion and deception. The question before me is different: whether the likelihood of confusion, if any, may bereduced or avoidedby the fact that theapplicant’s markhas built up a reputation since the date of the application for its registration. In other words, whilst the court may have regard to evidence that theopponent’smarkhas developed a reputation post-dating the application dateto support a findingthat there is a likelihood of confusion, it is unclear if the converse may be done. 99 There are conflicting academic views on whether events post-dating the registration application may be taken into account. InKerly’sLaw of Trade Marks and Trade Namesat para 9-103, the learned authors suggest that it may also be proper to take into account events which occur between the date of the application and the date of the final decision “if it means that the objection falls away; for example, the specification of goods or services of the earlier mark may be limited, the earlier mark may be cancelled or it may be assigned to the applicant”. It is unclear, however, what the learned authors mean when they refer to the objection “falling away”. The examples given concern cases where the objection is cured and rendered nugatory, such as by the amendment of the specification of the goods or services in the earlier mark or by acquiring or successfully attacking the earlier trade mark that is relied upon. It does not necessarily support the position that post-application use and promotion of the applicant’s trade mark can be relied upon to negate any risk of confusion. 100 Conversely, it has been suggested that the likelihood of confusion must be assessed as at the date of application. InTan Tee Jimat para 12.030, a distinction is drawn between opposition and infringement proceedings. For the purposes of opposition proceedings under ss 8(2) and 8(3) of the TMA, it is said that the likelihood of confusion is to be determined as at the application date. By contrast, infringement proceedings under ss 27(2) and (3) of the TMA are said to require the likelihood of confusion to be determined as at the time when the alleged infringing use commenced. 101 As discussed above, two different views have been espoused in judicial and academic authorities. On one view, the relevant date on which the likelihood of confusion should be assessed in opposition proceedings is the date of the application of the later mark. Evidence post-dating the application for registration may be adduced, but only in so far as it casts light on the state of affairs at the date of the application. The other view, said to be supported by theTiffanyandNikecases, is that the relevant date on which the likelihood of confusion should be assessed is the date of the opposition proceedings. 102 It will be useful to return to the words of the provision itself. For ease of reference, I have set out s 8(2)(b) of the TMA again: (2)  A trade mark shall not be registered if because — (a) … (b) it is similar to an earlier trade mark and is to be registered for goods or services identical with or similar to those for which the earlier trade mark is protected, there exists a likelihood of confusion on the part of the public. 103 The provision does not stipulate the relevant time at which the likelihood of confusion is to be assessed. What is clear, however, is that the provision does not confine the date of assessment to the date of the application. 104 Furthermore, it is clear that the reputation of the earlier trade mark is just one factor in deciding the likelihood of confusion. The approach is not reputation and therefore confusion. It does not always follow that the stronger the reputation enjoyed by the opponent’s mark, the greater the risk of confusion: see, for example,McDonald’s Corp v Future Enterprises Pte Ltd[2005] 1 SLR (R) 177. So even if it is proper to take account of developments in the reputation of the applicant’s mark between the application and the hearing, this is at best just one factor to be assessed in the round. 105 In any case, I have taken the view that there is no likelihood of confusion whether the date of the application or date of the opposition hearing is used as the basis for assessment in this case. In the circumstances, it is not necessary to make a conclusive determination on this point. I would, however, venture to observe that the applicant has gone on to establish itself in the market. It has achieved substantial sales in Singapore since 2007 as reflected in the following table:   Applicant’s Sales Figures in SingaporeYearAmount (in SGD)13Foot Note 13×PAR’s Grounds of Decision, para 73.2007362,00020082,000,00020092,300,00020103,700,00020114,900,0002012 (till August)1,600,000 (2) Likelihood of confusion 106 Broadly speaking, the question is whether there is a real likelihood that a substantial portion of the relevant public would be confused as to the trade origin of the goods or services under the marks. This requires the analysis of (a) how similar the marks are; (b) how similar the goods or services are; and (c) given the foregoing, how likely it is that the relevant segment of the public will be confused? 107 InHai Tong, the Court of Appeal said, at [85(c)]: Having regard to the express terms of s 27(2), there are three specific elements that plainly must be considered. These are: (i) the similarity between the registered mark and the allegedly infringing mark; (ii) the similarity or identity between the goods or services in relation to which the marks are used; and (iii) the relevant segment of the public in relation to whom the court must consider the likelihood of confusion. Each of these elements can vary. The marks may be identical or similar, and if the latter, they can vary in their degree of similarity. In the same way, the goods or services in relation to which the marks are used may be identical or similar, and again, if the latter, they may vary in the degree or extent to which they are similar. … And as to the relevant segment of the public, there may be characteristics that are particular to the group in question.Each of these factors will have a bearing on the likelihood of confusion.As an illustrative proposition,the likelihood of confusion must be greater where, say, the contesting marks are similar to a high degree, the goods are identical in nature and the segment of the public in question is undistinguished in its attentionthan would be the case if the marks and the goods are somewhat similar but not exceedingly so, and the relevant segment of the public happens to be highly knowledgeable and very fastidious. … [emphasis added] 108 There are two aspects to the element of confusion: thefirstis where the relevant public think that the goods or services bearing the later mark are those of the earlier trade mark proprietor. Thesecondis where the relevant segment of the public are led to think that the proprietor or user of later mark is an economically linked entity such as a licensee:Sarika Connoisseur Café Pte Ltd v Ferrero SpA[2013] 1 SLR 531 at [63];Staywellat [74]. 109 Whilst confusion includes the drawing of an economic link between the marks, a mere association between the marks is notin itselfa sufficient basis for concluding that there is a likelihood of confusion. It is insufficient that the relevant segment of the public would recognise or recollect similarities between the contesting marks if there is no likelihood of confusion as to origin ensuing (Hai Tongat [75]). What is required is the likelihood of confusion above ade minimislevel (Hai Tongat [78(e)]). 110 In making this assessment, the PAR is entitled to take certain extraneous factors into account to the extent that they inform the court as to how these similarities will likely affect the consumer’s perception as to the source of goods. These are (Staywellat [95]-[96]): (a) Factors that affect the impact of mark similarity on the consumer: the degree of similarity of the marks themselves, the reputation of the marks, the impression given by the marks and the possibility of imperfect recollection. (b) Factors that affect the impact of goods similarity on the consumer: these include the normal way in or the circumstances under which consumers would purchase goods of that type, the nature of the goods and whether they would tend to command a greater or lesser degree of attention on the part of the purchaser, and the likely characteristics of the relevant consumer. 111 Further, I am mindful that in opposition proceedings, it would generally not be relevant to consider extraneous factors that relate to the actual and particular circumstances and ways in which each competing mark is used on the goods or services in question.First, the question of whether there is a likelihood of confusion must take into account the full range of the competing monopoly rights that are already enjoyed on the one hand, namely the actual and notional fair uses to which the incumbent proprietor has or might fairly put his registered trade mark, and compare this against the full range of such rights sought by the applicant by reference to any actual use by the applicant (assuming there has been prior use) as well as notional fair uses to which the applicant may put his mark should registration be granted (Staywellat [60]).Second, factors which are not inherent in the goods but are susceptible to changes that can be made by the trader from time to time are impermissible considerations. These include pricing differentials, packaging and other superficial marketing choices made by the trader (Staywellat [95]). 112 I note preliminarily that there is no evidence of actual confusion between the goods of the applicant and those of the opponent. Evidence of actual confusion is not, however, a pre-requisite. The court is entitled to consider whether the average consumer with characteristics reflective of the relevant section of the public is likely to be confused:Novelty Pte Ltd v Amanresorts Ltd and another[2009] 3 SLR(R) 216 (“Amanresorts”)at [80]. With this in mind, I turn to consider whether the average consumer of Class 19 goods is likely to be confused. (A) Nature of goods 113 Class 19 of the Nice Classification covers: Building materials (non-metallic); non-metallic rigid pipes for building; asphalt, pitch and bitumen; non-metallic transportable buildings; monuments, not of metal 114 The actual specification of the CAESAR Mark covered: Non-metallic building materials, especially tiles for covering, floor coverings, tiles for gutters, cove moldings, corner beads not of metal, protruding wedges, stilted modular floors, special parts for finishing, stair treads. 115 When considering the nature of the goods/services, the inquiry is not limited to those specified in the registration. This is because the registered proprietor acquires the exclusive right to use the mark not only for the goods or services which he actually contemplated at the time registration was granted, but for the whole spectrum of goods or services within the specification for which the trade mark is registered. InStaywell, the Court of Appeal underscored, at [58], the fact that under s 26 of the TMA, registration confers the exclusive right on the proprietor to use the mark in relation to the goods or services for which the mark is registered. The proprietor also acquires immunity from infringement in his use of the mark in respect of all goods and services falling under the registered specification by virtue of s 28(3) of the TMA. That is why the Court of Appeal went on to stress, at [59], that a party who applies for registration of a mark is seeking to establish a monopoly over the right to use that mark for the immediately intended purpose as well as for a penumbra of notional fair uses. 116 It is useful to bear in mind that the average consumer's level of attention is likely to vary according to the nature of goods or services in question. As was said inReed Executive Plc v Reed Business InformationLtd[2003] RPC 12 at [103], “a 50 pence purchase in the station kiosk will involve different considerations from a once-in-a-lifetime expenditure of 50,000 pounds”. In the same tenor, the Court of First Instance inDevinlec Developpement Innovation Leclerc SA vOffice for Harmonisation in the Internal Market (Trade Marks and Designs) (OHIM)(T-147/03) [2006] ECR II-11 noted at [63] that: However, in the case of goods such as those covered by the marks in question here, which are not purchased regularly and are generally bought through a salesperson, the average consumer’s level of attention, as the Board of Appeal rightly found, must be taken to be higher than usual and therefore fairly high. 117 Thus, where the cost of product is high or where the services are of considerable importance, it has been held that consumers will tend to make a relatively thorough inquiry before going through with the transaction:Ta'Am Teva (1988) Tivoli Ltd v Ambrosia Supaherb Ltd[2004] ETMR 46 at [13]. Hence, the likelihood of mistake is smaller. 118 I find the above remarks highly pertinent to the present case. Whilst purchases of Class 19 goods for decoration of homes or commercial establishments may not rise to the importance and significance of “once-in-a-life” expenditures, I am of the view that the average consumer is likely to pay close attention to the purchase and this will help obviate or at least reduce the risk of any confusion between the competing marks. In this regard, I agree with the applicant’s submission that the purchase of Class 19 goods for renovation and interior decoration is likely to be an intensely personal and relatively expensive endeavour with long-term consequences.14Foot Note 14×See Applicant’s Written Submissions at [15.11.1].Once a consumer chooses the tiles for his house, he will have to live with it for a significant period of time. It is probable that the purchase will not be made lightly, and consumers would be fastidious in selecting the brand of goods which they wish to purchase. On top of that, it is highly likely that consumers will be aided by specialists ranging from professional sale staff to interior designers in the purchasing process.15Foot Note 15×Bundle of Documents (Vol II), pp 346–347 at [7].To this end, I note that the applicant asserts that the target market of the goods sold under the CAESARSTONE Mark comprises professional buyers, including fabricators, architects, and designers, and end-consumers. The goods are said to be costly, and unlikely to be purchased on a whim by end-consumers. Whilst the evidence on this could have been stronger, I agree with the tenor of these submissions.16Foot Note 16×Bundle of Documents (Vol II), pp 346–347 at [7]. 119 I shall also address briefly the opponent’s claim that the inference that consumers would pay a high degree of care and attention to the trade origin is unwarranted. To this end, the opponent claims that consumers of Class 19 goods would probably focus more on the attributes of the goods themselves, such as colour, finish and style, rather than on branding or trade source. This argument, in my view, misses the point. If it is indeed the case that consumers merrily purchase Class 19 goods without paying attention to what trade mark is attached to those goods, there can be no confusion as to their trade origin, which is precisely what the trade mark regime aims to protect. 120 For the above reasons, I am of the view that the nature of the goods goes towards reducing the likelihood of confusion, if there was any in the first place. (B) Mode of purchase 121 Likewise, I am of the view that the mode of purchase tends towards a lower likelihood of confusion. I note the applicant’s contention that the relevant segment of the public that should be the focus of this inquiry is specialists such as architects or designers. Nevertheless, even assuming the relevant view point is that of specialists, there is no evidence before me that indicates whether the aforesaid specialists could find themselves confused as to the origin of the goods supplied by the applicant and the opponent. That said, this is a relevant and material factor to be considered in the overall assessment of the likelihood of confusion since it would not at all be surprising if a large proportion of consumers would consult specialists when purchasing Class 19 goods.17Foot Note 17×Bundle of Documents (Vol II), pp 346–347 at [7]. 122 The opponent also made much of the fact that the applicant was seeking to register the CAESARSTONE Mark in Class 19. It was asserted that, within Singapore, numerous design houses and building material suppliers supply both brands. This was said to amplify the risk of confusion. I do not agree. The applicant is fully entitled to enter the market for Class 19 goods. It is not surprising at all that a supplier of building materials will stock goods from both the applicant and the opponent. If the goods under their respective brands are displayed side by side, in close proximity or on the same supplier’s webpage, it will surely be easier even for the end-user to see the differences in the trade marks. (C) Similarity of marks 123 I have found earlier that the marks are more dissimilar than similar on the whole. Whilst there is some aural similarity between the marks, I am not inclined to give much weight to this aspect of similarity since it is more likely that the average consumer will have occasion to view the marks during the purchase process and the visual aspect will be more important. 124 In any case, even if the marks are held to be similar as a whole, I am of the view that there is no likelihood of confusion. Any aural similarity lies at the lower end of the spectrum. Even if there is also some degree of conceptual similarity and a finding that there is similarity as a whole, the court can look at the degree of similarity as part of the overall analysis of whether there is a likelihood of confusion. There is strong visual dissimilarity between the marks. It bears repeating that whilst the device components (i.e., the two dots) are very small in the CAESAR Mark, the device mark is placed in a prominent position in the CAESARSTONE Mark. Further, the device appears at the beginning of the word “CAESARSTONE”. It is unlikely that it will be perceived as mere decoration. 125 Much of the opponent’s argument in support of a likelihood of confusion rests on the word “Caesar”. It contends that the presence of the dots and the ligature in the CAESAR Mark is to be discounted or ignored. In contrast, it is my view that the presence of the coloured device at the start of the word “caesarstone” and the last five letters of the CAESARSTONE Mark is not to be downplayed. I have found earlier that the device elements of the CAESAR Mark are indeed small, but the same cannot be said of the device in the CAESARSTONE Mark. Further, there is no break between “caesar” and “stone”: it is a single word that is presented. I do not think it is right to place so much emphasis on the fact that “caesar” is the common element without evaluating the CAESARSTONE Mark as a whole. (D) Similarity of goods and services 126 Curiously, in the present proceedings, the opponent has chosen not to oppose the CAESARSTONE Mark in the following classes that were specified in the application for registration:18Foot Note 18×Applicant’s 2nd Supplemental Bundle of Documents, Tab 1. Class 20 Worktops, sinktops [kitchen furniture]; work surfaces and surrounds [furniture] for kitchens, bathrooms, vanity units and offices, counter tops; table tops; bar tops [furniture]; non-metallic work surfaces for furniture, fixtures or surrounds [furniture] used in reception areas. Class 35 The bringing together, for the benefit of others, of a variety of goods such as tops and facing surfaces (excluding the transport thereof), enabling customers to conveniently view and purchase those goods from wholesale and retail outlets; wholesale and retail services in relation to tops and facing surfaces, work surfaces, surrounds, tiles, panels, floor coverings, wall cladding, flooring, ceilings, slabs and tiles formed of composite stone for building panels, counter tops, vanity tops, floors, ceilings, stairs, and walls; provision of commercial information relating to the aforesaid goods; provision of business consultancy, marketing services, promotional services and business assistance in the establishment and operation of, dealership, franchising, wholesale and retail services that feature tops and facing surfaces, work surfaces and surrounds, tiles, panels, floor coverings, wall cladding, flooring, ceilings, slabs and tiles formed of composite stone for building panels, counter tops, vanity tops, floors, ceilings, stairs, and walls. Class 37 Installation, maintenance and repair services of worktops, sinktops, work surfaces and surrounds for kitchens, bathrooms, vanity units and offices, counter tops, table tops, bar tops, tops and facing surfaces for furniture, reception desks and reception areas, tiles, panels for floors, floor coverings, wall cladding, flooring, ceilings, non-metallic covers for use with floors and parts thereof, profiles and floor skirting boards, slabs and tiles formed of composite stone. 127 No submissions were made as to the relationship between these unopposed classes of goods and services and Class 19 (which attracted opposition), and this issue was not directly before me.  That said, I will add my observation that the unopposed classes of goods and services are related to those of Class 19. If the opposition succeeds, the applicant would be precluded from applying the CAESARSTONE Mark to its Class 19 goods, which include floor coverings and tiles. However, the applicant would be at liberty to apply the same mark to wholesale, retail, installation, maintenance and repair services of Class 19 goods. The question that may need to be addressed head-on (in an appropriate case) is whether goods and services could ever be considered as being “similar” under the TMA as presently formulated. As will be seen, in some jurisdictions such as Australia, the equivalent statutory provisions refer to the concept of “closely-related” goods or services. 128 Given the close relationship between the goods and services in Classes 19, 20, 35 and 37, it is perhaps a little surprising that opposition proceedings were not brought in respect of the registration for Classes 20, 35 and 37. However, I also accept that it is the opponent’s prerogative to decide the extent to which opposition proceedings are to be brought where the opposed mark is applied for in several different classes of goods and services. For the avoidance of doubt, I make clear that the principal ground for my decision is my earlier assessment that there is no likelihood of confusion, bearing in mind the marks similarity comparison and the nature of the goods. 129 I note in passing and by way of observation that the opponent successfully opposed the registration of the CAESARSTONE Mark before the Australian Trade Mark Office (“ATMO”) and the Canadian Trade-marks Opposition Board. Whilst the statutory provisions in these jurisdictions are not the same as those in Singapore, a brief review of the decisions may nonetheless be helpful in setting out the international context of the dispute. 130 There are two relevant Australian decisions,viz.,Ceramiche Caesar S.p.A. v Caesarstone Sdot-Yam Ltd[2015] ATMO 12 (“CaesarNo 1”) and [2015] ATMO 83 (“CaesarNo 2”). It is important to note, however, that these decisions are under appeal. 131 InCaesarNo 1, the applicant mark comprised the plain word CAESARSTONE (“CAESARSTONE Word Mark”) and did not have any pictorial device. The opposed application was for registration in Class 19 for goods, and the specified goods were defined in a manner so as to exclude “tiles”. The applicant owned an earlier registration for the same mark in Class 20 for,inter alia,worktops, sinktops, work surfaces and surrounds for kitchens, bathrooms. The opposition succeeded. 132 The ATMO found that the CAESARSTONE Word Mark was deceptively similar to the opponent’s CAESAR Mark and that the likelihood of confusion or deception was very high. At [43], the ATMO stated that it was in agreement with much of the opponent’s arguments which included the following. (a) The word “Caesar” was the most distinctive and memorable feature of both marks. It was likely that customers may abbreviate the CAESARSTONE Word Mark in spoken form to CAESAR. (b) Conceptually, there was no point of distinction between the marks. The idea behind them was the same – both called to mind the Roman Caesars and the connotations that were attached to them such as supremacy, power and authority. (c) Customers were used to related brands and sub-divisions within brands. 133 The facts ofCaesarNo 2largely mirror that of the Singapore proceedings. The proceedings concerned the same CAESARSTONE Mark and CAESAR Mark that are the subject matter of the Singapore proceedings. Moreover, like the application in Singapore, the application inCaesar No 2was made in respect of goods and services in Classes 19, 20, 35 and 37. Notably, the specification for Class 19 excluded certain items in the nature of “tiles.” The opposition succeeded. 134 The ATMO found that whilst the marks were not “substantially identical”, they were deceptively similar (at [36] to [39]). It found,interalia, that the addition of the device element made no difference: it comprised “stylized crescents and nothing more” and as such was not “a memorable part of the CAESARSTONE Mark. Further, the ATMO considered that the memorable and essential feature in both marks was the word “Caesar”, with the prefix being the most important part of a word in terms of pronunciation. Conversely, the remaining word “stone” in the CAESARSTONE Mark lacked originality and was unlikely to be perceived as memorable even if the products in question were not made of stone. 135 The ATMO also found that the opponent’s ceramic tiles were closely related to the applicant’s services involving the retail and wholesale, installation, maintenance and repair of those goods in Classes 35 and 37 (at [33-[34]]). The provision of those services were ancillary to the goods themselves and it was likely that one would cease to exist without the other. In many instances, the product would also need to be altered to suit the customer’s requirements. 136 Similar opposition proceedings were also brought in Canada:Ceramiche Caesar SpA v Caesarstone Sdot-Yam Ltd[2015] TMOB 36 (“Caesar Canada”). The marks in the Canadian proceedings were the same as those in the Singapore proceedings, namely the CAESARSTONE Mark and the CAESAR Mark. The opposition succeeded in respect of the opposed services relating to: (1) Wholesale and retail stores and wholesale and retail showrooms featuring tiles, floor coverings, flooring, slabs and tiles formed of composite stone for building panels, floors, stairs; offering consulting, support, marketing, promotional and technical assistance in the establishment and operation of distributorship, dealership, franchising, wholesale and retail stores that feature floor coverings, flooring, slabs and tiles formed of composite stone for floors, stairs and walls. (2) Installation, maintenance and repair services of panels for floors, floor coverings, wall cladding, flooring, non-metallic covers for use with floors and parts thereof, profiles and floor skirting boards, slabs and tiles formed of composite stone. 137 Under s 12(1)(d) of the Canadian Trade-marks Act (RSC, 1985, c T-13), a trade mark is not registrable if it is “confusing with a registered trade mark”. It is critical to note that the Canadian decision proceeded on the basis that the burden was on the applicant to demonstrate that there was no likelihood of confusion (at [9]). This is different from the position in Singapore. What is interesting to note is that the opposition succeeded on the basis that the applicant’s opposedserviceswere closely related to the opponent’s registeredgoodsas they travelled in the same or similar channels of trade and the parties also advertised their products/services in a similar manner. However, the Canadian Trade-marks Opposition Board was not prepared to draw an inference that there is no likelihood of confusion from the opponent’s decision not to oppose the registration of the mark in association with the goods applied for in the subject application. This was judged to be not relevant in the proceedings, and would require speculation as to why the opponent did not oppose registration for the applied for goods (at [66]). 138 Whilst the litigation between the parties in respect of the CAESARSTONE Mark in Australia and Canada raised similar issues to those that have arisen in Singapore, this court is reminded that the facts, evidence and statutory framework, including the burden of proof, are not the same. Notwithstanding the substantive outcome of the Australian and Canadian proceedings, and with due respect to these decisions, I am of the view that the opposition fails in Singapore. 139 Whilst the Australian and Canadian decisions placed emphasis on the fact that the word “CAESAR” was common to both marks and that, as a prefix, it was of significance to the customer, I am more inclined towards the view that the pictorial device, whether described as a stylised crescent (Caesar No 2at [36]) or swirl (Caesar Canadaat [21]), is a distinctive feature on its own. Whilst the word “STONE” may describe some of the goods within Class 19 such as tiles formed of composite stone, it does not necessarily describe “non-metallic profiles and floor skirting boards.” Considering the marks as a whole and with due regard to the use of the word “CAESAR”, I find that there is no likelihood of confusion arising from any similarity between the marks and goods for the reasons that I outlined earlier. (E) Concluding remarks on likelihood of confusion 140 In view of all the factors and circumstances discussed above, I find that there is no likelihood of confusion. Questions of similarity and the likelihood of confusion are, after all, questions of impression. Nevertheless, and with due respect to the PAR, I am of the view that too much emphasis was placed on the fact that “Caesar” was common to both marks. There are clear differences between the marks as a whole. Bearing in mind that the burden is on the opponent to establish the ground of opposition, I am not satisfied that a likelihood of confusion has been made out. 141   As a final note, I note that during the eight years or so since the applicant applied to register the CAESARSTONE Mark in Singapore, there is no evidence or suggestion that confusion has occurred in the Singapore market despite the development of the applicant’s presence. Whilst this may be a little surprising (given that the burden is on the opponent to establish the ground of opposition) I am mindful that the absence of evidence is not evidence of the absence of confusion.",
        "The ground of opposition under s 8(4)(b)(i) of the TMA": "142 Section 8(4)(a) read with 8(4)(b)(i)) of the TMA provides: (4)  Subject to subsection (5), where an application for registration of a trade mark is made on or after 1st July 2004, if the whole or an essential part of the trade mark is identical with or similar to an earlier trade mark, the later trade mark shall not be registered if — (a) the earlier trade mark is well known in Singapore; and (b) use of the later trade mark in relation to the goods or services for which the later trade mark is sought to be registered — (i) would indicate a connection between those goods or services and the proprietor of the earlier trade mark, and is likely to damage the interests of the proprietor of the earlier trade mark; or … 143 The applicant has two primary complaints about the PAR’s decisionvis-à-visthe ground of opposition under s 8(4)(b)(i) of the TMA. First, it submits that the PAR erred in finding the whole or an essential part of the CAESARSTONE Mark to be similar to the CAESAR Mark. Second, it submits that the PAR erred in finding that the CAESAR Mark was well-known in Singapore. 144 As I have dealt with the issue of marks-similarity earlier, this leaves for determination the issue of whether the CAESAR Mark was well-known in Singapore as at the relevant date. I mention in passing the earlier decision of this court inRoviowhere it was held, at [146], that there was no difference between the similarity of marks comparison in s 8(2)(b) and s 8(4) of the TMA.",
        "Whether the PAR erred in finding that the Caesar Mark was well- known": "145 The PAR found that the opponent had discharged its burden of proof in showing that the CAESAR Mark was well-known in Singapore. Her decision was based primarily on the following comment by the Court of Appeal inAmanresorts: 229 Finally, it will be recalled that it is not too difficult for a trade mark to be regarded as “well known in Singapore” – essentially, the trade mark in question need only be recognised or known by “anyrelevant sector of the public in Singapore” [emphasis added] (see s 2(7)(a) of the current TMA), which sector could in certain cases be miniscule. … 146 The applicant submits that the PAR erred in finding that the CAESAR Mark was well-known. In essence, the applicant claims that the opponent has not adduced any evidence showing that its mark is well-known to all the actual consumers and potential consumers in Singapore of the goods or services to which the CAESAR Mark (and not any other variant of the mark) is applied. (a) No evidence whatsoever has been adduced by the opponent to show that its CAESAR Mark has ever been used in Singapore. The invoices tendered relates to “Ceramiche Caesar”, not the CAESAR Mark. The marketing materials too did not reflect use of the Caesar mark but either the “Ceramiche Caesar” or “Ceramiche Caesar Le Cultura Della Materia” marks. (b) The opponent has merely provided a bare list of supposed clients in Singapore but no evidence has been evinced to support any sale of goods under the CAESAR Mark in Singapore. Moreover, no probative value can be apportioned to the contents of Exhibits 7 and 8 of the opponent’s first statutory declaration, which ostensibly indicate that some of the opponent’s clients in Singapore have themselves been promoting its products, as the source of the documents has not been provided and the contents cannot be verified. (c) No evidence has been adduced to substantiate the opponent’s assertion that it first started selling goods bearing the CAESAR Mark in Singapore in 1989. (d) The sales and marketing figures specified by the opponent in its evidence are lump sum figures which do not show the revenue or marketing expenditure in respect of the relevant goods in Singapore. Further, no evidence (including but not limited to financial statements/report) have been adduced in support of the sales and marketing figures specified in the opponent’s evidence. (e) All the pertinent registrations in the name of the opponent are for the stylized version of the CAESAR Mark. There are no registrations for the plain word mark, “Caesar”. By stylised, the applicant is referring to the CAESAR Mark placed between the two small diamond-shaped dots with a ligature between the “A” and “E”. Any interchangeable reference to use of the mark by the opponent is erroneous and misconceived. The opponent has also failed to establish any goodwill or reputation in Singapore or worldwide with respect to “Caesar”. (f) The opponent has not adduced relevant evidence to demonstrate sufficient market penetration in Singapore. The details regarding the number of hits to its Italian website are unsubstantiated. There is no indication as to whether the hits are from relevant members of the target audience. Further, Exhibit 1 of the opponent’s first statutory declaration, a print out from the opponent’s website, suggests that the information on the website is in Italian and would not be of relevance to actual consumers and potential consumers in Singapore. 147 The opponent, on the other hand, submits that there is no reason to interfere with the holding of the PAR that the CAESAR Mark is well-known. It argues that the CAESAR Mark may be regarded as well-known in Singapore as there is sufficient evidence to satisfy each of the factors in s 2(7) of the TMA (see below): (a) On the duration, extent and geographical area of the use and/or promotion of the CAESAR Mark, the mark has been used since at least 1989 and goods under the same have been sold in more than 120 countries throughout the word, including in France, the United States and the United Kingdom. (b) On the scope and extent of trade mark applications and registrations filed for the CAESAR Mark: (i) The CAESAR Mark is registered or pending registration in almost 50 countries worldwide. (ii) The earliest of the opponent’s registrations dates back to 1994. (c) The opponent has successfully enforced its rights and interests in the CAESAR Mark: (i) The opponent has successfully opposed the applicant’s application for the CAESARSTONE Mark in Australia and Canada. (ii) The opponent had opposed the applicant’s application for the mark “Caesar Mosaic” in Australia. The applicant withdrew the application by agreement.",
        "Decision": "148 In assessing whether a trade mark is well-known in Singapore, regard must be had to the factors listed in s 2(7) of the TMA: (7) Subject to subsection (8), in deciding, for the purposes of this Act, whether a trade mark is well known in Singapore, it shall be relevant to take into account any matter from which it may be inferred that the trade mark is well known, including such of the following matters as may be relevant: (a) the degree to which the trade mark is known to or recognised by any relevant sector of the public in Singapore; (b) the duration, extent and geographical area of — (i) any use of the trade mark; or (ii) any promotion of the trade mark, including any advertising of, any publicity given to, or any presentation at any fair or exhibition of, the goods or services to which the trade mark is applied; (c) any registration or application for the registration of the trade mark in any country or territory in which the trade mark is used or recognised, and the duration of such registration or application; (d) any successful enforcement of any right in the trade mark in any country or territory, and the extent to which the trade mark was recognised as well known by the competent authorities of that country or territory; (e) any value associated with the trade mark. 149 Section 2(8) of the TMA provides that “where it is determined that a trade mark is well-known to any relevant sector of the public in Singapore, the trade mark shall be deemed to be well-known in Singapore”. This is followed by s 2(9) of the TMA which defines the “relevant sector of the public in Singapore” to be: (a) all actual consumers and potential consumers in Singapore of the goods or services to which the trade mark is applied; (b) all persons in Singapore involved in the distribution of the goods or services to which the trade mark is applied; (c) all businesses and companies in Singapore dealing in the goods or services to which the trade mark is applied. 150 In the present case, the relevant sector of the public includes consumers, retailers and distributors of,inter alia, tiles and flooring materials that fall within Class 19. On a broader view, given the nature of the products, it would be sensible and practical to also include within the “relevant sector of the public” professionals such as interior designers and architects who may have important roles to play in decisions involving the décor of homes or commercial establishments. I note, however, that the evidence before me does not provide any indication as to the size and the views of the relevant sector of the public in Singapore. 151 Having considered the evidence tendered by the opponent, I am of the view that the opponent has not discharged its burden of proving that the CAESAR Mark is well-known in Singapore. In coming to this conclusion, I am not holding that evidence of advertising expenditure incurred overseas and overseas sales is irrelevant in deciding whether a mark is well-known to the public in Singapore. After all, the extent of registration of the mark in other countries is a relevant factor to be considered. Nevertheless, the mere fact that the same mark has been registered, used and promoted overseas does not mean that it must be treated as a well-known trade mark in Singapore. Use of Mark 152 The opponent claims to have started selling its goods in Singapore in 1989. The opponent also claims that its goods have been sold in Singapore by various distributors to end consumers and are asource of substantial revenue. To this end, the opponent has provided its sales figures in Singapore as well as a list of its clients in Singapore. 153 I note, however, that the table below shows that the opponent’s sales figures in Singapore, whilst not insubstantial, do not constitute a significant percentage of its global sales. Opponent’s Sales FiguresYearSingapore Sales(in SGD)19Foot Note 19×PAR’s Grounds of Decision, para 122.Worldwide sales(in SGD)20Foot Note 20×Applicant’s Bundle of Documents (Vol I), p 22.20023,390,094119,929,92520031,874,266108,568,0932004935,055119,036,24220051,433,751159,243,9182006203,634173,550,9872007577,656176,795,005 154 I note in passing that the opponent’s sales figures for Singapore run from 2002 to 2007. Neither party made submissions as to the date by reference to which the court is to determine whether the earlier trade mark is well- known. It will be recalled that in respect of s 8(2)(b) of the TMA, the applicant’s position is that the date for assessment of opposition is the date of the hearing. By that date, it argues the CAESARSTONE Mark had acquired a significant presence or reputation in Singapore. That said, it will be recalled that the applicant asserts that it had already achieved Singapore sales amounting to $362,000 in 2007. The opponent, on the other hand, claims sales in Singapore in amounting to $577,656 in the same year. Both parties submit that there is insufficient evidence or details provided to support the claims of the other party. 155 Whilst the opponent asserts that it has continually promoted and advertised its goods using the CAESAR Mark through several mediums, such as magazines, press interviews and its website, it was only able to provide its worldwide promotional figures, as reflected in the table below. It is unclear how much of these expenditures relate to promotional activities in Singapore. Opponent’s Worldwide Promotional Expenditure FiguresYearAmount (in SGD)21Foot Note 21×Applicant’s Bundle of Documents (Vol I), p 24.2002273,3872003247,81220041,339,13120052,092,41220062,234,78820071,120,784 156 The opponent has also provided information as to the number of hits to its Italian website between 1999 and 2008.22Foot Note 22×Applicant’s Bundle of Documents (Vol I), p 148.Whilst the numbers are rather significant and I accept that the website has English text which would be relevant to consumers outside of Italy, I agree with the applicant that there is no indication as to whether the hits are from members of the relevant sector of the public in Singapore. 157 Finally, whilst the invoices and marketing materials tendered as evidence relate to marks which bear the words “Ceramiche Caesar” or “Ceramiche Caesar Le Cultura Della Materia”, I agree with the PAR’s view that the CAESAR Mark remains the dominant component of those marks. Thus, the materials bearing these marks should be accorded at least some weight in determining how well-known the CAESAR Mark is in Singapore. Again, for reference, the marks affixed to the invoices and marketing materials are:  Overseas registrations of mark and successful enforcement of rights 158 I have noted the opponent’s submission that it has applied for and/or obtained several registrations or applications for the CAESAR Mark in other jurisdictions. In particular, I note that the opponent has successfully enforced their rights against the applicant in Australia inCaesarNo 1. That said, I was informed by counsel during the hearing of this appeal that the applicant’s mark that was successfully opposed in Australia did not have a device and is thus different from the CAESARSTONE Mark that is the subject of these proceedings. I should add that it is apparent that at about the same time as the hearing of the appeal, the decision inCaesarNo 2was handed down.CaesarNo 2does involve the same CAESARSTONE Mark before me. It is understood that appeals are pending inCaesarNo 1andCaesarNo 2. Neither of these cases is binding in Singapore although the successful enforcement of the composite CAESAR Mark is a relevant factor in determining whether the mark is well-known in Singapore. Conclusion 159 The rights of proprietors of well-known marks are given greater protection. It is for this reason that well-known marks are particularly valuable. Therefore, one must take care not to elide the distinction between well-known marks and what may be loosely termed “ordinary” marks. Whilst the Court of Appeal has commented that it is “not too difficult” for a trade mark to be considered well-known in Singapore (Amanresortsat [229]), this should not be taken to mean that the hurdle that trade mark owners have to cross is minimal. 160 It is to be noted that the definition of an earlier well-known trade mark under s 2 of the TMA includes anunregisteredtrade markirrespectiveof whether the trade mark enjoys goodwill in Singapore provided that, at the date of application for registration of the opposed mark, the earlier mark was a well-known trade mark. This means that even if the “foreign” trade markis not registeredin Singapore and even if the proprietor hasnot establishedany business and goodwill in that mark in Singapore, he is still entitled to the special protection offered by ss 8 and 55 of the TMA provided that it is a well-known trade mark. There is no requirement for the trade mark to be well-known to the public at large for it to benefit from the basic protection offered to well-known marks. For this reason, I am of the view that the statement of the Court of Appeal inAmanresortsthat it is “not too difficult” for a trade mark to be considered as well-known, especially on a sectorial basis, must be applied with judicious caution to the actual facts and circumstances of each case. 161 It must be recalled thatAmanresortsconcerned a niche market involving high-end exclusive, ultra-luxurious boutique resort services. In that context, the Court of Appeal’s comment is perhaps unsurprising since the number of actual or likely patrons for such niche sectors could be small or even miniscule. Moreover, I note that the evidence presented before the Court of Appeal clearly showed that Amanresorts enjoyed a substantial reputation among the high-end crowd in Singapore ([12]–[20] ofAmanresorts): (a) Amanresorts had an international reservations office located in Singapore that handled approximately 30% to 40% of their global reservations; (b) Amanusa Bali, Amanresorts’ resort in Bali, had 1,382 Singaporean visitors between 1995 and 2005; (c) its newsletter, Amanews, was distributed to over 2,700 persons in Singapore every quarter; (d) the Amanresorts Group, as part of its marketing strategy, employed the targeted advertisement of its goods and services to 900 American Express Centurion members and 4,200 American Express Platinum members in Singapore; and (e) its resorts had been featured in several local publications such asThe Straits Times,Her WorldandFemale. 162 In my view, the evidence in the present case falls far short of the standard of evidence inAmanresorts. In view of the deficiencies in the opponent’s evidence as highlighted above, I am unable to come to the conclusion that the members of the relevant sector of the public in Singapore (including the relevant trade circles and consumers) are well acquainted with the CAESAR Mark. In any case, even if the opponent’s trade mark is well-known in Singapore, I repeat my earlier finding that the marks are on the whole dissimilar. There is no likelihood of confusion. I need not delve into the issue of damage to the interests of the applicant. Accordingly, the opposition on the basis of s 8(4)(b)(i) of the TMA must fail.",
        "Conclusion": "163 At the heart of this dispute is a delicate balancing exercise between the rights of the proprietor of an earlier mark and those of its competitors. As was said by the then Minister for Law (Professor S Jayakumar), “[a]s we strengthen the trade marks regime to provide greater protection for trade mark owners, we must also maintain the balance between trade mark owners and users”:Singapore Parliamentary Debates,Official Report(15 June 2004) vol 78 at col 113. Indeed, I am also mindful of the counsel of caution issued by Andrew Phang J (as he then was) that whilst the court should recognise and give effect to the rights of registered trade mark holders, wherever appropriate, it should bear in mind the fact that such rights should not be permitted to either blatantly or subtly develop into disguised monopolies which stifle or stymie the general public interest and welfare:Nation Fittings (M) Sdn Bhd v Oystertec plc and another suit[2006] 1 SLR(R) 712 at [45]. To do so would deprive the trade mark regime of its legitimacy as trade mark protection finds its justification in “a harmonious dovetailing between public and private interests”: opinion of Advocate-General Jacobs (dated 13 March 1990) inSA CNL-Sucal NV v Hag GF AG[1990] 3 CMLR 571 at [18]. 164 For the foregoing reasons, I allow the appeal. The CAESARSTONE Mark is allowed to proceed to registration in Class 19 and the opponent is to pay to the applicant costs here and below which are to be agreed or taxed. As a postscript, the court wishes to place on record its appreciation to counsel for their helpful submissions. George WeiJudge Prithipal Singh and Chow Jian Hong (Mirandah Law LLP)for the appellant;Melvin Pang (Amica Law LLC) for the respondent."
    }
}