{
    "case_title": "Zhou Weidong                                                                     vLiew Kai Lung and others",
    "ncitation": "[2017] SGHC 326",
    "coram": "Audrey Lim JC",
    "sections": {
        "Introduction": "1The plaintiff (“Zhou”) claimed against the first defendant (“Liew”) for misrepresentation, breach of fiduciary duty, and constructive and resulting trusts pertaining to four investment agreements that Zhou had entered into with the second defendant (“RCL”), of which he did not receive the agreed returns of $6,530,000. The third to fifth defendants are parties to this suit as Zhou claimed that his money for the investments was transferred to the third defendant (“SIPL”) and/or fourth defendant (“Mah”), SIPL’s director and sole shareholder, and then to the fifth defendant (“Gobind”). SIPL and Mah counterclaimed against Zhou, Liew and RCL for sums which were returned to them. Liew was made a bankrupt and was not sanctioned by the Official Assignee to defend the claim. Additionally, judgment in default of appearance was entered against RCL on the four investment agreements by Zhou for $6,530,000 and by SIPL and Mah on their counterclaim for $266,850.68.",
        "Plaintiff’s case": "2Zhou’s evidence is as follows. Liew incorporated RCL to spearhead investments in China, and was its director.1Foot Note 1×Zhou’s affidavit of evidence-in-chief (“AEIC”), para 9.Zhou maintained an investment portfolio with RCL, including four investments (“Four Investments”) which are the subject-matter of this suit. 3On 30 June 2011, Zhou entered into an agreement with RCL (“GT Agreement”). Under this agreement, Zhou was to invest $1m through RCL to participate in a loan placement for the development of a residential project in China (“GT Investment”) by a company (“Greentown”). To induce Zhao to enter into the GT Agreement, Liew had represented that: (i) Greentown would finance the residential project through local loan placement(s); (ii) the purpose of the GT Investment was to participate in the loan placement for the development of that project; and (iii) RCL would manage the GT Investment and funds of investors invested in the loan placements.2Foot Note 2×Zhou’s AEIC, para 25.Liew informed Zhou that his $1m contribution to the GT Investment came from Zhou’s returns on his previous investment under Liew’s care (“Blackgold Investment”) in an entity (“Blackgold”), and that it had been transferred to the account of SIPL, a money remitter.3Foot Note 3×Zhou’s AEIC, para 15; 3/10/17 Notes of Evidence (“NE”), pp 29–30.Around September 2012, Zhou discovered from Liew that his $1m was not used for the GT Investment. 4Next, around 11 August 2011, Zhou entered into a Lending Business Investment Agreement (“LBI Agreement”) with RCL to invest RMB5.2604m (equivalent to $1m) for participating in bridging loan placement companies in China (“LBI Investment”), with RCL as the investment manager. On Brian Dong’s instructions and pursuant to the LBI Agreement, Zhou remitted US$200,000 to Mah’s account and the balance in Renminbi to the account of one Chen Jie in China.4Foot Note 4×Zhou’s AEIC, para 17.Brian was Liew’s assistant in RCL’s employ. 5Lastly, on Liew’s recommendation, Zhou entered into two agreements (“1ST2 Agreement” and “2ST2 Agreement”) with RCL around 19 and 21 December 2011 respectively, to invest $2m on each occasion to participate in bridging loan placements to companies in China (“1ST2 Investment” and “2ST2 Investment”). Again, RCL was the investment manager. Liew informed Zhou that his principal of $2m each, for the 1ST2 and 2ST2 Agreements, came from Zhou’s returns on his previous investments under Liew’s care.5Foot Note 5×Zhou’s AEIC, paras 20 and 22; 3/10/17 NE, pp 31–32. 6To induce Zhou to enter into the LBI, 1ST2 and 2ST2 Agreements, Liew represented that the purpose of the LBI, 1ST2 and 2ST2 Investments was to provide bridging loans to companies in China and that Chen Jie would be the point of contact for these Investments as she had close connections with Chinese banks. Liew also represented that these Investments were protected and safe investments.6Foot Note 6×Zhou’s AEIC, paras 27(c) and 27(d).First, the bridging loans would only be provided to companies in Wenzhou, China, that had good credit rating and were existing customers of banks in Wenzhou (“the Borrowing Companies”). Second, Liew would open a bank account to receive the bridging loans and would retain full control over the account. Third, the Borrowing Companies would provide securities to Liew and their management would provide personal guarantees for the bridging loans. RCL would manage these Investments and the funds of investors invested in these Investments.7Foot Note 7×Zhou’s Statement of Claim (“SOC”), para 21(d).However, the principal investment sums (totalling $5m) and interests due under the Investments (save for approximately $430,0008Foot Note 8×Zhou’s AEIC, para 34.) were not paid out to Zhou. Zhou subsequently discovered from Liew that his $5m was not applied towards the bridging loan placements pursuant to the LBI, 1ST2 and 2ST2 Investments.9Foot Note 9×Zhou’s AEIC, para 39. 7Zhou thus claimed against Liew for misrepresentation, breach of fiduciary duty, constructive trust and resulting trust,10Foot Note 10×Zhou’s SOC, paras 12, 13, 16, 26, 27, 30, 43 and 44.seeking the repayment of $6,530,000 for the Four Investments that did not materialise. Zhou also relied on four guarantees (“the Guarantees”) signed by Liew in which he warranted and undertook to repay the principal sums and interest accrued on the four investment agreements (“the Four Agreements”) which RCL had failed to repay Zhou. As against SIPL, Mah and Gobind, Zhou claimed for the repayment of $5,247,689.04 on the basis of dishonest assistance, knowing receipt, unjust enrichment, as well as constructive and resulting trust.11Foot Note 11×Agreed List of Issues, items 7 and 11.Additionally, Zhou claimed that all the defendants had conspired to defraud him by unlawful means.",
        "Liew’s testimony": "8Liew came to know Chen Jie in 2008 or 2009. He set up RCL as its sole shareholder12Foot Note 12×4/10/17 NE, p 76.and Chen Jie became RCL’s client. Chen Jie introduced Liew to Mah’s husband, Marino, about one or two years before Liew’s wedding in 2010. Chen Jie informed Liew that Marino was her relative (which Marino denied) and business partner, and that he handled her finances and investments. Marino was a consultant for SIPL, a vehicle to transfer monies used for investments.13Foot Note 13×4/10/17 NE, pp 39–41.Liew and Chen Jie had also used SIPL to transfer monies in and out for investments introduced by RCL to Chen Jie.14Foot Note 14×4/10/17 NE, pp 45–47.However Liew did not know Gobind.15Foot Note 15×4/10/17 NE, p 38. 9Liew admitted that Zhou had entered into the Four Agreements with RCL and he had to transfer $6m in total to RCL pursuant to these agreements. At the same time, Liew would enter into corresponding loan contracts with Chen Jie to lend her the amounts that investors had placed with RCL for the purposes of the investments mentioned in the Four Agreements.16Foot Note 16×4/10/17 NE, p 66; Agreed Bundle of Documents (“AB”) 984.However, Zhou bypassed RCL and dealt directly with Chen Jie through SIPL, Mah or Brian (who was not RCL’s employee) and transferred the investment monies to SIPL, Mah or Chen Jie. Hence, Zhou had not performed his part of the bargain under the Four Agreements, and was therefore in breach of them.17Foot Note 17×4/10/17 NE, pp 65–66, 71; 5/10/17 NE, p 22.",
        "Mah’s, SIPL’s and Gobind’s cases": "10Mah and SIPL’s case is essentially related by Mah. She had agreed to assist Chen Jie, a friend, to remit monies belonging to Chen Jie’s business investors.18Foot Note 18×Mah’s AEIC, paras 8 and 20.On Mah’s request, Gobind agreed to assist with the remittance as he knew a money remitter.19Foot Note 19×Mah’s AEIC, para 9.Mah had only met Liew once at his wedding, and Brian was the main person who liaised with Marino and who instructed Mah on the money transfers.20Foot Note 20×Mah’s AEIC, para 16.Mah’s role throughout was merely to help Chen Jie remit and transfer money. She had no knowledge of the Four Investments and Agreements nor the dealings between Zhou, Liew and Chen Jie.21Foot Note 21×Mah’s AEIC, para 21.Mah claimed that the monies transferred by Zhou and Liew to SIPL and her accounts were subsequently remitted pursuant to Chen Jie’s instructions, and she did not retain the monies for her benefit nor was she paid a commission for her role.22Foot Note 22×Mah’s AEIC, para 20.She had also transferred monies back to Zhou and Liew – in fact, Mah and SIPL’s case is that they had disbursed monies in excess of what they received. The excess monies form the subject of Mah and SIPL’s counterclaim. 11As for Gobind, he was the owner of Silk Rose Pte Ltd, whose main business was in financing, including opening letters of credit for customers for a commission.23Foot Note 23×13/10/17 NE, pp 34–35.He had arranged for the monies received from Mah or SIPL to be remitted to various recipients in China based on Marino’s instructions.24Foot Note 24×Gobind’s AEIC, para 32.Gobind had agreed to assist Mah and Marino as he had connections in China.25Foot Note 25×Gobind’s AEIC, para 10.He did not know Zhou and was unaware of Zhou’s business relationship with Liew and RCL.",
        "Preliminary issues": "12Before considering the respective parties’ claims and defences, I deal first with some preliminary issues.",
        "Zhou and Liew’s relationship with SIPL, Mah and Marino": "13Despite Mah and Marino’s claim that they had only met Liew once at his wedding, I find that Chen Jie had introduced Liew to Marino before his wedding, and that he had on various occasions communicated with Marino about investments and money transfers of investment monies. Liew would not have invited Marino and Mah to his wedding if he did not already know them.26Foot Note 26×4/10/17 NE, p 29.Mah had in an earlier affidavit admitted that Marino and she were “good friends” with Liew.27Foot Note 27×Plaintiff’s Bundle of Affidavits (\"PBA\"), Tab 1, Mah’s Affidavit dated 4 July 2014, paras 6 and 7.I also find that Zhou first came to know Mah at Liew’s wedding. I accept that Liew had informed Zhou that Mah and SIPL were involved in assisting investors and Zhou had assumed that Mah and SIPL were to help transfer investment monies.28Foot Note 28×3/10/17 NE, p 42.However, there was no evidence that Zhou knew Mah or Marino well or that he had direct business dealings with them.",
        "Brian Dong": "14Contrary to Liew’s assertion that Brian was Chen Jie’s employee,29Foot Note 29×4/10/17 NE, p 80.I find that Brian was RCL’s employee who acted on Liew’s and RCL’s authority in dealing with RCL’s clients including Zhou. Brian had given the impression that he was Liew's assistant and that he was acting for RCL, which Liew did not object to.30Foot Note 30×5/10/17 NE, pp 25 and 72; AB 20.Brian used RCL’s e-mail address and its logo in his e-mails.31Foot Note 31×4/10/17 NE, p 81.Liew claimed that he had permitted Brian to do so as Brian, in his capacity as Chen Jie’s employee, needed a proxy company to send e-mails to his own clients.32Foot Note 32×4/10/17 NE, p 80.I find this unbelievable – if that was so, Brian could have used Chen Jie’s company’s e-mail address, or his personal e-mail, which Liew knew of.33Foot Note 33×Bundle of AEICs (Vol 2), p 491; 5/10/17 NE, p 72.Brian had even drafted the Four Agreements for RCL.34Foot Note 34×4/10/17 NE, p 105.Numerous correspondences (to which Liew was copied) showed that Brian was acting as RCL’s employee. Hence, I find that Bryan, in instructing Zhou to transfer money to SIPL’s, Mah’s or Chen Jie’s account, had done so on Liew’s and RCL’s authority.",
        "Claim against Liew": "",
        "Claim on the Guarantees": "15I first deal with Zhou’s claim on the Guarantees. A guarantor’s liability under a guarantee is secondary to that of the principal debtor and is collateral to and dependent upon the liability and default of the principal debtor (PT JayaSumpiles Indonesia and another v Kristle Trading Ltd and another appeal[2009] 3 SLR(R) 689 at [50]). If the principal debtor is not liable or the principal debt is unenforceable, the guarantor would not be liable under the guarantee. 16Thus, although judgment in default had been entered against RCL for breach of the Four Agreements, I will first consider their enforceability. Liew agreed that Zhou had to contribute $6m under the Agreements and would obtain the returns stated therein.35Foot Note 35×5/10/17 NE, p 68.Liew claimed that Zhou had breached the Agreements as he did not pay $6m to RCL but had dealt with Chen Jie through SIPL, Mah, and Brian without his approval. Hence the Guarantees were unenforceable.36Foot Note 36×4/10/17 NE, p 102. 17For the GT Investment, Zhou claimed that his $1m consideration came from the money he had entrusted to Liew for the Blackgold Investment. Liew had informed Zhou that he would use part of the returns from the Blackgold Investment for the GT Investment and on that basis he transferred $1m to SIPL. Zhou exhibited a debit note which showed $2,289,391.51 debited from Liew to SIPL’s account on 30 June 2011, which he claimed included his $1m.37Foot Note 37×Bundle of AEICs (Vol 2), p 187; 3/10/17 NE, pp 29–30.Liew claimed that the Blackgold Investment was not managed by him or RCL as the agreement was signed between Zhou and Aero Partners.38Foot Note 38×5/10/17 NE, p 11.Hence, Zhou had not given him or RCL consideration for the Blackgold Investment, much less did he transfer $1m from Zhou’s investment in Blackgold to the GT Investment. 18I accept Zhou’s evidence and disbelieve Liew. I find that Liew (as Zhou’s fund manager) had managed the Blackgold Investment for Zhou. He was the fundraiser for the investment, which was introduced to Zhou by RCL, and he had updated Zhou on the investment.39Foot Note 39×4/10/17 NE, pp 81–82; 5/10/17 NE, p 11; AB 39–40.The Blackgold Investment matured in late June 2011,40Foot Note 40×AB 39.shortly before Zhou’s intended investment in Greentown. Liew in fact admitted that the investors’ returns (including Zhou’s41Foot Note 41×5/10/17 NE, pp 12 and 16.), on maturity of the Blackgold Investment, were transferred by Aero Partners intohisaccount forhimto distribute to the investors. He also admitted that the sum of about $2,278,135.83, which was subsequently remitted to Chen Jie from SIPL’s account, included returns from the Blackgold Investment.42Foot Note 42×5/10/17 NE, pp 12–14, 16. 19With regard to the LBI Agreement, it is not disputed that Zhou had transferred $1m to Mah’s and Chen Jie’s accounts on Brian’s instructions. As for the 1ST2 and 2ST2 Agreements, I accept that Zhou’s principal sum for these investments were rolled over from returns on his previous investments with RCL which had matured.43Foot Note 43×4/10/17 NE, p 97.Liew admitted that he knew that Zhou’s monies were transferred for the purposes of the Four Investments (and other investments).44Foot Note 44×4/10/17 NE, p 66; 5/10/17, pp 66 and 70. 20I disbelieve Liew that Zhou had transferred his investment monies directly to SIPL, Mah, or Chen Jie without his approval. I find that the monies were transferred to them on Liew’s or Brian’s (acting under Liew’s) instructions and that Zhou had properly relied on those instructions. Liew was aware of the transactions and money transfers at the material time as he was copied on the correspondences between Zhou and Brian.45Foot Note 45×4/10/17 NE, pp 93 and 97; AB 235–236.Despite knowing the purpose of the money transfers, Liew did not tell Zhou not to forward the money elsewhere but only to RCL.46Foot Note 46×4/10/17 NE, pp 86–87.Liew’s claim that he did not intervene as Zhou was an astute investor was preposterous.47Foot Note 47×4/10/17 NE, pp 84–85.Further, under the Four Agreements, RCL was tasked to carry out the investment management activities as well as to oversee the administration of the investment,48Foot Note 48×Bundle of AEICs (Vol 2), pp 181, 192, 211 and 222.and the e-mails reveal that Liew continued to be involved in interest payments and client updates even after the respective investment terms had commenced.49Foot Note 49×Bundle of AEICs (Vol 2), pp 343 and 392.It is also inconceivable that Liew was copied on the correspondences relating to Zhou’s investments if he or RCL had nothing to do with them. In fact, Liew had agreed to the transfer of Zhou’s money directly to SIPL or Mah because Marino had promised him an agency fee for the transactions.50Foot Note 50×4/10/17 NE, pp 67, 125 and 126.In effect, he had approved and agreed to such an arrangement. 21Finally, Liew claimed that he had personally repaid Zhou about $500,000 as a conciliatory gesture.51Foot Note 51×4/10/17 NE, pp 90–91; 5/10/17 NE, p 44.There was no reason for Liew to do so, unless the investment agreements were valid and binding. Liew’s explanation that he had agreed to help Chen Jie repay the monies on her behalf was unbelievable given that Chen Jie was (according to Liew) on the run at that time.52Foot Note 52×4/10/17 NE, p 131.Overall, I find Liew to be a dishonest and evasive witness, whose evidence was riddled with inconsistencies. 22In the event, I find that RCL was bound by the Four Agreements. Liew accepted that he had signed the Guarantees to guarantee the return of the principal and interest on the Agreements.53Foot Note 53×5/10/17 NE, pp 68–69.As the Agreements were valid and enforceable against RCL and RCL had defaulted on them, Liew was liable under the Guarantees. For completeness,I should add that the requirements for a contract of guarantee to be in writing and signed by the guarantor under s 6(b) of the Civil Law Act (Cap 43, 1999 Rev Ed) have been met.",
        "Tort of deceit": "23Having found Liew liable on the Guarantees, there was no need to consider the other causes of action against him. Nevertheless, I shall now consider the claim on the tort of deceit. The elements of the tort of deceit were set out inPanatron Pte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 (“Panatron”) at [14] (and recently reiterated inACTAtek, Inc and another v Tembusu Growth Fund Ltd[2016] 5 SLR 335 at [46]): … First, there must be a representation of fact made by words or conduct. Second, the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff. Third, it must be proved that the plaintiff had acted upon the false statement. Fourth, it must be proved that the plaintiff suffered damage by so doing. Fifth, the representation must be made with knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. 24First, Liew admitted to making the representations regarding the Four Investments (see [3] and [6] above).54Foot Note 54×4/10/17 NE, pp 112–115, and 132–137.Second, I find that he had made them with the intention that it would be acted upon by Zhou in entering into the Four Agreements. This intention was also borne out by the fact that Liew had given personal guarantees to Zhou; further, Liew stood to gain (by receiving fees) if Zhou entered into the Four Agreements and/or the Four Investments materialised.55Foot Note 55×5/10/17 NE, pp 26 and 28.Third, I find that Zhou had relied on Liew’s representations as Liew was his fund manager who had sourced for and recommended the investment products to Zhou.56Foot Note 56×4/10/17 NE, pp 70–71.In particular, Zhou had relied on Liew’s representation that RCL would manage the Four Investments and the funds placed by the investors therein,57Foot Note 57×3/10/17 NE, p 20.and that the LBI, 1ST2 and 2ST2 Investments were protected and safe investments. These representations would have had a real and substantial effect in inducing Zhou to enter into the Four Agreements. Thus, even if Zhou had, as Liew claimed, relied partly on his own experience in deciding to enter into the Four Agreements, he could nevertheless have been induced by Liew’s representations (Panatronat [21]–[23]). Fourth, it was apparent that Zhou has suffered damage,viz, the loss of his investment monies. 25Fifth, I find that Liew had made the representations with the knowledge that they were false or without any genuine belief that they were true. When the representations relating to the GT Investment were made, Liew and RCL had no intention to manage the GT Investment or Zhou’s funds invested in the loan placements for the GT Investment. Despite Liew’s insistence that he wanted to continue being a fund manager,58Foot Note 58×4/10/17 NE, p 126.all he set out to do was to broker the deal59Foot Note 59×5/10/17 NE, pp 25–26.and to ensure that Zhou received scheduled interest payments and updates. As for the LBI, 1ST2 and 2ST2 Investments, Liew admitted that he did not ascertain which companies in Wenzhou would receive the bridging loans and he had never seen any bridging loan documentation.60Foot Note 60×4/10/17 NE, pp 136–137.He did not open any bank account for the bridging loans and the Borrowing Companies did not provide security or personal guarantees.61Foot Note 61×4/10/17 NE, pp 137 and 141.Similarly, it was clear that Liew and RCL never intended to manage Zhou’s funds in these investments.62Foot Note 62×4/10/17 NE, pp 140–141. 26Accordingly, I am satisfied that Zhou’s claim against Liew for the tort of deceit is made out.",
        "Breach of fiduciary duty": "27Given my findings on Zhou’s claims under the Four Guarantees and the tort of deceit, I will deal with this issue briefly, which is related to Zhou’s claim in dishonest assistance and knowing receipt (see [83]–[86] below). I find that as the intended investment or fund manager under the Four Agreements, RCL and Liew (the alter ego of RCL, being its only shareholder and director) owed fiduciary duties to Zhou. Even if investment or fund managers do not fall within settled categories of fiduciaries, the circumstances of the case justify the imposition of such duties. 28InTan Yok Koon v Tan Choo Suan and another and other appeals[2017] 1 SLR 654 (“Tan Yok Koon”), the Court of Appeal set out a few observations on fiduciary law. First, the hallmark of a fiduciary obligation is that he is to act in the interests of another person. The distinguishing obligation of a fiduciary is the obligation of loyalty which entails that he must act in good faith for his principal’s benefit (at [192]). Second, a fiduciary obligation is a conclusion rather than a premise. The relationship is the reason why undertaken duties are fiduciary (at [193]). Third, fiduciary obligations are voluntarily undertaken (see alsoVivendi SA and another v Richards and another[2013] EWHC 3006 (Ch) at [137]–[141]). Such undertakings arise when the fiduciary voluntarily places himself in a position where the law can objectively impute an intention on his part to undertake these obligations (Tan Yok Koonat [194]). 29I find that Liew and RCL owed a duty to act in good faith for Zhou’s benefit, having voluntarily taken on the responsibility as Zhou’s fund manager handling Zhou’s investment monies. Based on my earlier findings on the mismanagement of Zhou’s investment monies, Liew and RCL had not acted in Zhou’s best interest, and were thus in breach of their fiduciary duties.",
        "Claim against SIPL, Mah and Gobind": "30Zhou’s claim against SIPL, Mah and Gobind rests on three planks.63Foot Note 63×Zhou’s SOC, paras 60–65.First, they have wrongfully retained $5,247,689.04 (“the Sum”) and have thereby been unjustly enriched. The Sum comprises $5m transferred to SIPL and the remaining being the converted sum of US$199,975 transferred to Mah. Second, they were entrusted to remit the Sum to the relevant parties for the purposes of the Four Investments, and thus were liable to Zhou for the sum by way of a constructive trust or a resulting trust. Third, they were conspiring with Liew, Marino, and Chen Jie to use unlawful means to defraud Zhou.64Foot Note 64×Zhou’s Closing Submissions at para 142. 31I make two quick points about developments at trial. First, Zhou’s counsel (Mr Quah) clarified at a late stage (before closing submissions) that Zhou’s claim on constructive trust was also premised on dishonest assistance and knowing receipt. Gobind’s counsel (Ms Lim) submitted that these causes of action have not been pleaded with sufficient particularity.65Foot Note 65×Gobind’s Closing Submissions at para 21.It should also be noted that being liable to make restitution under a constructive trust (as Zhou pleaded) is conceptually different from being liable to account as a constructive trustee should dishonest assistance or knowing receipt be made out (The “Chem Orchid”[2015] 2 SLR 1020 at [103]; Tang Hang Wu, “The Constructive Trust in Singapore: Five Persistent Puzzles” (2010) 22 SAcLJ 136 at para 3). Regardless, I will deal with these causes of action as they do not change my ultimate findings. 32Second, Mr Quah seemed unsure of his client’s position in relation to Gobind. In court, he put to Mah and Gobind that Mah had never handed Gobind $2,278,135, $2m or $1m (pertaining to the GT Investment, 1ST2 Investment 2ST2 Investment respectively), but subsequently withdrew his put questions against Gobind.66Foot Note 66×12/10/17 NE, pp 72–73; 13/10/17 NE, pp 62–63, 65.But in closing submissions, Mr Quah asserted that Gobind did not receive the $2,278,135 or $1m (pertaining to the GT Investment and 2ST2 Investment).67Foot Note 67×Zhou’s Closing Submissions, para 118(7).Even Zhou had claimed under cross-examination that the monies that Gobind had arranged for remittance to China were not necessarily his monies.68Foot Note 68×3/10/17 NE, p 18.If this is Zhou’s position, I fail to see how he has a claim against Gobind.",
        "Transfers of monies pursuant to the Four Investments": "33Before I determine Zhou’s claims against SIPL, Mah, and Gobind, it would be apposite to set out my factual findings on the money transfers relating to the Four Investments. GT Investment 34I turn to what had become of Zhou’s $1m principal for the GT Investment, which came from his returns on the Blackgold Investment and which Liew had transferred to SIPL. I find that Zhou’s $1m for the GT Investment had been transferred by SIPL to Gobind and then to Chen Jie or her representative. 35On 29 June 2011, Marino arranged with Gobind to remit $2,278,135 to Chen Jie’s and Sun Mian’s accounts.69Foot Note 69×AB 41.On 30 June 2011, Liew transferred $2,289,391.51 to SIPL (which included Zhou’s $1m (see [17]–[18] above). Mah then encashed $2,278,135 from SIPL’s account and handed it to Gobind for remittance to Chen Jie.70Foot Note 70×Mah’s AEIC, para 24; Bundle of AEICs (Vol 3), p 1006.On receiving $2,278,135, Gobind arranged for RMB10,124,950 (the equivalent of $2,278,135 at the agreed exchange rate) to be remitted to Chen Jie and Sun Mian’s accounts between 30 June 2011 and 5 July 2011. This is evidenced by the remittance or deposit slips and Gobind’s contemporaneous e-mail updates to Marino on the remittance transactions.71Foot Note 71×Bundle of AEICs (Vol 3), pp 1007, 1012, 1013, 1026, 1029, 1162–1165 and 1174–1187; Exhibit G. 36The contemporaneity of the transactions above supports Mah’s case that $2,278,135 was transferred to Chen Jie (or her representative) pursuant to Chen Jie’s instructions and her arrangements with RCL, and that the amount came from Liew’s transfer to SIPL of $2,289,391.51. The $2,278,135 withdrawn from SIPL’s account and subsequently transferred to China was well in excess of Zhou’s $1m stake (in the $2,289,391.51 initially deposited) and would have included Zhou’s $1m. Indeed, after $2,278,135 was withdrawn from SIPL’s account, the account was largely depleted with a remaining sum of $105,167.72Foot Note 72×AB 572. LBI Investment 37For the LBI Investment, only the sum of US$200,000 (the other RMB3,980,580 was directly remitted to Chen Jie73Foot Note 73×Bundle of AEICs (Vol 2), p 203.) is in dispute. Zhou had transferred US$200,000 to Mah on Brian’s instructions. On 11 August 2011, Mah received US$199,975 (with US$25 deducted by the bank as “[sender’s] charges”), which she then converted to Singapore dollars of $247,689.04.74Foot Note 74×AB 235–236; Bundle of AEICs (Vol 3), p 1034.However, Mah did not explain what she did with the US$199,975 (or $247,689.04) and could not recall what this amount was for.75Foot Note 75×12/10/17 NE, p 57.Despite knowing that it was Zhou’s money for investment, there was no evidence that she was instructed by RCL or Chen Jie on what to do with this sum or that she had it transferred to Chen Jie or returned to Zhou. Mah also failed to explain why she had converted the US$199,975 to Singapore dollars. Although Mah had subsequently transferred a total of $75,000 each to Zhou and Liew in September 2011, the documents showed (and Mah admitted) that these were interest payments for earlier investments that were made not only to Zhou but to Liew.76Foot Note 76×Mah’s AEIC, paras 34 and 35 and exhibits therein; 12/10/17 NE, p 70.These monies were not transferred for the LBI Investment or any other investments. Accordingly, Mah has not accounted for the US$199,975. 1ST2 Investment 38On 18 August 2011, Zhou transferred $2m to SIPL to invest in a Bidding Deposit Investment (“BD Investment”). He obtained some returns from the BD Investment as interest.77Foot Note 77×Exhibit A; 6/10/17 NE, p 33.The principal of $2m invested in the BD Investment was then channelled into another investment (“Investment Z”) on which Zhou also obtained returns. Subsequently, the principal of $2m from Investment Z was then rolled over as principal for the 1ST2 Investment.78Foot Note 78×6/10/17 NE, pp 32–33; Exhibit A, items 3, 4 and 7. 39I accept that Chen Jie instructed Mah to remit $2m to her in China when SIPL received $2m from Zhou on 18 August 2011.79Foot Note 79×AB 574; Bundle of AEICs (Vol 3), p 1035.This was supported by Marino’s e-mail to inform Gobind of the bank account details for the money transfer, although the remittance amount was not stated because it had been agreed to orally.80Foot Note 80×12/10/17 NE, p 58; Bundle of AEICs (Vol 3), p 1036.Mah also issued two DBS cash cheques from SIPL’s account (cheque 301077 and cheque 301078 dated 19 August 2011 for $500,000 each) and handed them to Manjeet, Gobind’s employee. She also handed another $1m in cash to Gobind.81Foot Note 81×AB 574; Mah’s AEIC at para 31.Although Manjeet claimed that he did not receive the two cheques from Mah, I find that he had encashed cheque 301077 on 19 August 2011. His name and identification number were recorded on the cheque,82Foot Note 82×AB 255.and Jasslyn Teo from DBS bank confirmed that as a matter of general practice, bank officers would record the particulars of the person encashing the cheque on the back of the cheque.83Foot Note 83×6/10/17 NE, p 4. 40Gobind’s testimony has been consistent in that he had received $2m in total from Mah around 19 August 2011 and had contemporaneously arranged to remit RMB10,399,950 (the equivalent of $2m at the agreed exchange rate) to Chen Jie.84Foot Note 84×PBA, Tab 3 (Gobind’s Affidavit of 23 October 2014), paras 7–9; Gobind’s AEIC, paras 17 and 25.The transactions are evidenced by SIPL’s bank statement, the remittance slips and Gobind’s e-mail to Marino of 19 August 2011 to ask him to confirm the remittances.85Foot Note 85×AB 574; Bundle of AEICs (Vol 3) pp 1039–1054 and 1298–1309.Based on the contemporaneity of all the transactions, I also accept that Zhou’s $2m, which was transferred to SIPL on 18 August 2011 for the BD Investment, was withdrawn from SIPL’s account and transmitted to Chen Jie. Zhou himself agreed that his $2m was transferred to the investment party for the BD Investment and he had even obtained returns on his investment.86Foot Note 86×6/10/17 NE, p 33.In any event, SIPL’s bank balance after the sums were withdrawn was only $29,559.93.87Foot Note 87×6/10/17 NE, p 33; AB 574.There is also no evidence that any part of Zhou’s principal of $2m for the BD Investment had returned to SIPL or Mah when it was rolled over to Investment Z and then to the 1ST2 Investment. 41Hence, I find that Mah had handed Gobind $2m (ie, via cheques 301077 and 301078 and $1m in cash) and that the sum had been transferred to Chen Jie. 2ST2 Investment 42On 30 September 2011, Zhou transferred $2m to SIPL for an investment (“Investment X”).88Foot Note 88×Bundle of AEICs (Vol 3), p 1076.Zhou stated that when Investment X matured, Liew had rolled over $2m as Zhou’s principal for the 2ST2 Investment.89Foot Note 89×6/10/17 NE, pp 34–35; Exhibit A, items 6 and 8.Mah admitted that SIPL received the $2m on 30 September 2011 from an investor, and I accept that she was then instructed by Chen Jie to remit $1m to her. I accept that Mah had withdrawn $1m from SIPL’s account (by encashing a cash cheque 301083 for $1m) before giving it to Gobind, who then remitted RMB4,440,000 to an account under one “Chen Yi”, who was Chen Jie’s sister.90Foot Note 90×Mah’s AEIC, paras 37–38; 12/10/17 NE, p 71.These transactions are supported by a copy of cash cheque 301083, SIPL’s bank statement, Marino’s e-mail to inform Gobind of the details of the account for remittance, Gobind’s subsequent e-mail to inform Marino of the remittance, and the remittance slips.91Foot Note 91×Bundle of AEICs (Vol 3), pp 1077–1093, 1312; AB 575.Again the contemporaneity of the transactions supports that this $1m transferred to SIPL on 30 September 2011 for Investment X had been withdrawn and transmitted to China on Chen Jie’s instructions. I further accept that the monies were not in fact remitted until around 5 to 7 October 2011 because Gobind was only provided the details of the receiving account on 4 October 2011.92Foot Note 92×Bundle of AEICs (Vol 3), p 1312; 12/10/17 NE, pp 80–81. 43However, even if Mah did not know that Zhou’s $2m was meant specifically for Investment X, there was no evidence that SIPL had transmitted the remainder $1m (from the $2m that Zhou had transferred to SIPL for Investment X) onwards for any investment.93Foot Note 93×AB 576.Although Mah had, on Brian’s instructions, issued a $1,020,000 cheque to Zhou on 3 October 2011 which Zhou received, this was not Zhou’s returns on Investment X. The documents (which Mah had sight of contemporaneously) showed that this was Zhou’s returns (of principal and interest) on an earlier investment made with RCL around 19 September 2011 and which had matured.94Foot Note 94×6/10/17 NE, p 37; AB 481; Exhibit A, item 5. 44Additionally, Mah sought to show that she had made various payments back to both Zhou and Liew from late September 2011 to February 2012. The documents showed that these were also interest payments for other investments (which Mah admitted) and which were made not only to Zhou but to Liew.95Foot Note 95×Mah’s AEIC, paras 40–46 and exhibits therein; 12/10/17 NE, p 70. Phoenix Realty 45At this juncture, I deal with a transaction relating to Phoenix Realty Pte Ltd. Around 19 September 2011, Mah transferred $920,796.23 to that entity for the purposes of purchasing a property. This transfer occurred after Zhou had transferred $1m to SIPL’s account on the same day.96Foot Note 96×Mah’s AEIC, para 36.Zhou claimed that the $920,796.23 came from his $1m forwarded to SIPL for purposes of investment with RCL and that it had been misused to purchase the property.97Foot Note 97×Zhou’s AEIC, para 62.However, it is undisputed that the $1m transferred to SIPL by Zhou is not part of Zhou’s claim in this suit.98Foot Note 98×12/10/17 NE, pp 67–68; Bundle of AEICs (Vol 3), pp 1070–1073.In fact, Zhou had obtained the return of the full principal sum plus interest on that $1m.99Foot Note 99×6/10/17 NE, p 37; AB 481; Exhibit A, item 5.I therefore find this transaction irrelevant to this case. Conclusions on the flows of monies relating to the Four Investments 46I restate my findings relating to the Four Investments: (a)GT Investment: SIPL received but did not retain any of Zhou’s $1m. It formed part of the $2,278,135 that Gobind remitted onwards. (b)LBI Investment: Mah received US$199,975 from Zhou and converted this sum into Singapore dollars $247,689.04 but has not provided any explanation for how she dealt with it. (c)1ST2 Investment: SIPL received but did not retain any of Zhou’s $2m meant for the BD Investment as this sum was handed over to Gobind who then remitted RMB10,399,950 to Chen Jie. (d)2ST2 Investment: SIPL received $2m from Zhou meant for Investment X. Mah handed $1m to Gobind, who then remitted RMB4,440,000 onwards. No explanation has been provided for the other $1m. (e)Gobind’s role was to arrange for the monies to be remitted to the stated accounts as instructed by Mah or Marino, and there is no evidence that he knew of the purpose of the monies entrusted to him to remit, nor of the various investments between Zhou and RCL.100Foot Note 100×12/10/17 NE, p 77–78.All monies received by Gobind were remitted to Sun Mian, Chen Jie, or Chen Yi. 47Zhou’s position is that apart from the $2m that Gobind received in respect of the BD Investment, Gobind had not received any monies from Mah or SIPL.101Foot Note 101×Zhou’s Closing Submissions, paras 118(7) and (8).This argument, made by Mr Quah, is premised on the following “curious points”: (a)First, the 11 deposit slips documenting the remittances to China were not produced in response to Zhou’s earlier request for discovery and interrogatories.102Foot Note 102×Zhou’s Closing Submissions, para 82.They were adduced only after Mah had produced them. The defendants did not call any witnesses to comment on the issuance or receipt of the deposit slips. Further, Gobind was able to obtain the remittance slips for the BD Investment the first time round by searching through his e-mail inbox, and there was no reason why he could not have located the e-mails relating to the other remittances.103Foot Note 103×Zhou’s Closing Submissions, para 88.Mr Quah submits that the slips should therefore not be given any weight.104Foot Note 104×Zhou’s Closing Submissions, para 84.Since Gobind has no recollection of receiving monies from Mah,105Foot Note 105×Gobind’s AEIC, para 25(a).and his inference of receipt was solely premised on the deposit receipts,106Foot Note 106×Zhou’s Closing Submissions, para 118(7).Gobind did not receive the first tranche of monies. (b)Second, the exchange rates for the remittances departed from the Bank of China’s official exchange rates in an entirely random manner.107Foot Note 107×Zhou’s Closing Submissions, para 105. (c)Third, Mah’s placid response to Gobind’s denial of receiving monies from her is abnormal as one would have expected her to remind Gobind of the transfer.108Foot Note 108×Zhou’s Closing Submissions at para 108. 48I do not accept Zhou’s position for the following reasons: (a)At trial, Mr Quah confirmed that he was not disputing the authenticity of the documents and that he would “take the face value of the documents being deposit slips”.109Foot Note 109×12/10/17 NE, p 55.The remittance slips clearly show transfers to Sun Mian, Chen Jie, or Chen Yi. Mah and Marino also did not allege that Gobind had failed to remit the monies as instructed. In any case, I accept Gobind’s explanation that he did not mention these slips in his affidavit filed on 30 October 2014 because they had slipped his mind as the transactions took place six years ago and he has handled numerous transfers since.110Foot Note 110×13/10/17 NE, p 34. (b)Although the conversion to Renminbi was not based on the official bank rate, nothing material turns on this. I accept Gobind’s explanation that, in practice, the exchange rate is quoted by the money remitter and agreed with the party who is sending the money, as the money remitter would likely earn a fee through the exchange rate.111Foot Note 111×13/10/17 NE, pp 45, 48–50. (c)More importantly, it bears repeating that based on the documentary records, the contemporaneity of the transfers of money from Zhou or Liew to SIPL along with the transfers of SIPL to Gobind supported my findings that these transfers were linked. 49For completeness, that SIPL or Mah may have retained the difference of about $11,000112Foot Note 112×Zhou’s Closing Submissions, para 74.(ie, $2,289,391.51 minus $2,278,135 transferred to Gobind in relation to the GT Investment) is neither here nor there, given that Zhou’s stake was only $1m out of the $2,289,391.51. Additionally, transfer of monies by SIPL for Dongfang Shipbuilding (Group) Co Ltd (“Dongfang”), which Mr Quah raised, were transfers made into Dongfang’s Maybank account in Singapore,113Foot Note 113×6/10/17 NE, p 77; 12/10/17 NE, p 79; AB p 820.and which occurred in May 2011,114Foot Note 114×AB 820.well before Zhou gave any money for the Blackgold Investment, BD Investment or any other investments. 50I now proceed to deal with Zhou’s claims adumbrated above at [30].",
        "Unjust enrichment": "51In a claim for unjust enrichment, following elements have to be satisfied (Wee Chiaw Sek Anna v Ng Li-Ann Genevieve(sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Anna Wee”) at [98]–[99]): (a)the defendant has been benefitted or been enriched; (b)the enrichment was at the expense of the claimant; (c)the enrichment was unjust; and (d)there are no applicable defences. 52It is uncontroversial that monetary transfers can constitute a “benefit”. The requirement that such benefit be at the expense of the claimant means that there must be a nexus between the parties. Such nexus can be established where the defendant receives an immediate benefit from the claimant or receives a benefit traceable from the claimant’s assets (Anna Weeat [112], [115]–[116]).The essence of the defendants’ case is that all of Zhou’s monies have been remitted to Chen Jie or her representatives.115Foot Note 115×Gobind’s Closing Submissions at para 60.2; Mah and SIPL’s Closing Submissions at para 44. Claim in respect of $1m (GT), $2m (1ST2) and $1m (2ST2) 53I will deal first with the monies that have been remitted by SIPL to Gobind. I find that the defendants should not be liable for these monies as they had been received ministerially or because there was a change of position. That the defendants had not explicitly made these arguments in their pleadings or submissions pose no difficulty as they had pleaded that their roles were merely to remit monies to Chen Jie, that they remitted monies in accordance with instructions, and that they did not benefit from the transactions. Ultimately, the object of pleadings is to ensure that the other side is not taken by surprise, and Zhou was well-apprised of the defendants’ position. 54A defendant who receives assets as an agent and passes them to his principal may be able to escape liability in unjust enrichment on the basis that he received the assets ministerially, and not for his own use and benefit (Chua Kwee Sin v Venerable Sek Meow Di (Tang Kheng Tiong, third party)[2013] SGHC 265 at [54];Goff & Jones: The Law of Unjust Enrichment(Sweet & Maxwell, 9th Ed, 2016) (Charles Mitchell, Paul Mitchell & Stephen Watterson eds) (“Goff & Jones”) at para 4-68). This has also been referred to as the agency defence (Andrew Burrows,The Law of Restitution(Oxford University Press, 3rd Ed, 2011) (“Burrows”) at p 559). Save for the US$199,975 relating to the LBI Investment and the $1m relating to the 2ST2 Investment (see [46(b)] and [46(d)] above), I find that Mah, SIPL and Gobind had received the monies ministerially as they had remitted these monies onwards to Chen Jie or her representatives. 55Aside from ministerial receipt, Mah, SIPL, and Gobind could also rely on the defence of change of position based on the same fact pattern. InManagement Corporation Strata Title Plan No 473 v De Beers Jewellery Pte Ltd[2002] 1 SLR(R) 418 (“De Beers”) at [35], the Court of Appeal set out the following requirements: (a)the person enriched had changed his position; (b)the change wasbona fide; and (c)it would be inequitable to require the person enriched to make restitution or to make restitution in full. There must also be a causative link between the receipt of the benefit and the change of position. In other words, the recipient must show that but for the receipt of the benefit, it would not have changed its position (Cavenagh Investment Pte Ltd v Kaushik Rajiv[2013] 2 SLR 543 (“CavenaghInvestment”) at [67];Skandinaviska Enskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltdand another and another suit[2009] 4 SLR(R) 788 at [329]). 56On the facts, the monies that Mah and SIPL remitted to Chen Jie (or her representatives) through Gobind constitute a change of position. Further, the causative link between receipt and the change of position is also made out: but for the direct or indirect receipt of monies from Zhou, the third to fifth defendants would not have remitted monies to Chen Jie. 57Both ministerial receipt and change of position are subject to the requirement that the defendant must have acted in good faith, although in the context of ministerial receipt, it has been expressed as a rule that the agent must not have notice of the plaintiff’s claim at the time he transfers the received assets to his principal (Burrowsat p 565;Jones v Churcher[2009] EWHC 722 (QB) at [68] and [78]). InCavenagh Investment, Chan Seng Onn J, after consideringGeorge Raymond Zage IIIand another v Ho Chi Kwong and another[2010] 2 SLR 589 (“George Raymond Zage”) which approved and adopted the test inBarlow Clowes International Ltd (in liquidation) and others v Eurotrust International Ltd and others[2006] 1 All ER 333 (“Barlow Clowes”), held that the meaning of lack of good faith in the context of the defence of change in position was not inconsistent with the meaning of dishonesty in the context of liability for dishonest assistance (at [71]). A defendant lacks good faith if he acts in a commercially unacceptable way, and such behaviour is made out if he fails to query the irregular shortcomings of the transaction that ordinary honest people would so query. Put another way, a defendant would not be acting in good faith if the circumstances of transaction were such that he would be put on notice. In my judgment, there is no reason why this should not similarly apply to ministerial receipt. 58Further, inM+W Singapore Pte Ltd v Leow Tet Sin and another[2015] 2 SLR 271, Judith Prakash J (as she then was) held that theBarlow Clowestest involves two stages (at [42]). First, a subjective assessment of what the defendant knew about the transaction. Second, an objective assessment of whether participation in the transaction with such knowledge would offend ordinary standards. 59I turn now to address the third to fifth defendants’ knowledge to ascertain whether they were acting in good faith. Mah’s, SIPL’s and Gobind’s knowledge 60I make two quick observations at the outset. First, Mah was evidently not forthcoming on her business experience and SIPL’s scope of work. Based on ACRA searches, Mah was a shareholder and/or director of more than ten companies (many of which have since been struck off) apart from SIPL.116Foot Note 116×Exhibit B.Mah tried to distance herself from these companies: her evidence was that she was merely acting as a proxy for other individuals, that the companies did not do any business, that the reported capital was not paid in, or that she was not part of the operations of the business.117Foot Note 117×6/10/17 NE, pp 46–47, 51, 57–60.When queried on what SIPL’s business was, she claimed that it provided “advisory services to investors”, without being able to elaborate convincingly.118Foot Note 118×6/10/17 NE, p 69.The same goes for Marino’s testimony. The court was unsatisfactorily left with a vague understanding of SIPL. Indeed, all that could be gleaned from the ACRA records was that SIPL’s principal activities were the holding of investments and the provision of business and investment consultancy services.119Foot Note 119×Exhibit B-27. 61The other point pertains to SIPL’s knowledge (and this relates to the elements of the allegation of conspiracy as well, which I will deal with later), that the parties did not address. In order to fix a company (being an artificial construct) with the requisite intention or state of mind, it is necessary to pinpoint some human actor with that state of mind and to determine whether, as a matter of law, that state of mind also counts as the company’s via a process of attribution (The “Dolphina”[2012] 1 SLR 992 (“The Dolphina”) at [205]). Two attribution doctrines may be invoked here. The first is that of agency, which entails the imputation to a principal of knowledge relating to the subject matter of the agency which the agent acquires while acting within the scope of his authority. The second is that of identification, which involves the identification of the directing mind and will of the company (The Dolphinaat [216], [235] and [239]). In my view, Mah’s and Marino’s knowledge (and there appears to be no difference between the two) are attributable to SIPL. Mah is SIPL’s director and the directing mind and will of SIPL. Marino is SIPL’s business development executive120Foot Note 120×Mah’s AEIC, para 1; Marino’s AEIC, para 1.and corresponded on SIPL’s behalf pertaining to the investment monies. 62What was the extent of Mah/Marino and SIPL’s knowledge? I find that while Mah and Marino knew that the monies transferred to SIPL or to Mah were investors’ monies for investment,121Foot Note 121×Mah’s AEIC, para 27; 12/10/17 NE, pp 32, 57 and 76; 13/10/17 NE, pp 12–13.there is no evidence that Mah or Marino knew or could have known of the investment projects that Zhou was involved in or the specific purpose that Zhou’s money was to be applied. Zhou admitted as much,122Foot Note 122×3/10/17 NE, pp 25 and 42.and I accept that Mah did not know of Zhou’s investments or Liew’s representations to Zhou pertaining to the Four Investments.123Foot Note 123×Mah’s AEIC, para 21; 12/10/17 NE, p 78.Consistent with her testimony in court and an earlier affidavit of hers, I accept that Mah was instructed by Liew and Chen Jie to apply the monies in accordance with the instructions given by Liew, Chen Jie, Brian, or RCL.124Foot Note 124×PBA, Tab 1 (Mah’s Affidavit of 4 July 2014) para 7; 12/10/17 NE, pp 17–19, 27–28.Liew and Chen Jie were business partners in China, and Chen Jie was Liew’s business contact there for the Four Investments and the person whom Liew would enter into corresponding loan contracts relating to the investments (see [9] above). Essentially, RCL had obtained Mah and SIPL’s assistance to effect the transfers of investors’ monies invested with RCL, and Mah made a living by using SIPL as an intermediary for RCL for a fee, as she had done for Dongfang and when making remittances on behalf of students.125Foot Note 125×6/10/17 NE, p 77; 13/10/17 NE, p 20; AB 820; Exhibit F, Tab 5 – Marino’s affidavit, para 8(d). 63The case against Gobind is more tenuous. Mah testified that she did not inform Gobind that the monies to be remitted to Chen Jie came from Zhou, and added that she was “sure” that Gobind did not know of the investments.126Foot Note 126×12/10/17 NE, pp 77–78. 64I am cognisant of some other facts that gave rise to a suggestion of impropriety. In essence, Mr Quah pointed out three things. First, the redundancy of Mah/SIPL and Gobind since they had to get some other remitter to remit the monies to China.127Foot Note 127×12/10/17 NE, p 24.Second, Mah handled such large sums and even withdrew about $2.27m in cash to hand to Gobind.128Foot Note 128×12/10/17 NE, pp 19, 34; Zhou’s Closing Submissions, paras 77–79.Third, no records were kept to document the transfer of monies from Mah/SIPL to Gobind.129Foot Note 129×12/10/17 NE, p 69. 65In relation to the first point, I agree that the inclusion of Mah and SIPL was not satisfactorily explained. Mah claimed that Chen Jie involved her and SIPL because Chen Jie “had no account in Singapore” and trusted them as they were from Wenzhou.130Foot Note 130×12/10/17 NE, pp 22–23.But that does not address why so many intermediaries were needed. Indeed, Mah agreed that Chen Jie could have dealt directly with Gobind.131Foot Note 131×12/10/17 NE, p 23.All things considered however, I am not satisfied that this factor led to the conclusion that Mah, SIPL, and Gobind had acted in bad faith. 66As for the second point, Mah knew that RCL was involved in investments for its clients and that the monies that came into her or SIPL’s account were investors’ monies to be applied for investment purposes. In that light, that such sums were transferred to her or SIPL’s account did not suggest any impropriety.132Foot Note 132×12/10/17 NE, p 19.Such sums had to be handed over to Gobind as cash because it was troublesome for the money remitter to handle cheques, and Gobind confirmed that he had instructed Mah on the preferred mode of receiving money which was generally in cash.133Foot Note 133×12/10/17 NE, pp 36–37, 59; 13/10/17 NE, p 56.Gobind had also previously obtained cash of about $0.5m on various occasions to open letters of credit for customers.134Foot Note 134×13/10/17 NE, pp 35, 37. 67As regards the third point, Gobind explained that no records were kept because these remittances were not part of his line of business.135Foot Note 135×13/10/17 NE, p 40.Moreover, it was not as if there were no documentation at all. The money transfers by Gobind on Mah’s and SIPL’s behalf were evidenced by the remittance or deposit slips and Gobind’s contemporaneous e-mail updates on the remittance transactions. 68In my view, there are facts that point away from irregularity instead. First, it was not as if monies were transferred in one direction (ie, away from Zhou). SIPL had, on various occasions, transferred monies to Zhou and Liew as their investment returns. Second, the e-mail correspondences between RCL and Marino (representing SIPL) and even Chen Jie did not reveal anything suspicious. To the contrary, there was substantial e-mail correspondence dealing with interest payments and the repayment of principal, which would have instead indicated to Mah and SIPL that various investments were afoot.136Foot Note 136×Bundle of AEICs (Vol 3), pp 1209–1218, 1250–1251, 1271–1272.For instance, Brian had e-mailed Chen Jie (and which Marino was copied on) to remind her of interest payments due to Zhou under a lending business agreement, and for the return of $1,020,000 for another investment.137Foot Note 137×Bundle of AEICs (Vol 3), p 1250; AB 481; Exhibit A, item 5. 69All things considered, there is insufficient evidence to show bad faith on the third to fifth defendants’ part. I had earlier found that their roles were to transfer the money from Zhou or RCL to the proper party, and there was no evidence that they knew that the monies were to be applied for a specified purpose (ie, for the GT Investment, etc). The documents support that they had done so in accordance with proper instructions. It would be inequitable to require them to make restitution for the monies that had been remitted to Chen Jie. They had received those monies ministerially. Alternatively, they could rely on a change of position defence. That they would have likely earned a fee or commission for the remittances does not mean that they have been enriched at Zhou’s expense, as it was normal for fees to be charged for such services. Unjust enrichment claim in respect of US$199,975 (LBI) and $1m (2ST2) 70I turn now to the US$199,975 intended for the LBI investment, and the $1m intended for Investment X (which was to be rolled over to the 2ST2 Investment). These sums were received by Mah and SIPL respectively, and based on my earlier findings (see [37], [43] and [44] above), these sums have not been transferred to Chen Jie. 71I will focus, in particular, on the requirement of an unjust factor. There is no freestanding claim in unjust enrichment on the abstract basis that it would be “unjust” for the defendant to retain the benefit. Instead, there must be a recognised “unjust factor or event which gives rise to a claim” (Anna Weeat [134];Singapore Swimming Club v Koh Sin Chong Freddie[2016] 3 SLR 845 at [93]). Mr Quah has not identified the unjust factor that he is relying on; he had merely stated that the retention of Zhou’s funds would be wrongful. 72Nevertheless, I will go on to consider the ground on failure of consideration or basis, which appears to be the most relevant factor. This ground was recently applied inCristian Priwisata Yacobandanother v Wibowo Boediono and another and another suit[2017] SGHC 8 (“Wibowo Boediono”). InWibowo Boediono, monies were transferred as consideration for shares in properties, but the joint investment was not carried out. George Wei J held that the ground is made out when a promisor does not provide what has been promised. This can arise in both a contractual and non­contractual context where advances were made to further a particular purpose or goal, and the purpose or goal fails. In such cases, the recipient in general must return the advance (Wibowo Boedionoat [189]). InGoff and Jones, the editors explain that the idea underlying failure of basis is that “a benefit has been conferred on the joint understanding that the recipient’s right to retain it is conditional. If the condition is not fulfilled, the recipient must return the benefit” (at para 12-01). This joint basis is key and it is to be ascertained objectively; uncommunicated subjective thoughts are irrelevant (Supercars Lorinser Pte Ltd and another v Benzline Auto Pte Ltd[2016] SGHC 281 at [41]). 73In multi-party cases, it is not apparent how the fundamental requirement of a joint understanding will be satisfied (Goff & Jonesat para 13-05): must the defendants (Mah and/or SIPL) know of the understanding shared by the claimant (Zhou) and the third party (Liew)? In relation to the US$199,975, even if Zhou and Liew had a joint understanding that the monies were meant for the LBI Investment, there was certainly no joint understanding between Mah and Zhou about how the monies ought to be used except that Mah knew it was meant for investment. That said, there was a common understanding among Zhou, Liew and Mah/SIPL, or between any two of them, that the US$199,975 received by Mah was Zhou’s money meant for investment. Mah knew this even if she did not know the exact investment it was to be applied to. In this case, it is clear that the purpose or condition had not been fulfilled, as Mah cannot even recall or explain what she had done with this money. Hence she must return the benefit. For similar reasons, Mah would not be able to escape liability on the basis of ministerial receipt. 74This common understanding similarly applied to the $2m (pertaining to the 2ST2 Investment) originally transferred by Zhou to SIPL and intended for Investment X. Mah knew that this was Zhou’s money for investment, and she had remitted $1m onwards to Chen Jie through Gobind. However, Mah had failed to explain what had happened to the remaining $1m. Although SIPL had on 3 October 2011, issued a cheque to Zhou for $1,020,000, she did not explain how this was related to the remaining $1m which she had receivedfrom Zhouand which had to betransferred onwards for investment. Indeed, she would have known from the e-mails between Brian, Chen Jie and Marino (and Mah admitted that she read e-mails sent to Marino), that the $1,020,000 wasreturnson adifferentinvestment which had matured and was to bereturnedby Chen Jie or RCLto Zhou (see also Mah and SIPL’s counterclaim below at [97]).138Foot Note 138×Bundle of AEICs (Vol 3), pp 1094–1095; AB 481.Knowing that the whole of $2m was Zhou’s money meant for investment, and having only dealt with $1m in that manner, it is clear that the purpose for the remainder $1m had not been fulfilled and must be returned to Zhou. 75In this case, the defence of change of position would not apply as Mah has not shown a causative link between the receipt of the benefit (the remaining $1m received from Zhou) and the change of position (the transfer of $1,020,000 to Zhou on Chen Jie’s or RCL’s behalf). Mah did not adduce evidence to show that she would not have transferred the $1,020,000to Zhoubut for the earlier receipt of $2mfrom Zhou. Moreover, the circumstances were so irregular that ordinary honest people would have made further queries (see [57] above). The sum of $2m was transferred to SIPL for investment purposes, yet there was no designated recipient for the remaining $1m. It was not open for Mah to argue that the $1m constituted part of the $1,020,000 that she paid to Zhou, when she would have known that this $1,020,000 represented the returns from a different investment. This set of transactions was also unlike the earlier rollovers done by Chen Jie or Liew in respect of other investments. I therefore find that Mah was not acting in good faith in respect of this $1m. It follows that Mah would also not be able to rely on the defence of ministerial receipt. 76As an aside, it would appear from the foregoing that what Zhou is actually claiming is the $1m intended for Investment X (and not the 2ST2 Investment), which was not pleaded. That said, none of the defendants are taken by surprise and no objection has been made about this point in the defendants’ pleadings and closing submissions. 77As anin personamremedy is all that Mr Quah sought in respect of the unjust enrichment claim,139Foot Note 139×Zhou’s Closing Submissions, para 147.I find that Zhou is entitled to recover $247,689.04 (being the converted sum of US$199,975) from Mah and $1m from SIPL as personal restitutionary awards. 78I also find Mah jointly and severally liable for the $1m received by SIPL because the corporate veil should be lifted on the basis that Mah was SIPL’s alter ego. InAlwie Handoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 (“Alwie Handoyo”), the Court of Appeal lifted the corporate veil to find a company’s controller personally liable for an unjust enrichment claim. V K Rajah JA held that the applicable test was whether the company was carrying on the business of its controller (at [96]). On the facts of that case, the Court of Appeal agreed with the lower court’s finding that the controller in question (“Alwie”) had made no distinction between himself and his company (“OAFL”). Alwie was the directing mind and will of OAFL and although the monies constituting the enrichment was paid into OAFL’s bank account, Alwie was the beneficial owner of the account and had operated the account as if it was his own personal bank account. Likewise, Mah was the sole shareholder of SIPL. Her evidence was that her role in the transactions was “merely that of a friend helping out a friend”.140Foot Note 140×Mah’s AEIC, para 20; 12/10/17 NE, p 22.Yet she used SIPL to receive monies from Zhou, transfer them onwards to Gobind, and make interest payments on Chen Jie’s behalf.141Foot Note 141×Mah’s AEIC, paras 40; Bundle of AEICs (Vol 3), pp 1104–1105, 1113–1114.The way Mah used SIPL for her own personal affairs was indicative of how she treated SIPL as an extension of herself. Hence, I lift the corporate veil and find Mah liable for the $1m received by SIPL.",
        "Remedial constructive trust": "79I turn now to address the issue of constructive trust. Zhou’s submission is that if unjust enrichment is made out, then the court should impose a constructive trust on “funds in the possession of the guilty party as anin remremedy to return those funds to Zhou”.142Foot Note 142×Zhou’s Closing Submissions, paras 145–147.By this, Zhou must mean a remedial constructive trust (“RCT”) as the scenario does not fit within any categories of institutional constructive trusts (on the distinction between the two: seeGuy Neale and others v Nine Squares Pty Ltd[2013] SGHC 249at [140]–[141]). 80InAnna Wee, the Court of Appeal held that an RCT is to be imposed only where the payee’s conscience is affected, and the basis of an RCT is founded on fault which is predicated on a state of knowledge which renders it unconscionable for the recipient to keep the monies (at [171]–[172]). The Court citedChing Mun Fong (executrix of the estate of Tan Geok Tee, deceased) v Liu Cho Chit[2001] 1 SLR(R) 856 for the proposition that “the payee’s conscience must have been affected, whilethemonies in question still remain with him” [emphasis added] for an RCT to arise, stressing that the fact giving rise to the court’s discretion to impose an RCT is not the fact of unjust enrichment, but theknowing retentionof the monies in a way that affects the recipient’s conscience. This may arise separately from a strict liability claim in unjust enrichment, although the facts giving rise to an RCT may arise subsequently to or concurrently with the unjust enrichment claim (at [183]–[184]). 81On the facts, a claim in RCT would fail, as all of Zhou’s monies (apart from the US$199,975 pertaining to the LBI Investment and the $1m pertaining to the 2ST2 Investment) had been remitted to China. Even in relation to the US$199,975 and $1m, an RCT could not be imposed as the monies have since been dissipated. After the receipt of US$199,975 in Mah’s foreign currency account, a transfer of US$119,942.43 was made to another account and a cheque for US$85,000 was issued, leaving a balance of only $914.94 in that foreign currency account.143Foot Note 143×AB 595–596.The same applies to the $1m pertaining to the 2ST2 Investment. After $2m was received from Zhou on 30 September 2017, $1m was withdrawn on the same date and handed over to Gobind, and a cheque for $1,020,000 was issued on 3 October 2017, leaving a balance of $156,066.40.144Foot Note 144×AB 576. 82If Zhou wanted to obtain aproprietaryrestitutionary remedy (in respect of monies in Mah’s or SIPL’s accounts or otherwise), it had to establish some proprietary link to the money claimed via rules of following and tracing (Tjong Very Sumito and others v Chan Sing En and others[2012] 3 SLR 953 at [86]). This would involve establishing the flow of the trust assets from where it was at the outset to where it is said to be at the end (The State-Owned Company Yugoimport SDPR (also known as Jugoimport-SDPR) v Westacre Investments Inc and other appeals[2016] 5 SLR 372 at [72]). Not having done this precursory step of tracing, Mr Quah had not identified property that can properly be regarded as representing a substitute of Zhou’s property. Accordingly, Zhou’s remedial constructive trust claim fails.",
        "Dishonest assistance and knowing receipt": "83In relation to the monies transferred to Gobind and which Gobind transmitted onwards, I go on to consider whether Zhou could maintain a claim for dishonest assistance or knowing receipt, as I have disallowed Zhou’s claim in unjust enrichment in respect of these sums. 84The tests for dishonest assistance and knowing receipt were both set out by the Court of Appeal inGeorge Raymond Zage.For present purposes, it should be noted that for dishonest assistance, assistance of the breach of trust or fiduciary duty has to be rendereddishonestly(at [20]), and for knowing receipt, there must have beenknowledge on the part of the defendantthat the assets received are traceable to a breach of trust or fiduciary duty. The defendant’s state of knowledge must be such as to make it unconscionable for him to retain the benefit of the receipt (at [23]). 85Suffice to say, in relation to the monies that Mah had transferred to Gobind and which Gobind transmitted onwards, my findings above at [69] would mean that the mental elements of dishonest assistance and knowing receipt are not satisfied in respect of Mah, SIPL, and Gobind. 86Having found that Zhou succeeds in his claim in unjust enrichment against Mah pertaining to the US$199,975 and against Mah and SIPL pertaining to the $1m (see [74] and [78]), I need not consider dishonest assistance and knowing receipt in respect of these sums. Zhou is not seeking any personal remedy in excess of the investment monies that he has lost and cannot avail himself of any proprietary remedy (see [82] above). That said, if I had to consider the matter, I would have allowed the claim in knowing receipt in respect of these sums. A knowing recipient may be liable where he receives trust property or property in respect of which fiduciary duties exist, knowing it to be such, and he then either misappropriates it or otherwise deals with it in a manner which is inconsistent with the trust and/or the applicable fiduciary duties (Sitt Tatt Bhd v Goh Tai Hock[2009] 2 SLR(R) 44 at [34];Halsbury’s Laws of Singaporevol 9(3) (LexisNexis, Reissue, 2015) at para 110.587; Philip H Pettit,Equity and the Law of Trusts(Oxford University Press, 12th Ed, 2012) at p 156). Mah knew that the US$199,975 was intended for Zhou’s investments and had failed to explain how this sum was used. She had thus dealt with the monies in a manner inconsistent with the fiduciary duties that Liew owed. Likewise, Mah and SIPL knew that the remainder $1m was meant to be transferred onwards for investment purposes, but they have failed to do so.",
        "Resulting Quistclose trust": "87Zhou also claims entitlement to the monies he transferred as beneficiary of a resultingQuistclosetrust.145Foot Note 145×Zhou’s SOC, para 62; see also Agreed List of Issues, item 6.InAttorney-General v Aljunied-Hougang-Punggol East Town Council[2015] 4 SLR 474 at [114], Quentin Loh J held that for a resultingQuistclosetrust, the twin certainties of subject matter and object must be present. The settlor-donor must intend to constitute the recipient as a trustee and confer upon him the power or duty to apply the money exclusively in accordance with the stated purpose, and the donor must lack the intention to part with the entire beneficial interest in the transferred money. 88In my judgment, Zhou’s claim inQuistclosetrust against SIPL and Mah for the monies transferred to Gobind is not made out. As Zhou admitted, SIPL and Mah were essentially RCL’s intermediaries, assisting RCL to do the transfers. This they had done based on RCL or Chen Jie’s instructions. The stated purpose at the heart of Zhou’sQuistclosetrust claim is limited to the conveyance of these monies to the relevant party in China for unspecified investments and this purpose was discharged.A fortiori, Zhou’sQuistclosetrust claim against Gobind fails as well. As I have stated at [63], Gobind was not informed that the monies to be remitted to Chen Jie came from Zhou, and Mah had added that she was “sure” that Gobind did not even know of the investments.146Foot Note 146×12/10/17 NE, pp 77–78.There was no intention to constitute Gobind as a trustee, Zhou’s intention was never communicated to Gobind, and Gobind was only instructed to transfer monies to specified accounts, which he has done. 89Another fundamental difficulty with Zhou’s resultingQuistclosetrust claim (which applies to all monies transferred by Zhou) is that the monies have since been dissipated. As Robert Chambers notes inResulting Trusts(Clarendon Press, 1997), “[e]very resulting trust requires that the claimant (i) has provided the property and (ii) did not intend to benefit the recipient in the circumstances and, further, that the property (iii)is identifiable in the hands of the recipient…” [emphasis added] (at p 234). Indeed, even Mr Quah accepts that a claim in resulting trust applies only if Mah, SIPL, and/or Gobind had retained Zhou’s funds.147Foot Note 147×Zhou’s Closing Submissions, para 145.Accordingly, Zhou’s resultingQuistclosetrust claim fails in its entirety.",
        "Conspiracy by unlawful means": "90A party who seeks to establish a claim on conspiracy by unlawful means must establish the following (EFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”) at [112]): (a)there was a combination of or agreement between two or more persons to do certain acts; (b)the alleged conspirators intended to cause damage or injury to the plaintiff by those acts; (c)the acts were unlawful; (d)the acts were performed in furtherance of the agreement; and (e)the plaintiff suffered loss as a result of the conspiracy. 91Zhou’s case is that there was a conspiracy among Liew, Marino, Mah, SIPL, Gobind, and Chen Jie (or any two or more of them) to use Zhou’s funds for purposes other than those intended under the Investment Agreements.148Foot Note 148×Zhou’s SOC, para 65; Zhou’s Closing Submissions, para 142.In my judgment, the elements of conspiracy are not made out. 92First, there must be an agreement between the defendants to pursue a particular course of conduct and that concerted action was taken pursuant to that agreement. The parties must also be “sufficiently aware of the surrounding circumstances and share the object for it properly to be said that they were acting in concert at the time of the acts complained of” (EFT Holdingsat [113]). I find that this is not made out. There was insufficient evidence to show that Mah and Gobind (and even Marino) had sought to conspire with each other or with Liew, RCL or Chen Jie to defraud Zhou of his investment monies. Liew may have misrepresented to Zhou that he would manage and apply Zhou’s monies specifically for the Four Investments. However, there is no evidence that Mah, Marino or Gobind knew of the representations that Liew made to Zhou, or that Zhou’s monies in Mah’s, Gobind’s or SIPL’s hands were meant specifically for particular investments, or that they had agreed with each other or with Liew to mislead Zhou and retain the monies for some other purpose. 93Second, I am of the view that none of the defendants had an intention to injure Zhou. While Liew had left the management of Zhou’s monies to Chen Jie without maintaining proper oversight over the Four Investments, this did not amount to an intention to injure. Instead, having heard Liew’s testimony, I find that he was trying to earn a quick buck by brokering investment agreements and earning “management fees” (by staying “as relevant as possible to the deal so that [he] can at least be paid and be taken care of”149Foot Note 149×4/10/17 NE, p 126.), and yet at the same time absolve himself of the responsibilities associated with managing the Four Investments. This was indolence and irresponsibility at its worst – but nonetheless, not an injurious intent. It was certainly not in Liew’s interests for Zhou to be defrauded – his stream of “management fees” got cut off, he did not receive any of the investment monies, and ultimately, he was exposed to personal liability under the Four Guarantees. 94It follows that there was simply no intent by Mah (much less Gobind) to injure Zhou. Mah and Gobind were essentially intermediaries who knew that the monies belonged to investors and had to be transferred in accordance with instructions by RCL or Chen Jie (in Mah’s case) or by Mah and Marino (in Gobind’s case) and they had acted on those instructions. Mah had agreed to do so as she would earn fees from the transactions – that in itself did not make her actions unlawful nor was it sufficient to infer any conspiracy to do certain acts to injure Zhou. The fact that the monies were transferred through more than one intermediary and subsequently remitted in smaller amounts also did not necessarily or invariably mean that the parties were in cahoots to defraud Zhou of his money. There may be other possible explanations for this course of dealing. Gobind also explained that it is up to the money remitter to determine how the monies would be remitted,150Foot Note 150×13/10/17 NE, p 66.and there is nothing to show that such a practice was unusual. 95Mr Quah submits that the evidence in relation to the interest payments made by Mah and SIPL point unequivocally towards a scheme to defraud Zhou. According to Mr Quah, Mah’s willingness to render assistance to Chen Jie to remit large sums of monies without compensation “stretches credulity”, and Mah and Marino’s subsequent willingness to make interest payments to Zhou in advance “beggars belief”. Hence, Mr Quah submits that these payments were fuelled by an intention to maintain Zhou’s belief that his monies were being invested properly.151Foot Note 151×Zhou’s Closing Submissions, para 115.However, as mentioned above at [68], there was quite a substantial amount of e-mail correspondence that dealt with interest payments and the repayment of principal. These were e-mails that Zhou did not receive, and they would have been wholly unnecessary and farcical if the parties were all in cahoots to defraud Zhou. It should also be borne in mind that Liew had made a CAD report claiming that he had been defrauded by Chen Jie.152Foot Note 152×AB 981.It would take immense temerity for Liew to have done so if he was part of the entire scam. Additionally, I had earlier found (at [62] and [94]) that Mah and SIPL would earn fees for their role in remitting the monies; it was not as if they were willingly doing so without compensation. 96Finally, though this was not an argument raised by Mr Quah, I pause to briefly deal with the possibility that there was a conspiracy founded on a combination/agreement between Mah and SIPL (Nagase Singapore Pte Ltd v Ching Kai Huat and others[2008] 1 SLR(R) 80 at [22]). In my view, there was insufficient evidence to support such a conspiracy in respect of the retained monies. Instead, it appeared to me that Mah and SIPL were intermediaries awaiting instructions from Liew and RCL. Indeed, based on SIPL’s records of the running account, these retained monies were whittled away after issuing interest payments.",
        "Mah and SIPL’s counterclaim": "97Mah and SIPL claimed that they had paid to Zhou various amounts between September 2011 to February 2012 and that after setting off the amounts that Zhou and Liew had paid to Mah or SIPL, Zhou and Liew collectively owed Mah and SIPL $266,850.68, which they had wrongfully retained and been thereby unjustly enriched.153Foot Note 153×SIPL and Mah’s Defence and Counterclaim, paras 39–40.In my judgment, Mah and SIPL’s counterclaim against Zhou fails. 98The editors ofGoff and Jonesexamined the following hypothetical situation (at para 3–78): If [the defendant] receives a benefit at [the claimant’s] expense to which [the defendant] is entitled by a contract between [the defendant] and a third party, X, then can [the defendant] rely on this contract as a bar to [the claimant’s] claim in unjust enrichment? 99The answer proffered is that the claim would be barred if the claimant was aware of the contractual arrangements between the defendant and the third party, and had impliedly agreed to provide the benefit on the basis that the third party alone would be liable to pay the claimant for it (at para 3–79). Another consideration that has to be borne in mind is the contractual allocation of risk and benefit between the defendant and the third party, which would be upset if the claimant’s unjust enrichment claim succeeds (at para 3–78). In this regard, it is relevant to note that at [104] ofAlwie Handoyo, the Court of Appeal also commented that the courts would be unwilling to permit a plaintiff’s unjust enrichment claim to undermine contracts and contractual allocations of risk. 100In the present case, Mah knew that the payments made to Zhou were for returns on investment agreements entered into with RCL. In particular, Mah knew that the $1,020,000 cheque issued by SIPL on 3 October 2011 was Zhou’s principal and interest for an investment which had matured and she also knew that these monies had to be returned by Chen Jie or RCL to Zhou (see [43] and [74] above). For the other smaller amounts paid to Zhou, Mah knew they were interest payments which had to be paid to Zhou under the investment agreements that Zhou had entered into. Chen Jie had asked Mah to pay on her behalf in advance to Zhou and which she would repay Mah.154Foot Note 154×12/10/17 NE, pp 70 and 83.Hence, by continuing with the transfers, Mah and SIPL had impliedly agreed to pay Zhou on Chen Jie’s or RCL’s behalf on the basis that Mah would seek repayment from Chen Jie or RCL. I therefore find that Zhou was not unjustly enriched.",
        "Conclusion": "101In conclusion, I find Liew liable to Zhou for $6,530,000. I also find Mah liable for $247,689.04 (which is the converted sum of US$199,975 and which Zhou had claimed in Singapore dollars, pertaining to the LBI Investment) and jointly and severally liable with SIPL for $1m (pertaining to the 2ST2 Investment) – this is subject to the prohibition against double recovery from Liew and Mah/SIPL for the sums pertaining to the same investments. I dismiss Zhou’s claim against Gobind in its entirety and dismiss Mah and SIPL’s counterclaim against Zhou. 102I shall hear parties on costs. Audrey LimJudicial Commissioner Eugene Quah Siew Ping and Wong Teck Ming (RHTLaw Taylor Wessing LLP) for the plaintiff;First, third and fourth defendants in person;Lim Kim Hong (Messrs Kim & Co) for the fifth defendant."
    }
}