{
    "case_title": "Public Prosecutor vKesavan Pillai Govindan",
    "ncitation": "[2017] SGHC 44",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 This is an appeal by the Public Prosecutor (“the Prosecution”) against the acquittal by the District Judge in respect of the following charge under s 337(a) of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”) (“the charge”) faced by Kesavan Pillai Govindan (“the Respondent”): You, Kesavan Pillai Govindan, are charged that you, on 15 September 2013, at or about 4.50pm, along Guillemard Road in the vicinity of City Plaza Shopping Centre located at 810 Geylang Road, Singapore, did cause hurt to one Muhammad Nuralif Affendi Bin Zulkafli (male / then 22 years old / D.O.B. 18/03/1991) by doing an act so rashly as to endanger the personal safety of others, to wit, by driving your car bearing the license plate no. SKJ5230L forward when the said Muhammad Nuralif Affendi Bin Zulkafli was standing in front of your car, thus causing your car to hit onto the left shin of the said Muhammad Nuralif Affendi Bin Zulkafli twice, thereby causing the said Muhammad Nuralif Affendi Bin Zulkafli to sustain a contusion over the left anterior shin, and you have thereby committed an offence punishable under s 337(a) of the Penal Code (Cap 224, 2008 Rev Ed). 2 The decision of the District Judge can be found inPublic Prosecutor vKesavan Pillai Govindan[2016] SGMC 25.",
        "Background facts": "3 The background facts are simple. The Respondent stopped his car along the side of Guillemard Road, which was marked with double yellow lines, and was told to move off by enforcement officers because parked vehicles on both sides of the road were causing traffic congestion. Enforcement officer Goh Kar Luan Maggie (“PW6”) had difficulty getting the Respondent to drive off. Enforcement officer Muhammad Nuralif Affendi Bin Zulkafli (“PW1”) then went over to speak to the Respondent. They got into an argument. PW1 decided to book the Respondent. In the course of trying to issue a summons, certain events took place which resulted in the Respondent being charged for a rash act endangering the personal safety of PW1 by driving his car forward, when PW1 was standing in front of the Respondent’s car, thus causing his car to hit the left anterior shin of PW1 twice. 4 Having considered the District Judge’s grounds of decision, the parties’ submissions and the evidence, I allow the Prosecution’s appeal against acquittal and find the Respondent guilty of the charge. My reasons are as follows.",
        "Elements of the offence": "5 The elements of an offence under the rashness limb of s 337(a) of the Penal Code are: (a) the accused caused hurt to a victim by doing any act; and (b) such an act was committed so rashly as to endanger the personal safety of others.",
        "Respondent’s evidence": "6 The District Judge summarised the Respondent’s evidence as follows at [4] of his decision: In gist, the [Respondent] testified that he did not hit PW1 with his car. After an argument with PW1, the [Respondent] wanted to drive off but could not do so as PW1had rushed forward to the front of his car. The [Respondent] reversed his car and tried to move off again but PW1 was still in his way. He reversed again and finally managed to go round PW1 and drove his car to a nearby carpark. [emphasis added] 7 I note that the above summary is not entirely accurate because the Respondent did not mention that PW1 had “rushed forwardto the front of his car”. Instead, the Respondent stated in his evidence-in-chief that PW1walkedto the front of the car. When the Respondent reversed his car, PW1walkedcloser to the Respondent’s car again. The Respondent reversed again. He could not remember whether it was his second or third reversal. His car tyre was almost in contact with the kerb on his left, and the car could not reverse further. PW1 looked at him for one to two seconds before PW1 took a few steps to move to the pavement. When the path was clear, the Respondent drove off on his right. 8 Apart from the fact that there is nothing in the Respondent’s evidence to suggest any rapid or sudden movement or a “rushing forward” on the part of PW1, I further observe that, although the Respondent had testified to making several reversals1Foot Note 1×ROP at p 227., he did not make (or chose to refrain from making) any positive assertion of driving his car forward again after each reversal. The Prosecution’s case is that the Respondent had reversed each time after having inched forward and hit PW1’s leg with wanton disregard whether he had hit PW1. 9 With the limited space available since the car was close to the kerb, I find it hard to believe that the Respondent could repeatedly reverse the car (without having to move the car forward again after each reversal). Furthermore, if PW1 had indeed taken the trouble to walk closer to the front of the car after each reversal, to hem the car in so as to prevent the Respondent from leaving the scene, it is rather odd for PW1 thereafter to look at the Respondent for one to two seconds and then decide to move aside to the pavement to provide sufficient clearance for the Respondent to drive away, especially when PW1 had wanted to issue a summons to the Respondent and had not completed doing so. When examined carefully, the Respondent’s testimony of how it all happened does not quite make any logical sense. For completeness, I now set out the Respondent’s evidence-in-chief: As I’m moving forward, just then, he startedwalkingto his walk---he startedwalkingto the front---towards the front of the car. But he has not---he’s not at the front yet. He reached over to the front corner. My car, Sir, has sensors, even to measure the distance of objects. So, when he comes very close to the car, it would beep. So, I stopped. So, what is this guy doing? Asking what is this guy doing. Okay, never mind. He’s---he’s out to---I feel, like, he’s---he’s just not right. So,I reversed. But this time, he’s standing in front of the car. I turned extreme right, my steering wheel and I try to move. As he saw that I was trying to move,he walked closer to my car again. I was, like, okay, never mind.I reversed again. Can’t remember, Sir, whether it was twice or thrice.I reversed again.I think,my second reverse or third reverse. I could tell from my left view mirror that my tyre is almost in contact with the kerb---the black and white kerb on my left. And I know I cannot go any more.I cannot reverse anymore. I cannot move. He’s already very close to my car. I cannot move forward. I cannot because I’m on the kerb. So, I---I just stopped. I just stopped and I look at him.He saw me for1 or 2 seconds. He look down andhe moved to the side of the pavement.As he moved to the side of the pavement, he just took a few steps. He was clear.I had enough clearance, I drove off on my rightand I just turned left into the condo. [emphasis added] 10 During his cross-examination, the Respondent reiterated that, before he started to drive off, PW1 was by his side. He insisted that, when he moved the car, there was no one in front of him. As he was just moving forward, PW1 walked by the side of the car towards the front of the car. That was when the Respondent stopped after having moved off by “[m]aybe a feet, half a feet”2Foot Note 2×ROP at p 269.. He said that he could see PW1 “very clearly”3Foot Note 3×ROP at p 267.. When he stopped, PW1 went “somewhere along the corner front of the car”.  He stopped his car “because [he] could see that, by that time, [PW1] has already come to the corner front already”4Foot Note 4×ROP at p 269.. He also said that he stopped the car because “[PW1] was walking close to the front corner. He’s very close to the car”.  The Respondent said that he was shocked and surprised when PW1 was “coming to the front”5Foot Note 5×ROP at p 269.. The Respondent then paused in order to change from the forward gear to the reverse gear and he reversed his car “just to create a safe distance”6Foot Note 6×ROP at p 270.. There was no sign of PW1 stumbling or being shaken. He was “rock solid standing throughout the incident”7Foot Note 7×ROP at p 270.. As the Respondent reversed and turned to his extreme right to move forward, PW1 “very steadily, walked closer to the car again.”8Foot Note 8×ROP at p 270.",
        "The car had hit PW1 twice": "11 On the first element ofactusreus, the Respondent argues that his car did not hit PW1 at all thereby negating any possible hurt being caused to PW1. I reject this submission outright. 12 Although PW1’s evidence was found to be unreliable, the District Judge nevertheless found at [15] that there was a “slight collision” between the Respondent’s car and PW1. The District Judge said at [15] that the evidence suggested that “PW1’s movement to the front of the car wassudden and unexpected, and theslight collisionbetween the vehicle and PW1’s leg was due in no small part to PW1’s instinctive reaction to stop the [Respondent] from driving off.” [emphasis added]. The District Judge also found as “untenable” the Respondent’s evidence that his car did not have any contact with PW1 (at [16]). I am not inclined to disturb the District Judge’s finding of a “slight collision” in view of the objective medical evidence on PW1’s injury and the oral testimony of another enforcement officer Muhammad Danial Hanis (“PW5”), whom the District Judge found at [15] to be the “most credible witness among thosepresentat the scene of the incident.” [emphasis added]. I interpret this to mean that PW5 is more credible than his fellow enforcement officers present at the scene, namely PW1, PW6 and Syed Abdullah Bin Syed Ja’affar (“PW2”); and that PW5 is also more credible than the Respondent. 13 PW5 had testified that the driver started moving “forward, to the right” and he saw the bumper of the car touching PW1’s lower left leg. PW1’s left leg then started to shake. The medical report from Dr Ma Christina Racho Arroyo (“PW3”) states that there was contusion on the anterior shin of PW1’s left leg9Foot Note 9×ROP at p 324.. PW3 prescribed Ponstan to PW1 for the pain and swelling over his anterior shin. 14  However, the District Judge did not make any specific finding on whether PW1 was hit asecondtime. This is relevant not only to the question of sentence if the Respondent is found guilty, but also to the degree of rashness (if any) of the acts of the Respondent.",
        "Evidence of PW5": "15 Since the District Judge regarded PW5 at [15] to be “a fair and objective witness” and had “fully accept[ed] his testimony”, I will therefore set out PW5’s evidence in some detail. 16 During examination-in-chief, PW5 said that PW1 was standing next to the driver’s side of the door. PW1 asked the Respondent to step out of the car because he was about to issue the summons. Instead of complying, the Respondent started to put on his seat belt and placed his right hand on the wheel of the car and his left hand on the gearbox.  At this juncture, PW1 started to go to the front of the car. While PW1 was about to stand in front of the car, the car had not moved yet. PW1 stood about 20 to 30 cm away in front of the car on the right side, directly facing the Respondent (see exhibit P710Foot Note 10×ROP at p 331.(annexed to this judgment) drawn by PW5 indicating the locations marked with “x” of each of the four enforcement officers at the time when PW1 was standing 20 to 30 cm in front of the car). The Respondent started to drive forward to the right. PW1 raised his left hand gesturing to the Respondent to stop. The summons book was at that time in PW1’s right hand. That was when PW5 saw the bumper of the car touching PW1’s lower left leg. PW1’s left leg started to shake. Then, the Respondent reversed his car and he attempted a second time to turn to the right to move off but he could not do it. On this occasion, the car did not hit PW1. The Respondent reversed again and he “did the same thing” but, at this point of time, PW1 took a step back and his upper body was “wobbling a bit”. That was when the Respondent drove off. PW5 went over to PW1 to ask him if he was “okay”. Later, PW5 saw PW1 rubbing the lower part of his left leg. 17 PW5 remained unshaken during his cross-examination and elaborated that PW1 had already been standing in front of the car for one or two secondsbeforethe Respondent first started to move his car forward: Q  Now, my instructions are that my---as soon as [PW1] move forward and my client realised he had moved forward, my client stopped the car immediate--- ANo,as in,before he moved forward, he wasn’t even moving yet.So as soon as he stopped right in front of the Mercedes Benz driver, then he start to move forward. So at the moment that[PW1]was in front of the car, then he started to move.Before that, he wasn’t even moving at all. He was still stationary. ………… Q You said there was a moment of pause, what--- A Yah. Q ---do you mean? A Sothe moment he stood in front of the car, there was nothing yet, then he started to move off, for that one or two seconds. Q Then my car---client stopped the car. A Yah, then he reversed. Q Do you know why he stopped the car? Well, my instructions are that as soon as my client realised that [PW1] was in the front, my client was surprised and stopped the car immediately and then he reversed the car. A Uh-huh. Q And then he tried to turn out to the right but [PW1] moved forward. A No,he wasn’t moving forward, he was stillstanding there firm on the one spotuntil thesecond hit. Q Hold on, there was a second hit? A Yah, there was asecond,on the third attempt to move out. He--- Court: Yes. A ---attempted to move out three times. …… Q So thesecondtime, was it a touch or a hit? ADefinitely a hit because he was already wobbling and he took a step back. [emphasis added] 18 From the above testimony, PW5 was quite certain that PW1 was hit by the car a second time. 19 Defence counsel put the Respondent’s instructions to PW5 that after the Respondent had stopped and reversed his car, after seeing PW1 in front of the car, PW1 immediatelywalkedtowards the front of the car to stand closer to the car. PW5’s response was an emphatic negative as follows11Foot Note 11×ROP at p 177 to p 179.: ANo, he was definitely not walking closer. He was still standing firm at his own position. ….. ANo, he wasn’t even walking off anywhere.He was just standing there all the way until the driver left. Q So [PW1] did not move from there? ANo.He have to take one step back as the Mercedes Benz driver tried to attempt the third time to move off. So there were three attempts.The second one not hitting, just the first and the third. Q ---hit. Oh, you said the first one was a touch. A Strong tap, strong touch, whatever. Q And the second---what about the third time when my--- A The third one, the third attempt to move off,he did hit[PW1] for a second time, this time, he was taking a step back and his upper body was wobbling already. Q Which part of my client’s car made contact with [PW1]? A The front of the bumper of the car. Q The front corner? A The bumper, yah. …….. AHe only walked away as soon as the driver left. Before that, he wasn’t moving at all. [emphasis added] 20 I find that the evidence of PW5, found to be a credible witness by the District Judge, sufficiently establishes beyond a reasonable doubt that PW1 was hit asecondtime on his left leg again at theanteriorshin area by the front bumper of the car. According to PW5, this occurred when the Respondent drove his car forward for thethirdtime, after having reversedtwicebefore, in an attempt to leave the scene. 21 Based on the undisputed objective fact that the contusion is not on thesideorbackof PW1’s left leg but on theanteriorshin, which is at the front of his leg, I am of the view that this is entirely consistent and supportive of the Prosecution’s case that PW1 was standing stationary infrontof the carfacingthe Respondent, filling up the summons form, when the car inched forward towards PW1 on two separate occasions and the front of the car collided onto PW1’santeriorshin on each of these two occasions to cause the contusion. The location of the contusion itself is wholly inconsistent not only with the Respondent’s evidence but also with the Respondent’s case and analysis that the car did not and could not have hit PW1, and it effectively demolishes the fundamental basis of the Respondent’s case. 22 For completeness, I will also set out briefly below the evidence of the other two eyewitnesses, namely PW6 and PW2, although the District Judge had reservations on their credibility.",
        "Evidence of PW6": "23 PW5’s evidence is largely corroborated by PW6, who said that PW1 moved quickly to the front of the vehicle when the Respondent indicated that he wanted to move off by putting his hands on the steering wheel. PW6 confirmed that the car had not movedbeforePW1 had moved to the front of the car. PW1 stood in front of the car, and raised his hand over the bonnet of the car to signal to the Respondent to stop. This led the District Judge to query whether PW1’s lower body was actually quite close to the front of the car at this point of time, to which PW6 answered in the affirmative12Foot Note 12×ROP at p 191.. Based on PW6’s demonstration in court, PW1 stood less than a foot away from the front of the carbeforethe car moved. The Respondent ignored PW1, reversed and inched forward and hit PW1’s legs. PW1 stumbled. He then tried to regain his balance. The Respondent reversed the vehicle again, and the bumper hit PW1 once more. He reversed the third time and sped off on the right side13Foot Note 13×ROP at p 187.. PW6 observed that PW1 was “shaky” and not walking normally after the incident. During cross-examination, PW6 agreed that, from where she was standing near the left front passenger window, she did not see the actual contact between the bumper and PW1’s leg although she witnessed the car heading towards PW1 before PW1 stumbled14Foot Note 14×ROP at p 195.. 24 The main discrepancy between PW5’s and PW6’s evidence is not the fact that PW1 washit twicebut on which two occasions, out of the three times that the car moved forward, that PW1 was hit thesecondtime. I also note that PW1’s evidence seems to be aligned with PW6’s evidence in that both PW1 and PW6 testified that PW1 was hit thesecondtime after thefirstreversal of the car following the first hit, whereas PW5’s evidence is that PW1 was hit thesecondtime after thesecondreversal of the car15Foot Note 15×ROP at p 34 and 35.following the first hit. 25 I also note that there is another minor discrepancy with respect to the time when PW1 raised his hand to indicate to the Respondent to stop his car. PW1 had testified that heimmediatelyraised his handafterhe first felt pain (presumably he was too busy writing on the summons form and did not pay much attention earlier to the car until the car hit him for the first time)16Foot Note 16×ROP at p 35.. But both PW5’s and PW6’s evidence appears to be that PW1 had raised his left hand gesturing to the Respondent to stopjust whenor just beforePW1 was hit the first time17Foot Note 17×ROP at p 165 and 191..",
        "Evidence of PW2": "26 PW2’s evidence is that there was an argument between the Respondent and PW1. PW1 then walked in front of the car and was ready to issue the summons. While PW1 was standing in front of the car, facing the driver and writing the summons, the driver drove the car forward. PW1 told the driver to stop. The driver then reversed the car and drove the car forward again and the car hit PW1’s left leg. PW1 lost his balance but did not fall. The driver than reversed the car and drove off from the scene. PW2 observed PW1 to be limping after the incident18Foot Note 18×ROP at p 120.. To a specific question from the trial Prosecutor, PW2 confirmed that the car had not been moving when PW1 had walked to and stood in front of the car19Foot Note 19×ROP at p 122.. PW2 was howeverunsurehow many times the car had hit PW1 but added that it was at least once20Foot Note 20×ROP at p 101.. 27 In cross-examination, PW2 agreed with defence counsel that when the Respondent tried to turn to the right, to go to the right of PW1, PW1 immediatelymoved closerto the car, presumably to prevent him from doing so21Foot Note 21×ROP at p 118.. In this last respect, I recognise that PW2’s evidence is not consistent with PW5’s evidence that PW1 did not move at all from the position when he was first hit, until the time PW1 was hit a second time22Foot Note 22×ROP at p 177 and 178..",
        "Relevance of inconsistencies": "28 Notwithstanding the discrepancies highlighted above, I accept the Prosecution’s submission that it would have been curious if no inconsistencies emerged at all, for, as even the Respondent’s counsel himself observed, at the time of the trial, the incident had taken place “almost 2½ years ago”23Foot Note 23×ROP at p 103.. “The recollection of the details of particular events, particularly where these occur quickly, is easily susceptible to error with time”:Public Prosecutor v Tan Kim Seng Construction Pte Ltd and another[1997] 2 SLR(R) 192 at [27]. 29 If all the different Prosecution’s witnesses had given entirely consistent accounts, questions would understandably be raised as to how they could possibly recall every specific detail of an incident with such consistency. I agree with the Prosecution’s submission that the presence of inconsistencies on tangential issues or on matters that witnesses cannot be expected to be able to recall with precision may in itself indicate the absence of collusive behaviour on the part of these witnesses to falsely implicate the Respondent.",
        "The District Judge’s assessment of the witnesses’ credibility is plainly wrong": "30 The District Judge had repeatedly taken issue with PW1’s assertion in his evidence that he was in fact “standing in front of the car” when the Respondent “was about to drive off” (at [12]), characterising such testimony as being inconsistent with the evidence of PW2, PW5 and PW6 and with PW1’s own police report. He viewed PW1’s evidence as unreliable. He found PW1 to be untruthful in his evidence in certain other respects. The Prosecution submits that the District Judge’s characterisation is erroneous and predicated upon a misunderstanding of each of these witnesses’ evidence. 31 The District Judge further found at [14] that PW2 and PW6 were “not particularly helpful” witnesses. He concluded that PW2 was “evasive” as he “did not want to get involved” and PW6 was “not objective” (at [14]). 32 I do note that PW2, PW5 and PW6 were PW1’s enforcement teammates on the day of the incident but all three of them had said that they had no prior, or subsequent, relationship with PW1 as he was from a different Division. In the circumstances, I believe that it is not likely for them to take sides with PW1 and give false evidence in court just to implicate the Respondent. 33 The Prosecution very helpfully sets out in its written submissions24Foot Note 24×Submissions that descend into specific evidential details with full footnote references provided as was done in this case (especially when hyperlinked to the transcripts of the evidence in the record of proceedings) in order to support each of the arguments made and the overall analysis will be of much assistance to the court.a clear point by point analysis with full references to the various portions of the trial transcripts in the record of proceedings (“ROP”) to explain in detail why the trial judge had erred in his assessment of the credibility of PW1, PW2 and PW6. I can do no better than set it out in full: 55    The Appellant turns first to the trial judge’s reasoning on why the victim’s account appeared to be internally and externally inconsistent. As can be seen below, each of the lines of reasoning employed by the trial judge, with respect, fails upon closer analysis. a.Trial Judge’s observation / inference (GD, at [8]): The victim claimed that he had lost his balance after the vehicle made contact with his leg. The trial judge took issue with this as he noted that the victim was able to raise his left hand and gesture for the Respondent to stop. The trial judge also found it odd that the victim was not angry or shocked by the alleged reckless act and continued standing on the road, placing himself in a vulnerable position noting that if the victim was hit once by the Respondent, he would not have remained there to be hit again. Appellant’s Response: The victim testified that although he lost his balance, he did not fall.25Foot Note 25×ROP at p 34, lines 9, 20 to 22.It is significant to note that this version of events was maintained by the victim from the outset as the physician who attended to him,i.e.PW3 Dr Arroyo, reported a similar account being given to her. It should be added that significantly, this version of events (i.e.that there were two hits) was corroborated by both PW5 Hanis26Foot Note 26×ROP at p 176, lines 27 and 28 and p 177, lines 3 to 8.and, to a lesser extent, by PW6 Maggie27Foot Note 27×ROP at p 201, lines 25 and 26.(the latter having indicated that she saw the victim stumble after what appeared to be an initial contact). Having regard to these pieces of evidence, it is difficult to understand the concerns of the trial judge with the victim’s evidence on this front. Indeed, compellingly, the victim had explained that he had stood in front of the vehicle to issue a summons to the latter28Foot Note 28×ROP at p 33, line 2.and in the commission of such duty, noted that the Respondent was trying to leave the scene. Seen from that perspective, there was nothing remotely illogical about the victim’s decision to try and have the Respondent stop after being hit by him, rationalising quite rightly that standing in front of the vehicle would have minimised the prospects of the Respondent absconding. b.Trial Judge’s observation / inference (GD, at [9]): The victim testified that he was standing in front of the car, issuing a summons to the Respondent when he felt the vehicle inch forward and make contact with his leg. However, in his police report (Exhibit ‘’P3’), the trial judge noted that there was a “crucial piece of inconsistency” in that the victim stated that it was only when he noticed that the Respondent was about to move off that he moved to the front of the car.29Foot Note 29×ROP at p 322. Appellant’s Response: It is not apparent how the accounts are inconsistent. In the police report, the victim had stated that he was writing the summons form when the Respondent shouted at him to carry on, prompting the victim to tell the latter that he would call for the Police as he refuses to cooperate. The victim then saw the Respondent “getting ready to drive off” and stood in front of the car, gesturing for the latter to stop. It should be stressed that this evidence plainly does not mean that the Respondent was literally driving off at the time, only that he was seemingly in the preparatory stages of getting ready to drive off – to explain the factual circumstances in the words of PW5 Hanis, the Respondent was “starting to put back his seatbelt with his right (hand) placed on the wheel and his left hand on the gearbox as he was…most likely about to drive off.”30Foot Note 30×ROP at p 156, lines 5 to 7.It should be added for completeness that this is also in line with PW6 Maggie’s testimony, as she herself noted when the victim moved in front of the vehicle, the Respondent had merely placed his hands on the steering wheel and the victim would not have expected the Respondent to drive off.31Foot Note 31×ROP at p 198, lines 5 to 7.Seen in proper context then, it is obvious that the police report lodged by the victim did not contradict his court testimony; on the contrary, his account in the police report was consistent with his subsequent account of what had transpired, namely, that the victim was in the preparatory stages of driving off when he moved to the front of the vehicle. c.Trial Judge’s observation / inference (GD, at [12]): The victim’s account of standing in front of the vehicle when the Respondent started to move off is contradicted by PW2 Syed, PW5 Hanis and PW6 Maggie, who testified that the victim was standing next to the driver’s door when the Respondent was about to drive off. Appellant’s Response: As has been discussed at length above, this appears to be an erroneous characterisation of the evidence. As set out in some detail above, PW2 Syed, PW5 Hanis and PW6 Maggie all gave evidence that the victim had moved to the front of the vehicle before the latter drove it forward. None of their compelling testimonies in relation to this was alluded to or dealt with by the trial judge in the GD. When the evidence is seen in its proper context therefore, there is plainly no contradiction as suggested by the trial judge; on the contrary, the evidence unambiguously supports the victim’s version of events. d.Trial Judge’s observation / inference (GD, at [12]): The victim denied having an argument with the Respondent. This, the trial judge surmised, must have been false as PW2 Syed and PW5 Hanis testified that there was an argument between the Respondent and the victim. In the same vein, the victim denied having uttered the phrase “What the heck!” to the Respondent, even though PW5 Hanis testified that he heard the victim doing so. Appellant’s Response: It is hardly surprising, given the passage of time between the incident and the trial that the victim may not have recalled the precise specifics of the verbal exchange that he had with the Respondent. As will be discussed later on (see [58] below), all of the witnesses admitted to not being able to recall some particular specifics of the incident. The broad thrust of the evidence before the Magistrates’ Court, and by extension, this Honourable Court, is clear – as PW2 Syed noted, the victim told the Respondent to drive off but the latter refused. Thereafter, an argument ensued between them and he heard the victim telling the Respondent that he could not park along double yellow lines to which the latter replied that he did not know about yellow lines. The argument then continued. This is broadly consistent with the victim’s testimony that he had asked the Respondent if he knew what double yellow lines meant and the victim had replied that he did not and that they had a long conversation with the Respondent during which he had asked the latter to drive off but he refused to. It might be further added that this evidence is again broadly speaking consistent with that of PW5 Hanis who testified that the victim had been speaking to the Respondent in a calm manner until the Respondent repeatedly disobeyed his instructions to move off and started speaking with a slightly raised voice. It is significant to note that he was of the view that the Respondent was plainly the more aggressive one between the two of them.32Foot Note 32×ROP at p 152, lines 25 & 26 and p 155, lines 27 to 32.Whatever the contents of the exchange between the victim and the Respondent therefore, the evidence is unambiguous on the fact that the argument had escalated largely due to the Respondent’s own actions, and that he was angry with the victim immediately before the incident transpired. This serves to provide a useful complexion as to why the incident transpired in the first place,i.e.the Respondent was completely unconcerned about hitting the victim in his anger in driving off. In any event, even taking the Respondent’s case at its highest, and even assuming that the victim was intentionally understating his involvement in the exchange with the Respondent prior to the incident, it is difficult to see how that alone serves to fatally undercut the veracity of the victim’s evidence as to what happened subsequently. After all, even assuming one takes the victim’s account of the verbal exchange as being inconsistent with PW5 Hanis, his testimony on having been in front of the vehicle subsequently when the Respondent started to drive away was corroborated by every single eye-witness at the scene (including PW5 Hanis). In the same vein, the victim never wavered on the fact that he had been hit twice by the Respondent’s vehicle, a fact that the Appellant might add (as set out in extensive detail above) is fully corroborated by other eye-witnesses. In the circumstances, even if the trial judge felt it necessary to treat with circumspection the victim’s account about the specifics of the verbal exchange between the parties, it would be difficult to see why it ought not to have, having considered the evidence, accepted his account of the incidents amounting to the offences the Respondent was being charged with taking place. The law is clear on this – it is open for a Court, having considered the circumstances of the case, to believe the evidence of a witness, so far as the essentials of the case are concerned, without having to accept as true every single facet of his/her evidence: seePublic Prosecutor v SinghKalpanath[1995] 3 SLR(R) 158 .., at [88] andPublic Prosecutor v AOF[2010] SGHC 366 .., at [72]. …….. 59   In respect of PW2 Syed, the trial judge found that he was unhelpful as he was evasive when it came to answering certain questions. The trial judge reasoned this to be the case as PW2 “kept repeating that he did not know much as he did not want to get involved” (GD, at [14]). This appears to be a misunderstanding of the thrust of PW2 Syed’s evidence – to be sure, PW2 Syed did indicate that he did not wish to “get involved”, however this was in the context of explaining to the Court as to why he was not aware of certain specifics of the exchange between the Respondent and the victim.33Foot Note 33×ROP at p 100, line 19 and p 115, lines 30 & 31.Simply put, the only point he was trying to get across was that he could not testify to the specifics of the verbal exchange between the Respondent and victim as he made a conscious decision not to be involved in such exchange. It would accordingly be unsurprising that PW2 Syed would not be able to testify in minute detail or give a blow-by-blow account as to what the verbal exchange was all about. Considering the context in which the comment was made, it appears odd that the trial judge would characterise him as being “evasive” for no other reason than providing an explanation as to why he may not be able to provide useful responses to questions focused on the exchange between the victim and the Respondent on 15 September 2013. On the matter of his inability to recall some of the matters, as the Respondent’s counsel himself observed, the matter had taken place a long time before the hearing, and, in those circumstances, it would be unlikely that any individual would be able to recall every single specific detail about the incident given the relatively long passage of time between the incident and the hearing. 60 As for PW6 Maggie, the trial judge found her to be more forthcoming but not objective as she would give evidence in support of the victim but would waver when faced with difficult questions. An example given by the trial judge was that of PW6 Maggie testifying that the victim was tactful, courteous and professional when PW5 Hanis testified that the victim had reacted negatively to the Respondent and was flustered. With respect, this appears, again, to be a misunderstanding of the evidence – as PW5 Hanis testified, the victim was very calm for most of the conversation between him and the Respondent and only started speaking with a slightly raised voice after the Respondent had repeatedly disobeyed his orders to drive off. PW5 Hanis also testified that between the Respondent and the victim, the former was “definitely” the more aggressive one.34Foot Note 34×ROP at p 152, lines 25 & 26, p 155, lines 27 to 32.In short, just as PW6 Maggie intimated, the victim was, in fact, doing his best to be courteous and respectful in the face of unreasonable behaviour on the part of the Respondent, even if it would appear from PW5 Hanis’ evidence that he ended up frustrated by the Respondent’s obstinate behaviour. In any event, it bears noting that the trial judge was happy to discount the evidence of PW6 Maggie on this front while concomitantly being persuaded to rely on her evidence (as he did in various parts of the GD, albeit through ostensible mischaracterisations of PW6 Maggie’s evidence) as being supportive of his reasoning when it was aligned to the conclusions he arrived at. 61 As for the trial judge’s comment that PW6 Maggie would waver when it came to answering difficult questions, the singular example that the trial judge offered in support of his conclusion in fact lent further credence to PW6 Maggie’s testimony. The exchange in question35Foot Note 35×ROP at p 206.pertained to PW6 Maggie’s clarification that she did not see the actual physical contact between the bumper and the victim’s legs, that she only saw the vehicle moving towards the victim and had assumed, because he had stumbled, that contact must have taken place. It is difficult to see how this could form the basis of the trial judge’s conclusion that her testimony was unreliable – indeed, if nothing else, the fact that she had clarified that it was an inference on her part (and, the Appellant might add, a very logical inference at that), rather than something she saw with her own eyes, lends a certain rigour to her evidence for it suggests a willingness and ability on her part to clarify as to what she precisely saw. If she were really attempting not to be objective, she would have insisted that she saw the actual physical collision take place. 34 After having considered the above detailed submissions which are very logically reasoned36Foot Note 36×I commend the DPPs for the amount of effort they have taken to prepare such clear and detailed submissions., I agree with the Prosecution that the District Judge had erred in his assessment of the credibility of PW1, PW2 and PW6. His assessment was plainly wrong on a more careful evaluation of the evidence. As the District Judge had assessed the credibility of these witnesses not so much on their demeanour but primarily on their internal and external consistencies, I agree with the Prosecution’s submission that his assessment is particularly susceptible to appellate scrutiny:Jagatheesan s/o Krishnasamy v Public Prosecutor[2006] 4 SLR(R) 45, where it was stated at [40] that: There is, however, a difference between an assessment of a witness’s credibility where it is based on his demeanour and where it isbased on inferences drawn from the internalconsistency in the content of the witness’s testimony or the external consistency between the content of the witness’s evidence and the extrinsic evidence. In the latter two situations, the supposed advantage of the trial judge in having studied the witness is not critical because the appellate court has access to the same material as the trial judge. Accordingly,an appellate court is in as good a position as the trial court in such an instance to assess the veracity of the witness’s evidence: seePP vChoo Thiam Hock[1994] 2 SLR(R) 702 at [11]. [emphasis added]",
        "The Respondent’s acts were rash": "35 I will now explain why the Respondent had, in causing hurt to PW1twice, acted so rashly such as to endanger the personal safety of PW1 such that the second element of the offence is proved beyond a reasonable doubt.",
        "No sudden and unexpected movements": "36 During the appeal, the Respondent’s counsel strenuously argued that the look of “sudden shock”37Foot Note 37×ROP at p 80.on the face of the Respondent shows that the Respondent did not expect and could not have reasonably expected that PW1 would move to the front of the car suddenly as he was about to drive off the first time. The evidence (which I will set out below) however shows that PW1 had not moved suddenly to the front of the car, which undermines the very basis upon which counsel hopes to frame his argument. It appears to me that the Respondent could very well have been shocked because PW1 had remained standing in front of the car when the Respondent was inching his car forward and he had failed to stop in time and thereby hit PW1. 37 The District Judge also concluded at [15] that PW5’s evidence showed that PW1’s movement from the driver’s side to the front of the vehicle was “sudden and unexpected”. However, this conclusion is not borne out by the evidence of PW5. PW5 (and all the other Prosecution’s witnesses) never once said that PW1 suddenly ran or sprinted to the front of the car. 38 PW5 had clearly asserted that (a) the vehicle was “stationary” when PW1 was in front of the car; (b) “there was a moment of pause” before the Respondent drove off; (c) about one to two seconds had elapsed between the time when PW1 stood in front of the vehicle and the moment when the Respondent drove it forward38Foot Note 38×ROP at p 176.; and (d) PW1 was “already at the front before the car moved.”39Foot Note 39×ROP at p 174.If so, then where was the “sudden and unexpected” movement of PW1? Furthermore, there would also have been more than enough time in thatone or twoseconds for the Respondent to see exactly where PW1 was,ie, close to the front of the car, some 20 to 30 cm away, directly facing the Respondent, wellbeforethe Respondent started to drive his car slowly forward in the direction of PW1. 39 Even going by the Respondent’s own version of the events, PW1 was only “walking” towards the front of the car and not “running” or “sprinting”.40Foot Note 40×ROP at p 227.There is similarly no suddenness in any of PW1’s actions that were supposedly so “unexpected”. 40 Even if it were true that the actions of PW1 had beensudden(which is not the case from the evidence) and that the Respondent could not have expected PW1 torushto the front (which is also not the case from the evidence), that may only excuse the Respondent if he could not allegedly stop his car in time on the occasion of thefirsthit. However, no such possible excuse is available for thesecondhit, when PW1 had, after the first hit, remained standingat the same spotuntil he was hit asecondtime according to PW5 and the other Prosecution's witnesses.",
        "The Respondent saw PW1 standing in front of his car": "41 Based on the Respondent’s evidence, I find that there was no point of time during which the Respondent could not observe what PW1 was doing or see where PW1 was, as he was able to describe PW1’s movement in detail every step of the way, although his description of PW1’s movement differs markedly from that of the Prosecution's witnesses. He could allegedly observe PW1 “standing rock solid” and “very stable” during the whole time and even when he was reversing his car purportedly to avoid hitting PW1. He said that he could see PW1 “very clearly”41Foot Note 41×ROP at p 267.. 42 This shows that, at least from the Respondent’s perspective, there were no blind spots where he could not observe PW1 and no momentary lapses (egduring reversing) such that he was not able to observe PW1’s movements continuously. The Respondent’s own evidence shows that he had clearly observed everything that PW1 was doing at the material time. 43 Having regard to PW5’s evidence and the analysis as set out at [38] above, it is also implausible that the Respondent could not and did not see that PW1 was right in front of his car. 44 The District Judge had himself acknowledged at [10] that “[i]f the Respondent had seen PW1 standing there in front of his car and nevertheless drove forward, it would have been a rash act.” But that was exactly what happened according to PW5 (even if the District Judge were to disregard the evidence of all the other Prosecution’s witnesses). Since there is no question that the Respondent had observed all the movements of PW1 clearly but nevertheless drove forward in the direction of PW1, the District Judge should have found the Respondent guilty of a rash act.",
        "The Respondent was not trying to avoid PW1 when his car hit PW1": "45  The District Judge observed at [17] that the fact that the Respondent stopped and reversed twice clearly suggested that the Respondent was avoiding PW1, rather than trying to cause hurt to him. There is no basis to make this observation since the Respondent’s version is inherently quite unbelievable, if not false in many material aspects. 46 If the car had reversed in the manner described by the Respondent, with PW1 alwayswalkingtowards a reversing car thatnevermoved forward towards PW1 at any stage, as the Respondent was trying to avoid hurting PW142Foot Note 42×ROP at p 227., then it is highly unlikely for PW1 to suffer any contusion on theanteriorpart of his left leg, unless PW1 deliberately knocked his shin against the car bumper after walking towards the reversed or reversing car. 47 If, for the sake of argument, the car had moved forward first and there was insufficient time (iebefore the Respondent stopped his car to reverse) for PW1 to reach a position 20 to 30 cm in front of the car andfacethe Respondent after turning around, then the contusion again would not likely be on theanteriorleft shin of PW1. The medical evidence thus supports the Prosecution’s case but not the Respondent’s. 48 On the totality of the evidence, the Respondent’s version of events must be rejected in the light of the objective medical evidence, the evidence of PW5 (regarded as a credible witness by the District Judge) and also the evidence of the other two Prosecution’s witnesses, PW2 and PW6, both of whom should also have been found to be credible witnesses for the reasons I have stated. 49 There is clearly overwhelming evidence showing that the Respondent was fully aware of PW1’s presence in front of his car. Not only PW1 but every one of the eyewitnesses, PW2, PW5 and PW6 unambiguously attested to the fact that PW1 had stood in front of the vehiclebeforethe Respondent first started to drive his vehicle from the parked position towards PW1. The District Judge was plainly wrong to conclude that the car started to move offbeforePW1 had reached the front of the car and stood in front of it, when all the Prosecution’s witnesses had clearly testified to the contrary. In this regard, the District Judge had decided against the weight of the evidence. 50 Even if the District Judge is minded to disregard the evidence of PW1, PW2 and PW6 and accept only the evidence of PW5, whom he found to be the most credible of all the witnesses, the District Judge should still have concluded that the car had not moved untilafterPW1 had reached the front of the vehicle and stood there facing the driver for one or two seconds. 51 Accordingly, the District Judge’s finding that the Respondent was trying to avoid PW1 is manifestly wrong. Despite seeing PW1 close to and in front of his car, the Respondent nevertheless drove his car forward and hit the anterior left shin of PW1 twice. I have no hesitation in finding such an act to be rash. 52 Even if PW1 was not in front of the car, but had been standingvery closeto the driver’s side of the car facing and talking to the driver, I would still regard it to be a rash act if the Respondent were to simply drive off without waiting for PW1 to step backwards and away from the side of the car, and even more so if the Respondent veers his car to the right in driving off. This is because there is a real risk of the right rear wheel running over the toes or feet of PW1. 53 When a car is parked in a car park with side-by-side parking lots, with parked cars on both the left and right sides, the driver is expected to check if there are any persons standing or walking between the two sides of the adjacent parked cars and his car before driving out of the parking lot. The space between his car and the adjacent parked cars is narrow. Thus there is a real danger of hitting these persons or running over their feet or toes if the driver simply drives straight out of the parking lot before these persons have exited from the space between the cars in question. 54 Hence, even if PW1 had been standing very near to the driver’s car door, or was keeping close to the side of the car, as he walked forward to try to reach the front of the car, I would still regard the Respondent’s act to be rash if he were to drive off despite knowing that PW1 was still so close to the side of the car. I accordingly disagree with the analysis of the District Judge at [11], that “if PW1 was standing next to the [Respondent] at the driver side of the door when the [Respondent] was about to move off, then when PW1 suddenly moved to the front of the car at that point in time, the [Respondent] could not be said to have acted in a rash manner.” Since the Respondent knew that PW1 was very close to the car, be it (a) standing adjacent to the car door of the driver; or (b) walking close to and alongside the car somewhere between the driver’s car door and the right front headlights of the car; or (c) already standing in front of and near the car, the Respondent would still be acting rashly by driving off under such circumstances. 55 Even if the Respondent could be excused for thefirsthit, he certainly acted rashly to endanger the personal safety of PW1 when he reversed his car and moved forward again and hit PW1 asecondtime. This is because by this time, the Respondent had ample opportunity to realise that when he was driving forward, PW1 was still very close to anddirectly in frontof his car. It would have been dangerous to drive forward in such circumstances because of the high probability of injuring PW1. The Respondent should have known better than to drive forward again, even if he meant to squeeze past PW1 but without harbouring any intention to hit PW1 with his car. The Respondent clearly undertook the grave risk of having a second contact with PW1 by driving forward again under these circumstances, and it is not surprising that PW1 was hit asecondtime. 56 It certainly raises the question as to whether the Respondent’s acts wereintentionalwhen he inched his car forward and hit PW1 asecondtime, because the Respondent had argued with PW1 and was now irritated by PW1 who was still blocking his way to stop him from leaving the scene. The Respondent must have been angry with PW1 who was in the process of issuing him a summons. According to PW1, he moved to the front of the car and faced the driver because he wanted to take down the licence plate number of the car, and at the same time he could watch both the driver and oncoming traffic on his left (presumably for safety reasons).43Foot Note 43×ROP at p 32 and 33.Whilst PW1 was filling up the summons form, he noticed the vehicle inching forward and then he felt pain on his left leg. PW1 said he immediately raised his left hand to indicate to the Respondent to stop his car. PW1 remained where he was and continued writing on the summons form. He then noticed that the car reversed and moved forward to hit him asecondtime, before the car reversed again and moved off.44Foot Note 44×ROP at p 33 and 34. 57 Taking the Respondent’s case at its highest, the Respondent did not care that PW1 was in front of his car and obstructing his way. He simply tried to manoeuvre forward and squeeze his car through, though he was clearly aware that PW1 stood in the way and hemmed his car in by standing close to the front of his car, an act which in my view is no doubt rash in nature.",
        "Conclusion": "58 For these reasons, I allow the Prosecution’s appeal against acquittal and find the Respondent guilty of the charge and convict him accordingly. 59 I will now hear the parties on their submissions on sentence. Chan Seng OnnJudge Mohamed Faizal, Kelly Ho Yan-Qing and Azri Imran Tan (Attorney-General’s Chambers) for the appellant;Chhabra Vinit (Vinit Chhabra Partnership) for the respondent.      Exhibit P7"
    }
}