{
    "case_title": "TDL vTDK",
    "ncitation": "[2017] SGHCF 20",
    "coram": "Valerie Thean JC",
    "sections": {
        "Introduction": "1  This was an application for an extension of time for leave to appeal against the decision of a District Judge (“the Judge”) on ancillary matters in divorce proceedings between the applicant (the husband) and the respondent (the wife). The order on ancillary matters was made on 15 July 2016. Time for the filing of a notice of appeal expired on 29 July 2016. The respondent obtained Final Judgment on 1 August 2016. 2 The Judge’s decision included an order that the applicant should transfer one of the properties jointly held by parties (“the Miltonia Property”) to the respondent. The applicant has neither complied with that order nor applied for a stay of execution of that order. In the meanwhile, the respondent is living in rented premises while paying the mortgage and expenses for the Miltonia Property. 3 On 30 March 2017, I granted the applicant an extension of time, subject to the condition that he was to execute the transfer of the Miltonia Property to the respondent within stipulated timeframes (“the Condition”). The net value of the Miltonia Property accounted for about 17% of the asset pool. The order was made on the premise that, as the Judge’s property division orders concerned a much larger pool of assets, any appellate intervention regarding the property division would proceed on the basis that the transfer of the Miltonia Property had been effected. The applicant did not comply with the Condition. On 6 April 2017, after seeing parties, I granted a further extension of time as requested by counsel for the applicant, Mr Dhanwant Singh (“Mr Singh”). Again, the Condition was not complied with, and again, Mr Singh applied by letter for a further court appointment. I saw parties again on 18 April 2017 and decided not to grant any further extension. The applicant appeals against this decision of 18 April 2017.",
        "Principles for an extension of time to appeal": "4 The principles for granting an extension of time are not in dispute. As stated by the Court of Appeal inLee Hsien Loong v Singapore Democratic Party and others and another suit[2008] 1 SLR(R) 757 (“Lee Hsien Loong”) at [18] (cited recently inWerner Samuel Vuillemin v Oversea-Chinese Banking Corp Ltd[2017] 3 SLR 501 at [15]), four factors are to be considered: (a) the length of the delay; (b) the reasons for the delay; (c) the chances of the appeal succeeding if the extension of time were granted; and (d) the prejudice caused to the would-be respondent if an extension of time were granted. 5 The Court of Appeal inLee Hsien Loongalso noted that, in the context of appeals, the overriding concern is that there should be finality (at [33]).",
        "Decision and reasons": "6 Having considered the four factors listed above, I was of the view that the applicant’s chances of succeeding in his intended appeal was not without any prospect of success. Nevertheless, given the length of the applicant’s delay, the reasons for such delay and the prejudice that would be caused to the respondent, I decided that it would not be appropriate to grant a further extension of time. I shall address each of the four factors in turn, starting with the chances of the appeal succeeding.",
        "Chances of appeal succeeding": "7 In considering the merits of the appeal, the court may adopt a very low standard.Lee Hsien Loongat [19] enjoined the court to consider whether the appeal is “hopeless”, citingAberdeen Asset Management Asia Ltd v Fraser & Neave Ltd[2001] 3 SLR(R) 355 at [43]: As to the question of merits, it is not for the court at this stage to go into a full-scale examination of the issues involved. Neither is it necessary for the applicant to show that he will succeed in the appeal. The threshold is lower: the test is, is the appeal hopeless? … Unless one can say that there are no prospects of the applicant succeeding on the appeal, this is a factor which ought to be considered to be neutral rather than against him. 8 In the present case, the applicant intended to appeal against the following ancillary orders made by the Judge: (a) that the respondent receives care and control of the son; (b) that the respondent receives a 40% share of the sale proceeds of the matrimonial flat; (c) that the applicant transfers all his interests in the Miltonia Property to the respondent for no cash consideration; (d) that the respondent keeps her CPF monies, gold ornaments, other precious metals and family heirlooms to which the applicant had contributed; (e) that the respondent transfers her interests in the matrimonial properties in the US and India to the applicant, but that he bears all fees relating to the transfer of the properties; (f) that the applicant pays maintenance of $1,400 per month (subsequently varied to $1,000 per month from April 2017) for the son; and (g) that the applicant pays the respondent the costs of the proceedings. 9 These orders fall into these categories: (a) the order for the care and control of the son; (b) the order of maintenance for the son; (c) the orders as to the division of matrimonial assets; and (d) costs. Under s 137(2) of the Women’s Charter (Cap 353, 2009 Rev Ed), no appeal may lie purely on the issue of costs. I therefore considered the chances of the appeal succeeding in relation to the other categories of orders which the applicant intended to appeal. 10 There is little merit in the applicant’s appeal against the order that the respondent receive sole care and control of the son. He has not been involved in the son’s life. The son, on his part, furnished a written statement that he wanted nothing to do with the applicant.1Foot Note 1×Respondent’s submissions dated 30 March 2017 at para 24. 11 There is also little merit in the applicant’s appeal against the order that he should pay $1,400 per month in maintenance for the son, which sum was reduced to $1,000 by the Judge with effect from April 2017. The applicant contends only that “at the time of the [ancillary matters] hearing, [he] was unemployed”, and that the part-time job that he found thereafter provides an income that is less than double the sum of $1,400.2Foot Note 2×Applicant’s submissions dated 29 March 2017 at para 22.The applicant accepted that the “Family Court has on 29 March 2017, revised the maintenance to $1,000 commencing from April 2017”, but submitted that the “Court has no powers to revoke the earlier maintenance order or to back-date the present variation order to July 2016.”3Foot Note 3×Applicant’s submissions dated 29 March 2017 at para 23.By this, the applicant appeared to suggest that the variation of the maintenance order on 29 March 2017 was insufficient to address any prejudice he allegedly suffered by virtue of having to pay maintenance in the sum of $1,400 prior to April 2017. However, in his submissions, the applicant does not refer to any evidence to show that his income is insufficient to provide either $1,000 or the earlier sum of $1,400 in maintenance for the son. Further, there are inconsistencies in the applicant’s evidence on his employment. 12 Regarding the division of matrimonial assets, the applicant made a brief and general submission as follows:4Foot Note 4×Applicant’s submissions dated 29 March 2017 at para 21. On the question of the matrimonial flat and the [Miltonia Property], he has made substantial contributions towards their acquisition and the award are not reflective of his direct and indirect contributions. The transfer of the USA and India properties to [him] are not significant or adequate. The reasons for [him] not receiving any award in [the Miltonia Property] is unclear despite [him] having made significant contributions towards its acquisition. 13 Looking at his contention with reference to the list of matrimonial assets set out in the parties’ Ancillary Matters Fact and Position Sheets, and using the applicant’s values for the Miltonia Property and land in India and the USA, the Judge appeared to have awarded the applicant 59% of the matrimonial assets: AssetNet ValueHusband’s Share (Value)Wife’s Share (Value)Matrimonial Flat$540,00060% ($324,000)40% ($216,000)Miltonia Property$158,0000%($0)100% ($158,000)Lands in India$208,000100% ($208,000)0%($0)Lands in USA$12,000100% ($12,000)0%($0)Total$918,00059% ($544,000)41% ($374,000) This was a 24-year marriage, and the respondent, aside from contributing financially, was the primary caregiver to the children for much of the marriage while the applicant worked overseas. It was not clear that there was merit in the applicant’s appeal on the overall division of the assets. 14 Nevertheless, the test being whether the appeal is hopeless (see [7] above), the threshold for this factor was a very low one. While it was not clear that the applicant’s intended appeal had merit, it could not be said that the appeal was hopeless. An appeal would require detailed analysis of the range of factors that a court must consider in ordering the division of matrimonial assets under s 112(2) of the Women’s Charter. In addition to challenging the global allocation of 59% to the applicant, the applicant may also have appealed against the individual orders made in respect of the various properties within the pool of matrimonial assets. 15 In view of the above, it could not be said that the applicant had no prospects at all of succeeding upon appeal. The chances of his appeal succeeding were thus a neutral factor (seeLee Hsien Loongat [19]). However, this neutral factor was to be balanced against the other three factors, all of which weighed against the applicant. I turn now to the length of the delay.",
        "Length of delay": "Procedural history leading to the present application 16  Prior to bringing the present application, the applicant had filed a prior application (OSN 20/2016) for an extension of time to appeal against the Judge’s orders on 8 August 2016. This was 10 days after the time period permitted for filing a notice of appeal against the Judge’s ancillary orders had expired on 29 July 2016. 17 OSN 20/2016 was not served at the proper address. The court directed the applicant to rectify the error and to file and serve OSN 20/2016 as amended on the respondent by 24 August 2016. The Assistant Registrar also made an unless order requiring the applicant to pay the respondent costs of $600 within three days, failing which OSN 20/2016 would be struck out (“the Unless Order”). 18 On 31 August 2016, the court informed the parties that OSN 20/2016 had been struck out because the applicant had failed to pay the costs of $600. On 2 September 2016, the applicant filed an appeal (RAS 38/2016) against the Unless Order without first complying with the order or asking to restore OSN 20/2016. The appeal was dismissed on 13 October 2016, as OSN 20/2016 was no longer before the court. 19 Subsequently, on 2 November 2016, the applicant filed the present application (OSN 36/2016) seeking leave to file a notice of appeal out of time. The originating summons was later amended, and the amended originating summons was re-filed on 17 November 2016. Assessment of the length of delay 20 In view of the procedural history detailed above, the question arose as to how the length of delay should be assessed. The applicant argued that the period of delay was less than two weeks because he filed OSN 20/2016 on 8 August 2016 to seek an extension of time to file his notice of appeal. 21 I did not agree that the length of the delay should be calculated with reference to 8 August 2016. I accept that inFalmac Ltd v Cheng Ji Lai Charlie and another matter[2014] 4 SLR 202, the Court of Appeal took the length of delay as the time between the last day for filing a notice of appeal and the day on which the applicant filed an originating summons seeking an extension of time (at [18]). In the present case, the originating summons filed on 8 August 2016 is not the same originating summons that was before me on 30 March 2017. Although the applicantfiledOSN 20/2016 on 8 August 2016, he failed toserveOSN 20/2016 on the correct address. Consequently, the respondent did not receive notice of the application for an extension of time to appeal. When granted leave to amend and re-serve OSN 20/2016 on payment of $600 in costs to the respondent, the applicant neglected to pay the costs. OSN 20/2016 was then struck out. Rather than complying with the costs order in order to restore the OSN, the applicant waited until 2 November 2016 to file a new OSN. 22 The length of delay in this case was, at the very least, the time between the last day for filing a notice of appeal, 29 July 2016, and the day on which the applicant filed thepresentapplication, 2 November 2016. This was a period of about three months, which was far in excess of the two-week appeal window provided in r 825 of the Family Justice Rules 2014 (S 813/2014). 23 It should be noted that even a delay of 49 days has been held by the Court of Appeal to be “[b]y any standard ... very substantial” (AD v AE[2004] 2 SLR(R) 505 at [11]).  In light of this, the delay of over three months in this case was a factor which militated in favour of dismissing the application for an extension of time.",
        "Reasons for delay": "24 The applicant explained that his delay in seeking an extension of time to file a notice of appeal between 29 July 2016 and 8 August 2016 was due to the fact he had been unwell and needed a lawyer to represent him as he had been acting in person. This led to him filing OSN 20/2016, which was “struck out not on substantial issues but on the issue of an unless costs order.” Accordingly, he had to file OSN 36/2016 “due to the striking out of the first leave application.”5Foot Note 5×Applicant’s submissions dated 29 March 2017 at paras 10, 12 and 18. 25 These were not robust explanations. The fact that the applicant had been unwell and needed a lawyer to represent him accounted only for the delay between 29 July 2016 and 8 August 2016, when OSN 20/2016 was filed. The applicant gives no good reason for the delays thereafter that led to the striking out of OSN 20/2016 and his eventual filing of OSN 36/2016 on 2 November 2016. His only explanation for his need to file OSN 36/2016 is that OSN 20/2016 had been struck out. Yet it was the very dilatory conduct of the applicant that led to the striking out of OSN 20/2016 (see [18] above). He could have complied with the unless order or attempted to restore the OSN. He has offered no satisfactory explanation for why he waited until 2 November 2016 to file the present application. The applicant in an affidavit deposed on 16 January 2017 belatedly claimed that he had insufficient time to raise the $600 in costs that would have averted the striking out of OSN 20/2016,6Foot Note 6×Applicant’s affidavit dated 16 January 2017 at para 11.but made no mention and provided no evidence as to the efforts that he had taken to raise the sum.",
        "Prejudice": "26 The issue of prejudice was the strongest factor weighing against granting him an additional extension of time. 27 The respondent has been living in rented accommodation. After the ancillary orders were made, the applicant did not comply with them. On 21 November 2016, the respondent filed an application (SUM 3981/2016) for the Miltonia Property to be transferred to her pursuant to the ancillary orders, on account of the applicant’s failure to effect such transfer. SUM 3981/2016 was heard by the Judge on 14 December 2016. The Judge made no orders on SUM 3981/2016 because counsel for the applicant told him that only the High Court had jurisdiction to hear the matter, and in any event, the parties were discussing the transfer of the Miltonia Property from the applicant to the respondent.7Foot Note 7×Notes of Argument (30 March 2017) at pp 4–5. 28 By 30 March 2017, no transfer had yet been made. This was the reason I made the extension of time subject to the Condition, which made it necessary for the applicant to do all that was necessary to transfer the Miltonia Property to the respondent. In making this order, I had in mind that the respondent required accommodation and had been making the mortgage payments for the Miltonia Property on the basis that the property would be transferred to her. Further, the appellate court would take the transfer into account when considering the details of the property division, and would proceed on the basis that the transfer had been effected. The net value of the Miltonia Property only accounted for 17% of the asset pool and any revision of the orders on appeal could take this into account. Counsel for the applicant specifically agreed to the Condition and the seven-day timeframe stipulated for compliance. I thus ordered the applicant to execute the transfer of the Miltonia Property and to file his notice of appeal within seven days of 30 March 2017.8Foot Note 8×Notes of Argument (30 March 2017) at p 6. 29 On 2 April, Mr Singh wrote to the court with further arguments to the effect that complying with the Condition would prejudice the applicant’s appeal. This was inconsistent with the position Mr Singh had taken in court on 30 March 2017, when he had expressly agreed to comply with the Condition.9Foot Note 9×Notes of Argument (30 March 2017) at p 5.The court’s decision was reiterated in a Registrar’s Notice when an appointment was given to parties. Ms Sharma in fact requested Mr Singh to procure the applicant’s attendance in court on 6 April 2017 so that he could sign the relevant papers, which she had brought with her to court. If the applicant had been present, the papers would have been signed that very day. Mr Singh said on 6 April that he had not seen Ms Sharma’s request, and had told the applicant that he need not attend at court.10Foot Note 10×Notes of Argument (6 April 2017) at p 1. 30 Mr Singh then expressly agreed in the course of the hearing before me that he would see to it that the applicant would execute the relevant transfer documents by 7 April 2017.11Foot Note 11×Notes of Argument (6 April 2017) at p 5.Despite the further extension, the relevant transfer documents remained unsigned by the applicant at the close of business on 7 April 2017. This was in spite of the fact that Ms Sharma had personally delivered the transfer documents to the office of Mr Singh at 3.25pm on 6 April 2017. Although Mr Singh offered the excuse that the applicant was busy during working hours, the applicant could have signed the transfer documents as early as the evening of 6 April 2017. 31 When Ms Sharma telephoned Mr Singh at 4.55pm on 7 April 2017, she was informed by Mr Singh’s secretary that she had no instructions on the execution of the transfer documents for the Miltonia Property. It was only after the close of business hours, at 6.54 pm, that Mr Singh sent an email to Ms Sharma informing her that the applicant had signed the relevant transfer documents. Further, the transfer documents were only sent to Ms Sharma at 12.10pm on 10 April 2017.12Foot Note 12×Respondent’s submissions dated 17 April 2017 at paras 7–10.Ms Sharma refused to accept them. Mr Singh followed up with two letters to the court, first at 1.47 pm and then at 9.19 pm, requesting further arguments (“the 10 April Letters”) 32 In the letter sent to the court on 10 April 2017 at 9.19 pm, Mr Singh stated that he had misinterpreted my orders on 6 April 2017. It seems he had the mistaken impression that he had a total of eight days to sign and returnboththe transfer documents as well as the mortgage-in-escrow, rather than one day to sign and return the transfer documents and eight days to sign and return the mortgage-in-escrow. Case law is clear, however, that a mistake by a solicitor is insufficient reason to justify granting an extension of time to file a notice of appeal (seeKunal Gobind Lalchandani v Konduri Prakash Murthy[2005] SGHC 94 at [35] citingDenko-HLB Sdn Bhd v Fagerdala Singapore Pte Ltd[2002] 3 SLR 357 at [13]–[14]). More importantly, I found it difficult to accept Mr Singh’s explanation. On 6 April 2017, he clearly communicated that he understood the orders, which were explained and repeated to him. The claims about his alleged confusion were made only by way of letter, without the support of an affidavit. Moreover, the account given in the 10 April Letters was inconsistent with what Mr Singh told the court at the hearing on 18 April 2017 in several ways: First, Mr Singh stated in the 10 April Letters that “on 7 April 2017 [his] client was only able to come to our office to execute the Transfer [documents] after 6pm”. Before me he claimed that his “client only came at 4pm”.13Foot Note 13×Notes of Argument (18 April 2017) at p 2.Secondly, Mr Singh stated in the 10 April Letters that his office attempted to deliver the signed transfer documents in the “morning” of 10 April 2017, when the delivery had in fact been attempted at 12.10pm.14Foot Note 14×Notes of Argument (18 April 2017) at p 1.While these inconsistencies could also be taken as inadvertent inaccuracies rather than attempts to mislead, neither the account in the 10 April Letters nor the account offered by Mr Singh at the hearing on 18 April 2017 gave good reasons for any further extension; unsurprising, neither account was supported by affidavit. The extension given on 6 April 2017 had been conditional, and the time set for complying with the Condition had passed. 33 The applicant submitted that he “was within his rights in filing his many summons applications and appeals thereon” and that the respondent “has been compensated in terms of costs”.15Foot Note 15×Applicant’s submissions dated 29 March 2017 at para 28. 34 I am unable to agree that the respondent may be adequately compensated in terms of costs for the prejudice she has suffered due to the delays in these proceedings occasioned by the applicant’s conduct. Although in this judgment I have highlighted the delays since the time of the ancillary order, in fact, even before the ancillary orders were made, the applicant’s dilatory conduct throughout the divorce proceedings has made the proceedings a painful and protracted affair for the respondent. Almost five years have elapsed since the divorce proceedings were commenced by her. Even after the ancillary orders were made, the applicant neglected to comply with them by seeing to the transfer of the Miltonia Property to the respondent. This has left the respondent without any accommodation of her own in which to live, and has compelled her to rent another property in order to house herself and the children. In the meanwhile, the respondent has been responsible for the monthly mortgage instalments and other charges in relation to the Miltonia Property.",
        "Conclusion": "35 The Court of Appeal’s guidance inSun Jin Engineering Pte Ltd v Hwang Jae Woo[2011] 2 SLR 196 at [30] is instructive: In our view, what the aforesaid authorities show is that in each case, the court, in deciding whether to extend the prescribed timeline for an act to be done, has to balance the competing interests of the parties concerned. As the statement of Millett LJ inMortgage Corporation(quoted above at [27]) shows, the factual matrix of the case at hand will be paramount. In balancing the parties’ competing interests, the court inevitably needs to consider the question of prejudice. Copious citation of case law will not be necessary (and also will not be helpful) as previous decisions will be no more than guides. In determining how the balance of interests should be struck and in applying the four factors mentioned at [29] above,it is the overall picture that emerges to the court as to where the justice of the case lies which will ultimately be decisive. [emphasis added in bold italics] 36 Parties have a right to appeal and the rules set out the time limits for them so to do. These rules “mustprima faciebe obeyed” (see the remarks of Lord Guest in the Privy Council case ofRatnam v Cumarasamy[1965] 1 WLR 8 at 12). It follows then, that good reasons are required to support each request for an extension, because each extension given is a deviation from the standards and expectations that have been set by virtue of the very time limits which circumscribe the right to appeal. It further follows that where any extension has been granted, such a court order ought to be viewed with seriousness. Litigants must place emphasis upon compliance because the court, in granting the extension, has granted a measure of indulgence from stipulated norms.The applicant failed to appreciate this core principle.In the light of his scant regard for the authority of the court, the respondent ought not to be deprived the benefit of finality. Valerie TheanJudicial Commissioner Dhanwant Singh (S K Kumar Law Practice LLP) for the applicant;Anuradha s/o Krishan Chand Sharma (Winchester Law LLC) for the respondent."
    }
}