{
    "case_title": "BCBC Singapore Pte Ltd and another vPT Bayan Resources TBK and another",
    "ncitation": "[2017] SGHC(I) 06",
    "coram": "Quentin Loh J, Vivian Ramsey IJ and Anselmo Reyes IJ",
    "sections": {
        "Introduction": "2 The background and facts surrounding these disputes have been set out in our earlier judgment dated 12 May 2016 for the first tranche of this trial (“Tranche 1”): seeBCBC Singapore Pte Ltd and another v PT Bayan Resources TBK and another[2016] 4 SLR 1; [2016] 5 LRC 186 (“the First Judgment”) at [1] – [85]. We will not repeat the same and will only refer to those facts insofar as it is necessary to do so to answer the issues raised in Tranche 2. Unless otherwise specified, we adopt the same abbreviations used in the First Judgment. 3 To recapitulate, in the First Judgment, we determined issues which fell into three categories,viz, funding issues, coal supply issues and counterclaim issues (see the First Judgment at [86]). We held,inter alia, as follows: (a) in respect of the funding issues, we held that BR was not obliged to fund the joint venture between November 2011 and March 2012 on two grounds (see the First Judgment at [92] – [131]). First, cl 4 of the Funding MOU did not override cll 7.1 and 8 of the JV Deed. Secondly, the good faith obligation in cl 17.3 of the JV Deed did not constrain BR to approve any and all additional expenditure assessed by BCBCS. We also held that BCBCS had not undertaken to fund the joint venture until commercial production (see the First Judgment at [137] – [146]); (b) with regard to the coal supply issues, we held that the arrangements under the April 2011 Side Letter read with the 2010 CSAs were neither illegal nor tainted with illegality (see the First Judgment at [172] – [228]); (c) on the counterclaim issues, we held that BCBCS was not under an implied obligation to use the reasonable skill and care expected of a competent designer, builder and operator of coal preparation and briquetting plants in providing technical assistance to KSC (see the First Judgment at  [263] – [271]). For completeness, we also held that there was no implied term of the JV Deed and/or the Funding MOU that BCBCS was under a contractual obligation to procure that KSC produce 1 MTPA of upgraded coal briquettes within a reasonable time (see the First Judgment at [272] – [287]). 4 We also held that we were not able to answer the other coal supply issue, Issue 4, which was formulated as follows (see [155] of the First Judgment): … whether BR was under an obligation to supply and/or assist in procuring coal to be supplied to KSC on the basis set out in the JV Deed, PLFA and/or the April 2011 Side Letter, in around the period between early November 2011 to 2 March 2012. We left this question open for Tranche 2 because there was “insufficient evidence … before us to answer the question of what coal KSC required in early November 2011 to 2 March 2012”: see [171] of the First Judgment. We stated that “what stage the commissioning had reached by early November 2011 and whether there was sufficient coal for the commissioning process during the relevant period … cannot be answered on the inadequate evidence placed before us”, and reserved Issue 4 for Tranche 2 where the necessary facts and evidence could be fully adduced and explored. 5 For Tranche 2, the parties formulated a further list of eleven issues for our determination. Again, the issues fall within three broad categories:1Foot Note 1×List of Issues for Tranche 2. (a) coal supply issues (Issues 1 to 4); (b) repudiation issues (Issues 5 to 8); and (c) causation and loss issues (Issues 9 to 11). Notably, the parties were unable to agree on all the issues to be determined in Tranche 2. They agreed on the framing of Issues 2, 4, 5 to 8, 10 and 11, but were unable to agree on the wording of Issues 1, 3 and 9. In response, we informed the parties that we would hear Tranche 2 on the basis of the list of agreed and non-agreed issues set out in the Plaintiffs’ solicitors’ letter to the Court dated 18 November 2016. On those issues upon which the parties could not reach agreement, we would decide matters based on the pleaded issues, with each party being able to argue as to what the pleaded issues were.2Foot Note 2×Letter to the Parties dated 1 December 2016.We have set out these agreed and non-agreed issues in our judgment below. 6 In this tranche, the parties were, in essence, focused on: (a) Issue 4 from Tranche 1 (Issues 1 to 3 of Tranche 2); (b) the alleged breaches by BR of obligations in relation to the supply of coal to KSC (“BR’s coal supply obligations”) (Issue 4 of Tranche 2); (c) whether, in the events that occurred at the end of 2011 and early 2012, either party was in repudiatory breach of its obligations; and if so, whether the other party had accepted the other’s repudiatory breach (if any) and put an end to the joint venture (Issues 5 to 8 of Tranche 2); and (d) whether, even if BR was in repudiatory breach of its coal supply obligations, such breach could have caused BCBCS loss, given our conclusion in Tranche 1 that BR was not obliged to fund KSC between November 2011 and 2 March 2012 (Issues 9 to 11 of Tranche 2). The thrust of the Defendants’ case on this point is as follows: (i) BCBCS was not entitled under the JV Deed to unilaterally fund KSC without BR’s approval; (ii) accordingly, KSC was simply not viable, since it was devoid of funding from BR and unable to receive funding from BCBCS due to BR’s objections to such funding; (iii) even if coal had been supplied, KSC would not have been able to do anything with the coal (much less upgrade the same into coal briquettes) without funding; (iv) thus, even if BR had breached its coal supply obligations, this could not have caused loss to BCBCS. On these premises, it follows that, even if BR had breached its coal supply obligations, the damages for such breach would only be nominal. Thus, the Defendants argue that there is no need for a third tranche of these proceedings (“Tranche 3”) to determine the quantum of any loss or damage suffered by BCBCS due to BR’s alleged breach. 7 During a Case Management Conference (“CMC”) before Tranche 2, we informed the parties that reference could be made to evidence from Tranche 1 (to avert the need to recall witnesses to repeat their evidence).3Foot Note 3×Notes of Evidence of Case Management Conference (“CMC”) dated 8 November 2016.In this judgment, we shall refer to evidence from Tranche 1 where it is relevant. 8 We heard Tranche 2 on 4–6 and 12–13 January 2017. Thereafter, the parties submitted written closing submissions and reply submissions. We then heard oral closing submissions from the parties on 20 April 2017.",
        "The witnesses": "9 The following witnesses testified for the Plaintiffs in this tranche: (a) Mr Brian Flannery (“Mr Flannery”), the Managing Director and the Chief Executive Officer (“the CEO”) of WEC, who is also a director of the Plaintiffs, and who was a former director of KSC;4Foot Note 4×Affidavit of Evidence-in-Chief (“AEIC”) of Brian Joseph Flannery dated 28 December 2016 (“Flannery’s 1st T2 AEIC”) at paras 1 – 2. (b) Ms Neale, the Business Development Counsel of WEC (see also [83(b)] of the First Judgment);5Foot Note 5×AEIC of Andromeda Neale dated 16 October 2015 (“Neale’s T1 AEIC”) at para 5.and (c) Mr John Reilly (“Mr Reilly”), who was KSC’s Construction Superintendent from 19 July 2007 to August 2009 and KSC’s Site Operations Manager from September 2009 to December 2011, and who has more than 35 years of experience in the coal industry.6Foot Note 6×1st AEIC of John Reilly dated 2 January 2017 (“Reilly’s 1st T2 AEIC”) at paras 13 – 14. In addition, Mr David Friedlander filed an affidavit for the Plaintiffs which was admitted into the evidence.7Foot Note 7×Transcript, 13 January 2017, p 104.But the Defendants did not cross-examine Mr Friedlander; and, upon their withdrawal of the argument that BCBCS had repudiated the JV Deed by permitting WEC to make public announcements relating to the same (see [146] below), his evidence became superfluous. The Plaintiffs had also intended to call Mr Toh Ching Wah (“Mr Toh”), but later decided, in view of developments during the trial, not to rely on his evidence (see [53] below).8Foot Note 8×Transcript, 12 January 2017, p 85 10 The following witnesses testified for the Defendants in this tranche: (a) Mr Neil, a Director and Chief Development Officer of BR and a director of BI (see also [84(a)] of the First Judgment);9Foot Note 9×AEIC of Russell John Neil dated 16 October 2015 (“Neil’s T1 AEIC”) at para 1. (b) Mr McLeod, a Director and the Chief Financial Officer (“the CFO”) of BR and a director of BI (see also [84(b)] of the First Judgment);10Foot Note 10×AEIC of Alastair Gorden Christopher McLeod dated 15 October 2015 (“McLeod’s T1 AEIC”) at para 1. (c) Mr Lim, a Director and the Chief Operating Officer (“the COO”) of BR and a director of BI (see also [84(d)] of the First Judgment); and (d) Mr John Kipling Alderman (“Mr Alderman”), the President of Advanced Coal Technology (a company which provides coal quality consulting and process design services), who has 41 years of experience in the coal industry.11Foot Note 11×AEIC of John Kipling Alderman dated 23 December 2016 (“Alderman’s T2 AEIC”) at para 1. 11 The following representatives of the Plaintiffs and the Defendants also played leading roles in the key events detailed at [13] – [65] below: (a) Mr Duncan, the current chairman of WEC and a director of the Plaintiffs (see also [83(a)] of the First Judgment);12Foot Note 12×AEIC of Travers William Duncan dated 16 October 2015 at para 7. (b) Mr Maras, the CFO of WEC (see also [83(c)] of the First Judgment);13Foot Note 13×AEIC of Ivan Maras dated 16 October 2015 at para 1. (c) Dato Low Tuck Kwong (“Dato Low”), the chairman of BI; and (d) Mr Chin, the President Director and the CEO of BR and a director of BI (see also [84(c)] of the First Judgment).14Foot Note 14×AEIC of Chin Wai Fong dated 16 October 2015 (“Chin’s T1 AEIC”) at para 1.",
        "The key facts": "12 We now set out the key facts in Tranche 2. Insofar as these facts are disputed, the following paragraphs constitute our findings of fact.",
        "Events leading up to the November 2011 Board Meeting": "13 It will be seen from the First Judgment that a major bone of contention between the parties was the funding and escalating costs to complete the Tabang Plant. Despite a Funding MOU dated 16 March 2009, numerous emails continued to be exchanged between the parties on this and other issues. 14 The PLFA was signed by KSC, BR and BCBCS on 17 December 2010 but backdated to 22 April 2010 (see [58] of the First Judgment). 15 On 23 September 2010, the HBA Regulations were introduced to determine the HBA prices for minerals and coal in Indonesia. The HBA Regulations came into force on 1 October 2010 (see [62] of the First Judgment). 16 Between March and June 2011, KSC entered into the 2010 CSAs with Bara and FSP respectively (see [66] of the First Judgment). The 2010 CSAs were backdated to 1 October 2010, the date when the HBA Regulations came into force. 17 From around April to August 2011, Ms Trish O’Bryan (“Ms O’Bryan”), a WEC employee, was seconded to KSC to manage KSC’s accounts.15Foot Note 15×AEIC of Alastair Gordon Christopher McLeod dated 10 January 2017 (“McLeod’s 2nd T2 AEIC”) at para 26 and AM-127 (p 119).On 26 April 2011, Ms O’Bryan sent Mr McLeod an email which attached a cost report from KSC for the year ending March 2011 (“the March 2011 Cost Report”).16Foot Note 16×13.ACB 10261In her email, Ms O’Bryan stated that the report contained “draft numbers”. The report showed that, as of March 2011, the Tabang Plant’s operating costs had exceeded the budgeted sum by US$1,715,244 (with total costs exceeding the budgeted amount by US$1,457,354).17Foot Note 17×13.ACB 10263.Although Mr McLeod emphasised in his reply affidavit of evidence-in-chief (“AEIC”) that these figures were merely “draft numbers”,18Foot Note 18×McLeod’s 2nd T2 AEIC at para 30.during cross-examination, he accepted that, by 26 April 2011, he was aware that KSC had exceeded its budget.19Foot Note 19×Transcript, 13 January 2017, p 64.We therefore find that, by 26 April 2011, BR knew that KSC was spending in excess of its budget. 18 On 15 July 2011, Ms O’Bryan sent an email to Mr McLeod’s colleague which was forwarded to Mr McLeod on the same day.20Foot Note 20×13.ACB 10323The email attached the cost report from KSC for the year ending June 2011 (“the June 2011 Cost Report”) which showed that, as of June 2011, the Tabang Plant’s operating costs had exceeded the budgeted sum by US$6,071,314.21Foot Note 21×14.ACB 10361.Mr McLeod deposed that the June 2011 Cost Report caused BR grave concerns, and led BR to call for a KSC Board Meeting to discuss,inter alia, the KSC budget.22Foot Note 22×McLeod’s 2nd T2 AEIC at para 33.We therefore find that, on 15 July 2011, BR was reminded, and thus knew, that KSC had exceeded its budget. The KSC Board meeting which BR called for was eventually convened in November 2011 (“the November 2011 Board Meeting”).",
        "The November 2011 Board Meeting": "19 On 28 October 2011, Mr Maras sent an email to Mr Neil which enclosed an “Information Package” (“the November 2011 Board Pack”) in advance of the November 2011 Board Meeting.23Foot Note 23×14.ACB 10524 - 10585.The November 2011 Board Pack showed that, as of 30 September 2011, KSC had exceeded its budget for 2011 by a total of US$6,987,962 (US$6,671,727 in relation to Tabang Site Expenses and US$316,235 in respect of Balikpapan Office Costs).24Foot Note 24×14.ACB 10525, 10580 – 10581.Mr McLeod deposed that it was only at this point, from the material in the November 2011 Board Pack, that BR realised that KSC was (almost US$7m) over budget.25Foot Note 25×AEIC of Alastair Gordon Christopher McLeod dated 3 January 2017 (“McLeod’s 1st T2 AEIC”) at para 17.We do not accept this; we have found at [17] above that BR knew, by 26 April 2011, that KSC had exceeded its budget. 20 The November 2011 Board Meeting took place on 2 and 3 November 2011. Mr Flannery, Mr Maras and Mr Michael Chapman (“Mr Chapman”), the COO of WEC and Acting General Manager of KSC,26Foot Note 26×Flannery’s 1st T2 AEIC at para 16.represented BCBCS. Mr Chin, Mr McLeod and Mr Neil represented BR. In addition, Mr Lim and Mr Irwan Darmawan, who had just been appointed as KSC’s Financial Controller,27Foot Note 27×Flannery’s 1st T2 AEIC at para 46.attended the meeting on 2 November 2011. 21 There are two sets of notes of the discussions on each day. Mr Maras and Mr Neil took notes on 2 November 2011;28Foot Note 28×14.ACB 10803 – 10804 (Maras); 14.ACB 10809 (Neil).Mr Maras and Mr McLeod took notes on the next day.29Foot Note 29×14.ACB 10805 – 10806 (Maras); 14.ACB 10810 – 10811 (McLeod).We note these are contemporaneous records and they are generally in harmony with Mr Chin’s, Mr Flannery’s and Mr Maras’ accounts of the meeting in their AEICs.30Foot Note 30×Chin’s T1 AEIC at paras 34 – 35; Flannery’s 1st T2 AEIC at paras 44 – 64; AEIC of Ivan Maras dated 16 October 2015 (“Maras’ T1 AEIC”) at paras 415 – 420. 22 Mr Maras’ note indicates that the meeting began on 2 November 2011 with Mr Chapman first providing the Board with an update on the Tabang Plant, which had been shut down in October 2011 for modifications to be effected to the production module. His note then states the following: Project feasibility – [Mr Chin] raised issue of future feasibility of project, major shareholders of BR have instructed [management] to find a solution … BR’s representatives thereafter stated,inter alia, as follows: (a) Mr McLeod said that the solution was “[to] get out of [the] project”, for example, by selling the power station or stripping the Tabang Plant and selling the steel, and stated that “[the] project is not feasible”. (b) Mr Chin stated that BR wanted to sell the Project back to BCBCS. BR was “not sabotaging the [P]roject”, but its view was that “[the] project will not make money for KSC”. BR wanted “to get out of [the] JV”. Mr Chin also stated “project not returning to BR a return greater than discount built in to sell 4,200 CV [ie, Kcal/kg GAR] coal based on HBA Index”. (c) Mr Chin noted that, if BCBCS wanted to continue with the Project, BR would work with BCBCS to support BCBCS, for example, in relation to infrastructure issues. However, he said that “BR would need to sell coal to KSC at commercial rates” (for example, at US$40 per tonne for 4,200 CV coal, ex mine, without transport). (d) Mr Chin also stated that BR wanted the issue to be finalised by the end of 2011,ie, within two months. 23 Mr Neil’s note is a very brief one. It tersely states,inter alia, as follows: $40/tonne input x 1.6 (I) terms → recover investment on dollar per tonne basis. (II) terms →sell coal to KSC at commercial price(average of our selling price on open book basis). [emphasis added] 24 During Tranche 1, Mr Neil gave the following evidence regarding the meeting on 2 November 2011:31Foot Note 31×Transcript, 24 November 2015, pp 97 – 98 and 112. JUSTICE REYES:  Right. But at this point on 9 November, you hadn't actually withdrawn from the joint venture. You said you were intending to but you were still in the joint venture. A.Our position was on 2 November when we informed White Energy that was it, we were withdrawing from the joint venture at that point forward. JUSTICE REYES: You were withdrawing but you had already withdrawn on 9 --by 9 November you had already withdrawn, is it? A.That was our position, yes, sir. JUSTICE REYES:  Thank you. MR XAVIER:  So just to clarify, Mr Neil, BR's position in these proceedings is that at the meeting -- with effect from the meeting on 2 November, they were no longer in the joint venture, they had exited – A.We had exited the joint venture after notifying the other party, the other side, yes. Q.So effectively, at the end of the meeting that took place on 2 November, you didn't consider yourself as a joint venture party any more? A. Correct. … A. …Our position at that time was that we wanted to exit the joint venture and we were hoping to get an amicable resolution with White Energy. Q.  By that, you were hoping that White Energy would buy BR out, would that be fair? A.  That was one possible solution, yes. Q.  Well, you wanted to exit. Correct? A.  Correct. We wanted to exit. Q.As far as you were concerned, you were out of the JV from 2 November 2011? A.Yes, correct. [emphasis added] Mr Neil’s evidence was therefore that, on 2 November 2011, BR’s position was that it was exiting the joint venture immediately and that by the end of the 2 November meeting, BR no longer considered itself a party to the joint venture; it considered that it had exited the joint venture after informing BCBCS of the same. 25 Following the discussions on the Project’s feasibility, the meeting was adjourned to the next day. Mr Maras’ note indicates that, on 3 November 2011, the following discussion occurred: (a) BR stated that it wished to recover its US$45m investment in the Project. It would support WEC by supplying coal on arms’ length terms. (b) In response, Mr Flannery proposed two options which would allow the parties to “continue as is” until June 2012 and complete the modifications to the Tabang Plant. First, KSC could buy and sell coal at the HBA price (with BCBCS funding the shortfall). Secondly, coal could just be transferred with no sales recorded. Mr Flannery stated that either option would enable BR to write off its loans before the end of the year. Further, if the Tabang Plant were abandoned in the future, BCBCS would be entitled to the production module while BR would be entitled to the power station. (c) At this point, the meeting was adjourned for 30 minutes. When it resumed, Mr McLeod informed the meeting that BR did not see that the Project was viable and did not want to participate further as a 49% shareholder in KSC. Mr McLeod then set out two options as follows: (i) first, BCBCS could buy out BR’s 49% stake in the Project, thus enabling BR to recoup its US$45m investment, with the payment terms to be negotiated (“the US$45m buyout option”); (ii) secondly, the parties could immediately close the Tabang Plant and wind down the Project. Mr McLeod also reiterated that BR’s involvement would have to conclude by the end of 2011. 26 In relation to [25(b)] above, Mr Flannery deposed that, at the meeting on 3 November 2011, he had proposed the following options to BR:32Foot Note 32×Flannery’s 1st T2 AEIC at para 57(a) – (c). First, I informed BR that while our position was that the coal should be supplied in accordance with the Side Letter, we were willing to consider agreeing to KSC purchasing coal from BR and selling briquettes back to BR at HBA price until June 2012. I recall explaining that this will allow the remaining modifications to be completed in the meantime, and it would also give BCBCS some time to find a buyer for BR’s 49% stake. The alternative was for coal to be transferred to KSC and briquettes to BR with no sales recorded.  This would enable KSC’s operations to carry on with no cost to BR at all – the modifications and operating costs of the [Tabang Plant] would be funded entirely by BCBCS, and BR would receive upgraded coal in exchange for the low-grade coal which was supplied to KSC. I said that either option would allow BR to write off its loans to KSC before 31 December 2011. 27 Mr McLeod’s note of the meeting on 3 November 2011 is in line with Mr Maras’ account, and reflects the following: (a) Mr Chin stated that BR would supply coal, haulage and barging at commercial rates to KSC. BCBCS replied that the Project was not viable if KSC had to buy coal at US$40 per tonne. (b) BCBCS stated that it wished to carry on with the Project, and suggested a deadline of June 2012. (c) BR’s offer to BCBCS was for the latter to buy BR’s shares in the Project, with the payment terms being flexible. 28 Having set out the records of the November 2011 Board Meeting and Mr Neil’s testimony, we note that Mr Chin deposed on the meeting as follows: 34.  On 2 November 2011, Mr McLeod, Mr Neil, Mr Lim, Mr Irwan, Mr Brian Flannery, Mr Mike Chapman, Mr Maras and I attended the KSC board meeting in Jakarta, Indonesia. I recall that the following was discussed at the meeting: … (f)  I added thatBara and[FSP] had to supply coal to KSC (at least in the short term) in accordance with the terms of the 2010 Coal Supply Agreementsi.e. at the HBA Minimum Price, less transportation and port costs. … 35.  On 3 November 2011, Mr McLeod, Mr Neil, Mr Lim and I met with Mr Flannery, Mr Chapman and Mr Maras to continue the previous day’s discussion. At that meeting: … (b) I repeated my view that I did not think the Tabang Plant was technically or financially viable for BR, but that BR was prepared to continue supporting the Project (for the short term)by having Bara and/or[FSP] supply coal to KSC at a price which was in accordance with the terms of the 2010 Coal Supply Agreements; … [emphasis added] We note that Mr Chin identified Bara and FSP as the entities with obligations in relation to supplying coal to KSC, and spoke only of the 2010 CSAs. He did not state that BR had any obligations in relation to coal supply under the JV Deed or the PLFA. 29 Having reviewed the documentary evidence and heard the witnesses, we make the following further findings regarding what transpired at the November 2011 Board Meeting: (a) BR told BCBCS that the joint venture no longer made financial sense for BR; the Project was not feasible. (b) BR wanted to exit the joint venture and its exit to be finalised by the end of December 2011. We note that Mr Neil testified that BR had exited the joint venture on 2 November 2011, and no longer considered itself a party to the joint venture thereafter (see [24] above). If Mr Neil’s evidence is accepted, BR would have repudiated the JV Deed because, under the JV Deed, a party could not withdraw or bring the joint venture to an end by a unilateral declaration at a KSC Board Meeting. However, we do not accept Mr Neil’s evidence. The notes of the meeting show, and we find, that BR did not communicate to BCBCS that it had exited from the joint venture during the meeting. We place less weight on Mr Neil’s evidence, given during cross-examination a few years after the event, and give more weight to the contemporaneous documents. (c) Rather, what BR did was to inform BCBCS that it no longer wished to continue with the joint venture for the reasons set out above. BR then presented two options to BCBCS: the latter could buy out BR at US$45m on terms (ie, the time over which payment could be made) which were negotiable, or the parties could immediately wind down the Project and shut down the Tabang Plant. In turn, BCBCS presented two options to BR. Essentially, these were two experienced business entities negotiating with proposals and counter-proposals which were aligned to their respective, but conflicting, interests. What the parties said subsequently is consistent with this. (d) However, BR stated that if BCBCS wanted to continue with the Project, then Bara and FSP would only supply coal to KSC from then on at HBA prices,viz, at commercial rates and on arms’ length terms. We find that, in making this statement, BR committed a repudiatory breach of the PLFA by renunciation. This is because, under Art 7 of the PLFA, Bara and FSP were only entitled to US$8 per tonne immediately, and not HBA prices, for the coal which they supplied to KSC (see [58] of the First Judgment). By stating that Bara and FSP would only supply coal at HBA prices, BR renounced its obligation under Art 7.1 of the PLFA to ensure that coal was supplied to KSC in line with the deferred payment mechanism which the PLFA provided for. We consider that Art 7 was a condition of the PLFA. Therefore, BR’s renunciation of its obligation under Art 7.1 amounted to a repudiation of the PLFA. (e) It is noteworthy that BCBCS did not state at any time during the November 2011 Board Meeting that BR was in breach of its obligations. Nor did it state that it accepted any repudiatory breach by BR. (f) On the contrary, BCBCS asked that the Project continue as is until June 2012 by which time the modifications would have been completed. In this regard, BCBCS proposed two options. First, KSC could buy and sell coal at HBA prices and BCBCS would fund the shortfall. Secondly, coal could be transferred with no sales recorded. (g) The parties did not arrive at any final, concluded positions at the November 2011 Board Meeting. Rather, the meeting ended in an impasse and both sides left to consider their options and positions.",
        "The Cessation of the Coal Supply": "30 On 4 November 2011, Mr McLeod sent an email to Mr Maras and Mr Chapman stating that he had spoken to Mr Chin, and confirmed that as “an interim measure and for the short term Bayan would … [c]ontinue to supply coal to KSC at HBA … [and] [t]ake the upgraded coal at HBA”.33Foot Note 33×14.ACB 10812 31 On the same day, KSC requested that Bara and FSP deliver “2,000 tons of coal” and received 2,030.21 tonnes; again, on 5 November, KSC requested for “1,000 tons of coal” and received 1,035.88 tonnes.34Foot Note 34×2nd AEIC of John Reilly dated 2 January 2017 (“Reilly’s 2nd T2 AEIC”) at paras 9 – 11; see also AEIC of Russell John Neil dated 3 January 2017 (“Neil’s T2 AEIC”) at RJN-117 (p 101) and 1st AEIC of John Reilly dated 2 January 2017 (“Reilly’s 1st T2 AEIC”) at JR-1 Tab 40 (p 525).On 6 November, KSC requested for 2,000 tons of coal and received 809.34 tonnes on that day.35Foot Note 35×Reilly’s 2nd T2 AEIC at para 12; Neil’s T2 AEIC at RJN-117 (p 103) and Reilly’s 1st T2 AEIC at JR-1 Tab 40 (p 525).Then, on 7 November, KSC made the following request for coal:36Foot Note 36×14.ACB 10818 … We still needa lot of coal. Therefore request to continue the delivery to TCUP [Tabang Coal Upgrade Plant] tonight. Once we have enough, then I will convey information to IP to temporarily stop the supply. [emphasis added] 32 On 7 and 8 November 2011, KSC received 1,594.67 tonnes and 1,717.1 tonnes of coal from Bara and FSP respectively.37Foot Note 37×Reilly’s 1st T2 AEIC at JR-1 Tab 40 (p 525).In total, from 3–8 November 2011, KSC received 8,228.43 tonnes of coal from Bara and FSP.38Foot Note 38×Reilly’s 1st T2 AEIC at para 60 and JR-1 Tab 40 (p 525).As of 9 November, KSC had a stockpile of 18,606.56 tonnes of run of mine (“ROM”) coal.39Foot Note 39×Reilly’s 1st T2 AEIC at paras 61 – 62 (as amended by List of Corrections) and JR-1 Tab 11 (p 232). 33 However, on 9 November 2011, Mr Neil emailed Mr Wong Chong Keong (“Mr Wong”), the mine manager of Bara and FSP,40Foot Note 40×Reilly’s 1st T2 AEIC at para 34.instructing Mr Wong not to supply any more coal to KSC. This email, which was copied to Mr McLeod and Mr Chin (“the 9 November 2011 email”), stated as follows:41Foot Note 41×14.ACB 10869 … You may or may not be aware that Bayan hasdecided to withdraw from the KSC joint venture… At this time, we are still working out some of the  commercial details surrounding this andtherefore do not want to supply them any more coal until this has been resolved. In this regard,please stop all supply to them until further notice. … [emphasis added] We find that, by this email, BR instructed Bara and FSP to cease the supply of coal to KSC. 34 Subsequently, two KSC employees informed Mr Reilly that Bara and FSP would not supply any more coal to KSC as they had been instructed not to do so.42Foot Note 42×Reilly’s 1st T2 AEIC at para 63.On 10 November, Mr Reilly sent the following email to Mr Wong:43Foot Note 43×Reilly’s 1st T2 AEIC at para 64 and JR-1 Tab 42 (p 534). Mr Wong, we have requested supply of ROM coal to TCUP [Tabang Coal Upgrade Plant] and have been informed that this cannot be done. Could you please clarify the situation. Mr Wong then visited Mr Reilly in his office and showed him the 9 November 2011 email, which led Mr Reilly to inform Mr Chapman of the situation.44Foot Note 44×Reilly’s 1st T2 AEIC at paras 66 – 67.We thus find that BR’s instruction to Bara and FSP to cease supplying coal to KSC was communicated to KSC. Bara and FSP did not supply any ROM coal to KSC after 8 November 2011.45Foot Note 45×Reilly’s 1st T2 AEIC at paras 60 and 68.For the reasons set out in [137], [140] and [182], we find that BR was thus in repudiatory breach of the JV Deed.",
        "The 17 November 2011 Meeting": "35 On 17 November 2011, Mr Duncan and Mr Flannery met Dato Low and Mr Chin at BR’s office in Jakarta.46Foot Note 46×Flannery’s T2 AEIC at para 79.The meeting had been arranged at Mr Duncan’s suggestion “to discuss the current impasse relating to KSC”.47Foot Note 47×14.ACB 10886.During the meeting (“the 17 November 2011 Meeting”), it is undisputed that the parties discussed the US$45m buyout option.48Foot Note 48×Flannery’s T2 AEIC at para 81(a); Chin’s T1 AEIC at para 42.But it is disputed whether Mr Chin conditioned Bara and FSP’s supply of coal to KSC on the US$45m buyout option during this meeting. Mr Flannery stated that he did; however, Mr Chin denied this.49Foot Note 49×Flannery’s T2 AEIC at paras 83 and 88; Chin’s T1 AEIC at para 44. 36 Importantly, Mr Flannery took a handwritten note of the 17 November 2011 Meeting. The material portions of that note, which we accept, are as follows:50Foot Note 50×14.ACB 10890 – 10894. (EC) We don’t believe the WEC technology is economical for us andwe would like to sell our 49% shareholding in KSC to WEC for the loan amount approx US $45m … (BF) We need supply and offtake until say mid 2012 approx 6 months and we need it at cost as per our agreement. Reminded Bayan of side letter. (EC) They would supply coal but only at the market price (BF) You mean $40 or more (EC) Yes.But we would only supply coal provided we had agreement on how WEC would repay the Bayan loan to KSC. (BF) We might be able to find another party to buy them out … So give us some time to test the [Tabang Plant] and find a buyer for Bayan’s interest. (EC) No one would pay much for the [Tabang Plant] in that location. … We will be flexible on the payment terms.Only flexibility we have is on the payment terms. … (TWD)So Bayan will only agree to supply coal if we pay $45m for their equity. We will not pay $45m for their equity. Meeting concluded approx 11:10 am [emphasis added] 37 This note records Mr Chin as saying that coal would “only” be supplied to KSC if the parties agreed on how the WEC parties would pay US$45m, the quantum of the Bayan parties’ loan to KSC, to BR. Mr Chin also said that BR’s only flexibility was on the payment terms. Additionally, the note indicates that Mr Duncan stated his understanding of BR’s position just before the meeting ended,viz, that coal would only be supplied if BCBCS agreed to the US$45m buyout option; there is no record that Mr Chin or Dato Low then sought to disabuse Mr Duncan of his (alleged) misapprehension. Mr Flannery’s note is the one contemporaneous record of the meeting. We therefore find that, at the 17 November 2011 Meeting, BR (through Mr Chin) conditioned the supply of coal to KSC on the US$45m buyout option. 38 We also note, and it is not BCBCS’ case otherwise, that BCBCS made no protest over the cessation of the coal supply at this meeting. BCBCS also did not state that BR was in repudiatory breach in any way, or that it reserved its position thereon or that it accepted BR’s repudiatory breach. 39 On the contrary, during cross-examination, Ms Neale testified that, after the 17 November 2011 Meeting, BCBCS did not want to accept any (alleged) repudiatory breach by BR but wished to continue with the joint venture.51Foot Note 51×Transcript, 4 January 2017, p 144.",
        "Events preceding the 6 December 2011 EGM": "40 On 18 November 2011, Mr Todd Rollason, the commissioning manager of WEC, emailed Geared Engineering, a company which had been asked to look into gearboxes for the Tabang Plant, copying Mr Reilly and Mr Richard Kruger (“Mr Kruger”), a KSC employee who handled procurement, to request that all KSC-related orders be cancelled.52Foot Note 52×Reilly’s 1st T2 AEIC at para 71 and JR-1 Tab 45 (p 540); Transcript, 5 January 2017, pp 72 – 73.While this email was sent to Geared Engineering, Mr Reilly testified that, as it was copied to Mr Kruger, it could also have been sent to other vendors supplying engineering services or materials to the Tabang Plant in respect of the modification works.53Foot Note 53×Transcript, 5 January 2017, p 75.We find that as of 18 November 2011, given that coal supply to KSC had ceased, it is not surprising that KSC-related orders of this nature were cancelled. 41 On 21 November 2011, BCBCS sent a letter to BR, accusing BR of breaching cll 3.8(b)(iii) – (iv), 17.1, 17.2, 17.3 and 20.5 of the JV Deed.54Foot Note 54×14.ACB 10896 – 10897.According to BCBCS, BR had breached the JV Deed as its representatives had stated at the 17 November 2011 Meeting that (1) Bara would only supply coal to KSC “on the condition that [WEC] repay in full loans of approximately USD $45 million made by BR to KSC” and that (2) “Bara intended to cease supplying coal immediately unless [WEC] agreed to pay BR that amount”. BCBCS required BR to remedy the breach within seven days by directing Bara to supply coal in accordance with the 2010 CSA to which Bara was a party, and reserved all its rights arising out of BR’s breach of the JV Deed. 42 We note that there was no allegation that BR had breached the PLFA, or a direct claim that Bara and FSP had breached the 2010 CSAs. Moreover, BCBCS did not purport to accept any repudiatory breaches by the Bayan parties but only called on BR to remedy its alleged breaches of the JV Deed. 43 On 22 November 2011, Mr Reilly sent an email to Mr Kruger and Mr Chapman.55Foot Note 55×Reilly’s 1st T2 AEIC at para 72 and JR-1 Tab 46 (p 542).By this email, Mr Reilly directed Mr Kruger to inform KSC’s short term contractors, who were carrying out modification works at the Tabang Plant, that all works (by short term contractors) were suspended and the contractors were to begin demobilisation immediately. This order did not apply to KSC’s regular employees, of which there were more than 300, who, according to Mr Reilly (whose evidence on this point we accept), continued the modification works in addition to their regular operational and maintenance work at the Tabang Plant.56Foot Note 56×Reilly’s 1st T2 AEIC at para 72. 44 On 24 November 2011, BR replied to BCBCS’ letter of 21 November 2011,57Foot Note 57×14.ACB 10909 – 10910.stating that BCBCS’ notice of breach was “misconceived” and that: (a) BR had maintained that Bara must supply coal to KSC in compliance with the HBA Regulations; (b) Bara would supply coal to KSC based on the 2010 CSA to which Bara was a party; and (c) “at no point in time did [it] link the issue of Bayan’s intention to withdraw from the joint venture to an issue of cessation of coal supply”. BR then demanded that BCBCS retract its letter which it characterised as “mischievous and mademala fide”. 45 On 29 November 2011, WEC responded to BR’s letter of 24 November 2011 on behalf of the WEC parties as follows:58Foot Note 58×14.ACB 10914 – 10915. (a) First, WEC maintained that BR had conditioned Bara’s supply of coal to KSC on the US$45m buyout option at the 17 November 2011 Meeting, but stated that it was “proceeding on the basis that [BR’s] letter of 24 November 2011 withdraws that demand”. (b) Secondly, WEC averred that BR’s duty was to procure Bara to supply coal to KSC “in accordance with the [2010] CSA as amended on 5 April 2011” (and not in accordance with the 2010 CSA alone). (c) Thirdly, WEC claimed that BR was obliged to provide to KSC 49% of US$20m (a figure which WEC said that it had assessed to be what KSC required through to the end of June 2012), as funding for KSC’s operations. WEC requested BR’s confirmation that it agreed to provide such funding to KSC. 46 We note that BR’s letter of 24 November 2011 was clearly a repudiatory breach of the then extant PLFA (for the reasons given in [29(d)] above). But the WEC parties did not contend that it was a repudiatory breach or accept the repudiation.  Instead, the WEC parties expressly repeated that BR had to procure Bara to supply coal under the 2010 CSA to which Bara was a party. Additionally, it introduced the new element of BR’s alleged obligation to fund its 49% share of US$20m (KSC’s anticipated expenditure to the end of June 2012). The parties disputed the existence of this obligation in Tranche 1; and we found and ruled in favour of the Defendants in the First Judgment (see [3(a)] above). 47 On 2 December 2011, BR responded to WEC’s letter of 29 November 2011.59Foot Note 59×14.ACB 10960.First, BR stated that it had “not given any notice to suggest that it would not comply with the [2010] CSA”. BR claimed that it had “no knowledge of what 5 Apr 2011 amendment” WEC was referring to and requested a copy of that amendment. Secondly, BR rejected WEC’s request for BR to provide 49% of KSC’s funding requirements.",
        "The 6 December 2011 EGM": "48 On 6 December 2011, KSC held an extraordinary shareholders’ meeting (“the 6 December 2011 EGM”) at BR’s office in Jakarta. The 6 December 2011 EGM was held pursuant to a Notice issued by BR, dated 8 November 2011,60Foot Note 60×14.ACB 10831 – 10832.calling for such a meeting to discuss and resolve issues pertaining to the 2010 CSAs, KSC’s sale of upgraded coal briquettes to BR, and the joint venture. 49 Mr Chin, Mr Neil and Mr Oliver Khaw (“Mr Khaw”), BR’s in-house legal counsel,61Foot Note 61×Chin’s T1 AEIC at para 49.represented BR. Mr Duncan, Mr Flannery, Mr Maras, Ms Neale and Mr Chapman represented BCBCS. There are several contemporaneous records of this meeting: handwritten notes by Mr Neil and Ms Neale,62Foot Note 62×14.ACB 10961 – 10962 (Neil); 14.ACB 10971 – 10998 (Neale).file notes prepared by Ms Neale,63Foot Note 63×14.ACB 11009 – 11018. See Neale’s T1 AEIC at para 122.and what appear to be four versions of a set of draft minutes of the meeting (the first being the original prepared by Mr Khaw;64Foot Note 64×14.ACB 10963 – 10970; Chin’s T1 AEIC at para 50 and CWF-17.the second incorporating Mr Khaw’s first set of amendments to the original;65Foot Note 65×14.ACB 10999 – 11008; P-8.the third being a version of the original with Ms Neale’s amendments (ie, without Mr Khaw’s initial amendments as reflected in the second version);66Foot Note 66×14.ACB 11020 – 11029.and the fourth reflecting Mr Khaw’s mark-ups on the third version to incorporate his initial and other amendments).67Foot Note 67×P-9; T2 PSB Vol IV at Tab I.We take the fourth version to be the final copy of the minutes as it reflected input from both parties and their in-house lawyers. 50 The records of the meeting indicate, and we so find, that the following transpired: (a) Mr Duncan stated that Bara was obliged to supply coal to KSC under the 2010 CSAs as amended by the April 2011 Side Letter. Mr Khaw replied that the Bayan parties would only comply with the former: BR was only obliged to comply with the latter if the joint venture continued; however, it proposed to withdraw from the joint venture. Mr Chin clarified that Bara was prepared to supply coal to KSC in line with the 2010 CSAs, which required coal to be sold at HBA prices. (b) Mr Duncan requested that BR comply with its obligations under all the relevant agreements. Mr Chin “questioned how the agreements [could] be enforced against BR where BR [wished] to exit the JV”. Mr Duncan said that BR could not unilaterally exit the joint venture, and noted that cl 7.1(x) of the JV Deed states that the parties’ unanimous consent is necessary to wind up KSC. Mr Khaw said that “this provision was not relevant as BR’s intention [was] to exit the JV”. (c) Mr Duncan and Mr Flannery stated that Mr Chin had conditioned the supply of coal to KSC on the US$45m buyout option at the 17 November 2011 Meeting. Mr Chin denied this. Mr Flannery noted that he had been informed that Bara had received instructions to stop supplying coal to KSC. Mr Chin stated that “coal supply will continue on the condition that KSC agrees to pay the HBA price for the coal”. (d) Mr Chin reiterated BR’s intention to withdraw from the joint venture, noting the costs had substantially overrun the initial projection. (e) Mr Duncan offered to arbitrate the coal price issue in Singapore. Mr Chin rejected this offer. (f) Mr Chin reiterated BR’s offer to sell its 49% stake to BCBCS stating that, if BCBCS was not agreeable, KSC would have to be liquidated unless BCBCS had a counter-proposal. Mr Duncan replied that the WEC parties would not buy BR out unless the coal supply issue was resolved. (g) Mr Flannery stated that, if BR was not willing to fund KSC, KSC would need to go into care and maintenance. Mr Chin replied that KSC should “stop its operations to avoid incurring further costs”. Mr Flannery then “agreed to suspend KSC operations and maintain a limited number of people on site”, and added that BR would be provided with “proposals for BR’s approval on crew required to implement a care and maintenance program on a monthly cost basis”. 51 We make the following findings in relation to the 6 December 2011 EGM: (a) BR reiterated that it intended to withdraw from the joint venture. BCBCS made clear that it wished to continue with the Project. The parties negotiated to achieve their respective aims during the meeting, but did not reach a mutually acceptable position. (b) In reiterating that the Bayan parties would only supply coal to KSC at HBA prices, BR again committed a repudiatory breach of the PLFA (see [29(d)] and [46] above). (c) BR, having previously instructed Bara and FSP to stop supplying coal to KSC from 9 November 2011, was in continuing repudiatory breach of the PLFA and the JV Deed, at the time of the 6 December 2011 EGM. We expand on this at [137] and [182] below. (d) BCBCS did not accept the repudiatory breaches set out at [(b)] and [(c)] above. On the contrary, it wanted to keep the Project alive. (e) WEC and BR agreed to put KSC into care and maintenance at this meeting. We expand on this at [176] below.",
        "Events following the 6 December 2011 EGM": "52 On 6 December 2011, Mr Neil sent an email to Mr Wong, copying Mr Chin, which stated as follows: “If Kaltim Supacoal ask for more raw coal please agree to supply them”.68Foot Note 68×14.ACB 11019.Mr Reilly deposed that he was not aware of this email at the material time, and that its contents had never been communicated to him or his subordinates at KSC in December 2011.69Foot Note 69×Reilly’s 1st T2 AEIC at paras 69 – 70.Mr Neil accepted during cross-examination that he was “not in a position to disagree” with Mr Xavier’s statement that “neither the WEC parties nor KSC were aware of this email until these proceedings”.70Foot Note 70×Transcript, 12 January 2017, p 76.We therefore find that this email was internal correspondence and that its contents were never communicated to KSC. 53 We also note that the Plaintiffs had initially raised queries about the authenticity of this email, and had intended to rely on Mr Toh’s evidence to this end. However, during cross-examination, Mr Neil revealed that he had sent this email because Mr Chin had instructed him to do so. Upon further probing by Mr Xavier, Mr Neil said that, by this time, BR had taken internal legal advice and possibly external legal advice.71Foot Note 71×Transcript, 12 January 2017, pp 77 – 78.Thereafter, the Plaintiffs withdrew their challenge to the authenticity of the email.72Foot Note 72×Transcript, 12 January 2017, pp 84 – 85. 54 On 12 December 2011, WEC sent a letter to BR on behalf of the WEC parties which stated the following:73Foot Note 73×14.ACB 11036 – 11037. (a) WEC pointed out that BR’s refusal to fund KSC, in their letter of 2 December 2011 and at the 6 December 2011 EGM, were breaches of BR’s obligations under the JV Deed and the Funding MOU. (b) WEC observed that BR appeared to be unaware of BR’s funding obligations under cl 4 of the Funding MOU to fund 49% of the cost of commissioning, operating and maintaining the Tabang Plant. (c) WEC was accordingly prepared to give BR a further opportunity to reconsider its position, having regard to its obligations under the Funding MOU and the JV Deed, and to confirm that BR would fund 49% of KSC’s funding requirements. (d) WEC gave BR up to 10.00am (Jakarta time) on 13 December 2011 (the time to which it had been agreed that the 6 December 2011 EGM would be adjourned) to provide the requested for confirmation. WEC stated that otherwise it would commence proceedings in Singapore for damages arising from BR’s breach of its funding obligation and “from its breach of its obligation to procure [Bara] to supply coal to KSC in accordance with the [2010 CSA] as amended on 5 April 2011 …”. 55 On 13 December 2011, BR replied to WEC’s letter of 12 December 2011 by a letter with the heading: “RE: DEFAULT NOTICE”.74Foot Note 74×14.ACB 11042 – 11045.BR’s letter was addressed to WEC and BCBCS, and incorporated a default notice pursuant to cl 13.1(b) of the JV Deed (“BR’s Default Notice”). In its letter, BR stated that it would pay its 49% share of the outstanding salaries and termination payments of KSC employees. BR also stated that it would pay 49% of the outstanding obligations in relation to the SCB loan, but reserved the right to claim such amounts from BCBCS and WEC. BR further denied that it had any obligation to fund 49% of KSC’s ongoing funding requirements. Moreover, BR accused BCBCS of the following breaches of the JV Deed (which it gave BCBCS 30 days to remedy): (a) Breach of cl 7.1(s) and/or cl 7.1(bb) of the JV Deed, in that (i) KSC had exceeded its budget by approximately US$7m up to 30 September 2011 (“the Excess Expenditure”) under BCBCS’ unilateral management of such expenses, without any and/or sufficient prior notice to BR and without BR’s consent (“the Excess Expenditure Argument”); and (ii) the PLFA threshold sum of US$40m,viz, the working capital facility limit, had been exceeded by approximately US$6m (“the Excess Debt”) without BR’s consent (“the Excess Debt Argument”). (b) Breach of cl 16.3 of the JV Deed, in that WEC had made public announcements in relation to the joint venture without BR’s consent. 56 On 15 December 2011, the Tabang Plant was put into care and maintenance upon Mr Reilly and Mr Chapman’s issuance of a memorandum to this effect.75Foot Note 75×Reilly’s 1st T2 AEIC at para 77 and JR-1 Tab 48. 57 On 20 December 2011, WEC sent another letter to BR on behalf of the WEC parties.76Foot Note 76×14.ACB 11053 – 110055.WEC maintained that BR was in breach of its obligation to fund 49% of KSC’s ongoing funding requirements. WEC also stated that “one of the consequences of BR’s refusal to provide funding in accordance with its obligations is that KSC will need to suspend its operations and implement a care and maintenance program”. WEC asked BR to confirm that it would provide 49% of the funding necessary for the care and maintenance program. 58 We pause to note that, in this letter of 20 December 2011, WEC did not allege that the Tabang Plant was put into care and maintenance because of BR’s breach of its coal supply obligations, or because of BR’s breach of the JV Deed due to its alleged unilateral withdrawal from the joint venture. We further note that the statement of claim states that the Tabang Plant was put into care and maintenance because of “[BR’s] failure to provide funding to [KSC]”.77Foot Note 77×Statement of Claim (Amendment No 5) at para 32. 59 On 22 December 2011, BCBC sent a letter to BI demanding that BI perform BR’s obligations by procuring coal for KSC’s operations and providing 49% of (a) KSC’s funding requirements and (b) the funding for the care and maintenance program.78Foot Note 78×14.ACB 11057 – 11058.We note that, since the Tabang Plant was put into care and maintenance on 15 December 2011, KSC could not have had any immediate further requirement for coal thereafter. 60 On 22 December 2011, BR replied to WEC’s letter of 20 December 2011 and stated the following at para 5:79Foot Note 79×14.ACB 11069. With regard to the “funding necessary for the care and maintenance of the Project”, in orderto consider our position,please provide an exhaustive and detailed list of each and every item which you allege is required for the care and maintenance of the Project, together with the costs of each and every item. … We shall revert on these matters once we have had an opportunity to review the aforementioned documents.These requests are made strictly without any admission of liability or confirmation of payment by BR. [emphasis in original removed; emphasis added] 61 On 24 December 2011, WEC sent a letter to BR on behalf of WEC and BCBCS to demand that BR withdraw BR’s Default Notice.80Foot Note 80×14.ACB 11077 – 11082. 62 On 27 December 2011, the Plaintiffs commenced this action against the Defendants. 63 On 31 December 2011, the last day of the “Availability Period” under the PLFA expired (see [67] of the First Judgment). 64 On 21 February 2012, BR sent a letter to BCBCS (“BR’s Termination Notice”) referring to the JV Deed, the Deed of Novation and the Funding MOU, which stated,inter alia, the following:81Foot Note 81×14.ACB 11128 – 11130. (a) The consideration for the JV Deed and/or the Funding MOU had wholly failed. (b) BR had agreed under the JV Deed and Funding MOU to provide a reasonable amount of funds, within a reasonable time period, in consideration of BCBCS exploiting the technology so that KSC could produce upgraded coal briquettes of commercial viability, for sale at a commercial profit, at 1 MTPA within a reasonable time period. To date, five and a half years after the JV Deed was signed and 34 months after the Tabang Plant had “reached commissioning stage”, KSC had not produced and/or was unable to produce 1 MTPA of upgraded coal briquettes. (c) BCBCS had breached cll 7.1(s) and (bb) of the JV Deed in that BCBCS had failed to get BR’s consent for the Excess Expenditure. (d) BCBCS had exceeded the US$40m sum under the PLFA as amended by the Addendum to the PLFA (“the Addendum”) by US$6m, without BR’s consent, in breach of cll 7.1(s) and (bb) of the JV Deed. (e) In light of BCBCS’ (alleged) breaches of its obligations as set out in BR’s Default Notice, and alleged implied terms under the JV Deed and the Funding MOU, “we hereby terminate the JV Deed and/or [Funding MOU] with immediate effect”. 65 On 2 March 2012, BCBCS replied to BR’s letter of 21 February 2012 stating that BR’s Termination Notice was “misconceived” and BR did not have any grounds to terminate the JV Deed.82Foot Note 82×14.ACB 11134 – 11135.On the contrary, by reason of its conduct, BR had repudiated the JV Deed. After setting out its reasons therefor, BCBCS then proceeded to accept BR’s repudiation. As we explain at [179] and [195] below, BCBCS thereby brought the joint venture to an end. 66 We now turn to the issues in Tranche 2.",
        "The coal supply issues": "67 We first address the coal supply issues, Issues 1 to 4, and reference is made to [4] above.",
        "Issue 1": "68 The parties were unable to agree on the wording of Issue 1. 69 The issue raised by the pleadings relates to BR’s obligations in relation to the supply of coal to KSC between November 2011 and 2 March 2012. (The November 2011 Board Meeting took place on 2 and 3 November 2011 and 2 March 2012 was the date when, at the latest, the JV Deed was brought to an end.) In our judgment, consistently with the pleadings, the issue between the parties can be formulated as follows: Issue 1: From November 2011 to 2 March 2012, did BR have aprima facieobligation to supply and/or assist in procuring the supply of coal to KSC under (1) Art 7.1 of the PLFA and/or (2) cl 3.8(b)(iii) of the JV Deed; and, if so, what was the scope of the(se) obligation(s) in view of cl 3.9 of the 2010 CSAs between KSC and Bara and FSP? 70 Article 7.1 of the PLFA provides as follows:83Foot Note 83×10.ACB 7975, 7980. During the Availability Period,BR shall ensure that FSP supplies Feedstock Coal to [KSC]. [emphasis added] We make the following observations regarding this provision: (a) First, we reiterate that, while Art 7.1 only referred to FSP, the parties accepted that Art 7.1 extended to Bara as well: see the First Judgment at [157]. (b) Secondly, Art 1 of the PLFA defined the Availability Period as “[t]he period up to and including 30 June 2011 or as mutually agreed between the parties”. On 29 June 2011, the parties executed the Addendum which extended the Availability Period to 31 December 2011 (see [67] of the First Judgment and [63] above). (c) Thirdly, Art 1 of the PLFA defined “Feedstock Coal” as “coal as defined in the Coal Supply Agreement”, which was in turn defined as “the Coal Supply Agreements between [KSC] with FSP and [Bara] (as the case may be)”. 71 Clause 3.8(b)(iii) of the JV Deed provides that BR must “assist in procuring Coal for the operation of the Business”.84Foot Note 84×3.ACB 2144, 2160.Clause 1.1 of the JV Deed defines “Business” as follows:85Foot Note 85×3.ACB 2144, 2147. Businessmeans the business of: (a)  acquiring Coal from the Tabang Concession in accordance with the Coal Supply Agreement or from some other party; (b)  production of Upgraded Coal Briquettes by upgrading the Coal using the Patented Briquetting Process; and (c)  marketing and selling Upgraded Coal Briquettes to Utilities including sale of Upgraded Coal Briquettes under the Upgraded Coal Briquette Sale Agreement. 72 Clause 3.9 of the 2010 CSAs provides as follows:86Foot Note 86×11.ACB 8727, 8736 (Bara); 11.ACB 8787, 8796 (FSP). Supplier [ie,Bara and FSP respectively] must supply to Buyer [ie,KSC], as and when requested by Buyer, on the same terms and conditions as are set out in this Agreement with respect to price and quality,sufficient Coal to allow testingof the: (a)  Coal Briquette Processing Plantup to the point where Coal Briquette Processing Plant Commissioning is achieved; and (b)  each Electricity Generatorup to the point where Electricity Generator Commissioning is achieved. [emphasis added] Our Decision 73 In the First Judgment, we made findings, in relation to the 2010 CSAs and Art 7.1 of the PLFA, at [167] where we stated the following: 167.  In our view, the provisions of the JV Deed, the 2010 CSAs, [and] the PLFA … are clear and unambiguous. In or around the period between early November 2011 to March 2012, commercial production had not yet begun and consequently: (a)  theobligation under the 2010 CSAswas that [FSP] and Bara “must supply to [KSC], as and when requested by [KSC], … sufficient [c]oal to allow testing of the [Tabang Plant and each Electrical Generator] up to the point where [their] Commissioning is achieved”; (b)the obligation under Art 7.1 of the PLFAwas that “[d]uring the Availability Period, BR shall ensure that [Bara] supplies Feedstock Coal to [KSC]”; (c)  the obligations in relation to the payment of the feedstock coal up to the achievement of the commissioning of the Tabang Plant was provided for in the 2010 CSAs and the PLFA; … [emphasis added] 74 Consequently, we make the following findings: (a) By cl 3.9 of the 2010 CSAs, Bara and FSP were obliged to supply to KSC, as and when requested by KSC, sufficient coal to allow testing of the Coal Briquette Processing Plant and each Electricity Generator up to the point where their commissioning was achieved. (b) Under Art 7.1 of the PLFA, BR had aprima facieobligation to ensure that Bara and FSP supplied coal to KSC in accordance with cl 3.9 of the 2010 CSAs. 75 We also find that, under cl 3.8(b)(iii) of the JV Deed, BR was under a similar obligation to ensure that Bara and FSP supplied coal in accordance with their obligations under cl 3.9 of the 2010 CSAs. This obligation was part of their duty to “assist in procuring Coal for the operation of the Business”. 76 We would only add that, under cl 7.1 of the PLFA, BR’s obligation was limited in time to the “Availability Period”. The Availability Period ended on 31 December 2011 (see [70(b)] above). It follows that BR had no obligation in relation to coal supply under the PLFA after that date. However, BR continued to be subject to the obligation under cl 3.8(b)(iii) of the JV Deed. 77 Accordingly, the answer to Issue 1 (as formulated by us) is as follows: (a) Under Art 7.1 of the PLFA, BR had aprima facieobligation to ensure that Bara and FSP supplied coal to KSC in accordance with cl 3.9 of the 2010 CSAs. However, this obligation expired on 31 December 2011. (b) Under cl 3.8(b)(iii) of the JV Deed, BR had aprima facieobligation to ensure that Bara and FSP supplied coal to KSC in accordance with their obligations under cl 3.9 of the 2010 CSAs. This obligation persisted until the JV Deed was terminated.",
        "Issue 2(i)": "78 This brings us to Issue 2(i), which was framed in these terms: What stage the Coal Briquette Processing Plant Commissioning (as defined in the 2010 CSAs) had reached by November 2011 … This raises the question of the status of the Tabang Plant in November 2011. The answer is to be found in the documents, and the evidence of Mr Reilly and Mr Alderman. Our Decision 79 Clause 1 of the JV Deed defines the relevant phrase “Coal Briquette Processing Plant Commissioning” as follows:87Foot Note 87×3.ACB 2144, 2148. completion of the construction of the Coal Briquette Processing Plantso that it is capable of producing Upgraded Coal Briquettes,which must be evidenced by the relevant construction contractor providing the Buyer with a certificatefrom a qualified engineerengaged by the relevant construction contractor (not being an employee of either the construction contractor or any of the construction contractor's related bodies corporate) certifying that, in the engineer's professional opinion,the Coal Briquette Processing Plant has been tested and commissioned in accordance with the construction contract which relates to the Coal Briquette Processing Plant; [emphasis added] Clause 1.1 of the 2010 CSAs provides that, “unless the context or subject matter otherwise requires, the words and terms ... defined in the [JV Deed] will have the same meaning ... in this Agreement”.88Foot Note 88×11.ACB 8727, 8730 (Bara); 11.ACB 8787, 8790 (FSP). 80 In his AEIC, Mr Alderman exhibited a commissioning proposal to the KSC Board which outlined the proposed commissioning stages for this project.89Foot Note 89×AEIC of John Kipling Alderman dated 23 December 2016 (“Alderman’s 1st T2 AEIC”) at JKA-1 (para 13) and Appendix F (p 614 – 679).That proposal identifies “No Load Commissioning”, “Load Commissioning” and “Production Ramp Up” as stages of the commissioning process.90Foot Note 90×Alderman’s 1st T2 AEIC at Appendix F (p 616).In cross-examination, Mr Alderman agreed, and we so find, that commissioning of the Tabang Plant would have entailed (1) modification works after construction, and then (2) commissioning to check the Tabang Plant's individual components without a load, followed by (3) load commissioning,ie,running the production module with a load, and finally (4) ramping-up to commercial production. Stages (3) and (4) would have involved testing the production module with coal loads until the Tabang Plant was able to attain commercial production or some percentage of it.91Foot Note 91×Transcript, 6 January 2017, pp 76 – 80. 81 The Tabang Plant had been shut down at the end of October 2011 and was undergoing modifications in November 2011 to address issues which had arisen (see [22] above). The Defendants rely on Mr Alderman’s evidence to aver that, since extensive modifications to the Tabang Plant were being carried out, the Tabang Plant had effectively reverted to the construction phase, so that it was nowhere near commissioning in November or December 2011.92Foot Note 92×Defendants’ Closing Submissions at paras 62 – 63; Alderman’s 1st T2 AEIC at JKA-1 (para 34).The Plaintiffs rely on Mr Reilly’s explanation of the modifications and his evidence that the operation of the production module was imminent.93Foot Note 93×Reilly’s 1st T2 AEIC at paras 38 – 53.Mr Reilly referred to the modifications to the drying column and coal injection pipes in the period up to November 2011, and the proposed modifications to the dust extraction systems for the cooling system and briquetting machines which were delayed to November 2011 because of late deliveries in October 2011. 82 We prefer Mr Reilly’s evidence on the state of the Tabang Plant in November 2011. Mr Alderman based his assessment to a large extent on the November 2011 Board Pack which included minutes of the KSC Board Meeting in March 2011 (“the March 2011 Board Meeting”).94Foot Note 94×Alderman’s 1st T2 AEIC at JKA-1 (paras 23 and 25 – 32).Importantly, the November 2011 Board Pack only dealt with activities at the Tabang Plant up to September 2011.95Foot Note 95×14.ACB 10524, 10540.However, as Mr Reilly explained in his AEIC, work had been done to the Tabang Plant in October 2011 and further work was to be carried out in November 2011 (see [81] above). Mr Alderman referred to some email correspondence in October and November 2011 to pick out matters which were being dealt with at that time.96Foot Note 96×Alderman’s 1st T2 AEIC at JKA-1 (paras 33 – 40).However, Mr Reilly was able to give first-hand evidence on the state of the Tabang Plant from his personal day to day experience whilst Mr Alderman’s view, as he accepted,97Foot Note 97×Alderman’s 1st T2 AEIC at JKA-1 (paras 23).was based on documents. 83 Having considered the evidence, we accept, broadly, Mr Reilly’s view of the situation in November 2011. We find that substantial progress was being made on modifications which were on course for completion in November or December 2011. We find that the Tabang Plant was being commissioned in November 2011 because, as we have found at [80] above, the modifications were part of the commissioning process. The Tabang Plant remained in the commissioning phase until 15 December 2011, when it was put into care and maintenance when the modifications were not yet complete. We note that, at the 6 December 2011 EGM, Mr Chin, whilst complaining about the time which had been taken for commissioning, observed that “the [Tabang Plant] still remains under commissioning”.98Foot Note 98×P-9 at para 23d.This is consistent with the view we have reached. 84 Given the modifications carried out up to October 2011 and to be carried out in November 2011, we also find that, in early November 2011, KSC properly viewed the stages of commissioning which required coal for testing,viz, load commissioning and ramping-up, Stages (3) and (4), as being imminent. 85 Accordingly, we answer Issue 2(i) as follows. In November 2011, the Coal Briquette Processing Plant Commissioning had not been achieved. The commissioning was in the modification works phase,viz, Stage (1) above; yet, Stages (3) and (4), which required coal, were imminent.",
        "Issue 2(ii)": "86 Issue 2(ii) was formulated as follows: Whether, in the period between November 2011 and 2 March 2012, there was sufficient coal for the testing of the Tabang Plant or any Electricity Generator of the Tabang Plant; This issue raises two questions: (a) First, what coal was available at the Tabang Plant between November 2011 and 2 March 2012? (b) Secondly, how much coal was necessary for the testing of the Tabang Plant, including the electricity generators? Our Decision 87 On 9 November 2011, when Bara and FSP stopped delivering coal, KSC had a stockpile of about 18,500 tonnes of ROM coal (see [32] above). We accept Mr Reilly’s evidence that there were 3000 tonnes in the base layer which was necessary to prevent contamination from clay.99Foot Note 99×Reilly’s 2nd T2 AEIC at para 38; Transcript, 5 January 2017, pp 134 – 135.There were therefore about 15,500 tonnes of ROM coal available for use. 88 The Defendants rely on Mr Alderman’s evidence to contend that the Tabang Plant had sufficient coal to operate for at least one to two months after it resumed operations.100Foot Note 100×Defendants’ Closing Submissions at para 89; Alderman’s 1st T2 AEIC at JKA-1 (paras 85 – 86).On the basis that operations would have resumed on 7 December 2011, the Defendants submit that a stockpile of 18,500 tonnes would have lasted up to between 7 January and 7 February 2012. The Plaintiffs, on the other hand, rely on Mr Reilly’s evidence to submit that 40,000 tonnes of ROM coal was necessary, for an adequate stock of coal, to ensure continuous testing and commissioning after a resumption in December.101Foot Note 101×Plaintiffs’ Closing Submissions at para 44; Reilly’s 2nd T2 AEIC at para 13. 89 We have found that, in early November 2011, KSC properly viewed the stages of commissioning which required coal for testing, including load commissioning and ramping-up, as being imminent (see [84] above). As stated in the November 2011 Board Pack, KSC had assumed that, following completion of the modification works, the production module of the Tabang Plant could operate with 14 briquetting machines at 7.5 tonnes per hour (“TPH”) for a total production of 105 TPH.102Foot Note 102×14.ACB 10524, 10565.The production module was designed to produce upgraded coal briquettes at the rate of 140 TPH which would require, at a conversion rate of 1.6, 224 TPH of raw coal to be used in the process.103Foot Note 103×Plaintiffs’ Closing Submissions at para 41(i).It follows that, at the time that the November 2011 Board Pack was prepared, the view was that the production module would achieve 47% or, say, 50% of its capacity. The calculation in the November 2011 Board Pack was based on a daily production of approximately 18.36 hours per day (with an availability rate of 90% and a utilisation rate of 85% applied to the 24 hour period of a day).104Foot Note 104×14.ACB 10524, 10565.On this basis, the daily raw coal consumption would have been about 2,000 tonnes. Thus, 60,000 tonnes would have been required for 30 days of operations. After making allowance for the 15,500 tonnes already available on site, this would mean that, approximately, a further 44,500 tonnes of coal would have had to be delivered to the Tabang Plant for 30 days of operations. 90 The Defendants criticise the basis of Mr Reilly’s calculations. They aver as follows, relying on Mr Alderman’s evidence:105Foot Note 105×Defendants’ Closing Submissions at para 86; AEIC of John Kipling Alderman dated 5 January 2017 (“Alderman’s 2nd T2 AEIC”) at JKA-4 (paras 5 – 7, 10, 12, 16 – 22). (a) the proper assumed production rate of the briquetting machines in November 2011 was only 13.1%; (b) the drying column was not operating to reduce the average moisture content of the briquettes to 9% up to October 2011; (c) the daily shift reports from August to October 2011 showed that there was no improvement in dust issues; (d) it would have taken one to two months of operations for the Tabang Plant to return to its production levels before the shutdown; (e) the Tabang Plant had not demonstrated an ability to operate consecutively for 30 days. On this basis, the Defendants submit that there was adequate coal for at least one to two months after the resumption of commissioning (see [88] above). 91 We consider that Mr Alderman’s criticisms of the basis of Mr Reilly’s calculations are unjustified. Essentially, Mr Alderman was looking at the historical position prior to the modifications which were to be carried out in November 2011. Those modifications had the express purpose of improving the characteristics of the Tabang Plant. Mr Alderman arrived at his production rate of 13.1% by dividing the total production of 10,932.57 tonnes of briquettes in September 2011 by 30 days (to reflect a month of production).106Foot Note 106×Alderman’s 2nd T2 AEIC at JKA-4 (para 7).However, the Tabang Plant only operated for 13 days in September 2011. The daily production was therefore about 840 tonnes per day, which amounted to 30% of the targeted daily production rate. We note that the Tabang Plant had operated for 20 days and 22 days in March and May 2011 respectively.107Foot Note 107×Reilly’s 1st T2 AEIC at JR-1 Tab 39 (p 513)We therefore find that it was realistic to assume that, after the modifications to deal with the problems identified by Mr Alderman had been effected, the production module could have achieved production at about 50% for 30 days. 92 In terms of the time which would have been required to reach production levels after resumption in December 2011 (see [90(d)] above), we were not impressed by the way in which Mr Alderman sought to justify his opinion that one or two months would have been required.108Foot Note 108×Alderman’s 2nd T2 AEIC at JKA-4 (paras 17 – 21).He had not considered the available data which showed production levels being achieved in shorter time and, on being shown the data, he accepted that he would have to review this aspect.109Foot Note 109×Transcript, 6 January 2017, pp 37 – 43.We find that production at the rate which was anticipated in the November 2011 Board Pack would have been achieved much more rapidly than Mr Alderman suggested. 93 Further, we find that, with regard to the coal which was necessary for testing the production module during commissioning, much more was needed than the existing 15,500 tonnes. Accepting Mr Reilly’s evidence, we find that 15,500 tonnes would only have permitted the production module alone (excluding the power station) to run for about eight days (operating at about 18 hours per day).110Foot Note 110×Reilly’s 2nd T2 AEIC at para 38.We find that the 40,000 tonnes of coal which Mr Reilly had planned to accumulate was much closer to what was required. 94 It follows that, on 9 November 2011, when Bara and FSP stopped delivering coal, there was insufficient coal for the testing of the Tabang Plant or any electricity generator and this continued until 2 March 2012 (see [195] below). Thus, the answer to Issue 2(ii) is “no”.",
        "Issue 2(iii)": "95 The parties framed Issue 2(iii) in these terms: Whether, in the period between November 2011 and 2 March 2012, KSC had made a request in accordance with any of the 2010 CSAs for the quantity of coal that KSC required to allow testing of the Tabang Plant or any Electricity Generator of the Tabang Plant; 96 As noted at [31] above, on 7 November, KSC sent the following email to employees of Bara and FSP: … We still need a lot of coal. Therefore request to continue the delivery to TCUP [Tabang Coal Upgrade Plant] tonight. Once we have enough, then I will convey information to IP to temporarily stop the supply. This was the final request for coal which was made before the coal supply to KSC was stopped on 9 November 2011. Coal had been supplied on 7 and 8 November 2011 pursuant to that request. The Parties’ Arguments 97 The Defendants submit that, under cll 3.1 to 3.5 of the 2010 CSAs, KSC was required to provide Nominated Monthly Quantity (“NMQ”) Notices to Bara and FSP in respect of the coal to be delivered to KSC in a particular month:111Foot Note 111×Defendants’ Closing Submissions at para 96. (a) KSC was required to provide a Provisional NMQ Notice no later than 30 business days before the first day of each month; (b) KSC was required to provide a Final NMQ notice no later than 10 days before the first day of each month; (c) If no valid Final NMQ Notice was provided, the NMQ for the relevant month would be deemed to be zero tonnes of coal. It is common ground that KSC did not provide NMQ Notices to Bara or FSP. The Defendants therefore submit that there was no obligation to supply coal under the 2010 CSAs in response to the request of 7 November 2011; and, consequently, there was no such obligation at the time when Bara and FSP stopped delivering coal to KSC on 9 November 2011. 98 The Plaintiffs contend that the obligation to supply coal for testing under cl 3.9 of the 2010 CSAs was not subject to the requirements of cll 3.1 to 3.5 of the same. Clause 3.1 of the 2010 CSAs makes clear that the aim of these provisions was to assist Bara and FSP to plan how much coal they would have to deliver to KSC to enable it to deliver upgraded coal briquettes.112Foot Note 112×Plaintiffs’ Closing Submissions at paras 23 – 24. 99 In any event, the Plaintiffs submit that it is undisputed evidence that both parties had adopted a highly flexible approach on coal supply requests; and the procedures under cll 3.1 to 3.5 had never been followed. The Plaintiffs rely on Mr Reilly’s evidence that KSC placed its requests for coal over the telephone or in person or via email, between one day and a few days in advance.113Foot Note 113×Plaintiffs’ Closing Submissions at para 25; Reilly’s 1st T2 AEIC at paras 29 and 35 – 37. 100 However, the Defendants argue that, whilst Bara and FSP supplied small amounts of coal to be helpful to KSC, on the basis of informal notices, KSC was reminded of its obligation to comply with the NMQ procedure. The Defendants rely on the evidence of Mr Neil,114Foot Note 114×Neil’s T2 AEIC at paras 25 – 28.and the following emails:115Foot Note 115×Neil’s T2 AEIC at RJN-116 (pp 37 – 42). (a) an email of 16 June 2010 from Mr Goh Tiak Chua (“Mr Goh”), a BR representative, to,interalia, Mr Reilly, in which Mr Goh drew Mr Reilly’s attention to the provisions of cll 3.1 to 3.5 of the 2010 CSAs and sought confirmation that they had been complied with; and (b) an email of 25 June 2010, from Mr Phang Kiew Beng, who appears to have been a representative of Bara and FSP, to Mr Goh, in which the former referred to the NMQ procedure. 101 In response, the Plaintiffs rely on Mr Reilly’s evidence that the matter was, subsequent to the email from Mr Goh, discussed at the KSC Board Meeting on 21 and 22 June 2010 (“the June 2010 Board Meeting).116Foot Note 116×Plaintiffs’ Closing Submissions at para 26; Reilly’s 1st T2 AEIC at para 36.The notes of the June 2010 Board Meeting state:117Foot Note 117×11.ACB 8249, 8254 – 8255. … It was agreed that a procedure should be agreed at site level that is suitable for both parties. … Action item: WEC (John Reilly) and Bayan (Mr Wong) to agree procedure re-notification of coal supply quantities. [emphasis in original in bold; emphasis added in italics] Mr Reilly deposed that, following the June 2010 Board Meeting, he continued to liaise with Mr Wong over the supply and delivery of coal to KSC up till November 2011 and adopted the previously existing flexible arrangement.118Foot Note 118×Reilly’s 1st T2 AEIC at paras 36(ix) and 37.The Plaintiffs therefore submit that the procedure to be adopted was that agreed and implemented between Mr Reilly and Mr Wong, and that KSC was not required to comply with cll 3.1 to 3.5 of the 2010 CSAs. Our Decision 102 First, we find that the NMQ procedure set out in cll 3.1 to 3.5 of the 2010 CSAs does not apply to the obligation to supply coal to KSC under cl 3.9 of the same. Clause 3.1 of the 2010 CSAs provides as follows:119Foot Note 119×11.ACB 8727, 8735 (Bara); 11.ACB 8787, 8795 (FSP). The Supplier will make Coal available for delivery to the Buyer with the intent that the amount of Coal delivered by the Supplier to the Buyer will enable the Buyer to operate the Coal Briquette Processing Plantand fulfil its obligations to deliver Upgraded Coal Briquettes… [emphasis added] 103 The reference in cl 3.1 to Coal to enable KSC “to operate the Briquette Processing Plant and fulfil its obligations to deliver Upgraded Coal Briquettes” indicates, in our judgment, that this provision applies to Coal to operate the Tabang Plant. The provisions that follow in cll 3.2 to 3.5 and which set out a nominations procedure would be necessary for the large quantities of coal which would have been required if the Tabang Plant was in production. This is also confirmed by cll 3.6 and 3.7 which deal with the annual quantity to produce 1 MTPA of upgraded coal briquettes. However, after cl 3.8 which contains a separate provision for Coal for the Electricity Generator, cl 3.9 simply states as follows (see [72] above):120Foot Note 120×11.ACB 8727, 8736 (Bara); 11.ACB 8787, 8796 (FSP). Supplier must supply to Buyer,as and when requested by Buyer, on the same terms and conditions as are set out in this Agreementwith respect to price and quality, sufficient Coal to allow testing … [emphasis added] In our judgment, the obligation to supply coal to KSC for testing under cl 3.9 of the 2010 CSAs was triggered “as and when” KSC requested coal. Thus, when KSC requested coal over the telephone or in person or via email, between one day and a few days in advance (see [99] above), the obligation under cl 3.9 was triggered and there was no requirement for KSC to provide NMQ notices for coal for testing. We also find and hold that the obligation was triggered upon a request for coal, even if a specified quantity of coal was not stated in the request. We do not accept that KSC had to specify a quantity of coal to make a valid request for the same. 104 Secondly, we find that, even if, there was a requirement for KSC to comply with cll 3.1 to 3.5 of the 2010 CSAs, that ceased to be the case in view of what the parties agreed at the June 2010 Board Meeting, and Mr Reilly and Mr Wong’s subsequent decision to continue with the existing informal procedure. Thereafter, the obligation to supply coal to KSC under cl 3.9 of the 2010 CSAs was triggered by KSC’s informal requests for coal. We note that the minutes of the June 2010 Board Meeting were approved at the following KSC Board Meeting on 12 October 2010, with the final minutes to be reissued for execution by both BCBCS and BR.121Foot Note 121×12.ACB 9009 – 9010. 105 In these premises, KSC was not required to comply with cll 3.1 to 3.5 of the 2010 CSAs when it made its request for coal on 7 November 2011. That was a valid request for a substantial quantity of coal. It complied with the procedure under cl 3.9 of the 2010 CSAs and the informal procedure adopted by the parties. The request made on 7 November 2011 was thus operative on 9 November 2011 when Bara and FSP stopped delivering coal, and continued to be operative until 2 March 2012 (see [195] below). 106 It follows that, in the period between November 2011 and 2 March 2012, KSC had made a request in accordance with the 2010 CSAs for the quantity of coal that KSC required to enable testing of the Tabang Plant or any electricity generator of the Tabang Plant. The answer to Issue 2(iii) is therefore “yes”.",
        "Issue 2(iv)": "107 Issue 2(iv) was as follows: Whether, in the period between November 2011 and 2 March 2012, BR was under [BR’s coal supply obligations] in circumstances where the parties did not unanimously consent under Clause 7.1 of the JV Deed to the funding of KSC and/or in circumstances where BR, as it was entitled to, had not consented to provide further funding or for KSC to incur further expenses and/or where BCBCS was not prepared to further fund KSC on its own … The Parties’ Arguments 108 The Plaintiffs submit that there is nothing in cl 3.8(b)(iii) of the JV Deed or in the 2010 CSAs which makes the Defendants’ obligation to supply coal conditional upon continued financing of KSC.122Foot Note 122×Plaintiffs’ Closing Submissions at para 57.They rely onLucky Realty Co Pte Ltd v HSBC Trustee (Singapore) Ltd[2016] 1 SLR 1069 (“Lucky Realty”) as authority for the proposition that, in interpreting a contract, the text of the contract is the first port of call: seeLucky Realtyat [2] and [49]. The Plaintiffs thus submit that BR’s obligations in relation to coal supply were not affected by questions of funding. 109 The Plaintiffs also challenge the Defendants’ argument that BR’s coal supply obligations did not arise because KSC had no money or would soon have no money to pay for coal.123Foot Note 123×Plaintiffs’ Closing Submissions at para 58(iv).They submit that Bara and FSP were not entitled, under the 2010 CSAs, to stop supplying coal on account of late payment. They rely onChitty on Contractsvol 1 (H G Beale gen ed) (Sweet & Maxwell, 32nd Ed, 2015) (“Chitty”) at para 21-013,Alan Auld Associates Ltd v Rick Pollard Associates and Another[2008] BLR 419 (“Alan Auld Associates”) andIoannis Valilas v Valdet Januzaj[2015] 1 All ER (Comm) 1047 at [29]. 110 The Plaintiffs further submit that the Bayan parties never demanded payment from KSC, relying on Mr Maras’ evidence that the parties had an arrangement whereby payment for raw coal and briquettes would be recorded as liabilities and/or credits in KSC’s books.124Foot Note 124×Plaintiffs’ Closing Submissions at para 58(ii); Maras’ T1 AEIC at paras 412 – 413.They argue, on this basis, that the question of the Bayan parties ceasing the coal supply because of lack of payment was never an issue, and thus not raised at the November 2011 Board Meeting or the 6 December 2011 EGM as a reason for not supplying the coal. 111 The Defendants submit that the obligation under cl 3.9 of the 2010 CSAs was inextricably linked to and dependent on KSC’s reciprocal obligation to pay for the coal supplied.125Foot Note 125×Defendants’ Closing Submissions at paras 102 – 103.In this regard, they rely on J W Carter,Carter’s Breach of Contract(LexisNexis Butterworths, 2011) (“Carter’s Breach of Contract”) at paras 1-08 to 1-17 andTan Jin Sinand another v Lim Quee Choo[2009] 2 SLR(R) 938 (“Tan Jin Sin”). The Defendants also submit that a buyer’s obligation to pay and a seller’s obligation to deliver goods are concurrent conditions; in other words, each party’s obligation depends on the other’s readiness and willingness to perform their corresponding obligation. For this submission, the Defendants citeMorton v Lamb(1797) 7 TR 125 (“Morton”),The Aktor[2008] All ER (Comm) 784 (“The Aktor”) at [67],Chittyat para 13-029 andThe Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) (“The Law of Contract in Singapore”) at para 16.028. The Defendants accordingly aver that Bara and FSP’s obligations to supply coal did not arise unless and until KSC stood ready and willing to perform its corresponding obligation to pay for coal. Our Decision 112 The central issue here, over which the parties’ arguments are joined, is whether the obligation under cl 3.9 of the 2010 CSAs, borne by Bara and FSP, was a dependent obligation, in the sense that the obligation only arose if KSC was concurrently ready, willing and able to perform its obligation to pay for the coal: seeCarter’s Breach of Contractat para 1-08,Chittyat para 13-029 andThe Law of Contract in Singaporeat para 16-028. 113 InTan Jin Sin, which concerned an agreement about the enforcement of a judgment, the Court of Appeal (“the CA”) observed at [17] as follows: Expressed in legal terms, this first issue centred on whether or not the clauses concerned were “dependent” or “independent” obligations. As Sir Kim Lewison aptly points out (seeThe Interpretation of Contracts(Sweet & Maxwell, 4th Ed, 2007) at para 15.15): Which species of obligation has been createdis a question of construction, but if the obligation constitutes the whole or a substantial part of the consideration for the contract, the court is likely to construe it as a dependent obligation. [original emphasis omitted; emphasis added in italics] 114 Thus, the issue here turns on a construction of the 2010 CSAs. We have set out the principles of contractual interpretation under Singapore law in the First Judgment: see the First Judgment at [99] – [103]. We also note that the CA reiterated inLucky Realtythat, in construing a contract, the text of the agreement is the first port of call (see [108] above). 115 In this case, cl 3.9 of the 2010 CSAs provided that Bara and FSP were to supply coal to allow testing “as and when requested by Buyer,on the same terms and conditions as are set out in this Agreement with respect to priceand quality …” (see [72] above). Clause 10.4 of the 2010 CSAs states:126Foot Note 126×11.ACB 8727, 8743 (Bara); 11.ACB 8787, 8803 (FSP). Buyer must pay the amount stated in an invoice that is delivered by the Supplier in accordance with clause 10.1,within 30 daysof receipt of the invoice. [emphasis added] This provision is clear. It does not make delivery of coal dependent on payment of the invoice. Nor is KSC’s obligation to pay concurrent with the obligation to supply coal under cl 3.9; the present case is thus distinguishable fromMortonandThe Aktor, where the buyer’s duty was to pay on delivery. In our judgment, the remedy for a failure to pay under the 2010 CSAs was to make time of the essence (as stated inChittyat 21-014); it is clearly not of the essence under the 2010 CSAs. It would then have been open to Bara or FSP, if KSC’s failure to pay had become a repudiatory breach, to terminate the 2010 CSAs, as inAlan Auld Associates. 116 In any event, we find that the arrangement between KSC and Bara and FSP was that payment was not demanded from KSC. Rather, as Mr Maras explained (see [110] above), the price of coal supplied was treated as a credit to Bara and FSP in KSC’s accounts. There had therefore been no failure to pay; the arrangement did not lead to payment. 117 It follows that, even if there was no funding for KSC, such that KSC was not able to pay Bara and FSP for the coal which it received: (a) Bara and FSP continued to be under an obligation to supply coal to KSC under cl 3.9 of the 2010 CSAs; (b) BR’s obligation to ensure that Bara and FSP fulfilled this obligation, under Art 7.1 of the PLFA and cl 3.8(b)(iii) of the JV Deed (see [77] above), remained in place. We therefore answer Issue 2(iv) in the affirmative.",
        "Issue 2(v)": "118 Issue 2(v) is as follows: Whether, in the period between November 2011 and 2 March 2012, BR was under [BR’s coal supply obligations] in circumstances where KSC could not operate and/or where BCBCS itself did not fund or propose to fund the Business at the material time and thereafter by reason of one or more of the matters set out in sub-sub-paragraph 178A(a)(iv) of the [defence and counterclaim]; 119 This raises the issue of whether the matters pleaded in para 178A(a)(iv) of the defence and counterclaim affect BR’s coal supply obligations. That paragraph states as follows:127Foot Note 127×Defence and Counterclaim (Amendment No 5) at para 178A(iv). Further and/or alternatively, under Clause 3.8(b)(iii) of the JV Deed, BR's obligation to assist to procure coal was only for the operation of the Business. That obligation did not arise at the material time or thereafter because KSC could not operate and/or because BCBCS itself did not fund or propose to fund the Business at the material time and thereafter by reason of one or more of the following matters: (A) At the material time, the Tabang Plant was not operational; (B) As stated in paragraph 56(a)iv of the Statement of Claim, KSC was not self-funding, and any additional expenditure by KSC could be funded only by way of shareholder funding. KSC could not operate the Business in circumstances where, as it was entitled to, BR had refused to provide further funding to KSC, and where BCBCS itself did not fund or propose to fund KSC; (C) At the material time, the production module of the Tabang Plant had been shut down for upgrading works and/or the power station of the Tabang Plant had been shut down for maintenance; and/or (D) On 15 December 2011, BCBCS procured KSC to place the Tabang Plant into care and maintenance; Our Decision 120 It is convenient to consider each of the four allegations – allegations (A), (B), (C) and (D) – in that paragraph of the pleading in turn. 121 First, allegation (A) is that, at the material time, the Tabang Plant was not operational. We hold that the fact that the Tabang Plant was not operational from November 2011 to 2 March 2012 did not affect BR’s coal supply obligations. On 7 November 2011, KSC made a valid request for coal to be supplied for testing. That gave rise to Bara and FSP’s obligation to supply the coal under cl 3.9 of the 2010 CSAs, in order for there to be sufficient coal for testing when the Tabang Plant became operational after the modifications. BR thus also acquired obligations to ensure that Bara and FSP fulfilled their obligations under cl 3.9 of the 2010 CSAs (see [77] above). As matters developed in November and early December 2011, the modifications were not completed and the Tabang Plant remained non-operational so that testing was delayed. But we do not consider that this affected BR’s coal supply obligations. Those remained, and had to be fulfilled, so that coal would be available for testing when the Tabang Plant resumed operations. 122 Secondly, allegation (B) is, essentially as follows: (a) KSC was not self-funding, and any additional expenditure by KSC could be funded only by way of shareholder funding; (b) KSC could not operate the Business in circumstances where: (i) BR had refused to provide further funding to KSC, as it was entitled to; and (ii) BCBCS itself did not fund or propose to fund KSC. 123 In addressing Issue 9 below, we assess the last premise in this allegation,viz, that BCBCS did not fund or propose to fund KSC, and find that BCBCS had expressed a willingness to fund KSC unilaterally (see [220] – [223] below). Thus, we are not persuaded at this stage that the last premise is made out. 124 In any event, as explained at [112]–[117] above under Issue 2(iv), we do not consider that BR’s coal supply obligations were dependent on there being funding for KSC or, as developed in the Defendants’ submissions, on KSC being able to pay Bara and FSP for coal. Thus, BR’s coal supply obligations were not affected by the matters stated in allegation (B). 125 Allegation (C) is that, at the material time, the production module and/or the power station had been shut down for upgrading works and maintenance. This is, in essence, the same point raised in allegation (A) above. The fact that the production module and power station had been shut down did not affect Bara and FSP’s obligations to supply coal to KSC under cl 3.9 of the 2010 CSAs which had been triggered by KSC’s request for coal on 7 November 2011. Thus, these matters also did not affect BR’s coal supply obligations. 126 Finally, allegation (D) is that, on 15 December 2011, BCBCS procured KSC to place the Tabang Plant into care and maintenance. We have found at [51(e)] above, for full reasons given at [176] below, that the Tabang Plant was placed into care and maintenance by agreement. By that stage, the modifications had not been completed, but that did not affect the obligations under cl 3.9 of the 2010 CSAs or BR’s coal supply obligations. KSC had made a proper request for coal which was needed for testing; and, although the testing might have been delayed when the Tabang Plant was put into care and maintenance, the obligation to supply the coal for testing “as and when requested” remained. 127 We therefore find that, individually and cumulatively, the matters raised in this issue, and under para 178A(a)(iv) of the defence and counterclaim, did not affect BR’s coal supply obligations. These matters were united by the Defendants’ allegation that, as a consequence of these matters, the Business had come to a halt. However, we note at [214] below, in addressing Issue 9, that the JV Deed defines the Business in wide terms. As submitted by Mr Davinder Singh SC (“Mr Singh”) on behalf of the Defendants, the Business refers to “the entire spectrum of the joint venture company's activities from obtaining the raw coal from source to working on that coal in the [Tabang Plant] and to then selling that upgraded coal”.128Foot Note 128×Transcript, 20 April 2017, p 7.During his oral closing submissions, Mr Singh struggled to maintain that the Business had ceased when it was pointed out to him that, under cl 7.1(x) of the JV Deed, both parties’ unanimous consent was necessary for cessation of the business.129Foot Note 129×Transcript, 20 April 2017, p 38.We find that the Business did not cease, nor did BR’s coal supply obligations cease, just because the Tabang Plant was at a particular stage of commissioning, was non-operational, or placed into care and maintenance. Nor did any lack of funding or, as the Defendants developed, KSC’s inability to pay, affect BR’s coal supply obligations in relation to the Business. The answer to Issue 2(v) is therefore “yes”.",
        "Issue 2(vi)": "128 Issue 2(vi) was framed in these terms: Whether, by unilaterally placing KSC into care and maintenance, BCBCS effectively caused KSC to cease its business and/or terminate its operations without BR’s consent, thereby committing a breach of Clause 7.1(x) of the JV Deed, which breach released BR from the Disputed Coal Supply Obligation. 129 As stated at [126] above, we have found that the Tabang Plant was placed into care and maintenance by agreement between the parties. In those circumstances, there was no breach of the JV Deed which could have released BR from its coal supply obligations. Issue 2(vi) therefore does not arise.",
        "Issue 2 - Conclusion": "130 The following conclusions arise from our rulings on Issues 2(i) to (vi): (a) In November 2011, given the stage of commissioning, there was insufficient coal on site for the testing of the Tabang Plant or any electricity generator of the Tabang Plant. (b) KSC made a valid request for such coal in accordance with the terms of the 2010 CSAs on 7 November 2011. (c) There was nothing arising from the funding of KSC, the ability of KSC to pay for coal, the fact that the Tabang Plant had been shut down for modifications or the placing of the Tabang Plant into care and maintenance which affected BR’s coal supply obligations.",
        "Issue 3(i)": "131 Issue 3(i) states: Whether, as a matter of construction and at law, any limitation (in the terms relied upon by BR at sub-issues 2(ii) to 2(vi) above) was placed on BR’s continuing obligation to supply coal to KSC under Clause 3.9 of the 2010 CSAs; 132 The parties could not agree on whether this issue should be included. In any event, it has been answered as a result of our answers to Issues 2(ii) to 2(vi) above. The answer to Issue 3(i) is “no”.",
        "Issue 3(ii)": "133 Issue 3(ii) is: Whether the procedures under Clauses 3.1 to 3.5 of the 2010 CSAs had been dispensed with by agreement and/or prior dealing and/or whether BR is estopped from denying their obligation on account of these matters. 134 This issue has been answered as a result of the answer to Issue 2(iii) above. To the extent that cll 3.1 to 3.5 applied to requests for coal under cl 3.9 of the 2010 CSAs, the parties agreed, at the June 2010 Board Meeting, to apply a different procedure to be decided by Mr Reilly and Mr Wong. The latter in turn agreed to continue with the informal procedure that they had been using (see [104] above). The answer to this issue is therefore “yes”. 135 We now turn to Issue 4, which was conditioned on BR being subject to its coal supply obligations – a premise which, in light of our findings above, is made out. We now consider Issues 4(i) to (iii); each of these sub-issues pertain to breach of BR’s coal supply obligations.",
        "Issue 4(i)": "136 Issue 4(i) was whether BR was in breach by virtue of the following: Allegedly instructing its subsidiaries FSP and Bara to cease supply of coal to KSC on or around 9 November 2011; 137 We have found that, on 9 November 2011, BR instructed Bara and FSP to cease the supply of coal to KSC (see [33] above). We now find that, by issuing this instruction, BR was in breach of its coal supply obligations: (a) Under cl 3.8(b)(iii) of the JV Deed, BR was obliged to assist in procuring Coal for the operation of the Business. The supply of coal for testing under cl 3.9 of the 2010 CSAs was Coal for the operation of the Business. Thus, by instructing Bara and FSP to cease the supply of coal to KSC, BR breached its obligation under cl 3.8(b)(iii) of the JV Deed. (b) Under cl 7.1 of the PLFA, BR was obliged to ensure that Bara and FSP supplied coal for testing to KSC. Thus, by instructing Bara and FSP to cease the supply of coal to KSC, BR breached its obligation under cl 7.1 of the PLFA to ensure that Bara and FSP supplied coal for testing to KSC. 138 The answer to Issue 4(i) is therefore “yes”.",
        "Issue 4(ii)": "139 Issue 4(ii) was whether BR had breached its coal supply obligations by: Allegedly conveying to KSC that it would not be performing its obligation(s) to supply coal when the time for actual performance of these obligations arrived; 140 When, on 9 November 2011, BR instructed Bara and FSP to cease the supply of coal to KSC, there was an existing request for coal which KSC had made on 7 November 2011. Plainly, BR’s instruction referred to that request. We also find that the terms of the instruction meant that later requests for coal under cll 3.1 to 3.8 of the 2010 CSAs would not be met. Accordingly, we find that, by the 9 November 2011 email, the contents of which were later conveyed to Mr Reilly (see [34] above), BR conveyed to KSC that it would not be performing its coal supply obligations when the time for actual performance of these obligations arrived. Thus, BR committed a breach of cl 3.8(b)(iii) of the JV Deed and cl 7.1 of the PLFA by renouncing its duties thereunder. 141 The answer to Issue 4(ii) is therefore “yes”.",
        "Issue 4(iii)": "142 Issue 4(iii) was whether BR was in breach due to the following: Allegedly conditioning its performance of its obligation(s) to supply coal on BCBCS/WEC buying out its 49% stake in KSC for US$45 million. 143 We have found that, at the 17 November 2011 Meeting, BR did condition the supply of coal to KSC on the US$45m buyout option. We now find that BR thus conditioned performance of its coal supply obligations on that buyout option, and that BR was not entitled under Art 7.1 of the PLFA and cl 3.8(b)(iii) of the JV Deed to do so. Thus, BR breached its duties under those provisions. 144 The answer to Issue 4(iii) is therefore “yes”.",
        "The repudiation issues": "145 We now address the second cluster of issues which pertain to repudiation of the JV Deed. We emphasise that the narrow issue before us is whether either party repudiated the JV Deed, and not any other agreement. We therefore do not further elaborate on BR’s repudiatory breaches of the PLFA, referred to at [29(d)], [46] and [51(b)] above. 146 We turn first to Issue 5, which pertained to BCBCS’ alleged repudiation of the JV Deed. In their closing submissions, the Defendants clarify that their case that BCBCS repudiated the JV Deed is founded on the Excess Expenditure Argument, the Excess Debt Argument and BCBCS’ purportedly placing the Tabang Plant into care and maintenance on 15 December 2011 without BR’s consent (“the Care and Maintenance Argument”).130Foot Note 130×Defendants’ Closing Submissions at para 139.The Defendants concede, correctly in our view, that they are “no longer pursuing the point” that BCBCS repudiated the JV Deed by virtue of WEC’s public announcements.131Foot Note 131×Defendants’ Closing Submissions at para 140.Issue 5(iii), which reflected this point, accordingly falls away. We now determine Issues 5(i), (ii) and (iv) to (vi), before dealing with Issues 6 to 8.",
        "Issue 5(i)": "147 Issue 5(i) was whether BCBCS repudiated the JV Deed by reason of : Causing KSC to incur US$6,987,962 in expenses without BR’s consent; The Parties’ Arguments 148 The Defendants’ case is that, between January and September 2011, BCBCS breached cll 7.1(s) and/or (bb) of the JV Deed by causing KSC to incur the Excess Expenditure without BR’s consent; and that this amounted to a repudiatory breach of the JV Deed.132Foot Note 132×Defence and Counterclaim (Amendment No 5) at para 191(b)(ii).Clauses 7.1(s) and (bb) state:133Foot Note 133×3.ACB 2144, 2165 – 2167. 7.1 Matters requiring unanimous consent The Members agree that despite anything to the contrary in this Deed, or in the Constitution,the unanimous consent of the Members or the Directors(as appropriate as the case may be in accordance with the Applicable Law)is required for the Company to do any of the following, unless such act, matter or thing is dealt with in an approved Business Plan: … (s)approve any other matter that financially or contractually binds any or all of the Members; … (bb) permit the Company to incur any indebtedness in excess of $100,000 in total outstanding, or increase the total amount of its borrowings to a figure greater than that provided in the Business Plan; … [emphasis added] 149 The Defendants’ argument that BCBCS breached cll 7.1(s) and/or (bb) of the JV Deed has two fundamental premises: (a)  First, BCBCS had full control of KSC’s financial affairs from January to September 2011.134Foot Note 134×Defendants’ Closing Submissions at paras 146; Defence and Counterclaim (Amendment No 5) at para 182(c).In this regard, the Defendants argue that KSC had incurred the Excess Expenditure on works which were driven and supervised by BCBCS’ employees; that BCBCS hadde factocontrol and supervision of KSC’s expenses; that the WEC parties had made all the staffing decisions for KSC; and that Ms O’Bryan had managed KSC’s accounts during that period. (b) Secondly, BR had not consented to the Excess Expenditure because it had not expressly approved it.135Foot Note 135×Defendants’ Closing Submissions at paras 147 – 150; Defence and Counterclaim (Amendment No 5) at para 182(b) and (c).In particular, the Defendants submit that BR had not consented to the Excess Expenditure by virtue of the fact that BR’s nominated signatory, Mr Lim, had signed the KSC cheques by which KSC made payments out of its bank accounts. The Defendants emphasise that Mr Lim’s role was merely that of ensuring that KSC followed proper procurement procedures. He had no authority to approve the Excess Expenditure; and could not prospectively approve or even consider such expenditure because, when he received a cheque, KSC had already committed to the contract with the relevant vendor. 150 The Defendants further argue that breach of cll 7.1(s) and/or (bb) was a repudiatory breach of the JV Deed, as it was fundamental to the joint venture that the parties unanimously consent before KSC incurred expenditure.136Foot Note 136×Defendants’ Closing Submissions at para 143.While the Defendants did not expressly state that their case is that cll 7.1(s) and/or (bb) were conditions of the JV Deed, it is plain that this is their position; this was also how the Plaintiffs understood the Defendants’ case here.137Foot Note 137×Plaintiffs’ Reply Submissions at para 117. 151 The Plaintiffs challenge both premises of the Defendants’ argument that BCBCS breached cll 7.1(s) and/or (bb) of the JV Deed: (a) First, the Plaintiffs aver that KSC had incurred the Excess Expenditure on its own accord.138Foot Note 138×Plaintiffs’ Closing Submissions at paras 130 – 133; Plaintiffs’ Reply Submissions at para 120; Reply and Defence to Counterclaim (Amendment No 5) at para 68(c)(iii).In this regard, the Plaintiffs emphasise that KSC had its own management and operations team which had made the decisions which led to the Excess Expenditure. The Plaintiffs further deny that BCBCS had full control of KSC’s finances, and submit that BCBCS’ supervisory role over KSC did not suggest otherwise. (b) Secondly, the Plaintiffs contend that BR had consented to the Excess Expenditure by co-signing KSC’s cheques.139Foot Note 139×Plaintiffs’ Closing Submissions at paras 134 – 145; Plaintiffs’ Reply Submissions at paras 121 and 124; Statement of Claim (Amendment No 5) at para 56(a)(ii) – (iii); Reply and Defence to Counterclaim (Amendment No 5) at para 68(b) – (c).The Plaintiffs note that the co-signatory mechanism gave BR the right to veto any payment out of KSC’s bank accounts, that Mr Lim was a senior member of BR’s management, and that BR must have known, from the March 2011 and June 2011 Cost Reports, that KSC was exceeding its budget at the time when Mr Lim signed the cheques. 152 The Plaintiffs also challenge the Defendants’ argument that breach of Cll 7.1(s) and/or (bb) amounted to a repudiation of the JV Deed. The Plaintiffs argue that the Excess Expenditure could not amount to a repudiation of the JV Deed because it had been incurred to ensure KSC’s continued operations.140Foot Note 140×Plaintiffs’ Closing Submissions at paras 146 – 147. Our Decision 153 We do not find the Excess Expenditure Argument compelling. 154 The Defendants’ first premise (see [149(a)] above) stands on very shaky ground. KSC had been incorporated as the joint venture vehicle under the JV Deed. The members of its structure, including its board of directors and management and operations team, were all appointed in accordance with the agreed arrangements under the joint venture. For example, as Mr McLeod deposed, the KSC Board had approved Mr Chapman’s and Mr Reilly’s respective appointments as Acting General Manager and Operations Manager of KSC.141Foot Note 141×AEIC of Alastair Gordon Christopher McLeod dated 10 January 2017 at para 24.Even if KSC’s management and operations team was constituted of BCBCS employees or persons associated with the WEC parties, they made the decisions which led to the Excess Expenditure as KSC personnel. It was up to both parties, as joint venture parties, to decide on the budget and to ensure (if at all) that KSC did not exceed its budget. 155 We find that part of KSC’s structure included BR’s nominated signatory, Mr Lim, who was the COO of BR at the material time and so a senior member of BR’s management, who had the power to veto payments out of KSC’s bank accounts by withholding signature of KSC’s cheques. During cross-examination, both Mr Lim and Mr McLeod accepted that Mr Lim had this power which Mr McLeod defined as “the right under the joint venture document to stop the incurrence of further indebtedness, or if it’s over budget”.142Foot Note 142×Transcript, 13 January 2017, pp 25, 40 and 102.We find that there was a co-signatory mechanism in KSC: (a) In an email dated 20 October 2006, Mr Neil wrote of a “need to start establishing some expense approval mechanism” given that costs were being incurred for the development of the Tabang Plant.143Foot Note 143×4.ACB 3323.Mr Neil noted that the establishment of KSC “will make this much easier as we can set up bank accounts to require Group A and Group B signatories”. Thus, this email indicates that, at the material time, BR saw the proposed co-signatory mechanism as a procedure to control KSC’s expenditure. (b) The co-signatory mechanism appears to have been approved at a meeting between WEC and Bayan on 22 November 2006.144Foot Note 144×5.ACB 3344. (c) KSC’s bank accounts were set up with Group A (Bayan) and B (WEC) signatories, with one Group A and B signatory each required for payment out of KSC’s accounts. As of December 2010, there were five Group A and B signatories each for KSC’s Jakarta account and four each for KSC’s Balikpapan account.145Foot Note 145×P-15. In their closing submissions, the Defendants downplay the significance of the co-signatory mechanism by emphasising Mr Flannery’s evidence that it was the “final part of the process”, involving “the mechanical job of getting the cheques out to the vendors”.146Foot Note 146×Defendants’ Closing Submissions at para 149.However, in our judgment, BR held a vital key to the last stage of the process by which KSC expended funds. Without it, the payment process could not be completed and it meant that KSC could not spend without BR’s consent. It follows that BCBCS did not fully control KSC’s finances. Thus, we do not accept the first premise of the Defendants’ argument. 156 We note the Defendants’ submission that, as a matter of reality, Mr Lim served the restricted role of ensuring that KSC adhered to proper procurement procedures.147Foot Note 147×Defendants’ Closing Submissions at para 149.On this point, Mr Lim’s evidence was as follows: (a)  His role did not extend to keeping tabs on how much KSC had spent; he had no authority to consent, on BR’s behalf, to KSC spending in excess of previously approved amounts.148Foot Note 148×AEIC of Lim Chai Hock dated 3 January 2017 (“Lim’s AEIC”) at para 11.Furthermore, he could not control KSC’s spending because, when he received a cheque, “[t]he PO has been issued, work order given, [and the] order has been placed”.149Foot Note 149×Transcript, 13 January 2017, p 24. (b) He was generally not aware of KSC’s budgets, albeit that he had received a copy of the budget on one occasion around October 2010 when he had asked for supporting documents before signing a cheque.150Foot Note 150×Transcript, 13 January 2017, pp 27 – 28. (c) On that occasion, Mr Chapman had told him that it was not his business to look into KSC’s expenditure because BCBCS was funding KSC, and had accused him of being difficult. Thus, he subsequently signed all of the cheques which were supported by payment vouchers.151Foot Note 151×Lim’s AEIC at paras 12 – 16; Transcript, 13 January 2017, pp 15 – 16. 157 However, even if we accept Mr Lim’s evidence, a matter on which we must say we entertain grave doubts, we do not think that the way in which Mr Lim performed his role is of much relevance. It is not critical that Mr Lim did not (generally) know KSC’s budget. Nor is it crucial that, by the time he received a cheque, the purchase order and work order would have been issued. Nor is it significant, if true, that Mr Lim tempered his inquiries after his encounter with Mr Chapman. What is vital is that BR had the power to veto payments out of KSC’s accounts. How they chose to exercise that power is a matter that lies at their doorstep, not BCBCS’ nor WEC’s. 158 We have found that BR knew that KSC was spending in excess of its budget by 26 April 2011, when Ms O’Bryan sent the March 2011 Cost Report, and on 15 July 2011, when she sent the June 2011 Cost Report (see [17] – [18] above). As noted above, the latter showed that, as of June 2011, the Tabang Plant’s operating costs had exceeded the budget by US$6,071,314. In April or July 2011, BR could easily have acted to stop further expenditure or instructed Mr Lim to stop signing cheques. However, BR did not do so. 159 We now make the further finding that BR knew, since June 2010 at the very latest, that the WEC parties were funding KSC in excess of approved amounts and KSC were spending in excess of approved amounts. The evidence before us shows that only one Business Plan under cl 7.1 of the JV Deed was submitted and approved in the early stages of the joint venture. Thereafter, the formality of putting up and approving a Business Plan was not followed. We find that the parties kept revising the shareholder loans and KSC’s expenditure upwards, albeit with some instances where BR voiced concerns; and there was a pattern of extending sums and incurring or committing to incurring expenditure beyond approved limits before obtaining approval. For example: (a) On 16 September 2008, BCBCS transferred US$2m to KSC for KSC to meet its minimum cash needs. With this transfer, the US$25m facility under BCBCS’ first shareholder loan agreement was overdrawn by US$869,989.152Foot Note 152×Maras’ T1 AEIC at paras 121 – 122.This was only subsequently approved, in principle, at a meeting on the next day, where the parties broadly agreed to increase the shareholder loans from US$25m to US$35m;153Foot Note 153×Maras’ T1 AEIC at paras 122 and 129e.and a formal agreement was only executed on 25 November 2008 in the form of the second shareholder loan agreements.154Foot Note 154×Maras’ T1 AEIC at para 150; 8.ACB 5840. (b) The parties signed the PLFA on 17 December 2010: see [58] of the First Judgment. But they agreed to backdate it to 22 April 2010 when BCBCS had first advanced funds to KSC under the facility.155Foot Note 155×Maras’ T1 AEIC at para 357. (c) The parties only executed the addendum to the PLFA, which increased the revolving working facility which BCBCS made available to KSC, on 29 June 2011 (see [67] of the First Judgment and [70(b)] above). However, the US$20m facility under the PLFA had been fully disbursed by the end of 2010.156Foot Note 156×Maras’ T1 AEIC at paras 362 and 403. In correspondence in June 2010 (the salient parts of which are to be found in the First Judgment at [138]), BR unequivocally stated that it would not be providing further funding to KSC until KSC reached commercial production. BR then sought an undertaking from BCBCS to fund KSC until KSC reached commercial production. In the First Judgment, we found at [146] that BCBCS did not give such an undertaking. But that does not detract from the fact that BCBCS was funding KSC, regardless of whether it had undertaken to do this, and we so find. BR knew this, but BR did not stop KSC from incurring such expenditure, or instruct Mr Lim to stop signing any more cheques, even after it had received the March 2011 and June 2011 Cost Reports. BR does not appear to have called a halt to KSC incurring further expenditure until BR’s Default Notice. 160 We also note that, while Mr McLeod stated that BR had grave concerns after receiving the June 2011 Cost Report (see [18] above), the November 2011 Board Meeting was not held until more than three months after BR received that document. In his reply AEIC, Mr McLeod explained that he acceded to Mr Maras’ request to defer the meeting because Mr Chapman had stated, during the March 2011 Board Meeting, that the modifications to the Tabang Plant would be completed by September 2011 and BR had previously agreed that the next Board Meeting would be after the modifications were complete.157Foot Note 157×McLeod’s 2nd T2 AEIC at paras 36 – 38.We consider that BR would not have agreed to such a deferral of the meeting if it truly had grave concerns about KSC exceeding its budget. We also note that, from 15 July 2011 to the November 2011 Board Meeting, there is no written correspondence from BR to the WEC parties in which BR protests about KSC exceeding its budget. 161 From the meetings in November and December 2011, it is clear, and we find, that the central reason why BR wanted to exit the joint venture was that continuing with it no longer made commercial sense to BR, especially after the HBA Regulations, which set benchmark prices for coal, were introduced (see, in particular, Mr Chin’s statement at [22(b)] above). 162 For these reasons, we do not accept the Defendants’ Excess Expenditure Argument. Therefore, the answer to Issue 5(i) is “no”.",
        "Issue 5(ii)": "163 Issue 5(ii) was whether BCBCS repudiated the JV Deed by reason of: Causing KSC to incur a debt of US$6 million without BR’s consent; The Parties’ Arguments 164 The Defendants contend that, between 29 June and 6 December 2011, BCBCS breached cll 7.1 (f), (s) and/or (bb) of the JV Deed by causing KSC to incur a debt of US$6m without BR’s consent; and that this amounted to a repudiatory breach of the JV Deed.158Foot Note 158×Defence and Counterclaim (Amendment No 5) at para 191(b)(iii).Clauses 7.1(s) and (bb) are set out at [148] above. Clause 7.1(f) provides as follows:159Foot Note 159×3.ACB 2144, 2165 – 2166. 7.1 Matters requiring unanimous consent The Members agree that despite anything to the contrary in this Deed, or in the Constitution, the unanimous consent of the Members or the Directors (as appropriate as the case may be in accordance with the Applicable Law) is required for the Company to do any of the following, unless such act, matter or thing is dealt with in an approved Business Plan: … (f)make any decision about the requirements for, and the raising of, further finance or working capital for the Company; … [emphasis added] Again, the Defendants argue that Cll 7.1(f), (s) and/or (bb) were conditions. Thus, BCBCS repudiated the JV Deed by breaching these clauses.160Foot Note 160×Defendants’ Closing Submissions at para 153. 165 The Plaintiffs’ pleaded response to this allegation is as follows:161Foot Note 161×Statement of Claim (Amendment No 5) at para 56(a)(iv); Reply and Defence to Counterclaim (Amendment No 5) at para 72(b)(iii)(C). (a) First, the Plaintiffs contend that BR had consented to KSC’s incurring the Excess Debt because (1) BR knew or ought to have known that, if KSC spent more than the budgeted amount, the excess could only be funded by way of shareholder loans; and (2) BR had consented to the Excess Expenditure. (b) Secondly, the Excess Debt had been approved by the terms of the second shareholder loan agreements of 25 November 2008. (c) Thirdly, and in the alternative, BR’s consent to the Excess Debt was not required as cl 7.1(s) of the JV Deed had been superseded. (d) Fourthly, and in the alternative, BR was obliged to reasonably approve the Excess Debt by virtue of cll 17.1 – 17.3 of the JV Deed. 166 However, in their submissions, the Plaintiffs argue as follows:162Foot Note 162×Plaintiffs’ Closing Submissions at paras 148 – 155; Plaintiffs’ Reply Submissions at paras 125 – 129. (a) First, BR had consented to the Excess Debt because the agreed funding arrangements were that BCBCS would provide all cash funding to the Tabang Plant until it reached commercial production. (b) Secondly, BR had consented to the Excess Debt given that (1) it was clear from the materials prepared in advance of the March 2011 Board Meeting that KSC would require cash funding in excess of the previously agreed amount, (2) BR had approved KSC’s 2011 budget and (3) BR had continued to approve all of KSC’s expenses by counter-signing all relevant cheques. (c) Thirdly, BCBCS’ US$6m loan to BR would not have accrued as a debt to KSC unless BR and BCBCS consented to it by ratifying it by a shareholder loan agreement, or further Addendum to the PLFA. 167 The Defendants’ over-arching reply to the Plaintiffs’ submissions on this point is that they were not pleaded.163Foot Note 163×Defendants’ Closing Submissions at para 155.Furthermore, the Defendants respond to the Plaintiffs’ arguments as follows:164Foot Note 164×Defendants’ Closing Submissions at paras 157 – 160. (a) In response to [166(a)], the Defendants argue that the agreed funding arrangements which BCBCS contended for would render the US$40m limit under the PLFA meaningless. Moreover, it would have made no commercial sense for BR to have agreed to such funding arrangements since it would take longer for BR to recover its investment in KSC the more debt KSC took on from BCBCS. (b) In response to [166(b)], the Defendants argue that BR could not have consented to the Excess Debt when there was no information at the material time regarding who would be providing the funding, and the terms on which funding would be provided. (c) In response to [166(c)], the Defendants emphasise that the Excess Debt was recorded as a debt in the November 2011 Board Pack and that BCBCS had first argued that the Excess Debt was not one of KSC’s debts in Mr Flannery’s AEIC, in this tranche of the trial. Our Decision 168 We do not accept the Excess Debt Argument. It assumes that BCBCS had caused KSC to incur a debt. But, in our judgment, that premise is unsound. It does not follow from the fact that BCBCS had advanced US$6m to KSC that KSC accrued a corresponding debt to BCBCS. Furthermore, that the Excess Debt was recorded as a debt in the November 2011 Board Pack does not establish that such a debt had accrued. As the Plaintiffs argue, such a debt would only have arisen if the parties had subsequently ratified the funding by a shareholder loan agreement or a further Addendum to the PLFA. Failing such ratification, BCBCS simply could not recover from KSC the US$6m which it had advanced to the latter. It is not in dispute that there was no such subsequent ratification of the US$6m funding. Therefore, KSC did not incur a debt of US$6m to BCBCS; and the premise of Issue 5(ii) falls away. 169 The Defendants submit that this line of reasoning, which is inherent in the Plaintiffs’ submission summarised at [166(c)] above, was not pleaded. However, in our judgment, this objection has little weight. It was the Defendants who pleaded that the Plaintiffs repudiated the JV Deed by causing KSC to incur the Excess Debt. Accordingly, the Defendants bore the burden of proving that KSC incurred the Excess Debt, which burden they have not discharged. In any event, the matter is one for submissions and the parties have had adequate opportunity to deal with it. 170 For these reasons, the answer to Issue 5(ii) is “no”.",
        "Issues 5(iv) and (v)": "171 We will deal with Issues 5(iv) and (v) together. These issues were whether BCBCS repudiated the JV Deed by reason of: (iv) Failing to remedy the breaches set out in the Default Notice; (v) Demanding, by a letter dated 24 December 2011, that BR withdraw the Default Notice; 172 In relation to Issue 5(iv), the putative breaches alleged in BR’s Default Notice pertained to the Excess Expenditure, the Excess Debt, and WEC’s public announcements (see [55] above). As we have mentioned at [146] above, the Defendants have abandoned their argument in respect of the public announcements. We have also found that BCBCS did not breach the JV Deed in relation to the Excess Expenditure and the Excess Debt (see [162] and [170] above). It follows that the allegations of breach in BR’s Default Notice were baseless. Thus, BCBCS did not repudiate the JV Deed by failing to remedy these ostensible breaches; nor did BCBCS do so by demanding that BR withdraw BR’s Default Notice. Accordingly, the answer to both Issue 5(iv) and (v) is “no”.",
        "Issue 5(vi)": "173 Issue 5(vi) was whether BCBCS repudiated the JV Deed by reason of: Procuring KSC to place the Tabang Plant into care and maintenance without BR’s consent. The Parties’ Arguments 174 The Defendants’ case is that BCBCS repudiated the JV Deed by procuring KSC to place the Tabang Plant into care and maintenance, on or around 15 December 2011, without BR’s consent.165Foot Note 165×Defence and Counterclaim (Amendment No 5) at para 191(b)(vi).In their pleadings, the Defendants do not identify which provision of the JV Deed they are alleging that BCBCS had breached. However, in their closing submissions, the Defendants clarify that they are contending that BCBCS breached cll 7.1(s) and/or (x) of the JV Deed. Clause 7.1(s) is set out at [148] above. Clause 7.1(x) states: 7.1 Matters requiring unanimous consent The Members agree that despite anything to the contrary in this Deed, or in the Constitution, the unanimous consent of the Members or the Directors (as appropriate as the case may be in accordance with the Applicable Law) is required for the Company to do any of the following, unless such act, matter or thing is dealt with in an approved Business Plan: … (x)cease the Company’s business,terminate its operationsor wind up the Company; … [emphasis added] The Defendants’ submissions here are founded on an undisputed fact,viz, that the parties did not agree on the costs of care and maintenance.166Foot Note 166×Plaintiffs’ Closing Submissions at para 165; Defendants’ Reply Submissions at para 76.The Defendants argue that BR could not have consented to the care and maintenance program where it had not agreed to KSC incurring the costs of such a program. 175 The Plaintiffs rebut the Care and Maintenance Argument as follows:167Foot Note 167×Plaintiffs’ Closing Submissions at paras 179 – 184; Plaintiffs’ Reply Submissions at paras 130 – 135; Reply and Defence to Counterclaim (Amendment No 5) at paras 44(f) and 72(b)(vi). (a) First, the Plaintiffs contend that, during the 6 December 2011 EGM, the parties had agreed that the Tabang Plant should be put into care and maintenance. (b) Secondly, the Plaintiffs argue that care and maintenance did not fall within the scope of cl 7.1(x) because it did not amount to termination of KSC’s operations. (c) Thirdly, the Plaintiffs argue that, even if care and maintenance amounted to termination of KSC’s operations, BR had consented to such termination during the 6 December 2011 EGM. (d) Fourthly, the Plaintiffs object to the Defendants’ argument that BCBCS breached cl 7.1(s) on the basis that this was not pleaded. Our Decision 176 We do not accept the Defendants’ Care and Maintenance Argument. We found, at [51(e)] above, that, at the 6 December 2011 EGM, the parties agreed that the Tabang Plant be placed into care and maintenance. This is evident from the following: (a) The records of the meeting reflect that, towards the end of the meeting, Mr Chin proposed that KSC “stop its operations to avoid incurring further costs”. Mr Flannery then stated his understanding that the parties agreed “to suspend KSC operations and maintain a limited number of people on site” and that BR would be provided with proposals regarding the crew required to implement a care and maintenance program on a monthly cost basis (see [50(g)] above). Importantly, the records of the meeting do not show that BR stated, in response to Mr Flannery’s assertion, that there was no such agreement. (b) The records of the meeting also capture an exchange between Mr Chin and Mr Duncan, during which Mr Chin said, regarding the option of liquidating the Tabang Plant, that “BR would like to recover as much as possible” from a sale of KSC’s assets. During cross-examination, Mr Neil agreed that Mr Chin made this statement at the meeting.168Foot Note 168×Transcript, 12 January 2017, p 73.As the Plaintiffs submit, putting the Tabang Plant into care and maintenance would have been consistent with this avowed aim because the value of KSC’s assets could only have been maximally realised if the Tabang Plant was put into care and maintenance and not abandoned.169Foot Note 169×Plaintiffs’ Closing Submissions at paras 182; Plaintiffs’ Reply Submissions at para 135.This lends support to our finding that BR agreed to care and maintenance during the meeting. (c) After the meeting, the WEC parties wrote to BR on 20 and 22 December 2011 to request confirmation that BR would provide 49% of the funding for the care and maintenance program (see [57]–[59] above). In its reply to the 20 December letter (see [60] above), BR asked for an “exhaustive and detailed list” of every item which the WEC parties alleged was required for care and maintenance and the cost of each item to “consider [its] position” in relation to the funding necessary for the care and maintenance program. BR added that it was requesting further information “without any admission of liability or confirmation of payment by BR”. We make the following points about this letter: (i) In this letter, BR was careful to state that it did not admit liability or confirm payment (in respect of the costs of care and maintenance). However, BR did not state that it had not agreed to care and maintenance, or that it would only so agree if the parties agreed on the costs of care and maintenance. (ii) A care and maintenance program could be implemented at various levels, with crew of varying expertise and numbers and therefore at different cost levels. BR wanted to know, before agreeing to the same, what items were being specified for care and maintenance, the number of crew for those items and the costs thereof. (iii) BR therefore asked for information to decide its position in relation to the “funding necessary for the care and maintenance program”. Reading between the lines, it is plain, and we so find, that BR had agreed that the Tabang Plant be put into care and maintenance, but reserved its position as to whether it would fund it without knowing the cost therefor. 177 In short, the Care and Maintenance Argument is premised on the claim that BCBCS unilaterally procured KSC to put the Tabang Plant into care and maintenance. However, this was not the case. The parties agreed to put the Tabang Plant into care and maintenance at the 6 December 2011 EGM. Therefore, the Defendants’ contention on this issue fails. The answer to Issue 5(vi) is therefore also “no”.",
        "Issue 6": "178 Issue 6 states: If any of the above is established, whether BR accepted BCBCS’ repudiation of the JV Deed by way of BR’s letter dated 21 February 2012 to BCBCS. 179 We have answered Issues 5(i), (ii) and (iv) to (vi) in the negative. Therefore, BCBCS did not repudiate the JV Deed by reason of the matters contended for by BR. Hence, Issue 6 as to whether BR accepted BCBCS’ repudiation by BR’s Termination Notice does not arise.",
        "Issue 7": "180 Issue 7 states: Whether BR had repudiated the JV Deed by: (i)  Breaching the Disputed Coal Supply Obligation as set out at Issue 4 above; (ii) Its alleged words and conduct at the meetings of 2 and 3 November 2011 and 6 December 2011; and/or (iii)  The allegedly wrongful issuance of BR’s letter dated 21 February 2012 to BCBCS. We address Issues 7(i) to (iii) in turn.",
        "Issue 7(i) – The Coal Supply Argument": "181 The Plaintiffs argue that cl 3.8(b)(iii) of the JV Deed was a condition of the same.170Foot Note 170×Plaintiffs’ Submissions at paras 111 – 116.We agree. InRDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltd and another appeal[2007] 4 SLR(R) 413 (“RDC Concrete”), the CA  stated the test for a condition at [97] as follows: In the second situation (Situation 3(a)), the focus is on the nature of the term breached and, in particular,whether the intention of the parties to the contract was to designate that term as one that is so important that any breach, regardless of the actual consequences of such a breach, would entitle the innocent party to terminate the contract(this is, however, not to say that the consequences of breach are irrelevant inasmuch as the parties have,ex hypothesi, envisaged, in advance, and hypothetically, serious consequences that could ensue in the event of the breach of that particular term). In traditional legal terminology, such a term would be termed a “condition”. [original emphasis omitted; emphasis added in italics] Thus, a condition is a term which parties intended to designate as so important that any breach thereof, regardless of its actual consequences, would entitle the innocent party to terminate the contract. InMan Financial (S) Pte Ltd (formerly known as E D & F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008] 1 SLR(R) 663 (“Man Financial”), the CA elaborated on the inquiry into ascertaining whether a contractual term is a condition as follows: (a) First, the focus is on ascertaining the contracting parties’ intention by construing the contract, including the relevant term, in the light of the surrounding circumstances: seeMan Financialat [161] and [174]. (b) Secondly, four factors which are relevant in ascertaining whether a term is a condition are (1) statutory classification of the term as a condition, (2) an express statement in the term that it is a condition, (3) a prior precedent and (4) the context of mercantile transactions, where terms are more likely to be classified as conditions especially where they pertain to timing: seeMan Financialat [162] – [173]. 182 The Plaintiffs accept that none of the four factors identified inMan Financialapply.171Foot Note 171×Plaintiffs’ Closing Submissions at para 114.We agree. Nonetheless, applying the general test inRDC Concrete, it is clear that cl 3.8(b)(iii) was a condition of the JV Deed. The purpose of the joint venture was to upgrade coal from Bara and FSP in Tabang (see Recitals C and D of the JV Deed).172Foot Note 172×3.ACB 2144, 2146.Therefore, BR’s obligation to assist in procuring coal for the Business (which, as we have found at [75] above, extended to ensuring that Bara and FSP complied with their obligations under cl 3.9 of the 2010 CSAs) was fundamental to the joint venture. Thus, we find and hold that cl 3.8(b)(iii) of the JV Deed was a condition of the same. It follows that, when BR breached cl 3.8(b)(iii) of the JV Deed in respect of the matters set out in Issues 4(i) to (iii) (see [137], [140] and [143] above), BR was in repudiatory breach of the JV Deed. 183 However, the more important, and undisputed, point is that BCBCS did not purport to accept BR’s breaches of its coal supply obligations and terminate the JV Deed. BR’s repudiatory conduct in this regard was therefore a breach writ in water.",
        "Issue 7(ii) – The Renunciation Argument": "The Parties’ Arguments 184 The Plaintiffs’ case is that BR repudiated the JV Deed by renouncing the JV Deed at the November 2011 Board Meeting and at the 6 December 2011 EGM.173Foot Note 173×Statement of Claim (Amendment No 5) at para 59E(c).In this regard, the Plaintiffs rely on the following four points regarding the November 2011 Board Meeting:174Foot Note 174×Plaintiffs’ Closing Submissions at para 108. (a) BR informed BCBCS that it wished to end the joint venture; (b) BR made two proposals – that BCBCS buy BR’s 49% stake in the joint venture, or that the Tabang Plant be shut down – which were not in line with the scheme of the JV Deed; (c) BR told BCBCS that it would not comply with the PLFA and the Side Letter, which were ancillary agreements to the JV Deed; (d) BR did not consider itself a party to the JV Deed after the end of the meeting on 2 November 2011. In relation to the 6 December 2011 EGM, the Plaintiffs rely on the following statements which BR made at that meeting:175Foot Note 175×Plaintiffs’ Closing Submissions at para 120. (a) BR stated that it had withdrawn from the joint venture as it did not consider it economically viable; (b) BR stated that it would not comply with the PLFA and the Side Letter; (c) BR stated that, if BCBCS did not agree to the US$45m buyout option, KSC would have to be liquidated. 185 The Defendants deny that BR renounced the JV Deed; in particular, the Defendants pleaded that, at the material time, BR had no obligation which it could have renounced.176Foot Note 176×Defence and Counterclaim (Amendment No 5) at para 194.In their closing submissions, the Defendants clarify this contention by submitting that BR had the right to call a halt to the Business (as defined in the JV Deed) because it had the right to stop KSC from receiving any further funding.177Foot Note 177×Defendants’ Closing Submissions at paras 126 – 132.The Defendants further argue that, at the November 2011 Board Meeting, BCBCS recognised that BR had such a right because it made new proposals, which departed from the existing arrangements, in view of the fact that the Business and joint venture were over. Finally, the Defendants submit that “BR’s position at the 6 December 2011 EGM was no different from its position at the 2 and 3 November 2011 meetings”; and that BR therefore did not renounce the JV Deed at the 6 December 2011 EGM. Our Decision 186 The law on renunciation is settled. A party renounces a contract where, by words or conduct, it “clearly conveys to the other party to the contract that it will not perform its contractual obligations at all” [emphasis omitted]: seeRDC Concreteat [93]. 187 We find that BR did not renounce the JV Deed at the November 2011 Board Meeting for the following reasons. 188 First, during the meeting, BR stated that it wished to exit from the joint venture and matters had to be finalised by the end of December 2011. However, it did not communicate to BCBCS that it no longer considered itself a party to the joint venture (see [29(b)] above). In our judgment, BR, in simply stating that it wished to exit the joint venture, was not intimating to BCBCS that it would not perform its obligations under the JV Deed at all. We note two further points in this regard: (a) BCBCS did not state, during the November 2011 Board Meeting or in any of their contemporaneous letters thereafter, that BR had renounced the JV Deed during the meeting. (b) After the November 2011 Board Meeting, Bara and FSP continued to supply coal to KSC until 9 November 2011. 189 Secondly, BR did not renounce the JV Deed by merely making two proposals to BCBCS which were not in line with the joint venture. In doing so, BR was merely attempting to negotiate an exit from the joint venture (see [29(c)] above). In our judgment, the JV Deed did not preclude BR from doing so. We note that cll 11 to 13 of the JV Deed provided for termination of the joint venture by consent and for the resolution of deadlocks. We find that it was always open to BR to persuade BCBCS to agree, in a manner and on terms different from those contemplated by the JV Deed, to BR’s exit from the joint venture. We consider that this was what BR was trying to do in making its two proposals to BCBCS. And we note that BCBCS had also made counter-proposals to BR, which departed from the existing terms of the joint venture, as part of the negotiations between the parties. 190 Thirdly, in our judgment, BR’s obligation under cl 3.8(b)(iii) of the JV Deed was to assist in procuring coal for the Business in line with the terms of the 2010 CSAs (see [77(b)] above). This obligation did not extend to ensuring that coal was supplied to KSC on the terms of the PLFA, including the provision for the Coal Advance by BR. We note that, unlike the 2010 CSAs, the PLFA does not refer to the JV Deed at all. While we have found that Art 7.1 of the PLFA created a freestanding obligation on BR to ensure that coal was supplied to KSC in accordance with the 2010 CSAs (see [77(a)] above), we do not consider that the PLFA altered the content of BR’s obligation under cl 3.8(b)(iii) of the JV Deed. This continued to be to assist in procuring coal for KSC in accordance with the 2010 CSAs. Thus, while BR repudiated the PLFA at the November 2011 Board Meeting, we find that it did not thereby repudiate the JV Deed. 191 For similar reasons, we also find that BR did not renounce the JV Deed at the 6 December 2011 EGM: (a) First, as explained at [188] above, BR did not renounce the JV Deed by stating that it wished to withdraw from the joint venture. (b) Secondly, BR did not renounce the JV Deed by restating its two proposals. In doing so, BR was simply negotiating to achieve its goal of an exit from the joint venture by the end of 2011 (see [50(f)] and [189] above). (c) Thirdly, for the reasons given at [190] above, while BR again renounced the PLFA at the 6 December 2011 EGM, this did not amount to a breach of BR’s obligation under cl 3.8(b)(iii) of the JV Deed. (d) Finally, BR’s representatives may have made statements at the 6 December 2011 EGM which could be construed as indicating that BR no longer considered itself to be bound by the JV Deed (see [50(b)] above). But we find that, by these remarks, BR did not unambiguously convey to BCBCS that it would not perform its obligations under the JV Deed. We find that BCBCS would have understood these remarks as mere bluster or posturing. Ultimately, what is crucial is the consistent position expressed by BR during the meeting,viz, that BR wanted to exit the joint venture and was making two proposals to BCBCS in this regard. We have found that adopting this position did not amount to repudiatory conduct (see [(a)] and [(b)] above). 192 The answer to Issue 7(ii) is therefore “no”.",
        "Issue 7(iii)": "193 We have found that BCBCS did not repudiate the JV Deed (see [147] – [177] above) by reason of the matters relied on by BR. It follows that BR had no grounds to issue its Termination Notice which purported to terminate the JV Deed. By purporting to do so, BR clearly conveyed to BCBCS that it would not be complying with the JV Deed. We thus find that BR renounced the JV Deed by BR’s Termination Notice and thereby repudiated the JV Deed.",
        "Issue 8": "194 Issue 8 states: If any of the above is established, whether BCBCS accepted BR’s repudiation of the JV Deed by way of its letter dated 2 March 2012. 195 We have found that there was repudiatory conduct by BR by reason of (1) its breach of its coal supply obligations and (2) the wrongful issuance of BR’s Termination Notice. In relation to (1), it is common ground that BCBCS did not accept BR’s repudiatory breach in this regard (see [183] above). With regard to (2), BCBCS sought to accept BR’s repudiation in its letter dated 2 March 2012. Therefore, given our finding that BR repudiated the JV Deed by BR’s Termination Notice, we find that BCBCS validly accepted BR’s repudiation of the JV Deed by its letter dated 2 March 2012 and thus terminated the JV Deed. The joint venture accordingly came to an end on 2 March 2012. Thus, the answer to Issue 8 is “yes”. 196 We now turn to the causation and loss issues.",
        "The causation and loss issues": "",
        "Issue 9": "The Parties’ Arguments 197 The parties were unable to agree on the wording of Issue 9. 198 The Plaintiffs suggested the following: If BR is found to be liable for breach of its obligation(s) in respect of coal supply and/or repudiation of the JV Deed, and on the agreed assumption that the Tabang Plant would have achieved a production capacity of approximately 1 MTPA, whether, as a result of such breach, BCBCS suffered loss. 199 The Defendants proposed this version instead: Having regard, among other things, to the Court's finding in its Judgment dated 12 May 2016, including but not limited to its finding that BR was not obliged under the JV Deed or the Funding MOU to provide funding, and the matters pleaded in paragraph 178A of the D&CC, if BR is found to have breached the Alleged Coal Supply Obligation and/or repudiated the JV Deed, and on the agreed assumption that the Tabang Plant would have achieved a production capacity of approximately 1 MTPA, whether such breach and/or repudiation caused loss to BCBCS and (if so) what is the period that BCBCS is entitled to claim damages for. 200 It is convenient to consider the Defendants’ formulation first. 201 The Defendants’ formulation is premised on BR having breached its coal supply obligations or repudiated the JV Deed. We have found that both premises are made out. BR breached its obligations under cl 3.8(b)(iii) of the JV Deed to ensure that coal was supplied to KSC in accordance with cl 3.9 of the 2010 CSAs (see [136] – [144] above). BR was thus in repudiatory breach of the JV Deed by breaching its obligation under cl 3.8(b)(iii) of the same (see [182] above), albeit that BCBCS did not accept this repudiatory breach. BR also repudiated the JV Deed by BR’s Termination Notice which wrongly purported to terminate the JV Deed. BCBCS accepted this repudiation and put an end to the JV Deed by a letter of 2 March 2012 (see [195] above). 202 The parties agreed that, with one exception, questions of damage resulting from a finding of breach (including issues of quantum) would be left to Tranche 3.178Foot Note 178×Notes of Evidence of CMC dated 8 November 2016 at p 6.The exception was Issue 9. At a CMC, the Defendants obtained leave from the Court to argue in Tranche 2 that, even if BR had breached the JV Deed, there would only be nominal damages. According to Mr Singh, even on the assumption that the Tabang Plant could have attained something like commercial production (1 MTPA) at some point in time, it could readily be demonstrated that damages from any breach of obligation or a repudiation of the JV Deed must be nominal. Issue 9 is thus analogous to a strike-out argument. Mr Singh contends that there is no need for this Court to hear what might involve (among other matters) substantial expert evidence on the Tabang Plant’s capacity to achieve commercial production. Instead, the Court would only have to draw obvious inferences from a manageable number of facts. It was on this basis that we allowed the Defendants to argue Issue 9 as part of Tranche 2. If Mr Singh is right, there would be no need for a Tranche 3. 203  In their opening statement for Tranche 2, the Defendants contend that, even if BR is liable for breach of its coal supply obligations or repudiation of the JV Deed, BCBCS should only be entitled to nominal damages for a limited period.179Foot Note 179×Defendants’ Opening Statement at paras 109 – 113.Such period would run from the date of breach to either of the following dates: (a) 22 November 2011, when the Tabang Plant was demobilised (see [43] above); because, after that date, it would not have been possible for the Tabang Plant to reach commercial production of 1 MTPA and become profitable; (b) 6 December 2011, when BR instructed Bara and FSP  to supply coal to KSC if requested (see [52] above); the argument here appears to be that there could have been no continuing breach of the coal supply obligation after that date; (c) 15 December 2011, when the Tabang Plant was placed into care and maintenance (see [56] above); because the Tabang Plant could only have come out of care and maintenance, and become profitable subsequently, if there had been funding for KSC, and there was none (see further [205]–[206] below); or (d) 31 December 2011, when the PLFA expired (see [63] above); because BR had no obligation under the PLFA thereafter. In their closing submissions, the Defendants take the same position albeit that, in respect of [(b)] above, they suggest the alternative date of 24 November 2011, the date of BR’s letter to BCBCS stating that Bara would supply coal to KSC based on the 2010 CSA to which Bara was a party (see [44(b)] above).180Foot Note 180×Defendants’ Closing Submissions at para 188They further clarify that their argument with respect to 6 December 2011 is also based on the fact that Mr Chin purportedly made clear to BCBCS, at the 6 December 2011 EGM, that BR was willing and able to procure Bara and FSP to supply coal to KSC at HBA prices. 204 In their closing submissions, the Defendants develop an additional point as to why damages should be nominal in any event.181Foot Note 181×Defendants’ Closing Submissions at paras 175 – 179.This argument stemmed from para 178A(a)(iv) of their defence and counterclaim which has been dealt with in the context of Issue 2(v) at [118] – [127] above in relation to the extent of BR's coal supply obligations. (We note that Issue 9 as formulated by the Defendants refers to this paragraph of the defence and counterclaim: see [199] above). In the context of causation, the Defendants argue that, in the light of the matters pleaded in sub-para (A) to (D) of para 178A(a)(iv), BCBCS could not have suffered loss and damage from BR’s breach of its coal supply obligations or repudiatory breach of the JV Deed. 205 The Defendants submit that since, as we held in Tranche 1, BR did not have an obligation to continue funding the joint venture, the failure by BR to supply (or procure the supply of) coal to KSC could have no material consequence.182Foot Note 182×Defendants’ Closing Submissions at paras 175 – 178.That is because KSC would require funds to continue to operate. In particular, KSC would need funds to modify and commission the Tabang Plant, to pay for coal, and to bring the Tabang Plant to commercial production. If no funds were forthcoming from BR, then the monies for KSC’s operation could only come from BCBCS. But the Defendants say that BR was entitled to (and did) object to BCBCS unilaterally funding KSC.183Foot Note 183×Defendants’ Closing Submissions at para 179. 206 More specifically, the Defendants’ case is that, under cl 7.1(f) of the JV Deed, BR's approval was required before BCBCS could raise further finance or working capital for KSC.184Foot Note 184×Transcript, 4 January 2017, pp 52 – 60; Transcript, 6 January 2017, pp 202 – 205.The Defendants claim that, in late 2011, it had legitimate concerns about KSC taking on further liabilities to BCBCS and would not have allowed KSC to do so. The Defendants suggest that, due to its concerns, it made clear to BCBCS that BR would not countenance KSC incurring additional debt, given the large amounts already spent on the Project and the problems still being encountered with BCBCS’ coal briquetting technology. In consequence, even if theoretically the Tabang Plant was capable of achieving 1 MTPA of upgraded coal briquettes at some point, it could not (the Defendants assert) have reached that level of production without a further significant injection of cash. No such cash was forthcoming. Thus, the Tabang Plant would inevitably have had to close down without reaching commercial production or anywhere near that stage. 207 The Plaintiffs respond that, once ongoing modification works had been completed, the Tabang Plant would have soon been able to operate at a commercial level of 1 MTPA or something close to that.185Foot Note 185×Plaintiffs’ Closing Submissions at paras 200 – 208.The Plaintiffs argue that funding for the Project should not have been a difficulty, as WEC was prepared to fund KSC until at least June 2012. What was problematic was instead the continued supply of coal, because BR was threatening to pull out of the joint venture altogether. BR had also stopped the supply of coal since 9 November 2011. Our Decision 208 We are not persuaded by the Defendants’ arguments. 209 The four alleged cut-off dates argued by the Defendants would not necessarily constrain the amount of damages payable. 210 First, in respect of 22 November 2011 (see [203(a)] above), Mr Reilly’s evidence, which we have accepted at [43] above, was that demobilisation did not mean that activity at the Tabang Plant stopped on that date. Only short-term contractors were requested to suspend work. KSC’s more than 300 regular employees continued to work on the modifications. Therefore, we do not accept the Defendants’ argument that, after 22 November 2011, it would not have been possible for KSC to reach commercial production and become profitable. 211 Secondly, in respect of 6 December 2011 (see [203(b)] above), we have found that the 6 December 2011 instruction from BR to Bara and FSP was an internal communication that was not conveyed to KSC (see [52] above). We note that, in their closing submissions, the Defendants emphasise that, in their letter of 24 November 2011, and at the 6 December 2011 EGM, BR made clear that Bara and FSP were prepared to supply coal to KSC at HBA prices. However, at best, this would only mean that there was no continuing breach of BR’s coal supply obligations after 24 November or 6 December 2011. We have found that there was a breach of BR’s coal supply obligations under the JV Deed (see [137(a)] above); and we do not see why a claim for damages for this breach would necessarily have to be limited to the specific cut-off dates of 24 November or 6 December 2011. 212 Thirdly, as for 15 December 2011 (see [203(c)] above), Mr Reilly said that the Tabang Plant could be brought out of care and maintenance and “turned back on pretty quickly”.186Foot Note 186×Transcript, 5 January 2017, p 105.He clarified:187Foot Note 187×Transcript, 5 January 2017, p 106. JUSTICE REYES:  When you say “turned back on pretty quickly, if required”, how quickly? Are we talking days, weeks, months? A.I would say days if you did it correctly and you went through, it would only take days to turn stuff on.You're talking things like gearboxes, you're talking about conveyor drives, briquette machines, again, it's just a matter of turning them back on. I would think on the production module side of things and the conveyors side and the stockyard and the ROM coal, it wouldn't take long to get those going again. Depending on the amount of downtime that was there, it would obviously depend on how long it would take to re-fire the power station and get that back up to heat and get it going again so you could run under full steam. I would say that would take longer than anything on the production module. [emphasis added] Therefore, if BR had not repudiated the JV Deed on 21 February 2012 and the JV Deed had not been terminated in consequence on 3 March 2012 but had continued instead, the Tabang Plant could have been revived within “days” and gone on to commercial production at some point after 15 December 2011. The Defendants’ argument here is that this could only have been done if KSC had funding, and there was none. However, as we explain below, we do not consider that we can reach that conclusion at this stage. For these reasons, we do not accept the Defendants’ argument here. 213 That leaves the expiry of the PLFA on 31 December 2011 (see [203(d)] above). The Defendants submit that BR had no obligations under the PLFA thereafter. It is correct that the lapse of the PLFA on 31 December 2011 would have ended BR’s obligation under Art 7.1 of the same to ensure that Bara and FSP supplied coal to KSC in accordance with the terms of the 2010 CSAs. However, the JV Deed was still in force after 31 December 2011. Therefore, since Bara and FSP remained obliged under cl 3.9 of the 2010 CSAs to supply coal to KSC, notwithstanding the expiry of the PLFA, BR continued to bear the obligation under cl 3.8(b)(iii) of the JV Deed to ensure that Bara and FSP supplied coal to KSC in accordance with cl 3.9 of the 2010 CSAs (see [75] above). 214 To elaborate, under cl 3.8(b)(iii), BR was obliged to “assist in procuring Coal for the operation of the Business”.  As we have noted at [127] above, Mr Singh submitted that the JV Deed defines the “Business” in wide terms. We have also noted at [127] that the “Business” did not cease just because the Tabang Plant had gone into care and maintenance. We now find that, for similar reason, the “Business” of the joint venture would not have ceased merely because of the end of the “Availability Period” under the PLFA. BR continued to be subject to cl 3.8(b)(iii) of the JV Deed notwithstanding that the PLFA expired on 31 December 2011. 215 Additionally, if the joint venture had continued, and if the parties had managed to sort out their differences, it is possible that the Tabang Plant could have resumed operations, completed testing and commissioning, and gone on to commercial production. It therefore does not follow that all prospect of earnings under the joint venture came to an end when the PLFA expired. 216 The Defendants submit that, starved of funds, the Tabang Plant could never have gone into commercial production in any event. We accept that an effect of the expiry of the PLFA on 31 December 2011 was that BR’s funding of the Coal Advance would have ceased and that cessation would be relevant to funding. Nonetheless, there are difficulties with the Defendants’ argument. 217 To begin with, it is far from clear on the evidence that BCBCS was ever told that BR would veto BCBCS unilaterally funding KSC. Mr Singh cross-examined Mr Flannery extensively in relation to cl 7.1(f) of the JV Deed. But it was never directly put to Mr Flannery that BR had explicitly told BCBCS to stop injecting further funds into KSC from November 2011 onwards. On the contrary, Mr Flannery's evidence in cross-examination was that BR had made it clear that any further funding for KSC had to be provided by BCBCS alone at least until testing and commissioning of the Tabang Plant had been completed:188Foot Note 188×Transcript, 6 January 2017, p 150. Q.  What was your belief at that time, and I'm talking about before November 2011, about the parties' position as far as funding was concerned; in other words, what were the parties to do as far as funding was concerned? A.  The Bayan party had made it quite clear and it was said to me when I joined the company that they would not be funding anymore andwe had to fund everything to get this plant up and running to full production. So, you know, as far as I was concerned,we were powering ahead from the day I joined to get[the Tabang Plant]working properly and we were funding it-- 'we' being White Energy through BCBCS to KSC. [emphasis added] 218 Moreover, in Mr Flannery's view, which we accept, BR was content, at least tacitly, to allow BCBCS to fund KSC. Mr Flannery stated:189Foot Note 189×Transcript, 6 January 2017, pp 202 – 205. Q.  Now, you know now, don’t you, if you didn’t at that time, that BR could have stopped anyone from lending the company and could have stopped KSC from spending beyond $100,000 of what it already had and had been approved – yes? A.  It could have, but that would have been totally unreasonable, but it could have. Q.  Thank you. A.  But it didn’t. Q.  It is because you knew, or WEC knew at that time that it could have done any and all of these things that WEC was sending money into KSC on the quiet? A.Oh, no, not at all. They had copies. They had copies of our quarterly reports. Where did they think the money came from? Out of the clouds?They had copies of the report to show that we had exceeded the expenditure in terms of the PLFA. They knew that all the way through. They never asked – Chin never rang and asked, ‘What’s going on here?’ Q.  Do you remember your own case, sir? Your own case is BR would have found out about this in November 2011. Do you want me to show it to you? A.  Yeah, you should show it to me, because I don’t think – is that our case? Q.  It is, sir. A.  That they found out in November 2011. Q.  Our case is we found out about the additional 6 million at the 6 December EGM. WEC’s case is that the number was already in the November board pack. I’m going to show that to you. A.  I’m aware of that. Q.  Thank you. So, therefore, your earlier answer, which is BR knew about it all the time, where did they think the money was coming from, cannot stand, can it, because your own case is the first time documents referred to this additional 6 million was in the November board pack? A.As far as the 6 million is concerned, but not – Q.  Do you agree? A.–as far as overrun was concerned. Q.  You agree as far as the 6 million was concerned; correct? A.  Whatever the figure is, yes. I don’t know whether it was exactly 6, but it was somewhere around that number. Q.  Thank you. After that, WEC never informed BR of the further moneys that they were putting in to KSC; correct? A.  After November? Q.  After early November, 2 and 3 November. A.  We didn’t inform them, no. Q.  Thank you. In other words, 7.1 was breached because you needed their unanimous consent for this further funding, the further expenditure which was about 7 million partially funded by the 6 million, you needed the consent but didn’t get it? A.We didn’t ask for it and they didn’t query it. 219 What we derive from this evidence is that there never was an unambiguous indication from BR that it objected to further unilateral funding. We have instead found at [17] – [18] above that, by 26 April 2011, BR knew that KSC was exceeding its budget and was reminded of this on 15 July 2011. We have also found that BR knew, since June 2010 at the very latest, that BCBCS was funding KSC on its own (see [159] above). As Mr Flannery vividly put it, money does not come from “[o]ut of the clouds”. Mr Singh suggested that BR only learnt that the PLFA had been exceeded by US$6m at the 6 December 2011 EGM. Assuming, contrary to what we have found, that this is correct, that would still not detract from the point that BR knew that BCBCS was unilaterally funding KSC and did not object to it. 220 Subject to BR supplying coal, the evidence is that BCBCS had expressed a willingness to fund KSC, at least until June 2012, even at HBA prices. We have found that, at the Board Meeting on 3 November 2011, Mr Flannery made two proposals to BR, one of which was that KSC could buy and sell coal at the HBA price, with BCBCS funding the shortfall (see [25(b)] above). 221 Cross-examined on this, Mr Flannery stuck to his position:190Foot Note 190×Transcript, 6 January 2017, pp 165 – 166. Q.   … How was it going to happen without their [BR's] funding or agreement to allow funding? A.Well, as far as funding is concerned, we [WEC] would put the money in, we would continue -- this is a joint venture -- we would continue to put the money in, we told them that, they knew that;and the second part of your question is without their agreement, is that what you're saying, they needed to agree to that, to let us put the money in? Q.  You're talking about 2010 when you told them that you would put the money in; correct? A.  No, no, I'm talking about 2011, at this meeting. Q.  Are you saying that at this meeting on 2 and 3 November you, or any representative of WEC, told BR that WEC would put all the funding in, even if BR didn't want to? A.I told them -- I told them at the meeting and it's in my minutes -- it's in my affidavit, I told them at the meetingon the second day after we split and came back the second day on 3 November,'You continue to supply us coal at HBA, you take our coal at HBA and we will continue with this project and try to find you a partner to buy you out.' Q.  Thank you very much. So you were proposing a new arrangement? A.  Well, they were going – Q.  Correct? A.  They were going to blow up the joint venture. Q.  You see, you're not answering my question. I didn't ask you whether they were blowing it up. My question is a simple one. You proposed an altogether new arrangement, which was if the supplied at HBA and bought at HBA, WEC would fund; correct? A.We would continue with the project, at least until June of 2012. [emphasis added] 222 By reason of the foregoing, we do not accept that key assumptions that underpin Mr Singh’s argument have been established. In particular, we find that it has not been established that BCBCS would not have funded KSC unilaterally or that BR would have objected to BCBCS funding KSC unilaterally. 223 Whilst on the current evidence, it seems likely that BCBCS would have been prepared to fund KSC unilaterally and BR would not have objected, we leave open the question whether as a matter of fact BCBCS was in a financial position to fund KSC unilaterally to the completion of testing and commissioning, or until June 2012, or whether BR would have objected to that funding and, if so, what the effect of that objection would have been.. 224 Therefore, we do not think that what we have called Mr Singh’s strike-out argument is made out. We are not convinced that damages would only be nominal. They may or may not be. We are not persuaded that the Plaintiffs did not (and could not have) suffered significant expectation loss by reason of the Defendants’ repudiatory breach on 21 February 2012. In our judgment, a Tranche 3 specifically devoted to causation of damage and quantum cannot be avoided. 225 There are additional difficulties in Mr Singh’s case that we briefly comment on here, principally to flag (by no means exhaustively) issues of causation and loss that may need to be explored in Tranche 3. 226 First, the Defendants’ argument on causation focuses on expectation loss, contending that the Project would never have gotten off the ground due to a lack of funding. But, even if the Defendants’ proposition is correct, there would remain the question whether BCBCS is entitled to claim reliance loss or wasted expenditure. In other words, given the repudiatory breach by BR on 21 February 2012, can BCBCS recover some or all of its investment sunk into KSC? We have heard no submissions on this point, and so we merely raise the question here as a potential issue for Tranche 3. 227 Secondly, the Defendants emphasise BCBCS’ insistence that BR had an obligation under the JV Deed to fund its share of the joint venture. From 29 November 2011, BCBCS began insisting that BR provide funding pursuant to its alleged obligation under the JV Deed (see [45] above). BR refused to do so, maintaining that it had no such obligation under the JV Deed. The Tabang Plant was put into care and maintenance pending (among other matters) resolution of this dispute. The First Judgment established that BR had no obligation to provide funding under the JV Deed. In such circumstances, it is not obvious or self-evident whether (if at all) BCBCS’ wrongful insistence on BR being obliged to provide funding should (as a matter of causation) reduce or negate any damages to which BCBCS might be entitled on account of BR’s repudiation on 21 February 2012. The Defendants may have been arguing that BCBCS’ insistence on BR having an obligation to fund meant that there was contributory wrongdoing on BCBCS’ part and that would have led to any damages due to BCBCS being diminished or extinguished. That proposition may be right or wrong. Since neither party has thoroughly addressed us on this point, this question may likewise have to be explored in Tranche 3. We note in this connection that, contrary to what Mr Singh has submitted, it does not logically follow that, if BCBCS (wrongly) believed that BR was legally obliged by the JV Deed to provide its share of funding, BCBCS was not prepared to fund KSC on its own in any circumstances. In fact, as we have found, BCBCS did in fact put forward proposals to fund KSC on its own, subject to BR complying with its coal supply obligation. 228 Thirdly, the Defendants submit that any lost profit being claimed by BCBCS would not be its own loss, but that of KSC. They invoke the principle against claims for reflective loss to contend that, as a mere shareholder, BCBCS cannot claim compensation for loss suffered by KSC. 229 On the reflective loss principle, we were only referred to a single case:Townsing Henry George v Jenton Overseas Investment Pte Ltd(in liquidation)[2007] 2 SLR(R) 597 (“Townsing”). There, the CA invited the parties to address it on whether the principle of reflective loss was applicable. Chan Sek Keong CJ (“Chan CJ”), delivering the judgment of the court, took the opportunity to review the case law on claims for reflective loss, noting that it had been accepted as good law in Singapore. Chan CJ also mentioned, at [75], the exception to the reflective loss principle identified by Waller LJ inGiles v Rhind[2003] Ch 618 at [34] (“theGiles v Rhindexception”). Ultimately, however, the CA declined to apply the reflective loss principle. This was on the basis that the issue had not been pleaded or canvassed at first instance; thus, Jenton had not had the opportunity to adduce evidence to establish,inter alia, that theGiles v Rhindexception applied: seeTownsingat [85] – [89]. 230 In this case, the Defendants conceded that they did not specifically plead the point on reflective loss; however, in oral closing submissions,191Foot Note 191×Transcript, 20 April 2017, p 81.Mr Singh submitted that it sufficed that the Defendants pleaded para 197(c) of the defence and counterclaim. That pleading states:192Foot Note 192×Defence and Counterclaim (Amendment No 5) at para 197(c). 197. As regards 59G of the Statement of Claim: … (c) In any event, BCBCShas no basis in lawto claim the loss and damage pleaded in paragraph 59G of the Statement of Claim; We do not agree that this pleading was adequate. In any event, we consider that to apply that principle at this stage would unfairly deny BCBS the opportunity to adduce evidence in Tranche 3 that the loss for which it claims is not reflective, or that, if it is reflective, the loss falls within theGiles v Rhindexception. 231 On the law relating to reflective loss, we note that, after the decision inTownsing, the Hong Kong Court of Final Appeal delivered its judgment inWaddington Ltd v Chan Chun Hoo Thomas and others[2009] 2 BCLC 82 (“Waddington”). In that case, Lord Millett NPJ observed, and the other Court of Final Appeal judges agreed, thatGiles v Rhindhad been wrongly decided and the exception found there did not actually exist: seeWaddingtonat [1] – [3] and  [88]. Neither party addressed us on whetherWaddingtonhas any bearing on theGiles v Rhindexception as a matter of Singapore law. Thus, if the reflective loss argument is seriously to be pursued, the relevant evidence and law will have to be considered in greater detail in Tranche 3. 232 Finally, the Defendants were dismissive of BCBCS’ claim for damages predicated on what might have happened pursuant to the Expansion MOU.193Foot Note 193×Defendants’ Closing Submissions at paras 180 – 182.Mr Singh’s point was that the Expansion MOU gave BR the right, but not the obligation, to develop coal upgrading plants to an agreed capacity of 15 MTPA using BCBCS’ briquetting technology. That may or may not be valid. Again, in our view, this issue should be left to Tranche 3 to allow BCBCS an opportunity to make submissions and adduce such evidence as it deems appropriate on the relevance of the Expansion MOU to damages. 233 The net result is that there will have to be a Tranche 3. We are unable at this stage to answer Issue 9 (as formulated by the Defendants) in the Defendants’ favour by holding that damages would be nil or nominal. We do not believe that such conclusion is plain and obvious on the materials before us at present. For similar reasons, we are unable to answer Issue 9 as formulated by the Plaintiffs. Issue 9 will have to be left to Tranche 3, at which time the validity of the assumption that commercial production of 1 MTPA could be attained will itself require examination.",
        "Issues 10 and 11": "234 Issues 10 and 11 are as follows:- 10.  If the answer to Issue 9 is yes, whether BCBCS suffered loss and damage in the form of: (i)  loss of profits based on a projected production capacity of 1, 3 or 5 MTPA; or (ii)  wasted expenditure, and what is the appropriate quantum of damages BCBCS is entitled to? 11.  What are the costs orders that should be made in respect of the entire trial of the matter? 235 It follows from our findings and discussion above that Issues 10 and 11 can also only be dealt with in Tranche 3.",
        "Conclusion": "236 In summary, our answers to the issues in Tranche 2 are as follows: (a) Issue 1 – Under Art 7.1 of the PLFA and cl 3.8(b)(iii) of the JV Deed, BR hadprima facieobligations to ensure that Bara and FSP supplied coal to KSC in accordance with cl 3.9 of the 2010 CSAs. The obligation under Art 7.1 of the PLFA expired on 31 December 2011, while the obligation under cl 3.8(b)(iii) of the JV Deed persisted until  the JV Deed was terminated on 2 March 2012 (see [77] above). (b) Issue 2(i) – By November 2011, the Coal Briquette Processing Plant Commissioning had not been achieved. The commissioning was in the modification works phase; however, the phases of commissioning which required coal were imminent (see [85] above). (c) Issue 2(ii) – No (see [94] above). (d) Issue 2(iii) – Yes (see [106] above). (e) Issue 2(iv) – Yes (see [117] above). (f) Issue 2(v) – Yes (see [127] above). (g) Issue 2(vi) – This issue does not arise (see [129] above). (h) Issue 3(i) – No (see [132] above). (i) Issue 3(ii) – Yes (see [134] above). (j) Issue 4(i) – Yes (see [138] above). (k) Issue 4(ii) – Yes (see [141] above). (l) Issue 4(iii) – Yes (see [144] above). (m) Issue 5(i) – No (see [162] above). (n) Issue 5(ii) – No (see [170] above). (o) Issue 5(iii) – This issue has fallen away (see [146] above). (p) Issues 5(iv) and 5(v) – No (see [172] above). (q) Issue 5(vi) – No (see [177] above). (r) Issue 6 – This issue does not arise (see [179] above). (s) Issue 7(i) – BR was in repudiatory breach of the JV Deed, but this breach was writ in water because BCBCS did not purport to accept BR’s breaches (see [182] and [183] above). (t) Issue 7(ii) – No (see [192] above). (u) Issue 7(iii) – Yes (see [193] above). (v) Issue 8 – Yes (see [195] above). (w) Issues 9, 10 and 11 – We are unable to answer these issues in Tranche 2. These issues will have to be left to Tranche 3 (see [233] and [235] above). 237 Subject to the parties’ availability, a CMC for Tranche 3 will be fixed within 28 days of the date of this judgment.   Quentin Loh         Vivian Ramsey        Anselmo ReyesJudgeInternational Judge      International Judge  Francis Xavier SC, Jeremy Gan, Alina Chia, Tng Sheng Rong, Ang Tze Phern, Tee Su Mien and Vinna Yip (Rajah & Tann LLP) for the plaintiffs;Davinder Singh SC, Tony Yeo, Jaikanth Shankar, Chan Yong Wei, Lydia Ni, Harsharan Kaur and Jerrie Tan (Drew & Napier LLC) for the defendants."
    }
}