{
    "case_title": "Public Prosecutor vTan Lye Heng",
    "ncitation": "[2017] SGHC 146",
    "coram": "Steven Chong JA",
    "sections": {
        "Introduction": "1 This is an appeal by the Prosecution against the acquittal of the respondent in respect of the following charge:1Foot Note 1×ROP vol 1, p 4. You, TAN LYE HENG … are charged that you, on 27 January 2015, at or about 9.30am, at Block 124 Kim Tian Place #07-195 Singapore, did traffic in a Class A controlled drug listed in the First Schedule to the Misuse of Drugs Act (Cap 185, 2008 Rev Ed), to wit, byhaving in your possession for the purposes of traffickingsix (06) packetsof granular/powdery substance, which on analysis wasfound to contain not less than 11.95g ofdiamorphine, which possession was without authorisation under the said Act or the Regulations thereunder, and you have thereby committed an offence under s 5(1)(a) read with s 5(2) of the said Act, which is punishable under s 33(1) of the said Act read with the Second Schedule to the said Act. [emphasis added] 2 Following a six-day trial, the District Judge (“the Trial Judge”) acquitted the respondent under somewhat unusual circumstances. Specifically, he reversed his earlier decision to admit the respondent’s statements after avoirdire. It is accepted that a trial judge has a discretion, and indeed a continuing duty, throughout the trial to assess the evidence and to reconsider his decision to admit statements if further evidence that raises doubts about their admissibility emerges during the trial. However, if he decides to exclude statements previously admitted, it is incumbent on him to explain what new evidence caused him to change his decision, how it impacted on his earlier finding as regards the voluntariness of the statements, why that evidence, if new, was not adduced during thevoirdireand the consequences of his reversal in relation to theotherevidence before the court. 3 In addition to the respondent’s statements, the Prosecution also relied on the presumption under s 18(1)(c) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”). It is common ground that the respondent had possession of the keys to the premises at which the drugs which formed the subject matter of the charge were found. It is also common ground that he was neither the owner nor tenant but merely an occasional visitor to the premises. This judgment will examine whether the application of the presumption is in any way dependent on the legal status of the person in possession of the keysvis-à-visthe premises and how it operates in the context where several persons have possession of the keys to the premises.",
        "Background facts": "4 The material undisputed facts are as follows. The respondent resided with his mother in a flat at Yung Sheng Road (“the Yung Sheng flat”). On 27 January 2015, at about 3.45pm, he was arrested at the lift lobby of his block of flats by officers from the Central Narcotics Bureau (“the CNB”). Drugs were found in his pocket and in the Yung Sheng flat. The respondent did not dispute that the drugs found there belonged to him and has been separately charged and sentenced in respect of those drugs. 5 In addition, a set of keys was found in the Yung Sheng flat. These keys granted access to a flat belonging to one Sim Chiew Hoon (“Sim”) at Kim Tian Place (“the Kim Tian flat”). Earlier the same morning, CNB officers had arrested Sim and seized drugs from various locations in the Kim Tian flat. 6 It is undisputed that some of the drugs found at the Kim Tian flat belonged to Sim. She pleaded guilty to charges relating to the drugs admittedly belonging to her and was serving sentence when she gave evidence as a prosecution witness in the respondent’s trial. 7 The trafficking charge faced by the respondent in the trial below related to six packets found in the Kim Tian flat which were analysed to contain not less than 11.95g of diamorphine in total. These were specifically: (a) two packets of white granular/powdery substance (“H1A1”) and two packets of brown granular/powdery substance (“H1A2”), all found in a paper box in a plastic bag on the bedroom floor in front of the cupboard; and (b) one large packet and one small packet of brown granular/powdery substance (“K1A”) found in the last drawer of the cupboard along with other drug exhibits. (Collectively, “the disputed drugs”) 8 It was the Prosecution’s case, as well as Sim’s evidence, that the disputed drugs belonged to the respondent for the purposes of trafficking. The respondent did not dispute that he trafficked in drugs and that Sim had given him a set of keys to the Kim Tian flat. He also admitted to consuming drugs together with Sim in the Kim Tian flat now and then. However, he denied that the disputed drugs belonged to him, despite having admitted so in statements given to CNB officers in the course of investigations. Thus, the primary issue at the trial was whether the respondent was in possession of the disputed drugs.",
        "The disputed statements": "9 In the trial below, three investigation statements given by the respondent in the course of the CNB’s investigations were initially admitted as evidence after avoirdirein which the respondent unsuccessfully claimed that the statements were made as a result of a threat, inducement or promise (“TIP”) by the investigating officer, Mr Yeo Wee Beng (“the IO”). As the Prosecution’s appeal turns on the admissibility of these statements and the admissions contained within, the contents of these statements are of vital importance. 10   In the first statement dated 4 February 2015 (“Statement 1”), the respondent provided some background about himself and his drug activities.2Foot Note 2×ROP vol 2, pp 28–32.He admitted that all the drugs found inside his room in the Yung Sheng flat belonged to him and were variously intended for his own consumption or for sale. He elaborated that his drug supplier went by the name of “Ah Boon”. It is crucial to underscore that Statement 1 contained nothing about the drugs found at the Kim Tian flat and to whom they belonged. In Statement 1, the respondent merely explained that a set of keys found in the Yung Sheng flat belonged to Sim, who “had given [him] the keys to her house so that whenever [he] wanted to go up to smoke ‘leng eh’ [ie, ice or methamphetamine] and ‘liao’ [ie,heroin which contains diamorphine], [he] need not have to call her or bother her”.3Foot Note 3×ROP vol 2, p 30 at para 7. 11 The second statement was recorded two days later on 6 February 2015 (“Statement 2”). It picked up the narrative of the day of the respondent’s arrest from the time when he was escorted by CNB officers from the Yung Sheng flat to the Kim Tian flat. In Statement 2, he stated that he had repeatedly informed the CNB officers at the Kim Tian flat that he “did not know” to whom the drugs inside the Kim Tian flat belonged.4Foot Note 4×ROP vol 2, p 33 at para 17.The respondent went on to provide details of his acquaintance with Sim. He was introduced to Sim by a fellow drug addict and began supplying her with heroin and ice. Over time, they became “good friends” and he began visiting her frequently at the Kim Tian flat where they would smoke heroin and ice together.5Foot Note 5×ROP vol 2, p 35 at para 23.Sometimes, the respondent would bring heroin and ice to the Kim Tian flat to repack into smaller packets for sale. 12 When he was released on police bail in October 2014 following an earlier arrest, Sim gave him a set of keys to the Kim Tian flat so that he could “stay at her house if [he] wanted” to.6Foot Note 6×ROP vol 2, p 35 at para 23.The respondent gave a few reasons for his frequent visits to the Kim Tian flat. First, “there was no one at her house”. Second, while he was on police bail, he “did not want to go home because [he] was afraid that police might come to [his] house”. Third, he “did not want [his] mother to grumble” about his drug activities. 13 The respondent recounted that on 25 January 2015, two days before his arrest, he left the Kim Tian flat in the morning to first deliver drugs to his clients. He then met Ah Boon in the vicinity of Boon Lay Shopping Centre to pick up an order of one pound of heroin. This order was delivered to him in a box in a plastic bag.7Foot Note 7×ROP vol 2, p 36 at para 25.After this, he headed to the Kim Tian flat. There, he opened up the box, took out one packet of heroin and repacked it into a few smaller packets which he carried with him when he left the Kim Tian flat. The remaining heroin was left in the plastic bag at the Kim Tian flat.8Foot Note 8×ROP vol 2, p 36 at para 26.He had intended to return the next day to repack the heroin but was too tired to do so. 14 In a third statement recorded on 8 February 2015 (“Statement 3”), the respondent was shown photographs of various exhibits seized from the Yung Sheng flat and the Kim Tian flat. He identified the plastic bag and paper box in which the CNB officers found H1A1 and H1A2 as the plastic bag and box containing the order he picked up from Ah Boon on 25 January 2015. The two packets of heroin labelled H1A1 were identified as the remainder of the one pound that he had obtained from Ah Boon.9Foot Note 9×ROP vol 2, p 39 at para 55.Though Statement 3 records that he was shown a photograph of H1A2, no comments by the respondent on H1A2 were recorded. 15 The respondent also admitted that the two packets of heroin labelled K1A belonged to him and were meant for sale.10Foot Note 10×ROP vol 2, p 40 at para 57.He explained that these were the drugs which Sim said she had placed in the drawer for him along with other drugs of hers when he was rushing out of the Kim Tian flat on 25 January 2015. In relation to several other drug exhibits found at the Kim Tian flat, the respondent claimed they belonged to Sim and that he “knew what were the drugs [he] had put at [the Kim Tian flat]”.11Foot Note 11×ROP vol 2, p 40 at para 57.",
        "Proceedings below": "16  The Prosecution’s case was that the disputed drugs were in the respondent’s possession for the purposes of trafficking. They relied on the presumptions of possession and knowledge in ss 18(1) and 18(2) of the MDA and argued that the respondent had failed to rebut the presumptions on a balance of probabilities. Besides the admissions made in the three statements above, the Prosecution relied on evidence given by Sim that the disputed drugs belonged to the respondent. 17 In his defence, the respondent denied his admissions in the statements, repeating that he was induced by the IO into admitting to specific drug exhibits. He claimed that he was not the one who brought the plastic bag containing H1A1 and H1A2 into the Kim Tian flat. 18 The Trial Judge found that the respondent was not in possession of the disputed drugs and acquitted him. In particular, he reversed his earlier decision to admit the respondent’s statements as evidence. I will examine his precise reasons for doing so in greater detail below, but in gist, he found that the respondent’s defence about the statement-recording process being an “exercise of filling in the blanks” raised reasonable doubt about the voluntariness of the statements.12Foot Note 12×Grounds of Decision (“the GD”) at [35] and [38]. 19 The Trial Judge also expressed serious doubts about the reliability of Sim’s testimony and reasoned that Sim’s account to the CNB officers may have inaccurately influenced the way that the respondent was questioned during investigations. He stressed that Sim took the “convenient position” of claiming that larger packets of drugs, such as the disputed drugs, belonged to the respondent, while only smaller packets belonged to her.13Foot Note 13×GD at [25].He also found that Sim “did not specifically testify that she saw the [respondent] bring the [disputed] drugs… to [the Kim Tian flat]” and concluded that Sim did not actually see him do so.14Foot Note 14×GD at [26].The Trial Judge also highlighted a material inconsistency in her testimony when she went further to claim that all the drugs belonging to her were kept only in her bag and not in the Kim Tian flat.15Foot Note 15×GD at [25].This was viewed as a self-serving attempt to attribute even more quantities of drugs to the respondent despite having pleaded guilty to charges in relation to some drugs located in the Kim Tian flat. Furthermore, the DNA evidence showed that Sim had handled the digital weighing scale seized from the Kim Tian flat and the plastic bag in which H1A1 and H1A2 were found. 20 In contrast, the Trial Judge found the respondent’s defence to be credible and entirely believable. He accepted that it made no sense for the respondent to store valuable drugs in the Kim Tian flat because Sim was a drug addict and would have helped herself to the drugs. The Trial Judge also accepted that the respondent only consumed drugs at the Kim Tian flat and neither repacked nor stored drugs for sale there except when he was repacking drugs for sale directly to Sim. It was unnecessary for the respondent to carry drugs all the way to the Kim Tian flat for repacking as it could be done relatively quickly in the Yung Sheng flat without his mother’s detection. 21 Having rejected Sim’s testimony and excluded the respondent’s statements, the Trial Judge concluded that there was little or no evidence to link the disputed drugs to the respondent. In fact, even if the presumptions under ss 18(1) and 18(2) of the MDA were triggered, the Trial Judge took the view that the respondent had successfully rebutted the presumptions on a balance of probabilities. Accordingly, the respondent was acquitted.",
        "The Prosecution’s appeal": "22 The Prosecution appeals on essentially the following grounds: (a) The Trial Judge erred in reversing his decision to admit the respondent’s statements. Specifically, contrary to the Trial Judge’s finding, the respondent did not furnish new evidence about his allegations of involuntariness when his defence was called. It was also an error to rely on Sim’s evidence, which had no bearing on the issue of voluntariness, to exclude the statements. (b) The Trial Judge erred in failing to give due weight to Sim’s credible evidence and in accepting the respondent’s unconvincing evidence. (c) The Trial Judge erred in finding that the respondent had rebutted the presumption of possession under s 18(1)(c) of the MDA. 23 I will deal first with the issue of admissibility of the statements.",
        "Reversal of decision to admit statements": "",
        "The law": "24 It is clear that a trial judge has a discretion, and indeed a duty, throughout the trial to reconsider his decision to admit statements given by an accused if further evidence emerges that raises doubt about their admissibility. Sections 279(7) and 279(8) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”) contemplate the possibility of a court reversing an earlier decision to admit evidence: Procedure to determine admissibility of evidence 279.— … (7)If the court, after hearing evidence in the main trial, is doubtful about the correctness of its earlier decisionwhether or not to admit the evidence at the ancillary hearing, it may call on the prosecution and the defence to make further submissions. (8)  If the court, after hearing any submissions, decides toreverse its earlier decision in admitting the evidence, it shall disregard such evidence when determining whether or not to call for the defence or when determining the guilt or otherwise of the accused. [emphasis added] 25 The principles guiding the exercise of such a discretion were examined inRegina v Watson (Campbell)[1980] 1 WLR 991 (“Watson (Campbell)”). During the trial within a trial, the accused gave evidence that his admissions had been concocted by the police officers and he was induced against his will to sign the statements by promises of favour (namely, that he would be given bail, that no charge would arise from one shotgun found in his possession, and that only a less serious charge would proceed against his co-habitee). The judge ruled after the trial within a trial that the statements were voluntary and admissible. 26 During the main trial, further evidence emerged which the defendant’s counsel contended was inconsistent with that given during the trial within a trial. This related to the issue of whether the police officers had promised to turn a blind eye to the evidence implicating the accused’s co-habitee to more serious offences. The further evidence arose from the cross-examination of a police officer by the co-habitee’s counsel (who was not involved in thevoirdire). The judge held he had no power to reconsider his earlier ruling and convicted the defendant. 27 On appeal, the English Court of Appeal held that the trial judge retained throughout the trial the power to reconsider the admissibility of evidence upon which he had already ruled. Thus, he should have considered the submission that the further evidence indicated the statements were involuntary, although the appeal ultimately failed on its merits. Cumming-Bruce LJ explained the relevant principles as follows at 994–995: In our view the judge was wrong to rule as he evidently did that he had no power to consider the relevance of evidence, given after the trial within a trial, upon the issue whether the written statements were not voluntary and therefore inadmissible. He should have allowed counsel to develop his submission and should have ruled upon its merits. It is the duty of the judge to exclude from the jury’s consideration evidence which is inadmissible.In the case of a written statement, made or signed by the accused, the judge must be satisfied that the prosecution have proved that the contested statement was voluntary, before allowing the jury to decide whether to act upon it.Experience has shown that where the question of the voluntary character of a statement has been investigated and decided at a trial within a trial, it is only in very rare and unusual cases that further evidence later emerges which may cause the judge to reconsider the question whetherhe is still satisfied that the statement was voluntary and admissible. But where there is such further evidence, the judge has power to consider the relevance of the admissibility of evidence upon which he has already ruled. … The matter is discussed inCross on Evidence, 5th ed. (1979), p. 72 in which reference is made toReg. v Murphy: \"The judge retains his control over the evidence ultimately to be submitted to the jury throughout the trial. Accordingly, if, having admitted a confession as voluntary on evidence given in the absence of the jury,the judge concludes, in the light of subsequent evidence, that the confession was not voluntary, he may either direct the jury to disregard it, or, where there is no other sufficient evidence against the accused, direct an acquittal, or, presumably, direct a new trial.\" We accept the accuracy of this statement of the law. [emphasis added] 28Watson (Campbell)also affirmed (at 994) the following helpful passage from the Northern Irish case ofRegina v Murphy[1965] NI 138 (“Murphy”)(at 143) which clarifies that justice requires the court to revisit the issue of admissibility if the confessions are later shown to be clearly involuntary: Is the discretion spent once it has been exercised against the accused and the evidence has been admitted? We are not aware of any authority on this question, but on general principles we are of opinion that the court's discretionary powers are not necessarily at an end when the relevant evidence has been admitted.Sometimes the true bearing of evidence said to operate unfairly against an accused person may only appear clearly to do so when seen in the light of evidence adduced at a later stage of the trial and after the material objected to has become part of the record.To say that it is then too late to reconsider the objection would, we think, be to run the risk of letting the technicalities of the situation prevail over the requirements of justice. The admission of a confession as voluntary, on evidence heard in the absence of the jury,may be shown by subsequent evidence to have been clearly involuntary and therefore inadmissible. In such circumstances we consider it would undoubtedly be within the province of the court either to instruct the jury to disregard the evidence as no longer admissible or, in the absence of other evidence capable of sustaining the charge, to direct an acquittal. If this is right, we can see no reason for making a distinction between what becomes inadmissible after being thought admissible and what is seen to be unfair after an earlier view to the contrary. We are, therefore, of opinion that the discretion under discussion may, in certain circumstances, properly be the subject of reconsideration. [emphasis added] 29 Based on the foregoing, the decision to admit evidence should be reconsidered wherefurther or subsequent evidencehas emerged in the course of the main trial whichraises doubtaboutwhether the statement was voluntary. This further evidence should not betenuous, as the English Court of Appeal cautioned inWatson (Campbell)at 995: … We would emphasise that though as a matter of law the judge has throughout a trial the responsibility of doing what is practicable to prevent a jury acting upon evidence which the judge holds, or should hold, to be inadmissible,the occasions on which a judge should allow counsel to invite him to reconsider a ruling already made are likely to be extremely rare.Judges should continue to discourage counsel from making submissions of law founded on atenuous evidential base. [emphasis added] 30 InGohJoon Tong and another v Public Prosecutor[1995] 3 SLR(R) 90, the Court of Appeal accepted the principles inWatson (Campbell)andMurphy. The issue there was whether the trial judge could use evidence obtained in onevoirdirein anothervoirdire. In the course of examining the authorities on this issue, the following propositions were thought to be uncontroversial (at [33]): … We do not disagree with what was said inR v MurphyandR v Watson. Where a statement (including a confession) of an accused has been admitted in evidence on the ground that it has been made voluntarily (in the sense we have previously stated) andsubsequent evidence adduced raises some doubt as to the voluntariness in the making of such statement, clearly the trial judge in such an event, notwithstanding that such statement has been admitted in evidence,would be entitled to attach little or no weight to the statement and accordingly would not treat it as part of the substantive evidence in the main trial. It may be thought this is overly in favour of the accused … That may be so. But the rationale or the purpose for such an approach is to guard against any impropriety of the investigating authorities in obtaining a statement from the accused. [emphasis added] 31 A case that is more on point isNeo AhSoi v Public Prosecutor[1996] 1 SLR(R) 199 (“Neo AhSoi”), where Yong Pung How CJ applied these principles in an appeal to disregard statements that had been admitted by the trial judge. Avoirdirehad been held before the trial judge to determine the issue of admissibility. The evidence given at thevoirdireand the subsequent evidence at the trial will be recounted in some detail to illustrate the kind of evidence which may prompt a court to reconsider the issue of admissibility. 32 InNeo AhSoi, the accused had confessed in three statements to 23 counts of cheating by dishonestly inducing a supplier into believing that he would honour payment for purchasing goods when he had no intention to do so. During thevoirdire, the officer gave evidence of the dates and times when the confessions were recorded, the initial charges and the reduced charges after his confessions. The interpreter gave evidence that neither she nor the officer had made any TIP during the recording of the confessions and the accused nodded his head when the confessions were read back to him. The accused alleged that the officer made a number of threats and inducements as a result of which he signed the confessions. At the end of thevoirdire, the trial judge held that the confessions were voluntarily given, finding that the accused lied because he did not understand English and could not have understood any alleged threats made by the officer. It is crucial to note that on appeal, Yong CJ found that the trial judge’s finding at the end of thevoirdire could not be faultedand should not be disturbed (at [15]). 33 However, Yong CJ found that “once the confessions were admitted, it ought to have become clear that their contents gave rise to serious doubts about their voluntariness” (at [16]). In other words, his decision on appeal to disregard the confessions turned entirely on evidence that emerged after thevoirdire. In particular, doubts were raised by thecontentsof the confessions. First, the exact words “although I had no intention to pay” were parroted 23 times. Not only was it irrational that a person would condemn himself unequivocally 23 times in one confession, the refrain related precisely to the sole issue that was likely to be disputed at the trial (namely proof of intention). Second, the officer had included a bolded heading, “Decision not to make any payment to suppliers”, purportedly because he had interviewed the accused previously and knew he would confess. In Yong CJ’s view, this gave the impression that the officer had already made up his mind even before the confession was recorded. The confession should therefore have been disregarded, as Yong CJ explained at [21]: No doubt, as was said inR v Watson (Campbell), such an occurrence is rare.However, there can be no better example than when involuntariness appears from the very content of the confession.In my view, a trial judge’s duty to scrutinise the voluntariness of any statement made by an accused does not end upon a decision on thevoirdire. The trial judge should remain alert to any indication that the statement may have been made involuntarily even after thevoirdire. The contents of the confessions in this case were undoubtedly odd, to say the least. With the greatest respect to the learned district judge, it seemed to me apparent that the confessions in this case were not something which the court could rely on to any extent. The learned district judge ought to have disregarded it even though it had been admitted in evidence. As there was no other evidence of the appellant’s alleged intention not to pay at all for the goods, the learned district judge ought to have acquitted the appellant on all the charges. [emphasis added] 34 Another instance in which a trial judge reassessed the voluntariness of a statement admitted in evidence after avoirdireoccurred inPublic Prosecutor v Mustaffa bin Ahmad[1986] 1 MLJ 302 (“Mustaffa”). The accused had been charged with possession of firearms under the now-repealed Internal Security Act 1960 (Act 82, revised 1972) (M’sia). At the trial within a trial, the accused alleged that two days before the statement was recorded, two or three officers promised to charge him under an outdated non-capital charge if he made a statement implicating two named officers as the source of his firearms. He also alleged that on the day the statement was recorded, the recording officer reminded him to include what he had been instructed to say two days earlier. The statement was admitted because the trial judge found that there had not been any TIP. By the end of the trial, however, the trial judge was no longer satisfied beyond reasonable doubt that the statement was voluntarily made by the accused and accorded no weight to its contents. 35 Three reasons were given by the trial judge inMustaffafor this decision. First, the accused’s evidence had “as a whole … become more reliable” after the trial judge had accepted his evidence on a number of important facts in preference to other witnesses. Second, the contents of the statement cast doubt on the evidence of the investigation officer during thevoirdire; it recorded that the accused was cautioned that he had committed an offence for possessing the pistol and ammunition without a licence, but was not cautioned that he had committed a capital offence as the investigation officer had testified. This in turn affected the credibility of the investigation officer and lent credence to the accused’s claim that he was promised a lesser non-capital charge. Third, in the light of the trial judge’s reassessment of the relative credibility of the various witnesses, it now became “very significant” that the statement was only recorded a few days after the arrest and the accused had given evidence contrary to the statement at a co-accused’s trial. In other words, the further evidence that emerged in the main trial consisted of (a) the accused’s evidence on other facts; and (b) the contents of the statement. This case demonstrates that the question of voluntariness can be revisited not only because of further direct evidence of a TIP, but also because further evidence has prompted a reassessment of the credibility of witnesses who gave evidence at the trial within a trial. 36 To summarise, where a judge, having admitted a confession as voluntary based on evidence given at avoirdire, later decides that in the light of subsequent evidence the statement was not voluntary, he retains the discretion to disregard it or, where there is no other sufficient evidence against the accused, to direct an acquittal. To prompt a reconsideration, there must be further or new evidence adduced at a later stage which was not raised during thevoirdireand which raises doubt about the voluntariness of the statements.",
        "The alleged operative inducement": "37 Turning to the case before me, to evaluate if the Trial Judge erred in reversing his decision to admit the statements, it is necessary to first examine the operative inducement which the respondent had purportedly relied on and the Trial Judge’s initial reasons for admitting the statements, and thereafter to consider his reasons for his reversal and whatfurther evidencewas raised at the trial that was not raised during thevoirdire. 38 In all, the respondent made three allegations of TIP by the IO during the recording of his statements. These were: (a) first, that if the drug exhibits were found to contain less than 30g of diamorphine, he would be charged with trafficking 14.99g;(b) second, that if the drug exhibits were found to contain more than 10g of diamorphine, he would be charged with trafficking 9.99g; and(c) finally, that if the respondent’s DNA was not found on the drug exhibits, Sim would be charged for trafficking them instead. 39 The following excerpt from the transcript of thevoirdirecaptures the specific allegations put to the IO by the respondent and the IO’s categorical denial of the same:16Foot Note 16×ROP vol 1, pp 50–52 (NE 15/08/16, pp 35:28–37:23). Q I did say that---I did ask you whether you wanted me to take the rap. A No, Your Honour. … Q Okay, I did tell the IO that he was making me take the rap, the seized items was heroin, what happens if it exceeds the limit? A No, Your Honour. QYou did tell me that it was – if it was analysed and found to be less than 30, 3-0, you would offer me 14.99. A No, Your Honour. Q Before that, I already told you that the items were not mine and my fingerprint was not found on it. A No, Your Honour. QYou did tell me if it was above 10 gram, you would offer me 9.99? A I told him that I can’t make the decision. Q That was not what you said at that time. That was only subsequently when you told me to sign the fresh charges. A No, Your Honour. Q That was not what you said during the recording of the statement. A No, Your Honour. QLastly, I stress to you that my fingerprint was not found. You told me that if eventually my---after the DNA test was carried out and my fingerprint was not found, you would be chargingSim. A No, Your Honour. QThat was why I admitted---that was why I gave a positive statement. A That’s not true, Your Honour. … Tan: I wish to emphasise that during the recording of the first statement, he had already induced me. … Q Okay, the statement that was taken on the 6th, we spent 2 hours and 40 minutes on it. … Q Time was spent on the inducement. Much time was spent on the inducement. A No, Your Honour. [emphasis in bold added] 40 From the above exchange, it appears that of his three allegations, the respondent was claiming that the operative inducement was theIOinforming him that if the DNA test results were negative, Sim would be charged for the drugs instead of him. At the appeal hearing, I specifically asked the respondent to confirm whether theonlyreason he admitted to the drugs was because the IO informed him that Sim would be charged if his DNA was not found on the disputed drugs. The respondent replied in the affirmative. It is critical to appreciate that this was the inducement which allegedly caused the respondent to make the admissions – or in the respondent’s own words, “[t]hat was why I admitted”. Identifying the operative inducement is key because the inquiry as to whether the IO made a TIP must be properly focused on the allegation thatthisoperative inducementwas offered to the respondent. The alleged promises of a lesser charge were, by the respondent’s own account, insufficient to induce him to confess. 41 In fact, under cross-examination by the Prosecution, the respondentdeniedthat he was willing to take the offer of a lesser charge for trafficking 9.99g of diamorphine if the actual quantity was found to be above 10g. In other words, the alleged offer of the lesser charge did not cause him to admit to the ownership of the disputed drugs, as evidenced by the following excerpt from the Prosecution’s cross-examination of the respondent:17Foot Note 17×ROP vol 1, p 57 (NE 15/08/16, p 42:12–22). Q … [W]hen the IO then after that asked you---or rather, you said that the IO then tell you that he can offer you 14.99 grams if it’s 30 grams, correct? A Correct. Q And thereafter you also said that he would then offer you 9.99 if you---if the amount was 10 grams? A Yes. Q And you were willing to take that offer if that was the case? ANo, be---eventually I told him that if the DNA result is negative---he told me if the DNA test is negative, he would charge Sim instead.Under such circumstances, then only I admitted. [emphasis added] 42 When the Prosecution went on to suggest that the alleged bargaining for a lesser charge only operated on his mindafterhe had decided to confess, the respondent did not deny that he was making such strategic calculations:18Foot Note 18×ROP vol 1, pp 59–60 (NE 15/08/16, pp 44:12–45:14). A … The IO said that if the DNA result is negative, she would instead charge Sim Chiew Hoon. Q Which means he would then--- AThat was why I admitted. … Q During the time of the recording, it was---you could have said that, “I don’t want to admit now and I want to wait for the DNA report”, is that correct? A I was not aware of that. Q So because of that, you just decided, “I will just admit straightaway in that case”? A Correct. Q And in that---after that you then decided to bargain and decide whether it’s 10 years or 20 years? AIf it’s 10 years, then the offer would be 9.9. It would not be so heavy.I’m also facing enhanced trafficking now. … Q Let me just put it straight. You are very sure you never do---those items don’t belong to you, correct? A Yes, very sure. QBut if he had said that he would only be proceeding with 9.95 gram, you would actually be ready to admit, is that true? AAt that moment, that was my mentality.Now, he has changed his mind. … Q But to confirm at that point of time you initially thought---you initially believed that, “I didn’t do it”, correct?Andthen after that when the bargaining start, you decided, “I’m willing to admit to 10 years”? AYes, but you must reduce it to 9.9 at that time.He did not honour his words. [emphasis added] Even though the respondent seemed to agree at one point in the above exchange that his admissions were induced by the promise of a charge for trafficking 9.99g of diamorphine, the context of this line of questioning shows that the respondent was only concerned about the precise charge he would faceafterhe decided to confess. It does not alter my assessment that the operative inducement which persuaded him to confess was the alleged promise to charge Sim instead if the respondent’s DNA was not found on the exhibits. The evidence at thevoirdiresimply did not support the respondent’s claim that the operative inducement extended to the promises of a lesser charge. 43 Having identified the operative inducement, it becomes obvious upon reflection that it is an inherently incredible claim. If the IO had said what the respondent claimed he did,ie, that Sim would be charged instead if the respondent’s DNA was not found on the drugs, there was no cause for the respondent to respond in that scenario at all. Nothing in this promise required him to admit to owning the disputed drugs – the respondent’s compliance formed no part of the bargain. Equally, nothing in the alleged operative inducement would have persuaded him to admit to the disputed drugs if he did not in fact own them. For this reason, the respondent’s reaction makes no sense. If the drugs truly did not belong to him and the DNA test results were negative, why would the prospect ofnot being chargedat allpersuade him to give anincriminatingstatement? 44 In the light of the excerpts quoted above, I wish to make a few more observations about the evidence given at thevoirdire. First of all, I find it curious that the alleged inducement originated from an unsolicited offer by the respondent to “take the rap”. This suggests to me that it was the respondent who proactively initiated the bargaining process with the IO, which, if true, ought to raise suspicions about the veracity of the respondent’s claims that he was induced. 45 Second, it is relevant to consider the timing of the alleged inducements. The respondent claimed that the IO made the three alleged inducements even during the recording of Statement 1. This makes no sense because Statement 1 related to items seized from the Yung Sheng flat and contained absolutely no details about the drugs at the Kim Tian flat. Further, the drugs that the respondent confessed to possessing and selling in Statement 1 formed the subject of charges he has since pleaded guilty to. Therefore by his own course of conduct, the respondent does not challenge the voluntariness of his confessions in Statement 1. I find it altogether very improbable that the IO would induce the respondent to make confessions in relation to drugs found at the Kim Tian flat, only to then record a statement that is silent regarding those drugs and that includes only undisputed confessions. The admissibility of Statement 2 and Statement 3 cannot sensibly be challenged on the basis of inducements offered for Statement 1. 46 In relation to Statement 2, the respondent claimed that “much time” was spent by the IO making “the same” inducements.19Foot Note 19×ROP vol 1, p 52 (NE 15/08/16, p 37:12–26).This is the more pertinent allegation since Statement 2 recorded the respondent’s admissions to storing and packing drugs at the Kim Tian flat and volunteered details about the packaging and source of H1A1 and H1A2. However it is important to note that in relation to Statement 3 – the most incriminating of the three statements – the respondent was certain that “there was no inducement”.20Foot Note 20×ROP vol 1, p 53 (NE 15/08/16, p 38:1–18).According to him, it was unnecessary for the IO to offer further inducements for Statement 3 “because [the respondent] had already cooperated with him and admitted”.21Foot Note 21×ROP vol 1, p 53 (NE 15/08/16, p 38:11−12). 47 Third, it appears from the IO’s evidence under cross-examination that the alleged bargaining did occur but it was the respondent who proactively initiated it. When it was put to the IO that he offered to charge the respondent for 9.99g if the quantity of diamorphine was above 10g, the IO responded, “I told him that I can’t make the decision”.22Foot Note 22×ROP vol 1, p 51 (NE 15/08/16, p 36:16).In other words, the IO acknowledged that therespondentdid make the suggestion but he (the IO) said he could not make such a promise. 48 In view of the inherent incredibility of the alleged operative inducement and my circumstantial observations, I find that there was sufficient basis for the Trial Judge to have admitted the statements at the end of thevoirdire.",
        "Reasons for Trial Judge’s reversal of admissibility": "49 Indeed, after thevoirdire,the Trial Judge found that the three statements were given voluntarily and admitted them.23Foot Note 23×ROP vol 1, p 62 (NE 15/08/16, p 47).No reasons for his decision were recorded in the notes of evidence, but he explained in his grounds of decision (“the GD”) at [35] that he admitted the statements because he “initially felt that [the respondent’s] claims were vague”. I should emphasise that it is for the Trial Judge to explain what was vague about the respondent’s claims. Unfortunately, no such explanation was given. When considering what was “vague”, the relevant inquiry is not whether the respondent’s defence was generally vague at that point in the trial but whether the allegations of inducement were vague. In this regard, I fail to see how the respondent’s allegations could be considered vague in any material sense. I have captured his discrete allegations at [38]–[39] above. 50 The Trial Judge gave three reasons for subsequently reversing his decision to admit the statements: (a)More details were given.During the ancillary hearing, the respondent’s testimony was “understandably hesitant and sketchy and therefore came across as being vague”, but after the defence was called, the respondent seemed to have “gained more confidence and was able to recall more details”24Foot Note 24×GD at [36].about the alleged inducement and how the statement was recorded. In particular, it emerged that the IO would indicate which drugs Sim had not admitted to possessing and expect the respondent to admit to each accordingly. This led the Trial Judge to conclude that the statement-recording process was in essence “an exercise of filling in the blanks”.25Foot Note 25×GD at [35]. (b)Sim’s unreliable evidence cast doubt on the statements.The Trial Judge relied on Sim’s evidence as theadditionalevidence that emerged during the main trial which justified him in reconsidering his earlier decision to admit the statements. He explained that on this basis, his reversal was not premised solely on a repetition of the same allegations by the respondent. The link between Sim’s evidence and the voluntariness of the respondent’s statements was stated as such:26Foot Note 26×GD at [38]. I had doubts as to what she told the IO during investigations which in turn had a bearing on how the accused’s statement was recorded i.e. what ‘blanks’ the accused was asked to fill in. (c)The respondent’s credibility had increased.The Trial Judge found that the respondent’s entire testimony was “distinctly more coherent and believable” when he was giving evidence as to his whole defence and not only the recording of his statements.27Foot Note 27×GD at [36].As noted at [20] above, the Trial Judge found the respondent’s defence to be credible and entirely believable. 51 Further, the Trial Judge concluded that even if the statements remained admitted as evidence, he would attach little weight, if at all, to them. This was because Sim’s statements and the respondent’s statements were seen as “complementaryi.e. whatever drugs that Sim did not admit to being in possession were attributed to the [respondent]”28Foot Note 28×GD at [40].[emphasis added]. Viewed in this light, doubts about Sim’s evidence in turn raised doubts about the truth of the respondent’s statements. 52 Before dealing with each of the three reasons, it is significant to note that the Trial Judge did not identify the operative inducement which he effectively found was offered by the IO. This is an important step for the Trial Judge to undertake because it is only after he has satisfactorily identified the operative inducement that his mind would be properly directed to the material inquiry as to whether he is justified in changing his earlier decision that there was no TIP. This is one of several missing steps which caused the Trial Judge to fall into error. As I have analysed at [40]–[41], the operative inducement on the respondent’s best case was the IO informing the respondent that if the DNA test results were negative, Sim would be charged for the drugs instead of him.",
        "Analysis": "53 I shall now examine the Trial Judge’s reasons for reversing his decision in turn. Reason 1: more details were given 54 In relation to the first reason,viz,the respondent gave “more details”, the Trial Judge did not elaborate on (a) what these additional details were; and (b) how these additional details added credence to the respondent’s claim or otherwise caused him to change his mind. This is a second crucial missing step that would have directed the Trial Judge’s mind to the precise impact that the further evidence should have had on him. 55 At the appeal, when asked to identify the new details of the alleged inducement which were not raised during thevoirdirebut were raised during the defence, the respondent could only make some general points which did not bear on the issue of inducement. He explained that he did not give many details initially because he was not aware of the trial procedure but elaborated more when he was given another chance to go on the stand during his defence, when he “talked about the process of his arrest and what happened subsequently”. 56 This being the case, I undertook a comparison of the verbatim evidence of the alleged inducements adduced during the ancillary hearing and later during the defence. The following table summarises what allegations were repeated and what “more details” were newly-introduced, according to the various stages of the alleged exchange between the respondent and the IO: Stage of events that evidence pertained toRespondent’s evidence during defence29Foot Note 29×See ROP vol 1, pp 50–51 (NE 15/08/16, pp 35:15–36:24); ROP vol 1, pp 202–206 (NE 18/08/16, pp 10:25–14:8).Evidence of events prior to the alleged TIP being madeThe respondentrepeatedthat he initially said the items did not belong to him but the IO did not believe him and informed him that Sim had said they belonged to him.He furnishedadditional detailsthat (a) both he and the officer got impatient; and (b) he was suffering from withdrawal symptoms and felt very cold. Neither of these details are relevant to whether there was a TIP.Evidence of the alleged TIP relating to lesser quantity chargedThe respondentrepeatedhis allegations that the IO offered to charge him with trafficking 14.99g if the quantity was below 30g and with trafficking 9.99g if the quantity was more than 10g.Noadditional detailwas furnished.Evidence of the alleged TIP relating to DNA resultsThe respondentrepeatedhis allegation that the officer promised to charge Sim instead if the respondent’s DNA test results were negative. He stated that this was why he decided to admit that the drugs were his.Noadditional detailwas furnished.Evidence of the process of recording the statement after the alleged TIPThe evidence in this regard was all new. The respondent alleged:(a) The IO pointed to several drug exhibits and the accused duly admitted to each of them.(b) The respondent admitted that H1A1 and H1A2 belonged to him because he wanted to cooperate with the IO.(c) The IO asked him, “Since you have already admitted to the quantity, then why do you not admit to this?” (referring to exhibits marked “H1B1” and “H1B2” which were found in the same plastic bag). The IO also asked, “Sim denied owning this drug [referring to K1A], what’s going to happen then” and gestured with his hands, which the respondent understood as a cue for him to admit to possessing it.(d) The IO offered to help him write down some of the answers that the respondent did not know how to give and assured him that he need only sign the statement.(e) The respondent concocted the additional details about the source of the drugs and how they were left at the Kim Tian flat.(f) The respondent reminded the officer at the end that he had stated in a contemporaneous (unrecorded) statement that the items were not his. 57 The above comparison reveals that the respondent’s new evidence pertained to theprocess of recording the statement afterthe IO had offered the alleged inducements. It did not pertain to whether the IO had offered the alleged inducements, in particular the operative inducement, at all. It also included the curious allegation that the IO had directed him to admit to certain exhibits marked “H1B1” and “H1B2” which were not the subject of the eventual charge. As mentioned, the Trial Judge did not explain how the additional details changed his mind – an omission which I attribute to his earlier omission to identify the operative inducement so as to focus his inquiry on it. Instead, the Trial Judge was evidently disturbed by the fact that the interrogation was “an exercise of filling in the blanks”.30Foot Note 30×GD at [35].Two points should be made in this regard. First, these allegations were not put to the IO. The IO had testified during thevoirdirethat each statement was recorded by posing questions to the respondent, whose answers were recorded.31Foot Note 31×ROP vol 1, pp 46–48 (NE 15/08/16, pp 31:17; 32:17–18; 33:10–17).The IO was not called to give evidence again during or after the respondent’s defence. 58 Second, even if the interrogations were an exercise of filling in the blanks as the respondent claims, this is a matter which goes to the reliability and truth of the statements and not to their voluntariness. It would have remained the respondent’s free choice as to how to respond to each invitation to “fill in the blank” –unlesshe had been induced. Nothing in the new evidence has a bearing on whether the IO made the operative inducement as alleged. The respondent’s claims in relation to the three inducements were the same in substance. The only additional allegation relevant to voluntariness is the claim that the IO offered to help him write down some answers. In this regard, the respondent did not deny that the statements were read back to him and he had an opportunity to make corrections before signing them. Whether the respondent genuinely intended to accept the contents of the statements, as evidenced by his review and signature, must ultimately be tested with reference to whether the alleged inducements were made in the first place. Reason 2: Sim’s unreliable evidence 59 Since the new evidence by the respondent did not relate to whether a TIP was made, I turn to the impact of Sim’s evidence, which according to the Trial Judge constituted additional evidence justifying his revisiting the admissibility issue. 60 Even if the Trial Judge were correct in his adverse findings of Sim’s credibility, it was incumbent on him to explain how and why the adverse findings caused him to change his earlier finding that the IO had not induced the respondent. In my judgment, Sim’s evidence adds nothing to the assessment of whether the IO had misconducted himself in recording the statements. The two are completely unrelated. In this respect, the Trial Judge fell into error again. He failed to draw any causal connection between Sim’s evidence and his reversal of his decision. This error was partly attributable to his more fundamental failure to identify the operative inducement and to appreciate that by reversing his decision, he was effectively finding that the IO had misconducted himself. 61 According to the Trial Judge, the decisive link was that Sim’s testimony to the CNB officers had a bearing on what “blanks” the respondent was asked to fill in,ie, which drug exhibits the respondent was made to admit to. This, however, fails to focus on the precise question of whether there was an operative inducement. I do not see how Sim’s testimony to the CNB officers could have any bearing on the inducements the IO supposedly made to solicit the respondent’s compliant response. Even if the IO had interrogated the respondent about specific drug exhibits that Sim had not admitted to, Sim’s testimony could not have restricted the respondent’s volition in deciding whether to admit to the respective drug exhibits. It was a clear error to allow Sim’s evidence to affect his decision on admissibility. Reason 3: the respondent’s increased credibility 62 This leaves the Trial Judge’s third reason,viz,the respondent’s increased credibility. It should be recalled that based onMustaffa, it may be legitimate in some circumstances for further evidence in the main trial to prompt a judge to reassess the credibility of witnesses who gave evidence at thevoirdire.As was the case inNeo AhSoi,further evidence may include the contents of the statements themselves. What is relevant here is how the credibility of the respondent’s whole evidence in his defence enhanced the credibility of his account of the alleged inducements vis-à-vis the IO’s account during thevoirdire. 63 In my view, the evidence in the main trial gave the court no grounds to reassess the credibility of the IO who gave evidence during thevoirdire. To the contrary, the contents of the statements enhance the IO’s credibility and cast serious doubt on the respondent’s account. 64 For a start, it is noteworthy that Statement 2 recorded that while at the Kim Tian flat on the day of the arrest, the respondent had told CNB officersthricethat he did not know to whom the heroin in the Kim Tian flat belonged.32Foot Note 32×ROP vol 2, p 33 at para 17.I view this as an indication that the statement was truthfully recorded by the IO as it was not wholly slanted against the respondent. The Trial Judge instead regarded this as a sign of internal contradiction. I disagree because Statement 2 records this denial in the course of recounting the events of the day of the arrest; it is not inconsistent with a later admission that the disputed drugs actually belonged to the respondent who did not disclose this fact immediately upon his arrest. In fact, in Statement 3, the respondent explained that he originally denied possession of the disputed drugs because he considered the possibility that Sim may admit to possessing them but changed his mind when he reflected on how well she had treated him33Foot Note 33×ROP vol 2, p 41 at para 62.. 65 The contents of Statements 2 and 3 also raise suspicion about the respondent’s account of the statement-recording process. In Statement 2, the respondent admitted generally to packing drugs at the Kim Tian flat and specifically to collecting one pound of heroin from Ah Boon two days before his arrest and leaving the remainder that he had not repacked at the Kim Tian flat.34Foot Note 34×ROP vol 2, p 36 at paras 25–26.It was only in Statement 3 that the respondent was systematically shown photographs of various exhibits. In Statement 3, he identified H1A1 as the remainder of the one pound he collected from Ah Boon and K1A as a packet of heroin repacked by him for sale.35Foot Note 35×ROP vol 2, p 39 at paras 55 and 57.This sequence is inconsistent with the respondent’s evidence that his admissions were systematically extracted by being shown photographs of exhibits that Sim denied owning before he was asked to concoct a story about how he had obtained the drugs. This must weigh against any finding that the respondent appeared more credible after his defence. More tellingly, the respondent described the packaging of H1A1 and H1A2 accurately (namely, that they were placed in a box in a plastic bag) in Statement 2 even before he was confronted with photographs of the exhibits. This is a strong indication that his recorded confessions were true and emanated from his personal knowledge. 66 Furthermore, as the Prosecution correctly submitted, the statements contained details that could only have come from the respondent. Such details include: (a)  the respondent obtained one pound of heroin from Ah Boon at a shopping centre in Boon Lay;36Foot Note 36×ROP vol 2, p 36 at para 25.(b) he opened the box containing H1A1 when he returned to the Kim Tian flat from Boon Lay;(c) he repacked part of H1A1 into smaller packets which he took with him when he left the Kim Tian flat;(d) H1A1 contained the remainder of the one pound collected from Ah Boon, which he intended to return to repack the next day or the following day;37Foot Note 37×ROP vol 2, p 36 at para 26 and p 39 at para 55.and(e) K1A was intended for sale.38Foot Note 38×ROP vol 2, p 40 at para 57. In his defence, the respondent conceded that he had volunteered such details bearing in mind the IO’s alleged promise not to charge him if his DNA was not found on the disputed drugs.39Foot Note 39×ROP vol 1, p 203 (NE 18/08/16, p 11: 23-26); pp 204–205 (NE 18/08/16, pp 12:27–13:23).Under cross-examination, he explained that he had concocted the story about purchasing one pound of heroin from Ah Boon “just to go in line with the statement”.40Foot Note 40×ROP vol 1, p 217 (NE 18/08/16, p 25:8–10).It is inexplicable why the respondent should have felt obliged to help the IO fashion a coherent, detailedfalsestatement. In other words, if the respondent is to be believed that he admitted to the ownership of the drugs because of the IO’s inducement, it would mean that he then concocted these additional details to make his false confession more believable. This is absurd. As I highlighted at [43] above, the operative inducement,ie, to charge Sim if the respondent’s DNA was not found on the exhibits, did not require any participation on the respondent’s part. The inference must be that the details recorded in the statements were true. Consequence of the Trial Judge’s reversal 67 In deciding to reverse his earlier finding that the statements were voluntarily made, it is essential for the Trial Judge to appreciate the logical corollary to his new finding. The flipside of his new finding was that the IO induced the respondent to admit to the statements. Further, if the inducement was additionally the promise of a lesser charge, it would follow that the IO made afalsepromise given that he was in no position to make any offer of a reduced charge. These were severe findings that the IO misconducted himself. The Trial Judge omitted to engage this point at all. This was another crucial missing step which would have operated as a reality check on his new finding. 68 This omission is all the more damaging given that the IO was not cross-examined by the respondent in relation to the alleged inducements again during the main trial. With respect to allegations of inducement that were simply repetitions of his claims in thevoirdire, the Trial Judge did not explain why the IO’s earlier evidence that there was no inducement, which was initially accepted, should now be disbelieved. In addition, new allegations as regards the statement-recording process only emerged after thevoirdire, when the respondent testified in his defence. He alleged that the IO had pressured him into admitting that he owned specific drug exhibits in the photographs by asking, “Since you have already admitted to the quantity, then why do you not admit to this [referring to exhibits labelled “H1B1” and “H1B2” which are not the subject of the charge]?”.41Foot Note 41×ROP vol 1, pp 204 (NE 18/08/16, pp 12:16−17).It was further alleged that the IO hinted to the respondent, “Sim denied owning this drug [referring to K1A], what’s going to happen then”.42Foot Note 42×ROP vol 1, pp 204 (NE 18/08/16, pp 12:23−24).Though these new allegations did not relate directly to the operative inducement, they were material to the Trial Judge’s apparent disapproval that the statements were recorded through an “exercise of filling in the blanks”. These new allegations were not put to the IO. Applying the rule inBrowne v Dunn(1893) 6 R 67, it was not open to the respondent to make these allegations after the IO had taken the stand. It was therefore inappropriate for the Trial Judge to have reversed his finding in reliance on the respondent’s untested account in large measure and which, crucially, was not put to the IO.",
        "Conclusion": "97 Considering the totality of the evidence, I find sufficient basis to sustain all elements of the charge against the respondent beyond reasonable doubt. 98 As far as K1A is concerned, the admissions in the statements, to which I have given full weight, support all the elements of the charge and suffice by themselves to sustain a conviction for trafficking. 99 As regards H1A1 and H1A2, the admissions clearly established the elements of possession and knowledge. At [75] above, I alluded to the need to infer from the statements and circumstantial evidence that H1A1 and H1A2 were intended to be trafficked. Having assessed all the circumstances, I am satisfied that the respondent intended to traffic H1A1 and H1A2. Besides his stated intention to repack these exhibits, the respondent admitted in Statement 3 that the weighing scale and empty plastic packets belonged to him. Both Sim and the respondent also testified that the respondent would repack drugs for the purposes of delivering them in smaller packets to his buyers. In addition, the amount of diamorphine contained in these two exhibits, which exceeds the quantity required to trigger the presumption of trafficking under s 17 of the MDA, also bolsters the inference that the diamorphine was not intended for personal consumption. 100 I regard as instructive the cases where, in the face of a positive assertion by the accused that the controlled drugs found in his possession were meant for personal consumption, the court nonetheless drew an irresistible inference of trafficking based on circumstantial evidence such as the quantity of controlled drugs and the presence of drug paraphernalia. For example, inTehThiam Huat v Public Prosecutor[1996] 3 SLR(R) 234, the appellant did not deny possession of the heroin but claimed they were for his and his friend’s consumption at a startling rate of 40 straws a day. The Court of Appeal rejected this assertion because at a more probable rate of consumption, the heroin constituted three months’ supply and the appellant did not have the financial means to support such a level of addiction. The irresistible inference was that he was financing his drug addiction by trafficking in drugs (at [24]). Similarly, inRamanSelvam s/o Renganathan v Public Prosecutor[2004] 1 SLR(R) 550 (“RamanSelvam”), the Court of Appeal affirmed the trial judge’s decision that the sheer quantity of cannabis and the drug trafficking paraphernalia found in the same flat proved that the drugs were meant for the purposes of trafficking(see [32] and [48]). 101In the respondent’s case, an inference of trafficking is even more compelling because the respondent did not qualify in any of his statements that H1A1 and H1A2 were meant for his consumption. The evidence is clear that the respondent intended to repack H1AI and H1A2 into smaller packets. The irresistible inference is that the respondent’s intention to repack H1A1 and H1A2 was to facilitate his sale and distribution of them. In any event, since possession has been proved, the court is entitled to invoke the presumption of trafficking under s 17 of the MDA against the respondent even though it was not invoked by the Prosecution (seeShaharybin Sulaiman v Public Prosecutor[2004] 4 SLR(R) 457 at [12] andPublic Prosecutor vPhuthita Somchit and another[2011] 3 SLR 719 at [48]). If it were invoked, I would have found no evidence to rebut the presumption.",
        "The effect of the respondent’s admissions": "70 Once the statements are admitted, the next task is to identify the relevant admissions contained in them that support the elements of the charge. Applying the framework set out by the Court of Appeal inMuhammadRidzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59], the elements for establishing a charge of possession for the purposes of trafficking under s 5(1) read with s 5(2) of the MDA are: (a) possession of a controlled drug – which may be proved or presumed pursuant to s 18(1) of the MDA, or deemed pursuant to s 18(4) of the MDA; (b) knowledge of the nature of the drug – which may be proved or presumed pursuant to s 18(2) of the MDA; and (c) proof that possession of the drug was for the purpose of trafficking which was not authorised. 71 Of the three elements, the main thrust of the respondent’s defence in the trial below was that the disputed drugs were not in his possession. The Prosecution sought to rely on the presumptions in ss 18(1)(c) and 18(2) of the MDA and argued on appeal that the Trial Judge erroneously decided that both the presumptions had been rebutted. For the reasons detailed below, I ultimately find that the presumption in s 18(1)(c) is not available to the Prosecution on the facts of the present case. Bearing this in mind, I propose to deal with the presumptions separately after I have considered whether the charge can be sustained based on all the evidence before me, in particular the admissions contained in the statements which were erroneously excluded by the Trial Judge. It is essential to grasp that in any case the presumptions in s 18, even if applicable, would only operate to prove the first and second elements of the offence,ie, possession and knowledge. If the statements were excluded, as they were by the Trial Judge, the presumptions alone (even if unrebutted) would be insufficient to establish the elements of the charge of possessionfor the purposes of trafficking. As will be clear later, the admissions in the statements are a necessary part of the evidential base from which the third element of trafficking can be proved or inferred. Furthermore, had the Prosecution successfully invoked the presumptions in s 18, it could not at the same time rely on the presumption in s 17 of the MDA to relieve itself of the duty to prove beyond reasonable doubt that possession was for the purposes of trafficking (seeMohdHalmi bin Hamid and another v Public Prosecutor[2006] 1 SLR(R) 548 at [8]). Since it is necessary to rely on the respondent’s statements to determine whether the charge can be sustained, irrespective of the invocation of the presumptions in s 18, it makes sense to first examine whether and how the statements which I have now admitted can be used to prove all the elements of the offence and whether full weight should be given to the admissions contained therein. It is to this which I now turn.",
        "The relevant admissions": "72 As regards the element of possession, the statements contain clear admissions that H1A1, H1A2 and K1A belonged to the respondent. In relation to H1A1 and H1A2: (a) In Statement 2, the respondent admitted that the heroin found in a box within a plastic bag (ie, where the CNB officers retrieved H1A1 and H1A2) was obtained by him from Ah Boon on 25 January 2015 and brought by him to the Kim Tian flat. He dealt with them as his own when he repacked one large packet into smaller packets and smoked a small quantity from one of the packets. He also stated his intention to return another day to continue repacking these packets of heroin. (b) In Statement 3, the respondent identified H1A1 as the remainder of the one pound that he obtained from Ah Boon on 25 January 2015. When cross-examining the IO, the respondent highlighted that H1A2 was not mentioned in Statement 3 even though it was recorded that the respondent was shown a photograph of H1A2. This was a pertinent point because H1A2 was analysed to contain not less than 8.07g of diamorphine – the bulk of the quantity stated in the charge. The IO explained that he may have inadvertently “missed out” mentioning H1A2 in Statement 3.43Foot Note 43×ROP vol 1, p 117 (NE 16/08/16, p 38:30).However, the IO reasoned that there was only one box found inside the plastic bag and H1A2 was found inside the box. Putting this together with the respondent’s explanation in Statement 2 that the one pound of heroin he had obtained from Ah Boon was placed in a box inside a plastic bag, the one pound must have referred to H1A1 and H1A2 collectively. In fact, the respondent confirmed so when cross-examined by the Prosecution.44Foot Note 44×ROP vol 1, p 234 (NE 30/09/16, p 13:6–10).I note that the combined weight of the granular substances in H1A1 and H1A2 does not exceed one pound. 73 As for K1A, the respondent’s direct admission in Statement 3 reads as follows: The 2 packets of ‘liao’ [ie, heroin] above the Label K1A were mine. It was meant for sale.I had repacked this packet of ‘liao’ in [Sim’s] house and I think this is the packet that she said she had kept for me in the drawer with hers when I was rushing off to send drugs to my customers on Sunday (25.1.2015). … [emphasis added] 74 As regards the element of knowledge, it was not disputed in the trial below that the respondent knew of the nature of the disputed drugs. This fact was supported by Statement 3 wherein the respondent readily identified H1A1, H1A2 and K1A as heroin. He also knew precisely where K1A was found (that is, in the drawer) and how H1A1 and H1A2 were packaged. 75 Turning to the third element of possession for the purposes of trafficking, Statement 3 contains a clear admission by the respondent that K1A was “meant for sale”. As for H1A1 and H1A2, the respondent stated in both Statements 2 and 3 that he was intending to return to repack the remainder of this consignment of heroin. This was preceded by him recounting that on 25 January 2015, “after [he was] done with the repacking” of this same consignment of heroin, he “took a bit of ‘liao’ from a packet to smoke”. It is unclear whether the heroin he consumed was taken from the original large packet or from one of the smaller packets he had just repacked. He also did not specifically admit that he intended to repack H1A1 and H1A2 in order to facilitate theirsale and distribution, although he explained elsewhere in Statement 3 that his practice was to “repack [his] drugs into smaller packets for sale”.45Foot Note 45×ROP vol 2, p 39 at para 56.As his admission in the statements regarding the purpose of H1A1 and H1A2 is not entirely clear, I shall consider not only the weight to be accorded to his stated purpose, but also the strength of any other circumstantial evidence in support of an inference of trafficking in relation to H1A1 and H1A2.",
        "The weight to be accorded to the statements": "76 Considering that the contents of the statements are now disputed by the respondent, the weight to be accorded to them should be carefully examined. As the Court of Appeal recognised inMuhammad bin Kadarand another v Public Prosecutor[2011] 3 SLR 1205, reliability is a distinct question from voluntariness which goes to admissibility (at [73]–[74]): … Just like any other form of evidence, the truth of an admitted statement’s contents (and therefore the weight to be given to that statement) is to be evaluated on an ongoing basis throughout the trial. This should be done regardless of whether its truth is disputed by its maker, but especially if it is so disputed. The court and counsel should bear in mind that even if a statement has, standing alone, more probative value than prejudicial effect (and is therefore admitted), this does not mean that its contents should, as a matter of course, be given some or any weight after being assessed alongside all the other evidence in the case. The standard tools available to the court can all be used for this assessment, including examination of internal consistency, corroborating evidence, contradictory evidence, evaluation of the credibility of the witnesses, and so on and so forth. Confessions admitted into evidence that are partly or wholly retracted by the maker should be the subject of special care. … 77 The Court of Appeal went on to citeJagatheesans/o Krishnasamy v Public Prosecutor[2006] 4 SLR(R) 45 at [84]–[87] for the following propositions regarding retracted statements. First, it is settled law that an accused can be convicted solely upon his confession even though that statement is subsequently retracted (LimThian Lai v Public Prosecutor[2006] 1 SLR(R) 319 at [43]). However, the evidential weight to be assigned to the retracted statement should be assiduously and scrupulously assessed. In particular, if the retracted statement forms the only evidence upon which the Prosecution’s case rests, such statements should attract painstaking, if not relentless, scrutiny. It is necessary for the court to be satisfied that the retracted confession is voluntaryandobjectivelytrueandreliable; a statement given voluntarily may not be reliable depending on the circumstances and the cogency of the statement. Retracted statements may be regarded as an instance of inconsistency in the witness’s testimony. In such an instance, the assessment of that witness’s credibility and the weight to be assigned to that statement depends on whether areasonableandreliableexplanation can be furnished for the retraction. If the explanation is unsatisfactory, this may cast doubt on the entire evidence of that witness. 78 In my view, full weight should be given to the respondent’s admissions. The respondent recanted the statements on the ground that they were falsely induced by the IO’s promise to charge Sim instead if his DNA test results were negative. Since I have concluded that his allegations of inducement are false, it follows that his explanation for the recantation is neither reasonable nor reliable. As for his allegations that the statements were recorded through the IO’s systematic prompts as to which exhibits were not admitted to by Sim: while these allegations were irrelevant to the question of inducement, they may be relevant to assessing the reliability and truth of the statements’ contents (see [58] above). In this regard, I noted at [65] above that his account of the statement-recording process is inconsistent with the sequence of events reflected in the statements themselves. I also noted at [68] above that these allegations were not put to the IO, such that the veracity of the respondent’s account cannot be thoroughly tested. In any case, even if the IO had informed him which exhibits were not admitted to by Sim, the respondent could have denied possession of those exhibits if he were truly innocent. The respondent did not dispute that the contents of the statements emanated from him; in other words, it was not his allegation that the IOfabricated his admissions and elaborations. According to him, the alleged inducement was the only reason he admitted to the exhibits as indicated by the IO. Since I have rejected his claim in relation to the alleged inducement, there is no other reason for me to doubt that his admissions were anything but true and reliable. 79 Moreover, I find that the statements are cogent and reliable. As noted at [66] above, the statements contain details surrounding the disputed drugs that could only have come from the respondent. It also appears that he volunteered information about the source and packaging of H1A1 and H1A2 in Statement 2 before he was shown photographs of the exhibits in Statement 3. I rejected the respondent’s explanation that he had concocted these details just to “go in line with the statement” because it is absurd.46Foot Note 46×ROP vol 1, p 217 (NE 18/08/16 p 25:9−10).The inference must be that the particulars were true based on the respondent’s personal knowledge. 80 Further, the respondent’s attempts to explain away his specific admissions do not strike me as credible. He explained that he did not have the habit of storing his drugs at the Kim Tian flat because Sim was a drug addict who might help herself to the drugs. This is to be doubted because Sim and the respondent clearly trusted each other to the extent that Sim entrusted him, a known drug trafficker, with the keys to the Kim Tian flat. Sim was also a customer of the respondent and had occasionally loaned money to him which was offset against his supply of drugs to her. The respondent acknowledged his trusting relationship with Sim in his oral testimony:47Foot Note 47×ROP vol 1, p 212 (NE 18/08/16 p 20:30−32). She has been treating me quite well. When I needed money, I would borrow from her. She had been obliging, she readily lend me the money. She also allow me access to her home freely. … 81 The respondent also claimed that he only used the Kim Tian flat to consume drugs and never to repack drugs except when repacking orders for Sim herself. In direct contradiction, he admitted in his statements to repacking heroin and ice at the Kim Tian flat from the time he began visiting the place48Foot Note 48×ROP vol 2, p 35 at para 23.and to setting out from the Kim Tian flat to deliver drugs to his other clients.49Foot Note 49×ROP vol 2, p 36 at para 25.He also admitted in Statement 3 that the weighing scale and small empty plastic packets found at the Kim Tian flat belonged to him and were used to repack smaller packets of drugs for sale.50Foot Note 50×ROP vol 2, p 37 at paras 44 and 56.It seems very unlikely that the respondent would store a dedicated weighing scale and empty packets at the Kim Tian flat solely to weigh drugs for Sim, who was not charged with any drug trafficking offences. If repacking could indeed be done quickly at the Yung Sheng flat without his mother’s detection (which was his apparent concern), the respondent could simply have repacked packets for Sim at the Yung Sheng flat rather than store another set of trafficking apparatus at the Kim Tian flat. It bears mention that Sim testified that at the outset she allowed the respondent to use the Kim Tian flat to repack drugs partly because it was convenient for him to repack drugs for delivery to her on the spot. However, Sim did not testify that he used the Kim Tian flat exclusively to repack for her – in fact, she said he would repack there to “distribute … to others”.51Foot Note 51×ROP vol 1, p 141 (NE 16/08/16, p 62:26–30). 82 In my view, the Trial Judge failed to give sufficient weight to the fact that the respondent was released on police bail at the material time and was concerned to avoid not only his mother’s disapproval but also the CNB’s detection. It was after all in the context of his police bail that Sim gave him the keys to the Kim Tian flat. Not only did he admit in Statement 2 to using the Kim Tian flat to avoid the CNB52Foot Note 52×ROP vol 2, p 35 at para 23., he also revealed under cross-examination that “[b]ecause [he] was also out on bail, so [he was] afraid that CNB officers will come over to knock on [his] door”.53Foot Note 53×ROP vol 1, p 226 (NE 30/09/16, p 5:3–4).This concern to continue his drug trafficking activities without the lurking eye of the CNB fits better with the account given in his statements than in his oral testimony. 83 For the foregoing reasons, the admissions in the statements should be given full weight. I will next consider whether anything in Sim’s evidence and the objective evidence casts reasonable doubt on the respondent’s admissions and what corroborative value, if any, they may offer.",
        "Sim’s evidence": "84 In relation to Sim’s evidence, a point of first importance is that she is not an entirely disinterested witness. The Prosecution stressed at the trial and in submissions that Sim had no incentive to lie to incriminate the respondent because her case had concluded by the time she took the stand to give evidence. I think this overlooks the fact that charges in relation to the disputed drugs could still be preferred against her if the respondent were ultimately acquitted and the evidence points to her instead. Notwithstanding this, the credibility and reliability of her evidence as regards the ownership of the drugs must still be examined on its merits. 85 The Trial Judge found Sim’s evidence to be riddled with inconsistencies that materially weakened the Prosecution’s case. For a start, she did not testify that she witnessed the respondent bringing the disputed drugs to the Kim Tian flat. I note that at one juncture, she claimed that she witnessed him doing so, but she later conceded that he brought them over when she was not around.54Foot Note 54×ROP vol 1, p 174 (NE 17/08/16, p 22:13–14). 86 Since she did not personally witness him bringing the disputed drugs to the Kim Tian flat, her evidence incriminating him was based on her identification of the drugs which belonged to her and that which belonged to the respondent. In this regard, there were indeed discrepancies in her evidence. At first, she took what the Trial Judge described as the “convenient position” of claiming that all larger packets of drugs belonged to the respondent. She explained that drugs belonging to her would have been repacked into smaller sachets for her own consumption. She accepted that while she carried her drugs in her bag, she did store a bit of diamorphine in her cupboard.55Foot Note 55×ROP vol 1, p 143 (NE 16/08/16, p 64:5–8).However, when faced with photographs of the exhibits, Sim gave varying accounts of which drug exhibits belonged to the respondent. Under cross-examination, she claimed that all her drugs were kept in her bag and none of the drugs stored in the cupboard (whether large or small packets) belonged to her.56Foot Note 56×ROP vol 1, p 187 (NE 17/08/16, p 35:31).In other words, she claimed that not only K1A but all the other drugs found in the drawer of the cupboard belonged to the respondent. She stuck to this position even when the Prosecution reminded her that she had pleaded guilty to charges relating to drugs stored in the cupboard.57Foot Note 57×ROP vol 1, p 186 (NE 17/08/16, p 34:18−23).According to her, she was confused by the manner in which the drugs were arranged in the photographs and could not identify them with certainty when she was questioned by the CNB officers.58Foot Note 58×ROP vol 1, p 184 (NE 17/08/16, p 32:12–27). 87 The Trial Judge was clearly troubled by the fact that Sim’s oral testimony incriminated the respondent with possession of more drugs than when she pleaded guilty to her set of charges. He was also uneasy with the fact that Sim’s DNA was found on the plastic bag containing H1A1 and H1A2 and on the digital weighing scale seized from the Kim Tian flat. These observations should be considered in the light of his doubts regarding the respondent’s statements, which I have found to be erroneous. 88 At the appeal, the Prosecution conceded that Sim’s evidence contained discrepancies but submitted that these discrepancies related only to the penumbra of her evidence. The Prosecution relied onMicheal Anak Garing v Public Prosecutor and another appeal[2017] 1 SLR 748 where the court distinguished between the core and penumbra of a witness’s evidence (at [43]). It was argued that in relation to the critical factual issue, namely the ownership of the disputed drugs, Sim did not waver in her evidence that they belonged to the respondent. 89 Having reviewed the trial transcript and considering my decision that the Trial Judge erred in not admitting the respondent’s statements, I am of the view that the discrepancies in Sim’s evidence do not undermine the Prosecution’s case. The central inquiry here is the ownership of H1A1, H1A2 and K1A. Sim’s evidence was consistent in relation to H1A1 and H1A2: the plastic bag containing H1A1 and H1A2 was on the chair when she entered the flat on the day of her arrest; she moved the bag to the floor area in front of the cupboard but had no inkling of its contents.59Foot Note 59×ROP vol 1, p 145 (NE 16/08/16, p 66:23–26); p 146 (NE 16/08/16, p 67:13−16); p 171 (NE 17/08/16, p 19:23–27).This should be viewed in the light of the detailed account given by the respondent in Statement 2 of how he obtained the heroin contained in the plastic bag and how he dealt with it when he brought it to the Kim Tian flat. 90 When questioned with photographs of the drug exhibits, Sim consistently attributed H1A1, H1A2 and K1A to the respondent. It was evident to me that Sim was identifying which drugs were whose by reference to the packaging of the drugs. While it might seem “convenient” to implicate the respondent with all larger packets of drugs, given the way that drugs were found strewn all over the Kim Tian flat, it was understandable that Sim recognised her own drugs by reference to its packaging. Her insistence that none of the larger packets belonged to her was consistent with her assertion that she was not a drug trafficker. It also corroborated the respondent’s admission in Statement 2 that he would repack heroin “from the big packet to smaller packets”.60Foot Note 60×ROP vol 2, p 35 at para 23. 91 I conclude that Sim was sufficiently consistent with respect to the core factual issue in dispute in relation to the respondent’s charge, namely the respondent’s possession of the disputed drugs. I do not think that the discrepancies justified a complete rejection of her evidence. To the contrary, having decided that the statements should have been admitted, I find that Sim’s evidence corroborates the respondent’s confessions in the statements and therefore supports the reliability of the statements. In any event, even if Sim’s evidence were rejected entirely, the respondent’s admissions in Statements 2 and 3 are sufficient to establish the respondent’s ownership of the disputed drugs, so the acceptance of Sim’s evidence is not pivotal. 92 Lastly, I should state that with regards to the element of trafficking, Sim did not waver in her evidence that the respondent often brought large packets of drugs to the Kim Tian flat to repack in order to distribute to others in smaller packets.61Foot Note 61×ROP vol 1, pp 141 and 144.The respondent did not challenge her evidence that he repacked for distribution except insofar as he claimed that he only repacked drugs at the Kim Tian flat for the purposes of delivery to Sim herself (see [81] above). Consistent with Sim’s evidence, the respondent actually explained under cross-examination that he needed to repack large packets from his supplier into smaller packets before delivering them to his buyers:62Foot Note 62×ROP vol 1, p 228 (NE 30/09/2016, 7:9–28). Q … Now, earlier you mentioned that when you buy drugs from Ah Boon, you would deliver them straight to the buyer. Is that correct? A Not directly because sometimes I need to do repacking. Q Why would you need to do repacking? A Because sometimes I wanted the drugs in five packets but I only got it all put in one bag, one medium-sized bag. But if let’s say the supplier gave me the drugs in small packets, I will deliver to the buyers directly. … A Medium packaging will be H1A1 … Q How about H1A2? Is that a medium package as well? A That is---that is considered big. Large size. Q … if it comes this big a packet, before you bring to the buyer, would you need to repack this as well to a smaller? A Yes. For large packet, I definitely have to do repacking. I have to repack it into smaller packets … I am thus satisfied that Sim’s evidence further strengthens the inference that H1A1 and H1A2 were to be repacked for the purposes of sale and distribution.",
        "Objective evidence": "93 Turning to the DNA evidence, I mentioned above that Sim’s DNA was found on the plastic bag containing H1A1 and H1A2 and on the digital weighing scale seized from the Kim Tian flat. Neither the respondent’s nor Sim’s DNA was found on any of the actual drug exhibits forming the subject of the charge. The DNA of an unknown male was detected on the exterior and interior surfaces of the paper box and H1A2. 94 The evidence of Sim’s DNA on the plastic bag led the Trial Judge to believe that the objective evidence was more consistent with Sim’s handling of the drugs rather than the respondent. The Prosecution emphasised that Sim’s DNA was detected on theexteriorsurface of the plastic bag,63Foot Note 63×ROP vol 2, p 76.which is consistent with her evidence that she had moved the plastic bag from the chair to the floor. As for the weighing scale, Sim stated that she used it to weigh the quantity of drugs but never for repacking.64Foot Note 64×ROP vol 1, p 170 (NE 17/08/16, p 18:9–25).The respondent did not challenge this aspect of her evidence even though he said in Statement 2 that Sim would assist him in resealing the smaller packets of drugs he repacked. Instead, he testified that Sim did not assist him in repacking the drugs.65Foot Note 65×ROP vol 1, p 231 (NE 30/09/16, p 10:19-21). 95 The more significant rebuttal, in my view, is that the absence of the respondent’s DNA on the disputed drug exhibits and the weighing scale is not conclusive. The Prosecution adduced an unchallenged expert opinion from Ms Ang Hwee Chen, an analyst at the Health Sciences Authority. She explained that it is possible for a person to touch an exhibit but not have his/her DNA profile detected.66Foot Note 66×ROP vol 1, p 128 (NE 16/08/16, p 49:3–17).There are various explanations for this, including the fact that the person is a “bad shedder”67Foot Note 67×ROP vol 1, p 128 (NE 16/08/16, p 49:7−9).who is not prone to leaving traces of skin cells, that the item may have been handled with gloves on, or that the surface of the item was cleaned after contact. This being the case, I do not think that the absence of the respondent’s DNA raises sufficient doubt about the confessions in his statements. 96 Finally, I was initially sceptical that the respondent would casually leave drugs of such value unconcealed on the floor of someone else’s flat. The respondent said in Statement 2 that he would sell 7.5g of heroin for $150 per packet. If that is true, the combined value of H1A1 and H1A2 would be in excess of $6800. However, Sim testified that the respondent had the habit of placing his items, be it drug supplies or food, on the floor whenever he entered her flat.68Foot Note 68×ROP vol 1, p 159 (NE 17/08/16 p 7:18–26).This state of affairs should also be examined in the context of the fact that Sim and the respondent clearly trusted each other, as noted at [80] above. Viewed in this context, there was nothing odd about the placement of the drugs. It does not raise sufficient suspicion to cast doubt on the weight of the statements.",
        "The presumptions under ss 18(1) and 18(2) of the MDA": "102 The final thrust of the Prosecution’s appeal was that the Trial Judge erred in finding that even if the presumptions in ss 18(1) and 18(2) of the MDA had been triggered, the respondent had rebutted them. 103 The Prosecution submitted that the presumption of possession in s 18(1)(c) of the MDA applied because the respondent was in possession of the keys to the Kim Tian flat. Section 18(1)(c) provides: Presumption of possession and knowledge of controlled drugs 18.—(1) Any person who is proved to have had in his possession or custody or under his control — (a) anything containing a controlled drug; (b) the keys of anything containing a controlled drug; (c)the keys of any place or premises or any part thereof in which a controlled drug is found; or (d) a document of title relating to a controlled drug or any other document intended for the delivery of a controlled drug, shall, until the contrary is proved, be presumed to have had that drug in his possession. [emphasis added] 104 The respondent did not dispute that he was in possession of a set of keys to the Kim Tian flat which were seized from the Yung Sheng flat. It was common ground that the respondent was neither the owner nor the tenant of the Kim Tian flat. Sim was the owner of the Kim Tian flat. The respondent was however permitted by Sim to stay at the Kim Tian flat and, based on Statement 2, appears to have done so from time to time.69Foot Note 69×ROP vol 2, p 35 at para 23.He however maintained that the Yung Sheng flat was his place of residence. Sim did not clearly affirm whether the respondent stayed overnight,70Foot Note 70×ROP vol 1, p 142 (NE 16/08/16, p 63:10–11); ROP p 160 (NE 17/08/16, p 8:1–5).but no evidence was led by the Prosecution to show that any of the respondent’s belongings such as clothes, documents,etc,were present at the Kim Tian flat. What is clear is that the respondent at least visited the flat several times every week. 105 Given the respondent’s casual status vis-à-vis the Kim Tian flat, does the presumption in s 18(1)(c)apply to him by reason of his possession of the keys to the Kim Tian flat? The Trial Judge did not specifically rule on the applicability of the presumption. He merely stated thatifit was triggered, it has been rebutted by the respondent. 106 When my specific query about the respondent’s status vis-à-vis the flat was raised to the Prosecution at the appeal, the Prosecution placed reliance on the case ofRamanSelvam([100]supra). The appellant (“Selvam”) was charged with trafficking cannabis in furtherance of a common intention with one Bala. The cannabis was found in a room occupied by Bala in a flat belonging to one Indra. CNB officers gained entry to the flat and the room using keys found in Bala’s pocket upon his arrest. It was undisputed that keys to the flat were not found on Selvam when he was arrested. However, Bala claimed that Selvam possessed a duplicate set of keys and was the true tenant and “gatekeeper” of the room which Bala only entered and exited with his permission. This was supported by Indra’s evidence that Selvam had negotiated for the lease, arranged for the keys and paid the rent. The trial judge and the appellate court decided based on the circumstantial evidence that the appellant was in possession and control of the keys to the flat and the said room. This was sufficient to trigger the operation of the presumption in s 18(1)(c) of the MDA. There was no strict requirement that the Prosecution had to provewhenthe drugs were placed in the room in order to invoke s 18(1)(c) of the MDA (at [45]). However, the court stressed that where the Prosecution has the evidence to prove when the drugs were actually brought into the room, it should adduce that evidence at trial as a matter of sound practice, as the presumptions in s 18 had to be invoked with circumspection and care. 107 I accept thatRamanSelvamsubstantiates the proposition that anon-occupierof the premises could be presumed to be in possession of the drugs found on the premises pursuant to s 18(1)(c) once he is proved to be in possession of the keys to the premises. However it does not address my specific query in respect of two sources of complication. First, even though Selvam was not the occupier, the trial judge and the appellate court were both satisfied as a matter of fact that Selvam was the true tenant of the room and thereby had control of the premises. This is significantly different from the case of a casual visitor who is given a set of keys for free access but who may not control or have a close connection to the premises. What is odd about this latter scenario is that the logical link assumed by s 18(1)(c) betweenkeysandphysical controlof the premises appears to be factually missing.Second,bothSelvam and Bala were charged with trafficking the drugs found on the premises. It was not a case where only one of multiple persons with keys to the premises was charged in respect of the drugs even though the presumption could conceivably operate against each of them such as the present case. 108 I consider first the relevance of the accused’s actual connection to the premises where the drugs were found. InPublic Prosecutor v Okonkwo Gabriel and another[1993] 2 SLR(R) 256, the operation of the s 18(1)(c) presumption coincided with factual control of the premises. The two accused persons were jointly registered as occupants of a hotel room from which a briefcase containing diamorphine was seized. Although the briefcase was not in the first accused’s physical possession when he was arrested, the key to the hotel room was in his possession. The presumption under s 18(1)(c) operated against him. The court held that the same presumption operated against the second accused because he was in law entitled to the keys to the room as the registered occupant, although the keys were in the first accused’s physical possession.I see nothing controversial about applying the presumption in this case. 109 In the more pertinent case ofSharombin Ahmad and another v Public Prosecutor[2000] 2 SLR(R) 541 (“Sharom”), when Sharom was arrested, he was found with keys to a flat belonging to one Boksenang. In the flat, CNB officers discovered a haversack belonging to Sharom which contained heroin. Sharom and Boksenang each claimed that the heroin belonged to the other. In particular, Sharom claimed that he did not stay at the flat but only visited it on three occasions and had lent his haversack to Boksenang. The trial judge found each of them guilty of a separate charge of trafficking different quantities of heroin seized from the flat. On appeal, Sharom’s counsel argued that the trial judge had erroneously overlooked the fact that Boksenang was the flat’s tenant and Sharom had merely borrowed the keys. In response, the Court of Appeal laid down these useful points of guidance (at [29]): … To prove possession of drugs found in a flat, it is certainly not necessary for the Prosecution to prove that the person in possession of the drugs is also the owner of the flat, and conversely, proof that a person is not the owner of the unit in which the drugs were found does not necessarily mean that the person could not have been in possession of the drugs. In any event, even if the Prosecution was relying on the presumption of possession raised by s 18(1)(c) of the MDA, which we will discuss later, the argument by counsel for Sharom was still without merit.The presumption under s 18(1)(c) is not dependent upon ownership of the premises in which the drug was found, but will be raised once the accused is proved to have had in his possession or custody or under his control the keys of the place or premises in which the drug was found.In the present case, the presumption could be raised since the keys to the Ang Mo Kio flat were found in Sharom’s possession during a body search conducted immediately after he was arrested and Sharom himself had admitted that the keys belonged to him when he was questioned about it. [emphasis added] 110 The passage above clarifies that once a person is in possession of the keys, the presumption operates without regard to his status vis-à-vis the premises and applies even if he does not own the premises. Having said that, the Court of Appeal went on to find that Sharom was “certainly not the mere occasional invitee at the flat that he sought to make himself out to be” (at [30]). He was at the premises frequently at least during the week before his arrest. In addition to possessing the keys, Sharom’s personal belongings and drug trafficking paraphernalia such as a weighing scale and empty plastic sachets were found in the flat. These factors contributed to the Court of Appeal’s finding that Sharom was inactualpossession of the drugs found in the haversack seized from the flat, a finding which made it unnecessary to invoke the s 18(1)(c) presumption.In the circumstances, the presumption under s 18(1)(c) was not applied against Sharom, not because it would not arise, but in order that the presumption of trafficking in s 17 of the MDA could be invoked instead (at [38]). The Court of Appeal’s analysis in this case demonstrates that the s 18(1)(c) presumption operates upon proof of possession, custody or control of the keys to the premises. The accused’s actual connection to the premises is relevant only to a finding of actual possession of the drugs or actual physical control of the premises (from which possession of the drugs can thereby be inferred). 111 The same position is echoed in the Court of Appeal’s recent decision inObengComfort v Public Prosecutor[2017] 1 SLR 633 (“ObengComfort”). It is worth quoting the Court of Appeal’s commentary on the presumption in s 18(1) in full (at [33]–[35]): 33 … These two presumptions [in ss 18(1) and 18(2) of the MDA] were introduced to overcome the practical difficulty faced by the Prosecution of proving possession and knowledge on the part of the accused (TanKiam Peng v PP[2008] 1 SLR(R) 1 (“TanKiam Peng”) at [55]). 34 Section 18(1) lists certain circumstances under which a person is presumed to have had a controlled drug in his possession. For the purposes of s 18(1), what we are concerned with is whether the thing in issue exists and whether the accused in fact has possession, control or custody of the thing in issue.The thing in issue is the container, the key or the document of title.In this sense, this provision deals with secondary possession of the drug in that the accused possesses, controls or has custody of something which has the drug or which relates to the title in, or delivery of, the drug. As is evident in s 18(3), the accused does not need to be in physical possession of the drug,ie,primary possession. At this stage, we are also not concerned with the qualities of the drug. …Once theProsecution proves that the thing in issue exists and that the accused has possession, control or custody of the thing in issue, the effect of s 18(1) is to raise a presumption of fact, which is that the accused, by virtue of his possession, control or custody of the thing in issue, is presumed to possess the drugs which are contained in or are related to the thing in issue. 35 To rebut the presumption in s 18(1), the accused has to prove, on a balance of probabilities, that he did not have the drug in his possession.In this context, the most obvious way in which the presumption can be rebutted is by establishing that the accused did not know that the thing in issue contained that which is shown to be the drug in question. Thus, for instance, the presumption could be rebutted successfully if the accused is able to persuade the court that the drug was slipped into his bag or was placed in his vehicle or his house without his knowledge.The inquiry under s 18(1) does not extend to the accused’s knowledge of thenatureof the drug. That is dealt with under the presumption of knowledge in s 18(2) where a person who is proved or presumed to be in possession of a controlled drug is presumed to have known “the nature of that drug”. … [emphasis added] 112 This suggests to me that once it is proved that an accused possesses the keys to the premises containing the drugs, a presumption of possession of the drugs arises regardless of his status vis-à-vis the premises. Pursuant to s 18(1)(c), possession of a thing (namely keys) granting physical control of the premises containing the drugs is treated as a presumptive indicator of physical possession of the drugs. The presumption applies without regard to whether the accused was an owner, tenant, non-occupier or mere visitor to the premises. This may appear draconian as it is conceivable that in some circumstances, an innocent party may hold a key but factually have such a loose connection to the premises that drugs not belonging to him could easily have been placed there without his knowledge or control. However, this is only a matter of relevance if actual physical control must be proved and not presumed; since the very purpose of s 18(1)(c) is to presume upon the physical control represented by a set of keys, s 18(1)(c) does not permit any room to layer on an additional inquiry as to whether the holder of the keys actually exercised physical control over the premises and if so, the degree of such control. Any evidence to the contrary, including evidence that the accused did not reside at or leave his belongings at the premises, will go towards rebutting the presumption of possession insofar as theactusreusof physical control is concerned. In addition, it should be recalled that inObengComfort, the Court of Appeal noted that the most obvious way to rebut the presumption is to dispute the mental element of possession,ie, by establishing that the accused did not know that the place contained the drug in question, for instance, by proving that the drug was placed there without his knowledge. 113 Having established that the s 18(1)(c) presumption is raised regardless of theaccused’s actual connection to the premises, I turn to the related issue of how the presumption operates in a situation where several occupants have possession of the keys to the room or premises. This is material to the present appeal because both the respondent and Sim have keys to the Kim Tian flat. 114 In the case ofPoonSoh Har and another v Public Prosecutor[1977–1978] SLR(R) 97 (“PoonSoh Har”), the first appellant surrendered two packets of heroin upon his arrest and informed CNB officers that he kept more heroin in a letter box and an apartment to which the second appellant held the keys. The apartment was tenanted by the second appellant’s mother and the second appellant was one of the “authorised occupants”. The appellants were charged with jointly trafficking heroin. On appeal, the first appellant’s conviction was upheld as the weight of the evidence, including his admissions, inculpated him. However, the Court of Appeal discharged the second appellant. The only admissible evidence linking the second appellant to the drugs was his possession of the keys to the letter box and the apartment. In a single succinct paragraph, the Court of Appeal held that the presumption under the equivalent sections to ss 18(1)(b) and 18(1)(c)of the MDA could not apply unless it was first proved that the second appellant had possession ofallthe relevant keys (at [24]). The expression “the keys” required strict proof. Since the second appellant was only one of four authorised occupants who each also had access to the letter box and the apartment using the other keys that were not in his possession, he didnotpossess all the relevant keys. Hence, the presumption could not be invoked. 115 The Court of Appeal proceeded to consider that there was no evidence that the heroin in the letter box was kept by the first appellant with the knowledge and consent of the second appellant; it was wrong to infer so because it could have been kept there using the other key (at [26]). Hence, the drugs could not be deemed to be in the second appellant’s possession by virtue of the equivalent section to s 18(4) of the MDA either. It appears to me that, in examining the offence of possession, the Court of Appeal did not draw any distinction between the application of the presumption and proof of possession. In this regard, it should be clarified that the applicability of the presumption is a separate inquiry from an assessment of the evidence adduced by either party to prove or disprove (as the case may be), including any evidence of an accused’s knowledge and consent to the presence of the drugs. 116 According toPoonSoh Har, the presumption under s 18(1)(c) only applies if the accused has possession ofallthe relevant keys (at [24]).PoonSoh Harwas cited by counsel in three subsequent cases where the courts sought to distinguish it on the facts. First, the case ofPublic Prosecutor v Oh Teh Hwa[1993] SGHC 208 was clearly distinguishable because the drugs were seized from the toilet and the accused possessed the sole set of keys as far as the toilet was concerned. Second, inPublic Prosecutor v TheoTeo Leng[1993] SGHC 84, the court distinguishedPoonSoh Haron the basis that the accused had all the relevant keys to the main door of the flat and the bedroom where the drugs were found. While the court noted that the accused had obtained the keys from a friend named Tong, it was not clear from the judgment whether Tong and the accused held two separate sets of keys.If there was only one set of keys,PoonSoh Harwas simply inapplicable. Finally, inPublic Prosecutor vChijioke Stephen Obioha[2008] SGHC 243, the accused was presumed under s 18(1)(c)to possess the cannabis found in the master bedroom rented by him because he held the keys to this room. His landlord also held a spare key but testified that she did not use it to enter the master bedroom during a period of about two weeks before the arrest. The defence relied onPoonSoh Haras authority that the presumption could not apply but the Prosecution sought to distinguish it on the basis that this was not a case in which three other persons also had access to the letter box and apartment in which the drugs were found. The court agreed without elaboration that the case was distinguishable (at [213]); this conclusion was not challenged on appeal. The decision can also be reconciled on the basis that possession was effectively proved because the only person who had actual access to the master bedroom was the accused since it was accepted by the court that the landlord did not enter the room for two weeks prior to the arrest notwithstanding that he had a spare key. Thus, the proposition inPoonSoh Harhas not been applied in any subsequent cases where it was cited to the court. 117 Going further, it is crucial to consider that the approach adopted by the Court of Appeal inPoonSoh Haris at odds with the more recent proposition that the accused’s status vis-à-vis the premises is irrelevant to the applicability of the presumption, as expressly recognised by the Court of Appeal inSharom([109]supra) and implicitly applied inRamanSelvam([106]supra).If the accused, in possession of the keys to the premises, is a mere visitor or tenant, it would commonly be the case that another person, such as the landlord or owner of the premises, would also hold a set of the keys. Yet the presumption has been held to apply in such situations against the accused.PoonSoh Haris also at variance with the proposition that the presumption arises upon simple proof of possession of “the key” (ObengComfort([111]supra)at [34]). 118 However, it bears highlighting thatObengComfort, unlike the present case, was not a case under s 18(1)(c) involving possession of keys to premises where the controlled drugs were found. Instead the presumption seems to have been invoked under s 18(1)(a). InSharom, the court ultimately did not have to rely on the presumption of possession under s 18(1)(c) as possession of the controlled drugs was found to have been proved; inRamanSelvam, the material issue was a factual one, namely whether the evidence disclosed that Selvam was in possession of a set of keys. Furthermore,PoonSoh Harwas neither cited nor discussed in any of these subsequent cases which have adopted a seemingly different approach. In short, none of the cases post-PoonSoh Harconsidered the applicability of the presumption in a situation where the accused does not have possession ofallthe keys to the premises where the controlled drugs were found. Hence, I would be slow to conclude that these subsequent Court of Appeal cases have implicitly overruledPoonSoh Har. However, in the light of the recent pronouncements by the Court of Appeal inRamanSelvam,SharomandObengComfort, it would be timely to revisitPoonSoh Harwhen the opportunity should arise in future. 119 A further point worth noting is that a conflicting interpretation of the same presumption was adopted by the Hong Kong Court of Appeal inRv Sin Yau-Ming[1992] 1 HKCLR 127 (“SinYau-Ming”). The case involved a challenge that certain presumptions in Hong Kong’s Dangerous Drugs Ordinance (Cap 134) infringed the Bill of Rights Ordinance 1991 (No 59 of 1991) (Hong Kong). One of these presumptions was s 47(1)(d) which like s 18(1)(c) of the MDA introduced a presumption of possession on the basis of possession of keys to a place. The provision, which has since been repealed, read as follows: (1) Any person who is proved to have had in his possession or custody or under his control: … (d) the keys of any place or premises or part of any place or premises in which a dangerous drug is found, … shall, until the contrary is proved, be presumed to have had such drug in his possession. The Hong Kong Court of Appeal interpreted the presumption to apply against each of several keyholders without requiring each to holdallthe keys (seeSinYau-Mingat 148, 164 and 167–168). It was on the basis of this interpretation and its implications for numerous keyholders and large premises that the court held that the presumption infringed the Bill of Rights. 120 Notwithstanding the conflicting authorities, the proposition inPoonSoh Harappears to remain good law in Singapore and, on its face, is binding on me. This is despite the fact that, in my view, on the facts ofPoonSoh Har, the presumption of possession would ultimately have been rebutted even if it had been raised; I reach this conclusion on the basis that the drugs were found to be in the first appellant’s possession. Nonetheless, it is not necessary for me to rule on the precise status ofPoonSoh Har, especially as this point was not specifically addressed by either party. For the reasons set out in the previous section, the respondent’s offence has been proved and the presumption in itself would not, in any event, have been sufficient to prove the offence of possession for the purposes of trafficking. 121 On the basis thatPoonSoh Harremains good law, and taking the caseat face value, the presumption in s 18(1)(c) does not arise in the present case. It is clear that the respondent did not have possession of all the keys. It is an uncontroverted fact that Sim also has possession of the keys as she is the owner of the Kim Tian flat and resides there at least occasionally. 122 However if the presumption under s 18(1)(c) were applicable, I would have found that the respondent has failed to rebut the presumptions under ss 18(1) and 18(2) of the MDA. The respondent’s defence in rebuttal of the presumption was summarised at [17] and [20] above. The Prosecution argued on appeal that the Trial Judge erroneously took the respondent’s bare assertions at face value and failed to consider the respondent’s true motive for storing drugs at the Kim Tian flat and the fact that his assertions were unsubstantiated. I dealt with the substance of these arguments at [78]–[82] above. I also explained my reasons for rejecting the respondent’s defence and placing full weight on his admissions in his statements. At this juncture, I highlight particularly that the respondent’s statements admitted to possession of the specific disputed drugs, and not only to his regular use of the premises where they were found. Further, Statement 2 explained when and how H1A1 and H1A2 came to be placed by the respondent at the Kim Tian flat while Statement 3 identified K1A as his own from among the other drugs stored in the drawer.",
        "Conviction": "123 In conclusion, based on the respondent’s admissions taken together with all the other evidence, I find the respondent guilty of the charge of possessing not less than 11.95g of diamorphine for the purposes of trafficking under s 5(1)(a) read with s 5(2) of the MDA.",
        "Sentence": "124 Having convicted the respondent of the trafficking charge, the final issue is the sentence to be imposed. As Sundaresh Menon CJ set out inVasenthad/o Joseph v Public Prosecutor[2015] 5 SLR 122 (“Vasentha”), the starting point for sentencing is the quantity of drugs trafficked. The quantity reflects the degree of harm to the society and the seriousness of the offence. The full spectrum of sentences prescribed for the offence should be considered and the indicative starting points for sentencing should be broadly proportional to the quantity of drugs trafficked or imported.InSuventherShanmugam v Public Prosecutor[2017] SGCA 25 (“Suventher”),the approach inVasenthawas used to derive indicative starting points for the unauthorised import or trafficking of 330g to 500g of cannabis, an offence which carries the same minimum and maximum punishments as trafficking between 10g and 15g of diamorphine. 125 I agree with the Prosecution’s submission that the sentencing ranges laid down inSuventhershould be applied to the present case. The court inSuventherspecifically noted that the sentencing ranges proposed there may be used in relation to offences involving other types of drugs where the range of prescribed punishment is the same (at [31]). Applying a conversion scale, the indicative starting points for the custodial sentence for trafficking between 10g and 15g of diamorphine are: (a) 10 to 11.5g: 20 to 22 years’ imprisonment;(b) 11.51 to 13g: 23 to 25 years’ imprisonment; and(c) 13.01 to 15g: 26 to 29 years’ imprisonment. These indicative starting points will then have to be adjusted, where appropriate, to reflect the offender’s culpability and the presence of aggravating or mitigating circumstances (seeVasenthaat [48]). 126 Since the quantity of diamorphine trafficked here was 11.95g, the starting point is a sentence around the one-third mark of the second band,ie, 23 years and 8 months’ imprisonment. The Prosecution submitted that a sentence in the upper range of the second band was warranted on the facts considering that the respondent committed the offence while released on bail and used a second location to perpetrate his drug trafficking activities. In my judgment, there are two reasons to elevate his sentence beyond the indicative starting point. First, he re-offended while on bail, a fact which indicates a lack of genuine remorse (seeVasenthaat [63]). Second, as I noted at [82] above, his use of the Kim Tian flat was directed at avoiding detection by the CNB in order to continue his unlawful conduct (seeVasenthaat [69]). 127 Accordingly, I sentence the respondent to 24 years 2 months’ imprisonment and the mandatory 15 strokes of the cane. As the respondent is currently serving an imprisonment term for offences to which he pleaded guilty on 13 January 2017, under s 322(1) of the CPC, the court is not entitled to backdate the sentence for his present conviction. In this situation, the only options for the court are for the sentence to commence either immediately or at the end of the imprisonment term which he is currently serving. My order is for the sentence to commence immediately, as the Prosecution had submitted.     Steven ChongJudge of Appeal Marcus Foo Guo Wen and Zulhafni Zulkiflee(Attorney General’s Chambers) for the appellant;"
    }
}