{
    "case_title": "TYS vTYT",
    "ncitation": "[2017] SGHCF 7",
    "coram": "Valerie Thean JC",
    "sections": {
        "Introduction": "1 The plaintiff (“the Husband”), aged 49, and the defendant (“the Wife”), aged 50, married on 30 January 1996. They have a son, aged 10, who is on the autism spectrum.1Foot Note 1×Report of the Child Guidance Clinic dated 26 August 2016 at p 5.The parties met while the Wife was a flight stewardess with the Singapore Airlines, where she worked until 2004. She then worked briefly with the National Kidney Foundation until sometime in 2005, when she became a housewife.2Foot Note 2×Wife’s 1st Affidavit of Assets and Means dated 18 March 2014.The Husband worked previously as a corporate banker and rose to the position of Managing Director and Singapore Market Head in the private wealth management division of a large and reputable international bank. Since 2009, the Husband has been involved in various business interests with partners in the US and China. In February 2012, the Husband relocated to the US, where he worked, to date, as the CEO of [A] Inc, a Nasdaq-listed company.3Foot Note 3×Husband’s Submissions dated 2 March 2016 at para 15; Wife’s Submissions dated 2 March 2016 at para 2.The Wife and son remained in Singapore. 2 The Husband filed for divorce in Singapore on 26 December 2012. The divorce proceeded on an uncontested basis under s 95(3)(e) of the Women’s Charter (Cap 353, 2009 Rev Ed) (“WC”) on the ground of four years’ of continuous separation from 2008. Interim judgment (“IJ”) was granted on 23 September 2013 (“IJ Date”). 3 I gave oral judgment on parties’ ancillary matters on 13 December 2016. The Husband appealed against my orders on the issues of asset division and maintenance for the Wife and their son. The orders made as to custody, care and control and access for the son are not the subject of appeal. These grounds of decision, accordingly, deal only with asset division and maintenance.",
        "Division of assets": "",
        "Operative date": "4 Parties agreed to use the IJ Date as the date for ascertaining the pool of matrimonial assets liable to division.4Foot Note 4×Notes of Evidence dated 7 November 2016.In terms of valuation, these were generally taken as at the IJ Date, or valuations as proximate to the IJ Date as available. For the two real properties concerned, the parties agreed to use the latest available values in or around March 2016.",
        "Assets in dispute": "5 In this case, the Wife valued the matrimonial pool at $15,140,095,5Foot Note 5×Joint Summary of Relevant Information dated 12 October 2015 (WS-1) at p 4.while the Husband proffered a valuation of around $3,334,546.6Foot Note 6×Husband’s Submissions dated 2 March 2016 at para 40.The Wife sought to add the following to the pool: (a) the sale proceeds of the Husband’s shareholdings in companies where he previously held business interests, [B] Ltd and [C] Pte Ltd; (b) the value of the Husband’s shareholdings in two companies, [D] Pte Ltd and [E] Group Ltd; (c) withdrawn deposits from the Husband’s bank accounts which were allegedly not accounted for by the Husband; and (d) the Husband’s unaccounted remuneration since his relocation to the US; and (e) an unreturned balance of $730,000 from a loan of $800,000 purportedly made to the Husband by the Wife. 6 The Husband, on his part, sought to add back monies withdrawn by the Wife from two bank accounts. 7 In the result, both parties alleged improper dissipation or concealment of assets by the other party, and each invited me to draw an adverse inference against the other. 8 Having heard the parties and examined the evidence (including the valuation reports) before me, I determined the total matrimonial asset pool to be $2,686,883.57. I now deal with the disputed assets in turn. Husband’s proceeds from sale of shares in [B] Ltd 9 The Husband previously invested in shares of [B] Ltd, which he later sold. The Husband was able to show account statements putting the value of the acquired 100,000 [B] Ltd shares at $26,000.7Foot Note 7×Husband’s 1st Affidavit of Asset and Means dated 18 March 2014 at p 28.In his second affidavit, however, he stated that he sold the shares for $25,000.8Foot Note 8×Husband’s 2nd Affidavit of Asset and Means dated 31 August 2015 at para 13.In submissions, his counsel explained that while the shares had in fact been sold at $25,000, the Husband was prepared to treat the proceeds as amounting to $26,000 on the basis of the account statements.9Foot Note 9×Husband’s Submissions dated 2 March 2016 at para 43. 10 The Wife valued these shares at a total of $1,139,000, comprising three sums of $39,000, $100,000 and $1,000,000, even though the shares were in fact sold for $25,000. The source for the first figure of $39,000 was a market valuation of the shares, which came from the Husband’s first affidavit10Foot Note 10×Husband’s 1st Affidavit of Asset and Means dated 18 March 2014 at p 29.and was clarified by his counsel as an error.11Foot Note 11×Husband’s Submissions dated 2 March 2016 at para 43.The second figure of $100,000 was explained by the Husband to be the purchase price of the shares. The third figure of $1,000,000 was explained by the Husband to be deposits made to his account by a business partner in order for the Husband to invest on his behalf in the same company, [B] Ltd.12Foot Note 12×Husband’s Submissions dated 2 March 2016 at para 46. 11 I accepted the Husband’s estimate of the [B] Ltd share proceeds at $26,000 based on the 20 December 2013 Central Depository Account statement reflecting the same.13Foot Note 13×Husband’s 1st Affidavit of Asset and Means dated 18 March 2014 at p 28.The alternative value of $39,000, which was the Wife’s first figure, reflected the market value of the shares in February 2013, but those shares had depreciated to around $26,000 by December 2013, which was a date nearer to the IJ Date. There were, however, aspects not entirely satisfactory about the Husband’s explanation. If indeed the shares had been sold at $25,000 as he claimed, there ought to be some evidence of the sale, which was at a quarter of the purchase price of $100,000. Regarding the Husband’s explanation for the Wife’s last figure of $1,000,000, this was explained as a business contact investing in the same company, [B] Ltd through his account, but there was no explanation of their relationship and how the Husband benefitted from what must be some kind of a commercial arrangement. The timing of the relevant deposits and withdrawal of that $1,000,000 sum also did not perfectly match. On the Husband’s own account, the $1,000,000 withdrawal was made in October 2011 while the deposits totalling that amount were made in April and December 2011, which were curiously far apart and the second deposit,ex postthe corresponding withdrawal. I was of the view, nevertheless, that since none of the figures provided by the Wife which comprised her estimate of $1,139,000 were attributable to the specific basket of the Husband’s [B] Ltd shares that were being valued as at December 2013, it would be better to consider the oddly-timed deposits and withdrawal as part of the Wife’s larger contention on the need for an adverse inference to be drawn, rather than to use the Wife’s figure as the value of the [B] Ltd shares specifically. Husband’s proceeds from sale of shares in [C] Pte Ltd 12 The Wife submitted that $3.1m was paid to the Husband when he sold his shares in [C] Pte Ltd and that he failed to satisfactorily account for those proceeds. The Husband did not dispute that he was paid this $3.1m for a project known as the [Ch] Project. He did, however, submit that these monies were paid to him before the divorce proceedings had commenced, and explained his use of the money by reference to a table setting out the debits from, and credits into, his various investment accounts.14Foot Note 14×Notes of Evidence dated 13 December 2016; Husband’s Submissions dated 2 March 2016 at Tabs U, V and W. 13 From the table drawn up by the Husband for the investment accounts, it appeared that the Husband’s investments yielded a net surplus of $2.1m. This was a substantial sum which expenditure must be accounted for. The Husband’s bald contention was that part of these monies was spent on the family and on mortgage payments for their real properties. In the light of the Husband’s contentions, and there being no value of the expended surplus attributable specifically to these [C] Pte Ltd’s shares, I was of the view that it would be better to deal with the Wife’s submissions on this issue, as with the contentions surrounding the proceeds to be attributed to sale of the shares of [B] Ltd, on a holistic basis under the analysis on adverse inference against the Husband. Valuation of the Husband’s interests in [D] Pte Ltd and [E] Ltd 14 The Husband produced valuation reports for his two companies, [D] Pte Ltd, in which the Husband held 50% of its issued shares, and [E] Group Ltd, in which the Husband held 12.5%. [D] Pte Ltd was a joint venture between the Husband and a partner company which was set up in 2009. [E] Ltd, in turn, was a joint venture between [D] Pte Ltd and a Chinese company, set up to invest in [A] Inc. In order to have greater control over [A] Inc as its Asian investors, the Husband became [E]’s nominee director on its Board, and later, its CEO. 15 These valuation reports showed that [D] Pte Ltd was valued at $97,304 as at 31 December 2015.15Foot Note 15×Valuation Report by Straits Assurance PAC dated 21 June 2016 (“P1”).[E] Ltd, on the other hand, was said to be in negative equity for a sum over US$21m as at 31 December 2015.16Foot Note 16×Valuation Report by Straits Assurance PAC dated 21 June 2016 (“P2”).Both valuations were done on a Net Tangible Asset basis. Thus, the Husband’s position was that his shares in [D] Pte Ltd was worth $48,652 (being 50% of the value of the company) and that no value should be attributed for his shares in [E] Ltd. 16 The Wife submitted that these valuations, and in particular the report on [D] Pte Ltd, were inaccurate and one-sided. In the [D] Pte Ltd report’s reconciliation of intangible assets, a subsidiary (which was not disclosed and of which nothing was known) was struck off because of a disposal of trading shares “to fund Singapore operation (sic)”. No detail as to that disposal could be found, but some $968,249 arising from goodwill on consolidation of that subsidiary was written off for the 2015 accounts. In the same report’s reconciliation of investments in associate companies, it appeared that the net tangible assets of [D] Pte Ltd at 2014 was $7,970,489, but strangely plummeted the next year to $381,060.17Foot Note 17×Wife’s Supplemental Submissions dated 7 November 2016 at para 57.The single-line explanation was that this arose from a de-recognition of [E] Ltd, because [D] Pte Ltd’s holding in [E] Ltd was reduced to 25%. The audited accounts upon which the reports were premised were not enclosed within the reports. The Wife questioned the independence of the valuation reports, which she suggested may had been tailored to aid the position of the Husband.18Foot Note 18×Notes of Evidence dated 13 December 2016.The reports were not detailed and the maker of the valuation reports, who had prepared the audited accounts, was cross-examined by counsel for the Wife, without much light being shed. The valuer was not able to explain the various details, and also conceded that there was a potential conflict of interest in his valuing the companies after having earlier audited their accounts.19Foot Note 19×Notes of Evidence dated 13 December 2016.The Wife contended that I should value [D] Pte Ltd based on its paid up share capital of $4,580,000 and that accordingly the Husband’s share in [D] Pte Ltd was worth $2,290,000.20Foot Note 20×Wife’s Supplemental Submissions dated 7 November 2016 at para 58. 17 Counsel for the Wife had a point regarding the probative value of the valuations and the valuer. In my judgment, however,betweenthe Wife’s reliance on paid up share capital and the Husband’s reliance on net tangible assets, the latter was more reliable. The paid up share capital is a historical figure and not an accurate reflection of the present value of the companies. Further, while counsel for the Wife queried the plummeting of the $7.98m net tangible asset figure in 2014 to $381,060 in 2015, he did not provide the court with any viable alternatives. He did not object to the December 2015 date of assessment used in the report, and yet he provided no alternative figure to the company’s net tangible asset in 2015. Nor did he submit that the 2014 figure should be adopted. The Husband’s valuation of the companies was therefore the only available valuation before the court, and I accordingly adopted it despite my reservations. Nevertheless, while I used the Husband’s valuation of [D] Pte Ltd and [E] Group Ltd for the purposes of the delineating the asset pool, it was clear that the two companies formed a vehicle and platform for the Husband to pursue other business interests, as he had with the Chinese company which placed him as [E] Ltd’s nominee director in [A] Inc, which was in turn a stepping stone to his placement as CEO of [A] Inc. For this reason, necessary adjustments were made later in the final orders. Husband’s cash deposits 18 The Wife contended that the Husband failed to satisfactorily account for $5,314,122 which was deposited into the Husband’s bank accounts as cash and subsequently withdrawn.21Foot Note 21×Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at paras 36-42.In reply, the Husband submitted the Wife simply added the withdrawals from the bank accounts to come up with this figure without taking into account the deposits made into the same. This, he argued, was unprincipled.22Foot Note 22×Husband’s Submissions dated 2 March 2016 at paras 54-57. 19 I agreed with the Husband that the Wife’s arguments in relation to the $5,314,112 sum was a non-starter. The manner in which the Wife arrived at this sum–by adding up all the withdrawals from the account without consideration of the deposits – was clearly not sound. Nevertheless, the Husband’s larger explanation on his deposits and withdrawals required to be properly dealt with in consideration of whether any adverse inference should be drawn against the Husband. Husband’s savings from remuneration 20 The Wife further argued that the Husband failed to account for his savings from remuneration obtained from February 2012 to 2016. The Wife pointed out that the Husband initially declared that he had no income during this period. In 2014, however, he had an annual income of US$300,000 coupled with share options.23Foot Note 23×Notes of Evidence dated 7 November 2016.The Wife thus backdated the Husband’s salary to 2012 and accounted for reasonable living expenditure to arrive at a savings figure of $864,000.24Foot Note 24×Joint Summary of Relevant Information dated 30 September 2016 at item 9.The Wife submitted that this sum should be included as part of the matrimonial pool. While initially agreeing to use the IJ Date as the operative date for determining the assets constituting the matrimonial pool, the Wife somewhat reneged from that position by claiming that reasons existed for including this particular sum in the pool even though it was accrued post-IJ Date. In reliance onARY v ARX[2016] 2 SLR 686 (“ARYv ARX”), she contended that the Husband had in 2012 deserted her and their son, who has special needs, to pursue his new life and new career in the US. He was able to do this only because the Wife fulfilled all their shared marital duties while he was away. Further, even before the Husband’s relocation to US, the Wife had been the sole caregiver of the son, thereby allowing the Husband to concentrate on his work and eventually find the opportunity to pursue a lucrative career in the US.25Foot Note 25×Wife’s Supplemental Submissions dated 7 November 2016 at paras 12-13.For these reasons, the Wife urged the court not to exclude the savings figure from the matrimonial pool simply because they had been amassed by the Husband post-IJ Date.26Foot Note 26×Wife’s Supplemental Submissions dated 7 November 2016 at para 10. 21 In my judgment, this sum should not be added into the pool for division because a large component of it was the Husband’s savings from his salary, which only came into being after the IJ Date. It was not disputed that the Husband’s current employment agreement as CEO of [A] Inc commenced in 2014. In his first two years with [A] Inc, his evidence was that he earned only $3,000 a month because his involvement was being tested,27Foot Note 27×Husband’s Submissions dated 2 March 2016 at para 15.and there was no evidence to the contrary. I was not satisfied that I should depart from the general position of the IJ Date being the operative date for this particular sum of money. The Court of Appeal’s guidance inARYv ARXat [31] was that “while the court retains the discretion to select the appropriate operative date… there is much to be said that, unless the particular circumstances or justice of the case warrant it, the starting point or default position should be the date that interim judgment is granted”.In this case, the ground for divorce was that the parties had lived separately for four years prior to the filing of the divorce petition, which meant that parties had lived largely separate lives from 2008. To include as part of the matrimonial pool savings from income accrued some six years after the parties’ separation would not, to my mind, have been just and equitable. Husband’s purported loan from the Wife 22 The Wife submitted that she lent the Husband some $800,000 in September 2010, of which the Husband only returned $70,000. There thus remained $730,000 outstanding, which was a matrimonial asset and ought to be added to the pool.28Foot Note 28×Wife’s 1st Affidavit of Assets and Means dated 18 March 2014 at para 12.The Husband, on the other hand, claimed that he was the source of at least $500,000 of the loan, which he had paid to the Wife to hold on trust for their son.29Foot Note 29×Husband’s Submissions dated 2 March 2016 at para 61.He noted that the Wife’s own affidavit alluded to the fact that her giving of the $500,000 to the Husband was only a repayment of what he had earlier given to her.30Foot Note 30×Husband’s Submissions dated 2 March 2016 at para 62.He also invited the court to infer,interalia, that the Wife had relied on the $500,000 from him when she opened a Maybank Trust account for the son in September 2007 with a starting balance of around $1.26m, which was otherwise a large sum for her given that she had stopped working in 2005.31Foot Note 31×Husband’s Submissions dated 2 March 2016 at paras 63-68.In reply, the Wife did not counter most of the Husband’s submissions, but rather asked this court to hold the Husband to his alleged agreement to use the $800,000 for a trust fund for the son rather than for himself.32Foot Note 32×Wife’s Supplemental Submissions dated 7 November 2016 at para 78.I did not agree that that was the appropriate role of the court in determining the size of the matrimonial pool. In any event, on balance, although I considered that the Wife worked as a leading stewardess for some 16 years and may have had significant savings, I was not satisfied that the evidence was sufficient to establish the Husband’s liability to the Wife for the sum of $730,000. Adverse inferences against the Husband 23 Relevant to my findings at [11], [13], [17 and 19], and also as a result of the bank account statements obtained in discovery, the Wife asked for an adverse inference to be drawn against the Husband.33Foot Note 33×See Wife’s Supplemental Submissions dated 7 November 2016 at paras 4-58. 24 Generally, two requirements must be met for the court to draw an adverse inference (seeKoh Bee Choo v Choo Chai Huah[2007] SGCA 21 (at [28]) andChan Tin Sun v Fong Quay Sim[2015] 2 SLR 195 (“Chan Tin Sun”) (at [62])): (a) a substratum of evidence that establishes aprima faciecase against the person against whom the inference is to be drawn; and (b) that person must have had some particular access to the information he is said to be hiding. 25 In the present case, the Husband provided various bank statements and corporate documents during the disclosure process, in particular by his affidavit dated 22 December 2014, which including the exhibits spanned close to 500 pages. In his later submissions, he also tendered an extensive Microsoft Excel table detailing the debits from and credits into his various bank accounts34Foot Note 34×See Husband’s Submissions dated 2 March 2016 at Tab W.in a bid to demonstrate that most withdrawals relating to his investments had been returned to those account, and there was little that had not been accounted for.35Foot Note 35×Husband’s Submissions dated 2 March 2016 at para 59.In reply, the Wife submitted that the documents disclosed and tables prepared raised more questions than it answered. The voluminous, incomplete, and inconsistent documentation also made it close to impossible to verify the truth of the Husband’s claims and whether monies had indeed been siphoned off.36Foot Note 36×Notes of Evidence dated 7 November 2016; Wife’s Supplemental Submissions dated 7 November 2016 at paras 4-58. 26 In my judgment, it was appropriate to draw an adverse inference against the Husband in this case. Based on the Husband’s own submissions, there was a net surplus of around $2.1m across his various investment accounts.37Foot Note 37×Husband’s Submissions dated 2 March 2016 at Tab W.Yet, the amount left was only $132,699.38Foot Note 38×Notes of Evidence dated 7 November 2016.This expenditure of more than $2m was not satisfactorily accounted for. The Husband asserted that the sum was legitimately used for investment purposes and as mortgage repayments for the family’s real properties.39Foot Note 39×Husband’s Submissions dated 2 March 2016 at para 60.However, he did not adduce sufficient primary evidence to show the nature and veracity of his investment and share portfolio despite this being a matter to which he had particular access. His various statements in his submissions that he “reserved the right” to produce the relevant documents were also unacceptable:40Foot Note 40×Husband’s Submissions dated 2 March 2016 at para 59.the duty of disclosure was his, and he was obliged to produce the relevant documents from the outset. Apart from the issue of adverse inferences that may be drawn from a lack of documentation, the court will make its decision based on the evidence before it. The onus is on him to prepare and prove his case. The tabulation of investments incomings and outgoings contained the barest of descriptions, no aggregation, and no explanation of the linkagesinter seeven for large transactions.41Foot Note 41×See Husband’s Submissions dated 2 March 2016 at Tabs U and V; Husband’s Affidavit dated 23 April 2015.To the extent that counsel for the Husband sought to explain that the funds were used for investment in the US,42Foot Note 42×Notes of Evidence dated 13 December 2016.I agreed with the Wife that it raised more questions than it answered. I thus did not accept the Husband’s explanations in respect of the subsequent reinvestments. As regards the mortgage payments and family expenses, the expenditure would have amounted to around $525,000 for each of the 4 years in question, which was unusually and unacceptably high, in particular considering that the mortgage loans stated in the Husband’s affidavit were only in the low thousands per month.43Foot Note 43×See Husband’s Submissions dated 2 March 2016 at paras 75 and 77.Further, when questioned, counsel for the Husband’s stated that the sums spent as mortgage payments and on the family totalled around $840,500.60,44Foot Note 44×Notes of Evidence dated 7 November 2016.leaving an outstanding sum of more than $1m unaccounted for, even taking his case at the highest. Counsel’s response was that they could not trace every transaction.45Foot Note 45×Notes of Evidence dated 7 November 2016.The Husband’s submissions also highlighted the fact that the Wife sought interrogatories of only transactions over $10,000, which led to some transactions being left out.46Foot Note 46×Husband’s Submissions dated 2 March 2016 at para 57.While the court does not expect either party to document every single transaction, there was in this case a large amount of unexplained expenditure over a relatively short period. 27 Furthermore, as part of his expenditure, the Husband claimed that he incurred gambling losses of over $500,000 from 2011 to 2012.47Foot Note 47×Husband’s Submissions dated 2 March 2016 at Tab W; see also tabulation of gambling expenditures in Wife’s Supplemental Submissions dated 7 November 2016 at para 34.He averred that gambling was part of his lifestyle and was part of his entertainment of Chinese clients.48Foot Note 48×Notes of Evidence dated 7 November 2016.In my view, the Husband’s gambling losses had not been sufficiently accounted for. It was insufficient for him to simply assert that such significant expenditures were part of his business activities. Such a claim, just like the Husband’s claims of reinvestment of the surplus from the investment accounts, was all too convenient to make. Without some form of evidence to back up the assertions, which the Husband was uniquely placed to produce, these claims were essentially irrefutable. The Wife submitted that the gambling losses should be notionally added back to the pool for being unreasonably depleted. She further submitted that a fair credit should be given for the Husband’s gambling gains of $136,000, such that a total sum of around $364,000 should be added back to the asset pool.49Foot Note 49×Wife’s Supplemental Submissions dated 7 November 2016 at para 39.I agreed that gambling losses are not reasonable expenditure. Nevertheless, in my view, because of the larger concerns about the Husband’s expenditure at hand, this gambling expenditure should not be considered on a piecemeal basis, but rather in a broader context of the whole of the unexplained expenditure. 28 For these reasons, I was satisfied that an adverse inference should be drawn that there were other assets in the pool in the Husband’s custody which were not accounted for before me. The means by which an adverse inference may be given effect is fact-specific, including “by ordering a higher proportion of the disclosed assets to the other party, or, where possible, [by determining] the actual value of the undisclosed assets based on available information, and include such value in the pool of assets to be divided” (Chan Yuen Boey v Sia Hee Soon[2012] 3 SLR 402 at [21]) As the incoherent state of the accounts – which was contributed to by the Husband – made it impossible to add a finite sum to the pool (cf Chan Tin Sunat [66]), or to attribute the adverse inference to any particular asset within the pool, I was of the view that the most appropriate method to give effect to this inference was by way of a general uplift to the final orders made. Adverse inferences against the Wife 29 The Husband submitted that the Wife failed to account satisfactorily for withdrawals of $454,298.63 from her Maybank account50Foot Note 50×Husband’s Submissions dated 2 March 2016 at para 66.and $132,000 from her POSB account,51Foot Note 51×Husband’s Submissions dated 2 March 2016 at paras 70-72.for a total of around $589,000. Both withdrawals were larger than the usual transactions in those accounts, and were made in 2013 which was close to the IJ Date.52Foot Note 52×Notes of Evidence dated 7 November 2016.Before me, counsel for the Wife explained that part of the withdrawal was made to repay the Wife’s mother in respect of a loan the Husband had taken from his mother-in-law, and that some of the withdrawals were for fixed deposits that had reached the end of their terms.53Foot Note 53×Notes of Evidence dated 7 November 2016. 30 I accepted the Wife’s submission that, as these contentions were raised for the first time during submissions and not posed specifically earlier in interrogatories, she may not have had a full opportunity to respond properly to the allegations.54Foot Note 54×Notes of Evidence dated 7 November 2016.His submission were suggestive of a last minute attempt to contend dissipation on her part in retaliation to her contentions as to dissipation on his part. All things considered,even ifthe Wife’s explanation of these withdrawals were not entirely satisfactory, her alleged dissipation of about $589,000 had to be considered in the context of the Husband’s dissipation of a far larger sum. This was not a case where “any adverse inference I can draw against one party would be met and neutralised by an adverse inference against the other party” (AZZ v BAA[2016] SGHC 44 (“AZZ v BAA”) at [119]). As highlighted above, the Husband’s gross admitted gambling expenses already came to some $500,000. I was thus of the view that, considering also the unexplained movements in the Husband’s investment accounts, any dissipation on his part was larger than the sum at hand which he contended remained unaccounted for by the Wife. Accordingly, an uplift in favour of the Wife remains necessary to give effect to the more significant adverse inference drawn against the Husband.",
        "Excluded items": "31 In this case, each party was driving a car that was held in the other party’s name. Counsel agreed that it would not be cost efficient for any orders of transfer between parties and the status quo should be maintained.55Foot Note 55×Notes of Evidence dated 7 November 2016.The Husband also owned a car in the US, but that was an acquisition after the IJ Date and thus not part of the matrimonial pool. No orders were made for any of the cars in the result.",
        "Table of Assets": "32 In light of the above findings and the agreed facts, the pool of matrimonial assets was as follows: Joint AssetsS/NAsset DescriptionValueComments1Balmoral condominium$1,555,664.54Agreed.Gross value was $2.3m.56Foot Note 56×Notes of evidence dated 7 November 2016; Joint Summary of Relevant Information dated 30 September 2016 at Joint Assets item 1.Total$1,555,664.54Wife’s AssetsS/NAsset DescriptionValueComments1NTUC Wholelife Policy No 001195XXXX$40,694.21Agreed.57Foot Note 57×Joint Summary of Relevant Information dated 30 September 2016 at Wife’s Assets item 1.2POSB Savings 172-06XXX-X$14,578.19Wife’s valuation preferred.58Foot Note 58×See above at [30]; Joint Summary of Relevant Information dated 30 September 2016 at Wife’s Assets item 2.3Maybank Trust Account No 1-406-60-0XXX-X$9,395.40Wife’s valuation preferred.59Foot Note 59×See above at [30]; Joint Summary of Relevant Information dated 30 September 2016 at Wife’s Assets item 3.4CPFOrdinary AccountMedisave AccountSpecial Account$654.80$36,410.01$25,527.95Agreed.60Foot Note 60×Joint Summary of Relevant Information dated 30 September 2016 at Wife’s Assets item 4.Total$127,260.56Husband’s AssetsS/NAsset DescriptionValueComments1Simei flat$596,429.34Agreed.Gross value was $0.85m.61Foot Note 61×Notes of evidence dated 7 November 2016; Joint Summary of Relevant Information dated 30 September 2016 at Joint Assets item 2.2CPFOrdinary AccountMedisave AccountSpecial Account$4,205.85$150,471.99$45,500Agreed.62Foot Note 62×Joint Summary of Relevant Information dated 30 September 2016 at Husband’s Assets item 2.3[B] Goldmine share proceeds$26,000Husband’s valuation preferred.63Foot Note 63×See above at [11].4Bank AccountsUOB Uniplus 324-379-XXX-XDBS 069-002XXX-XCitibank Checking XXXX8063Citibank Checking XXXX8004$12,842.22$2,303.04$5,154.92$112,399.11Agreed.64Foot Note 64×Joint Summary of Relevant Information dated 30 September 2016 at Husband’s Assets item 2. There appeared to have been a typographical error in the Wife’s figure for the UOB Uniplus account, and she had earlier provided the figure of $12,842.22 in her Joint Summary dated 12 October 2015.5[D] Pte Ltd (50% shareholding)$48,652Husband’s valuation preferred.65Foot Note 65×See above at [17].6[E] Ltd (12.5% indirect shareholding through [D] Pte Ltd)NilCompany in negative equity66Foot Note 66×See above at [17].Total$1,003,958.47Grand total$2,686,883.57",
        "Division of the asset pool": "33 The Court of Appeal set out the structured approach inANJ v ANK[2015] 4 SLR 1043 (“ANJ”) (at [17]–[30]) to work out a just and equitable division of matrimonial assets. This approach may be summarised as follows (ANJat [36];Twiss, Christopher James Hans v Twiss, Yvonne Prendergast[2015] SGCA 52 at [17]): (a) express as a ratio the parties’ direct contributions relative to each other, having regard to the amount of financial contribution each party made towards the acquisition or improvement of the matrimonial assets; (b) express as a second ratio the parties’ indirect contributions relative to each other, having regard to both financial and non-financial contributions; and (c) derive the parties’ overall contributions relative to each other by taking an average of the two ratios above, keeping in mind that, depending on the circumstances of each case, the direct and indirect contributions may not be accorded equal weight, and one of the two ratios may be accorded more significance than the other. Adjustments can also be made in respect of other relevant factors under s 112 or 114(1) of the WC. I shall hereinafter refer points (a)–(c) above as “Step 1” to “Step 3” respectively. Step 1: Direct contributions 34 Due to the unsatisfactory state of documentary evidence in this case, it was necessary for the court to exercise its discretion to make a “rough and ready approximation” based on the evidence before it, as was the approach permitted by the Court of Appeal inANJ(at [23]) andNK v NL[2007] 3 SLR 743(at [28]). 35 Regarding the parties’ direct contributions to the matrimonial assets, the Husband claimed that the ratio vis-à-vis the Balmoral condominium was 85.4:14.6, and that he had entirely funded the Simei flat.67Foot Note 67×Husband’s Submissions dated 2 March 2016 at paras 76 and 78.However, he failed to make a calculation of his direct contribution in relation to the entire asset pool. 36 The Wife, on the other hand, claimed that the direct contribution ratio ought to be 70:30 in favour of the Husband, on the basis that she had contributed to the acquisition of various properties bought prior to the Balmoral condominium and was thus entitled to their sale profits and rental yields, which were eventually ploughed back in part into the acquisition of the Balmoral condominium.68Foot Note 68×Wife’s Supplemental Submissions dated 7 November 2016 at para 61; Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at paras 15-24.It was not disputed that the couple had owned several properties in a series of acquisitions. Their first home was sold and two others purchased, with rent from one going towards the mortgage for the other. Another home was purchased in 2008 with proceeds from the earlier two, and then later, the Balmoral condominium and the Simei flat. As the Wife had worked from 1990 to 2005, her CPF and cash savings went into the earlier properties. While the Wife admitted that she could not provide the exact details because she had left these matters entirely to the Husband, she estimated her contribution to be about 30% on a rough and ready basis.69Foot Note 69×Wife’s Supplemental Submissions dated 7 November 2016 at para 62. 37 I was not entirely satisfied with the manner in which the Wife arrived at her direct contribution ratio. She made an unsubstantiated claim that she contributed 30% to the matrimonial pool, while in the same breath acknowledging that she did not have any details or documentation as to her contribution. Further, at an earlier juncture in these proceedings, the Wife had claimed a more ambitious direct contribution rate of 40% for herself.70Foot Note 70×Joint Summary of Relevant Information dated 30 September 2016.There was no explanation as to the inconsistency between the figures. 38 Nevertheless, it was common ground that the Wife had contributedat least14.6% to the purchase of the Balmoral condominium, which constituted more than 80% of the total asset pool.71Foot Note 71×Husband’s Submissions dated 2 March 2016 at para 97. 39 The issue of the parties’ direct contribution as regards the rest of the matrimonial pool was less clear. It was undisputed that the parties had bought and sold various properties in the lead up to the purchase of the Balmoral condominium. For these earlier properties, the Wife had contributed CPF and cash from her working years. Any rental yield and other proceeds from these properties would thus have to be attributed in proportion between the parties. The Husband submitted that the Wife contributed around $90,000 via CPF to the first property purchased by the parties sometime in 2009, and thereafter merely turned over the same sum when old properties were sold for newer acquisitions. Thus, the Wife was said to have contributed no more than around $90,000 to the purchase of any properties.72Foot Note 72×Husband’s Submissions dated 2 March 2016 at para 92.I did not accept this. Many of the Husband’s statements of the property acquisition history were vague, unsupported, and did not stand scrutiny even if taken at their highest. For instance, instead of showing specifically that he was solely responsible for the purchase price of one “River Place”, he merely contended that since there had been no excess in rental received from another property after its mortgage repayment was made, he must have been the party who wholly contributed to River Place.73Foot Note 73×Husband’s Submissions dated 2 March 2016 at paras 84-86.Further, even if we assumed that the Wife started with a $90,000 contribution, that did not necessarily mean that she had to end with a $90,000 contribution cap. The Husband conceded at least some sale profits from the history of property acquisition;74Foot Note 74×Husband’s Submissions dated 2 March 2016 at paras 81, 84, 86, 89, 91.if so, it was not for him to attribute all of these profits to himself without giving fair credit to the Wife.75Foot Note 75×Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at para 7In fairness, the Wife’s evidence tracing the inflows and outflows into these earlier acquisition was also shaky, and often based only on her own recollection.76Foot Note 76×Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at para 5. 40 In these circumstances, while both parties’ evidence as to the extent and attribution of the rental yields and sale profits from the history of acquisitions were less than ideal, I found that there must at least have beensomesuch proceeds in existence, which must then be attributed to the Wife and Husband in proportion to their contributions to the original acquisition.77Foot Note 77×See Husband’s Submissions dated 2 March 2016 at paras 88-92.Since these proceeds were ploughed back into the purchase of other matrimonial assets other than the Balmoral property, such as the Simei flat and other investments,78Foot Note 78×See Husband’s Submissions dated 2 March 2016 at para 89; Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at para 24.the Wife’s direct contribution in this regard to the other properties in the matrimonial pool must too be recognised. This was so even if it was impossible to precisely quantify and trace such contribution into any particular matrimonial asset. Indeed, a broad brush approach was necessitated by the evidential deficiencies in both parties’ cases, and the fact that there had been intermingling of direct contributions, and cross-subsidisation of proceeds of one property towards the mortgage payments of another.79Foot Note 79×See Wife’s 2nd Affidavit of Assets and Means dated 31 August 2015 at paras 19, 24.In the circumstances, based on the evidence before me, I found it just and equitable to attribute a global direct contribution ratio of 85: 15 in favour of the Husband. Step 2: Indirect contributions 41 This was a 17 year marriage up to the time of the IJ. The Husband conceded that the Wife had been the primary caregiver of the son since his birth, but relied upon his having paid for the bulk of the family’s expenses as his indirect contribution. Computing this over two periods – the first 10 years in which both parties were working full time, and the next 8 years in which the Husband was the primary breadwinner while the Wife was looking after the son – the Husband arrived at an average of 55:45 in indirect contribution in favour of himself.80Foot Note 80×Husband’s Submissions dated 2 March 2016 at paras 93-95.The Wife, on the other hand, pointed out that the Husband had been focused on his career throughout the marriage, that she left her job as a leading stewardess with Singapore Airlines in 2004 at his behest as they wanted to start a family, that she had been the son’s primary caregiver since his birth, and that he relocated to the US in pursuit of his own career in 2012 leaving her to shoulder the full burden of care for the home and son, who has special needs. In recognition of all her sacrifices for the family, she contended that the indirect contribution ratio should be 80:20 in her favour.81Foot Note 81×Wife’s Supplemental Submissions dated 7 November 2016 at paras 69-70. 42 I accepted that in the initial years of the marriage, the indirect contributions as a whole would tend to be in favour of the Husband. The Husband was the primary breadwinner, even though both parties were working.  The significantly higher income of the Husband allowed the Wife to enjoy a standard of living that she otherwise might not be able to.82Foot Note 82×Husband’s Submissions dated 2 March 2016 at para 94.Credit ought to, and was, given for his significant indirect financial contributions. 43 This balance changed, however, when the parties tried to conceive. In or about 2004, they turned to in-vitro fertilization (“IVF”) treatment after being childless for around 8 years. This entailed significant sacrifices on the part of the Wife, who gave up her career and went through IVF for almost 2 years.83Foot Note 83×Wife’s Supplemental Submissions dated 7 November 2016 at para 68.The relevance of IVF treatment to indirect contribution, in recognition of the “high toll” it exacts on the mother, physically, emotionally and psychologically, was recognised by the High Court inAVM v AWH[2015] SGHC 194 (at [64]). Further, even after the birth of their son, it must have been extremely difficult for the Wife to serve as the primary caregiver of their son who, being on the autistic spectrum, required particular care and attention. Reference was made toAZZ v BAA, where the High Court augmented the wife’s indirect contribution because the son’s special needs had required more by way of indirect contribution from the wife (at [159]). Save for the first ten months, the Wife also managed throughout these 17 years without a helper. After the Husband’s relocation to the US in 2012, even though he continued to pay for the mortgage, home outgoings and the son’s classes, the Wife had to bear even greater responsibility in taking care of the son and household, and together they managed on only about $2,500 each month. While the Husband contended that his pay was $3,000 per month for the first two years of his involvement with [A] Inc, this was a unilateral and strategic move on his part to enhance his career, with attendant sacrifices made on the part of his family. On the balance of considerations, it was clear that the Wife made significantly greater indirect contribution to the family across the length of the marriage than the Husband, who concentrated on his career throughout the marriage, travelled extensively, and left the household to the care of the Wife. I therefore set the ratio for indirect contribution at 75:25 in favour of the Wife. Step 3: Adjustment of the average ratio 44 InANJ, the Court of Appeal set out the following non-exhaustive circumstances where the court could shift the average of the direct and indirect contribution ratios in favour of one party: (a) the length of the marriage, with indirect contributions featuring more prominently in long marriages; (b) the size of the matrimonial assets and its constituents, if extraordinarily large; and (c) the extent and nature of indirect contributions made (at [27]). Fundamental to this case is the Court of Appeal’s additional guidance that adjustments could be made for the factors stipulated in ss 112 and 114 of the WC (at [28]), and to give effect to any adverse inference (at [29]). 45 As explained earlier, I decided to use the uplift approach to address the adverse inference because it was not practicable to come to a finite sum for the Husband’s non-disclosure. The cases adopting an uplift approach cover a broad range of facts. InAu Kin Chung v Ho Kit Joo[2007] SGHC 150, the High Court upheld the decision of the district judge who increased the wife’s share from 50% to 70% on account of husband’s failure to give full and frank disclosure of his assets (at [45]). InChan Pui Yin v Lim Tiong Kei[2011] 4 SLR 875, the wife was awarded a further 10% of the value of the disclosed assets of $10.95m (at [52]). Therefore, the wife was awarded 30% of all the remaining assets save for the matrimonial property, which was separately divided. While the general uplift approach may be criticised as being arbitrary since there is no objective value to which it may take reference (AZZ v BAAat [120]), I considered that some degree of arbitrariness was inevitable as adverse inferences were drawn precisely to deal with situations of imperfect and incomplete information, and discarding the uplift approach entirely may create a perverse incentive for parties to tactically craft non-attributable non-disclosure. In the final analysis, much would depend on the facts, and in determining the appropriate uplift, the court will be guided by,inter alia, the evidence before it as to the extent of non-disclosure relative to the value of the disclosed assets. 46 On the facts of this case, this was not an extraordinarily long marriage nor was the asset pool extraordinarily large. If equal weightage was given to both direct and indirect limbs, the final division ratio would be 55:45 in favour of the Husband. In my judgment, two factors called for a more unusual order in this case: (a) the adverse inference drawn against the Husband’s financial position, and (b) the needs of the family. 47 I have set out my reasons on drawing an adverse inference against the Husband above. In respect of the family’s needs, of relevance was the fact that the son was on the autistic spectrum. In view of this, the stability and familiarity of living environment were both fundamental to his continued wellbeing. The Balmoral condominium is also a short walk from his school and convenient for the family. The Husband, to his credit, recognised this fact and offered to allow the Wife and the son to continue residing in the Balmoral condominium, and to transfer the property to the Wife after it has been paid down or the son completes his university education, whichever is later. In the meantime, he also indicated a willingness to continue paying the mortgage payments and outgoings of the Balmoral condominium, in recognition of the fact that any move to a new home and change in environment would be unsettling for the son.84Foot Note 84×Husband’s Submissions dated 2 March 2016 at para 98. 48 The issue, then, was whether I should defer the sale of the Balmoral condominium on the terms suggested by the Husband, or to order the transfer of the property immediately. The loan redemption would cost about $750,000. Adding the value of this mortgage redemption into the original asset pool of $2,686,883.57 would give a new value of $3,436,883.57, an enhancement of 22% within the new pool. The question that was crucial here was whether the Husband had at hand a source of funds to pay down the outstanding loan on the property and effect its transfer.85Foot Note 85×Notes of Evidence dated 6 October 2016; Notes of Evidence dated 7 November 2016.Having regard to all the facts, I was certain that he would be able to do so. He was clearly a man of substantial means and connections. Prior to setting up his various businesses, he had been the Managing Director and Singapore Market Head of private banking in a large and well-respected international bank. The couple’s real estate transactions in the run up to the Balmoral condominium purchase were also clearly astute business decisions. Parties did not dispute that the Husband had planned and effected these property investments. His bank accounts continued to show very high investment activity but his investment portfolio, which would no doubt have been impressive given his credentials and history, was not before the court. Further, since April 2014, he earned, as President and CEO of [A] Inc, a yearly salary of US$300,000.86Foot Note 86×Husband’s 2nd Affidavit dated 31 August 2015 at para 11.This sum, as the Wife pointed out, did not include bonuses, dividends or stock options, which were also not before the court.87Foot Note 87×Wife’s Supplemental Submissions dated 7 November 2016 at para 80.To this end, although he claimed to have paid 40% taxes in the US, no tax returns were adduced, but only the 2014 contract of employment. Indeed, those tax returns, to which the Husband had particular access, would also have shed light on the other sources of income that the Husband had, at least within the US. For these reasons, I did not accept the Husband’s submission that he was not in a position to pay up the mortgage loan on the Balmoral condominium. 49 Accordingly, I preferred to make an order of transfer as opposed to a deferment of sale of the Balmoral condominium. I further ordered that the Husband’s CPF contribution to the Balmoral condominium of around $310,000 should not be returned to him. This sum was smaller than the gambling losses of some $364,000 mentioned at [27], which the Husband had admitted formed part of his expenditure. This was, to my mind, a necessary accompaniment to my order of transfer. The Wife did not have the financial capacity to make repayment to the Husband on the execution of such transfer. Further, I took notice of the fact that the Husband had other CPF monies held in the Simei flat, and some $200,178 left in his CPF accounts. This order was thus unlikely to be oppressive to the Husband. 50 My order of transfer as such was not, and probably ought not to be, a typical order made to give effect to an adverse inference. On the special facts of this particular case before me, I was of the view that such a transfer constituted a just and equitable division between the parties. Stability in home environment was pivotal to the son’s wellbeing. Between deferring the sale and ordering a transfer, the latter would give certainty to the family. The Husband had already relocated to the US. Deferring the sale would leave the care arrangements for the family, and especially the welfare of the son, open to the vicissitudes of life for another 10 years or so. Plans, and even orders, as regards the future could become impracticable in that timeframe. For those reasons, I decided that it would be just and equitable, having regard to all the circumstances and in particular the needs of this family, to order a transfer of the Balmoral condominium free of encumbrance to the Wife.",
        "Mechanics of allocation": "51 In light of the above, I made the following orders to give effect to my decision as to division. Parties were to retain all assets in their own names. The Balmoral condominium was to be transferred to the Wife within six months of the date of my judgment, to be held in her sole name free of encumbrance. The Husband would bear the costs of the transfer and there would no repayment of the monies used by the Husband from his CPF account for the acquisition of the Balmoral condominium.",
        "Maintenance for the Wife and son": "52 The Husband, as CEO of [A] Inc, had a net after-tax monthly income of $21,000, not considering bonuses, share options and other emoluments. The Wife, on the other hand, stopped working since 2005 in the parties’ attempt to conceive a child.",
        "Maintenance for the son": "53 Parties’ last assessment regarding their son’s condition was as at 15 April 2011. As more than 5 years had since elapsed, I called for a fresh assessment, which was completed by the Child Guidance Clinic. The reports indicated that the son had high cognitive abilities. As he was on the autistic spectrum, various classes were also recommended to help him improve his socialisation and communication skills.88Foot Note 88×Report of the Child Guidance Clinic dated 26 August 2016 at pp 5-6. 54 The Husband agreed to pay for the classes recommended by the Child Guidance Clinic, being speech and occupational therapy and social behavioural class. He was, at the time of the hearing, paying for music and educational classes and he agreed to continue.89Foot Note 89×Notes of Evidence dated 7 November 2016.The Husband also agreed to pay a monthly maintenance for the son of $1,500.90Foot Note 90×Notes of Evidence dated 7 November 2016.That figure was on the footing, however, that the Husband would continue to pay for all outgoings on the Balmoral condominium which, inclusive of mortgage payments, amounted to around $5,524.50 each month.91Foot Note 91×Husband’s Submissions dated 2 March 2016 at para 32.As the Wife would have to bear the responsibility for these outgoings on behalf of herself and the son by virtue of my order on the Balmoral condominium, I added $500 per month to account for the son’s share of the utilities and similar outgoings. The quantum of maintenance for the son was thus increased to $2,000.",
        "Maintenance for the Wife": "55 Save for a specific feature of this case, I would have ordered lump sum maintenance. In this case, however, there was uncertainty in respect of the son’s future academic plans. While he was at the time of the hearing within the mainstream school system, his teachers reported that his work was not consistent. The reports opined that, going forward, he would require consistent learning support at home. The son would be taking his PSLE in two years’ time. While he was of a high cognitive ability, the local school system is a highly competitive one. His special needs would likely mean that he would require a greater level of support and attention than other teenagers, especially if he is to stay within the mainstream school system into the longer term. He would have to find coping mechanisms for the challenges highlighted in the report in respect of adaptive functioning, peer and teacher related social interaction, and the ability to do group work. His sole source of support was his mother. The Child Guidance Clinic also indicated, based on the school report, that the son may additionally have attention deficit disorder.92Foot Note 92×Report of the Child Guidance Clinic dated 26 August 2016 at p 5.That issue, however, did not appear to have been fully tested and assessed at the Child Guidance Clinic, probably because the report had been requested on the premise of an assessment as to the son’s autistic spectrum needs. Parties should consider if the son would benefit from an assessment and advice on the management of this additional issue. In view of the uncertainty as to his future and the amount of home support he would potentially require, the Wife may not be able to return to work promptly. In my view, the indeterminacy of matters ruled out a lump sum maintenance order. 56 Regarding the sum to be ordered as periodic maintenance, the Wife had estimated in her affidavit her monthly expenses to be around $4,231.50.93Foot Note 93×Wife’s 1st Affidavit of Assets and Means dated 18 March 2014 at para 13.At the hearing, however, her counsel tendered a table of expenses totalling $5,735 and asked for the same.94Foot Note 94×Notes of Evidence dated 13 December 2016.Counsel for the Husband countered that $4,000 a month was more than sufficient and pointed out that the Balmoral outgoings, absent the mortgage repayments, would not be more than $1,000. Having regard to her expenses and the fact that she would now take over responsibility to repay the outgoings for the Balmoral condominium, I set the monthly maintenance for the Wife at $4,000 a month. 57 I envisaged that the Wife should eventually re-enter the workforce and secure financial independence for herself. She was 50 years of age and ought in due course to be able to do so. I therefore considered if I should set this periodic sum only for a specific period. However, in view of the uncertainty surrounding the son’s longer term arrangements, I was of the view that the couple ought to settle his future first, in particular his post-PSLE school placement, before considering a re-arrangement of the Wife’s maintenance. Their so doing could then mark a material change in circumstance, in view of the premise upon which her periodic maintenance order was made. In my view, prematurely deciding a termination date for the Wife’s maintenance without information on the son’s long term arrangements could potentially cause hardship to the son.",
        "Costs": "58 Albeit I had drawn an adverse inference against the Husband, I was of the view that my orders had dealt sufficiently with his conduct. Father and mother should work towards a cooperative future for the sake of their son. I made no order on costs.",
        "Conclusion": "59 In conclusion, I made the following orders on 13 December 2016 regarding asset division and maintenance: (a)With effect from 15 December 2016 and on the 15th day of each month, the Husband is to pay the Wife $2,000 for the son’s maintenance. (b)The Husband is to pay for the agreed classes for the son’s speech and occupational therapy, social behavioural class, music and educational classes. The Wife is to use credit card to pay for all classes where possible; for cash reimbursement the Husband is to reimburse upon production of receipts on the 15th of the next month. (c)The Husband is to pay the Wife maintenance of $4,000 per month from 15 December 2016 and on the 15th day of each month thereafter. (d)The Husband is to transfer the matrimonial property, free of encumbrance, to the Wife to be held in her sole name, within 6 months of the date of my judgment. The Husband will bear the costs of the transfer, and there shall be no repayment of the Husband’s CPF monies. (e)Parties are to retain all other assets in their own names. (f)No order on costs. (g)Liberty to apply.  Valerie TheanJudicial Commissioner Wong Soo Chih (Ho Wong Law Practice LLC) for the plaintiff;Michael Moey Chin Woon (M/s Moey & Yuen) for the defendant."
    }
}