{
    "case_title": "Parakou Shipping Pte Ltd (in liquidation)vLiu Cheng Chan and others",
    "ncitation": "[2017] SGHC 15",
    "coram": "Chua Lee Ming J",
    "sections": {
        "Introduction": "1 The plaintiff, Parakou Shipping Pte Ltd (“Parakou”), is presently under creditors’ voluntary liquidation. The liquidator, Mr Cameron Lindsay Duncan, commenced this action in Parakou’s name against its former directors and shareholders (the 1st and 2nd defendants), its current directors and shareholders (the 3rd and 4th defendants), and two related companies (the 5th and 6th defendants), alleging that they orchestrated various transactions to strip Parakou of assets in anticipation of it being put into liquidation.",
        "The defendants": "2 The defendants are as follows: (a) The 1st defendant, Mr Liu Cheng Chan (“CC Liu”), and the 2nd defendant, Mdm Chik Sau Kam (“Chik”), are husband and wife. They were shareholders and directors of Parakou from the time of its incorporation but ceased to be shareholders after 21 December 2008 and directors after 31 December 2008.1Foot Note 1×Statement of Claim (Amendment No 2) (“SOC”) at para 5; 1st and 2nd Defendants’ Defence (Amendment No 3) (“D1-2’s Defence”) at para 10. (b) The 3rd defendant, Mr Liu Por, is the son of CC Liu and Chik. Liu Por joined Parakou in 2005. From 2006, he held a general management role as its Vice-President and oversaw its day-to-day operations.2Foot Note 2×SOC at para 15; 3rd and 4th Defendants’ Defence (Amendment No 3) (“D3-4’s Defence”) at para 8A.He became a shareholder of Parakou with effect from 1 January 2005 and currently holds 70% of its shares. He was appointed as a director of Parakou on 22 December 2008. He was also a director and shareholder of the 5th and 6th defendants at all material times.3Foot Note 3×SOC at para 16–17; D3-4’s Defence at para 8C. (c) The 4th defendant, Mr Yang Jianguo (“Yang”), was appointed as President of Parakou from 2006, overseeing its day-to-day operations together with Liu Por. From 22 December 2008, Yang became a 30% shareholder of Parakou and was appointed one of its directors.4Foot Note 4×SOC at para 18; D3-4’s Defence at para 8D–8E.He was also a director of the 6th defendant at all material times.5Foot Note 5×SOC at para 19; D3-4’s Defence at para 8C. (d) The 5th defendant, Parakou Investment Holdings Pte Ltd (“PIH”) was incorporated in Singapore on 8 January 1997. One of its businesses is general wholesale trade. At all material times, CC Liu, Chik and Liu Por were directors and shareholders of PIH, with CC Liu holding 70% of the shares in the company.6Foot Note 6×SOC at paras 20–21, 5th and 6th Defendants’ Defence (Amendment No 2) (“D5-6’s Defence”) at para 12. (e) The 6th defendant, Parakou Shipmanagement Pte Ltd (“PSMPL”), was incorporated in Singapore on 18 November 2008. Its businesses comprise shipping lines and freight. At all material times, (i) CC Liu, Chik, Liu Por and Yang were directors of PSMPL and (ii) CC Liu, Chik and Liu Por were shareholders of PSMPL holding 50%, 30% and 20% respectively.7Foot Note 7×SOC at paras 14, 17, 22–23; D5-6’s Defence at para 13.",
        "The undisputed facts": "3 Parakou was incorporated in Singapore on 13 October 1995. By 2007, Parakou was involved in three separate lines of businesses: (a) outer port limit services,ie,providing offshore supply vessel services to ships in and around Singapore (“the OPL business”), (b) ship management and (c) ship chartering.8Foot Note 8×D1-2’s Defence at paras 5–6. 4 At incorporation, CC Liu and Chik each held 50% of the shares in Parakou. In 2005, Liu Por became a shareholder with an 11.67% shareholding. CC Liu’s shareholding increased to 80% whilst Chik’s reduced to 8.33%.9Foot Note 9×SOC at para 10. 5 Mr Du Hong joined Parakou in July 2007.10Foot Note 10×Vol 5 of the Agreed Core Bundle (“ACB”) at pp 2775–2776.At all material times, Du Hong was a Senior Manager with responsibility for the chartering business. Du Hong reported to Yang. 6 As of early June 2008, Parakou had chartered two vessels – theMaritime Newandaand theThermidor– which it in turn sub-chartered to a company called Ocean Glory Shipping Ltd (“Ocean Glory”). Parakou was also looking to charter a third vessel, theCanton Traderand to sub-charter it to Ocean Glory. 7 On 17 June 2008, the shipbroker, Clarkson Asia Limited (“Clarkson”), sent Parakou a “Clean Recap” for theCantonTraderto “conclude a clean fixture” between Parakou and Galsworthy Limited (“Galsworthy”).11Foot Note 11×14 ACB 9676–9680.The charterparty was for a minimum period of 5 years commencing March/April 2009. Later that day, Ocean Glory sent Parakou a similar “Clean Recap” for theCanton Traderto “conclude the clean fixture” for the sub-charterparty between Parakou and Ocean Glory.12Foot Note 12×14 ACB 9704–9706. 8 On 17 July 2008, Clarkson sent Parakou a copy of the charterparty for theCanton Tradersigned by Galsworthy.13Foot Note 13×14 ACB 9711–9744. 9 On 15 September 2008, Lehman Brothers collapsed, triggering a worldwide financial crisis. The freight market collapsed in end-September/October 2008. The Baltic Dry Index (“the BDI”) fell from its peak of 11,793 points on 20 May 2008 to 3,000 points at the end of September 2008 after which it fell to a historical low of 770 points by the end of October 2008.14Foot Note 14×10 ACB 6639.The BDI is an authoritative index for dry bulk freight rates and therefore has a direct relation to Parakou’s chartering business. 10 On 30 October 2008, Parakou received an email warning it to “pay sharp attention to the financial condition of [Ocean Glory]” as it had redelivered a vessel which it had chartered from another entity (Cosco (H.K.)) “earlier than the minimum period with extremely short notice”.15Foot Note 15×14 ACB 9749. 11 The next day, Parakou received the original copies of the charterparty for theCanton Traderfrom Clarkson. Parakou replied that the file could not be found and questioned whether Parakou was the right party.16Foot Note 16×14 ACB 9750–9751.Clarkson replied on the same day confirming that Parakou was the charterer.17Foot Note 17×14 ACB 9752.Parakou did not respond. 12 On 14 November 2008, CC Liu and Chik (as directors of Parakou) passed a directors’ resolution authorising Liu Por and Yang to execute documents for the sale of ten vessels and two hulls (“the OPL Vessels”).18Foot Note 18×13 ACB 8862–8863.On 17 November 2008, Liu Por and Yang signed the documents for the sale of the OPL Vessels to PIH.19Foot Note 19×4 ACB 2288–2313.CC Liu and Chik, in their capacities as directors of PIH, also signed a directors’ resolution (prepared by Liu Por and Yang) resolving to purchase the OPL Vessels from Parakou; Liu Por was authorised to act on behalf of PIH.20Foot Note 20×D1–2’s Defence at para 50(b).Parakou claims that the OPL Vessels were sold at an undervalue resulting in a loss of S$2,263,900.21Foot Note 21×SOC at para 36(4). 13 On 18 November 2008, PSMPL was incorporated to take over the ship management business and the OPL business from Parakou. Subsequently, 12 ship management agreements (“SMAs”) between Parakou and 12 companies, the names of which all begin with “Pretty” (“the Pretty Entities”), were terminated with effect from 30 November 2008. The SMAs were for the management of 12 vessels (“the Pretty Vessels”). The sole shareholder in each of the Pretty Entities was Parakou International Limited, another company within the Parakou group. CC Liu, Chik and another son, Mr Lau Hoi, were the directors of the Pretty Entities. The three of them together with Liu Por were the shareholders of Parakou International Limited.22Foot Note 22×SOC at para 42. 14 The Pretty Entities entered into SMAs with PSMPL for the management of the Pretty Entities with effect from 1 December 2008. The terms of the SMAs that the Pretty Entities entered into with PSMPL were substantially the same as those that they had previously entered into with Parakou. 15 On 22 December 2008, CC Liu and Chik (a) transferred their shares in Parakou to Liu Por and Yang,23Foot Note 23×13 ACB 8928–8931.(b) appointed Liu Por and Yang as directors of Parakou24Foot Note 24×13 ACB 8937.and (c) gave notice of their resignation as directors of Parakou with effect from 31 December 2008.25Foot Note 25×13 ACB 8944–8948. 16 Meanwhile, the following payments/set-off took place in November and December 2008: (a) Between 12 and 24 November 2008, Parakou repaid PIH a total amount of S$9,812,542.80 that was owing to PIH (“the PIH Repayments”).26Foot Note 26×SOC at para 53; 2 ACB 671–697,730–733.Liu Por and Yang approved the PIH Repayments. (b) On 9 and 15 December 2008, Parakou set-off a total amount of S$1,732,239.17 owing from PIH against amounts owed by Parakou to PIH (“the PIH Set-Off”).27Foot Note 27×SOC at para 54; 2 ACB 747–755.Liu Por and Yang approved the PIH Set-Off. (c) On 5 December 2008, Parakou repaid a sum of S$3,046,200 (“the PSSA Repayment”) that was owing to a related company named Parakou Shipping SA (“PSSA”).28Foot Note 28×SOC at para 55; 2 ACB 736–741.CC Liu and Chik were the directors of PSSA which was wholly owned by CC Liu. PSSA’s request for payment was signed by CC Liu. Yang authorised the PSSA Repayment.29Foot Note 29×SOC at para 55. 17 On 23 December 2008, Liu Por and Yang, as directors of Parakou, signed a directors’ resolution noting, among other things, that (a) the SMAs had been terminated by the Pretty Entities with effect from 30 November 2008 and (b) 39 of Parakou’s employees (“the Affected Employees”) would be relieved of their duties with effect from 31 December 2008.30Foot Note 30×13 ACB 8944–8947. 18 The employment of the Affected Employees with Parakou was then terminated with effect from 31 December 2008. In January 2009, the Affected Employees were employed by PSMPL. However, Parakou continued to pay the salaries of six of the Affected Employees for the period between January 2009 and December 2010 totalling S$309,376.85 (“the Employees’ Salary Payments”). As PSMPL was the employer, these payments were technically paid on behalf of PSMPL. 19 In December 2008, it was decided that bonuses would be paid to the Directors and that Liu Por’s and Yang’s salaries would be increased with effect from 1 January 2009. On 12 December 2008, bonuses totalling S$267,127.50 were paid to CC Liu, Chik, Liu Por and Yang (“the Bonus Payments”). CC Liu was paid S$100,000, Chik S$80.000, Liu Por S$39,000 and Yang S$48,127.50.31Foot Note 31×SOC at paras 56–57.The additional salaries paid to Liu Por and Yang between January 2009 and March 2011, as a result of the increase in their salaries, totalled S$108,000 (“the Salary Increases”).32Foot Note 32×SOC at paras 59–61. 20 Between January 2009 and December 2010, Parakou paid a total amount of S$240,000 as rent either to or on behalf of PIH. PIH was the tenant and Parakou occupied part of the space tenanted by PIH. Parakou claims that an excess amount of S$213,270 was paid in respect of the rent (“the Excess Rent Payments”).33Foot Note 33×SOC at paras 62–65; D3-6’s Defence at para 39. 21 On 26 January 2009, Clarkson sent Parakou a reminder for the executed charterparty for theCanton Trader(which was to be renamed theJin Kang).34Foot Note 34×14 ACB 9819.On 11 February 2009, Parakou informed Clarkson that it would not be executing the charterparty; Parakou claimed that there was no fixture.35Foot Note 35×14 ACB 9865. 22 The charterparty for theCanton Traderprovided for arbitration in London and in February 2009, Galsworthy commenced arbitration proceedings against Parakou in London (“the London Arbitration”). 23 On 27 June 2009, Parakou commenced action in Hong Kong against the owners and/or demise charterers of theJin Kang(formerly, theCanton Trader) claiming damages and/or an indemnity in respect of any liability to which Parakou may be exposed in the London Arbitration (“the HK Proceedings”).36Foot Note 36×9 ACB 5895–5898. 24 The tribunal held that there was a binding charterparty between Parakou and Galsworthy. On 31 August 2010, an award was made in the London Arbitration ordering Parakou to pay Galsworthy US$2,673,279.15 with further damages to be assessed (“the First Award”).37Foot Note 37×8 ACB 5820–5826. 25 On 22 September 2010, Parakou’s claim in the HK Proceedings was struck out on the ground that it was a collateral attack on the outcome of the London Arbitration and therefore an abuse of process.38Foot Note 38×9 ACB 6217–6265. 26 On 18 March 2011, Parakou was placed under provisional liquidation.39Foot Note 39×13 ACB 8965–8966.Further to a creditors’ meeting on 14 April 2011, Parakou was placed under creditors’ voluntary liquidation.40Foot Note 40×13 ACB 8980. 27 On 13 May 2011, a second award was made in the London Arbitration ordering Parakou to pay Galsworthy further damages in the amount of US$38,579,000 (“the Second Award”).41Foot Note 41×8 ACB 5829–5889, at 5888. 28 Parakou claims that the total amount of legal fees incurred in the London Arbitration and the HK Proceedings from February 2009 to April 2011 was S$6,223,238.72.42Foot Note 42×SOC at para 31.",
        "Parakou’s case": "29 Parakou’s case, in summary, is as follows: (a) At all material times, CC Liu, Chik, Liu Por and Yang were directors (whether as appointed directors, shadow directors orde factodirectors) of Parakou.CC Liu and Chik resigned as appointed directors with effect from 31 December 2008 but remained as shadow directors thereafter. On the other hand, Liu Por and Yangwerede factodirectors of Parakou prior to their appointment as directors on 22 December 2008. CC Liu, Chik, Liu Por and Yang will be referred to collectively as “the Directors” in this judgment. (b) The (i) sale of the OPL Vessels, (ii) transfer of the SMAs, (iii) PIH Repayments, (iv) PIH Set-Off, (v) PSSA Repayment, (vi) Employees’ Salary Payments, (vii) Bonus Payments, (viii) Salary Increases and (ix) Excess Rent Payments (collectively, “the Disposal Transactions”) were carried out at a time when Parakou was insolvent and the Directors therefore had a duty to take creditors’ interests into account in making their decisions. (c)  The Directors breached their fiduciary, common law and/or statutory duties to Parakou by (i) causing and/or authorising the Disposal Transactions; and (ii) persisting with, and causing Parakou to incur legal fees for, the London Arbitration and the HK Proceedings. (d) In addition, some of the Disposal Transactions were transactions at an undervalue within the meaning of 329 of the Companies Act (Cap 50, 2006 Rev Ed) read with s 98 of the Bankruptcy Act (Cap 20, 2009 Rev Ed) (“undervalue transactions”). These were: (i) The sale of the OPL Vessels to PIH. (ii) The transfer of the SMAs to PSMPL. (iii) The Bonus Payments made to the Directors. (iv) The Salary Increases paid to Liu Por and Yang. (v) The Employees’ Salary Payments made on behalf of PSMPL. (vi) The Excess Rent Payments made to or on behalf of PIH. (e) PIH is liable as a constructive trustee on the ground of dishonest assistance and/or knowing receipt with respect to the sale of the OPL Vessels, the PIH Repayments, the PIH Set-Off and the Excess Rent Payments. (f) PSMPL is liable as a constructive trustee on the ground of dishonest assistance and/or knowing receipt with respect to the transfer of the SMAs, and on the ground of dishonest assistance with respect to the Employees’ Salary Payments. (g) The defendants conspired to injure Parakou by unlawful means. 30 Based on the above, Parakou seeks a multitude of wide ranging and overlapping reliefs. The reliefs pleaded in the statement of claim do not make for easy reading but in essence Parakou seeks both loss-based and gain-based remedies with respect to the Disposal Transactions. Under the loss-based remedies, each of the defendants will be liable for the losses suffered by Parakou. Under the gain-based remedies, Parakou is entitled to an account of profits and it may choose to follow or trace the misapplied assets and proceeds thereof and enforce an equitable lien or constructive trust. Parakou submits that it is entitled to elect the remedy which is most advantageous to it, and need only elect when judgment is given in its favour.43Foot Note 43×Plaintiff’s Closing Submissions (“PCS”) at para 443.I should add that Parakou also seeks the statutory remedy of voiding undervalue transactions.",
        "The issues": "31 The issues in this case are as follows: (a) Whether CC Liu and Chik were shadow directors of Parakou after their resignation from the board? (b) Whether Liu Por and Yang werede factodirectors of Parakou before their appointment to the board? (c) Whether the Disposal Transactions were carried out pursuant to a restructuring plan, as the defendants claim? (d) Whether Parakou was solvent at the material times? Parakou’s solvency status is relevant to the following issues: (i) whether the Directors had a duty to take into account the interests of the company’s creditors when they made their decisions to carry out the Disposal Transactions and to incur the legal costs in the London Arbitration and HK Proceedings, and (ii) whether the statutory remedy for undervalue transactions is available. (e) Whether the sale of the OPL Vessels, the transfer of the SMAs, the Bonus Payments and Salary Increases, the Employees’ Salary Payments and the Excess Rent Payments were undervalue transactions? (f) Whether the Directors breached their fiduciary duties by (i) causing and/or approving the Disposal Transactions, and (ii) deciding to defend the London Arbitration and pursue the HK Proceedings? (g) Whether PIH and PSMPL are liable for dishonest assistance and/or knowing receipt? (h) Whether the defendants are liable for unlawful means conspiracy? (i) What are the appropriate remedies?",
        "Whether CC Liu and Chik were shadow directors after 31 December 2008": "32 CC Liu and Chik resigned as directors of Parakou with effect from 31 December 2008. Parakou alleges that CC Liu and Chik are liable as shadow directors for decisions that were made after their resignation. 33 Under s 4 of the Companies Act, a ‘director’ “…includes any person occupying the position of director of a corporation by whatever name called and includesa person in accordance with whose directions or instructions the directors or the majority of the directors of a corporation are accustomed to actand an alternate or substitute director” [Emphasis added] 34 To find that a director is “accustomed to act” on the instructions of a person not appointed as one – often referred to as a ‘shadow director’ – it is sufficient if there is a “discernible pattern of compliance” with the shadow director’s instructions; occasional departures from the pattern will not affect the finding of shadow directorship:Raffles Town Club Pte Ltd v Lim Eng Hock Peter and others[2010] SGHC 163 (“RTC”) at [45]. There is no requirement that the shadow director’s directions or instructions must extend over the whole field of the company’s corporate activities:Secretary of State for Trade and Industry v Deverell and another[2000] 2 WLR 907 at 920. A shadow director is subject to the same fiduciary duties as an appointed director:RTCat [49]. 35 In my view, CC Liu remained a shadow director after his resignation from the Parakou board on 31 December 2008. The evidence, viewed in its totality, shows that CC Liu was a key decision maker whose directions continued to be sought even after he ceased to be a director. (a) CC Liu testified that as the elder in the family, he expected his views to be respected and Liu Por to consult him on significant issues in the running of the business.44Foot Note 44×Notes of evidence (“NE”), 29 March 2016, at 17:18–18:17.CC Liu confirmed that Liu Por did continued to consult him in respect of significant issues and that he still “had certain influence” over Parakou.45Foot Note 45×NE, 29 March 2016, at 19:1–5 and 127:7. (b) CC Liu continued to be given updates on Parakou’s business operations after he had stepped down. One example is an email dated 12 May 2009 from Du Hong to CC Liu reporting on the status of the company’s business.46Foot Note 46×14 ACB 9873.In the email, Du Hong addressed CC Liu as “Director Liu” and he ended the email by saying “Bosses, please feel at ease”. It is apparent from the email that “Bosses” referred to CC Liu, Liu Por and Yang.47Foot Note 47×14 ACB 9873. (c) Even in March/April 2010, Du Hong continued to seek instructions frombothCC Liu and Lau Hoi on Parakou’s business.48Foot Note 48×14 ACB 9884–9885.In his email dated 14 April 2010 to CC Liu and Lau Hoi, Du Hong asked “the bosses to clearly instruct [him] on how to respond”. (d) CC Liu clearly had influence over how the legal proceedings with Galsworthy panned out. He admitted in an interview in May 2012 with one of Parakou’s previous liquidators that Liu Por or Yang reported to him in respect of the dispute with Galsworthy. CC Liu also admitted that he instructed them to appoint a lawyer to represent Parakou.49Foot Note 49×12 ACB 8702–8703. 36 However, there is insufficient evidence to show that Chik remained a shadow director after 31 December 2008. Chik does not appear to have played an active role even before she resigned as a director. I accept her evidence that even before her resignation, she would usually listen to CC Liu and that she would make decisions based on the advice of Liu Por and Yang.50Foot Note 50×NE, 30 March 2016, at 33:15–23.",
        "Whether Liu Por and Yang were de facto directors before 22 December 2008": "37 Liu Por and Yang were appointed to the board of Parakou on 22 December 2008. Parakou alleges that Liu Por and Yang are liable asde factodirectors for decisions that were made before their appointments. 38 Ade factodirector is one “who is not formally appointed as a director but in fact acts as a director by exercising the powers and discharging the functions of a director”:RTCat [50]. It is not necessary that this person be held out as a director, but it is necessary to find that he directed the affairs of the company on an equal footing with other directors and exercised real influence in its corporate governance (RTCat [58], referring toSecretary of State for Trade and Industry v Aviss[2007] BCC 288 at [40]). Such a person is a director “by whatever name called” and is therefore subject to the duties ordinarily imposed on directors: s 4 of the Companies Act;RTCat [69]. 39 Parakou relied on the following as evidence that Liu Por and Yang undertook functions which could properly be discharged only by directors, that they were held out as directors and that they exercised real influence in the corporate governance of the company:51Foot Note 51×PCS at paras 381–384. (a) In 2006, Yang was appointed as President of Parakou and Liu Por as its Vice-President. Both were responsible for the management and day-to-day operations of the company. (b) Liu Por and Yang were in charge of important decisions relating to Parakou’s business including taking charge of the sale of the OPL Vessels. (c) Liu Por and Yang approved the PIH Repayments and the PIH Set-Off. Yang authorised the PSSA Repayment. 40 In my view, the evidence is insufficient to prove that Liu Por and Yang werede factodirectors before their appointment to the Parakou board on 22 December 2008. First, as Vice-President and President respectively, they were necessarily responsible for the management and day-to-day operations of the company. Second, taking charge of the process in selling the OPL Vessels could not be said to be outside the scope of their responsibilities as Vice-President and President. Further, Liu Por and Yang had been authorised by the directors to act as agents for Parakou in the sale of the OPL Vessels (see [12] above).52Foot Note 52×4 ACB 2284–2287.In any event, I would consider the actual process of selling the OPL Vessels to be implementation of the directors’ decision to sell the vessels; this was not something which directors need necessarily be involved in. Third, it would not have been surprising if Liu Por and Yang had decided to seek board approval for the PIH Repayments, the PIH Set-Off and the PSSA Repayment, given the amounts involved. However, I do not think that the mere fact that they did not do so means that they werede factodirectors. These matters are conceivably within the authority of the President and Vice-President of the company and there is no evidence to the contrary. In my view, looking at the totality of the evidence, I am not persuaded that Liu Por and Yang should be held liable asde factodirectors before their appointments to the board.",
        "Whether the Disposal Transactions were carried out pursuant to a restructuring plan": "41 The defendants claim that the Disposal Transactions were carried out as part of a restructuring plan. They allege that the objective of the restructuring plan was for Parakou to focus on the more profitable ship chartering business and cease to be engaged in the non-performing and/or loss-making OPL and ship management businesses. 42 Parakou disputes the existence of the restructuring plan and claims that the Disposal Transactions were part of a plan to strip it of its assets because the Directors knew that Parakou’s exposure under the charterparty with Galsworthy would lead to Parakou’s eventual liquidation.",
        "Whether there was a restructuring plan": "The March 2008 Resolution 43 The defendants allege that the restructuring plan was decided at a board meeting on 17 March 2008. They rely on a document titled “Minutes of a meeting of the Board of Directors…” which was signed by CC Liu as Chairman (“the March 2008 Resolution”).53Foot Note 53×13 ACB 8841–8842.Both CC Liu and Chik signed the attendance sheet. The March 2008 Resolution stated as follows: 1. For the purpose of restructuring, [CC Liu] and [Chik] will transfer all their shares to [Liu Por] and [Yang] within the year of 2008. After the transfer of the shares, the company will focus only on chartering business. 2. The company will terminate the operation of OPL boats and ship management within the year of 2008. 3. The company will sell all of its supply boats within the year of 2008. 44 Parakou submits that there was in fact no meeting on 17 March 2008 and that the March 2008 Resolution was not a contemporaneous document. I agree. In my judgment, the evidence supporting this conclusion is strong. 45 First, CC Liu, Chik and Liu Por had pleaded in earlier versions of their respective defences filed in August 2014 that Yang was present at the board meeting allegedly held on 17 March 2008. Subsequently, a transcript of Yang’s interview with the liquidator was disclosed in discovery. Yang told the liquidator that he did not attend this board meeting.54Foot Note 54×11 ACB 7710–7711.The defendants then amended their respective defences in February 2016 to remove all references to Yang’s presence at the board meeting.55Foot Note 55×1st and 2nd Defendants’ Defence (Amendment No 2), dated 24 February 2016, at para 42; 3rd and 4th Defendants’ Defence (Amendment No 2), dated 24 February 2016, at para 15.I find it unlikely that the defendants could have made such a mistake if the alleged meeting had in fact been held. The alleged restructuring was after all an important and significant change to the company’s business. 46 Second, the company secretary had told Parakou’s previous liquidator that she would normally draft simple directors’ resolutions and that more complex resolutions would be drafted by lawyers.56Foot Note 56×11 ACB 7351.However, the March 2008 Resolution was drafted by the accounts manager, Mr Ng Kam Hung (“Andy Ng”). There was no reason why the accounts manager (instead of the company secretary or lawyers) was asked to draft the resolution especially given its importance. Liu Por explained that he would normally ask Andy Ng to prepare directors’ resolutions.57Foot Note 57×NE, 7 April 2016, at 15:25–16:10.However, Andy Ng testified that this was the only time that he had been asked to prepare board minutes.58Foot Note 58×NE, 31 March 2016, at 29:12–15.I reject Liu Por’s explanation. 47 Third, the Directors’ respective defences pleaded that the restructuring plan decided on 17 March 2008 involved the following four key parts:59Foot Note 59×D1–2’s Defence at paras 42–43; D3-4’s Defence at paras 16–17. (a) The transfer of the assets of the OPL business to PIH. (b) The transfer of the OPL business and the ship management business to PSMPL and the consequent transfer of the employees who were involved in these businesses, to the same. (c) The repayment of debts owing by Parakou to related companies save for the debt owing to CC Liu. (d) The replacement of CC Liu and Chik with Liu Por and Yang as the directors and shareholders of Parakou. 48 There are several problems with the Directors’ case as pleaded. (a) The March 2008 Resolution did not mention PIH or PSMPL. Neither did it refer to the transfer of employees to PSMPL or the repayment of debts to related companies. (b) Liu Por testified during the trial that the decision was to sell the OPL Vessels to third parties.60Foot Note 60×NE, 5 April 2016, at 26:4–8.This contradicted his own defence. (c) It could not have been decided in March 2008 that the OPL and ship management businesses would be transferred to PIH and PSMPL respectively. First, it was originally expected that another company, Golden Wisdom Pte Ltd, would be incorporated to purchase the OPL Vessels.61Foot Note 61×Andy Ng’s AEIC at para 15; 14 ACB 9916.PIH became the buyer only because Golden Wisdom Pte Ltd could not be incorporated in time.62Foot Note 62×Andy Ng’s AEIC at para 26.Second, PSMPL was incorporated only in November 2008. 49 Fourth, the defendants claim that discussions for the restructuring (which centred on plans to abandon the OPL and ship management businesses) started around the end of 2007. However, this is clearly inconsistent with the fact that as at the end of 2007, Parakou was in fact expanding its OPL business. The objective evidence did not support any intention or reason to terminate the OPL business in March 2008. Parakou took substantial loans from PSSA (US$1m in August 2007 and S$1m in February 2008) and PIH (S$6.12m in September 2007).63Foot Note 63×13 ACB 8837–8838.Chik admitted that the loans from PSSA were for the construction of new boats to increase the fleet and monopolise the OPL business market.64Foot Note 64×NE, 30 March 2016, at 86:18–87:3.In addition, Parakou committed to a long-term S$6m shipbuilding contract in September 2007 for delivery of OPL vessels from August 2008 to January 2009. Yang testified that they thought the business would be lucrative and Parakou would still be in the OPL business by the end of 2008.65Foot Note 65×NE, 4 April 2016, at 20:5–14 and 21:1–5. 50 Fifth, there is no other contemporaneous evidence that supports the alleged restructuring plans or the March 2008 Resolution. No emails, minutes of meetings or other notes have been produced. The Directors did not seek any legal advice on how to carry out the restructuring; in my view, this was most unusual. As Liu Por described it, the restructuring was a “significant business decision”.66Foot Note 66×Liu Por’s AEIC at para 49.The Directors did not disclose their alleged restructuring plan to anyone else, including Du Hong who helmed Parakou’s chartering business. Again, this was most unusual. 51 Sixth, neither the alleged restructuring plan nor the March 2008 Resolution was disclosed to the company’s auditors at the relevant times. According to the Financial Reporting Standards, any announcement of a plan to discontinue an operation of a company is a post-balance sheet event which would generally result in disclosure although it is a non-adjusting event.67Foot Note 67×Exhibit P1 at para 22(b).However, in a management representation letter for Financial Year (“FY”) 2007 dated 7 July 2008, CC Liu and Chik represented to the auditors that there were no events after the balance sheet date which “could materially affect the state of affairs of the company” and made no mention of the restructuring plan or the March 2008 Resolution.68Foot Note 68×1 ACB 191–194 at para 9.When questioned, CC Liu was evasive but finally admitted that the plan in the resolution to terminate the OPL and ship management businesses ought to have been disclosed.69Foot Note 69×NE, 28 March 2016, at 66:9–70:8.CC Liu did not give any credible explanation for not having done so. 52 Seventh, the audit of Parakou’s accounts for FY 2007 took place in June/July 2008. Steven Shia, the supervising manager on the audit team, testified that the audit file for FY 2007 did not contain a copy of the March 2008 Resolution. He saw a copy of the resolution in the audit file for FY 2008 when he reviewed the file in late 2009 or early 2010. Steven Shia explained that the audit team would have made a copy of the March 2008 Resolution for the audit file for FY 2007 if they had seen it in the company’s secretarial records in June/July 2008.70Foot Note 70×NE, 22 March 2016, at 137:14–141:12.In my view, in the absence of credible explanation, the fact that the auditors did not have sight of the March 2008 Resolution in June/July 2008 gives rise to a strong inference that the March 2008 Resolution was not in existence then. 53 Andy Ng confirmed that he had provided two other resolutions dated June 2008 to the auditors and explained that he did not disclose the March 2008 Resolution to the auditors because it was “only just a plan”. This explanation was odd, to say the least. Subsequently, Andy Ng gave the excuse that perhaps he had forgotten and finally he claimed that he forgot because he thought it was just a plan.71Foot Note 71×NE, 31 March 2016, at 52:21–25, 61:6–9 and 66:14–25.I find Andy Ng’s explanations contrived and I reject them. 54 Eighth, in March 2009, Galsworthy commenced an admiralty action in rem in South Africa and arrested thePretty Timeas security for its claim in the London Arbitration. ThePretty Timewas a vessel owned by Pretty Time Shipping SA, a company owned by Parakou International Limited (of which CC Liu was a director and majority shareholder). In connection with an application to set aside the arrest, on 28 March 2009, South African counsel asked for an “[e]xplanation why [the] shareholding and directorship of [Parakou] changed between … 27/11/08 … and … 27/3/2009”.72Foot Note 72×15 ACB 10302–10303.Clearly, the easiest thing the Directors could have done was to produce the March 2008 Resolution. Liu Por agreed as much.73Foot Note 73×NE, 7 April 2016, at 5:7–9.Yet this was not done and the affidavits filed on 6 April 2009 for purposes of setting aside the arrest did not exhibit the March 2008 Resolution. There was no credible explanation for not exhibiting the March 2008 Resolution. In my view, the clear inference is that the March 2008 Resolution was not in existence then. 55 In fact, in his affidavit affirmed on 6 April 2009, filed in the South African proceedings, CC Liu referred to a decision in 2008 to transfer shares in Parakou to Liu Por and Yang and stated explicitly that “[t]his agreement was not reduced to writing”.74Foot Note 74×9 ACB 6530–6537, at paras 21 and 22.CC Liu could not explain why he said this nor why the March 2008 Resolution was not produced then. The March 2008 Resolution was finally disclosed in the South African proceedings on 17 April 2009 in an affidavit by Mr David Yeung who was the managing partner of Parakou’s auditors.75Foot Note 75×10 ACB 6652 – 6655, at 6657.David Yeung testified that he did not see the March 2008 Resolution in March 2008 or July 2008 and that he only saw it sometime between July 2008 and April 2009.76Foot Note 76×NE, 22 March 2016, at 117:3–14. Whether there was a restructuring plan in any event 56 The defendants also submit that in any event, the fact that there was a restructuring is not dependent on the existence of the March 2008 Resolution.77Foot Note 77×3rd to 6th Defendants’ Closing Submissions (“3-6DCS”) at para 112.Of course, there could have been a decision to restructure the company’s businesses even if the March 2008 Resolution was not a contemporaneous document. However, the defendants have not offered any evidence of such a decision (or the reasons for it) other than the March 2008 Resolution. I need only add that the Directors’ credibility on this issue has been severely eroded by their unsuccessful attempt to introduce the March 2008 Resolution as contemporaneous evidence. 57 In my view, the sale of the OPL Vessels to PIH and the transfer of the SMAs to PSMPL are also inconsistent with the defendants’ claim that they were carried out pursuant to a restructuring. The Directors’ case is that they wanted to dispose of the OPL and ship management businesses in order to focus on the more profitable chartering business. In his AEIC, Liu Por described the OPL business as “at best, marginally profitable” and the ship management business as “loss-making”.78Foot Note 78×Liu Por’s AEIC at para 41.Liu Por also stated that he was not able to find a suitable buyer as the market was suffering from an economic downturn and PIH was then incorporated in order to buy the OPL Vessels.79Foot Note 79×Liu Por’s AEIC at paras 81–82.. If the reason for disposing of the OPL and ship management business was that they were not profitable or even loss-making, it made no commercial sense to sell the OPL Vessels to another entity (PIH) within the Parakou group and to incorporate a new entity (PSMPL) to take over the ship management business. 58 Parakou’s emails to its lawyers at that time, Rajah & Tann LLP (“R&T”), also show that the Directors were in a hurry to complete the sale of the OPL Vessels.80Foot Note 80×14 ACB 9924, 9927, 9928.Andy Ng testified that Liu Por’s instructions were to complete the sale of the OPL Vessels “as soon as possible” and that Liu Por kept “rushing” and “pressuring” him to expedite the matter.81Foot Note 81×NE, 31 March 2016, at 123:11–15; NE, 1 April 2016, at 12:18–19.There was no reason for the urgency. I agree with Parakou that the urgency is consistent with the fact that the Directors were simply stripping Parakou of its assets.",
        "Conclusion – there was no restructuring plan": "59 I find that the March 2008 Resolution was not a contemporaneous document and that there was in fact no restructuring plan. The Disposal Transactions were not carried out pursuant to the alleged restructuring plan. In my view, the restructuring plan was an afterthought in an attempt to justify the Disposal Transactions. 60 In coming to my conclusions, I have been mindful of the principle that where fraud or dishonesty is alleged, more evidence is needed than in an ordinary civil case to discharge the standard of proof on a balance of probabilities:Gimpex Ltd v Unity Holdings Business Ltd and others and anotherappeal[2015] 2 SLR 686 at [184]. In my view, the evidence was more than sufficient in this case.",
        "Whether Parakou was insolvent at the material time": "61 Parakou’s solvency status is relevant to its claims for (a) breach of directors’ fiduciary duties and (b) the statutory remedy for undervalue transactions. 62 Where directors’ duties are concerned, it is axiomatic that directors have a duty to act in the interests of the company. Generally, this refers to the interests of the company as a separate commercial entity which in many cases are very readily identified with the interests of its shareholders as a whole: Hans Tjio, Pearlie Koh and Lee Pey Woan,Corporate Law(Academy Publishing, 2015) (“Corporate Law”)at para 09.045. The company’s solvency status is relevant because “when a company is insolvent, or even in a parlous financial position, directors have a fiduciary duty to take into account the interests of the company’s creditors when making decisions for the company”:Liquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd[2010] 4 SLR 1089 (“Progen”)at [48]. The greater the concern over the company’s financial health, the more weight the directors must accord to the interests of creditors over those of the shareholders:Dynasty Line Ltd (in liquidation) v Sukamto Sia and another and another appeal[2014] 3 SLR 277 (“Dynasty”) at [34]. 63 In the case of undervalue transactions, a condition for the statutory remedy is that the company was insolvent when the transactions were carried out or became insolvent in consequence of the transactions: s 329 of the Companies Act read with ss 98 and 100 of the Bankruptcy Act. 64 The cash flow test and the balance sheet test are well established tests for determining whether a company is solvent. They are also the appropriate tests in the context of undervalue transactions. Under s 100(4) of the Bankruptcy Act, a company is insolvent if it is unable to pay its debts as they fall due (the cash flow test) or if the value of its assets is less than the amount of its liabilities, taking into account its contingent and prospective liabilities (the balance sheet test). 65 However, for the purpose of deciding whether a director has a duty to take creditors’ interests into account, the company need not be technically insolvent. It is sufficient if the company is in a parlous financial position or perilously close to being insolvent:Progenat [48] and [52]. A strict and technical application of the cash flow and balance sheet tests, which are used in the context of a winding up action, would be of limited utility and a broader assessment of the surrounding circumstances of the case is called for; as long as there are reasons to be concerned that the creditors’ interests are or will be at risk because of difficult financial circumstances, directors ignore those interests at their peril:Dynastyat [33]–[35]. 66 Nevertheless, as Parakou is relying on both balance sheet and cash flow insolvency for purposes of its claims for breach of directors’ duties, I shall begin the analysis of Parakou’s solvency status with the balance sheet and cash flow tests.",
        "Whether Parakou was balance sheet insolvent": "67 The test for balance sheet insolvency is whether “there is a deficit after balancing overall liabilities against assets”:Chip Thye Enterprises Pte Ltd (in liquidation) v Phay Gi Mo and others[2004] 1 SLR(R) 434 (“ChipThye”) at [18]. A commercial and not technical approach should be taken in determining balance sheet insolvency; a surplus or deficiency of net assets is indicative but not determinative of solvency:Chip Thyeat [19]. 68 Parakou had a negative equity position on its balance sheet for six years prior to the time of the Disposal Transactions.82Foot Note 82×PCS at para 233.The figure was negative S$2.49m for FY ending 31 December 2002 and increased each year until it reached negative $46.24m as at 31 March 2011 (based on unaudited accounts).83Foot Note 83×Reid’s AEIC, Exhibit TJR-2 (“Reid’s Expert Report”) at para 24.The Disposal Transactions took place in FY 2008 and FY 2009. The legal proceedings relating to the Galsworthy claim took place over FY 2009 to FY 2011. Parakou had negative equity positions ranging from $10.147m for FY 2008 to S$46.24m as at 31 March 2011. 69 Parakou’s expert witness, Mr Timothy James Reid (“Reid”) from Ferrier Hodgson Pte Ltd, testified that Parakou’s non-financial assets were unlikely to fetch anything far greater than the recorded book value. In his view, it was therefore reasonable to conclude that, based on its negative equity position, Parakou was balance sheet insolvent.84Foot Note 84×Reid’s Expert Report at paras 32–33. 70 CC Liu and Chik accepted that Parakou was balance sheet insolvent at all material times.85Foot Note 85×1st and 2nd Defendants’ Closing Submissions (“1-2DCS”) at para 32.However, the 3rd to 6th defendants submitted that Parakou would be balance sheet solvent if its debt owing to CC Liu was notionally removed from the balance sheet.86Foot Note 86×3-6DCS at paras 75–76.They pointed to the fact that CC Liu had provided letters of support and had not demanded repayment of the debt.87Foot Note 87×3-6DCS at para 77.The 3rd to 6th defendants relied on the report by the defendants’ expert, Mr Chee Yoh Chuang (“Chee”) from RSM Corporate Advisory Pte Ltd. 71 Chee’s expert report does not support the 3rd to 6th defendants’ contention. In his report, Chee in fact accepted that Parakou was balance sheet insolvent.88Foot Note 88×Chee’s AEIC, Exhibit CYC-2 (“Chee’s Expert Report”) at para 3.17.Although Chee did discuss adjusting the balance sheet by excluding liabilities for which letters of financial support were provided by related parties, this was for purposes of supporting his opinion that Parakou was cash flow solvent. 72 In any event, I agree with Reid’s view that removing liabilities from the balance sheet in this way would be illogical as it would result in the balance sheet not balancing.89Foot Note 89×Reid’s 2nd Expert Report at para 22.I also note that a similar approach taken by Chee in an earlier case,Kon Yin Tong and another v Leow Boon Cher and others[2011] SGHC 228 (“Kon Yin Tong”), was described as “an avant-garde and irregular method of accounting” and rejected by Judith Prakash J (as she then was) (at [69]). 73 In my view, it is indisputable that Parakou was balance sheet insolvent at the material times.",
        "Whether Parakou was cash flow insolvent": "74 The evidence showed that Parakou was able to pay its debts as they fell due in 2008 and 2009. Chee noted that between January 2008 and February 2009, it had made 144 payments for trade-related expenses totalling approximately S$94m.90Foot Note 90×Chee’s Expert Report at para 4.3.7.Reid did not dispute these figures.91Foot Note 91×NE, 24 March 2016, at 12:3–9.The liquidator also conceded that between January 2008 and December 2009, all creditors who had made demands were paid.92Foot Note 92×NE, 17 March 2016, at 26:8–12. 75 However, the question of Parakou’s cash flow solvency also depends on the treatment to be given to the Galsworthy claim and the letters of support. Whether the Galsworthy claim should be taken into consideration 76 Section 254(2)(c) of the Companies Act states that “in determining whether a company is unable to pay its debts the Court shall take into account the contingent and prospective liabilities of the company”. The definition of inability to pay debts in s 254(2)(c) is for the purposes of establishing a ground for winding up. However, I see no reason why contingent and prospective liabilities should not similarly be taken into account when considering the issue of insolvency in the context of breach of directors’ duties or undervalue transactions. 77 A contingent liability is a liability or loss which arises out of an existing legal obligation or state of affairs but which is dependent on the happening of an event which may or may not occur, whereas a prospective liability is a debt which will certainly become due in the future:Kon Yin Tongat [40]. 78 It seems obvious that not all contingent liabilities need to be taken into account. In my view, where the likelihood of the liability materialising is remote, it would not make sense to take the contingent liability into account. However, a contingent liability must be taken into account if it is reasonably likely that it will materialise. 79 It is clear that the Galsworthy claim was a contingent liability at the material times. The question is whether the liability was reasonably likely to materialise. In my view, the likelihood of the liability materialising was not just reasonably likely but high. 80 Parakou had no defence to Galsworthy’s claim. The Directors assert that their view that there was no binding charterparty with Galsworthy was a reasonable one because no formal contract had been signed between Parakou and Galsworthy. I reject the Directors’ assertion. In my view, the objective contemporaneous evidence overwhelmingly proves that Parakou had entered into a binding charterparty with Galsworthy in June 2008 and that the Directors knew this. (a) First, as early as 10 June 2008, Du Hong, had reported to Yang to confirm that Parakou had, with Yang’s “kind authority” entered into a “new fixture for 5 years” with Galsworthy “as disponent owners”.93Foot Note 93×14 ACB 9707.Du Hong also reported that theCanton Traderwould be “relet to sub-[charterers] ‘Ocean Glory’ – the same [charterers] forMV Maritime Newanda[and]Thermidoron strict back to back basis except hire USD32,780/day.”94Foot Note 94×14 ACB 9709. (b) Second , on 18 June 2008, Clarkson sent Parakou a “Clean Recap” to “conclude the clean fixture” between Galsworthy and Parakou.95Foot Note 95×14 ACB 9676–9680.It is not disputed that the Directors understood a “Clean Recap” to contain the terms that were finally agreed on. (c) Third, later that day, Ocean Glory sent a similar “Clean Recap” to Parakou to “conclude the clean fixture” between Parakou and Ocean Glory.96Foot Note 96×14 ACB 9704–9706.Parakou could not have sub-chartered theCanton Traderto Ocean Glory without first having secured the charterparty with Galsworthy. (d) Fourth, the Directors did not raise any objection to the charterparty from June 2008 to September 2008. There were no objections even after Parakou received a time charter for theCanton Tradersigned by Galsworthy on 17 July 2008.97Foot Note 97×14 ACB 9711. (e) Fifth, in August 2008, Du Hong represented to a potential charterer that Parakou had entered into a number of charterparties including “Canton Trader(5 years)”.98Foot Note 98×14 ACB 9745.In September 2008, Du Hong announced to customers and counterparties that “all messages or communications relating to “fixtures” of, among others, “MV Canton Trader/Parakou/Ocean Glory” be sent to Parakou’s new address.99Foot Note 99×14 ACB 9747. (f) The fact that Parakou had no defence was confirmed in January 2009 by Parakou’s counsel, Mr Luke Parsons QC, who advised in no uncertain terms that Parakou would fail in the London arbitration.100Foot Note 100×14 ACB 9830–9837 at para 30.Parakou asked him to reconsider his advice and on 3 February 2009, Parsons QC re-affirmed his view that “Parakou will face severe difficulties” in defending the London Arbitration.101Foot Note 101×14 ACB 9845–9848 at para 15. 81 The likelihood that Galsworthy would commence proceedings against Parakou was high given that the chartering market had fallen off significantly. Indeed, Yang agreed that in these circumstances, there was “a very high possibility” that Galsworthy would bring legal proceedings.102Foot Note 102×NE, 4 April 2016, at 121:10–15.Parakou itself was expecting Galsworthy to commence legal proceedings. In an email to R&T dated 19 November 2008, Andy Ng wrote that Parakou expected a “big claim” in April 2009.103Foot Note 103×14 ACB 10036–10037.The “big claim” was clearly a reference to the claim by Galsworthy as delivery of theCanton Traderwas to take place in March/April 2009. There was no evidence of any other “big claim” that Parakou was expecting. As it turned out, Galsworthy did commence arbitration proceedings in February 2009. 82 In the circumstances, there can be no doubt that the Galwsorthy claim was a contingent liability that has to be taken into account in determining whether Parakou was able to pay its debts at the material times. The relevance of the letters of support 83 Chee relied on letters of support given for various FYs by CC Liu, Chik, Liu Por, Yang, PIH, PSSA and another related entity, Parakou Shipping Ltd. The letters of support were all addressed to Parakou’s auditor and given to satisfy the auditor that it was appropriate for the financial statements to be prepared on a going concern basis.104Foot Note 104×Reid’s Expert Report at para 39(i).In general, the letters of support confirmed that (a) debts owing by Parakou to the providers of the letters of support would be subordinated to the payment of Parakou’s other liabilities and (b) it was the providers’intentionto continue providing adequate finance to the company until all other payables had been met. 84 Conceptually, such letters of support must be a relevant factor in deciding whether a company is cash flow solvent, despite the fact that they are usually not contractually binding. Logically, the weight to be given to them must depend on the likelihood that they will be honoured. In practice, however, by the time such an issue has to be decided by the court, it would invariably be the case that the letters of support have not been honoured. It seems to me that it would be an exceptional case in which a company, which is otherwise cash flow insolvent, would be found to be cash flow solvent because of non-binding letters of support. 85 In the present case, I find that the providers of the letters of support had no intention of providing financial support to enable Parakou to meet the Galsworthy claim. (a) First, on 20 November 2008, CC Liu (the sole shareholder of PSSA) made a demand on behalf of PSSA for repayment of all outstanding loans.105Foot Note 105×14 ACB 10041.PSSA’s letter of support dated 7 July 2008 in which it stated its intention to “continue to provide adequate finance to [Parakou] until all other payables have been met”106Foot Note 106×1 ACB 188.was simply ignored. (b) Second, the PIH Repayments and the PIH Set-Off (both approved by Liu Por and Yang) were made in November/December 2008 (see [16] above). PIH’s letter of support dated 7 July 2008 stating its intention to “continue to provide adequate finance to [Parakou] until all other payables have been met”107Foot Note 107×1 ACB 189.was also ignored. (c) Third, legal advice from R&T dated 19 November 2008 shows that Andy Ng had informed R&T that Parakou was intending to use the money from selling off the ship management business, the OPL business and the OPL Vessels “to discharge the existing directors’ loans”.108Foot Note 108×14 ACB 10034.The only director’s loan was CC Liu’s loan of about S$10m.109Foot Note 109×NE, 5 April 2016, at 111:22–25.Liu Por explained that R&T had misunderstood.110Foot Note 110×NE, 5 April 2016, at 110:21.I reject his explanation. When Andy Ng wrote to R&T on 5 December 2008, he again asked whether it would be possible for Parakou to “settle” the loan due to CC Liu without “[undue] liability”.111Foot Note 111×14 ACB 10053.Andy Ng must have been acting on the instructions of CC Liu and/or Liu Por and/or Yang. The evidence shows that they were exploring ways to repay CC Liu despite CC Liu’s letter of support dated 7 July 2008 in which he had stated his intention to “continue to provide adequate finance to [Parakou] until all other payables have been met.”112Foot Note 112×1 ACB 187. 86 I conclude therefore that the letters of support cannot be given any weight in determining whether Parakou was cash flow insolvent. Conclusion – Parakou was cash flow insolvent 87 In my judgment, taking the Galsworthy claim into account, Parakou was indisputably cash flow insolvent at the material times. 88 Chee’s conclusion that Parakou was cash flow solvent cannot be relied on as he did not take the Galsworthy claim into account. Chee was instructed by Parakou’s directors that it was not liable under the charterparty for theCanton Traderand that the Galsworthy claim was not going to materialise.113Foot Note 113×NE, 7 April 2016, at 103:12–16; 104:3–6.In his oral testimony, Chee agreed that Parakou would be cash flow insolvent if the Galsworthy claim had to be taken into account.114Foot Note 114×NE, 7 April 2016, at 105:22 – 106:5.",
        "Whether Parakou’s financial health required the Directors to take creditors’ interests into account in any event": "89 It is clear from the above discussion and my conclusions about Parakou’s solvency status that even if Parakou was not technically insolvent, its financial health at the material times was in such a parlous state that the Directors were under a duty to take the interests of creditors into account in their decisions.",
        "Whether some of the Disposal Transactions were undervalue transactions": "90 As stated earlier at [29(d)], Parakou claims that the following transactions were undervalue transactions: (a) The sale of the OPL Vessels to PIH. (b) The transfer of the SMAs to PSMPL. (c) The Bonus Payments to the Directors and the Salary Increases for Liu Por and Yang. (d) The Employees’ Salary Payments paid on behalf of PSMPL. (e) The Excess Rent Payments made to or on behalf of PIH. 91 To obtain the statutory remedy under s 98 of the Bankruptcy Act, the liquidator must show that (a) there was a “transaction” (b) which took place at the “relevant time” (c) when the company was “insolvent”, and (d) which was at an “undervalue”:Mercator & Noordstar NV v Velstra Pte Ltd (in liquidation)[2003] 4 SLR(R) 667 (“Mercator”) at [21]. If all four requirements are met, the court shall make “such order as it thinks fit for restoring the position to what it would have been” if the transaction had not been entered into: s 98(2) of the Bankruptcy Act. 92 It is not disputed that the first two requirements have been met. The word “transaction” is not limited to contracts or mutual dealings; it includes unilateral acts such as simple payments:Mercatorat [23]–[24]. The “relevant time” for present purposes is the period of five years ending on 14 April 2011 (iethe date on which the resolution for voluntary winding up was passed) – see s 100(1)(a)(ii) of the Bankruptcy Act read with s 329(2)(b) of the Companies Act.  All five transactions in question took place within the five-year period. 93 In view of my findings that Parakou was balance sheet and cash flow insolvent at the material times, the third requirement is also met. I need only add that under s 100(3) of the Bankruptcy Act, insolvency is presumed if the transaction is with an “associate” as defined in r 5 of the Companies (Application of Bankruptcy Act Regulations) (1996 Rev Ed). It is not disputed that this presumption applies in the present case. In any event, it is clear that the defendants have not rebutted the presumption. Further, under s 100(4) of the Bankruptcy Act, the balance sheet and the cash flow tests are alternative tests; a company is deemed insolvent as long as either test is satisfied (seeLiving the Link Pte Ltd (in creditors’ voluntary liquidation) and others v Tan Lay Tin Tina and others[2016] 3 SLR 621 (“Living the Link”) at [26], citingVelstra Pte Ltd (in compulsory winding up) v Azero Investments SA[2004] SGHC 251 at [89]). Parakou was clearly insolvent at the relevant time. 94 The only question left is whether the transactions were at an undervalue. Pursuant to s 98(3)(a) and (c) of the Bankruptcy Act, each of the transactions would be at an undervalue if Parakou entered into it for no consideration or for a consideration the value of which, in money or money’s worth, is significantly less than the value of the consideration provided by Parakou. Value is not to be determined in a vacuum; the question to be asked is “whether there was a bargain of such magnitude that it could not be explained by normal commercial practice”:Show Theatres Pte Ltd (in liquidation) v Shaw Theatres Pte Ltd and anotherapplication[2002] 1 SLR(R) 578 at [12].115Foot Note 115×PCS at para 159; 3-6DCS at para 223.There is no need to ascertain the exact monetary value of the consideration received or provided in order to determine whether one is significantly less than the other:Ailyan v Smith[2010] EWHC 24 at [49].",
        "Sale of OPL Vessels to PIH": "95 A valuation report obtained before the sale of the asset is a useful piece of evidence. But the fact that the sale price falls within the price range in the report does not necessarily mean that the sale was at a fair value: Roy Goode,The Principles of Corporate Insolvency Law(Sweet & Maxwell, 4th Ed, 2011) (“Goode”) at para 13.26. 96 Parakou sold the OPL Vessels to PIH for S$9,905,600. After deducting the remaining construction costs for two of the OPL Vessels, which were uncompleted at the time of sale, Parakou received S$8,834,600.116Foot Note 116×Meade’s AEIC, Exhibit MM-1 (“Meade’s Expert Report”) at para 3.14. 97 The defendants commissioned a valuation report (“the Amsbach report”) dated 13 November 2008.117Foot Note 117×4 ACB 2234–2283This was a ‘desktop valuation’ report, meaning that the valuation was made on the basis of documents relating to the vessel, without any physical inspection. The report noted that the market value of the OPL Vessels was impacted by “general market uncertainty with difficult credit access and terms”.118Foot Note 118×4 ACB 2235.It gave a range of values for each vessel. On an aggregate basis, the value of all the vessels ranged from S$9.906m to S$12.291m.119Foot Note 119×Meade’s Expert Report at para 3.12.The sale price of the OPL Vessels was at the low end of the range.  There was no other valuation of the OPL Vessels. 98 Parakou’s expert, Mr Michael Meade (“Meade”) from M3 Marine Group, gave evidence that120Foot Note 120×Meade’s AEIC at para 14(2). (a) as there was no effort to market the OPL Vessels to the broader market, the sale prices could not be described as “fair market values” and were closer to “forced liquidation values”; (b) a sale and purchase transaction carried out at arm’s length would typically have closed at the mid-range of the valuation; and (c) if Parakou had appointed a broker and carried out the sale at arm’s length, the sale prices could have been closer to the higher range of the valuation. 99 In the present case, the OPL Vessels had been sold in a hurry to a related company using valuation prices at the low end of the range. I accept Meade’s evidence that an arm’s-length sale would likely have closed at the mid-range of the valuation. Based on the Amsbach Report, if each of the vessels were sold at the mid-range values, the aggregate price for the OPL Vessels would have been S$11,098,500. In my view, the sale of the OPL Vessels resulted in a loss to Parakou in the sum of S$1,192,900 (ieS$11,098,500 less S$9,905,600). Parakou’s loss figure of S$2,263,900 is incorrect as it was computed using S$8,834,600 as the sale price. As stated at [96] above, S$8,834,600 was the net price received by Parakou after deducting the remaining construction costs for two of the OPL Vessels. The correct figure to use is the gross sale price of the OPL Vessels,ie, S$9,905,600.",
        "Transfer of the SMAs to PSMPL": "100 Parakou did not assign the SMAs to PSMPL. What actually happened was that the Pretty Entities first terminated the SMAs with Parakou with effect from 30 November 2008 and then entered into new SMAs with PSMPL from 1 December 2008. The Pretty Entities were well within their rights under the SMAs with Parakou to terminate the same. However, it is obvious that these steps were orchestrated by CC Liu, Chik and Liu Por with the objective of effecting a transfer of the SMAs to PSMPL. CC Liu and Chik were directors of Parakou, the Pretty Entities (together with Lau Hoi) and PSMPL (together with Liu Por) when these steps were taken. The defendants did not dispute that the transfer of the SMAs to PSMPL was a ‘transaction’ for purposes of s 98 of the Bankruptcy Act. In any event, under s 2(1) of the Bankruptcy Act, a ‘transaction’ includes any ’arrangement’. In my view, the steps taken to effect the transfer of the SMAs amounted to an arrangement which falls within the definition of ‘transaction’. 101 Under s 98(3)(a) of the Bankruptcy Act, a transaction is at an undervalue if it is entered into on terms that provide for no consideration to be received. PSMPL did not provide any consideration for the transfer of the SMAs to it. The transfer therefore took place at an undervalue within the meaning of s 98(3)(a) of the Bankruptcy Act.",
        "The Bonus Payments and Salary Increases": "102 Parakou claims that the Bonus Payments and Salary Increases were not commensurate with the value provided by the Directors to the company, in particular, in the case of CC Liu and Chik who were not even based in Singapore. In addition, Parakou says that since the bonuses were paid in December 2008 for services rendered in 2008, the consideration for the bonuses was past consideration and therefore not good consideration. The bonuses were not paid pursuant to any contractual term. Parakou also pointed out that the Bonus Payments were unprecedented in that no bonuses had been paid to CC Liu, Chik or Liu Por in 2006 and 2007. 103 In my view, there is insufficient evidence to justify a finding that the Salary Increases were at an undervalue. However, I agree with Parakou that the bonuses were undervalue transactions as Parakou received no consideration for them.",
        "Employees’ Salary Payments": "210 CC Liu, Liu Por, Yang and PSMPL are jointly and severally liable to pay Parakou S$309,376.85 being Parakou’s loss in respect of the Employees’ Salary Payments.",
        "The Excess Rent Payments": "107 Parakou’s case is that after the termination of the Affected Employees on 31 December 2008, it had only four employees, one of whom was based in Beijing. However, Liu Por and Yang caused Parakou to pay rent at S$30,000 per month. As stated previously, PIH was the tenant and Parakou occupied part of the space tenanted by PIH. In its pleadings, Parakou refers both to payment of rent on behalf of PIH as well as to PIH.122Foot Note 122×SOC at paras 62–65.It does not matter which is the case since either way, PIH received the benefit of the payments. Parakou paid a total amount of S$240,000 as rent for the period from January 2009 to August 2009. Parakou claims that this rent was wholly disproportionate to the actual space utilised by the remaining three employees who were based in Singapore. 108 Parakou does not know the actual space occupied by Parakou and relies instead on market research data for an estimate of the office space required by its three employees. Parakou claims that applying the same rate per square foot that was actually paid by it to this estimate, the rent payable for the space required for three employees should have been S$3,341.25 per month (or S$26,730 for the period from January to August 2009). Therefore, Parakou claims that the Excess Rent Payments amounted to S$213,270. Parakou claims that it received no consideration for the Excess Rent Payments. 109 Liu Por and Yang pointed out that the rent paid by Parakou had been reduced from S$130,000 per month to S$30,000 per month to take into account the termination of the Affected Employees.123Foot Note 123×3-6DCS at para 312.They also claim that Parakou had seven employees in Singapore and that Parakou also shared administrative space, meeting rooms and other common areas with PIH and PSMPL. Liu Por testified that as a director, he also had an office space. 110 In my view, Parakou has not discharged its burden of proof. Its claim with respect to the Excess Rent Payments is, in my view, speculative.",
        "Conclusion – some Disposal Transactions were undervalue transactions": "111 In my view, the sale of the OPL Vessels, the transfer of the SMAs, the Bonus Payments and the Employees’ Salary Payments were undervalue transactions. The Salary Increases and the Excess Rent Payments were not.",
        "Whether the Disposal Transactions were in breach of directors’ duties": "112 The defendants’ explanation for the Disposal Transactions is the alleged restructuring plan. I have rejected that explanation and found that there was no restructuring plan. As matters stand, however, the defendants’ reliance on the alleged restructuring plan is misplaced. Parakou was insolvent or nearly insolvent by the time the Disposal Transactions were carried out. This meant that, regardless of any restructuring plan, the Directors had to consider whether the Disposal Transactions were in the interests of Parakou’s creditors. If they were not, the directors concerned would have acted in breach of their duties and it would have been no answer for them to say that they were merely implementing the alleged restructuring plan.",
        "Whether the Disposal Transactions were in the interests of creditors": "113 Given my finding that Parakou was balance sheet and cash flow insolvent at all material times, the Directors were under a fiduciary duty to take into account the interests of the company’s creditors when making decisions for the company. The question is whether each of the Disposal Transactions was in the interests of the creditors. Sale of OPL Vessels 114 There was no compelling reason for the rushed sale of the OPL Vessels to a related party at an undervalue. In my view, the sale of the OPL Vessels was not in the interests of the creditors and was in breach of the directors’ duties. PIH Repayments, and PSSA Repayment 115 The PIH Repayments and PSSA Repayment were clearly intended to prefer PIH and PSSA over Parakou’s other creditors in the event of Parakou’s liquidation. There is no other credible explanation. As noted at [85] above, these payments were made despite the fact that PIH and PSSA had both given letters of support stating their respective intentions to continue to provide financial support to Parakou “until all other payables have been met”. 116 There is no claim to recover these payments as undue preferences because they fall outside the claw-back period of two years provided s 100(1) of the Bankruptcy Act read with s 329(2) of the Companies Act. 117 The Directors, relying onLiving the Link, submit that where undue preference payments fall outside the claw-back period, the directors who authorised or made the payments cannot be sued for breach of fiduciary duties. They submit therefore that they cannot be held liable for breach of directors’ duties with respect to the PIH Repayments and PSSA Repayment. 118 Parakou submits that the liquidator is entitled to bring concurrent claims for both undue preference and breach of fiduciary duty and that a director who procured and/or authorised the undue preference would also be liable for breach of fiduciary duties. Parakou also relies onLiving the Linkin which the learned judge stated as follows (at [88]): … But I see no reason why a company should not be able to bring concurrent claims for both undue preference and breach of fiduciary duty as the liquidators have done in this case… Although they concern the same subject matter, the two claims are clearly premised on distinct causes of action. This, however, is subject to the caveat, which I will return to below, that the courts must be slow in allowing the liquidator to employ the claim against the director as a means of circumventing the strict statutory criteria for an undue preference laid down by Parliament in the Bankruptcy Act (seeKnight v Frost[1999] 1 BCLC 364 (“Knight”)at 381– 82and Re Continental Assurance Co of London plc (No 4); Singer v Beckett[2007] 2 BCLC 287 at [420]). 119 InLiving the Link, the court set aside certain transactions made within the relevant claw-back period as undue preferences and found the director who procured the transactions to be liable for breach of fiduciary duties (at [78]). However, certain cash transfers made outside the claw-back period were held to be legitimate and the director was therefore held not to have breached her director’s duties (at [91]). 120 In the present case, the Directors rely on the learned judge’sobiterobservations (at [92]) that even if the cash transfers had been influenced by a desire to prefer the associate companies, it was likely that he would not have found the director to be in breach of her duties. The learned judge’s reason was that courts must be slow in allowing the liquidator to circumvent the strict statutory criteria for an undue preference laid down in ss 99 and 100 of the Bankruptcy Act by bringing a claim directly against the director. 121 I note that the learned judge inLiving the Linkdid not shut the door to claims against directors for breach of duties for procuring an undue preference which falls outside the claw-back period. Each case must turn on its own facts. 122 In my view, the mere fact that the PIH Repayments and PSSA Repayment took place outside the claw-back period cannot excuse the directors concerned from being held liable for breach of their duties. As stated inLiving the Link(at [88]), a claim to recover an undue preference is a distinct cause of action from a claim for breach of directors’ duties even though they concern the same subject-matter. The fact that the payment was made outside of the claw-back period means that the statutory remedy is not available against the creditors who were preferred (in this case, PIH and PSSA). However, this ought not to excuse the director who procured the preferential payments for no legitimate reason. There were no legitimate reasons for the PIH Repayments and PSSA Repayment which were carried out in quick succession within two months in November and December 2008. Parakou was insolvent when they were made and they were clearly not in the interests of Parakou’s other creditors. 123 In my view, the directors who procured or authorised these transactions acted against the interests of creditors of the company and must be held liable for breach of their duties as directors. 124 The PIH Repayments and the PSSA Repayment extinguished the respective debts owed by Parakou to PIH and PSSA. As succinctly explained inLiving the Link(at [84]–[86]), the fact that Parakou’s liabilities to PIH and PSSA were reduced does not absolve the directors concerned from liability for breach of fiduciary duties. However, to the extent that the directors concerned are ordered to repay the value of the undue preferences, Parakou (and consequently, its creditors) would be in a better position since it no longer has to pay PIH or PSSA. To address this and ensure that unsecured creditors of Parakou will not receive a larger dividend than they would have otherwise obtained, the dividends attributable to such repayments are to be recouped to the directors who made the repayments (seeLiving the Linkat [84], [85] and [90]). PIH Set-Off 125 As this was a set-off, there was no payment by Parakou to PIH. A total amount of S$1,732,239.17 that PIH owed Parakou was set-off against amounts that Parakou owed PIH (see [16(b)] above). In my view, leaving aside the expiry of the claw-back period, the PIH Set-Off was in any event not an undue preference. One of the requirements for an undue preference is that the recipient’s position is improved in the event of the company’s winding up (see s 329 of the Companies Act read with s 99(3)(b) of the Bankruptcy Act). In my view, the PIH Set-Off did not satisfy this requirement. PIH would have been entitled to set-off its debt to Parakou against the debt that was owing by Parakou to it, whether or not Parakou went into liquidation. It is true that the statutory set-off in insolvency requires mutuality of dealings (see s 327(2) of the Companies Act read with s 88 of the Bankruptcy Act) but there is no question that this is satisfied in the present case. Where the statutory set-off in insolvency is available, any prior agreement for set-off cannot be construed as a void preference:Halsbury’s Laws of Singaporevol 13 (LexisNexis, 2016 Reissue) at para 150.443, footnote 2. 126 In my opinion, the fact that PIH was entitled to a set-off in any event also means that the PIH Set-Off cannot be said to have been contrary to the interests of Parakou’s creditors. The PIH Set-Off was therefore not in breach of directors’ duties. Bonus Payments, Salary Increases and Employees’ Salary Payments 127 The Bonus Payments and Salary Increases must be viewed in their proper context. Parakou was insolvent by then. The Bonus Payments were unprecedented and there was no contractual obligation to pay any bonus or give any salary increases. I agree with Parakou that given its financial status then, the Bonus Payments and the Salary Increases were not in the interests of its creditors and were in breach of the directors’ duties. As for the Employees’ Salary Payments, I have rejected the defendants’ explanation that the six employees’ names were erroneously included in the list of Affected Employees who had tendered their resignations from Parakou (see [105] and [106] above). There was no legitimate reason for Parakou to make the Employees’ Salary Payments. The Employees’ Salary Payments were therefore also in breach of directors’ duties. Transfer of SMAs 128 The ship management business was set up as a cost centre to provide ship management services to the Pretty Vessels which were owned by related parties (iethe Pretty Entities). It was, in Liu Por’s words, simply an “in-house” service.124Foot Note 124×Liu Por’s AEIC at para 112.It seems to me that the SMAs were transferred out of Parakou so that the management services for the Pretty Vessels would not be disrupted by Parakou’s liquidation. However, what is important here is that the ship management business was loss-making, a fact that the liquidator admitted during his oral testimony.125Foot Note 125×NE, 17 March 2016, at 51:7 – 52:24. 129 In the circumstances, in my view, the transfer of the SMAs was in fact in the interests of Parakou’s creditors and was not in breach of the directors’ duties. Excess Rent Payments 130 I have found that Parakou’s claim with respect to the Excess Rent Payments is speculative (see [110] above). Accordingly, the Excess Rent Payments were not in breach of directors’ duties.",
        "Conclusion – Disposal Transactions and breach of duties": "131 On the evidence, I am driven to the conclusion that, with the exception of the transfer of the SMAs, the PIH Set-Off and the Excess Rent Payments, the Disposal Transactions were carried out to shift assets out of Parakou because the Directors knew that it was highly probable, if not inevitable, that Galsworthy would succeed in its claim. The Directors knew that Parakou would not be able to discharge its liability to Galsworthy in that event. CC Liu, Chik and Liu Por had no intention of funding Parakou to meet Galsworthy’s claim. These transactions were not in the interests of Parakou’s creditors and were therefore in breach of directors’ duties. 132 CC Liu and Chik breached their duties as directors in authorising or procuring the sale of the OPL Vessels, the PIH Repayments, the PSSA Repayment, the Bonus Payments and the Salary Increases. The decisions to carry out these transactions were made when CC Liu and Chik were the directors of Parakou. 133 CC Liu, Liu Por and Yang breached their fiduciary duties with respect to the Employees’ Salary Payments. These took place when CC Liu, Liu Por and Yang were the directors of Parakou. Although CC Liu had resigned from the board by then, I have concluded that he continued as a shadow director after his resignation (see [35] above).",
        "Whether the Directors breached their duties in deciding to defend the London Arbitration and pursue the HK Proceedings": "134 In winding up proceedings, the court has the power to set aside an undue preference and make such order as it thinks fit for restoring the position to what it would have been if the undue preference had not been given: s 329 of the Companies Act read with s 99(2) of the Bankruptcy Act. The claw-back period is two years if the defendant was an associate of the company when the undue preference was given: s 100(1) of the Bankruptcy Act. 135 Parakou alleges that the Directors defended the Galsworthy claim in the London Arbitration and pursued the HK Proceedings in order to delay the winding up of Parakou until the two-year period for undue preference claims had expired. Parakou says that in doing so, the Directors were therefore in breach of their duties. Once again, the question is whether the steps taken by Parakou in the London Arbitration and the HK Proceedings were in the interests of its creditors. 136 The PIH Repayments and PSSA Repayment took place in November and December 2008 (see [16] above). The two-year claw-back period for undue preference claims expired at the latest by the end of December 2010. Parakou was wound up in 2011. On the evidence, the liquidator would have been able to recover these payments from PIH and PSSA as undue preferences but for the fact that they took place outside the claw-back period. Parakou argues as follows: (a) The Directors were well aware of the claw-back period of two years for undue preferences. The Directors do not dispute this. (b) The Directors were advised (including by Parsons QC) from the outset that Parakou “would fail” in the London Arbitration (see [80(f)] above). (c) The Directors sought to delay the proceedings. They objected to Galsworthy’s application for an expedited procedure although they had long anticipated the claim. They also objected to Clarkson providing Galsworthy with theCanton Traderfixture file although they knew they had no reason to do so.126Foot Note 126×20 ACB 12789–12791.The Directors also objected to Galsworthy’s application to take evidence from Clarkson, causing the Tribunal to describe the objection as “disappointing” since the evidence was what the Directors “themselves regard[ed] as being of vital importance”.127Foot Note 127×15 ACB 10618. (d) Concerned that the London Arbitration was not enough to delay matters past the two-year claw-back period, the Directors commenced the HK Proceedings on completely frivolous grounds. The Directors were advised that their claim in Hong Kong was “hopeless”.128Foot Note 128×15 ACB 10763.In the event, the claim in the HK Proceedings was struck out on the first day of trial at first instance.129Foot Note 129×15 ACB 10767. (e) Parakou’s Hong Kong counsel noted his understanding that Parakou may be able to “hold off winding up proceedings in Singapore on the basis of a pending appeal in Hong Kong”.130Foot Note 130×15 ACB 10782 at para 60.An email dated 11 November 2010 from the company’s Singapore lawyers also showed that the Directors were concerned about Galsworthy winding-up the company in Singapore.131Foot Note 131×15 ACB 10786.In another email dated 23 November 2010, the company’s Singapore lawyers instructed Hong Kong counsel to proceed to fix the hearing date for the appeal if “it will certainly be sometime next year”;132Foot Note 132×15 ACB 10788.by then, the two-year claw-back period would have expired. 137 In response, the Directors first pointed out that they had at least three opportunities to delay proceedings but did not do so:133Foot Note 133×3-6DCS at paras 182–184. (a) In March 2009, the arbitrator initially approached by Parakou said he would have to recuse or discharge himself due to conflict issues. Under the relevant arbitration rules, Parakou had 14 days to appoint an alternative arbitrator but Parakou did so a mere three days later. (b) In February 2010, Parakou’s solicitors informed Galsworthy’s solicitors that they would only agree to an extension of seven days for exchange of witness statements in the London Arbitration as opposed the extension of one month that had been requested. (c) On the first day of the London Arbitration (26 July 2010), two of the three arbitrators informed parties of a potential conflict of interest. Liu Por and Yang waived the potential conflict and the arbitration proceeded. 138 Next, the Directors pointed out that Liu Por and Yang had procured Parakou to admit liability for US$2.67m if the arbitration tribunal found that a valid charterparty existed between Parakou and Galsworthy.134Foot Note 134×3-6DCS at para 185.This led to the First Award dated 31 August 2010 against Parakou for US$2,673,279.15. As the liquidator admitted on the stand, there was nothing to stop Galsworthy from winding Parakou up, based on the First Award, before the two-year claw-back period expired.135Foot Note 135×NE, 17 March 2016, at 128:1–129:1.Indeed, on 6 September 2010, Galsworthy’s then solicitors issued a statutory demand for payment of the First Award.136Foot Note 136×20 ACB 12886–12887.Parakou argues that the Directors sought to rely on the HK Proceedings to hold off any winding up application by Galsworthy.137Foot Note 137×20 ACB 12888.However, Galsworthy’s solicitors were clearly of the view that Galsworthy was fully entitled to apply for a winding up order against Parakou notwithstanding the HK Proceedings.138Foot Note 138×20 ACB 12890. 139 The Directors therefore submit that they were not trying to delay Galsworthy from winding up Parakou until after the claw-back period expired. Instead, they submit that defending the London Arbitration and pursuing the HK Proceedings were part of a strategy to achieve a settlement with Galsworthy. As a result of the HK Proceedings, Parakou managed to compel Galsworthy’s related parties to put up security of US$44m for a period of more than a year. The Directors argue that this was part of the strategy to increase commercial pressure on Galsworthy. 140 Further, the Directors point to the fact that Liu Por and Yang had themselves placed Parakou into voluntary liquidation in March 2011 when the five-year claw-back period for undervalue transactions had not yet expired. The Directors argue that this shows there was no intention to delay the liquidation of Parakou until after the claw-back periods. 141 It must first be noted that Chik was no longer a director at the relevant time and Parakou therefore has no claim against her in respect of the London Arbitration and HK Proceedings. Looking at all the evidence in its totality, I am not satisfied that the liquidator has proved its claim. It seems to me that although CC Liu, Liu Por and Yang were conscious of the two-year claw-back period, their objective in defending the London Arbitration and pursuing the HK Proceedings was indeed to put pressure on Galsworthy to negotiate a settlement. 142 In particular, there was no reason for Liu Por and Yang to make the admission that led to the First Award in August 2010, if their objective was indeed to prevent any winding up application being made before the two-year claw-back period expired in December 2010. Parakou has no answer to this. In addition, CC Liu, Liu Por and Yang in fact proceeded with the appeal in the HK Proceedings even after the two-year claw-back period had expired. There was no need for them to do continue with the HK Proceedings if the reason for pursuing the HK Proceedings was simply to let the two-year claw-back period expire. Parakou’s solicitors described the appeal as “part of an overall strategy to keep the US$44m in the HK Courts for the purpose of incentivitising [sic] a negotiated settlement”.139Foot Note 139×15 ACB 10784.There is further evidence of this strategy. In an email dated 6 September 2010, Parakou’s Singapore solicitors made the point to its HK solicitors that Parakou had “absolutely no assets” and referred to a strategy to “say to opponents that it is either they take US$1 million or they get nothing in liquidation”.140Foot Note 140×15 ACB 10762. 143 I find that the decisions to defend the London Arbitration and to pursue the HK Proceedings were not in breach of directors’ duties.",
        "Whether PIH and PSMPL are liable for dishonest assistance and/or knowing receipt": "144 Parakou claims that PIH and PSMPL are liable for (a) dishonest assistance,ie,by assisting the Directors in the dishonest breaches of their duties, and (b) knowing receipt,ie,in receiving Parakou’s property under circumstances where they are chargeable for the property.",
        "The law": "145 To establish dishonest assistance, Parakou has to prove that (a) there was a trust, (b) there was a breach of trust, (c) PIH and PSMPL rendered assistance towards the breach of trust and (d) the assistance rendered by PIH and PSMPL was dishonest:George Raymond Zage III and another v Ho Chi Kwong and another[2010] 2 SLR 589 (“GRZ III”) at [20]. Dishonesty is established if the defendant has such knowledge of the irregular shortcomings of the transactions that ordinary honest people would consider him to be in breach of standards of honest conduct if he failed to adequately query them:GRZ IIIat [22]. 146 As for knowing receipt, the elements are (a) a disposal of the plaintiff’s assets in breach of fiduciary duty, (b) the beneficial receipt of the defendant of assets which are traceable as representing the assets of the plaintiff and (c) knowledge on the part of the defendant that the assets received are traceable to a breach of fiduciary duty:GRZ IIIat [23], affirmingCaltong (Australia) Pty Ltd (formerly known as Tong Tien See Holding (Australia) Pty Ltd) and another v Tong Tien See Construction Pte Ltd (in liquidation) and another appeal[2002] 2 SLR(R) 94 at [31]. The defendant’s state of knowledge must be such as to make it unconscionable for him to retain the benefit of the receipt:Bank of Credit and Commerce International (Overseas) Ltd and another v Akindele[2001] Ch 437 at 455E. 147 Where the defendant is a company, it may be attributed with the state of mind of its directing organ under its constitution,ieits board of directors acting as such or for some purposes the general body of shareholders:Bilta (UK) Ltd (in liquidation) and others v Nazir and others (No 2)[2015] 2 WLR 1168 (“Bilta”) at [67].",
        "Claims against PIH": "148 The claims against PIH for dishonest assistance and/or knowing receipt relate to the sale of the OPL Vessels, the PIH Repayments, the PIH Set-Off and the Excess Rent Payments.141Foot Note 141×SOC at paras 89–94.As I have held that the PIH Set-Off and the Excess Rent Payments were not in breach of the directors’ fiduciary duties, Parakou’s claims against PIH in respect of the same fall away. 149 It is not disputed that the directors were in the position of trustees in relation to Parakou’s assets. I have found that CC Liu and Chik breached their fiduciary duties in authorising the sale of the OPL Vessels and the PIH Repayments (see [132] above). It cannot be disputed that PIH assisted in these breaches and that PIH received the OPL Vessels and the PIH Repayments. The only question is whether the assistance rendered by PIH was dishonest and whether PIH’s receipt was with knowledge of the breaches by CC Liu and Chik. 150 As CC Liu and Chik were also directors of PIH at the material time, PIH is attributed with their knowledge. PIH therefore must be taken to have known that the sale of the OPL Vessels and the PIH Repayments were in breach of the directors’ fiduciary duties. It follows that PIH’s assistance was dishonest and that it would be unconscionable for PIH to retain the benefit of what it had received. 151 I therefore find that PIH is liable for dishonest assistance and knowing receipt in respect of the sale of the OPL Vessels and the PIH Repayments. For the same reasons discussed at [124] above, to the extent that PIH is ordered to pay the value of the PIH Repayments, the dividends attributable to such payments are to be recouped to PIH.",
        "Claims against PSMPL": "152 Parakou claims against PSMPL for dishonest assistance and/or knowing receipt in relation to the transfer of the SMAs and for dishonest assistance in relation to the Employees’ Salary Payments.142Foot Note 142×SOC at paras 95, 96 and 98.As I have found that the transfer of the SMAs did not involve a breach of the directors’ fiduciary duties, Parakou’s claim against PSMPL in respect of the same likewise falls away. 153 I have found that CC Liu, Liu Por and Yang acted in breach of their fiduciary duties as directors of Parakou in authorising or making the Employees’ Salary Payments (see [133] above). PSMPL rendered assistance by permitting Parakou to pay the salaries of the six employees although they were employed by PSMPL. 154 As CC Liu, Liu Por and Yang were also directors of PSMPL at the material time, PSMPL is attributed with their knowledge. Hence, PSMPL must be taken to have known that the Employees’ Salary Payments were in breach of the directors’ fiduciary duties. Again, it follows that PSMPL’s assistance was dishonest. 155 PSMPL is therefore liable for dishonest assistance in respect of the Employees’ Salary Payments. 156 CC Liu, Liu Por and Yang are jointly and severally liable with PSMPL in respect of the Employees’ Salary Payments.",
        "Piercing the corporate veils of PIH and PSMPL": "157 As pleaded, Parakou seeks to pierce the corporate veil of (a) PIH to make the Directors liable to account for the profits from the sale of the OPL Vessels;143Foot Note 143×SOC at para 89(5).and (b) PSMPL to make the Directors liable to account for the management fees and profits arising from the transfer of the SMAs,144Foot Note 144×SOC at para 97. 158 Parakou submits that the corporate veil may be pierced to recognise the receipt of a company as that of the individual in control of it if the company had been used as a device or façade to conceal the true facts, thereby avoiding or concealing any liability of that individual:Trustor AB v Smallbone and others (No 2)[2001] 3 All ER 987 (“Trustor AB”). 159 The corporate veil should not be pierced save in exceptional circumstances. Any attempt to do so deserves close scrutiny. In the present case, the OPL Vessels were sold to PIH, albeit at an undervalue. In my view, Parakou has not proved that the relevant directors at the material time used the corporate structure ofPIH to avoid or conceal their breach of duty (seeTrustor ABat [22]). 160 The question of piercing PSMPL’s corporate veil in connection with the transfer of the SMAs does not arise since PSMPL is not liable for dishonest assistance or knowing receipt in respect of the same.",
        "Whether the defendants are liable for unlawful means conspiracy": "161 Parakou claims that the defendants conspired to injure it and/or to cause it loss by unlawful means. The elements of conspiracy by unlawful means are as follows: (a) a combination of two or more persons to do certain acts, (b) the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts, (c) the acts were unlawful, (d) the acts were performed in furtherance of the agreement and (e) the plaintiff suffered loss as a result of the conspiracy:EFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 at [112]. 162 As pleaded, Parakou’s conspiracy claim arises in connection with the sale of the OPL Vessels, the PIH Repayments, the PIH Set-Off, the Bonus Payments, and the transfer of the SMAs and Affected Employees to PSMPL.145Foot Note 145×SOC at para 105.Parakou pleads that these constitute unlawful means as they involved directors’ breaches of duties and PIH’s and PSMPL’s dishonest assistance and/or knowing receipt.146Foot Note 146×SOC at para 106. 163 The PIH Set-Off and the transfers of the SMAs were not in breach of directors’ duties and are not unlawful means. The transfer of the Affected Employees was in consequence of the transfer of the SMAs and therefore also not in breach of directors’ duties. As the transfer of the SMAs and the Affected Employees were the only alleged unlawful means that involved PSMPL, it follows that the conspiracy claim against PSMPL fails. 164  The surviving conspiracy claim concerns only the sale of the OPL Vessels, the PIH Repayments and the Bonus Payments. The parties involved in the conspiracy were as follows: (a) CC Liu and Chik who were the directors of Parakou at the material time. They were also two of the recipients of the Bonus Payments; (b) Liu Por and Yang who were the Vice-President and President respectively of Parakou at the material time and had knowledge of the transactions. They were also authorised to execute and had executed the documents for the sale of the OPL Vessels to PIH. Liu Por and Yang were also the other two recipients of the Bonus Payments; (c) PIH which was the purchaser of the OPL Vessels and the recipient of the PIH Repayments. CC Liu and Liu Por were the directors of PIH at the material time. However, PIH was not involved in respect of the Bonus Payments. 165 As the sale of the OPL Vessels, PIH Repayments, PIH Set-Off and Bonus Payments were made in breach of the directors’ duties, these acts were unlawful. It is also clear that the intent was to cause loss to Parakou. Further, Parakou suffered pecuniary damage. The OPL Vessels had been sold at an undervalue. The PIH Repayments, PIH Set-Off and Bonus Payments resulted in monies being paid to PIH and the Directors. 166 In my view, (a) the Directors and PIH are liable for conspiracy to injure by unlawful means in connection with the sale of the OPL Vessels and the PIH Repayments; and (b) the Directors are liable for conspiracy to injure by unlawful means in connection with the Bonus Payments.",
        "Summary of findings": "167 CC Liu and Chik resigned from Parakou’s board with effect from 31 December 2008. However, CC Liu continued as a shadow director of Parakou thereafter. 168 Neither Liu Por nor Yang werede factodirectors before they were appointed as directors of Parakou on 22 December 2008. 169 The Disposal Transactions were not carried out pursuant to any restructuring plan. There was no restructuring plan. The March 2008 Resolution was not a contemporaneous document. 170 Parakou was both balance sheet and cash flow insolvent when the Disposal Transactions were carried out. Even if Parakou was not technically insolvent at the material times, its financial health was in a parlous state. The Directors therefore had a fiduciary duty to consider the interests of Parakou’s creditors before deciding to carry out the Disposal Transactions. 171 The sale of the OPL Vessels, the transfer of the SMAs, the Bonus Payments and the Employees’ Salary Payments were undervalue transactions. 172 The Salary Increases and the Excess Rent Payments were not undervalue transactions. 173 CC Liu and Chik breached their fiduciary duties as directors in authorising or procuring the sale of the OPL Vessels, the PIH Repayments, the PSSA Repayment, the Bonus Payments and the Salary Increases. 174 CC Liu, Liu Por and Yang breached their fiduciary duties as directors in authorising or procuring the Employees’ Salary Payments. 175 The transfer of the SMAs, the PIH Set-Off, the Excess Rent Payments and the decisions to defend the London Arbitration and pursue the HK Proceedings were not in breach of directors’ duties. 176 PIH is liable on the grounds of dishonest assistance and knowing receipt in connection with the sale of the OPL Vessels and the PIH Repayments. 177 PSMPL is liable on the ground of dishonest assistance in connection with the Employees’ Salary Payments. 178 The Directors and PIH are liable for conspiracy to injure by unlawful means in connection with the sale of the OPL Vessels and PIH Repayments. The Directors are liable for conspiracy to injure by unlawful means in connection with the Bonus Payments.",
        "Remedies": "179 A fiduciary who causes loss to the company as a result of his breach of fiduciary duty is liablein personamto pay equitable compensation (as damages) to the company. The claimant has an alternative remedy against the fiduciary for an account of profits which have been made in breach of fiduciary duty. Relief given by way of an account of profits is measured by the gain made by the wrongdoer irrespective of whether the claimant has suffered a corresponding loss:Snell’s Equity(John McGhee, ed) (Sweet & Maxwell, 33rd Ed, 2015) (“Snell’s Equity”) at para 20-039. 180 Where a fiduciary has made a gain through a breach of fiduciary duty, the claimant has anin personamclaim for payment of the amount brought out by the account of profits. Alternatively, the claimant may pursue a proprietary remedy – a constructive trust may be imposed on the profit or its traceable proceeds provided these survive in identifiable form in the fiduciary’s hands; otherwise there is no property to which the constructive trust can attach. See, David Hayton, Paul Matthews & Charles Mitchell,Underhill and Hayton: Lawof Trusts and Trustees(LexisNexis, 19th Ed, 2016) (“Underhill and Hayton”) at para 27.25. 181 Where the trustee has misapplied the claimant’s original asset and transferred it to a third person, the claimant can either follow the original asset and enforce his equitable title to it, or trace into the substituted asset in the hands of the trustee and enforce a proprietary remedy against it. Against a substituted asset in the hands of the trustee, the claimant has two alternative proprietary remedies. He may enforce an equitable lien against it for the value of the original asset which was applied to acquire it. Alternatively, he may claim the entire beneficial ownership of the substituted asset under a constructive trust. See,Snell’s Equityat para 30-055. 182 A claimant in a breach of trust may have claims against third parties involved in the breach,eg, dishonest assistants or knowing recipients. Claims brought against such third parties have the effect of reducing the amount of the claimant’s loss resulting from the primary breach of trust. Any sum which the beneficiary recovers would be counted towards reducing the amount of the trustee’s primary liability for losses resulting from the breach. See,Snells’ Equityat para 30-067.",
        "Election between alternative remedies": "183 A plaintiff may have alternative remedies against a defendant. Where alternative and inconsistent remedies (as opposed to cumulative remedies) are available to the plaintiff, he must elect between them. The classic example of inconsistent and alternative remedies is (a) an account of the profits made by a defendant in breach of his fiduciary obligations and (b) damages for the loss suffered by reason of the same breach. A plaintiff must elect one or the other. The election need not be made when proceedings are first brought but must be made when judgment is given in his favour. He is also entitled to readily available information before an election is made. See,Snell’s Equityat para 7-052. 184 As discussed earlier, both personal and proprietary remedies are potentially available where the fiduciary has made a profit. The court can award both personal and proprietary remedies on an alternative but not on a cumulative basis. It cannot order a fiduciary both to deliver up property to the principal and to pay over its value, but it can allow the principal to choose between the two. See,Underhill and Haytonat para 27.26. 185 Against a substituted asset in the hands of the trustee, the claimant has to elect between (a) enforcing an equitable lien against it for the value of the original asset which was applied to acquire it, and (b) claiming the entire beneficial ownership of the substituted asset under a constructive trust. 186 Where alternative remedies are cumulative, the claimant does not have to make an election but he cannot recover in the aggregate an amount in excess of his loss.",
        "Breach of directors’ fiduciary duties": "187 Each of the Directors is liable to Parakou for the losses caused to Parakou by his or her breaches of fiduciary duties (see [173] and [174] above). Alternatively, each of them is liable for an account of profits made by each of them in breach of fiduciary duties in connection with the Bonus Payments and Salary Increases.",
        "Dishonest assistance and knowing receipt": "188 A breach of fiduciary duty by a director is generally treated as a breach of trust. Where dishonest assistance or knowing receipt is established in connection with a breach of fiduciary duty by a director, the third party concerned is liable as constructive trustee. See,Corporate Lawat para 09.110. 189 A dishonest assistant is secondarily liable to pay equitable compensation for the losses caused by the breach of duty in which he assisted, or possibly to account for profits which accrue to him as a result of his assistance:Snell’s Equityat paras 20-033, 20-043 and 30-080. 190 A knowing recipient is liable to give restitution of the value of the property received by him. His liability is fixed at the value of the property when he first received it. A knowing recipient may also be required to account for profits gained as a result of his knowing receipt. SeeSnell’s Equityat paras 20-043 and 30-071. 191  PIH is liable to Parakou for the losses caused to Parakou as a result of its dishonest assistance in respect of the sale of the OPL Vessels and the PIH Repayments. PIH’s liability for knowing receipt would appear to be the same amount as the loss caused to Parakou. Alternatively, PIH is liable, as a constructive trustee, for an account of profits made as a result of its dishonest assistance and knowing receipt in connection with the sale of the OPL Vessels and the PIH Repayments. 192 PSMPL is liable to Parakou for the losses caused to Parakou as a result of its dishonest assistance in connection with the Employees’ Salary Payments (see [177] above).",
        "Undervalue transactions": "193 The discretion given to the court under s 98(2) of the Bankruptcy Act is a wide one. The court may, in appropriate cases, allow the defendant to retain the asset in return for a payment of the difference between the full value of the asset and the value which was in fact received by the company:Living the Linkat [75], citingGoodeat para 13-46 andPena v Coyne (No 2)[2004] 2 BCLC 730. On the other hand, the court will not make an order where the company would have found itself in an even worse position if the transaction had not been carried out:Goodeat para 13-45. 194 With respect to the sale of the OPL Vessels, restoring thestatus quowould be problematic given the lapse in time. In my view, the appropriate order is for PIH to retain the vessels but pay Parakou the sum of S$1,192,900 being the difference between the price that the vessels could have been sold for and the price that Parakou in fact received. 195 With respect to the Bonus Payments, each of the Directors will have to return the bonus received by him or her. 196 As for the Employees’ Salary Payments, PSMPL, having received the benefit of the payments amounting to S$309,376.85, will have to pay this amount to Parakou. 197 However, I do not think that any order should be made under s 98(2) in respect of the transfer of the SMAs. As stated at [128] above, the SMAs were loss making. Further, it is not disputed that the SMAs could have been terminated on 30 days’ notice or would have been terminated automatically upon Parakou’s liquidation in any event. It seems to me to be pointless and of no benefit to Parakou to restore the position to what it would have been if the transfer of the SMAs had not taken place.",
        "Damages arising from conspiracy claim": "198 The Directors and PIH are liable to Parakou for damages arising from the conspiracy claim in connection with the sale of the OPL Vessels and the PIH Repayments. The Directors are liable to Parakou for damages arising from the conspiracy claim in connection with the Bonus Payments. Damages are to be assessed.",
        "Conclusion": "199 As can be seen from the above, Parakou has alternative remedies against each defendant. It seems to me that it will not be a useful (or practical) exercise to try and deal with each and every remedy separately for purposes of the final orders to be made and I do not attempt to do so.",
        "Sale of OPL Vessels and PIH Repayments": "200 CC Liu, Chik and PIH are jointly and severally liable to Parakou for the following losses suffered by Parakou: (a) S$1,192,900 in respect of the sale of the OPL Vessels; and (b) S$9,812,542.80 in respect of the PIH Repayments. 201 PIH is also liable to account for the profits made by it as a result of its dishonest assistance in connection with the sale of the OPL Vessels and the PIH Repayments. 202 As against PIH therefore, Parakou may choose to elect between (a) claiming for loss suffered and (b) an account of profits. If Parakou elects an account of profits against PIH, Parakou has to then elect between making a personal claim and a proprietary claim. If Parakou elects the proprietary claim and profits are traced to substituted assets in the hands PIH, Parakou has to elect between (a) enforcing an equitable lien for the original value of the profits and (b) claiming the entire beneficial ownership of the substituted asset. 203 CC Liu, Chik, Liu Por, Yang and PIH are also jointly and severally liable for damages to be assessed arising from the unlawful means conspiracy claim in connection with the sale of the OPL Vessels and the PIH Repayments. Obviously, Parakou will not be entitled to double recovery. 204 Any dividends in Parakou’s liquidation that are attributable to any payment made by any of these defendants in respect of the PIH Repayments are to be recouped to the defendant who made the payment.",
        "PSSA Repayment": "205 CC Liu and Chik are jointly and severally liable to pay Parakou S$3,046,200 being the losses suffered by Parakou in respect of the PSSA Repayment. Any dividends in Parakou’s liquidation that are attributable to any payment made by either defendant in respect of the PSSA Repayment are to be recouped to the defendant who made the payment.",
        "Bonus Payments and Salary Increases": "206 CC Liu and Chik are jointly and severally liable to pay Parakou the following losses suffered by Parakou: (a) S$267,127.50 in respect of the Bonus Payments; and (b) S$108,000 in respect of the Salary Increases. 207 Each of CC Liu and Chik is liable for an account of profits made by him or her in breach of his or her fiduciary duties in connection with the amount of bonus received by him or her as a result of the Bonus Payments. 208 Parakou has to elect, as against each of CC Liu and Chik, between (a) claiming for loss suffered and (b) an account of profits. If Parakou elects an account of profits, Parakou has to then elect between making a personal claim and a proprietary claim. If Parakou elects the proprietary claim and profits are traced to substituted assets in the hands CC Liu and/or Chik, Parakou has to elect between (a) enforcing an equitable lien for the original value of the profits and (b) claiming the entire beneficial ownership of the substituted asset. 209 CC Liu, Chik, Liu Por and Yang are also jointly and severally liable for damages to be assessed arising from the unlawful means conspiracy claim in connection with the Bonus Payments. As mentioned previously, Parakou will not be entitled to double recovery.",
        "Interest and costs": "211 Interest is to be paid on all sums payable to Parakou at 5.33% from the date of the writ until judgment. 212 I will hear parties on costs. Chua Lee MingJudge Edwin Tong SC, Kenneth Lim Tao Chung, Chua Xinying and Yu Kexin (Allen & Gledhill LLP) for the plaintiff; Tan Shien Loon Lawrence, Senthil Dayalan and Ng Jia En (Eldan Law LLP) for the first and second defendants; Siraj Omar and Premalatha Silwaraju (Premier Law LLC) for the third and fourth defendants; Sim Chong and Yap Hao Jin (Sim Chong LLC) for the fifth and sixth defendants."
    }
}