{
    "case_title": "Liu HuaixivHaniffa Pte Ltd",
    "ncitation": "[2017] SGHC 270",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1 The applicant lodged a claim to the Commissioner for Labour against the respondent for a shortfall in the payment of his salary pursuant to s 119 of the Employment Act (Cap 91, 2009 Rev Ed) (“the Act”). On 22 July 2016, the Assistant Commissioner for Labour (“the Commissioner”) dismissed the bulk of the applicant’s claim. The Commissioner found the respondent only liable to pay the applicant the sum of $457.70 due to a mistake in the computation of his overtime. The applicant appealed to this court pursuant to s 117 of the Act. On 16 February 2017, after hearing counsel for the parties, I allowed the applicant’s appeal in part and ordered the respondent to pay $6,500 to the applicant. I also ordered the respondent to pay costs of the appeal fixed at $8,000 inclusive of disbursements. I now give my reasons.",
        "Background": "2 The respondent is a company in the business of selling textiles, jewellery, electronics, toiletries, and food products. The applicant, who is from China, worked for the respondent on a work permit from 7 April 2014 to 23 March 2016. 3 During this period, the respondent employed the applicant in two different positions: as a warehouse assistant from 7 April 2014 to 12 July 2015, and as a supermarket storekeeper from 13 July 2015 to 23 March 2016. The applicant’s employment ended on 23 March 2016. The parties did not agree whether the respondent or the applicant initiated the termination but that was not material to my decision. 4 This claim arose out of three sets of claims by the applicant against the respondent: (a) Short payment of the applicant’s salary from 28 March 2015 to 29 February 2016. (b) Non-payment of the applicant’s salary from 1 March 2016 to 23 March 2016. (c) Compensation in lieu of notice for the respondent’s termination of the applicant’s contract. 5 Although the applicant was employed by the respondent from 7 April 2014 to 23 March 2016, the one-year statutory bar under s 115(2) of the Act meant that the Commissioner only had jurisdiction to consider claims arising up to one year before the date of complaint. Since the applicant only lodged his complaint with the Ministry of Manpower (“MOM”) on 28 March 2016, the Commissioner could only consider the claim from 28 March 2015 to 23 March 2016. 6 The Commissioner dismissed the bulk of the applicant’s claims. On claim (a), he was not convinced that the applicant’s basic salary was $1,100 per month, as the applicant claimed. Instead, the Commissioner found that the applicant’s basic monthly salary was $680. However, the Commissioner noted that the respondent had wrongly computed the pay due to the applicant for overtime work and for his work on rest days. Hence, he ordered the respondent to pay the applicant $457.70, which the respondent has since paid. On claim (b), the Commissioner found as a matter of fact that the applicant had received his salary for the period 1 March 2016 to 23 March 2016, and accordingly also dismissed that claim. Claim (c) for compensation in lieu of notice of termination was not pursued by the applicant before the Commissioner.",
        "Issues": "7 It was not disputed by the parties that an appeal to the High Court from the decision of the Commissioner is to be heard by way of rehearing and this court is not constrained to reviewing the decision below for jurisdictional or manifest error or unreasonableness: see O 55 r 2(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed);Valentino Globe BV v Pacific Rim IndustriesInc[2009] 4 SLR(R) 577 at [10]–[11]. In particular, the court is not bound by any finding of the Commissioner. Accordingly, there were three issues before me: (a) Whether the respondent paid the applicant the full salary that he was entitled to between 28 March 2015 and 29 February 2016. (b) Whether the respondent paid the applicant his salary between 1 March 2016 and 23 March 2016. (c) Whether the respondent was liable to the applicant for compensation in lieu of notice of termination. I will address each of these issues in turn.",
        "Issue (a): Short payment of salary": "",
        "Applicant’s submissions": "44 At the hearing before me, Ms Eio informed me that the applicant was only claiming for payment in lieu of two days’ notice. She submitted that this would be for a sum of $84.62, being two days’ worth of the applicant’s basic rate of pay of $42.31. Ms Eio relied on s 10(3)(b) of the Act, which provides that an employee shall be given not less than one week’s notice of termination if he has been employed for more than 26 weeks but for less than two years. No such notice was given, as the applicant was informed that his employment was terminated on 23 March 2016 with immediate effect.",
        "Respondent’s submissions": "45 Mr Namazie submitted that no payment was necessary since the applicant chose to stop working. It was not the respondent who terminated the applicant’s employment. According to Mr Namazie, the respondent had decided not to renew the applicant’s work permit one month before it was due to expire on 27 March 2016. This was communicated to the applicant. The applicant had attempted to persuade the respondent to change its mind on multiple occasions, but the respondent did not relent. In those circumstances, the applicant requested to cease work early on 23 March 2016, so that he would have time to settle his affairs before taking his pre-booked flight out of Singapore on 29 March 2016. 46 Indeed, Mr Namazie submitted that there was no reason why the respondent would terminate the applicant’s employment just four days before his work permit was due to expire.",
        "My decision": "47 The facts before me were that the applicant’s employment was terminated on 23 March 2016, given that the respondent had issued a payslip for the period of 1 March 2016 to 23 March 2016. The respondent did not adduce any evidence that it had given notice to the applicant. As I earlier noted, it is incumbent on employers like the respondent to keep written documentation, not only to protect themselves, but also to ensure that their employees are fairly treated. Not only was there no such documentation in this case, but the only available documents were the March 2016 payslip and the letter of release. Both were only signed on 26 March 2016, which indicated to me that the respondent did not give sufficient notice. 48 Since the respondent did not give sufficient notice under s 10(3)(b) of the Act, the applicant was entitled to two days’ worth of his gross rate of pay under s 11(1) of the Act. In principle, thegrossrate of pay as defined under s 107A(1) of the Act is distinct from thebasicrate of pay under s 107A(2). But in this specific instance, the two were the same amount of $42.31. Accordingly, the respondent would need to pay the applicant a sum of $84.62.",
        "Issue (b): Non-payment of March 2016 salary": "",
        "Issue (c): Payment in lieu of notice of termination": "",
        "Overall sum": "49 On the basis of the findings I have made on each of the issues, I granted the applicant’s claim, subject to the following reductions: (a) $1,209.30, being the adjustment based on number of hours worked and part payment (at [36] above); and (b) $1,046.53, as I have found that the applicant was paid his March 2016 salary (at [43] above). 50 Accordingly, I ordered the respondent to pay the applicant the sum of $6,500 (after rounding up).",
        "Costs": "51 Ms Eio asked for costs on the basis that the applicant had succeeded in his application. Mr Namazie submitted that since Ms Eio took up the casepro bono, there should be no order as to costs. 52 I saw no reason in principle why the court should not award costs purely because the successful party is represented by counsel actingpro bono. Indeed, if costs were ordered on the ordinary basis, it would promotepro bonowork. This was also the case inSATS Construction Pte Ltd v IslamMd Ohidul[2016] 3 SLR 1164, where Debbie Ong JC awarded costs to counsel actingpro bono, as “pro bonoand legal aid services are provided to enhance access to justice and it is fair for the providers of such services to be paid for the work they have done by virtue of costs orders” (at [17]). This was precisely the case here. I therefore ordered the respondent to pay costs to the applicant, which I fixed at $8,000 inclusive of disbursements. Lee Seiu KinJudge Eio Huiting Sharleen (TSMP Law Corporation) for the applicant;Namazie Mirza Mohamed and Ong Ai Weern (Mallal & Namazie) for the respondent."
    }
}