{
    "case_title": "Liu Tsu Kun and another vTan Eu Jin and others",
    "ncitation": "[2017] SGHC 241",
    "coram": "Tan Siong Thye J",
    "sections": {
        "Introduction": "1 The plaintiffs claim against the defendants for the sums of US$1m, S$500,000 and S$2.5m. These were monies paid by the plaintiffs to the defendants for their investments in Autostyle Cars Company Limited (“Autostyle”) and Virtues Development Pte Ltd (“VDPL”), which turned out to be bogus investments. The plaintiffs also claim damages from the defendants for conspiracy by unlawful means and for making fraudulent misrepresentations which induced them to invest in the said sham investments.1Foot Note 1×Statement of Claim (Amendment No 1), paras 36–38. 2 The defendants deny the plaintiffs’ claims. They say that the Autostyle and VDPL investments were genuine transactions which turned sour. If there were any fraudulent misrepresentations, they were made by Ng Wee Liam Jerry (“Ng”), another director of JE Capital Pte Ltd (“JE Capital”), the third defendant. The defendants allege that the representations were made solely by Ng to the plaintiffs and that they had no part to play when the plaintiffs were invited to invest in Autostyle and VDPL. 3 After hearing the parties’ evidence and submissions, I reserved judgment.",
        "Undisputed facts": "",
        "The relevant parties": "4 The plaintiffs are Liu Tsu Kun (“PW1”) and Liu Chung Chi (“PW2”). PW1 is a Singapore citizen and PW2, who is PW1’s father, is a Singapore permanent resident.2Foot Note 2×BAEIC, p 5.The defendants are Tan Eu Jin (“DW1”), Tan Eu Chong (“DW2”) and JE Capital. DW1 was a director with a 36.25% shareholding in JE Capital. DW2 was an “alternate director” with a 20% shareholding in JE Capital.3Foot Note 3×3AB, pp 494–504.DW1 and DW2 are brothers. 5 Apart from the above, there are three other relevant and important parties. First, there is another company involved in the transactions, JE Capital Investments Pte Ltd (“JE Investments”), which is a subsidiary of JE Capital. DW1 and Ng were also directors of JE Investments. Second, there is one Lim Hung Kok (“PW3”), who was the bank relationship manager of PW1, DW1 and Ng. PW3 acted on PW1’s behalf in his various dealings with the defendants for these two investments. Third, there is Ng, who was a director of both JE Capital and JE Investments4Foot Note 4×Exhibit P19.and also had a 36.25% shareholding in JE Capital. He played a significant role in marketing the two investments to the plaintiffs but his whereabouts are presently unknown.",
        "The two investments": "6 The subject matter of this suit is the following two investments between the plaintiffs and the defendants: (a)The Autostyle investment. PW1 subscribed to Autostyle shares under an Autostyle Subscription Agreement (“ASA”) and an Autostyle Note (“AN”) for the sum of US$1m. These investments were secured by a banker’s guarantee (“BG”) issued by ABN AMRO for US$1m. It was not in dispute that the BG was later found to be forged. (b)The VDPL investment. The defendants, through JE Capital, intended to purchase a piece of land at 15 Genting Road (“15 Genting”) held by VDPL. This was to be done by buying 95% of VDPL’s shares.5Foot Note 5×BAEIC, p 250.To fund the share purchase, JE Capital entered into a transaction with the plaintiffs. The parties did not dispute that pursuant to the transaction, PW1 advanced S$500,000 and PW2 advanced S$2.5m to JE Capital on 27 November 2014.",
        "Parties’ submissions": "",
        "Plaintiffs’ submissions": "Autostyle investment 7 The plaintiffs submit that the Autostyle investment was a sham investment6Foot Note 6×PWS, paras 5–6.which DW1 and DW2 were involved in. The plaintiffs’ case is that both DW1 and Ng were responsible for the Autostyle investment. The Autostyle investment was first conceived in 2013 when DW1 discussed it with one Sarju Poport (“Sarju”) and one Simal Poport (“Simal”) whilst in the UK.7Foot Note 7×Transcripts Day 5, p 27, lines 5–28.DW1 then discussed it with Ng, and they agreed to use JE Investments as the underwriter for this investment. 8 Subsequently, both DW1 and Ng marketed the Autostyle investment to third party investors. Ng marketed the Autostyle investment to PW1 through PW3 while DW1 marketed the Autostyle investment to investors in China. Once PW1 had expressed interest in the Autostyle investment, Ng informed DW1 of PW1’s interest. PW1 later transferred US$1m to JE Capital for the investment. PW1’s investment in Autostyle was secured by the BG, which was subsequently issued to PW1. The BG was later found to be forged. 9 The plaintiffs submit that DW1 was involved in the Autostyle investment for the following reasons: (a) First, despite knowing that PW1’s US$1m was for the Autostyle investment, DW1 went ahead to use PW1’s money together with the money of another investor, Ma Yanzhi (“Ma”),8Foot Note 8×Transcripts Day 6, p 32, lines 10–16.to grant a loan of £1m to Centurion UK Ltd (“Centurion”). This loan was made without any documentation and without PW1’s approval, even though JE Capital had never dealt with Centurion before.9Foot Note 9×PWS, para 13. (b) Second, DW1 knew that the BG, which secured the Autostyle investment, was forged. PW3 stated in his affidavit of evidence-in-chief that the BG had been sent to him by DW1 and Ng, which PW3 later forwarded to PW1.10Foot Note 10×PWS, paras 189–191.It was later discovered in mid-2015 that the BG was forged. Instead of conducting further investigations into the forgery and alerting the other investors, particularly PW1, DW1 instructed Ng to “burn” an email pertaining to the banker’s guarantee of another investor, one Wang Hong Gang (“Wang”).11Foot Note 11×PWS, paras 171–175. 10 The plaintiffs also submit that DW2 is liable even though he was not directly involved in the Autostyle investment as he conspired with Ng to defraud investors, including PW1. They assert that this conspiracy can be seen from the fact that DW2 agreed with Ng that JE Investments would be used for the Autostyle investment, and that DW2 was aware of the “car project” that DW1 and Ng were involved in (ie, the Autostyle investment).12Foot Note 12×PWS, para 13. VDPL investment 11 As for the VDPL investment, the plaintiffs submit that this was also a sham investment and that both DW1 and DW2 knew or were involved in it. The VDPL investment was a sham because the three receipt vouchers that were issued to prove that the investment was ongoing were forged. The VDPL investment was later abandoned sometime in July 2015.13Foot Note 13×PWS, paras 96–98. 12 The plaintiffs submit that DW1 was involved in the sham VDPL investment in the following ways: (a) DW1 knew of the plan to acquire VDPL’s shares as he signed the relevant resolution passed by JE Capital. (b) DW1 and Ng met PW2 in Xindian, Taiwan to convince PW2 to invest in the VDPL project. At this meeting, DW1 explained the investment to PW2, and Ng represented that the VDPL investment was genuine. PW2 agreed to invest and transferred S$2.5m to JE Capital about three weeks later. (c) DW1 approved the VDPL term sheet and the presentation slides that were sent to PW1 via email. These induced PW1 to make the VDPL investment. PW1 later transferred S$500,000 to JE Capital for the VDPL investment. (d) Five days later, almost the entire S$3m of the plaintiffs’ monies were paid out to various directors of JE Capital,14Foot Note 14×PWS, para 14.including DW1, and to its shareholders, including DW2. 13 The plaintiffs also submit that DW2 was aware of the VDPL investment as he knew that JE Capital required external funding to construct the GoodWater Centre of Excellence for The GoodWater Company Pte Ltd (“GoodWater”), a subsidiary that DW2 was in charge of. DW2 also knew of the various payments out of JE Capital’s accounts as he was one of two required signatories.15Foot Note 15×PWS, para 14.Finally, after the plaintiffs’ S$3m was transferred into JE Capital, DW2 received a large sum of the plaintiffs’ money that was paid out.",
        "Defendants’ submissions": "Autostyle investment 14 The crux of the defendants’ submissions is that there is no direct evidence to link them to any fraudulent misrepresentations or conspiracy. It was Ng who was the main perpetrator.16Foot Note 16×D1WS, paras 3–4; D2WS, para 1. 15 For the Autostyle investment, DW1 submits that PW1 entered into the investment only because PW1 trusted PW3 and Ng. Any allegations that DW1 was involved are unsubstantiated.17Foot Note 17×D1WS, paras 21–22.In fact, DW1 never met PW1 prior to March 2016 and both parties had never discussed the Autostyle investment prior to this date.18Foot Note 18×D1WS, paras 26–28.DW1 submits that the “true conspiracy”, if any,19Foot Note 19×D1WS, p 13.was that PW3 had received kickbacks from Ng to turn a blind eye, avoid conducting due diligence, and merely assume the role of referring investors to Ng.20Foot Note 20×D1WS, para 40. 16 DW2 submits that he had “no involvement whatsoever” with the Autostyle investment21Foot Note 21×D2WS, para 41.as he had never met PW1 until January 2016. Furthermore, neither PW1 nor PW3 obtained any relevant information from or had any relevant communications with DW2.22Foot Note 22×D2WS, para 42.Although the BG which was meant to be security for the Autostyle investment had been forged, DW2 did not furnish the BG and was not involved in any way in its preparation.23Foot Note 23×D2WS, para 44. VDPL investment 17 For the VDPL investment, DW1 submits that the investment was a genuine and simple loan agreement which placed no restrictions on how JE Capital would eventually use the money advanced.24Foot Note 24×D1WS, para 56.Indeed, the payments that were later made from JE Capital’s accounts in December 2014, which the plaintiffs say are evidence of misfeasance, were repayments of director’s loans that had previously been given to JE Capital.25Foot Note 25×D1WS, para 60.While the VDPL investment was eventually abandoned sometime in July 2015 by DW1, DW1 submits that this is insufficient to show that he had entered into a conspiracy with Ng.26Foot Note 26×D1WS, para 58.Finally, while it is true that there were forged receipt vouchers relating to the VDPL investment, these were forged by Ng, who copied DW1 in the email when he sent out the soft copy of the forged receipt vouchers. This was not evidence that DW1 had forged the receipt vouchers or had colluded with Ng in any way.27Foot Note 27×D1WS, para 64. 18 DW2 submits that similar to the Autostyle investment, he had “no material involvement” in the VDPL investment.28Foot Note 28×D2WS, para 47.While he was aware that the investment existed, this was only because of his role as the CEO of GoodWater. He was aware that JE Capital intended to acquire the land at 15 Genting for the purpose of building a Centre of Excellence for Goodwater.29Foot Note 29×D2WS, para 48.Furthermore, DW2 had never met PW1 until January 2016,30Foot Note 30×D2WS, paras 51–53.and had never met PW2 until the trial.31Foot Note 31×D2WS, para 62.Hence, DW2 did not meet either of the plaintiffs until after the VDPL investment had been entered into. Finally, even if DW2 was obliquely involved in passing documents relating to the VDPL investment, this did not mean that he was part of any conspiracy. DW2’s role was confined to knowing that a Centre of Excellence was to be built at 15 Genting for GoodWater.32Foot Note 32×D2WS, paras 57–60.",
        "The court’s decision": "",
        "Issues": "19 The plaintiffs’ main cause of action is conspiracy by unlawful means. However, the unlawful means alleged in this case is fraudulent misrepresentation. Accordingly, I have to address the following issues in relation to both the Autostyle investment and the VDPL investment: (a) Did the defendants make fraudulent misrepresentations to PW1 in relation to the Autostyle investment and to both plaintiffs in relation to the VDPL investment? (b) Even if the defendants did not make fraudulent misrepresentations in relation to these investments, were they part of a conspiracy to defraud PW1 (in relation to both investments) and PW2 (in relation to the VDPL investment)? Before I address these issues I shall examine the relevant law.",
        "The law": "Conspiracy by unlawful means 20 The elements of the tort of conspiracy by unlawful means were set out by the Court of Appeal inEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 (“EFT Holdings”) at [101] read with [112]: (a) There was a combination of two or more persons to do certain acts. (b) The alleged conspirators intended to cause damage or injury to the plaintiffs by those acts. It is not sufficient that harm to the plaintiffs was a likely, probable, or even inevitable consequence of the defendants’ conduct. (c) The acts were unlawful. (d) The acts were performed in furtherance of the agreement. (e) The plaintiffs suffered loss as a result of the conspiracy. These elements were applied again by the Court of Appeal inSimgood Pte Ltd v MLC Barging Pte Ltd and others[2016] 1 SLR 1129 (“Simgood”) at [13] and are undisputed. 21 I note that there is some controversy over whether unlawful means conspiracy can exist alone as a cause of action. Indeed, the Court of Appeal expressly refrained from answering that question inEFT Holdings(at [90]). But subsequently, the Court of Appeal inSimgoodapplied the tort directly to the facts and therefore appears to have implicitly endorsed its existence. I shall therefore proceed on the basis that the tort of conspiracy by unlawful means is available in the present case. Fraudulent misrepresentation 22 As noted earlier at [20(c)], one of the elements of conspiracy by unlawful means is that one of the parties committed an unlawful act. In this case, the plaintiffs allege that the unlawful act is fraudulent misrepresentation. Hence, the elements of fraudulent misrepresentation must also be satisfied. 23 The elements of the tort of fraudulent misrepresentation were set out by the Court of Appeal inPanatron Pte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 at [14] and [24]: (a) There must have been a representation of fact made by words or conduct. (b) The representation must have been made with the intention that it should be acted upon by the plaintiff or a class of persons including the plaintiff. (c) The plaintiff must have acted on the false statement and must have been induced by the representations. Once this is proved, it is no defence that the plaintiff acted incautiously and failed to verify the truth of the representations. (d) The plaintiff must have suffered damage by doing so. (e) The representation must have been made with the knowledge that it was false; it must have been wilfully false or at least made in the absence of any genuine belief that it was true. 24 In applying these elements to the facts, two points merit consideration. First, misrepresentation can be made by silence even though it would be difficult to do so. InTrans-World (Aluminium) Ltd v Cornelder China (Singapore)[2003] 3 SLR(R) 501, the High Court held that misrepresentation by silence was possible but more than mere silence was needed. There must be a wilful suppression of material and important facts or “such a partial and fragmentary statement of fact that the withholding of that which is not stated makes that which is stated absolutely false” (at [66]–[67], citing Lord Cairns inPeek v Gurney[1861–73] All ER Rep 116 at 129). Similarly, the Court of Appeal inWee Chiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Wee Chiaw Sek Anna”) held at [65]: It is trite law that “mere silence, however morally wrong, will not support an action of deceit” … There can be no misrepresentation by omission, although active concealment of a particular state of affairs may amount to misrepresentation … In other words, for silence to be misrepresentation, it must be part of a factual matrix that includes the defendant making some positive statement or representation, but the silence consists in omitting to mention material facts within that statement or representation. 25 Second, although the standard of proof for an allegation of fraudulent misrepresentation is still based on a balance of probabilities (as in all civil cases), but because an allegation of fraud is a serious one, the party alleging fraud must furnish more evidence the graver his allegation. The Court of Appeal inWee Chiaw Sek Annaalso expressed this view at [30]–[31]: 30 It is, in our view, of the first importance to emphasise right at the outset therelatively high standard of proofwhich must be satisfied by the representee (here, the Appellant) before a fraudulent misrepresentation can be established successfully against the representor (here, the Deceased). As V K Rajah JA put it in the Singapore High Court decision ofVita Health Laboratories Pte Ltd v Pang Seng Meng[2004] 4 SLR(R) 162 (at [30]), the allegation of fraud is a serious one and that “[g]enerally speaking, the graver the allegation, the higher the standard of proof incumbent on the claimant”. … 31 This high standard of proof is also consistent with the fact that an award of damages for fraudulent misrepresentation covers awideambit – including all loss which flowed directly as a result of the entry by the representee into the transaction in question,regardless of whether or not such loss was foreseeable… [emphasis in original] 26 Similar sentiments were expressed by the Court of Appeal inTang Yoke Kheng (trading as Niklex Supply Co) v Lek Benedict and others[2005] 3 SLR(R) 263 at [14]: … But since fraud can also be the subject of a civil claim, the civil standard of proving on a balance of probabilities must apply because there is no known “third standard” although such cases are usually known as “fraud in a civil case” as if alluding to a third standard of proof. However, because of the severity and potentially serious implications attaching to a fraud, even in a civil trial, judges are not normally satisfied by that little bit more evidence such as to tilt the “balance”. They normally require more. … Therefore, we would reiterate that the standard of proof in a civil case, including cases where fraud is alleged, is that based on a balance of probabilities; but the more serious the allegation, the more the party, on whose shoulders the burden of proof falls, may have to do if he hopes to establish his case. These sentiments are apposite in the present case since the plaintiffs allege that the defendants had, from the very beginning, marketed investments which they knew were not genuine and dishonestly constructed a scheme, including “forg[ing] financial documents” and making “positive efforts to conceal all evidence of fraud”,33Foot Note 33×BAEIC, p 17.in order to lure the plaintiffs into the investments. This is a serious allegation that requires more proof for the plaintiffs to discharge their burden of proof.",
        "Application to the facts": "27 I shall deal with the plaintiffs’ case against DW2 first, as it is relatively less complicated. I shall then turn to the plaintiffs’ case against DW1, and finally to the evidence against JE Capital. Evidence against DW2 (1) Autostyle investment 28 I find that DW2 did not make any fraudulent misrepresentations relating to the Autostyle investment. For this investment, the parties agree that PW3 was the main gateway between PW1 on the one hand and Ng and the defendants on the other. Moreover, PW3 testified that he had no dealings with DW2 and that he did not communicate with DW2 about the Autostyle investment. PW3 further stated that he did not receive the BG (which was later found to be forged) from DW2.34Foot Note 34×Transcripts Day 2, p 63, lines 29–31.Indeed, the following testimony from PW3 is significant:35Foot Note 35×Transcripts Day 3, p 33, lines 30–32. Q: Do you agree that you have never communicated with [DW2] on matters pertaining to Autostyle terms or negotiations of the contract? A: I agree with the statement. 29 While PW3 did correspond with Ng and DW1 in relation to the Autostyle investment, neither Ng nor DW1 had asked for DW2 to be included in the relevant correspondence.36Foot Note 36×Transcripts Day 3, p 33, lines 18–32; p 44, lines 14–16.In other words, although PW3 was the main point of contact between the parties in relation to the Autostyle investment, he had never communicated with DW2. Hence, DW2 was not involved in the Autostyle investment. 30 This is corroborated by PW1, who also admitted that DW2 was not copied in any of the correspondence relating to the Autostyle investment.37Foot Note 37×Transcripts Day 2, p 63, lines 5–7.In fact, PW1 conceded that he had never even communicated with, spoken to, or met DW2 until January 2016,38Foot Note 38×Transcripts Day 2, p 62, lines 28–30.which was nearly two years after the ASA and AN were entered into:39Foot Note 39×PBD, pp 35–47. Q: So, Mr Liu, before January 2016, do you agree that we [ie, PW1 and DW2] have never communicated via email or spoken or met? Do you agree, Mr Liu? A: Correct. Therefore DW2 could not have made any representations that induced PW1 to enter into the Autostyle investment as he only arrived on the scene nearly two years after PW1’s investment. 31 In relation to the issue of conspiracy, the plaintiffs sought to convince the court that DW2 was involved in a conspiracy to defraud PW1 as DW2 was copied in the email that DW1 had sent to Ng, asking Ng to “burn” an email chain relating to Wang’s banker’s guarantee. In response, DW2 explained that when he saw that email he had asked DW1 for an answer and DW1 said that he suspected that Ng might have been up to some mischief.40Foot Note 40×Transcripts Day 7, p 58, lines 8–21. 32 In my view, the fact that DW2 was copied in this email is insufficient in itself to suggest that DW2 was involved in a conspiracy to defraud the plaintiffs. Rather, this email is more significant in relation to the question of whether DW1 was part of this conspiracy, since he was the one who sent the email (which is a point I shall deal with later). As for DW2, besides being copied in the said email, there is no evidence that would suggest that he was party to the conspiracy. Instead, DW2’s testimony (which remained unscathed throughout cross-examination) was that he was never told by Ng and DW1 that there would be investors for the Autostyle investment because his role in JE Capital was only to run another subsidiary, GoodWater.41Foot Note 41×Transcripts Day 7, p 21, lines 1–11.This is why DW2’s reaction when he received the email pertaining to Wang’s banker’s guarantee was to ask DW1 for an explanation.42Foot Note 42×Transcripts Day 7, p 61, lines 15–18. 33 I therefore dismiss the claim against DW2 in relation to the Autostyle investment. (2) VDPL investment 34 As noted at [30] above, PW1 testified that he had never communicated with DW2 before January 2016. This means that DW2 could not have been in the picture when the plaintiffs signed the VDPL investment as all the events pertaining to the VDPL investments occurred before January 2016: (a) The loan agreement in relation to the VDPL investment was entered into sometime between October and November 2014. While the agreement itself was not dated,43Foot Note 43×BAEIC, pp 115–125.JE Capital first explored the VDPL investment on 7 May 201444Foot Note 44×BAEIC, p 250.and later issued a term sheet on 10 October 2014.45Foot Note 45×PBD, p 63. (b) The plaintiffs subsequently advanced the sums of S$500,000 (by PW1) and S$2.5m (by PW2) to JE Capital on 27 November 2014.46Foot Note 46×BAEIC, pp 111 and 113. (c) Finally, the email that contained the forged receipt vouchers was sent by Ng to PW3 on 12 February 2015. Indeed, PW1 conceded that DW2 was not a party to the correspondence relating to the forged receipt vouchers that JE Capital forwarded to the plaintiffs to convince them that it had genuinely invested in VDPL’s shares.47Foot Note 47×Transcripts Day 2, p 64 line 28 to p 65 line 4. 35 However, PW3 testified that DW2 was involved in the VDPL investment in the following ways: (a) DW2 was copied in the email pertaining to the negotiations of the VDPL investment.48Foot Note 48×Transcripts Day 3, p 34, lines 1–3. (b) DW2 was involved in negotiating the terms of the VDPL investment.49Foot Note 49×Transcripts Day 3, p 45, lines 4–8. (c) DW2 received documents on DW1’s behalf and attended meetings where the VDPL investment was mentioned.50Foot Note 50×Transcripts Day 3, p 36, lines 3–29. 36 PW3’s testimony was not convincing. When asked to identify which emails he had copied DW2 in, PW3 could not do so.51Foot Note 51×Transcripts Day 3, p 34, lines 1-22.Indeed, none of the emails between the parties had included DW2. DW2 was also not involved in the negotiations of the terms of the VDPL investment52Foot Note 52×BAEIC, p 252.and was not copied in the email in which Ng forwarded the forged receipt vouchers to PW3.53Foot Note 53×BAEIC, p 127.DW2 was also not involved in other relevant documents such as JE Capital’s directors’ resolution to acquire 95% of the shares of VDPL,54Foot Note 54×BAEIC, p 250.JE Capital’s term sheet,55Foot Note 55×BAEIC, p 109.and the loan agreement.56Foot Note 56×BAEIC, p 125. 37 As for PW3’s testimony that he had inquired about the VDPL investment at a meeting where DW2 was also present, this meeting was “sometime in May 2015”57Foot Note 57×Transcripts Day 3, p 37, lines 25–28.which would have beenafterthe VDPL investment was entered into. Again, DW2 could not have induced the plaintiffs to enter into the investment as he played no part before the loan agreement was signed. Furthermore, PW3’s testimony on this point lacks credibility because he seemed unsure about whether the alleged meeting was in relation to the Autostyle investment or the VDPL investment. PW3 also changed his answer multiple times.58Foot Note 58×Transcripts Day 3, p 37, line 22; and p 38, lines 12–27. 38 Hence, I find that DW2 did not make any fraudulent misrepresentations in relation to the VDPL investment. 39 The plaintiffs alternatively submit that DW2 was involved in a conspiracy to defraud them together with DW1 and Ng as DW2 received a share of the plaintiffs’ money soon after the S$3m was deposited into JE Capital’s bank account. DW2 received S$313,994 on 3 December 2014. 40 DW2 did not dispute that he received this sum.59Foot Note 59×Transcripts Day 7, p 33, lines 15–28.He explained that this amount comprised the following:60Foot Note 60×Transcripts Day 7, p 36, lines 1–3; 3BAEIC, p 5, para 30. (a) $83,994 – outstanding salary for six months from June to November 2014;(b) $130,000 – balance of outstanding bonuses for 2013; and(c) $100,000 – repayment of outstanding loans given by DW2 to JE Capital. 41 Although this amount was large and was paid to DW2 with the approval of DW1 and Ng, the directors of JE Capital, the receipt of this amountper seis not sufficient for the court to draw the inference that DW2 was involved in a conspiracy with DW1 and Ng to defraud the plaintiffs. DW2 was not involved in the management of JE Capital and he was also not involved in marketing VDPL to the plaintiffs and other investors. Thus, he would not have known that the funds in JE Capital’s bank account belonged in part to the plaintiffs. DW2 would similarly not have known that the plaintiffs’ funds in JE Capital’s bank account were meant for the VDPL investment. 42 The reasons for the various payments to Ng, DW1, DW1’s wife and DW2 were to repay various loans made by the directors to JE Capital, and to pay outstanding salaries and bonuses. These were, by themselves, legitimate disbursements by JE Capital. At that time, DW2 was the chief operating officer of GoodWater61Foot Note 61×Transcripts Day 7, p 9, lines 7–9.although his remuneration was paid by JE Capital. He was not involved in the management of JE Capital. DW2’s role in JE Capital only began on 26 January 2015, and even then he only assumed a limited role of “alternate director” as Ng spent much of his time out of the country.62Foot Note 62×Transcripts Day 7, p 12 line 28 to p 13 line 14.Given that the evidence suggests that DW2 played an extremely limited role, the plaintiffs have not proven on the balance of probabilities that DW2 conspired with DW1 and Ng to defraud the plaintiffs in the VDPL investment. 43 Hence, I find that there is no evidence that DW2 made any representations to the plaintiffs in both the investments. The plaintiffs also fail to satisfy the court on a balance of probabilities that DW2 conspired with DW1 and Ng to defraud the plaintiffs in relation to these investments. It was only when the two investments subsequently turned sour, and when the plaintiffs started looking for people to hold accountable, that DW2 was named in this suit as he was a director of JE Capital. Evidence against DW1 (1) Autostyle investment (A) No fraudulent misrepresentations as DW1 was not actively involved 44 I shall first deal with the issue of whether DW1 made fraudulent misrepresentations to PW1 in relation to the Autostyle investment. The evidence suggests that it was Ng, and not DW1, who was actively involved in the negotiations for the Autostyle investment with PW1 and PW3: (a) PW1’s evidence is that he communicated with Ng through PW3 in relation to the BG.63Foot Note 63×BAEIC, p 6, para 10; Transcripts Day 1, p 20, lines 12–17.He also said that he had no “direct conversation[s]” with DW1 in relation to this matter although DW1 was copied in the email.64Foot Note 64×Transcripts Day 2, p 5, lines 25–30. (b) PW3 testified that DW1 was “not involved” when Ng was negotiating the term sheet with PW1 from January to February 2014.65Foot Note 65×Transcripts Day 3, p 14, lines 3–13.PW3 also did not have any discussions with DW1 pertaining to the BG.66Foot Note 66×Transcripts Day 3, p 15, lines 13–18. (c) DW1 also testified that he was not responsible for the alleged agreement with PW1, although he was aware that Ng had been marketing the investment to potential investors.67Foot Note 67×BAEIC, p 235; Transcripts Day 4, p 17, lines 11–26.DW1 said that he first became aware of the investment when Ng mentioned to him that he had been “successful” in raising money for Autostyle from PW3’s clients.68Foot Note 68×Transcripts Day 4, p 38, lines 23–28. The evidence from the various witnesses points to the fact that DW1 was not actively involved in the negotiating process for the Autostyle investment. He was a passive recipient of certain emails. If anyone had made any representations to PW1 it would have been Ng. 45 I next turn to the issue of whether, despite not having made the fraudulent misrepresentations directly to PW1, DW1 was nevertheless in a conspiracy with Ng to induce PW1 to enter into the Autostyle investment. Indeed, PW1 contends that DW1 should bear responsibility for Ng’s actions as DW1 was a major shareholder and director of JE Investments,69Foot Note 69×Exhibit P19.who Ng negotiated on behalf of.70Foot Note 70×Transcripts Day 2, p 10 line 19 to p 11 line 9.DW1 had also received the relevant emails. The answer to this issue depends on the extent of DW1’s involvement. As the majority of the evidence in this case is circumstantial, I shall examine the evidence closely in turn. (B) Unexplained discrepancies in the ASA 46 I begin with the documents involved in this case as they tell the most objective story of what the Autostyle investment was about. The plaintiffs submit that the ASA was a “nonsensical document”71Foot Note 71×PWS, para 144.that must have been created as a sham investment. The plaintiffs point to several discrepancies in the documents and I shall examine each of them in turn. 47 To begin with, the ASA was not signed by the contracting parties.72Foot Note 72×BAEIC, p 47.Although the document was signed by Ng on behalf of JE Investments and by one Sharon Lucas on behalf of JE Capital, they were not the contracting parties. The ASA was for PW1 to subscribe for Autostyle’s shares; but neither PW1 nor Autostyle had signed the agreement. I find it baffling that neither of the contracting parties signed the ASA, which was for US$1m – not a small amount. 48 Furthermore, it is ambiguous which company entered into the ASA with PW1. The document itself stated that the other contracting party was “AUTOSTYLE CARS LIMITED & AUTOSTYLE CAR COMPANY LIMITED (BVI & UK REGISTERED)”,73Foot Note 73×BAEIC, p 41.a holding company incorporated in Hong Kong. Under the recitals of the ASA, these companies were described to have an authorised share capital of £10m as of 24 February 2014, the date of the ASA. But the plaintiffs’ search revealed that the only UK-registered company that was related to Autostyle was one Autostyle Cars Limited with a paid-up capital of £100 as of 30 June 201474Foot Note 74×Exhibit P5.and the only related Hong Kong-registered company was one Autostyle Enterprise (HK) Limited that has since been dissolved.75Foot Note 75×Exhibit P16.It is therefore unclear which companies entered into the ASA with PW1 and whether they existed at the time of the ASA. 49 This is especially significant since DW1 appeared to have known about the existence of the companies registered in UK and Hong Kong. DW1 testified in court that Simal was the owner of the Hong Kong Autostyle company and Sarju was the owner of the UK Autostyle company.76Foot Note 76×Transcripts Day 5, p 27, lines 5–10.He also testified that sometime in 2013, he had met Simal and Sarju in London where they agreed to enter into the Autostyle investment to “finance [Simal’s and Sarju’s] car business”.77Foot Note 77×Transcripts Day 5, p 27, lines 19–28.Hence, he would have known of these companies’ involvement in the ASA, especially the fact that the Autostyle company registered in the UK only had a paid-up capital of £100 as of 30 June 2014 while the Autostyle company described in the recitals of the ASA was said to have a paid-up capital of £10m. Indeed, DW1 agreed during cross-examination that the UK-registered Autostyle company was the same company listed under the recitals in the ASA. When confronted with the discrepancy in the paid-up capital, DW1 could only baldly state that he “[did] not know who insert[ed] £10 million in this document”.78Foot Note 78×Transcripts Day 5, p 41, lines 20–31. 50 Apart from the confusion about the companies that were listed as parties to the ASA, there were internal inconsistencies in the document. The appendix to the ASA listed the “Issuer” of the fund notes as one “AUTOSTYLE AUTO GROUP LIMITED (LISTCO)”,79Foot Note 79×BAEIC, p 49.which was an entirely distinct entity from the two companies mentioned in the recitals. The plaintiffs conducted a search for this company but could not find it. More significantly, when DW1 was questioned about the entity in the ASA, he averred that he “personally [didn’t] understand as well because [he] never ran through this document with any sign investors”.80Foot Note 80×PWS, para 144; Transcripts Day 5, p 48, lines 6–7.I find this answer extremely puzzling given that DW1 testified that he had had discussions with Simal and Sarju – the two owners of the UK- and Hong Kong-incorporated Autostyle companies – in 2013 about the Autostyle investment, and he would have known of the companies involved in the ASA. 51 There was so much confusion as to who were the parties to the ASA and the various companies named in the ASA that even DW1, who was meant to market the ASA, did not understand the document. Furthermore, the ASA promised its investors an outrageously high investment return of 15% per annum with a payout of US$75,000 every six months (on 5 September 2014 and 5 March 2015),81Foot Note 81×BAEIC, p 50.which does not appear to be a sustainable investment. Taking the high promised returns together with the confusion inherent in the ASA, I can only conclude that the ASA was meant to lure investors like PW1, who were attracted by the exceptionally high returns, to pledge their money to the investment while turning a blind eye to the confusing discrepancies in the ASA. These indicate that the ASA was, in all likelihood, a façade hiding a sham investment. (C) False statements in the Autostyle investment prospectus 52 In addition to the ASA which contained multiple unexplained discrepancies, DW1 also admitted under cross-examination that the Autostyle investment prospectus, which was a document that DW1 and Ng had used to market the Autostyle investment, contained false statements. The relevant testimony is as follows:82Foot Note 82×Transcripts Day 4, p 36, lines 4–13. Q: It says there: [Reads] “AUTOSTYLE was founded in the year 2002 with FOUNDER Popat Family Office. Sarju Popat, a veteran auto trader with regional car trading experience of 25 years. Have progressed with the joint venture agreement funding investment partner, JE CAPITAL INVESTMENTS LIMITED since…2009.” I’ll just stop there. So, you are saying that this statement, that Autostyle Cars Co Ltd have progressed with a JV agreement funding investment partner with JE Capital Investments Ltd, is not true? A: Yes. 53 The Autostyle investment prospectus is important because it was the document that DW1 and Ng had used to market the Autostyle investment to potential investors like PW1 before they entered into further agreements such as the ASA. DW1’s admission during the trial that the investment prospectus itself contained false statements gives me even greater reason to doubt the authenticity of the Autostyle investment as a whole. (D) No records of investors’ payments in JE Capital’s financial accounts 54 When PW1’s US$1m was paid to JE Capital on 20 March 2014 for the Autostyle investment, this sum was not reflected in any of JE Capital’s financial statements for the financial year 2014, or, indeed, in any of its financial accounts. I find this very unusual as such sums, if they had been advanced by investors pursuant to legitimate investments, would have been properly recorded. When DW1 was asked to explain, he first said that the money was classified as a director’s loan;83Foot Note 83×Transcripts Day 5, p 67, lines 1–5.but when he was later confronted with JE Capital’s financial statements, DW1 changed his testimony and said that it was parked under “consulting fees”.84Foot Note 84×Transcripts Day 5, p 74, lines 5–6.DW1 attempted to chalk up the change in his testimony to the fact that JE Capital “park[ed] it [ie, PW1’s US$1m] under consulting fees because the auditors did not have time to classify Jerry Ng’s loan to the company”.85Foot Note 85×Transcripts Day 5, p 74, lines 13–14.This was an entirely unsatisfactory explanation that only emerged when DW1’s initial evidence that PW1’s US$1m was classified as a director’s loan was contradicted during cross-examination. I do not find this evidence credible. 55 In addition to PW1’s US$1m that was advanced to JE Capital which went unrecorded, a similar pattern was found in the funds of Ma, another investor. DW1 had prepared a promissory note for Ma in March 201486Foot Note 86×Transcripts Day 5, p 82, lines 26–27.and he had known that Ma’s S$1m was paid to JE Capital for the Autostyle investment,87Foot Note 87×Transcripts Day 5, p 85, lines 1–3.but again, this sum was not reflected in JE Capital’s financial statements. These unexplained instances of funds being unrecorded buttress my view that the Autostyle investment was not a genuine one, given that even DW1, who had been intimately involved in the investment from the beginning, was unable to explain why investors’ funds for this investment were not recorded. (E) Undocumented and unapproved use of PW1’s US$1m as part of a £1m loan to Centurion 56 The lack of records in relation to the investors’ funds is even more suspicious in light of what happened to these funds subsequently. The liquidator, Joshua James Taylor (“PW4”), stated in his liquidator’s report that there was a “high probability” that the plaintiffs’ funds had not been used for their intended purposes because they went to a third party, Centurion.88Foot Note 88×Transcripts Day 3, p 52 line 28 to p 53 line 28. 57 DW1 tried to explain during cross-examination that the money was transferred to Centurion as part of a £1m loan on Autostyle’s instructions as part of a “project investment”.89Foot Note 89×Transcripts Day 5, p 75, lines 22–29.This was because Centurion was one of Autostyle’s car suppliers.90Foot Note 90×Transcripts Day 5, p 79, lines 13–27.There would of course be nothing wrong for Autostyle to give instructions to JE Capital to pay Autostyle’s creditor, Centurion, if the latter was a legitimate creditor. But Centurion in this case was not a creditor but a supplier. The payment that was made was also not the payment of an existing debt (or any other similar transaction to that effect) but was, rather, a loan. This is significant because when commercial parties make loans to each other, they typically do so on pre-agreed terms. These terms would include the principal sum, the interest rate, the repayment date, the creditor’s rights upon default, etc. None of these terms are apparent from this “loan”, given that it was entirely undocumented. 58 This complete lack of documentation is, to say the least, stunning. This was not a small sum but a purported loan of £1m! Furthermore, there is no evidence that either DW1 or JE Capital had ever dealt with Centurion prior to this case.91Foot Note 91×Transcripts Day 5, p 75, lines 22-29; p 79, line 21 to p 80, line 5.This is also inconsistent with DW1’s ownmodus operandiof reducing investments to writing, as can be seen in the investments that various investors (including PW1, Ma and Wang) made in Autostyle. Indeed, DW1 admitted during cross-examination that this purported loan to Centurion was also done without the knowledge or approval of PW1.92Foot Note 92×Transcripts Day 5, p 66, lines 17–26.It is obvious that DW1 did not seek PW1’s approval for the use of this money as the latter would not have agreed since PW1’s intention was to invest in Autostyle. 59 Hence, given the fact that DW1’s use of PW1’s US$1m was entirely undocumented and unapproved, I have serious doubts about DW1’s evidence about the £1m loan to Centurion. Instead, coupled with the lack of records pertaining to PW1’s funds when they were deposited with JE Capital, the evidence indicates that DW1 and Ng were involved in a nefarious scheme to defraud investors like PW1. (F) Forged banker’s guarantees and DW1’s instructions to burn an email relating to Wang’s banker’s guarantee 60 I turn now from the evidence about the documentation and funds in the Autostyle investment (which, as I have explained, was full of discrepancies) to the evidence relating to the banker’s guarantees to the various investors, which were meant to secure their investments. The evidence in this regard likewise indicates that DW1 and Ng were in a conspiracy to defraud such investors. 61 It was undisputed that PW1’s BG was forged. DW1 admitted in cross-examination that if he had known that the BG was forged, he would not have considered the Autostyle investment as a legitimate one. The relevant exchange is as follows:93Foot Note 93×Transcripts Day 5, p 111, lines 2–16. Court:  Mr Tan, listen to the question carefully. Your position right now is that the Autostyle investment is not legitimate, having seen the forged banker’s guarantee. What is your answer? Witness:  Having seen the forged banker’s guarantee as of today, I will still say--- … Court:  “Having seen the forged banker’s guarantee as of today, I would say that the Autostyle in”--- Witness:  Investment is not legitimate. 62 This concession is significant in light of DW1’s previous position. In his statement of defence, DW1 had tried to distance himself from the BG by stating that he had “no knowledge of the alleged agreement by [JE Investments] to furnish [the BG] to [PW1]”.94Foot Note 94×Set Down Bundle, p 24, para 6.Hence, I must examine the evidence to see if DW1’s initial contention (that he did not know about the BG) is, on a balance of probabilities, true. If it is not true, then in light of DW1’s concession at trial, this would similarly mean that DW1 had marketed the Autostyle investment with the knowledge that it was not legitimate. 63 Having examined the available evidence, I find that DW1’s contention that he did not know about the BG cannot be true. On 29 June 2014, Simal (on behalf of Autostyle) sent four banker’s guarantees to Ng by email. In this email, Simal also mentioned that the originals of the banker’s guarantees would be couriered to DW1 the next day. On the same day, Ng forwarded Simal’s email to DW1. DW1 was to inform Ma about her banker’s guarantee, which was one of the four.95Foot Note 95×1DB, p 11.This email to DW1 (for him to liaise with Ma on her banker’s guarantee) was intended for him to follow up on Ma’s investment in Autostyle. Since March 2014, DW1 had been personally assisting in the procurement of Ma’s investment in Autostyle.96Foot Note 96×Exhibit P9, pp 16–19.Ma had invested in Autostyle at around the same time as PW1 and had also received a banker’s guarantee as security.97Foot Note 97×Exhibit P20. 64 Subsequently, in April 2015, Ma wrote to ABN AMRO inquiring about the validity of her banker’s guarantee. She was then told that the “documents that carry the name of ABN AMRO that [she had] received [were] fantasy documents, which have not been issued by [ABN AMRO]”.98Foot Note 98×BAEIC, p 63.Ma forwarded this email to PW3 and later called DW1 about her banker’s guarantee. DW1 admitted that by this time, he knew that her banker’s guarantee was forged.99Foot Note 99×Transcripts Day 6, p 8 line 17 to p 9 line 32. 65 DW1’s reaction to this discovery was very significant. He did not investigate the forged banker’s guarantees. Neither did he alert either Ng or the other investors who had received similar banker’s guarantees, which he would have known of since Ng had sent Simal’s email to DW1 when Ng was asking him to follow up with Ma’s banker’s guarantee. Given that all these banker’s guarantees related to the same Autostyle investment that had been entered into by the various investors on the same or similar terms, the natural and immediate reaction of a responsible and innocent underwriter of the Autostyle investment would have been to alert the investors at risk of fraud. Instead, DW1 instructed Ng via email to delete an email thread relating to the banker’s guarantee of another investor in Autostyle, Wang. The email thread that was sought to be deleted was titled “ABN AMRO BG of EUROS 1.5million (WANG HONG GANG)”, and DW1 wrote “THIS EMAIL NEEDS TO BE BURNED FROM OUR SERVER” [emphasis in original].100Foot Note 100×BAEIC, p 66. 66 When confronted with this highly incriminating email in court, DW1 tried to explain that by “burn[ing]” the email from the server, he did not mean that Ng or DW2 (who had been copied in the email) should destroy the email thread. Rather, DW1’s position was that he was angry about “something that [Ng] had done” regarding Wang’s banker’s guarantee, and he was “concerned that there [was] some wrongdoing” by Ng.101Foot Note 101×Transcripts Day 6, p 13, lines 7–12. 67 I am completely unconvinced by DW1’s explanation. DW1’s reaction is inconsistent with his contention that he did not know about the BG, and that he was not involved in any conspiracy with Ng to defraud the investors. If Ng was behind the scheme to defraud PW1, then the instruction to destroy incriminating evidence should have come from Ng and not DW1. Instead, it was DW1 and not Ng who directed that the email be burned from the server. DW1’s behaviour upon the discovery of the forged banker’s guarantee was not consistent with his portrayal of himself as an innocent person who was not part of the conspiracy to defraud PW1. His reaction was also inconsistent with the behaviour of an innocent businessman who only later discovered that the banker’s guarantees were forged. 68 To the contrary, I find that DW1’s reactions, especially seen in the light of how important these banker’s guarantees were, indicate that DW1 was in the know all along. These banker’s guarantees were purportedly sent by Simal from Autostyle for people who had invested in Autostyle. DW1 and Ng were directors of JE Investments and the underwriters of this Autostyle investment, and they were actively marketing this investment product. They knew that the banker’s guarantees were very important to the investors as the guarantees would safeguard their investments which appeared risky as it had a very high interest returns of 15% per annum. An innocent and responsible underwriter who was not involved in the sham investment would have quickly alerted those who had invested in the Autostyle investment as large sums were involved. He would also have immediately checked with the issuers of the banker’s guarantees (ie, Simal) to find out what was happening and to seek an explanation. As forgery of a banking instrument is a very serious criminal offence, an innocent underwriter who was unable to solicit a satisfactory explanation would have advised the affected investors to lodge a police report. DW1 did none of these. Instead, he did the complete opposite: he took steps to cover up and attempt to destroy evidence that suggested that the banker’s guarantees were forged, and remained silent, not alerting PW1 and the other affected investors. All of the above indicate that DW1 was not an innocent underwriter. It also suggests that, on a balance of probabilities, he did know that the banker’s guarantees, including the BG meant for PW1, were forged. 69 It must also be emphasised that both DW1 and Ng were actively involved in the marketing of the Autostyle investment, albeit to different investors. DW1 personally marketed the Autostyle investment to Ma and Wang, who were also given banker’s guarantees. Hence, although DW1 did not directly market the Autostyle investment to PW1, this is similar fact evidence that is relevant and admissible under ss 14 and 15 of the Evidence Act (Cap 97, 1997 Rev Ed). 70 Although most of the cases pertaining to similar fact evidence were decided in the criminal context,Rockline Ltd and others v Anil Thadani and others[2009] SGHC 209 (“Rockline”)102Foot Note 102×PBOA, Tab Q.explains that the principle can equally apply to the civil context with some minor modifications. InRockline, Choo Han Teck J agreed with Lord Denning’s decision inMood Music Publishing Co Ltd v De Wolfe Ltd[1976] 1 Ch 119 at 127 that “[in] civil cases the courts will admit evidence of similar facts if it is logically probative, that is, if it is logically relevant in determining the matter which is in issue: provided that it is not oppressive or unfair to the other side” (Rocklineat [2]). I agree with this statement of the law. 71 Applying this test to the facts before me, I find that the evidence relating to Ma’s and Wang’s banker’s guarantees is admissible. They are logically probative to the issue at hand as Ma’s banker’s guarantee was one of the four banker’s guarantees that Simal had sent to Ng on 29 June 2014 (which also included PW1’s BG). Ng later forwarded Ma’s banker’s guarantee to DW1, for the latter to follow up with Ma.103Foot Note 103×1DB, pp 10–11.Hence, given that Ma’s banker’s guarantee came from the same source as PW1’s, and that Ma’s investment in Autostyle also followed terms nearly identical to PW1’s,104Foot Note 104×Transcripts Day 5, p 82, lines 26–30; p 83, lines 26–30; see also P20.the authenticity of Ma’s banker’s guarantee (and DW1’s reaction to finding out that it was forged) is clearly probative in answering the question of whether DW1 knew that PW1’s BG was also forged. 72 As for Wang’s banker’s guarantee, it was not likely to have been part of the four guarantees sent by Simal as it was issued at a different date. But DW1 nevertheless knew of its existence and significance as he had agreed to meet Wang to discuss the latter’s grievances relating to his investment in Autostyle.105Foot Note 105×1DB, p 37, para 8.Hence, these pieces of evidence shed light on whether DW1 knew that there were serious problems relating to the legitimacy of the Autostyle investment. Furthermore, many of these documents were provided by the defendants themselves in their bundle of documents to support their case. 73 However, the plaintiffs also refer to other investors of JE Capital’s investment schemes who had been defrauded as evidence against DW1. They referred to Mark Penu (“Penu”), Ma, Huan Kok Sy, Wang and Liu Yanzhe. These were investors who also did not receive their returns on investments.106Foot Note 106×PWS, paras 113–116.However, these people did not testify in court. Their evidence is hearsay and inadmissible. I have to exercise caution in relation to references to their investments so that the hearsay rule is not breached. I can only refer to the documentary evidence that was provided before me, specifically, the fact that Simal had forwarded their banker’s guarantees to Ng who then forwarded them to DW1, and DW1’s reaction upon discovering that Ma’s banker’s guarantee was forged. 74 This evidence suggests that DW1 indeed knew that PW1’s BG was forged to begin with, and therefore, that the Autostyle investment was not genuine. This in turn indicates that DW1 conspired with Ng to defraud investors who wanted to place their money in the Autostyle investment. (G) Payments received by Ng and PW3 75 Although DW1 was not able to satisfactorily address the issues above, he submits that he was not involved in the conspiracy with Ng as, unlike Ng, he did not benefit from the Autostyle investment. DW1 referred to a discovery application in a related suit where Ma brought a claim against Ng, DW1 and PW3. A discovery order was granted on Ng’s OCBC bank account which showed that Ng had received S$480,915 from the Autostyle transactions from June to September 2014.107Foot Note 107×D1WS, paras 32–35.DW1 then referred the court to similar kickbacks that PW3 had received. By two separate transfers in June and December 2014, PW3 received S$195,000 in his OCBC bank account. DW1 submits that Ng had paid kickbacks to PW3 so that the latter would turn a blind eye and not conduct any due diligence.108Foot Note 108×D1WS, paras 39–40.DW1’s case is that, unlike Ng and PW3, he did not receive any such kickbacks for the Autostyle investment. Hence, he was not part of the conspiracy, if any. 76 The plaintiffs’ response to this point was that DW1 also received payments in relation to the Autostyle investment. The plaintiffs referred the court to PW4’s liquidator’s report, which listed two separate sums of S$250,000 and S$50,000 that had been transferred to DW1 on 27 February 2014 and 24 March 2014 respectively in the general ledger of JE Capital.109Foot Note 109×2BAEIC, p 97.According to the plaintiffs, these were significant dates as they were just after the parties had entered into the ASA on 24 February 2014110Foot Note 110×BAEIC, p 41.and had transferred the US$1m on 20 March 2014111Foot Note 111×BAEIC, p 53.respectively. 77 I accept that these payments were made to DW1 but I do not think that they show that the payments were made to DW1 for the same reasons that the payments were made to Ng and PW3. In the ledger accounts that was cited to me by the plaintiffs, there was an entry under the “credit” column dated 31 December 2013 under the heading “EUJIN-BONUS-YEAR2013” for a sum of S$235,000. The entries of S$250,000 and S$50,000 then came right after. In my view, the more logical explanation for these payments was that DW1 had been promised certain year-end bonuses which had yet to be paid (which is why they were indicated in the “credit” column). The sums advanced were simply to pay off these bonuses and other sums in the “credit” column, of which there were more. Indeed, when I queried the plaintiffs’ counsel as to what was the plaintiffs’ position or explanation in relation to the similar sum of S$235,000 in the “credit” column, the plaintiffs’ counsel could not give any. Hence, I do not agree with the plaintiffs that DW1 was given any kickbacks in the way that Ng and PW3 were given. 78  However, the lack of additional payments over and above DW1’s salary and bonuses does not necessarily mean that DW1 was not part of the conspiracy. In this case, as I have already noted, DW1 directed payment of £1m from the Autostyle investment to Centurion. This sum was not reflected in the account books of JE Capital. The purported loan to Centurion was also not reflected in JE Capital’s financial statements. To date, DW1 has not explained what became of this sum. There is no evidence that the £1m purported loan was repaid, or that any action was taken to recover this enormous sum. 79 The kickbacks that were purportedly furtively received by Ng and PW3 merely suggest that they had enriched themselves unbeknown to DW1. This is a separate issue between them. But I have to consider whether on the balance of probabilities, bearing in mind that more evidence is required for a cause of action under fraud, this lack of receipt of kickbacks by DW1 suggests that he did not conspire with Ng to defraud the plaintiffs. 80 The evidence that I examined earlier in relation to DW1 is largely circumstantial and the totality of that evidence suggests that he and Ng were involved in a conspiracy to defraud PW1 in relation to the Autostyle investment. InOCM Opportunities Fund II, LP and others v Burhan Uray (alias Wong Ming Kiong) and others[2004] SGHC 115 (“OCM Opportunities”),112Foot Note 112×PBOA, Tab A.Belinda Ang Saw Ean J noted at [47] that “in conspiracy cases of this type, it would be remarkable for various conspirators to regulate the arrangements as between themselves in a formal manner”; hence, the agreement or combination “is to be inferred from the evidence”. In describing this flexible approach that ought to be taken by the court, Ang J adopted the analysis inR v Siracusa(1990) 90 Cr App R 340 at 349 (notwithstanding that it was in the criminal law context) that participation in such a conspiracy “is infinitely variable: it can be active or passive”. Hence, even though the plaintiffs did not produce evidence pertaining to acts prior to PW1 entering into the Autostyle transaction, DW1’s reaction to the forged banker’s guarantees and his use of PW1’s money sufficiently indicate what his state of mind or understanding wasvis-à-visthe Autostyle investment. 81 The ambit of the rule that conspiracy can be inferred from the evidence was further discussed inThe Dolphina[2012] 1 SLR 992.113Foot Note 113×PBOA, Tab E.Ang J, citing her earlier decision inOCM Opportunities, explained that conspirators need not know what their fellow conspirators had agreed to do so long as they share the same eventual object (The Dolphinaat [265]). I also adopt this statement of the law. The fact that the kickbacks were not known nor given to DW1 while they were given to Ng and PW3 is no barrier to my finding that DW1 was part of the conspiracy, since he did not need to know the extent of Ng’s and PW3’s participation or benefit. 82 Accordingly, I find that the evidence, although largely circumstantial, is sufficient to discharge the plaintiffs’ burden of proof that DW1 was part of the conspiracy with Ng, wherein the latter made the fraudulent misrepresentations to PW1 to induce him to enter into the Autostyle investment. Indeed, although Ng was the primary actor and DW1 was not directly involved in making representations to PW1, and although the party that PW1 had relied on during the course of these negotiations was PW3, both DW1 and Ng were marketing the Autostyle investment toanyinvestors who were interested and PW1 just happened to be approached by Ng in this case. DW1 must therefore be liable as a fellow conspirator. (2) VDPL investment 83 I turn now to the VDPL investment, in which DW1 had a greater personal involvement compared to the Autostyle investment. As the chronology of events is important in analysing whether DW1 made fraudulent misrepresentations and whether he conspired with Ng to defraud the plaintiffs, I shall first set out the chronology of events before examining whether they show that DW1 made misrepresentations and was part of a conspiracy. (A) No evidence that the VDPL investment started as a sham enterprise 84 The VDPL investment began with DW1 and Ng signing a JE Capital directors’ resolution dated 7 May 2014 to approve the purchase of VDPL’s shares.114Foot Note 114×BAEIC, p 250.DW1 had requested to be kept in the loop. On 3 April 2014, before the directors’ resolution relating to the VDPL investment was signed, DW1 sent WhatsApp messages to PW3, in which DW1 told PW3 that he would like to be kept posted of all banking matters. The extract of the relevant WhatsApp messages reads as follows:115Foot Note 115×ABD, vol 1, pp 1–2. Bro next time u sent email pls address to me also..appreciate … banking matters should address to me and jerry [ie, Ng] since I am the owner [of JE Capital] … … just that I am equally responsible for everyone action in je capital. .if anything goes wrong..I want you to know..you can come to me anytime to take up matters … 85 It is therefore clear that DW1 was actively involved in the VDPL investment. But at this stage, there was no evidence to suggest that the VDPL investment was a sham. It appears that DW1 and Ng were initially genuinely interested in sourcing for funds to acquire 950,000 ordinary shares of VDPL. These shares constituted 95% of VDPL’s paid-up capital. DW1 and Ng had started to market the VDPL investment so as to source for seed funding to acquire VDPL shares in order to gain control of 15 Genting for the construction of the GoodWater Centre of Excellence. (B) DW1 fraudulently misrepresented the VDPL investment to the plaintiffs by not highlighting its rising costs and increased risks 86 There is no evidence that the VDPL investment started off as a sham. But when the cost of the VDPL enterprise started to rise from S$950,000 to some S$6.7m, and the due diligence report for this investment was not favourable, the viability of this investment was put in serious doubt. Nevertheless, DW1 and Ng continued to market the VDPL investment. This raised doubts about their honesty, even though the investment apparently started off as genuine. 87 The VDPL investment was entered into based on a term sheet dated 9 September 2014 between JE Capital and Virtues Group Pte Ltd (“VGPL”), which owned the shares in VDPL. The term sheet states that JE Capital wished to purchase and VGPL wished to sell shares in VDPL amounting to 95% of its issued and paid-up share capital for S$950,000. Ng signed on behalf of JE Capital and one Fu Qiang signed on behalf of VGPL.116Foot Note 116×BAEIC, pp 106–109. 88 One day later, on 10 September 2014, JE Capital’s lawyers sent an email to Ng (copying DW1) noting that there was a risk of S$3,144,900 on the VDPL investment due to “the increased consideration of SGD 6,668,000 instead of 950,000”. Because of this, JE Capital’s payment of S$3,144,900 would “now be exposed” and there was “the risk that it may not be recoverable eventually”.117Foot Note 117×1DB, p 17.This email suggests that the risk of exposure presented by the VDPL investment had increased manifold from the original risk and that Ng and DW1 knew about it. In court, DW1 was confronted with the increase in consideration from S$950,000 to some S$6.7m and was asked whether he approved the increase. He replied that he “did not agree because [JE Capital’s] lawyer wrote that the consideration will result in the increase of stamp duties”.118Foot Note 118×Transcripts Day 6, p 45, lines 9–15.In other words, DW1 knew about the increase at that time because JE Capital’s lawyers had informed him about it, even though his position was that he did not approve the increase. 89 About one month later on 21 October 2014, JE Capital requested119Foot Note 119×Transcripts Day 6, p 47, lines 20–25.its lawyers to prepare a “Legal Due Diligence Report” on VDPL.120Foot Note 120×Exhibit D2-1.The due diligence report noted that there were a number of issues which JE Capital’s lawyers recommended to be resolved before JE Capital proceeded with purchasing VDPL’s shares. One such issue that JE Capital’s lawyers noted was that there were several related-party transactions as of July 2013. For instance, VDPL owed VGPL a sum of S$199,900 which was “unsecured, non-trade in nature, interest free and repayable upon demand”. JE Capital’s lawyers advised that a loan agreement be entered into between VDPL and VGPL before JE Capital went ahead with the purchase of shares.121Foot Note 121×Exhibit D2-1, p 151, para 8.1.After the due diligence report had been completed, DW1 testified that JE Capital “[took] further steps to continue the deal after 21st October 2014”,122Foot Note 122×Transcripts Day 6, p 48 line 29 to p 49 line 1.such as making a second tranche payment of S$380,000 to VGPL from Ng’s personal bank account (the first tranche of S$95,000 was also made by Ng to VGPL on 16 September 2014). However, DW1 conceded that he did not verify whether the second tranche payment was received by VGPL or VDPL.123Foot Note 123×Transcripts Day 6, p 49 line 18 to p 50 line 4.Apart from the alleged second tranche payment (which was eventually found to have never been made, a point which I shall deal with later), DW1 (and JE Capital) did not take any steps to remedy these risks and did not even inform the plaintiffs of the said risks. Eventually, DW1 had to call off the VDPL investment “personally” in July 2015 as he alleged that Ng was stuck in China and he was worried at that time about the “various representations” that Ng had made.124Foot Note 124×Transcripts Day 6, p 50, lines 12-16. 90 These events occurred in September and October 2014, at least a month before the plaintiffs advanced their monies to JE Capital for the VDPL investment in late November 2014. Hence, the chronology of events shows that before the plaintiffs advanced their monies for the VDPL investment in November 2014, DW1 and Ng already knew of the grave concerns as explained by JE Capital’s lawyers,ie, the sharp rise in the share price from S$950,000 to some S$6.7m, the huge exposure of some S$3.1m, and the unfavourable due diligence report. These would have caused serious doubts as to the viability of this investment at that point in time and DW1 and Ng would have known that they might have to abandon it eventually. Despite these very real concerns, DW1 and Ng continued to market the VDPL investment and acted as though it was still afoot.125Foot Note 125×PWS, paras 243–245. 91 Rather than taking any further steps to ensure the viability of the VDPL investment after the risks were identified, sometime in late October 2014, PW3 was given the term sheet for a potential purchase of bonds from JE Capital (to fund JE Capital’s purchase of VDPL shares). PW3 was to forward this document to PW1.126Foot Note 126×PBD, p 69.The purpose of the bond issue was clearly stated in the term sheet:127Foot Note 127×BAEIC, p 68. The net proceeds of the Bond Issue shall be used to finance the acquisition of all the shares in [VDPL] in relation to its acquisition of the land at 15 Genting Road Singapore 349943 and the erection of a building thereon (“the Building”), and for general company purposes. 92 On 29 October 2014, PW3 forwarded these materials to PW1 to invite the latter to invest in the VDPL project.128Foot Note 128×PBD, p 69.PW1 was offered a “Secured Convertible Bond” with very tempting returns of 8% per annum with a maturity date of 18 months.129Foot Note 129×BAEIC, p 68.These attractive high returns lured PW1 (and later, PW2) to the VDPL investment. PW1 was particularly interested as he had already invested in the Autostyle investment that had previously been marketed by JE Capital, which had even larger returns of 15% per annum. By this time, PW1 had already received S$75,000 for his Autostyle investment in September 2014. This made him believe that the VDPL investment was also legitimate. Thus he asked PW2, his father, to join him in the VDPL investment. 93 DW1 did not only fail to object to misleading materials being sent to PW1, but also played an active role in marketing the investment to PW2. In November 2014, he physically accompanied Ng to Xindian, Taiwan to meet PW2 and PW3 in order to persuade PW2 to invest in VDPL. This was the evidence of both PW2130Foot Note 130×BAEIC, p 155, para 9.and PW3131Foot Note 131×BAEIC, pp 170–171.in their respective affidavits of evidence-in-chief. In court, DW1 also admitted that he had met PW2 in the latter’s house in Taiwan together with Ng. Ng had assured PW3 (who was acting on behalf of PW2) that the VDPL investment was a genuine investment and DW1 did not object to that representation:132Foot Note 132×Transcripts Day 6, p 80, lines 4–7. Q: But you ac---and---you accept that you had actually told [PW3] that the VDPL investment was a genuine and legitimate investment? A: Your Honour, I have said earlier that I am aware that [Ng] told [PW3] in Taiwan that the VDPL project was a legitimate project. Q: And you raised no objections to that statement, correct? A: I raised no objection. 94 It is clear that DW1’s meeting with PW2 in Taiwan was to convince the latter to put money into the VDPL investment despite the increased costs and risks. DW1 did not disclose these risks to PW2 and instead marketed the VDPL investment as if it had the same risk profile as it did in the beginning. I find that this constitutes fraudulent misrepresentation about the nature and risks of the VDPL investment. Although the evidence is less clear in relation to PW1, I find that by giving the term sheet (and other materials) to PW3 to give to PW1 and not correcting the information in these materials, DW1 likewise made fraudulent misrepresentations about the VDPL investmentvis-à-visPW1. 95 For the same reasons, I also find that the evidence indicates that DW1 and Ng, by this time, had the intention to defraud the plaintiffs. They knew that the VDPL investment was no longer viable but did not wish to return the plaintiffs’ monies to them. This is also corroborated by several other pieces of evidence which I turn to now. (C) DW1 knew about Ng’s forged receipt vouchers, which is evidence of a conspiracy 96 Before the plaintiffs transferred their monies to JE Capital, Ng produced three receipt vouchers purportedly issued by VDPL to JE Capital. These vouchers were evidence of purported payments to VDPL for the purchase of the VDPL shares. The first receipt voucher, dated 16 September 2014,133Foot Note 133×BAEIC, p 131.was to pay S$95,000 as the initial refundable deposit for the purchase of the VDPL shares.134Foot Note 134×BAEIC, pp 106–107.This payment was made by Ng from his personal OCBC bank account and DW1 admitted that he knew about this payment.135Foot Note 135×Transcripts Day 6, p 50, lines 17–31.The second receipt voucher of S$380,000 dated 20 October 2014 was for the purported payment of 40% of the VDPL shares. The third receipt voucher of S$475,000 dated 12 November 2014 was for the purported payment of 45% of the VDPL shares.136Foot Note 136×BAEIC, p 129. 97 VDPL did not receive the second and third payments. Although the payment of S$95,000 was made to VDPL, the parties agreed that all the three receipt vouchers were forged as VDPL did not issue these receipts. The total sum of the three receipt vouchers was S$950,000, which was the purported value of 95% of the VDPL shares. This was what DW1 and Ng had initially told potential investors (like the plaintiffs) how much the VDPL investment would cost. However, by JE Capital’s lawyers’ email of 10 September 2014 detailing the various difficulties,137Foot Note 137×1DB, p 17.DW1 and Ng would have realised that the value of 95% of the VDPL shares was no longer S$950,000. Instead, the estimated sum of those shares was some S$6.7m, which further confirmed that the figures in the second and third receipt vouchers could not be true. Because of DW1’s prior knowledge of the increased cost of the VDPL shares, he must have known that these receipt vouchers were false when they were only issued for S$950,000. Therefore, I cannot accept DW1’s testimony in court that he did not know that the receipt vouchers were forged until sometime in July 2015 when he realised that VDPL never received the funds specified in the vouchers.138Foot Note 138×Transcripts Day 6, p 52, lines 4–6. 98 In order to convince the plaintiffs of the legitimacy of the VDPL investment, Ng sent the three receipt vouchers to PW3 on 12 February 2015, copying DW1 in the email. Ng intended PW3 to forward these receipt vouchers to the plaintiffs to keep them updated about the status of the acquisition plan.139Foot Note 139×BAEIC, pp 127–128. 99 The forgeries were later discovered by Penu, who was another investor in the VDPL investment. Sometime in mid-2015, Penu discovered that the receipt vouchers that had been given to him were also forged after being alerted by Ma. DW1 told Penu that he would refund him. DW1 subsequently issued cheques to Penu but these cheques bounced.140Foot Note 140×BAEIC, p 133.Thereafter, DW1 did not take any action to confront Ng or to find out why the VDPL receipt vouchers were forged, nor did he alert the plaintiffs of the forgery. Forging the VDPL receipt vouchers is very serious, yet DW1 did not refer the case to the police. Instead, DW1 decided to abandon the VDPL investment in July 2015. He must have realised by then that the sham VDPL investment had been exposed. This indicates that DW1 and Ng were in the same conspiracy to defraud investors like the plaintiffs. It appears that DW1’s reaction to the forged receipt vouchers was similar to his reaction to the exposed banker’s guarantees in the Autostyle investment, regarding which I found that DW1 and Ng had conspired to defraud PW1 and other investors. (D) DW1’s use of the plaintiffs’ S$3m paid to JE Capital confirms that there was a conspiracy 100 The use of the plaintiffs’ S$3m further illuminates the illegitimacy of the VDPL investment. It was not disputed that the money had not been transferred to VDPL to fulfil the investment but had instead been transferred to JE Capital’s directors as loan repayments and salary payments. The following transfers were made:141Foot Note 141×BAEIC, p 144. DateAmountRecipientPurpose3 Dec 2014S$400,000 cashNgLoan repayment3 Dec 2014S$313,994 cashDW2Loan repayment, bonus, salary4 Dec 2014S$200,000 cashNgLoan repayment4 Dec 2014S$285,000 chequeDW1Loan repayment4 Dec 2014S$628,000 chequeNgLoan repayment4 Dec 2014S$740,000 chequeDW1Loan repayment9 Dec 2014S$285,000 chequeNgDirector withdrawalTOTALS$2,851,994 101 The speed at which the money was transferred out of JE Capital’s accounts suggests that the money was never meant to be used for the VDPL investment. The S$3m was transferred by the plaintiffs on 27 November 2014142Foot Note 142×BAEIC, pp 113 and 162.and reached JE Capital’s account on 3 December 2014.143Foot Note 143×Transcripts Day 6, p 73, lines 8–28; see also PSB, p 248 (entry for 3 December 2014).That same day, the first transfer was effected and all the transfers were completed one week later by 9 December 2014. In fact, two of the three cheques that were paid from JE Capital’s accounts had been prepared and signed on 1 and 2 December 2014,144Foot Note 144×AB, pp 7–8.which wasbeforethe plaintiffs’ money had even entered JE Capital’s account. The plaintiffs submit that this showed that the defendants were “so eager to get [their] hands on the plaintiff’s money that [they] started writing and signing the cheques even before the money had actually been deposited”.145Foot Note 145×Transcripts Day 6, p 75, lines 13–16. 102 The plaintiffs also tendered a Statement of Account for JE Capital’s bank account with Standard Chartered Bank, which showed that as of 29 November 2014 (which was right before the plaintiffs’ S$3m had entered JE Capital’s accounts), JE Capital only had a balance of S$4,268.28. The plaintiffs submit that the fact that DW1 (on behalf of JE Capital) had started preparing such payments before the plaintiffs’ money had come in, particularly when JE Capital had such a low balance in its account, suggests that the VDPL investment was not genuine and that the funds were meant to be siphoned out. 103 In contrast, DW1 took the position that although the plaintiffs’ S$3m had indeed been used for the repayment of directors’ loans, this was entirely legitimate due to cl 4 of the respective contracts between the plaintiffs and JE Capital. These loan agreements gave JE Capital a wide discretion over the use of the S$3m. DW1 says that cl 4 in particular “allows the director[s] to have sole discretion to how they would use the working capital”.146Foot Note 146×Transcripts Day 6, p 58, lines 5–8.Clause 4 provides as follows:147Foot Note 147×BAEIC, p 119. 4.PURPOSE 4.1The Parties agree that the purpose of the Loan shall be as follows: (a) financing the Borrower’s acquisition of 950,000 ordinary shares in VDPL, comprising 95% of the total issued and paid-up capital of VDPL; (b) as the Borrower’s working capital; and (c) used in connection with the business, investments and operations of the Borrower as the Borrower may decide at its sole discretion. 4.2 The Loan shall be disbursed for the abovementioned purpose in such proportion and manner at [sic] the Borrower may decide at its sole discretion. The plaintiffs’ response was that despite cl 4, the money could not be used “randomly” and could only be used in connection with the investment.148Foot Note 148×Transcripts Day 2, p 78, lines 16–31. 104 I do not accept DW1’s submission that cl 4 gave JE Capital and its directors an unfettered power to use the money that was transferred for the purpose of the VDPL investment. It is trite that a contractual term must be interpreted according to its plain meaning and also in its proper context, bearing in mind the purpose of the contract. Where possible, the different parts of the clause must be read in a way that does not render any other part of the clause nugatory. This is because the parties are taken to have wanted each and every part of the clause to be useful. In other words, the parties’ intentions are reflected in the precise language of the agreement. In this case, both parts of cl 4 must be read together. Clause 4.1 provides for three different limbs that may comprise the “purpose” of the loan. Clause 4.2 follows this by saying that the loan shall be disbursed “for the abovementioned purpose in such proportion and manner [as] the Borrower [ie, JE Capital] may decide at its sole discretion”. The operative phrase that DW1 relied on for JE Capital’s unfettered power is the last phrase, “at its sole discretion”. There are two possible interpretations of this last phrase in the clause: (a) JE Capital has the absolute discretion to use the loan as it deems fit, even if the money is used for a purpose that is not connected or related to the purpose of the loan (which is the interpretation that DW1 contends for); or (b) JE Capital must disburse the loan for the purposes related to the VDPL investment, although it has the discretion to choose how much to disburse at any one time. 105 The second interpretation of cl 4 is correct, because it more accurately reflects the intention of the contracting parties at the time when they entered the contract, assuming that the plaintiffs intended to enter into a legitimate loan agreement. If option (a) is right and JE Capital can disburse the loan for any purpose that it sees fit, then there would be no point in the parties listing the relevant purposes of the loan in cl 4.1. Furthermore, if the parties had intended option (a), they could have omitted the words “for the abovementioned purpose” altogether. In fact, it would suffice to say, “The Loan shall be disbursed as the Borrower may decide at its sole discretion.” As it stands, however, cl 4.2 clearly restricts the disbursement of the loan to the purposes stated in cl 4.1. 106 Accordingly, I do not accept DW1’s contention that cl 4 gives JE Capital the power to pay out the S$3m transferred by the plaintiffs for whatever purposes it pleases. The plaintiffs would not have invested or loaned money to JE Capital if they had known that their entire S$3m would be used to pay the outstanding loans to the directors and outstanding salary and bonuses of its shareholders (including DW2). This would leave practically no money for the VDPL investment and the plaintiffs cannot be taken to have intended this outcome in the absence of clear evidence to the contrary. 107 Hence, the evidence indicates that after November 2014, DW1 knew that the VDPL investment was no longer legitimate. The eventual amount of money that was needed to complete the purchase of the VDPL shares was S$6,668,000 (see [88] above). Of this amount, only S$3m had been advanced thus far, as can be seen from the bank accounts of JE Capital right before the plaintiffs’ money was received on 3 December 2014. Even after the plaintiffs’ S$3m was deposited into JE Capital’s account, the money was quickly depleted by the loan repayments, such that by 9 December 2014 only S$58,058.10 remained in the account. But JE Capital continued spending and by the close of December 2014, only S$19,516.26 remained in its account.149Foot Note 149×PSB, p 248.This is not conduct that one would expect of a company (or its directors) that was truly intent on purchasing 95% of the shares in VDPL, which cost some S$6.7m. It is inconceivable that JE Capital would so quickly and flippantly spend S$3m – nearly half of what was required – despite having close to nothing in its own bank account. This showed that by November and December 2014, DW1 and Ng did not have the intention to continue with the VDPL investment. Otherwise, they would not have used the plaintiffs’ S$3m for their own benefit. 108 I do not accept DW1’s explanation that it was expecting another injection of funds in the near future and therefore JE Capital was comfortable in spending the S$3m, as there is no evidence to this effect. On the contrary, the plaintiffs adduced evidence of other agreements that JE Capital entered into with third party investors for the VDPL investment. The next injection of funds was shown to be on 5 March 2015 for the sum of S$250,000150Foot Note 150×Exhibit P1.and this is consistent with JE Capital’s bank records.151Foot Note 151×PSB, p 245 (entry for “AGREEMENT – HUAN KOK SY”).This dismissive treatment of what would have been an important source of funds to realise JE Capital’s plan to acquire the VDPL shares suggests to me that DW1 may not have considered that the plan was to complete the share acquisition to begin with. This is consistent with DW1’s reaction to finding out about the problems with the VDPL investment (see [88]–[93] above). (E) Conclusion on DW1’s conspiracy with Ng to defraud the plaintiffs 109 From the totality of the evidence, I am satisfied that the plaintiffs have also discharged the burden of proof against DW1 for conspiring with Ng to defraud the plaintiffs in the VDPL investment. 110 Indeed, when the Autostyle and VDPL investments are considered together, they reveal a commonmodus operandiof DW1 and Ng. They marketed these bogus businesses to lure potential investors like the plaintiffs with exorbitantly high returns which were too good to be true. Unfortunately, the plaintiffs were enticed by DW1’s and Ng’s shenanigans and now face dim prospects of making a full financial recovery.",
        "JE Capital’s involvement": "111 JE Capital, as a corporate entity, is the third defendant. It could not engage the plaintiffs except through the actions of DW1 and DW2. I have already found that DW2 is not liable for both the Autostyle and VDPL investments. But I have found that DW1 is liable for having conspired with Ng to defraud the plaintiffs for both these investments. DW1 and Ng were acting in their capacity as JE Capital’s directors in these investments. Therefore, I find that JE Capital is jointly and severally liable with DW1 for the two investments.",
        "Conclusion": "112 In summary, I am of the view that there is insufficient evidence to implicate or link DW2 to the Autostyle and VDPL investments. DW2 was not involved in the marketing of these two investments. I am also satisfied that despite having received S$313,994 on 3 December 2014, which is traceable to the plaintiff's’ S$3m funds for the VDPL investment, DW2 did not conspire with DW1 and Ng to defraud the plaintiffs in relation to either investment. 113 However, I find that DW1 is liable for conspiracy in relation to both investments, although he is not liable for fraudulent misrepresentations in relation to the Autostyle investment. I first summarise my findings in relation to DW1’s involvement in the Autostyle investment as follows: (a) DW1 is not liable for fraudulent misrepresentations relating to the Autostyle investment as PW1 dealt primarily with Ng in relation to this investment. (b) Nevertheless, I find that DW1 conspired with Ng to defraud PW1, for the following reasons: (i) There were too many internal discrepancies in the ASA and AN, which DW1 was unable to explain even though he was given a chance to do so. He could not have been unaware of the investment that he was marketing. This indicates that the Autostyle investment was not genuine. (ii) These discrepancies were corroborated by DW1’s admission that he made false statements in relation to the Autostyle investment in the Autostyle investment prospectus, even though they were made to other investors, and not PW1. (iii) PW1’s investment of US$1m and Ma’s investment were not recorded in JE Capital’s financial statements. These raised serious doubts about the authenticity of the investment. (iv) PW1’s US$1m was used as part of an undocumented and unapproved loan to Centurion, a company which JE Capital had never dealt with. (v) When DW1 discovered that the banker’s guarantees were forged, instead of taking steps to remedy the situation, he issued instructions to Ng to “burn” an email relating to the banker’s guarantee of Wang, another Autostyle investor. (vi) Although DW1 did not receive kickbacks unlike Ng and PW3, this did not preclude the possibility of him having conspired with Ng to defraud the plaintiffs. 114 The following summarises my findings in relation to DW1’s involvement in the VDPL investment: (a) There was no evidence that the VDPL investment had started off as a sham investment. (b) However, the VDPL investment soon started facing problems. In September 2014, JE Capital’s lawyers informed DW1 and Ng of the rising costs of the VDPL investment and the increased exposure. A due diligence report also indicated that there were increased risks. DW1 and Ng did not inform the plaintiffs of these risks but continued to persuade them to enter the VDPL investment in November 2014 by the following actions: (i) DW1 fraudulently misrepresented the nature and risks of the VDPL investment to PW2 during the meeting in Taiwan. (ii) Although DW1 did not directly engage PW1 face-to-face unlike with PW2, DW1 still allowed the term sheet and other materials about the VDPL investment to be passed to PW3 with the intention that it would be forwarded to PW1. These materials also contained misleading information and this also constituted fraudulent misrepresentation. (c) DW1 and Ng were also in a conspiracy to defraud the plaintiffs given the following events: (i) As mentioned, in September 2014 DW1 and Ng knew about the rising costs and increased risks associated with the VDPL investment but did not inform the plaintiffs. DW1 went further and marketed the VDPL investment directly to PW2 during their meeting in Taiwan in November 2014, and allowed materials (including the term sheet) to be sent to PW1 through PW3. (ii) During this time, Ng issued three forged receipt vouchers to reassure the plaintiffs that the VDPL investment was afoot and that all was well. The vouchers referred to the previous amount required to finance the VDPL investment – S$950,000. DW1 knew by this time that the investment required much more money, but remained silent. This indicates that he knew that the vouchers were forged. (iii) Once the plaintiffs transferred their S$3m to JE Capital, DW1 and Ng immediately transferred the monies out to themselves. DW1 attempted to justify these transfers but there is no conceivable reason why a company which now needed some S$6.7m to finance its VDPL investment would immediately spend S$3m, nearly half the required amount. This is especially suspicious since apart from this S$3m, JE Capital had close to no funds in its bank account. 115 Finally, I also find that the plaintiffs have proven their case against JE Capital, the third defendant, as DW1 and Ng were its directors. For the reasons stated above, I allow the plaintiffs’ claims in part. 116 I shall now hear parties on costs. Tan Siong ThyeJudge Mohamed Nawaz Kamil (Providence LawAsia LLC) for the plaintiffs;Lee Ming Hui Kelvin and Ong Xin Ying Samantha(WNLEX LLC) for the first defendant; The second defendant in person;The third defendant unrepresented."
    }
}