{
    "case_title": "Comptroller of Income Tax vARW and another(Attorney-General, intervener)",
    "ncitation": "[2017] SGHC 180",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 Following an earlier decision of this Court granting the 1st Defendant’s application for discovery against the Plaintiff of various categories of documents, the Plaintiff sought leave to: (a) request for further arguments out of time, and (b) adduce further affidavits as evidence in support of those further arguments. In addition, the Attorney-General (“the AG”) sought leave to intervene in the summonses for discovery, further arguments, further evidence, and all related applications and appeals. Having heard and considered the arguments, I allow the AG’s application to intervene. I also allow the Plaintiff’s application for an extension of time to request further arguments, and part of his application to adduce further evidence in support thereof.",
        "Background": "2 In Summons No 1465 of 2015, the 1st Defendant sought discovery of various documents relating to an investigatory audit conducted by the Plaintiff’s officers against the 1st Defendant and a related company (“the Discovery Application”). The Plaintiff resisted the application primarily on the basis of legal professional privilege, invoking both legal advice privilege and litigation privilege. On 31 January 2017, I issued a judgment granting discovery, finding that neither legal advice privilege nor litigation privilege was made out: seeComptroller of Income Tax v ARWand another[2017] SGHC 16 (“the Judgment”). In the course of the discussion in the Judgment, it was mentioned (at [52]) that the Plaintiff’s real claim appeared to be a form of privilege protecting the fruits of the audit, review and related internal discussions conducted by law enforcement agencies, but that the Plaintiff had not invoked either s 125 or s 126 of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”), and that neither would seem in any event to be made out. 3 On 9 February 2017, following the release of my judgment in respect of the Discovery Application, the Plaintiff filed an application for leave to appeal,vide, Summons No 661 of 2017 (“the Leave to Appeal Application”). On 27 February 2017, the Plaintiff filed a Notice of Change of Solicitor. The newly appointed solicitors later informed the Court that they would take over conduct of only this discovery application and all related applications and appeals; the substantive matter remains in the conduct of the former solicitors. 4 On 1 March 2017, the Plaintiff filed Summons No 940 of 2017, in which it sought leave to file its request for further arguments in the Discovery Application out of time, and to adduce two affidavits in support of the Discovery Application and the Leave to Appeal Application (“the Further Arguments Application”). The further arguments sought to be made related to: (a) public interest privilege under s 126(2) of the EA, (b) official secrecy under s 6(3) of the Income Tax Act (Cap 134, 2008 Rev Ed) (“ITA”), and (c) legal professional privilege. The two affidavits are from: (a) Mr Tan Tee How, who is the Commissioner of Inland Revenue, the Chief Executive Officer of the Inland Revenue Authority of Singapore (“IRAS”) and the Comptroller of Income Tax, deposing to the injury and prejudice that would be caused to the public interest if disclosure of the documents concerned were to be ordered, and (b) Ms Christina Ng Sor Hua (“Ms Ng”), an officer of the IRAS, providing the background facts relating to the internal audits previously conducted by IRAS in relation to the Defendants’ tax avoidance arrangements. 5 On 3 March 2017, the AG filed Summons No 987 of 2017 for leave to intervene in the Discovery Application, the Leave to Appeal Application, the Further Arguments Application, and all related applications and appeals (“the Intervention Application”). The main thrust of its application was that the AG, as the guardian of the public interest, is obliged and entitled to intervene in these applications to argue its position on the issue of public interest privilege. 6 The various matters created a knot of inter-related applications. The better view may be that, putting aside the Leave to Appeal Application, the Intervention Application must be logically subsequent to the Further Arguments Application: if there are no further arguments, there would be nothing to intervene in. But the AG also sought to be joined in the Further Arguments Application on the basis that it had an obligation and entitlement to protect the public interest and thus desired the further arguments to be made. One option would have been to leave matters to the Court of Appeal. However, in the interests of efficiency, I considered that it would be best to cut this Gordian knot by taking all the matters – aside from the Leave to Appeal Application – in hand at the same time. Otherwise, taking the matters in a sequential manner as described above, while logical, would prolong these interlocutory proceedings in a suit that had itself arisen out of even earlier litigation (seeComptroller of Income Tax v AQQand another appeal[2014] 2 SLR 847).",
        "Issue 1: The Intervention Application": "7 Taking first the Intervention Application, the contention was primarily between the AG and the 1st Defendant; the Plaintiff did not take issue with the intervention.",
        "The AG’s arguments": "81 As noted above at [6], in the interests of efficiency, I allowed the AG to make submissions in respect of the Further Arguments Application, on the basis that a consideration of their written and oral submissions would be premised on their being granted leave to intervene in the Intervention Application. 82 The AG does not submit on the question of extension of time. However, the AG takes an interest in the issue of whether further evidence may be admitted in support of the further arguments as the two affidavits sought to be adduced are relevant to the issue of public interest privilege under s 126(2) of the EA, with which the AG is concerned. 83 In relation to the admission of further evidence in support of the further arguments to be requested in the Discovery Application, the AG submits that the Court has a discretion to admit new evidence even at the stage of further arguments:Lian Soon([73]supra). This is because the Court, when it hears the further arguments, continues to exercise jurisdiction as a first instance court:ThomsonPlaza (Pte) Ltd v Liquidators of Yaohan Department Store Singapore Pte Ltd (in liquidation)[2001] 2 SLR(R) 246. Further,Travista([78]supra), invoked by the 1st Defendant, does not in fact bar the admission of new evidence for the purpose of further arguments, insofar as those arguments pertain to an interlocutory decision. The principle of finality is not significantly infringed upon at present given that directions in this case are still pending and no order has been extracted. 84 On the facts, good reasons exist for admitting the further evidence. First, the AG is entitled to state his position in respect of the issue of public interest privilege regardless of whether the Plaintiff is allowed an extension to make further arguments on the same. Secondly, courts have viewed public interest privilege as a matter that they can and should take cognisance of even if neither party nor the AG has asserted it:BurmahOil([10]supra). Thirdly, the relevant factors would point towards the admission of the further evidence: (a) the affidavits are relevant and credible, (b) the delay does not in itself warrant exclusion, and (c) there is no irremediable prejudice caused. 85 As for the admission of further evidence in support of the Leave to Appeal Application, the High Court is similarly not precluded from admitting further affidavits. Otherwise, a putative appellant may be precluded from taking the new points to the Court of Appeal. In this context, even if this Court admitted the further evidence, that would only be for the purpose of determining whether the leave to appeal threshold is met and does not bind the Court of Appeal.",
        "The 1st Defendant’s arguments": "77 The 1st Defendant first submits that, of the three further arguments sought to be made by the Plaintiff, two of those relating to s 126 of the EA and s 6(3) of the ITA are new, whereas the third argument is that the Court had improperly rejected the claim for legal professional privilege. In this context, allowing the application would set a dangerous precedent as it would embolden litigants to try to repair and reopen their cases after judgments have been issued; the principle of finality and the respect for the procedures prescribed in the ROC would inevitably be undermined. 78 Substantively, the 1st Defendant attacks first the issue of further evidence. Counsel submits that new evidence cannot be admitted for the purpose of further arguments because further arguments must be based on existing evidence:TravistaDevelopment Pte Ltd v Tan Kim Swee Augustine and others[2007] 3 SLR (R) 628 (“Travista”). If the Plaintiff wishes to admit new evidence, the proper procedure is for it to do so on appeal and not before the Court of first instance. This approach accords with the rationale for permitting further arguments, which the 1st Defendant characterised as allowing a Judge in chambers to review an order made if the applicant was unable to present full arguments due to the time limit for the hearing:Singapore Press Holdings([70]supra). On this basis, the two affidavits should not be admitted as further evidence, and the issue of further arguments – at least in relation to public interest privilege and legal advice privilege, both of which necessarily require the support of the further evidence – would not even arise. 79 Leave to adduce further evidence in the Leave to Appeal Application should fail because an application to adduce new evidence for the purpose of a leave to appeal application in relation to an interlocutory order will be granted only if the applicant is able to show strong reasons why the new evidence was not previously admitted:JurongTown Corp v Wishing Star Ltd[2004] 2 SLR(R) 427. On the facts, the Plaintiff cannot satisfy this test for reasons by bare assertion that his former lawyers had not properly advised him. 80 As for the issue of whether an extension of time to request for further arguments should be granted, the 1st Defendant citesDenko([71]supra)and submits that the Court should not permit the extension primarily because no credible explanation has been given by the Plaintiff for the delay. The excuse that the Plaintiff’s former solicitors – which included a Senior Counsel – had not properly advised the Plaintiff was a bare and implausible assertion that should not be accepted in the absence of extenuating circumstances:Nomura Regionalisation Venture FundLtd v Ethical Investments Ltd[2000] 2 SLR (R) 926;TanSia Boo v Ong Chiang Kwong[2007] 4 SLR(R) 298. Further, the delay is not short, and grave prejudice would be caused to the 1st Defendant if all the effort expended in obtaining the initial judgment came to nothing, with further delays caused to the already protracted matter. In this regard, even an offer of payment of costs is not a cure for all defaults:ChanKern Miang([16(c)]supra).",
        "The decision": "86 The statutory basis for the requesting and making of further arguments is s 28B of the SCJA, which reads as follows: Further arguments before Judge exercising civil jurisdiction of High Court 28B.—(1)  Before any notice of appeal is filed in respect of any judgment or order made by a Judge, in the exercise of the civil jurisdiction of the High Court, after any hearing other than a trial of an action, the Judge may hear further arguments in respect of the judgment or order, if any party to the hearing, or the Judge, requests for further arguments before the earlier of — (a) the time the judgment or order is extracted; or (b) the expiration of 14 days after the date the judgment or order is made. (2)  After hearing further arguments, the Judge may affirm, vary or set aside the judgment or order. (3)  If any request for further arguments has been made under subsection (1) — (a) no notice of appeal shall be filed in respect of the judgment or order until the Judge — (i) affirms, varies or sets aside the judgment or order after hearing further arguments; or (ii) certifies, or is deemed to have certified, that he requires no further arguments; and (b) the time for filing a notice of appeal in respect of the judgment or order shall begin on the date the Judge — (i) affirms, varies or sets aside the judgment or order after hearing further arguments; or (ii) certifies, or is deemed to have certified, that he requires no further arguments. (4)  For the avoidance of doubt, a party to the hearing may, but is not required to, request for further arguments before he files a notice of appeal in respect of the judgment or order. 87 Sub-section (4) explains that a request for further arguments is not mandatory, but rather voluntary, before a notice of appeal is filed. As noted by the parties, this reflects a change from the pre-2010 position under s 34(1)(c) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (“the 1999 SCJA”), which required a party who wished to appeal to the Court of Appeal against an interlocutory order to write in for further arguments to the Judge who heard the application within seven days of the date of the order. After the SCJA was amended in 2010 to delete the then s 34(1)(c), s 28B was inserted in its place so that the making of further argument is now voluntary: the parties may write in for such arguments if they wished or the Judge may request for the same (seeSingapore Parliamentary Debates, Official Report(18 October 2010) vol 87 at cols 1372–1373 (Assoc Prof Ho Peng Kee, Senior Minister of State for Law)). 88 I should note that while some of the parties’ written submissions addressed the Leave to Appeal Application, that is not the subject of my present determination. The issues relating to the extension of time and the adducing of further evidence are to my mind the questions of immediate concern. If need be, the issue of what ought to be considered in any application for leave to appeal can be dealt with later, at the appropriate juncture. Extension of time to request for further arguments 89 It is common ground between the parties that the Court has the power to grant an extension of time for the Plaintiff to request further arguments under s 28B of the SCJA. That power to abridge the time prescribed can be found in para 7 of the First Schedule to the SCJA, which reads as follows: Time 7.  Power to enlarge or abridge the time prescribed by any written law for doing any act or taking any proceeding, whether the application therefor is made before or after the expiration of the time prescribed, but this provision shall be without prejudice to any written law relating to limitation. 90 Section 18(2) of the SCJA provides that the High Court shall have the powers set out in the First Schedule. In the present case, the Judgment was issued on 31 January 2017. As no notice of appeal has been filed against, and no order of court has been extracted in respect of that decision, under s 28B(1)(b) of the SCJA, further arguments (if any) should have been requested by 14 February 2017. Instead, the summons for the Further Arguments Application was filed on 1 March 2017: this was some 15 days after the time prescribed in s 28B(1)(b). 91 No authority has been cited to me which pronounced on the principles governing the exercise of the Court’s power to extend time in the context of further arguments under the present s 28B of the SCJA. However, certain principles may be extrapolated from two decisions of the Court of Appeal involving extensions of time in other contexts. 92 The first decision is that ofThe TokaiMaru([71]supra). In this case, the applicant sought to file an affidavit of evidence-in-chief nine months out of time. The Court of Appeal granted the extension even though the delay was found to be unjustified (at [29]), recognizing the principle that “a litigant should not be deprived of his opportunity to dispute the plaintiff’s claims and have a determination of the issues on the merits as a punishment for a breach of [the rules of civil procedure] unless the other party has been made to suffer prejudice which cannot be compensated for by an appropriate order as to costs” (at [23(b)]). Accordingly, that case concerning an application for an extension of time to file an affidavit was said to qualify for a less stringent approach than the test with respect to extensions of time to file a notice of appeal (at [20]). Under this less stringent approach, three issues are relevant: (a) whether any justification exists for the delay; (b) whether prejudice was caused to the other party; and (c) whether special circumstances warranted a dismissal of the application for extension of time (at [24]). 93 The next decision is that ofDenko([71]supra). In this case, the appellant sought to apply for the respondent’s action to be stayed on the ground offorum nonconveniens. The appellant succeeded before the assistant registrar but the stay was overturned on appeal before the High Court. Given the then-operative s 34(1)(c) of the 1999 SCJA, the appellanthad to file a request to the High Court Judge for further arguments within seven days of the date of the order if it wished to appeal against it, but in fact made that request some 14 days after the expiry of the prescribed timeline. The appellant later filed a notice of appeal but that was rejected on the basis that its request for further arguments was out of time and thus its notice was invalid. To correct the error, the appellant filed a motion before the Court of Appeal seeking an extension of time for a request to be made for further arguments. 94 The Court of Appeal observed (at [9]) that the law drew a distinction between an application for extension of time to file a notice of appeal and an application to extend time in relation to other matters: the less stringent approach as set out inTheTokai Maru([71]supra) governs the latter. In that context, the appellant’s application for extension of time to make a request for further arguments under the then s 34(1)(c) was more analogous to an application for extension of time to file a notice of appeal and thus warranted a stricter approach (at [10]): While [the appellant’s] application was not an application for an extension of time to file a notice of appeal, neither was it an application to extend time in relation to a matter of the nature inThe TokaiMaru. But the objective of [the appellant’s application was to enable [the appellant] to appeal against the order made [by the High Court] … As we see it, [the appellant’s] application was more akin to an application for an extension of time to file [an] appeal rather than to file affidavits of evidence-in-chief out of time as inThe TokaiMaru. It was a necessary step to filing an appeal. Therefore, a stricter approach should be followed in determining whether an extension of time should be granted … It must be borne in mind that the very limited time frame prescribed in s 34(1)(c) is to ensure that an interlocutory order made by a judge in chambers will obtain finality quickly so that the trial of the action will take place soonest practicable and not be bogged down by interlocutory squabbles. The trial of the action should not be delayed. 95 The Plaintiff submits that, given the amendment to the then s 34(1)(c), which now takes the form of s 28B of the SCJA, the requirement to request for further arguments is no longer a mandatory condition for the filing of an appeal against an interlocutory order. The link, so to speak, between the regimes of further arguments and appeals have thus been broken. Therefore,Denkono longer governs and the less stringent approach inTheTokai Marushould be preferred. 96 I am of the view that the more stringent approach inDenkoshould govern the Court’s approach to deciding whether to grant extensions of time to request for further arguments under s 28B of the SCJA. The less stringent alternative inTheTokai Maru,while entirely appropriate for interlocutory matters generally, is less so in respect of cases where the principle of finality may be disturbed. This would be the case if the time prescribed for the request of further arguments is that which is sought to be abridged. While there have been legislative amendments to the further arguments regime under the SCJA (see above at [87]), the crux of the matter is not whether such further arguments are mandatory or voluntary, but the fact that when the requests for further arguments are made, the time for filing a notice of appeal is suspended and there is significantly less clarity as to when and whether the initial judgment would continue to stand (see s 28B(3) of the SCJA). In other words, the legislative amendments relied upon by the Plaintiff to distinguishDenkodo not in substance negate the disturbance to finality that requests for further arguments out of time would create. To my mind, the Court of Appeal’s concern inDenko(at [10]) continues to apply in relation to the present s 28B: “an interlocutory order made by a judge in chambers [should] obtain finality quickly so that the trial of the action will take place soonest practicable and not be bogged down by interlocutory squabbles”. 97 The Plaintiff highlights that the present matter is merely interlocutory and there has not yet been a trial. However, the principle of finality applies also to interlocutory orders, even if to different extents. Interlocutory squabbles would otherwise bog down the progress of cases and there would be no end to the matter. In this regard, finality is not just a principle to which we pay lip service. It underlies several other concerns, including that there should be efficacious utilisation of the litigants’ and the Court’s resources, that the parties should be forthcoming with their arguments in the first instance, and that justice demands that an authoritative decision be made as regards any final or interlocutory matter so that the parties may move on with their lives. 98 The Plaintiff also submits that a more lenient approach would not set a bad precedent because the facts here are unusual and unlikely to be replicated. However, save for the fact that the AG is seeking an intervention in the present matter, it is not so clear that a request for further arguments out of time in relation to an interlocutory decision is such an uncommon occurrence. 99 Therefore, where an extension of time is sought for a party to request for further arguments, the more stringent approachinDenko(compared to that inTheTokai Maru), which applies to the issue of whether an extension of time should be granted to file or serve a notice of appeal, should govern save for one adaptation.Denkorefers to the “merits of the appeal” as one of four relevant factors (at [11]). Given that further arguments are no longer necessarily tied to an appeal, this question of the merits of the appeal should not arise. However, the question of the merit of the further arguments is a relevant consideration: if it is clear that the further arguments are hopelessly unsound, the Court should not exercise its discretion to extend time even if the delay is short and the applicant without any fault. 100 Accordingly, in determining whether an extension of time should be granted for a party to request for further arguments under s 28B of the SCJA, the relevant factors are: (a) the length of the delay, (b) the reasons for the delay, (c) the merits of the further arguments, and (d) the degree of prejudice to the other party (seeDenkoat [11]). 101 Applying this approach to the facts, I am satisfied that the application for extension of time should be granted in the present case. In this regard, I am also guided by the Court of Appeal’sdictuminSun Jin([71]supra) at [30]: … [T]he court, in deciding whether to extend the prescribed timeline for an act to be done, has to balance the competing interests of the parties concerned … Copious citation of case law will not be necessary (and also will not be helpful) as previous decisions will be no more than guides. In determining how the balance of interests should be struck and in applying the … factors [for when an extension of time will be granted], it is the overall picture that emerges to the court as to where the justice of the case lies which will ultimately be decisive. 102 Here, the delay was some 15 days, or as the Plaintiff put it, 11 working days. It is true that inDenko, the Court of Appeal opined that “[c]onsidering that the period allowed by s 34(1)(c) to apply for further arguments is only seven days, a delay of 14 days cannot be said to be relatively short” (at [12]). However, since the present s 28B permits a longer period to apply for further arguments (ie, 14 days), in that context the 15 days’ delay does not show such dilatoriness that the extension should not be given because of the length of the delay alone. 103 The reasons for the delay relied upon by the Plaintiff are that (a) time was taken in considering the Judgment, (b) advice was required from the AG, (c) new counsel had to be instructed, and (d) voluminous documents sought in the discovery had to be reviewed by the relevant parties in order for a position to be taken and the necessary affidavits to be drafted. In the circumstances, while there was probably some room for expedition, I do not find that the delay was inordinate or inexplicable. Some time would reasonably have to be consumed for the preparatory stages prior to making a request for further arguments, particularly given the involvement of external parties and the relative novelty of the issue of public interest privilege raised in the Judgment. 104 As to the merits of the further arguments, I could not say that the arguments on s 126 of the EA are so unlikely to succeed that no opportunity should be given for these to be raised. There may be some greater concern for the ambit of s 6(3) of the ITA, but it does not rise to the level that it could be described as hopelessly unsound. The 1st Defendant agreed that the applicant need only show that the merits of the further arguments are not hopeless, and need not rise to the threshold of likelihood to succeed. To that end, the merits of both these arguments on s 126 of the EA and s 6(3) of the ITA were not challenged. As for the further arguments on legal professional privilege, the real question which will be dealt with below is whether further evidence should be admitted at this stage. 105 Finally, I could not see that any material prejudice is shown from such delay. The matter is already some three years old and is still at the interlocutory stage. While the 1st Defendant should not be left with the threat of litigation hanging over its head, the suit is not yet so far advanced that further arguments would prolong matters disproportionately. In any case, as the Plaintiff acknowledges, any prejudice caused by the delay can be compensated by costs. 106 In the circumstances, therefore, I allow an extension of time for a request for further arguments under s 28B of the SCJA to be made by the Plaintiff. New arguments as further arguments 107 It should be clarified that it is permissible to raise new legal arguments or issues in further arguments which had not earlier been raised. In the present case, that would relate to the Plaintiff’s desire to submit on public interest privilege under s 126(2) of the EA and official secrecy under s 6(3) of the ITA. The Court of Appeal has expressly recognised that the main rationale behind the further arguments regime is to prescribe a procedure for the Judge to have an opportunity reconsider his decision in light of the further arguments as may be put forward (Singapore PressHoldings([70]supra) at [40], quotingJ H Rayner([70]supra)). The scope of the relevant provision may have since changed, but this core rationale did not. In a similar vein, it was stated under the recommendations section of a law reform report that “the making of further arguments was intended to address the possible injustice arising from full arguments not being made before the judge”: Law Reform Committee, Singapore Academy of Law,Report of the Sub-Committee on the Rationalisation of Legislation Relating to Leave toAppeal(October 2008) at para 105 (Chairman: Cavinder Bull). That being the case, there is nothing in the rationale, the case law, or the legislative framework or language to suggest that further arguments are to be restricted to arguments that had earlier been raised and that new arguments are to be precluded. Indeed, a contrary position would be odd when viewed against the purpose of the further arguments regime since it is often the bringing to the Court’s attention a heretofore unconsidered point that would be most helpful. Further evidence in support of further arguments 108 The second part of the Further Arguments Application relates to the Plaintiff’s request for leave to file and serve two affidavits in support of its further arguments in the Discovery Application and the Leave to Appeal Application (see above at [4]). 109 The Plaintiff argues that the Court has full discretion to allow the further evidence to be admitted. An analogy was drawn with new affidavit evidence coming in during a Registrar’s Appeal in the High Court: in that situation, “[t]he judge’s discretion is in no way fettered by the decision below, and he is free to allow the admission of fresh evidence in the absence of contrary reasons”:Lian Soon([73]supra) at [38]. Further, the Plaintiff citesPark Regis([73]supra) at [28] for the proposition that further evidence may be more liberally permitted in interlocutory matters, such as discovery, on the basis of “a distinction to be drawn between matters which had characteristics of a full trial or where oral evidence had to be recorded, and matters which were generally ‘interlocutory’ in nature”. 110 However, these cases do not go as far as the Plaintiff would like. BothLian SoonandPark Regiswere concerned with allowing evidence in a Registrar’s Appeal, which is a hearingde novo. The Judge in chambers may thus allow the admission of fresh evidence in the absence of contrary reasons because he is “entitled to treat the matter as though it came before him for the first time… [and] is in no way fettered by the decision below”:Lian Soonat [38]. This practice appears to be adapted from that in England and Wales: seeLian Soonat [35]. That is, however, not the case when further arguments are allowed. While the Judge’s agreement to hear further arguments may in some sense mean that the original decision is “tentative” (seeJ H Rayner([70]supra)), that tentativeness does not by itself mean that the doors are opened to all matters: the original decision is not readily departed from, and the findings are not revisitedde novo. As opposed to a further arguments hearing, ade novoRegistrar’s Appeal also does not involve the policy considerations of finality and abuse of process to the same extent. Therefore, I cannot accept the Plaintiff’s proposed position that further evidence should generally or readily be permitted to be adduced in support of any further argument that may be raised. 111 In my view, the more principled position is to allow further evidence in support of new arguments if sufficient reason exists, but to disallow the admission of further evidence to support or strengthen previously raised arguments. As discussed above, the finality of a decision, even if only interlocutory, must be respected (see above at [97]). Liberally allowing new evidence to support a previously raised argument would only encourage re-litigation and re-canvassing. The trickling in of evidence in support of an argument already made cannot, as the Plaintiff argues, be controlled solely by the Court’s discretion: much judicial time and cost would be incurred unless a bright line rule was applied to winnow possible applications. 112 I appreciate that this position would cause a line to be drawn between the position as to further arguments (which permits old and new arguments alike to be raised) and that in relation to further evidence (which distinguishes between further evidence in support of new arguments and that in support of old arguments). However, this is not unjustified. As a matter of principle, this reflects a distinction that may be made between finality in evidence and finality in law. As I understand it, the concept of tentativeness used by Chan Sek Keong J inJ H Rayner([70]supra) to describe an order that is subject to further arguments relate to findings in law or how the evidence already presented is to be construed. Finality in evidence involves separate concerns – and that is why s 28B of the SCJA addresses further arguments rather than further evidence. It is this that underlines the approach inTravista([78]supra), in which Judith Prakash J noted – expressly in the context of a final and not interlocutory decision – as follows (at [38]): … the purpose of further arguments is to highlight to the court an argument which was not made, or not made properly previously, but the new argument must be based on existing evidence. Otherwise, a party after having had the benefit of hearing the grounds of the court’s decision will simply adduce evidence to address flaws or gaps in its evidence and ask for the matter to be reheard. This will affect the finality of the court’s decision. 113 Practically, the admission of further evidence would also often be more disruptive to the conduct of the proceedings, distorting timelines to a greater extent than if further arguments were simply made without such evidence being adduced. This is because it may not stop with a simple affidavit introduced by one party; the other party may, as the Plaintiff acknowledged that the 1st Defendant could do in the present case, seek leave to file a reply or response. If not curtailed, the potential for further evidence to delay and disrupt matters is disconcerting. 114 In determining whether sufficient reasons have been shown to justify the admission of further evidence in support of new arguments, there can be no prescriptive list of factors for consideration given the myriad of factual circumstances that may arise. That said, the time-tested factors set out inLadd v Marshall[1954] 1 WLR 1489 would likely be a useful starting point: (a) whether the new evidence could have been obtained at the time of the original hearing, with reasonable diligence, by the party seeking to introduce it; (b) whether the new evidence is such that it would probably have an important influence on the result of the case, even though it need not be decisive; and (c) whether the evidence is such as is presumably to be believed. 115 In addition, the likelihood of further delay to the proceedings that would be caused as a result of such admission, and the degree of prejudice that may be caused to the other party, will likely be relevant. Where, as is the case here, an extension of time is also sought to request for further arguments, some of the considerations may overlap. 116 On the facts, leave to admit further evidence in relation to s 126(2) of the EA and s 6(3) of the ITA is granted. While the new evidence could have been obtained earlier, I appreciate that the issue of public interest privilege is relatively novel and untested in Singapore. Further, the importance of the further evidence to the further arguments that may be made in the Discovery Application is immediately apparent: without these new affidavits, public interest privilege under s 126(2) would be a non-starter. The credibility of the affidavits is also not in question. The nature of the evidence is such that they relate to largely undisputed facts; rather, it is the legal characterisation and meaning of these facts that are likely to be in dispute. Inordinate delay to the proceedings is therefore unlikely. In this regard, I am unaware of any prejudice caused that cannot be compensated by costs. For these reasons, I find that sufficient reasons exist for the admission of the further evidence as sought by the Plaintiffs in the Further Arguments Application insofar as they relate to the further arguments on public interest privilege under s 126(2) of the EA and official secrecy under s 6(3) of the ITA. 117 However, that part of the further evidence that is to support the previously canvassed point in relation to legal professional privilege – including both litigation privilege and legal advice privilege – cannot be admitted. That being so, it would be for the parties to consider whether to continue their pursuit of the further arguments in relation to those points.",
        "Issue 2: The Further Arguments Application": "",
        "The Plaintiff’s arguments": "69 The Further Arguments Application concerns the Plaintiff’s application for (a) an extension of time to file the request to make further arguments in respect of the Discovery Application and (b) leave to file and serve two affidavits as evidence in support of the further arguments to be made in the Discovery Application and the Leave to Appeal Application (see above at [4]). 70 In respect of the issue of extension of time to make further arguments, the Plaintiff starts from the premise that the purpose of allowing further arguments is for the parties to advance all arguments that may be material, and to allow the Court to review a decision before an appeal is brought:SingaporePress Holdings Ltd v Brown Noel Trading Pte Ltd and others[1994] 3 SLR(R) 114 (“Singapore Press Holdings”). In this regard, the party making further arguments is not confined to points that have already been raised, but may also rely on additional grounds not previously invoked:J H Rayner (Mincing Lane) Ltd v Teck Hock & Co (Pte) Ltdand others[1988] SGHC 103 (“J H Rayner”). Accordingly, the issue in the present application is not whether the failure to raise these arguments during the initial hearing for the Discovery Application should be excused, but a narrower one of whether the 11 working days’ delay in making the request for further arguments should bar the request. 71 To this end, the Plaintiff urges the Court to invoke its powers under para 7 of the First Schedule to the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”) to grant an extension of time for the Plaintiff to request for further arguments:Denko-HLBSdn Bhd v Fagerdala Singapore Pte Ltd[2002] 2 SLR(R) 336 (“Denko”). In considering whether to exercise its discretion, the less stringent approach inThe TokaiMaru[1998] 2 SLR (R) 646 (“The TokaiMaru”) should be adopted, rather than the stricter approach in relation to an extension of time to file a notice of appeal. The ultimate concern of the Court should be the justice of the case:Sun Jin Engineering Pte Ltd v Hwang Jae Woo[2011] 2 SLR 196 (“Sun Jin”). 72 On the facts, an extension of time is justified because: (a) there is a reasonable and genuine justification for the delay, (b) there is no irremediable prejudice that would be occasioned to the Defendants, and (c) the further arguments sought to be made are highly pertinent and meritorious. 73 In relation to the issue of further evidence, the Plaintiff submits that their admission would ensure that the Court is properly positioned to consider all relevant material evidence when hearing the further arguments and, if necessary, the Leave to Appeal Application. Since the Discovery Application is subject to further arguments, the decision is “tentative” until such arguments are heard:J H Rayner([70]supra). Accordingly, analogous to a Judge in chambers hearing a Registrar’s Appeal, the Court has a broad discretion to allow the admission of fresh evidence in the absence of contrary reasons:Lian Soon Construction Pte Ltd v Guan Qian Realty Pte Ltd[1999] 1 SLR(R) 1053 (“Lian Soon”). Further, the Court’s discretion to admit further evidence may be exercised more liberally in interlocutory matters such as discovery applications:Park Regis Hospitality ManagementSdn Bhd v British Malayan Trustees Ltd and others[2014] 1 SLR 1175 (“Park Regis”). 74 On the facts, the Court should permit the further evidence,ie, the two affidavits, to be admitted. These affidavits are necessary and relevant to the further arguments sought to be raised by the Plaintiff. They were delayed only because the advice to the Plaintiff to include these factual matters was given after the Judgment was delivered. No challenge has been made by the 1st Defendant as to their credibility, and no prejudice has been suggested that cannot be compensated by costs. 75 In particular, in relation to the affidavit of Ms Ng, the Plaintiff argues that this should now be admitted because this Court should have, during the earlier hearing of the Discovery Application, ordered further evidence to be produced on oath if it considered the evidential basis before it insufficient to justify the Plaintiff’s claim as to legal professional privilege: Colin Passmore,Privilege(Sweet & Maxwell, 3rd Ed, 2013) at para 9.032;AtosConsulting Ltd v Avis plc[2007] EWHC 323 (“Atos”) at [37(4)]. 76 Finally, the Plaintiff submits that even if the Court were to decline to grant the extension of time to request for further arguments, these affidavits should still be admitted as they provide context for the Leave to Appeal Application. No prejudice would be caused to the 1st Defendant since the Leave to Appeal Application will only be heard at a later stage and, if necessary, leave may be sought by the Defendants for time to respond.",
        "Issue 3: Inspecting documents and calling for further evidence in assessment of privilege": "118 Properly speaking, the issue of whether the Court should, in determining the applicability of a head of privilege, inspect the documents concerned or call for further supporting evidence should only be considered at the stage where the further arguments are substantively heard. But that would difficult, as the Plaintiff in part invoked the Court’s ability to inspect evidence as a supporting reason showing the strength of their case in favour of time being extended and further evidence being admitted. In view of that, I will address the issue here. 119 The Plaintiff submits that this Court should, at the original hearing of the Discovery Application and prior to the release of the Judgment, have given the Plaintiff an opportunity to file another affidavit to shore up his claim as to legal professional privilege if the Court considered the evidence before it insufficient to find in favour of the Plaintiff. Alternatively, the Court should have inspected the documents concerned. In this regard, the Plaintiff relied on the English High Court decision ofAtos([75]supra), where it was held (at [37(4)]) that where an objection is taken to discovery on the ground of privilege: If sufficient grounds are shown for challenging the correctness of the asserted right then the court may order further evidence to be produced on oath or, if there is no other appropriate method of properly deciding whether the right to withhold inspection should be upheld, it may decide to inspect the documents. 120 I do not readAtosas supporting the Plaintiff’s submission so definitively. As argued by the 1st Defendant, the proposition inAtosis not either novel or unknown in Singapore. InSkandinaviskaEnskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and other appeals[2007] 2 SLR(R) 367, the Court of Appeal considered that there may be grounds for the Court to inspect the documents concerned, and stated (at [104]) as follows: However, there is also a case for using this approach only in cases where the judge has a real doubt about the claim of the party seeking to resist discovery on the ground of legal professional privilege … … This approach was accepted by the New Zealand Court of Appeal inTaranakiCo-operative Dairy Company Limited v Rowe[1970] NZLR 895, where Turner J, delivering the judgment of court said (at 904), “[t]he jurisdiction to inspect the documents of one party without disclosing what is in them to the other is perhaps one to beconservatively exercised” [emphasis added]. Subsequently, Cooke J (as he then was), in the New Zealand Court of Appeal decision ofGuardian Royal Assurance v Stuart… observed thus (at 599): As in previous cases in this Court (seeKonia v Morley,Environmental Defence SocietyInc v South Pacific Aluminium Ltd (No 2)[1981] 1 NZLR 153 andFletcher Timber Ltd v Attorney-General[1984] 1 NZLR 290)inspection of the documents by the Judges has proved illuminating. High Court Judges now appear to be adopting this practice quite commonly in disputed privilege claims.Experience suggests that its advantage in being likely to lead to a more just decision outweighs the disadvantage that only the Judge and notthe other side sees the documents if the claim to privilege is upheld. Accordingly, in the field of legal professional privilege at least, I think thatin general a Judge who is in any real doubt and is asked by one of the parties to inspect should not hesitate to do so. [emphasis added] [emphasis in original] 121 I understand the guidance to be that if the Court is in real doubt from the affidavit evidence as to whether the claim of privilege is properly made out, the Court may inspect the documents concerned on the request of either or both parties. Indeed, to go beyond this would give too much leeway to the party claiming privilege and allow him a second attempt at the same argument. Further, inspection should be done with caution, as a decision on the basis of such an inspection results in a determination without giving the opposing party an opportunity to argue the matter fully. 122 In the present case, I was not in doubt in the original application. Rather, my conclusion, though not stated as strongly as Plaintiff’s current counsel may consider appropriate, was that the affidavit evidence was deficient and did not support what was claimed. For the avoidance of doubt, contrary to the Plaintiff’s submission, I made a positive finding that legal advice privilege was not applicable. In the face of the evidence presented by the Plaintiff at that time, there was to my mind no necessity for inspection or further evidence. The statements in the supporting affidavits were not doubtful or ambiguous in their claim or meaning; it was just that the privilege was not supported by what had been asserted. Indeed, given the unambiguity of the assertions, and the lack of doubt in my mind as to what was asserted and its basis, calling for further evidence would not only be indulgent but may also appear partisan.",
        "Conclusion": "123 For the foregoing reasons, I allow the Intervention Application, which accordingly permitted the AG’s submissions in relation to the Further Arguments Application to be considered. I also allow the Further Arguments Application in part: I grant the Plaintiff an extension of time to request for further arguments, but grant the Plaintiff leave to adduce further evidence only insofar as they relate to the further arguments on public interest privilege under s 126(2) of the EA and official secrecy under s 6(3) of the ITA. 124 Directions for arguments on costs as well as other matters relating to the conduct of this matter will be separately given. Aedit AbdullahJudicial Commissioner Ang Cheng Hock SC, Tan Ruyan Kristy, Lim Jun Rui, Ivan andMak Sushan, Melissa (Allen & Gledhill LLP) for the plaintiff;Davinder Singh SC, Jaikanth Shankar, Fong Cheng Yee, David and Shirleen Low (Drew & Napier LLC) for the first and second defendants;Aurill Kam and Jamie Pang(Attorney-General’s Chambers) for the intervener."
    }
}