{
    "case_title": "TYC Investment Pte Ltd v Chan Siew Lee Jannie and another",
    "ncitation": "[2017] SGHC 202",
    "coram": "Audrey Lim JC",
    "sections": {
        "Whether clause 10 of the SSD is frustrated by reason of the bankruptcy order made against JC": "55Likewise, given my earlier findings, I also dismiss TYC’s third prayer. However, I will deal with it briefly for completeness. TYC submits that there is an implied term that clause 10 is only operable if both JC and HT remain directors of TYC, and that in the alternative, clause 10 has been frustrated by the vacation of JC’s office as director of TYC.  I agree that there is an implied term that clause 10 is only operable if both JC and HT remain directors of TYC. Clause 10 was the subject of a previous dispute between the parties inTYC Investment, where the High Court held (at [192]) that the clause was a contractual promise by HT and JC to each otherin their capacities as directors of TYC. This part of the decision was not disturbed on appeal, and I have no reason to disagree with it. Clause 10 pertains to payments by TYC, and JC’s and HT’s capacities to sign cheques on TYC’s bank accounts or to approve the payments must be in exercise of their management powers as directors of TYC. The powers of management of a company rest with its board of directors and not with its shareholders (see s 157A of the CA andChan Siew Lee v TYC). 56Hence, had I held that JC was no longer a director of TYC, clause 10 would have been frustrated as the very capacities in which she and HT had contemplated their bargain in respect of that clause would no longer exist. Clause 10 would become impossible to perform as JC would not have the power to sign cheques on TYC’s bank accounts or vouchers approving the payments. Declaration that TYC be at liberty to reimburse Amstay for payments made by Amstay on TYC’s behalf 57At the hearing before me, parties agreed that I need not deal with the fourth prayer sought by TYC, namely for a declaration that it be at liberty to reimburse Amstay for payments made by it on TYC’s behalf in the ordinary course of TYC’s business. In my view, TYC should first attempt to utilise the mechanisms already available to resolve this. The parties agreed. In the present case, given that I have held that JC is reinstated as a director of TYC, the approval mechanism under clause 10 of the SSD should first be employed. Failing that, the Court of Appeal inChan Siew Lee v TYChas held that shareholders have, in certain limited circumstances, the reserve power to authorise payments where there is a deadlock within the board which cannot be broken by the appointment of additional directors and/or the removal of directors. Likewise, even if I had decided that JC was not reinstated to the board and that clause 10 of the SSD had been frustrated, TYC should first deploy mechanisms under its articles to resolve the issue of reimbursement or payments by Amstay. I make no comments on whether and how TYC can or should resolve this issue, as this is no longer a live issue before me. 58Suffice to say, the relief prayed for by TYC is, in my view, premature. The court should only step in when the company cannot resolve the matter after having employed the appropriate powers and mechanisms given under its articles and by law, and even then, there are limits to the types of relief that the court can grant. It is not the task of the court to manage the affairs of a company (Shuttleworth v Cox Brothers and Company[1927] 2 KB 9 at 23), such powers being the preserve of the board of directors (Chan Siew Lee v TYCat [1]).",
        "Declaration that JC be reinstated as permanent Governing Director, in the event that there is no automatic reinstatement or that JC was no longer a director": "59Again, the issue of whether JC should be reinstated, by the court, as a permanent Governing Director of TYC, if she were found to be no longer a director or that there is no automatic reinstatement despite setting aside the bankruptcy order, need not be dealt with in view of my findings above. 60However, if I had to deal with this, I would not have granted this relief. The TYC Articles read with Table A provides for the appointment of directors. JC is at liberty to stand for re-election as a director, in accordance with those provisions. The court has no power to alter a company’s articles, save on limited grounds such as under s 216 of the CA (Chan Siew Lee v TYCat [36]). There is also no express power (statutory or otherwise) conferred on the court to make a reinstatement in such circumstances. Thus, it is not appropriate for the court to depart from provisions in the TYC Articles pertaining to the appointment of directors and reinstate JC as a director of TYC on its own discretion. This would amount to rewriting the company’s articles. I would add that this is also not a case in which TYC or HT had procured JC’s ouster from the board, and hence the issue ofbona fideson the part of TYC or HT does not arise. JC’s office of director was vacated as a result of her bankruptcy, which had nothing to do with TYC or HT. Conclusion 61In conclusion, I make the following orders: (a)I dismiss prayers (1), (2) and (3) of TYC’s application (see [7(a)], [7(b)] and [7(c)] above) and make no order on prayer 4 of TYC’s application (see [7(d)] above). (b)I also dismiss JC’s counterclaim in [8(a)] and [8(b)] above, but allow her counterclaim in [8(g)] above, in that she is automatically reinstated as a permanent Governing Director of TYC. JC was not, during the time when the bankruptcy order subsisted, a director of TYC, as her office of director became vacant upon the bankruptcy order being made. Article 72 of Table A did not contradict Article 8 of the TYC Articles. However, by reason of the setting aside of the bankruptcy order, JC is automatically reinstated as a permanent Governing Director of TYC. I wish to emphasise that, had JC’s bankruptcy order remained in force and had not been set aside, JC’s office of director would have remained vacated. (c)As for clause 10 of the SSD, this remains operable because of JC’s reinstatement as a permanent Governing Director of TYC. Hence I make no order on JC’s counterclaim in [8(c)] and [8(d)] above. 62As for a declaration that the Notification filed on 7 October 2016 with ACRA on HT’s instructions is null, void and illegal (see [8(e)] above), I dismissed this prayer. I find that the Notification was properly filed since as at 7 October 2016, JC’s bankruptcy order was still in force. However, as I hold that JC’s office as director is reinstated, in relation to JC’s claim in [8(f)], TYC is to do the necessary and file the relevant information with ACRA on JC’s reinstatement as a director. 63I will hear the parties on costs. Audrey LimJudicial Commissioner Chu Hua Yi and Michelle Lee Ying-Ying (Dentons Rodyk & Davidson LLP) for the plaintiff;Bachoo Mohan Singh (Bachoo Mohan Singh Law Practice) for the first defendant;Chelva Retnam Rajah, S.C., Chia Ru Yun Megan Joan and Perry Elizabeth Wong (Tan Rajah & Cheah) for the second defendant."
    }
}