{
    "case_title": "United Overseas Bank Ltd vPereira, Dennis John Sunny and another",
    "ncitation": "[2017] SGHC 66",
    "coram": "Hoo Sheau Peng JC",
    "sections": {
        "Introduction": "1 Originating Summons No 619 of 2016 was a mortgage action brought by the plaintiff, United Overseas Bank Ltd (“UOB”), under O 83 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”) seeking, inter alia, orders for the delivery of possession by the defendants of two mortgaged properties at 44 Toh Crescent, Singapore (“the Toh Crescent Property”) and 700 Upper Changi Road East, #02-08, Singapore (“the Changi Property”), which shall be referred to collectively as “the Properties”. 2 On 24 August 2016, the learned Assistant Registrar Lim Sai Nei (“the AR”) granted,inter alia, the orders for delivery of possession of the Properties sought by UOB. However, as the defendants’ daughter was staying at the Toh Crescent Property at that time, and was due to take certain major examinations in November 2016, the AR granted a stay of execution until 30 November 2016 in respect of the order relating to the Toh Crescent Property (which I shall refer to as “the order for possession”). 3 On 23 December 2016, the first defendant, Pereira Dennis John Sunny (“Mr Pereira”), applied by way of Summons No 6142 of 2016 for a further stay of execution of the order for possession until 31 March 2017, or such earlier time that Mr Pereira’s company, Offshore Logistics (Asia Pacific) Pte Ltd (“the Company”), was to be sold or otherwise dealt with, with liberty to apply for an extension if an impending sale were to be in the midst of completion (“the application for stay of execution”). This was brought pursuant to O 45 r 11 of the ROC. 4 The AR dismissed the application. Mr Pereira appealed. After hearing the parties, I did not think that there was any basis to grant a further stay of execution of the order for possession, and upheld the AR’s order. Mr Pereira has appealed against my decision, and I set out my reasons.",
        "Background": "",
        "The parties": "5 Mr Pereira is married to the second defendant, Faridah Binte V Abdul Lattif (“Mdm Faridah”). He is a director and majority shareholder of the Company, and Mdm Faridah is a housewife. The defendants jointly own the Toh Crescent Property. It used to be their family home. However, by the time the order for possession was made, Mr Pereira had moved out, and only Mdm Faridah and their daughter resided at the premises. The defendants also used to jointly own the Changi Property, which had been sold by UOB by the time of the hearing before me. For the avoidance of doubt, Mdm Faridah was not a party to, and the Changi Property did not feature in, this application for stay.",
        "The underlying debt": "6 The defendants mortgaged the Properties to UOB as security for monies due and owing to UOB pursuant to two housing loans granted by UOB to the defendants, as well as guarantees furnished by Mr Pereira to UOB in respect of two loans facilities extended by UOB to the Company. 7 Sometime around March 2015, the Company failed to pay the monthly instalments due to UOB under the two loan facilities. Then, sometime around March 2016, the defendants started to default on the payment of the monthly instalments due under the two housing loans. On 14 March 2016, UOB’s solicitors issued letters of demand to the defendants demanding payment of the outstanding sum of $8,264,249.71 and interests to be made within 14 days. The defendants did not make such payment. 8 On 25 April 2016, UOB’s solicitors served on the defendants a notice pursuant to s 75(2) of the Land Titles Act (Cap 157, 2004 Rev Ed), requesting that the defendants deliver possession of the Properties to UOB within one month of the service of the notice, failing which UOB would exercise its power of entry under the respective mortgages. The defendants did not comply. On 30 May 2016, UOB’s solicitors sent a second letter to the defendants and their solicitors requesting that the defendants deliver possession of the Properties to UOB within three days of the said letter. Again, the defendants did not comply.",
        "The mortgage action": "9 On 21 June 2016, UOB commenced the present mortgage action in respect of the Properties. Mr Pereira sought relief from forfeiture, arguing that it was unconscionable for UOB to repossess the Properties, and to cause the defendants to lose their home when the Company’s assets were more than enough to pay off the full sum of the debt owed. He highlighted the fact that UOB held multiple securities over the Company’s assets. Further, it was pointed out that on 7 June 2016, UOB had applied for the Company to be placed under judicial management (“JM”), and that the JM order was made on 1 July 2016. In making that application, UOB had deposed as to its belief that there was a reasonable prospect of rehabilitating the Company. As for Mdm Faridah, she explained that she had not been involved in the Company and appealed for the court’s leniency, particularly given her daughter’s upcoming examinations. 10 The AR disagreed with Mr Pereira’s arguments, holding that relief against forfeiture should not be granted (even assuming that it applied in the first place), and that UOB had not been acting unconscionably as it was merely exercising its contractual rights. As such, orders for vacant possession of the Properties were granted. Specifically, in respect of the Toh Crescent Property, a stay of execution of three months (ie, until 30 November 2016) was granted, so as not to disrupt the defendants’ daughter in her preparation for her examinations. UOB did not object to this three months’ grace period. 11 On 30 November 2016, UOB’s solicitors wrote to the defendants and their solicitors to notify them that UOB would take the necessary actions to enforce the order for possession if the defendants failed to deliver the keys to the Toh Crescent Property by 1 December 2016. Around this time, Mdm Faridah called UOB’s solicitors to inform them that, in compliance with the order for possession, she had vacated the Toh Crescent Property and that her keys were with Mr Pereira. 12 As for Mr Pereira, on 30 November 2016, his solicitors wrote to UOB’s solicitors to request an extension of one month for the delivery of possession of the Toh Crescent Property to UOB, in order to “allow [Mr Pereira] and his daughter to firstly remove their personal property”. The next day, UOB’s solicitors replied by letter rejecting Mr Pereira’s request on the ground that ample time had already been given to him to remove his personal property, especially considering that Mr Pereira had not been in occupation of the Toh Crescent Property for some time. Solicitors for UOB and Mr Pereira continued to engage in correspondence, in the course of which UOB’s solicitors consistently rejected Mr Pereira’s contentions and proposals with regard to the Toh Crescent Property. 13 On 13 December 2016, UOB’s solicitors filed a writ of possession in respect of the Toh Crescent Property. On 23 December 2016, the Sheriff, together with representatives of UOB and its solicitors, attempted to execute the writ of possession, but discovered that Mr Pereira was in occupation of the premises. Mr Pereira then informed UOB that he had instructed his solicitors to file the present application for stay of execution.",
        "The application for stay of execution": "14 Indeed, the application for stay of execution was lodged on 23 December 2016. In the supporting affidavit (which was affirmed ten days prior), Mr Pereira averred that since the hearing before the AR, the Company had received new offers for its acquisition, the highest offer being one by LOGOS Property Group Pte Ltd (“LOGOS”) for around $9.8m. Although the LOGOS offer initially seemed like it would fall through due to restrictions on the use of the Company’s premises imposed by the landlord, JTC Corporation (“JTC”), Mr Pereira produced a letter from JTC dated 9 November 2016, which stated that JTC was “prepared to consider allowing [the Company] to extend the approved use to include other manufacturing activities but not logistics operation[s]”. Mr Pereira believed that this would allow the Company to secure other acquisition offers comparable to the LOGOS offer, which would be sufficient to pay off the debts due to UOB. 15 At the hearing for the application for stay of execution before the AR on 4 January 2017, Mr Pereira’s counsel requested an adjournment to respond to the reply affidavit by UOB, which had been filed one day before the hearing (“UOB’s Reply Affidavit”). Counsel for UOB countered that this was simply a “delaying tactic” on Mr Pereira’s part. The AR held that a reply affidavit from Mr Pereira was not necessary. Noting that it had already been more than four months since the order for possession was made, and that the initial stay of execution had been granted only to avoid disruption to the defendants’ daughter’s preparation for examinations, the AR dismissed the application for stay of execution on the basis of the written submissions and affidavits that were before her. This formed the subject matter of the appeal before me.",
        "The appeal": "16 To reiterate, the application for stay of execution was brought pursuant to O 45 r 11 of the ROC, which provides that the court may grant a stay of execution of an order on the ground of matters which have occurred since the date of the order, and on such terms as it thinks fit. Where a party relies on such matters which have occurred since the date of the order for the purposes of O 45 r 11, that party must show “that the matters referred to are matters which would or might have prevented the order being madeorwould or might have led to a stay of execution if they had already occurred at the date of the order” [emphasis added]:SAL Leasing (Pte) Ltd vHendmaylex Pte Ltd and others[1987] SLR(R) 303 at [8]. 17 As a preliminary matter, at the hearing before me on 6 February 2017, counsel for Mr Pereira sought leave to admit a further affidavit by Mr Pereira filed without leave of court on 3 February 2017 (“the Further Affidavit”). UOB’s counsel objected to this, pointing out that at the hearing before the AR a month earlier, Mr Pereira had failed to obtain leave to respond to UOB’s Reply Affidavit. Filing the Further Affidavit at the eleventh hour was thus a deliberate attempt on Mr Pereira’s part to delay matters. In response, counsel for Mr Pereira explained that the Further Affidavit not only sought to refute allegations within UOB’s Reply Affidavit, but also to introduce certain new documents received by the Company since the hearing before the AR. This accounted for the late filing. If so required, Mr Pereira was willing to file a formal application for leave to adduce the Further Affidavit. At this juncture, UOB’s counsel indicated that he was prepared to proceed with the hearing without delay and to address the court on the matters within the Further Affidavit. In these circumstances, and in order to deal comprehensively with the merits of the matter, I allowed the Further Affidavit to be used in the appeal.",
        "The parties’ cases": "18 For his main argument, Mr Pereira relied onHong Leong Finance Ltd v TanGian Huay and another[1999] 1 SLR(R) 755 (“Hong Leong Finance”) for the proposition that while the court did not have any jurisdiction to decline an order for possession sought by a mortgagee, it had jurisdiction to grant a stay of execution of an order for possession (Hong Leong Financeat [16]). To this end, a relevant factor was whether there was a reasonable prospect of the debt being satisfied in full or the mortgagee being otherwise satisfied (Hong Leong Financeat [10]-[12]). 19 In the present case, Mr Pereira contended that “new circumstances” indicated a reasonable prospect that the Company would be able to satisfy its debt in full. Specifically, there had been new offers to acquire the Company, and JTC was willing to widen the scope of authorised use of the Company’s premises. Mr Pereira was thus confident that the Company would be able to secure LOGOS’ offer or other comparable offers. In this regard, a draft term sheet between the Company and LOGOS for the purchase of 49% of the Company’s shares for $9.7m dated “January 2017” was produced. There was also interest in the purchase of the Company’s diving system for US$3m, as evidenced by a letter from Meds Offshore Group Sdn Bhd to Mr Pereira dated 1 February 2017. Both documents were exhibited in the Further Affidavit. With the funds from the sales of its shares and equipment, Mr Pereira expressed confidence that the Company would be able to discharge its debt to UOB. 20 Further, it was submitted that UOB’s continued support for the JM of the Company (with an extension of the JM order being granted by the court on 27 December 2016) meant that UOB remained of the view that there was a reasonable probability of rehabilitating the Company, such that it would be able to satisfy its debts in full. 21 In addition to the main argument, counsel for Mr Pereira raised two other matters for the court’s consideration. First, the sale of the Toh Crescent Property, which Mr Pereira estimated to be valued at around $5.4m, would not be sufficient to satisfy the Company’s debt owed to UOB, which as of 3 January 2017 exceeded $9m. Second, in the event that the court granted a further stay of execution, the prejudice against UOB would be negligible compared to that suffered by Mr Pereira and his daughter in losing their family home. 22 In response, counsel for UOB submitted that the application for stay of execution was without merit for three main reasons. First, as the creditor, UOB was fully entitled to elect whether to enforce its claim against the Company as the principal debtor, or against Mr Pereira as the guarantor:ChanSiew Lee Jannie v Australia and New Zealand Banking Group Ltd[2016] 3 SLR 239 (“ChanSiew Lee Jannie”). UOB should not be compelled to proceed against the Company, and to that extent, the Company’s prospect of being able to satisfy its debt in the future was immaterial. As forHong Leong Finance, it was argued that the case was not applicable to guarantees, and was also distinguishable on its facts. 23 Secondly, the “new circumstances” raised by Mr Pereira were merely speculative. LOGOS had never made a formal offer to acquire the Company, and Mr Pereira was only able to produce the draft term sheet between LOGOS and the Company, which was merely for the purpose of discussion. Further, JTC had not unequivocally and formally agreed to expand the authorised use of the Company’s premises, and had only stated that it would “consider” to do so. Given that the Company had other creditors, the sum to be received from any potential sale might still be insufficient for the Company to discharge its debt to UOB. The fact that UOB supported the continued JM of the Company did not serve to indicate that there was a reasonable prospect of the Company satisfying its debt in full. 24 Finally, UOB noted that more than sufficient time had been granted to the Company and the defendants to settle their debts and affairs. During this time, Mr Pereira had behaved unconscionably by taking advantage of the initial stay of execution under the order for possession to resume occupation of the Toh Crescent Property after Mdm Faridah had moved out, and further, he had deliberately waited to file the stay application in order to buy himself more time.",
        "Analysis and decision": "",
        "Whether a creditor may proceed against a guarantor regardless of the principal debtor’s prospect of satisfying its debt": "25 Turning to analyse the arguments, first and foremost, I agreed with UOB that a creditor is fully entitled to proceed against a guarantor regardless of the principal debtor’s ability to pay its debts. This legal principle is set out inChanSiew Lee Jannie, which involved a mortgagor-guarantor who entered into a personal guarantee to repay the creditor all sums owed under certain loan facilities taken out by the company of which she was a director. Much like in the present case, the company defaulted on payments and the creditor sought to enforce the mortgage against the mortgagor-guarantor in satisfaction of the debt owed. The mortgagor-guarantor argued that the creditor could not commence bankruptcy proceedings against her unless it first realised the securities that were provided by the principal debtor. The Court of Appeal rejected this argument and remarked(at [36]): It has long been the position that a creditor with several remedies at his disposal can choose whether to enforce and, if so, which one to enforce, at what time, in which order, and in whatever way, subject only to the rule that he cannot recover more than is due to him. The election is solely one for the creditor to make. A surety has no right as such to require the creditor to proceed against the principal (or any of the co-sureties), or against any security provided for the debt guaranteed before proceeding against himself. [internal citations omitted] 26 This position recognises the commercial rationale for guarantees. As the Court of Appeal explained, were the court to hold otherwise, “[it] would not only be re-writing the express terms of the parties’ contract, but [it] would also be diminishing the attraction of guarantees as a securing mechanism” (at [39]). This would be unfair to the creditor and also unwise “as a matter of legal policy” (at [39]). It was therefore held inChanSiew Lee Janniethat the creditor had the right to take action against the guarantor, including commencing bankruptcy proceedings, regardless of whether the creditor had other remedies which it could enforce against the principal debtor, and notwithstanding even the serious consequences of bankruptcy which were appreciated by the Court of Appeal. 27 Thus, as a matter of law, UOB was not required to enforce its principal debt against the Company before seeking remedies against Mr Pereira as the guarantor. Indeed, this principle was not disputed by counsel for Mr Pereira. However, it was argued that UOB should withhold its action against the guarantor for the time being, so as to await the outcome of genuine efforts by the Company to repay its debts. It was submitted, relying on the case ofHong Leong Finance, that the court retained the jurisdiction and discretion to grant a further stay of execution of the order for possession, provided there was a reasonable prospect of the Company being able to satisfy its debt. I now turn to examineHong Leong Financein greater detail. 28 InHong Leong Finance, the mortgagor-borrower defaulted on payments of a loan for the purchase of a Housing and Development Board property, which loan was secured by the said property. The mortgagee-lender applied for an order for possession of the mortgaged property. The High Court disallowed the application, but ordered the mortgagor-borrower to pay the outstanding loan by instalments. The Court of Appeal allowed the appeal in part and granted an order for possession, relying on the general principle that “the court has no jurisdiction to decline an order for possession or adjourn the hearing whether on terms of the mortgagor keeping up the payments or paying the arrears, if the mortgagee cannot be persuaded to agree to such a course” (at [11]-[12]). That said, as an exception to this principle, the court has the jurisdiction to order a short adjournment of the summons for possession “to afford to the mortgagor a chance of paying off the mortgagee in full or otherwise satisfying him, but not if there is no reasonable prospect of this occurring” (at [12]). On the facts, given that a repayment schedule had already been put in place by the High Court, a stay was granted to allow the mortgagor-borrower to keep up with the monthly instalments. 29 I agreed with counsel for UOB thatHong Leong Financeshould be distinguished on the basis that it dealt with the direct enforcement of the security between a mortgagor-borrower and a mortgagee-lender, with the mortgagor-borrower being given a short reprieve to satisfy the debt if there was a reasonable prospect of him doing so. In other words, the case did not provide any support for the contention that the guarantor may require the creditor to wait for repayment by the principal debtor before enforcing its rights and remedies against the guarantor because of a reasonable prospect of such repayment. The commercial value of a guarantee would be defeated if the creditor had to look to the principal debtor to discharge its obligations before proceeding against the guarantor. 30 To sum up, the arguments advanced by counsel for Mr Pereira ran completely contrary to the position that to give effect to the underlying commercial purpose of the guarantees, UOB should be entitled to elect when and whether to proceed against the guarantor, Mr Pereira, regardless of its remedies against the Company. With the principle in mind, it seemed to me that none of the matters raised by Mr Pereira would or might have prevented the order for possession from being made, or would or might have led to a stay of execution if they had occurred prior to the date of the order for possession, so as to justify a further stay pursuant to O 45 r 11 of the ROC.",
        "Whether there was a reasonable prospect of the principal debtor satisfying its debts": "31 In any event, I did not find that Mr Pereira had established that there was a reasonable prospect that the Company would be able to satisfy its debt owed to UOB. In my view, Mr Pereira overstated the significance of several of the “new circumstances” raised in support of his stay application as set out below: (a) First, the draft term sheet did not amount to a “firm offer” as Mr Pereira asserted in the Further Affidavit. The draft term sheet was clearly not meant to be binding. It was subject to several conditions precedent such as JTC’s approval and satisfactory discharge of JM of the Company (clause 1.5), and the consideration to be furnished by LOGOS for the Company’s shares was “to be adjusted in accordance with the final actual costs” (clause 2.3). Moreover, the draft term sheet was not signed, and its header emphasised that it was merely a “Draft for Discussion”. It was apparent that at this stage, the acquisition of the Company’s shares by LOGOS remained nothing more than a mere possibility. (b) Second, I was not able to fully accept Mr Pereira’s assertion that “the Company would have about $13.7 million of funds”, if it were able to sell its diving system for US$3m and its shares for a potential $9.7m. I had doubts as to whether the Company would still be able to sell its shares for $9.7m to LOGOS or other potential investors if its diving system were to be sold off separately. I further noted that Mr Pereira only averred that there was “interest” in the diving system and not an actual offer. The letter from Meds Offshore Group Sdn Bhd dated 1 February 2017 indicated that there was an “intention in principle”, and that the deal was subject to various conditions the fulfilment of which were beyond Mr Pereira’s control. Therefore, the sale of the diving equipment, based on the evidence before me, was also not more than a mere possibility. (c) Third, the letter from JTC dated 9 November 2016 did not in fact express that JTC had “agreed to expand the scope of authorized use of the premises beyond that of diving support services” as Mr Pereira stated. More accurately, JTC only stated that it was “prepared to considerallowing [the Company] to extend the approved use [of the Company’s premises] to include other manufacturing activities but not logistics operation[s]” [emphasis added]. Further, JTC added the caveat that this was “subject to the clearance of other relevant government agencies.” This did not amount to a definite undertaking or agreement by JTC to expand the scope of authorised use of the Company’s premises. It also did not lead to the conclusion that the Company would be able to secure the LOGOS offer or other offers of comparable value. 32 For these reasons, I was not convinced that the “new circumstances” raised by Mr Pereira showed that there was a reasonable prospect of the Company being able to satisfy its debt to UOB. Further, there was much uncertainty about the time required for the Company to resolve its issues and to secure the various agreements being negotiated. In this regard, I noted that before the AR, Mr Pereira had asked for a stay until 31 March 2017. Before me, this requested stay was extended to May 2017. This would be close to a year after the commencement of the mortgage action. This did not appear to be the short reprieve contemplated inHong Leong Finance, even if that case was applicable. 33 I should add that I failed to see how UOB’s application for the JM of the Company, and its continued support for the extension of the JM order, furthered Mr Pereira’s arguments that the Company had a reasonable prospect of paying its debt. As a starting point, an application for JM may be made by a creditor if it considers that the subject company “is or will be unable to pay its debts”: s 227A(a) of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”). This requirement would go against an assessment that, at the time of application, the Company has a reasonable prospect of satisfying its debts. Further, while a creditor has to consider that there is a reasonable probability of rehabilitating the company or preserving all or part of its business as a going concern or that otherwise the interests of creditors would be better served than by resorting to a winding up (s 227A(b) of the Companies Act), I did not see how a belief in any of these matters (including a belief in a reasonable probability of rehabilitating the Company) necessarily supported a finding that the Company had a reasonable prospect of satisfying its debts. To round off, in making an order for JM, the court has to be satisfied that the company “is or will be unable to pay its debt” (s 227B(1)(a) of the Companies Act), and that the order would be likely to achieve one or more of the stipulated purposes under s 227B(1)(b) of the Companies Act,ie, the survival of the company or the whole or part of its undertaking as a going concern; the approval of a compromise or arrangement; and/or a more advantageous realisation of the company’s assets than on a winding up. Again, the fact that a company is or continues to be under JM does notipso factoindicate a reasonable prospect of the company paying its debts. 34 To conclude, even if the court had the discretion to grant a stay of execution, there was insufficient basis for UOB to be denied of its rights and remedies against Mr Pereira as the guarantor for the Company’s debts.",
        "Whether there was any other reason to grant a stay of execution": "35 There were a few other points raised by the parties which I considered and will now briefly address. 36 First, counsel for Mr Pereira argued that UOB should enforce its debt directly against the Company because the estimated $5.4m in proceeds from the sale of the Toh Crescent Property would not suffice to fully discharge the debt owed to UOB, whereas the proceeds from the sale of the Company’s shares and diving system might. Further, the prejudice to UOB of a further stay of execution would be negligible compared to the irreparable prejudice to be suffered by Mr Pereira and his daughter if they had to vacate the Toh Crescent Property. 37 In my view, neither argument justified a further delay to UOB taking possession of the Toh Crescent Property. As stated above, UOB had the right to proceed against Mr Pereira, even if the sale proceeds of the Toh Crescent Property might not fully discharge the underlying debt. While I appreciated that the stability of having the family home was important, this had been taken into account when the initial stay of execution was ordered by the AR. Ample time had also been given for Mr Pereira and his family to vacate the premises, and to make alternative arrangements. 38 Next, I noted UOB’s assertion that Mr Pereira had behaved unconscionably by taking advantage of the order for possession to resume occupation of the Toh Crescent Property after Mdm Faridah moved out, and by deliberately delaying the filing of the stay application in order to buy himself more time. Mr Pereira disputed these allegations and provided his explanations in the Further Affidavit. I did not find it necessary to make any finding on these allegations.",
        "Conclusion": "39 To conclude, UOB was entitled to proceed against Mr Pereira as the guarantor for the Company’s debt, regardless of the Company’s prospects of being able to satisfy its debt to UOB. In any event, the “new circumstances” raised by Mr Pereira did not demonstrate that there was a reasonable prospect that the Company would in fact be able to satisfy its debt to UOB. For these reasons, I saw no basis to grant a further stay of execution of the order for possession. Accordingly, I dismissed the appeal. I ordered costs of the appeal to be fixed at $2,500 with reasonable disbursements to be paid by Mr Pereira to UOB. Hoo Sheau PengJudicial Commissioner Kang Weisheng, Geraint Edward and Seah Zhen Wei Paul(Tan Kok Quan Partnership) for the plaintiff;Joseph Ignatius, Chong Xin Yi and Yeo Mui Lin (Yang Meilin)(Ignatius J & Associates) for the first defendant."
    }
}