{
    "case_title": "Prometheus Marine Pte Ltd",
    "ncitation": "[2017] SGHC 36",
    "coram": "Kannan Ramesh JC",
    "sections": {
        "Introduction": "1 This was a dispute regarding the validity of an arbitral award. Originating Summonses Nos 429 (“OS 429”) and 430 of 2016 (“OS 430”) (collectively “the Applications”) were applications by Prometheus Marine Pte Ltd (“the Plaintiff”) to set aside the arbitral award dated 5 April 2016 (“the Award”) issued in ARB No 24 of 2013 (“the Proceedings”). The Plaintiff was the Respondent and Ann Rita King (“the Defendant”) was the Claimant in the Proceedings. The Proceedings were administered by the Singapore International Arbitration Centre (“SIAC”) under its rules of arbitration. 2 OS 429 was filed under s 48(1) of the Arbitration Act (Cap 10, 2002 Rev Ed) (“the AA”) and OS 430 was filed under s 24 of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the IAA”). The reason that two separate applications were filed was principally because the Plaintiff took the position that the Award was flawed by reason of the Arbitrator’s failure to determine whether the AA or the IAA applied. The Plaintiff claimed that it was therefore unable to ascertain the statutory instrument under which it should make the application to set aside the Award. However, the Plaintiff accepted, correctly in my view, that there was no material difference between the substantive positions under the two instruments as regards the issues at hand. 3 Several other applications were made in the course of the proceedings, namely: (a) Originating Summons No 386 of 2016 (“OS 386”), an application by the Defendant for leave to enforce the Award pursuant to s 46 of the AA; (b) Originating Summons No 431 of 2016 (“OS 431”), an application by the Plaintiff for leave to appeal the Award on points of law; (c) Summons No 2089 of 2016 (“SUM 2089”), an application by the Plaintiff in OS 386 to,inter alia, set aside the Order of Court dated 19 April 2016 granting the Defendant leave to enforce the Award; (d) Registrar’s Appeal No 198 of 2016 (“RA 198”), an appeal by the Plaintiff against dismissal of its application for an extension of time to file an affidavit in SUM 2089; (e) Summons No 3709 of 2016 (“SUM 3709”), an application by the Defendant in OS 386 for security for costs to be provided by the Plaintiff; and (f) Summonses Nos 4280 and 4281 of 2016 (“SUM 4280” and “SUM 4281” respectively) (collectively “the Amendment Applications”), applications by the Plaintiff for leave to amend OS 429 and OS 430 by introducing a new prayer for the court to determine, if necessary, whether thelex arbitriof the arbitration proceedings was the IAA or the AA. 4 I allowed the Amendment Applications by consent. It was agreed that it was unnecessary for me to address RA 198 for the time being. It was also agreed that I should deal with the Applications first as that would be dispositive of the issues between the parties. 5 I dismissed the Applications and delivered detailed oral grounds. The Plaintiff appeals my decision. These are the full grounds of my decision.",
        "Facts": "",
        "The parties": "6 The Plaintiff is a company incorporated in Singapore. It is in the marine engineering and yacht brokerage business, and is involved in yacht charter, yacht support and management and marina development. 7 The Defendant is a British national. She is the managing director of Mont D’Or Petroleum Singapore Pte Ltd, the regional office of Mont D’Or Petroleum Limited, a company which has its business in,inter alia, oil production in Indonesia. Pertinently, the Arbitrator found her not to have a habitual place of residence in Singapore. This is of relevance to whether the Proceedings were to be regarded as an international or domestic arbitration.",
        "Background to the dispute": "8 The Defendant contracted to purchase a yacht from the Plaintiff by way of a signed sale and purchase agreement entitled “Order Contract”, dated 21 February 2011 and numbered PM 010-2010 (“the Contract”). The Contract provided for the sale of a Clipper Cordova 60 (Hull #5) (“the Yacht”) at a total purchase price of USD 1,358,664. The Yacht was later named theSante.The Contract also provided at Clause 12 of its Terms and Conditions that any “dispute or difference arising out of or in connection with the contract shall be referred to and determined by arbitration at Singapore International Arbitration Centre and in accordance with its Domestic Arbitration Rules”. The Contract is governed by the law of Singapore. 9 The Yacht was manufactured by Clipper Motor Yachts International Ltd (“Clipper”), a company incorporated in Belize, and built by Ningbo FuHua Shipbuilding Industry Co Ltd (“the Shipyard”), a shipyard incorporated in China. 10 The Yacht was due to be delivered to the Defendant in June 2012. On 10 June 2012, the Yacht was being prepared for shipment to Singapore from Bailin, Ningbo, China. In the course of being lifted by a shipping cradle for loading onto a barge, the Yacht and cradle fell onto the wharf. The portside of the shipping cradle hit the concrete floor below and as a result the Yacht was extensively damaged (“the 10 June 2012 Incident”). 11 The Defendant engaged Mr Donald Richard Lamble, a maritime surveyor from Marine Surveys & Engineering Services Ltd to survey the Yacht. The parties agreed that the Plaintiff would repair the Yacht at its own cost and to Mr Lamble’s satisfaction. Mr Lamble surveyed the Yacht on 13 and 14 June 2012 and produced a report dated 16 July 2012 which identified a preliminary list of 19 items of damage resulting from the 10 June 2012 incident (“the Lamble Damage Report”). Following the 10 June 2012 Incident, the Plaintiff made repairs to the Yacht which purportedly addressed the defects enumerated in the Lamble Damage Report. 12 On 25 July 2012, the Yacht was delivered to the Defendant purportedly repaired. After the Yacht was delivered, Mr Lamble conducted a further inspection of the Yacht in Singapore and prepared another report enumerating 120 defects (“the Lamble Defects List”). Dissatisfied with the repairs done by the Plaintiff, the Defendant brought the Yacht to Phuket, Thailand for further assessment and repairs on 24 August 2012 at her own cost. The Defendant engaged Siam Surveyors International for this purpose. 13 Siam Surveyors International surveyed the Yacht on 7 and 8 September 2012 and prepared a comprehensive inspection report of the Yacht on 9 September 2012 (“the Siam Surveyors Report”). The Siam Surveyors Report identified an additional 109 defects and concluded that the Yacht did not meet the requisiteConformité Européenne(“CE”) standards for sailing and docking in Europe, did not meet the requisite International Organization for Standardization (“ISO”) standard, was not CE Category A compliant and was not fully in conformity with Recreational Craft Directive (“RCD”) 94/25/EC. The Yacht underwent repairs in Phuket, at the Defendant’s expense, to address the defects enumerated in the Lamble Defects List and the Siam Surveyors Report. 14 On 23 January 2013, the Defendant commenced the Proceedings against the Plaintiff, claiming damages for breach of the following contractual terms, that: (a) the Yacht would conform to the written description in the Contract (“the Specifications Term”); (b) the Yacht would be a new vessel (“the New Vessel Term”); (c) the Yacht would be suitable for use as a high quality place of residence (“the Residence Term”); (d) the Yacht would be suitable for sailing in Europe and docking at ports in Europe (“the European Compliance Term”); (e)  the Yacht would (i) meet the requisite ISO Standard; (ii) be CE Category A compliant; and (iii) fully conform with RCD 94/25/EC (“the Marine Standards Term”); (f) the Yacht would correspond with the description of the vessel in the contract, as implied by s 13 of the Sale of Goods Act (Cap 393, 1999 Rev Ed) (“the Correspondence with Description Term”); (g) the Yacht would be of satisfactory quality, as implied by s 14 of the Sale of Goods Act (“the Satisfactory Quality Term”); and (h) the Yacht would be fit for its intended purposes, as implied by s 14 of the Sale of Goods Act (“the Fit for Purpose Term”). 15 The Defendant also sought damages for: (a) the Plaintiff’s alleged breach of the agreement to repair the Yacht at its expense and to the satisfaction of Mr Lamble (“the Repair Contract”); (b) the Plaintiff’s alleged breach of what the Defendant termed “the Collateral Contract”, which essentially comprised the Residence Term, the European Compliance Term and the Marine Standards Term; and (c) the Plaintiff’s alleged misrepresentations as to the Residence Term, the European Compliance Term and the Marine Standards Term, which the Defendant claimed had induced her to enter into the Contract. 16 In the course of the Proceedings, the Plaintiff disputed the Arbitrator’s jurisdiction, arguing that it was not the true seller but instead had contracted with the Defendant as an agent for Clipper, the principal (“the jurisdictional objection”). It also argued that the terms sought to be implied by the Defendant under the Sale of Goods Act (Cap 393, 1999 Rev Ed) (“the SGA”) did not form part of the Contract, and denied breach of the other contractual terms asserted by the Defendant. 17 The Arbitrator issued the Final Award on 5 April 2016. The Arbitrator generally found in the Defendant’s favour and ordered that the Plaintiff pay the Defendant damages and the full costs of the arbitration. The Arbitrator also found against the Plaintiff on the jurisdictional objection, ruling that the Contract was between the Plaintiff and the Defendant. 18 On 19 April 2016, the Plaintiff filed the Applications seeking to set aside the Award.",
        "The Award": "19 The Arbitrator dismissed the Plaintiff’s jurisdictional objection, finding that the evidence did not support the Plaintiff’s argument that it had contracted as Clipper’s agent. The Arbitrator found that the remuneration arrangements between the Plaintiff and Clipper pointed towards a buyer-seller or dealer-manufacturer relationship rather than an agency relationship. 20 The Arbitrator went on to consider the merits of the case. He found that the Plaintiff had breached the Specifications Term, the New Vessel Term and its obligation to ensure CE Category B certification for the Yacht. 21 However, the Arbitrator found that the Residence Term, the European Compliance Term and the Marine Standards Term (“the oral terms”) were not terms of the Contract. The Defendant alleged that these had been orally agreed between the parties. However, the Arbitrator noted that Clauses 2 and 3 of the Contract prevented the application or inclusion of any other terms not contained in the Contract except in writing. 22 Similarly, the Arbitrator found that the Correspondence with Description Term, Satisfactory Quality Term and Fit for Purpose Term, sought to be implied by the Defendant under ss 13 and 14 of the SGA, were excluded by Clause 10(f), which disclaimed all express or implied warranties not contained in the Contract. This exclusion was unaffected by the Unfair Contract Terms Act (Cap 396, 1994 Rev Ed) as the Contract was an “international supply contract” within the meaning of s 26 of the said Act. At any rate, the Correspondence with Description Term need not be implied as it overlapped with the Specifications Term. 23 In light of the Arbitrator’s finding that the oral terms were not terms of the Contract, the Collateral Contract, Repair Contract and misrepresentation issues did not arise for determination. 24 The Arbitrator awarded the Defendant the following: (a) damages of US$269,701.11, representing the cost of the repairs necessary to render the Yacht compliant with the Specifications Term; (b) damages of US$95,106.48 for the Yacht’s diminution in value as a result of the breach of the New Vessel Term; (c) damages of US$10,000, representing the cost of obtaining CE Category B certification for the Yacht; (d) all the Defendant’s legal costs and expenses, in the sum of US$572,596; and (e) the total costs of the arbitration amounting to S$62,908.81.",
        "The Plaintiff’s submissions in OS 429 and 430": "25 The Plaintiff marshalled a litany of complaints against the Award, most of which were clearly unmeritorious. I got the distinct impression that the Plaintiff trawled for every conceivable argument it could find in order to fashion an all-out assault to impugn the Award, ditching in the process any regard for their sustainability. 26 First, the Plaintiff reiterated the jurisdictional objection. 27 Second, the Plaintiff argued that the Award should be set aside for exceeding the scope of the submission to arbitration under s 48(1)(a)(iv) of the AA or Article 34(2)(a)(iii) of the UNCITRAL Model Law on International Commercial Arbitration (“the Model Law”), breaching the rules of natural justice under s 48(1)(a)(vii) of the AA or s 24(b) of the IAA and/or the Plaintiff having been unable to present its case pursuant to s 48(1)(a)(iii) AA or Article 34(2)(a)(ii) of the Model Law, as a result of the Arbitrator: (a) reformulating and/or re-characterising the Defendant’s claim as regards the Correspondence with Description Term; (b) awarding damages to the Defendant for the Yacht’s diminution in value; (c) awarding damages to the Defendant for the Plaintiff’s failure to ensure the Yacht’s compliance with CE Category B; and (d) awarding damages to the Defendant for the Plaintiff’s failure to repair hidden or latent defects. 28 Third, the Plaintiff alleged that the Arbitrator breached the rules of natural justice by,inter alia: (a) failing to consider the Plaintiff’s evidence and submissions regarding the jurisdictional objection, the contractual exclusion of the Plaintiff’s liability (if any) and the Defendant’s true motives in commencing the Proceedings; (b) failing to give the Plaintiff an opportunity to address the Arbitrator on the Defendant’s loss and damage claim for contractual breach as reformulated and/or re-characterised by the Arbitrator; and (c) failing to give the Plaintiff an opportunity to address the Arbitrator on the appropriate computation of maintenance costs. 29 Fourth, the Plaintiff argued that the Arbitrator made findings which were “contrary to public policy and/or in conflict with the public policy of Singapore”. In support of this argument it alleged that the Arbitrator failed to determine thelex arbitriand listed 18 findings, both factual and legal, which it claimed to be erroneous and/or contradictory. 30 Fifth, the Plaintiff argued that its submissions regarding the foregoing issues collectively gave rise to justifiable doubts as to the Arbitrator’s impartiality. 31 A particularly apt illustration of the Plaintiff’s scattergun and indiscriminate approach to challenging the Award was its attempt to introduce allegations of fraud and corruption against the Arbitrator in the course of the proceedings before me. Around a month after filing its written submissions, the Plaintiff made a new submission without leave or any forewarning by way of a letter dated 28 September 2016, alleging that the Arbitrator had been fraudulent or corrupt. This was an allegation that had not reared its head in the affidavits filed in support of the Applications, and was therefore completely unsupported by any evidential substratum. I found all of this quite unpalatable.  No explanation was offered as to why the allegation had not been made earlier. On 14 October 2016, I directed that Mr Pickering, the Plaintiff’s principal deponent, set out the evidential basis for the allegation of fraud or corruption in an affidavit. Also, I drew counsel for the Plaintiff’s attention to relevant case authorities on the threshold for proof of fraud or corruption, and the undesirability of advancing a case that was unsupported by evidence. The Plaintiff subsequently wisely decided to withdraw the submission.",
        "The Defendant’s submissions in OS 429 and 430": "32 Counsel for the Defendant argued that the Plaintiff’s allegations were unsustainable. 33 As regards the alleged excess of jurisdiction, the Defendant argued that the Arbitrator had simply determined the very issues which had arisen in the pleadings and stated in the Statement of Issues. For example, the Correspondence with Description Term and CE Category B compliance fell within the scope of the Specifications Term, which had been pleaded and which the Plaintiff itself addressed in its submissions. 34 As regards the alleged breach of the rules of natural justice, the Defendant argued that the Arbitrator had fully considered the Plaintiff’s submissions. The Defendant submitted that the Award need not expressly address each point made by the Plaintiff, and identified various passages in the Award dealing with the Plaintiff’s arguments in the round on the issues in question. 35 Regarding the alleged contrariness to public policy, the Defendant argued that the Plaintiff had failed to identify which public policy imperative the Award purportedly breached. The Defendant submitted that this failure was fatal to the Plaintiff’s argument. Moreover, the grounds relied on by the Plaintiff which were allegedly contrary to public policy fell short of the typical recognised examples of breaches of public policy, such as bribery, corruption and fraud.",
        "Issues to be determined": "36 The issues before me were as follows: (a) whether the Plaintiff had contracted as Clipper’s agent and was therefore not party to the arbitration agreement; (b) whether the Arbitrator had exceeded his jurisdiction by reformulating the Defendant’s claims and/or awarding damages for the Plaintiff’s breach of the New Vessel Term and failure to secure CE Category B compliance; (c) whether the Arbitrator had breached the rules of natural justice by failing to invite submissions from the Plaintiff and/or consider the Plaintiff’s submissions; (d) whether the Award was contrary to public policy; and (e) whether there was actual or apparent bias on the Arbitrator’s part.",
        "Issue 1: Whether the Arbitrator had jurisdiction to hear the dispute": "37 It is trite that the court undertakes ade novoexamination of the evidential matrix when considering a challenge that the Arbitrator did not have jurisdiction:Sanum Investments Ltd v Government of the Lao People’s Democratic Republic[2016] 5 SLR 536 at [41]–[42];AQZ v ARA[2015] 2 SLR 972 at [49]. 38 In the present case, the Plaintiff resuscitated substantially the same arguments before me as it had raised before the Arbitrator, namely, that it was not party to the Contract as it had acted as agent, not principal, in the sale of the Yacht. The true seller and therefore the contractual counterparty to the Defendant was allegedly Clipper, the Yacht’s manufacturer. The Arbitrator had rejected this argument, ruling that the Plaintiff had contracted with the Defendant to sell the Yacht and was accordingly bound by the arbitration agreement. 39 Having examined the evidence, I was satisfied that the Arbitrator’s conclusion was correct. A constant refrain in the Plaintiff’s submissions was that the court should examine the contractual matrix to ascertain who the contracting parties were. While that might be true, that submission shied away from what I believe was really at the core of the inquiry before me and offered a clear pointer to the correct conclusion on the issue. That in my view was the written contract between the parties,ie,the Contract. The Contract encapsulated the arbitration agreement, and therefore ascertaining the parties to the Contract would also be determinative of who the parties to the arbitration agreement were.",
        "The terms of the Contract": "40 It was the Plaintiff’s position in the Proceedings and before me that the Contract set out the terms of the contract between the parties. It is important to remember that the Contract was a standard form contractof thePlaintiff, containing printed terms and conditions of sale formulated by the Plaintiff and issued on its letterhead. The letterhead only stated the Plaintiff’s address and contact details and made no reference whatsoever to Clipper. It was a document prepared by the Plaintiff for the purpose of setting out the terms upon which it would sell yachts. It could not therefore be said that it was not intended to capture the true nature of the Plaintiff’s relationship with its contractual counterparties. The standard terms were accompanied by three annexures, titled “Options”, “Appendix 1” and “Appendix 2”, which set out the specifications and additional equipment that were to be installed in the Yacht prior to delivery. It was clear from a review of the terms of the Contract, in particular the printed terms, that the Plaintiff was the seller of the Yacht. The Plaintiff was repeatedly and regularly described as the “seller” with no reference whatsoever to Clipper acting as the principal or the Plaintiff acting as its agent. This was telling. 41 Specifically, the first page of the Contract required two signatures: one by the purchaser (ie, the Defendant) and one “on behalf of ProMetheus Marine Pte Ltd”. Clipper’s signature was not required. Clause 1 of the printed terms identified the Plaintiff as “the Seller”. Indeed, the entire structure and tenor of the standard terms was predicated on the Plaintiff being the seller, for example: (a) Clause 1 stated, “The obligations of ProMetheus Marine (hereinafter called “The Seller”) shall be only upon and subject to these terms and conditions.” (b) Clauses 2 and 3 prohibited variation to the Contract save by the Plaintiff’s express agreement in writing. (c) Clause 3 further stated that only the Plaintiff (or a Director or authorised Broker thereof) – and no third party – could “assume any liability or obligations” under the Contract or vary its terms. (d) Clause 4 entitled the Plaintiff to sue for damages and sell the vessel in the event that the purchaser cancelled the order or failed to proceed with the Contract. (e) Clause 10(d) stated that the Plaintiff “does not authorize any other person, to assume for the company… any liability or expense” as regards defective parts of the vessel and/or the repair thereof. (f) Clause 13 entitled the Plaintiff to terminate the Contract by notice in writing in the event that the Defendant were to become bankrupt or enter into any composition or arrangements with her creditors. 42 Evidently, it was the Plaintiff rather than Clipper who acquired the relevant rights, obligations and liabilities under the Contract. In particular, Clause 4 catered for the right to bring an action for damages in the event of cancellation by the purchaser on the Plaintiff. The Plaintiff was not expressly obligated to consult Clipper or obtain its authorisation prior to varying the contractual terms, terminating the Contract or selling the vessel to a third party should the purchaser discontinue the purchase. In fact, the Contract and annexures made absolutely no reference to Clipper (save in the description of the Yacht as a “Clipper Cordova 60”, which in and of itself did not assist the Plaintiff’s cause). 43 That being the case, the Plaintiff’s submission that it was acting as Clipper’s agent appeared contrived and frankly inarguable. The submission begged the obvious question: why was the Contract not crafted to say exactly that, especially bearing in mind that these were printed standard terms of contract? If the Plaintiff contracted in the ordinary course of business as Clipper’s agent, then the Plaintiff and Clipper would surely have drafted their standard terms of contract to explicitly state that relationship. Care would surely have been taken to ensure that this was made crystal clear. It would have been entirely in the Plaintiff’s interest to have ensured that. Otherwise, liability for shortfall in performance would vest in the Plaintiff.  It bears emphasising that it would have been a relatively straightforward matter for the standard terms to have been drafted to reflect Clipper as the principal and the Plaintiff as the agent. Instead, the Contract strongly suggests that the Plaintiff, and no other, was the true seller. The Plaintiff offered no explanation for the dissonance between the terms of the Contract and the alleged principal-agent matrix underlying the Contract. Nor did it offer any explanation as to why the standard terms were not amended at the time of contracting to reflect the fact that the Plaintiff was acting as Clipper’s agent only. It would have been a matter of relative ease for the Plaintiff to denote on the Contract, when executing it, that it was doing so as Clipper’s agent. This was not done. Again, no explanation was offered. 44 The Plaintiff’s witnesses did not assist it in this regard. Neither Mr Alan John Pickering, the Plaintiff’s principal witness in the proceedings, nor Mr Mark Campion, one of Clipper’s founding partners and its former shareholder, addressed the dissonance between the terms of the Contract and the alleged principal-agent relationship between Clipper and the Plaintiff. Given Mr Campion’s position that the Plaintiff was Clipper’s agent, this omission was glaring in my view. Equally glaring was the Plaintiff’s failure to produce in evidence the terms of its relationship with Clipper. Surely that would at the very least have lent credibility to the Plaintiff’s assertion that it was Clipper’s agent, notwithstanding the language of the Contract. The evidential record was conspicuously missing this vital piece of documentary evidence. In this regard, Mr Campion testified in the Proceedings that there was no written agreement between Clipper and the Plaintiff. However, I found it very strange that the two companies would have totally neglected to set out the terms of the purported agency relationship, especially since these terms would have been extremely important in determining the apportionment of liability between the two companies vis-à-vis third party purchasers. It must be remembered that the product being sold was a high value item – yachts. Surely that would have warranted documenting the relationship. I also found it telling that Clipper did not come forward to assert that it was the principal. It seemed quite inconceivable that Clipper would leave the Plaintiff high and dry if it was indeed an agent. In fact, the contrary was true – see [53] and [54] below. 45 I do not mean to say that an agency relationship can never be found to exist unless explicitly stated in the contract between the purported agent and the third party. The point rather is that if an agency relationship had truly existed on the facts of this case, one would have every reason to expect the Contract to reflect this. That it was not so reflected detracts from the credibility of the agency argument, particularly as no written terms of the agency relationship between Clipper and the Plaintiff were adduced. I therefore not only found the Plaintiff’s argument unmeritorious but also factually difficult to shoehorn into the language of the Contract. I note that even if Clipper had been the Plaintiff’s undisclosed principal, the Plaintiff would remain personally liable to the Defendant under the Contract and the analysis would be unchanged:Law Relating to Specific Contracts in Singapore(Steven Chong & Cavinder Bull, eds) (Sweet & Maxwell Asia, 2nd Ed, 2016) at para 1.8.3.",
        "Payment arrangement between Clipper and the Plaintiff": "46 In the Proceedings, Mr Campion had testified as to the payment arrangements between Clipper and the Plaintiff. His testimony is set out at [96] of the Award and is partly reproduced here in light of its importance: ARBITRATOR: Just tell me, ProMetheus and them, what is your arrangement? A. The arrangement is they introduce clients to us and we give them a fixed price on that and they make a commission from it. ARBITRATOR: You give them a fixed price, meaning you tell them what the price is? A. Dealer price is, yes. ARBITRATOR: And then? If they sell it for more, who keeps the money? A. They can keep the profit from that if – ARBITATOR: They can keep the difference? A. That’s correct. ARBITRATOR: Whatever price they sell it? Vis-à-vis you, there is no fixed sum, and it’s for him to decide whatever sum he sells – A. That’s correct, that’s correct. ARBITRATOR: In addition to that, is there a commission that you pay? A. No. ARBITRATOR: So it’s a price differential? A. It’s a price differential. 47 In other words, Clipper would sell the vessel to the Plaintiff at a fixed price. The Plaintiff was given full liberty to determine the price at which it resold the vessel to a client, and would retain whatever profit it acquired from resale. There was, as it were, no fixed agency fee or commission. The Arbitrator considered that this arrangement was not consistent with a principal-agent relationship and instead accorded with a buyer and seller relationship. The Plaintiff did not produce any documents to suggest that this payment arrangement had been agreed between itself and Clipper as part of the terms of their relationship. 48 The Plaintiff criticised the conclusion that the Arbitrator drew from Mr Campion’s evidence. It citedLiu Wing Ngai (trading as Kam Wah Ultrasonic Engineering Co) v Lui Kok Wai (trading as Almac Machinery)[1997] 1 SLR 559 (“Liu Wing Ngai”) for the proposition that the practice of setting a minimum price and allowing the agent to keep the difference on resale is not inconsistent with an agency relationship. 49Liu Wing Ngaiwas a case with a very different factual complexion. There, a dispute had arisen between the plaintiff, a Hong Kong-based manufacturer of ultrasonic cleaning and degreasing machines, and the defendant, a Singapore-based salesman. The plaintiff had met the defendant in March 1990 and they had entered into an oral business agreement, the nature of which was disputed. Following this agreement, the plaintiff sold a number of machines to Singapore and Malaysia through the defendant. The plaintiff subsequently sued the defendant for unpaid sums on those sales. In his defence, the defendant argued that he was the plaintiff’s agent in Singapore and Malaysia for the sale and marketing of the machines, rather than the purchaser. The court concluded that the defendant was indeed the plaintiff’s agent, even though he had determined his own level of profit by marking up the price of sale to Singaporean and Malaysian customers. 50 Read in context,Liu Wing Ngaisimply states that the payment arrangement which subsisted between the parties does notipso factonegate a principal-agent relationship. As the court there acknowledged at [57], a payment arrangement of this nature remains an “important consideration” and “anindiciaof a buyer-seller relationship”. However, inLiu Wing Ngai, the payment arrangement between the parties was outweighed by countervailing evidence of the parties’ agency relationship. Notably, when the parties entered into the oral agreement in March 1990, the plaintiff knew that the defendant was financially incapable of purchasing machines from him. On numerous occasions, the plaintiff referred to the defendant as his “agent” for Singapore and Malaysia in correspondence with the defendant and with third parties. One of the machines was labelled with the plaintiff’s trade name, beneath which the defendant’s trade name was stated as its “Singapore agent”. The plaintiff admitted that he made use of the defendant because it was hard for him to personally keep in touch with buyers in Singapore and Malaysia. The plaintiff also manufactured a large proportion of the machines to the buyers’ specifications. He personally discussed these specifications with the buyers and later sold the machines to the defendant. The court found that the plaintiff had visited Singapore and Malaysia to commission the machines. 51 By comparison, there was a total dearth of evidence implying a principal-agent relationship in the present case. The facts here are important. No effort was made by the Plaintiff or Mr Campion to explain why the payment arrangement between the Plaintiff and Clipper was organised in this manner. Indeed, the payment arrangement was entirely consistent with a distributor relationship. Three features were particularly pertinent. First, the Plaintiff bought at a fixed price. Second, the Plaintiff sold at a price that only it determined. Third, the Plaintiff did not receive a commission but kept the difference between the price it paid to Clipper and the price it received from its buyer. The arrangement was tantamount to a resale by the Plaintiff of yachts purchased from Clipper. No written terms of an agency relationship were produced and I was unable to discern such a relationship from the notes of evidence of the Proceedings, the submissions that were presented there and the affidavits filed in the present Applications. Again, the evidence in this regard was glaringly inadequate by reason of the absence of a written agreement between the Plaintiff and Clipper. 52 On the contrary, various other factors collectively suggest that the purported principal-agent relationship was nothing more than an afterthought. In the aftermath of the 10 June 2012 Incident, the Plaintiff undertook repairs to the Yacht instead of disavowing responsibility on the basis that Clipper was the true contracting party. The allegation that the Plaintiff was not the true contracting party surfaced for the first time in Mr Pickering’s witness statement in the Proceedings. Had this been true, it ought to have been the foremost point raised in response to the Defendant’s attempt to arbitrate for obvious reasons. However, the Plaintiff did not allege this in its Response to the Defendant’s Notice of Arbitration (14 February 2013) or its Defence (17 May 2013). Nor did the agreed Statement of Issues for the arbitral proceedings list any such issue for determination. In this regard, I note that the Plaintiff was advised at all material times by solicitors and the omission of such an important point is conspicuous. 53 Clipper also denied any suggestion that the Plaintiff was its agent. On 7 August 2012, the Defendant had voiced her concerns about the defects in the Yacht to Mr Campion and Mr Darren Berry by email. Mr Campion and Mr Berry were the founding 50% partners of Clipper and Mr Campion had transferred his shares in Clipper to Mr Berry during the building of the Yacht. At the time of the email, Mr Berry was Clipper’s CEO. He replied on 8 August 2012: Anne as you are aware your contract for the build of your boat isbetween you and Alan from Prometheus Marine, Singapore[…] As your contract isbetween yourself and Alan, I would ask that we all adhere to the original contract and let Alan take care of all issues with commissioning your boat. […] [emphasis added] 54 Similarly, in response to the Defendant’s letter of demand sent to Clipper on 17 August 2012, Clipper took the position that the Plaintiff had contracted with the Defendant in its own right rather than as Clipper’s agent. It was therefore not surprising that Clipper, despite being the purported contracting party, did not come forward to assert that it was the seller, preferring instead to leave its purported agent, the Plaintiff, to defend the Proceedings. While Mr Campion testified for the Plaintiff, he could not have spoken for Clipper, having left Clipper by the time of the hearing. 55 On the present facts, I found that the Arbitrator was correct to conclude that the Contract was between the Plaintiff and the Defendant, and that the Plaintiff contracted in its own capacity rather than as Clipper’s agent. As the arbitration agreement was encapsulated in the Contract, the same conclusion applied as regards that agreement. I therefore found that the Arbitrator did have jurisdiction over the parties to the dispute.",
        "Issue 2: Whether the Arbitrator acted in excess of jurisdiction": "56 In determining whether the Arbitrator determined matters beyond the scope of the submission to arbitration, it is trite that mere errors of law or even fact are insufficient to warrant a setting aside. Rather, the crucial question in every case is whether there has been “real or actual prejudice” to the parties:CRW Joint Operation v PT Perusahaan Gas Negara (Persero) TBK[2011] 4 SLR 305 at [32]. I found that the Arbitrator acted fully within his jurisdiction in determining the issues in dispute.",
        "Purported reclassification of the Defendant’s claim": "57 The Plaintiff made much of the Arbitrator’s purported reclassification of part of the Defendant’s claim, arguing that the Arbitrator’s finding with regard to the Correspondence with Description Term constituted a “radical departure from the parties’ pleaded cases”. 58 Essentially, the Defendant had sought to imply a term into the Contract to the effect that “the Santé would corresponds [sic] with the description of the vessel in the Contract for Sale” (the Correspondence with Description Term), pursuant to s 13 of the SGA. Section 13(1) of the SGA states: “Where there is a contract for the sale of goods by description, there is an implied condition that the goods will correspond with the description.” The Arbitrator dealt with this submission succinctly at [116] of the Award, which I reproduce in full: In the Arbitrator’s view, the Correspondence with Description Terms need not be implied into the Contract. The Parties had by setting out the terms and conditions in the Contract and by agreeing to such specifications required by Mrs. King and agreed to by the Respondent, made them “express” terms. It is superfluous to further argue that they are implied. 59 The Plaintiff submitted that the Arbitrator had reclassified the Defendant’s claim and thereby exceeded his jurisdiction, as the reclassified claim was not an issue presented by the parties for arbitration. I did not accept the Plaintiff’s submissions. Clearly, all that the Arbitrator was really saying was that the description and specifications of the Yacht had been expressly agreed between the parties as set out in the Contract. That being the case, it was artificial and unnecessary to resort to an implied term. The Correspondence with Description Term need not be implied as it was already encapsulated in the specifications of the Yacht embodied in the Contract, by which the Plaintiff was bound. 60 It is trite that the remit and jurisdiction of the Arbitrator are circumscribed by,inter alia,the pleadings and the Statement of Issues:PTPrima International Development v Kempinski Hotels SA and other appeals[2012] 4 SLR 98 at [34];BLC and others v BLB and another[2014] 4 SLR 79 (“BLC v BLB”). In my view, a formulaic and pedantic approach to construction of the issues should be eschewed in favour of a holistic assessment of the true issues before the Arbitrator. In this regard, the pleadings clearly framed as one of the issues the non-conformity of the Yacht with the contractual description and specifications. 61 The Defendant had pleaded the contractual description and specifications of the Yacht at para 19 of her Statement of Claim, terming these “the Specifications Term”. She described this term as requiring the Plaintiff to supply a vessel conforming with the following description: (a) a new motor yacht manufactured in accordance with King’s specifications; (b) a Clipper Cordova 60 (Hull #5); (c) standard white the hull colour; (d) 3 cabins; (e) engine type Cummins 550 hp; (f) two engines; (g) fitted with an options package to the value of USD$270,164; (h) fitted with a soft furnishing package to the value of USD$12,000; and (i) fitted with a Raymarine package to the value of USD$39,000 62  These features were all expressly agreed upon in the Contract and its annexures. The Arbitrator was therefore, in my view, correct to conclude that the Specifications Term mirrored the Correspondence with Description Term. 63 Admittedly, the Defendant did not specifically plead breach of the Specifications Term, pleading instead breach of the Correspondence with Description Term at para 52 of the Statement of Claim. Nevertheless, the wording of the Statement of Claim made it clear that the substance of the Defendant’s complaint vis-à-vis the Correspondence with Description Term was that the Yacht did not comply with the contractual specifications. She alleged that as the Yacht was found to bear various defects after delivery (those enumerated in the Lamble Defects List and the Siam Surveyors Report), the Plaintiff had breached the Correspondence with Description Term by “[failing] to deliver a motor yacht thatconformed to the description and specifications in the Contract for Sale” (para 52 of the Defendant’s Statement of Claim, emphasis added). This was a clear reference to the Specifications Term as pleaded in para 19 of the Statement of Claim. 64 Evidently, the Defendant’s cause of action was for supplying a Yacht that did not conform to the contractual description and specifications as particularised in the Statement of Claim. Whether this was described as the Specifications Term or the Correspondence with Description Term had no bearing on the substance of the dispute. It is the substance and not the badge that matters. 65 Moreover, the Statement of Issues framed the precise issue that the Arbitrator allegedly reclassified. Paragraphs 1(a) and (f) of the Statement of Issues required the Arbitrator to determine whether the terms of the Contract included the Specifications Term and the Correspondence with Description Term respectively, and whether the same had been breached. In this regard, para 9 of the Statement of Issues was pertinent: Assuming that the terms as recorded in Paragraph 1 above are terms of the Contract for Sale, did ProMarine breach those terms by delivering to King a vessel having the the [sic] damage / defects in the Lamble Damage Report, the Lamble Defects List and the Siam Surveyors Report as pleaded by King in paragraphs 31, 37 and 45 of the Statement of Claim? 66 The Arbitrator was therefore compelled to determine whether these terms had been breached with reference to Lamble Damage Report, the Lamble Defects List and the Siam Surveyors Report. That in substance was the investigation before him. The Plaintiff and Defendant had agreed on the question of the Yacht’s non-conformity with the contractual description and specifications as an issue, and it was therefore squarely before the Arbitrator. It was thus incumbent upon the Arbitrator, and well within his jurisdiction, to determine whether the Plaintiff had indeed failed to deliver the Yacht in accordance with the contractual description and specifications. In no way could the Arbitrator be considered to have reclassified or reformulated the Defendant’s claim in excess of his jurisdiction. 67 Nor did the Plaintiff suffer any prejudice on this account, since it met the Defendant’s claim regarding the Specifications Term head-on in its pleadings and submissions in the Proceedings. For example: (a) In its Defence dated 17 May 2013, the Plaintiff put the Defendant to strict proof of para 19 of her Statement of Claim, in which she had pleaded the Specifications Term. The Plaintiff averred that “[t]he specification of the Santé is set out in the Contract” and claimed that Clause 6 of the Contract permitted it to alter the design and specification relating to the boat without notice. (b) In its Opening Statement dated 31 August 2015, the Plaintiff asserted that the Yacht had been designed, built and sold “in compliance with” the “Specification Term”. (c) In its written Closing Submissions dated 9 October 2015, the Plaintiff reiterated that the Defendant had pleaded breach of the “Specifications Term”, which it understood to mean “The Santé’s specifications (at para 19 of the Statement of Claim)”. It construed the Specifications Term as part of the Satisfactory Quality Term, which was “implied by section 14(2) of the SGA”, and on that basis argued that it had been excluded by Clause 10(f) of the Contract. 68 The Plaintiff therefore had ample opportunity to address – and did address – the Specifications Term.",
        "Damages for diminution in value for breach of the New Vessel Term": "69 Second, the Plaintiff argued that the Arbitrator had exceeded his jurisdiction by awarding damages to the Defendant for the Yacht’s diminution in value. The Plaintiff considered that the Defendant’s claim for damages for diminution in value had been “predicated upon the breach of the terms implied by the [SGA], i.e. the Correspondence with Description Term, the Satisfactory Quality Term and the Fitness for Purpose Term”. Since the Arbitrator had found that these terms were “validly and effectively excluded”, they could not be implied into the Contract. The Plaintiff therefore submitted that the Defendant was not entitled to any damages for diminution in value. 70 The Plaintiff’s argument betrayed a fundamental misunderstanding of the basis of the award of damages. It is clear from the Award at [196] that the Defendant had been awarded damages for diminution in value in respect of the Plaintiff’s breach of theNew Vessel Term, rather than any of the abovementioned implied terms: The Tribunal, however, finds that that [sic] the Respondent had delivered the vessel, Santè, non-compliant with the contractual specifications. The Claimant is thus entitled to: a. damages based on the costs of repairs to put the Santè into the state that would be compliant with the Specifications Term; b.any diminution in value to theSantè for not being a “new vessel” contemplated under the Contract; and c. lack of CE Category B certification and documentation. [emphasis added] 71 The New Vessel Term was not implied by the SGA into the Contract. Rather, the Arbitrator had found at [128] that “[a]lthough the term ‘new’ was never used in the Contract to describe the boat to be built, both Parties appear to accept that the Santè is meant to be a ‘new build’”. This was in line with the Defence filed by the Plaintiff in the Proceedings, in which it had admitted that “the Contract provides for a newly built yacht”. Hence, there was no question of inconsistency between the award of damages for diminution in value and the Arbitrator’s finding that no terms could be implied into the Contract pursuant to the SGA. 72 That suffices to dispose of the Plaintiff’s submission in this regard. For completeness, I add that the Plaintiff would have no basis to allege that the New Vessel Term exceeded the scope of submission to arbitration. Like the Specifications Term, the New Vessel Term had been specifically pleaded by the Defendant at para 22 of her Statement of Claim and addressed by the Plaintiff at para 15 of its Defence. It was discussed at para 7 of the Statement of Issues and the Plaintiff submitted on it at para 1.3.4 of its written Closing Submissions in the Proceedings. Given that the Plaintiff had every opportunity to address this head of claim, I do not see how the Arbitrator could be challenged for exceeding his jurisdiction in awarding damages in this respect. (The New Vessel Term is revisited below under Issue 4.)",
        "Damages for Plaintiff’s failure to secure CE Category B compliance": "73 Third, the Plaintiff argued that the Arbitrator exceeded his jurisdiction by awarding damages to the Defendant for the Plaintiff’s failure to ensure the Yacht’s compliance with the CE Category B standard. The Plaintiff relied on the fact that the Defendant had not expressly pleaded CE Category B compliance as a term of the contract. The Defendant had only referred to CE Category A compliance, at para 25 of her Statement of Claim: 25 It was a term of the Contract of Sale that the Santé would be constructed and sold: (a) of ISO standard; (b) CE Category A compliant; and (c) fully in conformity with Recreational Craft Directive 94/25/EC (the Marine Standards Term), as to ensure the Santé would meet the European Compliance Term. [emphasis in original] 74 The Marine Standards Term was reiterated at para 51 of the Statement of Claim: 51 By reason of the matters set out in the Lamble Defects List and Siam Surveyors report, in breach of the Fit for Purpose Term, the European Compliance Term and the Marine Standards Term, the Santé is not: (a) of ISO standard; (b)  CE Category A compliant; or (c) fully in conformity with Recreational Craft Directive 94/25/EC, and the Santé is not suitable for sailing to Europe or docking at ports in Europe. 75 The Plaintiff correctly recognised that the Arbitrator had found, at [137]–[140] of the Award, that the Marine Standards Term had been excluded by Clauses 2 and 3 of the Contract. As such, the Defendant was not entitled to damages for breach of the Marine Standards Term. However, the Arbitrator did not end his analysis there. He went on to find (at [141] of the Award) that the Yacht ought to nevertheless have been CE Category B compliant, and that the Defendant was liable for it not being so. The Plaintiff therefore argued that the Arbitrator had strayed beyond the scope of the submission to arbitration in reaching his conclusion. 76 Read in context, all that [137]–[140] of the Award amounts to is a finding that the Contract could not incorporate any orally agreed terms as these were excluded by Clause 10(f) of the Contract,ie, the need for terms to be in writing. Since the Marine Standards Term was alleged to have been orally agreed between the parties without written agreement, it was not a term of the contract. However, this finding did not preclude the Arbitrator from coming to the (entirely distinct) conclusion that the Contractexpresslyrequired CE Category B compliance. 77 In this regard, the Arbitrator observed at [139] of the Award that the Options annexed to the Contract showed that the Defendant had paid US$6,500 for “CE Certification”. The Plaintiff had itself accepted at para 18 of its Defence that “the Contract provides for the Yacht to have CE Category B Certification”. CE Category B compliance was therefore one of the express terms of the Contract, and failure to ensure compliance would accordingly have constituted a breach of the Specifications Term. Having considered the evidence, the Arbitrator found that the Yacht was not in fact CE Category B compliant. I note that the Plaintiff did not contest this finding of fact. 78 Given my earlier conclusion at [66] above that it was within the Arbitrator’s jurisdiction to determine any breaches of the Contract arising from the Yacht’s non-compliance with the contractual description and specifications, it was accordingly within his jurisdiction to find the Plaintiff liable for failing to ensure that the Yacht was CE Category B compliant, under the head of breach of the Specifications Term. 79 It is puzzling that the Plaintiff sought to make much of this. It was not contested that the Yacht had to be Category B compliant. It seems clear that it was not in fact so. That being the case, it is axiomatic that there was breach and loss in the form of expenses to be incurred to secure such certification. I therefore saw no merit in the Plaintiff’s submission that the Arbitrator reclassified the Defendant’s claim in excess of his jurisdiction.",
        "Awarding damages for hidden or latent defects": "80 Fourth, the Plaintiff argued that the Arbitrator had exceeded jurisdiction by “awarding damages to the Defendant for the Plaintiff’s failure to repair hidden or latent defects which were discovered during the extended warranty period”. By this I understood the Plaintiff to be essentially disclaiming any liability for those defects in the Yacht which were discovered only after the Lamble Damage Report was published,ie, the defects cited in the Lamble Defects List and the Siam Surveyors Report. The Plaintiff submitted that as the Defendant had not claimed the protection of any “extended (structural and non-structural) warranties”, and no such issue was framed in the Statement of Issues, the Arbitrator’s finding of liability for such defects exceeded the scope of the submission to arbitration. The Plaintiff’s criticism appeared to be directed primarily at [172] of the Award, which states: Mr. Lamble had, however, provided a caveat that his observation is limited to the repairs or defects that could be sighted; that there could still have been hidden or latent defects; that his comments were limited to the strength and seaworthiness of the hull, and not to any fittings or equipment; that there may be hidden or latent defects in the hull which might be revealed during the extended warranty period… The Respondent had referred to Lamble’s Damage Report to suggest that the Santè was satisfactorily repaired. Quite clearly, such a submission is totally misplaced. Mr. Lamble’s remarks were limited to those repairs made to the hull and, in any case, only to repairs made to what were considered as visible damage. No issue of waiver or estoppel against claims on latent or hidden defects against Mrs. King could conceivably arise from this. 81 The Plaintiff’s submission, again, has fundamentally mischaracterised the Award and taken [172] out of context. It was thePlaintiffwho had first made the submission that the Lamble Damage Report estopped the Defendant from subsequently complaining of any damage to the Yacht that had not been explicitly stated in this report. Having duly considered Mr Lamble’s evidence and the Lamble Damage Report, the Arbitrator rejected this submission. He made a factual finding at [172] of the Award that the Lamble Damage Report was limited to visible defects in the Yacht’s hull and that did not profess to be exhaustive. As such, no issue of waiver or estoppel against the Defendant could conceivably have arisen from the Lamble Damage Report. 82 Since the Plaintiff’s argument of waiver or estoppel had failed, the mere fact that existing defects happened to be discovered only after the Lamble Damage Report was not a defence available to the Plaintiff. It must be emphasised that the Arbitrator’s conclusion on this issue did notamount to a finding of liability for “failure to repair hidden or latent defects” despite the absence of a warranty, as the Plaintiff submitted. The point was notwhenthe defects were discovered, butwhethertheyexistedsuch as to render the Yacht non-compliant with the contractual description and specifications, thereby placing the Plaintiff in breach of the Specifications Term. This was eminently clear from [184] of the Award: To the extent that the Respondent had failed to repair the damage or rectify the defects on the Santèto comply with the contractual specifications set out in the Contract,the Respondent is in breach of the Specifications Term. It matters not how the damage and / or defects were caused, the Respondent had the duty to restore the vessel in a condition prior to the Incident, and to bear the cost of rectifying such defects. [emphasis added in italics and bold italics] 83 The Arbitrator’s award of damages at [196] reinforces the point that repair costs were awarded not on the basis of the Plaintiff’s failure to repair latent or hidden defectsper se, but its failure to ensure compliance with the Specifications Term: The Tribunal, however, finds that that [sic] the Respondent had delivered the vessel, Santè,non-compliant with the contractual specifications. The Claimant is thus entitled to: a.damages based on the costs of repairs to put theSantè into the state that would be compliant with the Specifications Term; b. any diminution in value to the Santè for not being a “new vessel” contemplated under the Contract; and c. lack of CE Category B certification and documentation. [emphasis added] 84 In finding that no waiver or estoppel arose from the Lamble Damage Report at [172] of the Award, the Arbitrator was doing no more than addressing the Plaintiff’s submission in this regard. As I have already found that the Arbitrator was fully entitled to determine the Plaintiff’s liability for breach of the Specifications Term, I do not accept the submission that he ventured beyond the scope of the submission to arbitration.",
        "Issue 3: Whether there had been a breach of the rules of natural justice": "",
        "Purported failure to consider the Plaintiff’s submissions": "85 The Plaintiff submitted that it had made detailed and lengthy submissions on various issues in its closing arguments and that the depth of its efforts was not reflected in the Award. It argued that there was a breach of the rules of natural justice as a result. I note that this submission was not being made as regards any point that the Plaintiff said was pleaded and left unconsidered by the Arbitrator. The submission was solely that the Arbitrator did not consider all of the Plaintiff’s arguments fully or at all. 86 A high threshold must be crossed for the court to set aside an Award for breach of the rules of natural justice. Where a party complains of a procedural breach, the breach “cannot be of an arid, technical, or trifling nature”, but must be “serious enough that it justifies the exercise of the court’s discretion to set aside the award”:Coal & Oil Co LLC v GHCL Ltd[2015] 3 SLR 154 at [51]. Moreover, the breach of natural justice must have prejudiced the party’s rights: s 48(1)(a)(vii) AA and s 24(b) IAA. 87 In particular, the Plaintiff claimed that its submissions were not duly considered on the following issues, amongst others: (a) its objection to the Arbitrator’s jurisdiction;(b) the contractual exclusion of the Plaintiff’s liability as regards implied terms;(c) the destination port of delivery;(d) the operation of waiver and estoppel;(e) the Plaintiff’s duty to deliver the boat to Singapore; and(f) the Defendant’s true motives in commencing the Proceedings, insofar as this ought to have affected the costs award. 88 The submission was a non-starter. There is no obligation for an arbitrator to expressly address each and every argument put forward by the parties. It is simply not practical nor feasible, nor indeed necessary, to do so. An issue need not be addressed expressly in an award but may instead be implicitly resolved:TMM Division Maritima SA de CV v Pacific Richfield Marine Pte Ltd[2013] 4 SLR 972 at [77]. For example, if it is clear to the arbitrator that a particular finding on a specific argument satisfactorily disposes of an issue, he need not go on to consider and reject further arguments in relation to that issue:AQU v AQV[2015] SGHC 26 at [23]. The central inquiry is simply whether the award shows that the arbitrator has applied his mind to the arguments advanced by the parties. 89 The inference that the arbitrator failed to consider an important pleaded issue should only be drawn where it is “clear and virtually inescapable”:AKN and another v ALC and others and other appeals[2015] 3 SLR 488 (“AKN v ALC”) at [46]. This being the threshold for interference on the basis of an Arbitrator’s inferred failure to consider an important pleaded issue, the threshold for interference on the basis of the Arbitrator’s inferred failure toconsider oneparty’s submissions on an issuemust be at the very least the same. Indeed, one would have thought that the threshold for interference ought to be even higher in such a situation, given that a failure to consider an important pleaded issue would instinctively ordinarily command more significance than a submission. 90 I was satisfied that the Arbitrator fully considered the submissions that were made. He methodically cited, considered and gave his conclusion on each of the issues in the Statement of Issues, employing detailed reasoning which explicitly or implicitly dealt with the key arguments raised by the Plaintiff. On some of these issues, notably including the exclusion of implied terms, the Arbitrator found for the Plaintiff. Surprisingly, the Plaintiff sought to persuade me that this was one of the issues on which the Arbitrator failed to properly consider its submissions. 91 On the whole, it was evident that the Plaintiff was effectively seeking to re-ventilate arguments on the merits of the dispute, under the guise of having been denied a full and proper consideration of its submissions. The Court of Appeal has made it clear that courts should be chary of such attempts. In this regard, it does well to recall the well-established principle of minimal curial intervention, as well as the “salutary reminder that the substantive merits of the arbitral proceedings are beyond the remit of the court”:BLC v BLBat [3]. Where the Arbitrator was unpersuaded by the Plaintiff’s submissions, I I do not find that this was for want of consideration on his part.",
        "Purported failure to hear the Plaintiff on the appropriate computation of maintenance costs": "92 The Plaintiff also argued that the Arbitrator breached the rules of natural justice by computing maintenance costs at 15% of the total repair costs, in the absence of submissions on this point from parties. 93 The audacity of this submission is apparent when the Arbitrator’s finding is viewed in context. At [202] of the Award, the Arbitrator computed the Defendant’s costs of repairing the Yacht from 2012 to 2014 at US$317,295.43. However, in fairness to the Plaintiff, the Arbitrator acknowledged that some of the items of claim might have been incurred by the Defendant as ordinary maintenance costs in any event. The Arbitrator thus reduced the damages by 15% to reflect this reality, awarding costs to the Defendant in the lesser sum of US$269,701.11. The Arbitrator’s acceptance of the Plaintiff’s expert, Mr Richard Howe’s comment, to the effect that it is not always easy to distinguish repair works from ordinary maintenance, was thus clearly in the Plaintiff’s favour. Had the Arbitrator chosen to ignore Mr Howe’s comment, the Plaintiff would have been ordered to pay an additional US$47,594.32 or the full US$317,295.43 to the Defendant. 94 The Arbitrator had explicitly invited parties to address him on the items of claim submitted by the Defendant as repair costs. The Plaintiff accordingly tendered a report from Mr Howe commenting on the legitimacy of the Defendant’s computation of repair costs, which the Arbitrator took into account at [199]–[200] of the Award. If the Plaintiff omitted to address the Arbitrator specifically on the computation of maintenance costs and the appropriate discount for maintenance works, it lies ill in the Plaintiff’s mouth to criticise the Arbitrator for its own omission. 95 Hence, the Plaintiff’s comparison of the present case toAKN v ALCwas misplaced. InAKNv ALC, the Tribunal re-characterised the claim from one of actual loss of profits to one ofloss of opportunityto earn profits and did not give parties the opportunity to address it on the quantum of chance lost. It instead estimated the loss of chance at 55%, which translated into a monetary award of US$80m, in the absence of parties’ submissions and without any apparent analysis or consideration beyond a vague estimation that the chance should be “slightly better than even” (AKN v ALCat [76]). In contrast, the Plaintiff here had ample opportunity to address the Arbitrator on the correct quantification of repair costs. No re-characterisation of the claim was involved. Plainly the two cases are not at all comparable.",
        "Issue 4: Whether the Award is contrary to public policy": "96 In its lengthy submissions on this issue, the Plaintiff submitted that the Award manifested various errors which “shock the conscience, are clearly injurious to public good and wholly offensive”.",
        "Failure to determine the applicable legislation": "97 The Plaintiff made substantial submissions to the effect that the Award ought to be set aside for being contrary to public policy because the Arbitrator failed to determine thelex arbitri. 98 In my view, this was not only a storm in a teacup but also a wholly misconceived submission. The seat of the arbitration almost invariably determines thelex arbitri: Sundaresh Menon & Denis Brock,Arbitration in Singapore: A Practical Guide(Sweet & Maxwell, 2014) at para 12.073. The Arbitrator did in fact determine thelex arbitriby determining that the seat of the arbitration was Singapore: see [10] of the Award. What he did not go on to state was which statute, the AA or the IAA, governed the Proceedings at hand. 99 At the outset, the Plaintiff was unable to refer me to any authority for the view that a failure by the Arbitrator to specifically state the governing statute in an Award renders the Award liable to be set aside. It was only able to point me to an extract fromArbitration in Singapore: A Practical Guide,where it is stated under “Drafting Pointers” at para 12.096 that the award should state, in addition to the seat of the arbitration, the relevant legislation under which the arbitration was conducted. This was a drafting pointer suggested as a matter of good practice and not stated as an imperative, let alone an issue that troubles public policy. 100 It should also be noted that s 38(3) of the AA and s 3 of the IAA read with Article 31(3) of the Model Law both make it essential for the Award to state the date and place of the arbitration. Neither statute requires the Award to state the governing legislation of the arbitral proceedings. This is also observed inArbitration in Singapore: A Practical Guide, which explains at para 12.073 that the place of arbitration or juridical seat is critical because it determines which court has supervisory jurisdiction over the arbitration proceedings, the nature and scope of the court’s involvement and intervention, the degree to which an Award might be challenged and the curial law of the arbitration (ie, thelex arbitri). 101 As the Arbitrator determined the seat of arbitration to be Singapore, thelex arbitriwas Singapore law. There was no legislative stipulation requiring him to also identify whether the AA or the IAA applied and I did not see the failure to do so as fatal. Once the Arbitrator has determined the seat, an assessment can be made by the parties or the court as to whether the Proceedings were a domestic or international arbitration. In this regard, the definition ascribed to the term “international” in s 5(2) and s 5(3) of the IAA read with Article 1(3) of the Model Law would be salient. 102 I must at this juncture make an observation. The Plaintiff made no submissions before the Arbitrator on the importance of determining the applicable legislation to the efficacy of the Award, let alone what ought to be the governing statute, even though both parties accepted that the seat was Singapore. It was therefore surprising for the Plaintiff to make the argument before me that the Award was flawed on account of the Arbitrator’s failure to identify the applicable legislation. If this was a matter of such gravity, the Plaintiff should surely have made the necessary submissions before the Arbitrator to guide him to the correct conclusion, rather than remain silent only to raise the point in an application to set aside. After all, the Plaintiff could very well have prevailed in the arbitration, and would not have wanted to risk having the Award subsequently impugned on this ground should it succeed. The Plaintiff’s conduct in my view was redolent with gamesmanship. 103 The Plaintiff’s reticence on this issue continued before me. Despite my repeated requests, counsel for the Plaintiff refused to assist me on the question of whether this was an international or domestic arbitration, citing the reason that do so would prejudice the Plaintiff’s case. I found the reason offered inexplicable and the refusal to assist completely unsatisfactory. I registered that in no uncertain terms with counsel for the Plaintiff. 104 It is fairly evident that the Proceedings were an international arbitration under the IAA. The Arbitrator had based his conclusion that the Contract was an “international supply contract” for the purpose of s 26 of the Unfair Contract Terms Act on his finding that the Defendant did not have a habitual place of residence in Singapore. The Plaintiff took the same position before me. That being the case, the Proceedings constituted an international arbitration under s 5(2)(a) read with s 5(3)(b) of the IAA. Counsel for the Defendant rightly conceded this point and applied to withdraw the application for enforcement of the Award in OS 386, which application had been incorrectly made under the AA. 105 In any event, the grounds that the Plaintiff relied on to set aside are mirrored in both statutes. As such, the view taken on this issue does not have a material bearing on the outcome of the Applications. It is all the more immaterial given that I am not with the Plaintiff on the merits of the Applications. 106 Given that the IAA applies, the threshold to make out a breach of public policy is a high one. It is clear that an objection based on public policy is to be narrowly construed, and only operates where the award would shock the conscience, is clearly injurious to the public good or wholly offensive to the public, or violates the forum’s most basic notion of morality and justice:PTAsuransi Jasa Indonesia (Persero) v Dexia Bank SA[2007] 1 SLR(R) 597 at [59]. Mere errors of fact and/or law made by an arbitral tribunal are not contrary to public policyper se; instead the tribunal’s decision or decision-making process must be tainted by fraud, breach of natural justice or some other vitiating factor:AJU v AJT[2011] 4 SLR 739 (“AJU vAJT”) at [66]. A merely “perverse” or “irrational” award cannot amount without more to a breach of public policy. There must be egregious circumstances, such as corruption, bribery or fraud:Sui Southern Gas Co Ltd v Habibullah Coastal Power Co (Pte) Ltd[2010] 3 SLR 1 at [48]. There is no right of recourse to the courts where an arbitrator has simply made an error of law and/or fact:BLC v BLBat [53]. 107 The fact that the Award omitted to explicitly identify the statutory instrument governing the Proceedings can hardly qualify as an error that shocks the conscience, is clearly injurious to the public good or wholly offensive to the public, or violates the forum’s most basic notion of morality and justice. Indeed one doubts whether such an omission can be characterised as an ‘error’ at all in the first place, particularly given that the Arbitrator was neither required by statute nor invited by the parties to determine whether the AA or IAA was applicable. In any event, I was satisfied that this issue would have had no substantive bearing on the Arbitrator’s determination of the merits of the dispute.",
        "Breach of the New Vessel Term": "108 The Plaintiff argued that the Arbitrator’s decision to award damages for diminution in value for breach of the New Vessel Term was erroneous and contradictory, and therefore a breach of public policy. The Defendant had pleaded that the Plaintiff failed to deliver a vessel that was new. The Arbitrator found that the New Vessel Term was a term of the Contract. The Arbitrator found that by accepting delivery of the repaired Yacht following the 10 June 2012 Incident, the Defendant was estopped from asserting that the Yacht was no longer new, but went on to find that the Defendant was nevertheless entitled to damages for diminution in value. The Plaintiff found this to be a contradictory finding that contravened public policy. 109 This submission chose to ignore the full breadth of the Arbitrator’s conclusion. The Arbitrator found that by reason of the damage caused by the 10 June 2012 Incident, the Yacht was no longer “new” even if it had been satisfactorily repaired. However, by taking delivery of the Yacht and sending it to Phuket for further inspection and repair, the Defendant had waived her right to reject the Yacht on the ground that it was not new. Nevertheless, the Arbitrator caveated this by stating that the Defendant continued to retain any claim she might have for “diminution, loss or damage or repair costs for any unrepaired damage or improper repairs resulting from the Incident”. In other words, the Defendant, while waiving her right to reject the Yacht on the ground that it was not new, retained her right to claim damages for diminution in value on the same ground. 110 Accordingly, the Arbitrator accepted that the Defendant could not reject the Yacht on the ground that it was not new, but awarded damages for diminution in value for breach of the New Vessel Term. Whether the Arbitrator was correct in his conclusion on the merits of this issue is not a matter for the court’s determination in an application to set aside the Award. It bears repeating that the threshold for making out a challenge on the public policy ground requires more than a mere error of law and/or fact:AJU v AJTat [66]. As long as the issue was before the Arbitrator, the Plaintiff had agreed to be bound to the determination that he arrived at, subject to due process being observed.",
        "Costs": "111 The Plaintiff also asserted that the Arbitrator was wrong to award the Defendant her legal costs and expenses as she failed in establishing many of the terms she had argued were terms of the Contract. However, this ignores the fact that the Defendant substantially made out her case that the Yacht was riddled with the defects set out in the three reports, and that she had been supplied with a Yacht which was not new. In any event, the Arbitrator’s award of costs was an exercise of discretion based on his assessment of how the issues had been decided. The Plaintiff’s argument is a challenge on the merits of this aspect of the Award which, as previously mentioned, is beyond the remit of the court in a setting aside application:AJU v AJTat [66]. 112 Besides the two foregoing grounds, the Plaintiff further cited 16 legal and/or factual findings by the Arbitrator as salvos against the integrity of the Award. It claimed that these findings rendered the Award contrary to public policy. Some of these were repeated from the Plaintiff’s submissions on breach of natural justice and/or excess of jurisdiction. As these are numerous and trivial, I will not go into them save to say that they fell far short of the threshold required to justify setting aside of the Award.",
        "Issue 5: Whether the Arbitrator was biased": "113 The Plaintiff’s submissions on this issue essentially invited me to infer actual or apparent bias from the Arbitrator’s rejection of the Plaintiff’s submissions and nothing more. The Plaintiff asserted that the Arbitrator failed to remain impartial and as a result was incapable of fairly evaluating the evidence before him. 114 This was an astonishing submission. In the complete absence of any evidence of the Arbitrator’s partiality, I found the Plaintiff’s submission groundless. On the contrary, I have already alluded to the comprehensiveness and detail with which the Arbitrator laid out his reasoning in the Award. 115 To a large extent, this was reminiscent of the Plaintiff’s attempt to submit that the Award was tainted by fraud and corruption on the Arbitrator’s part, which I have described at [31] above. This submission and the allegation of bias are perhaps illustrative of the tenor of the Plaintiff’s challenge. The Plaintiff appeared quite willing to cast aspersions on the Arbitrator without paying due regard to whether there was any substance to underscore them.",
        "Conclusion": "116 In the circumstances, I dismissed the Applications with costs to the Defendant to be taxed if not agreed. 117 Following my determination that the Proceedings had been governed by the IAA rather than the AA, the Defendant sought leave to withdraw OS 386. I granted leave to withdraw OS 386 with costs to the Plaintiff.      Kannan RameshJudicial Commissioner   Arvind Daas Naaidu (Arvind Law LLC) and Govindarajalu Asokan (Govind Law Corporation) for the plaintiff in HC/OS 429–430 of 2016 and the defendant in HC/OS 386 of 2016; Mark Tan Chai Ming and Low Yi Yang (JLC Advisors LLP) for the defendant in HC/OS 429–430 of 2016 and the plaintiff in HC/OS 386 of 2016."
    }
}