{
    "case_title": "UES Holdings Pte Ltd vKH Foges Pte Ltd",
    "ncitation": "[2017] SGHC 114",
    "coram": "Quentin Loh J",
    "sections": {
        "Introduction": "2 The Plaintiff and the defendant, KH Foges Pte Ltd (“the Defendant”), are Singapore-incorporated companies which carry on the business of building and construction. 3 On 25 February 2014, upon entering into a contract with the Public Utilities Board, the Plaintiff entered into a sub-contract (“the Sub-Contract”) with the Defendant for the provision of works.1Foot Note 1×Teow Seng Huat’s (“Teow’s”) Affidavit dated 8 December 2016 (“Teow’s 1st Affidavit”) at paras 6 – 7 and TSH-1 (p 145). 4 On 25 August 2016, the Defendant served a progress payment claim (“the Payment Claim”) on the Plaintiff for the sum of S$1,642,751.13.2Foot Note 2×Teow’s 1st Affidavit at para 8 and TSH-1 (pp 74 – 141).On 14 September 2016, the Plaintiff responded to the Payment Claim with a payment response (“the Payment Response”) which indicated that, far from being entitled to the sum sought in the Payment Claim, the Defendant was liable to pay the Plaintiff S$91,371.23.3Foot Note 3×Teow’s 1st Affidavit at para 9 and TSH-1 (pp 285 – 298). 5 On 28 September 2016, the Defendant notified the Plaintiff by letter of its intention to apply for adjudication of their dispute regarding the Payment Claim (“the Notice”).4Foot Note 4×Teow’s 1st Affidavit at para 10 and TSH-1 (p 304).Subsequently, on 30 September 2016, the Defendant’s solicitors lodged an adjudication application (“the Adjudication Application”) with the Singapore Mediation Centre (“the SMC”).5Foot Note 5×Teow’s 1st Affidavit at para 11 and TSH-1 (pp 25 – 71). 6 On 3 October 2016, the adjudicator (“the Adjudicator”) was appointed.6Foot Note 6×Teow’s 1st Affidavit at para 12.Notice of his appointment was given to the parties on 4 October 2016.7Foot Note 7×Teow’s 1st Affidavit at para 13.The Adjudicator then called for a preliminary conference of the parties, which was held on 12 October 2016 (“the Preliminary Conference”); subsequently, the substantive adjudication conference was held on 20 and 21 October 2016 (“the Merits Conference”).8Foot Note 8×Teow’s 1st Affidavit at para 15.Then, on 8 November 2016, the Adjudicator rendered the Adjudication Determination, in which he ordered the Plaintiff,inter alia, to pay the Defendant the sum of $1,199,179.96.9Foot Note 9×Teow’s 1st Affidavit at para 16 and TSH-2 (pp 527 and 652). 7 On 8 December 2016, the Plaintiff filed this OS for the court to set aside the Adjudication Determination. The Plaintiff submitted that the Adjudication Determination should be set aside on three (alternative) grounds:10Foot Note 10×Plaintiff’s Submissions at para 4. (a)  the Adjudicator had violated s 16(3)(a) and/or s 16(3)(c) of the Act due to apparent bias on his part (“the Apparent Bias Issue”); (b) the Adjudication Application had been lodged out of time (“the Timing Issue”); and (c) the Notice had failed to comply with reg 7(1)(f) of the Building and Construction Industry Security of Payment Regulations (Cap 30B, Rg 1, 2006 Rev Ed) (“the Regulations”) and was therefore defective (“the Content Issue”). 8 I address each of these grounds in turn.",
        "The Apparent Bias Issue": "9 I first set out the parties’ arguments on this issue.",
        "The Parties’ Arguments": "87 The Plaintiff argued that the Adjudication Application, which was made on 30 September 2016 (see [5] above), was lodged out of time. The Defendant disagreed. The parties’ respective accounts of the Payment Response Deadline, the DSP and the time period for lodging the Adjudication Application are set out in the table below:64Foot Note 64×Plaintiff’s Submissions at para 118; Defendant’s Submissions at para 83 Plaintiff’s AccountDefendant’s AccountPayment Response Deadline15 September 201616 September 2016DSP16 – 22 September 201617 – 23 September 2016Time Period for Adjudication Application23 – 29 September 201624 – 30 September 2016 As the table reflects, the parties’ arguments on the Timing Issue were joined over a single matter,viz, the Payment Response Deadline. 88 The parties disagreed on the Payment Response Deadline because they differed over whether public holidays are included in determining the Payment Response Deadline. In particular, they disputed whether the word “days” in Para 2h should be interpreted in accordance with the Statutory Definition so as to exclude public holidays. This was crucial because 12 September 2016 was Hari Raya Haji, a public holiday within the meaning of the Holidays Act (Cap 126, 1999 Rev Ed) (“the Holidays Act”): see s 2(a) read with the Schedule to the Holidays Act. If 12 September 2016 is not included in the calculation of 21 days after 25 August 2016, when the Payment Claim was submitted (see [4] above), the Payment Response Deadline was 16 September 2016; if 12 September 2016 is accounted for, the Payment Response Deadline was 15 September 2016. 89 The Adjudicator held that the Statutory Definition applied to the word “days” in Para 2h, on the basis that, by cl 19.1, the parties had expressly agreed that the Statutory Definition should apply to the Sub-Contract in respect of the deadline for payment responses.65Foot Note 65×Teow’s 1st Affidavit at TSH-2 (p 576) at para 119.The Adjudicator thus found that the Payment Response Deadline was 16 September 2016, and that the Adjudication Application had been lodged (just) in time on 30 September 2016.66Foot Note 66×Teow’s 1st Affidavit at TSH-2 (pp 576 – 577) at paras 119 – 121. 90 Against this backdrop, the Plaintiff made the following submissions: (a) first, cl 19.1 did not incorporate any provision of the Act into the Sub-Contract; thus, the word “days” in Para 2h should be accorded its ordinary and natural meaning of a 24-hour period;67Foot Note 67×Plaintiff’s Submissions at paras 88(i), 101 – 105. (b) secondly, even if cl 19.1 incorporated some provisions of the Act into the Sub-Contract, it did not incorporate the Statutory Definition into the Sub-Contract; and even if the Statutory Definition was incorporated in the Sub-Contract, it could not be used to interpret Para 2h.68Foot Note 68×Plaintiff’s Submissions at paras 88(ii), 106 – 117.Thus, the word “days” in Para 2h should not be read in accordance with the Statutory Definition so as to exclude public holidays. 91 The Defendant made the following submissions: (a) first, cl 19.1 incorporated the Statutory Definition into the Sub-Contract; the Defendant relied on the Adjudicator’s reasoning in the Adjudication Determination (see [89] above) in this regard;69Foot Note 69×Defendant’s Submissions at paras 71 – 76.and (b) secondly, even if cl 19.1 did not incorporate the Statutory Definition into the Sub-Contract, the word “days” in Para 2h should be read as excluding public holidays in line with the Statutory Definition.70Foot Note 70×Defendant’s Submissions at paras 80 – 82. 92 In this light, two issues fall to be determined: (a) whether cl 19.1 incorporated the Statutory Definition into the Sub-Contract (in respect of payment responses),ie, whether the parties had expressly agreed by cl 19.1 that the Statutory Definition should apply in respect of payment responses (“the Incorporation Issue”); and (b) the true interpretation, in light of the answer to (a) above, of the word “days” in Para 2h (“the Interpretation Issue”).",
        "The Conferences": "13 The parties presented conflicting accounts of what had occurred at the Conferences. During the hearing, I invited the Plaintiff’s counsel, Mr Ian de Vaz (“Mr de Vaz”), and the Defendant’s counsel, Ms Monica Neo (“Ms Neo”), who had attended the Conferences, to let me have the benefit of their notes of proceedings at the Conferences which could have assisted me in my findings.17Foot Note 17×Minute Sheet dated 1 February 2017 at p 5.However: (a) Mr de Vaz said that, while he had handwritten notes of what was said at the Merits Conference, “apparent bias is established even on what is common between the parties”.18Foot Note 18×Minute Sheet dated 1 February 2017 at p 3.To be complete, I mention the following further comments by Mr de Vaz in relation to matters which I discuss at [17]-[18] below: (i) Mr de Vaz later added that his notes reflected that the Adjudicator had said “we have met before” or words to that effect, as set out in his letter dated 14 November 2016 (see [22] below),19Foot Note 19×Teow’s 1st Affidavit at TSH-4 (p 666).and the Adjudicator had not alluded to “previous dealings” at the Merits Conference.20Foot Note 20×Minute Sheet dated 1 February 2017 at p 5. (ii) When I asked Mr de Vaz why, in his earlier letter dated 10 November 2016 (see [21] below), he had stated that the Adjudicator had said that he was “acquainted with and/or previously had dealings with [Mr Foo]”,21Foot Note 21×Teow’s 1st Affidavit at TSH-4 (pp 662).Mr de Vaz replied that “the idea was to be as expansive as possible” in that letter.22Foot Note 22×Minute Sheet dated 1 February 2017 at p 5. (b) Ms Neo said that she had no notes of what the Adjudicator had said at the commencement of the Merits Conference.23Foot Note 23×Minute Sheet dated 1 February 2017 at p 5. I thus proceed to determine the facts based on the affidavit and documentary evidence before me. 14 On 11 October 2016, one day before the Preliminary Conference, the Defendant’s solicitors wrote to the Adjudicator by email to inform him of the persons who would be attending the Preliminary Conference on the Defendant’s behalf.24Foot Note 24×Teow’s 1st Affidavit at TSH-3 (p 656).The email listed Mr Foo as one of the Defendant’s representatives. 15 On 12 October 2016, the Preliminary Conference took place. The parties dispute whether the Adjudicator had stated, during the Preliminary Conference, that he was acquainted with Mr Foo. According to Mr Foo, the Adjudicator had made such a statement at the end of the Conference in the presence of both parties’ solicitors.25Foot Note 25×Foo Hee Kang’s (“Foo’s”) Affidavit dated 30 December 2016 (“Foo’s Affidavit”) at para 16.However, the Plaintiff denied this.26Foot Note 26×Teow’s Affidavit dated 17 January 2017 (“Teow’s 2nd Affidavit”) at para 14. 16 I note that the Adjudicator’s emails (see [21] and [23] below) support the Plaintiff’s account of what had transpired at the Preliminary Conference: (a)  In his email dated 10 November 2016, the Adjudicator stated that he had mentioned his previous dealings with Mr Foo “[a]t the very commencement of theMerits Conference” [emphasis added].27Foot Note 27×Teow’s 1st Affidavit at TSH-4 (p 664).The Adjudicator did not suggest that he had mentioned such dealings on an earlier occasion, at the Preliminary Conference. (b) In his email dated 15 November 2016, in the course of providing a full response to the Plaintiff’s solicitors’ queries in their letter dated 14 November 2016 (see [22] below), the Adjudicator did not dispute the Plaintiff’s solicitors’ claim in the said letter that he had made no remarks or disclosure in relation to Mr Foo at the Preliminary Conference.28Foot Note 28×Teow’s 1st Affidavit at TSH-4 (p 668). I therefore find that the Adjudicator did not state that he had a prior relationship or was acquainted with Mr Foo at the Preliminary Conference. 17  The Merits Conference took place on 20 and 21 October 2016. Again, the parties disagree about what occurred at the start of the Merits Conference: (a) The Plaintiff averred that the Adjudicator had simply remarked “we have met before” or words to that effect, after calling out Mr Foo’s name while reading out the names of all the attendees.29Foot Note 29×Teow’s 2nd Affidavit at paras 20 – 21.The Adjudicator had simply made “a casual or passing remark in the course of “meeting and greeting” the parties”.30Foot Note 30×Teow’s 2nd Affidavit at paras 22. (b) By contrast, the Defendant’s position was that the Adjudicator had stated that he was acquainted with Mr Foo due to some previous dealings and that he wanted to make sure that parties had no problems with this fact (or words to that effect).31Foot Note 31×Foo’s Affidavit at para 17. 18 I note that the Plaintiff’s solicitors’ letter to the Adjudicator dated 10 November 2016 (see [21] below) is not consistent with the Plaintiff’s account of what had occurred at the Merits Conference:32Foot Note 32×Teow’s 1st Affidavit at TSH-4 (p 662). (a) In that letter, the Plaintiff’s solicitors stated that their notes of proceedings revealed that the Adjudicator had remarked that he was “acquainted withand/or previously had dealingswith one of the [Defendant’s] representatives” [emphasis added]. (b) Moreover, in that letter, the Plaintiff inquired into how long the Adjudicator had known Mr Foo and the nature of his relationship with Mr Foo. These would not have been natural queries if the Adjudicator had merely said that he and Mr Foo had “met before”. 19 Moreover, the Adjudicator’s account supports the Defendant’s version of the events.  In his email dated 10 November 2016, the Adjudicator stated that he had informed parties, at the commencement of the Merits Conference on 20 October 2016, that he was acquainted and had previous dealings with Mr Foo.33Foot Note 33×Teow’s 1st Affidavit at TSH-4 (p 664). 20 I therefore find that the Adjudicator did remark, at the beginning of the Merits Conference, that he had previous dealings with Mr Foo. However, what is also clear, being common to both the Plaintiff’s and the Defendant’s accounts, and I so find, is that the Adjudicator was not asked, nor did he offer any elaboration on, the nature and details of his relationship with Mr Foo at the Merits Conference.",
        "The Adjudicator’s Associations": "21 On 10 November 2016, two days after the Adjudicator had rendered the Adjudication Determination, the Plaintiff’s solicitors wrote to the Adjudicator to seek details of his relationship with Mr Foo.34Foot Note 34×Teow’s 1st Affidavit at TSH-4 (pp 662 – 663).The Adjudicator replied by email later that evening. In the email, the Adjudicator stated the following:35Foot Note 35×Teow’s 1st Affidavit at TSH-4 (p 664). (a) The Adjudicator had become acquainted with Mr Foo when he had acted as counsel for RPPL in litigious matters, when Mr Foo was the MD of RPPL. However, his last dealing with RPPL and Mr Foo was in August 2013 (more than 3 years before the adjudication commenced). (b) The Adjudicator had at all times dealt with Mr Foo only in his capacity as counsel for RPPL. He did not have any social relationship or dealings with Mr Foo on a personal basis. 22 On 14 November 2016, the Plaintiff’s solicitors wrote to the Adjudicator again.36Foot Note 36×Teow’s 1st Affidavit at TSH-4 (pp 666 – 667).Clarification was sought regarding when the Adjudicator had first met Mr Foo and had professional dealings with Mr Foo and RPPL, the number of matters which the Adjudicator had handled for Mr Foo and RPPL, the quantum of fees which the Adjudicator or his firm had billed Mr Foo and RPPL and whether the Adjudicator had disclosed his previous dealings with Mr Foo to the SMC. The Plaintiff also asked whether the Adjudicator had “at any time had dealings with Mr Foo and/or [RPPL] in any other capacity (aside from acting as Counsel for [RPPL])” and, if so, for details. 23 On 15 November 2016, the Adjudicator replied by email as follows:37Foot Note 37×Teow’s 1st Affidavit at TSH-4 (p 668). (a) The Adjudicator had first met Mr Foo in 2002, when he was instructed to act for RPPL. From 2002 until his last dealing with RPPL in August 2013, he had only handled two matters for RPPL and had never handled any matters for Mr Foo personally. (b) The Adjudicator was not at liberty to disclose the fees which his firm had billed RPPL. His firm had never billed Mr Foo personally for fees, and he had personally neither billed RPPL nor Mr Foo for fees. (c) The Adjudicator had not disclosed his previous dealings with Mr Foo and RPPL to the SMC. The Adjudicator explained that, given the nature, number and timelines of his previous dealings with RPPL and Mr Foo, no conflict of interest arose, nor were there any circumstances which could give rise to doubts as to his impartiality or independence. (d) The Adjudicator had “at all times dealt with Mr Foo only in [his] capacity as counsel for [RPPL] and only in [Mr Foo’s] capacity as [the MD] of [RPPL]”. He did not have a social relationship or personal dealings with Mr Foo, nor were they (ever) friends. 24 Thus, in his email dated 15 November 2016, the Adjudicator disclosed that he had dealt with Mr Foo when he had acted as counsel for RPPL, when Mr Foo was the MD of RPPL, in two matters between 2002 and 2013. 25 However, the Plaintiff placed evidence before me which revealed that the Adjudicator had dealings with two other companies linked to RPPL: (a) First, the Adjudicator had acted as counsel for Econ Piling Pte Ltd (“EPPL”) in two cases in 1998 and 2006 respectively.38Foot Note 38×Teow’s 1st Affidavit at para 40 and at TSH-8 (pp 888 – 900).EPPL was a wholly-owned subsidiary of Econ International Limited,39Foot Note 39×Teow’s 1st Affidavit at TSH-7 (p 879).which was an associated company of RPPL.40Foot Note 40×Teow’s 1st Affidavit at TSH-7 (pp 880 – 883). (b) Secondly, the Adjudicator had been an independent non-executive director of Resources Holdings Limited (“RH”), the holding company of RPPL, which subsequently changed its name to Keller AsiaPacific Limited (“Keller”),41Foot Note 41×Teow’s 1st Affidavit at TSH-7 (p 705).from 30 September 2008 to 14 October 2009.42Foot Note 42×Teow’s 1st Affidavit at TSH-6 (p 692).Therefore, the Adjudicator had shared a common directorship with Mr Foo; for the latter had been a director of RH/Keller from 30 January 2004 to 29 February 2016.43Foot Note 43×Teow’s 1st Affidavit at TSH-6 (p 696).Mr Foo had also served as the Chief Executive Officer (“CEO”) and Executive Chairman (“EC”) of RH.44Foot Note 44×Teow’s 1st Affidavit at TSH-5 (p 673). 26 Having set out the key facts, I now turn to the law.",
        "The Law": "27 Section 16(3) of the Act (“s 16(3)”) provides as follows: (3) An adjudicator shall — (a) act independently,impartiallyand in a timely manner … (c)comply with the principles of natural justice. [emphasis added] 28 In the recent case ofMetropole Pte Ltd v Designshop Pte Ltd[2017] SGHC 45 (“Metropole”), Vinodh Coomaraswamy J made the following observations regarding s 16(3) at [46]: It can be seen that an adjudicator comes under a statutory obligation to act impartially under two provisions of s 16(3). First, that obligation is set out expressly in s 16(3)(a). Second, that obligation is implicit in his wider obligation to comply with the principles of natural justice under s 16(3)(c).But there is no need to analyse these separate statutory obligations separately. The content of the obligation to act impartially under s 16(3)(a) is no different from the content of the obligation to act impartially in complying with the principles of natural justice under s 16(3)(c). An adjudicator who breaches one also breaches the other (SEF Constructionat [49]). [emphasis added] I respectfully agree. The principles of natural justice stem from two overarching rules. First, every party to a dispute is entitled to a fair hearing. Secondly, the tribunal which decides a dispute must be independent and impartial. This latter rule, which is known as the rule against bias, is expressly reflected in s 16(3)(a) of the Act. The doctrine of apparent bias is an offshoot of this rule. Apparent Bias under the Act 29 Apparent bias arises if “there are circumstances which would give rise to a reasonable suspicion or apprehension in a fair-minded reasonable person with knowledge of the relevant facts that the tribunal was biased”: seeRe Shankar Alan s/o Anant Kulkarni[2007] 1 SLR(R) 85 (“Re Shankar Alan”)at [91]. This is known as the reasonable suspicion test, which has been held to apply to adjudicators of payment claim disputes under the Act (“SOPA adjudicators”): seeJRP & Associates Pte Ltd v Kindly Construction & Services Pte Ltd[2015] 3 SLR 575 (“JRP”) at [53] andMetropoleat [47]. 30 In oral submissions, Ms Neo accepted that the reasonable suspicion test was the applicable test but submitted that the allegations of apparent bias should be critically examined.45Foot Note 45×Minute Sheet dated 1 February 2017 at p 14; Defendant’s Submissions at paras 38 – 42.Ms Neo cited Dyson LJ’s comments on the position under the English equivalent of the Act, inAmec Capital Projects Ltd v Whitefriars City Estates Ltd[2004] EWCA Civ 1418 (“Amec”) at [22]: It is easy enough to make challenges of breach of natural justice against an adjudicator. The purpose of the scheme of the 1996 Act is now well known. It is to provide a speedy mechanism for settling disputes in construction contracts on a provisional interim basis, and requiring the decisions of adjudicators to be enforced pending final determination of disputes by arbitration, litigation or agreement.The intention of Parliament to achieve this purpose will be undermined if allegations of breach of natural justice are not examined critically when they are raised by parties who are seeking to avoid complying with adjudicators' decisions. It is only where the defendant has advanced a properly arguable objection based on apparent bias that he should be permitted to resist summary enforcement of the adjudicator's award on that ground. [emphasis added] I accept that allegations of breach of natural justice against SOPA adjudicators must be critically examined, so that unmeritorious allegations do not stymie the Act’s aim of ensuring the timely settlement of payment disputes on an interim basis. In my judgment, in appropriate cases, such critical examination will additionally include examining the issue of waiver (see [49] – [53] below). But the test for apparent bias remains the same. The court applies the reasonable suspicion test to determine whether apparent bias is established on the facts of the case. 31 If the reasonable suspicion test is made out, the court may set aside the adjudication determination. This is clear fromCitiwall Safety Glass Pte Ltd v Mansource Interior Pte Ltd[2015] 1 SLR 797, where the Court of Appeal (“the CA”) recognised at [47] that an adjudication determination may be set aside if the adjudicator had violated the rules of natural justice. However, our courts have also held that not every such violation will justify setting aside an adjudication determination. Only material breaches of natural justice will suffice: seeAik Heng Contracts and Services Pte Ltd v Deshin Engineering & Construction Pte Ltd[2015] SGHC 293 (“Aik Heng”) at [24] andMetropoleat [62]. 32 Our courts have not considered whether or how the material breach requirement applies in cases of apparent bias under the Act. At this point, I note that no allegation of apparent bias was made inAik Heng. Although an allegation of apparent bias was made inMetropole(based on the adjudicator’s conduct), Coomaraswamy J, having found that no reasonable suspicion of apparent bias arose, did not proceed to discuss the material breach requirement in the context of the allegation of apparent bias. Again, inJRP, Chan Seng Onn J did not consider the material breach requirement in dismissing the apparent bias allegation. As will become clear, it is also unnecessary for me to decide in this case whether or how the material breach requirement applies when the reasonable suspicion test is made out against a SOPA adjudicator. I therefore leave this issue for another occasion when it can be fully argued. Bias by Association 33 While the reasonable suspicion test is well-established in our law as the test for apparent bias, our courts have not elaborated on how the test applies where apparent bias is said to have arisen from the tribunal’s relationship with a party to a dispute or a party’s representative (as is the case here). These are cases of “disqualification by association”, where apparent bias may arise from “some direct or indirect relationship, experience or contact with a person or persons interested in, or otherwise involved in, the proceedings”: seeWebb v The Queen(1993-1994) 181 CLR 41 at 74,perDeane J. In my view, the Australian jurisprudence on this category of cases is instructive. I note that the reasonable suspicion test is also the test for apparent bias in Australia. 34 The starting point is that the mere fact that a tribunal is associated with a party to the dispute before it, or a representative of a party, does not suffice to raise a reasonable suspicion of bias. InAussie Airlines Pty Ltd v Australian Airlines Pty Ltd and Another(1996) 135 ALR 753 (“Aussie Airlines”), the respondents’ counsel had a personal, professional and financial relationship with the judge (Merkel J): seeAussie Airlinesat 755 to 756. First, the pair had shared a close personal relationship. Each had been signatories to each other’s bank accounts and directors of each other’s family trust companies (albeit that these matters had ended after Merkel J’s judicial appointment). Secondly, the pair had shared an extended professional relationship which involved sharing chambers, along with other counsel, for 12 to 13 years. Thirdly, as members of chambers, the pair had interests in the trust administering the chambers, in investment properties and in a hotel business. After Merkel J and counsel had disclosed this relationship to parties, the applicant applied for Merkel J to disqualify himself for apparent bias. Merkel J rejected the application. A crucial step in Merkel J’s reasoning appears in the following passage, at 761: … [The cases] appear to accept that the reasonable bystander would expect that members of the judiciary will have had extensive professional associations with clients but thatsomething more than the mere fact of association is requiredbefore concluding that the adjudicator might be influenced in his or her resolution of the particular case by reason of the association. Although the test is one of appearance, it isanappearance that requires a cogent and rational link between theassociation and its capacity to influence the decision to be made in the particular case. … [emphasis added] 35 Merkel J then analysed two cases in which apparent bias was made out. The first involved a close and continuing personal relationship between a judge and a solicitor. Merkel J reasoned that the relationship “would be perceived to involve an emotional or relational inter-dependence”, which might reasonably be understood as having the capacity to affect the judge’s decision in the case: seeAussie Airlinesat 761. The second case involved a prosecution where the prosecuting solicitor was the acting head of a department to which the special magistrate belonged. Merkel J reasoned that it was the prosecutor’s power over the magistrate and the latter’s career that gave rise to apparent bias: seeAussie Airlinesat 763. Merkel J then concluded as follows, at 763: In my view the two cases again demonstrate the requirement for a cogent and rational link between the association and its capacity to influence the decision to be made in the particular case.It is the capacity of the association to influence the decision rather than the association as such that is disqualifying. [emphasis added] I agree. Where apparent bias is said to arise from the tribunal’s associations, a rational connection must be shown between the associations and the prospect of bias. This flows from the very idea of a reasonable suspicion. (It is notable that the rational connection test is now part of the overarching test for apparent bias in Australia: see the majority judgment inEbner v Official Trustee in Bankruptcy(2000) 205 CLR 337 at 345.) A suspicion is reasonable if and only if it is founded on a reason which is supported by the evidence. This is akin to the definition of a reasonable doubt, in the context of the criminal standard of proof, as a doubt “for which there is a reason that is, in turn, relatable to and supported by the evidence presented”: seeJagatheesan s/o Krishnasamy vPublic Prosecutor[2006] 4 SLR(R) 45, at [61]. Therefore, in my view, a party who alleges apparent bias based on a tribunal’s associations must show that there is reason to hold that the tribunal’s associations might influence its decision. 36 The Australian jurisprudence also provides guidance on how a rational link between the tribunal’s associations and the prospect of bias might be established. InS & M Motor Repairs Pty Ltd and Others v Caltex Oil (Australia) Pty Ltd and Another(1988) 11 IPR 97 (“Caltex Oil”), the appellants ran a petrol station under a franchise agreement with the second respondent (“Caltex”). A dispute arose. The first appellant gave an undertaking to the court not to pass off any petrol which the respondents had not supplied as Caltex petrol. The respondents then brought proceedings for contempt of court, alleging that the appellants had breached the undertaking. After the trial, but before the judge rendered judgment, the appellants learnt that that the judge had regularly acted for Caltex and other associated companies before his appointment to the Bench. The appellants applied for the judge to disqualify himself from hearing the case. Upon hearing the application, the judge disclosed that he had represented Caltex and associated companies on even more occasions than those which had been known to the appellants. The association had lasted for at least a decade, spanning public inquiries and two celebrated and protracted proceedings, up to November 1984: seeCaltex Oilat 103. (The trial before the judge began in February 1987). However, the judge dismissed the application and found that the appellants had committed contempt. The appellants then appealed to the New South Wales Court of Appeal. 37 The court unanimously allowed the appeal. However, the court was split on the issue of apparent bias. By a majority, the court held that a reasonable and informed observer would not have apprehended possible bias on the judge’s part. With respect, I pause here to note that it is unclear whether our courts would have reached the same conclusion. Plainly, the trial judge’s association with Caltex and its related companies was close and prolonged; this was the foundation of Kirby P’s detailed and forceful dissent. However, what is relevant here is Kirby P’s statement of the factors which are relevant to the issue of whether apparent bias arises from a tribunal’s association(s) at 107: … In so far as such bias is said to arise from a relationship between the parties, it is clearly relevant to know theduration of that relationship,its intensity and nature and the time that has elapsed between its last renewal and the performance of judicial functions said to be affected by it. [emphasis added] 38 In my judgment, the factors identified by Kirby P inCaltex Oilare relevant in determining whether there is a rational link between a tribunal’s associations and the prospect of bias. In approaching that enquiry, the court should consider the duration, intensity and nature of the tribunal’s relevant associations, along with the time which has passed since the last renewal of the associations. Apparent bias is established if there is reason to hold, upon analysing the tribunal’s associations through the prism of these factors, that those associations might influence the tribunal’s decision. The Relevance of Non-Disclosure 39 In this case, the Adjudicator did not fully disclose his associations with Mr Foo, EPPL and RH. The Plaintiff relied on this to submit that apparent bias was established. In this regard, the Plaintiff argued that a failure to disclose could “in and of itself” give rise to a reasonable suspicion of bias.46Foot Note 46×Plaintiff’s Submissions at para 44.This raises the question of the relevance of disclosure, or the lack thereof, to apparent bias. 40 I should perhaps start with what a tribunal should disclose, if at all, and how disclosure should be made. InTaylor and another v Lawrence and another[2003] QB 528 (“Taylor”), Lord Woolf CJ made the following apposite comments at [64]: A further general comment which we would make, is that judgesshould be circumspect about declaring the existence of a relationship where there is no real possibility of it being regarded by a fair-minded and informed observer as raising a possibility of bias. If such a relationship is disclosed, it unnecessarily raises an implication that it could affect the judgment and approach of the judge. If this is not the position no purpose is served by mentioning the relationship. On the other hand, if the situation is onewhere a fair-minded and informed person might regard the judge as biased, it is important that disclosure should be made.If the position is borderline, disclosure should be madebecause then the judge can consider, having heard the submissions of the parties, whether or not he should withdraw. … [emphasis added] Similarly, inAussie Airlines, Merkel J observed at 759 that “the facts to be disclosed are those thatmightfound or warrant a bona fide application for disqualification” [emphasis in original]. With respect, I agree with Woolf CJ’s and Merkel J’s observations on the scope of the duty to disclose. A tribunal should disclose facts which might found abona fidecase of apparent bias. Moreover, in a borderline case, a tribunal should err on the side of disclosure. But disclosure is unnecessary if the facts patently will not raise a reasonable suspicion of bias. 41 However, if disclosure should be made, it is good practice to make full disclosure because partial disclosure is likely to reduce public confidence in the administration of justice. As Lord Woolf CJ observed, partial disclosure is “naturally likely to excite suspicions in the mind of the litigant concerned even though those concerns are unjustified”: seeTaylorat [65]. InJones v DAS LegalExpenses Insurance Co Ltd and Others[2003] EWCA Civ 1071, the Court of Appeal made the following comments on full disclosure at [35]: … iv) A full explanation must be given to the parties. That explanation shoulddetail exactly what matters are within the judge's knowledgewhich give rise to a possible conflict of interest.The judge must be punctilious in setting out all material matters known to him. … [emphasis added] I endorse these observations as a statement of good practice which should be followed by a tribunal in disclosing facts which might found abona fidecase of apparent bias. 42 If a tribunal fails to make full disclosure of facts which it should have disclosed, how is this relevant to apparent bias? InAussie Airlines, Merkel J stated his views on this point at 758 – 759: Secondly, the failure to disclose, of itself, can beone of the circumstances which together with othersmay give rise to a reasonable apprehension of bias:S & M Motor Repairsper Kirby P at 374. A party or the public may well be left with the impression that there wasintentional concealment or non-disclosure, or that something was “wrong about it all”. … [emphasis added] I agree. A tribunal’s failure to (fully) disclose its associations with a party or a party’s representative is one factor which may lead to a reasonable suspicion of bias. Nonetheless, as Merkel J suggested, a failure to disclose will only give rise to apparent bias if there are other circumstances which support such a finding. Crucially, in my view, the tribunal’s associations must be sufficiently material or significant for lack of disclosure of the same to support a reasonable suspicion of bias. I draw support for this proposition from Kirby P’s reasoning on the topic of non-disclosure inCaltex Oilat 113, as follows: … To the reasonable observer, even one knowledgeable about our system of appointing judges,the duration, variety, intensity and proximity of his Honour's connection with the “Caltex interests” would, I believe, raise a reasonable apprehension of biason the basis that his Honour had been the “Caltex barrister”. This apprehension would bestimulated, in my respectful view, by the failure to disclose such along, recent and varied connectionwith the first appellantat the outset of the proceedings, as would, I think, have been normal. … [emphasis added] It is implicit in this reasoning that a fair-minded observer would generally not hold a reasonable suspicion of bias on the basis of a tribunal’s non-disclosure of insubstantial or limited associations with a party or a party’s representatives. This is because a fair-minded observer would generally not suspect that non-disclosure in such circumstances was due to bias, even if he or she considered that disclosure was warranted on the facts. Instead, the natural view would be that the tribunal had not made disclosure due to an honest and objective (albeit mistaken) judgment that disclosure was unnecessary. Thus, non-disclosure where a tribunal’s associations with a party or its representatives were insubstantial or limited would generally not support a reasonable suspicion of bias. 43 Thus, the nature and extent of a tribunal’s associations is a crucial factor in determining whether the failure to disclose the same supports a reasonable suspicion of bias. Additionally, in my view, there is a second key factor,viz, the nature of the partial disclosure; and, in particular, whether it gives rise to an impression that the tribunal had intentionally concealed or not disclosed any relevant associations to put forward a different picture (see Merkel J’s observations at [42] above). 44 In some cases, partial disclosure would falsely downplay the nature and extent of the tribunal’s associations:suppressio veri, suggestio falsi. This might occur, for example, if a tribunal revealed to the parties that it had links with one party, and disclosed a fleeting and trivial connection,eg,having represented the party’s relative as counsel many years ago, while omitting to mention a more substantial tie,eg, a prolonged personal friendship with the party. In such cases, upon discovering the truth, a fair-minded and reasonably informed observer might justifiably suspect that the tribunal had intentionally concealed the more significant association due to bias. In such circumstances, the partial disclosure would strongly support a reasonable suspicion of bias. However, in other cases, partial disclosure may not falsely suggest that the tribunal’s associations were more limited than they actually were. In these cases, therefore, a fair-minded observer, upon discovering the full extent of the tribunal’s associations, would not obtain the impression of intentional concealment or non-disclosure. Hence, the fact of partial disclosure would not lend great weight to a reasonable suspicion of bias in such cases. For these reasons, the nature of the partial disclosure made is relevant to whether it supports a reasonable suspicion of bias. The Relevance of the Tribunal’s Response to Inquiries 45 I now turn to the relevance of the tribunal’s response to inquiries from a party, for information as to the tribunal’s associations, to apparent bias. 46 The Plaintiff submitted that the Adjudicator was not forthcoming in responding to the Plaintiff’s solicitors’ requests for information, and that this is further basis for finding apparent bias on his part.47Foot Note 47×Plaintiff’s Submissions at paras 68 – 73.On this point, the Plaintiff relied onCofely Ltd v Anthony Bingham and Knowles Ltd[2016] BLR 187 (“Cofely”). 47 InCofely, the first defendant was appointed as the arbitrator of a dispute between the claimant and the second defendant. Subsequently, the claimant’s solicitors sought clarification from both defendants regarding their professional relationship. The first defendant was defensive and evasive in his responses to the claimant’s queries. He then convened a hearing during which he questioned the claimant’s counsel aggressively and in a hostile manner. Thereafter, even though neither the claimant nor the second defendant had sought a ruling, the first defendant ruled that there was no apparent bias. The claimant then applied to the court for the first defendant to be removed. In his witness statement in the court proceedings, the first defendant stated that the information which the claimant had sought from him was irrelevant and also described the claimant’s behaviour as “assertive/challenging/perhaps even bullying”. In ordering that the first defendant be removed, Hamblen J held, at 204 – 205, that his evasiveness in replying to queries, aggressive conduct during the hearing and continued lack of objectivity in his witness statement were grounds, among others, which established apparent bias. 48 I agree that a tribunal’s responses to a party’s inquiries for information about its associations can lend weight to a reasonable suspicion of bias. But the evidence must be carefully sifted and weighed to determine whether the tribunal’s replies support a finding of apparent bias. In this regard, the detail, speed and tone of the tribunal’s responses are relevant considerations. Waiver 49 The Defendant submitted that, even if apparent bias arose, the Plaintiff had waived its right to challenge the Adjudication Determination on that basis. The Defendant noted that, while the Adjudicator had told the parties that he had previous dealings with Mr Foo, the Plaintiff did not challenge his impartiality during the proceedings, and had only made queries about the Adjudicator’s relationship with Mr Foo after the release of the Adjudication Determination.48Foot Note 48×Defendant’s Submissions at paras 25 – 29. 50 The Plaintiff maintained that it was entitled to challenge the decision on the basis of apparent bias.49Foot Note 49×Plaintiff’s Submissions at paras 74 – 84.Here, the Plaintiff relied onSmith v Kvaerner Cementation Foundations Ltd (General Council of the Bar intervening)[2007] 1 WLR 370 (“Smith”). InSmith, Lord Phillips CJ, delivering the English Court of Appeal’s judgment, articulated three requirements for a party to waive its right to raise an allegation of apparent bias: “the party waiving should be aware of all the material facts, of the consequences of the choice open to him, and given a fair opportunity to reach an unpressured decision”: seeSmithat [29]. The Plaintiff argued that, as the Adjudicator did not fully disclose the nature and extent of his associations with Mr Foo at the material time, there had been no waiver because it had not been aware of all the material facts.50Foot Note 50×Plaintiff’s Submissions at paras 77 – 78. 51 I endorse the general principle that a party will only waive a right by a free and informed choice. But, in my judgment, that principle must be qualified in a way which does not enable a party to hold back an apparent bias challenge, and subsequently brandish it as a trump card against the tribunal’s decision if it is adverse to the party. This is especially so in relation to challenges of apparent bias against SOPA adjudicators. The aim of the Act is to ensure the timely settlement of payment disputes on an interim basis; an aim which will only be achieved if adjudication determinations are generally promptly enforced, unless there are good reasons otherwise. If parties were allowed to reserve apparent bias challenges for the setting aside stage, tactical manoeuvring would ensue. 52 These considerations lead me to conclude that, while the requirements for waiver inSmithare generally sound, the first requirement,viz, knowledge of all the material facts, should be qualified in the following way, at least where allegations of apparent bias are made against SOPA adjudicators. In some cases, a party will be put on notice that an issue of apparent bias may lie because the tribunal has disclosed sufficient information to the party to alert it to the facts underlying the issue, even if the tribunal has not fully disclosed every material detail. In these cases, it is up to the party to decide whether to pursue the point by requesting the tribunal to elaborate on the details of the relevant facts. However, in my judgment, if the party chooses not to make the relevant inquiries immediately or without undue delay, it should not be allowed, without strong reasons, to later allege, upon raising a challenge on the basis of apparent bias, and upon being met with the objection of waiver, that there was no waiver because it did not have knowledge of all material facts at the relevant time. For, having been put on notice, it was the party’s responsibility to enquire into those relevant facts. If it fails to do so, the party should be deemed to have had sufficient knowledge of all the material facts such that the first element of waiver will be fulfilled. In my judgment, this caveat to the test for waiver stated inSmithis necessary to afford “critical examination” of apparent bias challenges against SOPA adjudicators (see Dyson LJ’s comments quoted at [30] above). 53 I hasten to add that whether “sufficient information” was given to put a party on notice is heavily fact-sensitive and may, at times, be a fine balancing exercise. Presently, two considerations strike me as relevant. First, the tribunal’s disclosure must not misrepresent the material facts. To return to the example given at [44] above, it is unlikely that a tribunal would be held to have disclosed sufficient information if, having had a sustained personal friendship and trivial business dealings with one party, it disclosed the latter but kept (completely) mum on the former. In such a case, it seems that the aggrieved party could legitimately complain that, while it had waived its right to raise an apparent bias challenge on the basis of the business dealings, it had not done so regarding the personal friendship, for nothing suggesting that had been disclosed. Secondly, in my view, another key consideration is whether the party to whom disclosure was made had legal representation at the material time. If not, I consider that a higher threshold might have to be surpassed to establish that the party had sufficient information to put it on notice.",
        "Application of the Law": "54 I now apply the law to the facts and turn first to the substantive issue of apparent bias. The Adjudicator’s Associations 55 The Plaintiff’s case on apparent bias was founded on the Adjudicator’s associations with Mr Foo. The Adjudicator was associated with Mr Foo in two ways (see [21]–[25] above). First, he had represented RPPL, when Mr Foo was the MD of RPPL, and EPPL, a company linked to RPPL, as counsel. Secondly, he had been a non-executive director of RH while Mr Foo was the CEO and EC of RH. 56 I turn first to the Adjudicator’s associationsquacounsel. In terms of his representation of EPPL, the evidence merely discloses that the Adjudicator had acted for EPPL on two occasions,viz, in 1998 and 2006 (see [25(a)] above). Furthermore, when the Adjudicator was appointed on 3 October 2016 (see [6] above), about a decade had elapsed since the Adjudicator had last acted for EPPL. Moreover, and most significantly, it was unchallenged evidence that Mr Foo had never been involved in EPPL or its matters.51Foot Note 51×Foo’s Affidavit at para 34.3.I accordingly find that negligible weight can be placed on the Adjudicator’s prior representation of EPPL. 57 The Adjudicator had also acted for RPPL on two occasions. However, in comparison with the Adjudicator’s connection to EPPL, less time had elapsed since his last association with RPPL: he had last acted for RPPL in August 2013. Moreover, Mr Foo had instructed the Adjudicator in his capacity as the MD of RPPL; thus, the Adjudicator had been directly associated with Mr Foo in acting for RPPL. I also note that the Adjudicator’s dealings with RPPL had spanned about 12 years, as he had first acted for RPPL in 2002 (see [23(a)] above). 58 In my view, a reasonably informed member of the public would be aware of the following and appraise the Adjudicator’s dealings with Mr Foo accordingly. Many SOPA adjudicators are experienced practitioners at the construction bar, who would naturally have dealt with many members of the construction industry during the course of their practice. Thus, it is likely that SOPA adjudicators would have had dealings with the parties who come before them and their representatives. A fair-minded and reasonably informed member of the public would bear this reality in mind in assessing the Adjudicator’s dealings with RPPL. I draw support for this line of reasoning from the New Zealand Court of Appeal’s approach inMan O’War Station Ltd v Auckland City Council[2001] 1 NZLR 552. In that case, a surveyor had testified for a city council at a trial. On appeal, the New Zealand Court of Appeal upheld the trial court’s decision in favour of the council and allowed the council’s cross-appeal. It then transpired that a member of the appellate court had been associated with the surveyor. In particular, the firm which the judge had been a member of had acted for the surveyor’s firm before. An application was then made for the Court of Appeal’s judgment to be set aside. In dismissing the application, Gault J, delivering the court’s judgment, observed at [33] as follows: …Senior legal practitioners with busy commercial and conveyancing practicesmust come into contact and establish business associations with a considerable proportion of the professional practitioners in related fields such as surveying and civil engineering. The proposition that because of such an association they should be regarded as in danger of failure to carry out judicial functions impartially, eight years after retiring from practice, is unreal. … [emphasisadded] 59 In my judgment, a fair-minded and reasonably informed observer, bearing in mind that a SOPA adjudicator would likely have had dealings with the disputing parties or their representatives, would not place much weight on the Adjudicator’s associations with Mr Foo through RPPL: (a)  First, in terms of the intensity of his associations with RPPL, the Adjudicator had acted for RPPL twice over 12 years. Moreover, it was unchallenged evidence that, during this period of time, four other lawyers had acted for companies in the same group as RPPL, in “13 different matters”.52Foot Note 52×Foo’s Affidavit at para 31.Therefore, the Adjudicator’s association with RPPL, while it persisted, could not be considered to be strong or close. (b) Secondly, the Adjudicator’s association with RPPL had ended more than three years before he was appointed as the Adjudicator. Thus, by the time of his appointment, the Adjudicator’s association with RPPL was relatively remote in time. 60 I now turn to the Adjudicator’s association with Mr Foo through his non-executive directorship of RH. In my view, little weight should be accorded to this association with Mr Foo for the following reasons. (a) First, the duration of the association was relatively short: the Adjudicator had held his post as non-independent executive director for slightly more than a year (see [25(b)] above). Notably, Mr Foo deposed that the Adjudicator had been appointed as an independent non-executive director in view of plans to list RH, and had left his post once the plans to list RH did not materialise.53Foot Note 53×Foo’s Affidavit at paras 32.2, 32.4 and 32.5. (b) Secondly, in terms of the intensity of the association, there was scant basis for me to conclude that the Adjudicator had a close association with Mr Foo through his non-executive directorship. The evidence was that the Adjudicator had only interacted with Mr Foo at board meetings, and that there were no more than four such meetings.54Foot Note 54×Foo’s Affidavit at para 32.3. (c) Thirdly, at the time of his appointment as the Adjudicator, close to seven years had passed since the Adjudicator had relinquished his position as non-executive director of RH (see [25(b)] above). 61 Having separately analysed the Adjudicator’s relevant associations in terms of their duration, intensity, and the time which had passed since they ended, I now consider them together in the main. The picture which emerges is this. The Adjudicator had an intermittent professional association with Mr Foo which involved representing RPPL twice over 12 years, and serving as a non-executive director on the same board as Mr Foo for a fairly short time. The Adjudicator was not the only lawyer used by the above companies. His last association with Mr Foo ended more than three years before the adjudication. In his emails, the Adjudicator stated that he had not acted for Mr Foo personally and had never had a personal or social relationship with Mr Foo; there was no evidence before me to contradict these claims, nor did the Plaintiff seek to dispute them. 62 In this light, a fair-minded and informed observer would have no reason to suspect that the Adjudicator’s associations with Mr Foo might influence his decision. In other words, there is no rational link between the Adjudicator’s associations and any prospect of bias. Thus, without more, on the basis of the Adjudicator’s associations alone, the reasonable suspicion test is not fulfilled. 63 Nonetheless, the Plaintiff’s case is not founded on the Adjudicator’s associations alone. The Plaintiff argued that the Adjudicator’s lack of full disclosure and the nature of his responses to queries for information support a reasonable suspicion of bias. I turn now to these arguments. The Lack of Full Disclosure 64 The threshold question is whether the Adjudicator should have (fully) disclosed his associations with Mr Foo, RPPL and RPPL’s related companies at all. In my view, the answer is in the affirmative. This is not a case where the facts patently do not raise a reasonable suspicion of bias. The Adjudicator’s associations suffice to found abona fidecase of apparent bias (see [40] above). Thus, the Adjudicator should have fully disclosed his associations to the parties as a matter of good practice (see [41] above). Moreover, since the Adjudicator learnt that Mr Foo was one of the Defendant’s representatives through the Defendant’s solicitors’ email one day before the Preliminary Conference (see [14] above), he should have made disclosure to the parties at the commencement of the Preliminary Conference. 65 However, I do not regard the Adjudicator’s associations with Mr Foo, RPPL and RPPL’s related companies as sufficiently material such that apparent bias is established based on those associations and non-disclosure of the same. In my view, the Adjudicator fell short of best practices in failing to disclose his associations to the parties. But given the sporadic and limited nature of those associations, a fair-minded observer would not consider that he did so because of bias. Instead, one would consider, and I so find, the non-disclosure to be an honest, non-partisan misjudgement by the Adjudicator regarding the necessity of disclosure (see [42] above). 66 Furthermore, in my judgment, this is not a case in which the Adjudicator’s partial disclosure gives rise to an impression of intentional concealment or non-disclosure (see [44] above). I have found that the Adjudicator informed the parties that he had previous dealings with Mr Foo at the beginning of the Merits Conference (see [20] above). In my view, such partial disclosure did not falsely downplay the nature and extent of the Adjudicator’s dealings with Mr Foo. For stating that one has previous dealings with a party does not suggest anything about the nature and extent of those dealings. Thus, on these facts, a fair-minded observer would not conclude that the Adjudicator was attempting to conceal his previous associations with Mr Foo. Hence, a fair-minded observer would not entertain a reasonable suspicion of bias on the basis that the Adjudicator had deliberately concealed his associations with Mr Foo. 67 For these reasons, the Adjudicator’s omission to fully disclose his associations with Mr Foo does not support a reasonable suspicion that he was biased. Hence, I reject the Plaintiff’s submission that the lack of full disclosure bolsters its case on apparent bias. The Adjudicator’s Responses to Queries Regarding His Associations 68 The Plaintiff submitted that the Adjudicator’s responses to the Plaintiff’s solicitors’ queries, regarding his associations with Mr Foo, support a reasonable suspicion of bias. The Plaintiff relied on the fact that the Adjudicator had failed to disclose the fees which his firm had billed RPPL and his independent non-executive directorship in RH in his two email responses. The Plaintiff argued on this basis that the Adjudicator’s responses “were far from forthcoming and showed his lack of awareness of the unconscious bias that could arise [given] his associations”, and thus supported a reasonable suspicion of bias.55Foot Note 55×Plaintiff’s Submissions at para 73. 69 However, having carefully reviewed the Adjudicator’s two email replies, I do not accept the Plaintiff’s submissions for the following reasons: (a)  First, in terms of the content of the Adjudicator’s responses, the emails were meticulous and thorough; I note that even the Plaintiff’s counsel described the Adjudicator’s second email as “detailed” at the hearing before me.56Foot Note 56×Minute Sheet dated 1 February 2017 at p 2.I cannot criticise the Adjudicator’s refusal to disclose his professional fees. As the adjudicator explained in his email dated 15 November 2016, this is confidential information. While the Adjudicator did not mention his directorship in RH, this was an explicable slip given the remoteness of that association with Mr Foo (see [60] above). (b)  Secondly, in terms of the speed of the Adjudicator’s responses, the Adjudicator did not delay in replying to the queries for information. His first response was sent on the same day as the Plaintiff’s solicitors’ first query. His second response was sent one day after the Plaintiff’s solicitors’ second query. (c) Thirdly, the tone of the emails, while firm and direct, was also objective and tempered. The Adjudicator provided the requested-for information without challenging the propriety of the requests. The facts above are a far cry from those inCofelywhere the arbitrator had been evasive, dilatory and partisan upon receiving a request for information. They do not suggest a reasonable suspicion of bias on the Adjudicator’s part. 70 In summary, the Plaintiff’s substantive case on apparent bias is not made out. This suffices to dispose of the first ground of challenge to the Adjudication Determination. However, for good measure, I now consider the issue of waiver. Waiver 71 While the parties presented differing accounts of what the Adjudicator had stated at the Conferences, it is undisputed that the Adjudicator did not reveal full details of his associations with Mr Foo. As stated above, in my judgment, the Adjudicator thus fell short of good practice in failing to fully disclose his associations with Mr Foo at the Merits Conference (see [65] above). 72 But I have also found that the Adjudicator stated that he had “previous dealings” with Mr Foo at the start of the Merits Conference (see [20] above). In my judgment, the reference to “previous dealings” was sufficient to place the Plaintiff on enquiry for the following reasons: (a) First, “dealings” connotes business relations or transactions. I note that, inThe Oxford English Dictionaryvol IV (Clarendon Press, 2nd Ed, 1989), “dealing” is defined at p 297 as “Intercourse, friendly or business communication, connexion”. But other dictionaries define the term more specifically. For example, theOxford Advanced Learner’s Dictionary of Current English(Oxford University Press, 5th Ed, 1995) defines “have dealings (with sb)” at p 298 as “to have relations with sb,esp in business” [emphasis added]; again,Chambers English Dictionary(Chambers, 1990) defines “dealing” at p 363 as “manner of acting towards others: intercourseof trade” [emphasis added]. In my judgment, in the context in which the Adjudicator made his disclosure, the Plaintiff would have understood “previous dealings” in this more restricted sense. That the Plaintiff was represented by solicitors at the Merits Conference fortifies this conclusion (see the second factor identified at [53] above). (b) Secondly, the Adjudicator did not misrepresent his relationship with Mr Foo by describing it in terms of “previous dealings”. If I had found that the Adjudicator had simply said “we have met before” or similar words, I would have had little hesitation in finding that insufficient information had been disclosed to put the Plaintiff on notice. Similarly, if the Adjudicator’s association with Mr Foo had also involved a personal relationship, which the Adjudicator had made no mention of to the Plaintiff, I would also have found that insufficient information had been disclosed to put the Plaintiff on notice (see the first consideration noted at [53] above). But these are not the facts here. 73 Thus, the Plaintiff was put on notice that an issue of apparent bias might lie because the Adjudicator had disclosed sufficient information to the Plaintiff to alert it to the facts,viz, previous (business) dealings, underlying this issue. 74 Having concluded that the Plaintiff was put on inquiry, I now consider whether there are any strong reasons why it should nonetheless be allowed to contend, upon being met with the Defendant’s argument on waiver, that it did not have knowledge of all the material facts at the relevant time, such that it did not waive its right to raise an apparent bias challenge. In my judgment, there are no such strong reasons. The Plaintiff had no satisfactory explanation why it had not made inquiries into the Adjudicator’s associations with Mr Foo once the Adjudicator had disclosed that he had previous dealings with Mr Foo. When I pressed Mr de Vaz on this point, his telling answer was: “[f]or expediency, we raised the challenge later”.57Foot Note 57×Minute Sheet dated 1 February 2017 at p 9.When I then asked Mr de Vaz if I should conclude that his client had only raised queries about the Adjudicator’s associations with Mr Foo because it was unhappy with the Adjudication Determination, he said candidly that such unhappiness was “true in every case where one seeks to set aside the AD”.58Foot Note 58×Minute Sheet dated 1 February 2017 at p 9.I therefore conclude that the “strong reasons” exception to the rule stated at [52] above does not apply here. 75 Thus, applying that rule, the Plaintiff is deemed to have full knowledge of all the material facts at the relevant time such that the first element of waiver is fulfilled. Accordingly, the Plaintiff’s argument on the waiver point falls away. Hence, I find that the Plaintiff had waived its right to challenge the Adjudication Determination on the ground of apparent bias.",
        "Conclusion on the Apparent Bias Issue": "76 A fair-minded and reasonably informed observer would not reasonably suspect that the Adjudicator was biased. In any case, the Plaintiff had waived its right to challenge the Adjudication Determination on the basis of apparent bias. Therefore, I reject the Plaintiff’s submission that the Adjudication Determination should be set aside for apparent bias. 77 I now turn to the Timing Issue.",
        "The Timing Issue": "78 I first set out the key contractual provisions and the legal background to the parties’ arguments.",
        "The Key Contractual Provisions": "79 The Plaintiff entered into the Sub-Contract with the Defendant (see [3] above) which comprised a Sub-Contract Agreement (“the Sub-Contract Agreement”) and the documents specified in Section 6 of the First Schedule to the Sub-Contract Agreement (“the Documents”): see the definition of the Sub-Contract in cl 1.1 of the Sub-Contract Agreement.59Foot Note 59×Teow’s 1st Affidavit at TSH-1 (p 148).The Documents consisted of ten Annexes.60Foot Note 60×Teow’s 1st Affidavit at TSH-1 (p 167).Annex 1, which was entitled “Summary of Contract Negotiations” (“the SOCN”), is relevant for present purposes. 80 Clause 19.1 of the Sub-Contract Agreement (“cl 19.1”) states:61Foot Note 61×Teow’s 1st Affidavit at TSH-1 (p 159). 19. Payment 19.1 The Supplier agrees and accepts thatthe relevant provisions of the SOPA shall apply to this Sub-Contract in respect of payment claim(s), payment response(s) and the date(s) on which progress payment(s) become[s) due and payable. Details of the terms of payment are set out in item E of theAnnex 1 – Summary of Contract Negotiations. [emphasis added in italics] 81 Item E of the SOCN provided as follows:62Foot Note 62×Teow’s 1st Affidavit at TSH-1 (p 179). E.TERMS OF PAYMENT: A1l above payments shall be effected within35 daysfrom the date of invoice. The original copy of progress claim for work done shall be submitted to UESH on the 15th of each month on a monthly basis. Such claim shall then be assessed and approved for payment by authorized UESH personnel in the form of UESH interim valuation certificate.The interim certificate would be issued to the Sub-Contractor within 21 days from the date of receipt of progress claim by UESH. Should the Sub-Contractor fail to submit by the above specified date the progress claims shall be assessed and evaluated in the following month. … [emphasis added in italics] 82 It was undisputed that the terms of payment provided for under Item E of the SOCN were subsequently varied, by a letter dated 28 July 2015 (“the 2015 Letter”).63Foot Note 63×Teow’s 1st Affidavit at TSH-1 (p 282); Minute Sheet dated 1 February 2017 at p 10.The material portions of the 2015 Letter were as follows: … 2.  With effect from August 20l5,all Progress Claims must be submitted on or before 25th of each month…. h. Payment response and issuance of interim valuation certificate shall bewithin twenty-one (21) days from the submission cut-off date (25th of the month). … This letter shall form an integral part of the Contract. [emphasis added] Thus, under para 2h of the 2015 Letter (“Para 2h”), with effect from August 2015, the Defendant was required to submit its progress payment claims on or before the 25th of each month. The Plaintiff was required to submit its payment response “within twenty-one (21) days” from the 25th of each month.",
        "The Legal Background to the Parties’ Arguments": "83 It is settled law that an adjudication determination is liable to be set aside if it flows from an adjudication application which was lodged out of time: seeYTL Construction (S) Pte Ltd v Balanced Engineering & Construction Pte Ltd[2014] SGHC 142 at [43]-[49] andUES Holdings Pte Ltd v Grouteam Pte Ltd[2016] 1 SLR 312 (“Grouteam(HC)”) at [51]. 84 In relation to a construction contract, the deadline for filing an adjudication application hinges on the deadline for a payment response. This is clear from the following provisions of the Act: (a) s 13(3)(a) states that an adjudication application “shall be made within 7 days after the entitlement of the claimant to make an adjudication application first arises under [s 12]”; (b) s 12(2) provides that, in relation to a construction contract, the claimant’s right to make an adjudication application arises after the end of the dispute settlement period (“the DSP”); and (c)  s 12(5) defines the DSP as “the period of 7 days after the date on which or the period within which the payment response is required to be provided under [s 11(1)]”. 85 Section 11(1) of the Act provides as follows: 11.—(1) A respondent named in a payment claim served in relation to a construction contract shall respond to the payment claim by providing, or causing to be provided, a payment response to the claimant — (a)by the date as specified in or determined in accordance with the terms of the construction contract, or within 21 days after the payment claim is served under section 10, whichever is the earlier; or (b) where the construction contract does not contain such provision, within 7 days after the payment claim is served under section 10. [emphasis added] Thus, under s 11(1), where a construction contract provides that the respondent to a payment claim shall submit a payment response by a date (“the Payment Response Deadline”), the respondent must submit the payment response by either the Payment Response Deadline, or within 21 days after the payment claim is served (“the 21-Day Deadline”), whichever is earlier. 86 Importantly, public holidays are not accounted for in calculating the 21-Day Deadline. Under the definition of “day” in s 2 of the Act (“the Statutory Definition”), a “day” does not include a public holiday. Section 2 states: 2. In this Act, unless the context otherwise requires — … “day” meansany day other than a public holidaywithin the meaning of the Holidays Act (Cap. 126); … [emphasis added]",
        "The Incorporation Issue": "93 To recapitulate, cl 19.1 provides as follows: 19.1 The Supplier agrees and accepts thatthe relevant provisions of the SOPA shall apply to this Sub-Contract in respect of payment claim(s), payment response(s) and the date(s) on which progress payment(s) become[s) due and payable. … [emphasis added] 94 InGrouteam(HC), I analysed an identical provision at [20] as follows: … By this clause it is also clear that the parties accepted that the relevant provisions of the Act were to apply to payment claims, payment responses and the dates on which progress claims become due and payable. However that does not take us very far becausethe relevant provisions of the Act, viz, s 8(1) relating to the due date for payment, s 10(2) relating to payment claims, and s 11(1) relating to payment responses, refer us back to the contract provisions. Accordingly, we have to turn back to the Subcontract to ascertain if … [any contractual provision] governs the due date for submission of payment claims and responses for the purposes of the Act. [emphasis added] Thus, inGrouteam (HC), I stated that the “relevant provisions” of the Act which cl 19.1 referred to, which the parties accepted would apply, were ss 8(1), 10(2) and 11(1). While the CA allowed Grouteam’s appeal against my decision (seeGrouteam Pte Ltd v UES Holdings Pte Ltd[2016] 5 SLR 1011 (“Grouteam (CA)”), the CA did not comment on my interpretation of cl 19.1. Rather, the CA allowed the appeal on the basis that the provision governing the submission of payment claims was not the provision which I had identified; it followed that the payment claim had been served in time (seeGrouteam(CA)at [44]). 95 In my judgment, cl 19.1 did not incorporate the Statutory Definition into the Sub-Contract (in respect of payment responses) for the following reasons: (a) First and foremost, on a plain and natural reading, cl 19.1 merely states the parties’ acknowledgment that the relevant provisions of the Act govern the Sub-Contract: it does not purport to incorporate any provision of the Act into the Sub-Contract. (b) Secondly, to depart from this plain reading, by holding that cl 19.1 incorporates provisions of the Act into the Sub-Contract, would not make sense. Under s 4(1) of the Act, the provisions of the Act apply to the Sub-Contract regardless of whether parties incorporate them into their contractual arrangements. Thus cl 19.1 would be superfluous if it incorporated any provisions of the Act into the Sub-Contract. 96 Thus, cl 19.1 does not incorporate the Statutory Definition into the Sub-Contract (in respect of payment responses): the parties did not expressly agree, by cl 19.1, that the Statutory Definition should apply in respect of payment responses. In that light, I turn to the true interpretation of the word “days” in Para 2h of the 2015 Letter.",
        "The Interpretation Issue": "97 InFujitec Singapore Corp Ltd v GS Engineering & Construction Corp[2016] 1 SLR 1307 (“Fujitec”), the construction contract provided that payment responses would be issued within “21 calendar days of receipt of the progress claims”. In interpreting this clause, Lee Seiu Kin J remarked at [10] as follows: … While the word “day” is defined in the Act, that definition is meant to apply to that word wherever it is found in the Act. There is nothing in the Act compelling the use of that definition in any construction contractalthough parties are free to adopt such definitions by express provision. In appropriate circumstances, in interpreting a construction (or supply) contract the payment terms of which falls within the purview of the Act, it could be possible to hold that the same interpretation was meant in the contract. But this depends on the circumstances. The respondent submitted that it was appropriate to do it in the present case.If the term concerned was “day”, I would have little hesitation to do so. Unfortunately for the respondent it is not. Instead, the Contract uses “calendar day”. The counter-submission advanced by the applicant was that there must have been a reason for the use of a different term in the Contract. The applicant submitted that the reason was becausethe Contract intended a different concept for “calendar day” compared to “day” simpliciter, and this was that public holidays would also be counted. [emphasis added] 98 Both parties relied on this passage in their submissions. The Plaintiff submitted that, since the Statutory Definition had not been expressly adopted, the word “days” in Para 2h should not be read in accordance with the Statutory Definition; the ordinary and natural meaning of the word “day” should apply.71Foot Note 71×Minute Sheet dated 1 February 2017 at p 16; Plaintiff’s Submissions at paras 104 – 105.By contrast, the Defendant emphasised Lee J’s comment that he would have had “little hesitation” to interpret the word “day”, if it had been used in the contract which he had considered, in accordance with the Statutory Definition.72Foot Note 72×Defendant’s Submissions at paras 81 – 82. 99 InZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”), the CA affirmed the contextual approach to contractual interpretation in Singapore: seeZurich Insuranceat [114]. The CA also endorsed, at [131], a summary of principles of contractual interpretation in Gerard McMeel,The Construction of Contracts: Interpretation, Implication and Rectification(Oxford University Press, 2007) at paras 1.124–1.133. In particular, the CA endorsed the following principle: The contextual dimension Fourthly, the exercise in construction is informed by the surrounding circumstances or external context. Modern judges are prepared to look beyond the four corners of a document, or the bare words of an utterance.It is permissible to have regard to thelegal, regulatory, and factual matrixwhich constitutes the background in which the document was drafted or the utterance was made. [emphasis in original in bold italics; emphasis added in italics] Thus, the legal and regulatory backdrop of a contract is part of its context. In particular, a statutory definition may form part of the context of a contract such that a term used in the contract should be interpreted in accordance with the statutory definition. In Kim Lewison,The Interpretation of Contracts(Sweet & Maxwell, 6th Ed, 2015) (“Lewison”), the relevance of statutory definitions to the interpretation of contractual terms is discussed at para 5.16 at p 289, as follows: … The mere fact that a contract uses a word that is defined by statute does not make that word a legal term of art. Thus where the holder of an option agreed to apply for planning permission for “development” of property it was held that the word “development” was to be construed in a non-technical sense rather than in accordance with its statutory definition in town and country planning legislation.However, where an agreement has been drawn with the provisions of statutorily defined words in mind, some particular context is required before the court can attribute to the parties an intention to use such a term in a different sense to that which it has in the legislative context. [emphasis added] 100  InCastlebay Limited v Asquith Properties Limited[2005] EWCA Civ 1734 (“Castlebay”), whichLewisoncites for the italicised proposition in the extract above, the English Court of Appeal considered the true interpretation of the phrase “application for planning permission” in an option to purchase. At the material time, Asquith had obtained outline planning permission. However, its application for approval of certain reserved matters was pending. Under the planning legislation, “application for planning permission” denoted application for outline planning permission and did not refer to application for approval of reserved matters. The question arose as to whether the phrase “application for planning permission” in the option should be interpreted in accordance with its statutory meaning. In answering that question in the affirmative, Chadwick LJ, delivering the court’s principal judgment, reasoned at [46] – [47] as follows: 46 …this is clearly an agreement which has been drawn with the provisions of the planning legislation fully in mind. In those circumstances, I would expect the parties to have intended, by the phrase \"application for planning permission\", the meaning which that phrase has long been recognized to bear in the context of planning legislation. If there were a context which required that meaning to be enlarged, the court would give effect to that requirement, as it did in theHargreavescase. But,absent any context which requires some larger meaning, I am left with an agreement which is intended to strike a balance between the interests of the owner and the interests of the grantee. And I am left with the firm conclusion that,if these parties had intended some meaning to be given to the phrase, \"any application for planning permission\" wider than the meaning which that phrase normally bears, they would have made that clear. 47.The parties have not made that clear. So I am left with the meaning which the judge gave to that phrase; which is the meaning which it bears in planning legislation. … [emphasis added] I agree. When parties contract with the provisions of a statute in mind, and when the terms of those statutory provisions are defined by that statute, then generally, if the contract uses the same terms, the terms should be interpreted in accordance with the statutory definitions, unless the context yields a different interpretation. This is simply an application of the principle of contextual interpretation. 101 In this case, it is beyond doubt that the parties contracted with s 11(1) of the Act, which provides for the timeline for payment responses, in mind. For by cl 19.1, the parties expressly acknowledged that s 11(1), which is one of the “relevant provisions” of the Act which cl 19.1 refers to (see [94] above), would apply to the Sub-Contract. Section 11(1) uses the word “days” which is defined in s 2 of the Act to exclude public holidays. Moreover, the word “days” is a fundamental operative word in s 11(1) because s 11(1) is concerned with the calculation of the timeline for payment responses. I now turn to consider the phrase “twenty-one (21) days” in Para 2h of the 2015 Letter. The word “days” here is also being used in the context of determining the timeline for payment responses, because it affects the Payment Response Deadline. In the light of the foregoing, in my judgment, the word “days” in Para 2h should be interpreted in accordance with the Statutory Definition unless the context indicates otherwise. 102 But there is nothing which indicates that a different interpretation of the word “days” in Para 2h is appropriate. During oral submissions, Mr de Vaz brought my attention to a letter from the Plaintiff to the Defendant dated 20 June 2016 (“the 2016 Letter”). The material terms of the 2016 Letter are as follows:73Foot Note 73×Teow’s 1st Affidavit at TSH-1 (p 283) … 1.  This is a gentle reminder to submit your Progress Claim every 25th of the monthor on the subsequent working day if 25th falls on a Sunday/Holiday. 2.Requirements and other procedures forclaim submissionand payment responses shall follow the items listed in [the 2015 Letter]. … [emphasis added] But I do not think that this letter advances the Plaintiff’s case. First, as Ms Neo noted, it is not a contractual document.74Foot Note 74×Minute Sheet dated 1 February 2017 at p 15.Secondly, it deals with the date of submission of payment claims and not the timeline for payment responses.75Foot Note 75×Defendant’s Submissions at para 79; Minute Sheet dated 1 February 2017 at p 15.Paragraph 2 of the 2016 Letter expressly provides that the 2015 Letter governs the requirements and procedures for payment responses. Thirdly, as I suggested at the hearing on 1 February 2017, the 2016 Letter admits of multiple interpretations,76Foot Note 76×Minute Sheet dated 1 February 2017 at p 11.some of which do not support the Plaintiff’s case. For example, the 2016 Letter suggests that the Plaintiff envisaged that, in deciding the contractually stipulated deadline for submitting payment claims, public holidays should not be included. This would arguably be consistent with applying the Statutory Definition in interpreting the word “days” in Para 2h, for that would ensure consistency between the contractually stipulated deadlines for payment claims and payment responses to this extent: both timelines would not account for public holidays. In sum, there is nothing in the 2016 Letter which indicates that the word “days” in Para 2h of the 2015 Letter should not be interpreted in accordance with the Statutory Definition. 103 I conclude that the word “days” in Para 2h of the 2015 Letter should be interpreted in line with the Statutory Definition to exclude public holidays.",
        "Conclusion on the Timing Issue": "104 The parties did not expressly agree that the Statutory Definition should apply to the word “days” in the Sub-Contract. However, in the absence of such express agreement, the Statutory Definition applies in any case for the reasons above. Therefore, I conclude that the Payment Response Deadline was 21 days excluding public holidays after 25 August 2016,viz, 16 September 2016. It follows that the Defendant’s account of the time for lodging the Adjudication Application was correct. Hence, the Adjudication Application was lodged in time. Accordingly, this challenge to the Adjudication Determination fails. 105 I now turn to the Content Issue.",
        "The Content Issue": "106 The Notice stated as follows:77Foot Note 77×Teow’s 1st Affidavit at para 10 and TSH-1 (p 304). We refer to the above and to our Progress Payment Claim No. 16 ref. KHF/P22/2016/PC16 dated and served on you on 25 August 2016 for the claimed amount of S$1,642,751.13 (the “Payment Claim”). We disagree with and dispute your response amount of S$(91,371.23), set out in your Interim Valuation Certificate No. 16 served on us on 14 September 2016. Given the circumstances, we hereby give you notice of our intention to apply for adjudication of the dispute in respect of our Payment Claim. 107 The Plaintiff submitted that the Adjudication Determination should be set aside on the basis that the Notice was defective.78Foot Note 78×Plaintiff’s Submissions at paras 120 – 136.In particular, the Plaintiff submitted that the Notice violated reg 7(1)(f) of the Regulations (“reg 7(1)(f)”), which states: 7.—(1) Every notice of intention to apply for adjudication shall contain the following particulars: … (f)a brief description of the payment claim dispute. [emphasis added] 108 However, not all breaches of the Act or the Regulations render an adjudication determination liable to be set aside. InLee Wee Lick Terence (alias Li Weili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal[2013] 1 SLR 401, the CA held at [67] that the court may set aside an adjudication determination if the claimant had violated a provision “which is so important thatit is the legislative purpose that an act done in breach of the provision should be invalid…” [emphasis in original]. The Plaintiff recognised this point, and argued that reg 7(1)(f) was such a fundamental provision. The Plaintiff noted that the Notice was the only document in respect of which a description of the payment claim dispute is required, and submitted that such a description is practically important because it helps the respondent to a payment claim decide whether to pursue settlement of the claim with the claimant or to proceed to adjudication.79Foot Note 79×Plaintiff’s Submissions at paras 125 – 126 and 135. 109 InAik Heng, the applicant argued that the adjudication determination should be set aside because the notice of intention to apply for adjudication (“the s 13(2) notice”) breached,inter alia, reg 7(1)(c)(iii) of the Regulations. The notice did not state the date of the contract, as required under reg 7(1)(c)(iii),ie, the date on which the Letter of Award was accepted, but the date of the Letter of Award. However, Lee Seiu Kin J held that the breach did not warrant setting aside the adjudication determination and reasoned at [12] – [14] as follows: 12 I consideredAustralian TimberinProgressive Builders Pte Ltd v Long Rise Pte Ltd(“Progressive Builders”), in which I held at [58] that a payment claim would only be invalidated for failure to comply with s 10(3)(a) of the Actwhere that failure impeded the adjudication process. WhileAustralian TimberandProgressive Buildersrelated to the validity of a payment claim and not a notice of intention under s 13(2) of the Act, in my view, that reasoning was equally applicable. It is one thing to suggest that a failure to notify a respondent under s 13(2) of the Act deprives an adjudicator of any jurisdiction to adjudicate the matter; it is another thing altogether to say that any deficiency whatsoever in that notice would render it invalid. There is no doubt that the service of a notice of intention under s 13(2) of the Act is a jurisdictional requirement. What founds the jurisdictional nature of the requirement under s 13(2), in the sense that the condition is essential to the existence of an adjudicator’s determination, is that a respondent must know of the case he has to meet and be allowed to prepare his response. 13 … I was of the view that the breach of reg 7(1)(a) [sic] in the present case (ie, stating the date of the Letter of Award and not the date of the acceptance) was a technical breach which was insufficient to invalidate the notification.The formal requirements in reg 7(1) were clearly intended to ensure that a respondent has sufficient notice under s 13(2) of the Act. As I had stated inProgressive Buildersat [58], the Act, characterised by speed and informality, should not be countenanced by an excessively technical approach. 14 In the present case, counsel for the respondent conceded that the respondent was able to identify the subcontract in dispute, despite the fact that the date of the Letter of Award (and not the date the subcontract was made) was stated in the NOI.There was no doubt that it had, by way of the NOI, been notified of the applicant’s intention to apply for adjudication of the payment claim dispute, and that it was able to prepare its substantive response accordingly. This reinforced my finding that breaches of this nature do not render a notice of intention invalid. I therefore rejected the respondent’s submission on this ground. [emphasis added] This passage establishes the following two propositions: (a)  First, the touchstone for whether an adjudication determination should be set aside, on the basis that the s 13(2) notice which gave rise to the adjudication did not comply with the Regulations, is whether “that failure impeded the adjudication process”. (b) Secondly, a key consideration is whether, notwithstanding the failure to comply with reg 7 of the Regulations, the respondent was still notified for the applicant’s intention to apply for adjudication and was able to prepare its substantive response accordingly. 110 I note that the discussion of reg 7(1)(f) in Chow Kok Fong,Security of Payments and Construction Adjudication(LexisNexis, 2nd Ed, 2013) (“Chow”) at para 8.28 may appear to support the Plaintiff’s case: The requirement that the adjudication notice should contain a ‘brief description of the payment dispute’ is of considerable practical significance. Both [the Act] and Regulations are silent on the matters to be included in the description but it is considered that it should take the form of a statement of the claimant’s reasons in law and in fact supporting the payment claim. Where the adjudication application concerns a relatively small matter, the adjudicator may decide to proceed on the basis of the documents submitted. In such a situation, thisdescription may serve as a brief statement of the case for the payment claim. Where the dispute involves substantial amounts or relatively more complex issues, the adjudicator may call for further submissions or convene a conference. In these situations,the description is still tactically important as it encapsulates the thrust of the claimant’s arguments before the main submissions. [emphasis added] 111 However, I do not consider that reg 7(1)(f) is such a key provision that an adjudication determination may be set aside for breach of reg 7 (1)(f) alone: (a) First, applying the two propositions stated at [109] above, I do not consider that a notice issued in breach of reg 7(1)(f) will impede the adjudication process. Even if it does not contain “a brief statement of the case for the payment claim” or “the thrust of the claimant’s arguments” (which, in my view, is the basis for the comment inChowthat reg 7(1)(f) “is of considerable practical significance”), the notice will effectively communicate the claimant’s intention to the respondent (insofar as the other requirements of reg 7(1) are satisfied). Therefore, the s 13(2) notice will still serve its core function under the Act; hence, breach of reg 7(1)(f) will not impede the adjudication process. (b) Secondly, the Plaintiff’s argument that fulfilling reg 7(1)(f) is important to apprise a respondent of the nature of the claim, in order that the latter may decide whether to pursue settlement or adjudication (see [108] above), is not compelling. Generally, by the time that the s 13(2) notice is served, the Plaintiff will have received the payment claim. Under reg 5(2)(c), this will contain details such as a breakdown of the items constituting the claimed amount, a description of the items, the quantity or quantum of each item and the calculations showing how the claimed amount was derived. Thus, the Plaintiff will generally have sufficient information to decide whether to pursue settlement or adjudication before receiving a s 13(2) notice. I do not consider that the failure to provide even more information, due to breach of reg 7(1)(f), should be sufficient basis to set aside an adjudication determination. 112 More importantly, in this case, the Notice indicated that the Defendant intended to apply for adjudication in respect of the Payment Claim which it had submitted on 25 August 2016 (see [106] above). The Payment Claim included a breakdown of the items, the quantum claimed, and showed how the total claimed amount was derived. The Notice further indicated that the Defendant disagreed with the Payment Response, which itself contained details supporting the position set out therein. Thus, the Plaintiff must have been well aware of the nature of the dispute between the parties and the case which it had to meet during the adjudication proceedings. Plainly, any failure by the Defendant to comply with reg 7(1)(f) did not cause the Plaintiff any prejudice. 113 For the reasons, I reject the Plaintiff’s final challenge to the Adjudication Determination.",
        "Conclusion": "114 Each ground of challenge to the Adjudication Determination fails. Thus, I dismiss the Plaintiff’s application to set aside the Adjudication Determination. 115 I will hear parties on costs.  Quentin LohJudge Ian de Vaz, Tay Bing Wei and Lau Zi Hui (WongPartnership LLP) for the plaintiff;Monica Neo Kim Cheng and Karen Oung Hui Wen (Chan Neo LLP) for the defendant."
    }
}