{
    "case_title": "CPIT Investments Ltd vQilin World Capital Ltd and another",
    "ncitation": "[2017] SGHC(I) 05",
    "coram": "Vivian Ramsey IJ",
    "sections": {
        "Introduction": "1 These proceedings concern a non-recourse loan under which shares were provided as collateral for the loan. The issues dealt with in this judgment concern the rights and liabilities of the parties, including the rights of the lender to sell the shares provided as collateral and the rights of the borrower to terminate the two agreements under which the loan was made, together with the liabilities of the parties which arise from the sale of the shares and the termination of the agreements. 2 In this judgment I shall refer to the Plaintiff borrower as “CPIT”. There is an issue as to whether the First Defendant, a Hong Kong company or the Second Defendant, a British Virgin Islands company is the relevant lending party. They both have the same name. I shall refer to the relevant party as “Qilin”. 3 A list of issues has been produced and I shall deal with those issues under a series of topics before summarising my answers to the issues at the conclusion of this judgment by way of an annex.",
        "Background": "4 In late 2015, CPIT was seeking to raise finance. CPIT had a substantial shareholding in Millennium Pacific Group Holdings Limited (“Millennium”). Millennium’s stock code is 8147 and its shares are publicly traded on the Growth Enterprise Market of the Hong Kong Stock Exchange. 5 In about mid-October 2015, Lee Kai Ming, also known as Prior Lee (“Mr Lee”), was introduced to Sum La Lok Alex (“Mr Sum”) who, among other things, was a valuation surveyor in Hong Kong. Mr Sum apparently had contacts in the Hong Kong financial sector and acted through a consultancy, All Might Investments Limited (“All Might”). Mr Lee’s precise role within or on behalf of CPIT is not clear but Mr Sum mentioned to him that there was an opportunity for CPIT to obtain loan facilities of up to HK$200,000,000.00. This information was relayed by Mr Lee to the sole director of CPIT, Chan Kwong Chi Vicky (“Mr Chan”) who was evidently interested in this potential loan. 6 Mr Lee then pursued this loan opportunity with Mr Sum and, on 27 October 2015, Mr Sum emailed a “Term Sheet For Non-Recourse Loan Relating To Shares of [Millennium]” dated 26 October 2015 to Mr Lee. Mr Sum stated the terms, in summary, as “final offer is 36 months on LTV 50% of 8147. 4% interest + 1.5% lender fee + 5% handling fee (All Might)”. 7 It seems that the term sheet was provided to Mr Sum by Ms Becky Suen (“Ms Suen”). Ms Suen was formerly a stockbroker but by October 2015 she was working as a stock loan agent. She used a business card indicating that she was a Senior Account Manager with MIFA Data Service Company Limited (“MIFA”). That company was run by a person called Laurence, a mutual friend of Mr Sum and Ms Suen and the person who had introduced them to each other. 8 Ms Suen operated as an intermediary bringing lenders and borrowers together. She said that she came to know of Qilin in about September 2015 as a result of an internet search. She said that this led to contact with Morgan Wilbur (“Mr Wilbur”) at Qilin. Ms Suen explained that when there was a potential borrower she would first obtain a term sheet from Qilin which she would provide to a potential borrower. If the terms of the term sheet were acceptable to that borrower she would proceed to the next stage, which was to send template documents consisting of a financing agreement and a control agreement. Ms Suen explained that the name of the lender was not mentioned in the term sheet to protect the interests of the intermediary and the lender. This avoided people bypassing the intermediary and also avoided people making Qilin’s terms known to competitors. 9 Following receipt of the terms on the term sheet of 27 October 2015, Mr Lee discussed those terms with Mr Chan. Mr Chan also discussed the commercial terms of the loan with Chu Chun Kit (“Mr Chu”), an acquaintance of his and of Mr Lee. Mr Chan said that the terms were acceptable to CPIT and Mr Lee then communicated this to Mr Sum.  Mr Sum, it seems, in turn communicated this to Ms Suen because, on 28 October 2015, Qilin’s Chief Administrative Officer emailed Ms Suen drafts of a Stock Secured Financing Agreement and a Control Agreement. They identified CPIT as the prospective borrower and Qilin as the potential lender. However, in error, they showed the wrong stock code for Millennium, 8397 instead of 8147. 10 Those documents were sent by Ms Suen to Mr Sum who sent them to Mr Lee on 6 November 2015. At some stage the identity of Qilin had been deleted from the two agreements. Mr Sum said in an email that he would ask the lender to amend the stock code and he asked Mr Lee to pass the agreement to CPIT for review. He requested certain documents in terms of relevant CPIT board resolutions, CPIT’s account statement showing its holding and other necessary identification documentation. 11 On 12 November 2015 Mr Sum sent an email to Mr Lee referring to a checklist of the documents required to open the “custodian account” and indicated the documents which CPIT would have to sign the following week in the office of Qilin’s lawyers firm. These included a Commission Agreement (“the Commission Agreement”) between CPIT and Mr Sum’s consultancy, All Might, which was signed but now only exists in the draft version sent by Mr Sum to Mr Lee on 6 November 2015. The documents also included an account opening form with Prominence Financials Limited (“Prominence”) sent by Mr Sum to Mr Lee on 13 November 2015. 12 There was no direct contact, it seems, in relation to setting up the transaction except between Mr Chan and Mr Lee, Mr Lee and Mr Sum, Mr Sum and Ms Suen and Ms Suen and Qilin. 13 On 16 November 2015, Mr Lee, Mr Chan and Mr Chu met Mr Sum. This was the first contact between Mr Sum and Mr Chan or Mr Chu. Mr Sum then took Mr Chan, Mr Lee and Mr Chu, to the office of Qilin’s solicitors, M/s Gallant YT Ho (“Gallant”), in Hong Kong although he did not stay for the meeting. Ms Suen was also in attendance and Mr Chan, Mr Lee and Mr Chu were introduced to her for the first time. She was asked by Mr Chu whether she was from Qilin and she said that she was not but was from an intermediary. She produced her business card from MIFA. 14 A lawyer working for Gallant, Leung Yunn Kei Kelvin (“Mr Leung”) or his assistant handed Mr Lee execution copies of a Stock Secured Financing Agreement and a Control Agreement which identified Qilin as the lender. Mr Chan executed those agreements and the Prominence account opening forms and left them with Gallant for Qilin to sign. The two agreements, both dated 16 November 2015, were a Stock Secured Financing Agreement made between CPIT and Qilin (“the Loan Agreement”)and a Control Agreement made between CPIT, Qilin and Prominence (“the Control Agreement”) (collectively, “the Agreements”). 15 Before leaving Gallant’s offices, Mr Lee gave Ms Suen details of CPIT’s nominated bank account for the loan to be deposited into. It appears that, at the time, CPIT did not have a bank account in Hong Kong. Ms Suen then drafted a manuscript note in which she wrote: “It is resolved that our company agrees to assign the loan to MK Investments Limited. Please send the fund to the bank account below.” The bank account details for MK Investments Limited were then set out and the document was signed by Mr Chan. 16 A few days after 16 November 2015, Mr Chan asked Mr Chu to contact Ms Suen to confirm that the Agreements had been executed by Qilin and to ask when the loan would be ready for disbursement. Ms Suen* said that the signed agreements would be provided to CPIT and that Qilin was still calculating the closing/strike price for the Millennium shares and needed to see the closing price for five days to calculate an average. 17 Mr Sum had some involvement in relation to the opening of a bank account for CPIT. On 20 November 2015, DBS Bank (Hong Kong) Ltd (“DBS”) confirmed by an email to Mr Sum that it had received CPIT’s application to open a current and savings account and that it was being processed. It seems that Prominence needed proof of the bank account opening and Ms Suen forwarded the email from DBS to Cheng Yin Kong Michael (“Mr Cheng”), the Chief Operating Officer of Qilin, which he then sent to Prominence. The Prominence account (“Prominence Account 03”) was then opened and on 22 November 2015, Mr Cheng emailed Ms Suen to say that she might want to send instructions to CPIT to transfer the shares to that account. 18 It seems that these instructions were relayed by Ms Suen to Mr Sum. Mr Sum contacted Mr Lee and requested that CPIT transfer 210,000,000 Millennium shares to the Prominence account. This was more than the 187,272,728 shares stipulated in the Loan Agreement and Mr Chan said that this was for convenience and to allow for fluctuations in the price of the shares. Ms Suen informed Mr Cheng on 23 November 2015 that the 210,000,000 shares would be transferred on 24 November 2015 and, on that date, CPIT did make a transfer of those shares from its Emperor Securities Ltd account to Prominence Account 03. 19 Mr Chu was then asked by Mr Chan to check on the status of the loan. Mr Chu called Ms Suen on several occasions to chase the release of the loan. She told him that Qilin was finalising the closing/strike price and that she would be sending over a Closing Statement soon. Mr Chan also asked Mr Lee to chase the loan and he then spoke to Mr Sum. Mr Sum informed him that Qilin proposed for CPIT to draw down HK$31,250,000.00 for the first tranche of the loan and for CPIT to pledge 25,000,000 Millennium shares as security for the loan based on the average closing price of the past 10 days of HK$2.50 per share. Mr Sum explained that this would be the first of three tranches of the loan. 20 On 2 December 2015 at 10:13 Ms Suen sent Mr Chu the Closing Statement showing the transaction for the first tranche as Mr Sum had explained to Mr Lee. She asked Mr Chan to sign it with the company chop and return it to her. It was sent back the same day at 14:47 signed by Mr Chan but, in error, it was dated by him as 4 December 2015. 21 By letter dated 2 December 2015, Qilin gave instructions to Prominence to create a sub account in the name of “Qilin sub acct CPIT Invs Ltd” and transfer 25,000,000 Millennium shares (“the Pledged Shares” or “the Collateral”) into that new account on 2 December 2015 and also to transfer HK$30,781,250 to that account and then transfer that sum into the CPIT Prominence Account 03. A new Prominence account “Qilin World Capital Limited – Sub Ac – CPIT Investments Limited” (“Prominence Account 20”) was opened and those transactions took place. On 11 December 2015, Millennium made a voluntary Hong Kong Stock Exchange announcement in relation to the “pledge of shares by the controlling shareholder”, stating that the Pledged Shares represented approximately 0.48% of the issued share capital of Millennium. 22 On 2 December 2015, Qilin executed a Sold Note and Bought Note (“the Sale Note”) by which “Qilin World Capital Ltd sub acct CPIT Investments Ltd” as transferor sold the Pledged Shares at HK$2.50 per share to “Qilin World Capital Ltd” for a total consideration of HK$62,500,000.00 (“the Sale”). Hong Kong Stamp Duty, including a penalty for late stamping, was paid on that sale. 23 On 2 December 2015 at 10:19, Mr Cheng sent instructions to Prominence by two letters signed by Mr Raymond Lau and dated 3 December 2015 to transfer the Pledged Shares from Prominence Account 20 to Qilin’s account at Haitong International Securities Company Ltd (“Haitong”) and to debit Qilin’s account at Prominence (“Prominence Account 88”) with HK$242,000 being fees for that transaction. 24 The Pledged Shares were transferred from Prominence Account 20 in the name of “Qilin World Capital Limited – Sub Ac – CPIT Investments Limited” to Qilin’s Haitong account on 3 December 2015. 25 Mr Chu became aware that the Pledged Shares had been transferred from the Prominence account to Qilin’s Haitong account on 4 December 2015. He contacted Ms Suen who told him that Qilin was entitled to do this as it had an account with Haitong. At Mr Chan’s request Mr Chu also contacted Prominence who confirmed the transactions. 26 On 8 December 2015 Qilin started selling the Pledged Shares from its Haitong account. I shall refer to the sales of Pledged Shares after 8 December 2015 as “the Disposals”. Mr Chu soon became aware that Haitong were selling Millennium shares and contacted Ms Suen. He says that she informed him that Qilin could not have been selling and were possibly only hedging the Pledged Shares. Ms Suen says that she informed him that she was not aware of subsequent dealings following the execution of the Loan Agreement and the Control Agreement. Mr Chu asked Mr Lee to check with Mr Sum whether Qilin was selling the Pledged Shares. He called Mr Sum who said that the sales were not by Qilin. 27 On 11 December 2015, CPIT wrote to Qilin saying that they would not borrow any further sums under the Loan Agreement and that, therefore, the balance of 185,000,000 Millennium shares should be transferred back to CPIT from the Prominence Account 03. 28 On 15 December 2015, Hastings & Co, solicitors instructed by CPIT, wrote to Prominence reminding them not to transfer or otherwise dispose of the 185,000,000 Millennium shares without CPIT’s consent. It seems that, on the same day, the balance of 185,000,000 shares was transferred to CPIT’s account with Emperor Securities Ltd. 29 Qilin continued to sell the Pledged Shares. The closing share price decreased from HK$2.32 on 7 December 2015 to HK$1.98 on 8 December 2015 and to HK$1.66 on 15 December 2015. 30 On 18 December 2015, Qilin wrote to CPIT by Registered Mail to “Unit 11 13/F New Mandarin Plaza, Tower A, 14 Science Museum Road, Tsimshatsui, Kowloon” and said: Re: NOTICE OF DEFAULT… Our records indicate that the price default has been triggered, pursuant to the Stock Secured Financing Agreement between the Borrower and Qilin World Capital Ltd. Pursuant to section 5(b)(i) of the Loan Agreement, a decrease in the price of the collateral of more than thirty-five (35%) for three consecutive trading days. Additionally, pursuant to section 5(b) of the Loan Agreement, if the Borrower defaults on any terms and conditions set forth in the Loan Agreement, then the Borrower shall have a three (3) calendar day period within which they may cure the default by pledging additional securities or transferring a cash sum substantial enough to increase the total principal value to a level twenty-five (25%) percent in excess of the gross loan amount. In the event that no such cure is effected, the Borrower will have no rights, claims or interest in the Collateral. In order to cure the default, you must utilise one of the methods listed in the Loan Agreement and would ask that you refer to the Loan Agreement. [emphasis in original] 31 On 17 December 2015, Qilin transferred 15,000,000 Millennium shares from the Haitong account to a Qilin account with RHB Securities Singapore Pte Ltd (“RHB”) and on 21 December 2015 Qilin transferred another 4,064,000 Millennium Shares from the Haitong account to the RHB account. 32 On 22 December 2015, Qilin sent CPIT the same letter as was sent on 18 December 2015 to a different address at “Unit 05, 4/F Energy Plaza, No 92 Granville Road, Tsim Sha Tsui East KLN”, also by Registered Mail. 33 On 24 December 2015, Qilin wrote to CPIT by Registered Mail, to the same address as in the letter of 22 December 2015, and said: Re: NOTICE OF DEFAULT… Our records indicate we have not received the fifteen (15) day payment, which was due on December 23rd, 2015, pursuant to the Stock Secured Financing Agreement between the Borrower and Qilin World Capital Limited. Pursuant to Section 3(b) of the Loan Agreement,Fifteen (15) business days following theClosing Date for a particular tranche, the Borrower shall make a one-time payment to the Lender in the amount of one (1%) percent of the gross loan amount of such tranche (this payment shall be deducted from the total annual interest due in the first year of the term). Please note that this is an additional default trigger, which cannot be cured if the earlier default trigger, set out in our Notice of Default sent to you dated December 22, 2015, has not been cured. In order to cure the earlier default, you must utilise one of the methods listed in the Loan Agreement and would ask that you refer to the Loan Agreement. In the event that no such cure is effected, the Borrower will have no rights, claims or interest in the Collateral. Qilin World Capital Limited reminds the Borrower that it remain solely responsible for ensuring that it is aware of all payment deadlines, including without limitation, all quarterly payments and for making such payments incorrect amounts, as set out in the Debt Servicing Schedule and inadequate time to meet all deadlines. [emphasis added] 34 On 4 January 2016, So, Lung and Associates, Hong Kong solicitors acting for CPIT, wrote to Qilin, saying among other things: Termination of the Agreements as a result of your repudiatory breach(es) and/or renunciation and claims Our client is of the firm view that you have in,inter alia,surreptitiously transferring the Pledged Shares out of the Prominence Account and thereafter fraudulently and/or unlawfully selling and/or disposing of our client’s Pledged Shares when you had no right to do committed repudiatory breach(es) of the Loan Agreement and/or Control Agreement and/or you had renounced the Loan Agreement and/or Control Agreement. Notice is hereby given to you that with full reservation of our client’s rights, our client accepts your repudiatory breach(es) and/or renunciation as terminating the Agreements. 35 After setting out certain demands, the letter continued: In exchange for your full compliance with all the aforesaid demands and further subject to our client’s rights and remedies including its right of set-off, we are instructed that our client is in principle prepared to repay the loan amount of HK$31,250,000.00. 36 On 11 January 2016, J. Chan, Yip, So & Partners, Hong Kong solicitors instructed by Qilin, responded to So, Lung and Associates challenging what was said in their letter of 4 January 2016. 37 These proceedings were then commenced in the High Court on 12 January 2016. On the same date CPIT applied for an injunction prohibiting Qilin from disposing of the unsold shares and the proceeds of sale of any shares which had been sold (Summons No 164 of 2016). On 13 January 2016, CPIT applied for a worldwide Mareva injunction against Qilin up to the total value of HK$31,250,000 (Summons No 170 of 2016). 38 On 18 January 2016, the High Court granted an injunction (“the Injunction”) restraining Qilin from transferring, selling, charging, or in any other way disposing of the Pledged Shares, or where any part had been sold, charged or disposed of, restraining Qilin from parting, transferring or otherwise dealing with any proceeds of the sale (or its equivalent) until the trial of or determination of this action or until further order. 39 On 27 January and 11 March 2016, pursuant to the terms of the Injunction, Qilin filed the Affidavits from Mr  Cheng in which it was disclosed that Qilin had sold the Pledged Shares, except for 2,860,000 shares, and that there were proceeds from the sale of the shares of HK$25,3 82,415.78 held in various accounts. As a result, the 2,860,000 shares and the proceeds became the subject of the Injunction. 40 In relation to the Mareva injunction application, the parties reached an agreement which was recorded in a Consent Order on 12 February 2016, Order of Court No 942 of 2016 (“the Consent Order”). The Consent Order varied the Injunction so that HK$25,382,415.78, the proceeds of sale of the Pledged Shares, and a further sum of HK$2,149,584.22 were to be paid by Qilin into a designated account with Qilin’s solicitors. Those sums were paid to that account and currently remain there. 41This case was transferred to the SICC on 28 June 2016. On 28 July 2016 I heard two applications by Qilin, one to vary the Injunction and one for CPIT to fortify an undertaking in damages in relation to the Consent Order. I gave judgment on 15 September 2016, dismissing the applications (reported atCPIT Investments Ltd v Qilin World Capital Ltd and another[2017] 3 SLR 1). 42 I held regular case management conferences on 23 September, 14 October and 28 November 2016 and gave directions leading up to a trial which took place on 13, 14 and 15 December 2016. Closing written submissions were then exchanged on 26 January 2017. 43 At the trial, I heard evidence from three factual witnesses called on behalf of CPIT and two factual witnesses called on behalf of Qilin. CPIT called Mr Chan, Mr Lee and Mr Chu, and Qilin called Ms Suen and Mr Wilbur. 44 I also heard expert evidence from Christopher Chong Meng Tak (“Mr Chong”), a Director and Co-Founder of ACH Investments Pte Ltd called on behalf of CPIT and Mr  Clive Derek Conway Louis Rigby (“Mr Rigby”), the Managing Director of Lippo Securities Ltd, called on behalf of Qilin. Both experts were appropriately qualified to provide opinions on the matters dealt with in their reports.",
        "Issues": "45 The issues in the case are appended to the end of this judgment. As I indicated, I deal with those issues under various headings: (a) The identity of Qilin; (b) Whether Qilin was entitled to sell the Pledged Shares under Clause 5(f) of the Loan Agreement; (c) Whether there was a default by CPIT under Clause 5(b)(i) of the Loan Agreement; (d) Whether the Loan Agreement was terminated either under Clause 5(b) by Qilin or for repudiation by CPIT; (e) Fiduciary duties and trusts; (f) Whether Qilin, by selling shares after 4 January 2016, converted the remaining Pledged Shares; (g) The estoppel relied on by Qilin; (h) The relief claimed; and (i) Summary of the courts’ orders.",
        "The identity of Qilin": "",
        "True contracting party to the Agreements": "CPIT’s submissions 46 CPIT submits that as at 16 November 2015 the First Defendant Hong Kong company and the Second Defendant BVI company had come into existence. It points to the front page of the Loan Agreement which merely refers to “Qilin World Capital Limited” as the relevant party, without any reference to the country of incorporation or the company registration number. Both defendant companies have the same name. Qilin’s submissions 47 Qilin submits that it is clear on the face of the Loan Agreement itself and the circumstances of the transaction that the Second Defendant BVI company was the true contracting party to the Loan Agreement and the Control Agreement. It refers to the test for identifying the true contracting party to a contract set out in the decision of the UK House of Lords inShogun Finance Limited v Hudson[2003] UKHL 62; [2004] 1 AC 919 (“Shogun”). 48 InShogunthe question of the identity of the contracting party was said to be a matter of construction of a written document where the name of the party appeared in a written document. At [121], Lord Phillips of Worth Matravers said: “Where a name appears in a written document, the document itself may contain additional information which will enable the reader to identify the individual to whom the writer intended to refer when he wrote the name.” 49 In this case, Qilin relies on Clause 9(o) of the Loan Agreement which stated: “Miscellaneous:The borrower acknowledges that the Lender is not based in Hong Kong nor is it registered as a financial entity in Hong Kong. The Borrower acknowledges the fact that the Lender is an offshore entity.” 50 Qilin submits that this clause puts beyond doubt the fact that the First Defendant Hong Kong company was not a contracting party to the Loan Agreement and the Control Agreement. CPIT accepts that this clause points towards the Second Defendant BVI company being the contracting party but says that the description of this clause as “miscellaneous” and the fact that Clause 6 of the Loan Agreement gave a Hong Kong address of record contributed to the impression that the Lender was based in Hong Kong. However, it does not seriously challenge the effect of Clause 9(o). My decision 51 I consider that Qilin is correct in its submission. As a matter of construction of the Loan Agreement and, in particular Clause 9(o), there can be no doubt that the Second Defendant BVI company was the relevant “Qilin World Capital Limited” party to the Loan Agreement. It also follows, given the terms of the Control Agreement, that the relevant contracting party under the Control Agreement was also the Second Defendant BVI company.",
        "Whether the First Defendant is the alter ego of the Second Defendant": "CPIT’s submissions 52 However, CPIT submits that, on the basis that the contracting party was the Second Defendant, the First Defendant is thealter egoof the Second Defendant so that the First Defendant is also liable alongside the Second Defendant for any breaches of the Agreements. CPIT relies on the decision of the Court of Appeal inAlwie Handoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 (“Alwie Handoyo”) at [96] and says that the test is whether a company is carrying on the business of its controller and, if so, then the court may pierce the corporate veil. CPIT also relies on the English decision inSmith, Stone and Knight, Ltd v Lord Mayor, Aldermen and Citizens of the City of Birmingham[1939] 4 All ER 116 where Atkinson J found that a subsidiary company, operating a business on behalf of its parent company, was the agent or nominee of the parent company. 53 In relation to the position of the First and Second Defendants, CPIT says that they share the same shareholder and management, with Raymond Lau being the sole shareholder of both defendants, Chan Kam Fuk being the company secretary for both defendants, Mr Wilbur being the Managing Partner of both defendants, Tiziana Mason being the Chief Operating Officer of both defendants and, at the relevant time, Man Yun Wah being a director of both defendants. On that basis CPIT submits that neither defendant has a staff of its own and that there is no distinction between the two entities. CPIT also submits that the Second Defendant has given implausible reasons for having no documents in relation to the Agreements or account opening details and that the court should draw an adverse inference that the documents would have shown a mixing of funds between the defendants and that each was thealteregoof the other. Qilin’s submissions 54 Qilin submits that there is no evidence to support CPIT’s contention that the First Defendant was thealter egoof the Second Defendant or vice versa. It relies on the evidence of Mr Wilbur that the First Defendant Hong Kong company was and remains dormant with no ongoing business concerns of interest and says that CPIT produced no evidence to the contrary. It submits that evidence is required to show that the company is in fact not a separate entity from its controllers and that the company is run as a mere extension of its controllers’ affairs and that no such evidence has been produced. 55 Qilin relies on the decisions inNEC Asia Pte Ltd (now known as NEC Asia Pacific Pte Ltd) v Picket & Rail Asia Pacific Pte Ltd and others[2011] 2 SLR 565 andZim Integrated Shipping Services Ltd and others v Dafni Igal and others[2010] 3 SLR 426 where analter egoargument based on evidence of sole shareholding and control of a company by a party was not sufficient to lift the corporate veil. My decision 56 As VK Rajah JA said inAlwie Handoyoat [96] “the key question that must be asked whenever an argument ofalter egois raised is whether the company is carrying on the business of its controller”. The usual basis for the argument is that an individual, who controls and operates a company so that it is effectively the controller’s business, cannot hide behind the corporate veil. The position here is that there were two corporate entities which had the same shareholder and the same correspondence address and various other links. It cannot be said, on the evidence, that either of the two companies controlled the other company or that one company was effectively carrying out the business of the other company. Many businesses operate from the same address and have common shareholders. Such features, in themselves, are not sufficient to give rise to the imposition of liabilities of one company to the other company by lifting the corporate veil. 57 Nor do I think that there is any adverse inference to be drawn arising from the absence of documents produced on discovery. Whilst it is said that it is implausible that certain documents, which have not been disclosed, do not exist, I do not consider that this is a conclusion which I can draw from the evidence. Even if I could draw this conclusion, it would be difficult to take the further step and use the absence of such documents to form the adverse inference that evidence exists which would show that one company was thealter egoof the other company. I simply would not be in a position to do so. 58 It follows that the proper party to the Agreements was the Second Defendant BVI company and there is no basis for a finding, under thealter egoprinciple, that I should raise the corporate veil so as to make the First Defendant liable for defaults of the Second Defendant.",
        "Clause 5(f) of the Loan Agreement": "",
        "Whether Qilin was entitled to sell the Pledged Shares under Clause 5(f) of the Loan Agreement": "59 This provision is central to CPIT’s contentions in these proceedings. Clause 5(f) provides as follows: “The Lender shall have the right to transfer, re-hypothecate and assign the shares. In the event of a default, the Lender shall have the right to dispose of the shares.” CPIT’s submissions 60 CPIT submits that under Clause 5(f) Qilin was not permitted to sell any part of the Pledged Shares until and unless an event of default had taken place under the Loan Agreement. CPIT refers to the right to “transfer, re-hypothecate and assign” and says that reading those rights together and distinguishing them from the right “to dispose of the shares” in the second sentence of Clause 5(f), Qilin did not have the right to dispose of or sell the shares except in the event of a default. 61 CPIT also refers to Clauses 4(a) and 5(b) of the Loan Agreement, dealing with default. Clause 4(a) provides that, if the Borrower fails to pay or otherwise breaches the Loan Agreement, the Lender may “foreclose on the Collateral remain in whole possession and full unrestricted ownership of the Collateral, as the legal and beneficial owner of the Collateral, unencumbered in any way”. Equally, Clause 5(b) provides that, in the event of a default, the Borrower is given a period to cure the default but, in the event that no such cure is effected, “the Borrower will have no rights, claims or interest in the Collateral.” CPIT says that, like the right in the second sentence of Clause 5(f), these rights must be distinguished from the right in the first sentence of Clause 5(f). 62 CPIT refers to the Court of Appeal decision inPacrim Investments Pte Ltd v Tan Mui Keow Claireand another[2008] 2 SLR(R) 898 where the court had to consider whether the creation of an equitable mortgage over certain shares was a breach of an undertaking not to “assign” or “dispose” of those shares. In particular, CPIT relies on [16] where the court rejected submissions based on definitions of “assign” or “sell” collected in law dictionaries. Chan Sek Keong CJ, giving the judgment of the court, said that: “the meanings of “assign” and “disposal” depend on the context in which these words are used. The issue is one of construction of the contractual terms containing those words in each case. Where, as here, there is a contractual restriction against a shareholder “selling”, “assigning” or “disposing of” his freely transferable shares, we should consider, first, the principle of law applicable to property rights and then the intention of the parties with regard to such rights. It is a fundamental principle of law that all property rights are freely transferable unless there is some legal restriction preventing their transfer. In the case of a restriction on the transfer of shares, it is necessary to know why the restriction was imposed and why the shareholder agreed to it. In other words, the meaning of each of the terms “sell”, “assign” and “dispose of” would be coloured by the purpose for which the restriction on the shareholder was agreed to or imposed.” Qilin’s submissions 63 Qilin submits that under Clause 5(f) it was entitled to sell the Pledged Shares to a third party. It says that arrangements under which collateral is provided can either be arrangements where a security interest is granted in the collateral or where there is an outright transfer of the collateral. 64 Qilin submits that, in this case, there was an outright transfer of the Pledged Shares by CPIT to Qilin so that they belonged to Qilin from the moment they were delivered to Qilin and that Qilin was free to settle or deal with the Pledged Shares as it wished. This is to be distinguished, Qilin submits, from a situation where a party is given a limited security interest in the Pledged Shares so that the borrower would retain an equity of redemption in that collateral. 65 Qilin points out that the Collateral in this case consisted of shares which are fungibles which can easily be replaced by shares of the same description bought on the stock market. Consistent with this, Qilin says that the right to “transfer, re-hypothecate and assign the shares” must be based on there being an outright collateral transfer. It relies on statements in Joanna Benjamin,Interests in Securities: A Proprietary Law Analysis of the International Securities Markets(Oxford University Press, 2000) at para 4.12 and submits that “re-hypothecation” involves an arrangement where A delivers assets as collateral to B and B delivers the same assets as collateral to C; that “transfer”, which is not a technical legal term, describes the economic result of a transaction whereby a transferee acquires the asset that was previously held by the transferor and that the same reasoning applies to “assign”. 66 Qilin submits that under Clause 2(c) of the Loan Agreement, the Lender makes the non-recourse loan “upon receipt of collateral of the Pledged Shares” and that this receipt would vest in Qilin an interest and a right of property in the shares. Further, it says that there is no provision in Clause 4(b) or any other clause of the Loan Agreement which places Qilin under an obligation to return the identical shares conveyed to it on repayment of the loan. Qilin submits that this points to there being an outright collateral transfer underpinning the right to “transfer, re-hypothecate and assign the shares”. It also says that this is consistent with the absence of any prohibition in the Loan Agreement prohibiting Qilin from transferring the shares to itself. 67 In relation to the second sentence of Clause 5(f) of the Loan Agreement, Qilin says that the rights in the first sentence where there is no default can be read consistently with the right in the second sentence where there is a default. It contends that, in the case of a default, Qilin is entitled to dispose of any shares which have not been transferred, re-hypothecated or assigned to third parties. In this way it submits that, as held by the UK Supreme Court inGeys v Société Générale, London Branch[2013] 1 AC 523 at [23] to [24], the court should seek to reconcile two provisions that seem to be inconsistent with each other, if that can conscientiously and fairly be done. My decision 68 The issue to be determined depends on the proper construction of the right to “transfer, re-hypothecate and assign the shares” in Clause 5(f). In construing that provision, it is appropriate to consider both the other terms of the Loan Agreement and also the purpose for which that right was given under that agreement. 69 The central mechanism under Clause 2(c) of the Loan Agreement was that the Lender would make a non-recourse loan to the Borrower based upon receipt of collateral of Pledged Shares. Those shares were to be “transferred to the Lender” (Clause 2(a)) and the amount of the loan would not be fully determinable “until after the Collateral post to the Lender’s brokerage/delivery account” (Clause 2(c)). 70 The starting point was that the legal and equitable owner of the shares being provided as collateral was CPIT. It transferred those shares to the Qilin as collateral for the non-recourse loan. Where a party deposits shares or other property as collateral by making a transfer of those shares into a person’s account or transferring that property into a person’s possession, I do not consider that the act of transfer, without clear words to that effect, would transfer the legal ownership of those shares or property to the person who controls that account. 71 The deposit of shares or property as collateral is intended to provide security for the transaction, with rights of recourse against that collateral in the event that there is a default in respect of the transaction. In this case, the shares were provided as collateral for the non-recourse loan and Qilin had the right to “transfer, re-hypothecate or assign” those shares. 72 As Qilin submits, the essential question is whether the Collateral is transferred to Qilin so as to give Qilin a limited security interest or whether there is an “outright collateral transfer” under which the rights of ownership in the shares are transferred to Qilin so that it is entitled to deal with them as it wishes from the moment they were transferred. Based on the nature of the transaction and the terms of the Loan Agreement, I have come to the conclusion that the scheme of the Loan Agreement was for Qilin to be provided with a more limited security interest. 73 First, whilst it is clear that Qilin obtains possession of the shares, there is no statement to the effect that ownership passes to Qilin. If it did then there would be no need to limit the rights to the right to “transfer, re-hypothecate or assign” because Qilin would have all the rights of ownership and, as Qilin submits, could deal with the Collateral as it wished. Whilst those rights are consistent with the rights of an owner, they are also consistent with Qilin only having a security interest. The Collateral is placed in the particular account under Clause 2(c) and I consider that the right to transfer would mean that Qilin could transfer it, for instance, to another account. Qilin could also use the Collateral to provide security for another transaction, although the security would always be subject to the rights of CPIT. In terms of the right to assign the Collateral, that would be a right to transfer Qilin’s rights in the Collateral to another party but again subject to the rights of CPIT. 74 In coming to my conclusion, I have necessarily considered how the right in Clause 5(f) fits in with Qilin’s other rights, particularly its rights in the event of a default. The rights in relation to a default are to be found in several places. First, under Clause 4(a), Qilin can terminate the agreement and is entitled to “foreclose on the Collateral remain in whole possession and full unrestricted ownership of the Collateral, as legal and beneficial owner of the Collateral”. The consequence of foreclosure, particularly in the light of the provisions of Clause 4(a), is that Qilin remains in possession of the Collateral and has full unrestricted ownership as the legal and beneficial owner of the Collateral. Qilin already had possession of the shares, but this provision strongly suggests that Qilin was not butbecomesthe full unrestricted owner of the shares after termination for default under Clause 4(a). 75 Secondly, under Clause 5(b), if a default is not cured, CPIT will have “no rights, claims or interest in the Collateral”. Whilst this presupposes that CPIT had rights, claims and an interest in the Collateral prior to that event, it does not assist in identifying what are those rights or claims or that interest. 76 Thirdly, under the second sentence of Clause 5(f), in the event of a default, Qilin “shall have the right to dispose of the shares”. This I consider is a very important provision. It is clearly in contradistinction to the rights in the first sentence and makes it clear that Qilin does not otherwise have the right to dispose of the shares. 77 CPIT draws attention to Clause 5(g) which provides that Qilin “shall not, at any time, short sell the securities of [Millennium].” The concept of short selling, as agreed by the experts in this case, arises where a person sells shares which that person does not own. This provision therefore provides that Qilin should not sell shares which it does not own. This provides some indication that Qilin will not own the Collateral because, if it did own the shares, it would not “short sell the securities of [Millennium]”. 78 Also, it is to be noted that under Clause 6(b) upon the repayment of the loan, Qilin agrees to “return the relevant amount of Collateral” to CPIT. The “return” is, in my judgment, more consistent with possession of the Collateral being returned to the owner than with a process by which Qilin, as the owner of the shares, transfers ownership back to CPIT. 79 I have therefore come to the conclusion that Qilin was not entitled to sell the shares provided by CPIT as Collateral for the loan under the terms of the Loan Agreement. 80 There have been a number of additional points raised in this context. First, Qilin raised an argument that Qilin must be entitled to “hedge” when the value of the shares is falling. Qilin contended that Clause 5(f) should be construed to allow it to sell the shares to “hedge” so that it could manage the risk of the shares decreasing in value. Whilst it raised that argument in its opening submissions, Qilin did not pursue that aspect in its closing submissions. I consider that Qilin was right not to pursue this contention. It is clear that there was no reference in the Loan Agreement to Qilin having a right to “hedge” and, as dealt with below, Clause 5(b) provided rights to deal with a fall in value of the shares. 81 Secondly, Qilin referred an email exchange which had taken place between Ms Suen and Mr Wilbur in October and November 2015 and contended that, because of that exchange, CPIT was aware of Qilin’s right to sell the shares under the terms of the Loan Agreement. In Ms Suen’s evidence it transpired that the email exchange had related to a different transaction, not concerning CPIT or the Millennium shares but a different lender and shares in another company. As a result, Qilin did not pursue this argument in its closing submissions. 82 Thirdly, Qilin pleaded that Clause 1 of the Control Agreement gave it a power of sale over the shares. Clause 1 provides as follows: CONTROL BY THE LENDER.The parties acknowledge that the Lender may from time to time provide notifications to the Depository Broker directing it to transfer, pledge, hypothecate, withdraw or redeem any funds or other property in the Account (each an “Entitlement Order”). The parties further acknowledge that the Depository Broker shall comply with any such Entitlement Order originated by the Lender without further consent by, or notice to, the Customer. 83 As CPIT submits, the Control Agreement was entered into the give Qilin the rights provided by the Loan Agreement. The preamble to the Control Agreement makes this clear when it states: AND WHEREAS the parties are entering into this Agreement in order to grant the rights to the Lender over the Account provided by the Loan Agreement and perfect the Lender’s security interest in the Account; 84 In its closing submissions Qilin raised a new argument. It sought to rely on the Control Agreement, contending that it was a separate agreement from the Loan Agreement and deprived the Loan Agreement of any legal effect or superseded it. It referred to the “entire agreement” provision at Clause 10.3 of the Control Agreement which states: Entire Agreement. This Agreement constitutes the entire agreement between the parties pertaining to the subject-matter hereof and supersedes all prior agreements, understandings, negotiations and discussions of the parties, whether oral or written. 85 It submitted that this entire agreement clause deprived any precontractual or collateral/earlier agreement of legal effect or superseded it. Qilin relied onLee Chee Wei v Tan Hor Peow Victorand others and another appeal[2007] 3 SLR(R) 537 at [35];CherieHearts Group International Pte Ltd and others v G8 Education Ltd[2012] SGHC 70 at [107] andEncus International Pte Ltd(in compulsory liquidation) v Tenacious Investment Pte Ltd and others[2016] 2 SLR 1178 at [22]. Qilin therefore contended that in the light of Clause 10.3, it was permissible to look only at the Control Agreement and not the Loan Agreement to ascertain whether Qilin had the right to sell the shares in the absence of a default. 86 In other words, Qilin contended that the Loan Agreement was superseded by the Control Agreement. In the light of the preamble referred to above and the terms of the Control Agreement, it is clear that the Control Agreement was entered into in order to give effect to the rights under the Loan Agreement. Therefore, on its face, I do not consider that Clause 10.3 can possibly mean that the Control Agreement supersedes the Loan Agreement because the Control Agreement depends on the Loan Agreement for its existence. 87 Clause 1 of the Control Agreement therefore has to be read as being consistent with the rights granted under the Loan Agreement as its purpose is to grant Qilin those rights over the Account into which the shares are placed. Thus the phrase in Clause 1 entitling it to direct Prominence “to transfer, pledge, hypothecate, withdraw or redeem any funds or other property in the Account” has to be read as consistent with Clause 5(f) of the Loan Agreement from which it derives those rights. I read those rights as being consistent with the rights granted to Qilin in Clause 5(f). 88 Further, as CPIT points out, the terms of the Control Agreement are consistent with my construction of Clause 5(f). There are multiple references to Qilin having a “security interest” in the shares. This occurs, for instance: (a) In the first preamble where the Loan Agreement is referred to, it is stated that in the Loan Agreement “among other things [CPIT] has granted [Qilin] a security interest and/or pledge in [CPIT’s] assets” in the Account; (b) In the third preamble, as set out above, the Control Agreement is entered into to “perfect [Qilin’s] security interest in the Account”; (c) Under Clause 2.2 there is reference to Qilin notifying Prominence that “[Qilin’s security interest in the Account has terminated”; (d) In Clause 2.3 there is reference to Qilin’s “security interest”; (e) In Clause 9.2 there is reference to termination of Qilin’s “security interest” being terminated in accordance with Clause 2.2. 89 As set out above Qilin submits that the Collateral was provided by way of an outright collateral transfer rather than, as CPIT submits, as a “security interest”. The terms of the Control Agreement provide strong support for the arrangement under the Loan Agreement being a “security interest”. I consider that, in construing the Loan Agreement, it is permissible to take into account the terms of the Control Agreement either on the basis that the two agreements were part of the same transaction entered into at the same time or, if logically the Control Agreement was entered into after the Loan Agreement then the terms of the Control Agreement would come within the test of being relevant, reasonably available to contracting parties and relating to a clear and obvious context, so as to permit subsequent conduct to be taken into account as explained inZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 at [132(d)].",
        "Breach of the Loan Agreement": "90  It follows from the above that when, on 2 December 2015, Qilin executed the Sale Note by which Qilin sold the Pledged Shares in the Account at HK$2.50 per share to itself for a total consideration of HK$62,500,000.00, that constituted a breach of the terms of the Loan Agreement because Qilin’s rights, in particular under Clause 5(f), did not entitle it to sell the shares, even to itself. 91  Further, having made that sale and having transferred the Pledged Shares to the Haitong Account, Qilin then started selling those Pledged Shares. Again, I consider that by doing so Qilin was in breach of the terms of the Loan Agreement because it was selling the shares when it did not have the right to do so under Clause 5(f).",
        "Default under Clause 5(b) of the Loan Agreement": "",
        "Interpretation of Clause 5(b) of the Loan Agreement": "92 As set out above, the share price for the Pledged Shares fell during December 2015. That gave rise to the next issue. Clause 5(b) of the Loan Agreement provides as follows: If the Borrower defaults (a “Default”) on any terms and conditions set forth in this Agreement, then the Borrower shall have a three (3) calendar day period within which they may cure the default by pledging additional securities or transferring a cash sum substantial enough to increase the total principal value to a level twenty-five (25%) percent in excess of the gross loan amount. In the event that no such cure is effected, the Borrower will have no rights, claims or interest in the Collateral. The following events shall be considered a Default and automatically and irrevocably result in the immediate default of the loans: i. a decrease in the price of the Collateral of more than thirty-five (35%) percent for three (3) consecutive trading days; ii. a decrease in the daily trading volume of the Collateral of more than seventy-five percent (75%), for three consecutive trading days, below the average daily trading volume for Collateral for the three month period preceding the settlement date of the Loan; … Parties’ submissions 93 Qilin submits that under Clause 5(b)(i), the drop of 35% must last for three consecutive days and that the clause does not require that there must be a 35% drop for each of three consecutive days, leading to a value of 27.5% of the original price by the third day. It submits that contractual top up would be meaningless in those circumstances. It also submits that the decrease must be calculated by reference to the price of the Collateral when it was first pledged at the Closing Date (ie, HK$2.50 per share). 94 CPIT submits that under Clause 5(b)(i) there must be a drop of 35% from the price of the preceding trading day which persists for three consecutive trading days. It submits that Clause 5(b)(i), unlike Clause 5(b)(ii), does not refer to a reference “price” for the decrease in “trading volume”. My decision 95 I consider that the default has to be construed by reference to the underlying scheme of the non-recourse loan. The starting point is that the loan to value is 50%, as provided for in Clause 2(b) of the Loan Agreement. That margin between the value of the loan and the value of the Collateral provides a reassurance to the Lender that it will be able to recover the loan from the Collateral should the share value fall. 96 The purpose of Clause 5(b)(i) is evidently to protect the Lender if the value of the Collateral decreases. A “decrease in the price of the Collateral” for three consecutive days is, unlike Clause 5(b)(ii), not stated to be a decrease in the price compared to the price of HK$2.50 established at the Closing Date. The natural meaning of a decrease in price of 35% for three consecutive days would, I consider, be a decrease by reference to the price on the previous day. The concern would be for a large decrease which is maintained for three days and therefore not be a matter of temporary market volatility. The requirement of a 35% decrease “for three (3) consecutive trading days” means that there must be a decrease of at least 35% on the first day and that decrease must be maintained on the following two days. I accept that, as Qilin submits, it does not require a 35% decrease on the first day and then a further 35% decrease on the second day, followed by another 35% decrease on the third day. However, I do not accept that the decrease must be calculated by reference to the price of the Collateral when it was first pledged at the Closing Date. 97 It is to be noted that the cure under Clause 5(b) is that the Borrower has to increase the Collateral to “a level of twenty-five (25%) percent in excess of the gross loan amount.” Originally Clause 2(b) provided that the “gross loan-to-value for this transaction shall be 50% (fifty percent)”. Thus for every $100 of loan, there had to be Collateral of $200. If Qilin were correct and the closing value were taken as the point from which the 35% decrease was taken then the Collateral would have to decreased from $200 by 35%, so that it would then be $130. The cure would then be to pledge additional securities or transfer a cash sum so that the Collateral was 25% in excess of the loan, that is $125. If that were the outcome no cure would be needed as the value would already be $130. 98 I therefore do not consider that there was a default under Clause 5(b)(i) which had to be cured because as set out in the table produced by CPIT at paragraph 145 of its closing submissions (reproduced as Annex 2) there was no day when the 35% decrease in the price of the Collateral occurred. 99 However, if Qilin were correct and the 35% was calculated by reference to the price at the Closing Date of HK$2.50, then, as set out by CPIT at paragraph 146 of its closing submissions (reproduced as Annex 2), the price decreased by more than 35% on 16 December 2015 when it had decreased by 36.80% and it then decreased further to 37.60% on 17 December and 43.20% on 18 December 2015. On those figures a cure would be required as the percentage decrease would take the excess to below 25%. 100 For completeness, I will set out my findings on the basis that, contrary to my finding as to the meaning of 35% in Clause 5(b)(i), Qilin is right on its construction of the 35%, having had full argument on the issues.  There are two issues. First, whether the relevant decrease in the value of the shares was caused by Qilin’s breach in selling the Pledged Shares and if so whether Qilin can rely on the default. Secondly, even if Qilin can rely on the default, whether Qilin satisfied the necessary conditions to foreclose on the Collateral.",
        "The cause of the decrease in share price": "Parties’ submissions 101 If Qilin’s construction of the 35% decrease were correct, CPIT submits that Qilin cannot rely on the default caused by the decrease in share price because Qilin caused the decrease in share price by its breach of the Loan Agreement by selling the shares. CPIT says that Qilin caused the decrease of more than 35% (on Qilin’s construction) by 18 December because of its disposals of the shares up to that date. 102 CPIT relies on the decision inEvergreat Construction Co Pte Ltd v Presscrete Engineering Pte Ltd[2006] 1 SLR(R) 634 where VK Rajah J (as he then was) said as follows at [51] to [52]: 51 … In essence, even if the parties expressly provide that the contract shallipso factodetermine upon the happening of a certain event, such a provision is to be construed subject to the principle that no man can take advantage of his own wrong, so that one party may not be allowed to rely on such a provision where the occurrence of the event is attributable to his own act or default;Chitty on Contractsat para 22-054. This principle is also referred to as the “prevention principle” and is wedded to notions of fair play and commercial morality. It offends all sensible norms of commercial intercourse to allow a party in breach of its contractual obligations to rely on its very breach to either evade responsibility or, even more farcically, to assert that the other contracting party must also willy-nilly accept or sustain the consequences of that breach. 52 In order to invoke this principle it must be shown that the contractual right or benefit that a party is asserting or claiming is a direct result of that party’s prior breach of contract. The relevant breach, the factual consequences flowing from the breach and the advantages the contract breaker is seeking to raise must be identified. The principle seeks to prevent the contract breaker from seeking an “advantage” arising from his default; … [emphasis in original] 103 CPIT submits that the decrease in share price was a direct result of the sale of the shares by Qilin in breach of the terms of the Loan Agreement. Qilin submits that CPIT has the burden of proving the causative link between the selling of the shares and the fall in the share price and that CPIT has failed to establish that Qilin’s sale of shares was the “effective” or “dominant” cause of the fall in the share price. My decision 104 I have dealt with this topic below where I consider CPIT’s claim for loss caused by the fall in the Millennium share price (see [268]–[287] below). I have concluded that the effective cause of the fall in the Millennium share prices was the overinflated price of the shares. This applies to the period between 8 December 2015 and 14 January 2016 and therefore includes the fall in the price by over 35% (on Qilin’s construction) by 16 December 2015. 105 It follows therefore that, if there was a default, it was not caused by the sale of Millennium shares by Qilin. Thus, the default because of the decrease in shares was not caused by Qilin’s breach of contract in selling those shares.",
        "Termination under Clause 5(b) of the Loan Agreement": "106 I now turn to the second matter raised by CPIT.",
        "Qilin’s submissions": "203 Qilin submits that CPIT's claim in conversion fails either because it misapplies the concept of conversion to intangibles like choses in action, or if the law on tangibles can be applied to intangibles, because CPIT's failure to repay the loan disentitles it to possession, without which conversion cannot arise. 204 Qilin refers to Amy Goymour, “Conversion of Contractual Rights” (2011) LMCLQ 67 where she said (at p 67): “Conversion is a tort of strict liability which currently operates to protect against unauthorised interferences with legal possessory title to tangible goods.” It says that this is also the view of the editors ofClerk and LindselI on Torts(Michael A Jones gen ed) (Thomson Reuters, 21st Ed, 2014) at para 17-35 where it is stated: “[C]onversion lies in respect of dealings with any corporeal personal property.” 205 Whilst Qilin accepts that, as stated by the English Court of Appeal inOBG Ltdand another v Allan and others[2005] QB 762 (on appeal at [2008] 1 AC 1 (“OBG (HL)”)), conversion has been extended to intangible property which is represented in tangible documentary form, it says that this has been through the development of a “face value rule”, under which the document embodying or recording a debt or obligation should be treated as having the same value as the related debt or obligation. However Qilin submits that in all such cases of conversion, the subject matter of the interference is the document and the fiction involves the law treating the document as having the same value as the intangible right that it represents. 206 In the present case, Qilin submits that if the Millennium shares had a documentary form, there has been absolutely no interference with the share certificates as would amount to a conversion and no room therefore for the “face value rule” to apply. It says that, in order for CPIT to succeed, it would be necessary to extend the law of conversion so as to cover pure intangibles. It refers to the English Court of Appeal decision inYour Response Ltd v Datateam Business Media Ltd[2015] QB 41, in which Moore-Bick LJ stated at [23]: “Possession is concerned with the physical control of tangible objects [whereas] practical control is a broader concept, capable of extending to intangible assets and to things which the law would not regard as property at all.” Qilin submits that rights to intangible property differ but shares give rights enforceable against the company and other members but no others. 207 Qilin also submits that, as a matter of contract, its obligation to return the specific Millennium shares is dependent on CPIT redeeming the same by tendering the loan amount together with any interest charges but it has failed to do so.",
        "CPIT’s submissions": "201 CPIT submits that Qilin, by selling shares after 4 January 2016, converted the remaining Pledged Shares after the termination of the Loan Agreement and is therefore liable in Conversion. It refers toAlwie Handoyoand says that, under Singapore law, it is possible to convert public listed shares. Upon termination of the Loan Agreement, CPIT submits that Qilin lost its right to immediate possession over the remaining Pledged Shares which had been granted by the Loan Agreement and Control Agreement. 202 Therefore CPIT submits that Qilin’s right to immediate possession of the remaining Pledged Shares reverted back to CPIT, even if the equitable mortgage survived the termination of the Loan Agreement as the right to possession was conferred by the Loan Agreement, not the equitable mortgage. On this basis, CPIT submits that the unauthorised disposal of the remaining Pledged Shares from 4 January 2016 to 14 January 2016 was a conversion of those shares.",
        "My decision": "208 The requirements for an action for conversion were summarised by the Court of Appeal inTat Seng Machine Movers Pte Ltd v Orix Leasing Singapore Ltd[2009] 4 SLR(R) 1101at [45] as follows: ... [T]he action lies only if the claimant has possession or a right toimmediate possessionof the goods and this means that an owner who does not have such a right (say, because of the terms of the bailment) cannot bring an action for conversion. ... Generally, an act of conversion occurs when there is unauthorised dealing with the claimant’s chattel so as to question or deny his title to it ... Inconsistency is the gist of the action, and thus there is no need for the defendant to know that the goods belonged to someone else or for the defendant to have a positive intention to challenge the true owner’s rights... [emphasis in original] 209 The question in this case is whether the Pledged Shares, being intangibles, can be the subject of an action for conversion. The Court of Appeal considered whether an action for conversion applied to shares inAlwie Handoyo. The position was summarised at [131] and [132] in the following terms, after referring to the House of Lords decision inOBG (HL): 131 The general rule is that conversion only protects interest in chattels, or things that can be possessed:OBGat [95];Clerk & Lindsell on Torts(Michael Jones & Anthony Dugdale eds) (Sweet & Maxwell, 20th Ed, 2010) at para 17-35. In other words, there cannot be conversion of intangibles such as choses in action. There is one recognised exception to the general rule. Documentary intangibles such as cheques, negotiable instruments, guarantees, insurance policies and bonds can be converted, even though their sole value is in their nature as choses in action. InGoode on Commercial Law(LexisNexis, 4th Ed, 2009) at p 32, Prof Goode describes documentary intangibles as “rights to money, goods or securities which are locked up in a document to the extent that the document is considered to represent the right, which thus becomes transferable by transfer of the document itself.” This is achieved by treating the chattel, ie the physical instrument, as the subject-matter of the conversion, as evidencing the face value which can be extracted under the instrument:Lloyds Bank, Limited v The Chartered Bank of India, Australia and China[1929] 1 KB 40 at 55–56. Thus, if a physical instrument which value lies in a chose in action is unlawfully dealt with, the person entitled to the physical instrument may recover damages based on the value of the chose:Alsager v Close(1842) 152 ER 600;Midland Bank Ltd v Eastcheap Dried Fruit Co[1961] 2 Lloyd’s Rep 251;Ernest Scragg & Sons v Perseverance Banking and Trust Co[1973] 2 Lloyd’s Rep 101. 132    As corporeal, tangible property, there is no doubt that the share certificates can be converted. The question is whether they are worth more than just pieces of paper. InPacrim Investments Pte Ltd v Tan Mui Keow Claire and another[2005] 1 SLR(R) 141, Andrew Ang J held (at [18]) that: [a] share certificate is not a documentary intangible. A pledge of a share certificate does not confer on the pledgee the rights attaching to the shares but only possessory title to the paper on which the share certificate is printed. This may be read to mean that share certificates are not worth anything more than the paper on which they are printed on. While that may be true of, say, registered shares, (see Gerard McCormack, “Security Over Shares – Reform is in the Air” (2003) 3 Insolvency Lawyer 92 at p 92), this does not apply to all shares. Indeed, the share certificates inMCC Proceeds Inc v Lehman Brothers International (Europe)[1998] 4 All ER 675,Malkins Nominees Limited v Société Financiéré Mirelis SA and others[2006] EWHC 2132 (Ch), andEG Tan & Co (Pte) v Lim & Tan (Pte) and another[1985–1986] SLR(R) 1081, the case referred to by the Judge, were all held to be capable of forming the subject-matter of a claim for substantial damages for conversion: see also Mark Hsiao, “Legitimised Interference with Private Properties – Banking Act 2009” (2010) 25(5) JIBLR 227 at 232. 210 InAlwie Handoyo, there were share certificates issued by the relevant Singapore company over its shares. The Court of Appeal considered the way in which those certificates functioned under the Central Depository (“the CDP”) system in Singapore. The CDP system allowed trading of scripless shares which decouples the shares from the actual share certificates. The Court of Appeal held that under the scripless trading system in Singapore, although shares are scripless for the purposes of trading, they are still backed by certificates. In all cases, the share certificates would be registered in the CDP’s name and the account holder to whom the shares are issued would have a book-entry under their account reflecting their title to the shares, and would enjoy the same rights and privileges as a shareholder of the issuer. When the account holder transfers shares electronically, their account and that of the transferee’s would be updated to reflect the change in title to the shares so that, at any time, the account holder who has a book-entry reflecting title to shares of a company would be, for all intents and purposes, entitled to enjoy the rights associated with being a shareholder of that company. As a result, the Court of Appeal held that the share certificates which are tied to and sustain the book-entries in the CDP register, were capable of being the subject-matter of a substantive claim for conversion. 211 In the present case, the evidence indicates that the shares were transferred electronically between accounts but no evidence has been adduced to show the way in which share certificates are dealt with or how the shares are registered or the nature of any book-entries or the way in which sales of shares are recorded. As the Court of Appeal stated inAlwie Handoyoat [133], understanding the operation of the share transfer system is “crucial” to determining whether there is a cause of action for conversion of the shares as intangibles. 212 The general rule is that conversion only protects an interest in tangible property, or things that can be possessed. The extension to this rule applies it to intangible property, where the intangible property is represented in a tangible documentary form. Thus, inAlwie Handoyo, the share certificates were capable of being the subject-matter of a substantive claim for conversion in the circumstances of that case. In the present case, as Qilin correctly points out, it is not alleged that there has been any interference with the share certificates so as to amount to conversion. 213 As a result, I do not consider that CPIT has an action for conversion of the remaining Pledged Shares, at the date of termination.",
        "Repudiation of the Loan Agreement": "",
        "CPIT’s response": "138 In response to Qilin’s contention that it could purchase Millennium shares on the open Market, which were in this sense fungible, to return to CPIT, CPIT says that this does not affect the position as the selling of Millennium shares in the open market may cause a price decline which a subsequent repurchase may not remedy. CPIT submits that the cases cited by Qilin in support of the proposition that there can be no repudiatory breach simply because the shares were fungible are distinguishable. 139 CPIT refers to the passage in the judgment of Warrington LJ inEllis (CA)at 471 that: It would be absurd to insist on a retransfer of the identical shares mortgaged when other shares of the same nature are available, and so also, I think the judge is right in substituting for the actual shares the value thereof, inasmuch as the money representing the value could, if the mortgagor so pleases, be at once invested in the purchase of shares. CPIT submits that the issue in that case was not whether the wrongful sale of shares constituted a repudiatory breach of an agreement but whether the mortgagee was entitled to sue the mortgagor for any outstanding sums when the mortgagee had wrongfully sold the mortgaged shares. It says that Sargent LJ confirmed at 472–473 that, in general, a mortgagee or his assignee cannot recover his debt from the mortgagor except upon performing his reciprocal obligation of re-conveying the mortgaged property to the mortgagor. However, the English Court of Appeal, agreeing with the first instance judge, accepted that the mortgagee was not prevented from suing because he had parted with the mortgaged shares, given that shares of the same nature were easily purchased, as long as credit was given for the value of the shares wrongfully sold.",
        "Fiduciary Duty and Trusts": "",
        "The claim for conversion of the shares": "",
        "Qilin’s estoppel defence": "",
        "Applicable law": "214 Qilin contends that if, on construction of the terms of the Loan Agreement and the Control Agreement, it did not have the right to sell the Pledged Shares in the absence of an event of default, CPIT is nevertheless estopped from enforcing or relying on its legal rights. Qilin says that it relied on CPIT’s representations made as a result of conversations in early December 2015 and altered its position to its detriment such that it would be in equitable for CPIT to resile from its representation. 215 Qilin relies on the decision inAero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd[2013] 4 SLR 409 at [37] where it was stated that three requirements must be satisfied to establish promissory estoppel: (a) a clear and unequivocal promise by the promisor, whether by words or conduct; (b) reliance on the promise by the promisee; and (c) detriment as a result of the reliance. 216 Qilin submits that a promise giving rise to a promissory estoppel can be implied by words or conduct, so long as this promise would be objectively understood by a reasonable person. Qilin also refers toING Bank NVv Ros Roca SA[2012] 1 WLR 472, where Rix LJ held at [85] that there was a promissory estoppel in circumstances where the party had a duty to speak as the plaintiff knew that the defendant had adopted a wrong interpretation of the contract and yet it did not correct this impression. Qilin also relies on the decision inQBE Insurance (International) Ltd v Winterthur Insurance (Far East) Pte Ltd[2005] 1 SLR(R) 711 where the defendant wrote to the plaintiff on the issue of contribution arising from insurance for an accident and expressly called for a response, failing which it would proceed on the basis of certain assumptions. 217 Qilin submits that CPIT is also bound by communications made between Qilin/Ms Suen and Mr Sum as Mr Sum was acting as an agent for CPIT at all material times. Qilin submits that where it is provided in a contract that certain persons appointed by a company shall be agents of the company, the actual authority of the agent derives from the terms of the contract and it refers toWalter Woonon Company Law(Tan Cheng Han SC gen ed) (Sweet & Maxwell, 3rd Rev Ed, 2009) (“Walter Woon”) at pp 85–86. It also submits that an agent’s implied authority may be restricted by the express authority conferred by the terms of the contract and it refers toWalter Woonat pp 86–87. It also states that this implied authority includes the authority of an agent to do things incidental to the fulfilment of the tasks that he is expressly authorized to do, including things that a person in such a position usually does and it refers toHely-Hutchinson v Brayhead Ltd and another[1968] 1 QB 549 at 583, per Lord Denning MR. 218 Qilin also submits that a principal may be precluded from raising its agent's lack of authority by the doctrine of estoppel and it relies onWalter Woonat pp 91–92 for the requirements for such an estoppel: (a) There was a representation by the principal to some person that the agent in question has authority to do the act in question. (b) The representation must have been made by someone who has authority to make such representations on behalf of the principal. A principal may by his conduct over a period of time impliedly represent that the agent is authorized to contract or make representations on its behalf (Freeman & Lockyer v Buckhurst Park Properties (Mangal) Ltdand another[1964] 2 QB 480 (“Freeman & Lockyer”) at 503 per Diplock LJ (as he then was)). (c)  The person who wishes to enforce the position taken by the agent against the principal must have relied on the representation 219Freeman & Lockyerwas cited with approval and followed by the Court of Appeal inThe Bunga Melati 5[2016] 2 SLR 1114 and Qilin relies on the judgment at [9] and [12]. 220 The principles for promissory estoppel and for an agent’s authority are not seriously in issue as the estoppel defence is challenged mainly on the facts. I am therefore content to adopt the principles to be derived from the authorities as summarised above. I now turn to consider the way in which Qilin says that the estoppel arose on the facts.",
        "Events between 3 and 5 December 2015": "Qilin’s submissions 221 Qilin, first, relies on events that transpired between 3 and 5 December 2015 to establish the representation. It says that CPIT became aware of Qilin’s transfer of the Pledged Shares to the Haitong Account on or around 3 December 2015. It refers to Mr Chu’s AEIC at para 19, supported by Mr Chan's First Affidavit filed on 12 January 2016 at para 31. Mr Chu says that on or about 4 December 2015, he was reviewing the online records of the HK Stock Exchange's Central Clearing and Settlement System (“CCASS”) when he noted that, on 3 December 2015, Prominence’s holding of Millennium shares had decreased by 25,000,000 shares and that there was a corresponding increase of 25,000,000 shares in Millennium held by Haitong. 222 Despite the knowledge that it had transferred the Pledged Shares out of the Prominence Account into the Haitong Account, Qilin submits that CPIT did not take steps to enforce the rights they allegedly had under the Loan Agreement and Control Agreement. It says that if CPIT did not intend to allow Qilin to transfer or otherwise deal with the Pledged Shares, CPIT would be expected to have given Qilin notice of its objection once it became aware of the said transfer. It submits that the fact that CPIT did not do so can only mean that CPIT knew that Qilin had the right to transfer the Pledged Shares out of the Prominence Account under the terms of the Loan Agreement and Control Agreement or, having acquired the knowledge of such a breach, elected not to object to the said breach. Qilin contends that CPIT should be estopped from subsequently seeking to enforce its rights and obligations. CPIT’s submissions 223 CPIT submits that its awareness of Qilin’s transfer of the Pledged Shares to the Haitong Account on or around 3 December 2015 is irrelevant. It says that Qilin was arguably permitted to transfer the Pledged Shares from one account to another pursuant to Clause 5(f) of the Loan Agreement even in the absence of an event of default. In any event, it says that Qilin does not allege that CPIT was aware that Qilin had sold or was selling the Pledged Shares which Qilin states commenced only on 8 December 2015. My decision 224 As I have stated above, Clause 5(f) of the Loan Agreement allowed Qilin to transfer the Pledged Shares to another account and therefore that act was permitted. I accept, as CPIT submits, that there was nothing arising from the transfer of the Pledged Shares to the Haitong Account which would suggest that there was a sale of those shares. There was therefore no representation made by Qilin.",
        "The offer made by Qilin on 5 December 2015": "Qilin’s submissions 225 Qilin relies on an offer made by Qilin to CPIT on or around 5 December 2015, giving CPIT the option to rescind the Loan Agreement. Qilin relies on Mr Wilbur’s AEIC at paras 45–47 where he says that the offer was conveyed by Ms Suen, on behalf of Qilin, to Mr Sum. The terms of the offer relied on are “for Qilin to return all of the Pledged Shares to CPIT (as well as pay for the lawyer’s fees and return the 1% placement/origination fee), in exchange for CPIT's refund of the loan to Qilin”. 226 Qilin also refers to Mr Wilbur’s evidence under cross-examination, where he explained that “we told them that we were going to exercise our right to hedge the shares … [w]e made the decision that we were going to hedge the shares if the price continued to drop”. It also relies on Ms Suen’s evidence about phone calls from Mr Chu “probably early December, quite soon after the loan was disbursed” when “[f]irst, [Mr Chu] asked for why the shares assigned to the account and the second is why there are some orders that placed selling their stocks”. She also gave evidence that Mr Wilbur had said “if they don't agree with this, they can … reverse the deal.” She said that after this “I think I did talk to [Mr Chu] and also I talked to [Mr Sum]”. She was asked whether she mentioned “the question about the reversing of the deal” and stated that she thought she “talked to [Mr Sum] on this point”. 227 Qilin says that the information was passed to Mr Sum and was within his actual authority as a representative of All Might with whom CPIT had signed the Commission Agreement in November 2015, giving him a general mandate to assist CPIT in obtaining a loan, with no express scope of duties or restrictions on the authority conferred upon him. On that basis, Qilin submits that Mr Sum had actual authority conferred upon him by CPIT to obtain the loan from lenders, which would necessarily include negotiations on the terms of the loan. Qilin refers to the evidence of Mr Lee that Mr Sum’s duty was to look for a lender “for us so that we could choose” and that “[Mr Sum] had already selected the lenders for us, he chose the best one, and this one, he had a prior experience of a successful transaction.” Qilin also submits that Mr Sum's authority with regards to the Loan Agreement and the Control Agreement was a wide one and that he was also cloaked with apparent authority when CPIT chose to transact with Qilin through Mr Sum. 228 Qilin says that the fact there was no limit on Mr Sum’s authority is confirmed by the Commission Agreement and in the absence of evidence from Mr Sum, who CPIT did not call to give evidence, an adverse inference should be made that, if called, he would have given evidence contrary to CPIT and/or in support of Qilin’s case. CPIT’s submissions 229 CPIT submits that the alleged offer to CPIT to rescind the Loan Agreement on terms is not borne out by the evidence. It refers to Qilin’s further and better particulars where it pleads that this offer “was madevia telephone orally through [Ms Suen] on behalf of the [Qilin] to [Mr Sum] on behalf of [CPIT] on or around 5 December 2015, shortly after the first tranche was disbursed on 2December 2015.” It refers to the evidence from CPIT’s representatives that they were not aware of any such conversation. Further it points out that Ms Suen does not say in her AEIC that such a telephone call took place or give any evidence of it. My decision 230 I have considered the evidence relating to this conversation which is alleged to have taken place between Ms Suen and Mr Sum.  Ms Suen was called as a witness. In para 11 of her AEIC, she refers to telephone calls from Mr Sum requesting the transfer of funds under the loan agreement and says she informed Qilin of them between 2 and 4 December 2015. She mentions nothing there about making an offer to Mr Sum to rescind the Loan Agreement in exchange for repayment of the loan. In cross-examination she did refer to a conversation with Mr Chu in which he asked about the sale of the shares. That must have taken place on or after 8 December 2015 when Qilin started selling the Pledged Shares and was referred to in para 12 of her AEIC where she said to Mr Chu that she “was not aware of subsequent dealings.” Although she does not refer to it in her AEIC, under cross-examination she said she had contacted Mr Wilbur after she had spoken to Mr Chu, and Mr Wilbur had said that he had the right to hedge the shares. She then said that “[Mr Wilbur] did say that if they don’t agree with this, they can [reverse] the deal as they want, if they agree.” She then thought she talked to Mr Chu and Mr Sum; and when asked whether she mentioned the question of reversing the deal, she said: “I think I talked to [Mr Sum] on this point.” 231 Mr Wilbur’s evidence is that he informed Ms Suen of this offer and “I believe she informed Mr Sum accordinglyviatelephone call.” That is not persuasive, nor is the way he sought to support it in cross-examination by saying that Ms Suen had told him she had informed Mr Sum. I deal with my view of the credibility of Mr Wilbur’s evidence below. 232 Mr Chan and Mr Lee in their AEICs say that there were not aware of any conversation between Ms Suen and Mr Sum or of any offer made by Qilin. Mr Chu refers to conversations with Ms Suen on or after 4 December 2015 concerning the transfer of the Pledged Shares to the Haitong Account, and on or after 8 December 2015 concerning the sale of Pledged Shares. On the first occasion, Mr Chu says that Ms Suen said that Qilin was entitled to transfer the shares and, on the second occasion, that Qilin “could not have been selling, and was probably only hedging” the shares. 233 I do not consider that any offer to rescind the Loan Agreement and repay the Loan was made to CPIT. Whilst there is some evidence that Mr Wilbur informed Ms Suen of the offer, he obviously could not give evidence of what then happened. Ms Suen’s evidence on this point was unsatisfactory. She mentioned nothing about the offer in her AEIC when, in para 11 and 12, she was clearly being asked to recall what happened in early December 2015. She gave no evidence in her AEIC of a conversation with Mr Wilbur or of a conversation with Mr Sum. Her oral evidence was that the offer was made after Qilin started selling the shares, which must have been after 8 December 2015. Her evidence was that she did not mention it to Mr Chu who had contacted her and to whom she would be expected to pass on any offer. Instead, with uncertainty in her voice, she said “I think I talked to [Mr Sum] on this point”. I found that answer less than convincing. 234 Even if there might have been a discussion between Ms Suen and Mr Wilbur, I do not accept that Ms Suen passed on any offer to Mr Sum. In any event, Mr Sum had been engaged by CPIT to obtain the loan under the Commission Agreement. I do not consider that he had express authority to act as agent in respect of any offer to rescind the Loan Agreement or that he had implied, apparent or ostensible authority to receive such offers so that any offer made to him would be an offer made to CPIT. 235 It follows that I do not accept that any offer was made to CPIT or, indeed, to Mr Sum on 5 December 2015, as pleaded.",
        "Rejection of offer by CPIT": "Qilin’s submissions 236 Qilin says that this offer was rejected by CPIT, through Mr Sum and that Mr Sum informed Ms Suen that CPIT would continue with the Loan Agreement and requested that the second tranche of the loan be disbursed to them. CPIT’s submissions 237 CPIT submits that this alleged communication to Ms Suen through Mr Sum is also not borne out by the evidence. It refers to the pleaded case in Qilin’s further and better particulars that this communication was “made orally between[Mr Sum] and [Ms Suen] via telephone on or about 7 December 2015”. It points out that this is inconsistent with the date of 5 December 2015 pleaded in Qilin’s defence. 238 In any event, CPIT says that there is no documentary evidence supporting this alleged communication, whether taking place on 5 or 7 December 2015. In relation to witness evidence, CPIT refers to the evidence of Mr Chan and Mr Lee in their AEICs where they state that they were not aware of any such communication and points out that Ms Suen does not even say in her AEIC that such a communication in fact took place. It therefore submits that the alleged communication is not supported by the evidence. My decision 239 Having found that there was no communication of an offer by Ms Suen to Mr Sum, the communication in response must necessarily fail. However, in relation to the communication in response, the only evidence is that of Mr Wilbur who says that on 7 December 2015 he was informed by Ms Suen that Mr Sum confirmed that CPIT would continue with the Loan Agreement and requested the second tranche of the Loan to be disbursed to them. Ms Suen gives no such evidence in her AEIC where she sets out the evidence of conversations with Mr Chu in early December 2015 and there is no document to support this. There is clear evidence from Mr Chan and Mr Lee that they did not and did not ask anyone else to communicate to Qilin that CPIT wished to continue with the Loan Agreement or for the second tranche of the loan to be disbursed to them. 240 I consider that Mr Wilbur’s evidence is in error. Having observed his evidence, in particular, both in relation to an email chain between Ms Suen and Mr Sum and in relation to another loan transaction which he sought to rely on, and also the way in which he answered and embellished his answers about events in early December 2015, I have regrettably come to the conclusion that his evidence was not just mistaken but was put forward in an attempt to support Qilin’s case. If there had been a request for the second tranche to be disbursed, there would have been a record of that or of steps being taken to implement it either by CPIT or by Qilin. There was nothing. 241 I therefore find that there was no communication made on 5 or on 7 December 2015 by CPIT stating that it wished to continue with the Loan Agreement nor did it request that the second tranche of the loan be disbursed. Conclusion 242 It follows that there is no factual basis to establish that CPIT made a clear and unequivocal promise, through Mr Sum that it would continue with the Loan Agreement. Nor is there any evidence that Qilin acted in reliance on anything said by CPIT or Mr Sum. They had decided to sell the Pledged Shares and continued to do so, contending now that they were entitled to do so in order to “hedge” by the terms of the Loan Agreement, not because of anything said or done by CPIT. Qilin’s estoppel defence therefore fails.",
        "Relief claimed by CPIT": "243 As stated above, I have found that: (a) Qilin was in breach of the Loan Agreement by selling the Pledged Shares; (b) Qilin holds the Proceeds of Sale on trust for CPIT; (c) Qilin was not entitled to terminate the Loan Agreement for a Default by CPIT; and (c) CPIT was entitled to and did terminate the Loan Agreement on 4 January 2016. I now turn to consider CPIT’s entitlement to relief arising from those findings. 244 CPIT seeks three broad heads of relief: (a) Damages for breach of contract against which CPIT concedes that it will give credit for the loan sum of HK$31,250,000.00. It seeks two heads of damages: (i) Damages for breach of contract for the Sale and/or Disposals in terms of loss of CPIT’s rights in the 25,000,000 Pledged Shares; and (ii) Damages for breach of contract for the decrease in the value of CPIT’s shareholding in Millennium as a result of the Disposals. (b) The trust proceeds in excess of the loan sum of HK$31,250,000.00, against which CPIT concedes that it must make allowance for any overlap with the relief awarded for damages for breach of contract. (c) An account of profits from the Sale and/or Disposals and a tracing order. CPIT is not seeking the delivery up of the remaining Pledged Shares. 245 CPIT submits that Qilin, in breach of the Agreements, disposed of 25,000,000 Pledged Sharesviathe Sale on 2 December 2015. The value of each of those shares sold in breach of contract was HK$2.50 based on the Sale Note. Consequently, CPIT claims the loss suffered in terms of loss of its rights in the Pledged Shares as a result of the breach in the sum of HK$62,500,000.00 less the loan sum of HK$31,250,000, that is HK$31,250,000. 246 Alternatively, if the relevant breach is not the Sale but the Disposals, CPIT claims for the loss of its rights in the Pledged Shares based on the value of HK$2.50 per share, being the contractual strike price as stated in the Closing Statement dated 1 December 2015 or alternatively HK$2.32, being the closing price on 7 December 2015. It submits that it is inappropriate to use the share price on subsequent days because Qilin’s Disposals from 8 December 2015 drove down the share price and to use any of these lower prices would be allowing Qilin to take advantage of its own breach to reduce the damages payable. 247 At the contractual strike price, CPIT claims HK$62,500,000.00, being HK$2.50 per share for 25,000,000 shares, less the loan sum of HK$31,250,000.00, giving HK$31,250,000.00. If the closing price on 7 December 2015 were to be used, CPIT claims HK$26,750,000.00 based on HK$2.32 rather than the HK$2.50 Closing Statement price. CPIT says that the sum based on the closing price of HK$1.98 on the first date of the Disposals of 8 December 2015 would be HK$18,250,000.00. 248 CPIT also makes a claim based on the fall in price of the value of its portfolio of Millennium Shares caused, it submits, by the Disposals of the Pledged Shares. It is convenient to deal with that issue first.",
        "Loss to CPIT’s portfolio": "249 The relevant issue arising from the pleadings is “whether the fall in the price of Millennium Shares from 8 December 2015 was an inevitable eventuality because the prices of Millennium Shares were artificially maintained and, if so, whether CPIT was involved in, either directly or indirectly, and/or and knowledge that they were artificially maintained… [if so] what is the effect on the relief claimed by CPIT”. 250 In summary, CPIT submits that there was no artificial maintenance of the share price and, if there was, CPIT had no knowledge of this nor were they involved in it. Instead it says that the fall in share price from 8 December 2015 was not an inevitable eventuality but that the Disposals caused the fall in share price. Artificial maintenance of share price 251 CPIT submits that there is insufficient evidence to establish that there was any artificial maintenance of the share price. It says that artificial maintenance would occur where a party or a group of parties had intentionally taken steps to maintain the share price at a higher point than it would have been but for those steps. It submits that the expert evidence does not establish that this happened in this case. 252 Qilin submits that the share price had been artificially maintained because, based on the expert evidence of Mr Chong, the Millennium share price was very significantly overinflated. It relies on Mr Chong’s view that Millennium’s current business was faring poorly; its prospects were more announcements than actions; its valuation was ridiculously high; its financial performance was weak and getting weaker; and subsequent and extensive writs of summons called into question its governance. He regarded the Millennium share price as “very unusual”. 253 I first consider what evidence there was of artificial maintenance of the Millennium share price. In his expert evidence, Mr Chong dealt with whether there was artificial maintenance by considering whether there were breaches of ss 197 and 198 of the Securities and Futures Act (Cap 289, 2006 Rev Ed), which would be a criminal offence in Singapore. 254 In relation to s 197, he considers whether “a person created or was likely to create a false or misleading appearance— (a) of active trading in any securities on a securities market; or (b) with respect to the market for, or the price of, such securities.” 255 In his AEIC, Mr Chong stated that he was unable to answer the question of whether anyone undertook an action which created or was likely to create a misleading appearance, due to insufficient information. His view, however, was that the actions which led to the share price and share price performance of Millennium between 5 January and 1 December 2015 would be likely to mislead an investor to falsely assume that Millennium’s current business was faring well and/or its prospects were good; and/or that Millennium was in an industry where extremely high valuations were the norm; and/or that Millennium’s financial performance was good; and/or that there were no issues about its governance, when his view is that the opposite was true. 256 In relation to s 198, Mr Chong considers whether a person through two or more transactions “have, or are likely to have, the effect of raising, lowering, maintaining or stabilizing the price of securities of the corporation on a securities market.” Again, he concluded that he was unable to give an answer as to whether anyone undertook an action through two or more transactions that had or were likely to have the relevant effect on the Millennium share price, because he did not have sufficient information. 257 However Mr Chong gave an opinion on the effect of raising, lowering, maintaining or stabilizing the price of Millennium shares. He stated that, on his analysis, an investor would expect the share price of Millennium to fall after an initial rally or at least remain moribund in 2015 and would not have expected the price of Millennium to rise by 595% between the closing price of 5 January and 1 December 2015. However, as he confirmed in his evidence he was not saying that the share price had been manipulated. 258 Thus, whilst Mr Chong’s view was that Millennium’s current business, prospects, valuation, financial performance and governance did not justify Millennium’s share price performance in 2015, he could not attribute it to any particular action by any particular person. 259 Mr Rigby also accepted that the share price of Millennium appeared overvalued on a conventional analysis but said that stocks frequently capture the imagination of the investing or speculating public and go over and above conventional valuations and that, if this was the case with Millennium, that could lead to overvaluation in a conventional sense. This then would explain the share price without there being any artificial manipulation. 260 While Mr Wilbur expressed the view that the quick and sudden slide of the prices of the Millennium Shares so shortly after the funds were disbursed was probably a result of a scheme to maintain the share price, he accepted that this was speculation and, in any event, I discount his evidence as being of any assistance, for the reasons set out above. 261 It is common ground between the experts that by December 2015 the Millennium shares were overvalued. However, there might be a number of reasons for that, including the perception of the investing or speculating public. Neither of the experts was able to conclude that there was artificial maintenance of the Millennium share price on the information before them. Whilst the share price did not reflect the underlying weakness of Millennium on any conventional analysis, I cannot and do not conclude that this was as a result of any artificial maintenance. CPIT’s knowledge of or involvement in any artificial maintenance 262 As I have found that there was no artificial maintenance, I do not need to consider this aspect. However, I observe that, apart from inference from the share price, Qilin did not establish any involvement by CPIT in relation to the level of the share price. Again the allegation appears to be derived from Mr Wilbur’s evidence in his AEIC that “it is highly unlikely that [CPIT] had no involvement and/or knowledge in the said scheme to artificially maintain the price of Millennium Shares” and that “the quick and sudden slide or the price of the Millennium Shares so shortly after the funds were disbursed is probably a result of a scheme to maintain the share price until the disbursement of the funds so that [CPIT] is able to obtain the funding it desperately required.” Again, Mr Wilbur accepted that this was speculation and I give no credibility to these statements, for the reasons set out above. 263 I therefore have come to the conclusion that no artificial maintenance of the Millennium share price has been established, still less any artificial maintenance of which CPIT knew of in which CPIT was involved. Was a fall in share price an inevitable eventuality? 264 Qilin contends that the fall in the price of Millennium Shares from 8 December 2015 was an inevitable eventuality and it relies on the evidence of Mr Chong that Millennium’s share price was very significantly inflated and logic dictated that prices would have to deflate, and deflate by a significant quantum, eventually. 265 CPIT contends that the fall in share price was not inevitable. While it accepts that the share price was a “bubble”, it submits that circumstances change over time and could have meant that the bubble would not have burst. It refers to Mr Rigby’s evidence that a stock bubble cannot simply be said to be “ripe for bursting” as it can get riper and riper. Whilst, after it has burst, that might seem to be inevitable he said that one never knows whether it is going to burst or whether the company is going to be transformed and go on to wonderful new things. 266 CPIT submits that it is impossible to say when the bubble will burst. So, just because there is a bubble now, it is not inevitable that the prices will decline in the future. Therefore, on the evidence, CPIT says that it is impossible to conclude that the fall in the price of Millennium shares from 8 December 2015 was an inevitable eventuality. Nor, it submits, can it be concluded that the fall in share price that took place from 8 December 2015 onwards would have happened even if Qilin had not made the Disposals. It submits that the historic share price performance up until Qilin’s Disposals would suggest the opposite and Qilin has not discharged the burden of proving that that the share price decline was an inevitable eventuality. 267 These points on the inevitable eventuality are best considered in the context of causation of the fall in share price and whether it was caused by the sale of the Pledged Shares by Qilin. The cause of the fall in the share price (1) CPIT’s submissions 268 CPIT submits that the decrease in share price from 8 December 2015 was a direct result of the Disposals of the shares by Qilin in breach of the terms of the Loan Agreement. CPIT refers to the evidence of Mr Rigby and Mr Chong and says that Mr Rigby’s evidence was that the sale of the shares “materially contributed to and accelerated the decline” in the share price. It refers to Mr Rigby’s evidence that Qilin’s selling had acted like a finger removed from a cork held under water so that the cork immediately popped up. Whilst he could not assess the price impact of the sales in question, he said he was certain that the effect was meaningful. CPIT also refers to Mr Chong’s evidence that the sale of the shares by Qilin was like a “trigger” although he said that the magnitude of the fall, which he described as an avalanche, was due to the pre-existing condition of the shares. 269 CPIT refers to the fact that, in the course of 8 December 2015, Qilin sold more than a million of the Pledged Shares. CPIT says that the volume of this sale represented an “aggressive” or “very significant” 65.23% of the preceding five day trading average volume of sales and that, by the close of trading on 8 December 2015, the share price had plummeted from HK$2.32, the closing price on 7 December 2015, to HK$1.98, the closing price on 8 December 2015. It points out that prior to this date, the share price had not fallen below HK$2.00 for the entire year and that from 8 December 2015 onwards, as Qilin continued with the Disposals, the price of Millennium shares continued to fall. 270 CPIT says that the experts are in broad agreement that Qilin’s selling caused a fall in the share price, but Mr Chong takes issue with the magnitude of the fall in share price which Qilin should be responsible for because of pre-existing conditions in the share price. It states that both experts agree that the share price of Millennium was over-valued based on conventional analysis but Mr Rigby took the view that Qilin’s selling interacted with the overvaluation of Millennium shares so that the Millennium shares were “ideally set up for a sharp price decline once hit with very large amounts of incremental selling. That Qilin’s selling should have tipped the balance or accelerated and accentuated the price decline is neither surprising in hindsight nor should it have been thought of as being unpredictable in advance.” 271 CPIT submits that, even if Millennium’s share price was overvalued, Qilin must take the share price as it finds it. CPIT says that it is entitled to claim such part of the loss actually resulting as was at the time of the contract reasonably foreseeable as liable to result from the breach. It refers toOut of the Box Pte Ltd v Wanin Industries Pte Ltd[2013] 2 SLR 363 at [14]–[16] for the proposition that once a head of loss is found to be reasonably foreseeable, it is irrelevant what the quantum of the loss is. 272 CPIT submits that, looking at Qilin’s sales over the entire period of the Disposals as a percentage of the total market sales volume on the days of the Disposals, Qilin’s sales in total accounted for 19.3% of the total sales volume. If one were to look at the percentage of Qilin’s sales on the days it traded during the period of the Disposals, it amounts to 30.2%. It relies on Mr Rigby’s conclusion that this was “a very substantial percentage and a meaningful depressing effect on prices should have been expected both in advance of events as well as contemporaneously. Nor should this be surprising in hindsight.” 273 In relation to Mr Chong’s classification of effect, CPIT says that 19.3% was “material” and is very close to the threshold of “significant” with the effect of it being said to have most likely caused the price decline. CPIT has analysed each day’s trades and classified them as “material”, “significant” or “very significant” based on Mr Chong’s classification, by reference to the percentage that Qilin’s sales constituted over the five preceding day average. It submits that, as long as Qilin’s selling was at least “material”, either on a percentage of daily traded volume or the preceding five day average traded volume, Qilin’s selling caused the drop in share price. (2) Qilin’s submissions 274 Qilin submits that CPIT has the burden of proving the causative link between the selling of the shares and the fall in the share price. It refers to the need to ascertain whether the sale was the “effective” or “dominant” cause, as referred to inChitty on Contracts(Hugh G Beale QC gen ed) (Sweet & Maxwell, 30th Ed, 2010) vol 1 at para 26-032.  Qilin refers to the decisions inThe Feng Hang and others[2001] 3 SLR(R) 864 at [29] and [30] and also toSunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 (“Sunny Metal”) at [63]–[68]. It says that the question is “to put it more accurately, can the claimant adduce evidence to show that it is more likely than not, more than 50 per cent probable, that ‘but for’ the defendant's wrongdoing the relevant damage would not have occurred?” It submits that the test involves excluding the breach, and then asking whether the loss would have occurred in the circumstances without that breach. 275 On the evidence, Qilin submits that Mr Rigby fails to apply the “but for” test and says that when Qilin’s sale of the shares is removed, there is a myriad of other factors that makes it impossible to conclude that but for Qilin’s sale of shares, the price decline would not have occurred. On that basis it submits that CPIT has failed to establish that Qilin’s sale of shares was the “effective” for “dominant” cause of the fall in the share price. 276 Qilin also submits that, in addition to CPIT's failure to prove causation on a balance of probabilities, the damages claimed by CPIT are too remote as the collapse in prices of the Millennium Shares is not a foreseeable or natural consequence, given the pre-existing condition that the prices were artificially maintained. If damages are not foreseeable, Qilin says that the consequence in terms of the fall in share prices does not flow \"naturally\" from the breach as it was not reasonably foreseeable that a “Pump & Dump” scheme was being perpetuated. 277 Even if it had actual or imputed knowledge that the price of Millennium Shares was volatile, Qilin submits that it could not have realised, without special knowledge, in the form of inside information, that the prices of Millennium Shares were artificially maintained. Unlike CPIT, Qilin was not a substantial shareholder of Millennium and was not in the position to acquire such information. Therefore, Qilin says that it was not reasonably foreseeable that Qilin's sales would have caused the fall in the Millennium share price. 278 Qilin refers to Mr Rigby’s evidence that he cannot quantify the extent to which Qilin’s sale of the shares contributed to the price decline. Qilin also relies on his evidence that he does not believe that anybody has succeeded in quantifying precisely what factors affect what percentage of a share price. Qilin says that Mr Rigby acknowledged that there were factors other than Qilin’s sale of shares which led to the price decline of Millennium Shares between 1 and 7 December 2015 and that those factors would have operated after 7 December 2015. Mr Rigby also referred to a “myriad of factors\". 279 In addition Qilin refers to Mr Rigby's evidence that the fall in share prices would have occurred sooner or later, given that the optimism in Millennium share prices was wholly unjustified. Qilin says that downward pressure already operated on the price of Millennium Shares before 8 December 2015 so that the optimism that held the prices of the shares up had dissipated even before 8 December 2015. It refers to Table 7.1 of Mr Chong’s Report as evidence of the downward pressure. 280 Qilin refers to Mr Chong’s evidence and Mr Rigby’s acceptance that there was a pre-existing condition caused by three matters identified by Mr Chong: (a) A sharply rising share price against a background of declining business, profits and cash flow; (b) The announcement by Millennium of 10 strategic alliances in 10 months none of which had materialised and/or contributed to Millennium’s business, profits or cash flow; (c) Exceptionally high valuations (historic PER 2013 of 1,269 and current Price to Revenue of 195x). 281 Qilin therefore submits that CPIT has failed to show causation between Qilin's sale of the Pledged Shares and the fall in the price of the Millennium shares. It says that CPIT has not shown that, in the absence of Qilin's breach of contract, this steep fall in prices would not have occurred. It refers to the Court of Appeal decision inRobertson Quay Investment Pte Ltd v Steen Consultants Pte Ltd andanother[2008] 2 SLR(R) 623 (“Robertson Quay”) where the plaintiff claimed damages for the defendant's delay in a construction project, including the additional interest incurred. The Court of Appeal held at [39] that the premise that the defendant was responsible for the delay did not necessarily mean it was also responsible for the additional interest incurred as a result of the delay because there were other scenarios in which the plaintiff might have had to pay additional interest even in the absence of any breach by the defendant. 282 Qilin refers to para 2.4 of Mr Rigby’s report in which he states: “Qilin's selling was heavy and must have materially contributed to the price decline albeit not to an extent that can be quantified.” On this basis, Qilin says that any loss cannot be quantified but also that, applyingRobertson Quay, as the fall in the price of Millennium Shares was an inevitable eventuality, CPIT would only be entitled to nominal damages for its loss. (3) My decision 283 As made clear by the Court of Appeal inSunny Metal, the relevant test of causation is the “but for” test. The question is whether, but for Qilin’s sale of the shares the market price would not have fallen as it did between 8 December and 14 January 2016. The expert evidence in this case, unsurprisingly, shows how difficult it is to prove cause and effect between a particular cause, such as a sale of shares, and a movement of the share price. However, it is common ground between Mr Rigby and Mr Chong that the Millennium share price was overinflated and a “bubble ripe for bursting”. Mr Rigby likened Qilin’s selling of the shares as being like the removal of a finger on a cork in water and Mr Chong agreed that Qilin’s selling was like a trigger but said that the magnitude of the fall was caused by the pre-existing condition. 284 In this case, the relevant question is whether the substantial fall in the share price was caused by Qilin’s sales of shares. I consider that the fall in share prices which actually occurred was caused because of the overinflated price of the Millennium shares. I do not consider it can be said that but for Qilin’s sale of the shares the market price would not have fallen. The fall in the market price was waiting to happen and the dominant or effective cause of the actual fall in the market price was the overinflated price of the shares. The overinflated price meant that a sale of shares which normally would have had a minimal, if any, effect on the share price had a vastly disproportionate effect on the share price. Thus, I consider that it is unrealistic to describe the sale of shares as being the cause of the fall in the price of the Millennium shares. The effective cause was the overinflated price of the shares. 285 Given my view of the cause of the fall in the share price, I do not consider that it can be said that part of the fall in share prices was caused by the Disposals and part by the overinflated Price of the Millennium shares, even if it were possible to quantify each part separately. Further, there were, as the figures show, other substantial sales of the shares in the relevant period and, equally, it could not be said that a particular sale by Qilin rather than a sale by others caused a particular fall. In fact the fall that actually happened was caused by the overinflated Millennium share price. 286 Although CPIT placed reliance on the principle of remoteness, I do not consider that it impacts on this issue. If I had found that the fall in the Millennium share price had been caused by Qilin’s sale of the Pledged Shares then the principle of remoteness would have had to be considered to see whether the loss was foreseeable. The fact that a drop in share price might have been foreseeable would have meant that, if causation had been shown, Qilin could not contend that the extent of the loss was not foreseeable if the type of loss was foreseeable. That, however, is not the relevant issue here. Conclusion 287  For the reasons set out above, I conclude that the cause of the substantial fall in the Millennium share price was the overinflated share price at the beginning of December 2015 and not the Disposals of the Pledged Shares by Qilin.",
        "Damages arising from the sale of Pledged Shares": "Parties’ submissions 288 CPIT seeks damages for breach of contract for the Sale and/or Disposals in terms of loss of CPIT’s rights in the 25,000,000 Pledged Shares. 289 Qilin submits that CPIT’s loss, if any, should be calculated by reference to the “true value” of the Millennium shares and not the initial, artificially inflated, value of HK$2.50. Qilin says that awarding CPIT damages based on the overinflated value would be giving CPIT an unjustified windfall at the expense of Qilin. Equally Qilin says that CPIT’s alternative value of HK$1.98 was based on an inflated value as at 8 December 2015. 290 Qilin therefore submits that, in any event, CPIT has not adduced any evidence of its loss and damage and it refers to the Court of Appeal decision inBeckkett Pte Ltd v Deutsche Bank AGand another and another appeal[2009] 3 SLR(R) 452 where there had been an earlier finding that the shares had been sold at an undervalue. The Court of Appeal stated at [68] and [140]: 68 In the present case, we are satisfied that the Pledged Shares had been sold at an undervalue. However, the law also requires that Beckkett must prove that it has suffered a loss as a result of the Bank breaching its duty to obtain the best price for the Pledged Shares. To do this, Beckkett must adduce evidence of the best price the Pledged Shares could have fetched if the Bank had discharged its duty in the exercise of its power of sale. … … 140 … The fact that the Bank has not acted with due care does not necessarily mean that it has sold the Pledged Shares at an undervalue or that Beckkett has suffered a loss. Beckkett has to prove its loss by producing evidence to show that the price at which the Bank sold the Pledged Shares was not the best price available. The burden of proof is on Beckkett to produce such evidence to show that there was a shortfall against which it may rely on as a defence to the counterclaim by way of set-off. As far as the law is concerned, if Beckkett fails to prove a shortfall, then it has suffered no loss in law. My decision 291 The nature of the non-recourse loan in this case meant that CPIT lodged shares then valued at HK$2.50 each as security for the loan. The 25,000,000 shares at that time were valued at HK$62,500,000 and the loan of HK$31,250,000 was provided. Whilst Qilin was not entitled to sell those shares, it did so but there is no complaint that it failed to obtain the market value when it sold the shares and I have held that the sale of the shares was not the cause of the fall in the Millennium share price. 292 As made clear by the authorities, in particular inEllis, the mortgagor only suffers a loss if, when it redeems the security, that security is less valuable than it should have been on the date the mortgage would have been redeemed or, in this case, on the date the Loan Agreement was terminated. In other words, CPIT was entitled to have the value of the shares returned to it on 4 January 2016. Given my decision on causation, I do not consider that CPIT was entitled to have the value of the shares of HK$2.50 or the value on 7 December 2015 of HK$2.32 or on 8 December 2015 of HK$1.98 returned to it. For CPIT to be put in the position it would have been in, but for the breach, it would have had 25,000,000 shares returned to it at the value of those shares on 4 January 2016 of HK$1.20, giving it HK$30,000,000. However, to redeem the shares at that date, CPIT would have to repay the loan of HK$31,250,000. It follows that CPIT did not suffer any loss because of the breach by Qilin in selling the Pledged Shares – the loss which it suffered is the loss in value of the shares because of the fall in the share price. 293 I therefore do not consider that CPIT has proved that it is entitled to claim damages in the sums claimed by it. It has failed to prove its loss. Indeed, given the evidence of the overinflated value of the Millennium share price in December 2015, it is difficult to see what loss CPIT would have suffered, in any event. 294 Qilin contended that CPIT had failed to mitigate its loss and therefore that the sum awarded for damages should be reduced to take account of that failure to mitigate. In the light of my finding that CPIT has not established its claim for damages, I do not need to consider the alleged failure to mitigate. However, in any event, the first point relied on by Qilin was a failure to accept the offer made by Ms Suen to Mr Sum on 5 December 2015 which I have found was not made. The second was a failure to purchase 22,140,000 Millennium shares on 27 January 2016. It is not clear how the purchase of shares on that date would have mitigated damages or why a party in the position of CPIT would be obliged to act in that manner by way of mitigation, as a matter of commercial common sense, as alluded to inJia Min Building Construction Pte Ltd v Ann Lee Pte Ltd[2004] 3SLR(R) 288at [73].",
        "Claim based on the breach of fiduciary duty": "295 As I have held above, Qilin sold the Pledged Shares in breach of its obligations under the Loan Agreement, and it held the proceeds of the Sale on trust, after taking account of the loan and paying the expenses of the Sale. The first breach occurred when Qilin sold the Pledged Shares to itself by the Sale on 2 December 2015 at a price of HK$62,500,000. I therefore consider that Qilin held that sum, less the loan of HK$31,250,000 less expenses on trust for CPIT. The only evidence of any possible expenses was the cost of stamp duty. But it is not clear whether Qilin paid that as seller or buyer and Qilin has not submitted that the stamp duty should be taken into account. 296 Accordingly, I hold that Qilin holds the sum of HK$31,250,000 on trust for CPIT and that CPIT is entitled to be paid that sum.",
        "Remedy of an account": "Parties’ submissions 297 CPIT submits that by entering into the Sale and Disposals, Qilin breached its fiduciary duty and that, as a result, it is entitled to an order for an account to be taken. 298 Qilin accepts that the remedy of account of profit and for an inquiry to trace the proceeds into assets traditionally arises when there is a breach of equitable obligations. It submits that, while an account of profits may be granted as a remedy for breach of contract, that is exceptional and refers to the decision inNg Bok Eng Holdings Pte Ltd and another v Wong Ser Wari[2005] 4 SLR(R) 561 at [56]–[57]. My decision 299 In this case, Qilin sold the Pledged Shares in breach of contract but then, as a result of being an equitable mortgagee, the proceeds of the Sale less the value of the loan were held on trust for CPIT. To the extent that Qilin used those proceeds and made a profit, I consider that it is appropriate to order the remedy of an account of any profits made. I therefore order that an account be taken.",
        "Summary of the courts’ orders": "300 For the reasons set out above, I find that CPIT is entitled to the following relief: (a) Payment of HK$31,250,000 held on trust, being the proceeds from the Sale of the Pledged Shares, less the values of the loan. (b) An account of the profits made by Qilin in respect of the sum of HK$31,250,000 held on trust. 301 Otherwise, I dismiss the remaining claims and counterclaims. 302 In Annex 1 to this judgment I set out the issues in this case and my answers to them. 303 To the extent that matters cannot be agreed, a case management conference will be fixed within 21 days of the handing down of this judgment to deal with interest, costs and the sums held by the Defendant’s solicitors in relation to the Injunction and the Consent Order. Vivian RamseyInternational Judge Tan Poh Ling Wendy and Kenneth Chua (Morgan Lewis Stamford LLC) for the plaintiff;Roderick Martin SC, Renganathan Nandakumar, Vernon Voon and Sharon Chung (RHTLaw Taylor Wessing LLP) for the defendants.",
        "Annex 1: Answers to issues in the case": "",
        "Plaintiff’s claims": "Claim 1: Qilin’s breach of Loan Agreement and Control Agreement (collectively the “Agreements”) 1 Whether the First Defendant or the Second Defendant is the contracting party (“Qilin”) to the following agreements with the Plaintiff (“CPIT”): (a) A Stock Secured Financing Agreement dated 16 November 2015 between CPIT and Qilin (\"Loan Agreement\"); and (b) A Control Agreement dated 16 November 2015 between CPIT, Qilin and Prominence (\"Control Agreement\"). Answer: The Second Defendant is the contracting party. 2 Whether the First Defendant was the controller and/or manager of the business and/or operations of the Second Defendant orviceversa. Answer: Neither party was the controller and/or manager of the business and/or operations of the other party. 3 Whether Qilin is entitled, under Clause 5(f) of the Loan Agreement and/or Clause 1 of the Control Agreement, to sell the shares owned by CPIT in Millennium Pacific Group Holdings Limited (Stock Code #8147) (“Millennium”) pledged by CPIT as collateral for Qilin's loan (“Pledged Shares”) in the absence of an event of default under the Loan Agreement. Answer: Qilin is not entitled to sell the Pledged Shares in the absence of an event of default under the Loan Agreement. 4 Whether it is an implied term of the Agreements that Qilin is not permitted to sell any part of the Pledged Shares unless and until there was an event of default under the Loan Agreement. Answer: This issue does not arise. 5 Whether a decrease in the price of the Pledged Shares of more than 35% for three consecutive trading days was caused or contributed to by Qilin's sale of the Pledged Shares and if so, whether Qilin was entitled to rely on this share price decrease to trigger an event of default under Clause 5(h)(i) of the Loan Agreement. Answer: There was no decrease in the price of the Pledged Shares of more than 35% for three consecutive trading days. 6 If Qilin was entitled to rely on the decrease in the price of the Pledged Shares of more than 35% for 3 consecutive trading days to trigger an event of default under Clause 5(b)(i) of the Loan Agreement, whether Qilin was obliged to issue a notice of termination of the Loan Agreement or take any further steps under Clause 4(a) of the Loan Agreement before it was entitled to sell the Pledged Shares. Answer: Qilin was not entitled to issue a notice of termination of the Loan Agreement. 7 Whether Qilin repudiated and/or renounced the Loan Agreement and/or Control Agreement by its sale of the Pledged Shares. Answer: Qilin did repudiate the Loan Agreement and that repudiation was accepted by CPIT’s Solicitors’ letter of 4 January 2016. Claim 2: Qilin's breach of fiduciary duty and/or breach of trust 8 Whether an equitable mortgage was created in favour of Qilin was by virtue of the terms of the Loan Agreement and/or Control Agreement such that Qilin owed CPIT a fiduciary duty in respect of the proceeds of sale of the disposed Pledged Shares (“Proceeds of Sale”). Answer: Yes. 9 Whether Qilin holds the Proceeds of Sale and the remaining undisposed Pledged Shares on trust for CPIT. Answer: Qilin holds the Proceeds of Sale, less the loan amount on a constructive trust for CPIT. 10 Whether Qilin has knowingly dealt with the Pledged Shares and/or Proceeds of Sale in an unconscientious and/or unconscionable manner such that it would be inequitable to allow Qilin to assert beneficial ownership of or to knowingly retain the Pledged Shares and the Proceeds of Sale in a way that affects Qilin’s conscience, therefore giving rise to a constructive trust (institutional and/or remedial) over the Pledged Shares and the Proceeds of Sale in favour of CPIT. Answer: See the answer to issue 9. Claim 3: Qilin's conversion of the Pledged Shares 11 Whether Qilin converted any of the Pledged Shares by not delivering up the shares to CPIT as it demanded on 4 January 2016 following CPIT's acceptance of Qilin's repudiation and/or renunciation of the Loan Agreement and/or the Control Agreement as terminating the Agreements. Answer: CPIT has not established that Qilin converted the Pledged Shares. Estoppel defence pleaded by the 2nd Defendant 12 Whether the following matters took place and if so whether by reason of them CPIT is estopped from enforcing or relying on its legal rights: (a) CPIT allegedly became aware of the 2nd Defendant's transfer of the Collateral to Qilin's brokerage account with Haitong International Securities Company Limited on or about 3 December 2015. (b) The 2nd Defendant then allegedly offered CPIT the option to rescind the Loan Agreement   where the 2nd Defendant   would return all of the Collateral to CPIT (as well as pay for the lawyer's fees and return the 1% placement/origination fee), in exchange for CPIT refund of the loan to the 2nd Defendant. (c) On or about 5 December 2015, CPIT through Alex Sum allegedly communicated over the telephone to the 2nd Defendant through Becky Suen that CPIT would continue with the Loan Agreement and requested for the second tranche of the loan to be disbursed to them. (d) The 2nd Defendant allegedly relied on the Alleged Representation and altered its position by continuing to sell the Pledged Shares. As the share price has fallen, the 2nd Defendant pleaded that it is inequitable for CPIT to now claim that the 2nd Defendant has breached the terms of the Loan Agreement by selling the shares. Answer: CPIT is not estopped from enforcing or relying on its legal rights. Reliefs sought by CPIT 13 Whether CPIT has suffered any loss or damage as a result of Qilin's disposal of the Pledged Shares. Answer: CPIT has not established that it suffered a loss as a result of Qilin’s disposal of the Pledged Shares. 14 What has Qilin gained as a result of the disposal of the Pledged Shares? Answer: To be determined by an account. 15 Whether CPIT has failed to mitigate its loss as alleged by Qilin by CPIT not: (a) accepting the offer which the 2nd Defendant alleged was madeviatelephone orally through Becky Suen on behalf of the 2nd Defendant to Alex Sum on behalf of CPIT on or around 5 December 2015 to rescind the Loan Agreement where the 2nd Defendant would return all of the Pledged Shares to CPIT (as well as pay for the lawyer's fees and return the 1% placement/origination fee), in return for CPIT’s refund of the loan to the 2nd Defendant;   and/or (b) purchasing 22,140,000 Millennium shares in the open market shortly on or after the service of the Affidavit of Cheng Yin Kong on 27 January 2016 on CPIT's solicitors. Answer: No, but no question of mitigation arises.",
        "2nd Defendant’s Counterclaim": "16 Whether CPIT has wrongfully repudiated the Agreements by issuing a letter from their Hong Kong's solicitors dated 4 January 2016 stating that CPIT accepted the 2nd Defendant’s repudiation and/or renunciation of the Loan Agreement and the Control Agreement as terminating the same. Answer: No. 17 If so: (a) whether the 2nd Defendant suffered loss and damage in the sum of HK$31,250,000.00 (which is the loan amount) or at all; and (b) whether the 2nd Defendant was entitled to recover such loss and damage given the non-recourse nature of the loan. Answer: Not applicable.",
        "Annex 2: Change in the closing price of Millennium shares from 1 December 2015 to 14 January 2016": "DateClosing price (HK$)Percentage change from previous trading day (%)Percentage change from price of HK$2.50 per share (%)01.12.20152.50N.A.﻿N.A.02.12.20152.42- 3.2- 3.2003.12.2015﻿2.430.41- 2.8004.12.20152.34- 3.70- 16.0007.12.20152.32- 0.85- 18.0008.12.20151.98- 14.66- 52.0009.12.20151.65- 16.67- 34.0010.12.2015﻿1.777.27- 29.2011.12.20151.68- 5.08- 32.8014.12.20151.732.98- 30.8015.12.20151.66- 4.05- 33.6016.12.20151.58- 4.82-36.80(1st trading day)17.12.20151.56- 1.27-37.60(2nd trading day)18.12.20151.42- 8.97-43.20(3rd trading day)21.12.20151.35- 4.93- 46.0022.12.20151.27- 5.93- 49.2023.12.20151.302.36- 48.0024.12.20151.396.92- 44.4028.12.20151.33- 4.32- 46.8029.12.20151.29- 3.01- 48.4030.12.20151.290- 48.4031.12.20151.24- 3.88- 50.4004.01.20161.20- 3.23- 52.0005.01.20161.00- 16.67- 60.0006.01.20161.1010- 56.0007.01.20160.95- 13.64- 62.0008.01.20160.961.05- 61.6011.01.20160.89- 7.29- 64.4012.01.20160.75- 15.73- 70.0013.01.20160.70- 6.67- 72.0014.01.20160.68- 2.86- 72.80"
    }
}