{
    "case_title": "Alphire Group Pte Ltd vLaw Chau Loon",
    "ncitation": "[2017] SGHC 297",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 The plaintiff brings this action against the defendant to recover 68 sums of money.1Foot Note 1×Statement of claim (13 August 2015) at paragraph 3(b).The plaintiff claims that the defendant collected these 68 sums from the plaintiff’s clients on its behalf but has failed to account to the plaintiff for the sums.2Foot Note 2×Statement of claim (13 August 2015) at paragraph 10.In total, the plaintiff claims that the defendant owes it: (i) SGD 271,170, (ii) MYR 3,797,285, and (iii) HKD 18,742,810.3Foot Note 3×Statement of claim (13 August 2015) at paragraph 10(i)–10(iii). 2 After considering all the evidence and the parties’ submissions, I find that the plaintiff has made out its claim against the defendant for some of the 68 sums. Specifically, these are the sums that the parties have placed in Categories A and B as set out in the Scott schedule.4Foot Note 4×Scott schedule at pp 1–7.As for the sums which the parties have placed in Categories D and E,5Foot Note 5×Scott schedule at pp 11–13.I find that the plaintiff has not established that the defendant has either collected or failed to account for them. 3 I now set out the grounds for my decision.",
        "Background facts": "4 The plaintiff was incorporated in May 2012 by Ms Alicia Chua and the defendant. They were the plaintiff’s two initial shareholders and directors. The plaintiff ceased carrying on business in September 2014. The defendant ceased to be a director of the plaintiff in September 2015. 5 The plaintiff’s business was organising trips for its clients to foreign casinos. These trips are known as “junkets”.6Foot Note 6×Alicia Chua’s affidavit of evidence-in-chief (12 October 2016) at paragraphs 5 and 12.As a junket operator, the plaintiff essentially acted as a middleman between the casinos and its clients to facilitate its clients’ gambling. Thus, for example, it arranged for the casinos to extend credit to its clients and underwrote that credit.7Foot Note 7×Alicia Chua’s affidavit of evidence-in-chief (12 October 2016) at paragraph 6.It also collected money from its clients and paid the casinos for its clients’ losses. The casinos looked to the plaintiff, as the junket operator, and not to the plaintiff’s client for payment. The plaintiff as the junket operator therefore took on its clients’ credit risk.8Foot Note 8×Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 10(d) and 10(i).For its services, the casinos paid the plaintiff a commission based on the amount that its clients gambled at the casino.9Foot Note 9×Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 10(k). 6 The defendant’s primary role in the plaintiff’s business was to bring in new clients. But the defendant also collected money from the plaintiff’s clients.10Foot Note 10×Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 12.The 68 sums which the plaintiff claims from the defendant in this action are sums which the plaintiff says that the defendant collected from the plaintiff’s clients on the plaintiff’s behalf but failed to account to the plaintiff for.11Foot Note 11×Statement of claim (13 August 2015) at paragraphs 3–4. 7 The defendant concedes that he has collected some – but not all – of the 68 sums from the plaintiff’s clients. But he avers that he has paid all those sums either to the plaintiff or to six different casinos against the plaintiff’s debts to those casinos.12Foot Note 12×Defence (4 December 2015) at paragraph 7; Defendant’s particulars served pursuant to order of court (4 March 2016) at Annex B. 8 The parties have tendered a Scott schedule which breaks down the 68 sums which the plaintiff claims into five categories which they have called Categories A, B, C, D, and E. Put simply, the defendant admits collecting the sums in Categories A and B but claims he has either handed the sums over to the plaintiff or applied the sums towards the plaintiff’s business. The defendant denies collecting the sums in Categories D and E. Category C of the Scott schedule comprises sums that the defendant claims to have paid to various casinos on behalf of the plaintiff using sums that he collected from the plaintiff’s clients.13Foot Note 13×Scott schedule at pp 8–10; Defendant’s closing submissions (22 June 2017) at paragraph 177.As seen below at [27]–[31], this category overlaps with Category B14Foot Note 14×Defendant’s closing submissions (22 June 2017) at paragraph 117(c).and the two categories will therefore be analysed together. 9 To be more specific, the four categories that the plaintiff now claims from the defendant break down as follows: (a) Category A comprises sums amounting SGD 2,821,788.5215Foot Note 15×Plaintiff’s closing submissions (22 June 2017) at paragraph 16(a)(i); Scott schedule at p 2.which the defendant admits to having collected and which he alleges he has handed over to the plaintiff.16Foot Note 16×Scott schedule at pp 1–2. (b) Category B comprises sums totalling SGD 3,083,429.2217Foot Note 17×Plaintiff’s closing submissions (22 June 2017) at paragraph 16(a)(ii); Scott schedule at p 2.which the defendant also admits to having collected and which he claims to have used for the purposes of the plaintiff’s business.18Foot Note 18×Scott schedule at pp 3–7. (c) Category D comprises sums which represent the difference between (i) sums which the defendant claims to have collected in part and (ii) sums being claimed by the plaintiff.19Foot Note 19×Scott schedule at pp 11–12.These sums amount to SGD 202,708.56.20Foot Note 20×Plaintiff’s closing submissions (22 June 2017) at paragraph 16(b)(i); Scott schedule at p 12. (d) Category E comprises sums amounting SGD 1,095,770.2121Foot Note 21×Plaintiff’s closing submissions (22 June 2017) at paragraph 16 (b)(ii); Scott schedule at p 13.which the defendant denies collecting.22Foot Note 22×Scott schedule at p 13. 10 To summarise, Categories D and E are sums which the defendant denies collecting at all. And Categories A and B are sums which the defendant admits collecting but avers that he no longer has with him, either because he has handed the sums over to the plaintiff or because he has used them for the purposes of the plaintiff’s business.",
        "Issues to be determined": "11 The principal issue that I have to determine is whether the defendant has collected any of the 68 sums, and if so, whether he has paid them to the plaintiff or to the casinos or used them for the purposes of the plaintiff’s business. As will be seen, determining this issue requires determining a preliminary question: who has the burden of proving that the defendant has collected and discharged his obligations with respect to the 68 sums? This question arises because the plaintiff’s poor accounting practices have led to a paucity of objective evidence in relation to what happened to the money.23Foot Note 23×Plaintiff’s reply submissions (20 July 2017) at paragraph 36; Defendant’s closing submissions (22 June 2017) at paragraphs 167–170. 12 It is to the preliminary question that I now turn before addressing each of the four categories of the plaintiff’s claim.",
        "Burden of proof": "13 The defendant admits that he has a duty to account to the plaintiff for the sums that he has collected on its behalf.24Foot Note 24×Defence (4 December 2015) at paragraph 8; Statement of claim (13 August 2015) at paragraph 4.He therefore bears the burden of proving that he has handed over to the plaintiff the Category A sums and that he has used the Category B sums for the purposes of the plaintiff’s business. As for Categories D and E, the plaintiff rightly accepts that it bears the burden of showing that the defendant has collected these sums. If it can do so, the burden will shift to the defendant to show that he has discharged his obligation to the plaintiff to account for those sums. 14 The starting point in analysing the incidence of the burden of proof is s 105 of the Evidence Act (Cap 97, 1997 Rev Ed). That provision states that the “burden of proof as to any particular fact lies on that person who wishes the court to believe in its existence”. Accordingly, the burden of proof is to be determined by the parties’ pleadings and the facts which they each aver to be true in those pleadings. Where a defendant chooses to “confess and avoid” in his defence, the burden rests on him to prove the facts that underpin the avoidance. A defendant “confesses and avoids” where he accepts the allegation which the plaintiff makes against him, but nevertheless positively asserts further facts which he claims avoids his liability. The nature and effect of confessing and avoiding is explained by the Court of Appeal inSCT Technologies Pte Ltd v Western Copper Co Ltd[2016] 1 SLR 1471 at [23] as follows: [A] “confession and avoidance” plea [is where] the defendant expressly or impliedly “confesses” the truth of what is alleged against him (ie, the existence of the debt in this case) but proceeds immediately to “avoid” the effect of such an allegation (such as by positively asserting that payment was made as is the case here). … [I]t will be forthe defendantto prove the facts on which he relies to avoid liability… [emphasis in original] 15 On the facts of the case before me, the defendant’s defence on Categories A and B is a confession and avoidance defence. He admits that he collected certain sums from the plaintiff’s clients but avers that he has handed the sums over to the plaintiff or paid the sums to certain casinos on the plaintiff’s behalf.25Foot Note 25×Defence (4 December 2015) at paragraph 7.He has also identified with precision the sums he admits collecting, the sums he claims to have handed over to the plaintiff, and the sums which he claims to have paid to the casinos.26Foot Note 26×Defendant’s particulars served pursuant to order of court (4 March 2016) at Annexes A and B.Moreover, the defendant admits that he has an obligation to deliver a true and full account to the plaintiff of the sums he has collected.27Foot Note 27×Defence (4 December 2015) at paragraph 8.The burden is therefore on the defendant to prove that he has properly accounted for these sums. 16 The defendant relies onYap Son On v Ding Pei Zhen[2017] 1 SLR 219 to argue that s 108 of the Evidence Act applies to reverse the burden of proof.28Foot Note 28×Defendant’s reply submissions (20 July 2017) at paragraph 22.His reliance is misplaced.Yap Son Onstands for the proposition that s 108 applies when one party pleads a “confession and avoidance” defence and when theotherparty is in the position of an accounting party. In those circumstances, s 108 operates to reverse the burden of proof by placing it on the accounting party. That isbecause it is especially within the accounting party’s own knowledge how he has dealt with the money he is obliged to account for (Yap Son Onat [79] and [82]). 17 Here, the defendant is the one who has pleaded a “confession and avoidance” defence. He is also, by his own admission, the accounting party. In the light of this, the proposition set out inYap Son Ondoes not operate to relieve the defendant of the burden of proof which s 105 places upon him. 18 Lastly, the defendant submits that it is onerous for him to discharge this burden.29Foot Note 29×Defendant’s reply submissions (20 July 2017) at paragraph 44.That submission does not take his case very far. This is so for three reasons: (a) First, inSCT Technologies, the Court of Appeal noted at [32]–[33] that the burden of proof cannot be lifted merely because it would be “overly onerous” for a party to prove something. (b) Second, as the party alleging that he collected certain sums from certain clients and paid those sums either to the plaintiff or to certain casinos on the plaintiff’s behalf, the defendant was best placed to keep records of how he paid out these sums. Certainly, as between the parties, only the defendant knows from whom he collected the sums that he claims to have paid to the plaintiff and the casinos. (c) Third, the poor state of the plaintiff’s financial records is partly due to the defendant’s own practice of not keeping proper records.30Foot Note 30×Plaintiff’s reply submissions (20 July 2017) at paragraphs 39–41.It bears emphasising that the defendant was a director of the plaintiff at the material time and was in the best position to keep proper records not just for himself but also for the plaintiff as to who he collected the sums from and how he dealt with them. It therefore does not lie in the plaintiff’s mouth now to blame the plaintiff for its poor record keeping, especially when he admits that he has a duty to account to the plaintiff for these sums. 19 Accordingly, the burden is on the defendant to show that he has discharged his obligations with respect to the sums in Categories A and B (ie, the sums that the defendant admits collecting). As for Categories D and E (ie, the sums that the defendant denies collecting), the plaintiff accepts that it is the plaintiff who bears the burden of proving that the defendant collected these sums.31Foot Note 31×Plaintiff’s closing submissions (22 June 2017) at paragraph 42(b). 20 Bearing this analysis in mind, I now address the four categories of sums.",
        "Category A sums": "21 I find that the defendant has failed to account to the plaintiff for the Category A sums. It is the defendant’s case that he handed over one subset of the Category A sums to the plaintiff sometime around May 2013 by giving them either to the plaintiff’s office or to Ms Alicia Chua (“May 2013 Sums”).32Foot Note 32×Defendant’s closing submissions (22 June 2017) at paragraph 125.It is also the plaintiff’s case that he handed over the remaining Category A sums to Ms Alicia Chua sometime around August 2014 (“August 2014 Sums”).33Foot Note 33×Defendant’s closing submissions (22 June 2017) at paragraph 126; Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 106.But the defendant has failed to discharge his burden of proof for both subsets of the Category A sums. 22 I first note that the defendant is inconsistent in his evidence as to how he gave the May 2013 Sums to the plaintiff. In his affidavit of evidence-in-chief, he avers that he handed the sums over to “the office or Alicia”.34Foot Note 34×Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 105.But on the stand, he initially testified that he had given the sums to Ms Chuainthe office.35Foot Note 35×Transcript (Day 5) at p 16 (lines 2–7).He then changed his evidence and claimed that he had given these sums to heroutsidethe office to prevent the staff from noticing symptoms of his illness.36Foot Note 36×Transcript (Day 5) at p 29 (lines 1–21).These inconsistencies undermine the credibility of his evidence. At the very least, if the defendant says that he gave the sums to the plaintiff, it is reasonable to expect him to be able to say with some degree of certaintyhowhe gave the sums to the plaintiff. 23 Second, I agree with the plaintiff that the mere fact that the May 2013 Sums do not feature in the Stone Forest report37Foot Note 37×RS Ramasamy’s affidavit of evidence-in-chief (13 October 2016) at RSR-2.(a 2014 report commissioned by the plaintiff to review its accounts)38Foot Note 38×Alicia Chua’s affidavit of evidence-in-chief (12 October 2016) at paragraph 89.does not support the defendant’s case. It is true that the Stone Forest report is completely silent on the May 2013 sums in that these sums appear nowhere in the report. But there are a number of reasons why this may be so.39Foot Note 39×Plaintiff’s reply submissions (20 July 2017) at paragraphs 89–90.I bear in mind that it is Ms Chua’s evidence that the plaintiff, although it commissioned the Stone Forest report, does not rely on it now because it has “a large number of discrepancies, omissions and errors”.40Foot Note 40×Alicia Chua’s affidavit of evidence-in-chief (12 October 2016) at paragraph 92.Counsel for the defendant suggests that the real reason the plaintiff disavows the Stone Forest report now is because it does not support the plaintiff’s case.41Foot Note 41×Transcript (Day 2) at p 88 (lines 13–31).But I note the defendant adduces no evidence at all to suggest that the Stone Forest report is accurate. I accept Ms Chua’s evidence both as to the shortcomings of the Stone Forest report and also as to the plaintiff’s reason for no longer relying on it. I do not, therefore, draw any conclusion in the defendant’s favour from the absence of the May 2013 Sums from the Stone Forest report. 24 Third, just because Ms Chua told Ms Lim Siew Mei, who worked as the plaintiff’s executive secretary from August 2012 to October 2014,42Foot Note 42×Lim Siew Mei’s affidavit of evidence-in-chief (13 October 2016) at paragraph 1.not to chase the relevant clients for the May 2013 Sums as listed in the document titled “Summary of Player Outstanding Year 2012”43Foot Note 43×Lim Siew Mei’s affidavit of evidence-in-chief (13 October 2016) at paragraph 63.does not mean that the defendant had handed those sums over to the plaintiff. Certainly, as the defendant conceded in cross-examination, Ms Lim would not need to chase after the clients if the defendant had already collected the sums. By the same token, the defendant also acknowledged that just because he had collected sums from the plaintiff’s clients did not necessarily mean that he had handed those sums over to the plaintiff.44Foot Note 44×Transcript (Day 5) at p 18 (lines 17–32).In other words, the fact that Ms Chua told Ms Lim not to chase the plaintiff’s clients for the May 2013 Sums proves, in itself and at most, that Ms Chua believed that the defendant had collected those sums from those clients. The defendant adduced no independent evidence to suggest that the true reason for Ms Chua’s instructions was that the defendant had collected those sumsandhanded them over to the plaintiff. 25 I move on to the August 2014 Sums. The defendant claims that he handed over these sums to Ms Chua in a meeting before his participation in the plaintiff’s business ceased. In his affidavit of evidence-in-chief, the defendant claims that during this meeting, Ms Chua had a “handwritten page listing out all [his] players” and struck off the names of players as he handed the sums to her.45Foot Note 45×Law Chau Loon’s affidavit of evidence-in-chief (13 October 2016) at paragraph 74.But no such handwritten note was tendered to court.46Foot Note 46×Plaintiff’s closing submissions (22 June 2017) at paragraphs 75–76.Ms Chua testified that the defendant did not give her the August 2014 Sums and that there was no such note.47Foot Note 47×Transcript (Day 1) at p 72 (lines 13–17).Accordingly, there is nothing to tilt the balance of probabilities in the defendant’s favour. 26 In the premises, I find that the defendant is liable to the plaintiff for the Category A sums.",
        "Category B sums": "27 I find that the defendant has failed to account to the plaintiff for the Category B sums. The defendant avers that he used these sums for the purposes of the plaintiff’s business. It is a significant point that the defendant’spleadedcase is only that he paid the sums which he collected either to the plaintiff or to one of six casinos.48Foot Note 48×Defence (4 December 2015) at paragraph 7; Defendant’s reply submissions (20 July 2017) at paragraphs 4–5.It is not part of the defendant’s pleaded defence that he paid any of the sums which he collected to a third party, whether as expenditure for the plaintiff’s purposes or to discharge a debt which the plaintiff owed to the third party. The defendant is bound by his pleadings. It is therefore not open to the defendant to argue that he used the Category B sums for any purpose other than the six casino payments listed in his particulars49Foot Note 49×Defendant’s particulars served pursuant to order of court (4 March 2016) at Annex B.(which have also been placed under Category C of the Scott schedule).50Foot Note 50×Scott schedule at pp 8–9.In this connection, it is also not open to the defendant to argue that he used his own money to pay some of the plaintiff’s expenses, and to seek to set off those expenses from the plaintiff’s claim by way of reimbursement to him. 28 But even if the defendant is not bound by his pleadings, I find that the defendant has failed to account for the Category B sums. This is because he has failed to discharge his burden of proving: (i) that a set-off is available to him; and (ii) that he paid the six casinos out of the sums claimed by the plaintiff. 29 I start with the defendant’s suggestion that he made payments out of his own money on behalf of the plaintiff.51Foot Note 51×Defendant’s closing submissions (22 June 2017) at paragraphs 164–166.Even if I accept that he did so, he has made no submission to show precisely how much of his own money he used in this way. All that the defendant has done is to allege that the plaintiff did not have a system to record payments which he made on its behalf52Foot Note 52×Defendant’s closing submissions (22 June 2017) at paragraphs 167–170.and that the plaintiff has not demonstrated any loss.53Foot Note 53×Defendant’s closing submissions (22 June 2017) at paragraphs 171–172.These arguments are misdirected. The burden of proof on this aspect of the case is on the defendant. It is not enough for him simply to impugn the plaintiff’s record-keeping practice. I thus find that the defendant has failed to discharge the burden of proof to succeed in raising a set-off. 30 With regard to the casino payments, I disagree with the defendant that he need not show that he made the payments to the casinos out of the sums which the plaintiff claims.54Foot Note 54×Defendant’s reply submissions (20 July 2017) at paragraphs 40–44.In my view, it is incumbent on the defendant to show that the source of these payments to the casino were the sums which he collected from the plaintiff’s clients if he is to discharge his admitted obligation to account to the plaintiff for these sums. Put simply, he has an obligation to account for each cent collected; mere difficulty in attributing particular payments to the sums collected cannot and does not relieve him of the duty to account or discharge the duty. Therefore, aside from the casino payments that the plaintiff has recognised,55Foot Note 55×Statement of claim (13 August 2015) at paragraph 5.even if the defendant can show that he did indeed make all the payments set out in Category C (see [8] above), the principal difficulty that he has to surmount is to show that the payments were made out of the sums claimed by the plaintiff. But he has failed to tender any evidence to overcome this hurdle. 31 Accordingly, I find that the defendant is liable to the plaintiff for the Category B sums.",
        "Categories D and E sums": "32 Categories D and E are the sums which the defendant denies collecting. The plaintiff has not made any submissions or pointed to any independent or objective evidence – for example, oral evidence from the clients themselves – to establish that the defendant indeed collected the sums in these categories.56Foot Note 56×Defendant’s reply submissions (20 July 2017) at paragraphs 98 and 109. 33 I therefore find that the plaintiff has failed to discharge its burden of proving that the defendant is liable for these sums.",
        "Conclusion": "34 In the premises, I find that the defendant is liable to pay the sums in Categories A (SGD 2,821,788.52) and B to the plaintiff (SGD 3,083,429.22). Collectively, these sums amount to SGD 5,905,217.74. 35 I further note that the plaintiff has acknowledged that the defendant has paid SGD 1,737,945 and HKD 3,907,520 (converted to SGD 641,224.03)57Foot Note 57×Scott schedule at p 8.out of the Category B sums.58Foot Note 58×Plaintiff’s closing submissions (22 June 2017) at paragraphs 11, 12, and 16(b)(iii)(2); Statement of claim (13 August 2015) at paragraph 5.Taken together, these acknowledged payments amount to SGD 2,379,169.03. 36 For the reasons above: (a) The defendant shall pay to the plaintiff the sum of SGD 3,526,048.71 (being SGD 5,905,217.74 less SGD 2,379,169.03); and (b) The defendant shall pay to the plaintiff the sum of SGD 425,307.17 being interest on the said sum of SGD 3,526,048.71 at the rate of 5.33% per annum from 13 August 2015 (the date on which the writ was issued) to 16 November 2017 (the date of this judgment),ie2 years and 96 days at the rate of $514.90 per day. 37 I will now hear parties on costs.   Vinodh CoomaraswamyJudge Collin Seah, Reuben Tan, Jaime Lye and Timothy Ng (Quahe Woo & Palmer LLC) for the plaintiff;Palaniappan Sundararaj (instructed) and Lim Min (Straits Law Practice LLC), Thangavelu and Syafiqah Binte Ahmad Fu’ad (Thangavelu LLC) for the defendant."
    }
}