{
    "case_title": "Shaikh FaridvPublic Prosecutor and other appeals",
    "ncitation": "[2017] SGHC 239",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 Shaikh Farid (“Farid”), Shaikh Shabana Bi (“Shabana”) and Ho Man Yuk (“Ho”) (collectively “the Appellants”), all foreign nationals, were members of the Marina Bay Sands (“MBS”) casino. As MBS casino members, they were eligible to participate in a marketing promotion and entitled to redeem a fixed number of Free Play Credits (“FPCs”) that could be used at the casino. In April 2014, a computer system glitch occurred at the electronic redemption kiosks at the MBS casino, allowing Ho to redeem an apparently unlimited number of FPCs. Upon discovering this glitch, the Appellants pounced on the opportunity: over seven days, they swiped Ho’s membership card over 10,000 times to obtain more than a million FPCs, used them to gamble at the gaming machines, and then encashed their winnings which totalled a staggering $875,133.56 (“the Monies”). They remitted some of the Monies to various third parties and converted another portion into casino chips which they expended on more gambling before they were finally arrested. 2 At the end of a 20-day trial, Farid, Shabana and Ho were each convicted by the District Judge of one charge of engaging in a conspiracy to dishonestly misappropriate the Monies from the MBS casino, an offence under s 403 read with s 109 of the Penal Code (Cap 224, 2008 Rev Ed) (“the CMOP charge”), as well as various charges for converting, transferring or removing the Monies from jurisdiction, offences under s 47(1)(a) of the Corruption, Drug Trafficking and Other Serious Crimes (Confiscation of Benefits) Act (Cap 65A, 2000 Rev Ed) (“the CDSA charges”). Farid, Shabana and Ho were sentenced to imprisonment terms of 26 months, 12 months and 21 months respectively. 3 Magistrate’s Appeal Nos 9005, 9006 and 9007 of 2017 are the Appellants’ appeals against the convictions and sentences imposed by the District Judge. After hearing the parties, I reserved my judgment. I now deliver my decision, beginning with the background facts, which are uncontroversial.",
        "Background facts": "4 The Appellants were members of the MBS casino and were eligible from time to time to participate in various marketing promotions held there. This included the “Sands Bonus Dollars Rewards” promotion, under which eligible members were entitled to a limited number of Sands Bonus Dollars that could be redeemed for an equivalent number of FPCs at the Sands Rewards Club electronic kiosks in the MBS casino (the “redemption kiosks”). The precise number of Sands Bonus Dollars that a member was eligible to redeem was determined by various factors such as the frequency of his casino visits and his value worth to the MBS casino. The FPCs were not exchangeable for cash, but were electronic slot credits stored on the member’s membership card. One FPC was equivalent to a $1 cash credit and could be used at electronic gaming machines in the casino. After gambling, a paper slip of winnings would be generated which could then be exchanged for cash at various “Ticket In, Ticket Out” (“TITO”) machines located in the casino. 5 On 13 April 2014, Ho swiped her membership card at a redemption kiosk and selected the “Sands Bonus Dollars Rewards” icon. The following message was displayed on the screen: “You are eligible for $100 of Free Play Offer! Redeem offer now?” She then attempted to redeem the “offer” by clicking on the option “Yes, Redeem Now” and entering her four-digit PIN number. However, she was greeted with the following error message: “Sorry, service seems to be unavailable. Please try after sometime”. She exited the screen showing the error message and tried to swipe her card to redeem the Sands Bonus Dollars several more times, but the same error message appeared each time. Thereafter, she left the casino. 6 The next day, on 14 April 2014, Ho returned to the casino. She swiped her membership card at the redemption kiosk again and discovered that $800 worth of FPCs had been credited into her account from the day before. It transpired that even though the error message was displayed each time she swiped her card and selected the option to redeem the FPCs, 100 FPCs were in fact credited to her account on every such occasion. There appeared to be no limit to the number of FPCs she could obtain as long as she continued to swipe her card. Seizing the opportunity, she repeated numerous cycles of swiping her card to obtain the FPCs, using those FPCs to gamble at the electronic roulette machines, and encashing her winnings at the TITO machines. The Prosecution refers to this enterprise as the “swipe, gamble and encash” approach. 7 Later that evening on the same day, she called Farid and Shabana and asked them to join her at the MBS casino. When they arrived, she informed them of what she had been doing that afternoon. Over the next seven days from 14 April to 20 April 2014, the Appellants repeated numerous cycles of swiping, gambling, and encashing their winnings. On 16 April 2014, Ho even applied for an additional membership card; Ho and Farid then tried to use both cards simultaneously to carry out the “swipe, gamble, encash” endeavour, but this was apparently unsuccessful. In total, Ho’s membership card was swiped 10,293 times over the seven-day period to extract a total of 1,029,300 FPCs. These FPCs were expended at the electronic roulette machines, and the Monies amounting to $875,133.56 were encashed through the TITO machines. The Monies were the subject of the CMOP charge. 8 On 20 April 2014, Ho was detained by the authorities at the MBS casino. She alerted Farid through a text message that the “police [were] coming” and directed him to remove the $500,000 which was kept in a safe in their hotel room. Farid and Shabana, on their own accord, decided to take the sum to the Resorts World Sentosa (“RWS”) casino and converted the entire sum into casino gaming chips which Farid expended on table games. They were shortly thereafter apprehended at the RWS casino. 9 By the time of the arrests, a portion of the Monies had been converted into gaming chips which the Appellants expended on gambling in the two casinos, accumulating further winnings. Other sums of money had been remitted by the Appellants to various third parties. These transactions formed the subject of the CDSA charges.",
        "The District Judge’s decision": "10 The Appellants claimed trial to all the charges. The trial took place over about 20 days in the District Court. At the end of the trial, the District Judge convicted the Appellants of all the charges. 11 With regard to the CMOP charge, the District Judge found that each element of the charge had been proven beyond a reasonable doubt. First, the Monies belonged to MBS and not to the Appellants, as Ho was not entitled to more than 100 FPCs (at [47]–[48] of the grounds of decision: seePublic Prosecutor v Ho Man Yuk & others[2017] SGDC 23 (“GD”)). Second, the Appellants had misappropriated the Monies from MBS through a series of “detailed and calculated steps”, exploiting a glitch in MBS’ software (at [52] of the GD). Finally, the Appellants had clearly committed the acts with dishonest intention to cause wrongful loss to MBS and wrongful gain to themselves. This was evident from aspects of their statements which showed that they knew about the system error but exploited it to their advantage (at [54] of the GD). It was also inconceivable that the Appellants genuinely believed that Ho had somehow struck the “jackpot”, given that they had on previous occasions only been allowed to redeem a limited number of Sands Bonus Dollars and given the clear error message displayed at the redemption kiosk after Ho swiped her membership card and tried to redeem the FPCs. The deleted text message in which Ho warned Farid that the “police [were] coming” was also ground for drawing a reasonable inference that the Appellants knew that the Monies were “unclean funds” which did not belong to them (at [57]–[59] of the GD). Finally, there was a conspiracy among the Appellants to dishonestly misappropriate the Monies because each of them had admitted that the misappropriation was committed pursuant to a plan or agreement that they had entered into and each had played a different role in the process (at [68]–[70] of the GD). 12 In relation to the CDSA charges, the District Judge was satisfied that the sums of money that were the subject of the transactions identified were funds obtained from the predicate CMOP offence. This was evident from the Appellants’ own admissions in their statements and the objective documentary evidence of the transactions (at [92(a)] and [93] of the GD). In any event, investigations did not reveal that the Appellants had any other sources of income and they were completely unable to account for the large sums of money (at [92(c)] of the GD). The Appellants also knew that the source of the funds in the transactions were all directly or indirectly derived from the predicate CMOP offence and constituted benefits of their criminal conduct (at [98] of the GD). 13 In sentencing the Appellants for the CMOP charge, the District Judge noted that the Appellants had claimed trial and would not have been entitled to the same discount as an offender who has shown remorse and pleaded guilty timeously (at [126]–[127] of the GD). He was also not persuaded that there was effectively “restitution” of the Monies because $1.356m had been recovered by the police; he reasoned that the restitution was not made by the Appellants themselves but recovery was achieved “solely through the efforts of the police” (at [128] of the GD). He also disagreed that MBS suffered no loss; instead, he held that it had suffered financially by having to spend money on the investigations as well as at trial, and by virtue of the fact that it was the victim of an offence (at [128] of the GD). Finally, he held that the sentences for Ho and Farid should be higher than that for Shabana, because the first two were “clearly more culpable and more involved” (at [131] of the GD). 14 In relation to the CDSA charges, the District Judge took into account the fact that the amounts involved were large, that the money was recovered (although there was strictly speaking no “restitution”), and that there was no sentencing discount as they had not pleaded guilty to the offences (at [141] of the GD). 15 The District Judge also ordered that the sentence for the CMOP charge was to run consecutively with the CDSA charge involving the largest amount of tainted funds (at [148]–[149] of the GD). In the round, the District Judge imposed the following sentences on the Appellants: AccusedTotal chargesCMOP chargeCDSA chargesTotal sentenceRemarksFarid2712626 months’ imprisonment13 months’ imprisonment for CMOP charge to run consecutively with 13 months’ imprisonment for most serious CDSA charge (involving $500,000); the rest of the CDSA charges to run concurrently.Shabana41312 months’ imprisonment11 months’ imprisonment for CMOP charge to run consecutively with 1 month’s imprisonment for most serious CDSA charge (involving $5,000); the rest of the CDSA charges to run concurrently.Ho2112021 months’ imprisonment13 months’ imprisonment for CMOP charge to run consecutively with 8 months’ imprisonment for most serious CDSA charge (involving $75,000); the rest of the CDSA charges to run concurrently.",
        "The issues on appeal": "16 The appeals primarily, although not exclusively, challenge the District Judge’s findings of fact. The Petitions of Appeal raise numerous issues regarding the District Judge’s decision. In this judgment, I shall focus only on the most salient matters that emerged from the parties’ written submissions and at the hearing of the appeals. These are as follows: (a) In relation to the CMOP charge: (i) whether the Monies must have come into the Appellants’ possession “innocently, or in a neutral manner, or without wrong”; (ii) whether the Monies belonged to someone other than the Appellants; (iii) whether the Appellants had dishonest intention; and (iv) whether there was evidence of a conspiracy among the Appellants. (b)  In relation to the CDSA charges, whether the subject matter of the charges was traceable to benefits obtained from criminal conduct (that is, the predicate CMOP charge). (c) In relation to sentence, whether the sentences imposed were manifestly excessive.",
        "The CMOP charge": "17 The elements of the offence of criminal misappropriation under s 403 of the Penal Code were set out inWong Seng Kwanv Public Prosecutor[2012] 3 SLR 12 (“Wong Seng Kwan”) at [19]. They are as follows: (a) the movable property must belong to some person other than the accused person; (b) there must be an act of misappropriation or conversion to his own use; and (c) the accused person must possess a dishonest intention.",
        "Whether the Monies must have come into the Appellants’ possession “innocently, or in a neutral manner, or without wrong”": "18 The main legal argument put forth by counsel for Ho, Mr Selva K Naidu (“Mr Naidu”) centres on the contention that the essential elements of the s 403 offence of criminal misappropriation are not made out on the evidence. He argues that even if the District Judge’s findings of fact are accepted, on those findings, the Monies totalling $875,133.56 obtained through the “swipe, gamble and encash” approach didnotcome into Ho’s possession “innocently, or in a neutral manner, or without wrong”. This is because Ho swiped her membership card repeatedly with the knowledge that there was a computer system error. FPCs were thereby obtained, used to gamble at the electronic roulette machines, and the winnings encashed. As such, the facts of the present case did not admit of a conviction under s 403. At the hearing of this appeal, counsel for Farid and Shabana, Mr Sarbrinder Singh (“Mr Singh”), indicated that his clients would align themselves with Mr Naidu’s legal argument that the elements of s 403 have not been satisfied. 19 Mr Naidu’s contention is based on an extract from C K Thakker & M C Thakker eds,Ratanlal & Dhirajlal’sLaw of Crimes, A Commentary on the Indian Penal Code, 1860, Volume Two(Bharat Law House, 2007) (“Ratanlal & Dhirajlal”) at pp 2263–2264, wherein the learned authors suggest in their commentary on s 403 of the Indian Penal Code 1860 (identical in material terms to s 403 of our Penal Code) that “[c]riminal misappropriation takes place when the possession has beeninnocently come by”; the property “comes into the possession of the accused in someneutral manner” or is “alreadywithout wrongin the possession of the offender” [emphases added]. However, because of a “subsequent change of intentionor from the knowledge of some new fact with which the party was not previously acquainted” [emphasis added], the party’s continued retention of the property “becomes wrongful and fraudulent”. These views are echoed by Dr Sir Hari Singh Gour inThePenal Law of India, Analytical Commentary on the Indian Penal Code, Vol IV(Law Publishers (India) Pvt Ltd, 11th Ed, 2008) (“ThePenal Law of India”) at p 3918. For brevity and convenience, I shall refer to this as the “innocent possession” argument. In essence, the argument is that a s 403 offence can only be established where dishonest intention is formed only after the property in question has come into a person’s possession “innocently, or in a neutral manner, or without wrong”. 20 I note that the innocent possession argument appears at first blush to be consistent with the position taken in the local case ofWong Seng Kwan. In that case, the accused person found a wallet on the floor of the MBS casino and kept the cash in the wallet for himself. He faced one charge of criminal misappropriation under s 403 of the Penal Code. Steven Chong J (as he then was) drew a distinction between criminal misappropriation and theft in the following terms (at [15]): While the element of dishonesty is common to all property offences, the critical distinction between criminal misappropriation, theft, cheating and criminal breach of trust lies in the manner in which the accused personinitiallycomes across the movable property. An accused person commitstheftif the movable property was originally in the possession of some other person and the accused person moves the property with a dishonest intention to take it.Forcriminalmisappropriation, the accused personinitiallycomes across the movable property in a legally neutral manner (eg,by finding), and hesubsequentlyforms a dishonest intention to deal with the movable property in a manner that is inconsistent with the rights of the true owner… [emphasis in italics in original, emphasis added in bold] Chong J went on (at [16]) to refer to an extract fromThePenal Law of Indiaat p 3919, wherein the learned author states “[i]n theft the initial taking is wrongful, in criminal misappropriation it isindifferent and may evenbe innocent, but it becomes wrongful by asubsequentchange of intention” [emphasis added]. 21 Nonetheless, in my judgment, the innocent possession argument is unsustainable for the following reasons. As a preliminary matter, I note that this argument was unfortunately not canvassed before the District Judge but only on appeal, and in fact rests on a factual premise that contradicts Ho’s (as well as the other two Appellants’) entire defence at trial. The crux of their defence at trial was that Ho wasentitledto the FPCs, that there was no system error or computer glitch and that MBS had voluntarily credited the FPCs into Ho’s account. They allegedly believed that Ho was experiencing a streak of good fortune, had hit a “jackpot”, and had made legitimate winnings through redeeming the FPCs, using them to gamble at the electronic roulette machines and then cashing out her winnings. Indeed, the Appellants continue to rely on these arguments on appeal; I will come to these later in the judgment. 22Leaving aside this inconsistency, an evaluation of the merits of the “innocent possession” argument does not stand up to scrutiny. I turn first to Chong J’s decision inWong Seng Kwan.Notwithstanding his observations at [15] of his judgment (as set out at [20] above), Chong J went on immediately thereafter (at [16]) to state that an accused person charged with the offence of criminal misappropriation would “usuallyhave come across the movable property in a legally neutral manner” [emphasis added]. In my judgment, while Chong J’s observations at [15] ofWong Seng Kwanare not incorrect with respect to thearchetypals 403 scenario one may expect to encounter, his subsequent qualification demonstrates that this is not a requirement forallsuch cases.In this regard, I findapposite guidance in Stanley Yeo, Neil Morgan and Chan Wing Cheong,Criminal Law in Malaysia and Singapore(LexisNexis, 2nd Ed, 2012) (“Yeo, Morgan and Chan”). Yeo, Morgan and Chan at para 14.2 refrain from using similar restrictive language that the learned authors of the Indian texts have used. Instead, they suggest that criminal misappropriation will “mainlycover cases where the accused was legitimately in possession of something, but has used it or dealt with it in a manner that the law regards as criminal”[emphasis added]. They opine that the accused “willoftenhave come by the property in a morally and legally neutral manner”[emphasis added]. These statements, which accord with Chong J’s qualification at [16] ofWong Seng Kwan,are more nuanced and leave room for application to a wider range of factual scenarios. 23In my view, Yeo, Morgan and Chan’s commentary is  preferable because the language of s 403 of the Penal Code simply does not lend itself to the restrictive reading suggested by the Appellants.Section 403 provides: Dishonest misappropriation of property 403.Whoever dishonestly misappropriates or converts to his own use movable property, shall be punished with imprisonment for a term which may extend to 2 years, or with fine, or with both. 24 A plain reading of the text of s 403 does not support the proposition that innocent possession is a requisite element of the offence at all. Indeed, I note that when Chong J ventured to set out the ingredients of a s 403 offence inWong Seng Kwanat [19] (see [17] above), he conspicuously omitted reference to innocent possession as one of the elements. On the language of s 403 alone, I see no basis to construe the provision in the narrow sense advocated by the Appellants. Had Parliament intended to lay down such limitations on the applicability of s 403, it would have made this clear in the legislation. 25 It is only when the various illustrations and explanations to s 403 are taken into account that the Appellants’ contention ostensibly finds some support. Illustrations (a) to (c) to s 403, for example, can arguably be read as providing some basis for the proposition that in order for the offence to be made out, at the point of the appropriation of property, the accused person should not have any dishonest intention, either because he believes in good faith that the property belongs to himself or that he has the owner’s implied consent to take it. But the role and utility of illustrations and explanations must be borne in mind. Illustrations are only “examples of how it was anticipated that the law would apply to a given factual situation”. They “do not, therefore, have the effect of altering the scope of the law as defined in the substantive provision and are not ‘binding’”. They also “do not curtail or expand the ambit of the provision itself”. This means that if any inconsistency emerges between the substantive provision and the illustrations, the substantive provision “will prevail”: see Yeo, Morgan and Chan at paras 1.39–1.40; see also s 7A of the Interpretation Act (Cap 1, 2002 Rev Ed). With respect to the role of explanations, it is “to shed light on the construction of the words used in the substantive provision”; they are similarly “not generally designed to expand or limit the scope of the section”: see Yeo, Morgan and Chan at para 1.38. In other words, explanations and illustrations cannot be ignored, but at the same time they should not be read so as to unduly circumscribe the plain meaning of the statutory provision in question. These principles of statutory construction are well-settled. Mr Naidu, in fairness, accepted that this was the case at the hearing of the appeal. For this reason, I respectfully disagree with the learned author ofThePenal Law of Indiaat p 3918 where he states that the illustrations to s 403 are not “mere illustrations” but “rather statements of principle”. 26 In any event, I would posit that it is implicit from a reading of Explanation 2 to s 403 and Illustration (d) thereto that a person who harbours a dishonest intentbeforehe “finds property not in the possession of any other person, and takes such property” for wrongful purposes is logicallyno less guiltyof an offence than someone who only forms the dishonest intent to misappropriatesubsequentto finding the property. This is essentially the reasoning underpinning the example postulated by the Prosecution during the hearing of this appeal, which extrapolates only slightly from Illustration (d): if A sees Z drop his purse with money in it and picks it upwithoutintending to restore it to Z, but with the immediate or prior intent of appropriating its valuable contents for his own use, it would be absurd and illogical to hold that A is not guilty of an offence under s 403. A may well have been opportunistically biding his time, tailing Z and waiting for Z to drop the purse. Or A may have fortuitously chanced upon the moment when Z happened to drop his purse. Whichever the case, when A picks up the purse, he does not commit theft as he has not moved the property out of the possession of the owner (see s 378 of the Penal Code), but he commits criminal misappropriation under s 403. Logically, A cannot be any less guilty in these scenarios compared to a case where he only formed asubsequentdishonest intent to misappropriate the money (such as in Illustration (d)). On the facts of the present case, the Appellants’ acts of encashing their winnings can be likened to persons “finding” cash in lost purses, which they intend to misappropriatefrom the outset. 27 A variant of Illustration (d), which more closely mirrors the present facts, would be as follows: a person trails a moving truck loaded with boxes which are not properly secured. He sees the boxes falling off one by one, and he systematically takes them as they do,atthat pointdishonestly intending to help himself to any valuable contents found within even though he knows the true owner to whom they belong. Such a person is perhaps not simply a mere “finder” but may also be described as a “seeker”, targeting the “lost” property which he intends to make away with. This however does not make him any less guilty of criminal misappropriation than a mere “finder” who stumbles upon lost property and helps himself to it. The Appellants were precisely such “seekers” who exploited the situation they came across. They were not unlike the person trailing behind the moving truck loaded with boxes containing valuable goods in the example above. They opportunistically and dishonestly helped themselves to what seemed to be an endless stream of “boxes” of valuable goods (in the form of each swipe of Ho’s membership card leading to the crediting of FPCs), and assiduously capitalised on the opportunities to “find” the cash (through gambling and encashing the winnings therefrom). They subsequently kept the cash despite knowing the identity of the true owner and despite their awareness that the FPCs were mistakenly credited due to the system error. Even though the Appellants harboured dishonest intent from the outset at the point of “finding” the Monies, rather than only subsequent to it, this cannot make them any less guilty of criminal misappropriation. 28 In this connection, it may be pertinent to note that the learned authors ofRatanlal & Dhirajlalat p 2268 make reference to a 19th century Indian case,Shamsoondur(1870) 2 NWP 475 which held that retention of money paid by mistake where the recipient determines to appropriate the property at the time of the receipt, knowing it was a mistaken payment, can amount to criminal misappropriation. This is not dissimilar to the present scenario, where the electronic roulette winnings were encashed and payments made to the Appellants were “lost” by the MBS casino since they were paid out by mistake; the Appellants had no lawful excuse to keep the money which they “found”. By doing so, they had committed the offence of criminal misappropriation under s 403. 29 In the present case, the Prosecution accepts that the payments were correctly made out based on presentation of tickets for encashment at the TITO machines, and the Appellants were permitted (albeit because the casino had belaboured under a mistake of fact) to encash their winnings. In that sense, they did not obtain possession of the cash wrongfully. The winnings amassed were “legitimate” (but not untainted) in the sense that the Appellants at least had the right topossessthe cash, not having taken it from the possession of some other person. It is thus common ground that they had not committed theft of the cash. But it would clearly not be tenable to say that they had anyownershiprights to the cash, as they knew at all times that the true owner of the cash was always the MBS casino. They were not lawfully entitled to repeatedly exploit the system glitch, gamble and thereafter encash and keep the cash. This cements the findings of both theactus reusof misappropriation andmens reaof dishonesty, which I will further elaborate on in due course. Echoing Chong J’s salutary reminder inWong Seng Kwan(at [60]), “[f]inders are not always keepers, and a finder who dishonestly keeps his find may instead “find” himself in violation of the law” [emphasis in original]. 30 In summary, it is in my judgment not incorrect as a matter of general principle to say that s 403 of the Penal Code wouldordinarilyapply where an accused person hadoriginally been legitimately or innocently in possession of property, or where he had initially acquired it lawfully or in a legally neutral manner, and the dishonest intent to misappropriate it is only formed subsequently. This is the position set out inWong Seng Kwanat [15] (see [20] above). However, when the explanations and illustrations are properly understood in their scope and context, they unequivocally demonstrate that s 403 is intended to apply where the accused person does not commit theft or some other criminal offence in order to obtain possession of the property; in other words, he does not obtain possession of the property wrongfully by removing it from the possession of another. This is consistent with the facts of the present case (see [29] above). I reiterate, however, that there is no requirement that the dishonest intent to misappropriate the property must have been formed onlysubsequently; instead, a person who harbours dishonest intentbeforeorat the timehe “finds property not in the possession of any other person and takes such property” (see Explanation 2 to s 403) – as the Appellants did in the present case – is no less guilty of a s 403 offence.",
        "Whether the Monies belonged to someone other than the Appellants": "31 Counsel for the Appellants maintain on appeal, as they did below, that the FPCs are not movable property as defined in s 22 of the Penal Code and cannot form the subject matter of a CMOP charge. With respect, this submission is a non-starter. It avoids addressing the Prosecution’s case theory and ignores what is set out in the charge itself: the misappropriation in question is framed in terms of the Monies (ie, the cash amount of $875,133.56) and not the FPCs. 32 When the Appellants do deal with the subject matter of the charge, that is, the Monies, they argue that electronic roulette is a game of chance and payouts depend on the experience or skill of the player (which constitutenovus actus interveniens). The Monies encashed therefore cannot be consideredmisappropriatedproperty but are instead the Appellants’ legitimate winnings from the game. In fact, the Appellants contend, they had sustained anet lossof more than $100,000 from gambling, having used 1,029,300 FPCs (equivalent to $1,029,300) for the games but only managing to encash $875,133.56 in winnings. 33 In my view, it is immaterial in the present case whether electronic roulette is characterised as a game of chance or skill, or even a combination of both. In any event, it would be anon sequiturto assert that the outcome of a game of chance is generally capable of being influenced by a player’s purported skill or experience; such an argument is both logically and mathematically untenable. If electronic roulette is indeed a pure game of chance, then chance alone determines the outcomes, which will be random rather than predictable. Any purported amount of “skill” or “experience” on the part of a player has nothing to do with the probability of a favourable (or unfavourable) outcome. 34 In my judgment, there is no question that the Monies belonged to the MBS casino and not to the Appellants. Since it is clear on the evidence that Ho was not entitled to FPCs beyond the stipulated 100 Sands Bonus Dollars limit, she also could not claim ownership of the winnings from the electronic roulette games, as these were derivatives of or traceable proceeds of the FPCs expended at the machines. This is somewhat analogous to the process of tracing in civil law (seeCaltong (Australia) Pty Ltdand another v Tong Tien See Construction Pte Ltd and another appeal[2002] 2 SLR(R) 94 at [53]), where a plaintiff traces what has happened to his property, and identifies the new asset which has become the substitute for his original property. He can then claim title to that new asset. In the present case, the game of electronic roulette was simply one of the means through which the FPCs, which have no cash value in and of themselves, could be converted into cash. MBS, being the lawful owner of the FPCs, must also necessarily be the owner of the Monies traceable from them. As I have already alluded to (see [29] above), the Appellants can at most claim a right topossessionbut notownershipof the Monies. It follows that when they gambled using the FPCs which did not belong to them,anyamount that they encashed would in fact benetgainson their part which they were not entitled to retain. 35 As for the Appellants’ remaining contentions, they are aimed solely at overturning the District Judge’s findings of fact. I will deal with each of them in turn.",
        "Whether the Appellants had dishonest intent": "36 I first consider whether the Appellants harboured dishonest intent. The Appellants argue that they were unaware that Ho was only entitled to 100 FPCs, and had in fact approached the casino’s staff seeking clarifications about them. They also did not know that there was a system error at the redemption kiosk. They simply thought that Ho had struck a jackpot or was immensely lucky in being able to obtain “free money” from the casino. As I have indicated above, this is inconsistent with the main legal argument that the Appellants have advanced on appeal, which is premised on the assumption that theydidhave such dishonest intention from the very outset. 37 In any event, the contention that the Appellants had no dishonest intent is substantively flawed for the following reasons. First, I agree with the District Judge that it is inconceivable that the Appellants could have been unaware that there was a limit to the FPCs that Ho was entitled to. This was not the first time that Ho had obtained FPCs from MBS’ free play promotions. Under cross-examination, she confirmed that she had previously participated in similar free play promotions on at least five previous occasions in November 2012, March 2013, April 2013, August 2013 and March 2014. On each of these occasions, she had only been able to obtain a limited number of Sands Bonus Dollars. It was also undisputed that after Ho showed Farid and Shabana the apparently unlimited number of redemptions she could make of the FPCs, Farid and Shabana had each attempted to swipe their own membership cards at the redemption kiosk. Farid found that he was not entitled to any Sands Bonus Dollars. Shabana had 25 Sands Bonus Dollars in her account, but this could only be redeemed once. 38 In the Appellants’ statements, they had themselves confessed on various occasions that they knew Ho was only allowed to redeem a limited number of 100 FPCs: AccusedStatementContents[emphasis added in italics]Ho20 April 2014 at 2330 hrs para 8... I noticed that I hadone chanceto win $100 from Promotion Games of Rewards Sands Dollars. I tried to winthe $100 bonus dollar…Ho28 April 2014 at 1115 hrs Q 3 A 3... I pressed Sands Reward Bonus Dollars and saw that I was awardedone chancefor $100 dollars…Ho5 June 2014 at 1030 hrs Q 14 A 14The game wassupposed to give me 100 MBS rewards dollars…Farid6 June 2014 at 1530 hrs Q 36 A 36[Question] … How many chances do you think a MBS member has for the “Sand Rewards” promotion?[Answer] Shabana had one chance to redeem Sand rewards, [Ho] hadone chanceto redeem Sand rewards. I did not have any chance to [sic] Sand rewards.Farid6 June 2014 at 1530 hrs Q 37 A 37I saw [Ho]’s membership statusonly had “1” chance[to redeem FPCs]. 39 Second, it is equally unlikely that the Appellants were unaware that there was a system error which gave rise to the seemingly endless crediting of FPCs. Their actual knowledge of the system error is evident from the following self-explanatory portions of their statements: AccusedStatementContents[emphasis added in italics]Ho20 April 2014 at 2330 hrs para 9After this experience,I knew that there was something wrong with the machineas each time I swipe the card there was an error message to ask me to try again.Ho20 April 2014 at 2330 hrs Q 10 A 10On the first day, I thought I was luckybut on the subsequent days I knew that it was the system fault.Farid20 April 2014 at 2330 hrs para 6From thereI realised that there is some system errorwhich I deem it is dishonest to keep the sands reward dollars and convert it to cash. I did tell [Ho] to stop doing it as it is illegal but she ignored me.Shabana20 April 2014 at 2230 hrs Q 18 A 18[Question] Can you explain if it is wrong for [Ho] to take the money from MBS by taking advantage of the system error?[Answer] It is wrong because Farid explained to me that nobody can take more than $5000/- bonus Sands dollars. Even if all these statements are disregarded, I find that the Appellants must at least have been wilfully blind to the system error, especially given that FPCs continued to be credited into Ho’s account even though the error message at the redemption kiosk showed that the service for the redemption of FPCs was “unavailable” [emphasis added] and they were instructed to try again later (see [5] above). 40 Third, the sheer number of FPCs redeemed by the Appellants merits a reasonable inference of their dishonest intent. The District Judge was alive to the Appellants’ audacity. Fuelled by pure greed, they boldly and systematically exploited the casino’s system glitch. They knew that there was no downside in dishonestly helping themselves to as much as they could “take”, to maximise what the District Judge aptly described (at [57(a)] of the GD) as being not just a “free lunch” but an “endless ‘buffet spread’”. Indeed, among the seven MBS members whose accounts were affected by the system glitch, Ho was the only one who redeemed anything more than 300 FPCs; as indicated earlier at [7], she redeemed a “staggering” 1,029,300 FPCs in seven days, and her membership card swiped an almost-relentless 10,293 times. Her text message exchanges with Farid tellingly mentioned her “dilemma” of wanting the money but at the same time being so “tired” that she “[could not] stand”, presumably precisely because of the long hours she spent swiping her membership card at the redemption kiosk to redeem the FPCs. Farid himself also admitted that he was “very tired”. 41 As for the Appellants’ assertion that they had approached members of staff at the MBS casino on different occasions to enquire about the FPCs, it is not clear that these would have been exculpatory. According to the Appellants’ own evidence, which likely contains their cases at their highest, Ho said that on one occasion, she had approached a member of staff to ask (a) how long the Sands Bonus Dollars promotion would last and (b) how long the Sands Bonus Dollars in her account would be valid for. The member of staff only told her that the Sands Bonus Dollars were valid for a certain period of time. The member of staff also refused to follow her to the redemption kiosk. On a second occasion, she asked another member of staff about the error message at the redemption kiosk. The member of staff stated that there must be a problem with the kiosk and asked her to proceed to the counter staff to enquire about this, but the latter was also unable to answer her queries. Even if she had indeed made these enquiries, by Ho’s own admission, none of the members of staff told her that it was acceptable for her to continue obtaining multiple, unlimited FPCs. These attempts do not show at all that they had sought to notify the staff of the system fault or to clarify if they could swipe multiple times to obtain FPCs in excess of the stated limit. In any event, Ho’s evidence on the contents of the Appellants’ exchanges with the MBS casino staff as a whole is inconsistent and confused. 42 Finally, Ho and Farid’s conduct after the former was detained by MBS is also highly probative of their dishonest intent and guilty minds. Ho had sent a text message to Farid telling him that the “police [were] coming” and asking him to remove the $500,000 from their hotel safe. These text messages were then deleted from the mobile phones and had to be forensically recovered. This is strongly indicative that the Appellants knew that the Monies were dishonest gains; otherwise, there would be no need to cover the trails of their conduct. In this regard, Ho’s belated attempts during cross-examination to explain that her text messages were only meant to “inform” Farid of her detention and to ask him to help her safekeep her legitimate winnings, which she did not want to return to MBS, are unbelievable.",
        "Whether there was evidence of a conspiracy among the Appellants": "43 The Appellants’ next contention is that the conspiracy has not been made out because there was no agreement or “meeting of minds” amongst them. In particular, they highlight that the FPCs were only credited into Ho’s membership account. The roles of Farid and Shabana in the endeavour are downplayed. 44 With respect, I disagree with the Appellants’ characterisation of the events. It is plain from the Appellants’ evidence that the entire endeavour was a team effort with each of them playing a different role. Ho swiped her membership card at the redemption kiosk to redeem the FPCs. Farid assisted in swiping the card when Ho was tired. Ho even applied for a replacement card; she and Farid then attempted to swipe both cards at the redemption kiosks concurrently. Farid used the FPCs to gamble on electronic roulette, while Shabana did so once. Both Shabana and Farid helped to cash out the winnings from electronic roulette using the TITO machine, and carried the cash from the MBS casino to their hotel room. This concerted effort and their individual roles were also acknowledged by Ho during cross-examination. 45 It is therefore clear that an agreed arrangement among the Appellants was hatched after Ho called Farid and Shabana to the casino on the evening of 14 April 2014 and informed them about the purported unlimited crediting of the FPCs into her account. The arrangement, while tedious, was not sophisticated: it simply aimed to “swipe, gamble and encash” as much money as possible. This was duly carried out by the three parties over a period of seven days until they were apprehended. While it is true that each of the Appellants played a slightly different role, this, if anything, only affects the relative culpability of the Appellants which is relevant to sentence, but does not detract from the fact that there was a meeting of minds among them to systematically carry out the scheme.",
        "Conclusion on the CMOP charge": "46 Taking into account the foregoing, I am satisfied that the District Judge was fully entitled to find that the evidence demonstrates the Appellants’ consciousness that they were not entitled to the FPCs and had thus acted dishonestly in engaging in their conspiracy to commit the misappropriation of the Monies that resulted from it. He concluded that the necessary ingredients of the charges had been proved beyond reasonable doubt and I am unable to find anything plainly wrong in his findings. On the contrary, the findings are amply supported by the weight of the evidence in its totality. In the face of overwhelming evidence, the Appellants steadfastly denied any wrongdoing. The District Judge roundly rejected their fanciful defence of rightful entitlement to the cash or that Ho had “struck the jackpot”, having given careful and thorough consideration to the evidence and having set out his reasons comprehensively and cogently. In the circumstances, the District Judge was plainly correct to have found the Appellants guilty under s 403 read with s 109 of the Penal Code on the charge of engaging in a conspiracy to commit criminal misappropriation of the Monies from the MBS casino.",
        "The CDSA charges": "47 I move on to the CDSA charges. The Appellants’ preliminary objection is that if the CMOP charge is not made out, the CDSA charges also fail because the latter charges are predicated on the former. However, as I have explained, I am amply satisfied that the CMOP charge has been established beyond reasonable doubt. The Appellants’ initial objection therefore fails. 48 The Appellants’ main substantive objection is that the Prosecution has failed to discharge its burden of proving that the money that is the subject of the CDSA charges is “in whole” derived from the benefits of their criminal conduct (ie, the CMOP offence). Instead, they argue that the money has been mixed with the Appellants’ own funds from their known sources of income. 49 The immediate problem with this contention is that the Appellants, by their own concession, are persons of limited means, in financial difficulty, or having substantial debts. The evidence in this respect is summarised as follows: AccusedStatementContents[emphasis added in italics]Ho20 April 2014 at 2330 hrs Q 10 A 10I have very tough and painful experiences in Singapore for the past one year because ofmy business failure and I was cheated by my customers. My intention to come to Singapore was to look for business opportunity torecover the monies that I had lost.Ho5 June 2014 at 1030 hrs Q 7 A 7[Question] Are you in any financial debts or difficulties?[Answer] Yes. As my company is not doing well, Iowe moneyto my family…Shabana20 April 2014 at 2230 hrs paras 2–4[When describing Farid and her business interests] The first company was Freedom Export Pte Ltd, second company was Ajmeer Impex Pte Ltd and third company was Cotton India Asia Pacific Pte Ltd. Freedom Export Pte Ltd closed in 2010due to a loss of about$500,000/-.The company was solely owned by Farid and me. Ajmeer Impex Pte Ltd was opened in 2010. By 2012,we suffered losses of about$100,000/-so we closed the company and started Cotton India Asia Pacific Pte Ltd with me holding about 65% share. In 2013,we suffered losses of about$100,000/-.The company is still active but there are no transactions andwe did not repay the debts owed.In 2010, Farid and I started to frequent Marina Bay Sands (MBS) Casino. We went there to explore becausewe were stressed over company losses…Till date Farid had lost about $700,000/- in MBS casino and I lost about $20,000 in MBS casino.…[S]ince November 2013, Farid felt ashamed to ask for more money to be remitted from India to Singaporeso we struggled financially…Farid6 June 2014 at 0930 hrs Q 22 A 22[Question] Are you in any financial debts or difficulties?[Answer]Yes. From 2013, Arun [a business partner] invested about S$360,000 into Cotton India Asia Pacific Pte Ltd for marketing efforts.Before he invested, I lost about S$150,000 to S$200,000 in Marina Bay Sands (MBS).From March or April 2013,Iused his money to recover my losses in the casino.However, over a monthI lost all his S$360,000.… I wrote on a blank piece of paper stating that I wouldreturn him the moneyI lost and signed it. 50 None of the Appellants could prove that they had any fixed sources of income. Even though they had, during cross-examination, insisted that they had several other sources of income (such as accumulated savings, winnings at casinos and remittances from family members), these appeared to be afterthoughts which were neither mentioned in their statements nor buttressed by any documentary evidence. Indeed, it is difficult to believe that the Appellants had the resources to remit or convert a vast sum totalling more than $1.8m over six days. Under s 8(1) of the CDSA, the benefits derived by any person from criminal conduct refers to any property held that is “disproportionate to his known sources of income, and the holding of which cannot be explained to the satisfaction of the court”. The funds that are the subject of the CDSA charges can therefore be presumed to be the benefits of the CMOP offence. 51 This is coupled with the fact that the conversions of the money into casino chips and the overseas remittances were extremely proximate in time to the CMOP offence. They took place over six days from 15 to 20 April 2014, overlapping with the seven-day period over which the CMOP offence took place (from 14 to 20 April 2014). Taken collectively, it is inherently improbable thateven ifthe Appellants had known sources of income (which is doubtful), each of them would have decided to remit large sums of money overseas or convert the money into casino chips in numerous different tranches over that specific span of time. 52 The Prosecution has in any event been able to trace each remittance or conversion directly or indirectly to the Monies that are the subject of the CMOP offence: see the tables at [93] of the GD. The Appellants had also, in their statements, admitted that the source of the money which were remitted or converted into casino chips was the FPCs from Ho’s account which were expended at the electronic roulette machine and thereafter encashed. 53 For these reasons, I am satisfied that all the CDSA charges were also correctly found to have been proved beyond reasonable doubt. The funds that were transferred and converted could not have come from any other sources apart from being criminal benefits from the predicate CMOP offence.",
        "Conclusion on conviction": "54 I therefore dismiss all the Appellants’ appeals against their convictions and affirm the District Judge’s findings and conclusions in this regard.",
        "The sentence": "55 I turn to the question of sentence. The Appellants contend that the sentences imposed by the District Judge are manifestly excessive, mainly because they allege that he had failed to accord due weight to certain mitigating factors. Counsel for Farid and Shabana, Mr Singh, submits that the following sentences should be imposed instead: AccusedCMOP chargeMost serious CDSA chargeTotal sentenceFarid4 to 6 months’ imprisonment6 to 9 months’ imprisonment10 to 15 months’ imprisonmentShabana4 to 6 months’ imprisonment2 weeks’ imprisonment4 months 2 weeks’ to 6 months 2 weeks’ imprisonment Mr Naidu (acting for Ho) does not make any submissions on what the appropriate sentence for Ho should be. 56 In relation to the CMOP offence, the higher the quantum of money or value of property misappropriated, the heftier the sentence (seeSentencing Practice in the Subordinate Courts(LexisNexis, 3rd Ed, 2013) at p 760; see also by analogy,Public Prosecutor vFernando Payagala Waduge Malitha Kumar[2007] 2 SLR(R) 334at [47], in the context of cheating under s 420 of the Penal Code). On this footing, the suggested sentences by Mr Singh are manifestly inadequate in light of the precedents. InPublic Prosecutor v Nazlin bin OthmanDAC-910315-2014 andKrishan Chandv Public Prosecutor[1995] 1 SLR(R) 737 (“Krishan Chand”), the accused persons were sentenced to six months’ imprisonment each for farloweramounts of money appropriated ($87,190.70 and $120,000 respectively). Furthermore, the accused persons in those cases had pleaded guilty, which would have been accorded mitigatory weight, but the Appellants had claimed trial in the present case. In addition, to adopt Mr Singh’s suggested sentences would crucially fail to distinguish between the relative culpabilities of Farid and Shabana, when the former was more heavily involved in the conspiracy than the latter. 57 The sentences imposed by the District Judge for the CDSA offences are also in line with precedents that he had comprehensively considered. The three cases cited by Mr Singh on appeal – which, I should add, are the exact cases raised before the District Judge (see [137] of the GD) – in fact support the sentences imposed by the District Judge. InPublic Prosecutor v Evelyn Chua Hui Leng[2009] SGDC 137, aten-monthimprisonment term was imposed on the accused person who pleaded guilty to one charge under s 47(1)(b) of the CDSA involving $348,398.56. The amount involved was lower than the $500,000 that is the subject of the most serious CDSA charge against Farid, and the accused person had pleaded guilty in that case, which would have merited a further sentencing discount. There was therefore no basis for this court to reduce Farid’s sentence for the most serious CDSA charge tosixtonine months’ imprisonment; indeed, that would be manifestly inadequate. InPublic Prosecutor v Ng Ting Hwa[2008] SGDC 147, the accused pleaded guilty and was sentenced to 1.5 years’ imprisonment for each of the CDSA charges against her. The largest amount involved was $343,184.10. InPublic Prosecutor v KumaranA/L Subramaniam[2009] SGDC 220, the accused was sentenced to 24 months’ imprisonment when the amount involved was $83,534.27. In both of these cases, the accused persons were sentenced to a higher imprisonment term than Farid had been, even though the most serious CDSA charge against them involved a lower sum of money. 58 I turn then to the mitigating factors raised by the Appellants, which they allege the District Judge had failed to take into account. First, they contend that there was “no real loss to MBS” because the police had recovered a total of $1.356m, which is more than the Monies that are the subject of the CMOP charge ($875,133.56). In this sense, the Appellants claim that the amount seized by the police is “akin [to having] full restitution made to [MBS]”. This argument is in my judgment wholly misconceived. The very same argument was canvassed before the District Judge and he had comprehensively dealt with this at [128] of the GD (see [13] above). I fully agree with his reasons outlined therein and would only add that as indicated earlier at [56], the appropriate sentence is dependent on the amount misappropriatedatthe first instance. It follows that whether and how much of the misappropriated Monies wereultimately recoveredare far less significant – especially where the recovery is due to the investigative efforts of the police which should not, as a matter of principle, be credited to the Appellants. The amount recovered is only relevant insofar as voluntary restitution is madeby the accused personsthemselvesfor the simple reason that it would generally be indicative of the offenders’ genuine remorse (seeKrishan Chandat [12]–[13]). But this could not be further from the truth in the present case: the lack of remorse on the part of the Appellants is evident. Their actions were motivated by pure greed and a desire to exploit the system glitch for as long as they possibly could. The idea was simply to “get as much money as [they] could from MBS”, even if it involved many tedious rounds of “swipe, gamble and encash” over long hours in the seven-day period. There was also no indication that they had intended to stop their criminal conduct before they were arrested. In fact, as alluded to above, when Ho was detained by MBS, she even informed Farid to remove the $500,000 from the safe because the “police [were] coming”. Farid followed her instructions, and went on to splurge that money in the RWS casino before he too was apprehended. 59 Second, Mr Naidu argues that the District Judge failed to consider that Ho was compelled to remain in Singapore, a country foreign to her, for two and a half years. This is again completely without merit. Her detention in Singapore was caused entirely by her own actions. She had to remain in Singapore for the purpose of investigations and to conduct her defence at trial. 60 Third, Mr Naidu asserts that Ho was a first time offender. While the Appellants did not have any previous convictions, I note that they had committed multiple offences over several days before being apprehended, as evident from the sheer number of charges brought against them. Thus, they would arguably not be entitled to be treated as first time offenders: seeChen Weixiong Jerriek v Public Prosecutor[2003] 2 SLR(R) 334 at [15] and [17]. In taking into account the fact that the Appellants had no antecedents (in the sense of previous convictions) in reducing their sentences (see [131] of the GD), if the District Judge had erred, it was purely on the side of leniency. For these reasons, none of the mitigating factors highlighted by the Appellants merit any further sentencing discount.",
        "Conclusion on sentence": "61 In conclusion, I do not find the sentences imposed by the District Judge to be manifestly excessive. Given the large amount of money that the Appellants ultimately made away with before they were apprehended and their lack of remorse, I am satisfied that their sentences are appropriate deterrents and also in line with the precedents cited by the parties and carefully considered by the District Judge. The appeals against sentence are all therefore also dismissed.   See Kee Oon Judge Sarbrinder Singh s/o Naranjan Singh (Sanders Law LLC) for the appellants in MA 9005 and 9006 of 2017; Selva Kumara Naidu (Liberty Law Practice LLP) for the appellant in MA 9007 of 2017;Jiang Ke-Yue and Ang Siok Chen (Attorney-General’s Chambers) for the respondent."
    }
}