{
    "case_title": "TSH and anothervTSE and anotherand another appeal and another suit",
    "ncitation": "[2017] SGHCF 21",
    "coram": "Valerie Thean JC",
    "sections": {
        "Background": "",
        "The family": "4 The mother is a Mongolian national who is 34 years old. The father is a Singapore citizen who is 40. They met in Singapore in December 2010 and married the following year in June.1Foot Note 1×Record of Appeal in DCA 71/2016 at p 581.Shortly before the marriage, the father was engaged as a quantitative analyst at the London offices of a well-known American bank.2Foot Note 2×Father’s affidavit dated 20 January 2014 at paras 5 and 11.He purchased an apartment in London with a substantial mortgage with the intention that it would be their matrimonial home. The mother joined him in there in October 2011 and stayed under a dependant’s visa issued by the UK authorities. In July 2012, M was born to them in London. He holds Singapore citizenship.3Foot Note 3×Record of Appeal in DCA 71/2016 at p 583. 5 By the time M was about a year old, the mother had embarked on a course of study in written and spoken English, for which she had an examination in October 2013. The couple travelled to Singapore in July 2013 and placed M in the care of his paternal grandparents in Singapore over the summer so that the mother could prepare in London for her examinations without having to worry about taking care of M. The mother and the father returned to England in August 2013. 6 Before they could visit Singapore again, the father decided that the marriage was over. But he did not tell his wife this. He covertly instructed his solicitors in Singapore to prepare applications for leave to file for divorce within three years of marriage, for interim custody of M, and for an injunction preventing the mother from bringing M out of this jurisdiction. In ignorance of these actions, the mother travelled with the father to Singapore in January 2014 under the impression that they and M would return to England within the same month.4Foot Note 4×Mother’s affidavit in OSG 204/2015 dated 25 November 2015 at para 11. 7 Upon her arrival, the mother was served the applications for divorce and custody. The next day, the injunction was granted on anex partebasis. Caught by surprise, the mother contacted her solicitors in England, who filed an application in the English courts for an order for M to be returned. Cobb J granted the order and made M a ward of the English courts until further order.5Foot Note 5×Mother’s affidavit in OSG 204/2015 dated 25 November 2015 p 44 at paras 4 to 5.He also impounded the father’s passport and made its release conditional on M’s return.6Foot Note 6×Mother’s affidavit in OSG 204/2015 dated 25 November 2015 p 47 at para 1.The mother returned to England and did not enter appearance in the Singapore proceedings. Thus started three years of bitterly contested litigation in England and in Singapore.",
        "The litigation": "8  The father travelled to England at the end of January 2014 to contest the mother’s application. His case was that with the passage of time since July 2013, M had acquired a new habitual residence in Singapore. Russell J in the English High Court rejected that case and found that M remained habitually resident in England. Her judgment was handed down in March 2014 and is reported asRe M (a child)[2014] EWHC 963 (Fam). She continued the wardship proceedings and ordered the father to return M to England within the month. Having learnt about Russell J’s decision, M’s paternal grandparents filed an application in Singapore to be appointed as M’s legal guardians. 9 The father did not secure M’s return to England. The mother thus applied for the father to be committed to prison for contempt of court. The father argued that he could not personally escort M to England as his passport had been impounded, and that his parents had refused to bring M to England. Russell J decided against the father and sentenced him to 18 months’ imprisonment commencing in April 2014.7Foot Note 7×Mother’s affidavit in OSG 204/2015 dated 25 November 2016 p 53 at para E.She joined M’s grandparents as parties to the wardship proceedings and made new orders for them and the father to return M to England. The father appealed the orders and the sentence. 10 His appeal was heard by the English Court of Appeal in June 2014. The court allowed his appeal against sentence on the ground that Russell J had been responsible for gross and obvious lapses of procedure in committing him to prison. He was released, and would later in April 2017 succeed in a claim against the Lord Chancellor for damages under s 9 of the Human Rights Act 1998 (c 42) (UK) for unlawful detention:LL v The Lord Chancellor[2017] EWCA Civ 237. In July 2014, the court dismissed the father’s appeal against the orders requiring M’s return: seeRe K (Return Order: Failure to Comply: Committal: Appeal)[2015] 1 FLR 927. The matter was then listed for further directions before Wood J. In that month, the Singapore court also issued an interim judgment of divorce in respect of the father’s application for divorce. 11 Wood J made an order which required the father, in so far as he was lawfully able to do so, to issue an application in the Singapore courts seeking the immediate return of M to England. The parties were given permission to instruct a single joint expert in Singapore law to prepare a report on the father’s ability to issue or take part in any proceedings in Singapore to secure M’s return. General welfare issues or issues of forum would remain open for future consideration. 12 About three weeks after the hearing before Wood J, and with M still not in England, the mother decided to take things into her own hands. She engaged the assistance of Child Abduction Recovery International (“CARI”), an organisation run by a former mercenary named Adam Whittington. In August 2014, she, Mr Whittington and one of his operatives entered Singapore illegally by boat. They removed M from the care of his grandparents while they were leaving their home. There was a scuffle which left M and one or both of the grandparents with slight injuries.8Foot Note 8×Record of Appeal in DCA 71/2016 at p 437.The police retrieved M within a short time and the mother was arrested. The authorities placed M in the voluntary care of his grandparents.9Foot Note 9×Record of Appeal in DCA 71/2016 at pp 518 to 529.In September 2014, the mother pleaded guilty to immigration offences and was sentenced to ten weeks’ imprisonment. 13 Shortly after the attempted abduction, the father appeared before a duty judge in the English High Court, Roberts J, without notice to the other parties, to inform her of the mother’s abduction attempt in Singapore. Roberts J obtained an explanation of the incident from the mother’s solicitors a few days later, and she listed the next hearing for the end of August. The father then applied for permission to appeal against the part of Wood J’s order which required him to issue proceedings in the Singapore courts for the return of M. Taking the view that an English court may not have the jurisdiction to grant such an injunction, the Court of Appeal granted him permission to appeal. 14 By the time the matter came back to Roberts J at the end of August 2014, the report of the single joint expert, Ms Malathi Das, had come in. It was evident from the report that it was open to either the father or the mother to take steps in Singapore to seek M’s return to England.10Foot Note 10×Record of Appeal in DCA 71/2016 p 258 at para 34 and p 260 at para 46.Roberts J discharged that part of Wood J’s order which the father was appealing against, as the mother was no longer relying upon it and the appeal against it was no longer necessary. She then listed a hearing to consider the further conduct of the wardship proceedings. 15 In September 2014, the father applied for the discharge of the wardship proceedings and the release of his passport. Newton J, who heard the matter in October 2014, declared that M was habitually resident in England and that the English courts had jurisdiction in relation to all issues of parental responsibility and welfare. He asked the courts in Singapore to stay all proceedings relating to M and to assist in securing M’s immediate return to England. The father’s application for his passport would be refused until M was back. The father appealed against Newton J’s decision. 16 In the meantime, the divorce proceedings commenced by the father continued in Singapore. In January 2015, ancillary matters were heard before a district judge, who is also the district judge who granted the mirror order in these appeals.Inter alia, she made no order on custody, care and control of M, without prejudice to either party applying for custody after the conclusion of proceedings in the UK in relation to M. It was similarly left open to either party to apply for the maintenance of M after the conclusion of the UK proceedings. 17 Then, in England, the Court of Appeal in March 2015 allowed the father’s appeal against Newton J’s decision. The wardship proceedings were remitted to the High Court for rehearing and for a determination of a number of issues including the father’s application for a stay of the wardship proceedings on the ground offorum non conveniens, his application for his passport to be released, and the child’s welfare. The rehearing on the issue of forum took place in May 2015 before Roberts J. 18 Roberts J gave her decision in July 2015, which is reported asRe K (A Child) (No3) (Forum Conveniens)[2016] 2 FLR 132. She dismissed the father’s application for a stay. She also joined M as a party to the proceedings and appointed for him a guardian by the name of Mrs Lillian Odze. In August 2015, Roberts J made an order requiring the father to cause the return of M to England, contemplating that the father could instruct his lawyers to cooperate fully with any application the mother may make in Singapore to seek M’s return. The father was refused permission to appeal the dismissal of his application for stay. 19 In Singapore, the father’s appeal – which the mother did not contest –  against the district judge’s custody order was dismissed in September 2015, save that either party could apply for custody, care and control, and access upon the father’s return to Singapore, regardless of whether proceedings in the UK in relation to M had concluded. A few days later, M’s paternal grandparents withdrew their application to be appointed his legal guardians. 20 The husband was also facing criminal proceedings in England initiated by the Crown Prosecution Service. This arose out of allegations of rape which the mother had made against him in February 2014. The passport orders which had been made against him were overtaken by his bail conditions in those proceedings. In October 2015, he was put on trial for committing rape against the mother. He was acquitted at the end of the trial by a jury.11Foot Note 11×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 18. 21 In early November 2015, the English Court of Appeal heard the father’s applications for permission to appeal against Roberts J’s orders made in July and August 2015 and dismissed them entirely:ReK (a child)(Unreported, 10 November 2015) (Court of Appeal of England and Wales (Civil Division)). 22 Accordingly, in late November 2015, the mother filed an application in Singapore for an order which mirrored the terms of the various orders which had repeatedly been made by the English courts requiring M to be returned to England and recognising M as a ward of the English courts. She also applied for an interim injunction to prevent the father and the grandparents from removing M from Singapore. The injunction was granted by the district judge in December 2015. 23 In response, the grandparents in early February 2016 made a second bid for guardianship of M. Within a fortnight, the mother applied for the grandparents’ application to be stayed on the ground offorum non conveniens. The father then applied, under the ongoing divorce proceedings between him and the mother, for sole custody, care and control of M and for the mother to be granted supervised access. The mother in turn applied for the father’s application to be stayed or dismissed. There were therefore five applications before the Family Court, including the wife’s application for a mirror order. The month ended with yet another order being issued by the English courts for M to be returned by April 2016. 24 In May 2016, the district judge granted the mirror order sought by the mother and stayed the grandparents’ guardianship application: seeTSE v TSFand others[2016] SGFC 121 (“TSE”). She dismissed the father’s custody application, holding it to be misconceived as he had not yet returned to Singapore. The mother travelled to Singapore to bring M back to England, but the grandparents appealed against that decision and obtained from the district judge a stay pending appeal. So the mother returned to England alone after meeting M in Singapore. While she was here, she obtained a final judgment of divorce.",
        "The father returns": "25 In September 2016, the father absconded from England to Singapore in breach of the English passport orders which had continued in force after the end of his criminal proceedings. He obtained a Document of Identity (“DOI”) from the Singapore consulate in Istanbul under the false pretext that he had lost his passport, and he then made his way to Singapore. His earlier attempt to obtain a DOI from the Singapore consulate in Ireland was foiled when the consulate discovered that his passport had been impounded by the English authorities. This set afoot criminal proceedings against him in Singapore for the false statement he had made to the Singapore Consulate-General in Dublin. 26 In England, Roberts J proceeded on the mother’s application to convene a welfare enquiry in November 2016 to decide the final orders to be made in relation to M’s welfare arrangements. Roberts J invited the father and the grandparents to participate in this enquiry. They declined on the basis that she had no jurisdiction to inquire into M’s welfare. The enquiry proceeded and Roberts J gave her judgment in January 2017: seeMB v GKand others (No 2) Wardship (Welfare Enquiry)[2017] EWHC 16 (Fam) (“MB (Welfare)”). She ordered M to be returned to England immediately, whereupon he was to be handed to the mother and to live with her. Roberts J listed the matter for consideration within four weeks of his return. 27 In March 2017, various applications in the appeals against the district judge’s orders came before me. I granted the father leave to amend his notice of appeal to include an appeal against the mirror order. He had previously taken no position on the mirror order, he claims, in order to avoid being held in contempt of the English orders requiring him to secure M’s return.12Foot Note 12×Father’s affidavit in DCA 71/2016 dated 2 December 2016 at para 15.I also granted the mother and the father leave to adduce fresh evidence for the purpose of the appeals against the mirror order, so that events following Roberts J’s welfare enquiry in November 2016 could be properly taken into account at this stage of the proceedings. 28 In April 2017, I appointed Mr Yap Teong Liang as the Child Representative for M, with a Court Counsellor, Ms Hazel Yang, to assist me in ascertaining M’s best interests. They have each prepared a report, to which I will be referring in course of my judgment. Later in April, the father filed an application to vary the no custody order that was earlier obtained ancillary to divorce, for sole custody, care and control of M with supervised access to the mother. I directed that this be dealt with together with the appeals. 29 In late May 2017, the father was sentenced to three weeks’ imprisonment for making a false statement to the Singapore Consulate-General in Dublin. He was released in June 2017. Throughout the litigation, M has been under the care of his grandparents in Singapore. This was where matters stood when the father’s and the grandfather’s appeals and the father’s application to vary the custody order were argued before me on 31 July 2017.",
        "Applicability of the 1980 Hague Convention": "30 A final aspect of the background is that this case does not attract the application of the Convention on the Civil Aspects of International Child Abduction (25 October 1980), (entered into force 1 December 1983), accession by Singapore 28 December 2010 (“the 1980 Hague Convention”). This is because at the time M was wrongfully retained,ie, January 2014, Singapore had not gazetted the UK as a Contracting State under s 4(2) of the International Child Abduction Act (Cap 143C, 2011 Rev Ed) (“ICAA”). This was in turn because the UK had yet to accept Singapore’s accession to the 1980 Hague Convention. It did so only after the Council of the European Union (“EU”) issued Council Decision (EU) 2015/1024 of 15 June 2015 authorising certain EU member states, including the UK, to accept, in the interest of the EU, Singapore’s accession to the 1980 Hague Convention.",
        "The decision below": "31 The main part of the district judge’s decision inTSE([24]supra) concerned the mother’s application to stay the grandparents’ guardianship application. The judge held that the mother had satisfied the two limbs of the test for staying proceedings on the ground offorum non conveniensas set out inSpiliada Maritime Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”). The judge gave weight to the fact that wardship proceedings in relation to M had been ongoing in England since 2014, which madelis alibi pendensa significant factor in theSpiliadaanalysis. In her view, it was not contrary to public policy to take into consideration the orders made in those proceedings, as the English courts also regarded the welfare of the child as the first and paramount consideration. The judge granted a stay of the grandparents’ guardianship application. 32 In considering the mother’s application for a mirror order, the judge considered that making the order would not be against the child’s best interests or against public policy, so she granted the order. It is the mirror order aspect of the case which, on appeal, has assumed central importance, as I explain below.",
        "Parties’ positions on appeal": "33 Since the father’s return to Singapore in September 2016, he has superseded the grandparents as the driving force opposing the mother in these proceedings. He intends to be M’s primary caregiver with the support of his grandparents. Therefore, the grandparents’ guardianship application is no longer alive. They have asked me to make no order on their appeal. It is instead the father’s appeal against the mirror order which now occupies centre stage, flanked by his fresh application for sole custody, care and control of M. 34 The father submits that the applicable test under the general law for whether to grant the mirror order is whether such an order would be in M’s best interests. He relies on s 3 of the Guardianship of Infants Act (Cap 122, 1985 Rev Ed) (“GIA”). He argues that it is not in fact in M’s best interests to be returned to England. He raises new developments since the district judge’s decision in May 2016 and Roberts J’s welfare inquiry in November 2016. One of these is developments is that M was in March 2017 diagnosed with Autism Spectrum Disorder (ASD). Another is the father’s return to Singapore and his readiness to care and provide for M with the support of his parents in a stable environment to which M has been accustomed over the past four years. The father contrasts his ability to provide for M with that of the mother: his view is that her ability simply to remain in England is precarious and her finances uncertain. 35 The grandparents, unsurprisingly, stand with the father. They spent two periods of several weeks in London in July 2012 and March 2013 to help the couple. Their evidence, based on their time with the family, is that the mother is uncaring and was not his primary caregiver. They highlight the stable and comfortable environment which they have created for M over the past four years and that they are able to provide for his needs. 36 The mother, in the court below and in her initial submissions on appeal, submitted that the principles of the 1980 Hague Convention apply in deciding whether to grant the mirror order. At the hearing, she revised her view to agree with the father that the test is whether returning the child would be in his best interests. She argues that it is in M’s best interests to be returned to England to be placed under her care. She relies on Roberts J’s finding to that effect inMB (Welfare)([26]supra)and on the findings of fact made in that judgment. She contends that weight should be given to the fact that M is now a ward of the English courts, to which some deference ought to be given in order to preserve the comity of nations. The father disagrees that the mother is entitled to rely on that judgment.",
        "Issues to be determined": "37 These proceedings raise three principal issues, which I decide as follows: (a) The first is the proper approach under the general law to assess whether a court should make an order for a child to be returned to a foreign jurisdiction whose court has made an order for that child’s return. As the 1980 Hague Convention does not apply, I must look to the general law, which requires me to apply the welfare principle. (b) The second is the effect in these proceedings of the judgment of Roberts J inMB (Welfare)([26]supra), which addresses specifically the issue of M’s best interests in being returned to England. In my view, this judgment does not establish anyres judicatae.It cannot abrogate my overriding duty under s 3 of the GIA to have regard to M’s welfare. To fulfil this duty, I find it appropriate to consider all the arguments and evidence which have been presented before me. (c) This leads to the third issue, which is the application and effect of the welfare principle in this case. This is the common issue behind the father’s appeal and his application. Applying the welfare principle to the facts of the case, I decide that returning M to his mother’s care would serve his best interests.",
        "General law on return of a child: the welfare principle": "38 The court has a statutory duty under s 3 of the GIA to regard the welfare of the child as the first and paramount consideration in deciding, in any proceedings, any question on the custody or upbringing of an infant. An application for an order that a child be returned to a foreign jurisdiction is no exception to that duty. The welfare principle originates from the practice of the Chancery Court in wardship and guardianship cases in the late 18th and 19th centuries: Judith Masson, Rebecca Bailey-Harris & Rebecca Probert,Cretney’s Principles of Family Law(8th ed, Sweet & Maxwell, 2008) (“Cretney”), para 19-001. It was first made a statutory principle by s 1 of the Guardianship of Infants Act 1925 (UK) (“the 1925 Act”), which at the time was held to be declaratory of the existing law:In re Thain[1926] Ch 676 at 689. In Singapore, s 3 of the GIA, similar to the 1925 Act, has preserved the welfare principle in statutory form. The section reads: Where in any proceeding before any court the custody or upbringing of an infant or the administration of any property belonging to or held in trust for an infant or the application of the income thereof is in question, the court, in deciding that question, shall regard the welfare of the child as the first and paramount consideration and save in so far as such welfare otherwise requires the father of an infant shall not be deemed to have any right superior to that of the mother in respect of such custody, administration or application nor shall the mother be deemed to have any claim superior to that of the father. 39 The mother in the present case applies for an order which mirrors the terms of orders made by English courts. The principal effect of those orders is that M shall be returned to England. In my judgment, there is no doubt that the mother’s application concerns “the custody or upbringing of an infant” on the plain meaning of those words in s 3 of the GIA. My view is reinforced by the Court of Appeal’s approach inBNS v BNT[2015] 3 SLR 973 at [19] that the welfare principle governs applications to relocate a child. 40 The question whether a court should order the return of a child in its jurisdiction to a foreign jurisdiction whose court has ordered the child’s return is not a new one. Judges in 19th century England generally declined on grounds of comity to act in opposition to a foreign court’s order on a child’s custody: see,eg,Nugent v Vetzera(1866) LR 2 Eq 704 andDi Savini v Lousada(1870) 18 WR 425. But the passing of s 1 of the 1925 Act mandated a change in approach. InInre B’s Settlement[1940] Ch 54 at 63 to 64, Morton J distinguished the Victorian cases and considered himself bound by s 1 to consider as first and paramount the welfare of the infant, “whatever orders may have been made by the courts of any other country”. This approach was adopted by the Judicial Committee of the Privy Council on a Canadian appeal inMark TMcKee v Evelyn McKee[1951] 1 AC 352 (“McKee”). The House of Lords inJ vC[1970] AC 668 at 714F considered these two cases as representative of English law on the matter. 41 The emphasis on the court’s overriding statutory duty to have independent regard to the child’s welfare was followed by another important change when the 1980 Hague Convention entered into force in 1983. The treaty was motivated by the belief that it is in the best interests of children for disputes about their future to be decided in their home countries. One parent should not be able to take a child from one country to another, either in the hope of obtaining a tactical advantage in the dispute or to avoid the effects of an order made in the home country. The treaty established a summary procedure for the return of children who have been wrongfully removed to or retained in a Convention state. Upon proof of the wrongful removal of a child, the court of the Convention state in which the application under the Hague Convention is filed is only concerned with the return of the child to his or her country of habitual residence, subject to the limited exceptions in Art 13, and not with the merits of any dispute over the custody or care and control of the child:BDU v BDT[2014] 2 SLR 725 at [26];TUC v TUD[2017] SGHCF 12 at [36]. 42 The position between Convention states was clear: the Convention was to be followed. The position between non-Convention states was also clear: each state would apply their own law. But what of a court of a Convention state faced with a court order from a non-Convention state for a child’s return? This was the issue before the House of Lords inIn re J (A Child) (Custody Rights: Jurisdiction)[2006] 1 AC 80 (“In re J”). Baroness Hale, writing for the court, set out “three points [which] can be readily agreed” (at [18]). I find these three points consistent with the duty imposed upon me by s 3 of the GIA, and apply them in this case as explained below. 43 First, any court which is determining any question with respect to the upbringing of a child – including whether to make an order for his return to a foreign country – has a statutory duty under s 1(1) of the Children Act 1989 (c 41) (UK) (“the 1989 Act”) to regard the child’s welfare as its paramount consideration:In re Jat [18]. That provision has the same effect as s 3 of the GIA. The extent to which the legal system of the other country was relevant would depend on the facts of the case “[l]ike everything else”,ielike all other factors to be considered under the welfare principle:In re Jat [37]. 44 Second, the application of the welfare principle may be specifically excluded by statute:In re Jat [20]. This may take the form of a statute which is passed to give effect in domestic law to the 1980 Hague Convention. In the absence of such exclusion, there is no warrant, either in statute or authority, for the principles of the 1980 Hague Convention to be extended to countries which are not parties to it:In re Jat [22]. Baroness Hale agreed with Morton J’s view inIn re B’s Settlementthat the welfare principle applied without exception, whatever orders may have been made by the courts of any other country: see [40] above. Her Ladyship also affirmed Lord Simonds’ statement of principle inMcKeethat the court must form an independent judgment on the question of custody of an infant and not blindly follow an order made by a foreign court:In re Jat [23]. In this context, Singapore’s approach to the applicability of the 1980 Hague Convention, through the enactment of the ICAA, suggests that Parliament did not intend for Convention principles to apply in relation to non-Convention states. Even with Convention States, the 1980 Hague Convention applies only if the Singapore government specifies that state as a “Contracting State” by order published in the gazette: s 4(2) of the ICAA. Absent the application of the ICAA, the welfare principle must be applied by the court. 45 Third, the court has the power, in accordance with the welfare principle, to order the immediate return of a child to a foreign jurisdiction without conducting a full investigation of the merits:In re Jat [26]. When a child who has spent much of his life in a foreign jurisdiction is brought to this country and an application for his return is made within a short time, there may be a concern to ensure his swift and immediate return to minimise the disruption in his circumstances and also to eliminate the risk of his developing roots and relationships in this country which will complicate the assessment of his welfare:Re L (Minors) (Wardship: Jurisdiction)[1974] 1 WLR 250 at 264E-H. Of course, these considerations do not apply in the present case because my assessment of M’s welfare has been complicated precisely by the fact that he has settled in Singapore. That is why I appointed Mr Yap and Ms Yang to assist me in investigating fully the merits of returning M to England. 46 The mother’s initial submission to me was that that I ought simply to apply the principles in the 1980 Hague Convention to the present case and that it is only necessary for me to decide the issue of M’s habitual residence at the time of his wrongful retention, which was England.13Foot Note 13×Respondent’s case dated 27 April 2017 at para 62.The mother submitted that this approach is consistent with the welfare principle.14Foot Note 14×Respondent’s case dated 27 April 2017 at para 60.She relied on a series of cases which stand for the proposition that in a case where one parent has applied in Singapore to stay, on the ground offorum non conveniens, the other parent’s application for custody, care and control of their child, the application of the general doctrine of natural forum is consistent with the welfare principle because the relevant inquiry is which court is “best placed” to determine the welfare of the child:15Foot Note 15×Respondent’s case dated 27 April 2017 at paras 58 to 61.TDX v TDY[2015] 4 SLR 982 (“TDX”) at [51];TGT v TDU[2015] SGHCF 10 (“TGT”) at [61]. 47 I reject this submission. The mother is not seeking a stay of the variation application made by the father on the ground offorum non conveniens. What she has applied for is a mirror order. On such an application, the question before the court is notwhich of two courts is the more appropriate forum for the determination of a particular legal issue.TDXandTGTtherefore do not assist her. Those cases simply make the point that staying proceedings in favour of the forum with strongest connection is consistent with the welfare principle because that forum is generally best placed to determine a child’s best interests. They do not stand for the proposition that a court, in deciding whether to make mirror orders in respect of orders made by the natural forum,abdicates consideration of the welfare principleon theassumptionthat the orders made by the natural forum would be in the best interests of the child. This is in fact the assumption that the 1980 Hague Convention makes in relation to the state of the child’s habitual residence: see [41] above. But as I have said, that assumption does not apply to non-Convention countries under the general law. 48 In any event, after the parties were referred to various authorities, the mother revised her position at the hearing and now accepts, as the father submits, that I have a duty under s 3 of the GIA to apply the welfare principle and arrive at an independent view on whether returning M to England would be in his best interests. I turn now to this. I begin by considering the effect of Roberts J’s judgment inMB (Welfare)([26]supra).",
        "Effect of foreign judgment": "49 The judgment inMB (Welfare)was the product of a full welfare enquiry held before Roberts J in November 2016 to consider what final orders should be made in relation to M’s living arrangements. She concluded that it was in M’s best interests to be returned to the full-time care of his mother in England at the earliest opportunity. She also made findings of fact regarding M’s circumstances and those of his parents which led her to that conclusion. Accordingly, the mother relies on an issue estoppel arising fromMB (Welfare). She contends that the issue of whether M’s return to England is in his best interests is “res judicataas between the parties because the [English] courts have made a final and conclusive judgment on the same”.16Foot Note 16×Respondent’s case dated 27 April 2017 at para 31.She also relies the essential findings of fact which Roberts J made in deciding the issue: seeMB (Welfare)at [103] to [107]. The father, on the other hand, argues that the requirements of issue estoppel are not established, and even if they were, issue estoppel does not apply by operation of the rule inThompson v Thompson[1957] 2 WLR 138 (“Thompson”). 50 In my view, which I explain below, the doctrine of issue estoppel does not apply strictly in relation to proceedings involving the custody and upbringing of a child because the court has an overriding duty under s 3 of the GIA to have paramount regard to the child’s welfare. Thus, even if an issue estoppel is raised which binds the parties, the estoppel cannot abrogate the court’s duty under s 3, which may in an appropriate case compel the court to hear all the evidence and the submissions which the parties have presented. In any event, the strict requirements of issue estoppel are not made out in the present case. This is because there is no identity of subject matter, given that the facts underlying the issue of M’s best interests are capable of change. Therefore, none of the legal and factual findings inMB (Welfare)are capable of constituting ares judicata. The factual findings inMB (Welfare)thus fall to be treated under the normal rules of evidence, which hold that they are hearsay and therefore cannot be regarded as proof of what they assert. Hence, the proper approach in any case is for me to consider all submissions and evidence which the parties have presented so that I can arrive at an independent view on whether M’s best interests would be served by returning him to England today.",
        "Issue estoppel": "The rule in Thompson 51 The relationship between my duty under s 3 of the GIA and the doctrine of issue estoppel is best illustrated by the case ofThompson. In that case, a wife made allegations of cruelty on the part of her husband in an affidavit filed in answer to her husband’s petition for divorce. The English Court of Appeal declined to strike out those allegations on the ground ofres judicataeven though they had been rejected in previous maintenance proceedings. As Denning LJ explained at 147 to 148, even if the husband could establish an issue estoppel and his wife wouldprima faciebe precluded from re-opening the issue of his alleged cruelty, the court was not debarred by any estoppel between the parties from discharging its statutory duty of inquiring into the truth of a petition or countercharge, a duty which no rule ofres judicatacan abrogate. Whether a court should re-open the issue, in exercise of its duty, depends ultimately on the circumstances. Often, the court will not do so if it is satisfied that there has been a “full and proper inquiry” of that issue in the previous litigation. But if it decides to re-open the issue, then there is no longer any estoppel on either party. This is what is meant by the simplified maxim “estoppel binds the parties but not the court”. 52 I consider these propositions applicable to this case because I have a statutory duty under s 3 of the GIA to apply the welfare principle in deciding matters concerning the upbringing and custody of a child. To fulfil that statutory duty, I must have the discretion, having regard to all the circumstances, to allow the parties to re-open any issue concerning the welfare and upbringing of a child which has been decided by a court of competent jurisdiction where such is necessary. Here, the issue is whether it is in M’s best interests to be returned to England. 53 One circumstance in whichThompsonenvisages that an issue may be re-opened is where there has not been a full and proper inquiry of the issue in the previous proceeding. That is how the father has characterised Roberts J’s welfare enquiry. He contends that the enquiry was very much one-sided. He points out that neither Roberts J nor the officer from CAFCASS (the Children and Family Court Advisory and Support Service), who was M’s court-appointed guardian, had seen the child first-hand. The father and the grandparents were also not involved in the enquiry. And Roberts J, the father says, based her decision only on two brief video clips of two contact sessions between M and his mother. Counsel for the father characterised this as a “joke” in his oral submissions. In one of the father’s affidavits, he accuses Roberts J of bias and criticises her “blind and slavish support of the [wife’s] case”.17Foot Note 17×Father’s affidavit in DCA 71/2016 dated 6 April 2017 at para 52. 54 For two reasons, I reject the father’s view of the welfare enquiry. First, the imperative inThompsonto consider whether there has been a full and proper inquiry in the previous litigation must, in my view, be accompanied with appropriate respect for the foreign court. This attitude of the common law is grounded in the belief in upholding the “comity of international affairs”:Carl Zeiss Stiftung v Rayner & Keeler Ltd (No 2)[1967] 1 AC 853 at 939D, citing with approvalBankers and Shippers Insurance Co of New York v Liverpool Marine and General Insurance Co Ltd(1925) 24 Ll L Rep 85 at 87. 55 An exception to this attitude is where there has been a breach of natural justice. This occurs when a party is not given notice of the proceedings or, if a he is given notice, he is not afforded an opportunity to present his case before the court:Jacobson v Frachon(1928) 138 LT 386 at 392. In this regard, counsel for the father says that the father was notified of the hearing for the welfare enquiry only on 14 November 2016 (ie,one or two days before the substantive hearing) by an email from the wife’s solicitors. This allegation is without basis: it is not found in any of the father’s affidavits and he has not produced the email which he claims to have received. 56 In fact, a contrary position is expressed by Roberts J:MB (Welfare)at [5], [12] and [13]. It appears from her judgment that she sent multiple invitations to the father and the grandparents to participate in the welfare enquiry prior to the hearing, but they declined on the basis that she had no jurisdiction to conduct the enquiry. She asked one Mr Wilkinson, who was acting for the father in the Part III proceedings, to invite the father, and through him, the grandparents, to participate in the welfare enquiry. She indicated to them through Mr Wilkinson that arrangements could be made to facilitate their attendance by means of a video link directly with her court at a convenient time. Mr Wilkinson subsequently informed her that they had maintained their position that the English court had no jurisdiction and therefore declined to participate. In fact, Roberts J was invited to adjourn the welfare enquiry to await the outcome of the appeal from Tan DJ’s decision to grant the mirror order,ie, the father’s appeal in the present case. These are all matters which are within Roberts J’s personal knowledge, and I have no reason to doubt them. And it is clear to me from this account that the father and the grandparents were afforded every opportunity participate in the welfare enquiry and were not denied natural justice. 57 Second, the father is in any event not correct to say that Roberts J had only a limited selection of material on which to base her decision on M’s best interests. She did not only have sight of two short video clips. She had all the written material which the father and the paternal grandparents had put before the Singapore courts as at November 2016 to resist the mother’s application for a mirror order. She also had a copy of the affidavit which the father swore in support of his application to adduce fresh evidence on appeal. She was aware that the document provided that the father was now residing in Singapore. In addition to the written material from Singapore, she also heard oral evidence from the mother and the guardian. The guardian’s evidence was understandably limited because M’s paternal family refused to engage in any of her enquiries. In my judgment, therefore, there was a full and proper inquiry on whether, as at November 2016, it was in M’s best interests for him to be returned to England. 58 However, it also cannot be denied that unlike Roberts J, I have the benefit of considering the submissions and evidence of all interested parties on the issue of M’s best interests, including the parties’ conduct throughout and before the whole litigation and how M has been treated during this period. For the sake of fulfilling my statutory duty under s 3 of the GIA to consider M’s best interests under, I consider that I should not simply rely on what Roberts J has decided to be true as at November 2016 and look only to matters taking place after that, even though those matters have in fact been the focus of the parties’ submissions before me. Instead, I should come to my own view on the totality of the parties’ conduct and on M’s development in deciding the question of M’s best interests. In this regard, it is clear from Denning LJ’s reasoning inThompsonthat a full and proper inquiry of the issue in the previous proceeding is a strong but not decisive factor as to whether the court should allow an issue to be re-opened by the parties who are otherwise precluded from arguing it. The requirements of issue estoppel 59 Next, I find that in any event, the requirements of issue estoppel are not made out. The parties agree that for the mother’s argument to succeed, she must show that four requirements have been met, as the Court of Appeal explained inThe Bunga Melati 5[2012] 4 SLR 546 at [80]: (a) the judgment in the earlier proceedings being relied on as creating an estoppel must have been given by a foreign court of competent jurisdiction; (b) the judgment must have been final and conclusive on the merits; (c) there must have been identity of parties in the two sets of proceedings; and (d) there must have been identity of subject matter,ie, the issue decided by the foreign court must have been the same as that arising in the proceedings at hand. 60 I find that the first three requirements are made out, but not the fourth. 61 The parties did not appear to dispute that the first requirement was satisfied. I note that the father has consistently maintained that Roberts J had no jurisdiction to hold the welfare enquiry which gave rise toMB (Welfare), and he chose not to participate in the hearings which were convened for the enquiry. The specific issue is whether the English High Court hadin personamjurisdiction over the father in rendering its decision:Emanuel and others v Symon[1908] KB 302 (“Emanuel”) at 309, cited with approval inUnited Overseas Bank Ltd v Tjong Tjiu Njuk[1987] SLR(R) 275 at [14]. In my view, the court did have such jurisdiction. The father submitted voluntarily to the English courts’ jurisdiction by appearing in the earlier stages of the English wardship proceedings. Most recently, while the welfare enquiry was ongoing, the father was participating in English proceedings for financial relief which the mother had commenced under Part III of the Matrimonial Proceedings Act 1984 (c 42) (UK) (“the 1984 Act”):MB (Welfare)at [7]. His decision to do so was also a form of voluntary submission to the jurisdiction of the English courts:Emanuelat 309;Oomer Hajee Ayoob Sait v Thirunavukkarasu Pandaram & Another[1936] 2 MLJ 9 (High Court of Judicature at Madras) at [14]. 62 On the second requirement, I am of the view that Roberts J’s judgment inMB (Welfare)is in fact a final decision on the merits. It is a decision on the merits of the question whether M’s return would be in his best interests. Roberts J convened a welfare enquiry specifically to enable her to make findings of fact in order that, on the application of the welfare principle, she would be able to render a conclusion on the question of M’s best interests. The fact that she expressed in tentative terms the orders she intended to make to give effect to her conclusion on the merits does not detract from the finality of that conclusion. 63 The third requirement is clearly made out because the mother and the father were both parties to the English wardship proceedings. 64 On the fourth requirement, the father argues that there is no identity of subject matter becauseMB (Welfare)was a welfare enquiry whereas the proceedings before me involve an appeal against a mirror order for M’s return to England, an application in divorce proceedings for care and control of M, and an appeal against the stay of a guardianship application in respect of M. I reject that argument for the simple reason that for purposes of issue estoppel, the nature of an issue is a matter of its substance and not of the form of proceeding in which the issue has been argued. In both the English and Singapore proceedings, the central issue has been whether it is in M’s best interests to be returned to England. 65 There is however a problem with mother’s case on the fourth requirement. On this point, the High Court’s decision inGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 (“Goh Nellie”) is illuminating. In that case, Sundaresh Menon JC (as the Chief Justice then was) held that the requirement of identity of subject matter comprises a number of distinct conceptual strands. One of those strands is that the issues must be identical in the sense that the prior decision must traverse the same ground as the subsequent proceeding, and the facts and circumstances giving rise to the earlier decision “must not have changed or should be incapable of change”:Goh Nellieat [34]. This principle was affirmed by the Court of Appeal recently inTurf Club Auto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal and other matters[2017] SGCA 21 at [108]. 66 To illustrate the principle, Menon JC inGoh Nellieused two examples  relevant to the present case. The first isRichards v Richards[1953] P 36 (“Richards”), where the court allowed a wife to bring a second action against her husband alleging persistent cruelty. This was so that further acts of cruelty which allegedly took place after the first action could be rightfully taken into account for the determination of whether there had been persistent cruelty. Lord Perriman P held that the mere fact that a defendant’s past conduct was adjudged not to amount to persistent cruelty did not “shut out that evidence for ever”, otherwise it would hinder a future determination of that issue “in the light of the [defendant’s] whole course of conduct”:Richardsat 40, citingMolesworth v Molesworth[1947] 2 All ER 842 at 845A. The second example isMills v Cooper[1967] 2 QB 459 (“Mills”), where the court held that because the question whether someone was a gipsy could change depending on his circumstances, an earlier decision that the defendant was not a gipsy did not bar subsequent proceedings contending that he was. 67 In my judgment, the issue whether it is in M’s best interests to be returned to England is similar in nature to the question inMillswhether a person may be regarded as a gipsy. The similarity is that the facts which constitute the answer to both questions capable of change. The point may be appreciated by observing that the question before Roberts J was really whether, as at the time of the welfare enquiry (November 2016), M’s return would serve his best interests. That is the nature of the question she had to decide, and that is why Lord Simonds inMcKee([40]supra)at 365 considered that a custody order cannot in its nature be final. M’s best interests is not a historical event like a breach of contract which is not liable to change with the passing of time. In the latter case, even where fresh evidence is subsequently available, that evidence would be addressed to the question whether the historical event of breach had occurred. By contrast, best interests of a person is not an event and more like a status or quality. It possesses an ambulatory nature, changing with the circumstances of a person’s life. 68 Moreover, similar to the issue of persistent cruelty inRichards, I cannot meaningfully decide the question of M’s best interests if I restrict myself to considering matters occurring only after November 2016. It is necessary for me examine the evidence on the whole course of conduct involving M’s parents and grandparent from the onset of the litigation and even prior to it. Such an examination would be undermined if the parties were precluded by an issue estoppel from arguing, for example, that the facts prior to Roberts J’s decision ought to be viewed a certain way in the light of developments which have taken place after that decision. 69 The foregoing analysis illustrates the merit of the principle that identity of subject matter requires the factual substratum of the issue determined in the earlier decision not to be susceptible to change. This underscores the applicability of that principle to this case. Applying that principle, therefore, I find that the mother fails to show that there is identity of subject matter betweenMB (Welfare)and these proceedings. Accordingly, that decision raises no issue estoppel for the purposes of these proceedings.",
        "Evidential value of factual findings": "70 The mother nevertheless has a secondary argument, independent of the rules onres judicata,for why I may rely on Roberts J’s factual findings. First, she argues that Roberts J’s factual findings cannot be impeached because of the principle of comity of nations. Second, she argues that ss 42 and 43 of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) render as conclusive proof those factual findings. 71 It is not controversial that on account of the principle of the comity of nations, I am in no position to “challenge the factual findings made by the foreign court”, as Peter Gibson LJ puts it inEric Keller v Simon John Cowen, Christine Anne Connor(Unreported, 6 July 2000) (Court of Appeal of England and Wales (Civil Division)). It does not follow, nevertheless, that I may rely on those findings. The argument from ss 42 and 43 of the Evidence Act also does not assist her. Section 42 simply renders admissible a foreign judgment for the purpose of establishing ares judicata. Section 43 simply renders a foreign judgement in rem conclusive proof of its legal character. Neither provision says anything about factual findings. 72 In my judgment, I cannot rely on the factual findings inMB (Welfare)as proof of what they assert. The essential reason for this is that, without beingres judicata, such findings constitute hearsay under the usual rules of evidence. And it is well-established that the usual hearsay rules apply in custody proceedings:Soon Peck Wah v Woon Che Chye[1997] 3 SLR(R) 430 (“Soon Peck Wah”) at [34]. The position was clearly articulated by Chan Seng Onn JC (as he then was) inArul Chandran v Chew Chin Aik Victor JP[2000] SGHC 111 (“Arul Chandran”). He held at [142] that under the hearsay rule, factual findings in a foreign judgment cannot be tendered in another trial as proof of the existence or truth of those facts. The judgment may be admissible under s 42 of the EA for the purposes of determining question ofres judicata. But that provision does not provide “a gateway for the flood of facts established in other judicial forums to be admitted as evidence or as conclusive proof of the same facts in dispute in another trial”, “where all or some of the parties are different”:Arul Chandranat [141]. That last qualification indicates that Chan JC has in mind a foreign judgment which cannot or does not contribute to ares judicata. That is exactly the case here.",
        "Need for full assessment": "73 Therefore, my decision to consider all the arguments and evidence presented by the parties is motivated by two principal reasons. The first is my statutory duty under s 3 of the GIA to apply the welfare principle. In the circumstances of this case, I find it appropriate to consider all the material which has been laid before me in order to fulfil that duty. The second is that in any event, the requirements of issue estoppel are not made out. The principle on identity of subject matter illustrated byMillsandRichardsand discussed inGoh Nellieserves only to highlight the changes in M’s circumstances which I must consider against the history of this case. Those changes include M’s being diagnosed with ASD, his father’s return to Singapore, and the length of time he has spent here. These raise the concern that M may be impacted adversely by a change in thestatus quo. For these reasons, I ought to come to an independent view on the totality of the parties’ conduct and on M’s development in deciding the question of M’s best interests. I turn now to address this question.",
        "Applying the welfare principle": "74 It is well-established that the concept of the welfare of the child is to be understood in the widest sense:Lim Chin Huat Francis v Lim Kok Chye Ivan[1999] 2 SLR(R) 392 at [86]. As the scope of the welfare inquiry is comprehensive, a “multitude of factors” may impact on the ultimate inquiry into what is best for the welfare of the child:BNS([39]supra)at [20]. In this regard, the Court of Appeal has held that there is no pre-fixed hierarchy of factors or considerations in any given type of application, and that where the factors stand in relation to each other must depend on a consideration of all the facts in each case:BNSat [22]. To put it another way, there are no legal presumptions to the effect that any one or more factors will be given more weight in any given case:BNSat [23];TAAv TAB[2015] 2 SLR 879 at [17]. 75 These factors include continuity of arrangements, the need for both parents to have an involvement in the child’s life, which parent shows the greater concern for the child, the maternal bond, the child’s wishes, the desirability of keeping siblings together, and the loss to the child of the relationship with the left-behind parent:ABWvABV[2014] 2 SLR 769 (“ABW”) at [20] and [23];BNSat [25] to [26]. The idea of capturing various factors in a non-exhaustive statutory list to guide the application of the welfare principle was considered by the Family Law Review Working Group in its report titledRecommendations for Guardianship Reform in Singaporedated 23 March 2016. The statutory list approach has been adopted by England, Australia and New Zealand, and is being proposed in Hong Kong: s 1(3) of the 1989 Act; s 60CC of the Family Law Act 1975 (Cth); s 5 of the Care of Children Act 2004 (NZ); cl 3(2) of the Children Proceedings (Parental Responsibility Bill) 2015 (Hong Kong). The Working Group had the occasion to consider these pieces of legislation and at para 48 of its report it proposed its own set of factors: (a) the child’s physical, emotional and educational needs, and his physical and emotional safety; (b) the capacity of each of the child’s parents and of any other caregiver to provide for the child’s needs and to ensure the child’s safety; (c) the child’s relationship with each of his parents and with any other caregiver; (d) the need to ensure a continuing relationship between the child and his or her parents; and (e) the effect of any changes. 76 The rationale for this series and sequence of factors may be explained in this way. A proper analysis of the welfare of a child must begin by identifying the child’s needs. Making this an issue of the first order allows the needs of the child to shape the ensuing inquiry. This gives effect to the imperative in s 3 of the GIA to regard his welfare as the “first and paramount” consideration. When those needs are identified, the court must then consider whether those contending for responsibility over care of the child will in fact be able to meet them. The law for good reason places primary responsibility of the care of the child on his natural parents. Therefore, their capacity to meet the child’s needs will be assessed before that of any other caregiver. Closely connected to their ability to discharge their responsibility of care is their relationship with the child, which is a crucial factor in determining how they would relate to the child in their care of him. In the light of the answers to these issues, the court must then assess what solution would best meet the needs of the child. Two important factors must be taken into account in this assessment: the desirability of the child maintaining a good relationship with both parents to the best extent possible, and the impact upon the child of any changes envisaged for him. I use this organising framework below to deal with the parties’ various contentions in assessing M’s best interests. 77 In this regard, it must be remembered that the application of the welfare principle is an intensely fact-sensitive exercise. While the analysis must be holistic, the facts which any given case presents for that analysis often raise a specific set of concerns. These include the fresh information of M’s ASD, the growing effect on M of a change in thestatus quo, and the impact of the father’s return to Singapore. As M has been retained in Singapore for an extended period, it is important also to ascertain comparatively his connection with Singapore and England. On these points, I am grateful to Mr Yap and Ms Yang for their considerable assistance. 78 Briefly put, I find that is in M’s best interests for him to be returned to England and placed under his mother’s care. In coming to this conclusion, I do not regard lightly the fact that M is now settled in a stable environment in which he has grown up for the past four years, and that his father has returned to Singapore to care for him alongside his work. I also appreciate that his grandparents have cared for him well. However, while the mother may not be able to replicate in England the level of comfort and support which M now enjoys, she has the capacity to meet all of M’s emotional and developmental needs. She will also be able to meet his material needs. In any event, those needs must be assessed together with the whole spectrum of M’s needs in a proper determination of his welfare to facilitate his holistic development. Having performed such an assessment, I have no doubt that she is the best candidate to care for M on a daily basis. And that is why M’s return to England to be reunited with his mother will serve his best interests. Reunification with his mother will pose challenges, and I will address the solution to them. I turn now to elaborate.",
        "M’s needs": "79 M’s needs may be divided into two broad categories: emotional and developmental. M’s emotional needs 80   M is five years old today. He has, however, lived apart from his natural mother since he was brought to Singapore in July 2013. But even though he was separated from her at the age of one, he still expresses strong feelings of affection and longing towards her. As recently as June 2017, when his mother told him through Skype (an online instant messaging application) that she loved him and missed him, he said to her, “I really also miss you and I love you.”18Foot Note 18×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 18.During that Skype session, they played a game of solving mathematical sums, and M would squeal with joy each time he got the answer right.19Foot Note 19×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 18. 81 Ms Yang was there to observe this exchange. She explains that in M’s “worldview”, he has a mother who resides in a faraway land with whom he may communicate only through electronic means, and he enjoys that communication and yearns for it to continue. When asked by Ms Yang, he gave his Skype sessions with his mother a “6 out of 6” rating, with “1 being not enjoyable at all and 6 being highly enjoyable”.20Foot Note 20×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 24.Ms Yang says that it would be “ideal” if the mother has regular physical contact with M, because their intimacy is currently being “inhibited” by their distance apart.21Foot Note 21×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 30. 82 M appears to have always delighted in his mother’s company. In March 2016, the mother met M in person for a first time in a long while. He recognised her immediately despite their prolonged period of separation and was delighted to see her.22Foot Note 22×Mother’s affidavit in OSG 204/2015 dated 17 May 2016 at para 4.In May 2016, the mother again travelled to Singapore, this time in the hope of bringing M back to England after the mirror order was granted. Of course, she was not able to do so as his grandparents had obtained a stay of execution pending appeal. But she was nevertheless granted access to M. On that occasion, M approached her willingly and they spent what the mother has described as a “wonderful” day visiting a museum, a toy store and a play centre. I have seen pictures of their time together that day, and they depict nothing but a young boy at ease and engaged with his mother, thrilled to be in her arms and by her side.23Foot Note 23×Mother’s affidavit in OSG 204/2015 dated 17 May 2016 at p 13. 83 The law recognises that the maternal bond is worthy of special protection in cases on the custody of young infants:Soon Peck Wah([72]supra)at [45];Teo Geok Fong (m w) v Lim Eng Hock[1999] SGHC 209 at [55];ACU v ACR[2011] 1 SLR 1235 at [44];BMJ v BMK[2014] SGHC 14 at [13]. In considering this line of cases, I should be clear that each case must be decided on its own particular facts; fathers and non-parents, too, have in other cases fulfilled such emotional needs. This point applies with particular force in the present case, however, because M is a young infant with a range of emotional needs and his bond with his mother is strong. M’s developmental needs 84 In March 2017, M was diagnosed with ASD by Ms Annette Chen, a psychologist with KK Women’s and Children’s Hospital (“KK Hospital”). In Ms Chen’s psychological report, ASD is described as “a lifelong neurodevelopmental disorder, although behaviours, presentation, and the corresponding level of support may change over time”.24Foot Note 24×Annette Chen’s Psychological Report dated 9 March 2017 at p 7.M “presented as a boy who require[s] support in social communication and substantial support in managing his restricted and repetitive behaviours”.25Foot Note 25×Annette Chen’s Psychological Report dated 9 March 2017 at p 7. 85 Ms Chen recommends that M should continue attending his preschool programme. This would give him opportunities to socialise with other children and would also expose him to the classroom environment. Ms Chen also considers that M may benefit from attending an early intervention programme catered to children with ASD where he would be able to receive coordinated therapy and education to facilitate his development in all areas. She strongly encourages M’s caregivers to be involved in his intervention programme so that they can help him practise and generalise the skills which he learns. 86 Ms Chen also assesses M to have a number of strengths and protective factors which may help him to gain progress in improving his condition.26Foot Note 26×Annette Chen’s Psychological Report dated 9 March 2017 at p 7.His ability to make eye contact is poor but improving. He has an increasing awareness of his peers. And he has a fairly cooperative nature. Ms Chen considers that these attributes may help him with his learning and contribute towards building positive relationships with those working with him. 87 M also needs supportive caregivers to help him improve in his ability to communicate and interact with others. In this regard, Ms Chen recommends that M’s caregivers work on five areas of M’s behaviour at home, in particular, communication, play, social skills, problem-solving and behaviour management.27Foot Note 27×Annette Chen’s Psychological Report dated 9 March 2017 at p 8.Ms Yang has also in her report taken into account M’s ASD, specifically his need for early intervention in connection with his young age. She opines that in view of these factors, M would thrive with a consistent caregiver and a nurturing care environment.28Foot Note 28×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 31. 88 I gather from Ms Yang’s and Ms Chen’s reports that essentially, M’s developmental needs owing to his ASD need to be addressed early and consistently. Two other important considerations are his need for a stable environment and for his caregivers to be able to help him effectively develop social and communication skills at home. 89 Finally, I note that M was born with a congenital lung condition called Type 2 congenital cystic adenomatoid malformation (CCAM). It is now not life-threatening, and he receives care for his condition at KK Hospital.29Foot Note 29×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 32; Record of Appeal in DCA 71/2016 at p 471.The father considers that it would be in M’s best interests for M to continue receiving medical care from the same medical team. M’s guardian in England is also aware of M’s lung condition. She observes that he was under the care of Royal Brompton Hospital when he was in England,30Foot Note 30×Record of Appeal in DCA 71/2016 at pp 486 to 491.and that his condition could easily be cared for there as well.31Foot Note 31×Lillian Odze’s Position Paper dated 10 November 2016 at para 11.Ms Chen was aware of M’s lung condition when she saw him for a psychological evaluation in February 2017 noted that he was reported to be in good health at that time.32Foot Note 32×Annette Chen’s Psychological Report dated 9 March 2017 at p 2.It seems to me therefore that both parties agree M’s lung condition is not of critical concern, although of course it will have to be treated and monitored from time to time.",
        "Capacity to provide for M’s needs": "90 I turn now to address the capacity of each of the parties in these proceedings to provide for M’s various needs, in the context of their relationship with M and with each other. Mother 91 The father and the grandparents are aligned on their view against the mother: they believe she is unfit to care for M. The grandparents say that her relationship with M is “literally non-existent”.33Foot Note 33×Record of Appeal in DCA 68/2016 p 1046 at para 31.Their evidence is that she is merely using M as a pawn to obtain a more generous financial settlement in England against her husband, and has taken out the mirror order application only to subvert this jurisdiction.34Foot Note 34×Record of Appeal in DCA 68/2016 p 468 at para 10.The father and the grandparents also say that she has no capacity to take care of M even if he were to be returned to England. Their principal allegations against her are as follows: (a) The mother did not care for him during the one year M was in England. Instead, his grandparents were his primary carers for most of that period.35Foot Note 35×Record of Appeal in DCA 68/2016 p 497 at para 152 and p 501 at para 172.The mother would leave M at home for most of the day to attend English classes and beauty treatments.36Foot Note 36×Record of Appeal in DCA 68/2016 p 498 at para 155.When she was home, she rarely played with M and would not carry or cuddle him.37Foot Note 37×Record of Appeal in DCA 68/2016 p 498 at paras 155 and 157.Instead it was left to his grandparents, who had travelled to England on two occasions, to care for his daily needs.38Foot Note 38×Record of Appeal in DCA 68/2016 p 1046 at para 33. (b) The mother does not love M. In January 2014, she left Singapore without bidding M farewell – effectively abandoning him – the moment her husband served on her his application to commence divorce proceedings against her.39Foot Note 39×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 46; Record of Appeal in DCA 68/2016 p 475 at para 44.While she was in England, she did not attempt to communicate with her child.40Foot Note 40×Record of Appeal in DCA 68/2016 p 488 at para 104.It is only in April 2017 that she first asked to be allowed to communicate electronically with M through Skype.41Foot Note 41×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 46. (c) The mother is irresponsible and reckless with M. The main example of this is her abduction of M in Singapore in August 2014 with the assistance of two mercenaries.42Foot Note 42×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 47.She entered Singapore illegally and intended to leave illegally. M was taken from his grandparents at the lobby of their condominium building, and he and his grandparents suffered minor injuries in a scuffle which took place during the abduction attempt. The mother was jailed for ten weeks for her actions. (d) The mother is a forum-shopper and has conducted both English and Singapore proceedings in a “piecemeal” fashion “designed to achieve certain ends”. Instead of responding to her husband’s application for divorce in Singapore, she applied to make M a ward of the English courts and obtained English orders for his return. She then took out contempt proceedings against the husband for disobeying those orders. She also accused him of committing marital rape, for which he was tried and acquitted. She was awarded a lump sum of $2,400 in maintenance by the district judge in January 2015, but she now seeks under a “top-up” of financial provision from the husband by way of an “anomalous remedy” in English law. (e) The mother’s practical ability to take care of M in England is unclear. Her student visa expired in October 2016 and her application for leave to remain has so far been rejected. Even if she does obtain leave, it is not clear whether her visa status would permit her to work to support herself and M. Her finances are also uncertain because she spent significant resources in her proceedings in England for M’s return. Although she is able now to live in the parties’ former matrimonial home in London, the home is due to be repossessed by a bank because the mortgage has not been paid since February 2014.43Foot Note 43×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 56. 92 I reject entirely the father’s and the grandparents’ characterisation of the mother as uncaring. The objective evidence leads me to precisely the opposite conclusion. First, the mother suffered from clinical depression as a result of being separated from her son. She has produced a letter to this effect dated 5 November 2015 and prepared by a qualified cognitive behavioural therapist with the United Kingdom’s National Health Service (NHS), one Ms Christine Coho.44Foot Note 44×Record of Appeal in DCA 71/2016 at p 316.That letter states that the mother’s depression arose in part because she had been separated from M against her wishes and because of the domestic abuse she had allegedly suffered under the father. While Ms Coho’s letter is not evidence that these allegations are true, it is evidence of the fact that the mother’s depression is genuine, and that she experienced genuine feelings of panic and anxiety because of her belief in those allegations. Since she did experience such feelings, it is highly unlikely that she had no affection or care for M whatsoever, as the grandparents and the father assert. 93 Second, she continues to have a warm relationship with M, even after four years of being separated from him. This seriously undermines the grandparents’ and the parents’ claim that she did little to care for M during most of their time together in England,ie, July 2012 to July 2013. The grandparents allege that they were M’s primary carers from July to November of 2012 and from March to June of 2013,45Foot Note 45×Record of Appeal in DCA 68/2016 p 497 at para 152 and p 505 at para 189.and that during this period, the mother completely neglected her maternal duties and attended to M only when the grandparents’ had to have their meals.46Foot Note 46×Record of Appeal in DCA 68/2016 p 505 at para 189.But if she was truly an absent mother, I struggle to understand how it is that she and her son are able still to have a “positive and warm” relationship today, in the words of Ms Yang.47Foot Note 47×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 30.In my judgment, the only reason they have maintained a strong relationship is that she did in fact take care of him when he was with her, and that laid the foundation for the robust maternal bond which still exists today. I find that she was in fact M’s primary carer for the first year of his life, as she asserts.48Foot Note 48×Mother’s affidavit in DCA 71/2016 dated 26 May 2017 at para 30. 94 Third, while her abduction of M in Singapore in August 2014 with the assistance of mercenaries was unjustifiable, I accept her evidence that she did it out of desperation to see her son.49Foot Note 49×Mother’s affidavit in DCA 71/2016 dated 26 May 2017 at para 25.I agree with the father’s characterisation of this incident as a reckless and lawless attempt by the mother to take things into her own hands. I do not for a moment condone her actions. She demonstrated utter disregard for the rule of law and for that she was justly required to pay the price in prison. But beyond that, if she was not truly distressed about being separated from her son, and if she were in fact the negligent and uncaring mother the father and the grandparents have portrayed her to be, I cannot see why she would have gone to such lengths to secure M’s return. She would have been quite happy to be free from the burden of caregiving. But in actual fact, she sought to regain that burden through a most risky and laborious method. 95 Next, I do not accept that the mother is a forum shopper or that she has conducted herself in the English and Singapore proceedings in any way that disqualifies her from being a good parent to M. There is no merit to the father’s suggestion that because he started proceedings first in Singapore, the mother was by commencing wardship proceedings in England thereby guilty of forum shopping. Indeed, the parties lived in London. It was the father who sought the advantage in choosing Singapore as the forum for the divorce he wanted and for ancillary matters. As a foreign national with no local support network and no security of permission to stay beyond her social visit visa, when confronted with an injunction against removing M from Singapore, the mother took what is in my view a reasonable course of action. It made good sense to apply in England for M’s return to that jurisdiction and to use the return ticket which the father had previously purchased in order to return to England to pursue M’s return from there. 96 I find also that the mother is fully capable of meeting M’s needs. She has registered with the National Autism Society in England to learn all she can about autism.50Foot Note 50×Mother’s affidavit in DCA 71/2016 dated 29 May 2017 at para 60.She has also obtained for him a place in a kindergarten in England, and will be supported by her network of friends from the Mongolian community in England and from her local church. She is clearly critical to meeting M’s emotional need for his mother, considering her strong maternal bond with him for which there is compelling objective evidence. She also has an impressive ability to communicate with M despite his ASD. This must be appreciated against M’s usual behaviour at home. The report prepared by Ms Chen, who conducted M’s psychological assessment in February 2017 at KK Hospital, contains valuable insights on this. According to her report, the father and the grandmother told her that at home, M seldom approached them, and when he did, it was only to make verbal requests and even so, it would be done with poor eye contact.51Foot Note 51×Annette Chen’s Psychological Report dated 9 March 2017 at p 3.They also told her that M was inconsistent in responding to them when they called him by name, and might only respond to questions or directions given on his own terms.52Foot Note 52×Annette Chen’s Psychological Report dated 9 March 2017 at p 4.Ms Chen personally saw that M had difficulty engaging in reciprocal conversations initiated by others. She observed his eye contact to be “poorly modulated” and found that he often did not integrate nonverbal and verbal means to make clear his approaches.53Foot Note 53×Annette Chen’s Psychological Report dated 9 March 2017 at pp 3 to 4. 97 In contrast, the way in which M interacted with his mother through Skype, which Ms Yang observed in June 2017, revealed an entirely different dynamic. According to Ms Yang, M would “respond quickly” when the mother called in and “eased into” engaging with her through the computer screen.54Foot Note 54×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 16.He “took the lead in the conversation” and he “initiated different topics such as showing Mother pictures of the food he liked”.55Foot Note 55×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 17.He picked up items from around the house to show his mother. Mr Yap, who was with Ms Yang to observe the mother’s interaction with M, concluded similarly that the mother was “able to engage with [M] over [S]kype and had a calming and assured tone of voice, even when [M] moved away from the computer.”56Foot Note 56×Child Representative’s Submissions dated 4 July 2017 at para 12.When M appeared to lose interest in carrying on the conversation, his mother introduced a mathematical game which seized his attention and in which he participated with evident delight, squealing with joy every time he got the right answer. 98 The mother’s natural ability to connect with her son – despite his autism – is therefore well-documented. This indicates that she is fully capable of carrying out Ms Chen’s advice for M’s caregivers to teach M at home how to interact, communicate and play with others. Ms Yang assessed the mother to be “attuned to [M’s] developmental needs and has been able to engage [M] effectively through age appropriate activities”.57Foot Note 57×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 30.M is able to interact spontaneously with his mother, who has her recent Skype sessions, consciously adjusted her style of speech in order to connect with M on a deeper level.58Foot Note 58×Mother’s affidavit dated 29 May 2017 at para 61.The mother will be able to build upon her bond with him to show him how to interact with the world. 99 Next, for a long time, an important aspect of the father’s case was that the mother could lose her right to stay in the UK any day. At the hearing, I asked the mother’s counsel to give me an update on this. On 12 August 2017, I received a letter from the mother’s counsel, with supporting documents, stating that the mother on 2 August 2017 obtained leave to remain in the UK until 31 January 2020.59Foot Note 59×Letter from Peter Larkin dated 9 August 2017.After 2020, she will be able to apply to extend her permission to be in the UK. The mother followed up with a certified true copy of her residence permit on 22 August 2017 after the father made various objections on 16 August 2017 to her documents. 100 Her financial position also seems stable. During her period of stay she is permitted to pursue full or part-time employment. She intends to seek part-time employment as a retail manager with working hours from 9.00am to 4.00pm from Monday to Friday. She is confident of getting a job because she has a bachelor’s degree in finance and economics and a diploma in business management. She will soon obtain a portion of the sale proceeds of the former matrimonial home in London under proceedings for financial relief she has commenced under Part III of the 1984 Act. The husband refers to this as an “anomalous remedy”,60Foot Note 60×Father’s affidavit in DCA 71/2016 dated 6 April 2017 at para 50.but of course Singapore has provisionsin pari materiain Chapter 4A of the Women’s Charter (Cap 353, 2009 Rev Ed). I should also remind the father that he has responsibilities in the area of child maintenance and financial support for his child. This should include support for M’s enrolment in any necessary early intervention programme, whether in Singapore or England. 101 In my view, therefore, the mother is more than capable of meeting M’s emotional, developmental and material needs. Father 102 I accept that the father is able and willing, especially with the help of his parents, to support M financially and to provide for his basic needs. He intends to find a job as a quantitative analyst, a position he previously occupied in England with a well-known American investment bank. In the meantime, he will work as a private mathematics tutor.61Foot Note 61×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 30.The grandparents supported M out of their savings when the father was in England,62Foot Note 62×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at para 30.and I am sure they continue to do so as and when the need arises. The father and his parents now live with M in a rented condominium apartment which Ms Yang visited in May and June of 2017.63Foot Note 63×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 12.Ms Yang describes their residence as a three-storey private apartment which is spacious and neat. M has a designated play area as well as his own bedroom. The pre-school he attends is in the same condominium compound and within walking distance of the apartment. I therefore have no doubt that M’s basic needs are well-attended to and that he is living comfortably. 103 On this issue, the grandparents’ proven ability to care for M and their desire to do so supports the father’s case. It is not disputed that the grandparents have, for the last four years, left M with no physical want in his life. For this they are to be praised. I am sure they love M dearly. The same could be said of M towards them too: Ms Yang states that M has “formed a secure attachment with his paternal grandparents”.64Foot Note 64×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 29.I would emphasise, nonetheless, that their role cannot overtake the priority the law places on parental responsibility. A child’s grandparents are no substitute for the personal love and care of his parents:TQ v TR[2009] 2 SLR(R) 961 at [18]. Where possible, it is the child’s natural parents who ought to have primary and joint responsibility over their child’s upbringing and development:CX v CY(minor: custody and access)[2005] 3 SLR 390 (“CX v CY”) at [26]. 104 Next, I find that the father has made deliberate and laudable efforts to address M’s developmental needs.65Foot Note 65×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at paras 36, 37, 40, 43 and 44.Alive to M’s interest in numbers, he incorporates mathematical lessons into their outings and plays mathematical games with him. He teaches M to tell the time and plays educational videos about mathematics and science on the television and the computer for M. He has enrolled M in a children’s therapy centre which provides early intervention programmes for children with ASD. To help M improve on his social skills, he has also enrolled M in a public speaking course at Kinderland. He has also signed M up for karate and soccer lessons to improve his motor skills and coordination. He was a trained schoolteacher before entering the finance sector, and I accept that his teaching experience will to some degree have equipped him to deal with children with special needs. He has also enrolled himself and his parents in classes to learn how to take care of children with ASD. 105 In my view, the father has demonstrated a systematic and task-oriented approach towards addressing M’s developmental needs. That is to be applauded, because it means that M is getting all the institutional support he could possibly hope for as a child with special needs. 106 However, there is little in the father’s evidence on the intimacy of his relationship with M and how he intends to relate to M on a personal level. This troubles me. That personal dimension effuses naturally from the mother’s evidence and from the objective evidence on her relationship with M, but is sadly missing in relation to the father. For example, Ms Yang describes M’s relationship with his father to be “peer-like and hesitant”.66Foot Note 66×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 30.M also told Ms Yang, in a lowered voice, that he felt “a little scared, sad and angry” when his father made his solve arithmetic puzzles that he did not like.67Foot Note 67×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 24.She assesses that this is partly due to his long absence from M. Ms Yang also suggests it would be beneficial for the father to be equipped with skills to continue building his relationship with M.68Foot Note 68×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 30.The mother’s equally long absence from M’s life has not had a similar effect: M expressed delight when his mother played mathematical games with him on Skype. On balance, I am of the view that the mother has a stronger emotional bond with M compared to the father. 107 Moreover, a particularly troubling aspect of this case is the father’s conduct of his case both in England and in Singapore. Although I accept that both parties in this case have made tactical decisions in the litigation in England and Singapore, the mother’s submission that the father has shown himself to be deceitful and to have little regard for the rule of law is not without merit. The following examples are of particular concern: (a) There is no dispute that the father hatched and carried out a secret plan to divorce the mother and to separate her from M.69Foot Note 69×Mother’s affidavit in DCA 71/2016 dated 26 May 2016 at para 9.The mother travelled with the father to Singapore in January 2014, having been led by him to believe that they would return to England with M in a week. Upon their arrival, she was served with his applications for divorce and custody. He also applied for an order restraining her from bringing M out of Singapore. If they had truly intended to stay, as he asserts, they would be no need for the order. The father did not tell her that he had left his job in London. He did not tell her that he had emptied their joint accounts in England the day before their departure to Singapore. He bought three return tickets merely as a prop for his lie that he intended for them to return to London. I draw the inference from these facts that he intended to separate mother and son and to leave the former financially and legally isolated. (b) The father blames the mother entirely for being unable to return to Singapore due to her initiating proceedings in England in which he has had to appear. He claims that the mother’s absence from Singapore is therefore “self-enforced”.70Foot Note 70×Father’s affidavit in DCA 71/2016 dated 6 April 2017 at para 27.Yet he fails to appreciate that it was his own unilateral action in deceiving the mother and keeping M in Singapore against her will which set in train the series of English orders requiring the return of M to England.71Foot Note 71×Mother’s affidavit in DCA 71/2016 dated 28 April 2017 at para 13.Those orders and the passport orders which were made preventing him from leaving England pending M’s return were the direct result of his own unlawful actions. (c) The father absconded from England in September 2016 where his passport was being and still remains lawfully impounded.72Foot Note 72×Mother’s affidavit in DCA 71/2016 dated 26 May 2017 at paras 14 to 22By his own admission,73Foot Note 73×Father’s affidavit in DCA 71/2016 dated 14 July 2017 at para 8.he travelled to Ireland, where he applied to the Singapore consulate there for a Document of Identity (DOI) on the footing of a false claim that he had lost his passport.74Foot Note 74×Mother’s affidavit in DCA 71/2016 dated 26 May 2017 at paras 54 to 55.His application was rejected when the consulate discovered that his passport had actually been impounded by the English authorities. He then travelled to Turkey, where he somehow managed to obtain a DOI from the Singapore consulate there. He then used that to travel to Singapore. Upon his return, he was charged for and convicted of a making a false statement to the Singapore Consulate-General in Ireland. He completed a three-week prison term in June 2017 for that offence. (d) The father claims falsely that he tried all means to secure M’s return but to no avail when he was in England from February 2014 to September 2016.75Foot Note 75×Father’s affidavit in DCA 71/2016 dated 28 April 2017 at paras 21 to 22.In July 2014, he and the mother instructed a single joint expert to prepare a report on the father’s ability to issue proceedings in Singapore to secure M’s return to England. It was clear from the report that he was able to issue such an application.76Foot Note 76×Record of Appeal in DCA 68/2016 p 268 at para 34.Although the English order for issuing such applications were discharged (see [14] above), it does not change the fact that the father could have easily instructed his solicitors in Singapore to make the necessary applications. Inconsistent with his earlier stance before the English courts, he now argues against M’s return to England. Moreover, he initially complained to his parents that the English courts had ordered M’s return “in the absence of a full and proper welfare inquiry”.77Foot Note 77×Record of Appeal in DCA 71/2016 at p 358.Yet he later declined Robert J’s invitation to participate in her welfare enquiry and now tells this court that she was biased and that the enquiry was one-sided: see [53] above. 108 For these reasons, I have serious doubts about the father’s suitability to guide the development of M’s character. I recognise his ability to provide materially for M, and I am sure that he loves his son. But material comfort is only one aspect of the whole.",
        "Preserving the other parent’s relationship with M": "109 While M’s relationship with his parents are the context in which their capacity to provide for his needs are to be appreciated, the court must also consider the inherent value of two active and involved parents. It is in the interests of a child that he enjoys the love, care and support of both parents, and joint parental responsibility is deeply rooted in our family law jurisprudence:CX v CY([103]supra) at [26];AUA v ATZ[2016] 4 SLR 674 at [45]. It is therefore appropriate and necessary to examine each parent’s capacity to facilitate the other parent’s involvement in M’s life. 110 The father’s and grandparents’ approach in this regard may be gleaned from the history of this case. It is not disputed that from January 2014 to September 2016, the grandparents made no proactive effort to enable M to experience any physical contact with his mother. They knew as early as March 2014 that the English courts had ordered for M to be returned.78Foot Note 78×Grandfather’s affidavit in OS 147/2014 dated 19 March 2014 at para 82.Yet, they unilaterally decided that it was in M’s best interests for him to stay in Singapore. Nor has the father exhibited any intention of involving the mother in M’s life. A recent example is that he did not tell the mother about M’s ASD after he received the diagnosis in early March 2017. The mother found out about it only in late April through the father’s affidavit filed in these proceedings.79Foot Note 79×Mother’s affidavit in DCA 71/2016 dated 26 May 2017 at para 57. 111 Ms Yang’s observations support the view that the father and the grandparents have little intention of involving the mother in M’s life. In his child interview, M described London as a place with many clouds and which was filled with “bad people”.80Foot Note 80×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 22.When she asked him whether he wished to see or visit his mother, he exclaimed that it was “impossible” because she was “very-very-very-very far away” and reiterated that London was a place with bad people.81Foot Note 81×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 26.What strikes me about M’s responses here is how clear a conception he has of the distance between him and his mother, the impossibility of overcoming that distance, and the supposedly bad environment in which his mother is now located. 112 M’s impression of London is not something that he could have developed on his own because he was only a year old when he left that city. The only rational inference is that he obtained that impression from his father or his grandparents or both of them. Ms Yang makes a similar conjecture in her report: “[M] has no memory of London and holds a moderately negative impression of London, this could have stemmed from the paternal grandparents’ and Father’s gatekeeping, as well as the negative experiences that have transpired.”82Foot Note 82×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 32.Ms Yang explains that “parental gatekeeping” as refers to “parents’ attitudes and actions that serve to affect the quality of the other parent’s relationship and involvement with the child.”83Foot Note 83×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 32 fn 5.Nor do I think M would be acutely aware of a supposed impossibility of visiting his mother unless that idea was conveyed to him by his father or grandparents. There is no reason his mother would emphasise their distance or any difficulty of reunion. Indeed she has been working hard precisely to bridge their gap. At the very least, it is clear that neither the father nor the grandparents have fostered in M any hope of seeing his mother or being reunited with her in the near future. Tellingly, when asking to end a Skype call in June 2017, M said to his mother, “[G]randpa said once I said goodbye, I will have to go, else I keep talking to you.”84Foot Note 84×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 18. 113 What is clear is that if M remains under his father’s household, he will not merely be kept away from his mother, but will very likely see her role diminish in his life under the influence of his father and grandparents. In my judgment, this is a factor which suggests that returning M to his mother’s side, while he is just beginning to show an awareness of being alienated from her, would be in his best interests. As Judith Prakash J (as she then was) said inABW([75]supra) at [29]: [I]t is clear that switching care and control is a remedy that can be adopted if a judge finds that the parent having care and control has been either deliberately or unconsciously interfering with the bond between the child and the other parent. This remedy would be most suitable in a situation in which the child begins to show animosity towards a parent with whom he previously had a loving relationship. The court would have to consider if there is any apparent external reason for the animosity. A situation in which the child has previously had uneventful and loving interactions with the relevant party may call for this approach. It may also be that this approach is most helpful when the animosity has recently manifested itself and has not had a chance to become ingrained. 114 I would emphasise that generally, switching care and control for the purpose of reversing the effects of marginalisation is a feasible solution only where the parent being marginalised has a sufficiently close bond with the child. In this case, the solution is eminently feasible because mother and son have a warm and loving relationship. 115 In contrast to the father’s and the grandfather’s attitude towards the mother, the mother appears to recognise that the father ought to play a role in M’s life. She has undertaken to provide the father with information on M’s welfare, including his health, education and religion.85Foot Note 85×Respondent’s response dated 7 August 2017 at para 3.She says that she will facilitate regular Skype access between M, his father and his grandparents. I recognise that the father is prepared to make similar undertakings in the event that he is granted care and control of M. The credibility and effectiveness of those undertakings are undermined by his and his parents’ poor track record in facilitating the mother’s access to M. I accept that there is no evidence that the mother will honour her undertakings. But that is only because M was removed from her care very early on and she has had no opportunity to prove her word. In the circumstances, I find that the mother is more likely than the father to help preserve M’s relationship with those members of his family from whom he will be separated as a result of any order I make.",
        "Impact of change on M": "116 Having considered M’s needs and the ability of his parents to provide for those needs in the context of their relationship with M, I find that it is clearly in M’s best interests for him to be returned to his mother’s care. The unique challenge presented in this case is that M’s parents are located in separate jurisdictions, and neither parent appears to be willing or able to move to the other’s place of residence. The mother cannot enter Singapore unless she has a local sponsor, arising from her past conviction for immigration offences. While this is not an insurmountable obstacle especially if there is support from the father or grandparents, I do not consider her desire to stay in England to be unreasonable: she has put down roots in that jurisdiction, and she has no support network here.86Foot Note 86×Mother’s affidavit in DCA 71/2016 dated 26 May 2016 at para 34.The father has been refused a new passport by the authorities because of his conviction on his immigration offence.87Foot Note 87×Father’s affidavit in DCA 71/2016 dated 14 July 2017 p 6 at para 2. 117 Therefore, I must consider the effects which an order for M’s return to England would have on him. The most significant of these are the inevitable change in his relationship with his parents and the effect that a change in environment would have on his well-being. Impact on M’s relationship with his parents 118 I am alive to the fact that by returning M to England, his relationship with his father will be weakened. As in relocation cases, the court must consider the child’s loss of relationship with the left-behind parent. The Court of Appeal observed inBNS([39]supra) at [26], the weight to be given to this factor depends on the strength of the existing bond between the left-behind parent and the child. The stronger the bond, the larger the resultant void in the child’s life if he is separated from that parent. In the present case, the bond between father and son cannot fairly be described as strong; in any event it appears weaker than the bond which M shares with his mother: see [106] above. I consider that any loss of relationship may be ameliorated by granting the father reasonable access. The mother has indicated that she will facilitate such access to the best of her ability. In this context, M’s separation from his grandparents will cause him distress, and I would encourage the mother to facilitate their access. Impact on M’s emotional and psychological well-being 119 It is not disputed that M is settled in his current environment, which has been thestatus quofor almost four years. Therefore, the impact of disturbing thatstatus quoon his emotional and psychological well-being is an important significant factor I must consider. The corollary to this factor is M’s ability to transition to a new environment and the support which he can expect to receive to help him do so. 120 The father impresses upon me that it would be in M’s best interests, especially in the light of his ASD, for him to remain in a stable care environment. The father submits that M is well-settled in Singapore. He has spent nearly four years here. His day-to-day needs are being met by his father and his grandparents. He is accustomed to a routine of kindergarten classes, extra-curricular activities and play time. And it is also important, the father says, that M be allowed to maintain his ties of affection. Even though his relationship with his father remains tentative, he has a secure attachment to his grandparents, unsurprisingly, because they have been his primary carers for much of his life. The father relies also on Mr Yap’s submissions, which mentions that any order granting the mother care and control ought to address “the need for transition from Singapore to the UK”, the “change in environment”, the “change in education system” and the “change of familiar and primary caregivers”.88Foot Note 88×Child Representative’s Submissions dated 4 July 2017 p 20 at para 5(f).Perhaps most serious is Ms Yang’s note of caution that a change in environment might be traumatic for M.89Foot Note 89×Hazel Yang’s Child Interview Report dated 30 June 2017 at para 32. 121 There is considerable force in these concerns and submissions. The courts have operated on the premise that continuity of arrangements is an important factor for the emotional well-being of a child:ABW([75]supra) at [20] to [21]. Baroness Hale inIn re J([42]supra)highlighted the length of the child’s stay in the country from which he is sought to be removed and the degree of his connection to that country as variables which tend to attract serious weight in abduction cases under the general law. Both variables are, in the present case, clearly in favour of M remaining in Singapore. Moreover, M’s ASD is likely to make it more difficult for him, emotionally and psychologically, to adapt to a new environment. Bringing M to England would not only separate him from his father but also from his grandparents, who have been his pillar of security for most of his life and with whom he has a strong attachment to which Ms Yang has attested. M’s guardian in England also recognises that a change to his living arrangements is likely to be difficult for him at least in the short term.90Foot Note 90×Lillian Odze’s Position Paper dated 10 November 2016 at para 13. 122 In my judgment, however, the need to ensure a stable care environment does not override the need for M to be reunited with his mother. Considerations similar to those expressed by Prakash J inABW, in my view, apply to the present case. Prakash J opined at [46] that while stability is desirable, it cannot be the paramount factor. On the facts of that case, she considered that “[l]eaving the children with the father would in the short term avoid the distress associated with change but, in the long run, it risked the children losing one of the most important human relationships they could have.” In my view, this is also the case here. 123 Furthermore, the challenges that M will face in adapting to a new environment are not and have never been suggested by anyone to be insuperable. Neither Mr Yap nor Ms Yang ruled out the possibility that M should end up with his mother in England. Ms Yang in fact specifically contemplated it and advised that, in such a scenario, strong professional support should be put in place to assist M in making the transition. I will be making provisions for M and his mother to undergo reunification therapy conducted by a professional psychologist to prepare both of them for M’s return to England and his separation from his paternal family in Singapore. 124 M’s adaptation to his new home in England will also be assisted by the support which the English courts are certain to give to a child such as M who has been made a ward of their jurisdiction. The English courts will be notified through the International Hague Network of Judges. In this case, Roberts J has invited Mrs Odze to visit M at his home with his mother within days of their return to England (MB (Welfare)([26]supra)at [108]), no doubt to assess whether M needs any help in settling in, among other things. The institutional support for M’s care provided through England’s wardship jurisdiction is a factor which adds to my assurance that M will be well-provided for in England. 125 I end by observing that M’s transition could be eased significantly by the adults in his life. They could choose to redirect the deep concern that they have for him toward a joint pursuit of his best interests. Multiple court orders have been made in respect of how those interests are to be best pursued. If parents and grandparents are able to cooperate, M could receive, through their varied and complementary roles in his life, every aspect of care and attention that he requires, from all the people in his life who are dear to him. M would flourish. The adults, on their part, in jointly prioritising M’s happiness above their own, would have the satisfaction of looking to his long term development, and watching him grow.",
        "Conclusion": "126 In conclusion, I find that it is in M’s best interests for him to be returned to his mother’s care in England. I therefore dismiss the father’s appeal entirely. Considering that there is an application for variation of the custody order, I vary the order to facilitate the operation of the mirror order. I grant joint custody to both parents, bearing in mind the importance of joint parental responsibility:CX v CY([103]supra) at [36].As they both care deeply about M, they should cooperate in his upbringing as far as they are able to. I grant care and control to the mother and reasonable access to the father. I make no order on the grandparents’ appeal. 127 I further order as follows: (a) M is to be returned to England within 28 days of the date of this order. (b) The father is to hand over M at the Child Focused Dispute Resolution Centre at the premises of the Family Justice Courts at its Maxwell Road location, as well as his passport and all relevant travel documents, to the mother within 14 days of the date of this order. (c) After M is handed over and before he returns to England, the father is to have daily access to M at any Divorce Support Specialist Agency (“DSSA”) or any other venue in Singapore on which the parties agree. After M’s return, the father is to have daily Skype access at a time convenient to both parties. (d) The mother’s daily access to M through Skype is to continue until she arrives in Singapore. If she arrives before the date of the handover, she is to have daily access at any DSSA or any other venue in Singapore on which the parties agree. (e) M is to commence transition and reunification counselling with a court-appointed counsellor within ten days of the date of this order. The counsellor may involve parents or grandparents as necessary. The costs for the therapy are to be borne equally between the mother and the father. 128 I shall hear parties on costs. A Registrar’s Notice will be sent with administrative details regarding the orders at (b) to (e) above, and a date for counsel to see me on costs. Counsel may seek associated directions or consequential orders, if any, at that time. Valerie TheanJudicial Commissioner  Yeo Khee Chye Raymond (Raymond Yeo) for the appellants in DCA 68/2016;Tan Wen Cheng Adrian (August Law Corporation) for the appellant in DCA 71/2016 and the applicant in SUM 1424/2017;Koh Tien Hua (Eversheds Harry Elias LLP) for the respondent in DCA 68/2016, DCA 71/2016 and SUM 1424/2017; Yap Teong Liang (T L Yap Law Chambers LLC) as the Child Representative"
    }
}