{
    "case_title": "iHub Solutions Pte Ltd  vFreight Links Express Logisticentre Pte Ltd",
    "ncitation": "[2017] SGHC 06",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1The claim in this case is for damages in respect of alternative premises which the plaintiff alleged it had to acquire, by way of a tenancy agreement, in view of the defendant’s failure to expeditiously confirm the renewal of an existing agreement between the parties of the then current premises and the defendant’s acts of hindrances. The unusual feature of this case is that the plaintiff’s claim is made even though it continued to use the then current premises until the expiry of a renewed term for such premises which was eventually granted to it.",
        "Background": "2The plaintiff, iHub Solutions Pte Ltd (“the Plaintiff”) is a limited exempt private company. It is in the business of providing various services including supply chain and warehouse services. 3The defendant, Freight Links Express Logisticentre Pte Ltd (“the Defendant”) is a limited company. It is a wholly owned subsidiary of Vibrant Group Limited (formerly known as Freight Links Express Holdings Limited) which is a company listed on the Singapore Exchange Ltd. The Defendant is in the business of general warehousing. 4The Jurong Town Corporation (“JTC”), incorporated under the Jurong Town Corporation Act (Cap 150, 1998 Rev Ed), is the owner of a plot of land at Lot 4237 known as 51 Penjuru Road, Singapore with a building thereon. 5JTC had leased 51 Penjuru Road to the Defendant. By a Service Agreement made on 10 August 2005 between the Defendant and the Plaintiff (“the SA”), the Defendant agreed to let the Plaintiff use certain warehouse spaces on the second and third floors of 51 Penjuru Road totalling about 39,380 sqft (“51” or “the Spaces”) at the rate of $0.70 per sq foot (“psf”). Under that agreement, the Defendant also agreed to provide logistics services to the Plaintiff referred to as automated storage and retrieval services or “ASRS” based on a charge of $1.50 per pallet per week. The ASRS were performed in the same building but outside of the Spaces. The duration of the SA was up to 30 October 2008. 6By the 1st Addendum dated 27 June 2008, the SA was extended for two years from 1 November 2008 to 31 October 2010. The service charge for 51 was increased to $0.756 psf. 7By the 2nd Addendum dated 9 July 2010, the SA was further extended for three years from 1 November 2010 to 31 October 2013. The service charge for 51 was increased to $0.82 psf. Importantly, the extension included an option (to the Plaintiff) to extend or renew the agreement for yet another three years with any increase in the service charge to be not more than 10% of the rate,ie, not more than 10% of $0.82 psf which worked out to not more than $0.902 psf. 8The Plaintiff’s case is that as early as 23 April 2013,ie, more than six months before the expiry of the 2nd Addendum on 31 October 2013, the Plaintiff had given notice to the Defendant that it wanted to renew the agreement for 51 for another three years from 1 November 2013 to 31 October 2016. This was followed by other notices to renew which I need not elaborate on. However, the Defendant did not take steps to confirm the renewal within a reasonable time. Instead, the Defendant committed various acts from 24 July 2013 to hinder the Plaintiff in its operations in order to persuade the Plaintiff to agree to a higher rate of $1.30 psf which was more in line with the market rate in 2013 for the new term of three years. Although the Defendant withdrew certain instructions, which had also constituted hindrances, on 2 September 2013, the acts to hinder continued thereafter. 9The Plaintiff alleged that the Defendant’s tactics to delay confirming the renewal as well as to hinder the Plaintiff caused the Plaintiff to be uncertain whether the Defendant was going to confirm the renewal at all. Accordingly, in early August 2013, the Plaintiff decided to look for alternative premises in case the Defendant refused to renew the SA. The alternative premises would also allow the Plaintiff to operate without hindrances from the Defendant in the meantime. 10Eventually, the Plaintiff found alternative premises at 46A Tanjong Penjuru #02-02/03, Singapore, comprising office and warehouse spaces totalling about 44,710.75 sqft (“46A”). 11The letter of offer from the landlord of 46A was dated 2 September 2013 and the Plaintiff’s acceptance thereof was dated 6 September 2013 although the Plaintiff alleged that the actual date it accepted the offer was 5 September 2013. The difference in dates is immaterial for present purposes. 12On the other hand, the Defendant did revert to the Plaintiff on 5 September 2013 by email to state that it would offer the renewal of 51 on 6 September 2013 and that the relevant documents would be forwarded to the Plaintiff.1Foot Note 1×Agreed Bundle (“AB”) p 203. 13This was followed by a cover letter dated 6 September 2013 from the Defendant to the Plaintiff with various documents.2Foot Note 2×AB 204.While the Defendant purported to agree to the renewal for 51, it stated in a letter dated 5 September 2013 that it would not renew the ASRS (which had continued with each prior renewal). 14The Defendant’s decision not to continue the ASRS for the new term was not acceptable to the Plaintiff who pressed for a renewal of the entire SA. The matter dragged on with an exchange of various letters between the solicitors for the respective parties. 15In the meantime, the Plaintiff executed a formal agreement for 46A on or about 16 October 2013.3Foot Note 3×Plaintiff’s Bundle of Documents (“PBD”) pp 213-255; Notes of Evidence (“NE”) 26/10/16 p 42.According to the Plaintiff, it had already begun shifting its fast moving cargo from 51 to 46A from around mid-September 2013. However, as mentioned above, the Plaintiff was not giving up 51 and was still pressing for its three-year renewal with ASRS. 16Eventually, the Defendant informed the Plaintiff in December 2013 that it would grant a sub-tenancy agreement to the Plaintiff for 51 for the next three years. This agreement was to be in the form of a sub-tenancy agreement instead of a service agreement because JTC had learned that the Plaintiff was in exclusive possession of 51 and the Defendant did not provide the Plaintiff with any service inside 51. By then, the previous renewal under the 2nd Addendum had expired on 31 October 2013. After further protracted discussions on the terms of the sub-tenancy agreement, the sub-tenancy agreement was signed by the parties and dated 9 December 2014. 17The writ of summons (and statement of claim) was filed on 30 April 2015. 18The Plaintiff raised various implied terms in the statement of claim (Amendment No 2). For present purposes, I will refer only to two: (a) Implied term of expeditious renewal.(b) Implied covenant of quiet enjoyment.",
        "The issues": "19The issues were: (a) Whether there was an implied term of expeditious renewal and an implied term of quiet enjoyment. (b) If so, whether the Defendant had breached either of these terms, or both. (c) If so, whether the Defendant was liable in the circumstances for the various heads of damages claimed in respect of the Plaintiff’s acquisition of 46A. 20Although the trial was not bifurcated, I directed that the parties’ closing submissions address the issue of liability first including the issue whether the Defendant was liable in principle for the various heads of damages claimed by the Plaintiff even if the Defendant had breached either or both the implied terms. If liability was established, directions would be given for further submissions on the quantum of damages.",
        "The implied terms": "21The implied term of expeditious renewal was in respect of the term for another three years. The Plaintiff’s case for the implied term was based on the 2nd Addendum read with cl 11.4 of the SA. Although there were some missing words in cl 11.4, it was undisputed that it meant that the Defendant was to confirm the renewal if the Plaintiff gave not less than three months’ notice before 31 October 2013 and if the JTC gave its consent (if required) and there was no subsisting breach by the Plaintiff of any of its obligations under the SA. 22The Defendant, through its lead counsel, accepted on the first day of the trial that it was to take reasonable steps to comply with its obligations under cl 11.4 SA.4Foot Note 4×NE 24/10/16 p 53 lines 19-21.This concession meant that the Defendant was accepting that there was an implied term for it to revert reasonably expeditiously to confirm the renewal, unless there was valid reason not to do so. Indeed, the trial proceeded on that basis and the Plaintiff’s main director and main witness, Koh San Joo (“Koh”) was not cross-examined about the allegation of the existence of this implied term. 23As for the implied term of quiet enjoyment, I am of the view that in substance, the SA was a tenancy agreement. It was drawn up as a service agreement because of the way the Defendant had originally described the services it rendered to the Plaintiff to JTC. Once the air was cleared, JTC said that it should be a sub-letting agreement in accordance with the true nature of the agreement. There was no dispute that there was an implied term of quiet enjoyment for the Plaintiff under the SA in the circumstances. 24In the circumstances, it is not necessary for me to discuss the principles inSembcorp Marine Ltd v PPL Holdings Pte Ltdand another and another appeal[2013] 4 SLR 193 on implied terms.",
        "Whether any implied term was breached": "25The Plaintiff submitted that because cl 11.5 SA required parties to agree on the revised charge for the renewal not later than four weeks from the date of the Plaintiff’s written notice to renew and because there was in any event a maximum cap of $0.902 psf (under the 2nd Addendum) which the Plaintiff was prepared to agree to, the Defendant should have confirmed the renewal within four weeks of the Plaintiff’s first notice to renew dated 23 April 2013. 26It was not disputed that after the first notice of renewal from the Plaintiff, the Defendant was trying to get the Plaintiff to agree to a higher rate than $0.902 psf and that the Plaintiff did not agree to a higher rate. 27On the other hand, the Defendant submitted that the question of expeditious renewal should not be considered from the date of the first notice of renewal on 23 April 2013 but rather from the date of 30 July 2013 because the Plaintiff was supposed to give not less than three months’ notice to renew before the expiry of the SA on 31 October 2013. Thus the Defendant submitted that as it had formally informed the Plaintiff on 6 September 2013 that it would apply to JTC for approval to sublet 51 to the Plaintiff at $0.902 psf, it had acted more than reasonably expeditiously to confirm the renewal in the circumstances. 28In my view, the Defendant’s submission ignored the fact that under cl 11.4 SA, the written notice of renewal from the Plaintiff was to be given “not less than three (3) calendar months” before the expiry of the SA. It could be given earlier and therefore before 30 July 2013. Furthermore, even if one were to consider the timeframe for the Defendant to revert to be from 30 July 2013, the four weeks for the parties to agree on the revised amount (under cl 11.5 SA) would be till 27 August 2013 and not 6 September 2013. 29Moreover, the question of reasonably expeditious renewal should not be considered solely in the context of when the Defendant reverted but all the circumstances of the case,eg, did the Defendant take steps towards confirming the renewal in the meantime. 30As I will elaborate later, there was no genuine attempt by the Defendant in the interim period to try and agree on the revised charge for the renewal subject to the cap mentioned. Indeed, as mentioned, the Plaintiff was prepared to accept the maximum service charge but the Defendant was trying to get it to agree to more. 31Furthermore, the alleged acts of hindrances also shed light as to whether the Defendant was taking steps to confirm the renewal or the opposite. 32The pleaded acts of hindrances were in respect of the following: (a) Restriction of car parking spaces for the Plaintiff. (b) Improper parking of container by the Defendant which obstructed the Plaintiff’s access to the Spaces. (c) Preventing the Plaintiff from charging electrical material handling equipment at the usual designated charging point. (d) Requiring the Plaintiff to remove its diesel tank for its diesel forklift from a designated spot in the building grounds. (e) Cessation of lorry parking for the Plaintiff. (f) Cessation of ASRS by the Defendant. (g) Miscellaneous. This pertained to a requirement from the Defendant to the Plaintiff to provide various documentation which I will elaborate on later. 33I do not propose to elaborate on the parties’ arguments about each and every allegation as it suffices for present purposes to elaborate on a few of the allegations only.",
        "Cessation of lorry parking": "34By a letter dated 1 August 2013,5Foot Note 5×AB 146.the Defendant informed the Plaintiff to stop parking its lorry in the grounds of 51 with effect from 1 August 2013. The Plaintiff sent an email at 4.07pm on that day to ask for one month’s grace to find an alternative location. However, the Defendant responded by email at 4.12pm of the same day to say that, “After careful consideration, we are unable to further extend the service term” and required the removal of the vehicle from the grounds.6Foot Note 6×AB 148. 35The Plaintiff’s point was that it had in the past been paying $180 per month to the Defendant for the lorry parking space and that the timing of the Defendant’s letter to cease this coincided with the time when it was seeking the renewal of the SA. The Defendant was being obstructive because it did not even give the Plaintiff reasonable time to find an alternative location. The “careful” consideration by the Defendant of the Plaintiff’s request was done in only five minutes. 36Furthermore, the Defendant’s excuse for ceasing this facility was that there was no proper documentation for it. However, instead of proceeding to have this facility properly documented, the Defendant stopped it with immediate effect. 37The Defendant’s main witness on the hindrances was Mr Sim Ee Huey (“Sim”), an assistant vice-president. Even he had to admit that the Defendant’s conduct was “hasty and perhaps not reasonable” to the Plaintiff.7Foot Note 7×NE 2/11/16 p 28.He reiterated that it was unreasonable and agreed that this step was directed at the Plaintiff and not other occupants of other spaces in the building.8Foot Note 8×NE 2/11/16 p 34.However, he did not agree that it was done in bad faith.",
        "Restriction of car park spaces": "38By an email dated 2 August 2013,9Foot Note 9×AB 153.the Defendant informed the Plaintiff that it was experiencing very heavy usage of parking facilities at the grounds of 51. Accordingly, it was allocating only one parking lot for the Plaintiff’s staff. Previously the Plaintiff had been using two car park lots. When the Plaintiff sought an explanation for the computation logic for allocating one car park lot for it, no elaboration was given by the Defendant then.10Foot Note 10×AB 151. 39In Sim’s affidavit of evidence-in-chief (“AEIC”) at p 40, he alleged that while only one car park lot was reserved for the Plaintiff, there was in fact no restriction on persons who chose to drive and park in the grounds. There was no reported instance when the Plaintiff’s staff was denied entry. However, in cross-examination he accepted that one of the Plaintiff’s staff, Andrew Tng, was denied entry by the security guards to park at the grounds after the Defendant’s letter and that this part of his AEIC was inaccurate. He also agreed that the Defendant’s letter to restrict the car park lots for the Plaintiff was unreasonable but disagreed that it was done in bad faith.11Foot Note 11×NE 2/11/16 pp 44-45.",
        "Miscellaneous": "40By an email dated 16 August 2013,12Foot Note 12×PBD 133.the Defendant asked the Plaintiff to provide risk assessment forms for the conduct of loading and unloading activities at the common areas and also for the Plaintiff’s sub-contractors to provide similar forms for evaluation. However, by an email dated 2 September 2013 at 8.22pm, the Defendant said it no longer required such forms. 41By an email dated 31 August 2013, the Defendant complained about the parking of a disposal bin by the Plaintiff on the grounds.13Foot Note 13×AB 186.On 2 September 2013 at 9.49am, the Defendant required the Plaintiff to provide documentation for the parking of the disposal bin.14Foot Note 14×AB 185.However, by another email dated 2 September 2013 at 8.41pm, the Defendant said that the disposal bins had been retrieved and it did not require documentation on the matter.15Foot Note 15×AB 185. 42By an email dated 2 September 2013 at 9.47am, the Defendant required the Plaintiff to provide a copy of its public liability insurance. However, by another email dated 2 September 2013 at 8.25pm, the Defendant withdrew this request.16Foot Note 16×AB 177. 43As can be seen, each of the above requests was withdrawn in the night of 2 September 2013. This was after a meeting that the Defendant’s Charles Chan (“Chan”), the chief operating officer, had had with the Plaintiff’s Koh and his wife earlier that day. 44Sim’s evidence was that Chan had been upset with him for sending those emails which were dated before 2 September 2013 and had called him on 31 August 2013 to withdraw them but he had no time to do so until the night of 2 September 2013. However, as the Plaintiff submitted, if indeed Sim had no time to do so until the night of 2 September 2013, how was it that he nevertheless sent two emails in the morning of 2 September 2013 to require the Plaintiff to provide some more documentation? Furthermore, such additional requirements were inconsistent with any alleged prior instruction to stop what he was doing. I agree that Sim had not been truthful and he was trying to give the impression that the Defendant was acting in good faith with Chan giving such instructions even before the 2 September 2013 meeting. 45In any event, the point is that there was never really a need for the documentation which Sim was requiring. I agree that Sim required them to pressurise the Plaintiff to agree to a higher rate for the service charge. The timing of these requirements was not to ensure proper compliance with formalities as suggested by the Defendant. The fact that such requirements were not reinstated after they were withdrawn spoke for itself. 46I will now address an allegation about the transcript of a recording of the 2 September 2013 meeting. The Defendant’s position was that it was ambushed as Koh and his wife had secretly recorded what was said then. It submitted that the substance of that meeting was inadmissible in evidence as it was a “without prejudice” meeting. 47The Plaintiff submitted that the meeting was not on a “without prejudice” basis and that the transcript of the recording was admissible in evidence. 48InSin Lian Heng Construction Pte Ltd v SingaporeTelecommunications Ltd[2007] 2 SLR(R) 433, Sundaresh Menon JC, as he then was, said at [13], that there are two prerequisites before the “without prejudice” privilege can be invoked. The first is that the communication must be an “admission”. The second is that there must in fact be a dispute which the parties are trying to settle. He elaborated that the privilege does not apply if, for example, the discussion was to discuss repayment of an admitted liability rather than to negotiate and compromise a disputed liability, citingBradford v Bingley plc v Rashid[2006] 4 All ER 705 at [73]. 49In the case before me, there was no dispute that the maximum service charge payable by the Plaintiff for the new term was $0.902 psf. The Defendant was simply trying to get the Plaintiff to agree to pay more in that meeting as well as in earlier discussions. It seems to me that this is similar to the situation where a debtor does not dispute a debt but is asking for more time to pay. Accordingly, there was no dispute which the parties were trying to compromise. 50Secondly, I agree that the transcript showed that Chan had admitted that the Defendant was trying to put pressure on the Plaintiff to agree to a higher rate and that it was the Defendant’s Eric Khua, the chief executive officer, who had instructed that this be done. It is not necessary for me to set out the relevant portions of the transcript as it was not really disputed that that is what they showed. 51Hence, the transcript was admissible in evidence. 52In any event, I add that even if the transcript was not admissible in evidence, it is clear to me from other evidence, some of which I have elaborated upon above, that the Defendant had engaged in acts of hindrances to pressurise the Plaintiff to agree to a higher rate instead of taking reasonably expeditious steps to confirm the renewal. I find that the Defendant had breached the implied term to act reasonably expeditiously to confirm the renewal. 53Unfortunately, it is all too often the case that economic interests trump commercial probity. To make matters worse, the Defendant’s witnesses gave untrue excuses to try and justify its conduct instead of admitting what it was trying to do. 54The Defendant’s conduct at the material time did not improve even after it had appointed solicitors to act for it. If anything, its solicitors’ involvement appeared to have made matters worse. For example, when the Defendant eventually offered on 6 September 2013 to renew the SA in principle, it stated that there was no subsisting breach of the SA by the Plaintiff.17Foot Note 17×AB 207-208.It also stated in a separate letter dated 5 September 2013 to the Plaintiff that it was not renewing the ASRS.18Foot Note 18×AB 206.The Plaintiff’s solicitors then objected on 9 September 2013 to the Defendant’s decision to withdraw the ASRS and decided to forward the draft of a 3rd Addendum for the renewal, for the Defendant’s consideration. The Defendant’s solicitors in turn replied on 11 September 2013 to state that the Plaintiff had committed several breaches of the SA. They also said that the proposed 3rd Addendum was a counter-offer which extinguished the Defendant’s offer to renew the SA. Alternatively, the offer was withdrawn. The allegation by the Defendant’s solicitors that the Plaintiff had committed several breaches of the SA was a volte-face from what the Defendant itself had said on 6 September 2013. 55I also find that the acts of hindrances amounted to a breach by the Defendant of the implied term of quiet enjoyment by the Plaintiff. 56On this point, I reject the Defendant’s argument that allegations of hindrances which pertained to acts affecting the Plaintiff’s use of common property as opposed to its use of the Spaces themselves did not interfere with the implied covenant of quiet enjoyment. In my view, the concept of quiet enjoyment is to be viewed holistically and is not confined to the direct use of the Spaces only. 57In the circumstances, I find that the Defendant did breach both the implied terms mentioned above.",
        "Whether the Defendant was liable for the heads of damages claimed": "58However, the unusual aspect of this case is that although the Plaintiff did enter into an agreement for 46A, it did not yield its claim for the renewed term for 51. Indeed, the Plaintiff remained there and continued to use 51 although it claimed that the fast moving cargo was moved to 46A as there was stability for its operations there and some of the slower moving cargo was moved from other premises operated by third parties into 51. The Plaintiff was eventually granted a tenancy agreement for 51 for a term expiring on 31 October 2016 which was the same expiry date it had sought. 59The question then is whether the Plaintiff is entitled to claim damages which are associated with its acquisition of and operations at 46A. The Plaintiff’s heads of claims are for: (a) office and cargo shifting from 51 to 46A;(b) office renovations at 46A;(c) rental for the office (as opposed to the warehouse) at 46A;(d) additional warehouse rent (for the warehouse at 46A as compared with the average cost of storing cargo with external third parties);(e) office and warehouse equipment, furniture and fixtures and electrical installation at 46A; and(f) shuttle bus for its employees between 51 and 46A. 60If the Defendant’s conduct amounted to a repudiatory breach or a breach of a condition or conditions which would have entitled the Plaintiff to terminate the SA read together with the 2nd Addendum, then the Plaintiff had to elect whether to terminate the agreement or not. If it had elected to terminate and move out of 51, then it might in principle be entitled to claim some or all of the various heads of damages mentioned above. However, as it decided not to terminate and did in fact obtain the use of 51, I am of the view that it is not entitled to claim such heads of damages. Whether the Plaintiff could then instead have been entitled to claim damages for the distress caused by the Defendant’s conduct and any loss of productivity arising from the acts of hindrances is a moot point because the Plaintiff is not claiming such damages. 61It is telling that in the AEIC of Koh, he said at para 33(3) that even if the Defendant had repudiated the SA, the Plaintiff was entitled to elect between affirming the agreement or to accept the repudiation and treat the agreement as terminated. However, the Plaintiff was not obliged to accept the repudiation. I agree. However, the Plaintiff was attempting to do both,ie, to affirm the agreement and yet make a claim for damages as if it had terminated the agreement. The heads of damages claimed by it might be claimable in law only if it had terminated the agreement which it chose not to do. 62Furthermore, if the Defendant’s conduct was not serious enough to allow the Plaintiff to terminate the agreement as the Plaintiff was suggesting, then the Plaintiff cannot be in a better position than if the Defendant’s conduct would have allowed the Plaintiff to terminate but it chose not to do so. 63If the Plaintiff were permitted to remain at 51 at the maximum agreed rate and claim damages in respect of 46A, then the Defendant would be doubly penalised. First, the Defendant would lose the difference between the market rate and the maximum agreed rate. Secondly, the Defendant would have to compensate the Plaintiff by paying damages. Conversely, the Plaintiff would have enjoyed a windfall at the expense of the Defendant for the same reasons. Therefore, it is immaterial whether the Plaintiff continued to use 51 because the location was particularly useful to it as alleged by the Plaintiff. The Plaintiff could not adopt courses of action which are incompatible in law. 64It seems to me that in the circumstances, 46A was not in truth alternative premises but rather additional premises which the Plaintiff had acquired via a tenancy agreement from another landlord. In the cases which the Plaintiff cited to support its claim for damages, the plaintiffs were denied the use of the premises in question, unlike the Plaintiff before me. 65The Plaintiff also argued that it did not terminate the agreement and move out of 51 because if it had done so, it might then be compelled by the Defendant to move back if the Plaintiff was not entitled to terminate the agreement and move out. I do not accept this argument. First, the Plaintiff has to act consistently with its own stand. If it genuinely believed that the Defendant’s conduct was so destabilizing to its business as to justify it in terminating the agreement, then it was for the Plaintiff to act on that basis. If, the Plaintiff did not believe that such conduct justified its termination of the agreement, then it should not use such conduct to justify its acquisition of 46A. As mentioned above, the Plaintiff’s position cannot be better if the Defendant’s conduct did not permit the Plaintiff to terminate the agreement. 66This does not mean that the Plaintiff was at the mercy of the Defendant. It could have put the Defendant on notice that if the acts did not cease, it would seek an injunction to restrain the Defendant from committing such acts. Likewise, if, as the Plaintiff suggested, the Defendant was obliged to revert to it reasonably promptly to confirm the renewal and the Defendant was not doing so and this was destabilising its business, then the Plaintiff could have put the Defendant on notice that it would have to seek a mandatory court order to compel the Defendant to do so. Indeed, two such letters threatening court proceedings were sent in September 2013 by its solicitors and I will elaborate on them later. 67Secondly, and more importantly, there was no danger that if the Plaintiff moved out of 51, the Defendant would have insisted on the Plaintiff moving back to 51. As the Plaintiff had asserted, the maximum agreed rate it was to pay for the renewed term was way below the market rate. The Defendant would have only been too pleased if the Plaintiff chose to move out without sufficient legal ground to do so as the Defendant would then have been able to offer 51 at a higher rate to others. 68The Plaintiff relied onBanco de Portugal v Waterlow & Sons Ltd[1932] 1 AC 452 andThe “Asia Star”[2010] 2 SLR 1154 for the proposition that the court should adopt a generous approach in assessing the conduct of the aggrieved party in mitigation and that such conduct should not be weighed on fine scales. That proposition was not disputed. It was the application of the law to the facts that was in question. 69Furthermore, inThe “Asia Star”, the Court of Appeal also stated at [75] and [76] that the notion of fairness ordinarily requires the aggrieved party who has to incur substantial expenses to mitigate to notify the defaulting party of the proposed course of action it was intending to undertake so as to give the defaulting party an opportunity to take a certain course of action, unless there was “grave urgency” in taking the proposed course of action that rendered such communication impractical. That was a case involving a charter party. 70In the case before me, it is pertinent to note that while the Plaintiff was unhappy about the Defendant’s conduct, it did not notify the Defendant in writing or at all at the material time about its intention to seek alleged alternative premises if the Defendant did not immediately cease the acts of hindrances and confirm the renewal. 71It was only on 26 December 2013 that the Plaintiff’s solicitors wrote to the Defendant’s solicitors to mention only that the Defendant’s delay to confirm the renewal had caused loss and damage to the Plaintiff, “including but not limited to the costs of getting alternative premises. Our clients wholly reserve their rights to claim for damages”. Firstly, this allegation was too late in the day. By 26 December 2013, the Plaintiff had already committed itself to 46A. Secondly, the above allegation was vague. It did not inform the Defendant that the Plaintiff was indeed going to acquire other premises or had indeed acquired such premises. It also did not say whether the alternative premises acquired were for a short or long duration. There was no elaboration. 72As regards the question as to why the Plaintiff had not notified the Defendant of its intention to acquire 46A, the Plaintiff said that it did not want the Defendant to know how badly affected the Plaintiff was by the Defendant’s conduct as that might embolden the Defendant to continue or even to increase the frequency and intensity of the hindrances. I do not accept such an explanation which is illogical. If an aggrieved party is of the view that the conduct of another is wrongful, then the aggrieved party must, at the very least, notify the latter accordingly and require him to stop it. Indeed, as already discussed, the aggrieved party is also to put the defaulting party on notice of its own intended course of action if the wrongful conduct does not stop if the aggrieved party is seeking to claim damages subsequently. 73It seems to me that, for its own reasons, the Plaintiff was keeping its own plans to itself, whether such plans were for its own expansion or not. It is entitled to do that but not to claim compensation arising from the execution of such plans. 74There is one other point I would mention. Although the Plaintiff had already accepted a letter of offer for 46A on 5 or 6 September 2013, its solicitors wrote on 13 September 2013 to the Defendant’s solicitors for the renewal of 51. Paragraph 5 of that letter stated, “Our clients hope and trust that commercial sense and morality will prevail, that court proceedings will not be necessary, and look forward to a further three (3) year term with your clients”.19Foot Note 19×AB 222. 75In another letter dated 23 September 2013 from the Plaintiff’s solicitors to the Defendant’s solicitors, para 6 was in similar terms,ie, the Plaintiff was hoping that court proceedings would not be necessary.20Foot Note 20×AB 230. 76I asked the Plaintiff to submit on these two letters. The Plaintiff submitted that at that time the reference in these two letters to court proceedings was to proceedings to compel the Defendant to renew the SA only. It was not a reference to court proceedings to claim damages. The Plaintiff said that at that time it was only concerned about the survival of its business and the thought of suing the Defendant for damages did not even occur to it.21Foot Note 21×Para 36(2) of Koh’s AEIC and the Plaintiff’s closing submissions at paras 121 & 122.In other words, the Plaintiff was submitting that what the letters meant was that if the renewal was granted, there would be no court proceedings to seek specific performance but the letters did not suggest that the Plaintiff would not claim damages. Hence the letters did not show that the decision to acquire 46A was independent of the Defendant’s conduct. 77I had some doubt about the Plaintiff’s explanation.Prima faciethe two letters appeared to suggest that if the Defendant had responded expeditiously to confirm the renewal as demanded, there would be no court proceedings to claim any relief whatsoever even though the Plaintiff had already committed itself to acquiring 46A. In other words, the inference to be drawn from the two letters was that the Defendant’s conduct did not cause the Plaintiff to acquire 46A. Hence, the Plaintiff was prepared not to initiate court proceedings if the renewal was confirmed at that time. Also, it did not seem believable that the thought of claiming damages did not occur to the Plaintiff at the time the letters were sent when the Plaintiff was also asserting that it had to acquire 46A and incur various costs associated with and arising from that acquisition precisely because of the Defendant’s conduct. 78Nevertheless, as Koh was not cross-examined about these two letters, I have decided not to draw any adverse inference against the Plaintiff from these two letters. 79In any event, for the other reasons stated above, I find that the Plaintiff is not entitled to claim the heads of damages in question notwithstanding the Defendant’s wrongful conduct. I dismiss the Plaintiff’s claim for such damages. I will grant it judgment against the Defendant for the nominal sum of $100 instead. The assessment of the quantum of damages is academic. 80If either party wishes to pursue a claim for costs, that party is to write to the Registrar of the Supreme Court to state this intention within one month from the date of this judgment, otherwise any claim for costs will be deemed to be waived unless an extension of time is granted. If such written notice is given, a date will be fixed for the hearing of arguments on costs. Woo Bih LiJudge  Dominic Chan and Melvyn Foo (Characterist LLC) for the plaintiff; Kenneth Tan, SC (instructed) and Arivanantham s/o Krishnan (Ari, Goh & Partners) for the defendant."
    }
}