{
    "case_title": "Fu Loong Lithographer Pte Ltd and othersvMok Wing Chong(Tan Keng Lin and others, third parties)",
    "ncitation": "[2017] SGHC 97",
    "coram": "High Court — Suit No 311 of 2012/NQuentin Loh J6–7, 11–14, 18–20 February; 12, 16–19, 22–25 September 2014; 30 June; 1–3, 8 July; 9–10 September 2015; 9 October 2015; 1 December 2016.",
    "sections": {
        "The pleadings": "",
        "The main action": "12In their SOC, the Plaintiffs allege that the Defendant breached his duties as the chairman and a member of the Council of MCST 1024 in three broad ways: (a)First, he caused MCST 1024 to undertake the 62 items of works set out in the Annex to the SOC without having been authorised by the SPs to do so.8Foot Note 8×SOC at [11]–[18]I set out these works at [168]–[178] below, and refer to them as the “Annex A Works”. (b)Secondly, he favoured the SPs in the Mok Camp in relation to nine items of works. These works were performed on the common property adjacent to the units owned by the Mok Camp, and were “far superior and more extensive” than the corresponding works applied to the common property adjacent to the units owned by the SPs in the Plaintiffs’ Camp.9Foot Note 9×SOC at [19]–[27]For convenience, I refer to these nine items of works as the “Annex B Works”, and note that there is some overlap between the Annex A Works and the Annex B Works. (c)Thirdly, he appointed Mun Hean Asia Pte Ltd (“MH Asia”) as the managing agent of MCST 1024 without having been authorised to do so and without disclosing his pecuniary interest in MH Asia.10Foot Note 10×SOC at [28]–[32] 13In their closing submissions, the Plaintiffs cast the issues somewhat differently. The closing submissions state the essential issue to be whether the Defendant is liable to MCST 1024 for the funds (that were spent on the Annex A Works) and misusing and exceeding his powers as chairman. It is further stated that the following issues are “ancillary” to the “main issue”: (a) Whether the expenses for the disputed works had been approved or authorised by the Council or the general body of MCST 1024; (b) Whether the disputed works were upgrading works or routine maintenance works; (c) Whether the Defendant was in control of the Mok Camp; (d) Whether the decision to proceed with the disputed works was made by the Defendant; (e) Whether the expenses for the disputed works had been properly budgeted for and approved by the general body, and/or properly ratified subsequently; (f) Whether MH Asia had been appointed as managing agent of MCST 1024 and if so, whether they had been properly appointed; (g) Whether the Defendant was in breach of s 60 of theBuilding Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (“BMSMA”)in appointing MH Asia without declaring his pecuniary interests; and (h) Whether the Defendant had failed to act in the best interests of all the SPs of MCST 1024 in relation to the disputed works. 14Notwithstanding the strange characterisation of the above issues as “ancillary” (which means something that is auxiliary, supplementary, subsidiary, subordinate or additional), the answers to the issues at (a), (b), (d), (e), and (h) determine whether the Defendant is liable to MCST 1024 for the funds spent on the Annex A Works and whether the Defendant misused and exceeded his powers as Chairman. Also, for reasons that I will come to subsequently, whether the Defendant is “in control” of the Mok Camp (at (c) above) is irrelevant when all the SPs in the Mok Camp stood behind the Defendant and voted accordingly. Many of these SPs also gave evidence before me. 15The Defendant denies all these allegations. He pleads as follows in his defence (the “Defence”): (a)In relation to the Annex A Works: (i) The undertaking of the Annex A Works was authorised by the SPs, whether by the custom in MCST 1024 of the SPs consenting to works without a formal resolution,11Foot Note 11×Defence at [10(b)]or by the discussion of the works at the 24th AGM at which the Plaintiffs were present and raised no objections to them.12Foot Note 12×Defence at [16] (ii) Further, the undertaking of the Annex A Works was within the authority of MCST 1024 to maintain and keep the Development in good and serviceable repair (“repair and maintenance”), and the expenditure on the works had always been approved by the Council.13Foot Note 13×Defence at [8] (iii) In any event, MCST 1024 had at its 27th AGM ratified the Annex A Works.14Foot Note 14×Defence at [25] (b)In relation to the Annex B Works: (i) Some of the Annex B Works could not have been performed because the common property on which they were said to have been performed does not even exist.15Foot Note 15×Defence at [19(a)]Others were necessitated by the different characteristics and layouts of Block 51 and Block 53,16Foot Note 16×Defence at [19(b)] and [19(i)]and the different times at which the works were performed on each building.17Foot Note 17×Defence at [19(h)] (ii) In any event, the SPs in the Mok Camp had paid for any differences between the costs of the Annex B Works, and the costs of the corresponding works applied to the common property adjacent to the units of the SPs in the Plaintiffs’ Camp.18Foot Note 18×Defence at [19(h)] (c)In relation to the appointment of MH Asia, MH Asia was engaged on a temporary basis to provide MCST 1024 with the same book-keeping and administrative services that had previously been provided by Mun Hean Realty Pte Ltd (“MH Realty”), which was wound up in June 2009. MH Asia was paid the same rate of remuneration as MH Realty. All the members of the Council and all the SPs knew or ought to have known that the Defendant was a director of both MH Realty and MH Asia. None objected when informed about MH Asia’s appointment on or around 5 August 2009.19Foot Note 19×Defence at [26]",
        "The third-party action": "16In the 3PSOC, the Defendant pleads further that if the Plaintiffs obtain the reliefs sought against him, he is entitled to contribution and/or indemnity and/or corresponding declarations against KL Tan and MCST 1024 in respect of the Plaintiffs’ claims. He explains:20Foot Note 20×3PSOC at [7] (a)The Annex A Works were carried out pursuant to decisions made by the 23rd and 24th Councils. KL Tan was a member of these Councils and he agreed to or acquiesced in the Council’s carrying out of these works.21Foot Note 21×3PSOC at [9]–[11] (b)If the Annex A Works and Annex B Works were wrongful, KL Tan was in breach of his trust and/or fiduciary duties in allowing or consenting to the carrying out of them. He was also in breach of his duties to act diligently in failing to obtain the requisite approvals for the Annex A Works, and in failing to ensure that the SPs in the Mok Camp had provided an account of the payments that they made on account of the Annex B Works.22Foot Note 22×3PSOC at [12A]–[12B] (c)If MH Asia was appointed as managing agent wrongfully, KL Tan was in breach of his duties as a member of the Council in failing to object and thereby impliedly consenting to such appointment.23Foot Note 23×3PSOC at [16] (d)MCST 1024 obtained the benefit of Annex A Works and the Annex B Works, and of the administrative services provided by MH Asia.24Foot Note 24×3PSOC at [12] and [17] 17KL Tan denies that the 23rd or 24th Councils had approved either the Annex A Works or the Annex B Works. The sole Council meeting during that period was held only to propose an increase in the maintenance and sinking fund contributions of each SP.25Foot Note 25×Defence of 1st third party to 3PSOC at [10]Further, the body of SPs in general meeting did not authorise the works. Instead, KL Tan had in a letter to the Defendant on 25 May 2009 objected to the works “when he realised that they were not budgeted for”.26Foot Note 26×Defence of 1st third party to 3PSOC [11]The Defendant had unilaterally decided to use the management and sinking funds to undertake the works. KL Tan did not consent or agree to his doing so.27Foot Note 27×Defence of 1st third party to 3PSOC [16]",
        "The parties and their witnesses": "18The second plaintiff, In-Lite Enterprise (S) Pte Ltd, has been the SP of unit #03-01 of Block 53 since 1996. It was represented in its dealings in MCST 1024 by KL Tan and his wife, Sarah Tham,28Foot Note 28×AEIC of Sarah Tham at [1]–[2]both of whom are directors of the second plaintiff.29Foot Note 29×Notes of Evidence 6 February 2014 at p 14Sarah Tham gave evidence on behalf of it, while KL Tan gave evidencequafirst third party. However, Sarah Tham accepted that, from 1996 to 2009, the second plaintiff was represented exclusively by KL Tan. She attended neither general meetings nor Council meetings, and was not familiar with the events during that period.30Foot Note 30×Notes of Evidence 6 February 2014 at pp 15–16 19The fourth plaintiff, Poh Kim Video Pte Ltd, has been the SP of unit #03-03 of Block 53 since 1997. It was represented in its dealings in MCST 1024 by CY Lim,31Foot Note 31×AEIC of CY Lim at [1]–[2]who gave evidence on its behalf in these proceedings. 20The Defendant put forward six witnesses: (a)Mok Wing Chong, the Defendant himself;(b)Mok Wai Chung (“WC Mok”), the authorised representative of Wing Poh Hardware Pte Ltd, the SP of unit #03-01 of Block 51;32Foot Note 32×AEIC of WC Mok at [1](c)Lee Keng Kuang (“KK Lee”), a director of Southern Grace Hardware Pte Ltd, the SP of units #04-02 and #05-01 of Block 51;33Foot Note 33×AEIC of KK Lee at [1] and p 19(d)Ang Bee Tin, Jessie (“Jessie Ang”), the authorised representative of MH Asia, the SP of unit #04-01 of Block 51;34Foot Note 34×AEIC of Jessie Ang at [1](e)Loo Chee Keong (“CK Loo”), a member of the Council of MCST 1024 from 18 September 1998 to 4 November 2009, and from 6 October 2010 until at least the date of the trial;35Foot Note 35×AEIC of CK Loo at [5](f)Mok Wai Kuen (“WK Mok”);(g)Mok Wing Tak (“WT Mok”); and(h)Thomas Neo Lian Teck (“Thomas Neo”). 21As witnesses, all of them came across as being fairly truthful. I found that the Plaintiffs genuinely felt aggrieved with what they perceived as unfair governance of the affairs of MCST 1024 and the Development. I found the Defendant a very focussed and deep thinking person, but who was also very quietly wilful and stubborn. He strongly believed that he took on a task of running the management corporation when no one was interested in doing so and was very annoyed when he was being challenged after years of service. The trouble started when the Urban Development Authority (“URA”) issued a circular dated 7 July 2008 on the alternative land use for the industrial cluster at Jalan Ampas,36Foot Note 36×2AB1049which included the Development. This paved the way for a potentialen blocsaleof the Development with a change of user. However, it is alleged that the Defendant was not in favour of the sale. I pause to note that even if that was the case, he was entitled to take that view as a SP. His resolve to keep the control of MCST 1024 within the Mok Camp hardened thereafter. All the witnesses believed in what they said, but at times, that was simply their perception of the events. I therefore have to be guided more by the objective evidence before me. 22In addition, the Plaintiffs called Mr James TM Loo (“Mr Loo”) and the Defendant called Mr Leslie Harland (“Mr Harland”) as expert witness. The expert witnesses put forward a joint statement, in lieu of a joint report.37Foot Note 37×Exhibit P1I found the expert evidence to be of limited assistance. As set out in the joint statement produced by the experts: (a) It was difficult to make any meaningful comparisons in their respective reports because the instructions received by each expert was substantially different from the other. (b) For example, Mr Loo’s report concerns the cost differences between the standard of works at Block 51 as compared to Block 53 whereas the focus of Mr Harland’s report concerns the reasonableness (or otherwise) of the costs incurred in undertaking the works. What I note is that Mr Loo agreed with the findings of Mr Harland’s report and accepted the costs in carrying out the work was reasonable. Other than that I found the experts’ evidence was of little help for the issues I had to decide; they could not really be blamed for this due to their instructions and nature of the evidence put before them.",
        "The facts": "23The Defendant was first elected Chairman of the Council at the 7th AGM of MCST 1024 on 30 September 1991.38Foot Note 38×1AB3Thereafter, he was re-elected as Chairman at every AGM up to (and including) the 26th AGM on 6 October 2010.39Foot Note 39×1AB5, 11, 15, 21, 26, 31, 36, 40, 45, 50, 55, 59, 63, 67, 72, 76, 84, 109, 124",
        "The 23rd AGM in 2007": "24I start with the 23rd AGM, which was held on 2 October 2007.40Foot Note 40×1AB74At that AGM, the Defendant informed the SPs of the need toraise the driveway and the culvert at the main entrance to the Development along Kim Keat Road, and to build a boundary wall to replace the existing perimeter fencing. The former was necessitated by soil settlement and the fact that the roads leading to the Development had been raised, while the latter was designed to improve safety and aesthetics. The general meeting “unanimously accepted the propos[al] of the above works”,41Foot Note 41×1AB76which were then carried out. I pause to mention that Counsel for the Plaintiffs, Mr Leo Cheng Suan (“Mr Leo”), confirmed that the statement in the minutes that “[t]he Council” unanimously accepted the proposal was erroneous42Foot Note 42×Notes of Evidence 30 June 2015 at p 92and should have stated “the general body” (ie, the general meeting). 25On 20 November 2007, the Defendant sent a circular to all the SPs informing them that “[t]he lift lobbies and toilet facilities [at both Block 51 and Block 53] are due for upgrading”.43Foot Note 43×1AB160These works commenced in June 2008, and were completed by October 2009.44Foot Note 44×1AB164 and 1AB82",
        "The 24th AGM in 2008 and the events in 2009": "26The 24th AGM was held on 9 October 2008.45Foot Note 45×1AB81The Defendant updated the SPs on the progress of the works, and informed them that the five items of works had been “carried out and completed”.46Foot Note 46×1AB82This is recorded at Point 5 of the minutes of the 24th AGM: 5.  RENOVATION WORKS ON THE COMMON AREAS The Chairman updated the members on the upgrading works which have been carried out and completed: (a) Upgrading of fencing around the compound and the sliding gate (b) Signage for boundary walls (c)  Upgrading of 1st floor lift lobby (d) Upgrading of 1st & 5th floor male/female toilets (e) Installation of aluminium ceiling system Works for (c)(d)(e) were carried out at 53 Kim Keat Road. The SPs resolved to increase the management and sinking fund contributions by 20% and 10% respectively. Thereafter, the Defendant was re-elected as Chairman.47Foot Note 47×1AB82–85 27Some five months later, on 12 March 2009, the SPs of units on the third and fourth floors of Block 53 filed OS300/2009 to determine,inter alia, whether the common corridors and toilets on thethird and fourth floors of Block 53 came under the care of MCST 1024. These corridors and toilets were demarcated as common property. Over the years, however, these SPs had been made to pay additional sums, which were over and above their contributions to the maintenance and sinking funds of MCST 1024, to maintain these corridors and toilets. The Defendant, as Chairman, had taken the rather strange position that these corridors and toilets fell outside the care of MCST 1024 because “this arrangement was there from the start”.48Foot Note 48×AEIC of CY Lim at [4]This issue was resolved just over a year later on 12 April 2010 (ie, after the two-tranche 25th AGM on 5 October and 4 November 2009), when the High Court ruled that these corridors and toilets were part of the common property of the Development, and ordered MCST 1024 to reimburse the applicant-SPs the expenses that they had incurred over the years in maintaining, repairing and renovating the areas.49Foot Note 49×2AB1170–1172 28On 22 May 2009, the Council met at a coffee-shop and voted, by a majority, to increase the monthly maintenance and sinking fund contributions by 5% with effect from June 2009. KL Tan and Amy Tay voted against this proposal. In addition, the Defendant requested that the SPs pay two months’ maintenance and sinking fund contributions in advance, and the majority of the Council supported this request.50Foot Note 50×1AB145–146 29Between 8 and 11 June 2009, various SPs in the Plaintiffs’ Camp wrote to the Defendant questioning the works and stating that they would not be making the advance payments of the maintenance and sinking fund contributions that the Defendant had requested. These SPs included the second plaintiff (represented by KL Tan), Hock Guan Cheong Builder Pte Ltd (represented by Amy Tay), LCE Engineering Pte Ltd (represented by AC Tan), and CKT Thomas Pte Ltd (represented by one Steven Teo). The Defendant replied that the advance payments were necessitated by a “shortage of funds … due to the upgrading/renovation works which have been completed ahead of schedule”.51Foot Note 51×1AB198–204 30Over June and July 2009, KL Tan (on behalf of the second plaintiff) and other SPs in the Plaintiffs’ Camp corresponded with the Defendant on the expenses for the works. The former considered the expenditures on the works irregular and excessive, while the latter maintained that the works were approved at the 24th AGM.52Foot Note 52×1AB205–230 31On 31 July 2009, the Defendant wrote to KL Tan (in the latter’s capacity as the Secretary of MCST 1024) pointing out that members of the Council had been actively involved in the upgrading works for the past two years. The Defendant expressed his surprise at KL Tan’s “sudden interest” in the works, and stated that some of KL Tan’s questions were “frivolous”.53Foot Note 53×1AB231 32On 5 August 2009, the Defendant informed the SPs and the members of the Council that MH Realty, which provided administrative services to MCST 1024, had been wound up in June 2009. Further, MH Asia had taken over the provision of these administrative services “temporarily”. The Defendant also “appeal[ed] to anyone eligible and interested in taking over the works” to contact MCST 1024.54Foot Note 54×1AB232 33On 8 August 2009, the SPs in the Plaintiffs’ Camp wrote to object to the appointment of MH Asia, and proposed that an external managing agent be appointed to run MCST 1024 instead.55Foot Note 55×1AB233 34On 25 August 2009, KL Tan, Karen Ang, Amy Tay, and AC Tan (in their capacities as members of the Council) sent a written reply to the Defendant. They stated that they were “not given any opportunity to involve or participate in the upgrading work and were not even furnished with details on planning, design, pricing, types of materials and fittings etc”. They added that “the upgrading work was [the Defendant’s] unilateral decision and was not budgeted, voted and/or approved via the proper procedure”.56Foot Note 56×1AB236–237",
        "The 25th AGM in 2009": "35The 25th AGM was held on 5 October 2009 with all SPs represented.57Foot Note 57×1AB97A motion was tabled to ratify the upgrading expenditures up to an amount of $530,000. This was objected to by the representative of the third plaintiff, Lim Heng Hoe (“HH Lim”). A committee comprising representatives from both the Plaintiffs’ Camp and the Mok Camp was then set up to “go through the upgrading expenses” (the “Audit Committee”). The six members of the Audit Committee were CK Loo, WC Mok, AC Tan, Ong Lye Chun (“LC Ong”), Tan Han Yong (“HY Tan”), and Sunny Yu.58Foot Note 58×1AB99The 25th AGM was then adjourned for a month “to settle the outstanding matters”.59Foot Note 59×1AB105 36The 25th AGM resumed on 4 November 2009 with all SPs represented.60Foot Note 60×1AB106The Defendant, in his capacity as Chairman, noted that only AC Tan, CK Loo, and WC Mok of the six-member Audit Committee had submitted “their findings regarding expenses on the upgrading works”. HY Tan then commented that “copies of the bills handed to him for auditing purpose were marked ‘Confidential’ which prevented him from delegating the auditing work to others”. LC Ong stated that he “has not completed the auditing report”. Sunny Yu, while present at this meeting, does not appear to have made any remarks on his findingsquamember of the Audit Committee.61Foot Note 61×1AB108The SPs did not manage to resolve the issue of the upgrading expenditure; HH Lim is recorded as having “proposed that the [A]uditing [C]ommittee meet up and ratify the issue on the upgrading expenses”. Thereafter, the meeting concluded with the election to the Council of four members of the Mok Camp and one member of the Plaintiffs’ Camp, with the remaining seats unfilled.62Foot Note 62×1AB110 37Of the four members of the Mok Camp voted into the Council at the 25th AGM, two had been nominated by the SP of #01-00 of Block 53, Mun Hean Singapore Pte Ltd (“MH Singapore”), who is in the Mok Camp. This exceeded the number of nominees that MH Singapore was entitled to put up for election, and was in breach of s 53 of the BMSMA. One of MH Singapore’s nominees who had been elected to the Council resigned almost immediately after the 25th AGM in the hope of rectifying the defect. Nevertheless, various SPs in the Plaintiffs’ Camp applied to the STB in STB79/2009 to invalidate the election of all the Council members at the 25th AGM. The STB found that the error had been inadvertent and did not prejudice any of the SPs. It thus dismissed the application and awarded costs of $20,000 to the respondents.63Foot Note 63×DAEIC at p 275 38On 30 November 2009, LC Ong “on behalf of” AC Tan and HY Tan submitted their report on “Upgrading Expenses on Building Work-Done during the financial year ended 30 June 2009.” They made three observations: First, they opined that “the materials, fittings & fixture and work-done were generally not carried out in a uniform standard for common property in the [D]evelopment”, and suggested that “MCST 1024 should appoint a Quantity Surveyor to assess on the costs of the work done”. Secondly, they opined that the pricing for the works from two contractors, Kian Wah Contract Pte Ltd (“Kian Wah”) and Mod Creations Pte Ltd (“Mod Creations”), “were on the high side”, and that “the cost of boundary wall at approximately S$60,000.00 was high”. Thirdly, they stated that two bills from Kian Wah were omitted from the presentation on upgrading expenses at the 25th AGM on 5 October 2009, and “[a]s such, the Upgrading Expenses of $475,708.[44] … is not correctly presented”.64Foot Note 64×1AB259 39On 5 March 2010, LC Ong wrote to the Defendant asking for the “‘As-Built’ drawings and inventory lists for the upgrading works”.65Foot Note 65×1AB262",
        "The 26th AGM in 2010 and events in 2011": "40The 26th AGM was held on 6 October 2010 with all SPs represented. In light of the ruling in OS300/2009 (see [27] above), the Defendant tabled a motion to upgrade the toilets on the third and fourth floors of Block 53, and another motion to increase the management and sinking funds to meet the expenditures for the upgrading works on,inter alia, these toilets, the driveway, and the drainage system of the Development. This motion was defeated because all the SPs in the Plaintiffs’ Camp voted against them. Another motion to adopt the audited financial reports for the financial year (“FY”) ended 30 June 2010 (ie, FY2010)was also not passed after Sarah Tham expressed the view that these reports “could not be adopted (passed) as the previous year’s audited statement was not adopted and this could have an effect on the status of current statement”. Once again, all the SPs in the Plaintiffs’ Camp voted against this motion.66Foot Note 66×1AB113–123 41On 22 July 2011, various SPs in the Plaintiffs’ Camp requisitioned an Extraordinary General Meeting (“EGM”) to remove the Defendant as Chairman of MCST 1024 and to elect a new Chairman.67Foot Note 67×1AB269 42The Council met on 5 August 2011 to discuss the requisition. During the meeting, the Defendant stepped down as Chairman and was replaced by his son, Dr Mok Wai Hoe (“Dr Mok”).68Foot Note 68×1AB272The Defendant retained his position on the Council,69Foot Note 69×1AB272on which he continued to serve.70Foot Note 70×1AB138 43On 5 September 2011, an EGM was convened to consider a motion of no confidence in the Defendant as Chairman. Dr Mok ruled the motion out of order because “a new Chairman had already been elected”, and closed the EGM.71Foot Note 71×2AB1175",
        "The 27th AGM in 2011": "44The 27th AGM was held on 6 September 2011 in the meeting room of a hotel. The SPs split into two groups along the lines of the Mok Camp and the Plaintiffs’ Camp, and each group held a separate meeting. Dr Mok chaired the meeting of the Mok Camp (the “Mok Meeting”), while CY Lim chaired the meeting of the Plaintiffs’ Camp (the “Plaintiffs’ Meeting”).72Foot Note 72×1AB128–129 45On 26 September 2011, MH Singapore applied to the STB in STB78/2011 to invalidate various motions passed at the Plaintiffs’ Meeting. STB78/2011 was eventually decided on 18 February 2013. The STB declared that the Mok Meeting was the legitimate meeting and that the Plaintiffs’ Meeting was invalid. The STB also found that the elections at the Plaintiffs’ Meeting of the Council, and of CY Lim as Chairman, were invalid.73Foot Note 73×2AB1195 46Whilst awaiting the STB decision in STB78/2011, two things happened: (a) First, on 8 November 2011, the SPs in the Plaintiffs’ Camp purportedly held an EGM, and directed MCST 1024 to initiate legal proceedings against the Defendant for using the management and sinking funds without authority. MH Singapore applied to the STB in STB93/2011 to invalidate these resolutions. By consent, the hearing of STB93/2011 was held in abeyance until STB78/2011 was decided. After the decision in STB78/2011, MH Singapore withdrew STB93/2011. (b) Secondly, on 21 June 2012, various SPs in the Plaintiffs’ Camp applied to the STB in STB50/2012 to invalidate the appointment of Dr Mok as Chairman on 5 August 2011 as well as the election of the members of the Council at the Mok Meeting. By consent, the hearing of STB50/2012 was held in abeyance until STB78/2011 was decided. After the decision in STB78/2011, the applicant-SPs withdrew STB50/2012.",
        "The 28th AGM in 2012": "47The 28th AGM was held on 26 November 2012. None of the SPs in the Plaintiffs’ Camp attended this meeting, which proceeded with only the SPs in the Mok Camp present. The meeting adopted the financial statements of MCST 1024 for FY2012, as well as the interim financial report for the period from 1 July 2012 to 31 July 2012.74Foot Note 74×1AB136; 2AB1214 48On 23 April 2013,75Foot Note 75×2AB1196various SPs in the Plaintiffs’ Camp requisitioned an EGM to pass,inter alia,the following motions, which were subsequently ruled out of order by Dr Mok, who chaired the EGM when it was eventually held on 5 June 2013:76Foot Note 76×2AB1200–1238 (a) Motion 1: that two matters be determined by a general meeting of the SPs: (i) the “appointment of legal representatives” to defend MCST 1024 in this Suit; and (ii) the “appointment of any contractors or consultants or professional which costs or fees exceed $500 in total”. (b) Motion 3: to revoke various resolutions “passed at the 26th and/or 27th [AGMs]”: (i) the “ratification of the Upgrading Work Expenses of about S$530,000 or any other sum”, and (ii) the “adoption of all Financial Reports ended 30 June in years 2009, 2010, 2011 and 2012 and the interim Financial Report from 1 July 2012 to 31 July 2012”. (c) Motion 8: to direct MCST 1024 to refund late payment interest charges to various SPs in the Plaintiffs’ Camp. (d) Motion 9: to direct MCST 1024 to approve an application for the subdivision of lots by certain SPs. (e) Motion 10: to direct MCST 1024 to take action against the Defendant for “unauthorized use of the management and sinking funds to for Upgrading Expenses … and failing to declare his interest in [MH Asia]”. 49On 26 June 2013, the first to fifth plaintiffs (to this Suit) applied to the High Court in OS569/2013 to invalidate the decisions made by Dr Mok at the 5 June 2013 EGM. Chan Seng Onn J broadly upheld the rulings made by Dr Mok, and directed that the applicant-SPs were not totable any amendments to Motion 1 that touched on the legal representatives already appointed by MCST 1024 to defend itself in this Suit(seeFu Loong Lithographer Pte Ltd and others vMok Wai Hoe and another[2014] 1 SLR 218 (“Fu Loong (HC)”) at [70]). 50On appeal, the Court of Appeal allowed the appeal in part, and made the following decisions with respect to the motions that had been declared by Dr Mok to be out of order at the 5 June 2013 EGM (seeFu Loong Lithographer Pte Ltd and others vMok Wai Hoe and another and another matter[2014] 3 SLR 456 (“Fu Loong (CA)”) at [68]): (a) Dr Mok was wrong to rule out of order Motions 8 and 9, and his rulings were accordingly invalidated; (b) The High Court erred in its direction in respect of Motion 1, and this direction was accordingly set aside; (c) The High Court correctly affirmed the ruling by Dr Mok of Motion 3 out of order. However, its statements that “there wasnoresolution to ratify any previous upgrading work expenses passed during the 27th AGM” [emphasis in original] (seeFu Loong (HC)at [46]) and “the approval and adoption of audited accounts has nothing to do with whether individual expenditure items in the accounts were authorised” (seeFu Loong (HC)at [52]) had to be clarified as follows (at [42]): Whether or not a ratification of audited financial reports or audited accounts amounts to a ratification of the individual expenditure items in those reports or accounts depends on the facts and circumstances of the particular case and cannot be reduced to a blanket proposition of law.It therefore remains open to the trial judge in Suit 311/2012[ie, this Suit] to make a findingon this issue, if necessary, based on the relevant evidence and arguments in that case. [Emphasis added] 51Against this fractious background, I turn to the issues before me in this Suit.",
        "Proper plaintiff": "52I deal first with the preliminary issue of whether the Plaintiffs are the proper plaintiffs to bring this Suit against the Defendant. The Plaintiffs commenced this Suit on 17 April 2012, seeking declarations that the Defendant had breached a number of his duties to MCST 1024 as well as an account of sums that the Defendant had improperly caused MCST 1024 to incur (see [7] above). I note that, at a pre-trial conference (“PTC”) before Assistant Registrar Yeong Zee Kin on 18 April 2013, the Defendant objected to the Plaintiffs’ prosecution of this Suit on the grounds that MCST 1024 was the proper plaintiff to prosecute this Suit, and that the Plaintiffs were not entitled to seek reliefs on its behalf.77Foot Note 77×PTC Minute of AR Yeong Zee Kin 18/4/13However, the Defendant did not take out any application to strike out or dismiss this Suit on that ground. 53Probably in an effort to meet this problem, the Plaintiffs and several other SPs in the Plaintiffs’ Camp then requisitioned an EGM, which was eventually held on 5 June 2013 (see [48] above), to passinter aliaMotion 10 that reads:78Foot Note 78×2AB1199 That the MCST be authorised to commence legal action against [the Defendant] forunauthorizeduse of the management and sinking fundsto[sic]for Upgrading Expenses for Works done at Blocks 51 and 53 since June 2008 andfailing to declare his interest in MunHean Asia Pte Ltd. [Emphasis added] 54The 5 June 2013EGM was chaired by Dr Mok, who ruled Motion 10 out of order. Dr Mok explained that the accounts of the works had been ratified at the 26th and 27th AGMs, which were in turn upheld by the STB as valid and proper. There was thus no basis for MCST 1024 to commence legal proceedings in respect of the works.79Foot Note 79×2AB1237 55In OS569/2013 (see [49] above), the Plaintiffs had applied to invalidate,inter alia,DrMok’s ruling of Motion 10 “out of order”. Before the High Court, however, the Plaintiffs did not proceed with their application to invalidate Motion 10 (seeFu Loong (HC)at [4]).The reason for this is not apparent in the judgment and no convincing reason therefor was given (see [87] below). 56The Plaintiffs now submit that O 18 r 8 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) requires the Defendant to specifically plead his objection to theirlocusstandito prosecute this Suit. Since the Defendant did not do so, he stands bound by his pleadings.80Foot Note 80×PRS at [6]–[10]The Plaintiffs add that, in any event, they are entitled to bring this Suit against the Defendant for two reasons: (a)Since all common property (as well as the funds in the management and sinking fund) in MCST 1024 is owned by every SP as tenants-in-common in undivided shares, the Plaintiffs as “aggrieved SP[s] should be able to pursue a remedy in their own name” against the Defendant in his personal capacity.81Foot Note 81×PRS at [19]In support of this, the Plaintiffs provide the following illustration: For example, if [the Defendant] invested the MCST’s Sinking Funds on land in Iskandar, Malaysia, without the approval of the general body, any aggrieved SP can bring him to task. It does not matter what percentage of share value that SPs owns. (b)Alternatively, and drawing from company law, because MCST 1024 is controlled by the Defendant through the Mok Camp and will not take any action against him, the Plaintiffs are entitled to bring this Suit as a derivative action on behalf of MCST 1024 against the Defendant.82Foot Note 82×PRS at [29] 57The Defendant submits that the reliefs claimed by the Plaintiffs are only in respect of his role as Chairman and do not concern the Plaintiffs personally.83Foot Note 83×DCS at [31]The correct course for the Plaintiffs to take would be to seek support for a resolution at a general meeting directing MCST 1024 to pursue an action against him.84Foot Note 84×DCS at [37] 58I am surprised that no application was taken to dismiss or strike out this Suit on the basis that the Plaintiffs are not the correct parties to bring this action. It also seems to me that there are some issues, including this preliminary objection, in this Suit that are bound up with issues brought in the other proceedings to which I have referred above, or brought up but abandoned in those other proceedings. In these circumstances, I also note that there is no application to dismiss this action on the basis of an abuse of process under the rule inHenderson v Henderson[1843–60] All ER Rep 378 (“Henderson”), which has been described as part of the “extended” doctrine ofres judicata(seeGoh Nellie v Goh LianTeck and others[2007] 1 SLR(R) 453 at [41] and [51]). These observations of Court of Appeal inKhoJabing v Public Prosecutor[2016] 3 SLR 1259 at [3] are apposite: It is an abuse of the process of the court for a person to file an application containing a particular argument, withdraw the argument sometime before the hearing, and then – after his first application is dismissed – file a fresh application premised on the argument which had been withdrawn. If this were allowed, applicants would prolong mattersad infinitumby drip-feeding their arguments one by one through the filing of multiple applications. 59I have notedthat the issue ofthe Plaintiffs’locusstandito prosecute this Suit was raised as early as the PTC on 18 April 2013 (see [52] above). The Plaintiffs attempted to remedy any such criticism just five days after the PTC by requisitioning the 5 June 2013 EGM to pass Motion 10.85Foot Note 85×2AB1196Dr Mok ruled, probably incorrectly, that Motion 10 was “out of order”. For some strange reason, the Plaintiffs chose not to proceed with their challenge to this ruling before the learned judge in OS569/2013, although in those proceedings they included it as one of the rulings they wished to impugn. As noted, the Defendant has not taken out any application to dismiss or strike out this Suit on this basis that the Plaintiffs are not the correct parties to sue. 60I therefore have to deal with this preliminary objection within this rather curious state of affairs. O 18 r 11 of the Rules of Court provides that a partymayby his pleading raise any point of law.Independent Automatic Sales, Ltd v Knowles & Foster[1962] 3 All ER 27 andHo Weng Leong v Ng Kee Chin[1996] 5 MLJ 139 stand for the proposition that a party may nevertheless raise a point of law even if it is not pleaded. However subsequent cases have made clear that that proposition is one where it involves a pure question of law, or a simple point of law, and no embarrassment is caused to the other party by raising it at the last minute. What is clear is that, at the very least, even if it involves a pure point or simple point of law, all the facts to enable that point of law to arise must be pleaded. 61A point of law that is one of mixed law and fact must be pleaded (seeBok Chee Seng Construction Pte Ltd v Development Bank of Singapore Ltd[2002] 1 SLR(R) 291(“Bok Chee Seng Construction”)at [38]), but only insofar as to the material facts in support of the legal principle and not the legal result (seeMK (Project Management) Ltd v Baker Marine Energy Pte Ltd[1994] 3 SLR(R) 823at [26]). However, in today’s context, I venture to say the pleader must be careful to assess whether, and in most cases I think it would be desirable, to at least succinctly state the principle of law involved. This would prevent the opposing party from being taken unawares but more importantly, allow it to bring relevant facts in response to that point of law. Thus inBok Chee Seng Constructionat [38], Judith Prakash J (as she then was) refused to allow a bank to rely on the rule inThe Royal British Bank vTurquand(1856) 6 El &Bl 327 as an alternative defence. Her Honour held that because this defence had not been pleaded, the opposing party did not have the opportunity to plead and lead evidence that could or would have disentitled the bank from relying on the defence. The relevant cases and propositions are well set out inSingapore Civil Procedure2017vol 1 (Foo Chee Hock JC gen ed) (Sweet & Maxwell, 2017) at para 18/11/1. One should never lose sight of the golden rule of pleadings,viz,that the function of pleadings is to let the opposing party know the case brought against them or the defences raised in answer to their case. This prevents the party from being taken by surprise at trial and having no opportunity to bring in relevant evidence in response. Justice, fair dealing, and the efficient administration of justice requires scrupulous observation of this principle. 62First, as I shall discuss below, whether the Plaintiffs are the correct party to bring this action is a mixed question of law and fact. It involves the true construction of the BMSMA, the true legal nature of a Management Corporation, whether the concept of a derivative action is applicable to MCSTs and if so, whether the facts of this case enable these Plaintiffs to bring such an action on behalf MCST 1024. Secondly, although not directly pleaded, underlying this deep-running dispute between the Plaintiffs and the Defendant are issues such as who is in the Council of MCST 1024, the powers and duties of a Council member, who represents MCST 1024, the decisions of MCST 1024 and what powers it has, which group of SPs was entitled to represent MCST 1024, whether the decisions made by each group of SPs were valid. The many proceedings before the STB and the courts more than bear this out. The facts surrounding these issues have all in one way or another been put into evidence, particularly by the references made in this Suit to the records of the other proceedings. The witnesses were also cross-examined on the events in those other proceedings. Thirdly and most importantly, no one has claimed or can claim to have been caught by surprise or embarrassed by unexpected evidence that surfaced only at trial. Equally, no one has claimed to have been prejudiced thereby. 63In both the Plaintiffs’ and Defendant’s Lead Counsel Statements submitted before the commencement of the trial, the first three Agreed Legal Issues were stated to be: (a) Whether the Plaintiffs may commence this action on behalf of MCST 1024; (b) Whether the remedies sought are for the benefit of MCST 1024; and (c) Whether MCST 1024 authorised this action. 64In these Lead Counsel Statements, the Non-Agreed Factual and Legal Issues were listed as including: (a) By the Plaintiffs: (i) Whether the Defendant has control of the Council of MCST 1024 to prevent an action being brought against him for any wrongdoing by the SPs; and (ii) Whether the exception to the “proper plaintiff” rule applies in this action; (b) By the Defendant: (i) Whether MCST 1024 has authorised the Plaintiffs to commence this action to seek reliefs on its behalf; (ii) Whether the BMSMA permits such an action to be brought by the Plaintiffs, and, if so, the requirements to bring such an action; (iii) Whether a common law derivative action is available to the SPs in a development, and, if so, the principles governing the common law derivative action and the requirements to mount such an action; and (iv) Whether the Plaintiffs have fulfilled the requirements for bringing a common law derivative action. 65Counsel for the Defendant, Mr Lee Poon Khoon Edwin (“Mr Lee”), prefaced the relevant part of his cross-examination of Sarah Tham by informing her that he was going to ask her questions as to whether the Plaintiffs have correctly brought proceedings against the Defendant and whether they were the proper parties to bring these proceedings against the Defendant who was chairman of MCST 1024.86Foot Note 86×Notes of Evidence 6 February 2014 at p 57.The transcript goes on for some ten pages where Mr Lee asked Sarah Tham questions as to whether MCST 1024 had authorised these proceedings, whether the Plaintiffs’ Camp could have, given their majority in share value, passed a resolution to direct MCST 1024 to take action against the Defendant, whether the Plaintiffs’ Camp tried to circumvent the need to hold a general meeting to vote on taking action against the Defendant by commencing this suit themselves and why they had abandoned their claim to invalidate Dr Mok’s ruling their Motion 10 (which was to direct MSCT 1024 to take action against the Defendant) out of order and the events before Chan J and the Court of Appeal in OS569/2013. 66Mr Leo never objected to these questions as being irrelevant on the pleaded defence. In the event, whether pleaded or not, this was a very live issue before me and it was treated as such by the parties. Significantly, in the simultaneous closing submissions, the Plaintiffs ended with six paragraphs under the heading “Plaintiffs’ right to seek restitution for MCST” before their “Conclusion”.87Foot Note 87×PCS at [174]–-[179]They did not contend that this was not a pleaded issue. In their closing submissions, the Defendant set out at para 29(a) the question whether the Plaintiffs were entitled to maintain this action against him and claim for reliefs on behalf of MCST 1024 as one of the issues before me. It was only in the Plaintiff’s reply closing submissions that they contend that this was not a pleaded issue.88Foot Note 88×PRS at [10] 67I will accordinglyexceptionallydeal with this preliminary objection as it was one of the issues contested by the parties before me and because no party will be prejudiced by my doing so. This would have been an exceptional case where if the Defendant had applied to amend his Defence at the close of his case, I would have given leave to do so and no one would have been prejudiced by this.",
        "Personal claim by the Plaintiffs directly": "68The Plaintiffs’ submission is that this Suit is a personal action that they are bringing in their own names against the Defendant. In their pleadings and evidence, the Plaintiffs maintained that they are bringing this Suit on behalf of and for the benefit of MCST 1024. The following reliefs are claimed by the Plaintiffs in their SOC:89Foot Note 89×SOC at pp 16–17 (1) A declaration that the Defendant had breached his duties as Chairman of MCST 1024; (2)  A declaration that the Defendant had acted outside his authority by deciding on the upgrading works and undertaking the upgrading works at Mun Hean Building without the approval of the general body or of the Council; (3)  A declaration that the upgrading works at Mun Hean Building are unauthorized; (4)  An order that the Defendantmakes restitution toMCST 1024orpays toMCST 1024the sum used or permitted to be used by the Defendant without authority to carry out the said upgrading works at Mun Hean Building; (5) Alternatively, an account of all expenses improperly incurred and thereafter an order forpaymentby the Defendant to MCST 1024ofall moneys found to be improperly incurred on the taking of such account. (6)  A declaration that the Defendant, while he was Chairman of MCST 1024, did not at act honestly with regard to the unilateral appointment of Mun Hean Asia Pte Ltd as managing agent of MCST 1024 and unauthorized payment of S$8,000.00 to the purported Managing Agent, Mun Hean Asia Pte Ltd. … [Emphasis added] 69At trial, the Plaintiffs took the position that they are seeking remediesexclusivelyfor the benefit ofMCST 1024. This was even after Mr Lee had expressly highlighted to Sarah Tham that he was about to questions thelocusstandiofthe Plaintiffs to bring this Suit against the Defendant:90Foot Note 90×Notes of Evidence 6 February 2014 at p 57 Mr Lee I am now going to ask some questions relating to whether you have correctly brought these proceedings against the defendant; okay? Whether you are the proper party to bring these proceedings against the defendant who was the chairman of the MCST. Ms Tham, everything that you have asked for in these proceedings that you want the court to order is for the benefit of the Management Corporation, right? Sarah Tham Yes. 70Sarah Tham agreed further that the order sought by the Plaintiffs “is that the defendant pay back monies to the MCST”, and that the “plaintiffs do not benefit from any claim”.91Foot Note 91×Notes of Evidence 12 February 2014 at p 63 71Similarly, CY Lim simply “hope[d] the court can consider making an order that the cost incurred by the MCST should be paid by the defendant”.92Foot Note 92×Notes of Evidence 18 February 2014 at p 29CY Lim added unequivocally that he “[did] not wish this court to consider [Motion] 10 in this suit”.93Foot Note 93×Notes of Evidence 18 February 2014 at p 30 72That said, KL Tan when cross-examined disagreed that “a lawsuit about unauthorised use of MCST expenses should be brought by the MCST”,94Foot Note 94×Notes of Evidence 8 July 2015 at p 50and took the position that “our suit [ie, this Suit] is from subsidiary proprietor”rather than MCST 1024.95Foot Note 95×Notes of Evidence 8 July 2015 at p 50However, KL Tan gave this evidence solelyquafirst third party to these proceedings and not on behalf of the second plaintiff. Having chosen not to call KL Tan as their witness, the evidence adduced on behalf of the Plaintiffs is limited to the evidence of Sarah Tham and CY Lim. 73I also note that the Plaintiffs in their closing submissions maintain that they have the “right to seek restitutionfor MCST”[emphasis added].96Foot Note 96×PCS at [174]–[179]I am therefore unable to accept the Plaintiffs’ submission that they are bringing this Suit in their own names against the Defendant in his personal capacity. 74A management corporation of a strata plan is a legal entity separate from the SPs of the lots comprised in the strata plan (seeYap Sing Lee v Management Corporation Strata Title Plan No 1267[2011] 2 SLR 998at [26]). This is clearly spelt out in s 24(1)(b)of the BMSMA, which provides: Constitution of management corporation 24.—(1)The management corporation constituted by virtue of the Land Titles (Strata) Act (Cap. 158) in respect of a strata title plan shall — … (b)be a body corporate capable of suing and being sued and having perpetual succession and a common seal; and 75The Plaintiffs accept the principle of a separate legal personality of MCST 1024, but contend that “the interests of subsidiary proprietors are so intimately related to those of the management corporation that there is no real distinction between the two”.97Foot Note 97×PRS at [12]While I do not think that the separate legal entity of a management corporation is illusory, there is some force in the argument that the legal personality of a management corporation is weaker, or at least somewhat different, from that of a company. As observed in Rachel PS Leow, “The legal personality of management corporations in strata title developments in Singapore” (2012) 1 Conv 75 at 77, a management corporation is comprised of its SPs collectively, has a flow-through liability structure, is subject to limited agency in the case of structural defects, and is empowered to represent its SPs in legal proceedings (see s 85(1) of the BMSMA andNgEng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte Ltd, intervener)and another appeal[2009] 3 SLR(R) 109). 76For present purposes, it suffices that there exists at a minimum a distinction between breaches of duty owed to or wrongs perpetuated on a management corporation on the one hand, and wrongs done to an individual SP in his personal capacity on the other.Prima facie,claims in respect of the former are to be prosecuted by the management corporation itself, while claims in respect of the latter may be pursued by the individual SPs concerned. InFu Loong (HC)at [31],the High Court held that the Plaintiffs were entitled to pursue the personal action of OS569/2013 against Dr Mok because they were simply challenging rulings that affect them personally: [T]he Plaintiffs were not suing the [Dr Mok] for damages or an account of profits resulting from a breach of duty. Nor were they suing [Dr Mok] for wrongs allegedly done to the MC. Rather, they were seeking to invalidate [Dr Mok’s] rulings to the effect that certain motions submitted by them were ‘out of order’ and that they were not allowed to vote on Motion 2 because of a conflict of interest.These were rulings that affected them personally. [Emphasis added] These findings were not disturbed by the Court of Appeal inFu Loong (CA)and with respect, I agree. 77Unlike OS569/2013, this Suit involves claims by the Plaintiffs against the Defendant for damages or an account of profits resulting from a breach of duty to MCST 1024 (see [68] above). Such claims are properly within the remit of MCST 1024, and not the Plaintiffs, to prosecute. The very concept of a separate legal entity necessarily limits when others, even when it is its members, can bring actions on its behalf as opposed to that separate legal entity bringing its own action. Were the Plaintiffs allowed to pursue a personal action against the Defendant, the risk of double recovery – by both the Plaintiffs and MCST 1024 – in respect of his alleged breach of duty would be very real. It was put to KL Tan in cross-examination that if Motion 10 had been passed, the Defendant could have faced separate lawsuits by MCST 1024 and the Plaintiffs in respect of the same alleged breach of duty. KL Tan did not dispute the concern, and asserted only that “[w]e may withdraw our suit.”98Foot Note 98×Notes of Evidence 8 July 2015 at p 50 78Accordingly, I do not accept the Plaintiffs’ submission that they are bringing this Suit in their personal capacities rather than on behalf of MCST 1024.",
        "Derivative claim on behalf of MCST 1024": "79I turn now to the Plaintiffs’ alternative submission that they are bringing this Suit as a derivative action against the Defendant on behalf of MCST 1024. 80The Plaintiffs submitted that they were entitled to bring a derivative action against the Defendant on behalf of MCST 1024 “because the MCST, controlled by [the Defendant] through the Mok Camp, would not take any action against him”.99Foot Note 99×PRS at [29]The Plaintiff relied on principles analogous to those creating an exception to the rule that a company (rather than any of its members), as a separate legal entity, is the proper plaintiff for prosecuting claims to vindicate wrongs perpetuated on it. Their submission rests on a rationale that the Privy Council explained inBurlandand others v Earle and others[1902] 1 AC 83at 93 as follows: [W]here the persons against whom the relief is sought themselves hold andcontrol the majority of the sharesin the company, and will not permit an action to be brought in the name of the company … the Courts allow the shareholders complaining to bring an action in their own names. This, however, is mere matter of procedure in order togive a remedy for a wrong whichwould otherwise escape redress. [Emphasis added] 81The management corporation is a creature of statute. It may share some attributes of a corporation but it is important to bear in mind it stands outside company law and the Companies Act (Cap 50, 2006 Rev Ed) (the “Companies Act”). The fact is that there is no statutory provision in Singapore for an SP to bring a derivative action in the name and on behalf of a management corporation. Neither, it appears, has the question of whether an SP can bring such a derivative action at common law arisen been considered in any reported decision in the Singapore courts. Such common law derivative actions have been recognised by the courts of the Australian state of New South Wales, from which Singapore adopted its strata title scheme (seeeg,EastmarkHoldings Pty Ltd v Kabraji[2013] NSWSC 1763;Carrev Owners Corporation – SP 53020[2003] NSWSC 397;Houghton andAnor v Immer (No 155) Pty Ltd[1997] NSWSC 608). 82Tan Sook Yeeet al,TanSook Yee’s Principles of Singapore Land Law, (LexisNexis, 3rd Ed, 2009) at para 22.76 suggests that a common law derivative action could apply to strata developments in Singapore: There is also the possibility of the doctrine of fraud on the minority applying in relation to strata developments. Although this doctrine is generally applied in relation to company law, there does not seem to be any reason why it could not be equally applicable to strata developments. … It is suggested that the concept of fraud on the minority could apply to strata developments in Singapore. 83I agree, and can envisage that in some circumstances and appropriate cases, especially (but not limited to) where several SPs control the Council and the management corporation and are abusing their position as such, other SPs might never be able to pass a resolution for the management corporation to commence actions against wrongdoers who are in control. I note also that Mr Lee did not dispute the potential applicability of the doctrine of fraud on the minority and/or the common law derivative action in strata developments in an appropriate case. 84Accordingly, I see no reason why an SP cannot, in appropriate circumstances, bring a common law derivative action in the name and on behalf of a management corporation. That said, whether an SPshouldbe allowedto do so must depend on the particular facts and circumstances of each case and what the alleged wrongs are. Whether fraud on the minority is the only ground or whether acts akin to “oppression” in the context of the Companies Act are appropriate circumstances in which a derivative action can be brought in a strata scheme must be left to another case where this issue is properly raised and argued. It suffices to say for present purposes that even if “wrongs” have been committed by the SPs comprising the council of an MCST, the basis of any complainant must be its inability to get a resolution passed to commence actions against the Council members of the management corporation. 85Sarah Tham conceded that MCST 1024 had not authorised the Plaintiffs to bring this Suit on its behalf, and agreed that the Plaintiffs “could have raised a resolution before [a] general meeting to pursue any action against the chairman”.100Foot Note 100×Notes of Evidence 6 February 2014 at p 59She accepted further that the Plaintiffs had chosen to pursue this Suit without the authorisation of a general meeting.101Foot Note 101×Notes of Evidence 6 February 2014 at p 60 86Both Sarah Tham102Foot Note 102×Notes of Evidence 6 February 2014 at p 64and CY Lim accepted that the Plaintiffs had attempted, albeit unsuccessfully, to procure MCST 1024 to pursue legal proceedings against the Defendant. This was done by tabling Motion 10 at the 5 June 2013 EGM, and by applying to the High Court in OS569/2013 to invalidate Dr Mok’s ruling of Motion 10 as being “out of order”. Before Chan J in OS569/2013, however, the Plaintiffs elected not to proceed with their challenge to Dr Mok’s ruling on Motion 10 (Fu Loong (HC)at[4]). As mentioned above at [71], CY Lim stated that he “[did] not wish this court to consider [Motion] 10 in this Suit”.103Foot Note 103×Notes of Evidence 18 February 2014 at p 30 87Under cross-examination, Sarah Tham did not really answer Mr Lee’s questions as to why she did not proceed with her challenge to Dr Mok’s overruling of Motion 10 before Chan J in OS569/2013. In re-examination, despite the valiant attempts of Mr Leo to guide Sarah Tham through leading questions, the answers given by her made little sense as to why she did not proceed with the challenge to Dr Mok’s ruling on Motion 10 in OS569/2013:104Foot Note 104×12/2 pp 67–68 Mr Leo Why did you withdraw this [ie, Motion 10]? Sarah Tham I withdraw this because in the EGM, the Dr Mok Wai Hoe, before put it for voting, he ruled it out of order already. So means that even I repeat again, he will do the same thing and the case is there already with us – the case is in the – S311 is there already and give of us is suing the defendant. So that is the reason we withdraw. Mr Leo If I can paraphrase you, I'm not sure whether I got it correctly. You are saying that suit 311 already is in place, therefore there is no need to have motion 10. Is that what you are saying? Sarah Tham Especially when -- Mr Leo No. Is that what you are saying, yes? Sarah Tham Yes. Mr Leo Now you can explain why. Do you want to elaborate further? Sarah Tham Okay. Because in the EGM, this motion never put to vote. Dr Mok just ruled it out of order and say that we are not allowed to vote at all. A rather crestfallen Mr Leo wisely decided to move on. Her answer makes little sense because this Suit was originally commenced as OS283/2012 on 16 March 2012 and converted to a Writ action on 17 April 2012. The Statement of Claim was filed on 8 May 2012, and amendments thereto were re-filed on 11 October 2013. The Defendant’s objection to the Plaintiffs’locusstandito sue on behalfof MCST 1024 was raised before AR Yeong on 18 April 2013. The requisition for the EGM was filed on 23 April 2013 and the EGM was held on 5 June 2013 when Dr Mok ruled these Motions out of order. The Plaintiffs filed OS569/2013 on 26 June 2013, and the hearing took place on 15 August 2013 (with judgment being handed down on 28 October 2013). If what she says is true, then there was no reasonnotto ask for Motion 10 to be declared invalid in OS569/2013. In fact, with objections having been raised, it was all the more important to have Motion 10 invalidated so that an EGM could be held to legitimise these proceedings. Further, Sarah Tham’s answer does not explain why she nonetheless proceeded to ask for other resolutions that had also been ruled out of order by Dr Mok at that EGM to be declared invalid before Chan J in OS569/2013 but not Motion 10. 88It was put to Sarah Tham that the Plaintiffs’ Camp, which comprises all SPs other than those in the Mok Camp,105Foot Note 105×Notes of Evidence 6 February 2014 at p 59had the requisite majority in share value to pass a resolution directing MCST 1024 to pursue an action against the Defendant. Sarah Tham did not disagree, and attempted only to explain that the Plaintiffs had decided to pursue this Suit without the authorisation of a general meeting because of the events at the 27th AGM, in relation to which the Mok Meeting was eventually recognised as the legitimate meeting (see [44] above). There is also no evidence that any such resolution was proposed at the Plaintiffs’ Meeting for the purpose of the 27th AGM that was, in any case, ruled by the STB not to be the valid AGM. 89Having elected to forgo the alternative remedy of challenging (in OS569/2013) Dr Mok’s invalidation of Motion 10, which would, if successful, have paved the way for a general meeting of MCST 1024 to authorise the launching of proceedings against the Defendant, it is not open to the Plaintiffs to achieve the same result by bringing a derivative action on similar grounds in the name and on behalf of MCST 1024 against the Defendant. Allowing the Plaintiffs to now maintain a derivative action in the name and on behalf of MCST 1024 against the Defendant in the circumstances set out above would be entirely wrong. To her credit, Sarah Tham accepted that the invalidation of Motion 10 remains “stillvalidly made by DrMok” [emphasis added].106Foot Note 106×6/2 p 67 90Finally, it is telling that despite the allegation by the Plaintiffs (ie, thesecond and fourth plaintiffs) of a wrong perpetrated onallthe SPs, noother SP, not even one other from the Plaintiffs’ Camp, is proceeding to seek some redress. On the contrary, the first, third, and fifth plaintiffs discontinued their actionswith costsandwithout liberty to commencefresh proceedings on the Plaintiffs’ pleaded cases(see [10] above). Together, the first, third, and fifth plaintiffs account for 29% of the share value of MCST 1024, while the second and fourth plaintiffs possess a total of only 11% of the share value of MCST 1024.107Foot Note 107×Plaintiffs’ Opening Statement at [1]On any account, the first, third, and fifth plaintiffs are SPs aligned with the second and fourth plaintiffs, but it is the latter who alone continue to pursue this Suit. 91Accordingly, I find and hold that the Plaintiffs have not established their entitlement to maintain a derivative action on the facts and in the circumstances of this case. Nevertheless, in the event that I am wrong in these conclusions, I consider the factual issues which consumed much trial time and involved experts below.",
        "Annex A Works": "92The Plaintiffs allege that the 62 items of works that comprise the Annex A Works were unauthorised: (a) First, the works go beyond mere repair and maintenance that were within the authority of MCST 1024 to undertake, and were upgrades of the common property that required the approval of a special resolution of the SPs in general meeting. (b) Secondly, the body of SPs was unaware of the Annex A Works until they been undertaken, and did not authorise the Annex A Works at any general meeting or through the Council. (c) Thirdly, works on the Development involving major expenditure were always raised for discussion and not proceeded with until approval for them had been obtained. (d) Finally, the Annex A Works were not ratified by the body of SPs, and remain unauthorised today. 93The Defendant contends as follows: (a) First, the Annex A Works were not upgrading works but repairs and maintenance, and MCST 1024 had not only the power but also the duty to undertake them. (b) Secondly, the Annex A Works were approved by the SPs and the Council, having been undertaken in accordance with the past practices of MCST 1024 and its Council; in particular, the Annex A Works had been raised for discussions and not been objected to in general meetings and Council meetings. (c) Thirdly, no special resolution was needed to undertake the works, even if they went beyond mere repair and maintenance and amounted to upgrades to the Development. (d) In any event, the Annex A Works have been ratified at the 27th AGM on 6 September 2011.",
        "Repair and Maintenance works vs Upgrading works": "94The management corporation is the statutorily created legal entity through which its members, the SPs, manage and make decisions in relation to a strata development. It is responsible for maintaining and managing the common property in the development, out of the moneys contributed by the SPs (Teo Keang Sood,Strata Title in Singapore and Malaysia(LexisNexis, 5th Ed, 2015) (“Strata Title”) at para 1.35). These duties are provided for in s 29(1) of the BMSMA: Duties and powers of management corporation in respect ofproperty 29.—(1) Except as otherwise provided in subsection (3)[ie,curtailment of powers of management corporation upon creation of limited common property], it shall be the duty of a management corporation — (a)to control, manage and administer the common property for the benefit of all the subsidiary proprietors constituting the management corporation; (b)to properly maintain and keep in a state of good and serviceable repair (including, where reasonably necessary, renew or replace the whole or part thereof) — (i) the common property; (ii) any fixture or fitting (including any pipe, pole, wire, cable or duct) comprised in the common property or within any wall, floor or ceiling the centre of which forms a boundary of a lot, not being a fixture or fitting (including any pipe, pole, wire, cable or duct) that is used for the servicing or enjoyment of any lot exclusively … (d)when so directed by a special resolution, to install or provide additional facilities or make improvements to the common property for the benefit of the subsidiary proprietors constituting the management corporation … 95Accordingly, s 29(2) of the BMSMA empowers a management corporation to do all things reasonably necessary to discharge its duties under s 29(1) of the BMSMA: (2)  Except as otherwise provided in subsection (3), a management corporation may — … (b)do all things reasonably necessary for the performance of its duties under this Part and for the enforcement of the by-laws … 96A council of a management corporation consists of a small elected group of SPs whose principal function is the day-to-day management of the strata title scheme. It has been described as a group akin to the board of directors of a company (seeStrata Titleat para 9.01).But for the existence of the council, a general meeting of the SPs would have to be convened each time the management corporation needs to make a decision. 97Pursuant to s 58 of the BMSMA, the decisions of a council are the decisions of the management corporation. Nevertheless, the management corporation continues to be able exercise and perform its powers, duties, and functions in general meeting. Council’sdecisions to be decisions of management corporation 58.—(1)Subject to the provisions of this Act, the decision of a council on any matter, other than a restricted matter, shall be the decision of the management corporation. (2) Notwithstanding that a council holds office, the management corporation may in a general meeting continue to exercise or perform all or any of the powers, duties and functions conferred or imposed on the management corporation by this Act or the by-laws. … (4) In subsection (1), “restricted matter”, in relation to a council of a management corporation, means — (a)any matter a decision on which may, in accordance with any provision of this Act or the by-laws, only be made by the management corporation pursuant to a unanimous resolution,special resolution, 90% resolution, comprehensive resolution, resolution by consensus or in a general meeting of the management corporation, or only by the council at a meeting; and (b)any matter referred to in section 59 and specified in a resolution of that management corporation passed for the purposes of that section. [Emphasis added] 98The power of the Council to undertake works on the common property of the Development therefore rests on two bases: (a)pursuant to its duty to properly maintain and keep in a state of good and serviceable repair the common property and any fixture or fitting not used for the benefit of any SP exclusively (s 29(1)(b)of the BMSMA); and (b)pursuant to a special resolution at a general meeting of the SPs directing it to install or provide additional facilities or make improvements to the common property (s 29(1)(d)of the BMSMA). 99The parties, however, disagree over the operation of s 29(1)(b)and s 29(1)(d)of the BMSMA. 100The Plaintiffs submit that the general power to undertake repair and maintenance under s 29(1)(b)of the BMSMA extends only to remedying defects in the common property and restoring it to the condition that it was in at the time it was built. Works carried out to replace or improve an item of common property that remains functional are an improvement or upgrade of the common property that may be undertaken only when authorised by a special resolution under s 29(1)(d)of the BMSMA.108Foot Note 108×PCS at [101]–[103]The difference between the two provisions lies in the comparative functionality of the item of common property in question before and after the works. Mr Leo submits that repairs and maintenance under s 29(1)(b) of the BMSMAcontemplate only “like-for-like replacement: a single light-bulb light fitting cannot be replaced with a grand crystal chandelier”. Additions or alterations that go beyond this fall within s 29(1)(d) of the BMSMA and require a special resolution.109Foot Note 109×PRS at [53] and [54] 101The Defendant states in his closing submissions that “[a] special resolution is not necessary to carry out improvement works to the Development”.110Foot Note 110×DCS at Part F(e)Accordingly, the Council “can proceed with repair and maintenance works that may amount to improvement works without the need to call for an AGM”111Foot Note 111×DCS at [83]to pass a special resolution.112Foot Note 112×DCS at [86]–[87] This duty and power to ‘renew or replace’ [under s 29(1)(b)of the BMSMA] is not curtailed by Section 29(1)(d) of the BMSMA. Section 29(1)(d) of the BMSMA only deals with a situation when the MCSTis directedto make improvements to the common property. The focus, it is submitted, is on the fact that the MCST has a duty to make specific improvements when there is a special resolutiondirectingthe MCST to do so. The duty to ‘renew or replace’ the common property would necessarily result in an improvement to the common property. Such ‘improvement’ would be part and parcel of the usual duty of the MCST (and the Defendant as its Chairman). Such work does not require any special resolution or even an ordinary resolution because it is carried out as a duty of the council. [emphasis in underline in original] 102Neither party’s submission, which is both too broad in nature and extreme in position, is, with respect, helpful for a proper analysis of the problem. For example, there can be little argument over the analogy of replacing a bulb with a grand crystal chandelier, as Mr Leo contends. It would have been of much more utility and relevance if the argument and analysis centred on, for example: (a) the replacement of filament light bulbs with 20-year-old fittings, some of which have cracked and are difficult to source replacements for (or replacement of neon lighting), and replacement with more modern and commonly available energy saving bulbs and fittings; (b) the repair of a leaking pipe (or an age-cracked 20-year-old ceramic sink) which necessitates hacking up of tiles and where matching ceramic tiles of that size and colour are no longer available and the question arises whether all the tiles should be replaced; or (c) some switches are not working and current codes for electrical fittings no longer allow these 20-year-old switches to be used; modern replacements may require re-wiring of some areas and a replacement and re-wiring for all switches in the common property has been advised. Would these works be repair and maintenance or improvement for the purposes of the BMSMA? It would be useful to look to decisions in other jurisdictions with equivalent legislation. 103InProprietors of Strata Plan No 6522 vFurney and another[1976] 1 NSWLR 412 (“Furney”), a management corporation sought declarationson the extent of its powers of repair and maintenance under s 68(1)(b) of the then-New South Wales Strata Titles Act 1973 (“NSWSTA”), which corresponds to s 29(1)(b) of the BMSMA. Needham J held that the power and duty to perform “repairs” is wide enough to enable the undertaking of renewal and replacement of such parts of the common property as necessary to place the development in a state of good and serviceable repair. InFurney, this included adding draught resistors and waterproof flashings so as to make the common property weatherproof even when these works were omitted in the original building work (at 416): The fact that repair includes replacement and renewal is clearly established, for example, byGreg v.Planque([1936] 1 KB 669 at 677]), and inBurns v. National Coal Board([1957 SC 239 at 246]), Lord Patrick said: ‘It is true that the primary meaning of the word ‘repair’ is to restore to sound condition that which has previously been sound, but the word is also properly used in the sense of to make good. Moreover, the word is commonly used to describe the operation of making an article good or sound, irrespective of whether the article has been good or sound before.’ I think that that interpretation should be applied to the word ‘repair’ in s. 68, firstly, because it is the ordinary meaning of the word but, secondly, because, if the power to make good that which was not good before does not vest in the body corporate under the legislation, there is a gap in the legislation which would mean that nobody had power to perform that duty, no matter how necessary it might be in any particular case. 104This holding inFurneywas endorsed by the Singapore Court of Appeal inRSP Architects Planners & Engineers v Ocean Front Pte Ltd and another appeal[1995] 3 SLR(R) 653 at [73]: [T]he duty to maintain that property in a state of good repair … means not only maintaining it in a state which it was originally in, but also the state that it was supposed to be in. 105The notion that repair and maintenance includes renewal and replacement of the common property appliesa fortioriin Singaporegiven the statutory scheme of s 29(1)(b)read with 29(2)(b)of the BMSMA. Unlike s 68(1)(b) of the then-NSWSTA, s 29(1)(b)of the BMSMA expressly provides for a council to “renew or replace the whole or part thereof”, insofar as “reasonably necessary” to properly maintain and keep in a state of good and serviceable repair, the common property (seeStrata Titleat para 7.28). 106InStolfa v Hempton[2010] NSWCA 218, the New South Wales Court of Appeal considered the interaction between the general duty (and power) to repair and maintain the common property, and the obligation to make additions and improvements when so directed by a special resolution of the SPs.AllsopP (as he then was) held (at [10]): It was submitted that even though s 62 [of the Strata Schemes Management Act 1996 (NSW), which corresponds to s 29(1)(b)of the BMSMA] required repair and maintenance to be done, because the work in fact improved or enhanced the common property, a special resolution was required. The judge was correct to reject that submission. If, as a matter of fact, all the works satisfied the description in s 62 as repair and maintenance, they were not subject to any requirement of a special resolution in s 65A [corresponding to s 29(1)(d)of the BMSMA].The statute should not be construed so as to require the [management] corporation to act, but then to place a voting barrier in its path in complying with the statute. [Emphasis added] With respect, I entirely agree. 107InThe Owners Strata Plan 50276 vThoo[2013] NSWCA 270 (“Thoo”) at [5]–-[6],Barrett JAobserved that the specific obligation to make improvements and additions to the common property pursuant to a special resolution of the SPs under the New South Wales equivalent of s 29(1)(d) of the BMSMA does not curtail, but nevertheless shapes, the general duty to repair and maintain the common property. The touchstone of “replacement” is functional equivalence (seeThooat [4]), which necessitates a comparison of the end-product of the works with the attributes of the common property at some earlier reference point (seeThooat [6]): The question of what amounts to renewal, replacement, alteration or addition must be answered by a process of comparison with the position that prevailed at the earlier reference point. The first such reference point is the time at which the strata plan is registered and the common property comes into being. The initial attributes are fixed at that time; and it is from that base that characterisation as renewal, replacement, alteration or addition is to be approached. Once any addition or alteration is made in accordance with the Act, the attributes of the common property are changed, a new reference point is identified and future questions of renewal, replacement, alteration and addition fall to be assessed by reference to the changed state at that new reference point. 108In my view, these cases set out applicable guidance as to when a piece of work amounts to repair and maintenance and when it becomes an improvement. These judgments provide a good measure of common sense and practical considerations. They recognise that any enquiry into,eg, functional equivalence, will still be very fact sensitive. What amounts to repair and maintenance and what amounts to improvement depends on all the facts and circumstances of the case.What exactly amounts to “improvement” must be broadly interpreted as something more than just “old” for “new” or reasonable or unavoidable “betterment”. There must be an element of practicality. Any renewal or replacement will, by its very nature, involve improvement and betterment. Old will be superseded by new (seeThooat [7]). Prescriptive rules will often be of little utility as it cannot cover all the facts and circumstances that can arise. No one factor (eg, cost) or core of factors, is decisive. Replacement may also entail addition and the new or replacement item may now be different from the old. An example would be a change in drainage patterns in the broader vicinity and/or a change in long term weather patterns which necessitates installation of a sump pump in, for example, a basement or sunken areas for outdoor bathrooms, where none was necessary before. Another good example will be the replacement of 20-year-old electric bulbs and fittings or neon lights to the newer energy efficient lights which need transformers and perhaps reflective or special housing. These are undoubtedly newer; these are undoubtedly an improvement. They will initially cost a little more, but there will be a saving in its lower consumption and running costs. Few can argue that these cannot amount under any circumstances to “repair and maintenance”. Similarly, 20-year-old switches in common areas may no longer be allowed under current building and utility codes. Under s 29(1)(b)of the BMSMA, the question is that of thereasonable necessityfor the renewal or replacement. Building and safety codes change over time, and they have to be complied with. As stated inThooat [6], the initial attribute of the item does not necessarily stand still. A change in the building or safety codes can change that initial attribute. 109The need for a special resolution under s 29(1)(d)of the BMSMA arises only where the improvement or enhancement cannot be achieved under s 29(1)(b)of the BMSMA (seeThooat [126]),ie, works in the nature of “nice-to-have”, (a fortioriif it comes at a high cost),but not within the “must have” category. Even this distinction needs to be tempered with common-sense and practicality. A case in point is the burst sewer pipe that occurred here under the bathroom floor in Block 53. Few will argue that this is an emergency repair. But the old clay sewer pipes resting on haunching prevalent 20 years earlier, especially in an area where the nature of the subsoil is liable to settlement, will now have to be replaced with PVC piping and properly laid support, given the susceptibility to settlement. Can one sensibly argue that this is an improvement and needs a special resolution? Can one sensibly argue that the same 20-year-old floor tiles must be sourced and used or that only that part that was dug up to expose the sewer should be replaced with new tiles? It is unarguable (subject again to all the facts of the case and including, but not limited to, the cost and availability of tiles), especially where the toilets are not unduly large, that all the floor tiles should be changed and there is no need to have a special resolution to effect those repairs. Further, if that change of the sewer piping below the ground floor toilet necessitates corresponding changes to the stack of sewer piping to the connecting second, third and fourth floor toilets above, there can be little doubt that will fall within the phrase “repair and maintain”. On the other hand, if a concealed water pipe bursts and tiles have to be hacked to trace the breach, whether one replaces it with a pipe that is not concealed and whether those tiles or whole floors or walls have to be re-tiled can constitute borderline cases. At the other end, concrete spalling along corridors can be repaired without the need for laying tiles along the whole corridor or all the corridors for uniformity. The latter clearly requires a special resolution. 110Accordingly, works that are necessary to place the Development in a state of good repair may be authorised by either the Council or MCST 1024. Works that go beyond that, however, have to be authorised by a special resolution of the SPs in general meeting. That said, in assessing whether an item of work undertaken by the Council entails repair and maintenance, a measure of deference must also be accorded to the decisions of the Council, whose members are the elected representatives of the SPs that constitute the management corporation. Their decisions should not be interfered with unless they are clearly improper and/or unreasonable (seeLee Lay Ting Jane v MCST Plan No 3414[2015] SGSTB 5 at [60]). These principles will be applied to the items of work complained of by the Plaintiffs.",
        "Practice of MCST 1024": "111There was great dispute as to the practice of MCST 1024 on the undertaking of works to the Development, and as to whether the Annex A Works had to be approved by a special resolution of the SPs (as opposed to a decision by the Council pursuant to its duty and power to repair and maintain the common property). I now examine the disputed question of whether such a practice existed. Practice of the SPs in general meeting 112When a proposal to renew or replace common property is under consideration, it is quite possible that the views of a body of SPs will differ widely, even amongst those who are of the same view on the ultimate issue (Thooat [13]). The purpose of the strata title scheme of property management is to provide a mechanism for the resolution of such disagreement: the management corporation, which is empowered to take a decision on behalf of the SPs but in doing so must act in the interest of the SPs (seeChiaSok Kheng Kathleen v Management Corporation Strata Title Plan No 669[2004] 4 SLR(R) 27 at [34]). 113Andrew Ang J (as he then was) inSi-Hoe Kok Chun and another v RameshRamchandani[2006] 2 SLR(R) 59 (“Si-Hoe Kok Chun”)at [20] and [22] held that the SPs in a strata title scheme are entitled to adopt an informal manner of conducting the proceedings at their general meetings. They may choose to make decisions by consensus without the formality of taking a vote. Where relations between the SPs sour subsequently, these decisions remain valid and “should not be disturbed, least of all by a willing participant in the consensus” (seeSi-Hoe Kok Chunat [20]).Ang J explained his decision by reference to the position in company law, where the informal assent ofallmembers to some matter within the purview of a general meeting is as valid as a resolution properly passed. InJimatbin Awang and others v Lai Wee Ngen[1995] 3 SLR(R) 496at [22], the Court of Appeal stated: Generally, a company exercises any of its powers by means of resolutions in general meetings. It is also a well-entrenched common law principle that the unanimous and informal assent by all the members of a company in some other manner is as effective as a resolution passed at a general meeting, even if the assent is given at different times: seeParker and Cooper Limited v Reading[1926]Ch 975, and even if otherwise a special or extraordinary resolution is required: seeCane v Jones[1981] 1 All ER 533. 114It goes without saying that, as with informal decision making by the members of a company, the SPs choosing to make a decision without the formality of a vote must have full knowledge of what they are agreeing or deciding to do. InSi-Hoe Kok Chun, Ang J affirmed the STB’s dismissal of an application to invalidate the election toa council of the husband of an SP. Ang J emphasised that “the parties present [at the AGM] were aware that the [husband] was not a subsidiary proprietor but that he represented the wife” (at [25]). 115Relying on the evidence of the Defendant’s expert witness, Mr Harland, the Plaintiffs submitted that the “[t]he proper procedure for carrying out any upgrading or improvement work for a management corporation would be to plan it, budget for it, discuss it and obtain the requisite vote/approval by the general body then carry it through”.113Foot Note 113×PCS at [42]Mr Harland testified that “market practice [was] to get three quotations for major renovation work” and that the SPs should be “collectively” consulted over the replacement of assets.114Foot Note 114×Notes of Evidence 1 July 2015 at pp 68, 96However Mr Harland’s opinion did not reflect the practices that this MCST 1024 and Council adopted. Notwithstanding, I find the SPs of MCST 1024 are entitled to adopt, in any given instance, an informal way of managing the affairs of the Development and the works in relation to it. Whether a given set of works is authorised, albeit informally, must be assessed in the light of the circumstances that led to its undertaking. 116Sarah Tham admitted that the practice of MCST 1024 in relation to proposals to carry out works on the Development was simply that of laying the proposals before the SPs in general meeting. As long as no SPs objected, the works would be considered as having been authorised.115Foot Note 115×Notes of Evidence 7 February 2014 at p 14Further, a formal process of budgeting and calling for quotations was not a practice of MCST 1024. This was despite the fact that such a process had been undertaken at several AGMs.116Foot Note 116×Notes of Evidence 6 February 2014 at pp 108–109 Mr Lee: Some minutes do refer sometimes to the calling of quotations. But what we are saying is this is not a practice of the Management Corporation. …Do you accept that? Sarah Tham: As I say, if this is a general meeting and there is no objection from the general body whether they insist to have a three quotations or not, so this proposal should be considered as carried. 117KL Tan gave evidence that the past practice of MCST 1024 was informal. As long as a motion was raised for discussion at an AGM and no objection to it was taken, the motion would be considered as carried.117Foot Note 117×Notes of Evidence 2 July 2015 at p 57 Mr Lee: Mr Tan, isn't it correct that the past practice of the MCST has always been quite informal? KL Tan: It appears to be quite informal in the sense that when there is no objection in the AGM, motion is carried. And in most cases, before any work to be done, it has to be discussed at the AGM. 118KL Tan continued that it sufficed for an estimate of the costs of proposed works to be placed before a general meeting and where no objections to the estimate were taken, then, as long as the actual costs of the works did not exceed the estimate, the works were considered to have been authorised.118Foot Note 118×Notes of Evidence 2 July 2015 at p 57–58 Mr Lee: It is informal also because the AGM does not necessarily set a budget for expenses. KL Tan: I can't remember whether it was a budget or not, because all the budget was prepared by the managing agent. … Mr Lee: What you are saying is perhaps an estimate would be given, it would be raised at the AGM. KL Tan: Yes. For example, not more than $50,000, anything above -- less than $50,000 -- yes. Mr Lee: It is not put to a vote, but if there is no objection, it is considered approved. Correct? KL Tan: Yes. If there no objection, means nobody -- voting is not necessary, yes. 119CY Lim testified initially that all decisions taken at a general meeting had to be by way of a formal vote. However, he conceded that he attended general meetings infrequently and did not read the minutes. Although he had owned unit #03-03 at the Development since 1997, he had attended only “about two AGMs” until the 23rd AGM in 2007. CY Lim eventually clarified that “the matter has to be proposed and if there were no objections from the general body, then will be considered as approved”.119Foot Note 119×Notes of Evidence 13 February 2014 at pp 34, 36, 74 120Until the differences arose in 2008, the minutes of the earlier AGMs up to the 24th AGM also bear this out. I therefore find as a fact, as inSi-Hoe Kok Chun, the SPs of MCST 1024 were entitled to and did in fact adopt an informal manner of conducting the proceedings at their general meetings, including those concerning works to the development. They chose, at times, to make decisions by consensus without the formality of taking a vote. Insofar asallSPs at a general meeting had informally assented to a matter within its purview, the matter will be authorised as if a formal resolution had been passed. 121However such practices are not immutable and they can cease. This occurred here. The practice did not survive into the 25th AGM held on 5 October 2009 because, as noted above, disputes arose in the earlier part of 2009. I find that after 12 March 2009, when the SPs of units on the third and fourth floors of Block 53 commenced OS300/2009, the Council members and some, if not all, of the SPs became aware that disputes had arisen within their Development. There could have been no doubt about this after the decision in the Council meeting on 22 May 2009120Foot Note 120×1AB145to increase the monthly maintenance and sinking fund contributions and the call for two months’ advance was circulated. Between 8 to 11 June 2009 some SPs in the Plaintiffs’ Camp wrote to the Defendant questioning the works and stating that they would not be making the advance payments for the maintenance and sinking fund (see [29] above). It is noteworthy that all the SPs attended the 25th AGM on 5 October 2009121Foot Note 121×1AB97and 4 November 2009122Foot Note 122×1AB106because by this time disputes had erupted between the two camps. Practice of the Council 122Just as the SPs adopted an informal manner of decision-making, the Council, which comprised representatives from both the Plaintiffs’ Camp and the Mok Camp, also conducted its affairs and made decisions on behalf of MCST 1024 in an informal manner. Up until 2008/2009, no SP took issue with these practices of the Council. 123The Defendant deposed that the meetings of the Council were “informal and on anad hocbasis”. The members of the Council conducted discussions and made decisions by “the dissemination of notes or letters” between themselves. When they did meet face-to-face, their meetings were typically held at the office of the Defendant, and were usually not minuted.123Foot Note 123×DAEIC at [41]–[43] 124The Defendant added that the Council decided on all works to be done to the Development, and informed the SPs of its proposals at a general meeting or through the dissemination of written circulars. If no SP objected to the proposals, the Council would implement them.124Foot Note 124×DAEIC at [44]This was the process adopted in relation to five items of work: (a) Painting and washing works to Block 51 and Block 53 in 1995; (b) Waterproofing works to Block 53 in 2000; (c) Re-surfacing and replacing the driveways, culvert, drains, metal gates, car parks, and main incoming water-pipe in 2002 and 2003; (d) Replacing the main electrical switchboard in 2004 and 2005; and (e) Raising the driveway and culvert and the building of a boundary wall in 2007. 125KL Tan acknowledged this practice of the members of the Council deferring to the Defendantvis-à-visthe undertaking of works to the Development. This was at least the case between the 23rd AGM on 2 October 2007125Foot Note 125×1AB74and the 24th AGM on 9 October 2008,126Foot Note 126×1AB97when KL Tan was Treasurer. I set out his evidence in relation the upgrading works to the lobbies and toilets at the second and third floors of Block 51, which were preceded by various circulars on and after 30 November 2007 from the Defendant (quaChairman) to the SPs:127Foot Note 127×Notes of Evidence 2 July 2015 at pp 121–122 Mr Lee So after the [23rd] AGM on 2 October [2007], this notice on 20 November [2007] went out, almost a month later. If you really had those concerns, you did not raise them as treasurer. KL Tan At that time, I was not aware of this -- just found out lately that I think about it, it's a way to circumvent the law that requires approval from the general body. I only realise it short while -- some time around this time. Mr Lee At that time, you thought this was the common practice? KL Tan Yes, at that time. Mr Lee Because it was still the informal practice, right? KL Tan Yes. Mr Lee  And at that time in your mind, you thought if no one objects, it is considered as approved. Correct? KL Tan If was not brought in the AGM, we assumed it to be repair and maintenance. Mr Lee  I am only addressing this particular notice. This notice is very clear. It says upgrading of lift lobbies and toilets. So based on the practice, if there is no objection, it is considered as approved. Correct? KL Tan The approval can come from the AGM, not from by circular. You are circum -- it is a scheme to go around the law. The law requires you to -- to be voted, to be budgeted. Mr Lee And you were part of the council at that time as the treasurer, right? KL Tan Yes, it doesn't occur to me at the time. I only realise that this -- this practice. Mr Lee  It would have been part of your duty as a treasurer. KL Tan It doesn't occur to me at that time. Mr Lee  But it would have been your duty as treasurer at that time, correct? KL Tan It should my duty to tell here, but it doesn't occur -- I realise this -- this scheme only lately. [Emphasis added] 126It is clear to me and I so find, that KL Tan adopted and participated in this practice. He cannot now disavow the same. It is also clear that no SP took issue with these processes up until disputes arose between them in late-2008 to early-2009. 127The evidence of the Defendant was corroborated by the testimonies of CK Loo, who was a member of the Council from 1998–2009 and from 2010–2013, KK Lee, who was a member of the Council from 1987–2013, and Thomas Neo, who was a member of the Council in 1995, 1997, 1999–2009, and 2011–2013. KK Lee, CK Loo, and Thomas Neo added that far from objecting to its processes, “most of the [SPs] were happy to leave the decision making to the Council”.128Foot Note 128×AEIC of KK Lee at [5]–[18]; AEIC of Thomas Neo at [5]–[18]; AEIC of CK Loo at [7]–[13] 128The Plaintiffs do not dispute that it was the “customary practice” of the Council to communicate its proposals of works by placing notices of the works on the noticeboard of the Development,129Foot Note 129×PCS at [38]and that the works carried out by the Council pursuant to these notices were valid. The noticeboard was the sole noticeboard in the Development,130Foot Note 130×Notes of Evidence 6 February 2014 at p 118and was located at the ground floor of Block 53, the block that contained the units of all the SPs in the Plaintiffs’ Camp, including those of the Plaintiffs. Neither Sarah Tham nor CY Lim disagreed that it was a “customary practice of [MCST 1024] that a notice of the works to be carried out would be put on [its] noticeboard”.131Foot Note 131×6/2 pp 111–112 129Moreover, the Plaintiffs agree that the Council had on multiple occasions sent notices of its proposals to them. In their submissions, they accept that the Defendant “had sent some circulars about works to be done”, and contend only that “the circulars were not always sent to all SPs [and] only to affected [SPs] or occupants”.132Foot Note 132×PCS at [37]This was the evidence of Sarah Tham,133Foot Note 133×Notes of Evidence 6 February 2014 at p 112which was not disputed by CY Lim. 130Most crucially, KL Tan did not deny that pursuant to the informal practice of MCST 1024, the fact that a notice had been sent to the SPs and that there had been no objections to it meant that the works had been approved. He simply asserted that such a method of approval was “a scheme to go around the law. The law requires you to – to be voted, to be budgeted”. When it was then put to him in cross-examination that securing such approval was part of his duty as Treasurer in the Council, KL Tan simply replied “[i]t doesn’t [sic] occur to me at that time”.134Foot Note 134×2/7 p 122 131Just as a management corporation is entitled to adopt an informal manner of decision-making in its affairs, there is no reason why a council of a management corporation cannot, where the SPs that comprise the management corporation so agree, make decisions on behalf of the management corporation in an informal way. After all, the powers of a council derive from the management corporation (see s 58 of the BMSMA) Also, a management corporation is entitled to ratify a breach by the council of the Second Schedule of the BMSMA (seeDiora-Ace Ltd and others v Management Corporation Strata Title Plan No 3661 and another[2015] 3 SLR 620 at [76]–[77] applying s 88(3) of the BMSMA). Accordingly, I find and hold that the body of SPs of MCST 1024 had agreed that the Council could makes decisions on its behalf with respect to works to the Development. 132I note, for completeness, the Plaintiffs’ submission that some of the practices of the Council appear to be in breach of the Second Schedule of the BMSMA,135Foot Note 135×PCS at [67]which requiresinter aliathat a council gives three days’ notice for and keeps minutes of its meetings (see s 53(11) read with the Second Schedule of the BMSMA). However, as observed by Andrew Ang J inNg Swee Lang and another v Sassoon Samuel Bernardand others[2008] 1 SLR(R) 522 (“Ng Swee Lang(HC)”) at [51] in the context of collective sale orders, the procedural safeguards in the Land Titles (Strata) Act (Cap 158, 1999 Rev Ed) (the “LT(S)A”) are “not built in as absolute obstacles to be surmounted on pain of the Board being precluded from exercising jurisdiction [to sanction a collective sale] if any of the procedural requirements were not met, regardless of whether and to what extent the interests of the minority were affected.” Ang J continued (at [55]): At the end of the day, each objection must be examined on its own facts and the particular requirement breached set against the overall purpose of the legislation. One should then consider whether a strict construction and the invalidation of the [proceeding] is what Parliament would have intended, taking into account any prejudice to the rights of parties and the public interest (if any). These statements were subsequently endorsed by the Court of Appeal inNg Swee Lang and another v Sassoon Samuel Bernardand others[2008] 2 SLR(R) 597 (“Ng Swee Lang (CA)”) at [23]: … the modern approach is to consider whether it is the intention of Parliament to invalidate any act done in breach of a statutory provision. Applying this approach to the facts of the present appeal, we should ask whether Parliament intended the non-stipulation of the distribution method in the S&P Agreement to deprive the respondents of the capacity to make the Application. These passages inNg Swee Lang (HC)andNg Swee Lang (CA)were applied by the High Court inLim ChooSuan Elizabeth and others v Goh Kok Hwa Richard and others[2009] 4 SLR(R) 193. 133In my view, the observations inNg Swee Lang(HC)andNg Swee Lang(CA)apply with equal force in the context of the BMSMA, which, like the portions of the LT(S)A on collective sales, is designed to regulate the rights of the SPs in a strata developmentinter se, and ensure that a minority of SPs does not suffer oppression at the hands of the majority. On the facts of this case, all the SPs in MCST 1024 acquiesced in the procedural deficiencies in the meetings of the Council, and up until late-2008 to early-2009 raised no objections to the decisions made by the Council on works to the Development. None of the SPs were prejudiced by the lack of notice of the meetings of the Council; they were content to leave decision-making on works to the Development to the Council, and had no interest in attending the meetings of the Council. Accordingly, I find that the fact that the SPs were provided with inadequate notice of certain meetings of the Council did not invalidate the decisions of the Council made at those meetings.",
        "Authorisation of Annex A Works": "134As pleaded in the SOC, the Annex A Works comprise 62 items of works that the Plaintiffs allege were undertaken without the authorisation of MCST 1024, and I set them out in a table below. For convenience, I have categorised these works according to the 12 broad locations of common property on which they were performed. During the course of the trial, however, the Plaintiffs and their witnesses conceded that 30 of these 62 items were in fact undertaken within the authority of MCST 1024. These 30 items have accordingly been struck through in the table below: ItemDescription in SOCAmount ($)Category1Upgrading of fencing & sliding gate136Foot Note 136×1AB421; Notes of Evidence 11 February 2014 at p 118 (authorised; relates to fencing, sliding gate, boundary wall)30,000.00Boundary and Gate2Install 2 sets of aluminium signs on boundary walls at 51/53 (30% deposit)137Foot Note 137×1AB422; Notes of Evidence 11 February 2014 at p 118 (authorized; relates to fencing, sliding gate, boundary wall)1,470.00Boundary and Gate3Lighting for Gents & Ladies at 53 Kim Keat 5th floor138Foot Note 138×1AB424; Notes of Evidence 11 February 2014 at p 127 (repair and maintenance)446.00Block 53 5th floor Toilets4A&A Work at 53 Kim Keat 5th floor – Male/Female Toilets139Foot Note 139×1AB425; Notes of Evidence 11 February 2014 at p 126 (amount too big; individual figures, I'll disagree)38,521.07Block 53 5th floor Toilets5Additional Work at 53 Kim Keat – Male/Female Toilets140Foot Note 140×1AB426; Notes of Evidence 11 February 2014 at p 126 (repair and maintenance; amount is small)4,194.40Block 53 5th floor Toilets6Relocating 1 set of manual call point & alarm at 1st level141Foot Note 141×1AB427; Notes of Evidence 11 February 2014 at p 125 (repair and maintenance)462.24Others7Installation of Boundary Wall Sign (Balance 70% payment)142Foot Note 142×1AB422; Notes of Evidence 6 February 2014 at p 111 (24th AGM had approved “upgrading of fencing around the compound and the sliding gates” and “signage for boundary walls”)3,430.00Boundary and Gate8Install 2 sets of boundary Wall Sign – 5th Wall143Foot Note 143×1AB428; Notes of Evidence 11 February 2014 at p 125 (repair and maintenance)1,200.00Boundary and Gate97 downlights at 53 lift lobby144Foot Note 144×1AB431; Notes of Evidence 11 February 2014 at p 124 (repair and maintenance)595.01Block 53 1st floor Lobby10Installation of Decco 600 Aluminium Clip in Ceiling at 1st level lobby and vertical Pelmet at 1st level staircase at 53145Foot Note 145×1AB429; Notes of Evidence 11 February 2014 at p 124 (repair and maintenance)3,477.50Block 53 1st floor Lobby11Design Work for Upgrading at 51/53 Kim Keat146Foot Note 146×Notes of Evidence 11 February 2014 at p 129 (not repair and maintenance)9,500.00Others12Upgrading of fencing & sliding gate (balance) and additional work for entrance driveway147Foot Note 147×1AB432; Notes of Evidence 11 February 2014 at p 129 (approved)35,600.00Boundary and Gate13Purchase 14 pcs lights for 53 1st level toilet148Foot Note 148×1AB434; Notes of Evidence 11 February 2014 at p 130 (now you are talking about individual, I accept)cfp 129784.00Block 53 1st floor Toilets14Installation of wiring for lighting point at ladies & gents; cabling fr 5th floor to switch room149Foot Note 149×1AB435; Notes of Evidence 11 February 2014 at p 130 (now you are talking about individual, I accept)cfp 1292,640.00Block 53 1st floor Toilets; Block 53 5th floor Toilets15Labour & Equipment Tool to hack existing wall @ lift lobby, plaster smooth finish, concrete ramp at 53150Foot Note 150×1AB436; Notes of Evidence 11 February 2014 at p 130 (now you are talking about individual, I accept)cfp 129 (if I looked at this as an independent repair and maintenance work, I approve on it … but now I'm looking at the overall picture on the upgrading expenses that is posted under here I do not accept it is repair and maintenance work)1,600.00Block 53 1st floor Lobby16A&A works for toilets at 53 5th & 1st floor151Foot Note 151×1AB437; Notes of Evidence 11 February 2014 at p 13042,408.38Block 53 1st floor Toilets; Block 53 5th floor Toilets17Install 1 Directory Sign at lift lobby & to anodize black colour152Foot Note 152×1AB433; Notes of Evidence 11 February 2014 at p 130 (approved in the 23rd AGM)2,100.00Block 53 Directory18Re-arrange of Directory Sign at 53153Foot Note 153×1AB440; Notes of Evidence 11 February 2014 at p 130 (approved in the 23rd AGM)380.00Block 53 Directory19Deposits on labour work at Block 51 2nd & 3rd floor, sanitary ware at Block 51 all floors and tiles material at Block 51 all floors154Foot Note 154×1AB628 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 13142,886.00Block 51 Toilets; Block 51 Lobbies2020% Deposit for toilet plumbing work at Block 51 all floors155Foot Note 155×1AB629 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1317,120.00Block 51 Toilets21Balance 50% on tiles material at Block 51 all floors156Foot Note 156×1AB630 (balance for payment voucher to Mod Creations at 1AB628); Notes of Evidence 11 February 2014 at p 13137,390.00Block 51 Lobbies22Progressive Payment (20%) for toilet plumbing work at Block 51 all floors157Foot Note 157×1AB631 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1317,120.00Block 51 Toilets2320% Deposit on labour work, hacking & laying tiles to Block 51 2nd & 3rd floor158Foot Note 158×1AB632 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1315,496.00Block 51 Lobbies2450% Deposit for toilet cubicles at Block 51 2nd & 3rd floor159Foot Note 159×1AB633 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1314,465.00Block 51 Toilets2550% Deposit for ceiling work at Block 51 2nd & 3rd floor160Foot Note 160×1AB634 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1323,475.00Block 51 Toilets26A&A Work to fire sprinkler systems at Block 51 2nd & 3rd floor161Foot Note 161×1AB444; Notes of Evidence 11 February 2014 at p 132 (repair and maintenance)2,551.95Others27Purchase of basin mixer & trade 1 of basin tap162Foot Note 162×1AB445; Notes of Evidence 11 February 2014 at p 132 (repair and maintenance)682.00Others28Alteration Work at Block 51 3rd level toilet entrance163Foot Note 163×1AB636 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 132 (not repair and maintenance)970.00Block 51 Toilets2950% Deposit of 2 numbers swing glass toilet doors164Foot Note 164×1AB637 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1321,200.00Block 51 Toilets30Purchase of 4 Denver bath mixer165Foot Note 165×1AB450; Notes of Evidence 11 February 2014 at p 132 (repair and maintenance)600.00Others31Installation of downlight points, water heater etc. (Block 51 2nd floor); lighting points, double switch, dismantle rooftop motor cables etc. at Block 51166Foot Note 166×1AB641 (payment voucher to Rising Electrical Services); Notes of Evidence 11 February 2014 at p 1324,981.00Block 51 Lobbies32Purchase of paper holder, shower, set etc.167Foot Note 167×1AB452; Notes of Evidence 11 February 2014 at p 132 (repair and maintenance)169.74Others33Progressive Payment on labour work, balance 50% payment for toilet cubicles and purchase of mirrors and water spray head at Block 51, 2nd & 3rd floor168Foot Note 168×1AB642 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 13319,057.00Block 51 Toilets; Block 51 Lobbies34Purchase of lights169Foot Note 169×1AB454; Notes of Evidence 11 February 2014 at p 133 (repair and maintenance)2,656.06Block 51 Lobbies35Purchase of OASI Compact Spray & Scabeo paper holder (white)170Foot Note 170×1AB456–457; Notes of Evidence 11 February 2014 at p 133 (repair and maintenance)100.20Others3660% Deposit for labour, plumbing work at Block 51 1st, 4th & 5th floorKian Wah Invoice No. 3954171Foot Note 171×1AB459; Notes of Evidence 11 February 2014 at p 13345,712.33Block 51 Toilets; Block 51 Lobbies3750% Balance Payment for 2 numbers toilet swing doors, 2 numbers glass dividers and 50% Balance Payment for ceiling work at Block 51 2nd & 3rd floor172Foot Note 172×1AB647 (payment voucher to Mod Creations); Notes of Evidence 11 February 2014 at p 1335,575.00Block 51 Toilets38Purchase of lights at Block 51 1st floor173Foot Note 173×1AB460; Notes of Evidence 11 February 2014 at p 133 (repair and maintenance)874.62Block 51 Lobbies3930% Deposit for stainless steel hairline finished master door letterbox at Block 51 1st floor174Foot Note 174×1AB649  (payment voucher to Frxon); Notes of Evidence 11 February 2014 at p 133960.00Block 51 Letterbox40Installation of ventilating fan, lighting points, urinal bowl etc at Block 51 1st, 2nd, 3rd & 4th floor175Foot Note 175×1AB461–462; Notes of Evidence 11 February 2014 at p 1333,036.00Block 51 Toilets; Block 51 Lobbies41Deposit for Acrylic Signages at Block 51176Foot Note 176×1AB463; Notes of Evidence 11 February 2014 at p 1331,850.00Block 51 Acrylic Signs42Purchase of Sunrise L30 level handle c/w lockset177Foot Note 177×1AB467; Notes of Evidence 11 February 2014 at p 133 (if repair and maintenance)433.35Others43Toilet Cubicles and Mirrors at Block 51 1st & 4th floor178Foot Note 178×1AB466; Notes of Evidence 11 February 2014 at p 1334,793.60Block 51 Toilets44Purchase of basin, bottle trap, basin mixer & PR-23 Touched pop-up179Foot Note 179×1AB468; Notes of Evidence 11 February 2014 at p 133 (repair and maintenance)449.00Block 51 Toilets45Progressive Payment for Acrylic Signages at Block 51180Foot Note 180×1AB655 (payment voucher to Full Spectrum); Notes of Evidence 11 February 2014 at p 1341,000.00Block 51 Acrylic Signs46Balance 70% Payment for letterbox at Block 51 1st floor181Foot Note 181×Notes of Evidence 11 February 2014 at p 1342,464.00Block 51 Letterbox47Final Payment for Acrylic Signages at Block 51182Foot Note 182×Notes of Evidence 11 February 2014 at p 134159.00Block 51 Acrylic Signs48Toilet Signages at Block 51183Foot Note 183×Notes of Evidence 11 February 2014 at p 134490.00Block 51 Acrylic Signs49Alteration of Ceiling Work at Block 51 2nd & 3rd floor and modified work to run copper pipe to connect existing water supply from toilet common property to the subsidiary proprietors units at Block 51 3rd floor184Foot Note 184×1AB479; Notes of Evidence 11 February 2014 at p 134 (funny)1,487.30Block 51 Toilets50Scrabeo Paper Holder & Shower Spray Kit185Foot Note 185×1AB482; Notes of Evidence 11 February 2014 at p 134 (repair and maintenance)138.03Others5120% Deposit for Directory Panel at Block 51Supplier: Ultimate Display System Pte Ltd186Foot Note 186×1AB661 (payment voucher to Ultimate Display Spectrum); Notes of Evidence 11 February 2014 at p 134400.00Block 51 Directory52Balance payment of labour, plumping [sic] work at Block 51 1st, 4th & 5th floorKian Wah Invoice No. 3954187Foot Note 187×1AB490; Notes of Evidence 11 February 2014 at p 13430,474.88Block 51 Toilets; Block 51 Lobbies53Purchase of toilet cubicles, mirrors at Block 51 5th floor and glass dividers at Block 51 4th & 5th male toilets188Foot Note 188×1AB489; Notes of Evidence 11 February 2014 at p 1342,461.00Block 51 Toilets54Toilet Cubicles at Block 51189Foot Note 189×1AB495; Notes of Evidence 11 February 2014 at p 1341,583.60Block 51 Toilets55Purchase of tiles at Block 53190Foot Note 190×1AB503; Notes of Evidence 11 February 2014 at p 1341,466.10Others56Installation [o]f aluminium letters – Passenger Lift & Goods Lift at Block 51191Foot Note 191×1AB496; Notes of Evidence 11 February 2014 at p 1351,740.00Block 51 Lobbies57Additional Plumbing Work at Block 51, 3rd, 4th & 5th storey192Foot Note 192×1AB499; Notes of Evidence 11 February 2014 at p 135 (if repair and maintenance)2,694.26Block 51 Toilets58Balance Payment for Directory Panel at Block 51Supplier: Ultimate Display System Pte Ltd193Foot Note 193×1AB508 (GST error); Notes of Evidence 11 February 2014 at p 1351,740.00Block 51 Directory59Installation of cables, lights, fan points etc. at Block 51194Foot Note 194×1AB510; Notes of Evidence 11 February 2014 at p 135 (if repair and maintenance)2,775.00Block 51 Toilets; Block 51 Lobbies60Purchase of lights at Block 53 2nd, 4th & 5th floor195Foot Note 195×1AB672 (payment voucher to Innolux); Notes of Evidence 11 February 2014 at p 135 (if repair and maintenance)192.60Block 53 2nd to 5th floor Lobbies61Labour Work at Block 51 2nd, 4th & 5th floor196Foot Note 196×1AB517; Notes of Evidence 11 February 2014 at p 13514,190.34Block 51 Lobbies62Joinery Work – doors for toilets, staircase, electrical riser, telephone riser, fire hose reel, pope duct area etc.197Foot Note 197×1AB500; Notes of Evidence 11 February 2014 at p 13526,839.88Block 51 LobbiesTotal475,708.44- 135As reported in the audited financial statements for FY2010, the total value of the works undertaken on the common property of the Development was$489,741.44. This comprised $475,708.44 on the 62 items of Annex A Works and another $14,033.00 of “Upgrading Expenses” reported in the audited financial statements for FY2010.198Foot Note 198×2AB783The Plaintiffs, however, conceded in their SOC that they “do not have the particulars for the Upgrading Expenses $14,033.00”, and that the “Erection of Boundary Wall” for a sum of $65,600.00 (corresponding to Items 1 and 12 of the Annex A Works) had been “approved in 23rd AGM”.199Foot Note 199×SOC at p 21Accordingly, the Plaintiffs’ complaint of unauthorised works is only in relation to Annex A Works of$410,108.44(ie, $489,741.44 – $14,033.00 – $65,600.00 = $410,108.44). This was confirmed by Sarah Tham at trial.200Foot Note 200×Notes of Evidence 6 February 2014 at p 54 136I pause to observe that my assessment of the Plaintiffs’ claims on the Annex A Works was limited by the evidence and submissions on the items therein. The documentary exhibits provided few details on the works in question, and little explanation was offered at trial or in submissions on what exactly these items of works covered. The parties did not link these documents to the specific item or items in Annex A. There were also some errors in the items in Annex A when the supporting documents were eventually traced. For example, Item 58 states $1,740.00 but the relevant invoice201Foot Note 201×1AB508shows $1,712, and Item 61 states $14,190.34 but the relevant payment voucher202Foot Note 202×1AB686shows $9,897.50. Further, Item 16 states “A&A works for toilets at 53 5th & 1st floor” with the figure $42,408.38 but when the invoice is traced203Foot Note 203×1AB437we find that it only relates to the first floor “A & A Work”. In the event, linking the Plaintiffs’ allegations (as pleaded in Annex A) to the relevant documentary evidence was in many cases a matter of some deduction and some guesswork, which is an unsatisfactory level of proof. This leaves me with little option but to resolve the issue based on the burden of proof which rests on the Plaintiffs to demonstrate that the items of works in question were unauthorised. 137The Plaintiffs’ closing submissions did not touch on the individual items in Annex A, which formed a large part of the Plaintiffs’ claims. The Defendant however made comparatively more comprehensive submissions on the items in Annex A.204Foot Note 204×DCS paras.210 to 290 over 92 pages.The Plaintiffs’ reply submissions were, with respect, very inadequate. It was contained in paragraphs 61 to 65 which only took up four pages out of a 49-page, 133-paragraph reply submissions. The Plaintiffs tried to explain that various concessions made by their witnesses, particularly Sarah Tham,  had been taken out of context, and that all she had done was to concede certain items were repairs and maintenance. They claimed Sarah Tham did not know the state of the item that was being replaced or repaired before the expense was incurred to replace it and she was then asked to take that in isolation and to consider whether this could have been repair and maintenance. They also picked on an example of seven down-lights (Item 9), which had been posted in the ledgers as improvements or upgrading works to make the submission that “allthese items listed in Annex A (and in the MCST’s ledges [sic] as upgrading expenses) were likely to have been replaced or carried out even though they were not in disrepair or spoilt.” This is clearly not a correct proposition to make from the evidence given that some items in Annex A had been conceded in their pleadings and by Sarah Tham at trial,eg, when she was shown the minutes of the 23rd AGM which noted her husband, KL Tan’s request to change the directory (Items 17 and 18); this was acceded to. Save for her rather unconvincing attempts during re-examination to claw back her concessions made during cross-examination, the reply submissions stated at paragraph 65 rather weakly that when Sarah Tham was cross-examined on Annex A, she had been on the witness stand for a long time and was tired. This again is not true as I found Sarah Tham to be quite alert during her cross-examination, which was in any case carried out quite fairly by Mr Lee. 138The Plaintiffs offered no details or correlation with the documentary evidence and instead made allegations of grossed-up works with no individual pricing that could be matched to the documentary and photographic evidence. Submissions of the following nature were made: “Wash basins in Block 51 toilets changed to better wash basins”205Foot Note 205×PCS at [110(b)(iv)]without more. Another example is the Plaintiffs accepting as early as in their SOC that $65,600.00 of works on the driveway and boundary wall were approved, without bothering at any time thereafter to identify the items of Annex A Works that corresponded to that sum. I find that Sarah Tham was not confused when she made these concessions; she often paused to think before answering. 139The 62 items of Annex A Works were compiled with a blunderbuss approach and without much thought as to where the target might be. Many of the descriptions of the works, as pleaded in the SOC, simply reproduce the titles of the invoices issued by the contractors who performed the works. Hardly any attempt was made to relate the invoices to the works pleaded in the SOC, much less to consider whether the works in question had in fact been authorised. This was reflected in three troubling aspects of the Plaintiffs’ case, which undermined the credibility of their claims: (a) First, the Plaintiffs listed 62 items as the Annex A Works as works the expenses for which had been “incurred by the Defendant from June 2008 to March 2009 without approval and therefore in breach of trust”,206Foot Note 206×SOC at [18]but, as noted above, withdrew many their claims without much resistance in relation to 30 of these items when challenged by the Defendant during the course of the trial. As noted above, the lack of care with which their case was pleaded and presented is most clearly seen in relation to Items 17 and 18, (works relating to the directory of the Development). When she was shown the minutes of the 23rd AGM, Sarah Tham had no choice but to concede that these works had been approved.207Foot Note 207×Notes of Evidence 7 February 2014 at pp 14–16CY Lim provided no evidence to the contrary. (b) Secondly, the Plaintiffs appeared to premise the objections to the items of Annex A Works based on the quantum of expenditure involved on the works, rather than on the nature of the works in question and the circumstances leading to their undertaking. I set out as an example an extract of the evidence of Sarah Tham on Items 4 and 5, which concerned additions and alterations (“A&A”) work to the fifth floor toilets at Block 53:208Foot Note 208×Notes of Evidence 11 February 2014 at p 126 Sarah Tham: [Items] 4 and 5 is not repair and maintenance … If it is put into the repair and maintenance, definitely I question on it. Court: So you don't accept that. Sarah Tham: Don't accept, the amount is too big. Court:  So that's 4 and 5, or only for 5? Sarah Tham: If you look at the individual figures, I'll disagree the 4.5, because the amount is small, still can considerit is a repair and maintenance. Court: So if he had put it in the repair and maintenance ledger, item 5 you would accept as repair and maintenance? Sarah Tham: Yes. [Emphasis added] (c) Thirdly, and on a related note, the Plaintiffs took inconsistent positions on different parts of a series of works performed on the same items of common property. A good example would be Items 4 and 5 which concerned A&A works to the fifth floor toilets at Block 53, and were described by the Plaintiffs in the Annex of their SOC as “A&A Work at 53 Kim Keat 5th floor – Male/Female Toilets” and “AdditionalWork at 53 Kim Keat – Male/Female Toilets” [emphasis added] respectively. Yet, Sarah Tham took the position that Item 5 was authorised while Item 4 was not, apparently on the basis that Item 4 cost $38,521.07 while Item 5 cost $4,194.40 and without considering what the items of work entailed. I retained the conceded items in the Annex A table above because this kind of inconsistency can be seen when comparing the conceded items and non-conceded items especially when one considers the Plaintiffs originally claimed thatallthe sixty-two items were unauthorised works. From her evidence, it is clear that Sarah Tham also considered an item as authorised or unauthorised based on whether the item had been posted to the repair and maintenance ledger or the upgrading ledger. I set out one such example:209Foot Note 209×Notes of Evidence 11 February 2014 at pp 123–124 Court: Suppose Mr Lee asked you to help him go through all these items [in Annex A], never mind where he posted it. Suppose he had posted them properly under repair and maintenance, which of these items will you accept as repair and maintenance? Are you able to do that? Sarah Tham: Can you rephrase again? Court: There are a lot of items here, correct, and you have just told me for item 10, you say that it is unauthorised because it was put together in the upgrading works ledger? Sarah Tham: Yes. Court: Right. But you told me if this was under repair and maintenance and put under the repair and maintenance item, then it is fine, it is not unauthorised. Have I misunderstood you? Sarah Tham: Yes, that is what I meant. Because this one, the whole chunk of thing was categorised under upgrading expenses work. Court: So what I'm asking you is if the defendant didn't do that. He had put all this whole chunk under repair and maintenance, which items would you agree are repair and maintenance? Sarah Tham: So if he put this under as repair and maintenance … Then number 10, then I will accept this this as a repair and maintenance. 140At the 25th AGM, the SPs had appointed a six-member Audit Committee to “go through the upgrading expenses” in relation to the Annex A Works, the authorisation of which they disputed, and held off passing the audited financial report for FY2009 in the interim (see [35]–[36] above). To date, however, only five members of the Audit Committee have submitted their findings. CK Loo and WC Mok (from the Mok Camp) reported that the expenditure had been fairly and reasonably incurred.210Foot Note 210×1AB256, 257AC Tan, HY Tan, LC Ong (from the Plaintiffs’ Camp) reported that the Annex A Works were “not carried out in a uniform standard for common property in the [D]evelopment” and that various expenditures were “higher than the market rate”, and recommended that a Quantity Surveyor be appointed to assess details of the pricing. Notably, however, the only objections taken by AC Tan, HY Tan, and LC Ong were to thequantumandscope (betweenBlock 51 and Block 53), and not theauthorisation, of the Annex A Works.211Foot Note 211×1AB258 Notice of the Annex A Works and Acquiescence 141It is convenient at this juncture to deal with another important aspect of the Plaintiffs’ central complaint: whether the Annex A Works had been undertaken without informing them of the same thereby depriving them of an opportunity to object or disagree with the extent of the work. I have already dealt with the practice of MCST 1024 in relation to these kinds of works above as well as the functioning of the Council. I find that the evidence clearly shows that the SPs had advance notice of these works, notice in relation to the implementation of these works and some SPs, including the second plaintiff, had requested deviations from the proposed works. 142I start with the 22nd AGM held on 27 September 2006 where in the context of the maintenance and sinking fund, there were proposals to reduce the same. It is noted under Item 5 of the minutes that the Defendant explained that MCST 1024 “needs to have sufficient fund [sic] for contingencies, such as major breakdowns, water-proofing and other repair/improvement works, as both buildings [were] more than 20 years old” (emphasis added).212Foot Note 212×1AB71In the event there was a vote to decrease the contributions by 5% in view of the surplus accumulated in the last financial year. The Defendant was proposed as Chairman by KL Tan. 143As I have noted (at [23] above), at the 23rd AGM held on 2 October 2007, the Defendant informed the SPs at this meeting of the need to deal with the external works due to soil settlement of the surrounding roads and the remedial works undertaken by surrounding owners and the authorities. This was unanimously approved: a professional engineer would be engaged who would study the same and make proposals and a “subcommittee” would be formed “to look after these matters”213Foot Note 213×1AB76. It was resolved that the contributions to the maintenance and sinking funds could remain unchanged. There is no evidence of any “subcommittee” being constituted and I have no doubt, and I so find, that the Council proceeded to take over that role. 144On 20 November 2007, the Defendant (quaChairman) sent a circular to all the SPs notifying them that the lift lobbies and toilets at both Block 51 and Block 53 were “due for upgrading”, and that MCST 1024 would be calling for quotations for the works. The Defendant also “welcome[ed] suggestions” from the SPs” as to the works.214Foot Note 214×1AB160None were forthcoming. This was just over a month after the 23rd AGM on 2 October 2007. Sarah Tham gave evidence that this notice had come from “out of nowhere”,215Foot Note 215×Notes of Evidence 6 February 2014 at p 113and KL Tan claimed at trial that he was surprised by the notice because it provided “no details on what the upgrading was”.216Foot Note 216×Notes of Evidence 1 July 2015 at p 24Yet, none of the SPs raised any dispute as to this notice and none objected to the upgrading works proposed therein. This was confirmed by KL Tan who was the Treasurer of MCST 1024 at the time.217Foot Note 217×Notes of Evidence 2 July 2015 at p 121; Notes of Evidence 8 July 2015 at p 86In my view, this non-objection was telling. It shows the SPs were content with the works being carried out. This is so particularly in light of KL Tan’s evidence that the way that the upgrading works had been discussed at the 23rd AGM appeared to be in accordance with the common informal practice of MCST 1024 for the approval of works at that time.218Foot Note 218×Notes of Evidence 2 July 2015 at p 122 145On 5 March 2008, the Defendant (quaChairman) sent another circular to all the SPs repeating that the lobbies and toilets at both Block 51 and Block 53 were “due for upgrading (in view that these facilities are more than 20 years old)” and that MCST 1024 “is in the process of calling for quotations.”219Foot Note 219×1AB161Sarah Tham confirmed receipt of the circular, and accepted that none of the SPs had raised any contemporaneous objections to its contents.220Foot Note 220×Notes of Evidence 6 February 2014 at p 115Further, the position taken by the Plaintiffs was simply that “[a]nyone reading this notice will think that they would be consulted with the quotations before any work starts”,221Foot Note 221×Notes of Evidence 24 September 2014 at p 63and that “[i]t doesn't say for sure the MC will start work”.222Foot Note 222×Notes of Evidence 30 June 2015 at p 121I do not accept this. The circular conveyed an unmistakable intention to proceed with the works, and no SP voiced any objection to the works at the material time or asked to see the quotations. 146On 16 June 2008, WC Mok (quaSecretary) sent a circular to all the SPs of Block 53 notifying them that MCST 1024 had awarded the contract for the works to the fencing, sliding gate, and boundary wall of the Development to Teamcon Roofing Supply.223Foot Note 223×1AB163This was not disputed by the Plaintiffs. 147On 17 June 2008, WC Mok (quaSecretary) sent a circular to the SPs on the fifth floor of Block 53 notifying them that MCST 1024 had engaged Kian Wah to perform “Upgrading of Gents and Ladies Toilet”.224Foot Note 224×1AB164KL Tan confirmed receipt of this curricular, and accepted that he had neither queried its propriety nor objected to the proposals therein. Although he suggested that he was surprised at the scale of the work (and the expenses involved) because the circular did not state that there was going to be “major upgrading work”, he conceded that, when the works were eventually reported as completed at the 24th AGM, none of the SPs objected to them.225Foot Note 225×Notes of Evidence 3 July 2015 at pp 3–6I do not accept his “surprise” at the scale of the work, which I take to beex post factorationalisation, because there was certainly no contemporaneous expression of this at all material times. Moreover, these were works within his block. 148On the 22 September 2008 a notice for the convening of the 24th AGM was sent to all SPs. Items 3 and 4 in that notice were to review the maintenance and sinking funds and to update the SPs on the renovation works to the common areas.226Foot Note 226×1AB165 149The minutes of the 24th AGM (see [26] above) state at Item 5 “RENOVATION WORKS ON THE COMMON AREAS” records the Defendant (quaChairman) informing the SPs of,inter alia, upgrading of the first floor lift lobby, upgrading of the first and fifth floor male/female toilets and installation of the aluminium ceiling system for Block 53.227Foot Note 227×1AB83Although there were disagreements on Item 4.1 of the minutes, which I address elsewhere, there was no disagreement over Item 5 (c), (d) and (e). More importantly there is no record of anyone objecting or disputing to these works having been carried out without due authorisation or without their knowledge. To the contrary, the minutes show that CY Lim queried whether the third and fourth floor toilets would be upgraded as well and the Chairman explained that the toilets on these floors were not under the care of MCST 1024. This answer no doubt caused the launching of OS 300/2009 on 12 March 2009 (see [26] above) as the SPs on the third and fourth floors of Block 53 must have felt they were being unfairly left out. This must have meant that they wanted these works to be carried out 150On 14 October 2008, the Defendant (quaChairman) sent a circular to all the SPs of Block 51 notifying them that it had engaged Mod Creations to carry out “Upgrading of Lift Lobbly [sic], Gents and Ladies Toilet at second and third Floor”, suggesting the occupants on those floors use the toilets on the 4th and 5th floors instead and apologising for any inconvenience caused.228Foot Note 228×1AB169This was just after the 24th AGM on 9 October 2008. Sarah Tham did not dispute having received this circular, and merely insisted that the notice did not evince a definitive intention to carry out the works.229Foot Note 229×Notes of Evidence 6 February 2014 at p 119KL Tan admitted that the circular had been circulated to himquaTreasurer and did not object to the proposals therein.230Foot Note 230×Notes of Evidence 3 July 2015 at pp 25–27 151On 21 January 2009, the Defendant (quaChairman) sent a circular to all the members of the Council informing them that the works to the lobbies and toilets at Block 51 were underway and were “scheduled for completion in June 2009”, and that the works to the lobbies at the second to fifth floors of Block 53 would follow. The Defendant added that some of the SPs in Block 51 had “requested the use of different materials for the renovation” and that they “will be paying for the cost difference”.231Foot Note 231×1AB170KL Tan admitted that he received this circular, and did not deny that he had “not raise[d] any query as to why there was going to be any upgrading at all for even the lift lobbies and toilets for all levels of [B]lock 51”.232Foot Note 232×Notes of Evidence 3 July 2015 at p 27 152On 6 March 2009, the Defendant (quaChairman) sent a circular to all the SPs in Block 51 informing them of the imminent hacking and re-tiling works to the lobby and the toilets on the fifth floor.233Foot Note 233×1AB174Sarah Tham accepted that she had received this circular but “didn’t pay attention to it, because all this are work scheduled”.234Foot Note 234×Notes of Evidence 6 February 2014 at p 121–122KL Tan admitted that he received this circular and that he “did not raise any protest”. He explained that he had “treat[ed] this as normal routine and maintenance works”, and added that he “did not know whether it's the [B]lock 51 or [B]lock 53” that was the location of the work.235Foot Note 235×Notes of Evidence 3 July 2015 at p 28I am unable to accept this evidence. It is difficult to believe that KL Tan would have remained silent if the notification of these works came as a surprise to him. Rather, it is more likely than not that it did not matter to him whether the works were to Block 51 or Block 53, because the works to either location had been approved by the SPs. 153On 13 March 2009, the Defendant (quaChairman) sent a circular to all the SPs in Block 53 informing them of the imminent re-tiling works to the lobbies of the second to fifth floors.236Foot Note 236×1AB176It was undisputed that the Plaintiffs, whose units were on the third floor of Block 53, received this circular. Indeed, the Plaintiffs in a letter to the Defendant dated 18 April 2009. 154Significantly, the second, third and fourth plaintiffs, whose units were on the third floor, wrote in to the Defendant under the heading “Renovation of Lift Lobby Floor at 3rd floor Mun Hean Building” on 18 April 2009, (the original typed date of 30 March 2009 had been deleted and the handwritten date of 18 April 2009 was initialled). They referred to the above 13 March 2009 notice and “request[ed] that the existing floor-tiles be kept” because they had re-tiled the third floor lobby “at [their] own expenses few years ago”, and asked that MCST 1024 instead “consider to upgrade the lift lobby wall”.237Foot Note 237×1AB177The Plaintiffs eventually chose a set of tiles of a similar cost to those of the tiles that MCST 1024 had originally chosen for the lobby floor, and MCST 1024 bore the cost of tiling the walls of the third floor lobby.238Foot Note 238×1AB178–181 155There was a further notice sent by the Defendant to the occupants of Block 53 dated 24 April 2009 where they were informed of hacking and re-tiling of the fourth and fifth floor lobby floors and walls and this notice records the consent of the occupants of the fourth and fifth floor to go ahead with these works during the long weekend of 1 to 3 May 2009. 156On 11 May 2009, the Defendant (quaChairman) sent a circular to all the members of the Council informing them of the progress of the upgrading works, and notifying them of an imminent shortfall in the funds of MCST 1024 due to these works. He then proposed to increase the monthly maintenance and sinking fund contributions by 5% each, and to have the SPs pay two months’ of contributions in advance.239Foot Note 239×1AB182–183Only in the wake of this circular did the disagreements between the parties deteriorate significantly, with KL Tan first expressing his displeasure at the coffee-shop meeting of 22 May 2009 (see [28] above). 157The evidence shows, and I so find, that the members of the Council as well as the SPs had agreed to or otherwise acquiesced in the Council’s carrying out of the Annex A Works. They were content to go along with the proposals made by the Defendant and/or various members of the Council, who notified the SPs of the works through circulars. KL Tan confirmed that these circulars were sent to the members of the Council and were also published on the sole noticeboard of the Development located on the ground floor of Block 53,240Foot Note 240×Notes of Evidence 3 July 2015 at p 29even if not all the notices were sent to all the SPs, as contended by the Plaintiffs. KL Tan acknowledged that he had received the circulars, and testified only that the circulars were “a way to circumvent the law of getting approval from the general body” for the Annex A Works.241Foot Note 241×Notes of Evidence 2 July 2015 at pp 120–121Up until a meeting of the Council at a coffee-shop on 22 May 2009, where KL Tan asked to examine the “monthly bank statements and the bills for expenses incurred for the last 6 months”,242Foot Note 242×1AB145no one objected to this state of affairs or manner of carrying out such works. 158Sarah Tham confirmed that she received the circulars but that she “didn’t pay much attention to” many of them.243Foot Note 243×Notes of Evidence 6 February 2014 at p 119CY Lim, whose unit was tenanted out at relevant time, did not dispute that he had received some circulars that were handed to him by his tenant, and accepted that he had not protested that the works set out in the circulars had been unauthorised.244Foot Note 244×Notes of Evidence 13 February 2014 at pp 73–74. Point 4.1 of the minutes of the 24th AGM 159I now deal with the Defendants’ contention that the 24th AGM had authorised the Annex A Works in accordance with the informal decision-making practiced by MCST 1024 at that time as reflected in Point 4.1 of the minutes of the 24th AGM (“Point 4.1”). Point 4.1 records the Defendant informing the SPs of the cash balance of MCST 1024 as at 9 October 2008, the expenses for the upgrading works already carried out and those yet to be carried out, and a shortfall of $62,640.00 that MCST 1024 was about to encounter.245Foot Note 245×1AB82Thereafter, as stated in Points 4.2–4.5 of the minutes of the 24th AGM (“Points 4.2–4.5”), the SPs had resolved to increase their maintenance and sinking fund contributions to meet the shortfall. Point 4.1 reads:246Foot Note 246×1AB82 4.1  Mr Tan Keng Lin proposed to reduce or maintain the maintenance and sinking funds in view of the economy slowdown. The Chairman responded that the contribution funds were reduced by 5% from 1 Oct 2006. He explained that: As at 9 Oct 2008, Cash at Bank was: $223,603.09(after taking into consideration the expenses of approx. $197,000.00 for the upgrading works carried out, such as boundary wall, gates, upgrading of the 1st floor lift lobby and 1st & 5th floor toilets, ceiling/lightings and name directory at 53 Kim Keat Road). Contribution funds to be collected for Oct 2008:  $18,756.97 Total amount available:  $242,360.06 Estimated expenses for upgrading works yet to be carried out:   $305,000.00 -  Upgrading of lift lobbies on 2nd, 3rd, 4th & 5th floor at 53 Kim Keat Road -  Upgrading of lifts and toilets on all floors and tiling of common lobbies at 51 Kim Keat Road. There will be a shortfall of:  $62,640.00 [emphasis in original] 160The Plaintiffs argue that the events as recorded in Point 4.1 did not in fact occur at the 24th AGM. They refer to Points 2.2 and 2.3 of the minutes of the 25th AGM on 5 October 2009, which state that Point 4.1 was “expunged” from the minutes of the 24th AGM, and that “[a]s Point (4.1) was expunged, the minutes of the 24th AGM was passed”.247Foot Note 247×1AB98They contend that Point 4.1 was expunged because the upgrading expenses and ensuring shortfall in funds reflected therein had not been discussed at the 24th AGM.248Foot Note 248×PCS at [58]The SPs in the Plaintiffs’ Camp had remained “silen[t]” at the 24th AGM because they had not been informed of the shortfall in funds.249Foot Note 249×PCS at [60]I set out Points 2.2 and 2.3 of the minutes of the 25th AGM: 2.2 Mr Lim Chee Yong said that the upgrading expenditure of S$197,000.00 and $305,000.00 was not brought up for discussion or approved in the 24th AGM. As such,Mr Lim Heng Hoe said that in order not to hold up the approval of the last AGM minutesand there would also be a discussion on the ratification of upgrading expenditure at the later part of the Agenda,he suggested to expunge hereto the Point (4.1)of the last AGM minutes. Mr. Mok Wing Chong agreed. 2.3 As Point (4.1) was expunged, the minutes of the 24th AGM was passed. [Emphasis added] 161The Defendant, on the other hand, submits that Point 4.1 accurately set out the events that transpired at the 24th AGM, including the approval by the AGM of the works set out therein.250Foot Note 250×DCS at [120]At the 25th AGM, there was much debate over Point 4.1, and the Defendant had understood HH Lim to have proposed that Point 4.1 be put aside for subsequent discussion when HH Lim suggested that Point 4.1 be expunged.251Foot Note 251×DCS at [161] 162To place Point 4.1 in its context, I set out Points 4.2–4.5, which the parties do not dispute occurred at the 24th AGM:252Foot Note 252×1AB83 4.2  The Chairman proposed to increase the maintenance fund by 25% and the sinking fund by 15%. 4.3  Mr Tan Keng Lin offered an alternative proposal to increase the maintenance fund by 20% and sinking fund by 10%. Mr Tan suggested that, should the funds run low, a council meeting be held to pass through a resolution to increase the contribution funds. 4.4  The Chairman accordingly declared that it wasresolved that the charges for the maintenance fund and sinking fund contribution to be $18.168 and $7.238 per share per month respectively. The new charges will take effect from November 2008. 4.5  The Chairman further explained that the current surplus from the monthly contribution funds is about $4,000.00 (after deducting the monthly expenses for cleaning and caretaker services). With the increase, there will be an additional surplus of about $3,680.00. [Emphasis added] 163In my view, the evidence shows on a balance of probabilities that there was discussion on the works to the Development at the 24th AGM, and in particular on the works to the lobbies and toilets at both Block 51 and Block 53, as reflected in Point 4.1. This must be the case even if it is disputed whether thefiguresas set out in Point 4.1 on the expenses for the works to the Development were in fact stated or raised at the 24th AGM, and notwithstanding the resolution at the 25th AGM to “expunge” Point 4.1 as recorded in the minutes of the 24th AGM. 164First, it is unlikely for Points 4.2–4.5 to have been discussed at the 24th AGM without any context. Point 4.1 to 4.5 dealt with the need for increased maintenance and sinking fund contributions in light of the works. Notably, CY Lim, who is recorded as having claimed at the 25th AGM that the ratification of upgrading expenditure as recorded in Point 4.1 “was not brought up for discussion or approved in the 24th AGM” (see [160] above),253Foot Note 253×1AB98accepted in his affidavit of evidence-in-chief (“AEIC”) that “the Defendant could have said that generally upgrading or maintenance works was needed”254Foot Note 254×AEIC of CY Lim at [9]and again at trial that Points 4.2–4.5 were in fact raised at the 24th AGM.255Foot Note 255×Notes of Evidence 13 February 2014 at pp 37–40There must have been some actual or potential need for funds. Otherwise, the SPs, whom the Plaintiffs accept were very careful with their finances,256Foot Note 256×PCS at [64]would have been unlikely to approve a 20% and 10% increase respectively in their maintenance and sinking fund contributions. It is recorded in the opening words of Point 4.1 that KL Tan proposedto reducethe contributions in view of the economic slowdown. I therefore find that it is more likely than not that the SPs could only be persuaded to agree to the increase their maintenance and sinking fund contributions after they were presented with a shortfall in the accounts, as set out in Point 4.1. I pause as an aside to note that these minutes of the 24th AGM do not record any objections that such works were unauthorised. 165Secondly, the circulars describing the works undertaken or yet to be undertaken to the Development that were sent by the Council before and after the 24th AGM on 9 October 2008 (see [141]–[158] below) bear out the fact that works to the Development had been discussed at the 24th AGM. The Plaintiffs had not raised any contemporaneous objections to these circulars. On the contrary, the Plaintiffs had actively participated in the works, at one point even requesting that the MCST 1024 re-tile the walls instead of the floor of the lobby adjacent to their units (see [154] above). 166Thirdly and most importantly, KL Tan in his letter dated 13 July 2009 to the Defendant alleging variations in the works between different parts of the Development had accepted that the events as set out in Point 4.1 did in fact transpire at the 24th AGM.257Foot Note 257×1AB227 1.2 As per the minutes for the 24th AGM on 9 October 2008,there wasindeeda report by the Chairman on the upgrading expenses under Point (4.1)and updating on renovation works for the common area under Point (5). [Emphasis added in italics and bold italics] 167The effect of these findings is that the notification of the works to the Development to the SPs at the 24th AGM (as reflected in Point 4.1) and via the circulars sent by the Council (at [141]–[158] above), coupled with the lack of any contemporaneous objection by any of the SPs to the works in the context of the informal decision-making practices/processes of MCST 1024, amounted to an authorisation of or at least agreement to the works by the SPs. Since there is no dispute that the Annex A Works were undertaken pursuant to these notifications, insofar as the existence of these notifications is in fact established, I find that the Annex A Works were in fact authorised or at the very least agreed to by the SPs of MCST 1024. Individual items of Annex A Works 168With these observations in mind, I turn to individual items that comprised the Annex A Works. I need not repeat my comments on the nature of the evidence and the submissions thereon. There is also no need to repeat my findings set out above. I now turn to consider the Plaintiffs’ claims in relation to the larger items of expenditure, which together account for at least $385,295.88 of the $475,708.44 of Annex A Works (see [134] above). 169Item 1 (“Upgrading of fencing & sliding gate”) for $30,000.00 and Item 12 (“Upgrading of fencing & sliding gate (balance) and additional work for entrance driveway”) for $35,600.00.I note the Plaintiffs recognised in their SOC that $65,600.00 on works to the boundary wall had been approved at the 23rd AGM.258Foot Note 258×SOC at p 19However, they did not relate this sum to Items 1 and 12 of the Annex A Works. In any event, I find that these works were approved at the 23rd AGM as part of a unanimous resolution by the SPs to raise the driveway and to replace the fencing around the Development with a boundary wall (see [24] above). No objection was taken at the 24th AGM when the Defendant informed the SPs that these works had been completed. At trial, Sarah Tham and CY Lim confirmed the same on behalf of the Plaintiffs,259Foot Note 259×Notes of Evidence 11 February 2014 at pp 118, 120, 129; Notes of Evidence 13 February 2014 at pp 39–40, 51as did KL Tan, who was Treasurer at the material time.260Foot Note 260×1AB76; Notes of Evidence 2 July 2015 at pp 98–99 170Item 4 (“A&A Work at 53 Kim Keat 5th floor – Male/Female Toilets”) for $38,521.07.261Foot Note 261×SOC at p 19Despite their detailed criticism of the Annex A Works performed on the toilets, the Plaintiffs did not drill down to the individual items comprised in these invoices to make out their case that Item 4 was unauthorised. Item 4 relates tointer aliathe re-tiling of the floor and walls of the fifth floor toilets at Block 53, the instalment of new sanitary wares, and extensive “hacking” works to install new water and sewerage pipes.262Foot Note 262×1AB425Notably, Sarah Tham conceded that Item 5 (“Additional Work at 53 Kim Keat – Male/Female Toilets”) for $4,194.40 had been authorised.263Foot Note 263×11/2 pp 126–127Item 5 concerns primarily “[a]dditional hacking work” to replace the existing “cast iron soil waste pipe” with a “hubbless [sic] soil waste pipe” at the same toilet.264Foot Note 264×1AB426Both Item 4 and Item 5 had been performed by Kian Wah, which invoiced MCST 1024 for both of the items on the same day, 28 July 2008. Clearly, both items related to the same set of A&A works to the fifth floor toilets at Block 53. The Plaintiffs themselves plead Item 4 as “A&A Work” and Item 5 as “AdditionalWork” [emphasis added]. In addition to the reasons set out above, this inconsistency made it difficult to accept that Item 4 was unauthorised (see also [139] above). 171Item 11 (“Design Work for Upgrading at 51/53 Kim Keat”) for $9,500.00.265Foot Note 265×SOC at p 19This entailed the provision by Mod Creations of “Professional Services”vis-à-visthe Annex A Works to Block 51 and Block 53 such as “Design & Conceptualization Work” for the lift lobbies and toilets, “Detailed Drawings” for each of the lobbies, and “Project Management”.266Foot Note 266×1AB575–576In my view, design works are a necessary part of these kinds of work, and I struggle to see how the expenditure on them can be unauthorised. At trial, Sarah Tham alleged only that, of the design works, a “big chunk was for [B]lock 51 and a smaller chunk was for [B]lock 53”.267Foot Note 267×Notes of Evidence 7 February 2014 at p 100This went to the Plaintiffs’ allegation of unequal treatment, rather than that Item 11 was unauthorised. But more importantly, Mr Loo, the Plaintiffs’ own expert, attributed $5,700.00 of the $9,500.00 expenditure on Item 11 to Block 53.268Foot Note 268×AEIC of James Loo at p 189The Plaintiffs did not clarify Item 11 with Mr Loo thereafter. 172Item 16 (“A&A works for toilets at 53 5th and 1st floor”) for $42,408.38.269Foot Note 269×SOC at p 19At the outset, I note that although Item 16 refers to both the first and fifth floor toilets at Block 53, the invoice for $42,408.38 from Kian Wah that the Plaintiffs refer to in their SOC describes only works to the first floor toilet.270Foot Note 270×1AB437A separate invoice titled “A&A Works – 5th floor – Male/Female Toilet at 1st storey Additional work” for $8,453.00,271Foot Note 271×1AB438also issued by Kian Wah and on the same day as the invoice for Item 16, is not referred to by the Plaintiffs. Turning to Item 16 itself, it was undisputed that in June 2008, a sewerage pipe burst in the first floor toilets of Block 53, leaving a foul smell emanating from the first floor toilets at Block 53. Waste was seen under the soil, and the SPs found the stench quite unbearable.272Foot Note 272×Notes of Evidence 24 September 2014 at pp 24–25As a result, the toilets had to be overhauled. The extensiveness of the repairs needed can be seen in the evidence of KL Tan, who as Treasurer signed the payment vouchers for the works, that “the whole toilet had to be dug up”273Foot Note 273×Notes of Evidence 2 July 2015 at p 103; Notes of Evidence 3 July 2015 at p 60and that it was consequently “logical for the [Defendant] to propose a 25 per cent increase to the maintenance fund and a 15 per cent increase to the sinking fund”.274Foot Note 274×Notes of Evidence 2 July 2015 at pp 96–97In my view, the Council was entitled to and did in fact approve Item 16 pursuant to its duty to repair and maintain the Development. Item 16 involved hacking off the old and then installing new floors, walls, and toilet cubicles, running new pipes to the toilets, and installing new ceilings and fittings. These works were a necessary consequence in the replacement of the damaged sewer pipe. Indeed, the Plaintiffs accept in their Closing Submissions that the works to the first floor toilet at Block 53 were necessary repairs and maintenance:275Foot Note 275×PCS at [103] [S]ave for the works to the ground floor toilet at Block 53, which were necessitated by the bursting or the sewerage pipe, the works carried out to Blocks 51 and 53, as listed in Annex A of the Plaintiffs' Statement of Claim, are upgrading works and improvements to the common property. [Emphasis added] 173Item 19 (“Deposits on labour work at Blk 51 2nd & 3rd floor, sanitary ware at Block 51 all floors and tiles material at Block 51 all floors”) for $42,886.00,Item 21 (“Balance 50% on tiles material at Block 51 all floors”) for $37,390.00,Item 23(“20% Deposit on labour work, hacking & laying tiles at Block 51 2nd & 3rd floor”) for $5,496.00, andItem 33 (“Progressive Payment on labour work, balance 50% payment for toilet cubicles and purchase of mirrors and water spray head at Block 51, 2nd & 3rd floor”) for $19,057.00(I note that the invoice corresponding to Item 33 states a sum of $20,047.00. However, neither party addressed this discrepancy in its submission or its evidence. Accordingly, I proceed on the Plaintiff’s pleading of $19,057.00.)276Foot Note 276×SOC at pp 19–20These four invoices related to the re-tiling of the second and third floor lobbies and toilets at Block 51, as well as the installation of toilet fittings and accessories including “Casanova” water closets, automatic-flush urinals, and wall-mounted basins at the first to fifth floor toilets at Block 51.277Foot Note 277×1AB556–574The Plaintiffs barely made any reference to the re-tiling of the second and third floor lobbies and toilets apart from in their SOC, and did not cross-examine the Defendant and his witnesses on whether they had been authorised. As for the installation of toilet fittings and accessories, the focus of the Plaintiffs at trial was that these fittings and accessories were superior to those used in Block 53.278Foot Note 278×Notes of Evidence 7 February 2014 at p 69In essence, the Plaintiffs’ allegation was not that the works had been undertaken without authorisationper se, but that they amounted to unequal treatment between the SPs of Block 51 and the SPs of Block 53. I consider this allegation below, under the Annex B Works (see [195] below). 174Item 20 (“20% Deposit for toilet plumbing work at Block 51 all floors”) for $7,120.00 and Item 22 (“Progressive Payment (20%) for toilet plumbing work at Block 51 all floors”) for $7,120.00.I found it impossible to discern the details of these works, let alone find that they had been undertaken without authorisation. As recorded on the payment voucher for Item 20, Items 20 and 22 involved respectively a 20% deposit and a 20% progress payment for “proposed toilet plumbing work for level 1–5 @ [Block] 51” for a total sum of $35,600.00.279Foot Note 279×1AB629, 631However, only the payment vouchers for Items 20 and 22 were exhibited, but not the underlying invoice for $35,600.00 from Mod Creations (which bore the reference number 3222A/08, as handwritten on the payment voucher for Item 22). The payment vouchers were regrettably scant on the particulars of the “toilet plumbing work” performed by Mod Creations. Yet the Plaintiffs did not even cross-examine the Defendant and his witnesses on this work. Further, the expenditures on Items 20 and 22 amounted to only 40% of $35,600.00 expenditure on the “toilet plumbing work”. It is noteworthy that the Plaintiffs pleaded only this portion of the total expenditure, and made no allegation as to the remaining 60%. 175Item 36 (“60% Deposit for labour, plumbing work at Block 51 1st, 4th & 5th floor”) for $45,712.33 and Item 52 (“Balance payment of labour, plumping [sic] work atBlock 51 1st, 4th & 5th floor”) for $30,474.88.280Foot Note 280×SOC at pp 20–21Kian Wah performed these works. As set out in the quotation from Kian Wah, the expenditures for these works entailedinter alia, “Labour charges for laying marble wall”, “Labour charges for laying wall tile”, and “Bird Mouth edge with polishing for tile at corner point”.281Foot Note 281×1AB459, 490, 646, 662 (Quotation at 1AB560–562)The Plaintiffs alleged that the quotation “was not shown to the [SPs] of [B]lock 53”.282Foot Note 282×Notes of Evidence 24 September 2014 at p 50However, CK Loo, to whom the quotation and the invoices had been made out,283Foot Note 283×1AB459, 490testified that he had shown the quotation to KL Tan, who was a member of the Council, in May 2008.284Foot Note 284×Notes of Evidence 24 September 2014 at p 50This was not disputed by the Plaintiffs, who asserted only that KL Tan had told CK Loo to present the quotation at the 24th AGM and that CK Loo had failed to do so. To that end, there was no reason why KL Tan could not have raised the issue of the quotation (and what the Plaintiffs contend to be excessive expenditure) at the 24th AGM, particularly when he had vigorously resisted a proposal by the Defendant to raise the maintenance and sinking fund contributions to pay for the Annex A Works. The fact that KL Tan did not see fit to bring up this quotation at the 24th AGM suggests that he had found the works therein not to be out of the ordinary, and reinforced my view that they were not unauthorised. 176Item 61 (“Labour Work at Block 51 2nd, 4th & 5th floor) for $14,190.34.285Foot Note 285×SOC at p 21No attempt was made to relate these works to any invoice or payment voucher. Also, no evidence was given on the works, save for a bare denial by Sarah Tham that Item 61 had been authorised.286Foot Note 286×Notes of Evidence 11 February 2014 at p 135Finally, no submissions were made on these works. There was however an invoice from Kian Wah entitled “A & A Work for 2nd floor to 5th floor lift lobby area at No 53, Kim [sic] Keat Road” for the very same amount of $14,190.34, which listed,inter alia, “Hack off existing floor tile included to cart away (2nd, 4th and 5th floor)” and “Labour charge for laying new floor tile (2nd, 4th and 5th floor)”.287Foot Note 287×1AB517However, this invoice was described as relating to works to Block 53 rather than Block 51. Given the dearth of evidence on Item 61, I am unable to find that it was unauthorised. 177Item 62 (“Joinery Work – doors for toilets, staircase, electrical riser, telephone riser, fire hose reel, pipe duct area etc.”) for $26,839.88.These works were performed by Kian Wah, and entailed the installation of doors with “Zebrano veneer & veneer ply finish” at the lift lobbies of Block 51.288Foot Note 288×1AB500At trial, the primary position taken by the Plaintiffs was that these doors were more expensive than those at Block 53. Sarah Tham described the doors at Block 51 as of “superior quality”.289Foot Note 289×Notes of Evidence 7 February 2014 at p 105This was properly an allegation of unequal treatment between the SPs in Block 51 and Block 53, rather than an allegation that the works were unauthorised. But more importantly, the Defendant gave evidence that there were no doors at the lobbies of Block 53, and that the doors installed at Block 51 were “one to one replacement of doors at the lift lobby area”.290Foot Note 290×Notes of Evidence 11 February 2014 at p 7Sarah Tham accepted that there were no doors at the lift lobbies at Block 53,291Foot Note 291×Notes of Evidence 11 February 2014 at p 4and admitted that for Block 51 she “don’t know what was before the renovation, whether there is door or not”.292Foot Note 292×Notes of Evidence 11 February 2014 at pp 7–8I was thus unable to accept the Plaintiffs’ contention that these works were unauthorised. 178For completeness, I set out my findings in relation to some of the other items of the Annex A Work that involved comparatively smaller expenditure: (a)Item 13 (“Purchase 14 pcs lights for 53 1st level toilet”) for $784.00.293Foot Note 293×SOC at p 19When the sewerage pipe at the first floor toilets of Block 53 burst, the whole toilet had to be dug up (see [172] above). Even if the exposed sewerage and/or the repair works thereto did not directly affect items of common property like the toilet lights, the replacement of such items was certainly reasonable and within the authority of MCST 1024. These items were over 20 years old, and it was only logical and sensible that a new ceiling and new lights were installed once the toilets had been overhauled, as reflected in Item 13. (b)Item 17 (“Install 1 Directory Sign at lift lobby & to anodize black colour”) for $2,100.00 and Item 18 (“Re-arrange of Directory Sign at 53”) for $380.00.294Foot Note 294×11/2 p 130Sarah Tham accepted that these works had been expressly authorised by the 23rd AGM,295Foot Note 295×11/2 p 130and withdrew the complaints of the second plaintiff in relation to these works.296Foot Note 296×Notes of Evidence 7 February 2014 at pp 14–16CY Lim did not give any evidence to the contrary on behalf of the fourth plaintiff. (c)Item 39 (“30% Deposit for stainless steel hairline finished master door letterbox at Block 51 1st floor”) for $960.00 and Item 46 (“Balance 70% Payment for letterbox at Block 51 1st floor”) for $2,464.00.297Foot Note 297×SOC at p 20The Plaintiffs’ “complaint is that the letterbox at [B]lock 51 was replaced but the one at [B]lock 53 was not.”298Foot Note 298×Notes of Evidence 11 February 2014 at p 64However, the letterbox at Block 51 had never been replaced since 1986, and was at least 12 years older than the letterbox at Block 53, which had been replaced in 1998.299Foot Note 299×Notes of Evidence 11 February 2014 at p 64At the time of its replacement, the original letterbox at Block 53 was approximately 17 years old. To replace the letterbox at Block 51 no less than 22 years after its construction can fairly be considered a work of repair and maintenance.",
        "Ratification of the works": "179In the Plaintiffs closing submissions they point out that the Defendant admitted that there was a “technical mistake in not obtaining consent before proceeding with the work.”300Foot Note 300×PCS at [65]The Defendant wasnotcross-examined on this point. Importantly, that submission is not the full story. The full extract from the minutes of the 25th AGM reads: “[The Defendant] also mentioned that there was a technical mistake in doing the upgrading work without holding an Extraordinary General Meeting. He said that the work was carried out on a “work-on-trust” basis and the upgrading expenditure did not exceed the original figure.”301Foot Note 301×1AB98 It is clear that the Defendant’s explanation for not holding an EGM to approve the works was the informal practice adopted,ie, the “work-on-trust” basis, which I have dealt with above. 180According to the minutes of the 27th AGM,ie, the AGM held by the Mok Camp and which was eventually ruled by the STB as the valid AGM, the SPs unanimously confirmed the minutes of the 26th AGM, and then “unanimously resolved to confirm and accept all the outstanding minutes of the 25th AGM held on 5 Oct 2009 and the [EGM] held on 6 April 2010 and 24 July 2010 respectively”.302Foot Note 302×1AB130Thereafter, the SPs “unanimously resolved to approve the accounts and adopt the three (3) audited financial reports for the years ended 30 June 2009, 30 June 2010, and 30 June 2011”.303Foot Note 303×1AB129–130I shall refer to these resolutions collectively as the “Ratification Resolutions”. 181The Plaintiffs submit that the Annex A Works have not been ratified. First, the 25th AGM did not pass a motion that had been tabled to ratify the Annex A Works.304Foot Note 304×PCS at [119]Secondly, the 26th AGM merely considered a motion to “decide on the unresolved upgrading expenditure not exceeding $530,000”, and decided that the amount be “reviewed and verified further” without passing the motion.305Foot Note 305×1AB121; PCS at [120]Thirdly, the Ratification Resolutions were defective. Although the SPs in the Plaintiffs’ Camp had been present at the 27th AGM, their votes had not been taken. As previously noted, at this AGM, the SPs split into two meetings within the same room, one held by the Mok Camp and the other by the Plaintiffs’ Camp. The SPs in the Plaintiffs’ Camp should thus be treated as having voted against the Ratification Resolutions, which the SPs in the Mok Camp, who held only 44% of the share value of the Development, lacked the requisite majority to pass.306Foot Note 306×PCS at [124] and [127]Further, the notice of the 27th AGM (the “27th AGM Notice”) did not refer to the minutes of the 25th AGM (or the two EGMs thereafter) and the audited financial reports for FY2009 and FY2010. This was in breach of s 27 read with Paragraph 1 of the First Schedule to the BMSMA that invalidated the Ratification Resolutions.307Foot Note 307×PCS at [129] and [131] 182The Plaintiffs add that in any event, mere adoption of the audited financial reports of MCST 1024 does not amount to ratification of the Annex A Works.308Foot Note 308×PCS at [128]The SPs (in the Mok Camp) in adopting the audited financial reports accept only that the figures therein are current and that the sum stated in the report has been spent on the purposes stated.309Foot Note 309×PCS at [132] 183InFu Loong (HC), the High Court dismissed an application by the Plaintiffs to invalidate a ruling by Dr Mok at the 5 June 2013 EGM that their motions to revoke the Ratification Resolutions out of order. Chan J held that pursuant to the decision of the STB in STB78/2011 (see [45] above), the Mok Meeting was the valid 27th AGM and that the resolutions passed thereunder (including the Ratification Resolutions) had been validly passed (Fu Loong (HC)at [45]). However, “there wasnoresolution to ratify any previous upgrading work expenses passed during the 27th AGM”, and that “the approval and adoption of audited financial reports did not amount to a ratification ofpastupgrading work expenses” [emphases in original] (Fu Loong (HC)at [46]). Chan J added (Fu Loong (HC)at [52]): But the approval and adoption of audited accounts has nothing to do with whether individual expenditure items in the accounts were authorised. If these items were unauthorised, that is a separate matter involving a failure of internal controls and does not mean that there was a material misstatement in the audited accounts or that the audited accounts were erroneous in some material way or that the audited accounts should have been qualified. 184InFu Loong (CA), the Court of Appeal granted the clarification sought by Dr Mok’s counsel thatFu Loong (HC)did not stand for the blanket proposition that a ratification of accounts could never amount to a ratification of the individual expenditure items in those accounts. It would be apposite to set out the Court of Appeal explanation (Fu Loong (CA)at [42]): Whether or not a ratification of audited financial reports or audited accounts amounts to a ratification of the individual expenditure items in those reports or accounts depends on the facts and circumstances of the particular case and cannot be reduced to a blanket proposition of law. It therefore remains open to the trial judge in Suit 311/2012 [ie, this Suit] to make a finding on this issue, if necessary, based on the relevant evidence and arguments in that case. 185At the outset, I note that the Plaintiffs do not dispute the veracity of the minutes of the 27th AGM, and of the Ratification Resolutions reflected therein. 186The minutes of the 27th AGM state that the Ratification Resolutions wereunanimouslypassed. Further, WC Mok and all his witnesses, KK Lee, Jessie Ang, CK Loo, WK Mok, WT Mok and Thomas Neo, each of whom was present at the 27th AGM, gave evidence that they had understood that when voting in favour of the Ratification Resolutions, they were also ratifying the authority of the Council to undertake the Annex A Works as well as the expenses incurred by MCST 1024 in consequence. This evidence is not challenged by the Plaintiffs. Indeed, the Plaintiffs had together with five other SPs in the Plaintiffs’ Camp had on 23 April 2013 written to the Secretary of MCST 1024 to requisition,inter alia, that various “resolutions, passed at the 26th and/or 27th [AGMs] be revoked”.310Foot Note 310×2AB1197These included “[t]he ratification of the Upgrading Work Expenses of about $530,000 or any other sum” and “[t]he adoption of all Financial Reports ended 30 June in years 2009, 2010, 2011 and 2012 and the Interim Financial Report from 1 July 2012 to 31 July 2012” (see [53] above). Implicitly at least, the Plaintiffs must have accepted that the expenditure of $530,000 had been ratified at the 26th and/or 27th AGMs. I do not accept the Plaintiffs’ submission that this requisition was “a pre-emptive measure, to revoke any such resolution, if it had been passed”.311Foot Note 311×PRS [96]The text of the requisition is clear, and refers unambiguously to “[t]he ratification” that had been passed. But more than that, Sarah Tham admitted in cross-examination that the Plaintiffs had made the requisition because the expenditure on the Annex A Works had been “unanimously ratified by all who attended [the 27th AGM]” in the Ratification Resolution:312Foot Note 312×Notes of Evidence 6 February 2014 at pp 30–31 Mr Lee So would it be correct to say that when the general meeting finally approved the accounts, they were ratifying the expenditure? Sarah Tham You look at this minutes, you can consider -- I also consider that you have passed the ratification issue and therefore we know that it's not correct and therefore immediately after the ruling of 78, STB78, we quickly call for an [EGM] to ratify it. Mr Lee This is exactly the point … you recognise that the expenditure for the renovation or upgrading works had been ratified, right? At the 27th AGM? Sarah Tham Has been ratified but not by the majority of the MCST. Mr Lee It had been ratified by all who had attended that particular meeting, correct? Sarah Tham Yes. Mr Lee So it had been unanimously ratified by all who attended that meeting, correct? Sarah Tham Yes. Mr Lee And because you recognised that it had been ratified, you then subsequently introduced or requisitioned a motion to revoke that ratification, correct? Sarah Tham Yes. 187Sarah Tham conceded further that the Ratification Resolutions have not since been revoked, and that if the ratification remains, she had no case in respect of the Annex A Works:313Foot Note 313×Notes of Evidence 6 February 2014 at pp 39–41 Mr Lee … As long as the expenditure has been ratified, you know you have no case, correct? Sarah Tham Not necessarily. As I say, the ratification is a resolution and it can be revoked. Mr Lee So as long as the ratification remains, and has not yet been revoked, you know you have no case, correct? Sarah Tham Logically, it explain that way. Mr Lee  So the answer is \"yes\", correct? Sarah Tham Yes. … Mr Lee … As of today, the ratification of the accounts at the 27th AGM has not been revoked by the general body of the MCST, correct? Sarah Tham I do not know what position to take. Because -- Mr Lee  It is either a \"yes\" or \"no\"? Sarah Tham If you base on -- you put me to your documents, it's not revoked. But when you look at the -- this case has been brought to OS569 and the ruling is the ratification was not approved in the 27th AGM. Mr Lee My question is focused on the general body. The general body has not revoked that ratification of the expenses, correct? Sarah Tham To make it simple, based on this, I will answer you that it's not revoked. 188I do not accept the Plaintiffs’ contention that the SPs at the Mok Meeting lacked a sufficient majority to pass the Ratification Resolutions because they held only 44% of the share value of MCST 1024. The Plaintiffs relied onLaboucherev Earl of Wharncliffe(1879) 13 Ch D 346314Foot Note 314×PCS at [125]andThe Queen v The Overseers of Christchurch, Middlesex(1857) 7 El & Bl 409315Foot Note 315×PCS at [126]to contend that a member present or assembled at a meeting who does not vote on a resolution should nevertheless count as part of the corpus of participants at the meeting (from which the number of votes needed to constitute the requisite majority is calculated). However, these cases do not address the question of what it means to be “present” at a meeting. Mere physical existence at the venue a meeting cannotipso factoconstitute such “presence”, otherwise the question of “presence” at a meeting would simply come down to the physical boundaries of the venue. Something more is required: that of a conscious choice on the member’s part to participate in the meeting, even if he chooses to abstain from voting on a particular resolution. Although the SPs in the Plaintiffs’ Camp may have physically been in the same room as the SPs in the Mok Camp at the time of the 27th AGM, the SPs in the Plaintiffs’ Camp had chosen not to take part in the proceedings of the Mok Meeting. On the contrary, they had gathered to hold their own meeting in the same room. Hence they could not be said to have been part of the corpus of the Mok Meeting. 189More importantly, under s 2(2) and (3) of the BMSMA on ordinary and special resolutions respectively, the relevant votes at a general meeting of a management corporation are the votes “cast” by SPs, whether for or against a resolution. This suggests that an SP must take the active step of voting, either for or against a resolution, in order for his vote to count. Having chosen to neither participate nor cast any votes in the Mok Meeting, the SPs in the Plaintiffs Camp cannot now assert that they had in fact voted against the Ratification Resolutions. I set out s 2(2) and (3) of the BMSMA with the appropriate emphases added in italics and bold italics: Interpretation 2.— … (2) For any management corporation or subsidiary management corporation, a motion is decided byordinary resolutionif — (a) the motion is passed at a duly convened general meeting of such corporation of which at least 14 days’ notice specifying the motion has been given; and (b) thevotescastby subsidiary proprietors who are entitled to vote and are present (in person or proxy) at the time the vote is taken are as follows: (i) if no poll is taken — the number of valid votes counted for the motion are more than the valid votes counted against the motion; or (ii) on a poll — the total of the share value of the lots for which valid votes are counted for the motion is more than the total of the share value of the lots for which valid votes are counted against the motion. (3) For any management corporation or subsidiary management corporation, a motion is decided byspecial resolutionif — (a)  the motion is passed at a duly convened general meeting of such corporation of which at least 21 days’ notice specifying the motion has been given; and (b) on a poll, the total of the share value of the lots for which valid votes are counted for the motion is at least 75% of theaggregate share value of the lots for which all valid votes arecastby subsidiary proprietors who are present (in person or proxy) at the time the vote is taken. 190The difficulty for the Plaintiffs’ Camp is that they took the unfortunate decision to hold a separate AGM and, of the two AGMs that were held, the STB in STB78/2011 ruled that the AGM held by the Mok Camp was the valid 27th AGM, see [45] above. That decision was not appealed against. Having chosen that option and not attending and voting at the AGM held by the Mok Camp, they are now bound by what occurred at that valid AGM. 191I turn now to the Plaintiffs’ allegations of defects in the 27th AGM Notice, and the effect of such defects on the validity of the Ratification Resolutions passed at the 27th AGM. These objections should have been taken in OS569/2013, where the Plaintiffs applied to invalidate Dr Mok’s ruling out of order their motions to revoke the Ratification Resolutions. Having neglected to do so before either Chan J or the Court of Appeal, the Plaintiffs’ attempt to do so now is, in my view, an abuse of process under the rule inHenderson. A litigant will not be permitted to argue points that should have been, but were not, previously determined by a court or tribunal “because they were not brought to the attention of the court or tribunal in the earlier proceedings even though they ought properly to have been raised and argued then” (seeThe Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 at [101] citingHendersonat 381–382). 192OS569/2013 was, in substance, an application by the Plaintiffs to revoke the Ratification Resolutions. Any deficiency in the 27th AGM Notice that had the effect of impugning the Ratification Resolutions passed at the 27th AGM was a “point which properly belonged to the subject of litigation, and which the parties, exercising reasonable diligence, might have brought forward at the time” (seeHendersonat 382). Yet, as Chan J observed inFu Loong (HC)at [51], “[t]he Plaintiffs’ affidavit [in OS569/2013] was silent on why it was necessary to revoke the approval and adoption of the audited accounts.” Moreover, the Plaintiffs raised their objections to the 27th AGM Notice for the first time only in their closing submissions, having maintained in their pleadings and at trial that the Account Adoption Resolution was not valid only because it was not passed with a requisite majority of SPs.316Foot Note 316×Reply at [37]–[38]I am therefore unable to accept these belated objections. 193On the facts and in the circumstances of this case, I find that the SPs in passing the Ratification Resolutions ratified the upgrading expenditure on the Annex A Works set out in the audited financial reports, and the SPs treated the adoption of audited financial reports as a amounting to a ratification of the individual expenditure items therein. At the 25th AGM, the SPs did not pass the audited financial report for FY2009 because the Plaintiffs’ Camp disputed the authorisation of the Annex A Works (see [35] above). At the 26th AGM, when the authorisation of the Annex A Works remained unresolved, the SPs similarly did not pass a motion to adopt the audited financial report for FY2010 (see [40] above). This practice was confirmed by Sarah Tham:317Foot Note 317×Notes of Evidence 6 February 2014 at pp 29–30 Mr Lee Isn't it true, Ms Tham, that the accounts, these three sets of accounts in 2009, 2010 and 2011, were not passed at the previous two AGMs because there were queries -- allegations about the works being unauthorised and therefore the expenditure was unauthorised for those works, correct? Sarah Tham Yes Mr Lee And that was why the general meeting in the last two years did not approve the accounts, correct? Sarah Tham Yes. 194Accordingly, when the 27th AGM passed the Ratification Resolutions it can only be taken to have ratified the upgrading expenditure on the Annex A Works set out in the audited financial reports. Sarah Tham conceded as much:318Foot Note 318×Notes of Evidence 6 February 2014 at pp 32–33 Mr Lee Ms Tham, you knew that the only reason why the accounts had not been approved, the 2009 accounts had not been approved, was because there was objection to the upgrading works expenses, and you knew also that when the accounts were finally approved, that meant that the upgrading works expenses had been ratified. Correct? Sarah Tham Before reading the ruling in OS569, I have that kind of understanding that if the accounts is approved, it indicate -- it imply that the ratification is also approved. But after reading the OS569, my understanding is not the same. So even – Mr Lee Now your understanding is because it is based on what had happened at the AGMs, at the two AGMs before the 27th AGM, where the accounts were not approved precisely because the expenditure was considered unauthorised? Sarah Tham Before the OS569 I have that kind of understanding. Mr Lee That's right. Andeveryone at that AGM, at the 27th AGM, knew that when they were proving the accounts they were ratifying the upgrading expenses, correct? Sarah ThamYes, and therefore immediately after the STB78, I call for -- we call for the EOGM to revoke the resolution. Mr Lee That's right. So including you,you thought that therefore the accounts -- the works had been ratified, right? Sarah ThamYes. [Emphasis added] Annex B Works 195I now deal with the Plaintiffs’ allegations that in the undertaking of the Annex B works the Defendant had treated them (and the other SPs in Block 53) unequally as compared those in Block 51,319Foot Note 319×SOC at [20]thereby breaching his fiduciary duties to manage MCST 1024 for the benefit of all the SPs. The Plaintiffs allege that in respect of the Annex B Works “far superior and more extensive” works were carried out to Block 51 than to Block 53320Foot Note 320×The Defendant used his position as to gain for himself and the SPs in the Mok Camp the advantage of “improvements and high quality renovations to the common property of Block 51 (and the 1st and 5th floors in Block 53) where [they] own units”. In consequence, “MCST 1024 incurred excessive costs and expenses for the renovation for which it did not have the funds”.321Foot Note 321×It is important to note that Blocks 51 and 53 are quite different in layout and area. They were designed by different architects and constructed by different building contractors some 5 years apart. There is also some evidence that Block 51 was designed to the specifications of the developer’s subsidiary which included the choice of material used for the building and which was subsequently sold to the subsidiary for their own usage.322Foot Note 322×See 1AB158 196It therefore does not take the Plaintiff far to simply rely on a report by Mr Loo (P2 – Estimated Cost Over-Spent on Block 51) that there was an over-spending of $99,962.02 on Block 51 because: (a) the works to Block 51 cost $295,411.64 while those to Block 53 cost only $127,186.80; and (b) the cost of the works to Block 51 would have been only $195,449.62 if it had been renovated to an equivalent standard as Block 53.323Foot Note 323×PCS at [166]–[170]Some of the works to Block 51, which works were allegedly carried out to a higher standard than those to Block 53, were in fact paid for by the SPs at Block 51 and not MCST 1024. The Plaintiffs simply submit that “[o]nly some additional costs were borne by the SPs of Block 51”,324Foot Note 324×PCS at [172]and point to a list compiled by the Defendant of the improvements paid for by the SPs at Block 51.325Foot Note 325×DAEIC at pp 465–466However, the list shows that the SPs at Block 51 paid for $124,818.12 of improvements, which exceeds the $99,962.02 allegedly over-spent on Block 51. The Plaintiff did not dispute the veracity of the list, and made no allegation that the contents of the list do not relate to the items on the report on over-spending at Block 51 prepared by Mr Loo. 197I turn now to the nine specific items of Annex B Works, as pleaded by the Plaintiffs in their SOC.326Foot Note 326×SOC at [20]I consider also the Plaintiffs’ claim, which the Plaintiffs did not plead but made only in submission, that the 20-year-old lift mechanism at Block 53 has not been changed despite the many requests made by SPs from the Plaintiffs’ Camp since the 14th AGM on 18 September 1998 to do so.327Foot Note 327×PCS at [161]–[164] 198Item A: “the common corridors at Block 53 2nd & 5th floors were not tiled even though the corridors are common property, but for Block 51 expensive marble and granite tiles were used”.At the outset, I note that there are no common corridors at Block 51,328Foot Note 328×DAEIC at [175]and Item A could relate only to thelobbiesthere. However, comparing the common corridors (with or without the lobbies) of Block 53 against the lobbies of Block 51 would not be a like-for-like comparison based on the photos adduced by the Plaintiff. No party provided any evidence or submission on how such a comparison should be made. Moreover, marble and granite was used only at the fifth floor lobby of Block 51. Quartz wall tiles were laid on the walls on the first floor lobby of Block 51, while deco-coloured mosaic was used on the walls and floors of the fourth and fifth floor lobbies of Block 51. Sarah Tham conceded that the marble and granite at the fifth floor lobby had been paid for by an SP from the Mok Camp, and took issue only with the quartz wall tiles at Block 51.329Foot Note 329×Notes of Evidence 11 February 2014 at pp 27–29However, the relevant invoice from Mod Creations shows that MH Singapore had paid for both the “supply” and “laying” of the quartz wall tiles.330Foot Note 330×1AB563Neither CY Lim norKL Tan gave evidence on marble, granite, or quartz titles at Block 51. Accordingly, I find that there is no substance to this complaint of unequal treatment and this claim in Item A must be dismissed. 199Item B: “there are fewer lights installed at Block 53 and they were ordinary down lights whereas the Defendant installed fibre optic lights at his 5th floor office at Block 51”.I deal first with the quantity of lights and then the quality of lights. (a) It was undisputed that there were more downlights at Block 51 than at Block 53. Even so, it was also undisputed that the lobby at Block 51, where all the downlights were installed, spanned a larger area than that at Block 53. This was confirmed by Sarah Tham.331Foot Note 331×Notes of Evidence 11 February 2014 at p 29The floor plans of Block 51 and 53 showed that the lobby of Block 51 was more than double the size of the lobby of Block 53.332Foot Note 332×AEIC of James Loo at pp 25, 27Neither KL Tan nor CY Lim gave evidence on the number of down lights at the lobbies of Block 51 and Block 53. Further, the Plaintiffs did not make any submissions on whether, in light of the comparative sizes of the lobbies at Block 51 and Block 53, the number of downlights at the former was unjustified. Accordingly, the Plaintiffs were unable to prove, as far as the quantity of lights was concerned, that there was unequal treatment of the Plaintiffs. (b) It was undisputed that fibre optic lights were installed at the fifth storey of Block 51. However, these lights were located at the fifth floor lobby and not the Defendant’s fifth-floor office, as pleaded by the Plaintiffs. Moreover, the fibre optic lights were purchased by an SP in the Mok Camp, with the invoices in question addressed to MH Singapore.333Foot Note 333×1AB455This was confirmed by Sarah Tham,334Foot Note 334×Notes of Evidence 11 February 2014 at p 42who explained that the issue of the fibre optic lights had been raised because they were “additional fixtures” in Block 51 that were “expensive”. She then claimed that “this additional fixtures will increase the consumption of electricity”,335Foot Note 335×Notes of Evidence 11 February 2014 at p 42which was charged to MCST 1024. However, the Defendant gave evidence that these fibre optic lights draw their power from his unit, and not from the common grid of the Development. Moreover, the electricity bills of MCST 1024 show that electricity consumption for Block 51 had, on the whole, decreased rather than increased after the fibre optic lights were installed.336Foot Note 336×1AB555–557Neither KL Tan nor CY Lim gave evidence on the fibre optic lights at the fifth floor of Block 51. Accordingly, the Plaintiffs’ claim on unequal treatment with respect to these works are also without foundation and must fail. 200Item C: “the directory is of a lower grade for Block 53”.I note at the outset that, at trial, the Plaintiffs withdrew all their claims in relation to the directory at Block 51 (see [178(b)] above) under the Annex A Works. There was no withdrawal of Item C. Nevertheless, I am also of the view that the differences between the directories at Block 53 and Block 51 do not amount to unequal treatment of the SPs in Block 53. Sarah Tham deposed that the “directory for Block 53 is a bare aluminium panel with old vinyl text”. In contrast, the “directory for Block 51 is boxed up, lighted up and comes with a display monitor”.337Foot Note 337×AEIC of Sarah Tham [39]In cross-examination, however, she accepted that mathematically, MCST 1024 had spent more on the directory at Block 53 than on that at Block 51.338Foot Note 338×Notes of Evidence 11 February 2014 at pp 62–63It was then put to Sarah Tham by Mr Lee, that the same aluminium directory board had been installed in both Block 51 and Block 53. Sarah Tham eventually accepted that the two directory boards differed in appearance “because [MH Singapore], the defendant’s company, has paid for the difference and upgraded [the directory at Block 51] to a different looking board”.339Foot Note 339×Notes of Evidence 11 February 2014 at p 61NeitherKL Tan nor CY Lim gave evidence on the directory signs at Block 51 and Block 53. For completeness, I note that Sarah Tham had observed at trial that unlike the directory at Block 53, the directory at Block 51 was lit up and therefore consumed electricity that was charged to MCST 1024.340Foot Note 340×Notes of Evidence 11 February 2014 at p 61However, this contention is not supported by the Plaintiffs’ pleadings, or by the evidence of CY Lim and KL Tan, or the Plaintiffs’ complaint as it stood at and after the trial. Neither have the Plaintiffs addressed this in their closing or reply submissions. I therefore find that the Plaintiffs have failed to make out their complaint or claim in respect of this item. 201Item D: “the letterbox is not upgraded for Block 53 and the new letterbox at Block 51 is far bigger and of a superior design than the existing old box at Block 53”.This is a complaint in similar vein as the foregoing: (a) First, it was undisputed that letterbox at Block 53 had been replaced in 1998, whereas the letterbox at Block 51 had never been replaced since Block 51 was built in the 1990s. In my view, it is unreasonable to insist that MCST 1024 must have, in 2008, procured for Block 51 a letterbox of a design identical to that procured for Block 53 in 1998, some ten years ago. Indeed, scouring the market for such a design in 2008, even if such a design was available in 2008 (as Sarah Tham testified),341Foot Note 341×Notes of Evidence 11 February 2014 at p 66could have been costly and unproductive. (b) Secondly, there were no particulars of this complaint other than a retreat to generalities. From the photographs,342Foot Note 342×AEIC of Sarah Tham at p 56.each letterbox at Block 51 looks bigger, however there are no dimensions to show if the overall size of the Block 51 letterbox structure was larger than the letterbox structure at Block 53. (c) Thirdly, from the photographs, I note that Block 51 has nine letterboxes in a three-by-three configuration with two letterboxes below them but spanning the same width, making it a total of 11 letterboxes. In contrast, the Block 53 letterboxes were divided into two segments with each segment containing 12 letterboxes in a two-by-six configuration; this makes a total of 24 letterboxes. At the time of trial, I am told that Block 51 had 8 SPs owning 8 units and Block 53 had 11 units owned by 11 SPs. Why the number of letterboxes per block were discrepant was not explained. I was also not told if each SP in Block 53 had more than one letterbox. These differences were not even touched upon by the Plaintiffs. (d) Thirdly, in comparing these photographs, one cannot say that the new letterbox at Block 51 is “far bigger and of a superior design” to that at Block 53. How they are superior or larger is not spelt out. From the photographs, their exteriors look similar and are simply of different designs. The Plaintiffs’ closing and reply submissions also did not address this item. I therefore find that the Plaintiffs have not made out their complaint in Item D. 202Item E: “only plastic signs were installed for Block 53 whereas solid aluminium, brass or metal signs were installed for Block 51”.The Plaintiffs claimed in their pleadings that only plastic signs were installed forBlock 53 whereas solid aluminium brass, brass or metal signs were installed for Block 51. However, in Sarah Tham’s AEIC, she complains that there were signs for the passenger and cargo lift installed at every floor at Block 51 whereas there was no such signs in Block 53.343Foot Note 343×AEIC of Sarah Tham at [24]Her AEIC did not state or identify which signs were in plastic and which were in metal. From the evidence, the signsfall into three broad categories, according to the items of common property to which they relate: (i) the risers and hose reels; (ii) the lifts; and (iii) the staircases. I note the Plaintiffs did not specifically identify the categories of signs with which they took issue. 203The Defendant’s evidence, which I accept, as well as the documentary evidence, is as follows: (a) First, Block 51 had three sets of signs: “Electrical Riser”, “Telephone Riser” and “Fire Hosereel” for the simple reason that whilst Block 51 had been designed and built with proper shafts for these risers and the hosereel, Block 53 did not have such shafts.344Foot Note 344×DAEIC at [181]This was a fact and could not be challenged by the Plaintiffs. That said, the signs in relation to the risers, hose reels, and staircases were not commented upon by the witnesses for the Plaintiffs, and were not referred to by the Plaintiffs in their submissions. There is accordingly no substance to this complaint. (b) Secondly, Sarah Tham deposed that the there was “signage for the passenger and cargo lift installed on every floor in Block 51”.345Foot Note 345×AEIC of Sarah Tham at [24]It emerged in cross-examination that there were two lifts, a cargo lift and a passenger lift in Block 51 whereas there was only one lift in Block 53. Under cross-examination, Sarah Tham eventually accepted this as a fact and conceded there was therefore no need for Block 53 to have a similar set of signs for the lift. She then changed her allegation to one that “[i]f the signage is done in [sic] a reasonable price, I think it is acceptable, but it was not”.346Foot Note 346×11/2 pp 18–20This was a belated allegation that was not borne out in the pleadings and evidence of the other witnesses of the Plaintiff, and I reject it. There is accordingly no substance to this aspect of the complaint as well. (c) Thirdly, Sarah Tham complained that the lift signage at Block 51 comprised “solid aluminium letters or cut out solid brass letters with gold plated, lacquered finish”. In contrast, “[t]he lift in Block 53 does not have any lettering” but only plain acrylic signs.347Foot Note 347×AEIC of Sarah Tham at [24]As depicted in the photos exhibited by Sarah Tham in her AEIC, the words “Passenger Lift” and “Goods Lift” are spelt out with individually cut-out aluminium and brass letters at the lift lobbies of Block 51 but as Sarah Tham had conceded, for obvious reasons, there was no need to similarly label the one lift at Block 53. 204I note that the aluminium and brass letters that were installed to label the lifts at Block 53 simply replaced similar cut-out metal letters, some of which had fallen off over time.348Foot Note 348×2AB745This too was accepted by Sarah Tham.349Foot Note 349×Notes of Evidence 11 February 2014 at pp 20–21Although the Defendant deposed further that “for the signage in [B]lock 51, the subsidiary proprietors sponsored part of the cost of the replacement”,350Foot Note 350×DAEIC at [181]I note that the Defendant tendered no documentary evidence in support of this allegation. Nevertheless, the Plaintiffs did not dispute this assertion, either at trial or in their submissions. Accordingly, I find that the Plaintiffs have not made out their allegations in relation to the signs at Block 51 and Block 53. 205I observe further that signs bearing the additional messages warning against the use of the lift in the event of fire and describing the “maximum design load” are found at both lobbies, albeit engraved on polished metal at Block 51 but printed on acrylic at Block 53.351Foot Note 351×2AB694–695It was put to Sarah Tham and she grudgingly accepted that there was a “one to one replacement” of these signs and “when there was previously one sign, we now replace it with a new sign”.352Foot Note 352×11/2 pp at 20–21These differences were historical and existed long before these disputes arose. I therefore find and hold that the Plaintiffs have not made out their complaints in Item E of Annex B. 206Item F: “the toilet doors and door handles are of a lower grade for Block 53”.I consider first the door handles and then the doors themselves. (a) The photographs exhibited by the parties show little visible difference in quality between the door handles in Block 51 and Block 53.353Foot Note 353×2AB737The Plaintiffs adduced no documentary evidence and did not explain or elaborate why the door handles in Block 53 are of a lower grade. Sarah Tham made no specific submissions in relation to the door handles and did not challenge the evidence of the Defendant during cross-examination that the handles of the toilet doors “are of the same quality”.354Foot Note 354×DAEIC at [182]Accordingly, the Plaintiffs have not established their allegations in relation to the door handles at Block 51 and Block 53. (b) The works on the toilet doors at Block 51 were performed by Kian Wah. As stated in the invoices issued by Kian Wah, these works were simply to “modify existing door/ door head & door frame in re-con Zebrano veneer & veneer ply finish”.355Foot Note 355×1AB485These invoices were made out to MH Singapore,356Foot Note 356×1AB485, 522and under cross-examination, Sarah Tham accepted that some subsidiary proprietors had paid for some of the renovation works themselves. However, when shown documentary evidence that MH Singapore had made separate payment for the joinery work, she continued to refuse to acknowledge the clear contents of the documentary evidence.357Foot Note 357×7/2 pp 105–109I therefore do not accept her denials on the evidence on this score. I find that the Defendant had paid for the difference in the cost. (c) However, Sarah Tham asserted subsequently that the differences in the appearances of the toilet doors at Block 51 could not be attributed solely to the works performed by Kian Wah under the invoices above. She explained that the amount under these invoices did not tally with the amount of expenditure, $492,000.00, that the Plaintiffs claim was incurred without authorisation.358Foot Note 358×Notes of Evidence 7 February 2014 at pp 107–108I do not accept this evidence. It conflated the Plaintiffs’ claims in relation to the Annex A Works and the Annex B Works, and are irrelevant to the Plaintiffs’ allegation that the toilet doors at Block 53 are of lower quality than those at Block 51. That said, KL Tan, who had been sitting in the courtroom, had at this point been shaking his head rather vigorously at various points of the cross-examination and I had to warn him against doing so.359Foot Note 359×Notes of Evidence 7 February 2014 at p 108On balance, I find that MH Singapore had paid for the costs of laminating the toilet doors at Block 51. Accordingly, the Plaintiffs have not established their allegations in relation to the toilet doors at Block 51 and Block 53. 207Item G: “the fire escape doors were not upgraded for Block 53”.The Defendant deposed that the fire escape doors in Block 53 had been changed in 2002 at a cost of $10,433.90 whereas those in Block 51 had not been changed since its inception in the 1980s.360Foot Note 360×DAEIC at pp 525I note that the cost of changing the fire doors at Block 51 was $7,488.00 ($8,012.16, including GST).361Foot Note 361×1AB500 (Item 1) and 525 (Item 1)This was not challenged by the Plaintiffs, with Sarah Tham, CY Lim, and KL Tan giving no evidence on the fire escape doors. Accordingly, the Plaintiffs’ have not made out their complaint of unequal treatment in relation to these works. 208The Defendant submitted, which I accept, that in Block 53, there were no doors leading off the lift lobbies whereas in Block 51 there were. The differences in the layout can clearly be seen in the floor plans of Block 53, which do not indicate doors to the staircase and with the toilets at the other end of the corridor. When the lift lobby works were carried out, these doors at the Block 51 lobbies were replaced on a one-to-one basis. Sarah Tham had no alternative but to agree to this under cross-examination.362Foot Note 362×Notes of Evidence 11 February 2014 at pp 4–6However, in reviewing the evidence after the trial, I discoveredonephotograph of the fifth floor lobby, Block 53, which shows two doors.363Foot Note 363×See 1AB724I note that the units at the fifth floor of Block 53 are owned by SPs in the Mok Camp. However, this evidence was not referred to by anyone at trial. 209Item H: “the toilet fixtures, sanitary ware and accessories are of a lower quality for Block 53. For Block 51, the toilets are working of grade A office blocks, some complete with shower and water heater”.I note at the outset that the Plaintiffs adduced no evidence on what “grade A office blocks” entail, or that the toilets in Block 51 were of such a standard. Sarah Tham deposed only that the ground floorlobby(and not the toilets) of Block 51 is of such a standard.364Foot Note 364×AEIC of Sarah Tham at [30]As for the works themselves, I make three points: (a) The Defendant gave evidence that the tiles used at the toilets in Block 51 and Block 53 were sourced from the same country of manufacture. However, due to the fact that the Blocks were renovated at different times, the tiles used were different. Further, the SPs in Block 51 paid for the additional fixtures at the toilets there.365Foot Note 365×DAEIC at [184]The Defendants adduced invoices showing that the cost of the tiles and veneer doors at Block 51 were billed to CK Loo, MH Singapore, or other SPs in Block 51.366Foot Note 366×1AB451, 472, 481, 483, 521, 540–542The Plaintiffs did not adduce or point to any evidence to the contrary. I note too that there were no payment vouchers reflecting that MCST 1024 had paid for these works. (b) Nevertheless, there is evidence that flush sensors and glass divided urinals were installed at the toilets in Block 51 but not at Block 53. In this regard, the Defendant deposed that flush sensors were necessary due to the smaller size of the toilet at Block 51. Further, at the time when the toilets in Block 51 were renovated in 2009, flush sensors were commonplace at most public buildings, and installing the same at Block 51 was simply part of keeping Block 51 in a state of good and serviceable repair.367Foot Note 367×DAEIC at [186]–[192]CK Loo, who had procured the urinals at Block 51 and Block 53 broadly confirmed the same in his evidence.368Foot Note 368×Notes of Evidence 24 September 2014 at pp 125–137 (c) Even so, the Plaintiffs have made no specific allegations in their closing and reply submissions on the installation of flush sensors and glass divided urinals at Block 51, beyond the fact that such works were “clearly improvements and not merely like-for-like repairs and maintenance”.369Foot Note 369×PRS at [58]The duty of MCST 1024 to keep the common property in a state of good and serviceable extends to the undertaking of works necessary to keep it in a state of good and serviceable repair (see [105] above). Further, the Plaintiffs have not disputed the evidence that urinals with flush sensors were necessary due to the smaller size of the toilet at Block 51. On balance, I am unable to accept that the installation of flush sensors and glass divided urinals at Block 51 was wrongful. Accordingly, I found that the Plaintiffs have not established their allegations of unequal treatment in relation to these works. 210It is worth noting the following three complaints by the Plaintiffs: (a) First, Sarah Tham made an unfounded allegation that glass swing doors were installed for the toilets in Bock 51.370Foot Note 370×Notes of Evidence 11 February 2014 at p 53The Defendant corrected that with his evidence that only the second floor toilet had a glass swing door because that was the designated handicap toilet for the whole development. A larger access was required hence the glass swing door was installed.371Foot Note 371×Notes of Evidence 11 February 2014 at pp 54–55The Defendant correctly pointed out in his submissions that this was a sacrifice of the SP on the second floor of Block 51 (an SP in the Mok Camp) because more cubicles could not be constructed and the handicap toilet could only be used by one person at a time.372Foot Note 372×DCS at [263] (b) Secondly, Sarah Tham also alleged that the toilet bowls in Block 51 were of a superior quality. However, she was not able to say how or why they were superior. In the event, she had to concede that they were just of different brands.373Foot Note 373×Notes of Evidence 11 February 2014 at p 56 (c) Thirdly, Sarah Tham disingenuously said that the toilets on the first and fifth floors of Block 53 were renovated but the third and fourth floor toilets were not. Under cross-examination, Sarah Tham had to admit that once the judgment in OS300/2009 was handed down on 12 April 2010, which held that the toilets on the third and fourth floor were common property, the Defendant proposed a resolution to renovate the third and fourth floor toilets at the first available opportunity on the 26th AGM (6 October 2010), but the Plaintiffs’ Camp voted against that resolution thereby defeating the same. Sarah Tham had no real answer as to why they cast such a vote and yet proceeded to make this complaint before me. Again these complaints were not raised in the Plaintiffs’ closing or reply submissions and I have little hesitation in dismissing them. 211Item I: “the electrical distribution boxes are exposed and in disrepair for Block 53 whereas those at Block 51 were neatly covered up with a tailor-made design doors”.The Defendant deposed that there had always been a door to the electrical distribution box at Block 51. In contrast, the electrical distribution box at Block 53 had always been left exposed “as the said Block never had any risers”. This difference was attributable to the fact that the Blocks were “built by different architects / contractors”.374Foot Note 374×DAEIC at [185]–[186]Sarah Tham did not dispute this evidence, and accepted that the electrical distribution box at Block 53 had always been left exposed. However, she insisted in cross-examination that the electrical distribution box at Block 53 should have been covered up “[b]ecause we are also contributing to the management sinking fund”.375Foot Note 375×Notes of Evidence 11 February 2014 at pp 13–15The Plaintiffs did not offer any evidence to show that this state of affairs should have been rectified as a matter of safety or compliance with any codes, nor have they raised this in any general meeting as an item for discussion if they felt it should be remedied. Nevertheless, the Plaintiffs did not take this up in their closing and reply submissions. CY Lim and KL Tan did not give evidence on the electrical distribution boxes. Accordingly, I find that the Plaintiffs have failed to establish their allegations of unequal treatment in relation to these works.",
        "Lift mechanism": "212For completeness, I note that the Plaintiffs dedicated a substantial portion of their submissions on the Annex B Works to the Defendant’s omission to even consider changing the lift mechanism at Block 53, which “is extremely old and old-fashioned”, despite frequent requests from the SPs in Block 51 to do so.376Foot Note 376×PCS at [160]–[164]I note the Plaintiffs were able to table this at any time as part of an item to be discussed at an AGM and put to the vote. However there is no evidence that they have ever attempted to do so. Whilst they did raise this on a few occasions at general meetings, they never insisted it be put to a vote. 213The short answer to this is that the Plaintiffs have made no mention of the lift mechanism at Block 53 in their pleadings, and brought the issue up for the first time in their closing submissions. I am therefore unable to accept the Plaintiffs’ allegations in relation to the lift mechanism at Block 53 as an issue in this trial. MH Asia 214Finally, the Plaintiffs raise three issues with the appointment of MH Asia: (a) First, the Defendant appointed MH Asia as managing agent of MCST 1024 without the approval of the Council or a general meeting in breach of s 66(1) of the BMSMA. (b) Secondly, the Defendant failed to disclose his pecuniary interest in MH Asia and decline to participate in the appointment decision in breach of s 60(1) of the BMSMA. (c) Thirdly, the Defendant used his position as Chairman to appoint MH Asia and gained an advantage for himself or for MH Asia via an $8,000 payment from MCST 1024 to MH Asia in breach of s 61(2) of the BMSMA.377Foot Note 377×PCS at [144]; PRS [103] 215The Defendant denies the Plaintiffs’ claims, and makes the following submissions: (a) First, MH Asia was appointed to fulfil a need for administrative services by MCST 1024.378Foot Note 378×DCS at [305]–[307] (b) Secondly, MH Asia (and MH Realty before it) provided only administrative and book-keeping services to MCST 1024. No resolution was needed to appoint it.379Foot Note 379×DCS at [312] (c) Thirdly, no separate declaration of the Defendant’s interest in MH Asia required since the Plaintiffs were clearly aware of the Defendant’s interest in MH Asia.380Foot Note 380×DCS at [322]–[329] (d) Fourthly, the Plaintiffs are not entitled to seek damages for breach of statutory duty since they have no civil right of action against the Defendant arising from any such breach, and, in any event, no damage has been suffered.381Foot Note 381×DCS at [330] 216At this juncture, it bears mention that the Plaintiffs donotseek damages against the Defendant in respect of these alleged breaches of duty. Rather, they pray in their SOC only for adeclarationthat the Defendant “did not at [sic]act honestly with regard to the unilateral appointment of [MH Asia] as managing agent of MCST 1024 and unauthorized payment of S$8,000 to the purported Managing Agent, [MH Asia]” (see [68] above).",
        "Status of MH Asia": "217The appointment of a managing agent by a management corporation is not mandatory under the BMSMA. That said, in view of the increasing complexities of the BMSMA, the various procedures that need to be followed, and the onerous duties imposed by the BMSMA on a management corporation, management corporations increasingly appoint managing agents to relieve them of most of these duties, as well as their day-to-day administration of the strata scheme (seeStrata Titleat para 14.01). This is provided for in s 67 of the BMSMA, which reads: Delegated duty and liability of managing agent 67.—(1) Subject to subsection (2), a management corporation may, by instrument in writing, delegate to its managing agent appointed under section 66(1) — (a) all of its powers, duties and functions; (b) any one or more of its powers, duties and functions specified in the instrument; or (c) all of its powers, duties and functions except those specified in the instrument. … 218As Prof Teo observes inStrata Titleat para 14.39, however, the BMSMA is silent on when it is appropriate for a management corporation to delegate its powers to a managing agent, and when it suffices the management corporation to employ an agentsimpliciterto carry out tasks on its behalf under r 12 of the Building Maintenance (Strata Management Regulations) 2005 (S 192/2005), which provides: Agents and employees of council, etc. 12. A council of a management corporation and an executive committee of a subsidiary management corporation may employ, on behalf of the management corporation and subsidiary management corporation, respectively, such agents or employees as it thinks necessary in connection with the exercise and performance of the powers, duties and functions of the management corporation and subsidiary management corporation. 219Accordingly, difficulties may arise in a particular case in determining whether, in the circumstances, a person is acting as a managing agent or performing only managerial services (seeStrata Titleat para 14.40). Much would therefore depend on the nature of the powers, duties, and functions delegated. 220The Plaintiffs make no submission on the actual powers, duties, and functions that were delegated to and performed by MH Asia. They allege only that MH Asia had simply “tak[en] over the works of MH Realty”, which had been recorded to have been performing “management and administration” works, and “preparing financial statements, keeping books of account, sending bills/notices and other secretarial/administrative matters”, in the minutes of the 8th AGM in 1992 and the 11th AGM in 1995 respectively. Further, the appointment of MH Realty had been described as that of a “Managing Agent”.382Foot Note 382×PCS at [147]–[148] 221In my view, MH Asia (and MH Realty before it) performed only administrative and book-keeping services for MCST 1024. Sarah Tham gave evidence that MH Asia performed the same services as those performed by MH Realty, and that she had never seen MH Realty sign off as managing agent. Further the payment vouchers made out to MH Realty, and subsequently to MH Asia, reflect the provision of only administration and book-keeping services.383Foot Note 383×Notes of Evidence 11 February 2014 at p 74Accordingly, I am unable to accept the Plaintiffs’ contention that MH Asia was appointed as managing agent of MCST 1024.",
        "Duties of Chairman": "222The duty of the members of the council of a management corporation is fiduciary in nature and analogous to that of company directors (seeFu Loong (CA)at [27]). InRe Steeland Others and the Conveyancing (Strata Titles) Act, 1961(1968) 88 WN (Pt 1) (NSW) 467 at 470, Else-Mitchell J held: [M]embers of the council of a body corporate under the Conveyancing (Strata Titles) Act … are at least in a position analogous to company directors; … it is their duty to manage the affairs of the body corporate for the benefit of all the lot holders, and that the exercise of any of their powers in circumstances which might suggest a conflict of interest and duty requires them to justify their conduct, and that the onus lies on them to prove affirmatively that they have not acted in their own interests or for their own benefit. 223Similarly, s 61 of the BMSMA provides for, in appropriate cases, imprisonment, fine, and/or disgorgement of profits: Duty and liability of council members and officers 61.—(1) A member of a council shall at all times act honestly and use reasonable diligence in the discharge of the duties of his office. (2) A member of a council … shall not use his position … to gain, directly or indirectly, an advantage for himself or for any other person or to cause detriment to the management corporation. … (4) This section shall be in addition to and not in derogation of any other written law or rule of law relating to the duty or liability of members of a council. … 224Further, s 60 of the BMSMA mandates: Disclosure of interests in contracts, property, offices, etc. 60.—(1) … if a member of a council has a pecuniary interest, direct or indirect, in any contract, proposed contract or other matter which is before any meeting of the council or management corporation, he shall at that meeting — (a) declare the nature of his interest; (b) not take part in the consideration or discussion of, or vote on any question with respect to, that contract or proposed contract or other matter; and (c) if the chairman or the person presiding at that meeting so directs, withdraw from the meeting during the consideration or discussion unless asked by the council to be present to provide information. (2)  The requirements of subsection (1) shall not apply in any case where the interest of the member of a council consists only of being a member or creditor of a company which is interested in a contract or proposed contract with the management corporation if the interest of the member may properly be regarded as not being a material interest. … 225Theraisond'etrefor these rules is “to prevent abuse, malpractice and corruption” by members of the council (Singapore Parliamentary Debates, Official Report(28 July 1987) vol 49 at col 1412 (Prof S Jayakumar, Second Minister for Law)). 226The Defendant admits that he is a shareholder of MH Asia.384Foot Note 384×DAEIC at [199]However, he submits that he did not need to declare his interest in MH Asia since “the Plaintiffs were clearly already aware of [it]”.385Foot Note 385×DCS at [324]Further the Defendant’s interest in MH Asia was not a “material interest” under s 60(2) of the BMSMA, and he was thus exempted from the need to declare his interest.386Foot Note 386×DCS at [332]The Defendant adds that MH Asia simply “continued to seamlessly perform the functions [MH Realty] had erstwhile been performing for the MCST”. He had “belatedly realized that MHR[ealty]’s winding up would affect MHR[ealty]’s charges for the services provided to the MCST” and thus “sent a letter to the [SPs] and Council Members on 5 August 2009” to “[i]nform the SPs that MH Asia would takeover MHR[ealty]’s services temporarily” and to request “interested parties to put forward some names for the provision of the same services”. When SPs in the Plaintiffs’ Camp objected to MH Asia’s appointment, the Defendant replied that their “points are noted and will be included in the forthcoming [AGM]”, to which there was no further response from the SPs.387Foot Note 387×DCS at [296]–[300]Presumably, his submission is that the SPs had acquiesced in the appointment of MH Asia. 227I am unable to accept that the Defendant has no material interest in MH Asia. First, the Defendant is a director of MH Asia.388Foot Note 388×1AB1023Although he only holds one share in MH Asia, all the other shares are held by MH Singapore.389Foot Note 389×1AB1024Secondly, the Defendant is the managing director of MH Singapore, and together with his wife own at least 18% of the shares in MH Singapore.390Foot Note 390×Notes of Evidence 20 February 2014 at p 119The other 21 shareholders in MH Singapore are all from the Mok family, save for Thomas Neo, who is also a fellow director of MH Asia and who gave evidence on behalf of the Defendant in these proceedings, and two others, Lee Chor Ying and Leong Sow Yong.391Foot Note 391×Sarah Tham’s AEIC at [5]That 18% shareholding, in the absence of evidence to the contrary, does appear as the largest block of shares purely on an average. Thirdly and most importantly, there is clear evidence that the Defendant was considered the patriarch of the Mok family, whom everyone in the family “look up to you as a senior member of the family and defer to you in most decisions”.392Foot Note 392×Notes of Evidence 17 September 2014 at p 97In these circumstances, the submission that the Defendant does not have a material interest in MH Asia is quite misleading. 228Further, there is no dispute that the Defendant had procured the appointment of MH AsiaquaChairman, and that $8,000.00 was paid by MCST 1024 to MH Asia, of which the Defendant is a shareholder. This $8,000.00 was paid in tranches of $6,000.00 on 6 August 2009, and $1,000.00 on each of 27 August 2009 and 28 September 2009.393Foot Note 393×1AB675, 676, 685The Defendant clearly used his position to gain, directly or indirectly, an advantage for himself or MH Asia. One needs to look no further than the Defendant’s submission that MH Asia was appointed to ensure MH Realty’s winding up did not “affect MH[Realty]’schargesfor the services provided to the MCST” [emphasis added]. 229The Defendant explained that MH Asia was appointed as a “temporary measure to assist MCST I024 in fulfilling its administrative duties”.394Foot Note 394×DAEIC at [200]Further, the rate of $1,000.00 per month paid to MH Asia was the same as that paid to MH Realty.395Foot Note 395×DCS at [302]This does not assist him. The duty of a member of the Council under ss 60 and 61 of the BMSMA, as well as at common law, is clear. As early as 1 February 2009, and on the first day of each of the seven months thereafter, MH Asia had issued debit notes for $1,000.00 to MCST 1024 “for accounting services for the month”.396Foot Note 396×1AB465, 471, 485, 504, 518, 523, 529, 535The Defendant was a shareholder of both MH Realty and MH Asia, as well as Chairman of MCST 1024. He must have known of the winding up of MH Realty, and had appointed MH Asia in its place. Yet he neither placed the appointment of MH Asia before nor declared his interest in MH Asia to either the Council or the SPs in general meeting. Instead, he appointed MH Asia unilaterally, kept the Council and the SPs in the dark on MH Asia until 5 August 2009, and procured theretrospectivepayment of $6,000.00 to MH Asia (for work done from February to July 2009) the very next day.397Foot Note 397×1AB675In doing so, the Defendant used his position to gain, directly or indirectly, an advantage for himself or MH Asia. This was a breach of duty under ss 60 and 61 of the BMSMA, as well as at common law. 230As noted above, the Plaintiffs limit their claims in respect of MH Asia to a declaration that the Defendant breached his duty as Chairman in the appointment of MH Asia. There is thus no need for me to consider the losses that they or MCST 1024 have suffered as a result of such breach. All that I will therefore do is observe that Sarah Tham accepts,inter alia, that MCST 1024 was in need of book-keeping and administrative services following the winding up of MH Realty, that MH Asia was simply “stepping into the shoes of” MH Realty, and that their objection to the appointment of MH Asia was “technical”.398Foot Note 398×Notes of Evidence 11 February 2014 at pp 77–81 Conclusion 231I find that the Plaintiffs have not established theirlocusstandito prosecute this Suit. Accordingly, I dismiss the Plaintiffs’ claims against the Defendant. In consequence, the Defendant’s claims for relief against the third parties, which are premised on the Defendant’s liability to the Plaintiffs, are also dismissed. 232Even if I am wrong on my conclusions as to the Plaintiffs’locusstandi, I find that they have not established their claims in respect of the Annex A Works and the Annex B Works. In such an event, I decline to grant the declarations sought by the Plaintiffs (see [68] above) insofar as they relate to the Annex A Works and the Annex B Works. However, I will grant the following declaration in relation to the appointment of MH Asia by the Defendant: The Defendant has breached his duties as Chairman under ss 60 and 61 of the BMSMA in (a) failing to place the appointment of MH Asia before and to declare his interest in MH Asia either the Council or the SPs in general meeting; and (b) appointing MH Asia unilaterally and then procuring the retrospective payment of $6,000.00 to MH Asia for its work carried out between February 2009 and July 2009.  233I will hear parties on costs. Quentin LohJudge Leo Cheng Suan and Teh Ee-Von (Infinitus Law Corporation)for the plaintiffs;Lee PengKhoon Edwin and Poonaam Bai d/o Ramakrishnan Gnanasekaran (Eldan Law LLP) for the defendant;Lam Wai Seng (Lam WS & Co) for thefirstto fourth third parties;Tan TianLuhand Ling Zixian (Chancery Law Corporation)for thefifththird party."
    }
}