{
    "case_title": "Public Prosecutor v Chow Chian Yow Joseph Brian",
    "ncitation": "[2017] SGHC 18",
    "coram": "George Wei J",
    "sections": {
        "Introduction": "1 The phenomenon known as “parallel importation” is broadly concerned with situations where a third party, without the consent of the proprietor of an intellectual property right, imports the proprietor’s goods that are legitimately produced in Country A into Country B, to be distributed and sold “in parallel to” and in competition with identical goods sold through the proprietor’s authorised distribution networks in Country B. 2 Parallel imports are to be distinguished from counterfeit (infringing) goods. Parallel imports are genuine goods, in the sense that they originate from the proprietor or its licensee; conversely, counterfeit goods are not. Parallel imports are, in this way, essentially concerned with goods made and first released into the market by the owners or licensees of intellectual property rights. For the purposes of this decision, which concerns trade mark law, counterfeit goods are generally goods to which the trade mark has been applied without the consent of the proprietor or its licensee. 3 Parallel importation lies at the interface between competition and intellectual property law. On the one hand, it is argued that consumers benefit from parallel importation because of increased intra-brand competition, which leads to reduced prices. On the other hand, proprietors of intellectual property rights may have an understandable commercial desire to prevent parallel importations, in order to preserve and enhance the commercial value of their rights. Owners of intellectual property rights stress the “national” nature of intellectual property rights within the “global” market place, and emphasise the important role these national rights play in securing and protecting access to the individual markets. Conversely, parallel importers and consumers focus on the importance of competition, the fact that the goods are genuine, and the need for a principle of “exhaustion of rights” in the national and international marketplace. These are the background concerns which have arisen in the present suit. 4 In the present suit, the Plaintiff, a trade mark proprietor, sued the Defendant, a parallel importer, for trade mark infringement arising from the importation of a shipment of backpacks bearing the Plaintiff’s trade marks into Singapore. The Defendant raised the defence that the Plaintiff’s rights had been exhausted under s 29 of the Trade Marks Act (Cap 332, 2005 Rev Ed) (“TMA”). The Plaintiff then filed an application for summary determination under O 14 r 12 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“Rules of Court”) against the Defendant, essentially requesting for a determination of the scope of the defence. It also applied for summary judgment against the Defendant. 5 After hearing the parties, I reserved my judgment. I now deliver my decision on the application, beginning with the background facts.",
        "Background facts": "6 The Plaintiff, Samsonite IP Holdings Sarl (“Samsonite”), is a company incorporated in Luxembourg. It is the registered proprietor of various trademarks relating to the SAMSONITE brand (hereafter referred to collectively as the “SAMSONITE Marks”) around the world, including in Singapore and China. The SAMSONITE Marks comprise of the following words and symbols: Trade Mark NoTrade MarkClassSpecificationT9800905G9Bags adapted for photographic, video, telephone apparatus and instruments;binoculars and binocular cases; bags adapted for equipment; bags adapted for carrying computers.T0601901H9Electronic calculator type currency convertors; eyeglasses and eyeglass cases; bags adapted for  photographic, video, audio, electronic and computer equipment; cases adapted for telephones; binoculars and cases adapted for binoculars; cases adapted for calculators; luggage alarms; electronic calculators for converting currency; electrical current convertor adapter apparatus, all for sale in kit form; electrical current convertors; electrical plug adapter apparatus, all for sale in kit form; electric clothing steamers, electric clothing steam irons; neck and shoulder straps for photographic and video equipment; tripods for photographic and video equipment, travel electric clothing irons.T0601902F16Document portfolios, writing instruments, diaries [printed matter], agendas [printed matter], pencils, pens [writing instruments],  check book holders, notebook cases, pocket calendars, desk sets [office requisites].T0815865A18Luggage, suitcases; travelling bags; bags for toiletry kits, messenger bags, weekend bags, garment bags, duffle bags, wheeled duffle bags, totes, wheeled totes, beauty cases (not fitted), backpacks, school bags, sports bags, other than adapted (shaped) to contain specific sports apparatus; business cases [leather cases], shoulder bags, briefcases, pilots' bags, key holders, key cases, coin holders, credit card holders, wallets, purses, billfolds, portfolios (other than stationery), umbrellas.T0601904B18Luggage, billfolds, leather wallets, key cases, business card cases made of leather, coin purses, handbags, purses, organizers for bags and suitcases, all being bags; tote bags, backpacks, umbrellas, money holders [pocket wallets], belt bags for holding money; men's bags and cases for shaving kits; cosmetic bags [not fitted]; traveling cases for lingerie and shoes; jewellery organizers in the nature of bags; collapsible shopping bags; passport clutch bags; toiletry bags; luggage straps; luggage tags; luggage strap shoulder protectors, briefcases; backpacks and handbags including school book bags and book bags.T9800906E18Luggage; garment bags; business cases; duffle bags; bags; umbrellas; trunks; travelling bags; attaché cases; back packs; billfolds; credit card cases; key cases; tote bags; purses; handbags; wallets; waist bags; neck money holders; holster money holders; empty shaving kits for men; cases for cosmetic articles; empty toiletry cases; passport holders; luggage straps; luggage taps.T7152282I18Trunks, suitcases, travelling bags and the like, all being goods included in Class 18.T7357154A18Trunks, suitcases, travelling bags, knapsacks, rucksacks; bags and articles made from leather or from imitation leather, all included in Class 18.T0601908E35Retail stores featuring luggage and travel accessories. 7 The Plaintiff and its related companies have been designing, manufacturing and selling bags, backpacks, luggage and travel accessories under the SAMSONITE name and brand for years.1Foot Note 1×Statement of Claim (“SOC”) paras 1-4.The intellectual property policy of the Samsonite group of companies is such that its subsidiary operating in a specific country or territory is allowed to use the SAMSONITE Marks only in that country or designated territory. In accordance with this policy, the Plaintiff granted to its subsidiary located in China, Samsonite International Trade (Ningbo) Co, Ltd (“Samsonite China”), a licence to use the SAMSONITE Marks only in China.2Foot Note 2×3rd affidavit of Richard Andrew Lamb para 12. 8 The Defendant, An Sheng Trading Pte Ltd,is a company incorporated in Singapore. 9 On 1 July 2015, the Plaintiff’s solicitors received a Notice of Detention of Goods from the Singapore Customs, stating that a shipment comprising of 2,328 backpacks bearing the SAMSONITE Marks had been imported into Singapore. The backpacks were duly detained by the Singapore Customs. I shall refer to this shipment of backpacks as “the Detained Backpacks”. The Defendant was subsequently identified as the importer of the Detained Backpacks. 10 The Plaintiff was authorised by the Singapore Customs to conduct an inspection of two samples of the Detained Backpacks. Its inspection confirmed that the Detained Backpacks included two models covered under a co-branding agreement between Samsonite China and Lenovo PC HK Ltd (“Lenovo”).3Foot Note 3×SOC para 6 and 3rd affidavit of Richard Andrew Lamb para 8Lenovo is a manufacturer and distributor of computers and laptops. 11 Under the terms of the co-branding agreement, Samsonite China was to manufacture and supply specific models of computer cases and backpacks to Lenovo (“the co-branded backpacks”). The co-branded backpacks manufactured by Samsonite China specifically for the co-branding agreement was required to bear at least one of the SAMSONITE Marks as well as the LENOVO trade mark. The LENOVO mark was either stitched to the inside of the backpack, or printed on a hand tag tied to the co-branded backpack. 12 Under the terms of the co-branding agreement it was provided,inter alia, that in consideration for the supply of the co-branded backpacks, Lenovo will give away for free the co-branded backpacks in conjunction with the sale of certain models of LENOVO laptops, exclusively in China. I note that the parties accepted during the hearing that neither the Plaintiff nor Samsonite China received direct remuneration or consideration for the manufacture and supply of the co-branded backpacks. 13 Lenovo and its retailers and distributors were prohibited from selling or otherwise disposing of the co-branded backpacksindependently fromthe sale of a LENOVO laptop in China. Lenovo was also obliged to ensure that its China-based distributors and retailers complied with the terms of the co-branding agreement.4Foot Note 4×1st affidavit of Lingguo Chen, para 5; 3rd affidavit of Richard Andrew Lamb para 13To be clear, there is no assertion in the material before me that the LENOVO laptops would bear a SAMSONITE trade mark. 14 The Plaintiff and Samsonite China also took steps to prevent the unauthorised sale of the co-branded backpacks. For instance, they conducted market surveillance of such unauthorised sales. Additionally, Samsonite China worked with Lenovo to enforce the terms of the co-branding agreement.5Foot Note 5×1st affidavit of Lingguo Chen, paras 6-7; 3rd affidavit of Richard Andrew Lamb para 15 15 It was undisputed during the hearing before me that the Defendant came to acquire the Detained Backpacks in the following manner. The Detained Backpacks were first manufactured by Samsonite China and supplied to Lenovo pursuant to the co-branding agreement. Lenovo duly passed them on to its authorised distributors and retailers to be given away for free in conjunction with LENOVO laptops. However, some of these authorised dealers sold theunbundledDetained Backpacks, that is,withoutthe LENOVO laptops, to unauthorised dealers. The unauthorised dealers subsequently sold the unbundled Detained Backpacks to the Defendant, a parallel importer.6Foot Note 6×See also 3rd affidavit of Heng Zhi An para 32The following two diagrams illustrate the disparity between the envisioned pathway of co-branded backpacks under the co-branding agreement (“Path One”), and the pathway of the Detained Backpacks in the present case (“Path Two”):      16 From the above analysis, it must necessarily follow that the Detained Backpacks are genuine SAMSONITE products, in the sense that they originated from Samsonite China, a licensee of the Plaintiff trade mark proprietor. 17 In this regard, I note that the director of the Defendant, Mr Heng Zhi An (“Mr Heng”), stated that he possessed a backpack “of the same make” as the Detained Backpacks. Mr Heng said that he then provided the Product Identification Number to Samsonite’s customer service division in Hong Kong (“Samsonite Hong Kong”), and sought confirmation on whether the backpack was an authentic SAMSONITE product. Samsonite Hong Kong duly confirmed that it was genuine. The Plaintiff, in its submissions, had sought to cast doubt on this verification process, stating that there was no evidence that the backpack examined by Samsonite Hong Kong was from the same batch as the Detained Backpacks.7Foot Note 7×3rd affidavit of Heng Zhi An para 22-23; Plaintiff’s submissions paras 37-39The dispute over the provenance of Mr Heng’s backpack is, in my view, irrelevant to the present application. It is clear that the parties are in agreement that the batch of2,328 Detained Backpacks(as opposed to Mr Heng’s sample sent to Samsonite Hong Kong), which are the only goods in issue in the present case, are genuine SAMSONITE products.",
        "The Plaintiff’s pleaded case": "18 On 30 July 2015, the Plaintiff commenced Suit No 779 of 2015 against the Defendant for trade mark infringement under s 27(1) of the TMA. The Plaintiff alleges that the Defendant had used signs which are identical to the SAMSONITE Marks in relation to goods which are identical to those for which the SAMSONITE Marks are registered, when the Defendant was not an authorised distributor or retailer of the Plaintiff in Singapore and without the Plaintiff’s consent.8Foot Note 8×SOC para 6To particularise its infringement claim, the Plaintiff refers to the facts outlined at [15]–[17] above. 19 The Plaintiff seeks an injunction to restrain the Defendant and its officers, servants and agents from infringing the SAMSONITE Marks, a delivery up of the Detained Backpacks, and an inquiry as to damages or (if the Plaintiff elects) an account of profits, together with payments of all sums found due to the Plaintiff. No claim for passing off has been brought against the Defendant.",
        "The defence and counterclaim": "20 The Defendant raises two defences.9Foot Note 9×Defence and Counterclaim para 6The first is that it did not infringe the SAMSONITE Marks under s 27(1) of the TMA. Further or in the alternative, the Defendant argues that the Detained Backpacks were sold and imported into Singapore with the deemed consent of the Plaintiff as the registered proprietor, and were parallel imports for the purposes of s 29(1) of the TMA. No particulars were adduced in support of the first defence. The bulk of the defence as presented to the court concerned the second defence under s 29(1) of the TMA, which is the focus of this judgment. 21 The Defendant counterclaimed for damages, including loss of profits and costs of importation of the Detained Backpacks.",
        "The Plaintiff’s application for summary judgment and summary determination on a point of law": "22 On 29 June 2016, the Plaintiff filed Summons No 3175 of 2016, seeking a determination to be entered pursuant to O 14 r 12 of the Rules of Court that the Detained Backpacks, which are designed and manufactured under licence from the Plaintiff for the sole purpose of being given away free with the sale of specific laptops to consumers, and which are distributed to an authorised distributor or retailer for those purposes, havenotbeen “put on the market” for the purposes of s 29(1) of the TMA (“the Question”). It also asks for final judgment to be entered pursuant to O 14 r 12 and/or O 14 r 1 against the Defendant in the terms as prayed for in the statement of claim.",
        "The Plaintiff’s submissions": "23 The Plaintiff states that it has made out aprima faciecase of infringement under ss 27(1) and 27(4)(c) of the TMA,10Foot Note 10×Plaintiff’s submissions paras 27-29and that the Defendant’s sole defence is under s 29(1) of the TMA.11Foot Note 11×Plaintiff’s submissions para 30 24 The Plaintiff is of the view that two elements need to be proved under s 29(1) of the TMA in this case:12Foot Note 12×Plaintiff’s submissions para 31 (a) The Detained Backpacks were “put on the market” anywhere in the world; and (b) The Detained Backpacks were put on the market with the Plaintiff’s express or implied consent. 25 The Plaintiff argues that the Defendant has failed to show that there is a triable issue, because it has failed to plead any particulars or adduce any evidence that the Detained Backpacks were put on the market by the proprietor of the registered trade mark or with his express or implied consent.13Foot Note 13×Plaintiff’s submissions para 33 26 Instead, the Defendant merely relies on two propositions in support of defence. First, it argues that the Detained Backpacks are genuine products according to Samsonite Hong Kong, and are parallel imports.14Foot Note 14×Plaintiff’s submissions paras 36-39To this argument, the Plaintiff asserts that the authenticity of the subject matter of a trade mark infringement claim and whether the backpacks are parallel imports are not determinative of whether the defence applies. 27 The Defendant’s second argument is that the co-branded backpacks are available for sale by parties who are not the Plaintiff’s authorised distributors. This shows that the Detained Backpacks were imported into Singapore with the Plaintiff’s deemed consent, as it is proof that the Plaintiff failed to exert full control over the distribution and/or sale of the product.15Foot Note 15×Plaintiff’s submissions paras 40-49However, the Plaintiff highlights that it has at all times expressly prohibited the sale of backpacks without the LENOVO laptops. It has also worked together with relevant parties at Lenovo to stop its distributors from selling the backpacks separately. The fact that there were difficulties and a failure on their part to effectively enforce the terms of the co-branding agreement is not equivalent to the Plaintiff’s consent to putting the backpacks on the market. 28 Indeed, I note that the Defendant has itself pleaded in para 6 of its defence and counterclaim that distribution of the Detained Backpacks was subject to the strict arrangement between the Plaintiff and Lenovo, under which the Detained Backpacks would never be given away for free, sold or otherwise disposed of independently from the sale of a LENOVO laptop in China. It is clear that the point being run by the Defendant is that the Detained Backpacks nevertheless had been disposed of in apparent breach of that arrangement. I shall return to this point later. 29 Regarding the Question to be determined under O 14 r 12 of the Rules of Court and the interpretation of the phrase “put on the market” under s 29(1) of the TMA, the Plaintiff adopts the narrow definition of the phrase, based onPeak Holding AB v Axolin-Elinor(Case C-16/03) [2004] ECR I-11313 (“Peak Holding”), a decision by the Court of Justice of the European Communities (currently known as the European Court of Justice (“ECJ”)). 30 It was held inPeak Holdingthat goods are not “put on the market” if they are merely offered for sale, without any actual sale having taken place, as this would not allow the proprietor to realise the economic value of the trade mark. The Plaintiff argues that this position is supported by Susanna H S Leong,Intellectual Property Law of Singapore(Academy Publishing, 2013) (“Leong,Intellectual Property Law of Singapore”) at para 29.132, where it is stated that the doctrine of exhaustion of rights allows the owner of the intellectual property right to receive “fair reward for the exploitation of his property right”. 31 In this case, the Plaintiff submits that the economic value of the SAMSONITE Marks has not been exhausted in respect of the goods. This is because the benefit that Plaintiff intended to reap from the co-branding agreement was not direct financial gain but the enhancement of the Plaintiff’s brand in China, through association with LENOVO laptops. Thus, where the Detained Backpacks were sold without LENOVO laptops and, indeed never to end users in China, the economic value of the SAMSONITE Marks as applied to the co-branded backpacks could not be realised.16Foot Note 16×Plaintiff’s submissions paras 53-61At the hearing, the Plaintiff’s counsel argued thatPeak Holdingis analogous to the present case. Although Lenovo and Samsonite are different (rather than related) companies, the co-branding agreement meant that this was a joint commercial venture by both parties. The passing of the co-branded backpacks from Samsonite China to Lenovo and then to Lenovo’s authorised dealers, in connection with the retail sale of LENOVO laptops to end users in China, was part and parcel of the internal distribution network from the perspective of the co-branding arrangement. 32 The Plaintiff’s counsel also argued that the word “market” refers to the end user market (as opposed to the wholesale market) in the present case, as that was the only way the economic value of the trade mark could be realised,ie, after the end user has bought the laptop and thereby associates the Samsonite backpack with the LENOVO laptop. To be clear, “associate” in this particular context means that the buyer of a LENOVO laptop would become aware that there was co-operation between Lenovo and Samsonite (not that Samsonite laptop backpacks were made by Lenovo). The co-branding arrangement in this way would lead to an increased awareness of the SAMSONITE brand in China. 33 As to the issue of consent, the Plaintiff’s counsel claimed that there could not be any deemed consent on the part of the Plaintiff, as the only act that Samsonite China consented to was the giving away of the co-branded backpacks for free in conjunction with the LENOVO laptops.",
        "The Defendant’s submissions": "34 The Defendant argues that it has raised triable issues, and leave should be granted to defend in the present case. 35 According to the Defendant, these triable issues were:17Foot Note 17×Defendant’s submissions para 13 (a) Whether the backpacks were parallel imports for the purposes of s 29(1) of the TMA; (b) Whether the Plaintiff, as the registered proprietor of the SAMSONITE Marks, is deemed to have given consent to the sale of the Detained Backpacks, despite the term in the co-branding agreement that the backpacks were only to be given away for free in conjunction with the sale of LENOVO laptops; and (c) Whether it could reasonably be inferred that there was implied consent from the Plaintiff for the backpacks to be put on the market in Singapore, given the availability of such unbundled backpacks (ie,backpacks without the LENOVO laptops) for sale in Singapore, which shows that the Plaintiff’s contractual agreement with Lenovo was problematic. 36 At the hearing, the Defendant’s counsel argued that the definition of the word “market” includes the wholesale, distribution and retail markets.",
        "Issues": "37 In light of the foregoing, three sequential questions arise for determination: (a) Is this an appropriate case for summary determination pursuant to O 14 r 12 of the Rules of Court? (b) If so, how should the Question be determined? (c) Given the determination of the Question, should summary judgment be granted to the Plaintiff under O 14 r 1 of the Rules of Court? 38 I shall deal with each of the issues in turn.",
        "Is this an appropriate case for summary determination under O 14 r 12 of the Rules of Court?": "",
        "Legal principles": "150 Order 14 rules 1 and 3 of the Rules of Court state: Application by plaintiff for summary judgment (O. 14, r. 1) 1.  Where a statement of claim has been served on a defendant and that defendant has served a defence to the statement of claim, the plaintiff may,on the ground that that defendant has no defence to a claimincluded in the writ, or to a particular part of such a claim, or has no defence to such a claim or part except as to the amount of any damages claimed, apply to the Court for judgment against that defendant. … Judgment for plaintiff (O. 14, r. 3) 3. —(1)  Unless on the hearing of an application under Rule 1 either the Court dismisses the application or the defendant satisfies the Court with respect to the claim, or part of a claim, to which the application relates thatthere is an issue or question in dispute which ought to be tried or that there ought for some other reason to be a trial of that claim or part,the Court may givesuch judgment for the plaintiff against that defendant on that claimor part as may be just having regard to the nature of the remedy or relief claimed. … [emphasis added] 151 The burden is on the plaintiff to prove aprima faciecase that there are no triable issues of fact orbona fidedefence. Thereafter, the burden shifts to the defendant to show that there is some triable issue of fact or law, or whether there is some other reason for a trial.  It should be noted that a defendant will not be given leave to defend based on mere assertions alone:Goh Chok Tong v Chee Soon Juan[2003] 3 SLR(R) 32 at [25], cited with approval inCalvin Klein, Inc and another v HS International Pte Ltd and others[2016] 5 SLR 1183 (“Calvin Klein”) at [45]. In reaching my decision, I have noted the principle that while proceedings at the summary judgment stage are not to be conducted as a trial on affidavits, this does not mean that anything set out in the affidavits is to be accepted without rational consideration to determine if there is a fair or reasonable probability of a real defence. 152 The purpose of summary judgment under O 14 is to enable a plaintiff to obtain a quick judgment where there is plainly no defence to the claim. In particular, if the defendant’s only defence is a point of law, and the court can see at once that the point is misconceived, the plaintiff is entitled to judgment. 153 Summary judgment under O 14 has been granted in Singapore to claims for an injunction to restrain trademark infringements, for example, inCreative Technology Ltd v Cosmos Trade-Nology Pte Ltdand another[2003] 3 SLR(R) 697, where the High Court granted restraining orders and orders for delivery up or destruction of all infringing reproductions and an inquiry as to the damages or at the plaintiff’s option an account of profits.",
        "Decision": "154 In my view, the Plaintiff has made out aprima faciecase of infringement. It is not seriously disputed that the Defendant has used a sign which is identical with the SAMSONITE Marks in the course of trade, without the consent of the proprietor of the trade mark, in relation to goods and services which are identical with those for which the trade mark is registered (see s 27(1) of the TMA andCalvin Kleinat [42]). As I have earlier noted, the Defendant has raised in its defence that it has not infringed the Plaintiff’s trade marks, but provided no details to support its assertion. This mere assertion cannot be the basis of granting leave to defend. 155 After the determination of the point of law under O 14 r 12 above, it is clear that the defence under s 29(1) of the TMA does not apply on the present facts, as the Detained Backpacks were never “put on the market”. Further, the unbundling and sale of the Detained Backpacks was not done “by the proprietor or with his express or implied consent (conditional or otherwise)”. 156 The Defendant has failed to show that there are any other triable issues in this case. Referring to the three triable issues listed by the Defendant (at [35] above), the first relates to a determination of whether the Detained Backpacks are parallel imports. This is not relevant to the establishing of a defence under s 29(1) of the TMA. The second and third issues relate to the Plaintiff’s deemed consent and implied consent to the sale of the backpacks respectively. I have already dismissed these issues earlier in my judgment.",
        "How should the Question be determined?": "48 Having concluded that this is an appropriate case for a summary determination on a point of law under O 14 r 12 of the Rules of Court, I turn to the substantive issue of how the Question should be determined.",
        "The “exhaustion of rights” defence to trade mark infringement": "49 I begin with an overview of the relevant legislation underpinning the present suit. The starting point is s 27(1) of the TMA, which outlines acts that would amount to an infringement of trade marks: Acts amounting to infringement of registered trade mark 27.—(1)  A person infringes a registered trade mark if, without the consent of the proprietor of the trade mark, he uses in the course of trade a sign which is identical with the trade mark in relation to goods or services which are identical with those for which it is registered. 50 The “proprietor” of a trade mark is defined in s 2(1) of the TMA to mean, “in relation to a registered trade mark, the person in whose name the trade mark is registered”. Where trade marks are owned by different entities in different countries, Lai Kew Chai J made it clear inPan-West (Pte) Ltd v Grand Bigwin Pte Ltd[2003] 4 SLR(R) 755 (“Pan-West”) at [14] that the relevant consent is that of the registered trade mark proprietorin Singapore.Further, s 2(5) of the TMA states that references to “registered trade mark” are, unless the context otherwise requires, references to registration in the register. “Register” is in turn defined as the register of trade marks maintained by the Registrar under s 66 of the TMA. 51 The “use” of a trade mark is further defined in s 27(4) of the TMA: (4) For the purposes of this section and sections 28, 29 and 31, a person uses a sign if, in particular, he — (a) applies it to goods or the packaging thereof; (b) offers or exposes goods for sale, puts them on the market or stocks them for those purposes under the sign, or offers or supplies services under the sign; (c) imports or exports goods under the sign; (d) uses the sign on an invoice, wine list, catalogue, business letter, business paper, price list or other commercial document, including any such document in any medium; or (e) uses the sign in advertising. 52 The Plaintiff’s case against the Defendant for infringement is based on s 27(1) read with s 27(4)(c) of the TMA. While the Defendant denies the infringement in his Defence, no particulars were provided and no arguments were raised in relation to this during the hearing. Based on the undisputed facts, it appears to me that there is aprima facieinfringing use of the SAMSONITE Marks in relation to the Detained Backpacks. 53 The Defendant’s substantive defence is under s 29(1) of the TMA. Section 29(1) of the TMA states: Exhaustion of rights conferred by registered trade mark 29.—(1) Notwithstanding section 27, a registered trade mark is not infringed by the use of the trade mark in relation to goods which have beenput on the market, whether in Singapore or outside Singapore, under that trade markby the proprietor of the registered trade markorwith his express or implied consent(conditional or otherwise). [emphasis added] 54 The defence is not absolute, and is subject to two exceptions: 29.—(2) Subsection (1) shall not apply where — (a) the condition of the goods has been changed or impaired after they have been put on the market; and (b) the use of the registered trade mark in relation to those goods has caused dilution in an unfair manner of the distinctive character of the registered trade mark. 55 Section 29 of the TMA encapsulates what is known as an “exhaustion of rights” defence to infringement: seePan-Westat [23]. This is a particularly relevant defence in the context of parallel imports. The concept of exhaustion applies to genuine goods which emanate initially from the intellectual property right owner or associated enterprise (such as its subsidiaries, licensees, distributors): William Cornish, David Llewelyn & Tanya Aplin,Intellectual Property: Patents, Copyrights, Trademarks and Allied Rights(Sweet & Maxwell, 8th Ed, 2013) (“Cornish, Llewelyn & Aplin,Intellectual Property”) at para 18-113. 56 The operative effect of the exhaustion of rights defence is that, following theactof “put[ting] [the goods] on the market”, whether in Singapore or outside Singapore, by the trade mark proprietor or with his consent, the proprietor loses all rights to object to further exploitation and dealing with those goods, such as by importation, resale and circulation. The proprietor’s trade mark rights are thus deemed to be “exhausted” in respect of these goods. This is despite the fact that in principle, the bundle of trade mark rights that the proprietor possesses includes the right to prevent imports and exports of goods bearing identical trade marks (under s 27(4)(c) of the TMA): see Tan Tee Jim SC,Law of Trade Marks and Passing Off in Singapore(Sweet & Maxwell, 3rd Ed, 2014) (“Tan,Law of Trade Marks and Passing Off”) at paras 13.065 and 13.066 andZino Davidoff SA v A & G Imports Ltd[2000] Ch 127 (“Zino Davidoff (England)”) at [10]. Third parties, such as parallel importers, are free to sell these goods which come from the very source that had the right to apply the trade mark. 57 There are, in my view, two substantive questions to be determined before a defence under s 29(1) of the TMA can be made out: (a) First, were the goods “put on the market”? This requires the determination of the what “put[ting] on the market” constitutes, as well as a definition of the relevant “market”. (b) Second, if the first question is answered in the affirmative, were the goods put on the market either (i) by the proprietor of the registered trade mark, or alternatively (ii) with his express or implied consent (conditional or otherwise)? Encompassed within this is the identification of the proprietor of the relevant trade mark in accordance with s 2(1) of the TMA and/or the determination of the meaning of “consent” of the proprietor. 58 If there is aprima faciedefence under s 29(1) of the TMA, the next issue is whether any of the exceptions in s 29(2) of the TMA apply to prevent the operation of the defence. In the present case, neither side even referred to s 29(2) whether in the pleadings or the submissions. At the hearing, the Plaintiff also confirmed that s 29(2) was not pleaded and that the Plaintiff was not relying on this provision. For this reason, the focus of this judgment is on s 29(1) of the TMA. I will review the legislative history of the provision, the principles and policy reasons underlying the provision, as well as the case law in this respect. 59 However, I note that the Plaintiff, in one of its affidavits in support of the application for summary judgment, did make reference to the nature of the goods which the Plaintiff consented to being put on the market. The point made was that the only goods which the Plaintiff consented to being put on the market were the co-branded backpacks in conjunction with the sale of the designated LENOVO laptops. Since the Detained Backpacks were importedwithoutthe designated LENOVO laptops, the goods were different. The original goods (ie, the combination of the co-branded backpack and the LENOVO laptops) had been modified and altered by the omission and removal of the LENOVO laptop to which the LENOVO mark refers.19Foot Note 19×3rd affidavit of Richard Andrew Lamb para 14Hence, while the Plaintiff did not raise any arguments based on s 29(2) of the TMA in the submissions, I shall make some brief comments on this provision later in the judgment.",
        "Legislative history": "60 The genesis of the exhaustion of rights defence in Singapore is s 45(3)(a) of the repealed Trade Marks Act 1939 (Cap 332, 1992 Rev Ed) (“TMA 1939”). This is almost identicalto the repealed s 4(3)(a) of the Trade Marks Act 1938 (c 22) (UK) (“UK TMA 1938”), upon which some of the early landmark cases in England were based. Section 45(3)(a) of our TMA 1939 stated: (3)  The right to the use of a trade mark given by registration as aforesaid shall not be deemed to be infringed by the use of the trade mark as aforesaid by any person — (a) in relation to goods connected in the course of trade with the proprietor or a registered user of the trade mark if, as to those goods or a bulk of which they form part, the proprietor or a registered user conforming to the permitted use has applied the trade mark and has not subsequently removed or obliterated it or has at any time, expressly or impliedly,consented to theuseof the trade mark … [emphasis added] 61 In 1998, a revised Trade Marks Act was enacted in place of the TMA 1939. In brief, s 45(3)(a) of the TMA 1939 (above) sets out a defence to infringement when the proprietor applied the trade mark or consented to the “use” of the trade mark. The modern formulation in s 29(1) of the current TMA is narrower, in that the defence only operates when the proprietor consents to the “put[ting] [of the goods] on the market” (see [53] above). “Put[ting] [the goods] on the market” is only one of the definitions of the “use” of a trade mark under s 27(4) of the TMA (see [51] above). 62 I note in passing that the latest amendments to the current TMA that are most pertinent to this discussion were made in 2004 (by Act 20 of 2004). These amendments were mainly intended to give effect to the obligations under the United States-Singapore Free Trade Agreement 2003. Among other things, s 29(2) of the TMA was amended to restate the circumstances in which the defence of exhaustion of rights in a registered trade mark wouldnotapply. I do not consider it necessary to further elaborate on this in great detail, given that the focus of this judgment is on s 29(1) of the TMA. Nevertheless, as mentioned, I shall make some brief comments below. 63 The current s 29(1) of our TMA is modified from s 12(1) of the Trade Marks Act 1994 (c 26) (UK) (“UK TMA 1994”), which replaced the UK TMA 1938, and was an implementation of Art 7(1) of the First Council Directive 89/104/EEC, Doc 31989L0104, 1989 OJ L 40/1 (“the EU Trade Marks Directive”). For ease of comparison, I set out the relevant provisions in the following table: Section 29(1) of the TMASection 12(1) of the UK TMA 1994Article 7(1) of the EU Trade Marks DirectiveExhaustion of rights conferred by registered trade markNotwithstanding section 27, a registered trade mark is not infringed by the use of the trade mark in relation to goods which have beenput on the market,whether in Singapore or outside Singapore, under that trade mark by the proprietor of the registered trade mark or with hisexpress or implied consent(conditional or otherwise).Exhaustion of rights conferred by registered trade markA registered trade mark is not infringed by the use of the trade mark in relation to goods which have beenput on the marketin the European Economic Areaunder that trade mark by the proprietor or with hisconsent.Exhaustion of the rights conferred by a trade markThe trade mark shall not entitle the proprietor to prohibit its use in relation to goods which have beenput on the marketin the Communityunder that trade mark by the proprietor or with hisconsent. 64 Although the exhaustion of rights defence in s 29(1) of our TMA shares a common historical origin with the defence in the UK, and s 29(1) of our TMA was modelled after the equivalent provision in the UK, there are material differences between the two models which are, as commentators put it, “deliberate”: Leong,Intellectual Property Law of Singaporeat para 29.141, citing Ng-Loy Wee Loon, “Exhaustion of Rights in Trade Mark Law: The English and Singapore Models Compared” [2000] EIPR 320 at 321. 65 To begin with, s 12(1) of the UK TMA 1994 and Art 7(1) of the EU Trade Marks Directive require that goods must be put on the market “in the European Economic Area [(‘EEA’)]” and “in the [European] Community” respectively. Section 29(1) of our TMA, on the other hand, applies whether the goods are put on the market within or outside Singapore. In other words, the UK and EU models encompass the concept ofregionalexhaustion (seeSilhouette International Schmied GmbH& Co KG v Hartlauer Handelsgesellschaft mbH(Case C-355/96) [1998] ECR I-4799), in which the first putting of the goods on the market must bewithinthe EEA. Consequently, a trade mark proprietor who first places his goods on the marketoutsidethe EEA can still rely on his trade mark rights to prevent the goods from being marketed and soldwithinthe EEA without his consent. The exhaustion of rights defence would not apply. However, the view has been expressed that there may still be scope in UK law for a trade mark owner to consent to parallel importation from outside the EEA: see Cornish, Llewelyn & Aplin,Intellectual Propertyat para 18-122. Consent will, of course, be crucial and this has given rise to tricky issues which will be examined later in this judgment. 66 By contrast, under our TMA, the act of putting the goods on the market can be done “in Singapore or outside Singapore.” It does not matter where the market is situated. The provision clearly embraces aninternationalexhaustion principle (see Tan,Law of Trade Marks and Passing Offatpara 13.091), which is broader than regional exhaustion. 67 Second, while the UK and EU merely refer to “consent” by the registered proprietor of the trade mark to the putting of the goods on the market, our TMA provides more guidance as to the nature of the consent required, by explicitly referring to the proprietor’s “express or implied consent (conditional or otherwise)”: see M Ravindran,LexisNexis Annotated Statutes of Singapore– Trade Marks Act: A Commentary(LexisNexis, 2010) (“Ravindran,Trade Marks Act: A Commentary”) at p 178. 68 Despite the differences outlined above, the main questions to be determined for the purposes of the present case, which relate to interpretations of the expressions “put on the market” and “consent” in the exhaustion of rights defence, are common between the local TMA, the UK TMA 1994, and the EU Trade Marks Directive. References to UK and EU case law will therefore be broadly instructive, especially in the light of the lack of local cases on these issues. Nonetheless, I am cognisant that the differences outlined above are sometimes material in the context of a particular case, and I will point them out at the appropriate junctures.",
        "Principles and policy": "69 Moving away from the legislative history of s 29 of our TMA, it is helpful to touch on the policy behind s 29 as this provides the backdrop for the determination of the Question. 70 The phenomenon of parallel imports is well-known, and has attracted considerable discussion: see, for example, Timothy H Hiebert,Parallel Importation in US Trademark Law(Greenwood Press, 1994) (“ParallelImportation in US Trademark Law”) and Warwick A Rothnie,Parallel Imports(Sweet & Maxwell, 1993) (“Parallel Imports”). Rothnie postulates in the preface ofParallel Imports(at p xi) that “the central conflict of parallel imports” is between “cheaper prices for consumers now versus incentives to invest in desirable economic and cultural activity.” In a similar vein, Hiebert notes inParallel Importation in US Trademark Lawat p 1 that parallel importers may find it profitable to purchase identical goods from authorised distributors in other countries (for example, Country A), where the goods are less expensive, and import them to Country B, in competition with the local authorised distributors of the goods in Country B. Relieved of the local advertising expenditures and other overheads, and often obtaining the goods at lower costs, the parallel importers are able to sell the goods at prices well below that charged by the authorised distributors. In other cases, the parallel importer may seek to bring into the domestic market goods marketed in an overseas market which have not yet been made available in the domestic market. Doubtless, other reasons for parallel imports will exist. 71 Should such parallel imports be allowed? This is a large and complex question best resolved by Parliament. Indeed, I note in passing that the question regarding exhaustion of rights and parallel imports featured heavily in the negotiations leading to the Agreement on Trade-Related Aspects of Intellectual Property Rights (“the TRIPS Agreement”) and the formation of the World Trade Organization. Given the complexity and diversity of views, it is perhaps not surprising that Art 6 of the TRIPS Agreement expressly states that nothing in the TRIPS Agreement shall be used to address the question of exhaustion of rights. A “neutral” position was adopted. Instead, the question of exhaustion and intellectual property was left to Member States to resolve on a national basis subject only to the principles of National Treatment and Most-Favoured-Nation Treatment. 72 As alluded to in the introductory paragraphs of this judgment, a balance needs to be struck and maintained between thepublicinterests in the free movement of goods and promotion of intra-brand competition, and theprivateinterests of proprietors of intellectual property rights, who would understandably want to exercise their rights conferred by the trade mark to extract maximum remuneration for their intellectual efforts: Tan,Law of Trade Marks and Passing Offat para 13.077. 73 The difficult question is determining where the line is to be drawn. In Singapore, it is clear that Parliament, in enacting intellectual property laws, including the TMA, was cognisant of the conflict between intellectual property rights, and competition law and consumer interests. The legislative balance in trade mark law between the competing interests is set out in s 29 of the TMA. In broad terms, the trade mark proprietor is given the right to control when (and how) the goods are to be put on the market for the first time. Once the goods have entered the market, he is denied the ability to use his proprietary rights to control the subsequent importation, sale, distribution or other exploitation of those goods (as explained above): see the opinion of the Advocate-General inPeak Holdingat [19] and [31] andPan-Westat [23]. This provides for the balance between the interests of the trade mark proprietor against the interests of competition law and consumer interests, and recognises the interests of purchasers in good faith. 74 The underlying rationale for drawing the line in this manner appears to rest on the view that since the proprietor has already reaped economic benefits from his trade mark through the first putting of the goods on the market, he should not (bearing in mind the broader public interest) be conferred or allowed to exercise perpetual monopoly rights (with the consequent accrual of monopoly profits) in relation to those very trade-marked goods. The exhaustion of rights defence in this way represents an “important limit of the trade mark right”: James Mellor QCet al,Kerly’s Law of Trade Marks and Trade Names(Sweet & Maxwell, 15th Ed, 2011) (“Kerly’s Law of Trade Marks and Trade Names”) at para 16-001. 75 I pause to underscore that the need to balance the rights of trade mark owners and the needs of intellectual property users featured in the parliamentary debates in respect of the 2004 amendments to our TMA. Even though s 29 was not specifically mentioned, it was expressly stated that one goal of the 2004 amendments was to clarify and review what uses of a registered trade mark willnotamount to infringement: seeSingapore ParliamentaryDebates, Official Report(15 June 2004) vol 78 at cols 109 and 114 (Prof S Jayakumar, Minister for Law). 76 In fact, the stance of our Parliament is generally in favour of parallel imports. Parliament has endorsed the public interest highlighted above. A leaf may be taken from copyright law, in which issues concerning parallel importation have frequently arisen. Initially, in the case ofPublic Prosecutor v Teo Ai Nee and another[1995] 1 SLR(R) 450 (“Teo Ai Nee”), Yong Pung How CJ held that the importation of a copyrighted product and its distribution in Singapore would be unlawful if the imported article was manufactured abroad without the consent of the local copyright owner in Singapore. This decision was based on the legislative provisions in the Copyright Act (Cap 63, 1988 Rev Ed). Following the decision inTeo Ai Nee, Parliament passed the Copyright (Amendment) Act 1994 (No 14 of 1994). One of the major amendments made was to clarify the position on parallel imports by amending s 25 of the Copyright Act and adding a new sub-section (3), to make clear that the relevant copyright owner whose consent must be obtained is generally the ownerin the country of manufacture. The sub-section reads: Ownership of copyright for particular purposes 25.—(3) Where reference is made in this Act to an imported article the making of which was carried outwithout the consent of the owner of the copyright, the reference to the owner of the copyright shall be read as a reference to — (a) the person entitled to the copyright in respect of its application to the making of an article of that descriptionin the country where the article was made… [emphasis added] 77 From these amendments, it is clear that Parliament took a firm stance in favour of parallel imports of genuine products by persons other than authorised distributors. The parliamentary intention evidenced from the debates was to continue to “ensure that parallel imports of copyright products would be allowed”. It was noted that this would enable Singaporeans to “have a wider choice of products which they can purchase and also at cheaper prices”: seeSingapore ParliamentaryDebates, Official Report(25 August 1994) vol 63 at cols 413–416. It should be noted that s 25(3) still exists in the same form in the present Copyright Act (Cap 63, 2006 Rev Ed). 78 While these remarks were made in the context of copyright law, I see no reason why Parliament’s position in favour of parallel imports should not be extended to the rest of intellectual property law, including trade mark law. Indeed, the learned author of Ravindran,Trade Marks Act:A Commentaryechoes this view, stating at p 177 that: “[t]hegeneral policyof the Singapore government is to allow parallel imports of goods. [Section 29 of the TMA] puts into law that policy … The effect of the policy is to drive down prices of goods sold under the mark as there is competition between the authorised distributor and parallel importers. This is obviously good for the public at large [emphasis added]. 79  Parallel imports can be further justified in the context of trade marks when one considers the essential function of a trade mark. Unlike other intellectual property rights (such as patents and copyrights), trade marks are not only rewards for the proprietor’s intellectual labour and expenditure, but also crucially act as indications of origin of the goods to which the mark is applied: seeZino Davidoff (England)at [11]–[12]. In other words, the trade mark is meant to: …guarantee the identity of the origin of the trade marked productto the consumer or ultimate user, by enabling himwithout any possibility of confusionto distinguish that product from products which have another origin. This guarantee of origin means that the consumer or ultimate user can be certain that a trade marked product which is sold to him has not been subject at a previous stage of marketing to interference by a third person, without the authorisation of the proprietor of the trade mark, such as to affect the original condition of the product. … [emphasis added] 80 Where the parallel importer obtains trade-marked goods which originate from the proprietor of the trade mark, leaves the proprietor’s mark on the goods without alteration, and imports it into Country B, the public in Country B is not confused. The purpose of the trade mark would not be undermined, as the trade mark is still accurately indicating the origin of the goods and therefore, performing its proper function. In the event that the imported goods are altered so as to materially affect their condition, resulting in the mark being adversely affected or the consumer to be confused, Art 7(2) of the EU Trade Marks Directive (and also s 29(2) of our TMA) would cater for this, and the exhaustion of rights defence would not apply: seeZino Davidoff (England)at [14]–[15]. 81 I pause to note that the origin function of a trade mark was referred to by Laddie J inZino Davidoff (England)in the context of the principle of exhaustion of rights and intra-community trade. In brief,Zino Davidoff(England)was a case where the plaintiffs were the owners of registered trade marks applied to goods distributed worldwide. The defendant purchased the goods from a dealer in Singapore and re-sold them in the EEA at a profit. The plaintiffs applied for summary judgment on the basis that its trade mark rights were not exhausted where trade-marked goods were put on the market outside of the EEA by or with the consent of the trade mark proprietor. Laddie J dismissed the application. In doing so, Laddie J noted at [38] that the principle of exhaustion in Art 7(1) of the EU Trade Marks Directive did not apply to goods imported into the EEA from outside it. Art 7(1) was concerned with exhaustion within the EEA, based on the goods being put on the market within the EEA. Laddie J went on to hold that in cases where the trade-marked goods were put on the market outside the EEA, the principle of international exhaustion did not apply. Instead, the trade mark proprietor retained the right, like any other property owner, to decide whether to object to importation and circulation within the EEA or to permit the importation, circulation and sale. 82 In the present case, Singapore has, by legislation, adopted an international exhaustion of rights principle. The origin function of a trade mark has been recognised by the Court of Appeal inSociété des Produits Nestlé SA and another v Petra Foods Ltd and another[2017] 1 SLR 35. Sundaresh Menon CJ (at [21]), citingCnl-Sucal NV SA v Hag GF AG[1990] 3 CMLR 571 at [14], stated that “[a] trade mark gives the consumer or final user aguaranteeof the origin of the marked product by enabling him todistinguish, without any possibility of confusion, that product from others of a different provenance” [emphasis in original].  The origin function of a trade mark lies behind the distinctiveness requirement in the TMA. It also supports the exhaustion principle set out in s 29 of the TMA. It is against this backdrop that I turn to examine the key issue before this court.",
        "Were the goods “put on the market”?": "83 Bearing in mind the legislative history, and the principles and policy underlying s 29(1) of the TMA, I now come to the substantive issue of what it means for the goods to be “put on the market”. Legal principles 84 As alluded to earlier, s 29(1) of the TMA has received comparatively little attention in local case law. I will thus examine the foreign case law and academic opinion on this issue. 85 The analysis must begin with the landmarkPeak Holdingcase, which was a case referred to the ECJ by the Swedish Court of Appeal for a preliminary ruling. The claimant was a Danish company that was the proprietor of the PEAK PERFORMANCE trade mark. Its right to use the trade marks was transferred to a related company, Peak Performance Production AB (“Peak Production”), which produced and sold garments and accessories under those trade marks in Sweden and abroad. 86 The case concerned a consignment of garments bearing the PEAK PERFORMANCE trade mark, which were manufactured outside the EEA and imported into the EEA. They were offered for sale to the public in Copenhagen, in a store supplied by Peak Production’s sister company, but remained unsold. Peak Production then sold the garments to a French company. According to the claimant, the contract was concluded on the basis that the garments were not to be resold in European countries, other than Russia and Slovenia, but five per cent of the total quantity could be sold in France. The defendant parallel importer obtained the garments and offered them for sale in Sweden at half price. The defendant contended that the rights of the trade mark proprietor had been exhausted,inter alia, when the goods were put on the market in the store in Copenhagen, and offered to consumers. 87 One of the questions referred to the ECJ for a preliminary ruling was whether goods bearing a trade mark were regarded as having been “put on the market” where the proprietor of the trade mark hasimportedthem into EEA with the intention of selling them there, or where he hasoffered them for saleto consumers, in his own shops or those of a related company, but where a sale of the goods had not taken place. 88 While not legally binding, the opinion of the Advocate-General in this case is illuminating. The Advocate-General was of the view that internal transactions (such as the transfer of goods bearing the trade mark to a retail subsidiary) andpreparatory acts (such as the importation by the proprietor of goods from other countries), didnotconstitute “putting on the market” for the purposes of Art 7(1) of the EU Trade Marks Directive (at [24]). Instead, the directionof the trade mark proprietor’s act must be towards the market.Based on a teleological interpretation of the provision, the Advocate-General opined (at [32]) that any interpretation of the phrase must not restrict the right of the trade mark proprietor to control the first putting of the goods on the market in the EEA and to benefit economically from them, but must at the same time prevent the proprietor from having control over subsequent sales of the goods. On this footing, the Advocate-General concluded that theofferingof the goods for sale, without actually selling the goods, did not exhaust the rights of the proprietor, and did not constitute putting the goods on the market. The main reason is that the protection of the proprietor’s investment in the trade mark could not be realised in economic terms purely by offering the goods for sale (at [37]). The Advocate-General noted (at [38]) that practical reasons,viz,the lack of legal certainty, also militated against interpreting “putting on the market” as including the mere “offer for sale.” Ultimately, the Advocate-General took the view (at [43]) that goods are only put on the market in the EEA when “an independent third party has acquired the right of disposal of the goods bearing the mark.” 89 The ECJ largely adopted the same view, holding that where the proprietor merely imports his goods with a view to selling them in the EEA or offers them for sale in the EEA, he doesnotput them on the market within the meaning of Art 7(1) of the EU Trade Marks Directive. This is because “such acts do not transfer to third parties the right to dispose of goods bearing the mark … Even after such acts, the proprietor retains complete control over the goods”. Moreover, such acts “do not allow the proprietor to realise the economic value of the trade mark”:Peak Holdingat [42]. Additionally, the ECJ further observed (at [43]) that Arts 5(3)(b) and 5(3)(c) of the EU Trade Marks Directive, which relate to the content of the proprietor’s exclusive rights, distinguishes between offering the goods, putting them on the market, stocking them for those purposes and importing them. This confirm that importing the goods or offering them for sale in the EEA could not be equated to putting them on the market. I pause to stress that Arts 5(3)(b) and 5(3)(c) of the EU Trade Marks Directive isin pari materiawith ss 27(4)(b) and 27(4)(c) of our TMA. 90 The effect, therefore, is that the interpretation of the expression “put on the market” requires arealisation of the economic value of the trade markwith the accompanying change of ownership of the trade-marked goods (ie,a third party’s acquisition of the subsequent right of disposal of the goods bearing the mark.) As a result, some commentators have opined that the upshot of the ECJ’s interpretation of “put on the market” is that the goodsmustbe “released into the marketby an act of sale” [emphasis added]: seeKerly’s Law of Trade Marks and Trade Namesat para 16-077. In particular, the learned authors ofKerly’sLaw of Trade Marks and Trade Namescomment at para 16-079 that a change of ownership is not relevant to the “economic” approach taken by the Advocate-General. This is because the “decisive event” is “the transfer of the actual right of disposal of the goods”. Under this approach, what is needed is “a sale to an objectively independent third party who acquires the actual right of disposal of the goods.” 91 However, there also exists the contrary view that “put on the market” includes not just the actual sale of the goods, but also thepre-sale actsof marketing (such as advertising and promotion), offering for sale and other forms of exposure of the goods for the purposes of sale. This is the view espoused by the learned author in Tan,Law of Trade Marks and Passing Offat paras 13.104 and 13.106, and was also the position adopted by the Swedish Government inPeak Holding. There is also some support for this proposition in Paul Sumpter, Trade Marks in Practice(LexisNexis, 2004) at p 202 (cited at [91] of the High Court of New Zealand (Auckland Registry) decision ofLeisureworld Ltd v Elite FitnessEquipment Ltd(21 July 2006, HC) (NZ) (“Leisureworld”)), in which the learned author stated that to “put on the market” presumably means that the goods are available or, possibly, areadvertisedas being available for sale. 92 At this juncture, it is germane for me to observe as an aside that in Europe, there have been cases concerning whether goods have been “put on the market” when they were put out for use in adistribution network, but not for sale. The products in question were perfume tester bottles which had been made available to specialist dealers in Singapore, but without sale and with an express prohibition against their sale. The tester bottles were then picked up by a parallel importer and imported into Germany for sale: seeCoty Prestige Lancaster Group GmbH v Simex Trading AG(Case C-127/09), [2010] ECR I-4967; see alsoL’Oréal SA and others v eBay International AG and others(Case C-324/09),[2011] RPC 27 andKerly’s Law of Trade Marks and Trade Namesat para 16-080. 93 These cases do not affect my decision in the present matter. In any case they were not cited in arguments before me. The whole point of the co-branding arrangement in the present case, at least from the perspective of the Plaintiff, was to promote the market awareness of the SAMSONITE Marks and facilitate the penetration of the SAMSONITE brand into the Chinese market by means of the “free gift” of the co-branded backpacks in association with LENOVO laptops. In the case of the perfume tester bottles, these had been supplied to the specialist dealers and shops. Accordingly, the point could be made that the perfume tester bottles were merely given away for free to promote the sale ofother goods, and were not distributed with the aim of facilitating the penetration ofthe bottles themselvesinto the market in question. Therefore, it is fairly evident that the economic value of the trade mark on the perfume tester bottles had not yet been realised by the trade mark proprietor. A conceptual framework for Singapore law 94 Upon consideration, I agree with the ECJ inPeak Holdingthat the expression “put on the market” must involve the realisation of the commercial and economic value of the trade mark. This would ensure consistency with the principleunderlying the exhaustion of rights doctrine, which is that the proprietor must be allowed the first right of reaping a “reward” for his intellectual labour before his rights can be derogated from under s 29(1) of the TMA. This is essential because, as the learned author in Leong,Intellectual Property Law of Singaporerightly observes at para 29.132, the doctrine of exhaustion of rights is premised on allowing the proprietor to receive “fair reward for the exploitation of his property right”. 95 However, ascertaining the precise ambit of what the act of “putting” entails demands further discussion. On the one hand, to hold that the proprietor canonlyrealise the economic value of his trade markby an act of saleis too narrow (see Tan,Law of Trade Marks and Passing Offat para 13.105). The realisation of the commercial value of a trade mark can be achieved through multifarious methods, and not just through an actual sale of the trade-marked product. For example, the commercial value of the trade mark can be realised, in appropriate cases, by allowing the good bearing the trade mark to be hired, or even given away for free. This would increase the brand awareness of the product, and allow the trade-marked product to penetrate a specific consumer market. Even though an immediate profit is not obtained, developing brand awareness helps to generate and increase reputation, which is in turn clearly commercially valuable in the context of business goodwill. Ultimately, a broader construction of the range of situations in which the proprietor has exhausted his rights by either personally putting or consenting to a third party putting a good on the market accords with the legislative intent of Parliament, which favours parallel imports. 96  I also note that there are two problems with construing the phrase “put on the market” too broadly to includepreparatory actssuch as offering a good for sale. The first is that s 27(4) of the TMA expressly makes a distinction between “offer[ing] or expos[ing] goods for sale” and “put[ting] them on the market” (see[89] above). Hence, to include the former in the definition of the latter would create an inconsistency between two related provisions of the TMA. This would be contrary to the basic canon of construction that where the same term or expression is used more than once in a statute, the term or expression should ordinarily be interpreted consistently as having the same meaning throughout the statute. Second, when the goods are merely offered for sale, without any consequent change of ownership of the goods (whether through a sale or otherwise), the proprietor has not yet been deprived of the ability to control the subsequent exploitation of the goods, which is a key pillar underpinning the exhaustion of rights defence (see [73] above). 97 I note the view expressed in Tan,Law of Trade Marks and Passing Offat para 13.105 that the ECJ approach should not be followed because Singapore has adopted a true principle of international exhaustion. It is also pointed out that the trade mark proprietor’s exclusive right of use does not depend on the use realising an economic value. While I agree that Singapore has indeed adopted a principle of international exhaustion (as opposed to the EEA-wide regional exhaustion which serves to protect the working of a single internal market), I am of the view that the underlying rationale for exhaustion, whether international or regional, remains the same: to achieve a balancing of the interests of the rights holder and the public at large. The opportunity to realise the economic value must be part of that balance. 98 Regarding the definition of “market”, tricky questions may arise as to whether it refers to the end user or retail market, or whether it can include wholesale markets upstream from the end user or retail market. Given that the TMA lacks the definition of a “market”, much will depend on the facts of each case.  For example, some goods, such as lifting cranes, may rarely be “sold” to end users (such as a construction company). It may be that the trade-marked lifting crane is sold to a specialist building machinery supplier, which then loans the crane to a construction company for use in projects. In such a case, the fact that the actual end user has not purchased the lifting crane is irrelevant. The market in such a case will comprise the specialist building machinery suppliers market. There will, of course, be many other permutations and possibilities. 99 The precise “market” may also depend on the economic objective of the proprietor of the trade mark. If the economic aim is the immediate extraction of profit, this objective can be realised through selling to wholesalers, distributors and retailers. In such cases, the relevant “market” can be the wholesale, distribution and retail markets. However, if the economic aim is the penetration of a specific consumer market, the relevant “market” is much narrower, in that it consists only of the particular retail (end user) market. In appropriate cases, that would be the only market in which the economic aim can be achieved. 100 To summarise, it is my view that the expression “put on the market” in s 29(1) of the TMA refers to the situation where an independent third party has acquired the right of disposal of the goods bearing the trade mark. The acquisition by an independent third party of the right of disposal must be an act that simultaneously allows the proprietor of the trade mark to realise the commercial or economic value of the trade-marked goods, and deprives him of the right to control the subsequent exploitation of the goods. Such an act includes, but isnot limited to, a sale of the goods by the proprietor to the third party. It does not, however, include preparatory acts such as offers for sale. Additionally, the precise “market” in question is contingent on the precise factual matrix of each case and the economic objective of the particular trade mark proprietor. Decision 101 I now turn to the question of whether the Detained Backpacks in the present case have been “put on the market” for the purposes of s 29(1) of the TMA. 102 The Plaintiff submitted in oral argument and written submissions, and the Defendant does not dispute, that the economic objective of the Plaintiff is to penetrate the Chinese consumer market, to create awareness of the SAMSONITE brand, and to boost its reputation specifically by being associated with LENOVO laptops.20Foot Note 20×Plaintiff’s written submissions para 61.I agree with the Plaintiff that in the light of this economic objective, the relevant “market” is the retail (end-user) market in China. The commercial value of the SAMSONITE Marks would only be realised if a purchaser of a LENOVO laptop has received a SAMSONITE backpack as a free gift along with his laptop. 103 In my judgment, it is abundantly clear that the 2,328 Detained Backpacks have never been “put on the market” in the present case. There is no realisation of the economic value outlined in the preceding paragraph, as the Detained Backpacks have never reached Chinese consumers in the retail market in China. There was, therefore, no penetration of the Chinese market with the associated boosting of awareness of the SAMSONITE brand. This is all the more so, given that the Detained Backpacks wereunbundledby some of the authorised dealers from the LENOVO laptops, and could not have been associated with the LENOVO brand. Indeed, the presence of LENOVO trade marks, together with the SAMSONITE trade marks, on the Detained Backpacks without any accompanying LENOVO laptop or LENOVO product might well cause concern. I return to this point later. 104 To be clear, none of the acts in Path Two (see [15] above) constituted putting the goods on the market, given the particular economic objective. The Detained Backpacks were not put on the market when they were passed from Samsonite China to Lenovo, as there was no assertion that Samsonite China had sold the co-branded backpacks to Lenovo for profit. It will be recalled that the consideration for the supply of the co-branded backpacks was the free distribution of these backpacks as part of the bundled package to end user purchasers of certain LENOVO laptops. Further, the fact that the Detained Backpacks were passed to Lenovo and thereafter to its authorised dealers is neither here or there. In the circumstances of this case, which involved a co-branding arrangement, the authorised retailers are not independent third parties. It also cannot be the case that the Detained Backpacks were put on market when sold by the authorised dealers to the unauthorised dealers, or by the unauthorised dealers to the parallel importers. This is because any profit received through these sales was never passed on to the Plaintiff as the proprietor of the trade mark, either directly or through its licensee, Samsonite China. 105 To sum up, although it is undeniable that parallel imports are generally favoured in Singapore, the first and foremost requirement of the exhaustion of rights defence is that the proprietor of the trade mark must have been able to reap the economic benefits of his intellectual property right. This is why s 29(1) of the TMA only applies where the trade-marked goods have been “put on the market”. This requirement was not satisfied on the facts of the present case. The Detained Backpacks were thus never put on the market for the reasons explained above.",
        "Were the goods put on the market with the proprietor’s “express or implied consent (conditional or otherwise)”?": "106 Given the conclusion that the Detained Backpacks were not even “put on the market”, there is strictly speaking no need to delve into the logically subsequent issue of whether they were put on the marketwith the proprietor’s express or implied consent (conditional or otherwise). However, given that the Question, as framed, impliedly raises issues as to the consent of the proprietor, and given that the Defendant has listed the issue of consent as a triable issue at [35] above, it may be helpful to set out some observations on the issue of consent. Legal principles 107 The exhaustion of rights defence in s 29 of the TMA draws a distinction between two scenarios. The first envisages goods being put on the marketby the trade mark proprietor himself. The second envisions goods being put on the marketby a third party, butwith the proprietor’s “express or implied consent (conditional or otherwise)”. 108 The Advocate-General opined inPeak Holdingat [48] that the latter scenario represents a “criterion of attributability”, in that it allows the establishing of whether the putting of goods on the market by a third party can nonetheless be “attributed” to the trade mark proprietor by virtue of his consent. 109 The problematic issue is what “consent” entails. This is succinctly summarised in Mark Davison & Ian Horak,Shanahan’s Australian Law of Trade Marks and Passing Off(Thomson Reuters, 5th Ed, 2012) at para 90.635, in which the learned authors state that consent can on the one hand mean “acquiescence”, “silent submission”, “giving tacit assent” or “being silent compliant or resting satisfied”. This means not objecting and being contentedly neutral or ambivalent about another’s conduct. On the other end of the spectrum, consent can also be positively expressed, with a pro-active connotation of giving permission. 110 The issue of consent is especially problematic in the UK and EU contexts, where the wording of the relevant provisions simply read “with [the proprietor’s] consent”. This has resulted in litigation as to whether implied consent is sufficient for the purposes of the exhaustion of rights defence. The Singapore position is somewhat clearer as to the type of consent that is acceptable, given the addition of the words “express or implied consent (conditional or otherwise)”. 111 I note from the outset that the ECJ approach inZino Davidoff SA v A& G Imports Ltd(Joint Cases C-414/99 to C-416/99), [2001] ECR I-8731 (“Zino Davidoff (EU)”) requires the defendant who alleges consent to prove consent: see Cornish, Llewelyn & Aplin,Intellectual Propertyat para 18-122. In other words, it is up to the parallel importer to provide the evidence. It is not for the trade mark proprietor to prove its absence. Express consent 112 Express consent is generally uncontroversial: it is permission for something that is explicitly, clearly and unmistakably given, either verbally, in writing or by clear conduct (such as an unmistakeable nod). Implied consent 113 The notion of “implied consent” is a more difficult concept to grapple with, especially in terms of its application. In general, it can be characterised as consent which is not expressly granted by the proprietor, but rather inferred from his actions and/or the facts and circumstances of a particular situation. General circumstances in which consent may be implied 114 TheZino Davidoffline of cases provides valuable insight into the circumstances in which consent may be implied. The same facts came before the courts of England and Scotland, with a preliminary reference to the ECJ. 115 InZino Davidoff (England), the plaintiff was the proprietor of two trade marks, COOL WATER and DAVIDOFF COOL WATER, registered in the UK and used in a wide range of toiletries and cosmetic products. These products were manufactured in France for distribution worldwide, including to Luxasia Singapore, which was given an exclusive right to import, sell and distribute products in Singapore, Malaysia, Indonesia, the Philippines, Hong Kong, Cambodia, Sri Lanka and Myanmar (“the Territories”). Luxasia Singapore had contracted not to sell outside the Territories, and was bound to impose these obligations on customers to whom it on-sold. The parallel importer sourced for goods bearing the relevant trades marks from Singapore and re-imported the goods back to the UK. The plaintiff applied for summary judgment against the defendant in respect of alleged infringement of its trade marks on the ground,inter alia, that the trade mark rights were not exhausted when they were placed on the market outside the EEA. 116 Laddie J held (at [38]) that in deciding whether a third party has a right to distribute and onward sell the goods without restriction, regard must be had to all the relevant circumstances including the nature of the goods, the circumstances under which they were put on the market, the terms of any contracts for sale and the provisions of any applicable law. In particular, where the law of a non-EEA country includes a rebuttable presumption that, in the absence of full and explicit restrictions being imposed on purchasers at the time of purchase, the proprietor is treated as consenting to the goods being imported and sold within the EEA, courts within the EEA are free to recognise the effect of that law and allow the importation of those goods. 117 In the circumstances of the case before him, Laddie J observed (at [39]) that the goods in issue were placed in the market in circumstances where the plaintiffcouldhave placed, but didnotplace, an effective restraint on their further sale and movement. As a consequence, pursuant to the contract, purchasers within the chain of distribution of the plaintiff’s products were free to market the goods where they liked, including within the EEA. The plaintiff was treated as having consented to such marketing. A question was then referred to the ECJ for a preliminary ruling, seeking the clarification as to the manner in which the consent of a trade mark proprietor may be expressed, and in particular whether the consent of a trade mark proprietor to the putting on the market must be express or can also be implied. 118 It is interesting to note that whenthe same facts came before Lord Kingarth in the Scottish case ofZinoDavidoff SA v M & S Toiletries Ltd(No 1)[2000] ETMR 622 (“Zino Davidoff (Scotland)”)(at a time when the referral to the ECJ was pending), Lord Kingarth reached the opposite conclusion from Laddie J. He held that, on the same distributorship agreement, there wasnoimplied consent by the proprietor of the trade mark. He reasoned that it was not seriously disputed that there was a clear intention from the distributorship agreement that the goods be subject to retail sales within the Territories and not beyond. Nor was it disputed that the agreement sought to provide that all distributors in the potential chain of distribution which was contemplated, up to and including sales to retailers, would need to impose on purchasers restrictions on sale outside the Territories (at [18]). Thus, it appears that the trade mark owner had taken all reasonable steps to limit sales to the Territories. Further, he noted that Art 7(1) of the EU Trade Marks Directive was a derogation from the rights conferred on the trade mark owner by Art 5(1), and derogations should generally not be construed widely. Against that background, before a trade mark proprietor could properly be said to haveconsentedto the putting on the market of particular goods by a third party, a reasonable construction would suggest that he must at least have had knowledge of “the third party's actings or proposed actings” in relation to the goods (at [14]). 119 When the ECJ considered the case (together with two other related cases) inZino Davidoff (EU), it agreed with the Scottish approach. The ECJ was of the view (at [44]) that the question is not whether consent must be express or implied but rather “whether the trade mark proprietor has had a first opportunity to benefit from the exclusive rights he holds within the EEA.” Further, the ECJ noted (at [45]) that because of the serious effect of extinguishing the exclusive rights of the trade mark proprietors, an intention to renounce those rights must beunequivocally demonstrated.Such intention wouldnormallybe gathered from anexpressstatement of consent. Nonetheless, the ECJ agreed that it was conceivable that consent in some cases might beinferredorimpliedfrom facts and circumstances prior to, simultaneous with or subsequent to the placing of the goods on the market outside the EEA, whichunequivocally demonstratethat the proprietor has renounced his right to oppose the placing of the goods on the market within the EEA (at [45]-[46]). 120 The ECJ went on to hold that implied consent could not be inferred from the fact that the trade mark proprietor had not communicated to all subsequent purchasers of the goods his opposition to marketing within the EEA, the fact that the goods carried no warning or prohibition in this regard, or the fact that the trade mark proprietor had not imposed any contractual reservations upon subsequent purchasers of goods and that under the law governing the contract of sale, there was an unlimited right of resale. Clearly, the ECJ approach on consent is much narrower than the approach taken by Laddie J inZino Davidoff (England). Indeed, one commentator has stated that “in effect, though the [ECJ] held that it was possible for consent to be implied, for all practical purposes, the consent must be express”: Christopher Morcom QC, Ashley Roughton & Thomas St Quintin,The Modern Law of Trade Marks(LexisNexis, 4th Ed, 2012) at para 16.55. Related entities within the same corporate group 121 One specific situation in which consent may be implied is with respect to related entities within the same corporate group. This was the position in the UK Court of Appeal case ofRevlon Inc v Cripps & Lee Ltd and Others[1980] FSR 85 (“Revlon”), which concerned the issue of consent under the repealed s 4(3)(a) of the UK TMA 1938. As explained at [61] above, the consent under the repealed statute relates to theuseof the trade marks, which is broader than the “putting [of the goods] on the market”. Nonetheless, it provides useful guidance as to the meaning of “consent” in the context of the exhaustion of rights defence as currently framed. 122 InRevlon,the plaintiffs were members of an international group engaged in making and selling cosmetics and toiletries. The first plaintiff, Revlon Inc, was the parent company based in Delaware. It owned the trade marks and marketed the REVLON and REVLON FLEX range of shampoos in the United States (“US”), including an anti-dandruff shampoo (which was subsequently discontinued). The anti-dandruff shampoos were, however, never marketed in the UK. The second plaintiff, Revlon Suisse SA (“Revlon Suisse”), was the registered proprietor of the REVLON marks in the UK. The third plaintiff, Revlon Overseas, manufactured the products, and the fourth plaintiff, Revlon International, distributed and marketed them. The defendants managed to obtain the supplies of the discontinued line of anti-dandruff shampoo from the US, which they imported into the UK. The plaintiffs applied for interlocutory injunctions against the defendants. The defence to the trade mark infringement alleged was s 4(3)(a) of the UK TMA 1938. 123  In considering whether there was consent to the use of the marks, Dillon J, in the High Court, held that in the context of the group structure and group operations, each company in the group impliedly consents to any use of any group mark by any other company in the group (at 97). Citing (at 95) Lord Denning MR inDHN Food Distributors Ltd v Tower Hamlets London Borough Council[1976] 1 WLR 852 at 860, he opined that this was especially the case when a parent company owns all the shares of the subsidiaries, so that it could control every movement of the subsidiaries. These subsidiaries are bound hand and foot to the parent company and must do as what the parent company said. In such a case, the companies should be treated as one. 124 On appeal, Templeman LJ agreed with Dillon J’s approach, commenting (at 115) that the Revlon group of companies was one collective corporate entity, regardless of the technical legal distinctions. Although the parent company, Revlon Inc, did not own the REVLON FLEX marks in the UK, they were held by Revlon Suisse (the proprietor of the UK trade marks)for the benefit of Revlon Inc. He opined that in a group such as Revlon, the legal ownership of trade marks were mere instruments. In fact, Revlon Inc orchestrated the business of the group through the subsidiaries for the benefit of itself. He further held (at 117) that Revlon Suisse was a subsidiary which could not object to the parent company, Revlon Inc, putting the trade mark and disposing of the goods in the US or anywhere else in the world. Thus, Revlon Suisse was taken as having impliedly consented to the use of the trade mark in connection with the goods which emanated from the parent company, and which had found their way into the ownership of the defendants. 125Revlonwas distinguished inColgate-PalmoliveLtd and Another v Markwell Finance Ltd and Another[1989] RPC 497 (“Colgate”), which is another UK Court of Appeal case.InColgate, Colgate-Palmolive Company (“Colgate US”) was the parent company with subsidiaries in multiple jurisdictions. The subsidiaries in each country were given licences to produce toothpaste marked with the COLGATE trade marks. In Brazil, the use of the COLGATE trade marks was licensed to a company known as Colgate-Palmolive Limitada (“Limitada”). To meet the requirements under Brazilian law, the licence to Limitada expressly stated that exports to other countries were not restricted. However, in practice, Colgate US retained a high degree of control over exports by its subsidiaries, through Colgate-Palmolive Global Trading Company (“Global”), another of its subsidiaries. Pursuant to the agreement, Limitada’s exports were limited to three export markets: Bolivia, Paraguay and Chile. Limitada also sold to export trading companies in Brazil, for export to countries where there were no Colgate subsidiaries, such as Nigeria. 126 The defendants parallel imported consignments of COLGATE toothpastes from Brazil into the UK. These toothpastes were being sold at lower prices, in competition with the toothpaste made in the UK by the UK licensee of the COLGATE trade marks. It should be noted that the toothpaste produced in Brazil were of lower quality as compared to those made in the UK, as there were significant differences in the formulation of the products. The Brazilian toothpastes used calcium carbonate (chalk) as an abrasive element, rather than silica or dicalcium phosphate, as calcium carbonate was cheaper and easier to obtain in Brazil. 127 On the issue of consent, Falconer J held at first instance that neither Colgate UK nor Colgate US had expressly consented to the use of the UK-registered trade marks. Colgate US had only consented to the use of the Brazilian trade marks, as evidenced by the strict regulation on exports by the agreement with Global. This was upheld by Slade LJ on appeal. 128 On the issue of implied consent, the court distinguishedRevlonon its facts and held that there was no implied consent. The court saw no reason why, in the absence of express consent and in the face of attempts to prevent import of Brazilian toothpaste to the UK, the plaintiffs should be treated as impliedly consenting to the use of the UK trade marks in the UK, especially where, because of the qualitative differences in composition, there would be a misrepresentation to consumers as to the quality of the product (at 527). 129 It should be noted thatRevlonwas distinguished rather than overruled. It may be said that implied consent inRevlonwas established largely because of the high degree of corporate control by the parent company over its subsidiaries, such that they can be treated as asinglecorporate entity where consent is concerned. This is coupled with the absence of any qualitative differences in the good that was imported into the UK from the US. 130 The reasoning inRevlonappears to have been adopted in the Singapore case ofPan-West, which was an appeal from a summary judgment application by the plaintiff. The plaintiff was the proprietor of the KATANA GOLF trade mark in Singapore for golf clubs. A similar KATANA mark was also registered in Japan for golf clubs, in the name of an unrelated company, Umeda Shokai KK (“Umeda”). When the defendant imported Umeda’s KATANA golf clubs, it was sued for trade mark infringement and passing off. The defendant argued that it had a defence under s 29(1) of the TMA. Lai Kew Chai J held that s 29 of the TMA was not applicable. It was held that s 29 of the TMA only applied to genuine goods of the trade mark proprietor. The mark that was applied on the defendant’s goods was not the plaintiff’s trade mark. The golf clubs were not put on the market in Japan under the plaintiff’s trade mark, or with their consent. Instead, it was made by the registered proprietor in Japan. One key plank of Lai J’s reasoning was that the plaintiff and Umeda were “separate and distinct entities” (at [53]), and Umeda was “not a subsidiary or an associated company of the plaintiffs” (at [35]). 131 This distinguishesPan-Westfrom the case ofHup Huat Food Industries (S) Pte Ltd vLiang Chiang Heng and Others[2003] SGHC 244 (“Hup Huat”).In that case, the plaintiff (a Singapore company) was the registered proprietor of the APOLLO trade mark for biscuits and other confectionary products. The same trade mark was registered in Malaysia in the name of Hap Huat Food Industries Sdn Bhd (“HHM”). The goods in question were made in Malaysia by Apollo Food Industries (M) Sdn Bhd (“AFI”). The plaintiff imported AFI’s APOLLO goods into Singapore for sale here and re-exported them to other countries in the Middle East. The fifth defendant used to buy AFI’s APOLLO goods from the plaintiff, but started dealing directly with AFI from July 2002. One of the claims the plaintiff made in the suit was against the fifth defendant for trade mark infringement and passing off for importing APOLLO goods from AFI into Singapore. 132 Tay Yong Kwang J (as he then was) held that the fifth defendant was not liable for trade mark infringement, reasoning (at [81]): … Like some other businesses here dealing with Apollo products, [the fifth defendant] was importing genuine Apollo products from AFI for resale. Indisputably, the plaintiff allowed AFI to manufacture Apollo products in Malaysia and to sell them in Singapore and elsewhere. The fifth defendant was entitled to invoke s 29(1) [of the TMA] … The present case was not unlike that inRevlon Inc v Cripps & Ltd …where it was observed thatthe Revlon Flex mark had become in effect the house mark of the Revlon group, indicating that the goods to which it was applied originatedfrom the Revlon group but not any particular entity in the group.Here, the Apollo trademark was applied freely in Malaysia by AFI, the manufacturer, with HHM being the owner of the trademark in Malaysia. The products were then sold in Singapore and elsewhere.The trademark was no longer the preserve of the plaintiff. [emphasis added] 133 In New Zealand, the concept of “associated persons” of the owner of a trade mark was built into the Trade Marks Act 2002 (New Zealand) (“NZ TMA 2002”), through the latest legislative amendments in 2011. Section 97A of the NZ TMA 2002 states: 97A Exhaustion of rights conferred by registered trade mark (1) A registered trade mark is not infringed by the use of the trade mark (including use for the purpose of advertising) in relation to goods that have been put on the market anywhere in the world under that trade mark under any 1 or more of the following circumstances: (a) by the owner: (b) with the owner’s express or implied consent: (c) by an associated person of the owner. (2) For the purposes of subsection (1)(c), a person is an associated person of the owner if— (a) they are in the same group of companies; or (b) they are both bodies corporate and they consist of substantially the same members or are directly or indirectly under the control of the same persons; or (c) either of them has effective control of the other's use of the trade mark; or (d) a third person has effective control of the use of the trade mark by each of them. (3) For the purposes of subsection (2),— (a) group of companies includes a holding company and its subsidiaries within the meaning of section 5 of the Companies Act 1993; and (b) a person has effective control of the use of a trade mark if that person may authorise the use of the trade mark or has significant influence over how it is used, regardless of how that authorisation or influence arises (for example, whether directly or indirectly and whether by way of proprietary interest, contract, arrangement, understanding, a combination of those things, or otherwise). [original emphasis omitted; emphasis added in italics] 134 The New Zealand position appears to be unique. It does not attempt to deal with related entities under the ambit of the “consent” of the trade mark proprietor (implied or otherwise), as is the case in England. Instead, s 97A of the NZ TMA 2002 allows for the exhaustion of rights defence to apply where an “associated person” of the trade mark owner puts the goods on the market directly. A person is an associated person of the owner of the trade mark if, as defined in s 97A(2), (a) the associated person is in the same group of companies as the owner of the trade mark; (b) both the owner and the associated person consist of substantially the same members or are under the control of the same persons; (c) one has effective control of the other’s use of trade marks; or (d) a third party has effective control of the use of trade marks by each of them. While this court makes no comment on how cases might be decided under New Zealand law, it appears that if theRevloncase had come before the New Zealand courts today,Revlon Inc would be deemed to be an “associated person” of Revlon Suisse (the trade mark proprietor in the UK) who has placed the goods on the market, under ss 97A(2)(a), 97A(2)(b) or 97A(2)(c) of the NZ TMA 2002.The exhaustion of rights defence would likely apply, without the need for an analysis leading to the implication of consent on the part of Revlon Suisse. It is understood that the purpose of this defence in New Zealand is to allow the parallel importation of legitimate goods, in line with the Government’s parallel importing policy (seeLeisureworldat [67]). Incidentally, this policy position is in line with that in Singapore (as explained earlier). However, for the avoidance of doubt, I stress that the comments on the New Zealand position are simply intended to illustrate the range of issues that have arisen and the different approaches that can be adopted. Observations on implied consent in Singapore 135 Taking into account of the case law surveyed thus far, in particularZino Davidoff (EU), I make some general observations on implied consent in Singapore. 136 A registered trade mark is a property right. Under the TMA, the registered proprietor is granted certain exclusive rights. These include the right to object to importation of goods under the sign. Section 29 of the TMA is a derogation from the exclusive rights of the trade mark proprietor. The derogation is especially significant as it embraces international exhaustion, as opposed to regional exhaustion within a common market. Thus, the onus is rightly on the defendant to show consent on the part of the proprietor of the trade mark. Further, consent under s 29 of the TMA, whether express or implied, must not be ambiguous. 137 That said, there is no reason why consent should be unduly limited such that it cannot arise from the conduct of the registered proprietor. Parliament, by adopting the principle of international exhaustion, is clearly taking a stance favourable to parallel imports. An overly narrow approach to consent might be said to be inconsistent with that stance. Indeed, one of the main concerns in theZino Davidoffseries of cases is that implying consent for the goods to be put on the marketwithinthe EEA, where consent was only given for the same goods to be put on the marketoutsidethe EEA, would amount to allowing international exhaustion of the proprietor’s rights by the back door: seeZino Davidoff (Scotland)at [11]. However, since Singapore already adopts the international principle of exhaustion, no such concern arises. 138 In the present case, it is not necessary for me to make a definitive finding on consent since I have held that the Detained Backpacks were never put on the market in the first place. The cases referred to above, such asRevlon,Colgate, Pan-West, Hup Huatand theZino Davidoffline of cases, well demonstrate the tricky issues that surround the issue of consent. Given that neither side has referred to these cases, I shall say no more on the general principles and approach to consent save for some comments on the concept of “conditional consent”, to which I now turn. “Conditional or otherwise” 139 The final gloss on consent arises out of the phrase “conditional or otherwise” in s 29(1) of our TMA.  This phrase is not found in s 12 of UK TMA 1994 or Art 7(1) of the EU Trade Marks Directive. In Singapore, it appears that the phrase was likely borrowed from 25(4) of the Copyright Act (Cap 63, 2006 Rev Ed) and s 66(2)(g) of the Patents Act (Cap 221, 2005 Rev Ed). 140 The provision means that even if the proprietor’s consent to the first putting on the market is conditional and not unqualified, it will still be treated as valid consent under s 29(1) of the TMA. The learned author in Ng-Loy Wee Loon,Law of Intellectual Property of Singapore(Sweet & Maxwell, 2nd Ed, 2014) (“Ng-Loy,Law of Intellectual Property of Singapore”) states at para 24.8.5 that the reference to “conditional or otherwise” in relation to the proprietor’s consent provides a “deeming” effect, in that the proprietor is “deemed to have given consent to the sale of the goods even where he has imposed conditions on the further movement of the goods, for example, by restricting sale of the goods to a particular territory”. This is also the view of the learned author in Tan,Law of Trade Marks and Passing Offat para 13.110. This is in accordance with the principle underlying s 29(1) of the TMA that once the proprietor of the trade mark has consented to thefirstplacement of the goods on the market,even though that consent is not unqualified, the exhaustion of rights defence prevents the proprietor of the trade mark from controlling thesubsequentexploitation of the goods (see [73] above). Observations in relation to the facts of this case 141 Having made some general observations of the notion of “consent” in s 29(1) of the TMA, I now make further observations in relation to the facts of the present case. 142 The proprietor’s consent, according to s 29(1), has to be with reference tothe putting of the goods on the market. As I have earlier defined, the expression “put on the market” refers to the realisation of the economic or commercial value of the trade mark, which in this case is the penetration of the Chinese consumer market and the boosting of the reputation or awareness of the SAMSONITE Marks by association with LENOVO laptops. The Plaintiff has never consented to the Detained Backpacks being diverted by some of the authorised dealers into the hands of the Defendant parallel importer. 143 Instead, it is clear that the only consent that the Plaintiff gave under the co-branding agreement is in relation to acts leading to the putting of the co-branded backpacks on the market, namely for: (a) Samsonite China, its licensee, to manufacture the co-branded backpacks (including the Detained Backpacks) and apply the SAMSONITE Marks on them; (b) Samsonite China to supply the co-branded backpacks to Lenovo; and (c) Lenovo to pass the co-branded backpacks to its authorised distributors and retailers togive away in conjunction with the sale of certain models ofLENOVO laptopsto end users in China only. 144 I pause to address another argument raised by the Defendant. The Defendant’s position is that despite a term in the co-branding agreement that the co-branded backpacks are to be exclusively distributed by Lenovo’s distributors together with the sale of LENOVO laptops, unbundled backpacks were still available for sale outside of the Plaintiff’s authorised distribution channels, with the result that some of these backpacks were then sold to the Defendant for export to Singapore. To this end, Lenovo had itself conceded that it had been difficult to have a complete control of the unbundling of the backpacks and the LENOVO laptops. Therefore, the Defendant argues, it could reasonably be inferred that there was implied consent from the Plaintiff for the backpacks to be sold in Singapore. Alternatively, the Defendant argues that the sale of the backpacks to the Defendant can be “deemed” to have been made with the consent of the Plaintiff as the proprietor. For this proposition, the Defendant cites the learned author in Ng-Loy,Law of Intellectual Property of Singaporeat paras 24.8.4–24.8.5 on the definition of the “deeming” effect of consent (see [140] above).21Foot Note 21×Defendant’s submissions paras 13 (b), (c), 22(b), (c), 23 and 30In my judgment, the Defendant’s argument is misconceived on several counts. 145 First, it is clear that Plaintiff and Samsonite China had actively tried to prevent and police unauthorised sales of the co-branded backpacks, and sought to ensure that Lenovo and its authorised distributors adhered to the terms of the co-branding agreement. Indeed, the Defendant does not dispute that active policing was carried out. The fact that the Plaintiff and Samsonite China were not completely successful in their endeavour does not mean that consent can be implied from this failure. This was not a case where the Plaintiff was aware of the sales of unbundled backpacks, could have objected to it, but did not, thereby opening the door to a finding of tacit acceptance of the status quo or acquiescence to the sales. On analogy withColgate,there is no reason why, in the absence of express consent and in the face of attempts to prevent the sale of unbundled backpacks, consent should be implied in such circumstances. 146  Second, the Defendant’s reliance on the “deeming” effect of conditional consent is misplaced. It would be recalled that the consent of a proprietor that is required is in relation to the putting of the goods on the market, which only occurs when a consumer in China purchases a LENOVO laptop with the accompanying SAMSONITE backpack. Given the purpose of the co-branding arrangement as described above, as well as the legal definition of “market”, I am of the view that the restrictions were highly relevant to determining the relevant market for s 29 of the TMA on the facts. The question of consent (express or implied) must be related to the market. The putting of the goods on the market doesnotoccur when Samsonite China supplied the backpacks to Lenovo. Thus, the Plaintiff can legitimately impose restrictionson Lenovo(as well as its distributors) as to how the backpacks are to be distributed. The Plaintiff did not impose conditions to control the subsequent exploitation of the co-branded backpacks bearing the SAMSONITE Marksaftera consumer in China had received it in conjunction with the LENOVO laptop (ie, after the co-branded backpacks have been “put on the market”). This is, therefore, not a case in which the Plaintiff’s consent to putting the backpacks on the market was “conditional”, and from which consent can be “deemed” in the first place.",
        "Observations on the exception under s 29(2) of the TMA": "147  The qualification to exhaustion set out in s 29(2) of the TMA, while not raised in submissions, was briefly alluded to in the affidavit filed in support of the application. This has been referred to at [59] above. I shall accordingly make some brief observations on it. 148 To make out an exception under s 29(2) of the TMA in Singapore, it is necessary for two cumulative conditions to be shown: (a) The condition of the goods has been changed or impaired after they have been put on the market; and (b) The use of the trade marks on the altered goods is such as to cause dilution in an unfair manner to the distinctive character of the trade mark. 149 The SAMSONITE Marks have been registered in several classes. The bulk of the goods relates to bags, suitcases and the like (see [6] above). In the present case, the goods manufactured by Samsonite China were the co-branded backpacks. The laptops were made by Lenovo. The co-branded backpacks and the LENOVO laptops were intended to be provided as a bundled item to consumers in China.  As mentioned at [11] above, the co-branded backpacks bore the SAMSONITE trade mark as well as the LENOVO trade mark (either as a stitched-in label or hand tag). The commercial concept was to develop the brand awareness of Samsonite in China through the association with Lenovo. Indeed, while the point was never raised, it may well be that Lenovo also saw advantage in association with the SAMSONITE brand. In any case, the point is that in the context of a co-branding agreement where each trade mark proprietor is responsible for different goods within the package (backpack and laptop), tricky questions can arise over the application of s 29(2) of the TMA. What are the “goods” in the context of co-branding? Is the condition changed or impaired where co-branded bundled goods are merely split apart and separately dealt with, and if so, will the use of the SAMSONITE Marks cause dilution in an unfair manner of the distinctive character of the registered trade mark?: see Ng-Loy,Law of Intellectual Property of Singaporeat para 24.8.11 and Tan,Law of Trade Marks and Passing Off in Singaporeat para 13.112. In the UK and the EU, where there is a similar but not identical provision denying exhaustion where the condition of the goods has been changed or impaired, there has been considerable discussion of the meaning of the provision: seeZino Davidoff (England).Given that this matter was not developed or argued in submissions, I say no more on this issue.",
        "Given the determination of the Question, should summary judgment be granted to the Plaintiff under O 14 r 1 of the Rules of Court?": "",
        "Conclusion": "157 Therefore, summary judgment is granted to the Plaintiff on the terms of the prayers in Summons No 3175 of 2016, including an injunction to restrain the Defendant and its officers, servants and agents from infringing the SAMSONITE Marks, a delivery up of the Detained Backpacks, and an inquiry as to damages or (if the Plaintiff elects) an account of profits, together with payments of all sums found due to the Plaintiff. 158 The Defendant’s counterclaims are dismissed. 159 Costs are to be paid by the Defendant to the Plaintiff, to be taxed if not agreed.  George WeiJudge Nurul Asyikin Binte Mohamed Razali and Denise Loh Li Ping (Ella Cheong LLC) for the plaintiff; Kris Chew Yee Fong (Zenith Law Corporation) for the defendant."
    }
}