{
    "case_title": "Biofuel Industries Pte LtdvV8 Environmental Pte Ltd",
    "ncitation": "[2017] SGHC 184",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1The Plaintiff, Biofuel Industries Pte Ltd (“Biofuel”) is a waste disposal service provider. The Defendant, V8 Environmental Pte Ltd (“V8”) is a waste management service provider. It collects waste from its customers’ construction sites or premises for a fee and eventually delivers the waste to disposal facilities provided by others such as Biofuel. In the present case, the waste involves waste wood and wood chips collectively referred to as “biomass”. Biofuel accepts such biomass for a fee. 2The dispute between the parties is centred on an agreement called the Biomass Supply Agreement (“BSA”). Under the BSA, V8 agreed to appoint Biofuel as its exclusive Recycling Plant Facilitator for the disposal of biomass for a period of five years. V8 undertook to supply a minimum tonnage of 2,000 metric tons of biomass per month and to pay Biofuel at certain fixed rates for waste wood (at $30 per metric ton or “pmt”) and for wood chips (at $13.50pmt). 3It was unclear from the BSA when the five year period commenced from. One copy of the BSA in the Agreed Bundle of Documents (“AB”) has a handwritten date of 25 July 2013 below the signature of Derrick Yu of V8 but the date of execution by Eugene Lee of Biofuel was left blank. Another copy annexed as an exhibit to an affidavit of evidence-in-chief (“AEIC”) of Derrick Yu does not show the date of 25 July 2013 but has a handwritten note, “(Start from 1 August 2013)” beside his signature. Biofuel’s Opening Statement at para 11(b) stated that the BSA started from July 2013 to July 2018. V8’s Opening Statement at para 1 stated that the BSA was entered into on 1 August 2013. 4The difference in the alleged starting date was not material for the issue of liability. However, it should be established as it may affect, however slightly, the computation of certain reliefs claimed by Biofuel. Since the execution by Derrick Yu of V8 was on 25 July 2013 and it is unclear when Eugene Lee of Biofuel executed the BSA and in the light of the handwritten note, “(Start from 1 August 2013)”, I am of the view that the BSA commenced on 1 August 2013. 5By an undated letter from V8 to Biofuel sent on 10 April 2015 with an email, V8 purported to terminate the BSA on the ground that Biofuel had wrongly repudiated the BSA based on various conduct of Biofuel which I shall elaborate on later. On the other hand, Biofuel took the position that it did not repudiate the BSA and that V8’s termination of the BSA was wrongful. Biofuel then filed the present action to claim the following from V8: (a) Payment of specific invoices issued by Biofuel to V8 in respect of deliveries of waste wood for the months of January to April 2015 (“the Unpaid Invoices”); (b) Damages for breach of the BSA. The damages claimed were: (i) for the shortfall in deliveries of biomass by V8 during February 2015 and April 2015 and the period from 1 May 2015 to 31 July 2015; and (ii) loss of profit in respect of Biofuel’s onward sale of wood chips to a Thai company, SCG Trading Co Ltd (“SCG”) under a contract with SCG (“the SCG contract”). 6The conduct which V8 complained of as amounting to Biofuel’s repudiation of the BSA comprised the following: (a) Biofuel’s attempts to increase the prices of disposal stated in the BSA; (b) Biofuel’s rejection of delivery of biomass on various dates; and (c) Biofuel’s attempts to impose a new requirement that wood chips delivered by V8 must be less than 100mm in length (“the 100mm requirement”), failing which Biofuel would either reject the delivery of wood chips or charge the higher rate for waste wood disposal. 7As I will elaborate on later, the third reason was the most important one. It entailed a consideration as to whether the 100mm requirement was an applicable term of the BSA. Before I continue, I would mention that there was some slight confusion over the 100mm requirement. The parties referred to it as requiring wood chips delivered by V8 to be less than 100mm in length or not more than 100mm in length interchangeably. The two standards are not exactly the same but the difference is immaterial for present purposes. For convenience, I have treated the 100mm requirement to be less than 100mm in length.",
        "The witnesses": "8The two witnesses for Biofuel were: (a) Lee Shung Guan also known as Eugene Lee. He was the Chief Executive Officer of Biofuel and was the main witness for Biofuel. He signed the BSA on behalf of Biofuel. (b) Lee Peng Quan also known as George Lee. He is the brother of Eugene Lee and was the Plant Manager of Biofuel. 9The three witnesses for V8 were: (a) Yu Jia Ru Derrick, referred to as “Derrick Yu” in this judgment. He was the Sales and Operations Director of V8 and was its main witness. He signed the BSA on behalf of V8. (b) Er Kee Sing. He was the founder and Managing Director of V8 and is the father of Derrick Yu. (c) Er Chin Guan also known as Ah Tee. He was the Operations Manager of V8 and is the cousin of Er Kee Sing.",
        "Biofuel’s alleged repudiatory conduct": "10I turn now to consider the conduct which V8 complained of as amounting to Biofuel’s repudiation of the BSA, beginning with Biofuel’s attempts to impose the 100mm requirement.",
        "The 100mm requirement": "11As mentioned earlier, the key consideration is whether the 100mm requirement was an applicable term of the BSA. 12The business relationship between the parties started in 2006 or 2007. At that time, pursuant to an oral agreement between a sales staff of Biofuel (by the name of Roy) and Derrick Yu, the parties agreed that Biofuel would provide waste wood disposal services to V8 at the price of $40pmt. In the course of that relationship, Derrick Yu got to become familiar with Eugene Lee. 13In late 2010, Eugene Lee informed Derrick Yu that his other company Hammel (S) Pte Ltd (“Hammel Singapore”) was distributing wood shredders. Eugene Lee said that with such a machine, V8 could shred its waste wood into wood chips and deliver the latter to Biofuel at a reduced price of $15pmt.  Consequently, an order confirmation was issued by Hammel Singapore to V8 dated 24 December 2010 for the supply to V8 of one such shredder. 14According to Eugene Lee, he had specifically informed Derrick Yu and his father, when they were discussing about the purchase of a shredder, that the machine they were to purchase would meet the 100mm requirement for wood chips. This was because the machine had 10 knives with 7/7 discs and such a specification would meet the 100mm requirement. 15On the other hand, Derrick Yu and his father denied having been told specifically that the shredder would meet the 100mm requirement. It was their position that the 100mm requirement was not discussed. 16The shredder was delivered to V8 in or about May 2011. From July 2011, V8 began to deliver wood chips to Biofuel at the reduced price discussed. 17About two years later, the BSA was signed. I have mentioned above that I will consider it as being effective from 1 August 2013. Under this exclusive five year contract, V8 had the option of delivering wood chips or waste wood to Biofuel. This would cost V8 $13.50pmt and $30pmt respectively. 18The terms of the BSA did not explicitly specify the 100mm requirement. However, Eugene Lee said that this requirement applied in the light of what he had said to persuade V8 to buy the shredder. He also alleged that the 100mm requirement was part of the BSA as the BSA was to ensure that Biofuel would have a supply of suitably sized wood chips to meet its own obligations to supply wood chips of the same size to SCG. Biofuel had been supplying wood chips to SCG for some time and this was subsequently formalised under its agreement with SCG dated 23 March 2012. Thus the chronology was: (a)24 December 2010Order confirmation from Hammel Singapore to V8 to supply a shredder.(b)May 2011Delivery of the shredder to V8.(c)July 2011V8 starts to deliver wood chips to Biofuel.(d)23 March 2012Biofuel’s agreement with SCG.(e)1 August 2013Effective commencement date of BSA. 19Biofuel’s contentions about the 100mm requirement ran into various difficulties. First, the 100mm requirement was not mentioned in Biofuel’s Reply (Amendment No 1) even though V8’s Defence (Amendment No 3) had raised the point that Biofuel’s imposition of the 100mm requirement was part of Biofuel’s repudiatory conduct. Biofuel’s Reply did not even hint that the 100mm requirement had already been agreed to when the shredder was ordered by V8 or that it was agreed to in order to meet Biofuel’s contractual obligations to SCG. 20Secondly, Eugene Lee’s AEIC did not mention the 100mm requirement. 21Thirdly, it was only Biofuel’s Opening Statement that first mentioned the 100mm requirement at para 19. Even then, Biofuel’s reasons for saying that this requirement applied was that, “This is the industry standard for a wood chip or the length required by [Biofuel] by custom of its business with [V8] and in wood chips”. Yet Eugene Lee’s AEIC and his subsequent oral testimony did not say anything about the alleged industry standard that wood chips delivered to a disposal facilitator must meet the 100mm requirement. Instead, his oral testimony was that there was an express oral agreement to this requirement. 22The allegation about such an express oral agreement also contradicted the allegation in Biofuel’s Opening Statement that such a length was required by the custom of its business with V8. 23Fourthly, the agreement between Biofuel and SCG did not specify that all wood chips supplied by Biofuel to SCG must meet the 100mm requirement. Instead, that agreement specified that 90% of the wood chips had to be less than 50mm in length and 10% would be 100mm in length. Thus, even if that agreement was a genuine one, it did not entirely support Biofuel’s contention that the 100mm requirement was part of the BSA in order to meet its obligations with SCG. 24Eugene Lee tried to explain this inconsistency by saying that Biofuel could meet its obligations to SCG because Biofuel was producing its own wood chips from its own shredder and this accounted for 60% to 70% of the wood chips supplied to SCG. The rest was accounted for by wood chips supplied from V8 and four other customers of Biofuel.1Foot Note 1×Notes of Evidence (“NE”) 7/3/17 pp 41–46This was a nonsensical explanation. Biofuel had given the impression that the 100mm requirement was necessary under the BSA as it was the only or the main requirement under the contract with SCG. As it turned out, the latter contract required 90% of the wood chips to be less than 50mm instead. The 100mm requirement would not have helped Biofuel meet the entirely different specifications under the contract with SCG. 25Fifthly, Eugene Lee could not adequately explain why the 100mm requirement was not specified in the BSA, which was drafted by Biofuel itself, if such a term had already been specifically agreed to before the BSA was signed. 26Sixthly, it was the evidence of Eugene Lee that after V8 started to deliver wood chips to Biofuel, not all the wood chips met the 100mm requirement. Hence, someone from Biofuel, perhaps George Lee or one Leow Ming Lee (also known as “Ah Lee”) had raised with Biofuel’s management the problem of oversized wood chips being delivered to a barge provided by Biofuel. Consequently, Biofuel appointed its own quality controller and V8 was also requested to appoint its own quality controller to pick out oversized wood chips from the piles of wood chips after they were unloaded onto the barge. This was a manual process done with the eyes and without any measurement tool. Consequently, the quality controllers would pick out only those that were obviously oversized,ie, those that were 130mm in length or shorter might be left behind.2Foot Note 2×NE 7/3/17 pp 22–26Even as the quality controllers went through the piles of wood chips, they would pick out only those oversized wood chips which they actually spotted. Furthermore, the oversized wood chips would then be placed in bags and sent back to Biofuel’s own premises at 51 Shipyard Crescent and Biofuel would re-shred them. Pertinently, Biofuel had not charged V8 any fee for these additional steps. Neither did they charge V8 the higher rate for waste wood disposal in relation to these oversized wood chips. Indeed, Eugene Lee’s evidence was that this state of affairs continued even after the BSA was signed. 27While this history showed that there was some concern by Biofuel about oversized wood chips it still fell short of establishing the 100mm requirement. Furthermore, Eugene Lee’s own evidence illustrated that there was no material contractual consequence arising from the delivery of oversized wood chips. Quality controllers were appointed to help pick out such wood chips which were then shredded at no extra cost to V8. 28Therefore, I find that Biofuel has failed to establish that the 100mm requirement was an applicable term of the BSA.",
        "The price increases for biomass disposal": "29I will now address the question whether Biofuel was entitled to increase prices for biomass disposal unilaterally. Eugene Lee’s AEIC suggested at para 18 that under the BSA, Biofuel could unilaterally increase the prices for disposal of wood chips and waste wood. Thus, he alleged that, “Despite the provision in the BSA, giving [Biofuel] the right to revise the price of deliveries of Biomass and wood chip, in order to keep the custom of [V8], [Biofuel] issued credit notes to the disputed invoices.” The BSA was poorly drafted and it was not clear from its terms whether Biofuel could unilaterally increase prices. In any event, Eugene Lee readily conceded in cross-examination that any price increase had to be agreed to by V8.3Foot Note 3×NE 3/3/17 pp 73–75I will elaborate later in some detail the instances when Biofuel attempted to increase prices unilaterally although it did issue credit notes to V8 when the increase was not accepted by V8.",
        "The rejection of deliveries of biomass": "30I will next address the question of Biofuel’s rejection of deliveries of biomass from V8. Although V8 had alleged that Biofuel had on various dates rejected deliveries of biomass from V8, Biofuel’s initial position in its Reply at para 5 was that it had never rejected deliveries from V8. 31Biofuel’s position then morphed into suggesting that even though there was rejection, Biofuel had good reason not to accept deliveries because it was running short of space to receive further deliveries of waste wood or wood chips as the case may be. There was also a suggestion that perhaps Eugene Lee was not personally aware of the rejection. Lastly, Biofuel countered with the argument that there was no evidence from V8 that it had waste wood or wood chips, as the case may be, to deliver.4Foot Note 4×NE 9/3/17 p 60 32I can address the last two points quickly. The suggestion that Eugene Lee might not be personally aware of the rejections was not pursued by Biofuel in closing submissions. It would in any event be irrelevant if other employees of Biofuel had rejected deliveries. 33It was also not open to Biofuel to argue that V8 did not produce any evidence that, on the dates in question, it had waste wood or wood chips to deliver. Up to the commencement of trial, Biofuel’s case was that it had not rejected any delivery. It did not have an alternative plea that even if it had rejected any delivery, V8 itself had nothing to deliver. If V8 established that Biofuel did not want to receive any delivery of biomass on the dates in question, it did not lie in Biofuel’s mouth to argue that, in any event, V8 did not have biomass to deliver unless advance notice was given of this allegation. No such notice was given and it came as a surprise when this was raised by Biofuel’s counsel during cross-examination of Derrick Yu. I am of the view that Biofuel was not entitled to spring this surprise on V8. 34Coming back to the question of rejection, Biofuel sought to draw a distinction between the situation when Biofuel turned back a truck of V8’s (at the barge location or at Biofuel’s premises) as opposed to the situation when Biofuel called V8 and informed V8 not to make any delivery of biomass.5Foot Note 5×NE 3/3/17 pp 14–15Biofuel’s position then was that the latter was a non-acceptance which did not constitute a rejection and only the turning back of V8’s truck when it arrived would constitute a rejection.6Foot Note 6×NE 3/3/17 p 14I am of the view that Biofuel was trying to be too clever by drawing such a fine distinction. The crux of V8’s complaint about Biofuel’s rejection was that its delivery would not be accepted with the result that it (V8) was running short of space at its own premises as the biomass which it collected from its own customers was piling up there. In that context, it was immaterial whether Biofuel had called first to inform V8 not to deliver or only informed its truck driver to turn back at the point of delivery. I reject such a distinction. Either conduct amounted to a rejection of delivery. Whether Biofuel had a good reason to reject and whether the rejection amounted to a repudiation of the BSA by Biofuel were separate arguments. As I will elaborate later, Biofuel eventually accepted that it did reject deliveries but alleged it was for valid reasons.",
        "Chronology": "35I will now set out in chronological order V8’s allegations of the dates when Biofuel attempted to raise prices and/or rejected the delivery of biomass. There was some overlapping of the steps taken by Biofuel and it was V8’s case that Biofuel’s rejections were part of a strategy to pressure V8 to agree to an increase in rates. The main question was whether Biofuel’s conduct, taken as a whole, was repudiatory in nature. 36On 26 August 2013, the National Environment Agency (“NEA”) announced that effective from 1 October 2013, recyclable waste would no longer be disposed at incineration plants and was to be disposed at designated recycling facilities. As NEA did not operate any recycling facility, its announcement was a boon to those who operated recycling plants like Biofuel. 37According to V8, another reason for an increase in demand for such services was that in 2013 and 2014, there were two large ongoing construction projects taking place at a refinery plant on Jurong Island and the Singapore Sports Hub. 38The increase in demand allowed Biofuel to charge other waste collectors higher prices. As a result, the prices in the BSA (which was a fixed price contract) became less lucrative for Biofuel which began to attempt to increase its prices for V8.7Foot Note 7×Derrick Yu’s AEIC at para 62–68 39By a letter dated 12 March 2014, Biofuel informed V8 of a new price for disposal of clean timber and clean horticultural effective from 16 March 2014. It was common ground that both these items were considered as waste wood. The new price was $45pmt (instead of $30pmt under the BSA). This letter asked for V8 to sign on the letter to acknowledge the increased price. However, the increase was not accepted by V8. 40On 17 April 2014, Ah Lee informed Er Chin Guan (aka Ah Tee) that Biofuel’s plant was full after accepting two truckloads of waste wood from V8. Accordingly, Biofuel was not accepting any further delivery of waste wood. In V8’s mind, this was a breach of the BSA as Biofuel was supposed to accept any delivery on demand. V8 noted that Biofuel continued to accept the delivery of wood chips. In V8’s view, Biofuel was refusing to accept waste wood as part of its attempt to increase the price for waste wood. As a result of the rejection, V8 had to store the waste wood at its premises. The delivery of waste wood resumed on 22 April 2014. 41On 8 May 2014, Ah Lee informed Ah Tee that Biofuel’s plant was full after accepting seven truckloads of waste wood. Delivery of wood chips was not stopped. The delivery of waste wood resumed on 9 May 2014. 42By a letter dated 9 May 2014, Biofuel informed V8 of another price increase for waste wood effective from 12 May 2014. The new price was $35pmt (instead of $30pmt under the BSA). Again, this increase was not accepted by V8. 43Nevertheless, Biofuel then issued six invoices to V8 between 19 May and 21 June 2014 based on the new price of $35pmt. 44On 18 June 2014, Ah Lee informed Ah Tee that Biofuel’s plant was full, after accepting one truckload of waste wood. Delivery of wood chips was not stopped. 45Derrick Yu said he had had enough of Biofuel’s games. He tried to telephone Eugene Lee but was unsuccessful. Therefore he sent an email instead on that day,ie, 18 June 2014. The email said, Tried to called [sic] you but you nv answer. Pls see attachment pic, our waste wood is pile up. Called your guys and they said waste wood cannot unload at your factory. Pls advise. 46There was no response from Eugene Lee but delivery of waste wood resumed the next day. 47On 28 June 2014, Ah Lee informed Ah Tee that Biofuel would not accept delivery of waste wood. However, Biofuel continued to accept delivery of wood chips. Derrick Yu then instructed Ah Tee to telephone Ah Lee. While he recorded their conversation, Ah Tee asked Ah Lee whether V8 could dispose “big wood” (meaning waste wood) and was told there was no way for this to be done. Ah Lee said he was putting a bin to load wood chips instead. 48On 5 July 2014, Biofuel again declined to accept waste wood. It was unclear whether this was done after V8 delivered one truckload of waste wood but this was not material. 49Derrick Yu then telephoned Eugene Lee. He recorded the telephone conversation. In the conversation, Eugene Lee said he could not shred waste wood in time (presumably for delivery to a barge). He asked V8 to shred the waste wood itself but Derrick Yu said the remote control of his shredder was spoilt. He also mentioned to Eugene Lee that Biofuel was increasing the price for waste wood disposal. 50In the meantime, Biofuel was chasing for payment of outstanding invoices based on the price increase. However, V8 stuck to the price under the BSA and requested that Biofuel issue credit notes to reflect the original price. This was done. 51On 15 October 2014, Biofuel sent an email to V8 attaching a letter dated 14 October 2014. This time the letter was to increase the price for disposal of wood chips to $20pmt (instead of $13.50pmt under the BSA). Also for the first time, the letter stated that wood chips must be shredded to less than 100mm in length,ie, the 100mm requirement. Otherwise they would be rejected or a rate of $45pmt would be charged. 52V8 alleged that after this, Derrick Yu and his father had a meeting with Eugene Lee at Biofuel’s premises in October 2014. George Lee was also present. It was at that meeting that Eugene Lee said that he imposed the 100mm requirement in order to meet his contract with a third party, Biofuel’s customer in Thailand. V8 responded that: (a) There was no such requirement in the BSA; (b) Biofuel had been accepting delivery of wood chips which were longer than 100mm; and (c) Biofuel’s contract to deliver to a third party was irrelevant to the parties’ obligations under the BSA. Biofuel said it would get back to V8 but did not do so. 53In the meantime, Biofuel did not reject any delivery of wood chips until 31 October 2014 when Ah Lee informed Ah Tee that Biofuel had run out of space to store wood chips, after accepting one truckload. 54Upon hearing this from Ah Tee, Derrick Yu went to Biofuel’s premises. He took a photograph of two heaps of wood chips there. He said that the first heap was significantly larger than the second heap. In his view, Biofuel still had space to store wood chips from V8.8Foot Note 8×Derrick Yu’s AEIC at para 138 55In any event, Biofuel continued to receive wood chips from V8 from the next day,ie, 1 November 2014. 56In the meantime, Biofuel had sent five invoices to V8 between 22 September 2014 and 31 October 2014 based on the higher rate of $45pmt for waste wood which was also being delivered by V8 from time to time. As V8 did not agree to the higher rate, Biofuel issued credit notes to V8 to negate the price increase. 57According to V8, George Lee informed Ah Tee on 26 November 2014 that Biofuel would not accept any further delivery of wood chips from V8 if the wood chips were longer than 100mm, after Biofuel had accepted two truckloads of wood chips. On the other hand, George Lee’s evidence was that he told Ah Tee to do something about wood chips longer than 100mm and he did not say that Biofuel would not accept such wood chips anymore. However, apparently delivery of wood chips was stopped that day. 58The delivery of wood chips resumed on 2 December 2014. 59Then on 5 December 2014, Biofuel sent a fax dated 4 December 2014 to V8. This fax stated that any oversized wood chips (more than 100mm in length) will be charged at “$60 per ton”. 60Again, V8 did not agree. Delivery of wood chips continued until 12 December 2014. According to V8, three truckloads of wood chips were unloaded. As the fourth truck was unloading its wood chips, George Lee told the truck driver to re-load the unloaded wood chips back onto the truck. He said that the wood chips were too large and Biofuel would not accept delivery of wood chips from V8. The truck driver did as he was told and brought the wood chips back and reported the situation to Ah Tee. Ah Tee telephoned George Lee to honour the BSA but the latter said Biofuel would not accept wood chips from V8 as their wood chips were too large. Ah Tee then reported the matter to Derrick Yu. However, Derrick Yu did not attempt to call Eugene Lee to complain to him. His explanation was that he saw no point in doing so as Eugene Lee had not been helpful. Hence from then on, V8 stopped delivering wood chips to Biofuel and delivered waste wood instead. Accordingly, V8 was charged at the higher rate for waste wood as stipulated in the BSA. 61George Lee’s evidence was to deny that he had told V8’s truck driver to reload the wood chips back onto the truck or to take back an entire truckload of wood chips. He also denied telling Ah Tee that Biofuel would not accept any more wood chips from V8 as they were too large. 62According to Er Kee Sing (Derrick Yu’s father), he saw Eugene Lee standing at the main gate of Biofuel’s premises in March 2015.9Foot Note 9×NE 10/3/17 p 113According to paras 160 to 165 of Derrick Yu’s AEIC, which Mr Er adopted, Mr Er informed Eugene Lee that it was wrong of Biofuel to refuse to accept V8’s wood chips and he (Mr Er) asked Eugene Lee to honour the BSA. Eugene Lee said he would look into the matter but asked that V8 pay the outstanding invoices which had been issued for delivery of waste wood to Biofuel and which remained unpaid from December 2014. Mr Er said he would pay $30,000 as a gesture of goodwill and hoped that Biofuel would honour the BSA. Mr Er implied that the payment was made but Eugene Lee did not get back to V8. 63Eugene Lee’s evidence was that Mr Er had not spoken to him about this but had asked him about the supply of timber as he (Mr Er) was rebuilding his house. But Mr Er denied this. He said that he had his own contractor and would not speak about personal matters to Eugene Lee during office hours. 64V8 eventually sent Biofuel an undated letter to terminate the BSA via email on 10 April 2015. The letter cited various breaches of agreement as set out above but did not mention the alleged incident of 12 December 2014. The termination was immediate. However, according to Eugene Lee’s undisputed evidence, deliveries of waste wood continued till 13 April 2015. 65In the light of the termination, Biofuel filed the present action for the reliefs already mentioned above at [5].",
        "The law on repudiation": "66InSan International Pte Ltd v Keppel Engineering Pte Ltd[1998] 3 SLR(R) 458 (“San International”), the Court of Appeal said at [20]: The law on repudiatory breach or renunciation can be summarised as follows: A renunciation of contract occurs when one party by words or conduct evinces an intention not to perform or expressly declares that he is or will be unable to perform his obligations in some material respect. Short of an express refusal or declarationthe test is to ascertain whether the action or actions of the party in default are such as to lead a reasonable person to conclude that he no longer intends to be bound by its provisions.The party in default may intend in fact to fulfil the contract but may be determined to do so only in a manner substantially inconsistent with his obligations, or may refuse to perform the contract unless the other party complies with certain conditions not required by its terms:Chitty onContractsvol 1 at para 24-016. [emphasis in original] 67The substance of the above passage has been cited with approval in subsequent cases, for example,in Alliance Concrete Singapore Pte Ltd v SatoKogyo (S) Pte Ltd[2014] 3 SLR 857 (“Alliance Concrete”) at [59] and inNgChee Weng v LimJit Ming Bryanand another and another appeal[2015] 3 SLR 92 at [66]. 68I note that inAlliance Concrete, the Court of Appeal described, at [58], four situations which entitle an innocent party to elect to treat a contract as discharged as a result of the other party’s breach. Situation 2, as described there, occurs where the party in breach of contract renounces the contract. This renunciation is also referred to as repudiation as stated inSan International. Situation 3(b), as described inAlliance Concrete, occurs where the breach of a term of the contract deprives the innocent party of substantially the whole benefit of the contract which it was intended to obtain. This situation 3(b) is not the same as Situation 2. I mention this because para 66 of V8’s closing submission referred to a situation which is actually Situation 3(b). However, V8’s pleaded defence at paras 32 and 33 relied on repudiation,ie, Situation 2 and not Situation 3(b). Hence, I will confine my consideration to Situation 2 only. 69It is not in dispute that the test is an objective one,ie, whether the conduct of Biofuel was such as to lead a reasonable person to conclude that Biofuel no longer intends to be bound by the BSA. 70Thus, it is not every breach, even if repeated, which will amount to a repudiation (see [25] ofSan International).",
        "The court’s reasons and conclusion": "71Although Biofuel did not plead that V8 had affirmed or waived its rights when V8 continued to deliver biomass after each alleged breach, it was still for V8 to establish that the sum total of Biofuel’s conduct constituted a repudiation of the BSA. 72It is true that Biofuel did attempt to raise the price for disposal first of waste wood and then of wood chips. I have specified above its letters which sought to do this. 73Eugene Lee sought to explain the letters as being sent to every counterparty which Biofuel was dealing with regardless of whether the counterparty had a fixed price contract with Biofuel or not. In other words, the letters were not targeting V8 specifically. Secondly, he sought to explain that where there were invoices sent which incorporated a price increase, this was due to some standard protocol of his finance department which simply incorporated the increase into the invoice without distinguishing whether the customer had a fixed price contract with Biofuel or not. 74I find such explanations to be lame. If Mr Lee were a reasonable businessman, he would know the importance of a fixed price contract. It would not be difficult to give instructions and to ensure that any letter about a price increase would be sent only to those counterparties which did not have a fixed price contract. He must know that those with a fixed price contract would view dimly any attempt to increase the price during the duration of the fixed price contract. 75Furthermore, besides his bare allegation, there was no other evidence to show that it was standard protocol to incorporate the price increase into all the invoices, regardless of the existence of a fixed price contract. Indeed, the first few invoices after the first attempt to increase the price for waste wood did not incorporate the price increase. 76Thirdly, V8 had objected to any price increase and consequently Biofuel had to issue credit notes. Yet, Biofuel continued to issue new letters about price increases. 77I am of the view that Biofuel was deliberately attempting to increase prices in the hope that V8 would inadvertently pay. The attempts to increase the prices were contrary to the BSA. However, Biofuel did issue credit notes to negate any price increase which were included in invoices and, consequently, V8 did not in fact pay more. Furthermore, deliveries continued save for certain specific instances when Biofuel declined to accept deliveries. 78In the circumstances, I am of the view that the price increases did not constitute repudiatory conduct. 79I come now to the instances when Biofuel declined to accept delivery. In the first place, V8 submitted that Biofuel was under an obligation to receive all deliveries on demand. This was because V8’s business depended on a quick turnover of the biomass it collected from its own customers to the delivery of the same (whether with or without shredding) to Biofuel. Otherwise V8 would run out of storage at its own premises. 80V8’s pleading was based on express terms of the BSA relating to the appointment of Biofuel as V8’s exclusive Recycling Plant Facilitator and V8’s obligation to deliver a specific minimum quantity of biomass each month and the rates for delivery of waste wood (ie, timber or horticultural) and for wood chips. However, there was no express term in the BSA requiring Biofuel to receive every delivery from V8 on demand. Neither did V8’s defence plead any implied term which required delivery to be accepted on demand. 81Furthermore, just as V8 was concerned about its own storage space, Biofuel was equally justified in taking into account its own storage space. 82In the circumstances, I reject V8’s submission that Biofuel was under a legal obligation to receive all deliveries of biomass on demand although common commercial sense would dictate that Biofuel cannot refuse any delivery unless with good reason such as the lack of storage space in its own premises and, even then, it was arguable how long it could decline to accept delivery for. 83On the other hand, Biofuel did not even plead that it could decline to accept delivery from V8 if it had a valid reason to do so or that lack of storage space was a good reason. It will be recalled that Biofuel’s Reply was that it had not rejected any delivery of biomass from V8. Such was the manner in which Biofuel conducted its case which in turn damaged its credibility. 84In the absence of a Reply that Biofuel had a valid reason to reject, it was not open to Biofuel to attempt at trial to establish that it had a valid reason to reject at each time of the alleged specific instances. 85I agree that V8 has established that from time to time, Biofuel did reject deliveries of biomass from V8 on the dates mentioned by V8 in its letter of termination (but bearing in mind that the purported rejection on 12 December 2014 was not mentioned in the letter, although this date was later mentioned in its Defence). 86In the circumstances, even though there was no legal obligation on Biofuel to accept deliveries on demand, each rejection of delivery from V8, if made without a valid reason, would constitute a breach of the BSA. As it was not open to Biofuel to establish a valid reason, each rejection did constitute a breach of the BSA. 87If Biofuel were not precluded from asserting that it had a valid reason to reject, the burden of proof would still be on Biofuel to establish its valid reason once the instances of rejection were established. 88V8’s evidence, which was supported by the quantity of amounts of biomass delivered on the dates in question, did support its contention that Biofuel did reject deliveries on the dates mentioned in its letter of termination. At trial, these dates of rejection were not really contested. 89Since V8 did establish various dates of rejection, it was for Biofuel to establish that it had a valid reason to do so on each occasion. Biofuel’s alleged reasons for rejection were not all the same. According to the evidence for V8, the reason given for each occasion of rejection was a lack of space except for the date of 26 November 2014. On that date, the alleged reason was that the wood chips were oversized. At trial, Biofuel proceeded on the basis that a lack of space was a valid reason to reject.10Foot Note 10×NE 9/3/17 p 35As for the 26 November 2014 rejection, Biofuel’s case, through George Lee’s evidence, was that he did ask V8 to do something about the oversized chips but he did not say that Biofuel would no longer accept any delivery because of oversized wood chips. 90However, the fact that Biofuel initially took the position in correspondence and in its Reply that it did not reject any delivery reflected poorly on its credibility. I have also set out above as to how it sought to distinguish between instances when a lorry was in fact turned back and instances when advance notice was given and how it sought to suggest that Eugene Lee was personally unaware of such instances and how V8 had allegedly failed to adduce evidence that it did in fact have biomass to deliver. These points also reflected poorly on its credibility. 91Furthermore, there was one occasion where Derrick Yu took a photograph of two heaps of wood chips at Biofuel’s premises which showed a larger and a smaller mound (see [54]). This suggested that contrary to Biofuel’s assertion about lack of space, there was still some space to receive more wood chips. Also, Derrick Yu’s email dated 18 June 2014 to Eugene Lee to complain that Biofuel had said that V8 could not reload waste wood did not meet with a reply (see [45]). Such evidence supported V8’s contention that Biofuel’s belated allegation about a lack of space was untrue. 92As for the telephone discussions between Ah Lee and Ah Tee and between Eugene Lee and Derrick Yu, which Derrick Yu recorded, the discussions did not shed much light as to whether the alleged lack of space was true or not. 93As for the rejection on 26 November 2014, V8’s letter of termination said that the alleged reason given by Biofuel was that the wood chips were more than 100mm in length. The rejection and the reason were not disputed in the reply letter dated 17 April 2015 sent by Robert Wang & Woo LLP, the then solicitors for Biofuel. Instead, that reply stated that, “wood chips that are above 100mm in length are too large to be accepted as ‘shredded’ wood chips… The said wood chips have to be treated as Timber Biomass and charged as such which you unreasonably refused”. 94As I have concluded that the 100mm requirement was not a term of the BSA, it follows that it was not a valid reason for Biofuel to reject delivery that day. Furthermore, even if that requirement were a term of the BSA, it was not open to Biofuel to reject any truckload of wood chips just because there would be some wood chips therein which would not meet the requirement. There was no evidence from Biofuel as to the quantity of oversized chips in each truckload that day. 95The burden of proof would have been on Biofuel to establish a valid reason for each rejection. I find that it has not discharged its burden. Consequently, I find that its rejection on various dates was part of its strategy to put pressure on V8 to accept a price increase for delivery of waste wood and later for wood chips. 96Nevertheless it will be recalled that on some occasions, Biofuel accepted delivery after the date of rejection. 97For the rejection on 17 April 2014, deliveries resumed on 22 April 2014. However, 17 April 2014 was a Thursday followed by a Good Friday public holiday and Easter Sunday. 98For the rejection on 8 May 2014, deliveries resumed on 9 May 2014. 99For the rejection on 18 June 2014, deliveries resumed on 19 June 2014. 100For the rejection on 28 June 2014, this was a Saturday. The next day was a Sunday. Deliveries resumed on 5 July 2014. I refer to the recording of the conversation between Ah Lee and Ah Tee which was supposed to have taken place on 28 June 2014. I have referred to this conversation at [47] above. It did not add much beyond the fact that Biofuel was not taking further deliveries of waste wood from V8 that day,ie, 28 June 2014. 101In cross-examination, Derrick Yu suggested that V8 had been calling Biofuel daily to confirm that V8 would make delivery on subsequent days but did not receive a favourable response, presumably until 5 July 2014. 102In closing submissions, Biofuel submitted that in the light of many deliveries of wood chips by V8 from 28 June to 4 July 2014, V8 had instead shredded waste wood into wood chips during this period and hence, V8 did not have any evidence that it had waste wood to deliver during this period in any event. I have already mentioned that questions as to whether V8 had evidence that it had waste wood to deliver came as a surprise. Furthermore, Biofuel did not suggest during the trial that the reason for non-delivery of waste wood was that V8 had shredded waste wood into wood chips during this period. This suggestion was made only in Biofuel’s closing submissions. 103The evidence from each side as to the reason for V8’s non-delivery of waste wood for the period from 28 June to 4 July 2014 was unclear and I am not able to conclude that it was solely because of rejection by Biofuel. 104For the rejection of delivery of wood chips on 31 October 2014, delivery resumed on 1 November 2014. 105For the rejection of delivery of wood chips on 26 November 2014, delivery resumed on 2 December 2014. 106Delivery of wood chips continued until 12 December 2014. As mentioned above, V8 alleged that on that day, its truck driver was told to reload wood chips already unloaded and take them back to V8. Thereafter, V8 stopped delivery of wood chips because, allegedly, Biofuel had refused to take delivery. V8 further alleged that George Lee told Ah Tee over a telephone conversation that Biofuel would not accept future deliveries from V8 because of their oversized wood chips. 107Biofuel disputed the incident on 12 December 2014,ie, that it had told V8’s truck driver to reload the unloaded wood chips and also that it said it would not accept future deliveries of wood chips because of oversized wood chips. However, it was not disputed that the amount of wood chips delivered on that day was less than on other days. 108If the allegation about that incident were true, it would have been the first time that V8’s truck driver was told to reload wood chips already unloaded back onto his truck and take them back to V8. Also, if this incident had truly caused V8 to stop delivery of wood chips thereafter, then it would have been the proverbial straw which broke the camel’s back. It would have been very much in the mind of V8 especially since V8 said that that was the reason why it then henceforth delivered only waste wood until the letter of termination (and even thereafter). 109However, the alleged incident on 12 December 2014 was not mentioned at all in V8’s letter of termination sent on 10 April 2015 even though all the other dates of rejection were carefully set out in that letter. V8 submitted that the omission was inadvertent. It also submitted that para 9 of the letter of termination stated that, “We reserve the right to add to this list if necessary”. In my view, this did not explain why such a significant event was omitted in the first place. 110According to Derrick Yu, V8 had already obtained legal advice before 10 April 2015 and the letter of termination was drafted by its solicitors. He did not volunteer any evidence to explain why the alleged incident was omitted from the letter. Although the alleged incident was subsequently mentioned in V8’s initial pleading of 16 June 2015, some two months later, this still did not address the question as to why it was omitted from the letter of termination in the first place. 111Furthermore, if V8 truly believed that Biofuel would reject all future deliveries of wood chips so long as some of the wood chips exceeded the 100mm requirement, it was strange that there was no oral or written complaint by V8 to Biofuel. Derrick Yu’s evidence for this omission was that he saw no purpose in contacting Eugene Lee in the light of his unhelpful response to previous complaints. However, this alleged incident on 12 December 2014, if true, was even more serious. Unlike the other incidents, V8 was not going to resume deliveries of wood chips thereafter. V8 did not protest or warn Biofuel about its alleged breach. It was not as though V8 was ignorant of its rights. I reiterate that in the past, Derrick Yu had sent an email to complain about non-acceptance of waste wood, he had recorded two telephone conversations and he had taken a photograph at Biofuel’s premises (see [45], [47], [49] and [54] above). 112Neither did V8 put Biofuel on notice that even though it would henceforth have no choice but to deliver waste wood, it would not be liable for the higher fee for waste wood, which was the stance it took later after the letter of termination was sent. In the meantime, Biofuel was issuing invoices to V8 at the price for waste wood delivered and V8 did not specifically object then. It simply declined to pay. 113As mentioned at [62] above, Er Kee Sing said that he did see Eugene Lee at Biofuel’s premises in March 2015 to say that Biofuel’s refusal to accept wood chips from V8 was wrong and contrary to the BSA. As Eugene Lee asked for payment of outstanding invoices, Mr Er said that he would make a partial payment of $30,000 and hoped this would encourage Biofuel to honour its obligations under the BSA. However, Eugene Lee never got back to V8 thereafter. 114Unfortunately for V8, there were aspects of its evidence about this visit which were inconsistent or illogical. 115First, Derrick Yu’s AEIC said at para 160 that he had been informed by Er Kee Sing that the visit to Eugene Lee was in response to telephone requests by Biofuel for payment of outstanding invoices. Given the gravity of the situation from V8’s point of view, if V8 were to be believed that it had stopped delivery of wood chips because of Biofuel’s conduct, it was surprising that Mr Er would wait till Biofuel chased for payment (for accepting past deliveries of waste wood) before deciding to speak to Eugene Lee about taking delivery of wood chips. As I have alluded to above, V8 would already have made a complaint to Eugene Lee immediately on or after 12 December 2014. 116Secondly, according to Mr Er’s oral testimony, he saw Eugene Lee standing at the main gate of Biofuel’s premises and hence Mr Er spoke to him (see [62] above). This indicated that the visit was not planned in advance as was suggested in Derrick Yu’s AEIC when he said that Mr Er had the meeting in view of Biofuel’s chasers for payment. 117Thirdly, according to Derrick Yu, Mr Er did update him about the discussion between Mr Er and Eugene Lee. If so, this too would have been an important event and it would have been unlikely that Mr Er or Derrick Yu would have made a mistake about it. Yet Derrick Yu said that there had been a miscommunication between Mr Er and him about this meeting. Derrick Yu had said in an earlier affidavit of 28 August 2015 that he had been informed by Mr Er that the discussion with Eugene Lee was by way of a phone call. However, this was the result of a miscommunication. Hence, Derrick Yu corrected his earlier position and said in his AEIC that the discussion between Mr Er and Eugene Lee was in person. No elaboration was given as to how the miscommunication came about. 118Fourthly, although V8 implied that pursuant to the discussion it did make payment of $30,000 as a gesture of goodwill towards the outstanding invoices, there was no evidence of payment of this specific sum. There was evidence that some payment was made for outstanding invoices for deliveries of waste wood after 12 December 2014 to 31 December 2014 but these invoices amounted to $41,000.11Foot Note 11×NE 9/3/17 p 191V8 did not adduce evidence to establish that $30,000 was the sum in fact paid after the alleged March 2015 meeting. 119Fifthly, it was illogical for V8 to remain silent if in fact the $30,000 was paid after that meeting. One would have expected V8 to protest and say that its gesture was left unreciprocated and to urge Biofuel to accept deliveries of wood chips. This was not done. 120The burden of proof is on V8 to establish its allegations. In the circumstances, I find that it has not established that on 12 December 2014 its truck driver was told to reload wood chips back onto the truck or that Biofuel said it would not accept deliveries of wood chips thereafter. V8 has also not established that there was a meeting and discussion in March 2015 in which Mr Er had asked Eugene Lee to allow V8 to deliver wood chips to Biofuel. 121There is one other point. It appears that V8 did acquire another shredder in 2015. According to Derrick Yu, this was a secondary shredder and he placed the order for this shredder through a third party in October 2014. It was delivered in March 2015. The initial shredder it had acquired in May 2011 was the primary one. He said that V8 would use the secondary shredder to produce wood chips below 100mm in length after the initial shredding by the primary shredder.12Foot Note 12×NE 10/3/17 pp 47–48Derrick Yu said he placed the order in October 2014 because Biofuel had sent its letter (dated 14 October 2014) stating the 100mm requirement. So he decided to acquire the secondary shredder rather than do nothing.13Foot Note 13×NE 10/3/17 pg 49Yet, strangely, Derrick Yu did not inform Eugene Lee that V8 had placed an order to acquire this shredder and that there should be no more issue about the wood chips exceeding 100mm in length. His evidence for not doing so was rather curious. He said that Eugene Lee had in any event learned about the acquisition and that V8 was not obliged to meet the 100m requirement.14Foot Note 14×NE 10/3/17 pp 56–58I find this evidence illogical. Since he said he had ordered this shredder so as to ensure that the wood chips met the 100mm requirement imposed by Biofuel, it was strange that he was not telling Biofuel about his plans. Furthermore, according to Derrick Yu, that shredder was operational in April 2015 after it was delivered to V8  in March 2015.15Foot Note 15×NE 10/3/17 p 64Yet, V8 proceeded to terminate the BSA in April 2015 instead of telling Biofuel that the secondary shredder had arrived and there should be no more issue about oversized wood chips. 122It seems to me that V8 had its own reasons for acquiring the secondary shredder. 123Furthermore, it transpired that V8 had been looking for other parties to whom it could deliver its wood chips. According to Derrick Yu, after the alleged incident on 12 December 2014, he was looking around for any such party. He found such a party which he referred to as CGN. Interestingly, his arrangement with CGN was that CGN would pay V8 for the wood chips instead of V8 paying CGN to dispose of wood chips. This was of course a much better deal for V8. When Derrick Yu was asked when he found CGN, his initial response on 9 March 2017 was that he could not remember. For example, he could not remember whether it was in January 2015 or in February 2015.16Foot Note 16×NE 9/3/17 p 184The next day of his evidence on 10 March 2017, he said that discussions with CGN were in February 2015 but he supplied wood chips to CGN from April to September 2015. CGN operated a power plant and when it stopped its operations during April to September 2015 for maintenance, V8 had to dispose of its wood chips to another party referred to as LHT and pay them for the disposal. V8 was also supplying wood chips to Tuas Power but it was not clear whether V8 was paying Tuas Power or receiving payment from Tuas Power for the wood chips. 124The above evidence raised the question as to whether V8 had terminated the BSA because it truly considered Biofuel’s conduct to be repudiatory in nature or because it had found a better deal. In the absence of more evidence, I am not able to conclude that it was the latter. Nevertheless, the burden of proof is on V8 to establish that Biofuel’s conduct was repudiatory. 125While there were photographs, in one instance, of waste wood piling up at V8’s premises and a complaint by email about rejection of waste wood and oral discussions about the same between Ah Lee and Ah Tee and between Derrick Yu and Eugene Lee, V8 did not adduce any other evidence about the consequences to it. Indeed the substance of the oral discussions was quite muted. Deliveries of waste wood continued. Deliveries of wood chips also met some obstacles as set out above but also continued until 12 December 2014. 126Besides the instances of rejection, I take into account Biofuel’s attempts to raise prices for waste wood and then for wood chips and then imposing the 100mm requirement. On the last point, the letters imposing the 100mm requirement stated only that oversized wood chips would be rejected or be charged at a higher rate than rates applicable for wood chips. They did not say that the entire truckload of wood chips would be rejected even if only part of the wood chips exceeded the 100mm requirement. While that in itself was wrongful conduct on the part of Biofuel, the question was whether, taking into account Biofuel’s overall conduct, there was repudiation by Biofuel. 127I am of the view that V8 has not established that a reasonable person would consider Biofuel’s overall conduct as amounting to a repudiation of the BSA. While Biofuel should be chastised for its attempts to raise prices in a fixed price contract and to introduce the 100mm requirement as well as the occasions of rejection without a valid reason, its conduct still did not amount to repudiation. It seems that V8 itself did not think that Biofuel’s conduct amounted to repudiation and hence it was prepared to tolerate the situation until in 2015 when it purported to terminate the BSA. In the circumstances, I find that V8 was not entitled to terminate the BSA on 10 April 2015.",
        "Reliefs claimed by Biofuel": "",
        "Payment of the Unpaid Invoices": "128In view of my finding that V8 has failed to establish the 12 December 2014 incident, I also find that V8 chose not to deliver wood chips to Biofuel thereafter. It may be that it chose not to do so because it was having its own problems with its (primary) shredder aside from the 100mm requirement or because it was receiving payment for wood chips from a third party or some other reason unconnected with the alleged incident. Whatever the reason, it was not because of the alleged incident. In the circumstances, V8 is not entitled to use the alleged incident to avoid its liability to pay for waste wood delivery. Therefore V8 is liable to pay $186,326.92 for the Unpaid Invoices.",
        "Damages for breach of the BSA": "129As mentioned above at [5], Biofuel’s claim for damages for breach of the BSA was for (a) shortfall in deliveries and (b) loss of profit in respect of the SCG contract. 130For the month of February 2015, the shortfall was 285.56mt. For the month of April 2015, the shortfall was 1,315.57mt. 131V8 submitted that it should not be liable for the shortfall in February 2015 because of the Chinese New Year period in that month. The evidence showed that there was no delivery between the period of 17 to 23 February 2015. V8 suggested that the non-delivery was because Biofuel itself had stopped collections during the period due to the Chinese New Year holiday break for that period (even though the public holidays would be at most for two days). Biofuel agreed that there was the Chinese New Year holiday break.17Foot Note 17×NE 7/3/17 p 181V8 therefore submitted that it was not reasonable for it to be liable to meet the target of 2,000mt for February 2015. While this submission appeared attractive at first blush, I note that the BSA does not distinguish between different months of the year. V8 must have been aware of the Chinese New Year holiday break each year. Furthermore, V8 did not say that in the previous year it was allowed to deliver less than the minimum because of the Chinese New Year holiday break or that it was allowed to make up the shortfall in the next month. 132In the circumstances, I am of the view that V8 is not entitled to use the Chinese New Year holiday break to avoid the minimum target. 133I therefore conclude that V8 is liable for the shortfall of 285.56mt for that month. As for the shortfall in April 2015, V8 was relying on its termination of the BSA to absolve it from its obligation to deliver 2,000mt per month. Since its termination was wrongful, it will still be liable to meet that obligation. As mentioned above, the shortfall for April 2015 was 1,315.57mt. 134The next issue is whether V8 should be liable for shortfall based on delivery of waste wood or wood chips as the rates payable to Biofuel were different. 135V8 argued that it was a general principle of law that damages would be assessed on the assumption that a defendant would have performed the contract in the manner most beneficial to itself and not to the plaintiff. However, that is only an assumption. In the case before me, the evidence was that V8 was delivering only waste wood in February 2015. Therefore I am of the view that V8 isprima facieliable on the premise that it ought to have delivered another 285.56mt of waste wood for which the price was $30pmt. 136As for the April 2015 shortfall, I am of the same view that since V8 was delivering only waste wood to Biofuel in April 2015 before the letter of termination was sent and even thereafter up to 13 April 2015, it is reasonable to infer that it would have continued to deliver only waste wood for the rest of April 2015 if the letter of termination had not been sent. This inference is reinforced by the fact that V8 was, on its own evidence, delivering wood chips to others which in turn suggests that it preferred to do so rather than to deliver wood chips to Biofuel. 137Therefore, for the April 2015 shortfall, V8 isprima facieliable on the premise that it ought to have delivered another 1,315.57mt of waste wood for which the price was $30pmt. 138Likewise, for the remainder of the duration of the BSA,ie, from 1 May 2015 to 31 July 2018. This works out to 2,000mt x 39 months = 78,000mt of waste wood for which the price was $30pmt. 139However, V8 also submitted that the price of $30pmt was not the damages that Biofuel was entitled to claim as that was only the contract price. Biofuel ought to deduct its costs as it was entitled to claim only the profit it would have derived and not the revenue. As Biofuel did not adduce any evidence on its costs, V8 submitted that at least the following costs should be taken into account:18Foot Note 18×V8’s Closing Submissions, para 438. (a) Cost of operating Biofuel’s shredder to shred waste wood delivered by V8 including labour costs. (b) Utility costs at Biofuel’s premises. (c) Cost of loading wood chips onto a truck, after the shredding, and transporting it from Biofuel’s premises to a barge and unloading it onto the barge. 140I infer that some of such costs may be fixed costs in any event. The problem, as mentioned above, was that Biofuel did not adduce evidence on the quantum of costs that it would have incurred in respect of the waste wood delivered by V8. I also note that V8 was obliged to pay Biofuel $30pmt for delivering waste wood and $13.50pmt for delivering wood chips. This suggests that it was Biofuel which preferred to receive wood chips than waste wood and hence the lower price to encourage V8 to deliver wood chips instead of waste wood. However, it was still unclear how much costs Biofuel would incur in respect of the waste wood. Accordingly, V8 suggested that Biofuel should be entitled to nominal damages only. 141Although the burden of proof is on Biofuel to prove the quantum of its damages, it seems to be unjust to award Biofuel nominal damages only because it omitted to include its costs in respect of the waste wood. 142One alternative is to take into account the lower rate of $13.50pmt for delivery of wood chips and apply it as the profit (without further deduction for costs) which Biofuel would have earned from the delivery of waste wood. I think this is a more just solution and accordingly, I award Biofuel damages for the shortfall in February 2015, April 2015 and the remainder of the duration of the BSA as follows: (a)285.56mt x $13.50$       3,855.06(b)1,315.57mt x $13.50$     17,760.20(c)78,000.00mt x $13.50$1,053,000.00Total:$1,074,615.26",
        "Loss of profit in respect of Biofuel’s onward sale to SCG": "143The last head of damages claimed by Biofuel is the loss of profit on the SCG contract with its Thai customer. Under the SCG contract, SCG was to pay Biofuel $10pmt of wood chips. For this head of damages, Biofuel restricted its claim to $10pmt x 2,000mt x 39 months (ie, the period from 1 May 2015 to 31 July 2018) = $780,000. In other words, Biofuel did not claim for loss of profit on the SCG contract for the short deliveries in February and April 2015. 144Biofuel submitted that there was no cost to be deducted as the wood chips are finished products and freight and insurance was to be borne by SCG. There would have been incidental costs such as the excavator driver’s salary but Biofuel was not claiming for such costs. If it were, its claim would be more than $10pmt. 145V8 submitted that under the SCG contract, Biofuel was responsible for marine insurance. Also, there would be other incidental costs and such costs should be deducted from the $10pmt figure to derive Biofuel’s net profit. It was incorrect for Biofuel to say that such costs should be disregarded on the premise that it would not have incurred such costs. In other words, one has to assume that Biofuel would have incurred such costs in order to claim $10pmt from SCG. I agree. 146In any event, there were other significant difficulties about this claim. 147First, the SCG contract was to end on 31 December 2016 whereas the BSA would end on 31 July 2018. There was no evidence that the SCG contract would continue after 31 December 2016. Although Biofuel said it had other customers too, no evidence was given about the details of contracts with such other customers. Accordingly, I agree that Biofuel would not be entitled to claims beyond 31 December 2016 in any event. 148Secondly, it will be recalled that the SCG contract required 90% of the wood chips supplied by Biofuel to be less than 50mm in length. This was not the 100mm requirement which Biofuel sought to impose on V8. Furthermore, Biofuel said that it had met 60% to 70% of the quantity of wood chips required under the SCG contract from its own production of wood chips and the rest from others including V8 (see [24]). It was therefore incorrect, if not dishonest, of Biofuel to try and claim the price for the quantity it was to deliver to SCG entirely from V8. In the absence of more and better evidence as to how much of V8’s wood chips would have in fact been delivered to SCG, I will not allow this head of claim for this reason alone. 149In the circumstances, it is unnecessary for me to conclude whether V8 knew about the SCG contract and if so, when it acquired that knowledge. 150Therefore, I dismiss Biofuel’s claim for loss of profit arising from the SCG contract. 151In the circumstances, I grant judgment for V8 to pay Biofuel the following: (a)$   186,326.92For the Unpaid Invoices(b)$1,074,615.26For damages for shortfall in delivery 152Biofuel’s claim for contractual interest was poorly put together. In the prayers for relief as set out in the Statement of Claim (Amendment No 3), it claimed interest on the amount outstanding on the Unpaid Invoices at the rate of 1.5% per month as set out in the BSA pursuant to para 9 of the same pleading. However, para 9 merely states the total amount outstanding on the Unpaid Invoices. It does not state the contractual provision which allows Biofuel to claim that rate of interest. It was for Biofuel to state the contractual basis for interest in the main body of its pleading and not just mention the BSA in one of the prayers for relief. 153Furthermore, in Biofuel’s closing submissions and closing reply, no mention was made of the contractual basis for interest. The closing submissions of V8 also did not address the question of contractual interest perhaps because the point was not raised specifically in Biofuel’s closing submissions in the first place. 154In the circumstances, I am of the view that Biofuel is not entitled to any contractual interest for the unpaid invoices and it would not be just to grant it. Instead, I will grant it non-contractual interest as specified below together with the rest of its successful heads of claim. 155V8 is to pay interest on the sums stated at [151] above at the rate of 5.33% per annum from the date of the Writ of Summons to the date of this judgment, both dates inclusive.  156I will hear the parties on costs. Woo Bih LiJudge  G Radakrishnan (instructed) and Ramachandran Shiever Subramanium (Grays LLC) for the plaintiff;Kok Chee Yeong Jared and Jared Ravin Dass (Rajah & Tann Singapore LLP) for the defendant."
    }
}