{
    "case_title": "Major Insulation & Links (MIL) Marketing Pte LtdvNichias Singapore Pte Ltd",
    "ncitation": "[2017] SGHC 23",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Background": "2 The dispute in this suit arose in the course of the defendant acting as subcontractor of Mitsubishi Heavy Industries Ltd for insulation and scaffolding works at the ExxonMobil Singapore plant. The defendant appointed the plaintiff as its local subcontractor for the installation of insulation and issued a work order for this purpose (“the Contract”).  On 1 December 2010, the plaintiff issued a statement of account in relation to the Contract, listing 12 invoices issued between 15 September and 29 November 2010 totalling $624,618.71.  After setting off two sums due from the plaintiff to the defendant amounting to $7,500 and $101,292.09, the plaintiff claimed that the defendant was obliged to pay the plaintiff the balance sum of $515,826.62.  The defendant admitted to some of the invoices, totalling $64,500.03. However the balance of $560,118.68 was disputed by the defendant.  On 1 November 2012, I dismissed the plaintiff’s claim for the $560,118.68.  However I gave judgment for the plaintiff for the sum of $64,500.03 that was admitted by the defendant. 3 The defendant filed a counterclaim for the following: (a) The sum of $101,292.09 for the supply of insulation materials and other items. (b) The sum of $53,693.54 for the cost of site staff deployed by the defendant at the plaintiff’s request to undertake Quality Assurance and Quality Control functions, as set out in the defendant’s invoice dated 1 November 2010. (c) Damages in the sum of $108,000 for failure to provide the items in cll 1.2, 1.3 and 1.4 of the Contract. (d) Damages in the sum of $559,038.56, or such damages as the Court may assess, for the plaintiff’s repudiation of the Contract. (e) The sum of $237,099.54, or such other sum as the Court may assess, being the difference between the total interim payments for the Contract and the value of the works done by the plaintiff pursuant to the Contract up to the date the plaintiff left the site. (f) Interest. 4 The plaintiff admitted the debt in respect of counterclaim (a) and therefore the defendant was granted judgment in the sum of $101,292.09. In respect of counterclaim (b), I found that the plaintiff was liable for the amount of $7,500.  I found insufficient evidence for counterclaim (c) and dismissed it.  As for counterclaims (d) and (e), I found the plaintiff liable to the defendant for damages to be assessed in accordance with the following formula: Damages = A - (B - C) Where: A = the amount incurred by the defendant in engaging another contractor, Meisei International Pte Ltd (“Meisei”), to complete the works that the plaintiff was supposed to have carried out under the Contract; B = the amount payable by the defendant to the plaintiff under the Contract had the works thereunder been completed by the plaintiff; and C =  the total interim payments made by the defendant to the plaintiff under the Contract. 5 I also ordered interest to be paid by the plaintiff to the defendant on the net judgment sum at the rate of 5.33%.",
        "Assessment of damages": "6 In the interest of expediency and savings of costs, I ordered the assessment of damages to be heard before me. 7 At the outset, parties agreed that the value of item A was $1,311,163.19 and that of item C was $818,433.67.  The only issue in contention was the value of item B, which is the amount that the defendant would have to pay the plaintiff had the latter completed all the works under the Contract.  This exercise would entail a measurement of all the insulation installation that had been carried out at the ExxonMobil Singapore plant by the plaintiff and by Meisei, who completed the work left unfinished by the plaintiff. 8 There was a large number of pre-trial conferences at which the court gave directions on the manner in which the assessment would be conducted. This was in view of a number of technical issues relating to method of measurement, and the large number of documents that had to be processed to derive the measurements necessary to compute the total quantities. 9 On 31 October 2016 after hearing submissions of counsel on the evidence, I determined the value of item B to be $1,106,000.  I accordingly assessed the damages at $1,023,596.  After hearing submissions from counsel on the question of interest, I ordered the plaintiff to pay interest on the net judgment sum at the rate of 5.33% from the date of the decision on liability, i.e. 1 November 2012.",
        "Grounds for assessment": "10 On 25 November 2016 the plaintiff filed a notice of appeal against my assessment and the defendant followed suit on 29 November 2016. I now give the grounds for my assessment. 11 Under the Contract, the plaintiff was paid on the basis of the volume of insulation that it installed. There were two categories of insulation work, namely (a) pipes; and (b) equipment.  The assessment was therefore on the basis of the volume of insulation installed on the pipes and the equipment in the ExxonMobil Singapore plant in accordance with the method envisaged under the Contract. 12 Due to the large number of drawings (some 4,000 of them) and other documents involved, the parties were tasked to compare their computations and to arrive at agreed quantities where possible so that the court need only consider the areas that they could not agree on. To this end counsel and their experts very helpfully came up with a list of differences for my consideration. The base figure was the sum of$1,017,311.83(“Base Quantum”), which was a figure derived from the defendant’s position.  The assessment turned on whether various items that comprised the Base Quantum ought to be increased on the basis of the plaintiff’s arguments.",
        "(a) Pipes": "13 Although the pipes were of various diameters, the basic method of measurement is the same with the variable being the diameter of the pipe and thickness of the insulation surrounding the pipe.  I held that the most accurate method of measurement would be to compute the volume based on the radius measured from the centre of the pipe to the mid-point of the insulation (“R”). The circumference (“C”) derived from R would represent the length of the circle at the mid-point of the insulation. With “T” being the thickness of the insulation, the volume of insulation per metre of pipe would be C x T cubic metres (with C and T measured in metres).  The Base Quantum was computed on this basis. The plaintiff had submitted that C should be based on the radius being measured to the outer margin of the insulation.  However, this would overstate the volume. I was satisfied that mathematically, the mid-point was the most accurate mode of computation of the volume.  There was therefore no need to make any adjustment to the Base Quantum in respect of this point. 14 Another issue related to the insulation to flanges.  Not all flanges required insulation. The defendant had gone through the 4,000 drawings and submitted a figure based on its contention that only some flanges were insulated.  The plaintiff went through 537 of the 4,000 drawings and asserted that the defendant did not count 40 flanges that were actually insulated.  This meant that the quantum for those 537 drawings was short by $1,600.  The plaintiff submitted that because errors had been discovered in 537 drawings, the court should order the defendant to rework the remaining drawings.  I declined to do so as the defendant had already carried out the exercise and the error rate was rather low. To require the defendant to carry out another exercise over some 3,500 drawings would add disproportionately to the cost.  Further, this assessment had dragged on long enough due to the volume of drawings involved and the fact that the plaintiff had difficulty processing them.  The defendant had presented its evidence of damages and the ball was in the plaintiff’s court to rebut it.  If the plaintiff chose not to review the remaining 3,500 documents the defendant should not be made to redo its computations in a situation where the error rate is low.  I therefore chose the expediency of applying the error rate discovered by the plaintiff over the remaining 3,500-odd documents and found that the Base Quantum should be increased by$36,000. 15 A further issue related to notes in various drawings stating “insulation undefined” for various items in those drawings. From its review of 537 drawings, the plaintiff found that 140 of those drawings had such items.  For these items, the defendant took the position that there was no insulation installed and did not provide for it in the Base Quantum.  However, in eight of the 140 drawings, the defendant had claimed from MHI for insulation in respect of those items. Those claims amounted to $578.67.  I took the same view as the preceding paragraph that it was disproportionate to require the defendant to review the remaining drawings and that the onus was on the plaintiff to do so. I therefore carried out an extrapolation based on the sum of $578.67 over 537 drawings to the 4,000 drawings.  On this basis, the Base Quantum should be increased by$5,000. 16 There is a final item relating to a difference in piping length from which arises a sum of$4,126.91to be added to the Base Quantum. This was in fact a concession by the defendant to the plaintiff.  However, it would appear that I had not included this sum in the total computed.  This would be an error in the judgment, to the extent of this sum.",
        "(b) Equipment": "17 There were 81 pieces of equipment which required to be cladded with insulation.  There were three areas of contention: (a) whether the calculation ought to be based on the mid-point of insulation or the outer edge of the insulation; (b) whether insulation over flanges ought to be included; and (c) what rate ought to be applied to the volume of insulation installed. (i) Mid-point or outer edge 18 I held that the measurement ought to be based on the measurement to the mid-point of the insulation as opposed to the plaintiff’s position that it should be measured to the outer edge.  The reasoning is the same as for the pipes; this would give a more accurate computation of the accurate volume.  There was therefore no change to the Base Quantum on account of this issue. (ii) Flanges 19  The issue was whether the insulation to the flanges connecting the equipment to the pipes ought to be counted.  As such insulation was already counted under the “Pipes” category, I held that this should not be counted again under “Equipment”.  There was therefore no change to the Base Quantum on account of this issue. (iii) Rate 20 On the basis set out under (i) and (ii) above, the defendant computed the volume of insulation and submitted the amount payable for installation of this volume of insulation under “Equipment” would amount to $366,842.58.  The plaintiff could not dispute the accuracy of the computation of volume. However the plaintiff highlighted that in respect of 92.4m3 of insulation, there was no agreed rate under the Contract, a point not disputed by the defendant.  I therefore assessed this on aquantummeruitbasis, obtained from the following evidence that was before me.  For insulation governed by contractual rates, the defendant paid the plaintiff $823/m3 of insulation installed whereas the defendant claimed from MHI at the rate of $1,384, a difference of $561/m3.  This margin would cover the cost to the defendant of the insulation material supplied and its profit margin.  In respect of the 92.4m3 of insulation for which there is no contractual rate between the plaintiff and defendant, the defendant claimed from MHI at the rate of $1,937.19.  Applying the same margin of $561/m3, I arrived at the rate of $1,376.19 ($1,937.19 - $561).  I therefore increased the amount of $366,842.58 computed by the defendant by$47,449.25.",
        "Conclusion": "21 At the end of the assessment hearing, I determined the quantum for B in the following manner: B = $1,017,311.83 + $36,000 + $5,000 + $47,449.25 = $1,105,761.08, which I rounded off to $1,106,000. 22 However, as I have stated in [16] above, I had omitted to include the sum of $4,126.91.  Therefore the value of B ought to have been computed as follows: B = $1,017,311.83 + $36,000 + $5,000 + $47,449.25 + $4,126.91 =$1,109,887.99 23 With this finding of the value of B, the damages payable under the counterclaim ought to be: $1,311,163.19 – ($1,109,887.99 – $818,433.67) = $1,019,708.87 24 At the end of the assessment hearing, I had assessed the sum to be $1,023,596 which had not taken into account the $4,126.91 assessed under [16] above. That sum is therefore in error and the damages assessed in the counterclaim ought to be $1,019,708.87. Lee Seiu KinJudge Raymond Wong (Wong Thomas & Leong) for the plaintiff;Tan Teng Muan and Javad Namazie (Mallal & Namazie) for the defendant.."
    }
}