{
    "case_title": "Law Society of Singapore vUdeh Kumar s/o Sethuraju and another matter",
    "ncitation": "[2017] SGHC 141",
    "coram": "Sundaresh Menon CJ (delivering the grounds of decision of the court)",
    "sections": {
        "Introduction": "1 Originating Summonses No 5 of 2016 (“C3J/OS 5/2016”) and No 1 of 2017 (“C3J/OS 1/2017”) were applications brought by the Law Society of Singapore (“the Law Society”) pursuant to s 98(1) of the Legal Profession Act (Cap 161, 2009 Rev Ed) (“LPA”) for Mr Udeh Kumar s/o Sethuraju (“the Respondent”), an advocate and solicitor of the Supreme Court of Singapore, to show cause before a court of three judges as to why an appropriate sanction under s 83(1) of the LPA should not be imposed. 2 After hearing the parties, we found that due cause was made out arising from the charges against the Respondent that were before us and we ordered that he be struck off the roll of advocates and solicitors. We now give the detailed reasons for our decision.",
        "Background facts": "3 The Respondent was a senior practitioner, having been called as an advocate and solicitor about 29 years ago on 16 March 1988. He practised as a sole proprietor in the firm S. K. Kumar & Associates until 14 April 2011. Thereafter, he practised at S. K. Kumar Law Practice LLP. 4 Disciplinary proceedings were commenced against the Respondent as a result of separate complaints lodged against him by (a) the Attorney-General (“AG”) and (b) the Presiding Judge of the State Courts. The complaint by the AG was made pursuant to s 85(3)(b) of the LPA on 24 April 2015 and was supplemented with further information on 9 June 2015. Arising from this complaint, the Law Society preferred 14 charges against the Respondent. Of these, the disciplinary tribunal (“the Tribunal”) found that seven had been made out; and cause of sufficient gravity was found for disciplinary action to be pursued under s 83 of the LPA in respect of five of these charges, namely the 4th, 5th, 6th, 7th and 11th charges. While no cause of sufficient gravity was found in respect of the other two charges, the Respondent was ordered to pay a penalty of $15,000 and $10,000 respectively. The Tribunal dismissed the rest of the charges. The decision of the Tribunal is reported atThe Law Society of Singapore v Udeh Kumar s/o Sethuraju[2016] SGDT 6 (“Udeh Kumar (C3J/OS 5/2016)”).The five charges, for which cause of sufficient gravity was found, were the subject of C3J/OS 5/2016. 5 The other complaint by the Presiding Judge of the State Courts was made on 5 May 2015. It set out the conduct of the Respondent which had ostensibly resulted in “intolerable delay, disruption and inconvenience to the court, the prosecution and to his clients”. Based on this complaint, the Law Society pressed another 14 charges against the Respondent. The Tribunal found that cause of sufficient gravity was established for six of the charges against the Respondent, namely, the 1st, 2nd, 7th, 9th, 11th and 14th charges. It dismissed the remaining charges. The decision of the Tribunal is reported atThe Law Society of Singapore v Udeh Kumar s/o Sethuraju[2016] SGDT 12 (“Udeh Kumar (C3J/OS 1/2017)”).The six charges for which cause of sufficient gravity was established were the subject of C3J/OS 1/2017. 6 With the agreement of the parties, both Originating Summonses were fixed together for hearing before us. Consequently, we considered a total of 11 charges against the Respondent (five in C3J/OS 5/2016 and six in C3J/OS 1/2017). These charges can be divided into three broad categories: (a) First, a set of charges that concerned the alleged breach of Rule 55(b) of the Legal Profession (Professional Conduct) Rules (Cap 161, R 1, 2010 Rev Ed) (“PCR”) for failing to use his best endeavours to avoid unnecessary adjournments, expense and waste of the court’s time (“Group 1 Charges”). These were the subject of the 4th, 5th and 6th charges in C3J/OS 5/2016, as well as the 7th, 9th and 11th charges in C3J/OS 1/2017. (b) Second, a set of charges concerning the alleged breach of Rule 56 of the PCR in deceiving or misleading the court by making false and inaccurate statements (“Group 2 Charges”). These were the subject of the 7th and 11th charges in C3J/OS 5/2016. (c) Third, a set of charges relating to events that culminated in the Respondent advising his client to obtain a medical certificate under false pretences in a seeming attempt to excuse the client’s absence from court in circumstances that would amount to a subversion of the course of justice (“Group 3 Charges”). These were the subject of the 1st, 2nd and 14th charges in C3J/OS 1/2017.",
        "Preliminary issues": "7 Before turning to our decision in relation to each of the three groups of charges, we first make some observations on two preliminary issues that arose in the proceedings.",
        "Whether recusal was necessary": "8 In the course of the hearing before us, counsel for the Respondent, Mr N Sreenivasan SC (“Mr Sreenivasan”), made a passing reference to the fact that consideration had been given by the Respondent and his counsel to whether he should seek the recusal of Tay Yong Kwang JA from the bench hearing this matter on account of the fact that he had heard one of the matters which was the subject matter of one or more of the charges before us. Tay JA had granted an adjournment in that instance. Although Mr Sreenivasan made it clear that having considered the matter, the Respondent had decided not to seek the recusal, nonetheless, because the issue had been raised, we thought it appropriate to set out our views on the matter. As shall shortly become evident, it was so plainly baseless in the circumstances that we were surprised it was even mentioned. 9 We first observe that Tay JA did not lodge any complaint against the Respondent in that (or in any other) instance. He had instead ordered the Respondent to pay costs personally. Indeed, the Respondent relied on these very same facts to contend that the Respondent had already been punished for the conduct in question and that this therefore did not and could not warrant further punishment. We will deal with the merits of this particular contention in relation to the disciplinary proceedings later in this judgment; but having sought to call Tay JA’s disposal of the matter in questionin aid of his own case, we found it odd, if not inconsistent, that the Respondent could at the same time consider that this might afford him a basis to contend that Tay JA ought not to hear the matter before us. 10 Second, and even more compelling, was the fact that out of an abundance of caution, we had earlier directed the Registry to seek the views of the parties as to whether either of them had any objections to Tay JA being part of the panel hearing the matter. The Registry had done so by way of a letter sent to the parties on 10 November 2016. On the same day, both parties replied confirming that they had no objections to Tay JA hearing the matter. In all the circumstances, this was an alleged concern that was entirely without basis and as we have already observed, we were somewhat surprised that any reference was made to it at all.",
        "Whether minute sheets of hearings in the State Courts were admissible": "11 The second preliminary issue related to the admissibility of certain minute sheets of hearings in the State Courts which were recorded and signed by various district judges (“DJs”), and which were relied on by the Law Society in making its case in C3J/OS 1/2017. These minute sheets were annexed to the affidavit of evidence-in-chief (“AEIC”) of Mr Dean Yeo Sin Haw (“Mr Yeo”), Assistant Director (Operations Management) of the Criminal Justice Division in the State Courts, who was one of the Law Society’s witnesses. The Respondent objected to any reliance being placed on these minute sheets, arguing that they were inadmissible because they constituted hearsay evidence. The Respondent’s contention was that since the Law Society had not called the makers of these minute sheets (namely, the DJs in question) to be witnesses at the hearing, the Tribunal had erred in admitting these as evidence of the truth of their contents. 12 At the hearing before the Tribunal, Mr Sreenivasan made a submission of no case to answer at the close of the Law Society’s case on the basis that the minute sheets were inadmissible. The Tribunal dismissed this argument on the ground that it had the power to regulate its own proceedings and that the Respondent’s objection was a technicality without substance, since there was nothing to suggest that the minute sheets were not an accurate record of what had transpired at the hearings in question. The Tribunal thus admitted the minute sheets as part of Mr Yeo’s evidence. It also considered that once the Law Society’s case had been submitted in accordance with the statutory provisions which regulated the presentation of its case, as was done here, the Tribunal was obliged to deal with the case before it (at [16] and [18] of its decision inUdeh Kumar (C3J/OS 1/2017)). 13 We agreed with the Tribunal’s decision that the Respondent’s objections regarding the minute sheets should be dismissed, but reached this conclusion for different reasons. We begin by observing that pursuant to Rule 23 of the Legal Profession (Disciplinary Tribunal) Rules (Cap 161, R 2, 2010 Rev Ed), the Evidence Act (Cap 97, 1997 Rev Ed)isapplicable to proceedings before the Tribunal. Nonetheless, even though the minute sheets on their own, without the DJs in question being called as witnesses, would in a strict sense constitute hearsay evidence, we found that they fell within two exceptions to the hearsay rule. The first was under s 32(1)(b) of the Evidence Act, which rendered statements “made by a person in the ordinary course of a trade, business, profession or other occupation” relevant and thus admissible. In particular, the minute sheets fell within either s 32(1)(b)(i) (entries in books kept in the ordinary course of a profession or in the discharge of a professional duty) or s 32(1)(b)(iv) of the Evidence Act (documents constituting or forming part of the records of a profession that are recorded, owned or kept by a person, body or organisation carrying out that profession). 14 We note that if the exception under s 32(1)(b) had been relied on, then pursuant to s 32(4)(b) of the Evidence Act read with O 38 r 4(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed), the Law Society would technically have been required to serve a formal notice on the Respondent, no later than two weeks after the service of Mr Yeo’s AEIC, stating the grounds under s 32(1) of the Evidence Act that rendered the minute sheets admissible. In the present case, it did not appear that this was done. In such circumstances, s 32(3) of the Evidence Act vests the court with the discretion to exclude the minute sheets if it considers that their admission would be contrary to the interests of justice, for example if the failure to give notice deprived the opposing party of the opportunity to respond to significant evidence that would compromise his case: see Jeffrey Pinsler SC (“Prof Pinsler”),Evidence and the Litigation Process(LexisNexis, 5th Ed, 2015) (“Pinsleron Evidence”)at para 6-050. However, we found it difficult to see how the Law Society’s failure to give notice could conceivably cause prejudice or unfairness to the Respondent. The minute sheets were made available to him from the outset when the Tribunal Secretariat forwarded to him a copy of the complaint (with the annexed minute sheets) on 26 May 2016. Yet, no objections were taken until the hearing before the Tribunal on 22 September 2016. We thus exercised our discretion under O 2 of the Rules of Court, as we did inGimpex Ltd v Unity Holdings Business Ltdand others and another appeal[2015] 2 SLR 686 at [141], to cure the non-compliance with O 38 r 4 of the Rules of Court. 15 The second applicable exception to the hearsay rule in this context arose by way of s 37 read with s 76 of the Evidence Act. The minute sheets of the DJs constituted entries into a public record by public officers in the discharge of their official duties and were thus relevant and admissible (see s 37 of the Evidence Act). A “public officer” refers to all holders of offices of emolument in the service of the Government (see s 2 of the Interpretation Act (Cap 1, 2002 Rev Ed)), and includes DJs. Public documents include documents that are records of the acts of official tribunals and public officers (including judicial officers) of Singapore: s 76(a) of the Evidence Act. In light of these statutory definitions, the minute sheets of the DJs were clearly public documents and/or records. Indeed, Mr Sreenivasan himself conceded that this was the case at the hearing before the Tribunal. As stated inPinsler on Evidenceat para 6-064, the rationale for the admissibility of public documents is twofold. First, the official nature of the documents renders them generally reliable. Second, it would be impractical to expect public officers to remember details in such records, so as to be able to add to what is contained in the records themselves, a point that was also noted by the President of the Tribunal during the hearing. 16 On the basis of these two exceptions to the hearsay rule, we found that the minute sheets were relevant and admissible. The Tribunal did not err either in admitting them into evidence or in relying on them in reaching their decision. We accordingly turn to consider the substantive charges against the Respondent.",
        "Group 1 Charges: failing to use best endeavours to avoid unnecessary adjournments, expense and waste of the court’s time": "",
        "Legal principles": "31 The Group 2 Charges involved an alleged breach of Rule 56 of the PCR. These were the subject of the 7th and 11th charges in C3J/OS 5/2016. 32 Rule 56 of the PCR provides: Not to mislead or deceive Court 56.An advocate and solicitor shall not knowingly deceive or mislead the Court, any other advocate and solicitor, witness, Court officer, or other person or body involved in or associated with Court proceedings. 33 Deceiving or misleading the Court includes the passive concealment of material facts, the presentation of half-truths, and the active articulation of untruths and/or misrepresentation of facts:Public Trustee and another v By Products Traders Pte Ltdand others[2005] 3 SLR(R) 449 (“By Products”) at [30]. The fundamental nature of the obligation encapsulated in this rule is aptly summarised by Prof Pinsler inConduct of Proceedings – The Legal Profession (Professional Conduct) Rules, 1998(1998) SingJLS 409 (“PCR Comment”) at 410-411: [An advocate and solicitor’s]most basic obligationis not to deceive or mislead the court, any other advocate and solicitor, witness, court officer, or other person or body involved in or associated with court proceedings. This responsibility extends to every function including the presentation and interpretation of facts, drafting of pleadings and documents, legal argument and other submissions to, or communications with, the court. The duty not to intentionally mislead or deceive is only thebare minimumrequired of the advocate and solicitor. … [emphasis added] 34 One of the key issues raised at the hearing before the Tribunal was themens rearequired to establish a breach of Rule 56 of the PCR. At [68] of its decision inUdeh Kumar (C3J/OS 5/2016), the Tribunal adopted the test laid down inDerry v Peek(1889) 14 App Cas 337 (“Derry v Peek”), a seminal English case concerning an action in deceit based on a fraudulent misrepresentation. Lord Herschell (at 374) held that fraud is proved when it is shown that a false representation has been made (a) knowingly; (b) without belief in its truth; or (c) recklessly, without caring whether it is true or false. In his written submissions for the present proceedings, the Respondent argued that themens rearequired for a breach of Rule 56 of the PCR was subjective dishonesty; specifically, he contended on that basis that recklessness to the truth or falsehood of a statement (limb (c) ofDerry v Peek) was insufficient. 35 We disagreed with the Respondent. Instead, we concurred with the Tribunal in applying the test inDerry v Peekand including recklessness as one of the mental states on the basis of which a breach of Rule 56 of the PCR could be established. Indeed, this has been the approach of our own courts; thus, when commenting on the duty of an advocate and solicitor not to mislead the court inBachoo Mohan Singhv Public Prosecutorand another matter[2010] 4 SLR 137 (“Bachoo Mohan Singh”), V K Rajah JA said (at [114]) that an advocate or solicitor must “neither deceive nor knowingly orrecklesslymislead the court” [emphasis added]. 36 We also consider this to be correct as a matter of principle because the focus of the test inDerry v Peekis on theabsence of an honest beliefin the truth of what is being stated.Consequently, even making a statement recklessly(not caring whether it was true or false) would be subjectively dishonest: seePublic Prosecutor v Wang Ziyi Able[2008] 2 SLR(R) 61 (“Wang Ziyi Able”) at [77] and [82].The position is otherwise only where the relevant state of mind is notrecklessness but only carelessness in making a statement, which though false, washonestly believed to be true:Derry v Peekat 361, cited inWang Ziyi Ableat [80]. That was not the case before us.",
        "The charges": "57 The 1st charge in C3J/OS 1/2017 asserted that the Respondent failed to inform the client of a court mention on 16 December 2014 (“the 16 December Hearing”), in which the client was due to plead guilty. Being unaware of the mention, the client did not attend court on that day and this resulted in a warrant of arrest being issued against him. The Respondent’s conduct evidently constituted a breach of Rule 17 of the PCR, which provides: Keeping client informed 17.An advocate and solicitor shall keep the client reasonably informed of the progress of the client’s matter. 58 The 2nd charge in C3J/OS 1/2017 alleged that the Respondent failed to advise the client to surrender himself once the warrant of arrest (referred to in the 1st charge) had been issued against him. The act of the Respondent in the 2nd charge was alleged to be grossly improper conduct under s 83(2)(b) of the LPA. Section 83(2)(b) of the LPA states: Power to strike off roll, etc. 83.— … (2) Subject to subsection (7), such due cause may be shown by proof that an advocate and solicitor — … (b)has been guilty of fraudulent or grossly improper conduct in the discharge of his professional duty or guilty of such a breach of any usage or rule of conduct made by the Council under the provision of this Act as amounts to improper conduct or practice as an advocate and solicitor… 59 Finally, the 14th charge in C3J/OS 1/2017 stated that the Respondent advised the client to obtain a medical certificate under false pretences to excuse himself from the 16 December Hearing. This was said to be a breach of Rule 56 of the PCR (see [32] above), and was the most serious of this cluster of charges against the Respondent. 60 For convenience, the sequence of the undisputed events in relation to the Group 3 Charges may be summarised as follows: DateEvent16 December 2014Plead guilty court mention. The client was absent as the Respondent had not informed him of the hearing date. A warrant of arrest was issued against the client.16 December 2014 – 31 January 2015The client did not voluntarily surrender in response to the warrant of arrest.1 February 2015The client was arrested for another matter.2 February 2015The client was charged in court for the other matter. He informed the court that he wanted the Respondent to act for him in this matter as well. The matter was adjourned for two weeks.16 February 2015Further mention in relation to the other matter. The client attended by video link. He applied for bail in relation to this matter but the Prosecution objected to his application on the basis of his absence from the 16 December Hearing. He was recorded to have made several allegations against the Respondent outlined at [67] below in seeking to justify his absence from the 16 December Hearing.",
        "The Respondent’s defence": "23 The Respondent did not dispute that he was indeed late for or absent from the hearings in question. He also admitted that this was sometimes due to “scheduling problems of his own creation” or his own mistakes and lack of preparedness. However, he highlighted that: (a) The reason for his conduct generally lay in his commitment to matters involving his other clients; (b) The judicial officers involved had not lodged complaints against him but had instead granted the adjournments on each of these occasions, suggesting that his requests for adjournments had all been  made on reasonable grounds; (c) His absence from and lateness in attending hearings was “a mistake that anyone could make” and was “not so grave as to amount to professional misconduct”; and (d) He had since corrected his errors. Further, the matters in question had all subsequently concluded without any mishap.",
        "The Tribunal’s findings": "70 In relation to the 1st charge, the Tribunal observed that it was important that clients be kept informed of court dates because the consequences of not attending court when required are serious. It also held that it would be good practice for advocates and solicitors to make an extra effort to send letters or emails to their clients as well. The Tribunal found that the Respondent contravened Rule 17 of the PCR and was guilty of misconduct under s 83(2)(b) of the LPA: at [24]-[25] of its decision inUdeh Kumar (C3J/OS 1/2017). 71 In relation to the 2nd charge, the Tribunal found that even if the Respondent’s version was to be accepted, he had not taken sufficient steps to discharge his duty to inform the Respondent to surrender himself. He was thus guilty of grossly improper conduct as an advocate and solicitor under s 83(2)(b) of the LPA: at [28]-[29] of its decision inUdeh Kumar (C3J/OS 1/2017). 72 In relation to the 14th charge, the Tribunal relied on the minute sheet of the DJ (see [67] above) and found the failure of the Respondent to respond in court to the client’s grave allegation “troubling and detrimental”. The Tribunal held that the Respondent could easily have clarified his position in court, but the minute sheet recorded that “[the Respondent]could not explainwhy he did not get his client to surrender himself earlier” [emphasis added]. 73 The Tribunal also found that the Respondent in advising the client to obtain a medical certificate under false pretences had acted wrongfully and with the intention to subvert the course of justice; it did not matter that this was not fully executed, in that the memo was not in the end submitted to the court. This was especially so because the 14th charge was not brought under Rule 56 of the PCR (on the duty to not mislead or deceive the court), but under s 83(2)(b) of the LPA: at [82]-[83] of its decision inUdeh Kumar (C3J/OS 1/2017).",
        "Our decision": "The 1st charge 74Although the client did not dispute that he attended the hearing on 20 November 2014 (when the 16 December Hearing was fixed), there was no evidence that he was issued a mention slip at that hearing. In any case, even assuming that the client had indeed been issued with a mention slip, this would not absolve the Respondent of his own duty to remind the client of the hearing date. The need to keep the client informed was all the more important in the context of criminal proceedings, in which the consequences of not attending a court hearing as required are serious. 75The assertion that the Respondent had done his best to inform the client of the mention date on 15 December 2014 was equally without merit. First, we noted that the client disagreed that the Respondent had taken these steps at all. But even if the Respondent’s version were true, the attempts were belated and insufficient to discharge his duty under Rule 17 of the PCR. This was especially the case because the 16 December Hearing had been fixed at the previous hearing on 20 November 2014. The Respondent thus had 25 days before the 16 December Hearing to inform the client of the hearing date. On the Respondent’s own account, he first attempted to contact the client in the evening of 15 December 2014, at about 4 pm or5pm, when the hearingwas scheduled to be held at around 9.30am the next day. His inaction in the 24 days preceding his first alleged attempt to contact the client was wholly unjustifiable. In our judgment, the Respondent was simply derelict in the basic duties he owed his client. 76Moreover, even taking the Respondent’s case at its highest, he only informed the client’s mother-in-law but had not kepttheclientreasonably informed of the mention date, which was the crux of his duty under Rule 17 of the PCR. The 2nd charge 77 In relation to the 2nd charge, the Respondent insisted that he had informed the client’s wife of the need for the client to surrender immediately. However, the client emphatically denied that the Respondent had spoken to his wife. If the Respondent did, the client argued, he would have been aware of it. This was evident from the following extract of the transcript: Q And you are aware that [the Respondent] had said that he had contacted your wife? A No, he --- Q You’re not aware? ANo, because my wife is always with me. So we staying together. So if[the Respondent] call my wife, I should know. [emphasis added] 78 Further, the client was not cross-examined on a related allegation in the client’s AEIC that the Respondent had advised him to stay with his sister temporarily in order to escape arrest. Although this was not the subject of the 2nd charge, this unrefuted allegation was simply incompatible with the Respondent’s case that he had advised the client to surrender himself. In the circumstances, we prefer the client’s evidence on this issue. The 14th charge 79 Finally, in relation to the 14th charge, we agreed with the Tribunal that the absence of any explanation from the Respondent in the face of the client’s serious allegations was most troubling. The Respondent did not deny that the client had made those allegations against him. His case before us was that he did not respond because he wished to protect solicitor-client privilege. But if the client’s accusations, which were extremely serious, were false, the relationship of trust between the Respondent and the client would have irretrievably broken down. In those circumstances, the only course of action open to the Respondent would have been to inform the court that the accusations were wholly untrue, and then apply to discharge himself. In this regard, we refer to Prof Pinsler’s observation inPCR Comment(at 412) that an advocate and solicitor may be required to “terminate his professional relationship with his client when circumstances have arisen which make it difficult or impossible for him to continue acting in a manner consistent with his position as an officer of the court”. This principle is encapsulated in Rule 57(a) of the PCR, which states: Client’s perjury or fraud 57.If at any time before judgment is delivered in any case, an advocate and solicitor becomes aware that his client has committed perjury orhas otherwise been guilty of fraud upon the Court,the advocate and solicitor — (a)may apply for a discharge from acting further in the case… [emphasis added] Since the Respondent’s position was that the client made untruthful statements in trying to persuade the court to grant him his bail application for the fresh charge, this would have amounted to a fraud upon the court, and the Respondent ought to have applied immediately to terminate the solicitor-client relationship. This is all the more so where, as here, the statements were directed squarely at the Respondent and alleged that he had acted most improperly. 80 As to the Respondent’s argument that the memo was for the purposes of excusing the client’s failure to immediately surrender to the warrant of arrest, rather than to justify his absence from the 16 December Hearing, this left no impression on us. This was so for two reasons. First, we agreed with the Tribunal (at [81] of its decision inUdeh Kumar (C3J/OS 1/2017)) that the memo could nonetheless have been useful even if the Respondent had already told the court about his failure to inform the client of the 16 December Hearing date,becauseitwould show that the client would not have been able to attend the 16 December Hearing in any event due to his medical condition. 81 Second, althoughwe appreciated that a strict literal reading of the minute sheet (at [67] above) might give the impression that two explanations were provided by the client in response to two separate questions from the court directed at (a) why he was absent from the 16 December Hearing; and (b) why he did not surrender immediately,we were satisfied fromreading the minute sheetas a whole that the key issue that was dealt with at the hearing was the reason for the client’s absence from the 16 December Hearing. The memo was, in our judgment, procured with a view to excusing the same. Thus, the Respondent’s insistencethat the memo had been obtained only to excuse the client’s failure to immediately surrender to the warrant of arrest was unsustainable. 82 Finally, when evaluating the client’s evidence as against the Respondent’s, we preferred the client’s evidence because we could see no conceivable reason for the client to lie. Even if he was seeking at the hearing on 16 February 2015 to persuade the DJ to grant his bail application, he would have been able to justify his absence from the 16 December Hearing on the sole basis that the Respondent failed to inform him of the hearing date. There was no need for him to go on and make a specific allegation that the Respondent had told him to procure the memo – unless this was the truth. It should be noted that the client was not the complainant in these proceedings and had nothing to gain from the Respondent’s conviction. There was also no evidence that the client had any personal animosity towards the Respondent. Indeed, he had already been released from prison for his offences, and was gainfully employed at the time of the hearing before the Tribunal. 83 For these reasons, we found that the Respondent’s conduct was grossly improper under s 83(2)(b) of the LPA. We were also amply satisfied that due cause was found in relation to the Group 3 Charges given their gravity.",
        "Group 2 Charges: misleading the court by making false or inaccurate statements": "",
        "The parties’ cases": "The 1st charge 61 In relation to the 1st charge, the Respondent admitted in his Defence and AEIC that the 16 December Hearing was fixed at a previous hearing on 20 November 2014. He added that “most unfortunately, due to an inadvertence”, he had failed to inform the client personally of the date, and the client did not attend the 16 December Hearing. He confirmed this before the Tribunal. 62 However, the Respondent submitted that he had not breached Rule 17 of the PCR for two reasons. First, his firm’s practice of updating clients of mention dates (by phone call or messages rather than letters) was a reasonable one and he had allegedly tried to do so in this case. Further, according to the Respondent, those parties who attended a hearing would receive a mention slip from the court stipulating the next mention date; it was not incumbent on him in such circumstances to remind his client once again of a fresh mention date. In the present case, since the client had attended the previous hearing on 20 November 2014, he must have received a mention slip informing him of the 16 December Hearing. There was no need for the Respondent to remind him of it again. 63 Second, even if the court was of the view that the client had not received a mention slip, the Respondent had already done his best to inform the client of the 16 December Hearing date. In particular, when he realised on 15 December 2014 that he had forgotten to remind the client of the 16 December Hearing, he immediately tried to call the client and his wife several times, but could not reach them. He then called the client’s land line, spoke to his mother-in-law, and requested that she pass on the message to the client. However, the client denied all these and contended that the Respondent had only contacted his mother, and even then onlyafterthe 16 December Hearing. The 2nd charge 64 In relation to the 2nd charge, the Respondent’s position was that after the 16 December Hearing when the warrant of arrest had been issued, he tried to contact the client but could not reach him. He then called and spoke to the client’s wife and informed her that a warrant of arrest had been issued and that the client ought to surrender himself to the court immediately. 65 The client gave a different version of events. He said that the Respondent only left a message with his mother requesting him to call the Respondent. On the same day, the client called the Respondent and learnt that the warrant of arrest had been issued against him. He was “shocked and nervous” and asked the Respondent what to do. The Respondent told the client to “see him soonest”. The client duly met the Respondent on 20 December 2014. Because the warrant of arrest had been issued, the client claimed that he was afraid to return home. He was advised by the Respondent to stay with his sister for the time being “in order … to escape from being arrested”. The client denied that the Respondent had informed his wife that he should surrender himself immediately. Instead, the client said that the Respondent had told him that the Respondent would “settle the Warrant of Arrest issue for [him]”. The 14th charge 66 In relation to the 14th charge, it was undisputed that a medical memorandum (“the memo”) dated 22 December 2014 was issued by Dr Goh Hsin Kai of Healthwerkz Medical Centre. The memo stated that the client suffered from “chronic episodic back pain”, which was exacerbated around 12 December 2014 (that is, before the 16 December Hearing). The condition apparently caused marked back stiffness which worsened with movement. The memo requested that the client be “grant[ed]…the needed leave and excuses at work or in any other circumstances”. It was also undisputed that the memo was not ultimately submitted to the court. However, the parties differed on the purpose of the memo, and whether the memo was procured under false pretences at the instigation of the Respondent. 67 The Law Society’s case was that the Respondent had told the client to procure the memo under false pretences in order to excuse his absence from the 16 December Hearing. This was based on (a) the minute sheet of the hearing on 16 February 2015, as well as (b) the client’s evidence. The minute sheet recorded the following: [The Respondent] took a [plead guilty (“PG”)] mention date from Court 17 for [the client] to PG in Court 18 on 16/12/2014 but on that day, [the client] was absent. Warrant of arrest was issued. [The client] was arrested [for another matter] and brought before Court 26 where he claimed that it was [the Respondent]’s fault that he was absent as [the Respondent] did not inform him about the PG date. [The Respondent] said he could not reach [the client] and thus left word with his in-laws. He said he overlooked writing to [the client]. [The Respondent] did speak with [the client] on 16/12/2014 after the Warrant of arrest was issued.[Theclient] was asked why he did not immediately go to court after he spoke with [the Respondent] on 16/12/2014 and [the client] said that [the Respondent] told him to go see a doctor if he “wants to save his ass”.[The Respondent] could not explain why he did not get [theclient] to surrender himself earlier. [emphasis added in italics and bold italics] According to the Law Society, it was simply incredible that the Respondent did not express any shock or surprise when a serious allegation – especially one which he vehemently insisted was false – was made by the client to the courtin his presence, to the effect that the Respondent had urged the client to see a doctor to try to exonerate himself. 68 The client’s evidence was that he spoke to the Respondent on 16 December 2014 and met him on 20 December 2014 (see [65] above). At the meeting, the Respondent told him that he needed to obtain a memo from his doctor for the purposes of explaining his absence from the 16 December Hearing. Under cross-examination, when asked how his medical condition was brought up during that discussion, the client said that the Respondent had asked him if there was any reason for him to go to the doctor, and he had reported that he suffered from “back pain”. The Respondent then told him to use this reason to visit the doctor in order to obtain the memo. The Respondent also told the client that he could arrange the memo for the client for $300; alternatively the client could get the memo himself. The client chose the latter option. After obtaining the memo, the client handed it to the Respondent and the Respondent assured the client that he would settle the matter. 69 The Respondent denied the client’s version of events. First, he disputed that the memo had been obtained under false pretences; instead, he argued that the client’s backache was a genuine medical condition and it had been raised by the client’s wife when she learnt that the warrant of arrest had been issued against the client. It was in this context that the Respondent requested that a memo be obtained so that he could produce it in court. Second, he denied that the memo was obtained for the purpose of excusing the client’s absence from the 16 December Hearing; instead, he said it was meant to justify the client’s failure to immediately surrender himself in response to the warrant of arrest.The Respondent argued that he had already informed the court about his mistake in failing to inform the client of the 16 December Hearing date. Thus, it was not necessary to also produce the memo in order to exonerate the client.Third, the Respondent sought to cast doubt on theclient’s version of events, arguing that the client had failed to bring up the issue of the memo when he was first produced in court to face the fresh charge on 2 February 2015. Instead, he had only mentioned this when he attended court for a further mention in relation to the fresh charge on 16 February 2015 and the Prosecution had objected to his bail application in respect of the fresh charge on the basis of his absence from the 16 December Hearing. We note in passing that this last point seems to confirm that the memo was mentioned in connection with the client’s absence from the 16 December Hearing contrary to what the Respondent contends.",
        "Group 3 Charges: advising a client to obtain a medical certificate under false pretences": "56 The Group 3 Charges concerned events that culminated in the Respondent advising one of his clients to obtain a medical certificate under false pretences to excuse his absence from court. This was the subject of the 1st, 2nd and 14th charges in C3J/OS 1/2017.",
        "Conclusion on conviction": "84 In sum, all the 11 charges before us were made out and constituted improper conduct under s 83(2)(b) of the LPA. We were also satisfied that due cause existed in relation to each charge. In the end, what was common in all these charges was that they went to the heart of the relationship between the Respondent, as an officer of the court, and the court itself, in connection with its core function of administering justice. In our judgment, this exacerbated the gravity of the offences. 85 In that light, we turn to the question of sentence.",
        "Sentence": "",
        "Sentencing principles": "86 The general sentencing principles underlying the determination of the appropriate penalty in cases of disciplinary proceedings are well established: seeLaw Society of Singapore v Chiong Chin May Selena[2005] 4 SLR(R) 320 at [26] andLaw Society of Singapore v Ravindra Samuel[1999] 1 SLR(R) 266 (“RavindraSamuel”) at [11]. The sentencing objectives in this context include: (a) Upholding public confidence in the administration of justice; (b) Safeguarding the collective interest in upholding the standing of the legal profession; (c) Punishment of the errant solicitor for his misconduct; and (d) Deterrence against similar offences by like-minded solicitors by leaving “no doubt as to the standards to be observed by other practitioners”. 87 Where there are multiple instances of misconduct complained of, the court will view the misconduct in totality and determine the overall gravity in determining the appropriate sentence:Law Society of Singapore v Yap Bock Heng Christopher[2014] 4 SLR 877 at [27]. With these principles in mind, we turn to examine the aggravating and mitigating factors in the present case.",
        "Aggravating factors": "88 The first aggravating factor highlighted by the Law Society was the Respondent’s seniority.As mentioned at the beginning of this judgment, the Respondent was a senior practitioner of about 29 years’ standing. The case law is clear that the more senior an advocate and solicitor, the more damage he does to the integrity of the legal profession:Law Society of Singapore v Nathan Edmund[1998] 2 SLR(R) 905 (“NathanEdmund”) at [33]. Hence, a more onerous sentence may be warranted in such circumstances. 89 The next aggravating factor was the Respondent’s past conduct. Section 83(5) of the LPA states that “the court may in addition to the facts of the case take into accountthe past conduct of the person concerned in order to determine what order should be made”.In particular, inLaw Society of Singapore v Ng Bock Hoh Dixon[2012] 1 SLR 348 (“Ng Bock Hoh Dixon”) at [35], the court held that “[t]he fact that an advocate and solicitor had previously committed a similar disciplinary offence is a significant aggravating factor that the court will consider in determining the appropriate sanction”. This is especially the case if the similar offences in the past demonstrate a “propensity” for the commission of such offences, so that the offence at hand cannot be seen as just a “discrete and momentary lapse of judgment”. 90 The Law Society highlighted a string of previous disciplinary offences that the Respondent had been convicted of and punished for. These included a suspension of three months in 2013 for failing to communicate directly with his client in relation to the sale of a flat and failing to keep the client reasonably informed of the progress of the sale of the flat. In that case, the court found that the Respondent’s actions amounted to a “total abdication of his duty”: seeLaw Society of Singapore v Udeh Kumar s/o Sethuraju[2013] 3 SLR 875 at [66]. In another instance in 2011, the Respondent was fined $1,000 for failing to keep his client informed of the basis on which his fees would be charged. 91 More significantly, the Respondent had previously committed several similar disciplinary offences of being late for or absent from court hearings and causing unnecessary adjournments (the subject of the Group 1 Charges): (a) InTheLaw Society of Singapore v Udeh Kumar S/O Sethuraju[2014] SGDT 9 (“the 2014 Hearing”), the Respondent was convicted of one charge involving four instances of non-attendance in court and three instances of non-compliance with court directions. Although no cause of sufficient gravity was found under s 83 of the LPA, the Respondent was ordered to pay a penalty of $20,000. The disciplinary tribunal observed (at [11]) that the Respondent has had a “history of poor case management which runs over a period of years and was so troubling that the Chief District Judge of the then Subordinate Courts had counselled him about his repeated failures to and lateness in attending court and urged him to change his ways”. (b) On 20 March 2014, the Council of the Law Society imposed a penalty of $10,000 on the Respondent for the 22 occasions between August 2010 and August 2012 on which the Respondent had, among other things, failed to attend court at the appointed time or had been late in his attendance. (c) On 30 April 2015, the Council of the Law Society imposed a fine of $15,000 on the Respondent for, among other things, “chronic non-attendance” by “failing to attend Court at the appointed time on 4 occasions…and thereby being disrespectful and disruptive to Court proceedings”. (d) On 12 June 2015, the Council of the Law Society imposed a fine of $2,000 on the Respondent for failing to comply with the directions of the Inquiry Committee appointed to inquire into a complaint lodged against him, failing to turn up for the hearing into his complaint at the appointed time, failing to notify the Inquiry Committee that he would be delayed and failing to give any proper explanation for his lateness.",
        "Mitigating factors": "92 We turn to the mitigating factors that were urged upon us on the Respondent’s behalf. The Respondent’s first argument was that his actions were a result of overextending himself out of a desire to help all his clients. As we have already indicated earlier, we were unable to accept this benign characterisation of the Respondent’s misconduct. We agreed with the observations of the disciplinary tribunal at the 2014 Hearing (at [12]) that “[a] heavy caseload cannot be put forward as an excuse or mitigation for repeated incidents of bad case management. [The Respondent’s] failure to attend court and to comply with timelines does not reflect diligence or responsibility towards his clients”. We were therefore disappointed that the Respondent attempted to mount this ill-conceived argument once again. We reiterate that the Respondent had full control over his timetable and should have taken steps to ensure that he was not scheduled for multiple cases at the same time. In failing to manage his schedule, he had done a disservice to his clients and it was disingenuous for him to then suggest that he was to be commended for his loyalty to them. 93 The Respondent also contended that he did not act with any malicious or dishonest intent.We did not see this as a mitigating factor. In relation to the Group 1 Charges, we concurred with the disciplinary tribunal which conducted the 2014 Hearing (at [13]) that while the Respondent might not have been “deliberately disdainful” towards the court, he “must have been aware” that his conduct was “disrespectful towards the court…and disruptive to the efficient progress of the proceedings” and that this was conduct “unacceptable and unbefitting of an advocate and solicitor”. As for the Group 2 and Group 3 Charges, the alleged lack of a malicious intention is irrelevant when one is concerned with the intentional making of a false statement. 94 The Respondent also pointed to the fact that on 31 August 2015, he had given a solicitor’s undertaking that (a) he would not act as counsel or instruct others in any new cases for a period of six months commencing from 7 September 2015; (b) his firm would not take on any new cases for a period of six months commencing from 7 September 2015; and (c) his firm would endeavour to clear all outstanding cases in this period. Although we were urged to construe this as a step in the right direction, we were ultimately not persuaded that this was motivated by genuine contrition; instead, we agreed with the Tribunal (at [95] of decision inUdeh Kumar (C3J/OS 5/2016))that the undertaking was belatedly given on 31 August 2015, which wasafterthe commencement of the disciplinary proceedings that led to C3J/OS 5/2016 and did not detract from his misconduct which was the subject matter of these proceedings. 95 The Respondent further relied on the fact that he had been ordered to pay costs personally in relation to OS 576 to submit that he had thereby already been punished.In our judgment, this was misconceived. The imposition of such an adverse costs order may demonstrate that the advocate and solicitor’s conduct in relation to a particular matter is such that it calls for the court to express its disapproval by such an order. But that has nothing to do with the wider question of whether he has misconducted himself in such a way as to warrant disciplinary action being taken against him by reason of that and perhaps other matters. In keeping with this, it may also be noted that the penalty reflected in the adverse costs order in OS 576 was obviously insufficient in the context of the severity of the Respondent’s offences as a whole and only served to confirm that his conduct in relation to that matter was egregious (see [27] above). 96 Finally, the Respondent argued that in relation to the Group 1 Charges, the consequences of his actions were not severe and the matters did substantially progress. Again, this was not a relevant mitigating factor. The point was not whether the casesultimatelyprogressed; instead, the crux of the matter was that by being late and causing adjournments, the Respondent had hindered thetimelyprogress of the cases, undermined the efficiency of the administration of justice, and disrespected the authority of the court. 97 In the circumstances, we found that there were no material mitigating factors in this case.",
        "The appropriate penalty": "98 Under s 83(1) of the LPA, when due cause has been shown, an advocate and solicitor is liable to be struck off the roll, to be suspended from practice for a period not exceeding five years, to pay a penalty of up to $100,000, to be censured, or to pay a penalty in addition to a suspension or censure. 99 At the hearing before us, counsel for the Law Society in each of the Originating Summonses sought a suspension for a period of between 12 and 15 months. It was not clear to us whether the Law Society was urging this as an aggregate sentence or as a sentence that was to be imposed in respect of each of the Originating Summonses yielding an aggregate suspension of between 24 and 30 months.When queried on why the Law Society did not seek the more severe penalty of striking off given that the gravamen of at least some of the charges entailed a finding that Respondent had been dishonest, counsel for the Law Society, Mr Siraj Omar (“Mr Omar”), indicated there was a “spectrum of dishonesty”, and that because the Respondent’s conduct did not, for example, involve the misappropriation of his clients’ funds, forgery or the like, a suspension would be sufficient. We expressed some doubt over this approach, and Mr Omar then clarified that while it was clear that every instance of dishonesty was deserving of punishment, there was a “spectrum of punishment” that might be imposed for different types of dishonest conduct. 100 In his submissions, the Respondent argued that even if due cause was found, a fine would be sufficient. At the hearing before us, Mr Sreenivasan departed from this and instead sought to persuade us that a suspension would be adequate and that striking off was not warranted. 101 As evident from our observations in the preceding sections, the Respondent’s misconduct was egregious and a fine would obviously be insufficient. In fact, in our judgment, even a suspension for the period sought by the Law Society would be grossly inadequate to reflect the gravity of the Respondent’s offences. This left us with the question of whether the most severe penalty of striking off was appropriate in the present case. As a starting point, we were guided by the observations of Yong Pung How CJ inRavindra Samuel, where he considered the decision of Lord Bingham MR (as His Lordship then was) inBolton v Law Society[1994] 1 WLR 512 and set out the following principles (at [15]): (a) where a solicitor has acteddishonestly, the court will order that he be struck off the roll of solicitors; (b) if a solicitor isnot shown to have acted dishonestly,but is shown to havefallen below the required standards of integrity, probity and trustworthiness, he will nonetheless be struck off the roll of solicitors, as opposed to merely being suspended,if his lapse is such as to indicate that he lacks the qualities of character and trustworthiness which arethe necessary attributes of a person entrusted with the responsibilities of a legal practitioner. [emphasis added] 102 In our judgment, the severity with which the court deals with any instance of dishonesty is perhaps best exemplified inLaw Society of Singapore v Choy Chee Yean[2010] 3 SLR 560 (“Choy Chee Yean”). In that case, the respondent pleaded guilty to and was convicted by the Hong Kong District Court of a charge of burglary of several items from a hotel room. Among the extenuating circumstances was the fact that the solicitor in that case was suffering from Major Depressive Disorder at the time of the offence. He was sentenced to 12 months’ imprisonment, but recognising the exceptional circumstances, the court suspended the sentence for two years. In his subsequent show cause proceedings before this court, the respondent submitted that he ought not be struck off the roll because he had not in fact been dishonest given that he had acted in the midst of a psychiatric illness (at [19]). His evidence was that he had pleaded guilty because of the real concern that his mental condition would deteriorate further if he underwent a criminal trial, and he also wanted to avoid the prospect of a longer period of incarceration should he be unsuccessful at trial (at [9]). He asserted that he did not in fact possess the requisite criminal intent of dishonesty at the time of the offence (at [20]). While the court noted the strength of the extenuating circumstances, it nonetheless ordered that the respondent be struck off the roll. Writing for the court, Andrew Phang Boon Leong JA emphasised as follows at [44] and [50]: 44 …Where the advocate and solicitor concerned has been guilty of dishonesty, the court willalmost invariably,nomatter how strong the mitigating factors advanced by the advocate and solicitor, order that he or she be struck off the roll… 50  The legal profession cannot be seen to be tolerant ofanyact of dishonesty on the part of an advocate and solicitor,even if the dishonesty has been of a technical nature(such as in the present case). … [emphasis added in italics and bold italics] 103 Despite acknowledging that the respondent’s act was a single one-off act, rather than a series of deliberate acts, and that he was suffering from a psychiatric condition at the material time such that the dishonesty could be described as “technical” in nature, the court held (at [46]) that the precedents clearly established that the sanction of striking off could be (and was, in that case) warranted. 104 We were therefore unable to accept Mr Omar’s suggestion that there is a “spectrum of dishonesty” or a “spectrum of punishment” for different types of dishonest conduct. In our view, it is clear thatanyform of dishonesty – even “technical” dishonesty in the extenuating circumstances that were found inChoy Chee Yean– would almost invariably lead to an order for striking off. This is essentially a function of the special role that advocates and solicitors have as officers of the court to assist in the administration of justice. 105 From our review of the case law, there are at least three categories of cases in which dishonest conduct has resulted in the striking off of an advocate and solicitor. The first is when the advocate and solicitor has been convicted of a criminal offence which implies a “defect of character” rendering him unfit for the profession (seeLaw Society of Singapore v Tham Yu Xian Rick[1999] 3 SLR(R) 68 at [13] and s 83(2)(a) of the LPA). These include cases involving offences such as theft in a dwelling place (Choy Chee Yean;Law Society of Singapore v Ong Lilian[2005] SGHC 187;Law Society of Singapore v Amdad Hussein Lawrence[2000] 3 SLR(R) 23), criminal breach of trust (Law Society of Singapore v Ezekiel Caleb Charles James[2004] 2 SLR(R) 256;Law Society of Singapore v Loh Wai Mun Daniel[2004] 2 SLR(R) 261), attempted cheating (Nathan Edmund) and abetting a client to avoid attending court by producing false medical certificates (Law Society of Singaporev Dhanwant Singh[1996] 1 SLR(R) 1). 106 The second broad category of cases is where the advocate and solicitor fails to deal appropriately with his client’s money or the firm’s accounts. For example, inRavindra Samuel, the respondent received two cash payments from his clients which he failed to pay into the firm’s relevant accounts. On one of these occasions, he also appended a false attendance note stating that the client had not made payment. InNg Bock Hoh Dixon,the respondent, amongst other things, rendered a bill with a statement that he knew to be false and failed to pay his client’s money into a client account. InLaw Society of Singapore v Lim Yee Kai[2001] 1 SLR(R) 30, the respondent used money from a client’s account for his own purposes and failed to keep and maintain the firm’s books of accounts. 107 Finally, and most pertinently for the present case, a striking off order will be made where the advocate and solicitor is fraudulent in his dealings with the court. InLaw Society of Singapore v Nor’ain bte Abu Bakarand others[2009] 1 SLR(R) 753, the first and third respondents were struck off the roll forfraudulently concealing material facts from the court, which resulted in an order being made for payment out to their client when it was not in fact entitled to the money. 108 For completeness, we note that inRe Ram Goswami[1988] 2 SLR(R) 183, the advocate and solicitor, while acting for one of his clients (a bailor) who was ordered to show cause as to why his bail money should not be forfeited, made submissions to the court in terms which he knew to be untrue. In essence, he told the court that the bail money was 15 years’ worth of the bailor’s savings, when this was not the case. In fact, the money had not even been provided by the bailor. The court upheld the disciplinary committee’s finding that it had been proven beyond reasonable doubt that the respondent was a participant in an attempt to deceive the court, and ordered that he be suspended from practice for six months.In our judgment, the sentence imposed by the court was manifestly inadequate in the circumstances and should not be followed. 109 In our judgment, where an advocate and solicitor is shown to have been dishonest, including where he has been fraudulent in his dealings with the court, striking off will typically be the sanction save in the most exceptional circumstances. This is because an advocate and solicitor is an officer of the court; indeed, his very designation is an advocate and solicitorof the Supreme Court. The paramount duty of an advocate and solicitor is his duty to the court. This is a multifaceted duty, but at its core, it is a duty to assist the court in the due administration of justice with integrity, honesty and rectitude. The court depends on its advocates to discharge its own mission to dispense justice; we cannot do this if those we count as our officers do not have even a basic understanding of their duties and responsibilities, including in particular, the duty to be honest and truthful. In this regard, we agree with the observations of V K Rajah J (as he then was) inByProductsat [35], where he said: 35 …[The duty not to mislead or deceive the court] is a sacred duty which every court is entitled to expect every solicitor appearing before it to unfailingly discharge. So overwhelming is the public interest in maintaining the dignity and honour of the legal profession through the preservation of the highest ethical and moral standards amongst solicitors that the courts cannot risk allowing it to be compromised by even a few recalcitrant individuals within the profession. If and when any such breaches come to light, they must be dealt with swiftly and severely.",
        "Conclusion on sentence": "110 We conclude this analysis with the following observations of Yong CJ inRavindra Samuelat [12]-[13]: 12 … The administration of justice can only proceed on the basis that solicitors can place reliance upon the honesty of the solicitors with whom they deal. The public too must be able to repose confidence in a profession which plays so indispensable a part in the administration of justice. Similarly, the courts of this country must be able to depend on the honesty and integrity of all practitioners appearing before them and to expect that they will maintain the highest standards of personal honesty and integrity in their dealings with the courts. 13 There is therefore a serious responsibility on the court, a duty to itself, to the rest of the profession and to the whole of the community, to be careful not to accredit any person as worthy of public confidence and therefore fit to practise as an advocate and solicitor who cannot satisfactorily establish his right to those credentials. In the end therefore, the question to be determined is whether the solicitor in question is a fit and proper person to be an advocate and solicitor of the court, and the orders to be made are to be directed to ensuring that, to the extent that he is not, his practice is restricted. 111 Those observations usefully frame the grave concerns we have with the Respondent’s conduct. In the present case, the charges revealed a gross failure by the Respondent to apprehend even the most fundamental duties of an advocate and solicitor to the court. The Group 1 Charges showed that the Respondent was recalcitrant in being utterly disrespectful to the courts over a prolonged period of time, with antecedents demonstrating a persistent pattern of similar behaviour over the course of several years. He remained unrepentant despite the several penalties that had already been imposed on him to little or no effect. As we have already noted, this was plainly not a case of a momentary lapse or misjudgment. The Group 2 and Group 3 Charges revealed that the Respondent had been fraudulent or dishonest in his dealings with the court on several occasions. 112 Applying the principles we have considered to the circumstances of the present case, we were satisfied that the proper order was to strike the Respondent off the roll of advocates and solicitors and we so ordered. We also made the usual orders against the Respondent for costs (including disbursements) to be paid to the Law Society in each of the Originating Summonses and the two hearings before the Tribunal. Sundaresh Menon       Andrew Phang Boon Leong           Tay Yong KwangChief Justice        Judge of Appeal                        Judge of Appeal Siraj Omar and Alexander Lee (Premier Law LLC) for the applicant in C3J/OS 5/2016;Vijai Parwani (Parwani Law LLC) for the applicant in C3J/OS 1/2017;N Sreenivasan SC and Jason Lim (Straits Law Practice LLC) and B Uthayachanran (Essex LLC) for the respondent in C3J/OS 5/2016 and C3J/OS 1/2017."
    }
}