{
    "case_title": "Attorney-General vTham Yim Siong and others",
    "ncitation": "[2017] SGHC 267",
    "coram": "Kannan Ramesh J",
    "sections": {
        "The facts": "2 The first defendant is the daughter of the second and third defendants. 3 On 9 May 2016, the defendants filed a bankruptcy application, HC/B 1051/2016 (“OS 1051”), against 21 defendants (“the 21 Defendants”) including nine Cabinet Ministers (“the 9 Ministers”). In their joint supporting affidavit, the defendants averred that the 21 Defendants were indebted to them in the sum of $1,773,192.99 excluding interest; and that they had served statutory demands on the 21 Defendants for this sum, which demands had neither been complied with nor set aside. I note that although OS 1051 was commenced against the 21 Defendants, the defendants had also identified a total of 1426 alleged debtors in a List of Debtors which was sent to the AGC at about the same time as the filing of OS 1051. In OS 1051, the defendants raised a myriad of complaints against the 21 Defendants. They alluded,inter alia, to an injury suffered by the third defendant and her claims thereafter for employment benefits, related wrongful disclosures of confidential information and a criminal conspiracy against the defendants. The gist of the claims against the 9 Ministers was that as office holders or heads of a ministry or organisation, they were liable for the alleged misconduct and breaches which were relevant to the defendants’ allegations. 4 On 18 May 2016, the 9 Ministers and two other defendants in OS 1051 applied to strike out OS 1051 on the basis that it was frivolous, vexatious, obviously unsustainable, and an abuse of the process of the court. On 20 May 2016, Woo Bih Li J (“Woo J”) heard the striking-out applications. Woo J held that OS 1051 was groundless and an abuse of the process of the court, and struck out and dismissed OS 1051 against the 9 Ministers and the other two defendants. On 27 May 2016, Woo J struck out OS 1051 against the remaining defendants. 5 On 30 May 2016, the Supreme Court sent a letter to the parties in OS 1051 stating that OS 1051 “has been struck out and dismissed in its entirety”. 6 The defendants then sent an email to the Registrar of the Supreme Court (“the RSC”) dated 1 June 2016 (“the 1 June 2016 email”), insisting that Woo J’s orders to strike out OS 1051 against the 9 Ministers and two other defendants be set aside. Further, they recommended that Woo J be temporarily suspended on “suspicion of misconduct” and alleged that the then Second Solicitor-General, who was not one of the 21 Defendants, was “a secondary suspect in criminal conspiracy”. The 1 June 2016 email was copied to more than 60 persons, including the President, the Prime Minister, several Cabinet Ministers and members of the media. 7 By a letter dated 2 June 2016, the Supreme Court responded to the 1 June 2016 email by reiterating that OS 1051 had been “struck out and dismissed in its entirety” and stated that the defendants “may wish to seek legal advice … for the matters raised in [their] email”. 8 Subsequently, by an email dated 6 June 2016, the defendants wrote to the Chief Justice, alleging that Woo J’s orders in OS 1051 “are strong evidence of his inability to perform the functions of his office” and that they suspected that the RSC was involved in a criminal conspiracy. This email was also copied to,inter alia, the President, the Prime Minister, several Cabinet Ministers and the media. 9 On 22 June, 3 July and 12 July 2016, the first defendant purported to serve three “affidavits” by email on various public agencies, organisations, and several Cabinet Ministers. These were sworn by the first defendant on behalf of all of the three defendants. The “affidavits” apparently pertained to OS 1051, but named the Prime Minister as the sole defendant. These emails were copied,inter alia, to members of the media. The enclosed “affidavits” levelled a host of allegations of wrongful conduct against public agencies and public officers. They also stated that around 1500 persons owed debts to the defendants, including the President, the Prime Minister and the Chief Justice. 10 On 15 August 2016, the first defendant attempted to file what she termed a “summary judgment” application (“the Summary Judgment Application”) in the State Courts. This comprised a draft OS, which named 19 defendants, including Woo J, the RSC, the then Solicitor-General and Second Solicitor-General and counsel for the defendants in OS 1051, and an affidavit affirmed by the first defendant. In the affidavit, the first defendant averred that Woo J’s orders that OS 1051 be struck out were void and liable to be set aside. She sought an order for substituted service of OS 1051 and a special hearing “at the Supreme Court Auditorium for [six] consecutive days”. The Summary Judgment Application was closely linked to OS 1051 as it was an attempt to revive the same, notwithstanding that OS 1051 had already been conclusively dealt with by Woo J. 11 On 16 August 2016, the State Courts rejected the Summary Judgment Application on the basis,inter alia, that bankruptcy proceedings fell outside the jurisdiction of the State Courts. 12 On 28 August 2016, the first defendant purported to serve, by email, a further “affidavit” on several Cabinet Ministers. This “affidavit” was also allegedly sworn by the first defendant on behalf of all the defendants. Again, it named the Prime Minister as the sole defendant, and alleged wrongful conduct on the part of various public officers and agencies. The first defendant also attached a List of Debtors to this email which, this time, identified 1501 purported debtors. 13 On or about 26 October 2016 and 15 February 2017, the first defendant sent two more “affidavits” to AGC which named herself as the plaintiff. The “affidavit” dated 26 October 2016 named several Cabinet Ministers and senior public officers as defendants. The “affidavit” dated 15 February 2017 (“the CLTPA Affidavit”) named 12 alleged Legal Service Officers (“the 12 LSOs”) as defendants. Wrongful conduct was again alleged against the named defendants, and the first defendant sought the Minister of Home Affairs to impose a detention order under the Criminal Law (Temporary Provisions) Act (Cap 67, 2000 Rev Ed) in respect of the 12 LSOs. 14 On 22 February 2017, the first defendant attempted to file an application in the Supreme Court for leave for an investigation to be made into a complaint of misconduct against the AG and the 12 LSOs under s 82A(5) of the Legal Profession Act (Cap 161, 2009 Rev Ed) (“the LPA Application”). Again, this consisted of a draft OS and an affidavit. Pertinently, the allegations of misconduct in the affidavit concerned the injury suffered by the third defendant and the related breaches of confidential data. These were the very same factual matters that underpinned OS 1051 (see [3] above). Thus, in filing the LPA Application, the first defendant was essentially raising the same facts that she had relied on in OS 1051, albeit in the different context of making a complaint against public officers, rather than that of a bankruptcy application. 15 On 24 February 2017, the Supreme Court rejected the LPA Application on the basis that the draft OS and affidavit did not comply with O 7 r 3(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“the Rules of Court”); and the affidavit did not comply with O 41 r 1(4) of the Rules of Court. 16 On 13 March 2017, the defendants attempted to file an application to “renew” OS 1051 (“the Renewal Application”) comprising a draft OS (“the Draft Renewed OS”) and an affidavit. The affidavit did not name the 21 Defendants as defendants, but instead named as defendants the 13 defendants to the LPA Application and ten other public officers. The contents of the affidavit were similar to those of the affidavit filed in connection with the Summary Judgment Application. It was again stated that OS 1051 was still pending; and the same orders for substituted service and a special hearing of OS 1051,ie, the same reliefs prayed for in the Summary Judgment Application, were sought once more (see [10] above). 17 On 15 March 2017, the Supreme Court rejected the Renewal Application on the basis that OS 1051 had been struck out in its entirety and there was thus no longer any matter for renewal. 18 Notwithstanding the rejection of the Renewal Application, on 15 March 2017, the first defendant purported to serve three documents on some 60 recipients by email. These were (1) a document entitled “Renewed Originating Summons (Creditor’s Bankruptcy Application) (“the Purported Renewed OS”), (2) an affidavit and (3) a “Proof of Loss Form” listing 314 persons. The Purported Renewed OS was similar to the Draft Renewed OS, but differed from the latter in the following material aspects. (a) The Purported Renewed OS referred to a “Special Hearing Date … from 29-March-2017 to 03-April-2017”, and stated that the hearing would be before a Judge. The Draft Renewed OS did not state this. (b) The Purported Renewed OS bore a notation stating “Renewed for 6 months from the 10 [sic] day of November 2016 by an order of Court dated the 15 [sic] day of March 2017”. This notation did not appear in the Draft Renewed OS. (c) The Purported Renewed OS bore what appeared to be the signed endorsement of the RSC, unlike the Draft Renewed OS. 19 The affidavit in the Renewal Application referred,inter alia, to the Summary Judgment and LPA Applications. It appears that it was through this affidavit that the Attorney-General’s Chambers (“the AGC”) came to learn of the two aforementioned applications. Subsequently, by letters dated 17 March 2017, the AGC wrote separately to the Supreme Court and the State Courts for clarifications regarding the Purported Renewed OS, the Summary Judgment Application, the LPA Application and the CLTPA Affidavit. 20 By a letter dated 21 March 2017, the Supreme Court informed the AGC,inter alia, that both the LPA Application and the Renewal Application had been rejected (see [15] and [17] above). The Supreme Court also informed the AGC that it had lodged a police report in respect of the Purported Renewed OS. 21 By an email dated 21 March 2017, the State Courts informed the AGC that no application in relation to the CLTPA Affidavit had been filed in the State Courts. By a further email dated 24 March 2017, the State Courts informed the AGC that it had rejected the Summary Judgment Application. 22 On about 23 March 2017, the first defendant sent two letters to the AGC to request that prosecutions be initiated against,inter alia, the AG, the 12 LSOs, Woo J and the RSC. She also sent an “affidavit” to the AGC that named four judicial officers, including Woo J, and three public officers as the defendants who allegedly “aided or promoted certain offences relating to organized criminal group, by doing anything to stop the bankruptcy proceedings of [OS 1051]”. 23 Throughout this period, the first defendant also published several posts on her Facebook account, in which she uploaded various documents which have been referred to above, to describe the steps that she had taken. (a) On 19 August 2016, the first defendant uploaded a copy of the Summary Judgment Application and announced that she had lodged a police report after the State Courts rejected the same. (b)  On 22 February 2016, the first defendant uploaded a copy of the CLTPA Affidavit and claimed that she had served it on the 12 LSOs. (c) On 24 February 2017, the first defendant uploaded a copy of the LPA Application and announced that she had made the application because the AG and the 12 LSOs had “committed wilful misconduct”. She further stated that she was “now effecting substituted service of the [LPA Application] on the 13 defendants using Facebook”. (d) On 15 March 2017, the first defendant uploaded a copy of the Purported Renewed OS, and proposed settlement of the matter.",
        "The procedural history and the hearing": "24 On 27 March 2017, the AG filed OS 334. Copies of the OS and the supporting affidavit were served on the defendants at their place of residence. 25 Subsequently, three pre-trial conferences (“the PTCs”) were held for OS 334 on 17 April, 8 May and 19 June 2017 respectively. The Supreme Court sent Registrar’s Notices in respect of the PTCs to the defendants. In addition, the AGC also sent letters to the defendants enclosing the Registrar’s Notices. These stated the hearing dates for the PTCs as well as directions made at the PTCs. However, the defendants did not attend any of the PTCs. They also did not comply with a direction made at the PTC on 17 April 2017 to explain their absence from the same PTC. Nor did they comply with directions to file and serve reply affidavits and written submissions for OS 334. 26 Notably, on 31 March 2017, the first defendant published a Facebook post stating that a PTC for OS 334 had been fixed for 17 April 2017. She also stated that the defendants would not be attending the PTC because it had been fixed earlier than usual, and should only be held after the police investigations in respect of the Purported Renewed OS had been completed (see [20] above). Thus, the evidence indicates, and I find, that the defendants were aware of OS 334, and had received the cause papers in the application. They also knew of the hearing dates for the PTCs and the directions made at those PTCs but chose not to attend the same. 27 The evidence also indicates that the defendants knew, before 30 June 2017, that OS 334 was fixed for hearing before me on that date. In this regard, two emails sent by the first defendant on 29 June 2017 are relevant. In the first email, she wrote to Mr Quek Mong Hua and Mr Lee Han Tiong of Lee & Lee (“the Lee & Lee lawyers”) asserting that they were “to attend the hearing tomorrow – 3pm at Chamber 5F of the Supreme Court – on behalf of me and my parents …”. In making this assertion, the first defendant invoked s 74(2) of the SCJA, which provides that “if [a] person against whom an order is sought under [s 74(1) of the SCJA] satisfies the High Court that he lacks the means to retain an advocate and solicitor, the High Court shall assign one to him.” In the second email, the first defendant wrote to the Prime Minister stating that the Lee & Lee lawyers had not returned a call that she had made to them earlier that morning. She queried: “So will my parents and I classify [sic] vexatious litigants by the Attorney-General tomorrow?” These two emails clearly demonstrate, and I find, that the defendants knew in advance of the hearing of OS 334, of the date, time and location of the hearing, and what orders the application sought. 28 However, on 30 June 2017, the defendants did not attend the hearing of OS 334. State Counsel Ms Elaine Liew (“Ms Liew”), who appeared for the AG, then applied for the court to proceed with the hearing under O 28 r 4(1) of the Rules of Court. Ms Liew brought my attention to the evidence set out at [24]–[27] above. She informed me that a cause book search had been performed, and there was no indication that the Lee & Lee lawyers acted for the defendants. Ms Liew also submitted that there was no evidence of the defendants’ impecuniosity and the defendants had not made a request to the court for an advocate and solicitor on that ground. She made the point that, at the very least, the defendants ought to have turned up at the hearing to state their position. 29 It seemed clear from the evidence that the defendants were well aware of the hearing dates of the PTCs and OS 334 but simply chose not to attend the said hearings. Also, they knew the subject matter of the application. Moreover, for the reasons given below, I was satisfied that I had jurisdiction to grant orders against the defendants under s 74(1) of the SCJA in their absence. I therefore decided to proceed with the hearing of OS 334.",
        "The AG’s case": "30 The AG’s case was that the defendants should be restrained from instituting or continuing any legal proceedings in any court or subordinate court, in respect of whose decisions there was a right of appeal to the Supreme Court, without the leave of the High Court. The AG’s application was founded on two bases: s 74(1) of the SCJA, and the inherent powers of the court. 31 In relation to s 74(1) of the SCJA, the AG argued that the conditions for exercising the power thereunder were satisfied and the court should exercise its discretion to grant the orders sought. In particular, the AG submitted that the court should adopt a broad interpretation of the phrase “instituted … legal proceedings” in s 74(1) of the SCJA. The AG made this argument as the defendants did not technically institute proceedings given that their attempts at filing the Summary Judgment, LPA and Renewal Applications were unsuccessful. The AG also submitted that, although the defendants did not attend the hearing of OS 334, they were given every opportunity to do so. Hence, the requirement under s 74(1) that the court hear the litigant or give the litigant “an opportunity of being heard” had been satisfied. The court therefore had jurisdiction to grant orders under s 74(1). 32 The AG further submitted that, even if the elements of s 74(1) were not satisfied, the court could grant the orders sought pursuant to its inherent powers to prevent abuse of process, and should exercise its discretion to do so.",
        "The law": "33 Section 74 of the SCJA provides as follows: Vexatious litigants 74.—(1) If, on an application made by the Attorney-General, the High Court is satisfied that any person hashabitually and persistentlyandwithout any reasonable groundinstituted vexatious legal proceedingsin any court or subordinate court, whether against the same person or against different persons, the High Court may,after hearing that person or giving him an opportunity of being heard, order that — (a) no legal proceedings shall without the leave of the High Court be instituted by him in any court or subordinate court; and (b) any legal proceedings instituted by him in any court or subordinate court before the making of the order shall not be continued by him without such leave, and such leave shall not be given unless the High Court is satisfied that the proceedings are not an abuse of the process of the court and that there is prima facie ground for the proceedings. … (5) In this section, “legal proceedings” includesany proceedings, process, action, application or appealin any civil matter or criminal matter. [emphasis added] In my view, s 74(1) of the SCJA may be analysed in terms of three conditions that must be fulfilled for a court to have jurisdiction to grant an order thereunder. 34 First, the litigant in question must have “habitually and persistently … instituted … legal proceedings” (“the First Condition”). In the recent case ofLai Swee Lin Linda v Attorney-General[2016] 5 SLR 476 (“Linda Lai”) at [10], Judith Prakash JA (“Prakash JA”), delivering the judgment of the Court of Appeal, discussed the phrase “habitually and persistently” as follows: The mere institution of vexatious legal proceedings, without more, does not bring s 74(1) into play. The requirements that the litigant must have acted “habitually” and “persistently” suggest thata pattern of conduct is necessary. … the words “habitually” and “persistently” areordinary English words which should not be given any technical meaning specifically for the purpose of s 74(1)… As commonly defined and interpreted,the word “habitually” suggests the institution of legal proceedings almost as a matter of course or almost automaticallywhen the appropriate conditions exist, while the word“persistently” suggests determination and the act of doggedly continuing in the face of difficulty or opposition. [emphasis added] Prakash JA also made the following pertinent observations at [14]: Although the number of legal proceedings that have been brought by the litigant may be a relevant factor in consideringwhether he has been instituting vexatious legal proceedings in a habitual and persistent manner, it is not determinative and should not be given undue weight…There is no magic number of legal proceedings that have to have been broughtbefore a litigant would be labelled as vexatious. Ultimately, the court must takea broad viewof all the legal proceedings that have been instituted by the litigant and consider whether thegeneral character and result of those proceedingscause him to fall within the category. [emphasis added] In other words, the inquiry is whether, assessed broadly, the general character and result of the legal proceedings lead to the conclusion that the defendant has instituted vexatious legal proceedings in a habitual and persistent manner. 35 Secondly, the legal proceedings must have been “vexatious” and instituted “without any reasonable ground” (“the Second Condition”). InLinda Laiat [11]–[13], Prakash JA discussed the meaning of “vexatious” as follows: 11  The term “vexatious” is likewise given its ordinary meaning.Legal proceedings are regarded as vexatious if they are instituted with the intention of annoying or embarrassing the opposing party, orare brought for collateral purposes and not for the purpose of having the court adjudicate on the issues to which they give rise. Further,legal proceedings which areso obviously untenable or groundless as to be utterly hopeless may also be regarded as vexatious, even if the litigant’s motives are wholly innocent. 12  Drawing these definitions together, a vexatious litigant is one who iseither unable or unwilling to accept the finality of court decisions, and who repeatedly brings legal proceedings which are vexatious in nature in an attempt to re-litigate mattersthat have already been conclusively decided by the courts when there is no basis for doing so. … 13 The court takes an objective view of the facts in deciding whether a litigant’s conduct falls within s 74(1) of the SCJA.It is immaterial that the litigant may have acted in good faith in bringing the legal proceedings concerned, or that he may genuinely believe in the justice of his cause and may not understand that his case has already been authoritatively dealt with and decided by the court… Having said that,the motives of the litigant may be relevant to the inquiry in cases where the litigant is shown to be acting in bad faith. This would have some bearing on the court’s assessment of whether the legal proceedings instituted by him are vexatious. [emphasis added] 36 Thirdly, the litigant must be heard or given “an opportunity of being heard” before the order is made (“the Third Condition”): seeLinda Laiat [15]. 37 If the aforementioned three conditions are satisfied, the court will have jurisdiction to grant an order under s 74(1). Although the court has a “residual discretion” not to grant such an order, Prakash JA observed inLinda Laiat [16] that “it is unlikely, although not inconceivable, that the court will decline to grant the application where it has concluded that the litigant is vexatious”.",
        "The First Condition": "",
        "The scope of the concept of institution of legal proceedings": "38 The AG argued that the First Condition was fulfilled. A crucial premise of this argument was the contention that a broad interpretation of the phrase “instituted … legal proceedings” should be adopted, such that it would include both successful and unsuccessful attempts to file proceedings. In this regard, the AG relied on the Supreme Court of South Australia’s decision inGarrett &Anor v Mildara Blass Ltd & Ors[2009] SASC 19 (“Garrett”). There, the court held that for the purpose of s 39 of the Supreme Court Act 1935 (SA), which is equivalent to s 74(1) of the SCJA, “instituting proceedings” encompassed the lodging of documents for the purpose of filing proceedings, even where such documents were rejected by the court (at [133]). On that basis, the AG argued that I should account for the Summary Judgment, LPA and Renewal Applications, which had been rejected by the State Courts and the Supreme Court, in considering whether the First Condition was satisfied. 39 The issue of whether failed or unsuccessful attempts to file proceedings amount to the institution of proceedings for the purposes of s 74(1) had not been considered by our courts before. I therefore reviewed the English and Australian authorities. The English authorities 40 Section 74(1) appears to derive from the English legislation on vexatious litigants. InAttorney-General v Tee Kok Boon[2008] 2 SLR 412 (“Tee Kok Boon”) at [60], Woo J noted the similarities between an earlier version of s 74(1) and s 51 of the Supreme Court of Judicature (Consolidation) Act 1925 (c 49) (UK) (“the 1925 Act”) as amended by the Supreme Court of Judicature (Amendment) Act 1959 (c 39) (UK). These provisions derive from s 1 of the Vexatious Actions Act 1896 (c 51) (UK) (“the VAA”): seeEbert vVenvil and Another[2000] Ch 484 (“Ebert”) at 490H andTee Kok Boonat [53]. 41 Section 1 of the VAA, which was the first English statutory provision on vexatious litigants, provided as follows: It shall be lawful for the Attorney-General to apply to the High Court for an order under this Act, and if he satisfies the High Court that any person hashabitually and persistently instituted vexatious legal proceedings without any reasonable groundfor instituting such proceedings, whether in the High Court or in any inferior court, … the courtmay, after hearing such person or giving him an opportunity of being heard, … order that no legal proceedings shall be instituted by that person in the High Court or any other court, unless he obtains the leave of the High Court or some judge thereof, and satisfies the court or judge that such legal proceeding is not an abuse of the process of the court, and that there is prima facie ground for such proceeding. … [emphasis added] The similarities between this provision and s 74(1) (see [33] above) are evident. The First, Second and Third Conditions are found in s 1 of the VAA. 42 InInre BernardBoaler[1914] 1 KB 21 (“BernardBoaler”), the English Court of Appeal ruled, by a majority (Buckley LJ dissenting), that criminal proceedings did not fall within the scope of s 1 of the VAA. Each of three judges made observations on the meaning of the word “instituted” in s 1 of the VAA. Buckley LJ made the following observations (at 28): The verb used in the Act is “institute\". … The expression “to institute a prosecution” is, I think, an accurate one. Colloquially “to start or to launcha prosecution” might be used, but I should not expect to find those expressions in an Act of Parliament. The only other verbs which occur to me are “institute” or “initiate” or “begin”. … [emphasis added] Kennedy LJ remarked as follows (at 33): Now I have no doubt that the word \"institute\" may be found in use in statutes, legal text-books, and legal parlance, in reference to criminal as well as to civil proceedings. But when it is used [in] reference to criminal proceedings what does it denote?It denotes the commencement of the proceedings. How, in criminal proceedings, does that commencement take place? It is stated in Archbold's Criminal Pleading Evidence and Practice (24th ed.) at p. 92: “The commencement of the prosecution is the preferring of the indictment when it is sent up without a preliminary inquiry; or the laying of the information; or, it would seem,the arrest of the accused, or the application for summons or warrant in respect of the offence.” … [emphasis added] Scrutton J made the following comments (at 37): The words “legal proceedings” are, in my opinion, wide enough to cover criminal as well as civil process; “instituting legal proceedings,” however, seems to me a phrase much more appropriate to civil than to criminal process. A subject of the Kingby issuing a writ against a person within the jurisdictioninstitutes a proceeding which must proceed. … [emphasis added] Thus, inBernardBoaler, the institution of legal proceedings was defined as the starting, launching or commencement of the same. Scrutton J’s remarks indicate that he would not have considered a failed or unsuccessful attempt to commence proceedings to amount to the institution of proceedings. While Kennedy LJ may not have followed Scrutton J in equating the institution of proceedings, in the civil context, with the issuance of a writ, it seems Kennedy LJ understood the institution of legal proceedings to involve, at least, some invocation of the jurisdiction of the court: thus, his reference to “the application for summons or warrant in respect of the offence”. (While there was also reference to “the arrest of the accused”, it appears to me that Kennedy LJ was only referring to an arrest under a warrant.) For these reasons, in my judgment, a rejected filing would not have fallen within the concept of instituting legal proceedings that the judges inBernardBoalerhad in mind. 43 InIn reVernazza[1960] 1 QB 197 (“Vernazza”), the English Court of Appeal considered the meaning of the phrase “instituted … legal proceedings” in s 51 of the 1925 Act. The appellant argued that the phrase referred to “the commencement of an action by a writ or other proper procedure, and that nothing else [could] be regarded as the institution of proceedings” (at 209). The AG and his junior counsel proposed competing interpretations. Ormerod LJ described and commented on these submissions (at 209): The Attorney-General, on the other hand, submitted that the term \"instituted proceedings\" carried a very much wider construction than the construction for which [the appellant] contended. His submission was thattaking any step in an action was the institution of proceedings. [The Attorney-General’s junior counsel], in the course of his submission to the court, said that it wasa step taken which, if successful, would set in train the machinery of the court with the effect that the court would grant relief or compel the other party to take a procedural step. That, of course, putsan extremely wide constructionon the section, and would operate to bring within its ambit even a summons for directions.For my part, I am not prepared, as I have already intimated, to put so wide a construction as that on the words of this section, butI think that the words admit of a wider construction than that for which [the appellant] contends, which is that the words \"institution of proceedings\" mean nothing more than the commencement of an action by a writ. [emphasis added in italics and bold italics] Wilmer LJ made the following remarks (at 215): It seems to me thatthe construction of the section which we are invited to adopt by [the appellant] is much too narrow. At the same time, I share the view already expressed by my Lord that the alternative construction suggested to us by the Attorney-General and by [the Attorney-General’s junior counsel]is much too wide. I do not think that this is an occasion which makes it necessary to attempt the almost impossible task of drawing an exact line between that which does and that which does not amount to \"instituting\" proceedings. … [emphasis added] Pertinently, a rejected filing would have fallen under the notion of institution of proceedings proposed by the AG’s junior counsel,ie, “a step taken which, if successful, would set in train the machinery of the court …”. Ormerod and Wilmer LJJ did not accept that the institution of proceedings could be understood so broadly. Thus, it seems that they would not have held that an abortive attempt to file proceedings amounted to the institution of proceedings. 44 In summary, the aforementioned authorities suggest that a rejected filing would not amount to the institution of proceedings under the English equivalent of s 74(1) of the SCJA. The Australian authorities 45 InJones vSkyring(1992) 109 ALR 303 (“Jones”), the Registrar of the High Court of Australia sought an order that the respondent not begin any proceeding in the High Court of Australia (“the HCA”) without leave of the HCA or a Justice. The application was made pursuant to O 63 r 6 of the High Court Rules 1952 (“the HCA Rules”), which provided for a litigant to be restrained from instituting legal proceedings without the leave of the HCA or a Justice if the litigant had “frequently and without reasonable ground … instituted vexatious legal proceedings”. The respondent had on several occasions lodged documents with the Registry of the HCA, which he sought to have issued as writs: seeJonesat 306–308. On some of those occasions, a Justice of the HCA had directed the Registrar to refuse to issue proceedings until the respondent had obtained leave of a Justice, pursuant to O 58 r 4(3) of the HCA Rules, which stated as follows: 4 Sealing writs (3) If the writ, process or commission appears to a Registrar on its faceto be an abuse of the process of the Court or a frivolous or vexatious proceeding, the Registrar shallseek the direction of a Justice who may direct him to issue it or to refuse to issue it without the leave of a Justice first had and obtained by the party seeking to issue it. [emphasis added] The respondent had applied for leave to issue the writs in some cases. However, in other cases, he did not do so. Considering what had transpired, Toohey J made the following remarks (at 310): As appears from the recital of the history of Mr Skyring's involvement with the court, there have been many occasions on which a justice has given a direction pursuant to O 58, r 4(3) that the Registrar refuse to issue a writ or other process without the leave of a justice and that, on application by Mr Skyring, a justice has refused leave and some occasions when no step has been taken after such a direction.Can it be said that MrSkyring \"issued\" a writ or other process if the matter proceeded no further than a direction given under O 58, r 4(3)? Did he \"institute\" a proceeding for the purposes of O 63, r 6(1)? In my view, the answer to those questions must be no. However, there is no reason why an application to a justice made consequent upon a direction under O 58, r 4(3) should not itself be regarded as the institution of a legal proceeding.… [emphasis added] Toohey J thus held that lodging a filing that was not issued by the Registry of the HCA, pursuant to a direction under O 58 r 4(3) of the HCA Rules, would not, without more, amount to the institution of proceedings. Notably, in reaching this conclusion, Toohey J relied onReVernazza: seeJonesat 310. This fortifies my view that Ormerod and Wilmer LJJ would not have held a rejected filing to amount to the institution of proceedings (see [43] above). 46 I now come to the case ofGarrett, which the AG relied on (see [38] above). InGarrett, the AG for South Australia applied for an order to restrain a litigant from instituting proceedings without permission of the court. The application was made pursuant to s 39 of the Supreme Court Act 1935 (SA) (“the 1935 Act”), which empowers the court to make such orders if a litigant had “persistently instituted vexatious proceedings”. The AG for South Australia  submitted that a document lodged with but later rejected by the Registry, pursuant to r 53 of the Supreme Court Civil Rules 2006 (SA) (“the SA Rules”), amounted to the institution of proceedings. Rule 53 of the SA Rules provides as follows: 53—Power to reject documents submitted for filing … (2) If it appears to the Registrar that a document submitted for filing is an abuse of the process of the Court,the Registrar must refer the matter to a Judge or Master. (3)If the Judge or Master so directs, the Registrar will reject the document. … [emphasis added] Thus, r 53 of the SA Rules empowers the Registrar to refer a document that has been submitted for filing and appears to be an abuse of the process of the court to a Judge or Master; and to reject the said document if so directed. 47 After consideringJonesand another case, Layton J opined as follows (Garrettat [133]): In my view,the context in which those two cases arose are not analogous to the situation which exists in South Australiaas a consequence of the power given to the Court or a judge or master to reject a document which is sought to be filed if it contains matter that is scandalous, frivolous or vexatious, or is an abuse of the process of the Court.There is therefore a specific rule which invokes the jurisdiction of the Court before a document has been accepted for filing.This rule applies not only to cases in which leave is required to be sought before filing, but more generally to any document.Although this process isarguably administrative rather than judicial, in my view,given the very broad context and purpose of s 39, which is an endeavour to prevent a litigator from occupying the time and resources of the Court as well as the time and resources of another party, I consider that proceedings have been \"instituted\" for the purposes of s 39 when they have been lodged for the purpose of filing. [emphasis added in italics and bold italics] 48 I foundGarrettandJonesdifficult to reconcile as a matter of principle. Both r 53 of the SA Rules and O 58 r 4(3) of the HCA Rules empowered the Registrar to reject a document that was an abuse of process, upon a direction by a judicial officer. Both these rules dealt with a situation where there was an attempt to invoke the jurisdiction of the court by the submission of documents, which had not been accepted as yet by the court. The provisions were in substance very similar save that inJonesan application for leave was possible. I thus struggled to follow the reasoning that Layton J used to distinguishJonesinGarrett. It seemed that the divergent holdings inGarrettandJonesdid not stem from any difference in the provisions in question, but from different views on how broadly the word “institute” could be interpreted. 49 The AG submitted that I should followGarrettin holding that the lodging of subsequently rejected filings amounted to the institution of proceedings for the purposes of s 74(1) of the SCJA, for the following reasons: The Summary Judgment, LPA and Renewal Applications were rejected under O 92 r 3 of the Rules of Court. While this provision is administrative in nature, Layton J held inGarrettthat lodging a filing that was rejected after an “arguably administrative” process amounted to the institution of proceedings (see [47] above). Moreover, O 92 r 3 of the Rules of Court also invoked the jurisdiction of the court. Thus, the Summary Judgment, LPA and Renewal Applications fell within the scope of s 74(1). 50 However, I was not persuaded by the attempt to analogise O 92 r 3 of the Rules of Court to r 53 of the SA Rules. The two provisions serve different functions. The former provision states: Rejection of earlier documents (O. 92, r. 3) 3.—(1) The Registrar, or any officer charged with the duty of receiving and filing any document,may reject it if it does not comply with these Rules or with any practice directions issued. … [emphasis added] This is plainly more of an administrative provision than r 53 of the SA Rules. Order 92 r 3 empowers the RSC to reject any document which is non-compliant with the Rules of Court or practice directions. No assessment is undertaken as to whether the proceedings are vexatious and an abuse of process. Nor does O 92 r 3 provide for directions to be sought as to whether the submission ought to be accepted. Thus, no assessment is undertaken, whether by the RSC or by a Judge, as to whether the document in question would amount to an abuse of the process of the court. Order 92 r 3 is purely administrative. On the other hand, r 53 of the SA Rules (and O 58 r 4(3) of the HCA Rules) served to sieve out proceedings which were vexatious and an abuse of process. These provisions did not have a purely administrative function. This consideration seems to have underpinned Layton J’s ruling that the filing of documents which were rejected pursuant to r 53 of the SA Rules nonetheless amounted to the institution of proceedings for the purpose of s 39 of the 1935 Act (see his remarks at [133] inGarrett, cited at [47] above). Furthermore, a filing rejected under r 53 of the SA Rules on the basis of abuse of process would (almost always) have constituted an oppressive proceeding (if not rejected). The connection between a provision that allows rejection for non-compliance with the Rules of Court or practice directions and one that allows rejection of oppressive proceedings is tenuous. Accordingly, the argument for having regard to filings rejected under O 92 r 3 is not particularly compelling. For all these reasons, I considered that it would not be appropriate to hold that a rejected filing fell within the scope of s 74(1) of the SCJA on the basis of a direct analogy toGarrett. My decision 51 Having reviewed the English and Australian authorities, I found that the matter ultimately turned on whether the legislative purpose of s 74(1) of the SCJA warranted a broad reading of the phrase “instituted … legal proceedings” to encompass both successful and failed attempts to file proceedings. I note that the legislative purpose also guided the conclusion inGarret(see [47] above). 52 InLinda Lai, Prakash JA observed that s 74(1) of the SCJA serves three purposes. Its “principal purpose … is to prevent abuse of the process of the court”, thus ensuring that the court’s scarce resources are allocated to and utilised on meritorious disputes (at [7]). It also protects “the opposing party who faces a litany of legal proceedings brought by the vexatious litigant … diverting that party’s attention and resources away from other more worthwhile pursuits” (at [8]). Finally, it protects the vexatious litigant from himself or herself by averting him or her from persisting indefinitely in instituting legal proceedings (at [9]). 53 In my judgment, the “principal purpose” of s 74(1) of the SCJA,ie, to prevent vexatious litigants from abusing the process of the court, was material to the issue at hand. It would not advance the aim of s 74(1) to hold that attempted filings of proceedings, which were rejected by the Registry under O 92 r 3(1) of the Rules of Court, do not amount to the institution of proceedings under s 74(1). Such abortive attempts to file proceedings occupy valuable judicial resources that could be more productively employed. As the AG submitted, in the present case, the rejection of the Summary Judgment, LPA and Renewal Applications entailed the assessment and determination of the following: (a) in respect of the Summary Judgment Application, that the matter concerned bankruptcy proceedings, which the State Courts had no jurisdiction over (see [11] above); (b) in relation to the LPA Application, that it did not comply with O 7 r 3(1) and O 41 r 1(4) of the Rules of Court (see [15] above); and (c) as for the Renewal Application, that it pertained to OS 1051 which had been struck out in its entirety (see [17] above). It is thus plain that these three applications occupied judicial resources which, given their unmeritorious nature, could have been used more productively. 54 Moreover, it would advance the other aims of s 74(1),viz, to protect the opposing party and the vexatious litigant (see [52] above), to hold that unsuccessful or failed attempts to file proceedings amounted to the institution of proceedings under s 74(1). Counterparties served with vexatious documents would likely divert their attention and resources away from more worthwhile pursuits, regardless of whether the Registry rejects the documents. Further, litigants who repeatedly make attempts to file vexatious proceedings need to be protected from themselves. That holds true even if their attempts do not succeed. 55 For all these reasons, I considered that, with regard to the three purposes of s 74(1), it made no difference whether the vexatious litigant successfully filed proceedings or failed to do so because documents lodged for filing were rejected by the Registry under O 92 r 3(1) of the Rules of Court. 56 I therefore turned to consider whether it was legitimate to interpret the phrase “instituted … legal proceedings” to encompass such abortive attempts to file proceedings. In my judgment, this phrase is broad enough to allow adoption of the definition of institution of proceedings suggested by the AG’s junior counsel inVernazza,viz, “a step taken which, if successful, would set in train the machinery of the court …” (see [43] above). Admittedly, this definition might not follow from a strict reading of the word “institute” in s 74(1). However, inTee Kok Boon, Woo J departed from such a strict reading of the word “institute” in holding that s 74(1) applied to proceedings in the Court of Appeal: seeTee Kok Boonat [83]–[84] and [92]–[94]. Notably, Parliament endorsed Woo J’s interpretation of s 74(1) by giving it statutory effect in 2011, by enacting s 74(5): seeLinda Laiat [6]. This indicated to me that a broader reading of the word “institute” was in accordance with Parliamentary intention. I therefore decided to depart from the English authorities in adopting a broader reading of the word “institute”. 57 For these reasons, in my judgment, it was appropriate to adopt the concept of institution of proceedings that was proposed by the AG’s junior counsel inVernazzafor the purposes of s 74(1). A step taken which, if successful, would set in train the machinery of the court, would amount to the institution of proceedings under s 74(1). In relation to the present case, a document that was lodged for filing, but later rejected by the Registry under O 92 r 3(1) of the Rules of Court, would fall within the scope of this definition. 58 Additionally, this was not simply a case in which the litigant had tried and failed to file proceedings. Rather, the first defendant took to social media to announce that she had taken legal action or was in the midst of legal proceedings. This was especially pertinent with regard to her Facebook posts for the LPA and Renewal Applications. By purporting to effect substituted service of the LPA Application (see [23(c)] above), the first defendant gave the impression that the application had been accepted by the Supreme Court and was proceeding. A similar picture was fostered by her Facebook post on the Renewal Application, in which she offered to settle her dispute with the named defendants, which falsely implied that the dispute was still extant (see [23(d)] above). In sum, the case for a broad reading of the phrase “instituted … legal proceedings” was fortified by the first defendant’s misleading portrayal of these applications as having been successfully commenced. 59 For all the above reasons, I held that the Summary Judgment, LPA and Renewal Applications were proceedings that had been instituted for the purpose of s 74(1) of the SCJA.",
        "Application of the First Condition": "60 Having regard to the Summary Judgment, LPA and Renewal Applications, it was plain, and I found, that the first defendant had habitually and persistently instituted legal proceedings. I saw a clear pattern of conduct on her part, in repeatedly attempting to file proceedings notwithstanding that each proceeding was, in turn, struck out and dismissed or rejected by the courts (see [10] ofLinda Lai, quoted at [34] above). The first defendant had served the Purported Renewed OS, which referred to a “Special Hearing Date”, falsely stated that OS 1051 had been renewed and contained the forged signed endorsement of the RSC. This showed how far the first defendant was willing to go to institute proceedings (see [18] above). The gravity of her conduct was severe. I thus found that the First Condition had been satisfied in respect of the first defendant. 61 In relation to the second and third defendants, the position was less clear as they had only been parties to two applications,ie, OS 1051 and the Renewal Application. However, the following considerations seemed material: (a) As noted at [34] above, the Court of Appeal held inLinda Laithat the number of proceedings commenced should “not be given undue weight”, and that there is “no magic number of legal proceedings that have to have been brought” before s 74(1) of the SCJA will apply. (b) The Summary Judgment and LPA Applications were based on the same factual issues as OS 1051 (see [10] and [14] above), which the second and third defendants were parties to. (c) While the first defendant was named as the sole plaintiff in the Summary Judgment and LPA Applications, she was effectively bringing them on her parents’ behalf as they were partly based on alleged wrongs to her parents. For example, in her affidavit for the LPA Application, the first defendant raised allegations of medical malpractice involving both her mother and father. As the AG submitted, the second and third defendants had been at the very least either unwilling or unable to stop their daughter from using their names and involving them in her endeavours. For these reasons, I found that the First Condition had been satisfied in respect of the second and third defendants as well.",
        "The Second Condition": "62 I found that OS 1051 and the Summary Judgment, LPA and Renewal Applications were vexatious proceedings, for the following reasons: (a) First, I found that all these applications were brought with the intention of annoying or embarrassing the named defendants and for collateral purposes. This came within the first limb of the definition of “vexatious” in [11] ofLinda Lai(quoted at [35] above). In this regard, I noted that in dismissing OS 1051, Woo J observed that it was “an attempt by the plaintiffs to pressurise the [9 Ministers] to meet the demands of the plaintiffs and is an abuse of the process of the court”. I considered that the same was true of the Summary Judgment, LPA and Renewal Applications, which were of no merit. Amongst other reasons, there was no jurisdiction to entertain either the Summary Judgment or the Renewal Applications. In respect of the Summary Judgment Application, the State Courts have no jurisdiction over bankruptcy proceedings. In respect of the Renewal Applications, there was no basis to renew OS 1051 after it was struck out in full. The LPA Application was based on spurious allegations of misconduct by the AG and the 12 LSOs. Further, apart from the unmeritorious nature of the applications, the fact that the first defendant publicised them through Facebook (see [23] above) demonstrated that they had also been brought with the principal purpose of embarrassing the named defendants. The fact that the Purported Renewed OS was served with an affidavit and a “Proof of Loss Form” on some 60 recipients, after the Supreme Court rejected the Renewal Application (see [18] above), further underscored this point. (b) Secondly, for the reasons given in [(a)] above, I also found that the aforementioned applications were “so obviously untenable or groundless as to be utterly hopeless”. This also brought the applications within the second limb of the definition of vexatious in [11] ofLinda Lai(quoted at [35] above). (c) Thirdly, I found that the Summary Judgment, LPA and Renewal Applications were attempts to re-litigate OS 1051 which had already been finally determined by Woo J (see [12] ofLinda Lai, quoted at [35] above). Plainly, the Summary Judgment and Renewal Applications were attempts to revive OS 1051: both sought a special hearing of the same (see [10] and [16] above). The same was true of the LPA Application, which was based on the same facts as OS 1051 (see [14] above). Finally, service of the Purported Renewed OS, which bore a notation indicating that OS 1051 had been renewed and contained the alleged signed endorsement of the RSC (see [18] above), clearly revealed the defendants’ vexatious intention to re-litigate OS 1051. 63 I also found that the aforementioned applications were brought “without any reasonable ground”. There were no reasonable grounds to bring these applications, which were devoid of merit whatsoever. 64 I therefore found that the Second Condition was fulfilled.",
        "The Third Condition": "65 The AG’s written submissions did not address the Third Condition. In oral submissions, Ms Liew argued that “an opportunity of being heard” had been given to the defendants. She emphasised that three PTCs were held before the OS 334 hearing was fixed. The defendants were also directed to file affidavits and written submissions but failed to do so. It was further submitted that the defendants had every opportunity to attend the PTCs and the hearing. 66 The AG did not cite any case where an order was granted under s 74(1) of the SCJA in the defendant’s absence. It did not appear that there was any Singapore authority on the point. However, inAttorney-General vFoden[2005] EWHC 1281 (“Foden”), an order restraining the defendant from instituting or continuing civil proceedings (“Civil Proceedings Order”) was granted against the defendant in her absence. The order was made under s 42 of the Supreme Court Act 1981 (c 54) (UK) (“the 1981 Act”), which originates from s 1 of the VAA (seeEbertat 490H) and is similar in terms to s 74(1) of the SCJA. InFoden, the defendant repeatedly requested adjournments of the hearing of the application for the Civil Proceedings Order, on account of her alleged ill-health. An interim order was granted against her. Yet, notwithstanding her alleged inability to attend court, the defendant filed four applications for permission to initiate proceedings after the interim order was made (Fodenat [8]). She then applied for the hearing of the application for the final Civil Proceedings Order to be adjourned again on account of her alleged ill-health. The English High Court refused to grant an adjournment, and proceeded to grant a final Civil Proceedings Order against the defendant, in her absence, without limit of time (Fodenat [10] and [29]). 67 In view of the similarity in language between s 42 of the 1981 Act and s 74(1) of the SCJA, and their common origin in s 1 of the VAA, I concluded, on the authority ofFoden, that it is not necessary for a litigant to attend the hearing to have been given “an opportunity of being heard” under s 74(1). In addition, the following considerations led to this conclusion: (a) First, the contrary conclusion would render the phrase “giving him an opportunity of being heard” in s 74(1) superfluous. The Third Condition consists of two limbs. On the first limb, the High Court may grant an order under s 74(1) “after hearing [the litigant]”. On the second limb, an order may be made after the litigant is given “an opportunity of being heard”. Under the first limb, the litigant must attend the hearing: only then may the High Court hear him or her. If the second limb required the same, it would be otiose. Yet, an important rule of statutory construction is that “Parliament shuns tautology and does not legislate in vain; the court should therefore endeavour to give significance to every word in an enactment”:Tan Cheng Bock v Attorney-General[2017] SGCA 50 at [38]. Applying this rule, the phrase “giving him an opportunity of being heard” cannot require an actual hearing of the litigant before an order under s 74(1) is made. (b) Secondly, the contrary conclusion would stymie the purpose of s 74(1) of the SCJA. If an order under s 74(1) could not be issued unless the litigant attended the hearing of the application for the same, the litigant could avoid such an order by refusing to attend the hearing. It is inconceivable that, in enacting s 74(1), Parliament intended such an extraordinary result, which would only facilitate further vexatious abuse of the process of the courts. In this light, I conclude that the second limb was intended to allow orders under s 74(1) to be made even if the litigant did not attend the hearing of the application for the order. Of course, this is on the assumption that the litigant has been afforded the opportunity to be heard. 68 Having concluded that a litigant need not attend the hearing to have been given “an opportunity of being heard”, I found that the Third Condition was fulfilled. The primary consideration must be whether the defendants were afforded an opportunity to be heard. It seemed clear to me that they were. The defendants knew of the date, time and location of the hearing of OS 334 (see [27] above), which was only fixed after three PTCs that the defendants chose not to attend. They had received the cause papers and were well aware of the purpose of the application and the orders that were being sought. However, they did not attend the hearing. In the absence of any reasons being offered for their absence, I can only conclude that the defendants did not have sound reasons for failing to attend the hearing. Furthermore, the defendants could have stated their case in the reply affidavits and submissions that they were ordered to file. They did not do so (see [25] above). In my judgment, ample opportunity to be heard was given to the defendants. I also noted that the defendants did not attend the hearings of the striking-out applications in OS 1051. This, along with their absence at the hearings of OS 334 and the three PTCs for the same, indicated their indifference to or disregard of applications that had been taken out against them. For all these reasons, I found that the Third Condition was fulfilled.",
        "The scope of the orders": "69 I did not consider that this was that “unlikely” case where, having found that I had jurisdiction to grant orders under s 74(1) of the SCJA, I should refrain from doing so (see [37] above). The plainly vexatious conduct of the defendants, and especially that of the first defendant, warranted such orders. 70 I turned to consider the appropriate scope of the orders at three levels: (a)Protected persons: Should the orders be limited to protecting the named defendants in OS 1051 and the Summary Judgment, LPA and Renewal Applications, or should they be framed widely to prohibit proceedings against any persons? (b)Subject matter: Should the orders only restrain proceedings connected to OS 1051, or all proceedings? (c)Subjects of the order: Should there only be an order against the first defendant, or should there be orders against all the defendants? 71 Having carefully considered the matter, I decided that a wide order, at each of the aforementioned three levels, was apposite and necessary to prevent the defendants from commencing further vexatious legal proceedings. (a)Protected persons: The defendants had sought to take legal action against an expanding circle of persons who were unconnected to OS 1051,eg, the 12 LSOs. It seemed clear that this pattern of conduct would continue unabated if the order only restrained proceedings against the previously named defendants. In this regard, I noted that the original List of Debtors in April 2016 identified 1426 persons who were the defendants’ alleged debtors (see [3] above), and this number increased to some 1501 debtors in the List of Debtors attached to the first defendant’s email of 28 August 2016 (see [12] above). It seemed likely that the defendants would commence, or would attempt to commence, proceedings against: (i) some of the alleged debtors in the List of Debtors who had not been previously named as defendants; and (ii) parties not included in the most recent List of Debtors, as the List of Debtors kept expanding. In this light, I decided that the order(s) should cover all persons and not just the previously named defendants. (b)Subject matter: In OS 1051, the defendants raised a litany of complaints (see [3] above). After OS 1051 was dismissed, they then raised several distinct causes in the Summary Judgment, LPA and Renewal Applications. In my view, this trend was likely to continue to circumvent a more targeted or narrower order. I thus decided that the order(s) should cover all proceedings, and not just those connected to OS 1051. (c)Subjects of the order: I noted that the first defendant had been the primary actor behind the Summary Judgment, LPA and Renewal Applications. However, I accepted the AG’s submission that if orders were not granted to restrain the second and third defendants from commencing or continuing legal proceedings, the first defendant was likely to engage in litigation through them subsequently. This is not an improbable scenario given the second and third defendants’ inability or unwillingness to rein in the first defendant from commencing or attempting to commence proceedings on their behalf (see [61(c)] above). I thus considered that orders under s 74(1) of the SCJA should be granted against all the defendants.",
        "Conclusion": "72 For the above reasons, I granted an order in terms of the prayers sought. In the premises, I did not need to decide whether similar orders could be granted on the basis of the court’s inherent powers to prevent the abuse of its process. I raised with Ms Liew the question of whether the court had inherent powers to make orders of the wide scope described above. In this regard, Ms Liew relied onEbert. However,Ebertdoes not stand for the proposition that the court’s inherent powers extend to restraining proceedings other than the vexatious proceedings before it, and to protecting parties other than the vexed defendants before the court. If the court’s inherent powers were so broad, s 74 would seem somewhat otiose. This point is made in Michael Taggart, “Alexander Chaffers and the Genesis of the Vexatious Actions Act 1896” (2004) 63 CLJ 656–684 at p 679, where it is observed that the “unspoken assumption upon which [the VAA] rests is that, in the absence of statutory authority, the judges have no inherent jurisdiction to prevent a habitually vexatious litigant … from bringing future legal proceedings”.The position is at the very least unclear to me. As it was unnecessary for me to decide these points, I did not do so. 73 The AG did not seek costs. I accordingly made no order as to costs. Kannan RameshJudge Sivakumar Ramasamy and Elaine Liew Ling Wei (Attorney-General’s Chambers) for the plaintiff;The defendants unrepresented and absent."
    }
}