{
    "case_title": "Von Roll Asia Pte LtdvGoh Boon Gay and others",
    "ncitation": "[2017] SGHC 82",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 The present action concerns an errant individual who had acted in concert with other third parties to defraud a company for which he acted as a director. 2 The plaintiff, Von Roll Asia Pte Ltd, is a company incorporated in Singapore (“the Plaintiff”). The first defendant, Anson Goh Boon Gay (“the 1st Defendant”) was at the material time employed by the Plaintiff as the Regional Head of Sales for Asia. 3 There are four other defendants: (a) Semi-Solution Inc (Asia) Pte Ltd, a company incorporated in Singapore (“the 2nd Defendant”); (b) Semi-Solution Inc (Singapore) Pte Ltd, a company incorporated in Singapore (“the 3rd Defendant”); (c) Semi-Solution Inc Trading (Shanghai) Co Ltd, a company incorporated in Shanghai (“the 4th Defendant”); (d) Jason Lim Keng Huat (“the 5th Defendant”), who was previously a director of the 2nd Defendant and presently remains as the director of the 3rd and 4th Defendants. Collectively, all five defendants will be referred to as “the conspirators”. The 2nd to 4th Defendants will be referred to as “the SSI group”. 4 Presently before me, only the claims against the 1st and 3rd Defendants (“the Defendants”) remain because default judgment has already been entered in favour of the Plaintiff against the 2nd, 4th and 5th Defendants. Since the trial has been bifurcated,1Foot Note 1×Plaintiff’s Letter to Court dated 23 March 2017 at para 9 and NE, Day 4, pp 20–22.this Judgment will only deal with the issue of liability.",
        "Background to the present dispute": "5 I start by outlining the undisputed facts. The Plaintiff is in the business of providing products, services and systems for power generation, insulation, transmission and distribution. The Plaintiff employs agents and distributors to source for and secure new customers in markets that the Plaintiff has yet to establish a presence in. In 2005, the Plaintiff engaged Faxolif Industries Pte Ltd (“Faxolif”) as one of its main distributors through a written agreement for Faxolif’s services. 6 Until the 1st Defendant’s dismissal on 9 May 2011, he was employed by the Plaintiff as its Regional Head of Sales for Asia under a contract of employment dated 16 November 2007 (“the Employment Agreement”).2Foot Note 2×1st Defendant’s AEIC dated 19 February 2013, p 29. 7 Just three months after his employment, the 1st Defendant terminated the Plaintiff’s distribution agreement with Faxolif. He then appointed We Corp Pte Ltd (“Wecorp”) as a distributor of the Plaintiff on 3 March 2008.3Foot Note 3×PBOD, vol 5, p 920.This appointment was made by the 1st Defendant even prior to Wecorp’s incorporation4Foot Note 4×PBOD, vol 4, p 764.and without review by the Plaintiff’s legal department.5Foot Note 5×NE, Day 4, pp 102–103.Subsequently, Wecorp’s services were terminated in September 2008 and replaced with that of the 2nd Defendant. The Plaintiff’s main point of contact in Wecorp, one Nick Ong, also moved over to the 2nd Defendant. The 5th Defendant controlled the 2nd Defendant and the rest of the SSI group. 8 Between 30 September 2009 and 8 May 2011, there were numerous instances of diversions of both current and prospective clients of the Plaintiff to the SSI group.6Foot Note 6×See references at Plaintiff’s Closing Submissions at para 32.In addition, even though the Plaintiff had its own customer service and sales teams, the 1st Defendant caused the Plaintiff to pay commissions to the companies comprising the SSI group for customers that had been diverted to them for their management.7Foot Note 7×NE, Day 4, pp 105–106.",
        "The Plaintiff’s case": "9 In the present proceedings, the Plaintiff claims that: (a) The conspirators unlawfully conspired to cause loss to the Plaintiff through an agreement for the SSI group to be enriched by diverting to the SSI group both the Plaintiff’s existing and prospective clients, as well as by defrauding the Plaintiff through the procurement of various commissions and payments to the SSI group (“the Conspiracy Claim”). (b) The 1st Defendant breached his fiduciary duties owed to the Plaintiff (quadirector) by channelling the Plaintiff’s customers to the SSI group and paying commissions to the SSI group for the management of these customers, by making secret profits and by failing to disclose conflicts of interest (“the Breach of Directors’ Duties Claim”). (c) The 3rd Defendant dishonestly assisted the 1st Defendant in breaching his fiduciary duties owed to the Plaintiff and is thus liable to account for the losses suffered by the Plaintiff or the profits made from its dishonest assistance. 10 The Plaintiff also initially claimed in its Statement of Claim that the conspirators breached the obligation of confidence by exploiting the confidential information gained by the 1st Defendant from being a director of the Plaintiff.8Foot Note 8×Plaintiff’s Statement of Claim dated 19 January 2012 at paras 9–20.This claim is however not pursued in the Plaintiff’s closing submissions.",
        "The Defendants’ case": "11 In response to the Conspiracy Claim, the Defendants assert that there was no agreement to unlawfully injure the Plaintiff and that the 1st Defendant had no financial interest in the success of the SSI group. 12 In relation to the Breach of Directors’ Duties Claim, the 1st Defendant argues that all his actions in respect of the Plaintiff were carried out in the best interest of the Plaintiff. Even if the 1st Defendant did breach his fiduciary duties owed to the Plaintiff, the Defendants argue that the 3rd Defendant is nonetheless not liable for dishonest assistance as it was not dishonest.",
        "Issues arising for determination": "13 The main factual question that I have to determine in relation to the Conspiracy Claim is whether there was an agreement to unlawfully conspire amongst the conspirators to cause loss to the Plaintiff. If there was such an agreement, I then have to determine what actions were taken by the Defendants together with the other conspirators (ie, the 2nd, 4th and 5th Defendants) in furtherance of this agreement. 14 The following issues arise for determination in relation to the Breach of Directors’ Duties Claim: (a) Whether the 1st Defendant had breached his duties to act honestly and/or with reasonable diligence in dealing with the affairs of the Plaintiff; (b) Whether the 1st Defendant had made improper use of his position as an officer of the Plaintiff; (c) Whether the 1st Defendant had failed to disclose any conflicts of interest to the Plaintiff and abused his position to make a secret profit; and (d) Whether the 3rd Defendant had dishonestly assisted in the 1st Defendant’s breach of his fiduciary duties owed to the Plaintiff and if so, whether the 3rd Defendant can be made to account for its profits.",
        "The Conspiracy Claim": "15 I commence the analysis by briefly setting out the law on conspiracy by unlawful means before discussing whether the Conspiracy Claim is made out on the facts.",
        "The law": "16 The law on the tort of conspiracy by unlawful means is clear. The leading authority is the Court of Appeal decision inEFT Holdings, Inc and another v Marinteknik Shipbuilders (S) Pte Ltd[2014] 1 SLR 860 (“EFT Holdings”), which was also recently affirmed by the Court of Appeal inSimgoodPte Ltd v MLC Barging Pte Ltd and others[2016] SGCA 46 (“Simgood”) at [13]. To establish this tort, the Plaintiff must show that (EFT Holdingsat [112]): (a)     there was a combination of two or more persons to do certain acts; (b)     the alleged conspirators had the intention to cause damage or injury to the plaintiff by those acts; (c)     the acts were unlawful; (d)     the acts were be performed in furtherance of the agreement; and (e)     the plaintiff suffered loss as a result of the conspiracy. 17 At [101], the Court of Appeal inEFT Holdingsexplained that in an action for a tort of conspiracy by unlawful means, a claimant “would have to show that the unlawful means and the conspiracy were targeted or directed at the claimant” and that “[i]t is not sufficient that harm to the claimant would be a likely, or probable or even inevitable consequence of the defendant’s conduct.” The Court of Appeal made clear that the loss to the claimant must have been “intended as a means to an end or as an end in itself.” 18 Broadly speaking, the parties are largely in agreement on the law relating to conspiracy, save on three issues. In respect of these three issues, it is beyond doubt that the Plaintiff’s position is more consistent with the current legal position. 19 First, the Defendants argue that there is a higher standard of proof, above that of a balance of probabilities in an action for conspiracy.9Foot Note 9×Defendants’ Closing Submissions at para 44.This is plainly erroneous. Even though the nature of the allegations involved means that “the amount of proof required is higher than that required in a normal civil action”, the standard of proof is still the civil standard based on the balance of probabilities:Swiss Butchery Pte Ltd v Huber Ernstand others and another suit[2010] 3 SLR 813 (“Swiss Butchery”) at [17], affirmingWu Yang Construction Group Ltd v ZhejiangJinyi Group Co, Ltd and others[2006] 4 SLR(R) 451 at [93]. 20 Second, the Defendants argue that the Plaintiff has to show a “predominant purpose” on the part of the conspirators to injure the Plaintiff.10Foot Note 10×Defendants’ Closing Submissions at para 52.This argument clearly misunderstands the true nature of the Plaintiff’s claim, which is based on the tort of conspiracy byunlawfulmeans and notlawfulmeans. This fundamental misunderstanding is evident from the Defendants’ reliance on authorities which relate to the latter.11Foot Note 11×Defendants’ Closing Submissions at paras 51–52.As seen from the Court of Appeal decision ofQuahKay Tee v Ong and Co Pte Ltd[1996] 3 SLR(R) 637 at [45], in an action for conspiracy bylawfulmeans where no unlawful act is involved, there is however an additional requirement of a “predominant purpose” to cause loss to the plaintiff: The tort of conspiracy comprises two types: conspiracy by unlawful means and conspiracy by lawful means. A conspiracy by unlawful means is constituted when two or more persons combine to commit an unlawful act with the intention of injuring or damaging the plaintiff, and the act is carried out and the intention achieved. In a conspiracy by lawful means, there need not be an unlawful act committed by the conspirators. But there is the additional requirement of proving a “predominant purpose” by all the conspirators to cause injury or damage to the plaintiff, and the act is carried out and the purpose achieved. Similar pronouncements were also made in the High Court decisions ofSwiss Butcheryat [13] andNagase Singapore Pte Ltd vChing Kai Huat[2008] 1 SLR(R) 80 at [23]. 21 Third, the Defendants argue that the tort of conspiracy is “outmoded” and thus should not be accepted as a valid cause of action.12Foot Note 12×Defendants’ Closing Submissions at para 51.This argument similarly stems from a misunderstanding of the nature of the present action. The Plaintiff’s claim is based on the tort of conspiracy byunlawfulmeans, not conspiracy bylawfulmeans. The decision ofPanatronPte Ltd v Lee Cheow Lee[2000] SGHC 209 relied on by the Defendants only suggested that the tort of conspiracy bylawfulmeans may be outmoded (at [85]). Lai Kew Chai J did not, in that case, doubt the tort of conspiracy byunlawfulmeans. The Defendants’ reliance is therefore misplaced. 22 As for the tort of conspiracy byunlawfulmeans, the Court of Appeal considered the question inEFT Holdingsat [90] but decided not to rule on the point: A preliminary question is whether unlawful means conspiracy continues to have any relevance in our law as a basis of civil liability. Should we continue to recognise its existence, as well as that of lawful means conspiracy? We do not propose to answer that question in this appeal as it was not argued, but a future case might well present the opportunity for this to be carefully considered. 23 Nonetheless, the Court of Appeal in the subsequent case ofSimgoodimplicitly acknowledged the existence of the tort of unlawful means conspiracy by applying the elements laid down inEFT Holdingsto determine whether the tort had been established on the facts of that case (seeSimgoodat [14]–[19]). Given the present state of affairs, it appears that the tort of unlawful means conspiracy still exists within our law. Before me, no credible arguments questioning the existence of the tort were made. I therefore defer to the apex court’s position inEFT HoldingsandSimgoodaccepting that the tort of unlawful means conspiracy continues to exist in our law. 24 To recapitulate, on the present facts, the key question is whether the Defendants had intended to cause loss to the Plaintiff when they acted pursuant to their conspiracy agreement. This requires a consideration of two issues: first, whether there was an agreement to unlawfully conspire to cause loss to the Plaintiff; and if so, what actions were taken by the conspirators in furtherance of this agreement. I turn to consider the first issue.",
        "Issue 1: Conspiracy to injure the Plaintiff": "25 The Plaintiff has to show that the conspiracy and the unlawful means employed pursuant to that conspiracy were intended specifically to cause loss to the Plaintiff. A conspiracy usually takes the form of an agreement (and in appropriate cases, may even include a sufficiently clear arrangement or understanding) of some kind reached by the alleged conspirators on how they should act together to cause loss to the claimant. The existence of a conspiracy can be inferred from the circumstances and the acts of the conspirators. 26 The Plaintiff’s case is essentially that there was an agreement amongst the conspirators to enrich the SSI group at the expense of the Plaintiff by divesting the Plaintiff of both its existing and prospective clients as well as by defrauding the Plaintiff through the procurement of various commissions and payments to the SSI group (“the conspiracy agreement”). The Defendants’ case denies the existence of this agreement. 27 I find on a balance of probabilities that such an agreement existed. In my view, the existence of this agreement can be inferred from two sets of evidence: (a) The first set shows the 1st Defendant’s undue preferential treatment of the SSI group as compared to other agents and distributors. (b) The second set shows the particularly close financial relationship of the conspirators. Undue preferential treatment 28 In order to appreciate the extent of preferential treatment in this case, it is important to first understand the role of agents and distributors in the Plaintiff’s business (“Third Party Agents”). As explained by the Plaintiff’s witnesses, these Third Party Agents are employed specifically to source, secure and managenewcustomers in markets that the Plaintiff has yet to establish a presence in. Hence, it would make no commercial sense for the Plaintiff to divert itsownexistingandprospectivecustomers to a Third Party Agent; this entirely undermines the purpose of appointing such agents in the first place.13Foot Note 13×NE, Day 2, pp 38–41. 29 However, this was exactly what happened during the employment of the 1st Defendant. There is substantial evidence that he diverted both current and prospective clients of the Plaintiff to the SSI group.14Foot Note 14×NE, Day 3, p 66 and see references at Plaintiff’s Closing Submissions at para 32.This point was also not contested by the Defendants at trial. Instead, the Defendants only attempt tojustifythese diversions on the following three bases, none of which is backed up by any reliable evidence: (a) First, these customers had specifically requested to deal through the SSI group instead of the Plaintiff. However, the Plaintiff’s first witness, Mr Huang Wei (“Mr Huang”) – who was employed by the 1st Defendant on behalf of the Plaintiff and held the position of Head of Sales for China – testified during cross-examination that no customers had specifically requested as such.15Foot Note 15×NE, Day 1, p 44.Moreover, the Defendants fail to adduce any evidence of such requests despite promising to do so at trial.16Foot Note 16×NE, Day 1, p 44. (b) Second, the diversions were necessary in order to ease problems resulting from a shortage of staff at the Plaintiff’s end.17Foot Note 17×NE, Day 4, p 27.Similarly, no evidence is adduced to prove the alleged inadequacy in staffing. (c) Third, these diversions were a part of a business strategy aimed at optimising processes within the Plaintiff to enable growth.18Foot Note 18×NE, Day 3, p 3.In making this argument, the Defendants rely on a set of presentations where it was stated that customers offering lower sales would be transferred to the management of Third Party Agents.19Foot Note 19×1st Defendant’s AEIC dated 19 February 2013, pp 197–225.Again, the Defendants do not adduce any evidence confirming that these presentations were either accepted by the Plaintiff’s higher management or that this was the predominant practice of managers on the ground. In fact, there is evidence to the contrary: the Plaintiff’s second witness, Ms Goh Siew Hoon (“Ms Goh”) – the finance and human resources manager for the Plaintiff – explained that these presentations were nothing more than proposals that had been discussed but were never implemented or approved.20Foot Note 20×NE, Day 3, p 3. 30 In addition to these diversions, the Plaintiff also adduces evidence that the 1st Defendant provided the SSI group with extended credit terms that were not offered to any of the Plaintiff’s other customers or distributors.21Foot Note 21×PBOD, vol 1, p 300 (see also references at Plaintiff’s Closing Submissions at para 40).No contrary evidence is produced by the Defendants. 31 Lastly, the Plaintiff highlights that on the 1st Defendant’s instruction, the SSI group enjoyed lower cost prices compared to other distributors of the Plaintiff.22Foot Note 22×See references at Plaintiff’s Closing Submissions at para 41.In response, the Defendants argue (again without adducing any evidence) that the cost prices appear lower because they have not been adjusted and normalised to Cost, Insurance and Freight (“CIF”) rates. However, two of the Plaintiff’s witnesses, Ms Goh and Mr Huang, explained that the rates had in fact been normalised, by cross referencing the various invoices of the products sold by the Plaintiff (“the invoices”).23Foot Note 23×NE, Day 4, pp 9–11.On a consideration of the evidence, I agree that the prices were in fact normalised to CIF, especially since the Defendants do not point to any invoices where the prices had not been normalised. 32 The Defendants also argue that the invoices have not taken into account the higher costs of airfreight which certain customers may demand on short notice and therefore the invoices are not an accurate reflection of the true cost price. This argument is again unsubstantiated by any evidence. In fact, it is entirely contradicted by the evidence: the invoices reflect “Ex-factory” rates (instead of CIF),24Foot Note 24×NE, Day 4, pp 12–17.which are independent of any cash considerations for shipment. Thus, any extra payments required owing to shipment considerations would not have increased the prices in the invoices sent to the other distributors. The evidence thus establishes that the SSI group had benefitted from prices lower than that offered to other distributors of the Plaintiff. 33 On a consideration of the evidence concerning the diversions, extended credit terms and lower cost prices, I find that the 1st Defendant conspired with the other four defendants to cause loss to the Plaintiff by giving undue preferential treatment to the SSI group. Close relationship among the conspirators 34 In addition to this undue preferential treatment, the Plaintiff submits that the existence of the conspiracy agreement can be inferred from the particularly close financial relationship among the conspirators. The mutual financial benefit arising from that relationship is the motivating factor and the driving force behind their conspiracy. 35 The Plaintiff argues that the 1st Defendant was part of the set-up of the SSI group and was entitled to or was receiving monies from them. In support of this argument, the Plaintiff relies on the unmistakable similarity between the internal emails of the SSI group and those sent by the 1st Defendant to the Plaintiff. At trial, these emails were systematically compared in Ms Goh’s re-examination.25Foot Note 25×NE, Day 2, pp 16–21 and NE, Day 3, pp 48–54.In particular, Ms Goh analysed a set of SSI group’s internal emails (originating from the email address admin@ssiasia.com.sg) discussing the breakage of a mirror item and the email author’s subsequent claim for insurance on that item.26Foot Note 26×PBOD, vol 1, pp 228–230.She then compared that set of emails with a second set, comprising emails sent by the 1st Defendant (using his email account associated with the Plaintiff) to the Plaintiff’s claims department for the exact same item.27Foot Note 27×PBOD, vol 1, p 248.The above comparison reveals that in both these sets of emails, the description of the mirror item, the date on which it was broken and the manner in which it had been broken were worded very similarly. It is clear to me from this evidence that the 1st Defendant was in fact corresponding from the email address admin@ssiasia.com.sg and was also operating under the alias “Henry” when corresponding from this email address in internal emails of the SSI group and in emails to the Plaintiff. 36 This is made all the more clear on a consideration of Mr Huang’s testimony on the identity of “Henry” in the email correspondence. Mr Huang testified that he had been informed by the 5th Defendant to refer to the 1st Defendant by the alias “Henry” when communicating through email:28Foot Note 28×NE, Day 4, pp 77–79. Ct: Now before I forget, there’s one question I want to ask him. You know, you were corresponding through email and you meant---there was a Henry, right? Who is this Henry? A: I think that’s [the 1st Defendant]. Ct:  What do you mean you think? You are corresponding with the person. A: Yes. Ct: You don’t know that person? A: Henry or Harry? Ct: H-E-N-R-Y. A:Yes, the1st defendant. Ct: How do you know Henry? … A: ... I think mostly 2009, we have a lot of occasions, dinner, karaoke, bar, talk together with … the 5th defendant, the 1st defendant. The 5th defendant told me, Henry, the boss, … email because he’s not---not, er, convenient to use the name, er, his true name. So they use a---Harry, er, for---for the name---the name of Harry for email communication or verbal communication; we call Harry. Ct: Harry or--- A: Henry, Hen--- Ct: H-E-N-R-Y? A: Yes. Ct: And that … name is to be used when communicating with him under what email? A:  I think, er, inSSI email---SSI internal email or sometime the email with---with Von Rolls, very few case. I think there are---there were few case. He may email to Von Roll. There---there were Henry, er, er, appeared but mostly within SSI internal email, Henry will be there in the email. Ct: It won’t be Jason. It won’t be--- A: Anson. Ct: Anson? A: Yes. Ct:  Who told you to---who told you as in “not convenient”? You said it was the 5th defendant, Lim. A: Yes, yes. Ct: Jason Lim told you to use--- A: Yes. Ct: ---Henry. A: Yes. [emphasis added] 37 Importantly, the Plaintiff points to a particular email from the 5th Defendant which indicated that he (ie, the 5th Defendant) was due to make payments to “Henry” for his contributions (ie, the 1st Defendant’s contributions) to the SSI group, thereby providing the motivating factor behind the undue preferential treatment shown by the 1st Defendant to the SSI group.29Foot Note 29×PBOD, vol 1, p 263. 38 However, the 5th Defendant testified on behalf of the Defendants in re-examination that the person referred to as “Henry” within the internal SSI correspondence was in fact one Goh Boon Eng, the 1st Defendant’s brother:30Foot Note 30×NE, Day 4, p 140. Q:  Who is Henry, Mr Lim? A: Anson’s brother. … A: I’ve---I think in my evidence, I’ve written affi---affidavit for Goh Boon Eng, yah, saying that he’s Henry. 39 I note that no such written affidavit from the 1st Defendant’s brother was produced to support this assertion that he was in fact “Henry”. Neither was the 1st Defendant’s brother called to testify that he was the “Henry” referred to in the emails. It is also strikingly telling that the 1st Defendant himself did not even testify or give evidence that “Henry” was his brother. 40 Thus, in light of Mr Huang’s evidence above at [36], which I accept, I find that the alias “Henry” was in fact used by the 1st Defendant. The fact that the 1st Defendant was using the internal email system of the SSI group demonstrates that the 1st Defendant must have been intimately involved in or closely linked in some way with the SSI group. 41 If however it is true that “Henry” was in fact the 1st Defendant’s brother, this admission opens up a new can of worms in relation to the duty of disclosure owed to the Plaintiff by the 1st Defendant as a director of the Plaintiff (see below at [92]). 42 Nonetheless, even if I accept that “Henry” is 1st Defendant’s brother Goh Boon Eng and is also the person behind the email account admin@ssiasia.com.sg, I am of the view that he was no more than a conduit through which the 1st Defendant received monies from the SSI group. I am fortified in this conclusion by an examination of Goh Boon Eng’s employment contract with the 2nd Defendant.31Foot Note 31×5th Defendant’s AEIC dated 22 February 2013, pp 70–71.This contract is highly unusual, being a skeletal document containing no clauses relating to his job scope, entitlements or termination. The only detail it contains is the amount of fees payable which, incidentally, matches the same percentage and amounts that were to be given to the SSI group as commission for taking over the management of the Plaintiff’s original clients (ie, 4% of the sales revenue of each customer).32Foot Note 32×NE, Day 4, p 106. 43 In view of the points made above in relation to the undue preferential treatment as well as the close relationship of the conspirators, it is clear to me that there was an agreement among the conspirators to cause loss to the Plaintiff. The Plaintiff’s financial interests were totally disregarded and sacrificed when they used the Plaintiff as a means to nurture and grow the SSI group for the financial benefit of, ultimately, the 1st and 5th Defendants.",
        "Issue 2: Actions taken by the Defendants to further their conspiracy": "44 I turn now to the second disputed issue as to whether any actions were carried out by the Defendants together with the other three defendants in furtherance of their conspiracy to injure the Plaintiff. 45 The Plaintiff groups the actions taken by the Defendants into four broad categories – (1) preparatory steps; (2) diversion of clients and profits from onward sales; (3) commissions; and (4) other acts. Preparatory steps (1) Termination of Faxolif’s services 46 The Plaintiff submits that the preparatory steps began with the termination of Faxolif’s services. Since 2005, the Plaintiff had maintained Faxolif as one of its main distributors through a written agreement for their services (“agreement with Faxolif”). However, within three months of the 1st Defendant’s employment, this agreement with Faxolif was terminated (see [5]–[7] above). The Plaintiff argues that this termination was done by the 1st Defendant without any valid reasons, especially because there had been no problems in the working relationship between the Plaintiff and Faxolif. In fact, there were upcoming plans for the year of 2008.33Foot Note 33×PBOD, vol 4, pp 800–801; PBOD, vol 5, pp 961–962 and NE, Day 4, pp 53–58.The Plaintiff thus postulates that the termination was done in order to create a vacancy within the Plaintiff’s distributor ranks that the SSI group would be able to fill.34Foot Note 34×Plaintiff’s Closing Submissions at para 53. 47 In response, the Defendants submit three alternative reasons to justify the termination of the agreement with Faxolif. I do not find these reasons convincing and agree with the Plaintiff’s submission that the termination of Faxolif’s services was a preparatory step in furtherance of the conspiracy agreement. 48 First, the Defendants claim that there was evidence that the agreement with Faxolif had expired by 31 December 2007 and, as a result, the 1st Defendant was justified in terminating the agreement with Faxolif.35Foot Note 35×Defendants’ Closing Submissions at paras 28–30 and NE, Day 3, pp 7–8.Presumably, the Defendants are referring to Clause 10.1 of the agreement with Faxolif. However, on a reading of Clause 10.1, it is clear that the Plaintiff’s argument is untenable. The relevant clause reads as follows:36Foot Note 36×PBOD, vol 5, p 935. This agreement enters into force on the date first above written and shall remain in full force and effect for anindeterminate period of time. Itcan be terminatedby either party upon three (3) months’ written notice to the end of every calendar year, at the earliest, however, on December 31st 2007. [emphasis added] The reference to an “indeterminate period of time” militates against the interpretation that the agreement with Faxolif had expired by the end of 2007. The only sensible meaning to be given to the specified date of 31 December 2007 is that it is the earliest possible date on which the contract can be terminated; it does not in any way mandate that the contract automatically expires on 31 December 2007. Such an interpretation is also consistent with the testimonies of Ms Goh and Mr Richard Ho (“Mr Ho”), the technical support manager of the Plaintiff, where they explained that the agreement with Faxolif would be automatically renewed so long as neither party openly elects to terminate it.37Foot Note 37×NE, Day 3, pp 8–9 and NE, Day 4, p 59. 49 Second, the Defendants argue that the agreement with Faxolif was terminated because Faxolif had stocked and sold products of the Plaintiff’s competitors, relying on the same set of presentations referred to at [29(c)] above as evidence.38Foot Note 38×1st Defendant’s AEIC dated 19 February 2013, pp 34, 137.While this argument appears compelling at first blush, it must be seen in the light of the fact that the Plaintiff was fully aware (evenpriorto Faxolif’s appointment as a distributor of the Plaintiff in 2005) that Faxolif carried competitors’ brands. This was explained in Ms Goh’s AEIC to be of “no real conflict of interest” as the function of the competitors’ products carried by Faxolif was different from that of the Plaintiff’s products.39Foot Note 39×Ms Goh’s AEIC dated 16 March 2016 at para 39.In fact, Faxolif had given a presentation to the Plaintiff’s board in January 2008, wherein the complete list of Faxolif’s other customers was listed.40Foot Note 40×PBOD, vol 7, pp 1712–1719.Given thispriorknowledge of Faxolif’s business, it is hardly likely that the Plaintiff wouldabruptlyterminate Faxolif’s services for the sole reason that Faxolif stocks competitors’ products. This is especially since it makes no commercial sense to replace Faxolif with Wecorp, a company that was a complete newcomer to the industry. 50 Third, the Defendants attempt to refute the Plaintiff’s submission that Faxolif had been abruptly terminated without notice by pointing out that the 1st Defendant had indeed given clear instructions, by way of an email to one Ray Ng, the then-Managing Director of the Plaintiff, to terminate Faxolif’s services. This argument qualifies the abruptness in termination but does not address the nub of the Plaintiff’s submission that the termination of Faxolif’s services without a good reason was in fact a preparatory step in the conspiracy. I need not make a finding as to whether the termination was abrupt in order to find that the termination of the agreement with Faxolif was the formative act in the scheme of the conspiracy. 51 Seen in totality, I find that the agreement with Faxolif was terminated by the 1st Defendant in order to pave the way for the SSI group to be appointed as a distributor of the Plaintiff. (2) Establishing systems of control within the Plaintiff 52 I also agree with the Plaintiff’s submission that the 1st Defendant had established systems for his direct and tight control within the Plaintiff as part of the preparatory steps in the conspiracy.41Foot Note 41×Plaintiff’s Closing Submissions at paras 65–67.The control he wielded was so extensive that he implemented a system of protocols which requiredallmajor decisions in respect of sales and pricing to be approved by him.42Foot Note 42×PBOD, vol 1, p 151. 53 The Plaintiff also submits that the 1st Defendant had systemically replaced previous employees of the Plaintiff with inexperienced employees who were well-acquainted with the 1st Defendant.43Foot Note 43×Ms Goh’s AEIC dated 16 March 2016 at paras 36–37 and Mr Ho’s AEIC dated 23 March 2016 at paras 25–26.The Defendants neither contest the evidence of the new appointments made by the 1st Defendant nor challenge the relationship between the new employees and the 1st Defendant. Instead, the Defendants argue that the employees appointed by the 1st Defendant were experienced and capable.44Foot Note 44×Defendants’ Closing Submissions at paras 30–31.For the purposes of the present dispute, it is unnecessary for me to decide whether these employees were qualified for their respective roles as the mere fact that the 1st Defendant had employed people who were close to him allows me to draw the inference that this was part of his scheme to cement his control within the Plaintiff. It is also very telling that the 1st Defendant had gone to the extent of creating entirely new positions and appointments in the Plaintiff to ensure that these individuals could be weaved into the Plaintiff’s hierarchy of staff.45Foot Note 45×NE, Day 4, pp 67–68. Diversion of clients 54 Continuing from the preparatory steps, the Plaintiff submits and I agree that the 1st Defendant diverted both current and prospective clients of the Plaintiff to the 2nd, 3rd and 4th Defendants.46Foot Note 46×Plaintiff’s Closing Submissions at paras 68–73.As stated above at [29], this was a point that was unchallenged by the Defendants at trial.47Foot Note 47×NE, Day 3, p 66; PBOD, vol 4, p 759 and Plaintiff’s Closing Submissions at para 32. 55 It is the Plaintiff’s further submission that the diversion of clients furthered the conspiracy agreement because these diversions greatly benefitted the SSI group. I agree with this submission and find that the SSI group had much to gain financially from the conspiracy agreement. This is especially because the SSI group were newcomers to the industry. As argued by the Plaintiff, the conspirators intended to benefit the SSI group in two key ways. First, the conspiracy agreement enabled the SSI group to pocket the amounts the Plaintiff would otherwise have made had the clients dealt directly with the Plaintiff. This profit was also greatly maximised by virtue of the fact that the SSI group was given undue preferential treatment and enjoyed lower prices vis-à-vis other distributors (see above at [31]–[32] above). Second, the conspiracy agreement also provided the SSI group (which started with very few customers of its own) with a vast array of customers which it otherwise would not have had. If the SSI group had not been given this leg up by the 1st Defendant, it would probably have taken several years to develop its customer base to the same extent. 56 In the circumstances, I also find that that the SSI group was heavily or even solely reliant on the Plaintiff for its business. As admitted by the 5th Defendant in his affidavit, the SSI group faced difficulties in finding its own revenue streams and clients after the Plaintiff terminated the distribution agreements with the SSI group in 2011.48Foot Note 48×5th Defendant’s AEIC dated 22 February 2013 at para 30.This incidentally also raises the question as to why the Plaintiff would have seen a need to engage the SSI group as distributors in the first place when they do not even appear to be capable of sourcing customers for themselves, let alone capable of helping the Plaintiff source fornewcustomers. 57 Due to the close relationship among the conspirators, I find that the 1st and 5th Defendants would in turn benefit from the financial success of the SSI group, which was brought about at the Plaintiff’s expense through the diversion of its current and prospective clients to the SSI group pursuant to the conspiracy agreement. Commissions 58 The Plaintiff also submits that the Plaintiff was made to pay commissions to the SSI group in furtherance of the conspiracy agreement.49Foot Note 49×Plaintiff’s Closing Submissions at paras 74–77.It is unchallenged evidence that the SSI group was remunerated at a rate of 4% of the sales revenue from customers that were handed over by the Plaintiff for  management by the SSI group (“the 4% management fee”).50Foot Note 50×NE, Day 4, p 106. 59 The 4% management fee does not make commercial sense because prior to the appointment of the 1st Defendant as director, the Plaintiff had always dealt with the management of its customers through its own customer service and sales personnel regardless of the size of the potential sale.51Foot Note 51×NE, Day 2, p 40.This essentially means that the SSI group was being paid to do the exactsamework that the Plaintiff’s customer service and sales personnel could have handled in-house at no additional cost to the Plaintiff. There is also no evidence to show that the Plaintiff’s customer service and sales department was so understaffed that this work had to be farmed out to the SSI group at a cost of 4% of the total sales revenue. 60 Thus, I agree with the Plaintiff’s submission that these commissions were yet another stream of additional funding devised pursuant to the conspiracy agreement to enrich the conspirators at the expense of the Plaintiff. Other acts of the Defendants 61 In addition to the above, the Plaintiff refers to two further acts undertaken by two or more of the conspirators pursuant to the conspiracy agreement, which caused it to suffer losses. I will now discuss each in turn and explain how they furthered the conspiracy agreement in my view. (1) Sale of imitation goods 62 The Plaintiff claims that the SSI group had copied the formulae of the Plaintiff’s chemical products to make imitation chemical products and sold these in containers.52Foot Note 52×Plaintiff’s Closing Submissions at paras 92–95.During the course of trial, it came to light that the conspirators had obtained the formulae of the Plaintiff’s chemical products through the 1st Defendant’s appointment of a chemical mixing company, Trinity Chemical, a company partially held by the 4th Defendant.53Foot Note 53×PBOD, vol 1, p 182.Ms Goh explained during re-examination that the usual business practice would have been to appoint a mixer that was not involved, or owned by a company that was involved, in the same industry as the Plaintiff in order to reduce the risk of such an entity counterfeiting the Plaintiff’s chemical products and subsequently using these products to compete with the Plaintiff.54Foot Note 54×NE, Day 3, p 77. 63 The Plaintiff submits that the SSI group had reproduced the Plaintiff’s chemical products, packaged them in containers it had purchased on its own, and placed SSI labels on these containers before selling them off and making a profit. The Plaintiff produced photographs of these chemical containers, taken during its investigations at the premises of the SSI group in Shanghai where the containers were stored. These photographs revealed how the containers were labelled. In his cross-examination, Mr Huang explained that if the particular chemical products shown in these photographs had in fact been produced by the French subsidiary of the Plaintiff, the terms “SSI” or “CH” would not appear on the container labels.55Foot Note 55×NE, Day 4, pp 85–88.The use of these terms on the labels strongly suggests that the products within had been produced by the SSI group, in China. Separately, internal correspondence of the SSI group also shows that the 5th Defendant had directed and given instructions as to how these imitation chemical products should be packaged and labelled.56Foot Note 56×PBOD, vol 2, pp 435–437, 452 and 461 and PBOD, vol 5, pp 989–991. 64 The Defendants simply allege that the evidence relating to the imitation goods is weak, asserting a lack of certainty in Mr Huang’s testimony.57Foot Note 57×Defendants’ Reply Submissions at paras 11–12A.However, I do not find any such uncertainty in Mr Huang’s testimony. On the contrary, he was able to unequivocally explain why the formulation for the mixture of the goods was most likely copied from the Plaintiff and used to produce the imitation goods:58Foot Note 58×NE, Day 4, pp 85–88. Ct: You see, this photograph— A: Yah. Ct: Von Roll Shanghai Co Ltd is stated there on the drum. For this product, Demisol 3030-2CH. Are you familiar with this product and where is the sales, which factory manufactures it or which company manufactures it? A: Okay. Er, yes. I know there are product made in Von Roll France. The name is like so-called Demisol 3030-2. Ct: Made in France? A: Made in France but here, I think the label is, er, somebody else. I believe it’s, er, defendant…. They print it out by themselves. Because you see the figures, they are at CH. The 30 last two characters are “CH”. Ct: “CH” stands for what? A: I think it’s stand for China. Because for Von Roll, we 1 have---we do have the, er, part number of 3030-2. But we never have 3030-2CH. CH is--- Ct: If he’s from China, how---if he’s from France how do they---how do they us---label the product? Demisol 3030-2? That’s all? A: That’s it. That’s it. Ct: No CH? A: No CH. Here not. Even here not, no. Ct: Okay. Does---is Von Roll Shanghai authorised to produce this product, Demisol 3030-2? A: Not at all. Ct: How do you know? … A: I’m involved in---in the whole---whole project. The liquid proj--- Ct: You have never made this? You have---Von Roll Shanghai Co Ltd under you never makes this? A: Never. Ct: Are you surprised to see this? A: Yes. … Ct: Okay. What about the next photograph? Ah, you see the next photograph. You see Semi-Solution Inc, also on a---with a CH there. 3030-2CH. A: Yes, also. I see now. Ct: Ah. Can---wu---you want to say anything about this? A: I---from these two pictures, I---my understanding is, like, er---my understanding of the whole scenario, I think, er, initially, we are sell---er, we von---er, Von Roll is selling these, er, made in France 3030-2 product to customer. But later on somehow defendant 2 to 5, somehow---somehow they said---they told the customer, “Okay, we will make it sold in China. So we add the CH, add the Chinese version, but still under Von Roll name.” The people---the customer somehow, er, maybe accept. But later on, since, er, I think they---maybe they want to make more---how to say? They are have a purpose, say, maybe un---sell under SSI name, so they---gradually, they say---they change Von Roll name to SSI name, but still use the same part number. I think, er, maybe insider people---customer insider people and they, I think, I---together work out this, er, scenario. Otherwise, I don’t think they can change so easily from Von Roll name to Semi-Solution name. Yes, that is---that is my understanding. 65 I thus find that the Defendants had copied the formulae of some of the Plaintiff’s chemical products and profited from the sale of these imitation products. This was certainly another string in the bow as part of the conspiracy agreement between the conspirators to cause loss to the Plaintiff. Selling imitation products of the Plaintiff would no doubt cause loss to the Plaintiff by unjustly depriving the Plaintiff of profits that would otherwise have accrued to it had its own genuine products been sold to these customers instead. (2) Rent of excessive warehouse space 66 Last but certainly not the least in the series of acts committed by the conspirators, the Plaintiff was made to pay monthly rentals for warehousing services in Shanghai, China to cater to one of the Plaintiff’s customers in China that had required this service.59Foot Note 59×Plaintiff’s Closing Submissions at paras 90–91 and Plaintiff’s Reply Submissions at para 43.This warehouse space was rented by the SSI group and then sub-let to the Plaintiff as the sub-tenant.60Foot Note 60×NE, Day 3, p 27.In support, the Plaintiff adduces evidence of monthly invoices issued by the 3rd Defendant to the Plaintiff, for the period of June 2009 to July 2011.61Foot Note 61×PBOD, vol 3, pp 652–677.Each of these invoices shows unequivocally that the Plaintiff had been billed by the 3rd Defendant for a space amounting to 300 square metres at a monthly rental rate of RMB45,000.62Foot Note 62×PBOD, vol 3, pp 652–677. 67 However, this rented warehouse space far exceeded the estimated space required to cater to that sole customer (ie, 66 square metres).63Foot Note 63×NE, Day 3, p 38.Ms Goh gave evidence that only one customer in China required warehousing services; the majority of the Plaintiff’s other customers’ orders were done through drop shipment arrangements.64Foot Note 64×NE, Day 3, p 27.Drop shipment arrangement is a supply chain management system under which the Plaintiff would provide its customers’ orders and shipment details to the entity making or supplying the goods so as to allow that entity to ship the goods directly to the Plaintiff’s customers. The Plaintiff would thus avoid having to warehouse these goods in stock. Ms Goh testified that the rented space was unnecessary to cater to only one client.65Foot Note 65×NE, Day 3, pp 32–38.I then asked the Defendants to explain why renting such a large space was necessary. However, they failed to offer any such explanation, despite promising to do so at trial.66Foot Note 66×NE, Day 3, p 39. 68 There is also evidence in the form of an email sent by the 5th Defendant to the 1st Defendant and one Dennis Chia, who was the Plaintiff’s Head of Sales for China, wherein it was expressed that the Plaintiff required only “29.724096” square metres.67Foot Note 67×PBOD, vol 4, p 823.Thus, it is not open for the conspirators to claim that they were unaware of the warehouse space actually required by the Plaintiff. 69 In the absence of a credible explanation from the Defendants, I fail to understand how it would have been necessary or even reasonable for the Defendants to cause the Plaintiff to rent a space several times larger than that required by the Plaintiff. Given the control the 1st Defendant wielded over the Plaintiff’s management decisions during that time (see above at [52]–[53]), I draw the adverse inference that the 1st Defendant caused the Plaintiff to rent far more warehouse space in China than that actually required by the Plaintiff so that there would be spare warehousing space made available, likely for the SSI group’s own use, and again at the Plaintiff’s expense. 70 In sum, I find that the preparatory steps, diversion of clients, commissions paid, sale of imitation goods as well as the rent of the excessive warehouse space were actions taken in furtherance of the conspiracy agreement to cause loss to the Plaintiff. 71 Even though the Defendants do not specifically contest the issue of the unlawfulness of these acts, for completeness, I shall briefly give my views on this element in relation to a claim in unlawful means conspiracy. I find all of these acts to be unlawful either in tort or criminal law. As further discussed below at [83]–[87], the preparatory steps, diversion of clients, payment of commissions and sale of imitation goods were all acts in breach of the 1st Defendant’s duty to act honestly in the discharge of his duties under s 157(1) of the Companies Act (Cap 50, 2006 Rev Ed) (“the CA”), which is a criminal offence as provided under s 157(3) of the CA. The manufacturing of imitation chemical products for sale using confidential technical information belonging to the Plaintiff could also potentially be an infringement under the tort of breach of confidence. The warehouse space was rented property of the Plaintiff’s and entrusted to the 1st Defendant in his capacity as director to use for the Plaintiff’s purposes. If the 1st Defendant had allowed unused warehouse space to be used by the SSI group free of charge, and if SSI did in fact do so, then this could constitute a case of criminal breach of trust as defined under s 405 of the Penal Code (Cap 224, 2008 Rev Ed). It may also be a breach of the 1st Defendant’s duty to act honestly in the discharge of his duties under s 157(1) of the CA since he acted in a conspiracy with the others and caused the Plaintiff to enter into such a sub-lease with the SSI group. 72 For the above reasons, I find that the Plaintiff has proved its case of unlawful means conspiracy against the Defendants and I thus allow the Conspiracy Claim. This now brings me to the discussion on the losses suffered by the Plaintiff.",
        "Losses suffered by the Plaintiff": "73 At the outset, I would like to clarify that the aim of this section is only to establish in principle which heads of losses the Plaintiff is entitled to. Thereafter, the quantum of losses under the respective heads of losses are to be assessed at a separate hearing before the Registrar. As such, I reject the Defendants’ argument that the Plaintiff has to prove its exact quantum of loss at trial since the trial has been bifurcated.68Foot Note 68×Defendants’ Reply Submissions at para 12A. 74 The Plaintiff argues that its losses can be classified into four main categories: (a) loss from multiple diversions of the Plaintiff’s current and prospective customers to the SSI group; (b) loss from commissions paid to the SSI group; (c) loss from payment for warehousing facilities that the Plaintiff did not require; and (d) loss of profit arising from the sale of imitation goods. 75 I find that the Plaintiff is entitled to all four heads of losses, with the quantum to be assessed separately. 76 The first head concerns the loss of profit arising from the multiple diversions of the Plaintiff’s current and prospective customers to the SSI group.69Foot Note 69×Plaintiff’s Closing Submissions at paras 81–85.In response, the Defendants argue that there was no loss to the Plaintiff because the Plaintiff’s volume of sales had in fact increased during the period of the 1st Defendant’s employment.70Foot Note 70×Defendants’ Closing Submissions at paras 41–42.This argument stems from a misunderstanding of the nature of the damages sought. In a claim for loss of profit, it is entirely unnecessary to consider the financial position of the victim: doing so would conflate two separate inquiries and thus be fundamentally flawed. The Plaintiff’s contention is not that the conspiracy agreement had caused its absolute volume of sales to decline, but that the Defendants’ actions resulted in a loss ofprofitsthe Plaintiff could have made from an even higher absolute volume of sales at the prices sold by the SSI group, had some of the Plaintiff’s clients not been diverted to the SSI group. I thus allow the Plaintiff’s claim for this loss. 77 The second head concerns the commissions that the Plaintiff was made to pay to the SSI group.71Foot Note 71×Plaintiff’s Closing Submissions at paras 86–89.These commissions were irrational as the Plaintiff was essentially made to pay the 4% management fee in respect of itsexistingcustomers that had been diverted to the SSI group to manage (see above at [59]). This caused financial loss to the Plaintiff. The Defendants failed to provide any credible explanation as to why these commissions had to be paid. I thus allow the Plaintiff’s claim for this loss. 78 The third head concerns losses from the rental of excessive warehouse space. Given that the Plaintiff had been made to pay for a much larger space than it actually required, I find the rental paid for the warehousing space to be another loss suffered by the Plaintiff pursuant to the conspiracy agreement and find that the Plaintiff should be compensated for all losses in connection with the rental of the space not needed by the Plaintiff. 79 The last head of loss under the Conspiracy Claim is that arising from the sale of imitation goods by the SSI group.72Foot Note 72×Plaintiff’s Closing Submissions at para 95.However, the Defendants raise the inability of the Plaintiff to prove their exact loss of profit.73Foot Note 73×Defendants’ Reply Submissions at para 12A.As explained above at [73], it is unnecessary for the Plaintiff to prove its loss at this stage of the action. I thus find that this is another loss caused by the Defendants pursuant to the conspiracy agreement to benefit themselves at the Plaintiff’s expense (see above at [65]). Accordingly, I allow the Plaintiff’s claim for this loss. 80 For the avoidance of doubt, in respect of each head of loss, I allow the Plaintiff to elect whether to claim damages or an account of profits.",
        "The Breach of Directors’ Duties Claim": "81 In the alternative to the Conspiracy Claim, the Plaintiff also submits that the 1st Defendant has breached his directors’ duties owed to the Plaintiff. This claim is only brought against the 1st Defendant. In this regard, the Plaintiff claims that the 1st Defendant breached three distinct duties: (a) The duty to act honestly and with reasonable diligence in the discharge of his duties as a director of the Plaintiff; (b) The duty not to make improper use of his position as an officer of the company; and (c) The duty to disclose all conflicts of interest to the Plaintiff’s board of directors. 82 It is undisputed that the 1st Defendant owed the Plaintiff fiduciary duties as a director of the latter. The question to be determined is whether the 1st Defendant breached any of these duties. The 1st Defendant does not make any relevant submissions in relation to this claim other than that the Breach of Directors’ Duties Claim should similarly fail if the Conspiracy Claim fails.74Foot Note 74×Defendants’ Closing Submissions at para 54.I take this to mean that the 1st Defendant is only contesting the facts and not the relevant legal principles on which the Plaintiff relies.",
        "Acting dishonestly or without reasonable diligence": "83 The first duty allegedly breached is that of the duty to “at all times act honestly and use reasonable diligence in the discharge of the duties of his office”, as contained in s 157(1) of the CA.75Foot Note 75×Plaintiff’s Closing Submissions at paras 100–107. 84 InIntracoLtd v Multi-Pak Singapore Pte Ltd[1994] 3 SLR(R) 1064, the Court of Appeal (at [28]–[29]) enunciated an objective test for the purposes of s 157(1) of the CA. The question is whether an “honest and intelligent man in the position of the directors, taking an objective view, could reasonably have concluded that the transactions were in the interests of [the company].” In applying this test, where the transaction is “not objectively in the company’s interest”, the court may draw an inference that the directors were not acting honestly:Ho Kang Pengv Scintronix Corp Ltd (formerly known as TTL Holdings Ltd)[2014] 3 SLR 329 (“Ho Kang Peng”) at [38]. Further, the Court of Appeal inHo Kang Pengreferred to the High Court decision ofVita Health Laboratories Pte Ltdand others v Pang Seng Meng[2004] 4 SLR(R) 162 (at [17] and [19]) and remarked at [39] that “the requirement ofbona fideor honesty will not be satisfied if the director acteddishonestly even if for the purported aim of maximising profits for the company” (emphasis in original). It is thus no defence for a director to claim that his actions were, in his view, in the best interest of the company if he is found to have acted dishonestly. 85 Applying these principles to the facts of this case, it is clear beyond a balance of probabilities that the 1st Defendant had acted dishonestly, especially in view of my finding above that he was a party to the conspiracy to injure the Plaintiff and in so doing, to also benefit himself and his co-conspirators. In fact, based on the evidence before me, I take the view that the 1st Defendant played a major role in the conspiracy. Without the 1st Defendant orchestrating the unlawful acts within the Plaintiff, not only as its director, but also as its Regional Head of Sales for Asia, I do not believe that the other conspirators could have succeeded in injuring and causing loss to the Plaintiff. 86 I am unable to see how a director participating in such a conspiracy to harm the Plaintiff can ever be said to have acted honestly in the discharge of his duties as a director. Accordingly, I find that the abrupt termination of Faxolif’s services, the appointment of Wecorp, the SSI group, and Trinity Chemical (thereby facilitating the production of imitation goods), the rental of the warehouse space in China, the diversion of customers as well as the commissions paid to the SSI group were all actions that were clearly not in the interest of the Plaintiff. Insofar as the 1st Defendant was responsible for effecting or making the decisions on behalf of the Plaintiff to enable those actions to be carried out, he had clearly acted in breach of his duties as a director of the Plaintiff. 87 The 1st Defendant would therefore be statutorily liable to the Plaintiff under s 157(3)(a) of the CA for any profit made by him or for any damage suffered by the Plaintiff as a result of his failure to act honestly in the discharge of his duties to the Plaintiff as a director.",
        "Making improper use of his position as an officer of the company": "88 The second duty the Plaintiff asserts has been breached is contained in s 157(2) of the CA:76Foot Note 76×Plaintiff’s Closing Submissions at paras 108–111. An officer or agent of a company shall not make improper use of his position as an officer or agent of the company or any information acquired by virtue of his position as an officer or agent of the company to gain, directly or indirectly, an advantage for himself or for any other person or to cause detriment to the company. 89 Where a person uses his position as an officer of the company to make a decision or carry out an act that is dishonest, it is highly likely that the court will consider the officer to have made improper use of his position to do so. Given my finding above at [86] that the 1st Defendant had acted dishonestly, I find that the 1st Defendant did make improper use of his position in the Plaintiff either as a director and/or as the Regional Head of Sales for Asia to effect an abrupt termination of Faxolif’s services, the appointment of Wecorp, the SSI group, and Trinity Chemical (thereby facilitating the production of imitation goods), the rental of the warehouse space in China, the diversion of customers as well as the commissions paid to the SSI group. 90 The only question remaining is whether by making improper use of his position, the 1st Defendant directly or indirectly derived any “advantage for himself or for any other person” or caused “detriment to the company”. In view of my findings above in relation to the Conspiracy Claim, there is sufficient evidence to prove on a balance of probabilities that the 1st Defendant had not only obtained an advantage for himself as well as the other four defendants, but also caused detriment to the Plaintiff. Thus in my view, s 157(2) of the CA has been breached. 91 Again, pursuant to s 157(3)(a) of the CA, the 1st Defendant is statutorily liable to the Plaintiff for any profit made by him or for any damage suffered by the Plaintiff on account of his breach of s 157(2).",
        "Non-disclosure of director’s interest in related transactions": "92  The final duty that the Plaintiff relies on is the duty of disclosure contained in s 156(1) of the CA: Subject to this section, every director or chief executive officer of a company who is in any way, whether directly or indirectly, interested in a transaction or proposed transaction with the company shall as soon as is practicable after the relevant facts have come to his knowledge ─ (a) declare the nature of his interest at a meeting of the directors of the company; or (b) send a written notice to the company containing details on the nature, character and extent of his interest in the transaction or proposed transaction with the company. 93 As I have found (at [34]–[39] above), the 1st Defendant had a financial interest in the success of the SSI group, which was involved in numerous commercial transactions with the Plaintiff. This financial interest may have been sufficient for the 1st Defendant to come under an obligation to disclose the same to the Plaintiff and his failure to do so may constitute a breach of s 156(2) of the CA. However, this is a matter that pertains to the 1st Defendant’s potential liability for a criminal offence under s 156(15) of the CA. Unlike s 157, there is nothing within s 156 which imposes any statutory liability on the 1st Defendant for any profit made by him or damage suffered by the Plaintiff as a result of his breach of s 156(2) by failing to disclose his financial interest in the SSI group. 94 In any event, there remains liability at common law for the breach of this duty of disclosure. However, in view of my conclusions on the other claims made by the Plaintiff, it will be duplicitous to consider in detail the remedies that follow from this breach.",
        "Secret profit": "95 The Plaintiff also submits that the 1st Defendant made a secret profit in a transaction involving the Plaintiff and one of its agents (“the kickback”).77Foot Note 77× 96 By way of background, Bombardier ChangZhou Power (“Bombardier”) is one of the Plaintiff’s customers. The Plaintiff supplies Bombardier with kapton-covered wires. Sometime in 2010, Bombardier ceased to do business with the Plaintiff. The 1st Defendant then tasked Mr Huang to appoint an agent to recover the business with Bombardier and also expressed his ability to pay a commission to the agent who could successfully revive the business relationship between the Plaintiff and Bombardier. Subsequently, Mr Huang introduced one Mr Dai, who had a good relationship with the top management of Bombardier. Mr Dai then successfully assisted in regaining Bombardier as a customer for the Plaintiff. 97 In his cross-examination, Mr Huang explained that the Plaintiff’s normal policy is to pay a 5% commission to its agents. However, Mr Huang confirmed that in relation to Mr Dai, the 1st Defendant deviated from this policy. The 1st Defendant used his power, in his position as a director of the Plaintiff, to award 8% commission, envisioning that the additional 3%was to be split between himself and Mr Huang.78Foot Note 78×NE, Day 1, p 51. 98 Mr Huang also testified that it is the normal practice in China for an agent to pay 20% of his commission to the government, presumably as tax on the commission earned. Thus, Mr Dai should have had to pay 1% of the commission fee (ie, 20% of the 5% commission) to the Chinese government and would be allowed to keep the remaining 4%. However, this was not what transpired. Despite only receiving 5% of the commission, Mr Dai had to pay 20% of theactualcommission fee of 8% (ie, 1.6% of the commission fee) to the Chinese government. That being the case, Mr Dai could only keep 3.4%. Eventually, Mr Huang explained that he only collected 1.5% of the commission fee from Mr Dai for the 1st Defendant, but did not take his own share of 1.5%. This meant that Mr Dai was able to keep 4.9% of the commission fee (ie, 3.4% + 1.5%).79Foot Note 79×NE, Day 1, pp 51–56.In other words, the 8% commission was paid out as follows: Mr Dai 4.9%; 1st Defendant 1.5%; Chinese government 1.6% with Mr Huang receiving nothing. 99 The key question is whether the 1st Defendant did receive the kickback of 1.5%. Most material to this question is Mr Huang’s evidence that he had physically passed the kickback from Mr Dai to the 1st Defendant:80Foot Note 80×NE, Day 1, pp 80–81. A: Only thing I did--- … A: ---is take this 1.5% cash and pass--- Ct: You mean who--- A: ---to--- Ct: ---gives you this cash? A: Er, Mr Dai. Ct: Mr Dai every time gives you cash? A: Yes. Ct: 1.5%? A: Yes. Ct: Does he make you sign anything? A: No, no, no. Mm. Ct:  When you hand the cash to your boss, did you make him sign anything? A: No. Also no. Ct: Also no? Okay. A: No, (indistinct). Ct: Okay. So you go to your brother-in-law’s house to collect the cash? A: My---Changzhou is my hometown. Ct: What? A: The---Bombadier---the place Bombadier located is my hometown so I go back, er, once in a while. So--- Ct: So then? A: So, er, the Von Roll pay them the mon---money. Then I go there not purposely. Like, it---this is in the new year time. You see, the time. Ct: Oh, homecoming? A: Yah, homecoming, I take the money. Then immediately after we resume work after Chinese New Year, the 1st defendant came to Shanghai, I pass to him. 100 Mr Huang went on to testify that he had passed the money containing RMB50,000 to the 1st Defendant in an unsealed envelope.81Foot Note 81×NE, Day 1, pp 81–83.I note that this entire set of oral evidence by Mr Huang, as well as his evidence in Mr Huang's AEIC,82Foot Note 82×Mr Huang’s AEIC dated 17 March 2016 at para 9.had not been contested by the 1st Defendant during the trial. Specifically, counsel for the Defendants did not cross-examine Mr Huang in respect of the actual physical transfer of the envelope containing the kickback to the 1st Defendant. Rather, counsel for the Defendants put to Mr Huang that his sister had been involved in the entire arrangement and subsequently only contested the quantum of the kickback in the Defendants’ closing submissions. However, neither of these points go towards refuting the fact that the 1st Defendant received a kickback and was in effect personally and secretly profiting from the commission paid out to an agent by the Plaintiff. In my view, the 1st Defendant abused his position as a director and an officer of the Plaintiff to cause the Plaintiff to pay out a commission to its agent that was higher than the norm so as to secretly profit from that inflated commission via a kickback to himself. 101 Even on the point of quantum, I have no reason to doubt Mr Huang’s testimony that the kickback was valued at RMB50,000 as this represented the 1.5% commission that he handed over to the 1st Defendant.83Foot Note 83×NE, Day 1, p 84. 102 Accordingly, I find that the 1st Defendant did receive the kickback from Mr Huang. This is a clear breach of the 1st Defendant’s fiduciary duty not to use his fiduciary position to make a secret profit. It is uncontroversial that a director cannot do so (see,eg,Industrial Development Consultants Ltd v Cooley[1972] 1 WLR 443 andRegal(Hastings) Ltd v Gulliver[1967] 2 AC 134 (“Regal Hastings”)). This “no profit” rule has been applied in Singapore in several High Court decisions such asHiggins,Danial Patrick v Mulacek, Philippe Emanuel and others and another suit[2016] 5 SLR 848 (“Higgins”) at [96] andHytechBuilders Pte Ltd v Tan Eng Leong[1995] 1 SLR(R) 576 at [58]–[59]. It is irrelevant that the company itself could not have obtained that profit or no loss is caused to the company by the director’s gain of the profit (seeHigginsat [96], citingRegal Hastingsat 144–145). 103 For these reasons, I allow the Plaintiff’s claim against the 1st Defendant for an account of profits in respect of the kickback.",
        "Dishonest assistance": "104 Additionally, the Plaintiff submits that the 3rd Defendant is liable for dishonest assistance rendered in relation to the 1st Defendant’s breach of fiduciary duties.84Foot Note 84×Plaintiff’s Closing Submissions at paras 179–183. 105 The following elements must be satisfied for a claim in dishonest assistance to succeed (seeGeorge RaymondZage III v Ho Chi Kwong[2010] 2 SLR 589 (“George Raymond”) at [20] for the analogous elements in relation to dishonest assistance rendered by a third party towards a breach of trust): (a) the presence of a fiduciary duty owed to the plaintiff; (b) a breach of that duty; (c) assistance rendered by the third party towards the breach; and (d) such assistance was rendered dishonestly. 106 Since I have found that the 1st Defendant had breached his fiduciary duties owed to the Plaintiff, the first two elements are readily satisfied. 107 In view of my finding in the Conspiracy Claim that the 3rd Defendant is a co-conspirator together with the rest of the defendants, I also have no hesitation in concluding that the 3rd Defendant (controlled by the 5th Defendant) had rendered assistance in relation to the 1st Defendant’s breach of fiduciary duties, specifically in relation to the abrupt termination of Faxolif’s services, the appointment of Wecorp, the SSI group, and Trinity Chemical (thereby facilitating the production of imitation goods), the rental of the warehouse space in China, the diversion of customers as well as the commissions paid to the SSI group. I am excluding the breach of fiduciary duty in relation to the kickback (see above at [95]–[102]) from this analysis as that appears to have been singlehandedly committed by the 1st Defendant without any assistance from the other defendants. 108 On the final element of dishonesty, the Court of Appeal inGeorge Raymondat [22] clarified that the standard of what constitutes honest conduct is an objective one, entailing an inquiry as to whether the defendant had “such knowledge of the irregular shortcomings of the transaction that ordinary honest people would consider it to be a breach of standards of honest conduct if he failed to adequately query them” (see alsoBarlowClowes International Ltd (in liquidation v Eurotrust International Ltd[2006] 1 All ER 377 at [15]). 109 I find that the 5th Defendant, who was a co-conspirator, undoubtedly had such dishonest knowledge when assisting the 1st Defendant as part of the conspiracy. He did not merely passively benefit from the conspiracy. He controlled the SSI group and actively engaged and dealt with the Plaintiff’s clients that had been transferred to the SSI group. Given that the 5th Defendant was the controlling director of the SSI group at the material time and thus the directing mind and will of these companies, his knowledge can be imputed to the three companies comprising the SSI group (seeParakouShipping Pte Ltd (in liquidation) v Liu Cheng Chan[2017] SGHC 15 (“ParakouShipping”) at [147], citingBilta(UK) Ltd (in liquidation) v Nazir (No 2)[2015] 2 WLR 1168). Accordingly, I find that the 3rd Defendant’s assistance is dishonest. 110 Given that all the elements for a claim in dishonest assistance are satisfied, I find that the 3rd Defendant is liable for dishonestly assisting the 1st Defendant in the breach of his directors’ duties to the Plaintiff. Accordingly, I grant the Plaintiff’s claim for losses against the 3rd Defendant arising from its dishonest assistance. Account of profits as a remedy 111  In the alternative to its claim for losses, the Plaintiff claims the remedy of account of profits against the 3rd Defendant.85Foot Note 85×Plaintiff’s Statement of Claim dated 19 January 2012 at para 31(c) and Plaintiff’s Closing Submissions at para 183. 112 This claim raises the legal question as to whether an account of profits can be ordered as a remedy against a dishonest assistant, even where no corresponding loss has been suffered by the victim. Other than the decision ofParakouShippingwhich tangentially discussed this issue at [189], there does not appear to be any local decision on this point to date. 113 Thus examining the English position, the Court of Appeal inNovoship(UK) Limited v YuriNikitin[2015] 1 QB 499 (“Novoship”) decided this question in the affirmative at [93] and in so doing confirmed a string of first-instance authorities deciding likewise. Longmore LJ, writing for the court, gave several justifications for the position. First, the basic starting premise of the analysis is that “both a liability to make good a loss and a liability to account for profits ‘follow from the premise that the defendant is held liable to account as if he were truly a trustee to the claimant’” (at [75], citing John McGhee QC,Snell’s Equity(Sweet & Maxwell, 32nd Ed, 2010) at para 30-079). Second, this position is supported by a series of English cases which equated, in principle, the responsibilities of a knowing recipient or dishonest assistant with that of an express trustee (at [82]). Third, permitting liability to account to follow from a claim in dishonest assistance, in an appropriate case, would ensure the prophylactic function of the equitable principles governing the liability of one who dishonestly assisted in a breach of fiduciary duty (at [76]–[77]). Fourth, the Court of Appeal observed at [84] that, since equity has long recognised the inadequacy of damages as the appropriate remedy in some situations, … [w]here, as here, the equitable wrong is itself linked with a breach of fiduciary duty we see no reason why a court of equity should not be able to order the wrongdoer todisgorge his profits in so far as they are derived from the wrongdoing. [emphasis added] 114 I am of the view that such logic should apply equally in Singapore. Although this issue has yet to arise squarely for consideration, both the Court of Appeal and High Court have observed that a dishonest assistant’s liability is as “a constructive trustee” (seeGeorge Raymondat [19] and [29] andParakouShippingat [188]). This observation dovetails with the starting premise identified by Longmore LJ inNovoship. I also agree that to distinguish between the nature of remedies that exist against a primary fiduciary in breach and a dishonest assistant who aided that breach would compromise the prophylactic nature of accessory liability. 115 In any event, such alternative liability to account is not unduly harsh to the dishonest assistant as it is more restricted than the remedy of account available against a fiduciary, who is primarily liable. As is made clear inNovoship, unlike a fiduciary’s liability to account which “does not depend on any notion of causation” (at [96]), a dishonest assistant will only be liable to account for profits gained as a result of a “sufficiently direct causal link” to its assistance (at [120]). It is also discussed inNovoshipat [119] that this remedy is not “automatic” as against the dishonest assistant: We consider that where a claim for an account of profits is made against one who is not a fiduciary, and does not owe fiduciary duties then, as Lord Nicholls said inBlake, the court has a discretion to grant or withhold the remedy. We therefore agree with Toulson J inFyffesthat the ordering of an account in a non-fiduciary case is not automatic. One ground on which the court may withhold the remedy is that an account of profits would be disproportionate in relation to the particular form and extent of wrongdoing … 116 The 3rd Defendant profited in the form of commissions as well as from the diversion of the Plaintiff’s clients to it, effected by the 1st Defendant whilst he was a director of the Plaintiff. It is beyond doubt that these profits bear a sufficiently direct causal link with the 3rd Defendant’s misconduct in assisting the 1st Defendant to breach his fiduciary duties. In fact, the 3rd Defendant was one of the corporate vehicles through which the breaches of fiduciary duties were committed. I also see no reason to exercise my discretion to withhold the remedy of account of profits as against the 3rd Defendant. 117 I fully appreciate that there may be difficulties in delineating the precise contours of a dishonest assistant’s liability to account. For instance, whether the primary fiduciary in breach and the dishonest assistant share joint and several liability not only for the beneficiary’s loss but also for their gains (see,eg, Pauline Ridge, “Justifying the Remedies for Dishonest Assistance” [2008] 124 LQR 445 at p 457). Nevertheless, I am of the view that these difficulties are not of a nature as to defeat the validity of the general rule. Although a claim in dishonest assistance isusuallyassociated with joint and several liability in respect of thelossessuffered by the plaintiff, it seems to me that in an appropriate case, the dishonest assistant should be made liable to account, at least in respect of theprofitsmade by him. If such an alternative remedy were denied, it would allow the dishonest assistant to enjoy an unjustified windfall, particularly where the loss suffered by the victim is insignificant compared to the profits made by the dishonest assistant. Such a conclusion would be a perverse one as the dishonest assistant would stand to gain despite having acted dishonestly in rendering assistance to the fiduciary’s breach of his duty. 118 Therefore, on the facts of this case, I find that the 3rd Defendant, as the dishonest assistant, is liable to account to the Plaintiff for profits it made pursuant to its dishonest assistance. However, as to the question of whether the 3rd Defendant is also jointly and severally liable for the 1st Defendant’s profits, I need not decide this question as the Plaintiff has not asked for the 3rd Defendant to be made so liable in respect of the 1st Defendant’s profits. 119 I accordingly allow, in the alternative to its claim for losses, the Plaintiff’s claim against the 3rd Defendant for an account of profits. The Plaintiff is to elect between the two aforementioned remedies. For the avoidance of doubt, the 3rd Defendant is only liable to account for its own profits with no order made on any joint and several liability for any profits made by the 1st Defendant with the 3rd Defendant’s assistance.",
        "Conclusion": "120 For the reasons mentioned above, I find that the Plaintiff’s Conspiracy Claim succeeds. Accordingly, I allow the Plaintiff’s claim for damages or account of profits against the Defendants arising from the Conspiracy Claim. 121 I find that the 1st Defendant is also in breach of his fiduciary duties owed to the Plaintiff and is thus liable to account for any profit made by him or for any damage suffered by the Plaintiff resulting from the breach of his fiduciary duties. 122 I also find that the 3rd Defendant dishonestly assisted the 1st Defendant in breaching his fiduciary duties. It is thus liable for any damages arising from such dishonest assistance. In the alternative, the 3rd Defendant is liable to account for any profit made by it in relation to its dishonest assistance. 123 In addition, I also allow the Plaintiff’s claim against the 1st Defendant for an account of profits in relation to the kickback. 124 I further order the assessment of damages and/or account of profits to be heard by the Registrar. 125 I will hear the parties on costs if there is no agreement. Chan Seng OnnJudge Godwin Gilbert Campos and Chan Qing Rui, Bryan (Godwin Campos LLC) for the Plaintiff;Gopalan Raman (KhattarWong LLP) for the Defendants."
    }
}