{
    "case_title": "Keeping Mark John vPublic Prosecutor",
    "ncitation": "[2017] SGHC 170",
    "coram": "Chao Hick Tin JA",
    "sections": {
        "Introduction": "1 The appellant, Keeping Mark John (“the Appellant”), pleaded guilty before a district judge (“the DJ”) to a single charge of abetment of cheating by personation under s 419 read with s 109 of the Penal Code (Cap 224, 2008 Rev Ed) (“the PC”). This is an offence that may be punished with a fine, or with up to five years’ imprisonment, or with both. The Appellant was sentenced to 12 months’ imprisonment by the DJ, whose grounds of decision can be found atPublic Prosecutor v Keeping Mark John[2016] SGDC 344 (“the GD”). The Appellant appealed against the DJ’s decision. 2 On appeal, the Prosecution argued before me that a term of 12 months’ imprisonment was appropriate for the Appellant, and was also a “fair starting point” for an offence under s 419 of the PC (a “s 419 offence”) committed pursuant to a scheme by a syndicate to smuggle a person into or out of Singapore by air.1Foot Note 1×Prosecution’s submissions (“PS”) at para 34. 3 At this juncture, I would like just to touch briefly on a matter of terminology. It seems to me that the term “starting point” may not be entirely appropriate, and that the term “benchmark sentence” may well be preferable. As the Court of Appeal recently explained inNg KeanMeng Terence v Public Prosecutor[2017] SGCA 37, which had yet to be issued at the time this appeal was heard, the starting point approach “calls for the identification of a notional starting point which will then be adjusted taking into account the aggravating and mitigating factors in the case” (at [27]). It is generally used for regulatory offences (at [28]). The benchmark approach, on the other hand, “calls for the identification of an archetypal case (or a series of archetypal cases) and the sentence which should be imposed in respect of such a case” (at [31]). It is “particularly suited for offences which overwhelmingly manifest in a particular way or where a particular variant or manner of offending is extremely common and is therefore singled out for special attention” (at [32]). In the present case, what I was addressing was a sentencing guideline for s 419 offences committed in the context of people smuggling by syndicates, whether transnational or local. Given this degree of specificity, it seems to me that “benchmark sentence” would be the more appropriate term. 4 On the substance of the Prosecution’s arguments, having regard to the relevant precedents, I disagreed that the benchmark sentence for a s 419 offence should be 12 months’ imprisonment. Instead, in my view, the benchmark sentence ought to be four to six months’ imprisonment. Accordingly, I found the sentence imposed on the Appellant manifestly excessive. Given that the Appellant had, by the date of the hearing before me, effectively served a nine-month imprisonment sentence, taking into account remission, I held that he could be released forthwith. As the Appellant indicated that he was amenable to being released only “tomorrow morning” as opposed to on the same afternoon that the appeal was heard, I ordered his release on the morning of the following day,viz, 16 March 2017. I now set out the grounds for my decision.",
        "The facts": "5 The background to this case was set out in detail by the DJ at [5]–[13] and [25]–[30] of the GD. As the facts were undisputed, I will only give a brief summary of the material facts, which are as follows. 6 The Appellant is a 45-year-old British national. He was recruited by a people smuggling syndicate to assist in facilitating the illegal entry of their customers into another country. The customer in the present case was one Vigneshwararaja Kajanan (“Kajanan”), a Sri Lankan national. Kajanan had paid the syndicate to facilitate his entry (and migration) to Auckland, New Zealand. The Appellant’s role in the scheme was to check in for a flight to Auckland which had been booked in his own name. After having done so and having received his boarding pass, he handed it to Kajanan, who then used the boarding pass and a forged passport in an attempt to board the flight to Auckland. The Appellant received US$600 for his role in this scheme.2Foot Note 2×PS at para 5. 7 The Appellant admitted to also having taken part in a similar operation in Tokyo in 2016, for which he was paid a total of US$500.3Foot Note 3×PS at para 6.",
        "The decision below": "8 In the court below, the Prosecution referred the DJ to two District Court precedents, namely,Public Prosecutor vRayappen Thevakumaran(District Arrest Case No 940175 of 2015) (“Rayappen”) andPublic Prosecutor v Thirupathi Pillai Thevaraj Satheesh(District Arrest Case No 919518 of 2016) (“Thirupathi”): see the GD at [17]. These two cases, which I will refer to collectively as “the Passport Cases”, related to the abetment of possession of a false passport under s 47(6) of the Passports Act (Cap 220, 2008 Rev Ed) (“the PA”) read with s 109 of the PC. They were the only precedents cited to the DJ,4Foot Note 4×ROP at p 29.who was not referred to any precedent involving s 419 of the PC; in fact, Prosecution had submitted to her that the Passport Cases were more relevant than cases on s 419 offences.5Foot Note 5×ROP at p 16-17.I should point out that, as was the case at the hearing of this appeal, the Appellant was not represented in the court below. 9 I will later discuss (at [32]–[37] below) the relevance of the Passport Cases to the present case. For present purposes, it suffices to note that the DJ appeared to accept that the Passport Cases were directly relevant to the Appellant’s case, and accordingly sentenced the Appellant to 12 months’ imprisonment: see the GD at [31].",
        "The arguments on appeal": "",
        "The Appellant’s arguments": "10 On appeal, the Appellant argued that his case was less serious than the Passport Cases as, unlike the offenders in those cases, he had not been involved in providing false passports.6Foot Note 6×Appellant’s skeletal submission at p 2. 11 The Appellant also denied being part of a syndicate, claiming that he had only agreed to help the syndicate concerned as he was desperate for money.7Foot Note 7×Appellant’s skeletal submission at pp 1–2.",
        "The Prosecution’s arguments": "12 At the hearing before me, the Prosecution acknowledged that relevant precedents on s 419 of the PC had not been cited to the DJ (these cases are discussed below at [15]–[22]). Be that as it may, the Prosecution argued, if the DJ had considered those precedents, she would have imposed an even more severe sentence.8Foot Note 8×Oral submissions of the Prosecution.The Prosecution emphasised, in particular, two significant developments which had occurred since the precedents were decided. First, terrorism had emerged as a major security concern and had been linked to people smuggling. Second, Parliament had amended the law to enhance the maximum penalty prescribed for s 419 offences. In addition, the Prosecution maintained its argument that the Passport Cases were still germane to s 419 offences.",
        "My decision": "13 I will begin by discussing the appropriate benchmark sentence for s 419 offences committed in the context of people smuggling, before applying it to the facts of the present case.",
        "The appropriate benchmark sentence": "14 In determining the appropriate benchmark sentence for s 419 offences that are committed in the context of people smuggling, it is important to first consider the relevant precedents decided under s 419 of the PC itself. Next to be considered is whether recent developments, both legal and factual, justify an increase in the benchmark sentence. Finally, I will examine the relevance of the Passport Cases. Relevant precedents concerning s 419 of the PC 15 There are two relevant sentencing precedents decided under s 419 of the PC, namely,Chua Bee Lay v Public Prosecutor(Magistrate’s Appeal No 152 of 1995) (“Chua Bee Lay”) andPublic Prosecutor v Ng Tai Tee Janetand another[2000] 3 SLR(R) 735 (“Janet Ng”). 16Chua Bee Layis an unreported decision by the District Court, where the accused person (like the Appellant in the present case) was sentenced to 12 months’ imprisonment for s 419 offences. The case is summarised inSentencing Practice in the Subordinate Courts(LexisNexis, 3rd Ed, 2013) (“Sentencing Practice”) at pp 855–856 as follows: Offender pleaded guilty to two counts of abetment of conspiracy to cheat by personation under s 419 and one count of cheating under s 420. A similar charge of s 420 was taken into consideration. The offender had been recruited into a syndicate smuggling alien nationals. On her part, she recruited another member into the syndicate. The role of the offender was to escort nationals from China into Japan using forged Singapore international passports. For the first charge, the offender was involved in a conspiracy to provide a Chinese national with a Singapore passport to gain entry to Japan. The second charge alleged that the offender conspired to cheat an airline official into allowing the Chinese national to board a United Airlines flight by using a boarding pass which had been issued to another person. For the third charge, the offender cheated the immigration authorities by inducing them to issue a new passport by making a false representation that her godson had scribbled in her passport and had damaged it. In fact, she had destroyed her old passport to remove evidence of her smuggling trips. The fourth charge which was taken into consideration was similar to the third charge. In mitigation, it was said that the offender was of poor health. The District Judge felt that the overwhelming consideration was that of public policy which required a severe sentence to deter criminals from using Singapore as a transit point to smuggle aliens. Sentence imposed by the trial court: One year’s imprisonment each on the s 419 charges and two years’ imprisonment on the s 420 charge. One one-year term and the two-year term were ordered to run consecutively. Total: three years’ imprisonment. Results of appeal: Offender withdrew appeal. 17 The Prosecution placed substantial reliance onChua Bee Lay. In response to a query by this court, the Prosecution clarified that it consideredChua Bee Layto be the most relevant precedent for the present case.9Foot Note 9×See also PS at para 41. 18 However, I entertained substantial doubt as to the precedential value ofChua Bee Lay. As it is an unreported case, I reiterate the common refrain by the courts that sentencing precedents without grounds or explanations are of relatively little, if any, precedential value because they are unreasoned: see,eg,JanardanaJayasankarr v Public Prosecutor[2016] 4 SLR 1288 at [13(b)]. Such decisions must be approached with some caution even if they have been briefly reported or summarised elsewhere, for example, inSentencing Practice: seeYap Ah Lai v Public Prosecutor[2014] 3 SLR 180 at [39]. Generally speaking, where a relevant precedent with a reasoned decision is available, it ought to carry more weight than a relevant precedent without a reasoned decision. 19 UnlikeChua Bee Lay,Janet Ngwas a reasoned decision; it also emanated from the High Court (as opposed to the District Court in the case ofChua BeeLay). 20Janet Ngconcerned two offenders whose role in the people smuggling scheme was to source for persons who were willing to let their names be used to book airline tickets. Using the particulars of one such person, the offenders obtained an airline ticket and a boarding pass, which were then used by an illegal immigrant in an attempt to travel on a forged passport. The district judge in that case sentenced the two offenders to a fine of $4,000 each. On appeal, Yong Pung How CJ increased the sentence of both offenders to one month’s imprisonment each (the fine for each offender was, however, reduced to $2,000). 21 The court inJanet Ngalso considered the earlier case ofYong Siew Soonand another v Public Prosecutor[1992] 2 SLR(R) 261 (“Yong Siew Soon”), which concerned abetment of cheating under s 417 read with s 109 of the then version of the PC (viz, the Penal Code (Cap 224, 1985 Rev Ed) (“the 1985 edition of the PC”)). The two offenders in that case abetted two foreigners in cheating an auxiliary police officer by presenting boarding passes in assumed names. The first offender introduced the people who wanted to be smuggled to the second offender. The latter then procured false passports, purchased airline tickets and obtained boarding passes in assumed names matching the names stated in the false passports. Yong CJ sentenced the first offender to two months’ imprisonment and the second offender, to five months’ imprisonment. 22 I was of the view thatJanet NgandYong Siew Soondid not support the benchmark sentence of 12 months’ imprisonment that the Prosecution contended for. Indeed, the Prosecution’s proposed benchmark sentence represented a significant increase of 12 times the imprisonment sentence imposed inJanet Ng, the last reported High Court precedent on s 419 of the PC. Even if one were to consider the sentences meted out inYong Siew Soonunder s 417 of the 1985 edition of the PC, the benchmark sentence advocated by the Prosecution would still represent a very significant increase in sentence. 23 Given that these cases were decided some time ago, I went on to consider whether the benchmark sentence ought to be revisited. I bore in mind, in particular, the two developments highlighted by the Prosecution: the increased threat of terrorism, and legislative changes increasing the maximum penalty for s 419 offences. Developments since the precedents were decided (1) The threat of terrorism and its link to people smuggling 24 The Prosecution argued that people smuggling posed amajorthreat to public safety and security. Citing an article by the Organisation for Economic Co-operation and Development (“the OECD article”),10Foot Note 10×Bundle of Authorities, Tab N.the Prosecution emphasised that “[t]errorist groups appear to be increasingly resorting to organised crime, including activities such as people smuggling, as a source of funding for terrorist activities”.11Foot Note 11×PS at para 25. 25 In my view, where a particular crime has been linked to the support of terrorism, a more severe sentence is undoubtedly called for. However, the evidence linking people smuggling to safety threats and terrorism is rather thin. The problem of people smuggling has been around for some time, as the cases ofYong SiewSoonandChua Bee Layshow. The OECD article did not indicate how much of the people smuggling trade was conducted by terrorist groups. Furthermore, although it stated that the link between terrorism and people smuggling “ha[d] been flagged by several national administrations as a growing area of concern”,12Foot Note 12×The countries are Portugal and Australia (Bundle of Authorities, Tab N, p 2).the Singapore government was not among the national administrations cited. Given the state of the evidence, I did not think it would be proper to set a benchmark sentence for s 419 offences committed in the context of people smuggling on the basis that they were always linked to terrorism. To do so would be to assume the worst-case scenario in every case. 26 Moreover, in the present case, there was no specific evidence that the syndicate which the Appellant was working with had any links to terrorism. Indeed, there was no evidence – and for that matter, not even any suggestion – that that syndicate funded terrorist groups or smuggled potential terrorists. Kajanan, the person who attempted to travel to Auckland using the Appellant’s boarding pass, was simply trying to migrate to New Zealand to seek a better life.13Foot Note 13×GD at para 25.There was thus no basis for me to place any real weight on the issue of terrorism in setting the benchmark sentence for s 419 offences involving people smuggling and in sentencing the Appellant. (2) The increase in the maximum sentence for s 419 offences 27 The Prosecution highlighted that sinceJanet Ngwas decided, Parliament had increased the maximum sentence for s 419 offences from three years’ imprisonment to five years’ imprisonment.14Foot Note 14×PS at para 47. 28 It is true that the maximum sentence prescribed for an offence is generally indicative of its seriousness. It also follows that an increase in the maximum sentence for an offence is an indication that Parliament intended that the offence should thereafter attract heavier sentences, and the courts should reflect that intention in their sentencing decisions. However, such a change does not automatically have a conclusive effect, especially when Parliament states otherwise (see Kow Keng Siong,Sentencing Principles in Singapore(Academy Publishing, 2009) at paras 5.008–5.010). 29 In the present case, while I thoughtsomeweight should be given to the increase in the maximum sentence for s 419 offences, the weight to be given had to be moderated in the light of the relevant Parliamentary speeches during the second reading of the Bill proposing this amendment (viz, the Penal Code (Amendment) Bill 2007 (Bill 38 of 2007) (“the Bill”)). The increase in the maximum sentence for s 419 offences was undertaken when Parliament conducted a broad review of the 1985 edition of the PC and changed the sentences for many offences. However, Parliament did not intend to effect a general increase in the sentences for all affected offences. As Senior Minister of State Assoc Prof Ho Peng Kee (“Assoc Prof Ho”) explained during the second reading of the Bill in October 2007 (seeSingapore ParliamentaryDebates, Official Report(23 October 2007) vol 83 at cols 2439–2440): … when Mr Lim Biow Chuan asks whether what we have done will lead automatically to fines or punishments going up[,] I do not think so. He has mentioned, for example, the benchmarks, the sentencing guidelines, that the courts have.I think the guidelines will continue.It does not mean that automatically when the maximum punishment is raised, the punishment will go up. Because every punishment must depend on the facts of the case. … [emphasis added] 30 Thus, Assoc Prof Ho made it clear that existing sentencing guidelines need not be changed and could continue. Accordingly, I was of the view that the increase in the maximum sentence prescribed in s 419 of the PC could not,ipso facto, justify a significant increase in the sentence for an offence under that section. That said, I did not think it would be wrong on my part to have regard to this change and to effect such adjustment as I thought was called for. 31 I turn now to consider the relevance of the Passport Cases. Relevance of the Passport Cases 32 The Passport Cases involved the abetment of breaches of s 47(6) of the PA. For reasons which will become clear in the following paragraphs, I reproduce both s 47(3) and s 47(6) of the PA below: Offences relating to false foreign travel documents 47.… … (3) If — (a) a person uses in Singapore a foreign travel document in connection with travel or identification; (b) the foreign travel document was not issued to that person; and (c) the person knows or ought reasonably to have known that the foreign travel document was not issued to him, the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 10 years or to both. … (6) If — (a) a person has possession or control of a document; and (b) the person knows or ought reasonably to have known that the document is a false foreign travel document, the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 10 years or to both. 33 The accused persons in both of the Passport Cases abetted the breach of s 47(6) of the PA by collecting forged passports from a people smuggling syndicate and handing them to persons who then attempted to travel using those forged passports. The accused inThirupathiwas sentenced to 12 months’ imprisonment, while the accused inRayappenwas sentenced to 16 months’ imprisonment (presumably because he had a prior conviction in 2012 for a similar offence for which he had beensentenced to six months’ imprisonment). In reliance on these two cases, the Prosecution argued that the sentence that the Appellant received in respect of his s 419 offence was not manifestly excessive.15Foot Note 15×PS at paras 35–38. 34 I was unable to accept the Prosecution’s submission in this regard. The reservations which I expressed earlier (at [18] above) as to the precedential value of unreported cases applied with equal force here. Even more pertinently, it was questionable how relevant the Passport Cases were, given that the Appellant had been charged under adifferentprovision,ie, s 419 of the PC. As stated by the High Court inLuongThi Trang Hoang Kathleen v Public Prosecutor[2010] 1 SLR 707 (“Luong”) at [14]: … In assessing the value of sentencing precedents based on an offencedifferentfrom that for which the court is to pass sentence, care must be taken to ensure that the two offences (ie, the offence which is the subject matter of the sentencing precedents and the offence for which the court is to pass sentence), although different, are still analogous in terms of both policy and punishment. … [emphasis in original] 35 The offence under s 47(6) of the PA is not analogous to the offence under s 419 of the PC in terms of both policy and punishment. In terms of punishment, the maximum term of imprisonment provided for in s 47(6) of the PA istwicethe length of the maximum term of imprisonment stipulated in s 419 of the PC. In terms of policy, it seems clear to me that there is a significant difference in criminal activity involvingboarding passesas opposed topassports. While it is true, as the Prosecution submitted, that a fake passport alone is useless for travel if there is no matching boarding pass, it remains the case that a fake passport would cause much more harm than a fake boarding pass (or a boarding pass used in an unlawful manner). A fake boarding pass can only facilitate one journey; a fake passport can facilitate many more. 36 The difference in policy behind s 47 of the PA and s 419 of the PC was considered by the High Court inLuongin relation to s 47(3) of the PA. The accused inLuongwas convicted of two charges under s 47(3) of the PA in the District Court. On appeal, she argued that the district judge had erred in failing to consider sentencing precedents for the offence under s 419 of the PC. The High Court rejected this submission. It noted that Parliament’s intention in enacting the PA was “to enact a consolidated statute to,inter alia, arrest the increased misuse of both Singapore passports and foreign travel documents by criminal and terrorist elements to facilitate their movement between countries” (at [13]). Section 419 of the PC, on the other hand, had not been enacted for the same purpose (at [14]). 37 The High Court held that “sentencing precedents for other unrelated offences would be of limited guidance in prosecutions for the offence under s 47(3) of [the PA]” (at [14]). In my view, the same reasoning would also explain why precedents under s 47(6) of the PA would be of limited relevance in sentencing accused persons charged under s 419 of the PC. Conclusion on the appropriate benchmark sentence 38 Bearing all the foregoing considerations in mind, in my view, the benchmark sentence for s 419 offences committed in the context of people smuggling should be a term of imprisonment of four to six months.",
        "The appropriate sentence for the Appellant": "39 I turn now to consider the appropriate sentence for the Appellant. Despite his protest that he was not part of a people smuggling syndicate, it was beyond doubt that the Appellant’s crime was indeed committed as part of the operations of a transnational syndicate. It would be different if Kajanan, the primary offender, had approached the Appellant personally asking for help to travel to Auckland. That said, in fairness to the Appellant, it was clear – as accepted by the Prosecution – that the Appellant occupied a position among the lower echelons of the syndicate.16Foot Note 16×PS at para 16. 40 If the present case had not involved a people smuggling syndicate, whether transnational or local, then barring any other aggravating factor, a sentence at the lower end of the benchmark range of four to six months’ imprisonment would have been appropriate. However, as the Appellant’s offence was perpetrated by a transnational syndicate, and one in which the Appellant was very much involved at that, a sentence at the higher end of the benchmark range was warranted. In this regard, the Prosecution suggested that the two offenders inJanet Ngwere “at most, part of a local syndicate” as opposed to “a sophisticated transnational people smuggling syndicate”.17Foot Note 17×PS at para 47.It was not clear what material the Prosecution relied on to infer thatJanet Nginvolved a local syndicate. In any event, the benchmark sentence of four to six months’ imprisonment which I have set out is already a marked increase from the one-month imprisonment term imposed inJanet Ng. There is sufficient flexibility within this benchmark range to account for any possible need to differentiate between local and transnational syndicates. It is undoubtedly the case that an offence of this kind perpetrated by a syndicate, whether transnational or otherwise, poses a greater threat to security than the same offence committed by a solo operator. 41 The Prosecution also argued that applying the principle of parity, the Appellant’s original sentence of 12 months’ imprisonment was not and could not be manifestly excessive. This was because Kajanan had been sentenced by the same judge (ie, the DJ) to 12 months’ imprisonment on a charge under s 419 of the PC.18Foot Note 18×PS at para 32. 42 It should, however, be noted that Kajanan hadalsobeen charged under s 47(6) of the PA for being in possession of a false travel document,19Foot Note 19×Bundle of Authorities, Tab F.and had been sentenced to 12 months’ imprisonment for that charge. The sentences for both charges were ordered to run concurrently, making a global sentence of 12 months’ imprisonment. 43 As explained above at [35]–[36], an offence under s 47(6) of the PA is more serious than one under s 419 of the PC. Thus, applying the principle of parity, the Appellant’s sentence was manifestly excessive as he received the same sentence as Kajanan, who had committed the more serious offence under s 47(6) of the PA (in addition to the offence under s 419 of the PC). Indeed, based on the principle of parity, Kajanan’s sentence for his s 419 offence should also be considered manifestly excessive. However, as his two sentences had been ordered to run concurrently, there was no need for me to exercise my powers of criminal revision to revise his sentence in relation to his charge under s 419 of the PC.",
        "Conclusion": "44 For the reasons above, I found that the 12-month imprisonment sentence imposed by the DJ on the Appellant was manifestly excessive. I was disappointed and also troubled by the fact that the appropriate precedents were not cited to the DJ at the time she sentenced the Appellant. She was instead referred to precedents that were not quite on point, resulting in a sentence that was manifestly excessive. 45 Taking into account remission, by the time this appeal was heard before me, the Appellant had already effectively served a nine-month imprisonment term. I therefore ordered that he be released forthwith,ie, on the morning of 16 March 2017 (see [4] above). Chao Hick TinJudge of Appeal Appellant in person;Nathaniel Khng (Attorney-General’s Chambers) for the respondent."
    }
}