{
    "case_title": "BMLvComptroller of Income Tax",
    "ncitation": "[2017] SGHC 118",
    "coram": "Choo Han Teck J",
    "sections": {
        "The Board’s decision": "5 The appellant appealed against the Comptroller’s decision to the Board under s 79(1) of the Act. On 8 November 2016, the Board dismissed the appeal and upheld the Comptroller’s decision to refuse deductions of the interest expenses on the shareholder bonds against the rental income of the Mall. It found that the test in s 14(1)(a) of the Act was whether there was a “direct link” between the money borrowed and the income produced. This link had to be “real, tangible, precise and factual”. On the facts, the Board found no direct link between the shareholder bonds (the money borrowed) and the Mall’s rental income (the income produced) as the Mall’s rental income was derived independently from the issuance of the shareholder bonds. This was because: (a) The Mall was owned by the appellant and generating rental income before the shareholder bonds were issued. There was no cash flow impact generated by the shareholder bonds. No moneys were generated by the shareholder bonds – the change of the capital structure of the appellant from an equity-based to debt-based structure was reflected only by accounting entries; (b) The shareholder bonds were issued for the purpose of allowing the shareholders to obtain a return in the form of interest rather than helping them to preserve the Mall or generate more rental income. There was in fact no need to issue the shareholder bonds to preserve the Mall. The appellant had sufficient working capital to hold the Mall and it would have been inconceivable for the shareholders to sue the appellant to satisfy the debt arising from the capital reduction. There was thus no real threat to the continued operation of the Mall; (c) It was clear from the entire series of transactions from the Loan to the issuance of the shareholder bonds that the moneys obtained from the shareholder bonds had no connection with, and was superfluous to, the equity capital of the appellant; and (d) The appellant’s capital restructuring was not a case of “substituted financing” and it could not therefore rely on the Australian case ofYeung v Federal Commission of Taxation(1988) 88 ATC 4193 (“Yeung”). Even if it was a case of substituted financing, the test of “direct link” would still not have been satisfied.",
        "The present appeal": "6 The appellant appeals to this court on the basis that the Comptroller and the Board had interpreted s 14(1)(a) of the Act wrongly. The provision reads: Deductions allowed 14.---(1) For the purpose of ascertaining the income of any person from any source chargeable with tax under this Act (referred to in this Part as the income), there shall be deducted all outgoings and expenses wholly and exclusively incurred during that period by that person in the production of the income, including – (a) except as provided in this section – (i) any sum payable by way of interest; … (ii) … upon any money borrowed by that person where the Comptroller is satisfied that such sum is payable on capital employed in acquiring the income 7 The question thus is whether the interest paid by the appellant on the shareholder bonds is a “sum payable by way of interest… upon any money borrowed by that person where the Comptroller is satisfied that such sum is payable on capital employed in acquiring the income”. If so, that interest would be deductible as against that particular income for tax purposes. It is not disputed by the parties that this is all that the statute requires. The Court of Appeal held inBFC v Comptroller of Income Tax[2014] 4 SLR 33 that for interest expenses to be deductible under s 14(1)(a) of the Act, the general deductibility test in s 14(1) of the Act (that the expense be “wholly and exclusively incurred… in the production of the income”) does not need to be fulfilled (at [10]). Section 14(1)(a) of the Act is also an exception to the prohibition against deductions of capital expenditure in s 15(1)(c) of the Act (at [39]). This means that although interest expenses payable on capital employed in acquiring the income are nonetheless considered capital expenditure, they are deductible pursuant to s 14(1)(a) of the Act. 8 The parties disagree over the factors that the Comptroller can take into account when deciding whether the interest is payable on “capital employed in acquiring the income”. In particular, the appellant argues that the Comptroller is not empowered by s 14(1)(a) of the Act to look behind the transaction into the subjective purpose or necessity of the money borrowed when he determines whether the interest is indeed payable on capital employed in acquiring the income. The Comptroller’s case is that the test of whether there is a “direct link” between the money borrowed and the income acquired is a question of fact, including the purpose for which the money is borrowed and whether the money borrowed was necessary for the acquisition of income.",
        "The test under s 14(1)(a)of the Act": "9 The leading case on the interpretation of s 14(1)(a) of the Act isAndermattInvestments Pte Ltd v Comptroller of Income Tax[1995] 2 SLR(R) 866 at [26]-[27] (“AndermattInvestments”). Andermatt was an investment holding company. Its shareholders were members of the Wan family. It wanted to acquire a Hillview property owned by another company, Wan Holdings, whose shareholder was also a Wan family member. To do so, Andermatt first purchased all the shares in Wan Holdings. The requisite resolutions were then passed to initiate the winding up of Wan Holdings. The Hillview property (as a return of capitalin specie) was vested in Andermatt as a result. To pay the balance purchase price for Wan Holdings, Andermatt drew down an overdraft facility and sought to deduct the interest payable on the facility against the Hillview property’s rental income. 10 The Court of Appeal disallowed the deduction. It endorsed the view that under s 14(1)(a) of the Act, there must be a “direct link between the money borrowed and income produced” (at [27]). In that case, the money from the overdraft facility was used to pay a debt due to the vendor of the shares, for the purchase of shares in Wan Holdings. The Hillview property was obtained by liquidation of Wan Holdings and the consequent distribution of its assets. They were “extraneous matters brought about by acts of the shareholders of Wan Holdings” and had no direct link with the overdraft facility. 11 The requirement of a direct link between the money borrowed and income acquired has been followed in cases such asJD v Comptroller of Income Tax[2006] 1 SLR(R) 484 (at [29] and [47]). The appellant accepts this, but Mr Ong, counsel for the appellant, submits that the test does not allow an unrestrained fact-finding exercise beyond the statutory requirement that the capital be employed in acquiring the income. Mr Ong argues that the statute only requires that income-producing assets represent the specific capital on which interest is payable. This is because the only way that a company acquires income is through use or employment of its assets. The capital of the company is therefore said to be represented by its assets. Such capital may be said to be employed in acquiring income when it is represented by assets that are income-producing. Thus, so long as the money borrowed is to obtain capital that is represented by income-producing assets, the interest payable on such money borrowed would be on capital employed in acquiring the income from these assets. 12 Mr Ong thus submits that the direct link test is only relevant in determining whether the original assets representing the capital have ceased to exist. If they have ceased to exist, no income can be generated from the (non-existent) assets and there is thus no link between the money borrowed (ie, the capital) and the income produced. Hence, inAndermattInvestments,the original assets and income acquired with the money,ie, the shares of Wan Holdings and its dividends, had ceased to exist after the liquidation, and the acquisition of rental income could not be attributed to the overdraft. 13 Ms Foo for the Comptroller argues that the appellant’s characterisation of the test in s 14(1)(a) of the Act based on whether the capital (on which interest is payable) is represented by income-producing assets is overly simplistic and impractical. It does not apply the ordinary meaning of the word “employ”, which requires some form of “use”, to “make use of” and to “apply”. The test proposed by the appellant would take into account the entire represented capital of the company without taking into consideration specific funds used in income-producing assets. This is just adopting the balance sheet presentation, where movements in funds or capital are recorded on the company’s balance sheet to comply with the tax requirement that capital has been employed in the acquisition of income. This is because accounting entries are within the control of the taxpayer companies and their shareholders. All companies owning properties for rent would thus be able to avoid tax expenses by creating a debt against rental income generated by the properties, with no real monetary transactions. This could not have been the intention of the legislature with regard to s 14(1)(a) of the Act. Thus, the Comptroller’s contention is that s 14(1)(a) of the Act allows and perhaps even requires the Comptroller to engage in a fact-finding exercise, in order to determine if the money borrowed is truly directly linked to the production of the specific income against which the interest is sought to be deducted. 14 I do not think that the test of whether a company’s capital is simply represented by income-earning assets is in the spirit of s 14(1)(a) of the Act. First, it is unclear what “represented” means in this context. Can one say that where there is debt listed on the company’s balance sheet, and there are income-earning assets listed on the same, the debt is represented by the income-earning assets? I cannot see how that would comply with the requirements of the Act. It would mean that so long as there is a proportion of a company’s assets that is income-earning, the relevant proportion of the total stated capital on the company’s balance sheet will always be considered capital employed in acquiring the income. I accept Ms Foo’s argument that “employed in acquiring” requires more than that. It implies a closer, causal, relationship between the capital and the income it produced. It is still useful to refer to the company’s balance sheet to determine this in some cases. For example, if a taxpayer company had taken out a loan and this was reflected on its balance sheet together with an increase in its assets, this could be used as some evidence that the loan was used to acquire certain income-producing assets. This does not mean that it is conclusive of such a fact. The relationship between the money borrowed and the income-producing asset requires investigation. 15 Mr Ong relies on the United Kingdom case ofBirmingham Small Arms Co Ltd v Inland Revenue Commissioners[1951] 2 All ER 296 (“Birmingham Small Arms”) to persuade me that there is no special meaning to the word “employed” in s 14(1)(a) of the Act. In that case, the House of Lords held (at 303-304) that the words “capital employed in a trade or business” did not bear any significant difference in meaning from the words “capital of a trade or business”. That case related to the computation of the amount of capital employed in a trade or business for the purposes of excess profits tax.Birmingham Small Armsis unhelpful. No meaningful comparison of the definition of the word “employed” in what was para 1(1), Part II, schedule VII to the Finance (No. 2) Act 1939 and s 14(1)(a) of the Act can be made because of the difference in statutory language and purpose in both provisions. The House of Lords made extensive reference to the statutory context of the Finance (No 2) Act in coming to its conclusion that the word “employed” did not have any additional meaning in the context of the case. In the absence of similar statutory context, we ought to remind ourselves of the rule of statutory interpretation that Parliament does not legislate in vain. “Employed” must be given its ordinary meaning in the present context. I also find support in the legislative drafter’s report to the Governors of the Malayan Union and Singapore when the Singapore Income Tax Ordinance (the first version of the Act) was introduced in 1948, where he stated with reference to Clause 11 of the Ordinance (currently s 14 of the Act) that specific deductions would be granted for “interest on borrowed money used in the business”. 16 Second, I find that Mr Ong’s argument (that the direct link test is only limited to an enquiry of whether the original assets that represented the capital still exist) is based on a very narrow reading ofAndermattInvestments. The non-existence of the original assets (the shares in Wan Holdings following the liquidation) and the original source of income (dividend income from those shares) were fatal to Andermatt because the appellant could not escape from the fact that the overdraft facility was raised to pay for the shares in Wan Holdings. It thus had to find some way to link the source of income to which the capital was raised for (the shares) to the source of income it wished to seek a deduction from (rental income). The income acquired cannot possibly remain the same if the original source of income is gone. This is important because it shows that the Court of Appeal there was concerned with what the loan was actually used for. This is evident from its judgment at [31]: We also noted that appellant’s contention that the important question is not to whom the overdraft money was paid butfor what. It is precisely when we addressed this question that we felt that on the facts the money was used to pay a debt due to the vendors of the shares. There can be no doubt about that.  The debt was due to the vendor on account of the salesimpliciter. The liquidation of Wan Holdings, and the distribution of the assets of Wan Holdings, were extraneous matters brought about by acts of the shareholders in Wan Holdings. 17 Third, the statutory scheme of the Act reinforces my view that there has to be a closer relationship between the money borrowed and the income produced than what the appellant claims. Income tax is a tax on income and not capital receipts. The corollary of this principle is that revenue expenditure can be deducted from a taxpayer’s assessable income, but capital expenditure cannot. The exception to this prohibition on deductions of capital expenditure is s 14(1)(a) of the Act, which allows capital expenditure to be deducted from assessable income as long as the interest payments are on capital employed in acquiring the income. It is therefore necessary for the taxpayer to establish a direct link between the capital and the income, such as to justify availing itself of the exception in s 14(1)(a) of the Act. The need for the capital to be instrumental in acquiring the specific income against which the deduction is sought ensures that the Act’s revenue-capital distinction is maintained. To read the provision as merely requiring that a company’s capital be represented by income-producing assets would invite companies with such assets to seek deductions merely by making changes to their capital structure by creating a debt on their balance sheet, regardless of whether the loan taken was needed for, instrumental to, or had any direct link to the income produced from the assets. This would change s 14(1)(a) of the Act, which is an exception, into a broad principle. I do not think that that was Parliament’s intent. 18 Section 14(1)(a) also gives the Comptroller discretion in deciding whether or not a direct link exists between the money borrowed and the income produced, and how much deduction should be allowed to the taxpayer. The Comptroller must not, of course, misuse his discretion or wrongly apply the law, but the fact that this discretion is given to him implies that the direct link test is more than the limited test proposed by Mr Ong on behalf of the appellant. 19 Thus, the test in s 14(1)(a) of the Act,ie, whether there is a direct link between the money borrowed and the income produced, requires more than a look at the company’s balance sheet. The link has to be real, tangible, precise, and factual, and this requires the consideration of a number of factors, which includes but is not limited to whether the original source of income (to which capital was originally employed towards) can be said to be the same source as the income against which a deduction is now sought.",
        "Factors that can be considered under s 14(1)(a) of the Act": "20 I move on to what factors can be considered in determining whether there is a direct link between the money borrowed and the income produced, as well as how they apply in the present case. I confine my consideration to the factors the appellant claims to be irrelevant, and not other factors that may be generally considered under s 14(1)(a) of the Act. As mentioned above, this is not entirely a matter for the courts. Section 14(1)(a) states that the Comptroller is the person who must be satisfied that the direct link exists. Although the court has powers to overturn the decision on the basis that the law in s 14(1)(a) has been wrongly interpreted, or that the Comptroller did not exercise his discretion fairly or reasonably, given my finding that the relevant test is the direct link test, which involves a fact-finding exercise into the actual relationship between the money borrowed and the income produced, it follows that the Comptroller has a wide discretion in deciding which and to what extent those factors are relevant. The court should be slow to interfere with the Comptroller’s discretion in this regard:Comptroller of Income Tax v AQQ and another appeal[2014] 2 SLR 847 at [123]. 21 The appellant argues that the Comptroller and Board erred by taking into account three irrelevant considerations. These are: (a) Whether the money borrowed had an observable effect on the income (which the interest expense is sought to be deducted from); (b) The subjective purpose of the money borrowed (as opposed to the objective use to which the money was placed); and (c) The necessity of borrowing (to the extent that there was no practical danger that the appellant would have lost the asset).",
        "Whether the money borrowed had an observable effect on income produced": "22 Whether the money borrowed had an observable effect on the income against which deduction is sought is clearly a relevant consideration. The whole point of s 14(1)(a) of the Act is to allow deductions where capital is employed in income-generating activities. It even requires that income be produced before deductions are allowed: seeJDat [29]. Proof that the money borrowed has a visible impact on income produced would of course be relevant in determining whether there is a direct link. 23 This does not mean that the mere fact that the money borrowed has no ostensible effect on income generated should immediately disentitle the appellant to a deduction. The respondent concedes this. Its point is simply that the taxpayer bears the burden of proving the direct link between the debt and the income produced. Where the money borrowed leads to a tangible effect on the income produced, regardless of the way the finance is obtained, the taxpayer would not have much trouble proving the link. Where there is no ostensible effect on income, no acquisition of any new assets, and the only perceptible change caused by the transaction is to the capital structure of the company, one wonders whether the money borrowed was truly to produce income or one step removed from the income-earning operation. 24 I accept of course, that money spent on retaining, rather than acquiring, an income-producing asset can sometimes be capital employed in the production of income, but the onus is on the taxpayer to prove that there is a direct link between the money borrowed and the relevant income-producing asset. For example, re-financing a loan that was previously borrowed to buy machinery or other assets used in income-producing activities is entitled to a deduction. The Inland Revenue Authority of Singapore (“IRAS”) accepts that this is not allowed by the statute, because the money borrowed from re-financing would have been used to repay another loan rather than to purchase new assets. But IRAS allows a deduction by way of an “administrative concession” if the re-financing was carried out for genuine commercial reasons. The strict reading of the statute may thus not reflect the full commercial reality as IRAS sees it. InComptroller of Income Tax v IA[2006] 4 SLR 161, it was also there accepted (at [108]) that expenses incurred in connection with the refinancing of a revenue loan are also revenue in nature,ie, the new loan takes on the same character as the previous loan. Where money was borrowed to purchase certain income-earning assets, and the company re-finances the loan at a lower interest rate, the interest expenses on the new loan should usually be deductible as against the income from the same assets under s 14(1)(a) of the Act. This is of course subject to exceptions,eg, where the proceeds from the new loan are used to finance the acquisition of a new asset, the interest expenses payable on the new loan would not be deductible as against the income from the previous asset. 25 The appellant here seeks to extend this principle of “substituted financing” to cases where money is borrowed to replace equity capital in a company (ie, as in the present case) based on the Australian case ofYeung. InYeung, a husband and wife had contributed moneys to purchase properties in their children’s names and theirs. This was deemed a partnership under Australian tax law. The husband and wife wished to be repaid the money that they had originally advanced. They were repaid through funds borrowed from a related company. There was no material effect on the income generated from these properties. The court held that the interest paid on these borrowed funds were deductible as against the income from the properties. It stated (at 4204) that: In an income-earning enterprise, both income and equity capital may be invested in assets directed to the earning of income. In such an event, if equity capital is repaid and loan capital replaces it, interest payable on the loan capital will ordinarily be an allowable deduction from the income derived from the assets. This is because the assets held represent the equity and the loan capital and, if the assets are directed to the earning of income, then both the loan capital and the equity capital which they represent are devoted to the earning of assessable income. 26 “Substituted financing” is not a term of art and does not in itself entitle the taxpayer to a deduction. There are various ways a company may change its sources of finance. The ultimate question will still be whether there can be said to be a direct link between the substituted finance and the income produced. I accept that there may be instances where it can reasonably be said that when loan capital replaces equity capital, there can still be a direct link between the money borrowed and the income,eg, inYeung, where the partners were essentially paid back the same amount that they had invested into the business. Cases likeYeungwould closely resemble the situation where a new loan replaces a previous loan. In the case ofFCT v Roberts and Smith(1992) 23 ATR 494 (“Roberts and Smith”) decided by the Federal Court of Australia, Hill J interpretedYeungas a case “involving a borrowing to fund the repayment of moneys originally advanced by a partner and used as partnership capital, particularly given that the original funds were used to purchase the rental property”. He was clear that where the new borrowing did not operate as a “refund of a pre-existing capital contribution”, deduction of the interest expenses on the new borrowing would not be allowed. Thus, interest on loans to replace partnership capital represented by internally generated goodwill would not be deductible. 27 In the appellant’s case, the paid-up capital of the shareholders was only $10.2m in contrast to the $333m payable to the shareholders after the capital reduction. A large part of the $333m was capitalised from the company’s asset revaluation reserve. These are surpluses recorded in the appellant’s balance sheet when its investment assets, namely the Mall, are revalued annually and are shown to have appreciated in value. Thus, not all of the $333m was employed as working capital in the Mall, nor was the $333m a repayment of capital invested by the shareholders. They are unrealised capital gains from the Mall’s appreciation in value, recorded on the balance sheet. Even if I were to take the view that there is no material difference between partnership capital and a company’s share capital,Yeungclearly does not assist the appellant.",
        "Purpose for which the money was borrowed": "28 Mr Ong argues that the purpose for which the money was borrowed is irrelevant. He submits that the only question under s 14(1)(a) of the Act is whether capital had objectively been employed to acquire the income, and not what the appellant, much less its shareholders (which were distinct legal entities), subjectively intended. He relies onAndermattInvestmentsas authority in support. Andermatt’s counsel had argued that its main motive was to acquire the Hillview property, and the overdraft facility was taken up to purchase the shares in Wan Holding only as a means to that end. As such, the overdraft facility should be seen as having a direct link to the Hillview property’s income. The Court of Appeal rejected that argument, holding that the motive of the transaction could not overcome the manner in which it had been carried out: the overdraft facility had clearly been utilised towards the share purchase. 29Andermatt Investmentscannot be taken to mean that the purpose of the transaction is irrelevant to the question of whether the interest expense is indeed payable on capital employed in acquiring the income. It is clear that Andermatt could not have saved its case by stating that it had the remote purpose of obtaining the Hillview property via the purchase of shares in Wan Holdings, given that the Hillview property was obtained through acts wholly extraneous to the overdraft facility (ie, the winding up of Wan Holdings). 30 Whether a direct link exists between the money borrowed and the income produced is not determined solely on the taxpayer’s intention. Intention in itself does not prove a direct link where none exists, and it also cannot sever the link once the link has been established. But intention is relevant in some cases to show how the capital had been used, especially when the statute itself implies a purpose such as the acquisition of income. It is not so much a distinction made between subjective intention and objective use as it is a consideration of the wider context of the shareholder bonds to see what the overall role and purpose of these bonds are. The appellant would also have to show that the purpose of issuing the shareholder bonds was to retain the Mall, since the money raised from the bonds was used to repay its shareholders after the capital reduction, and not for developing or maintaining the Mall. 31 What the appellant seems to be claiming is that where there are two purposes that money borrowed has been used for, one to produce income and the other to obtain a capital advantage, then, even if the latter is the dominant purpose, it should not automatically sever the direct link between the money borrowed and the income produced. This seems to be the New Zealand Court of Appeal’s position inPacific RendezvousLtd v Commissioner of Inland Revenue[1986] 2 NZLR 567(per Richardson J): … Does it matter that the company also had other considerations in mind? Is there a principled justification under the statute for drawing a distinction between income earning investments involving the employment of borrowed funds where the taxpayer’s only purpose is to gain income on the one hand and investments in similar assets with similar borrowing where the taxpayer also aims for capital advantages on the other?... … Certainly the taxpayer’s purpose may bear on the consideration of whether it can fairly be said that the capital has been employed in the production of assessable income. It cannot, however, be invoked to deny the conclusion that the capital was employed in that way… If borrowed money is spent on assets which are then employed appropriately in producing assessable income, and in no other manner, para (h) is satisfied. 32 This might be acceptable where a taxpayer can establish that the money borrowed was used for two separate purposes. Where there is a dominant purpose in a transaction, the taxpayer would have more difficulty in proving the existence of a separate purpose. The appellant here admitted that the shareholder bonds formed part of a capital restructuring process. The parties had intended, at the outset, to restructure the equity holding by the shareholders in the appellant to a debt-based investment to meet its capital needs. The appellant’s argument that it was not its intention to restructure but the intention of its shareholders is a weak one. The appellant’s directors’ resolutions passed on 10 December 2004 show that they had fully intended to carry out the shareholder’s intentions of capital restructuring by issuing the shareholder bonds. On these facts, it was reasonable for the Board to hold that the shareholder bonds were “issued for reasons completely distinct from the continued earning of the rental income from the Mall”.",
        "Whether it was necessary to borrow the money": "33 The final factor is whether it was necessary for the appellant to issue the shareholder bonds to preserve its assets. This is related to the principle mentioned above, namely that money spent on retaining income-earning assets can be considered to be money spent in producing income so long as there is a direct link between the money borrowed and the income-earning assets. The issue is whether the appellant can establish this direct link if it shows that borrowing money was necessary to retain the assets, and if so, how necessary was it. 34 Mr Ong argues that the appellant’s capital reduction necessitated the shareholder bonds since the appellant had to replenish the lost capital to avoid selling off its income-earning asset, the Mall. The appellant relies on the Hong Kong Court of Final Appeal’s decision inZeta Estates Ltd v Commissioner of Inland Revenue(2007) 2 HKLRD 102 (“Zeta Estates”) for its proposition. Zeta purchased and developed real estate for letting and sale. Its development projects were mainly financed by loans from shareholders and accumulated profits. Zeta’s directors declared dividends of around $400m. These were not paid to the shareholders in cash but credited to their accounts as interest bearing shareholders’ loans. Zeta applied to deduct the interest payable on these loans from its assessable profits. The Court of Final Appeal allowed these deductions. It held that the declaration of dividends was a commercial decision that the court had no power to question or interfere in. Having declared the dividends, it was evident from Zeta’s accounts that it was very illiquid and could not have paid off the dividends without selling off part of its profit-earning real estate, which could have reduced its income. The shareholders’ loans thus prevented Zeta from selling off its profit-earning properties and to maintain its existing profit-producing capacity, and were accordingly deductible. 35 The appellant thus similarly claims that its capital reduction was a commercial decision that could not be questioned by the courts, and after the capital reduction, there was a debt to the shareholders that had to be paid, so that the appellant could avoid losing the Mall. The Board held that it was improbable that the shareholders would ever have sued for the debt, and there was thus no danger of the appellant having to sell the Mall to repay its debt to the shareholders. Thus, it was unnecessary to issue the shareholder bonds to avoid losing the Mall. Mr Ong submits that this misses the point and that it ignores the relationship between the capital of a company and its assets. As an objective financial fact, there was a capital gap left by the capital reduction exercise. The appellant either had to replace the capital returned to the shareholders by way of alternative financing or accept a corresponding reduction of its assets. It was precisely because there was never any intention to dispose of the Mall that the shareholder bonds were issued. 36 I agree with Mr Ong that the appellant had to replace the missing capital following the capital reduction but I do not think that this is sufficient to entitle the appellant to a deduction. First, without expressing a view to its correctness, I find thatZeta Estatesshould not be taken as a general proposition that where borrowing is necessary to retain particular income-earning assets, the interest expenses on the borrowing would be deductible as against the income from those particular assets. Such a test does not consider the use to which the borrowed funds are actually put. More often than not, when a taxpayer has to resort to this argument, it means that the borrowed funds are needed simply to fill another financial need of the company. The only connection to its income-earning operation is that it allows the company not to divert its financial resources from its income-earning operation to a completely different financial need. This would undermine the purpose of s 14(1)(a) of the Act, allowing borrowings that are only remotely linked to the income-earning asset to benefit from deductions. For example, if a taxpayer had taken out a loan for personal purposes, mortgaged his income-earning property, and then takes a second loan when the first was due for repayment, he would have been entitled to say that without repayment of the loan, the income-earning property would be lost, despite the fact that the loan had nothing to do with the taxpayer’s income-earning operations. 37 Thus, something more is needed beyond the loan simply being necessary for the taxpayer to avoid selling its assets. This “something more” is what the appellant has failed to show. There is a missing link. Although I accept that the capital reduction was an act within the prerogative of the appellant and its shareholders, such commercial decisions can still be taken into account in deciding whether or not the money eventually borrowed had anything to do with the specific income against which a deduction is sought. It would be artificial to see the appellant’s acts of capital reduction and bond issue as two separate events, as opposed to part of a plan to restructure the appellant’s financing structure. Before the capital reduction, the appellant had already taken out the Loan, a large portion of which was used to re-finance its borrowings. Apart from any consideration of the Mall and its rental income, the appellant entered into the capital reduction exercise for commercial expediency, after they had already obtained the requisite working capital to own and operate the Mall via the Loan. 38 Second, I also endorse the Board’s holding thatZeta Estates(as with the other foreign authorities cited by the parties) should be treated with caution, as the relevant sections of the tax statute and the scheme of taxation in other countries are not the same as Singapore’s. The Board noted that s 16(1)(a) of the Hong Kong Inland Revenue Ordinance (Cap 112) was more liberal than s 14(1)(a) of the Act. For example, there was no requirement that the Revenue was to be satisfied that the money borrowed was for the purpose of producing profits. I would also add that there are also other sub-requirements relating to the identities of the lender and borrower and the character of the loan in s 16(2) of the Hong Kong Inland Revenue Ordinance before any interest payments under s 16(1)(a) are allowed to be deducted. In my view, our Act is different. It gives the Comptroller a discretion to determine whether the requirements of s 14(1)(a) of the Act are met. In the absence of any error or law or unreasonable result, the court will not interfere with the exercise of the Comptroller’s discretion.",
        "Conclusion": "39 Although I have considered the relevance of each factor in turn, I emphasise that the governing test under s 14(1)(a) of the Act is that there should be a direct link between the money borrowed and the income produced. The factors stated are neither exhaustive nor conclusive of the matter, and may apply to differing extents depending the circumstances of each particular case. Under this specific sub-section (as opposed to,eg, s 14(1) of the Act), the Comptroller is given the discretion to determine whether its requirements have been satisfied. Without proof that the Comptroller had taken irrelevant considerations that was material to its findings into account, or arriving at an objectively unreasonable result, the court would not intervene. 40 Thus, I find the Comptroller’s determination, and the Board’s endorsement of it, not to be unreasonable or wrong. It would have been a straightforward case had the appellant borrowed money for the purpose of buying the Mall, and generated rental income from it. But here, the appellant faced a few problems in establishing a direct link between the shareholder bonds and the Mall’s rental income, all of which were correctly considered by the Comptroller. First, the Mall was already under the appellant’s ownership and was generating rental income prior to the bond issue. The bond issue neither changed the ownership status nor the rental income. Second, the appellant’s shareholders admitted that the bond issue was part of their plan to restructure their capital holding in the firm. It was not due to any financing needs or the desire to generate more rental income. The Comptroller had exercised his discretion correctly by taking these factors into account and denying the deduction of interest expenses on the shareholder bonds as against the Mall’s rental income. 41 The appeal is thus dismissed. I will hear the parties on costs. - Sgd -Choo Han Teck Ong Sim Ho, Joanne Khoo, and Keith Lam (Ong Sim Ho) for the appellant;Foo Hui Min, David Lim, and Christopher Lim (Inland Revenue Authority of Singapore) for the respondent."
    }
}