{
    "case_title": "Public ProsecutorvRazak bin Bashir",
    "ncitation": "[2017] SGHC 33",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1 The accused, Razak bin Bashir (“the Accused”) a 52-year old male, faced various charges under the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”). The Prosecution proceeded with the following charges: (a) First charge – possession of not less than 14.99g of diamorphine for the purposes of trafficking without authorisation under s 5(1)(a) read with s 5(2) of the MDA;(b) Second charge – consumption of monoacetylmorphine without authorisation under s 8(b)(ii) of the MDA; and(c) Fourth charge – possession of 7.14g of diamorphine without authorisation under s 8(a) of the MDA. 2 On 23 January 2017, I accepted the Accused’s plea of guilt in respect of each of the proceeded charges and convicted him accordingly. 3 On the question of sentencing, a third charge of being in possession of utensils intended for consumption of a Class A controlled drug under s 9 of the MDA was taken into consideration. 4 The Accused was represented by counsel. After hearing arguments on sentencing, I sentenced the Accused to an aggregate sentence of 22 years and three months. The Accused has filed an appeal on the basis that the sentence is excessive.",
        "The parties’ submissions, my decision and the reasons": "5 I set out below the sentencing range sought by the Prosecution and Defence for each of the proceeded charges and my decision in respect of the same. ChargeProsecutionDefenceCourtFirst charge –  trafficking21–22 years plus an additional 12 months in lieu of caning.20–21 years. No additional imprisonment in lieu of caning.20 years and 6 months. Additional 9 months in lieu of caning.Second charge – consumption12–18 months.9–12 months.12 months.Fourth charge – possession2 years.2 years.2 years. 6 As can be seen, the sentence which I imposed for each charge was within the range that the Defence had sought with one exception. The exception was that, in respect of the first charge, the Defence had asked that there be no additional term of imprisonment in lieu of caning but I imposed an additional nine months’ imprisonment in lieu of caning. 7 There was also the question as to which sentences were to run consecutively. Under s 307(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”), at least two of the sentences were to run consecutively. On this point, the Defence acknowledged that the sentence for the first charge, which was the most serious of the three charges, ought to be included in the consecutive sentences because the Defence submitted that the sentence for the second charge, instead of the one for the fourth charge, should run consecutively with the sentence for the first charge. The Prosecution submitted that either the sentence for the second charge or the fourth charge was to run consecutively with that for the first charge. 8 As the sentence for the first charge already attracted a minimum of 20 years’ imprisonment, I ordered the sentence for the second charge, instead of the sentence for the fourth charge, to run consecutively with that for the first charge. Hence, the aggregate sentence was 22 years and three months as stated above.",
        "Sentence for the first charge": "9 While the sentence of 20 years and six months’ imprisonment for the first charge may appear high to a lay person, one must bear in mind that the minimum sentence of imprisonment for the offence was 20 years. Furthermore, as mentioned, the sentence imposed by the court was within the range that the Defence had sought. I elaborate below on my reasons. 10 Although the first charge was for trafficking in not less than 14.99g of diamorphine, the actual quantity involved was not less than 20.52g of diamorphine. This was stated in the Statement of Facts which the Accused accepted without qualification. As the charge was reduced to 14.99g, the Accused avoided the prospect of a capital punishment. 11 The Defence highlighted the case ofVasenthad/o Joseph v PP[2015] 5 SLR 122 (“Vasentha”), where, at [31], Sundaresh Menon CJ had said that the actual correlation between the quantity of drugs trafficked and the term of imprisonment is somewhat weak. At [34] ofVasentha, Menon CJ also said that it would not be sufficient to focus on the quantity alone. The sentencing judge must have due regard to all the circumstances of the case, including the culpability of the offender and any aggravating or mitigating factors. The Defence also submitted that the quantity of drugs trafficked was often fortuitous. 12 However, as the Prosecution noted, at [44] ofVasentha, Menon CJ then went on to set out the following approach: (a) First, subject to any prescribed mandatory minimum or maximum sentence, the quantity of drugs provides a good starting point as it reflects the degree of harm to society and is a reliable indicator of the seriousness of the offence. (b) Secondly, after the starting point was identified, the offender’s culpability and aggravating or mitigating factors should be considered. (c) Lastly, any time spent in remand by the offender may be taken into account for the purpose of sentencing. 13 Therefore, it was clear that Menon CJ was saying that the quantity of drugs is still one of the key factors to be considered although it is not the sole or overriding factor (see [31] ofVasentha). I also accept that there is some merit in the argument that the quantity may be fortuitous as quite often the offender has no option in the quantity he is involved in trafficking, as appeared to be so in the case before me. 14 As mentioned above, the quantity of diamorphine actually involved was 20.52g,ie, higher than the threshold of 15g for a capital charge. However, the Prosecution did not say that it was among the highest of the cases so far prosecuted in Singapore. 15 The Prosecution submitted that based on a table of precedents it had produced, the courts generally imposed sentences of 20 to 21 years’ imprisonment for similar cases in which the actual quantity of diamorphine involved was 20–25g but the Prosecution had proceeded on non-capital charges for trafficking in not less than 14.99g of diamorphine. As the Accused had drug related antecedents, the Prosecution sought a sentence of at least 21 years. 16 This brought me to the next stage of the framework inVasentha,involving culpability and the question of aggravating or mitigating circumstances (see [12] above). What stood out here was the Accused’s drug-related antecedents. In 1985, he had been detained under the Criminal Law (Temporary Provisions) Act (Cap 67, 1985 Rev Ed) for an offence of unauthorised trafficking in a controlled drug. In 1991, he was admitted to a Drug Rehabilitation Centre for unauthorised consumption of a controlled drug. He was also fined $1,000 for unauthorised possession of a controlled drug in 1991. 17 The Defence submitted that the Accused did not resist arrest, was co-operative with the authorities and pleaded guilty as soon as a capital charge was reduced. However, the Accused’s antecedents outweighed such arguments. 18 In the circumstances, I was of the view that a sentence of more than the minimum was warranted even though the minimum sentence was already 20 years’ imprisonment. Accordingly, I was of the view that a sentence of 20 years and six months’ imprisonment was warranted. 19 The first charge also attracted a mandatory punishment of 15 strokes of the cane. This would apply unless the Accused came within a certain class of persons who are exempted from caning. If the Accused was exempted, the question of an additional sentence of imprisonment in lieu of caning would arise under s 325(2) of the CPC, which allows a court to impose a sentence of not more than 12 months’ imprisonment in lieu of caning if an offender is a woman or is more than 50 years of age at the time of infliction of the caning. These were two classes of persons exempted from caning. 20 The Accused’s date of birth is 20 August 1964. The date of the three offences for which he was convicted was 18 June 2015. He was more than 50 years of age at the date of the offence and,a fortiori, at the date of sentencing. Therefore, he was exempted from caning. 21 InPP vKisshahllini a/p Paramesuvaran[2016] 3 SLR 261 (“Kisshahllini”), the offender was a female who was 22 years of age at the date of the offence. In view of her gender, she was not liable for caning. Tay Yong Kwang J (as he then was) said at [16] that since the relevant law imposed a mandatory sentence of 15 strokes of the cane, a court should consider imposing an additional sentence of imprisonment where the offender was exempted from caning under s 325(2) CPC, unless there are special circumstances to justify doing otherwise. The purpose was to deter individuals who were exempted from caning from committing the offence. Tay J noted that the mandatory punishment for the offence in question, being 15 strokes of the cane, was severe, considering that the maximum number of strokes that can be inflicted at any one time was 24 strokes. In line with the severity of the mandatory caning sentence that would otherwise be imposed, Tay J was of the view that the maximum of 12 months’ imprisonment in lieu of caning was appropriate in that case (see [16] ofKisshahllini). 22 The Defence argued that in Criminal Case No 32 of 2016 (PP v Low Johnnie) where the offender was 75 years of age, no additional sentence of imprisonment was imposed in lieu of caning. That is incorrect. In that case, the offender was sentenced to a global sentence of 21 years’ imprisonment, of which 6 months’ imprisonment was imposed in lieu of caning. 23 As a matter of general principle, I agreed that an additional sentence of imprisonment should be imposed in lieu of caning to deter individuals who are covered by s 325(2) CPC from trafficking unless there are special circumstances to justify otherwise. Furthermore, the additional sentence of imprisonment is a substitute for the additional punishment of caning which would otherwise have been imposed. 24 However, as the prescribed punishment for the first charge was 15 strokes of the cane and this was not the maximum which an offender could have been facing, I was of the view that I should calibrate the additional sentence of imprisonment. Accordingly, I imposed an additional nine months’ imprisonment in lieu of caning.",
        "Sentences for the second and fourth charges": "25 As mentioned above, the Defence agreed to a sentence of two years for the fourth charge. 26 As for the second charge, there was not much disagreement between the ranges submitted by the Prosecution and the Defence as set out above at [5]. I imposed a sentence of 12 months. Woo Bih LiJudge Tan YanYing and Terence Chua (Attorney-General’s Chambers) for the prosecution;Sunil Sudheesan and Diana Ngiam (Quahe Woo & Palmer LLC) for the accused."
    }
}