{
    "case_title": "LED Linear (Asia) Pte LtdvKrislite Pte Ltd",
    "ncitation": "[2017] SGHC 150",
    "coram": "Tan Lee Meng SJ",
    "sections": {
        "Introduction": "1 The plaintiff, LED Linear (Asia) Pte Ltd (“LED Linear”), sells light emiting diode (“LED”) lighting and accessories manufactured by its German parent company, LED Linear GmbH (“LED Germany”). The defendant, Krislite Pte Ltd (“Krislite”), is a provider of electrical lighting equipment. The dispute between the parties relates to a contract (the “contract”) between LED Linear and Krislite for the supply of light fittings for installation in a building project known as the “South Beach Mixed Development” (the “Project”).",
        "Facts": "2 In 2012, Krislite was interested in supplying the LED lighting required for the Project, which comprises two high-rise towers, the North and South Towers, and a canopy connecting both towers. LED lighting was required for the external facade of the canopy (the “Canopy lighting”) as well as the North and South Towers (the “Tower lighting”). 3 The main contractor for the Project was Hyundai Engineering & Construction Co Ltd (“Hyundai”). The Project’s lead consultant/architect was Aedas Pte Ltd, whose specialist façade consultant was Mr Philip Kwang (“Mr Kwang”). The specialist lighting consultant for the Project was Mr Bruce Schneider (“Mr Schneider”) from Light Cibles Pte Ltd. All these consultants will be collectively referred to as “the consultants”.",
        "Krislite calls a tender": "4 In October 2012, Krislite called a tender for the supply of the Canopy lighting and the Tower lighting to enable it to bid for the sub-contract for the supply of LED lighting for the Project. 5 The required LED lighting consisted of an encapsulated LED lighting strip (“LED strip”) together with a male connector cable at one end and a female connector cable at the other end (“the connectors”). The LED strips came in various lengths and could be joined to one another using the connectors. This allowed a customer the flexibility of joining various LED strips together to form a seamless strip of lighting of the desired length. 6 On 20 December 2012, LED Linear submitted a quotation to Krislite, setting out the prices for two different types of LED lightings, namely, the Vario LED Flex Venus TV IP67 at 6W/m and Vario LED Flex Venus TV IP67 at 10W/m. The difference between the 6W/m Lightings and the 10W/m lightings lay in their wattage and power consumption. 7 On 27 March 2013, LED Linear submitted a revised quotation to Krislite for the supply of the required lightings at reduced prices.",
        "Acceptance of Krislite’s offer to supply LED lighting for the Project": "8 On 30 March 2013, the Project’s main contractor, Hyundai, confirmed its acceptance of Krislite’s offer to supply the Canopy lighting and the Tower lighting. Krislite asked LED Linear to submit a sample board with specified LED lighting for mock-up purposes at a meeting with the main contractor and its consultants.",
        "LED Linear required a binding letter of intent before supplying samples": "9 LED Linear was prepared to supply the sample board only if it received a Letter of Intent (“LOI”) from Krislite to purchase the LED lights from it for the Project. The first LOI furnished by Krislite was rejected by LED Linear as it stated that it was not binding on the parties. 10 On 17 April 2013, Krislite forwarded to LED Linear a fresh LOI which omitted the provision in the earlier LOI that it was not binding. Krislite confirmed in this LOI that it intended to utilise LED Linear’s lighting products for the Project and it was agreed in the LOI that its validity was subject to “official sample approval from the Client & Consultants”. 11 The LOI specified that the LED lighting strips and connectors were to be IP67 compliant. “IP” refers to ingress protection and the IP67 rating concerns the ability of the LED strips and connectors to resist the ingress of dust and water. It was envisaged that the LED lighting required for the Project would be manufactured by LED Linear’s parent company, LED Germany. 12 The samples supplied by LED Linear to Krislite had no visible gaps between the connectors for the lights and there was an aluminium backing slip for the LED printed circuit board. 13 After inspecting the relevant samples, the Project lighting consultant, Mr Schneider, accepted the lighting samples submission by LED Linear in December 2013.",
        "Contract between Krislite and LED Linear for the supply of lighting": "14 According to Krislite, it was on the basis of the lighting samples furnished by LED Linear that it entered into the contract to purchase the Canopy lighting and the Tower lighting from LED Linear. 15 Apart from the revised LOI, which was signed by both parties, the parties did not sign any other document to record their agreement on the sale and purchase of the LED lighting required by Krislite for the Project. The parties could not agree on when the contract was concluded but it was common ground that under the contract, the agreed payment terms for the Canopy lighting and the Tower lighting called for the payment of 50% of the purchase price before delivery of the goods. The balance of 50% of the purchase price was payable by way of a Letter of Credit (“L/C”).",
        "Krislite’s Purchase Orders for the Canopy lighting and Tower lighting": "16 On 25 February 2014, Krislite issued two Purchase Orders (“POs”) for the Canopy lighting. Krislite paid the 50% down-payment of $181,247.13 for the Canopy lighting on 6 March 2014. The two POs for the Canopy lighting were endorsed and returned to Krislite more than two months later on 22 May 2014. 17 On 9 May 2014, Krislite paid LED Linear the 50% down-payment for the Tower lighting, which amounted to $408,734.71. Subsequently, it issued a PO for the said lighting on 4 June 2014. 18 On 1 July 2014, Krislite applied for an irrevocable L/C for the Canopy lighting. LED Linear was named as the beneficiary for the sum of $181,247.13. 19 Under the L/C for the Canopy lighting, delivery orders signed by Krislite acknowledging that the goods have been received in good order and condition must be presented to obtain payment. The said L/C was valid until 12 September 2014.",
        "Delivery of the Canopy lighting and problems with these lights": "20 In July 2014, the Canopy lighting was delivered to Krislite. It is common ground that 5.49% of them or 41 out of 746 lighting strips had illumination problems. Furthermore, Krislite was very concerned that around 85% of the connectors had a visible 1.5mm to 2.5mm gap between the connectors as compared to the samples that had been furnished, which only had a gap of less than 1.5mm. Krislite feared that the wider gaps might allow the ingress of water and that the connectors were non-IP67 compliant. 21 LED Linear offered to replace the 41 LED lights with illumination problems. However, Krislite wanted all the lighting strips to be replaced. LED Linear maintained that it was not obliged to replace 746 lighting strips when only 41 of them had illumination defects. 22 As for the allegedly defective connectors, LED Linear took the position after receiving assurances from LED Germany and the manufacturers of the connectors, ESCHA Bauelemente GmbH (“Escha GmbH”), that the connectors were IP67 compliant despite the wider gaps.",
        "Hyundai ordered Krislite to test the Canopy lighting for IP67 compliance": "23 After Krislite highlighted its concerns about the connectors to the main contractor, Hyundai, and the consultants, it was instructed by Hyundai to have the Canopy lighting tested for IP67 compliance in a Singapore laboratory. 24 Krislite asked LED Linear to undertake this task at the latter’s own expense. As the contract did not require the Canopy lighting to be tested in a Singapore laboratory, LED Linear, which insisted that the said lighting was IP67 complaint, refused to pay for the cost of the proposed test.",
        "Krislite refused to sign delivery orders to enable LED Linear to be paid": "25 Krislite refused to test the lights at its own expense.  As LED Linear refused to pay for the cost of testing of the Canopy lighting for IP67 compliance in a local laboratory, Krislite refused to sign the delivery orders for the Canopy lighting, which stated that the goods were received in good order and condition. 26 Without the signed delivery orders, LED Linear was unable to claim the balance of the purchase price of the Canopy lighting under the L/C. 27 As the L/C for the Canopy lighting was due to expire soon, LED Linear’s then Regional Business Development Manager, Mr Emeric Duteil (“Mr Duteil”), emailed Krislite on 31 July 2014 that he would stop all further deliveries of LED lights unless LED Linear received the signed delivery orders for the Canopy lights by 1 August 2014. 28 On 14 August 2014, LED Linear informed Krislite that the latter’s failure to sign the delivery orders for the Canopy lights was a breach of contract and it demanded the payment of the balance of the purchase price for the Canopy lighting, which amounted to $181,247.13. 29 On 16 August 2014, Krislite’s senior project manager, Mr Vincent Quek Gek Sin (“Mr Quek”), emailed Mr Duteil that “the LED lights that [LED Linear] supplied are defective and have been rejected by the Consultants/Employers”. He added that Krislite had every right to reject all the lights supplied thus far and would not be signing the delivery orders.",
        "LED Linear’s variation of the payment terms for the Tower lighting": "30 On 26 August 2014, LED Linear upped the pressure on Krislite to return the signed delivery orders for the Canopy lighting when Mr Duteil emailed Mr Quek to say that the Tower lighting, which was ready in the German factory, would only be delivered after the balance of the amount due for the Canopy lighting had been paid and upon full payment of the remaining 50% of the Tower lighting by telegraphic transfer. 31 The new requirement of full payment for the Tower lighting before delivery was a variation of the agreed mode of payment, which called for a L/C for the balance of the 50% of the purchase price in the same way that the L/C for the Canopy lighting was issued. 32 On 27 August 2014, Mr Quek replied to say that LED Linear’s unilateral change of the payment terms for the Tower lighting and the latter’s refusal to deliver the Tower lighting unless the new payment term was complied with was unjustified and a breach of contract.",
        "Final chance for LED Linear to deliver the Tower lighting": "33 On 29 August 2014, the deadline for the delivery of the Tower lights passed by. On 11 September 2014, Krislite wrote to LED Linear to give the latter one final chance to deliver the Tower lights within seven days. 34 The impasse was not broken and the Tower lighting was not delivered to Krislite. On 19 September 2014, the L/C for the Tower lighting expired.",
        "Solicitors were instructed and actions commenced": "35 On 4 September 2014, one and a half months after the delivery of the final batch of the Canopy lighting, Krislite’s solicitors wrote to LED Linear’s solicitors that Krislite had rejected the Canopy lighting and requested LED Linear to collect the rejected light fittings from Krislite’s premises. 36 On 5 September 2014, LED Linear instituted DC Suit No 2783 of 2014 (“DC Suit 2783”) in the State Courts to recover the balance of the 50% of the price for the Canopy lighting. 37 On 23 September 2014, Krislite’s solicitors wrote to LED Linear’s solicitors to state that their clients accepted LED Linear’s wrongful repudiation of the contract by failing to deliver the Tower lighting required for the Project. In the same letter, Krislite demand the repayment of the 50% of the purchase price already paid to LED Linear for the Tower lighting. 38 Krislite then purchased light fittings for the Project from another supplier. 39 On 1 October 2014, LED Linear commenced Suit No 1043 of 2014 (“Suit 1043”) against Krislite to obtain an order that the latter take delivery of the Tower lighting and pay the remaining 50% of the purchase price for the Tower lighting. 40 On the same day, Krislite commenced Suit No 1046 of 2014 (“Suit 1046”) against LED Linear for breach of contract in not delivering the Tower lighting timeously. 41 On 18 November 2014, Krislite applied for summary judgment against LED Linear. The application for summary judgment was dismissed. 42  On 3 March 2015, LED Linear applied for the transfer of DC Suit 2783 to the High Court and for the consolidation of this action with Suit 1043 and Suit 1046. Although Krislite objected to the application, LED Linear succeeded in its application for the consolidation of the two suits.",
        "The issues": "43 In these proceedings, LED Linear, which has been paid 50% of the purchase price of the Canopy lighting and the Tower lighting, claimed the balance of the purchase price of the said lighting. 44 Krislite contended that it was not liable to pay the balance of the purchase price for the Canopy lighting as it was defective. It also denied that it was liable for the balance of the 50% of the purchase price of the Tower lighting as LED Linear breached its obligations under the contract by failing to deliver the Tower lighting required for the Project. 45 Insofar as the Canopy lighting is concerned, Krislite also claimed that it was entitled to reject them on other grounds. The first was that its own Standard Terms and Conditions gave it a right to reject the lighting if it was,in its opinion, defective. Secondly, it contended that there was an implied term of the contract that it could reject the Canopy lighting if the said lighting was rejected by the main contractor and the consultants of the Project. 46 In its counterclaim, Krislite sought a refund of the 50% of the purchase price that it paid for the Canopy lighting and the Tower lighting. 47 To determine the parties’ respective rights and obligations, the following questions must be considered: (a) When was the contract made? (b) What were the terms of the contract? (c) Was Krislite entitled to reject the Canopy light fittings? (d) Was LED Linear entitled to unilaterally alter the agreed terms of the contract in relation to the time and mode of payment for the Tower lighting? (e) If LED Linear was not entitled to unilaterally alter the said agreed term, was its refusal to deliver the Tower lighting except on the basis of its unilaterally altered terms a repudiatory breach that gave Krislite a right to terminate the contract?",
        "When was the contract made and what were its terms?": "48 It was common ground that the parties had a contractual relationship with respect to the supply of the LED lighting required by Krislite to fulfil its obligations to the main contractor for the Project. However, the parties took different positions as to when their contract was formed. 49 It may be recalled that on 17 April 2013, Krislite issued a revised LOI to LED Linear to purchase the LED lighting required for the Project from the latter and that the parties did not sign any other document to record their agreement for the sale and purchase of the LED lighting. 50 According to LED Linear, the contract was formed when the revised LOI was issued and signed by both parties. It contended that terms of the contract were found in the revised LOI, which incorporated the terms stated in its revised quotation dated 27 March 2013 for the supply of the lighting for the Project. 51 Krislite contended that the revised LOI was not binding on the parties and that this document was, in any case, too vague for there to be a contract on its terms. It asserted there were two separate contracts for the purchase of the Canopy lighting and the Tower lighting respectively and that these two contracts were formed when it issued two separate POs Orders for the said Canopy lighting and one PO for the Tower lighting respectively. 52 In relation to determining when a contract is formed, the Court of Appeal stated inTribune Investment Trust Inc v Soosan Trading Ltd[2000] 2 SLR(R) 407 (at [40]) as follows: The principles of law relating to the formation of contracts are clear. Indeed the task of inferring an assent and of extracting the precise moment, if at all there was one, at which a meeting of the minds between the parties may be said to have been reached is one of obvious difficulty, particularly in a case where there has been protracted negotiations and a considerable exchange of written correspondence between the parties. Nevertheless, the function of the court is to try as far as practical experience allows, to ensure that the reasonable expectations of honest men are not disappointed. To this end, it is also trite law that the test of agreement or of inferring consensus ad idem is objective. Thus, the language used by one party, whatever his real intention may be, is to be construed in the sense in which it would reasonably be understood by the other.",
        "LED Linear’s assertion that the revised LOI was the contract": "53 LED Linear asserted that the revised LOI was the contract between the parties because it made it clear to Krislite that the LOI furnished by the latter would only be acceptable if it was binding on the parties. 54 LED Linear highlighted the fact that it rejected Krislite’s first version of the LOI that was forwarded to it on 11 April 2013 because the LOI included a statement that Krislite “does not bind itself” to enter into a formal contract with LED Linear. Subsequently, Krislite removed this statement from its revised LOI, which was then accepted by LED Linear. As has been mentioned, the validity of the revised LOI was subject “to the official sample approval from the Client & Consultants” and it was not disputed that the required approval was obtained. 55 LED Linear submitted that the revised LOI was intended to be the contract between the parties and pointed out that there was no other document that records the terms upon which the LED lighting required by Krislite were sold by it to the latter. 56 LED Linear also asserted that the contract must have been made when the revised LOI was signed by the parties and not when the POs were issued by Krislite because the latter paid the 50% deposit for the Canopy lighting on 6 March 2014, which was more than two months before Krislite’s POs for the Canopy lighting was endorsed and returned by LED Linear on 22 May 2014. Similarly, the deposit for the Tower lighting was also paid to LED Linear around a month before the PO for these lights was issued. When cross-examined, Krislite’s project director, Mr Loh Rhu Fong (“Mr Loh”), conceded that if the contract was based on the terms of the POs issued by his company, it made no sense for Krislite to pay the deposit for the lighting required before the endorsed POs were returned to it.1Foot Note 1×Transcripts, 10 June 2016, p 63, lines 3 to 15.I agree that the fact that Krislite paid more than more than half a million dollars to LED Linear before it issued its POs for the purchase of the Canopy lighting and the Tower lighting shows that its case that the contract was made when the POs were issued and not when the revised LOI was signed was rather weak.",
        "Krislite’s assertion that the revised LOI was not binding": "57 Krislite asserted in its closing submissions that the revised LOI was issued only because LED Linear would not supply samples of its light fittings to it unless it was issued and that the revised LOI was nothing more than a letter of comfort. 58 Krislite claimed that its witnesses corroborated its case that the revised LOI was not binding. However, this is certainly not the case. 59 To begin with, Krislite’s managing director, Mr Teo Cheng Ser (“Mr Teo”), testified that the contract was based on the revised LOI. The relevant part of his testimony is as follows:2Foot Note 2×Transcripts, 8 June 2016, p 120, lines 13 to 21. Q: …[T]he letter of intent forms the contract between the plaintiff and the defendant, do you agree or not? A: Yes, that’s what we have given to them but not they have given to us. Q: If the letter of intent is the contract between the parties, then it stands to reason thatall the terms of the LOI will be applicable to the contract, isn’t it? ASure. [emphasis added] 60 Krislite’s project director, Mr Loh, who was responsible for marketing and securing contracts for Krislite had a lot to say about the revised LOI but what matters is that he accepted that the revised LOI was binding on both sides as he testified as follows:3Foot Note 3×Transcripts, 10 June 2016, p 34, lines 4 to 11. Q: … [Krislite] wanted originally the LOI to be non-binding but because LED Linear say: “No, we can’t have a non-binding LOI” … you agreed to their terms. You agreed to remove that non-binding clauseandso now the LOI becomes binding on both sides. Do you agree or not? A:Agree. [emphasis added] 61 Krislite downplayed the effect of Mr Teo’s evidence on the effect of the revised LOI and pointed out that he could not understand the questions. Admittedly, whether or not there was a binding contract when the revised LOI was issued by Krislite and counter-signed by LED Linear is a matter for the court to determine on an objective basis. However, the evidence that there was a meeting of minds as both LED Linear and Krislite’s key witnesses agreed that the revised LOI was intended to be binding on both parties cannot be overlooked when the issue relates to whether or not there was a meeting of minds for the purpose of concluding a contract.",
        "Whether the terms of the revised LOI were certain": "62 Krislite submitted that the contract could not have been formed when the parties signed the revised LOI because of uncertainty of terms. It pointed out that the revised LOI did not fix the quantity of lights that Krislite was to purchase from LED Linear and did not specify which of the two types of lighting samples furnished by LED Linear would be purchased by it.  It also asserted that when the revised LOI was issued, it did not know which of the two types of LED lighting were required by the consultants for the Project. This line of argument lacks merit. 63 It is trite that for a contract to be made, there must be certainty of terms (seeDynasty Line Ltd (in liquidation) v Sukamto Sia and another and another appeal[2014] 3 SLR 277 at [19]). Crucially, the revised LOI did not stand alone as it incorporated the revised quotation issued by LED Linear on 27 March 2013. The revised quotation, which was quite comprehensive, dealt with the quantity of lights required and the price for the light fittings to be supplied to Krislite. The lighting consultant, Mr Schneider, testified that the approximate quantity of 6,000 metres of LED lighting strips envisaged in the revised LOI, read with the revised quotation, was the quantity required under the tender to supply the lighting for the Project.4Foot Note 4×Transcripts, 8 June 2016, p 53, line 21 to p 54, line 3.Regardless of the type of lighting finally selected for the Project, the price for the lighting was fixed at $217 per metre for the 10W/m strips and $190 per metre for the 6W/m strips. Furthermore, under the revised LOI, the offered unit rate was “to remain valid, irrespective of any changes in quantities throughout the progress of the entire development.” It was also made clear that any reduction in quantity of more than 10% would be re-quoted and that the “final quantity shall be subjected to final site re-measurement as per the Client & Consultant’s changes.” 64 Krislite’s managing director, Mr Teo, admitted that the final quantity had already been agreed upon when the revised LOI was executed by both parties although this was subject to a final site re-measurement. His testimony was as follows:5Foot Note 5×Transcripts, 8 June 2016, p 131, line 23 to p 132, line 1. Q: Yes, so I’m saying the final quantity at the point the letter of intent was signed is already agreed between LED Linear and Krislite, agree or not? A: Subject to changes, agree, yes. 65 The terms of payment for the required LED lighting were also clear, namely, 50% of the purchase price was to be paid in advance and the balance to be paid by an L/C. There was also provision for a warranty for three years from the date of the issuance of the Certificate of Completion and the expected delivery dates of the main indent was fixed for the fourth quarter of 2013. 66 I thus find that Krislite’s assertion that the revised LOI could not be the contract because its terms were uncertain is without any merit as the revised LOI covered the terms which the law requires as essential for the formation of a legally binding contract. As such, the parties reached full and final agreement on the contract when the revised LOI was signed by them. I also find that there was one contract based on the terms of the revised LOI for the supply of LED lighting required by the project to Krislite and thus reject Krislite’s assertion that there were two separate contracts for the supply of the Canopy lighting and the Tower lighting.",
        "Whether Krislite was entitled to reject the canopy lights": "67 According to Krislite, it was entitled to reject the Canopy lighting for the following reasons: (a) the lighting strips did not have the aluminium backing found in the samples supplied by LED Linear;(b) there was an illumination problem with 41 out of 746 lighting strips;(c) the gaps between the connectors were larger than those found in the samples and this could mean that the connectors were not IP67 compliant;(d) cl 6 of its Standard Terms and Conditions gave it a right to reject the goods ifin its opinionthe goods were defective or did not conform to its requirements; and(e) there was an implied term that the lighting was subject to the approval and acceptance by the main contractor and consultants.",
        "Sections 14(2), 14(3) and 15 of the Sale of Goods Act": "68 Krislite submitted that the defects in the Canopy lighting referred to in the above paragraph resulted in a breach by LED Linear of a number of provisions in the Sale of Goods Act (Cap 393, 1999 Rev Ed) (“SGA”). For a start, it alleged that there was a breach of s 14(2) of the SGA, which provides as follows: Where the seller sells goods in the course of a business, there is an implied condition that the goods supplied under the contract are of satisfactory quality. 69 Krislite next contended that as the goods were not fit for their purpose, as made known to LED Linear, it was entitled to reject the Canopy lighting by virtue of s 14(3) of the SGA, which provides as follows: Where the seller sells goods in the course of a business and the buyer, expressly or by implication, makes known — (a) to the seller; …. any particular purpose for which the goods are being bought, there is an implied condition that the goods supplied under the contract are reasonably fit for that purpose, whether or not that is a purpose for which such goods are commonly supplied, except where the circumstances show that the buyer does not rely, or that it is unreasonable for him to rely, on the skill or judgment of the seller or credit-broker. 70 Finally, Krislite alleged that by supplying it with connectors having greater gaps than those in the connectors in the samples supplied, LED Linear breached s 15 of the SGA, which provides as follows:  15.— (1)  A contract of sale is a contract for sale by sample where there is an express or implied term to that effect in the contract. (2)  In the case of a contract for sale by sample, there is an implied condition — (a) that the bulk will correspond with the sample in quality; …. (c) that the goods will be free from any defect, making their quality unsatisfactory, which would not be apparent on reasonable examination of the sample.",
        "The missing aluminium backing strips in the Canopy lights": "71 The first of Krislite’s pleaded complaints about the Canopy lighting was that they had polycarbonate backing strips instead of the aluminium backing strips found in the samples supplied by LED Linear. 72 It is most unsatisfactory that Krislite complained about the missing aluminium backing strips as it knew or should have known that it was the Project’s lighting consultant, Mr Schneider, who had requested that the aluminium backing strips found in the sample supplied by LED Linear be changed to strips with a polycarbonate backing. 73 Mr Schneider testified thatallparties had agreed to the replacement of the aluminium backing strips in the samples with polycarbonate backing strips. He also testified that he considered the said replacement to be an improvement and disagreed that the missing aluminium strips caused the lights to become defective.6Foot Note 6×Transcripts, 8 June 2016, p 68, lines 12 to17. 74 In the face of Mr Schneider’s evidence, Krislite’s Mr Teo agreed to withdraw his company’s allegation regarding the missing aluminium strips.7Foot Note 7×Transcripts, 9 June 2016, p 12, lines 23 to 25 and p 13, line 1.In view of this, these missing strips need not be considered any further.",
        "The illumination defects": "75 Krislite’s second complaint about the Canopy lighting concerned illumination defects. It was not disputed that 41 of the 746 lighting strips failed to light up properly. This failure was understandably of grave concern to Krislite and the consultants but whether this resulted in the entire consignment of 746 lighting strips being of unsatisfactory quality or unfit for the purpose for which they were acquired is a different matter altogether. 76 Whether goods are of satisfactory quality has been considered by the courts on numerous occasions. There is no need to consider the cases on satisfactory quality because there is no doubt in this case that the 41 defective lighting strips with illumination problems were not of satisfactory quality and were not fit for the purpose for which they were acquired. LED Linear took responsibility for the defective 41 lighting strips and immediately offered to replace them without charge. However, Krislite, who wanted all the 746 lighting strips to be replaced, required LED Linear to give an undertaking to replace all the 746 lighting strips before it would sign the delivery orders for these lights to enable the latter to claim the balance of the 50% of the purchase price for the Canopy lighting under the L/C for the said lighting. 77 LED Linear submitted that in building projects, it is usual for the seller of goods to replace only the defective goods which, in this case, meant that only the 41 defective lighting strips had to be replaced. It relied onCehave NV v Breme Handelsgessellschaft mbH[1976] 1 QB 44, where there was a dispute as to the buyer’s rights in relation to a cargo of 12,000 tons of pulp pellets which were to be shipped in good condition. In that case, Lord Denning MR, who considered that a clause “shipped in good condition” was comparable to a clause as to quality, stated (at 61) as follows: … If a small portion of the goods sold was a little below that standard, it would be met by commercial men by an allowance off the price. The buyer would have no right to reject the whole lot unless the divergence was serious and substantial …. Likewise with the clause “shipped in good condition.” If a small portion of the whole cargo was not in good condition and arrived a little unsound, it should be met by a price allowance. The buyers should not have a right to reject the whole cargo unless it was serious and substantial…. 78 LED Linear also sought to rely on s 15A(1)-(2) of the SGA, which concerns the modification of remedies for breach of a condition in non-consumer cases. This statutory provision is as follows: 15A.—(1)  Where in the case of a contract of sale — (a) the buyer would, apart from this subsection, have the right to reject goods by reason of a breach on the part of the seller of a condition implied by section 13, 14 or 15; but (b) the breach is so slight that it would be unreasonable for the buyer to reject them, then, if the buyer does not deal as consumer, the breach is not to be treated as a breach of condition but may be treated as a breach of warranty. (2)  This section applies unless a contrary intention appears in, or is to be implied from, the contract. Consultant and main contractor did not support Krislite’s position 79 The Project lighting consultant, Mr Schneider, shed some light on what usually happens when some lights required for building projects malfunction. He testified as follows:8Foot Note 8×Transcripts, 8 June 2016, p 66, lines 7 to 24. Q: …[I]n your experience of past projects, the fixtures that are replaced relate to those that show problems or does it require a 100 per cent replacement of all fixtures irrespective of problems? A: It’s a good point. I think it’s a case-to-case basis.Normally, it’s a direct replacement one-to-one based on the failure… it’s more difficult and more sensitive problem to ask for a full replacement … but very rare, very rare, because it’s also difficult to – I mean you need to substantiate and other things…. [emphasis added] 80 Hyundai’s chief engineer, Mr Somanathan Raju (“Mr Raju”), also did not support Krislite’s position that all 746 lighting strips had to be replaced. Significantly, when cross-examined, he agreed that the replacement of the 41 defective lighting strips with brand new strips by LED Linear would bring the illumination defects “down to zero”.9Foot Note 9×Transcripts, 13 June 2016, p 15, lines 1 to 4. Krislite’s own witness contradicted the company’s position 81 Krislite’s senior project manager, Mr Quek, admitted that where part of a consignment of lights is defective, it does not always follow that the buyer has a right to terminate the contract as he testified as follows:10Foot Note 10×Transcripts, 9 June 2016, p 108, lines 16 to 25 and p 109, lines 1 to 4. Q: Is it your position if the lights came with any percentage, 0.1 per cent defect, are you saying that even with 0.1 per cent, it will give rise to a right for your company to terminate the contract, is that what you are saying? A: No. Q: It is not, right? Because what you would have done is to require them to replace the defective lighting, isn’t that right? A: Yes. Q:And isn’t that exactly what LED Linear agreed to do, that they agreed to replace the 5.49 per cent lighting? “Yes” or “no”? A:Yes. [emphasis added] Conclusion on the illumination problem 82 I find that LED Linear was entitled to offer to replace only the 41 lighting strips that had illumination problems as these problems did not result in the entire batch of Canopy lighting being of unsatisfactory quality or unfit for the purchase for which it was acquired. It follows that Krislite cannot reject the entire batch of Canopy lighting on the ground that 41 lighting strips had illumination problems.",
        "Whether the Canopy lighting connectors were IP67 compliant": "83 Krislite’s most serious complaint about the Canopy lighting supplied by LED Linear was that the connectors for these lights were not of satisfactory quality, were not fit for the purpose for which they were required, and did not conform to the samples furnished by LED Linear. Krislite’s complaint was based on the fact that 85% of the connectors had a visible 1.5mm to 2.5mm gap between them whereas the samples supplied to had “little or no gaps”. It pleaded at para 6F of its Defence and Counterclaim (Amendment No 1) that a wider gap between the connectors “meant that the connectors would be susceptible to water or rainwater ingress and cause the Canopy Lights to fail”. Real issue relates to IP67 compliance and not the connector gaps 84 The real issue with respect to the gaps does not concern the gapsper seas what mattered was whether or not the gaps might allow water to seep in. This was confirmed by the Project’s lighting consultant, Mr Schneider, who testified that no specifications on the size of the gaps had been furnished for the lighting required by the Project because what was relevant was whether or not the connectors were IP67 compliant. When cross-examined, he stated as follows:11Foot Note 11×Transcripts, 8 June 2016, p 73, lines 7 to 22. Q: Can you just tell us whether there was, within all the tender or contract documentation relating to the lighting, any specification as to the width of the gap? A: No, there was no such specification. There was a dimension given which, I think, is indicated in our lighting catalogue. The dimension was important to avoid clustering with the cabling, et cetera, with the installation, and the technical requirement was important. And after, it was a plug in or a screw in type connector – I mean the concept was to ease the maintenance so there’s no such requirement about the visible gap because it seems to be like an aesthetical point. It need to be technical.So the IP67 and the waterproof is the main issue here. It’s not about the gap. [emphasis added] 85 Hyundai’s chief engineer, Mr Raju, testified that he agreed with Mr Schneider that it was whether or not the connectors were IP67 compliant and not the gaps between the connectors that was of concern to him. Krislite’s Mr Quek conceded that in the event of a difference of opinion on the quality of the connectors, Mr Schneider’s view would prevail. 86 It should not be assumed that the sale by LED Linear of LED lighting was a sale by sample merely because samples were handed over by LED Linear to enable the consultants to inspect them. However, this issue need not be considered for the simple reason that Mr Schneider did not regard the fact that the connector gaps were larger than those in the samples furnished by LED Linear as of any significance so long as the light fittings were IP67 compliant. 87 As for whether or not the connectors were IP67 compliant, Krislite and the consultants merely suspected that the connectors for the Canopy lights were not IP67 compliant and did not know for certain that they were not IP67 compliant. 88 Admittedly, when LED Linear’s Mr Duteil was informed about the gaps between the connectors, he was initially quite alarmed. On 27 July 2014, he wrote to LED Germany as follows: …. [T]here are many connectors that show a major gap when connected together. This is a serious problem as it would definitely cause water seepage. After installation, this is giving [Krislite] a chance to point out this issue and claim replacement FOC, which we cannot ignore or even fight against. 89 Mr Duteil, who was in charge of sales, testified that as the supply of LED lighting for the Project was his first major assignment, he was under tremendous pressure. As such, he said that he panicked when the complaints about the gaps between the connectors were made. However, he was soon reassured by LED Germany and Escha GmbH, the manufacturers of the connectors, that his fears were unfounded. 90 On 4 August 2014, Escha GmbH, to whom Krislite’s photographs of the allegedly defective Canopy lighting connectors had been forwarded, advised LED Germany that far from being a defect, “[the] gap ensures that the sealing is at the right position” and was needed to fulfill the IP67 standard. Escha GmbH also stated that there was a radial sealing inside the connector that ensured that no water can penetrate into the connectors. 91 In the meantime, Hyundai’s chief engineer, Mr Raju, who testified that it was Krislite who brought the issue of the gaps between the connectors to the attention of the consultants, “strongly” instructed Krislite in an email on 7 August 2014 to send a sufficient number of the light fixtures and connectors to a local independent laboratory for IP67 compliance tests. Part of the letter is as follows: … Your immediate action required to send sufficient quantity of both the light fixture and connectors to a local independent laboratory for IP67 testing. This shall be carried out as soon as possible in order to prove that the quality of the suspected delivered materials and also without causing any delay for the installation….So we strongly instruct you to proceed the lab test to prove the quality and IP rating compliance without any further delay. [emphasis added] 92 Although Krislite was obliged under its contract with Hyundai to act on the latter’s instructions, it did not send the light fixtures and connectors for testing. Instead, it attempted to push the responsibility as well as the cost for having the lighting tested for IP67 compliance to LED Linear. As explained earlier, as the contract did not require the Canopy lighting to be sent to a local independent laboratory to be tested for IP67 compliance, LED Linear refused to bear the cost of the test. LED Linear furnished Certificate of Compliance with IP67 93 On 26 August 2014, LED Linear furnished a Certificate of Compliance issued by LED Germany on 19 August 2014 to Krislite. This certificate clearly stated that the Canopy lighting was IP67 compliant. Despite the assurances by LED Linear and LED Germany, Krislite was not convinced that the Canopy lighting was IP67 compliant and it refused to sign the delivery orders for the said lighting to enable LED Linear to collect the balance of the purchase price under the L/C, which was about to expire. 94 Hyundai’s Mr Raju informed the court that Krislite did not forward LED Germany’s Certificate of Compliance to him. More importantly, he added that if he had seen this certificate, he would have been reassured by the manufacturer’s assurance that the connectors were IP67 compliant.12Foot Note 12×Transcripts, 10 June 2016, p 112, lines 15 to 22.Mr Raju also admitted that the fears about the gaps in the connectors, which were fuelled by Krislite, had no basis as he testified as follows:13Foot Note 13×Transcripts, 13 June 2016, p 11, lines 9 to 15. Q: Your suspicions regarding the gap being a defect were, in fact, misconceived. Agree or disagree? A: Agree. Q: In fact, Hyundai was content to also rely on Krislite’s misconceived position that there was a defect in the lights. Agree or disagree? A: Agree. LED Linear Germany sends samples of connectors for testing in Germany 95 To prove that the connectors for the Canopy lighting were IP67 compliant, LED Linear Germany sent samples of similar connectors to Phoenix Testlab GmbH (“Phoenix”), an accredited laboratory in Germany, for testing in September 2014. In its report dated 2 October 2014 (the “Phoenix Report”), Phoenix found that the sample connectors were IP67 compliant and capable of withstanding the ingress of water. The Phoenix Report was forwarded to Krislite on 8 October 2014. 96 Krislite, which pointed out that the Phoenix Report was sent to it after it had already rejected the Canopy lights, contended that this report should not be relied on as no representative from Phoenix came to prove the report. However, the report was included in the “Agreed Bundle of Documents” without any reservations as to its admissibility. InGoh Ya Tian v Tan Song Gou[1981-1982] SLR(R) 193, Lai Kew Chai J held (at [12]) that if it is clear that the documents in an agreed bundle are admitted into evidence by consent, they form part of the evidence before the court. Furthermore, inPress Automation Technology Pte Ltd v Trans-Link Exhibition Forwarding Pte Ltd[2003] 1 SLR(R) 712, Judith Prakash J (as she then was) stated (at [22]) that the effect of the parties’ agreement to the inclusion of a report as one of the agreed documents is that they had agreed that it would be admissible without formal proof. 97  Krislite also asserted that the Phoenix Report was not helpful as the light fittings that were tested were not taken from the Canopy lighting in its possession. Mr Duteil testified that the results of this test were applicable to the Canopy lighting. It was not put to him that there was a difference between the samples submitted to Phoenix and the Canopy Lighting which rendered the Phoenix Report unreliable. 98 As for Krislite’s point that it had already rejected the Canopy lighting by the time the Phoenix Report was received, this is not relevant if it had no right to reject the said lighting. In any case, LED Linear was entitled to rely on this report to say that it showed that it had taken the correct position all along that the Canopy lighting was IP67 compliant. Local laboratory test for IP67 compliance 99 For the purpose of the trial, LED Linear wanted to have some of the connectors for the Canopy lighting that were still in Krislite’s possession sent to a local laboratory in early 2016 to determine whether or not they were IP67 compliant. 100 Krislite refused to hand over the connectors in its possession for the local test. In view of this, LED Linear applied for and obtained a court order compelling Krislite to hand over some of these items for the proposed test by TUV-SUD=PSB, an independent Singapore laboratory. Mr Tan Heng Khoon, the expert appointed by the local laboratory, selected six connectors with the widest gaps and tested four of them for IP67 compliance. TUV-SUD=PSB reached the same conclusion as LED Germany and Phoenix Testlab that the connectors were IP67 compliant. The report by TUV-SUD=PSB (the “local test report”) stated as follows: All 4 connectors (S1, S2, S3 and S4) were identicallybone dryandfree from dustafter IP67 test. All the 4 connectors (S1, S2, S3 and S4) that were subjected to IP67 test weredeemed to comply with IP67 requirementsof IEC 60598-1:2014 (clauses 9.2.1 and 9.2.8), to be read in conjunction with IEC 60259: 2001 with amendment 2:2013. [emphasis added] 101 When faced with the results in the local test report, Krislite tried to downplay its significance by suggesting that the laboratory only tested the connectors and not the entire strip of lights for IP67 compliance. This is not a valid argument as Krislite’s pleaded position was that the connector gaps affected IP67 compliance and the test established that this is not a defensible position. 102 In any case, Krislite’s managing director, Mr Teo, conceded that IP67 compliance was no longer an issue as he now accepted that the local test report showed that there was no problem with the connectors.14Foot Note 14×Transcripts, 9 June 2016, p 54, lines 19 to 22.Krislite’s witness admitted that only true defect is the illumination problem 103 When cross-examined, Krislite’s Mr Quek agreed that had his company tested the lights in August 2014 when it was ordered to do so by Hyundai, it would have discovered that the connectors were IP67 compliant and it would have had no reason not to sign the delivery orders to enable the balance of the purchase price for the Canopy lighting to be paid.15Foot Note 15×Transcripts, 9 June 2016, p 105 line 20 to p 106, line 6.Mr Quek went so far as to concede that with the finding that the connectors were IP67 compliant, the only “true defect” concerned the illumination of the 5.49% of the Canopy lighting strips,16Foot Note 16×Transcripts, 9 June 2016, p 54, lines 19 to 22.which was dealt with earlier on in this judgment. Conclusion on the connector gaps 104 I find that Krislite’s complaint about the connector gaps lacks merit and that it did not prove that LED Linear breached any express term or any of the implied terms in the SGA by supplying it with connectors that were of unsatisfactory quality or unfit for their purpose. As such, Krislite cannot rely on the alleged defects in the connector gaps to justify its rejection of the entire consignment of Canopy lights that were delivered to it.",
        "Whether Krislite’s Standard Terms applied to the contract": "105 To shore up its case, Krislite contended that its own Standard Terms and Conditions (the “Standard Terms”) were applicable to the contract. Krislite wanted to rely on cl 6 of the Standard Terms, which gave it a right to reject the Canopy lights if the goods were,in its opinion, defective. This rather one-sided clause provides as follows: If in the opinion of the Purchasers any of the goods delivered to Purchases under the order is found to be defective or not in conformity with the requirements or other faults in the Purchaser’s discretion, Purchasers shall have the right to reject such goods or require the Sellers to rework the goods…. 106 The Standard Terms were not referred to or attached to the revised LOI, which was drafted by Krislite. In fact, although a fleeting reference was finally made to the Standard Terms in the POs issued by Krislite, the said terms were only forwarded to LED Linear by way of an email attachment on 8 May 2014, more than one year after the revised LOI was issued and more than two months after Krislite had issued its POs for the Canopy lighting. This email ended with the words “T & C for our company is all attached fyi”. Krislite made no further reference to the Standard Terms until 11 September 2014. Krislite’s witness admitted that its Standard Terms did not apply 107 Significantly, Krislite’s Mr Loh admitted that the Standard Terms were so one-sided and onerous that had LED Linear been made aware of the said terms, it would not have agreed to them. More importantly, he testified that Krislite knew that LED Linear never agreed to the Standard Terms and that Krislite dealt with LED Linear on the basis that the Standard Terms were inapplicable. The relevant part this damning testimony is as follows:17Foot Note 17×Transcripts, 9 June 2016, p 54, lines 19 to 22. Q: … There is no evidence that your company has presented in court showing that LED Linear had accepted Krislite’s terms and conditions, isn’t that right? A: Yes. Q: …So I put it to you that … LED Linear has never accepted Krislite’s terms and conditions. Agree or disagree? A: Yes. Q: Yes. So Krislite continued to fulfil its obligations under the contract,knowing that the terms and conditions, your terms and conditions didn’t apply. A: Yes. Conclusion on applicability of Krislite’s Standard Terms 108 For the reasons given, and especially so in the face of Mr Loh’s testimony on the Standard Terms, Krislite’s assertion that the Standard Terms were incorporated into the contract for the supply of lighting for the Project must be rejected.",
        "Whether there was an implied term that the main contractor and consultants must approve and accept the Canopy lighting": "109 I now turn to Krislite’s contention that it was entitled to reject the Canopy lighting as there was an implied term that the said lighting has to be approved and accepted by the main contractor and/or the consultants. Its case was that the Canopy lighting was rejected by the consultants. 110 LED Linear retorted that the approval of Hyundai and the consultants was, in accordance with the revised LOI, only relevant to the sample lights that were used in the mock-up, long before the order for the Canopy lighting was confirmed. 111 Krislite’s reliance on the suggested implied term is flawed. To begin with, it did not prove that the Canopy lights were rejected by Hyundai and the consultants. That the consultants did not reject the Canopy lighting was made clear by the consultant in charge of the façade work in the Project, Mr Kwang, to whom Krislite’s solicitors had written as follows: Our client intends to call you as a witness to testify on their behalf, in particular whether and why you rejected the Canopy lights supplied by LED Linear. To this end, if you are willing to testify on behalf of Krislite, we will need to meet up with you to take your statement. [emphasis added] 112 On 28 October 2015, Mr Kwang replied to Krislite’s solicitors and made it clear that the lighting supplied by LED Linear had not been rejected by the consultants. He stated as follows: I would not be willing and am not available to be the witness for your client. For the purpose of clarity, kindly note the following: … 2)I am unable to agree that the consultant had rejected the light supplied. We simply could not accept the lighting suppliedbecause of the alleged defects as [highlighted] and brought to our attention by [Hyundai]/Krislite. [emphasis added] 113 Mr Kwang, who declined to be Krislite’s witness, had to be subpoenaed to testify at the trial. When cross-examined, he stood by his statement in his letter dated 28 September 2015 to Krislite’s solicitors that the consultants did not reject the lighting supplied by LED Linear.18Foot Note 18×Transcripts, 13 June 2016, p 65, line 22 to p 66, line 21. 114 That the consultants did not reject the Canopy lighting was corroborated by the lighting consultant, Mr Schneider, who testified that it was Krislite and Hyundai who withdrew LED Linear’s light fittings from the Project because of “legal issues” or a “legal case with the manufacturer”. 115 Apart from the fact that it was not established that the Canopy lighting had been rejected by the consultants, Krislite failed to prove the existence of the alleged implied term. InSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193, where the Court of Appeal stressed that the process of implication of terms is best understood as an exercise in giving effect to the parties’ presumed intentions, Sundaresh Menon CJ explained (at [101]) as follows: … [T]he implication of terms is to be considered using a three-step process: (a) The first step is to ascertain how the gap in the contract arises. Implication will be considered only if the court discerns that the gap arose because the parties did not contemplate the gap. (b) At the second step, the court considers whether it is necessary in the business or commercial sense to imply a term in order to give the contract efficacy. (c) Finally, the court considers the specific term to be implied. This must be one which the parties, having regard to the need for business efficacy, would have responded “Oh, of course!” had the proposed term been put to them at time of the contract. If it is not possible to find such a clear response, then, the gap persists and the consequences of that gap ensue. 116 Krislite failed to show that there was a gap in the contract that required the implication of a term to the effect that the Canopy lighting was subject to the acceptance by the consultants. Neither was it established that such an implied term was necessary to give business efficacy to the contract (seeThe Moorcock(1889) 14 PD 64) or that it would not pass the officious bystander test outlined by MacKinnon LJ’s judgment inShirlaw v Southern Foundries (1926) Ltd[1939] 2 KB 206. The parties had given due consideration to the role of the consultants in the contract and had agreed that the revised LOI was binding subject to “officialsampleapproval from the Client & Consultants” [emphasis added]. If the parties had wanted to give Krislite an additional right to reject the lighting if the consultants did not accept the lights at some future time after having approved the sample, this should have been provided for in the contract. 117 I thus find that Krislite’s arguments in relation to the alleged implied term lacked substance and did not advance its case in relation to the Canopy lighting in any way.",
        "Conclusion on the Canopy lighting": "118 Krislite was not entitled to reject the entire batch of Canopy lighting, and especially so when LED Linear offered to replace the 5.49% of the lighting strips with illumination defects. As such, I hold that Krislite has to pay LED Linear the remaining 50% of the price for the Canopy lighting less the cost of the defective lights that LED Linear had offered to replace. Interest on this sum is payable at the rate of 5.33% from the date of the writ to the date of judgment.",
        "The Tower lighting": "119 As for the dispute between the parties regarding the delivery of the Tower lighting, it should be noted at the outset that in accordance with the terms of the contract, Krislite had already paid to LED Linear half the cost of the said lighting, which amounted to $408,734.71, and the L/C required for the payment of the balance of the purchase price for these lights had already been put in place by Krislite. 120 The Tower lighting was to be delivered by LED Linear to Krislite by 29 August 2014. Although the contract required LED Linear to deliver the Tower lighting before it was entitled to claim the balance of the purchase price, it unilaterally varied the agreed terms for the time and mode of payment and insisted that it be paid the remaining 50% of the purchase price for the Tower lighting by telegraphic transfer before it would deliver the said lighting to Krislite. LED Linear’s unilateral variation of the terms was not accepted by Krislite, which insisted that the former deliver the Tower lighting on the basis of the original payment terms. Krislite gave LED Linear a final chance to deliver the Tower lighting 121 On 11 September 2014, Krislite gave LED Linear a final chance to deliver the Tower lighting by 18 September 2014 when it wrote to the latter as follows: 7By your email dated 26 August 2014, you informed us that you will not be supplying the lights to us unless we make payment of the remaining 50% by T/T. Your change of payment terms at this late stage is unreasonable, was never agreed to by us and in breach of contract. 8 Your refusal to supply us with the lights will cause us to be in breach of contract with the main contractor and render us liable to payment of liquidated damages for delay. 9 Nonetheless, we are prepared to give you one final chance to supply and deliver the lights. 10 Please note that if the lights are not delivered to uswithin the next seven (7) days, we will terminate the contract/PO and claim all loss and damage incurred from you. [emphasis in original] 122 Although LED Linear knew that Krislite had strict timelines to follow for the installation of the Tower lighting, which was customised for the Project, it was quite content to hold on to the Tower lighting as a bargaining chip to force Krislite to pay the balance of the purchase price for the Canopy lighting. As neither party budged from their respective positions, the Tower lighting was not delivered and the L/C for the said lighting, which was intended to pay LED Linear the balance of the purchase price for the said lighting, expired on 14 September 2014. Krislite purchased from other suppliers the lighting required to fulfil its commitment to Hyundai to supply external light fittings for the two towers in the Project. 123 Despite refusing at the material time to deliver the Tower lighting to Krislite except on unilaterally imposed new terms, LED Linear now seeks an order for specific performance of the contract to require Krislite to take delivery of the said lighting that is no longer required for the already completed Project and to pay the balance of the purchase price for the redundant lighting. 124 Krislite contended that LED Linear repudiated the contract by refusing to deliver the Tower lighting at the material time and that it was entitled to accept the repudiation.",
        "Whether LED Linear could unilaterally alter the terms of the contract": "125 Whether or not LED Linear’s claim against Krislite regarding the Tower lighting is sustainable depends on whether it was entitled to unilaterally alter the terms of the contract regarding the time and mode of payment for the said lighting and to refuse to deliver the said lighting unless Krislite complied with its new terms. LED Linear’s explanation on why it imposed the new payment terms 126 In its Reply and Defence to Counterclaim (Amendment No 1), LED Linear sought to justify its unilateral imposition of new payment terms for the Tower lighting as follows: …The Plaintiff avers that as a result of the Defendant’s failure, refusal and/or neglect to make payment under the L/C for the Canopy Lighting, the Plaintiff no longer had confidence that the Defendant would honour its obligations under the Contract. The Plaintiff therefore informed the Defendant by way of its solicitor’s letter dated 18 September 2014 that it would require the Defendant to make the remaining 50% payment for the North and South Tower Lighting by a secured payment method such as a cashier’s order. The Plaintiff denies that the change in payment terms constituted a breach of the Contract. No unilateral imposition of new terms is allowed 127 It is trite that a party cannot unilaterally alter the agreed terms of a contract. While LED Linear claimed in para 16 of its Statement of Claim (Amendment No 1) that it remained willing and able to perform its obligations under the contract, it ought to be noted that inSan International Pte Ltd v Keppel Engineering Pte Ltd[1998] 3 SLR(R) 447, the Court of Appeal accepted (at [20]) that there could be a repudiation where the “party in default may intend in fact to fulfil the contract but may be determined to do so only in a manner substantially inconsistent with his obligations, or may refuse to perform the contract unless the other party complies with certain conditions not required by its terms”. This is precisely the situation in this case as LED Linear offered to perform its obligations under the contract only if Krislite accepted its new terms on the mode and time of payment for the Tower lighting. This is a breach of its obligation under the contract to deliver the Tower lighting in order to be in a position to rely on the L/C that was already in place to claim the balance of the purchase price for the said lighting. 128 LED Linear sought to rely onWithers v Reynolds(1831) 2 B & AD 882 to support its contention that it was entitled to withhold the delivery of the Tower lighting to Krislite unless the latter accepted its revised terms and paid for the goods in full before delivery. However, that case is clearly distinguishable from the present case. In that case, the defendant agreed on 20 October 1829 to supply the plaintiff, a stable-keeper, with straw to be delivered at the rate of three loads per fortnight at an agreed price for each load of straw delivered. The straw was sent regularly from October 1829 to the end of January 1830, by which time the plaintiff had not paid for several loads of straw. When asked to pay the amount due, the plaintiff paid for all the straw delivered except for the last load and claimed to be entitled to keep one load in hand without having to pay for it until the next load arrives. This was a unilateral change of the terms of payment by the purchaser. Lord Tenterden CJ, who pointed out that the contract provided for the payment for the straw upon delivery and did not require the defendant to give credit to the plaintiff for an indefinite period of time, said that the only question was whether upon the plaintiff saying “I will not pay for the goods on delivery”, it was incumbent on the defendant to go on supplying straw to the plaintiff when he was clearly not obliged to do so. That it was the plaintiff’s unilateral change of the terms of payment which persuaded the court to hold that the defendants were no longer obliged to send straw to the plaintiffs was made clear by Patteson J, who said (at p 885) that if “the plaintiff had merely failed to payfor any particular load, that, of itself, might not have been an excuse to the defendant for delivering no more straw” [emphasis added]. He added that the position was different because the plaintiff had expressly refused to pay for the loads as delivered, as was required under the contract, and that was why the defendants were no longer obliged to continue to deliver straw to the plaintiffs. 129 Unlike the defendant inWithers v Reynolds, Krislite did not say that it would not pay the balance of the purchase price of either the Canopy lighting or the Tower lighting and did not attempt to alter the terms of the contract on payment. With respect to the Canopy lighting, Krislite erroneously thought that it was entitled to have all the lights changed before it paid the balance of the purchase price because of the mentioned problems with these lights. In this context, it is worth noting that inBrani Readymixed Pte Ltd v Yee Hong Pte Ltdand another appeal[1994] 3 SLR(R) 1004, the Court of Appeal made it plain (at [18]) that the mere failure or delay in making payment per se would not amount to a repudiation of the contract. LED Linear did not allege that non-payment of balance of purchase price for the Canopy lighting was a repudiation of the contract 130 If LED Linear believed that Krislite had repudiated the contract by not paying the balance of the purchase price for the Canopy lighting, it could have pointed this out to the latter and taken steps to accept the alleged repudiation. However, it chose not to do so and it did not plead that Krislite had repudiated the contract by refusing to sign the delivery orders to enable it to rely on the L/C to claim payment for the balance of the purchase price of the Canopy lighting. Instead, its position was that it no longer had confidence that Krislite would honour its obligations under the contract by paying the balance of the purchase price for the Tower lighting and that was why it unilaterally changed the terms of payment for the Tower lighting. Fears that the other party might not pay does not, without more, entitle LED Linear to unilaterally change the terms of payment for the Tower lighting. Conclusion on LED Linear’s unilateral imposition of new terms 131 As I have found that LED Linear had no basis for unilaterally changing the terms of the contract with respect to the time and mode of payment, it breached the contract by refusing to deliver the Tower lighting to Krislite except on new terms that were inconsistent with the agreed terms of the contract.",
        "Whether LED Linear’s refusal to deliver the Tower lighting was a repudiatory breach": "132 Whether or not Krislite was entitled to terminate the contract on account of LED Linear’s breach in failing to deliver the Tower lighting on time depends on whether the breach falls within one of the four situations referred to inRDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltd and another appeal[2007] 4 SLR(R) 413 (at [90]) (“RDC Concrete Pte Ltd”), under which an innocent party is entitled to terminate a contract. These situations were summarised by the Court of Appeal inMan Financial (S) Pte Ltd v Wong Bark Chuan David[2008] 1 SLR(R) 663 as follows (at [154] – [158]): 154    Thefirst(“Situation 1”) is where the contractual term in question clearly and unambiguously states that, should an event or certain events occur, the innocent party would be entitled to terminate the contract (seeRDC Concreteat [91]). 155    Thesecond(“Situation 2”) is where the party in breach of contract (‘the guilty party’), by its words or conduct, simplyrenouncesthe contract inasmuch as it clearly conveys to the innocent party that it will not perform its contractual obligations at all (seeRDC Concreteat [93]). 156    Thethird(“Situation 3(a)”) is where the term breached … is aconditionof the contract. Under what has been termed the “condition-warranty approach”, the innocent party is entitled to terminate the contract if the term which is breached is a condition (as opposed to a warranty): seeRDC Concreteat [97]. The focus here, unlike that in the next situation discussed below, is not so much on the (actual) consequences of the breach, but, rather, on thenature of the termbreached. 157    Thefourth(“Situation 3(b)”) is where the breach of a term deprives the innocent party of substantially the whole benefit which it was intended to obtain from the contract (seeRDC Concreteat [99]). (This approach is also commonly termed the ‘Hongkong Firapproach’ after the leading English Court of Appeal decision ofHongkong Fir Shipping Co Ltd v Kawasaki Kisen Kaisha Ltd[1962] 2 QB 26; see especiallyidat 70.) The focus here, unlike that in Situation 3(a), is not so much on the nature of the term breached, but, rather, on thenature and consequences of the breach. 158    Because of the different perspectives adopted in Situation 3(a) and Situation 3(b), respectively (as briefly noted above), which differences might, depending on the precise factual matrix, yield different results when applied to the fact situation, this court inRDC Concreteconcluded that, as between both the aforementioned situations, the approach in Situation 3(a) should beapplied first, as follows (idat [112]): If the term is acondition, then the innocent party would be entitled to terminate the contract.However, if the term is awarranty(instead of a condition), then the court should nevertheless proceed to apply the approach in Situation 3(b) (viz, theHongkong Firapproach). [emphasis in original] 133 To begin with, LED Linear’s breach falls within the ambit of Situation 3(a) because the delivery of the Tower lighting on time is a condition. The effect of s 10(1) of the SGA is that whether or not stipulations as to time other than the time of payment is of the essence of the contract depends on the terms of the contract. The contract between LED Linear and Krislite was silent on this matter but it is noteworthy that in relation to the time for delivery of goods, McCardie J stated inHartley v Hymans[1920] 3 KB 475 (at 484) as follows: In ordinary commercial contracts for the sale of goodsthe rule clearly is that time isprima facieof the essence with respect to delivery…. Now, if time for delivery be of the essence of the contract, as in the present case,it follows that a vendor who has failed to deliver within the stipulated period cannot prima facie call upon the buyer to accept delivery after that period has expired. He has himself failed to fulfil the bargain and the buyer can plead the seller's default and assert that he was not ready and willing to carry out his contract. That this is so seems clear. It is, I take it, the essential juristic result when time is of the essence of the contract…. [emphasis added] 134 The decision inHartley v Hymanswas followed by the Court of Appeal inHimatsing & Co v Joitaram PR[1968-1970] SLR(R) 766, where Wee Chong Jin CJ reiterated (at [13]) that it “is also clear law that in most mercantile transactions, as regards stipulations other than those relating to time of payment, time is of the essence of the contract”. 135 It follows that having failed to deliver the Tower lighting on time, LED Linear cannot, without more, call upon Krislite to accept after the period of delivery of the said lighting has long expired.",
        "LED Linear claims that its breach is only a breach of warranty": "136 LED Linear asserted that even if it breached the contract by failing to deliver the Tower lighting on time, this was merely a breach of warranty. This assertion cannot be taken seriously. In any case, a breach of warranty must be viewed in the context of Situation 3(b) outlined inRDC Concrete Pte Ltd, where Andrew Phang JA explained (at [107]): If … the term breached is a warranty, we are of the view that the innocent party is not thereby prevented from terminating the contract (as it would have been entitled so to do if the condition-warranty approach operated alone). Considerations of fairness demand, in our view, that the consequences of the breach should also be examined by the court, even if the term breached is only a warranty (as opposed to a condition)…. There would, of course, be no need for the court to examine the consequences of the breach if the term breached was a condition since, ex hypothesi, the breach of a condition would (as we have just stated) entitle the innocent party to terminate the contract in the first instance.Hence, it is only in a situation where the term breached would otherwise constitute awarranty that the court would, as a question of fairness, go further and examine the consequences of the breach as well. In the result, if the consequences of the breach are such as to deprive the innocent party of substantially the whole benefit that it was intended that the innocent party should obtain from the contract, then the innocent party would be entitled to terminate the contract, notwithstanding that it only constitutes a warranty.If, however, the consequences of the breach are only very trivial, then the innocent party would not be entitled to terminate the contract. [emphasis added] 137 The delivery of the Tower lighting on time concerned a major part of LED Linear’s contractual obligations under the contract. The very serious consequences of not delivering the Tower lighting to Krislite on time were known to LED Linear, which also knew or ought to have known that Krislite had to deliver the Tower lighting to be installed before the main contractor, Hyundai, removed the scaffolding around the buildings in the Project. Furthermore, LED Linear knew that Krislite would be in breach of its contract with Hyundai to supply LED lighting to the Project if it did not deliver the Tower lighting on time. In these circumstances, there can be no doubt that the failure to deliver the Tower lighting cannot be a breach of a warranty as it deprived Krislite of substantially the whole benefit it was intended to obtain from LED Linear’s remaining obligations under the contract and had such serious consequences that Krislite was entitled to regard itself from having been discharged from the contract by LED Linear’s breach.",
        "Where a party who accepts the other party’s repudiation is also in breach": "138 The fact that Krislite is also in breach of contract by failing to pay the balance of the purchase price of the Canopy lights does not, by itself, affect its right to treat the contract as having been repudiated by LED Linear’s breach in failing to deliver the Tower lighting. InState Trading Corporation of India Ltd v M Golodetz Ltd[1989] 2 Lloyd’s Rep 277 at 286, Kerr LJ explained as follows: The fact that in the present case both parties had committed breaches before one of them elected to treat the contract as repudiated appears to me to make no difference whatever; nor the fact that (assumedly) both had been breaches of condition. If A is entitled to treat B as having wrongfully repudiated the contract between them and does so, then it does not avail B to point to A’s past breaches of contract, whatever their nature. A breach by A would only assist B if it was still continuing when A purported to treat B as having repudiated the contract and [this emphasis is in the original text] if the effect of A’s subsisting breach was such as to preclude A from claiming that B had committed a repudiatory breach. In other words, B would have to show that A, being in breach of an obligation in the nature of a condition precedent, was therefore not entitled to rely on B’s breach as a repudiation. 139 Kerr LJ’s view was approved inJet Holding Ltd and others v Cooper Cameron (Singapore) Pte Ltd and another and other appeals[2006] 3 SLR(R) 769 (at [98]) by the Court of Appeal, which noted (at [99]) that it is “both logical and principled”. A similar approach was adopted by the Court of Appeal inAlliance Concrete Singapore Pte Ltd v Comfort Resources Pte Ltd[2009] 4 SLR(R) 602 (at [46]). 140 It may be recalled that LED Linear did not plead that Krislite was guilty of a repudiatory breach. If all the circumstances of the case are taken into account, the fact that Krislite was itself in breach by failing to pay the balance of the purchase price for the Canopy lighting does not prevent it from taking the position that LED Linear’s failure to deliver the Tower lighting was a repudiatory breach that entitled it to terminate the contract.",
        "Conclusion on the Tower lighting": "141 For the reasons stated, I find that LED Linear’s refusal to deliver the Tower lighting to Krislite on time except on unilaterally imposed revised terms was a repudiatory breach and that Krislite was entitled to accept the repudiation. It follows that LED Linear is liable in damages to Krislite for the breach. No question of mitigation of damage arises as this was not pleaded by LED Linear. 142 Krislite claimed a refund of the $408,734.71 that it paid in advance for the Tower lighting. This claim is allowed and interest is payable on this sum at the rate of 5.33% from the date of the writ to the date of judgment.",
        "Krislite’s counterclaim": "143 In its counterclaim, Krislite also pleaded that it was entitled to damages for having to replace the Tower lighting with lighting purchased from other suppliers. As there was no order for a bifurcated trial, there is no separate hearing for the assessment of such damages. As Krislite clearly failed to furnish proof of its alleged loss in procuring the LED lighting required for the North and South Towers from other sources, this matter need not be considered any further.",
        "Costs": "144 LED Linear succeeded in its claim in relation to the Canopy lighting while Krislite succeeded in its case with respect to the Tower lighting. After taking all circumstances into account, including the fact that far too much time was spent during the trial on trivial issues regarding the Canopy lighting, each party is to bear its own costs. Tan Lee MengSenior Judge Lim Tat and Subir Singh Grewal (Aequitas Law LLP) for the plaintiff;John Chung and Kok Zihao (Kelvin Chia Partnership) for the defendant."
    }
}