{
    "case_title": "Smile Inc Dental Surgeons Pte Ltd vOP3 International Pte Ltd",
    "ncitation": "[2017] SGHC 246",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 Smile Inc Dental Surgeons Pte Ltd (the “plaintiff”) is a Singapore-incorporated company that is in the business of providing dental services. The plaintiff operates several dental clinics in Singapore. OP3 International Pte Ltd (the “defendant”) is a Singapore-incorporated company that provides,inter alia, interior design and fitting out services. 2 The plaintiff sues the defendant for damages and losses, including damages for loss of management time and effort and wasted expenses and overheads. The plaintiff avers that these damages and losses were caused by: (a) the defendant’s failure to exercise a reasonable standard of care, skill and diligence in executing certain fitting-out works (the “Works”) for the plaintiff’s clinic at Suntec City Mall, 3 Temasek Boulevard #02-326/327, Singapore 038983 (the “Suntec Clinic”), and the defendant’s failure to ensure that the Works were designed and carried out in a manner such that the Suntec Clinic would be fit for its purpose; (b) the defendant’s delay in completing the Works; and (c) the defendant’s failure to provide as-built drawings and documents to the plaintiff, which caused the plaintiff’s fitting-out deposit of $3,000 (the “Fitting-Out Deposit”) to be forfeited. 3 According to the plaintiff, the defendant’s defective design and construction of the Suntec Clinic resulted in two episodes of flooding at the Suntec Clinic (the “1st Flood” and the “2nd Flood”). After the 1st Flood, the defendant did not properly investigate the cause of the flooding and failed to carry out the necessary rectifications to the design and construction of the drainage system despite being given the opportunity to do so. This resulted in the 2nd Flood. The plaintiff’s case is simply that the drainage system should not have been designed or constructed the way it was. The defendant’s design or construction was incorrect and inadequate for the plaintiff’s purposes. 4 The defendant counterclaims for the unpaid balance sum of $79,005.00 (the “Balance Sum”) for the Works, and the unpaid sum of $39,128.00 for the variation works, set out in its revised variation quotation order dated 10 September 2013 (the “2nd Variation Quotation”),1Foot Note 1×Mr Foo Kian Beng’s AEIC (“Mr Foo’s AEIC”) at para 39.that it allegedly carried out on the plaintiff’s request. 5 I bifurcated the trial, ordering the issue of liability to be tried first, to limit the number of issues for the first tranche of the trial.",
        "The plaintiff’s requirements and the defendant’s appointment": "6 The plaintiff required its Suntec Clinic to be fitted out in the same style and design, and with the same finishes, as its other clinics. The plaintiff required the Works to be completed well before the grand opening of the refurbished Suntec City Mall on 12 September 2013 (the “Grand Opening”), as the plaintiff intended the opening of its Suntec Clinic to coincide with the Grand Opening. 7 In January 2013, the plaintiff appointed an interior designer, Mr Peter Tay (“Mr Tay”), who had previously fitted out the plaintiff’s other clinics at the Mandarin Gallery (the “Mandarin Gallery Clinic”) and the Sail, to fit-out its Suntec Clinic. 8 The plaintiff then provided drawings, albeit these were subject to change, on some aspects of the Works, to the defendant, to enable the latter to prepare the initial quotation. The defendant submitted a quotation dated 19 July 2013 for the Works (the “19 July 2013 quotation”),2Foot Note 2×1AB 282–288.which was accepted by the plaintiff on the same day.3Foot Note 3×1AB 288.According to the plaintiff, the agreement to complete the Works for the sum of $158,010 (the “Contract Sum”) was made partly orally, partly in writing and partly by conduct (the “Agreement”).4Foot Note 4×Statement of claim (Amendment No 2) (“SOC”) at paras 3–4.However, the defendant maintains that the Agreement was wholly in writing and as captured in the 19 July 2013 quotation accepted by the plaintiff.5Foot Note 5×Defence and counterclaim (Amendment No 1) (“Defence”) at para 3.",
        "The material terms of the Agreement": "9 According to the plaintiff, the material terms of the Agreement included,inter alia, the following:6Foot Note 6×Plaintiff’s closing submissions at para 11. (a) The Works were to be completed by 31 August 2013, which deadline the plaintiff extended to 11 September 2013.7Foot Note 7×2AB 604. (b) The standards applicable to the finishes were those of the Mandarin Gallery Clinic. The defendant visited the Mandarin Gallery Clinic to ascertain the finishes required for the Suntec Clinic before preparing its quotation for the Works. (c) The defendant was to design and construct a plumbing system that would drain effluent water from the sinks, suction pipes and spittoons connected to the dental chairs in the Suntec Clinic. (d) The defendant was to issue to the plaintiff the as-built drawings and other documents in relation to the Works, which were required for the Management Corporation Strata Title (“MCST”) to release the Fitting-Out Deposit upon or within a reasonable time of the completion of the Works; 10 However, the defendant disputes that the term relating to the standards for the Works (see [9(b)] above) was part of the terms of the Agreement.8Foot Note 8×Defendant’s reply submissions at para 10. 11 The Agreement also expressly provided that the Works were subject to “additional orders and changes to on-site works”, which “will be charged accordingly as Variation Orders”.",
        "The plaintiff’s claims": "12 The plaintiff claims,inter alia, the following heads of damage:9Foot Note 9×SOC at para 27. (a) loss of profit/damages from 12 September 2013 to 31 October 2013, which resulted from the defendant’s delay in handing over the Suntec Clinic to the plaintiff; (b) loss of profit/damages arising from the closure of the Suntec Clinic, from 17 January 2014 to 8 March 2014, after the 1st Flood; (c) loss of profit/damages arising from the closure of the Suntec Clinic, from 29 July 2014 to 5 March 2015, after the 2nd Flood; and (d) loss of the Fitting-Out Deposit due to the defendant’s failure to submit the required drawings and documents, which resulted in the  MCST forfeiting the deposit.",
        "The defendant’s defence": "13 The defendant pleads the following in its defence.10Foot Note 10×Defence at paras 24, 27, 29, 30, 35, 40, 46, 48 and 50. (a) The delay in completion was caused by the plaintiff’s multiple revisions to the drawings. It received the final revised drawings as late as 11 September 2013. (b) The drainage downpipe for water to be discharged out of the Suntec Clinic (the “Drainage Downpipe”) was situated in a raised bunded area (the “Bunded Area”). The Suntec Clinic produced debris, which clogged up the white circular plastic floor grating (the “Floor Grating”) that covered the Drainage Downpipe. This caused water to overflow the Bunded Area. (The Bunded Area is 340mm in length and 300mm in breadth, and is enclosed by a bunded concrete wall 65mm in thickness and 100mm in height. The photographs in Annex A to this judgment show the Bunded Area.) (c) The plaintiff failed to carry out regular maintenance of the Floor Grating, even though the defendant installed an access panel to facilitate maintenance (the “Access Panel”) after the 1st Flood and reminded the plaintiff to carry out maintenance. This caused the Floor Grating to be clogged once again, which led to the 2nd Flood.",
        "The issues": "14 Accordingly, the following issues fall to be determined: (a) First, was there a delay in the completion of the Works (the “First Issue”)? (b) Secondly, did the defendant breach its duties to the plaintiff in designing and constructing the drainage system in the Suntec Clinic, which was not fit for its purpose, and in failing to rectify its design or construction after the 1st Flood (the “Second Issue”)? (c) Thirdly, was the defendant liable for the forfeiture of the Fitting-Out Deposit (the “Third Issue”)? (d) Fourthly, is the defendant entitled to recover for its counterclaim and, if so, to what extent (the “Fourth Issue”)? I shall now address these issues in turn.",
        "The First Issue": "15 The defendant commenced work in July 2013. The defendant claims that it handed over the Suntec Clinic to the plaintiff in late October 2013. The plaintiff denies that there was a proper handing over. However, it is undisputed that the plaintiff commenced operations in the Suntec Clinic on 1 November 2013. Thus, the Suntec Clinic would have been handed over to the plaintiff by 31 October 2013 at the latest; and I so find.",
        "The contractual completion date": "16 It now falls on me to determine the contractual completion date. In this regard, I note that the initial completion date was 31 August 2013 (approximately six weeks from 22 July 2013, the date on which APM Property Management Pte Ltd (“APM”) handed over the premises to the plaintiff as the tenant, upon which the plaintiff in turn handed over the premises to the defendant for the Works). In an email to the defendant dated 21 June 2013,11Foot Note 11×1AB 213–215, 215; Ms Chong Mo-Ai Grace’s AEIC (“Ms Chong’s AEIC”), exhibit GC-22, pg 129.Ms Chong Mo-Ai Grace (“Ms Chong”), the Managing Director of the plaintiff, indicated in bold: “Please add [to the quotation] Contract Period: 6 weeks”. The defendant did not object to this specification. 17 Subsequently, in the 19 July 2013 quotation, which the plaintiff accepted, the time for completion was defined by reference to a work schedule to be submitted after confirmation.12Foot Note 12×1AB 288.The “Terms & Conditions” stated: “Lead Time: Schedule will be submitted upon confirmation”.13Foot Note 13×1AB 288. 18 After further discussions between the parties, Ms Chong notified the defendant in an email sent on 26 July 2013 that the completion date was extended from 31 August 2013 to 11 September 2013.14Foot Note 14×1AB 234–236; Ms Chong’s AEIC, exhibit GC-35, pg 299. 19 On 1 August 2013, the defendant submitted a work schedule reflecting a handover date of 11 September 2013 (the “Schedule”).15Foot Note 15×Ms Chong’s AEIC, exhibit GC-38, pg 305–306.On the same day, Mr Matthew Chee Young Tock (“Mr Chee”), the Business Development Director of the defendant during the Works, emailed Ms Chong to state that the defendant was working towards the handover date of 11 September 2013.16Foot Note 16×Ms Chong’s AEIC, exhibit GC-37, pg 303. 20 On 30 August 2013, the defendant’s Mr Nicholas Goh (“Mr Goh”) sent a revised work schedule (the “Revised Schedule”) to Ms Chong. The Revised Schedule showed 25 September 2013 as the expected completion date. 21 The defendant contends as follows: (a) First, the defendant maintains that the Schedule was only a working schedule: the 11 September 2013 date stated therein was only a targeted handover date, and not a contractual completion date. (b) Secondly, the defendant claims that Ms Chong agreed to extend the completion date to 25 September 2013, and therefore 26 September 2013 became the revised handover date.17Foot Note 17×2AB 513 and 2AB 604; 3AB 634. I now address each of these contentions in turn. 22 First, I do not accept the defendant’s first contention (see [21(a)] above). I find that the parties agreed that 11 September 2013 was the extended contractual deadline for completion of the Works, in the light of the fact that the Grand Opening was scheduled on 12 September 2013 (see [6] above). This was mentioned in Ms Chong’s email dated 26 July 2013 to the defendant.18Foot Note 18×Ms Chong’s AEIC, exhibit GC-36, pg 301.Moreover, the defendant subsequently submitted the Schedule which reflected a handover date of 11 September 2013, which was one day before the date of the Grand Opening. I do not believe that the plaintiff would have agreed to a completion date later than the date of the Grand Opening. 23 In this regard, I note that Ms Chong’s email sent on 24 September 2013 to Ms Cheryl Poh of APM and copied to Mr Chee, Mr Goh and the MCST amongst others, mentioned that APMhad been askingthe plaintiff “to open in time for Suntec’s Grand Opening”.19Foot Note 19×2AB 604.This is unsurprising as whoever was coordinating the Grand Opening would have wanted all the tenanted units in Suntec City Mall to be open on that day. I find that the plaintiff was under some pressure from APM to have the Suntec Clinic opened in time for the Grand Opening on 12 September 2013. Ms Chong’s messages to Mr Chee bear this out. As early as 30 August 2013, she reminded Mr Chee several times of the 11 September 2013 deadline and continued to do so even after Mr Goh sent the Revised Schedule on 30 August 2013.20Foot Note 20×Ms Chong’s AEIC, exhibit GC-34, pg 220 and pg 224; Ms Chong’s AEIC, exhibit GC-39, pg 308.Upon receiving these reminders, the defendant did not object on the basis that the plaintiff had stipulated the wrong deadline. 24 Secondly, I also reject the defendant’s second contention (see [21(b)] above). To begin with, I note that the defendant did not plead that the plaintiff agreed to the revised handover date. Moreover, the documents which the defendant relies on in relation to this point were not put to Ms Chong during the trial. I am therefore not prepared to accept this unpleaded allegation by the defendant, which it only raised in its closing and reply submissions. 25 In any event, I find that the Revised Schedule, which showed 25 September 2013 as the expected completion date (see [20] above), was not accepted by Ms Chong. Importantly, the Revised Schedule was the result of aunilateralamendment by the defendant. Ms Chong did not agree that the contractual completion date would be extended to coincide with the revised date of handover in the Revised Schedule. 26 In this regard, I accept the plaintiff’s submission that Ms Chong’s reference to the 25 September 2013 date in her email dated 24 September 2013,21Foot Note 21×2AB 604.which was relied upon by the defendant to show her alleged acceptance of that date as the revised deadline, was not pertinent. In that email, Ms Chong was simply explaining and restating that the defendant hadunilaterallyprovided the revised deadline of 25 September 2013. This is clear from the email: As you can see, the first attached schedule … states that 12 September 2013 was the date of the handover. As the job progressed, Mr Nick Goh sent another schedule, see second email titled “Smile inc new work schedule” attached where the new deadlinewas given by OP3 themselves as 25 September 2013. I sent a [Whatsapp] reminder on 14 September 2013 reminding handover on 25 September 2013, but have not received any replies. [Emphasis added] I find that this email is in no way an admission by Ms Chong that 25 September 2013 was the agreed revised contractual date for completion of the Works. 27 I also do not construe the Whatsapp message which Ms Chong sent,22Foot Note 22×3AB 634.which was referred to in her email quoted above, to mean that Ms Chong had agreed that 25 September 2013 would be the new contractual completion date for the Works. Ms Chong had to work with the defendant to find a suitable date for the handover. However, this does not mean that Ms Chong had, in liaising with the defendant on this,agreedto extend the contractual completion date to the actual date of the handover. 28 In short, the evidence is clear to me and I find that Ms Chong did not agree to extend the 11 September 2013 deadline to 25 September 2013. She merely noted that the latter was a new deadlineunilaterallyadopted by the defendant. There was no admission by Ms Chong that 25 September 2013 was the new contractual date for the completion of the Works. 29 Critically, Mr Chee was cross-examined extensively on his understanding of the deadline of 11 September 2013. He eventually admitted that the deadline of 11 September 2013 was a contractual one,23Foot Note 23×Transcript 7 February 2017, pg 179 line 31 to pg 180 line 20; see also Transcript 8 February 2017, pg 17 line 23 to 26.and not merely an estimated date or a completion date on a best endeavour basis. 30 For all the above reasons, I find, on the totality of the evidence, that 11 September 2013 was the agreed contractual deadline, and not a “best endeavour completion date” or “an estimated completion date” as the defendant submits.",
        "The date of practical completion": "31 I have found that the plaintiff took possession of the Suntec Clinic from the defendant by 31 October 2013 (see [15] above). It is undisputed that, on that date, there were still incomplete and outstanding items of Works. Ms Chong listed a total of 36 such items in an email dated 28 October 2013 at 8.38pm to the defendant.24Foot Note 24×Ms Chong’s AEIC, exhibit GC-32, pg 862 to 864.I shall refer to this list as the “List of Outstanding Works”. 32 For the purposes of computing the delay, I will use 31 October 2013 as the date of the practical completion of the Works. This is because the plaintiff was able to proceed with its dental business in the Suntec Clinic from 1 November 2013 even though there were these 36 outstanding items.",
        "The cause of the delay in completion of the Works": "33 At this stage, the plaintiff has proven that the defendant did not complete the Works by the contractual completion date of 11 September 2013 (see [32] above). The plaintiff has also proven that the Suntec Clinic was handed over to the plaintiff well after the contractual completion date (see [30] and [32] above). It now falls on the defendant to prove its defence that the completion of the Works was in fact delayed by the plaintiff. 34 The defendant alleges that the completion of the Works was delayed by the plaintiff because the final revised drawings were only provided to the defendant on 11 September 2013. In this regard, it appears that the delay may have been attributable to some miscommunication between Ms Chong and Mr Tay. Ms Chong acknowledged that Mr Tay issued some drawings without obtaining her approval to do so, and that he should not have done this. 35 The defendant submits that the delay in providing the final drawings delayed the completion of the Works in two ways.25Foot Note 25×Defendant’s closing submissions at paras 24–30. (a) First, the delay in providing the drawings allegedly delayed the tempered glass works. The defendant claims that, in the revised drawings, changes were made to the door and wall dimensions, which affected the tempered glass measurements that were to be done on-site. The plaintiff initially requested the door width to be changed from 750mm to 900mm, before settling on 850mm. The defendant further alleges that, because of the multiple changes on-site by the plaintiff, there was a long lag time between when Ms Chong ordered the granite tiles for the flooring works and when they eventually arrived. This also affected the tempered glass measurements, according to the defendant. (b) Secondly, in its closing submissions, the defendant seeks to introduce a new allegation that the delay in providing the drawings delayed the sprinkler works. According to the defendant, on 1 August 2013, the plaintiff engaged contractors for the water sprinklers. Ms Chong informed the defendant to ensure that the positioning of the air-conditioners, sprinklers, television and lightings did not overlap. The defendant could not carry out the Works without the approved drawings. Therefore, Mr Chee told Ms Chong that the drawings had to be finalised before the defendant continued work on the ceiling. To this, Ms Chong responded that the layout would be decided “on site”. As the ceiling contained both the sprinkler points and electrical works, the defendant had to ensure that the sprinklers were installed before working on other aspects of the ceiling. However, at this stage, Mr Tay had yet to provide the drawings for the layout of the ceiling. Without the drawings, the defendant was not able to start work on the ceiling and therefore the schedule had to be pushed back. 36 The plaintiff disputes that it caused the delay in completion. In respect of the delay to the tempered glass works, the plaintiff contends that (1) the defendant caused the granite works to be delayed; and (2) the fabrication of the tempered glass was dependent on the completion of the granite works. (a) In respect of contention (1), the plaintiff avers that the defendant delayed in finalising the quantity and dimensions of the granite pieces,26Foot Note 26×Transcript 8 February 2017, pg 75 line 15 to pg 76 line 27.which then delayed Ms Chong’s ordering of the granite tiles, which could only take place on 10 September 2013. It must be noted here that the defendant contracted to supply the granite tiles for the corridor works. As the defendant’s suppliers had no stock of the granite tiles, Ms Chong ordered the granite tiles from her own supplier instead to reduce the period of delay. On 25 July 2013, when Ms Chong was ready to have the granite tiles supplied and asked Mr Chee to advise on the date of delivery,27Foot Note 27×Mr Chee’s AEIC, exhibit CYT-1, pg 94.the defendant was unable to do so because the site was not in a state to receive delivery of the tiles.28Foot Note 28×Transcript 8 February 2017, pg 75 line 15 to pg 76 line 27. (b) In respect of contention (2), the plaintiff emphasises that Mr Chee admitted that the granite flooring had to be laid before the glass supplier could measure the distance between the floor and the ceiling.29Foot Note 29×Transcript 8 February 2017, pg 32 line 8 to line 19These measurements were necessary to determine the dimensions for the glass, which had to be pre-cut off site and then brought to the site. Accordingly, the plaintiff argues that the fabrication of the tempered glass, was not delayed by the delay in issuing the 11 September 2013 drawings. 37 I accept the sequence of construction as set out by the plaintiff. I find that, until the granite tiles had been laid, the measurements on site of the dimensions of the tempered glass could not have taken place; and the tempered glass could only have been ordered after those measurements had been taken. Fabrication of the tempered glass could not be done until the tiles had been laid because the height between the floor and the ceiling could not be finalised until the granite tiles were laid. Thus, for the reasons stated by the plaintiff, I find that the defendant has failed to prove that the plaintiff caused the tempered glass works to be delayed and thereby delayed the subsequent completion of the Works. 38 With regard to the allegation introduced in the defendant’s closing submissions that the plaintiff delayed the sprinkler works, I note that this does not form part of the defendant’s pleaded case on delay, which was limited only to thevariationsconstituting the “numerous changes and add-ons to the designs” requested by the plaintiff which allegedly caused the delay.30Foot Note 30×Defence at paras 24, 27, 29 and 30.In fact, in response to the plaintiff’s application for further and better particulars regarding the defendant’s allegation that the plaintiff had delayed the Works, the defendant only stated that:31Foot Note 31×Further and Better Particulars (“FBP”) of the defence at para (1)(a) (Setting Down Bundle, pg 115). All of the changes requested for are contained in variation order 1 dated 24 October 2013 (VO 1.3). … Apart from failing to plead with sufficient particularity how exactly the plaintiff caused the Works to be delayed, it was also not put to the plaintiff’s witnesses that the plaintiff caused delay to the sprinkler works, and thereby caused the Works to be delayed. I am thus not minded to find that the plaintiff caused the delay in the completion of the Works on the basis of this new allegation by the defendant, which has been introduced at the eleventh hour. 39 In any event, I find that the defendant’s arguments in respect of the sprinkler works are without merit. The sprinkler points had been predetermined and fixed by “Tyco”, a company which appears to have been engaged by Suntec,32Foot Note 32×Ms Chong’s AEIC, exhibit GC-22, pg 128.in or around April to July 2013,ie,beforethe unit was handed over to the defendant for the Works (see [16] above).33Foot Note 33×Plaintiff’s reply submissions at para 56.Sketch ceiling drawings were given to the defendant as early as June 2013. Ms Chong had also emailed Mr Chee the drawings of the fixed sprinkler points, air conditioners and lights on 1 August 2013 for the defendant to prepare their ceiling plan for,eg, the insertion of lights, emergency lights, exit light positions and TV positions.34Foot Note 34×Ms Chong’s AEIC, exhibit GC-17, pg 96-100; Mr Chee’s AEIC, exhibit CYT-1, pg 104.The plaintiff did not delay in providing the ceiling drawings to the defendant. 40 Hence, I find that the defendant has failed to prove that the plaintiff delayed the completion of the Works. 41 In conclusion, I find that there was a delay in the completion of the Works and I attribute it to the defendant and not the plaintiff.",
        "The Second Issue": "42 I shall first set out the key facts in relation to this issue.",
        "The key facts": "43 On 9 January 2014, the plaintiff found mould growing on the walls of the filing room in the Suntec Clinic and informed the defendant of this.35Foot Note 35×Ms Chong’s AEIC at para 93.On 17 January 2014, the defendant cut a hole in the raised floor platform and found that debris had clogged the Floor Grating. This had prevented the accumulated water from flowing through the Floor Grating into the Drainage Downpipe, which was of some 100mm in diameter.36Foot Note 36×Transcript 9 February 2017, pg 94 lines 22 to 23, pg 100 lines 1 to 7 and pg 228 lines 14 to 19.Consequently, water had overflowed the Bunded Area into other areas of the cement floor beneath the raised floor of the Suntec Clinic. The plaintiff closed the Suntec Clinic on 17 January 2014, and handed it over to the defendant for remedial and rectification works thereafter. 44 The defendant removed the debris from the Floor Grating. This allowed the accumulated waterwithinthe Bunded Area to drain into the Drainage Downpipe. However, accumulated wateroutsidethe Bunded Area in other areas of the cement floor underneath the raised floor had to be pumped out because the bunded walls prevented it from draining into the Drainage Downpipe. The defendant returned possession of the Suntec Clinic to the plaintiff on 8 March 2014. Apart from creating the Access Panel, the defendant did not modify its design of the Bunded Area or the Floor Grating to prevent the recurrence of flooding. 45 Some four and a half months later, on 21 July 2014, the plaintiff again discovered mould growth on the same walls of the filing room. The plaintiff also experienced several electrical power supply trips, the source of which were traced to flooding beneath the raised floor by Quantum Leap Healthcare Pte Ltd (“Quantum Leap”), the supplier of dental chairs to the plaintiff. The Floor Grating was again found to be clogged, and the Bunded Area was completely flooded with water to a depth of approximately 30cm. On 29 July 2014, the plaintiff closed the Suntec Clinic.",
        "The plaintiff’s contentions": "46 The plaintiff pleads that the repeated flooding was caused by the following :37Foot Note 37×SOC at paras 22(16)(h) and 22(17)(c). (a) leakage of water through the hole (see the photographs attached in Annex B to this judgment) in the waste water discharge pipe (the “Drainage Pipe”) from the dental chair in Surgery Room No 3 of the Suntec Clinic; (b) the design and installation of nine discharge pipes (the “discharge pipes”) whose discharge outlets were situated above the Floor Grating (see the photographs in Annex A to this judgment); and (c) the design and construction of the raised bunds, which prevented water that had overflowed the Bunded Area from draining into the Drainage Downpipe.",
        "The defendant’s duties in contract and in tort": "47 I accept the plaintiff’s submission that the defendant owed duties to the plaintiff in contract and in tort for the design, installation and construction of the plumbing works.38Foot Note 38×Plaintiff’s closing submissions at para 129.The defendant does not disagree with the authorities cited by the plaintiff in support of the existence of such duties. I agree with the plaintiff that these duties included the following: (a)An implied duty of fitness for purpose: A duty to ensure that the Works would be designed and performed in a workmanlike or professional manner, such that the Suntec Clinic would be fit for its intended purpose as, amongst other things, a clinic suitable and safe for performing dental surgeries and procedures; (b)An implied contractual duty of care: A duty to carry out its duties under the Agreement with the standard of care, skill and/or diligence expected of a competent interior renovation contractor; and (c)A tortious duty of care: A duty of care in tort similar to the duty at (b) above.",
        "The defendant did not damage the Drainage Pipe": "48 For the following reasons, I do not accept the plaintiff’s allegation, set out in [46(a)] above, that the repeated flooding was caused by damage to the Drainage Pipe (attributable to the defendant). I find that the defendant did not damage the Drainage Pipe. 49 As I explain below, one reason for this finding is that a hydrostatic test was carried out to determine the integrity of the discharge pipes, including the Drainage Pipe. The plaintiff claims that this test was never performed. However, in my view, this contention is against the weight of the evidence for the following reasons. (a) First, photographic evidence indicates that the hydrostatic test was carried out. (b) Secondly, there is evidence that the defendant paid $2500 to AXN Engineering Pte Ltd (“AXN”) to perform the water pressure and hydrostatic tests. (c) Thirdly, I accept the evidence of Mr Muhammad Sidek bin Yusof, the independent witness from AXN, that the water pressure test for the water inlet pipes and the hydrostatic test on the integrity of the discharge pipes were carried out on 28 and 29 August 2014. I scrutinised his affidavit of evidence-in-chief and his oral testimony in court; and, in particular, his description of how he supervised and carried out the water pressure and hydrostatic tests together with his assistant, Mr Azmi bin Azman. I am satisfied that the hydrostatic test was properly carried out; and that if there was indeed a hole in the Drainage Pipe at the time of the hydrostatic test, the water level at the test marking would not have remained unchanged after the test period of 24 hours had elapsed. This is because the water would have drained out of the hole, thus causing the water level to drop. Importantly, these tests were carried outbeforethe plaintiff’s contractors dismantled the raised floor after the 2nd Flood was discovered. 50 The defendant submits that no leakage was found on each of the three occasions when the tests were conducted: before the Suntec Clinic was first handed over to the plaintiff in October 2013, after the 1st Flood and after the 2nd Flood. I accept the defendant’s submission on this point. 51 I therefore find that the water leakage test performed using the hydrostatic test method, which were conductedprior tothe removal of the floor boards after the 2nd Flood, eliminates the possibility that there was a hole or puncture in the Drainage Pipe when the defendantfirsthanded over the Suntec Clinic to the plaintiff. The Drainage Pipe, as shown in the photographs at Annex B, was thus not damaged by the defendant during its installation of the raised platform for the floor. I conclude that the Drainage Pipe must have been damaged during the removal of the pedestals and the raised floor platformafterthe 2nd Flood, by the plaintiff’s own contractors. The flooding was accordingly not caused by leakage of waste water through the hole in the Drainage Pipe, as postulated by the plaintiff.",
        "The defendant’s faulty design of the drainage system": "52 The defendant submits that it was merely engaged as a contractor, and not as a designer. After the plaintiff’s first contractor, Interni Construction Pte Ltd (“Interni”) decided not to continue works mid-way through the project, the plaintiff provided the initial plumbing drawings of Interni to the defendant for it to produce an initial quotation. Therefore, the defendant was not in any position to unilaterally dictate the piping layout. The defendant attributes the termination of the discharge pipes above the floor screed, as opposed to below the floor screed, to the requirement by the plaintiff of a raised floor. 53 I do not see how the requirement of a raised floor would have constrained or dictated the design or the manner of construction of: (a) the system of discharge pipes, which drained the waste water from the sinks, dental chairs and suction pump into the Drainage Downpipe; and (b) the effluent discharge arrangements for the outlets of the discharge pipes, and the Bunded Area where the Drainage Downpipe was located. (The outlets for the discharge pipes and the Bunded Area are shown in the photographs at Annex A.) 54 The defendant also tries to hold Ms Chong responsible for the design of the drainage system at the Bunded Area on account of her alleged micro-management of the design of the Suntec Clinic. I reject this submission. I accept that Ms Chong was active in deciding the aesthetics and design of the exterior layout of the Suntec Clinic. However, she left the layout and manner of construction of the drainage pipes and the discharge arrangements for the same, the Bunded Area and other parts hidden beneath the raised floor wholly to the defendant. Any micro-management on her part did not extend to those areas beneath the raised floor. I also have no doubt that Ms Chong relied entirely on the defendant’s expertise in the design and construction of the plumbing works for the Suntec Clinic. She has no expertise in plumbing works. 55 The defendant also seeks to pin the blame for the design of the plumbing works on Mr Tay. The plaintiff rightly points out that there was no evidence that the defendant had ever requested drawings for the plumbing or drainage system for the Suntec Clinic from Mr Tay. I also accept Mr Tay’s evidence that he was only engaged by the plaintiff to develop the interior design details and the finishes for the Suntec Clinic. Mr Tay said that the contractor would know how to run the piping, and he would not be concerned with it as the contractor would take care of it. I accept that Mr Tay would have understood that the discharge pipes must eventually run to where the Drainage Downpipe was situated. However, I find that he did not knowhowthe discharge pipes would be constructed to discharge the waste water into the Drainage Downpipe. In my view, this is an important part of the plumbing system design which Mr Tay was not aware of. 56 Finally, the defendant attempts to attribute responsibility to Quantum Leap, which had provided its own drawing for the discharge pipes and determined the number of discharge pipes from the dental chairs that would terminate at the location of the Drainage Downpipe. Discussions took place between Quantum Leap and Mr Tai Chee Ching (“Mr Tai”), the sole proprietor of Ching Plumbing Solutions, which was engaged by the defendant to install the waste water pipes beneath the raised floor at the Suntec Clinic. These discussions resulted in the number of discharge pipes terminating at the Bunded Area being adjusted from five to nine pipes. The defendant argues that Quantum Leap had sight of and approved the discharge piping layout before the raised floor platform was closed. The defendant submits that it was logical, or even necessary, for Quantum Leap to have a say in how many pipes should be laid out in relation to the discharge pipes running from the dental chairs and the suction motor, as its concern was to minimise choking of the said discharge pipes. As a result, at least six discharge pipes had been agreed to by both Quantum Leap and Mr Tai to terminate at the Bunded Area (four discharge pipes from the four dental chairs, and two discharge pipes from the suction motor). 57 However, there is no evidence before me that Quantum Leap prepared the design for the Bunded Area. Rather, counsel for the defendant clarified during the pre-trial conference before me that the design of the drainage system was undertaken solely by the defendant. Accordingly, the plaintiff played no part in the detailed design and construction of the plumbing system, in particular the Bunded Area and the drainage system there. The defendant now seeks to resile from this position in its submissions (see [52]–[56] above). I am not inclined to allow it to do so. 58 Furthermore, Mr Tai,ie, the defendant’s plumbing sub-contractor, admitted in his oral evidence that the design of the Bunded Area was developed by himself and the defendant.39Foot Note 39×Transcript 9 February 2017, pg 77 line 1 to pg 78 line 9Therefore, on the evidence, I find that the design for the plumbing system, and in particular the Bunded Area and the discharge arrangements for the discharge pipes there, was entirely the creation of the defendant and the defendant’s plumbing sub-contractor. It had nothing whatsoever to do with the plaintiff or anyone else. 59 Under the 19 July 2013 quotation, the defendant was responsible for the installation of the plumbing works for the Suntec Clinic.40Foot Note 40×1 AB 282–288, 285 (Section F: Plumbing & Sanitary Works)The bunded walls at the Bunded Area were an integral part of the Suntec Clinic’s plumbing and drainage system. They were constructed to hold in place the nine discharge pipes. These terminated above the Floor Grating, which covered the Drainage Downpipe that was in the centre of the Bunded Area. The defendant’s design and construction therefore required all the waste water discharged from the nine discharge pipes to pass through the Floor Gratingbeforeentering the larger Drainage Downpipe. 60 It was not feasible to design the drainage such that all the discharge pipes terminated directly into the Drainage Downpipe. This was because the discharge pipes had a diameter of 40mm each,41Foot Note 41×Transcript 9 February 2017, pg 84 lines 8 to 12.while the Drainage Downpipe had a diameter of 100 mm. The defendant submits that, in this light, the best possible design was to terminate all the discharge pipes above the Floor Grating. This appears to be the defendant’s justification for its design of the effluent discharge arrangements. 61 To my mind, this is the most critical part of the design in so far as the prevention of flooding is concerned. In relation to the prevention of flooding, I do not consider that the route of the discharge pipes, from the sinks and the dental chairs, and across the floor areas from the different rooms in the Suntec Clinic, to the location of the Drainage Downpipe, was material. Thus, discussions and any alleged agreement with Quantum Leap concerning therouteof the discharge pipes, from the dental chairs to the Drainage Downpipe, and how these pipes might be joinedbeforereaching the Bunded Area do not help the defendant’s case. The faulty design was not in theroutebeneath the raised floor that the discharge pipes took, or how they were joinedbeforereaching the Bunded Area, but in the design of the Bunded Area itself. In particular, as I explain below, the design was defective because the discharge outlets of the discharge pipes endedabovethe Floor Grating, and because the Floor Grating was included to begin with. 62 Importantly, in its closing submission, the defendant asserted that:42Foot Note 42×Defendant’s closing submissions at para 86. The [defendant] had initially not anticipated that a lot of debris would be generated in the course of the [plaintiff’s] operations.The plumbing system was meant to be self-functioning without any need for maintenance. Therefore, no access panel was initially created. [emphasis added] This submission demonstrates that the defendant had rightly approached the design on the premise that the plumbing system should only require minimal maintenance, if not being self-functioningwithout any need for maintenance. It was rightly conceptualised to be (almost) maintenance free. 63 However, the defendant failed to re-examine its design of the Bunded Area after the 1st Flood. This is notwithstanding that the 1st Flood occurred very shortly after the Suntec Clinic began its operations (two and a half months thereafter). The defendant must have known that there was a real risk that flooding might recur. Yet it did not reconsider its design of the Bunded Area to ascertain (1) how the risk of future flooding could be minimised, if not eliminated; and (2) whether the design needed to be fundamentally modified to achieve the intended and correct design concept,ie, a drainage system that was self-functioning and (almost) maintenance free. Clearly, as designed, the drainage system was not at all self-functioning and hardly maintenance free. I do not believe that the defendant meant to design a plumbing system that was maintenance intensive. Yet, as will be seen below, that was exactly what the defendant did. 64 When the 1st Flood occurred some two and a half months after the Suntec Clinic began its operations, the defendant’s design for a self-functioning plumbing system was proven to be ineffective. However, the defendant did nothing to rectify or modify its design. The defendant instead expected the plaintiff to constantly maintain and keep the Bunded Area debris free, by simply providing the Access Panel which did not even have a glass panel to enable visual inspections of the Bunded Area. In other words, once it became clear that the defendant’s original design concept of a plumbing system that was “self-functioning without any need for maintenance” had not materialised, the defendant expected the plaintiff to live with a drainage system that required constant monitoring and frequent maintenance to prevent flooding, the very antithesis of its intended design. The limited quantity and small size of debris generated 65 The defendant attempts to suggest that the flooding was not caused by its faulty design but by the unexpectedly large amount of debris generated by the dental clinic. 66 I do not accept that there was a lot of debris generated in the course of the plaintiff’s operations, for the following two reasons. (a) First, I accept Ms Chong’s evidence,43Foot Note 43×Transcript 31 January 2017, pg 159 line 18 to pg 160 line 5.which was as follows. Each dental chair had a spittoon where patients spat out their saliva. There was also a suction pipe that sucked out saliva, blood and small fillings from the mouth. The suction from this suction pipe went through a very fine sieve. After passing through the sieve, whatever flowed through was probably just fluid. Ms Chong said that she had also made the effort to buy a sieve like a T-netting for each of the drainage holes of the sinks in the Suntec Clinic, to prevent debris from falling into the said holes. Thus, I find that, unlike a food and beverage outlet, the Suntec Clinic did not generate a lot of sizeable waste or debris that entered the discharge pipes, which situation might then have warranted frequent maintenance and checking of the Floor Grating. (b) Secondly, I watched the video that showed how the blockage at the Bunded Area was cleared. There was no evidence that large quantities ofsizeabledebris had accumulated. Instead, the blockage was easily cleared. The stagnant water and debris flowed quickly through the Floor Grating after the technician stirred the water in the Bunded Area. The video and the relevant photographs show that the debris was mainly fine greyish powdery/silt-like and sand-like particles. Given that there were fine sieves at the spittoons and in the sinks of the Suntec Clinic, it is not surprising that the debris did not consist of large or lumpy materials. 67 It must have been clear to the defendant, and objectively foreseeable, that silt and dirt would be discharged into the drainage pipes. Apart from this, I would imagine that, after being immersed in water over time, sediment from the loose sand and cement from the rough walls of the bund would also form part of the debris generated. Notably, the Bunded Area was simply constructed from cement and sand. The defendant did not tile the walls of the bund. I shall return to this point at [115] below. 68 The Floor Grating had a total of 52 small holes. Each of these small holes was approximately only 8mm in diameter. The Floor Grating thus obstructed the free flow of effluent water from the nine discharge pipes into the Drainage Downpipe, which was of 100mm in diameter (see [60] above). By leaving in place the Floor Grating, which acted as an unnecessary sieve, the defendant incorporated a feature that carried an inherently high risk of flooding into its design of the drainage system, given the likelihood that the Floor Grating would be frequently blocked by the kind of debris seen in the video despite their limited quantity and small size. The necessity of frequent maintenance 69 As mentioned above, the 1st Flood was discovered on 17 January 2014, some two and a half months after the Suntec Clinic commenced its operations. In fact, on 9 January 2014, mould clusters were discovered on the walls of the filing room in the Suntec Clinic (see [43] above). The mould clusters would have needed time to grow after the onset of dampness and accumulation of water beneath the raised floor. Thus, the actual blockage of the Floor Grating must have occurred even earlier than 9 January 2014. 70 The 2nd Flood was discovered about four and a half months after the Suntec Clinic resumed operations after the 1st Flood. Having regard to the time that would have been required for the huge quantity of water beneath the raised floor, which was up to 30cm deep, to accumulate, the blockage at the Floor Grating would probably have occurred much earlier, perhaps within a month or two after the Suntec Clinic resumed operations after the 1st Flood. 71 In this light, I will proceed on the basis that the defendant’s drainage design would have required, at the minimum,monthlymaintenance to prevent blockage and subsequent flooding. 72 However, a design that required the plaintiff to clear the debris at the Bunded Area as part of maintenance on amonthlybasis, or evenonce every two months, as opposed to a (nearly) fully self-functioning and maintenance free drainage system, is in my view unacceptable. I find that such a drainage system is unfit for its purpose. In my judgment, a useful analogy here is to toilet bowls. I note that the diameter of the Drainage Downpipe is of thesame 100mm diameteras that of drainage downpipes for toilet bowls.44Foot Note 44×Transcript 9 February 2017, at pg 228 lines 14 to 19.No one expects to maintain toilet bowls on a monthly basis to prevent blockage with the technology and scientific knowledge available today for the design of sanitary systems. Even twenty years ago, a drainage system for toilet bowls would have been considered unfit for its purpose if it required maintenance every month or two months to prevent blockage. In the case of toilet bowls, materials and effluent of a far larger size (comprising both faeces and toilet paper) are generally discharged into the drainage downpipe as opposed to the fine discharge from sinks, dental chair spittoons and the suction pump. Yet, clogging of toilet bowls and their drainage downpipes is rare even without any monthly or bimonthly maintenance. Given that the Drainage Downpipe is of a similar size to the drainage downpipes for toilet bowls, and having regard to the nature of the discharge from sinks, dental chair spittoons and suction pumps in a dental clinic as compared to that from toilet bowls, the frequency of clogging and blockage of the drainage system for the Suntec Clinic should have been even less than that of a sanitary system. Therefore, the need for maintenance should not have been much more onerous and intensive than that for a household sanitary system. 73 In my judgment, the plaintiff could not have been expected to carry out such frequent maintenance for the drainage system in Suntec Clinic, which only catered for drainage from sinks, dental chair spittoons and a suction pump, all of which were already equipped with fine sieves. There was also nothing exceptional in the nature of the effluent discharge. A proper drainage system design would have been nearly fully self-functioning and maintenance free. The frequency at which the 1st and the 2nd Floods occurred demonstrates that the drainage system was not of a design that was at all suitable for its purpose. 74 In my view, it would not have required rocket science to solve the problem with the drainage system. For example, simply removing the Floor Grating would have rendered the drainage system nearly fully self-functioning. This is because the Drainage Downpipe is of a 100mm diameter. Thus, the risk that it would have become clogged up by the relatively small quantity of fine greyish powdery/silt-like and sand-like material produced in the Suntec Clinic is remote. This view is shared by the defendant’s own expert Mr Chee.45Foot Note 45×Transcripts 9 February 2017, at pg 228 line 14 to pg 230 line 10.That the defendant never thought of this simple remedial solution to its design at the time after it discovered the 1st Flood cannot negate its liability for (a) its faulty design of the drainage system at the Bunded Area to begin with; and (b) its failure to remedy the design after the 1st Flood, when the need for rectification had become evident. The presence of the Floor Grating 75 The defendant’s expert witness, Mr Chee Yan Pong (“Mr YP Chee”), does not say that the regulations required the Floor Grating under the prevailing conditions,viz, with a raised floor constructed above and covering the Drainage Downpipe. As I will explain later, the function of the Floor Grating was not to ensure that pests and insects did not emerge from the Drainage Downpipe. Small insects could easily have emerged from the 8mm diameter holes in the Floor Grating. Rather, the Floor Grating served two functions. (a) First, it prevented large items or debris from accidentally falling into the Drainage Downpipe. This was its main function. (b) Secondly, it enhanced safety in preventing persons from stepping onto the 100mm diameter hole. 76 However, there was a raised floor above the Drainage Downpipe. This removed the risk of large items or debris accidentally falling into the Drainage Downpipe. It also eliminated the risk of persons stepping onto the 100mm diameter hole. Therefore, the Floor Grating was redundant; there was no need to retain it to serve the functions set out at [75] above when there was already a raised floor above the Drainage Downpipe. 77 Even if some form of grating were required, a different kind of grating, with or without 8mm holes, could have been easily fashioned and placedon topof the bunded walls. That would have prevented large items or debris from accidentally falling into the Drainage Downpipe. Additionally, if the grating had no holes, it would also have prevented insects and pests from emerging from the Drainage Downpipe. Such a form of grating, placed above the Bunded Area, could easily have been incorporated into the design by the defendant. 78 The various explanations from the defendant on why the Floor Grating could not be removed are not backed up by any expert opinion and I reject them. There were alternative ways to prevent large items or debris from accidentally falling into the Drainage Downpipe without having to retain the Floor Grating. 79 In fact, both of the parties’ experts acknowledge that discharge pipes from sinks in households dischargedirectlyinto 100mm drainage downpipeswithout any further sieveat the outlets of these discharge pipes where they join the drainage downpipes. The floor grating is actually at the floor level andabovethe outlets of these discharge pipes from the household sinks. The outlets of these discharge pipes from household sinks do not end above the floor grating. The floor grating does not act as another sieve before the waste water from the discharge pipes empties into the drainage downpipe. I therefore cannot see why the defendant’s design of the drainage system for the discharge pipes from the sinks, spittoons and suction pump in the Suntec Clinic was such that the effluent had to pass through a sieve,ie, the Floor Grating, before being discharged into the Drainage Downpipe. Removing the Floor Grating and installing a new floor grating on the top of the bunded walls would, in my view, be one example of an effective remedy to the defendant’s defective design. I thus reject the defendant’s submission that the best design was to terminate all the discharge pipes above the Floor Grating. The relevance of a similar design at another dental clinic 80 The defendant’s Managing Director, Mr Kelvin Foo Kian Beng (“Mr Foo”) visited the same unit on 6 February 2017, which is currently occupied by another dental clinic. The present clinic has several dental chairs with a similar drainage layout, and with waste water pipes terminating into a bunded area above a similar floor grating. According to the defendant, this establishes that the design adopted is not unusual because it has been employed by another dental clinic. 81 I disregard this evidence as it is irrelevant. The correctness of the design is a matter of expert opinion, and cannot be decided on the basis of another clinic’s adoption of a nearly similar design. The fact that somebody else adopts a nearly similar design does not necessarily mean that it is a proper and correct design to begin with. The primary cause of the 1st and 2nd Floods 82 I shall now determine the primary cause of the 1st and 2nd Floods. The lack of maintenance was not the primary cause of the 1st and 2nd Floods 83 The MCST issued a handbook to tenants dated 1 November 2012 (the “Fit-Out Handbook”), which includes a section on “M&E Fit Out Guideline[s]” for “Plumbing & Sanitary Works”.46Foot Note 46×1AB 63–100.These guidelines provided that the plaintiff, as the tenant of the premises, was “to be responsible[for] maintaining … the floor grating/waste discharge pipe till [the] sub-main stack” [emphasis added].47Foot Note 47×IAB 63, 82.The defendant claims that the primary cause of the flooding was the plaintiff’s failure to maintain the Floor Grating at the Bunded Area. The defendant argues that the plaintiff feigned ignorance of the need for maintenance, when the plaintiff’s own pleadings suggests the need for maintenance. The plaintiff pleads that the defendant’s design was defective as it did not provide “access to the [Floor Grating] and/or drainage pipes for checks and maintenance”.48Foot Note 48×SOC at para 22(18)(a)(i). 84  The defendant argues that, whilst the above averment may be true for the 1st Flood, the defendant cannot be liable for loss or damage that occurred after the Access Panel was created. This is for the following reasons: (a) The plaintiff knew that the 1st Flood occurred because debris had clogged up the Floor Grating. This prevented water from the discharge pipes from flowing into the Drainage Downpipe, which resulted in the water overflowing the walls of the bund into areas outside the Bunded Area. (b) The plaintiff was also informed of the need to maintain the Floor Grating via the Access Panel, which the defendant installed after the 1st Flood. 85 To begin with, I note that the defendant does not contend that the lack of maintenance was the primary cause of the 1st Flood (see [84] above). It acknowledges that the Access Panel was only created after the 1st Flood. The defendant submits that this was because it did not anticipate that much debris would be generated in the course of the plaintiff’s operations, and thus considered that the drainage system would not require maintenance.49Foot Note 49×Defendant’s closing submissions at para 86.Thus, the issue here is whether the lack of maintenance caused the 2nd Flood. 86 I shall first address the first premise of the defendant’s argument set out in [84(a)] above. As noted at [43] above, after the 1st Flood, the defendant discovered that the Bunded Areas and surrounding areas were filled with water, and that this was because debris had accumulated on top of the Floor Grating, thus preventing the water from draining into the Drainage Downpipe. I accept the defendant’s submission that both Ms Chong and Dr Tan knew that the 1st Flood occurred because debris had clogged up the Floor Grating. 87 I also accept the second premise of the defendant’s argument set out in [84(b)] above. In this regard, I accept the evidence of Mr Donald Seah Choon Kiat (“Mr Seah”), the defendant’s project manager, who was involved in this matter from January 2014 onwards, that he verbally informed the plaintiff to carry out maintenance of the Floor Grating. He said that Ms Chong witnessed the defendant clearing the water that had accumulated. In my view, it must have been obvious to the plaintiff when the defendant created the Access Panel that it was meant to provide the necessary access to the plaintiff to maintain the Floor Grating. 88 However, notwithstanding that I have accepted the two aforementioned contentions of the defendant, I do not accept that the lack of maintenance was the primary cause of the 2nd Flood. For the reasons given at [92]–[111] below, I find that the defendant’s defective design was the primary cause of the 2nd Flood. 89 Moreover, at this juncture, I note that the defendant, the designer of the drainage system, did not inform the plaintiff, after creating the Access Panel, how regularly or frequently the plaintiff should inspect and maintain the Floor Grating,eg, on a daily, weekly, monthly, or yearly basis. The Access Panel also does not contain a glass inspection window to facilitate visual inspections of the Floor Grating and the Bunded Area. 90 In my view, it was the duty and responsibility of the designer,ie, the defendant, to educate, specify and point out to the user,ie, the plaintiff, at the very least, the frequency of maintenance that was necessary. This was especially because, on these facts: (a) unusual and unexpectedly frequent maintenance was required for the drainage system designed by the defendant; and (b) flooding would cause mould formation, which is unacceptable in a dental clinic where minor operations are performed and cleanliness and hygiene are paramount. 91 However, the defendant did not tell the plaintiff how frequently to perform the maintenance. In that light, in my judgment, the defendant cannot avoid liability simply by saying that the plaintiff should have maintained the drainage system. It designed this unusual drainage system, which required maintenance of a frequency that was entirely unforeseeable. In the circumstances, even assuming that the system designed by the defendant was fit for its purpose, the defendant should have informed the plaintiff of the frequency of maintenance that was necessary. The faulty design of the Bunded Area was the primary cause of the 1st and 2nd Floods The Floor Grating 92 The defendant’s position is that the Floor Grating was necessary. According to the defendant, a floor grating was a mandatory aspect of the design of the Bunded Area as seen in the various guidelines. It also served an important function of preventing pests from coming out of the Drainage Downpipe and infesting the dental clinic. It would have been devastating if a dental clinic was overrun with disease-ridden pests. In any event, it is not the plaintiff’s case that there should not have been a floor grating. 93 The defendant also relies on a code of practice issued by the Public Utilities Board (the “PUB”), the “Code of Practice on Sewerage and Sanitary Works” (the “Code of Practice”).50Foot Note 50×1AB 6–61.Guideline 3.3.3.9(a) of the Code of Practice states,inter alia, that “[t]he waste pipeshall be connected above the water seal of the floortrap…” [emphasis added].51Foot Note 51×1AB 6–61, 53. 94 However, the “water seal” refers to the water level at the “U” portion of the drainage downpipe. The “water seal” does not refer to a floor grating and is not at the same level as the Floor Grating. The “water seal” is at a much lower level than the Floor Grating. The Code of Practice does not require that all drainage pipes be connected above the level of the floor grating. 95 The Code of Practice also contains a rule on gratings and covers for floor traps and floor wastes. Guideline 3.3.3.11 states that “[t]he grating and cover shall be of an approved design so as to enable them to be securedto deter the unwarranted openingof the grating or cover and hence introduction of garbage or other solid waste into the sewerage system” [emphasis added]. The defendant submits on this basis that the Code of Practice envisages that no garbage or solid waste should enter the sewerage system, thus necessitating the presence of a floor grating to cover the opening of the Drainage Downpipe. The defendant argues that the PUB made this even clearer in an email dated 22 February 2017, where it stated that “the floortrap has to be covered in order to prevent foreign materials from entering” [emphasis added]. The defendant annexed this email to its closing submissions. 96 However, Mr YP Chee made the following comments on whether the Floor Grating was the cause of the blockage and should have been removed altogether:52Foot Note 52×Transcript 9 February 2017, pg 194 lines 3 to 21. Court: Since main cause is due to the lack of maintenance which mean the debris covering up the holes of the floor grating, that’s the principal cause of the flooding, right? Witness: Er, yes and no--- Court: No? Yes and no? Witness: ---in a sense that, er,if there are some concern over debris, over the top of the grater in a dental clinic, then I would say that, er, it may be better for the practice in the dental clinic not to have a cover over the grating---er, over the f------over the floor grating.As--- Court: Yes. Witness: ---would be in some cases, er, it could be just opening a cover or in some cases, er, you can build a very reasonable s---er, bunded area and then have an access cover in the form of a simple metal grating, right. Er, I would into greater detail on this but basically, it’s due to the lack of maintenance which causes the clogging of the floor grating that cause it. If there were no maintenance issue and there were no clogging of the floor grating, then it does not matter whether the floor grating existed or otherwise. [emphasis added] 97 Further, Mr YP Chee agreed that there would not have been a flood had the Floor Grating been removed:53Foot Note 53×Transcript 9 February 2017, pg 199 lines 25 to 32. Q:          Okay. Now, I’m talking about, you know, the design of the bund, okay, as it is in existence, okay, and as you have seen from all these photographs which you just mention, right? Now in this particular case,would you agree with me that, you know, if the grated cover over the drainage hole had not been there, the chokage would not have occurred and therefore the flooding would have been avoided, you agree? Court:     On the balance---on balance--- Witness:Yes. [emphasis added] 98 Notwithstanding the evidence above, Mr YP Chee denies that the Floor Grating was a design defect which created the drainage problem at the Bunded Area and therefore the need for frequent maintenance. He believes that the blockage resulted because “the holes on the cover were not cleared regularly”.54Foot Note 54×Transcript 9 February 2017, pg 99 lines 14 to 25.I do not accept Mr YP Chee’s evidence on this point. In my view, if the Floor Grating had been removed from the Bunded Area, there would have been no need for such frequent maintenance. That would have been the simple design solution to the flooding problem. The recurrence of flooding should have been anticipated and fairly obvious to the defendant after the 1st Flood. But the defendant failed to think of an appropriate way to re-design the Bunded Area to mitigate the high risk of recurrent flooding, which was inherent in the defendant’s design. 99 Mr YP Chee acknowledged that sinks have a bottle grating (normally found directly underneath the sink) to capture dirt. Thereafter, the waste water from the sink empties directly into the large drainage downpipe without any further sieve.55Foot Note 55×Transcript 9 February 2017, pg 209 line 18 to pg 210 line 22.The exit point of the discharge pipe from the sink would bebeneaththe floor grating, butabovethe water seal of the drainage downpipe. Mr YP Chee also conceded that, for residential and commercial buildings, he had not seen any discharge pipe outlets from sinks that end up above a floor grating that covers the drainage downpipe opening at the floor level.56Foot Note 56×Transcript 9 February 2017, pg 211 lines 25 to 28. 100 Accordingly, I find that there was no need for the defendant’s design to include the Floor Grating, which served as a secondary sieve at the discharge pipe outlets to prevent dirt from the waste water from being discharged directly into the 100mm diameter Drainage Downpipe. I agree with Dr Liew Kian Heng (“Dr Liew”), the plaintiff’s expert, that floor gratings are not meant to act as sieves for effluent from sinks.57Foot Note 57×Transcript 2 February 2017, pg 197 lines 22 to 31. 101 In this light, it is plain that the defendant’s design, which involves terminating all the discharge pipes above the Floor Grating, thereby turning the Floor Grating into a new sieve for the waste water discharged, was most unusual. Furthermore, the defendant, in my view, had created an inherently flood prone design, a flawed design, because the defendant had turned the Floor Grating into a sieve when it was never meant to be one. To now allege that the lack of regular maintenance of the “sieve”, which the defendant unnecessarily and dangerously created, was the primary cause of the flooding, is to ignore the design fault which is the real primary cause. 102 It is important to note that the plaintiff’s case is not that the drainage system should have been designed and constructed in a fixed or prescribed manner. The plaintiff’s case is simply that the defendant’s drainage system should not have been designed or constructed the way it was, as such design or construction was incorrect and inadequate for the plaintiff’s purpose (see [3] above).58Foot Note 58×Plaintiff’s reply submissions at para 20.After the 1st Flood, the defendant should have realised that if further alteration to the arrangements for the termination of the discharge pipes was too difficult or expensive, an alternative solution would have been to remove the Floor Grating completely to prevent that from acting as a sieve that was prone to clogging. In my view, that would have substantially mitigated the risk of recurrent flooding which was inherent in the defendant’s design. Mr YP Chee accepts that there would have been a very low chance that the Drainage Downpipe would have become choked if the Floor Grating was removed since it was of a 100mm diameter.59Foot Note 59×Transcript 9 February 2017, pg 229 line 1 to pg 230 line 9.He further agrees that the flooding on balance would have been avoided if the Floor Grating was removed completely. 103 I also note that Ms Chong had put netting sieves into the drainage holes of the sinks in the Suntec Clinic to reduce the accumulation of debris. To expect Ms Chong to conduct monthly maintenance of the “sieve” that the defendant illogically and incorrectly created out of the Floor Grating is totally unreasonable and I reject the defendant’s defence on this point. The Bunded Area 104 Furthermore, apart from the Floor Grating, I accept Dr Liew’s evidence that it was also wrong to have a raised bund to begin with.60Foot Note 60×Transcript 2 February 2017, pg 186 lines 1 to 24.If water overflowed the raised walls of the bund constructed by the defendant, any clearing or cleaning of the “sieve” as part of maintenance would only have cleared the water accumulatingwithinthe Bunded Area. It would not have cleared the water that had accumulatedoutsidethe raised bund, which could not flow back into the Bunded Area to be drained away by the Drainage Downpipe because of the impermeable nature of the bunded walls. The uncleared stagnant water remainingoutsidethe raised bund would have continued to promote the growth of mould, an unacceptable state of affairs for a dental clinic, where minor surgery and dental treatment would  be conducted, and hygiene and cleanliness was therefore paramount. Essentially, the raised bund undermined the very function of the Drainage Downpipe which was supposed to drain off water on the cement floor beneath the raised floor of the clinic, regardless of whether the water had accumulated outside or inside the Bunded Area. Regular maintenance of the “sieve” would still not have enabled the Drainage Downpipe to fulfil its function of draining any accumulated wateroutsidethe Bunded Area. The reservoir of stagnant water outside the Bunded Area would not only lead to mould growth but also cause electrical outages (as some electrical connections and wires were under the raised flooring). 105 Dr Liew explains that it is not a good idea to build a raised bunded area.61Foot Note 61×Transcript 2 February 2017, pg 185 lines 4 to 30.I accept his evidence that a sump,ie, a depressed rectangular reservoir created below the level of the floor screed, would have been a better solution. This is because, if there was any pipe leak or water spillage on the floor of the Suntec Clinic, water could still flow back into the sump and into the Drainage Downpipe within the sump. This would have prevented water from accumulating on the cement floor beneath the raised floor of the Suntec Clinic. 106 Moreover, according to Dr Liew, even if the raised bunded walls were necessary, the defendant ought to have created another outlet called a floor waste and joined it to the neck of the Drainage Downpipe, below the cement floor level, to drain any accumulated water outside the raised bund.62Foot Note 62×Transcript 2 February 2017, pg 202 line 27 to pg 204 line 7.Water that accumulated outside of the Bunded Area,eg, from spillage of water on the raised floor, floor cleaning or leaking water pipes, could then still flow back to the Drainage Downpipe. 107 For the reasons stated above, I agree with the plaintiff’s submission that terminating the nine discharge pipesabovethe Floor Grating, and at the raised Bunded Area, was a serious design flaw, which was the primary cause of the 1st and 2nd Floods. I find that no reasonable contractor would have provided for such a drainage system, which Dr Liew likened to a “death certificate signed” for flooding to occur.63Foot Note 63×Transcript 2 February 2017, pg 183 line 17 to pg 187 line 12. 108 Guideline 3.2.1 of the Code of Practice states:64Foot Note 64×1AB 6–61, 44. The sanitary plumbing system for any premises shall be designed, installedand maintained so asto carry away wastewater from the building into the sewerage system quickly without creating any nuisance or risk of injury to health. [emphasis added] 109 Guideline 3.3.1 of the Code of Practice states:65Foot Note 65×1AB 6–61, 49. Sanitary wares, sanitary pipes and fittings are part of the sanitary plumbing and drainage system for the conveyance of wastewater from within the premises to the sewerage system.Its design and construction have a great impact on the proper functioning of the sanitary plumbing system. The proper selection and installation of sanitary wares, pipes and fittings will reduce the risk of danger to health arising from blockage, leakage or surcharge. [emphasis added] 110 I find that the defendant breached the Code of Practice by designing and constructing a raised Bunded Area where the outlets of all nine discharge pipes terminated above the Floor Grating. The defendant’s design conduced to frequent clogging and flooding, electrical outrages and mould growth. 111 For all these reasons, I accept the plaintiff’s submission that the flooding was primarily caused by (a) the termination of the outlets of all nine discharge pipes above the Floor Grating; and (b) the presence of the bunded walls, which prevented water outside the Bunded Area from draining into the Drainage Downpipe. Alternative designs were not explored 112 I also agree with the plaintiff’s criticism that the defendant opted for a fast, cheap and easy method of construction, without regard to the prevailing Code of Practice, and without much consideration of alternative designs and flood mitigation measures and the potential problems with its selected design.66Foot Note 66×Transcript 9 February 2017, pg 79 lines 6 to 24. 113 Dr Liew has suggested much better alternative designs. These include: (a) using elbow joints to connect the discharge pipes directly into the Drainage Downpipe through a hole in the Floor Grating (presumably the discharge pipes would have to be joined togetherpriorto entering the Bunded Area, such that only a few discharge pipes ending with elbow joints would fit vertically into the 100mm diameter Drainage Downpipe through the Floor Grating); (b)  running the discharge pipes through the screed or floor and connecting the outlets of the discharge pipes directly to the Drainage Downpipe beneath the level of the Floor Grating, and dispensing entirely with the bunded walls; or (c) removing the Floor Grating entirely or alternatively, fabricating a new grating at the top of the raised bunded walls so that there would be no Floor Grating between the outlets of the discharge pipes and the mouth of the Drainage Downpipe, and creating an additional floor waste outside the Bunded Area but connected back via a floor waste pipe through the screed and beneath the level of the Floor Grating to join the neck of the Drainage Downpipe. The defendant had to lay screed of 95mm.67Foot Note 67×1AB 299, item B(2).It would therefore have been possible for the discharge pipes, of 40mm diameter, to pass through the screed at an inclined angle, without the need to drill into the concrete floor. In any case, if APM’s approval was necessary for such a construction, it would have behoved the defendant to raise the issue with the plaintiff as a responsible and reasonably competent contractor would. However, the defendant did not do so. It seems that the defendant did not thoroughly consider the appropriateness and suitability of its design for the purpose it was supposed to fulfil. Flood mitigation measures were not adopted 114 Similarly, the defendant also probably did not carefully consider flood mitigation measures when it designed and constructed the Bunded Area. The volume of the Bunded Area was so small that the water it contained would overflow within a very short time (based on a continuous rate of tap flow of 6la minute). This meant that there would have been hardly any lead time for the plaintiff to react when a blockage at the Floor Grating arose.  The defendant could have raised the height and increased the size of the Bunded Area to create a much bigger reservoir, to address the possibility of clogging at the Floor Grating. The defendant could also have proposed the installation of an alarm system as another flood detection and mitigation measure at the Bunded Area, to give the plaintiff sufficient lead time to react to clogging. The shoddy construction 115 Further, Dr Liew also observed that, on the whole, the construction was shoddy. The walls and floor of the Bunded Area should at least have been tiled for hygiene purposes, instead of being left with rough unfinished cement surfaces. Tiling up the Bunded Area would have helped to prevent mould growth and would not have been very costly. 116 Dr Liew also commented on the haphazard and unprofessional manner in which the water copper pipes, water sanitary pipes and electrical conduits were laid. Electrical conduits were also run across the Bunded Area without proper safety considerations in mind. In a nutshell, it was a “mess”.68Foot Note 68×Transcript 2 February 2017, pg 144 lines 9 to 29. No effective remedial action was taken after the 1st Flood 117 Furthermore, the defendant failed to address the primary cause of the flooding,viz, its inadequate design of the drainage system at the Bunded Area despite being given the opportunity to do so from 17 January 2014 to 8 March 2014, after the 1st Flood had occurred. The 1st Flood should have given the defendant food for thought; and there was more than enough time for it to carefully review its design and construction of the Bunded Area. However, the defendant did nothing to remedy the fundamentally defective design and instead created the Access Panel. It appears that the defendant assumed that it could pass the responsibility of preventing flooding to the plaintiff, by looking to the plaintiff to perform “regular preventive maintenance” occasioned by its defective design. This led to the 2nd Flood. Either the defendant was incompetent in not being reasonably innovative enough to devise a solution to its defective design, or the defendant was simply negligent in not rectifying its defective design.",
        "Conclusion on the 2nd Issue": "118 For the above reasons, I find that the defendant breached its contractual obligation to ensure that the Works were designed and carried out in a workmanlike or professional manner such that the renovated Suntec Clinic would be fit for its intended purpose as, amongst other things, a clinic suitable and safe for performing dental surgeries and procedures (see [47(a)] above). 119 I also find that the defendant breached its obligation to carry out its duties under the Agreement with the standard of care, skill and/or diligence expected of a competent interior renovation contractor (see [47(b)] above). 120 I also find that the defendant breached its duty of care in tort to the plaintiff and is therefore liable in negligence to the latter (see [47(c)] above). 121 I shall now turn to the issue of the defendant’s liability for the forfeiture of the Fitting-Out Deposit.",
        "The Third Issue": "122 The 2015 edition of the Fit-Out Handbook contained a checklist form at Appendix F, which listed the various documents that APM would require in exchange for the release of the Fitting-Out Deposit.69Foot Note 69×Mr Seah Choon Kiat Donald’s AEIC, exhibit DS-1, pg 197; Ms Chong’s AEIC, exhibit GC-58, pg 435 to 442.Amongst the documents and drawings listed are the following:70Foot Note 70×Ms Chong’s AEIC, exhibit GC-58, pg 436. As-built drawings for ACMV ducting, piping, kitchen exhaust ducting, auxiliary condensing unit and drainage layout etc Air-con balancing report As-built drawing for Fire Protection System (Sprinkler/Fire - Suppression System/ Fire Extinguishing System) (With PE endorsement) As-built drawing forgas,plumbingand sanitarylayout(With licensed gas services worker endorsement / licensed plumber endorsement) [emphasis added] 123 On 28 July 2016, the MCST forfeited the Fitting-Out Deposit of $3,000 because the plaintiff did not submit the required drawings and documents to the MCST. 124 Under the terms of the July quotation, the defendant was required to provide as-built ACMV drawings,71Foot Note 71×1AB 282–288, 285 (Section E: ACMV works, Item 2).and as-built plumbing drawings.72Foot Note 72×1AB 282–288, 285 (Section F: Plumbing & Sanitary Works, Item 1).It is not disputed that the defendant failed to furnish these as-built drawings.73Foot Note 73×Transcript 9 February 2017, pg 26 lines 5 to 16.Thus, I find that the defendant breached the express terms of the Agreement in failing to provide these as-built drawings to the plaintiff. 125 The plaintiff further asserts that it is an implied term of the Agreement that the defendant was to provide other drawings and documents for the Works, including final layout drawings, M&E drawings, and documents such as endorsements by licensed personnel engaged by the defendant, which were necessary for the Fitting-Out Deposit to be released (“the Other Documents”). 126 InSembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp Marine”) at [101], Sundaresh Menon CJ, delivering the judgment of the Court of Appeal, laid down a three-stage test for the implication of terms as follows: … (a) The first step is to ascertain how the gap in the contract arises. Implication will be considered only if the court discerns thatthe gap arose because the parties did not contemplate the gap. (b) At the second step, the court considers whether it isnecessary in the business or commercial sense to imply a term in order to give the contract efficacy. (c) Finally, the court considers the specific term to be implied.This must be one which the parties, having regard to the need for business efficacy, would have responded “Oh, of course!” had the proposed term been put to them at time of the contract. If it is not possible to find such a clear response, then, the gap persists and the consequences of that gap ensue. [emphasis added] 127 Applying this three-stage test, I find that it is an implied term of the Agreement that the defendant was to provide the Other Documents to the plaintiff, upon the plaintiff’s request for the same, for a price to be agreed by the parties. I make this finding for the following reasons. (a) First, I find that there was a gap in the Agreement because it did not provide for the defendant to provide the Other Documents to the plaintiff. The evidence does not indicate that the gap arose because the parties contemplated the issue and either mistakenly considered that the Agreement expressly provided for the Other Documents to be furnished, or could not agree on how the gap could be closed: seeSembcorp Marineat [94]–[96]. In this regard, I note that Ms Chong sent several emails to the defendant requesting the latter to provide,inter alia, the Other Documents.74Foot Note 74×Ms Chong’s AEIC, exhibit GC-58, pg 433; Ms Chong’s AEIC, exhibit GC-62, pg 481.The defendant never objected to these requests,eg, to state that the parties tried but failed to reach an agreement on the Other Documents and the defendant was thus not required to provide them. It seems to me that the parties did not consider the issue of what were the necessary documents for the Fitting-Out Deposit at all. The 19 July 2013 quotation did not contain a section dealing with the Fitting-Out Deposit. The as-built drawings for the ACMV and plumbing and sanitary works were provided for in separate sections of the quotation. Thus, I find that the first step of theSembcorp Marinetest is fulfilled. (b) Secondly, I find that such an implied term is necessary to give business efficacy to the contract. The defendants were the plaintiff’s contractors and were best placed to provide the Other Documents. In my judgment, business efficacy requires that a contractor in the defendant’s position provide the relevant documents, before submitting a variation order to the owner for the additional works requested. (c) Thirdly, I find that the implied term set out above satisfies the officious bystander test. It is a sensible term which the parties would have agreed to if it had been put to them at the time of the Agreement. 128 On the facts, the plaintiff requested the Other Documents (see [127(a)] above). The defendant did not accede to this request. Accordingly, I find that the defendant breached the implied term. 129 I find that the defendant’s breaches of the express and implied terms of the Agreement, in failing to provide the as-built drawings and the Other Documents to the plaintiff, caused the Fitting-Out Deposit to be forfeited. Thus, the plaintiff is thus entitled to the sum of $3,000 from the defendant on account of these breaches. 130 Further, even if my finding in relation to the implied term is incorrect (see [127] above), I find that the defendant’s breach of the express terms of the Agreement, in failing to provide the as-built drawings, caused the plaintiff to suffer loss. If the defendant had supplied the as-built drawings, but refused to provide the Other Documents, I find that the plaintiff would have contracted with another party to obtain the Other Documents and thereby secured the release of the Fitting-Out Deposit. In this regard, there is evidence that Mr Chong liaised with Mr Tay to prepare some drawings when the defendants did not respond to her requests for the same.75Foot Note 75×Ms Chong’s AEIC, exhibit GC-58, pg 450 to 464.Ms Chong’s repeated requests for the drawings and the Other Documents also reveal that she would have done the necessary to satisfy the MCST requirements if the defendant had supplied the as-built drawings. The breach of the express term was thus the effective or dominant cause of the forfeiture of the Fitting-Out Deposit. Hence, even if there was no implied term, I would find that the plaintiff was entitled to recover the value of the Fitting-Out Deposit from the defendant.",
        "The Fourth Issue": "131 I shall first address the counterclaim for the variation works.",
        "The variations": "132  The plaintiff submits that the pleadings on variations in the counterclaim are defective, because they do not contain material facts. (a) First, they do not specify the original scope of the Works and state how the alleged works were additional works outside the original scope. (b) Secondly, they do not state that the plaintiff requested for the additional works constituting the alleged variations in the counterclaim. 133 The defendant’s answer to the plaintiff’s request for further and better particulars is simply as follows: The exact [location] of the works may be found in VO 1.3. VO 1.1, VO 1.2 and VO 1.3 contain the Plaintiff’s requests for changes; the documents are quotations, method of communication is via handwritten amendments and acknowledgements… The Defendants are unable to confirm whether the Plaintiff’s Ms Grace Chong had communicated instructions to the Defendants’ former employees. 134 I agree with the plaintiff that there is confusion and lack of clarity in the pleadings in respect of the defendant’s counterclaim. However, the plaintiff was able to deduce in its closing submissions that the defendant’s variations claim for $39,128 was based on the 2nd Variation Quotation.76Foot Note 76×Mr Foo’s AEIC at para 39; see also Transcript 7 February 2017, pg 154 line 28 to pg 155 line 4.The defendant confirms in its reply submissions that this is the correct document. I now set out the 2nd Variation Quotation: S/nDescriptionQtyTotal amountCarpentry works1.Supply and installation of plywood backing on partition in walkway for supporting mirror panels (Approx.150 sq ft)1 lotS$1,800.002.Supply and installation of aluminium frame base with spray paint metal plate for shop front bulk head above the shop front glass, including metal hollow section support for bulk head and main signage (Size: 3940mm (L) x 670mm (H)  x 100mm)1 lotS$6,500.003.Supply and installation of plywood carcase base for shop front column box up and finished in tempered glass black spray paint finish (Approx. 1754mm (W) x 150mm (D) x 3800mm (H))1 lotS$9,500.004.Additional magazines shelves in 1mm-thick c-channel polished s/s finish (Approx. 900mm (W) x 350mm (H) x 150mm (D))2 setsS$700.005.Reception counter material and size changed, pending revised detailed drawing (to be in another variation order quote)1 setPending revised detailed drawing6.Admin room cabinet stainless steel handles6 setsS$480.00Glass and mirror1.Supply and installation of 5mm-thick 3000mm height tinted mirror on walkway wall (150mm x 3000mm – 1 pc; 1025mm x 3000mm – 2 pcs; 1075mm x 3000mm – 2 pcs)1 lotS$3,948.002.Supply and installation of 5mm-thick 3000mm height tempered glass with Smile Inc logo in black sticker, black ground in gun metal JOTGYM sticker to be supplied and installed (Glass size: 200mm x 3000mm – 1 pc; 750mm x 2800mm – 1 pc; 750mm x 200mm – 1 pc)1 lotS$7,500.00Signage1.Supply and installation of main signage “Smile Inc Dental Surgeons” on shop front bulk head in 3D cut out white acrylic finish (1170mm (W) x 360mm (H) x 15+15mm (Thk)1 setIncluded in item 1 under: “Glass and mirror”2.Supply and installation of side signage: “Smile Inc Dental Surgeons” on shop front column cladding in 3D cut out white acrylic finish, the horizontal line and “The Original since 1997” to be in reversed cut, including stainless steel C-channel framing (1370mm (W) x 550mm (H))1 setIncluded in item 2 under: “Glass and mirror”3.Additional vinyl stickers for doors for 4 surgery rooms and admin and pantry6 setsS$1,800.00Stainless steel skirting and framing1.Supply and installation of 1mm-thick &100mm height polished stainless steel skirting, directly installed on all walls, except compactor room and reception glass door (Approx. 60m length)60mS$1,800.002.Supply and installation of polished stainless steel framing for 5 sliding glass doors opening in 1mm-thick polished stainless steel finish, total of 6 sets, no timber backing, capping to be mounted directly8 doorsS$4,800.003.Supply and installation of perforated steel panel in spray paint finish for the front of runway (Approx. 1200mm (W) x 150mm (H) x 1mm thk)1 pcS$300.00TotalS$39,128.00 135 Even if the defendant’s defective pleadings were disregarded, I agree with the plaintiff that the defendant failed to produce sufficient evidence to establish its claims for variation works. The defendant has to prove the following on the balance of probabilities in respect of each claim: (a) the plaintiff gave instructions, expressly or implicitly, to the defendant to carry out the variation works; (b) the works were additional works not covered under the original Agreement; and (c) these works were completed in accordance with the instructions given. 136 According to Mr Foo, Mr Chee had a “drawing file” containing drawings setting out the difference between the original scope of work and the change in the scope of work due to the variations. But the drawing file and the drawings were not adduced as evidence at the trial. The defendant’s witnesses never mentioned the existence of this drawing file in their AEICs nor sought to adduce it as evidence. I do not believe that such a file exists. The burden rests on the defendant to show that the disputed variations constitute work items falling outside the original scope of the Works. For the reasons given below, I find that the defendant has not discharged this burden for many of the disputed variation items. 137 The plaintiff made lengthy submissions on why the items of work claimed as variations in the 2nd Variation Quotation, except for one item of work under item 3 “Stainless steel skirting and framing,77Foot Note 77×Plaintiff’s closing submission at para 378.were: (a) not variations; (b) not properly completed or not completed at all; or (c) were optional items where the claimed quantum exceeded the price agreed under the 19 July 2013 quotation. I agree with most of these submissions. I will now set out the points in respect of each claim in some detail, under the categories of works set out in the 2nd Variation Quotation (see [134] above). The carpentry works 138 Item 1 pertains to the supply and installation of plywood backing on the corridor wall to support the mirror panels. I find that no such work was done. The mirror panels were glued with max bond to adhere them to the partition walls. I disallow the whole variation claim for $1,800. 139 In respect of items 2 and 3, the plaintiff only admits that it has to pay $6,000 and $9,000 for the Optional Items under the 19 July 2013 quotation that correspond to these two items. I agree with the plaintiff that the defendant has not provided any explanation for the increase of $500 for each of these items. Accordingly, I will only allow a total of $15,000 for these two items. 140 Variation item 4 was one of the items in Ms Chong’s List of Outstanding Works (see [31] above).78Foot Note 78×Ms Chong’s AEIC, exhibit GC-32, pg 862 (item 3).Since these works fell within the original scope of the Works, and as there is no evidence that they had been subsequently completed, I disallow the whole variation claim for $700. 141 With regard to variation item 6, I agree with the plaintiff that the provision of appropriate and suitable handles matching the look and feel of the plaintiff’s other clinics formed part of the original scope of the Works.79Foot Note 79×Transcript 7 February 2017, pg 182 line 17 to pg 183 line 1 and pg 183 line 30 to pg 187 line 24.The defendant is not entitled to payment for variation item 6 as its quotation was based on the premise that the standard of finishes was to be similar to that of the plaintiff’s other clinics. In any event, the evidence shows that the replacement handles were not installed, as they were another outstanding item in Ms Chong’s List of Outstanding Works.80Foot Note 80×Ms Chong’s AEIC, exhibit GC-32, pg 863 (item 17).Since this item formed part of the original scope of the Works, I disallow the whole variation claim for $480. Glass and mirror 142 In respect of item 1, I accept Ms Chong’s evidence that the mirror was shorter than it was supposed to be,81Foot Note 81×Transcript 1 February 2017, pg 80 line 26 to pg 81 line 7.and the job was therefore not done satisfactorily. Ms Chong told the defendant to change the mirror to one of the right size. However, the defendant did not do so and this was reflected in Ms Chong’s List of Outstanding Works.82Foot Note 82×Ms Chong’s AEIC, exhibit GC-32, pg 862 (item 13).As these works were also part of the original scope of the Works, I disallow this variation claim for $3,948. 143 With regard to item 2, I agree with the plaintiff’s submission that the defendant has not discharged its burden to prove the basic elements of a variation claim such that it would be entitled to this claim. Accordingly, I disallow this variation claim for $7,500. Signage 144 Items 1 and 2 under this category of works were included in items 1 and 2 under the category of works to the glass and mirror (see [134] above). 145 With regard to item 3, Mr Chee admitted in a Whatsapp message to Ms Chong in September that this item of work could be completed by the plaintiff’s own contractor.83Foot Note 83×Ms Chong’s AEIC, exhibit GC-34, pg 231.Ms Chong confirmed that the defendant did not do these works, and that the plaintiff engaged its own contractor, DigiOne, to complete these works.84Foot Note 84×Transcript 1 February 2017, pg 88 line 25 to pg 89 line 13.As such, I disallow this variation claim for $1,800. Stainless steel skirting and framing 146 In relation to items 1 and 2, I accept Ms Chong’s evidence that these two items were not completed satisfactorily and the quality of the material was unacceptable to the plaintiff.85Foot Note 85×Transcript 1 February 2017, pg 89 line 23 to pg 91 line 11.Items 1 and 2 were both listed as items in Ms Chong’s List of Outstanding Works.86Foot Note 86×Ms Chong’s AEIC, exhibit GC-32, pg 863 (items 16 and 29).There is insufficient evidence before me to show that these two items were subsequently completed to the satisfaction of the plaintiff. Accordingly, I disallow the variation claims for $1,800 and $4,800 for items 1 and 2 respectively. 147 The plaintiff accepts item 3. I thus allow this variation claim for $300. Conclusion 148 In conclusion, I allow the defendant a total of$15,300for its variation claim, which sum is to be set off against the plaintiff’s damages.",
        "The Balance Sum": "149 In evaluating the quantum of the balance of the Contract Sum that the defendant is entitled to, it seems clear that an amount must be deducted from the Contract Sum on account of defective or uncompleted work. 150 Based on the 19 July 2013 quotation, I accept that there were 36 items of outstanding work in Ms Chong’s List of Outstanding Works,87Foot Note 87×Ms Chong’s AEIC, exhibit GC-32, pg 862 to 864.being either items “not made good, not completed, not rectified or damaged”. On the same day, Mr James Tan of the defendant acknowledged in an email that 24 items of work were outstanding.88Foot Note 88×Ms Chong’s AEIC, exhibit GC-34, pg 408.During the period after the 1st Flood, from 17 January 2014 to 8 March 2014, the defendant did some work in relation to the outstanding items, although it is not clear to me on the evidence exactly how much rectification work was done, how many outstanding items were completed and how many outstanding items Ms Chong decided not to pursue and subsequently left out of the remaining list of outstanding items. 151 Based on Mr Foo’s email on 2 May 2014 to Ms Chong on the subject “Re: Outstanding work at Suntec”, the following items of work were subsequently listed as “the work to be done”:89Foot Note 89×Ms Chong’s AEIC, exhibit GC-63, pg 485 to pg 486. (1) Vinyl Floor for Compactor room (2) Office Table in [Ms Chong’s] room (3) Replacement of laminate on the cabinet in [Ms Chong’s] room; (4) Glass cover for [the] reception. 152 Ms Chong then replied on 15 May 2014, referring to the four items listed in Mr Foo’s email on 2 May 2014, as follows: In addition to your listare also the following which are still problematic after erroneous work by your contractors: 1. Lights still blown after your electrician supposedly changed all the lights’ wiring. He claimed it was due to the bulbs but my supplier came and said the issue was not the bulbs. 2. Carpet need to be changed and there is still a patch of the screeding flooring exposed. 3. All drawings, line drawings, submissions, certification, report of flooding and rectification and assurances. Even if you hand to the landlord, we need to have original copies. This is normal practice. [Emphasis added] 153 Based on this email correspondence between Mr Foo and Ms Chong, it would appear that many of the 24 or 36 outstanding items were rectified, completed, not pursued or later accepted to be no longer part of the outstanding items list, except for the seven items listed above. I have to assess the remaining seven outstanding items on the limited evidence before me in the best way I can. I do not believe that they are major outstanding items of work involving substantial remedial costs, given the description of these outstanding items. I also recognise that the Suntec Clinic was operational for several months despite the presence of these outstanding items. The plaintiff does not appear to have experienced much hindrance or difficulty when running the Suntec Clinic arising from these outstanding items. 154  On a broad brush basis, I assess $5,000 to be a fair amount for the seven remaining items of outstanding work set out above, which ought to be deducted from the Balance Sum claimed by the defendant. 155 I am given to understand that the defendant also did not supply the granite tiles for the walkway which was covered by the Contract Sum. The granite tiles were in fact supplied and paid for by the plaintiff. Therefore, the amount of $1,872.50 that the plaintiff paid to Ocean Granites (Singapore) Pte Ltd for the granite tiles must also be deducted from the Balance Sum claimed.90Foot Note 90×Ms Chong’s AEIC, exhibit GC-81, pg 916 and pg 918. 156 Accordingly, I award the defendant a sum of $79,005 less $5,000 and $1,872.50 with respect to its counterclaim for the Balance Sum. This amount of$72,132.50is to be set off against the plaintiff’s damages.",
        "The reason for the set-off": "157 The defendant’s counterclaim is closely linked to the plaintiff’s claim, as they both arise out of the same Agreement. As the plaintiff’s claim will most likely far exceed the total amount of $87,432.50,ie, $15,300 for the variations and $72,132.50 for the Balance Sum, which I have assessed to be due to the defendant for its counterclaim, I have allowed the common law set-off of this sum of$87,432.50which is owed to the defendant against the sums which the defendant owes to the plaintiff, which sums are to be subsequently determined at the assessment for damages.",
        "Conclusion": "158 I therefore order interlocutory judgment for the plaintiff with damages to be assessed, which damages would include,inter alia, the following: (a) Losses arising from delayed completion from 12 September 2013 to 31 October 2013 to be assessed; (b) Losses arising from the closure of the Suntec Clinic from 17 January 2014 to 8 March 2014 as a consequence of the 1st flooding incident to be assessed; (c) Losses arising from the closure of the Suntec Clinic from 29 July 2014 to 5 March 2015 as a consequence of the 2nd flooding incident to be assessed; and (d) Loss of the Fitting-Out Deposit assessed at $3,000; 159 In total, I award $$87,432.50for the defendant’s counterclaim, which shall be set off against the damages assessed to be due to the plaintiff. 160 If the parties are unable to agree on the costs up to the stage of this interlocutory judgment, I will hear the parties on these costs within two weeks on a date to be fixed by the Registrar. Chan Seng OnnJudge Ho Chien Mien and Ng Chee Jian (Allen & Gledhill LLP) for the plaintiff;Vijai Dharamdas Parwani and Nicholas Winarta Chandra (Parwani Law LLC) for the defendant.",
        "": "",
        "Annex A": "",
        "Annex B": ""
    }
}