{
    "case_title": "Wayne Burt Commodities Pte Ltd vSingapore DSS Pte Ltd",
    "ncitation": "[2017] SGHC 70",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Background": "1 This is the defendant’s appeal from the registrar’s decision in suit no 967 of 2016. The registrar granted the plaintiff’s application for summary judgment under O 14 r 1 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”). I agreed with the registrar and dismissed the defendant’s appeal. I now give my reasons. 2 The plaintiff, Wayne Burt Commodities Pte Ltd, is a wholly-owned subsidiary of Wayne Burt Pte Ltd, previously known as Wayne Burt Systems Pte Ltd (“the plaintiff’s parent company”). The plaintiff was incorporated in Singapore and is in the business of trading in commodities. The defendant is also a Singapore-incorporated company, in the business of general wholesale trade. 3 This dispute arises out of a sum of US$3m that the plaintiff claims is owed by the defendant. The parties were in agreement that a loan of US$6.55m was extended to the defendant and that the money came from the plaintiff’s parent company. It was also not in dispute that a total of US$3.55m was transferred by the defendant to the plaintiff’s parent company in two payments of US$2m and US$1.55m on 29 April 2015 and on 8 May 2015 respectively. The issue in this suit is whether the defendant had repaid the balance US$3m. 4 The defendant submitted that summary judgment should be refused because there were triable issues on the following: (a) The plaintiff’s parent company was the party to the loan agreement. (b) The defendant repaid the US$3m by way of payment of the sum US$3.15m to one Justin Lim who had actual or apparent authority to receive this sum on behalf of the plaintiff.",
        "The law on summary judgment": "5 It is well-settled that in order to obtain summary judgment, the plaintiff must first show aprima faciecase for summary judgment. The burden then shifts to the defendant to establish that there is a fair or reasonable probability that he has a real orbona fidedefence:M2B World Asia Pacific Pte Ltd v Matsumura Akihiko[2015] 1 SLR 325 (“M2B”) at [17]. The defendant can also show that “there is an issue or question in dispute which ought to be tried or that there ought for some other reason to be a trial of that claim”: O 14, r 3(1). 6 However, a triable issue or a reasonable probability of abona fidedefence is not established by a mere assertion in an affidavit. InM2Bat [19], Judith Prakash J cited with approval the following passage fromBank Negara Malaysia v Mohd Ismail[1992] 1 MLJ 400: Under an O 14 application, the duty of a judge does not end as soon as a fact is asserted by one party, and denied or disputed by the other in an affidavit.Where such assertion, denial or dispute is equivocal, or lacking in precision or is inconsistent with undisputed contemporary documents or other statements by the same deponent, or is inherently improbable in itself, then the judge has a duty to reject such assertion or denial, thereby rendering the issue nottriable. … [emphasis in original] 7 In other words, a triable issue or a reasonable probability of abona fidedefence is not one which is either (a) inconsistent with undisputed contemporary documents, or (b) inherently improbable in itself. This principle is not controversial and has also been noted inGohChok Tong v Chee Soon Juan[2003] 3 SLR(R) 32 at [25], which was cited to me by the defendant.",
        "Issue (a): Proper party to the loan agreement": "",
        "Defendant’s submissions": "17 Mr Narayanan further submitted that even if the plaintiff was the proper party, the amount had been repaid in full. Apart from the US$3.55m which was undisputed (see above at [3]), Mr Narayanan submitted that the claimed sum of US$3m had been transferred to Justin Lim, who had apparent authority to receive it on behalf of the plaintiff. This apparent authority was based on a representation by Justin Lim that he represented the plaintiff and its parent company at all material times. 18 While Mr Narayanan acknowledged that Justin Lim was only appointed as a director on 25 February 2015, which was one day after the US$3m had been transferred to him, he submitted that Justin Lim was acting as agent of the plaintiff and its parent company prior to that date. 19 Mr Narayanan submitted that Justin Lim had this apparent authority based onFreeman &Lockyer (A firm) v Buckhurst Park Properties (Mangal) Ltd and another[1964] 2 QB 480 (“Freeman”) at 503 as approved by the Singapore Court of Appeal inBanqueNationale de Paris v Tan Nancy and another[2001] 3 SLR(R) 726 (“Banque”) at [68]. InFreeman, the court stated that apparent authority arises out of the representation made by the principal to the contractor that the agent has authority to deal on behalf of the principal, which was intended to be and was in fact acted upon by the contractor. Mr Narayanan submitted that this constituted a triable issue. 20 In this regard, Mr Narayanan also sought to shore up his assertions by applying for leave to file a further affidavit. This further affidavit would state that Justin Lim had paid the plaintiff the US$3m that had been transferred to him by the defendant. When I queried Mr Narayanan as to why the application was only made at such a late time, he replied that he had received new information from his client the night before that would support the affidavit. Mr Narayanan tendered copies of an application form from Justin Lim to the bank for the two payments.",
        "Plaintiff’s submissions": "21 Mr Ravindran submitted that Justin Lim did not have authority to deal with the defendant. He did not have actual authority as he only became a director of the plaintiff one day after the money was transferred to him. As for apparent authority, Mr Ravindran submitted that there was no such representation since Justin Lim was not involved in negotiating the loan agreement, which was negotiated by Mr Mahesh alone. 22 Mr Ravindran also pointed me to the defendant’s own board of directors’ resolution on 20 April 2015, which stated that US$6.55m – the full sum – was to be repaid. He submitted that there was no reason why the defendant would have taken out a resolution acknowledging that the full US$6.55m was still outstanding if it had already paid US$3m nearly two months earlier. 23 Mr Ravindran also submitted that it would have been grossly irregular for the US$3m, which was owed by the defendant to the plaintiff, to have been transferred to the personal account of Justin Lim. Further, it was left unexplained why, despite the debt being a sum of only US$3m, US$3.15m was transferred. Indeed this US$3.15m was transferred to Justin Lim in two tranches, a sum of US$1.55m and another sum of US$1.6m. He submitted that this strongly suggested that Justin Lim was acting for himself rather than for the plaintiff. 24 As to the application to file a further affidavit, Mr Ravindran objected on the grounds that the application was spurious. Mr Ravindran highlighted that the documents tendered by Mr Narayanan were mere application forms which could have been filled up by anyone. There was no signature by Justin Lim, nor was there an acknowledgment by the bank that the application was received and was being processed. It could not have been evidence of payment.",
        "My decision": "25 I first rejected the defendant’s application to file a further affidavit. The document which Mr Narayanan tendered before me was nothing more than an application form for the transfer of funds. It did not indicate that the bank had processed the transfer. Therefore those documents did not prove anything. 26 On the issue of apparent authority, I found that the defendant has not made out a triable issue or a reasonable probability that Justin Lim has apparent authority to receive money on behalf of the plaintiff. According toBanque, which was cited by the defendant, two requirements must be satisfied for apparent authority to be made out (at [69]): (a) There must be a representation made by the principal to the third party that the agent had authority to enter into transactions on the principal’s behalf. (b) The third party must have relied on this representation. 27 There was absolutely no evidence of a representation by the plaintiff that Justin Lim was empowered to receive payments on its behalf. Mr Narayanan’s case was that Justin Lim had made such representations but there was no evidence such as an affidavit from Justin Lim himself. As noted inM2Bat [19] (see above at [6]), a mere assertion without supporting evidence is not enough. 28 Further, I found that the defendant’s account was again both inconsistent with the objective documentary evidence and inherently incredible. The defendant’s version was that it had paid the US$3m outstanding to Justin Lim on 24 February 2015. By 20 April 2015, a full two months later when the defendant executed the board resolution, the amount that was left unpaid should have been only US$3.55m – which was subsequently paid on 29 April 2015 and 8 May 2015 (see above at [3]). But the board resolution instead stated that US$6.55m was owing. I did not find Mr Narayanan’s explanation that this was an acknowledgment of prior debt convincing because this was not what was stated on the face of the board resolution. Reasonable commercial parties are unlikely to have placed on record a debt that they have already made payment for. 29 This situation is similar to that inStone Forest Consulting Pte Ltd v Wee Poh Holdings Ltd[2004] 3 SLR(R) 216. In that case, the defendant had engaged the plaintiff for consulting services but did not pay the full amount. The plaintiff applied for summary judgment for the remaining sum. In dismissing the appeal against the registrar’s decision to grant summary judgment, MPH Rubin J (“Rubin J”) relied on a board resolution which stated that the board agreed to pay the plaintiff the full amount (at [11]-[14]). The defendant sought to circumvent the resolution using a second letter of engagement between the parties where the plaintiff allegedly qualified its initial obligations. Rubin J rejected this argument on the basis that the board resolution, which was passed some eight months after the second letter of engagement, did not refer to the second letter (at [15]). If the second letter of engagement had indeed qualified the first letter, the parties would have raised it in the board resolution. The same reasoning applies here: if the defendant had paid the US$3m on 24 February 2015, it would be difficult to imagine why this payment was not recorded in the board resolution of 20 April 2015. 30 But not only was the defendant’s account inconsistent with the objective evidence, it was also inherently incredible. The defendant’s account would have meant that despite the payments being of the same US$6.55m debt and owed to the same party, the defendant chose to make one set of payments (for US$3m) to the personal account of Justin Lim, and another set of payments (for the remaining US$3.55m) directly back to the plaintiff’s parent company. Further, the defendant had transferred US$3.15m, and not US$3m, to Justin Lim. When queried, Mr Narayanan submitted that this extra amount was for other loans that Justin Lim had personally extended to the defendant previously. I found this explanation incredible. Reasonable commercial parties were highly unlikely to have mixed personal and professional moneys to such a degree within the course of a single transaction. Furthermore, the defendant split the US$3.15m into two sums. Since US$3m was the debt owed to the plaintiff, presumably the amount owed to Justin Lim was US$150,000. It is puzzling that the split should be US$1.55m and US$1.6m and not US$3m and US$150,000 and the defendant provided no explanation for this. 31 At this point, Mr Narayanan sought to impress upon me that there was a triable dispute regarding who had been present at the conclusion of the oral agreement. I found that to be irrelevant. Neither party was disputing that an oral loan agreement had been entered into. While they did not agree on who were present at the conclusion of the oral loan agreement, the issue before me pertained to whether there was a representation as to who couldreceivethe moneys. 32 Accordingly, I found that the defendant had not made out a triable issue or a reasonable probability that Justin Lim had apparent authority to receive the US$3m on behalf of the plaintiff.",
        "Issue (b): Actual or apparent authority of Justin Lim": "",
        "Costs": "33 Since the application was dismissed, I ordered costs to the plaintiff to be fixed at S$3,000 inclusive of disbursements.",
        "Conclusion": "34 An incredible account of facts, baldly asserted through affidavits without supporting documents, should not constitute a reasonable basis to go to trial. There were too many holes in the defendant’s account. While I was mindful that the court should not prevent a defendant from ventilating his case, I was also mindful of the countervailing concern that mere assertions cannot suffice to deny a plaintiff the sums that he is rightfully due. The evidence in this case did not disclose to me anything other than mere assertions. Lee Seiu KinJudge Ravindran s/o Ramasamy (Colin Ng & Partners LLP) for the plaintiff;Nicholas Jeyaraj s/o Narayanan and Jared Andrew Kong (Nicholas & Tan Partnership LLP) for the defendant."
    }
}