{
    "case_title": "Gulf Hibiscus LtdvRex International Holding Ltd and another",
    "ncitation": "[2017] SGHC 210",
    "coram": "Aedit Abdullah JC",
    "sections": {
        "Introduction": "1 This is an appeal from the decision of the learned Assistant Registrar (“the AR”), who granted a stay of court proceedings on the basis that the matters raised in the court proceedings were covered by an arbitration clause.",
        "Background facts": "2 Lime Petroleum PLC (“Lime PLC”) is an Isle of Man company. It has three shareholders (“the Shareholders”), namely the plaintiff, Gulf Hibiscus Limited (“the Plaintiff”), which is a Malaysian company, Rex Middle East Limited (“RME”) and Schroder & Co Banque S.A. (“Schroder”). The first defendant, Rex International Holding Limited (“the 1st Defendant”) is the ultimate holding company of RME. The second defendant, Rex International Investments Pte Ltd (“the 2nd Defendant”) is the intermediate holding company of RME, and a wholly owned subsidiary of the 1st Defendant. Both the 1st and 2nd Defendants are locally incorporated companies and will collectively be referred to as “the Defendants”. 3 The issued shares in Lime PLC are currently held by the Shareholders in the following manner: (a) Plaintiff – 35%; (b) RME – 56.4%; and (c) Schroder – 8.6%. 4 Lime PLC has a number of subsidiaries, including a wholly owned company incorporated in the British Virgin Islands (“BVI”), Lime Petroleum Ltd (“Lime BVI”). Lime BVI in turn owns shares in the following BVI companies: Dahan Petroleum Limited (“Dahan”), Zubara Petroleum Limited (“Zubara”), Masirah Oil Limited (“MOL”) and Baqal Petroleum Limited. Lime PLC also owns shares in Lime Petroleum Norway A.S. (“Lime Norway”), a Norwegian company. 5 A Shareholders’ Agreement dated 24 October 2011 was entered into between the Plaintiff, RME (then known as Rex Oil & Gas Ltd), Schroder and Lime PLC (“the SHA”).1Foot Note 1×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at pp 34–35; Statement of Claim (Amendment No. 1) at para 5.Clause 1(H) of the SHA provided that the parties had entered into the agreement to “regulate the affairs of” Lime PLC and “their respective rights and obligations as shareholders of” Lime PLC.2Foot Note 2×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 36.Most pertinently, cl 25.2 of the SHA provides for a dispute resolution procedure with an arbitration mechanism (“the arbitration clause”).3Foot Note 3×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 65. 6 There are,inter alia, two other relevant agreements. First, the Project Management and Technical Services Agreement dated 24 October 2011 (dated the same date as the SHA) (“the PMTSA”), which was entered into between Lime PLC and Hibiscus Oilfield Services Limited (“HOSL”). HOSL is an affiliate company of the Plaintiff’s parent company. Under the PMTSA, HOSL was appointed as a service provider for Lime PLC wherein it was tasked to prepare annual work programmes or plans and budgets (“the WPBs”) for,inter alia, MOL. The WPBs would then be submitted to Lime PLC’s board, the approval of which would represent a commitment by the Shareholders to fund specific items within the WPBs. 7 The second relevant agreement is the Operating Services Agreement dated 22 March 2012 (“OSA”) that was entered into between Lime PLC and MOL. In 2014, the Ministry of Oil and Gas in Oman alleged that MOL had not complied with good oilfield practices with regard to the drilling of an offshore exploration well. MOL relied on this allegation to terminate the OSA by way of a letter dated 28 February 2015. 8 Although Lime PLC initially owned the whole of Lime Norway, its shareholding was subsequently reduced. The Plaintiff alleged this was the result of various wrongs committed by the Defendants (“the Lime Norway Allegations”). Allegations were also made by the Plaintiff in respect of the conduct of the Defendants, their associated companies and associated persons. The Plaintiff commenced an action by way of Suit 412 of 2016 (“S 412/2016”). The Defendants sought a stay of proceedings in S 412/2016 in light of the court’s exercise of case management powers, relying on the arbitration clause in the SHA. 9 There are or were other connected proceedings in the Isle of Man and Norway (“the foreign proceedings”): (a) the Isle of Man matter concerned a derivative  action against the directors of Lime PLC; and (b) the Norwegian proceedings apparently involved a putative action against officers of Lime Norway. 10 A number of adjournments were sought and granted, particularly in light of the foreign proceedings.",
        "Decision of the AR": "11 Before the AR, the Defendants relied on two separate bases in their application to stay proceedings in S 412/2016. First, they sought to invoke the court’s inherent jurisdiction to stay proceedings for case management interests. On this basis, they submitted that the claims raised in S 412/2016 were premised on or overlapped with the alleged breaches of the disputes arising out of the SHA. As such, the claims should be referred to arbitration in accordance with the SHA and S 412/2016 should be stayed pending the arbitration. Second, they submitted that the institution of S 412/2016 was an abuse of process, which justified for a stay of the proceedings. 12 The AR granted the Defendants’ application for stay on the first basis but found that the second basis was not made out, issuing oral grounds for his decision. 13 The AR found that on the pleadings as they stood, the legal and factual disputes in the Plaintiff’s claims overlapped and were intertwined with those concerning breaches of the SHA. The conspiracy allegations were founded on events concerning the dilution of Lime PLC’s shareholding in Lime Norway, and thus involved breaches of the SHA, though there were some issues which were technically unrelated. The claims in relation to the various subsidiaries of Lime PLC were also similarly founded on breaches of the SHA. As for the unjust enrichment, wrongful interference and inducement for breach of contract claims, these were also found to be based on breaches of the SHA. Given the significant overlap, the close relationship between the parties in the two proceedings, the duplication of witnesses, the risk of inconsistent findings, and there being no bar to the claims in S 412/2016 being pursued in arbitration in accordance with the SHA, a stay was ordered. 14 The AR noted that the Plaintiff’s counsel wished to pursue its claims as pleaded, and there was no intention to amend its pleadings. Given this indication, the AR did not find it necessary to give the Plaintiff an opportunity to amend its pleadings. 15 As for the Defendants’ argument that there was, alternatively, an abuse of process, the AR found that there was insufficient evidence of this.",
        "The current applications": "16 On 29 September 2016, the Plaintiff filed an appeal against the AR’s decision to grant a stay of court proceedings (“RA 348/2016”) and subsequently applied to amend its pleadings on 3 November 2016 (“SUM 5355/2016”). 17 The Defendants then sought leave to file a further affidavit on 24 November 2016 (“SUM 5691/2016”). 18 After hearing the parties, I allowed the Plaintiff to amend its pleadings and consequently granted leave to the Defendants to adduce further evidence by way of an affidavit. However, I reserved my decision with regard to the stay of court proceedings in RA 348/2016.",
        "Plaintiff’s case": "19 In SUM 5355/2016, the Plaintiff argued that the proposed amendments to the pleadings should be permitted as no prejudice would result from them. The Plaintiff submitted that the AR had erred in not inviting an amendment, as was required by the Court of Appeal’s decision inTomolugenHoldings Ltd and another v Silica Investors Ltd and other appeals[2016] 1 SLR 373 (“Tomolugen”). With respect to SUM 5691/2016, it was argued that the Defendants should not be allowed to raise new evidence on appeal and the further affidavit should thus not be admitted. 20 Following the amendments to the pleadings by way of SUM 5355/2016, the Plaintiff submits that there is no longer any basis to order a stay. The Plaintiff argues that the amendments removed all reliance on breaches of the SHA. The SHA is thus irrelevant in respect of the amended claims. 21 The Plaintiff agrees with the Defendants and the observations made inTomolugenthat the relevant question is whether the substance of the controversy is covered by the arbitration clause. On the facts however, the Plaintiff argues that the scope of the SHA does not cover the amended claims. 22 The Plaintiff further submits that it cannot be compelled to bring arbitration proceedings against a specific party that it does not intend to sue. This approach is evident from some of the cases relied upon by the Defendants (includingTomolugen) where the plaintiff had already initiated arbitration and/or court proceedings against a party, with whom the plaintiff has an arbitration agreement, thereby evincing an intention to bring legal proceedings against this party. 23 Furthermore, it is significant that neither the Plaintiff nor the Defendants are parties to the PMTSA or OSA. Thus, the Plaintiff argues that the Defendants cannot invoke the arbitration clauses in either agreements to stay the action. 24 In addition, the Plaintiff asserts that the Defendants’ arguments in relation to the abuse of process and multiplicity of proceedings are not made out. According to the Plaintiff, the Lime Norway Allegations do not raise issues of abuse of process, or create multiplicity of proceedings. The appropriate standard was noted inCheeSiok Chin and others v Minister for Home Affairs and another[2006] 1 SLR 582 – a high threshold for abuse of process or vexatiousness is to be made out and clear evidence is required. For abuse of process to be made out, it must also be shown that unmeritorious claims are being made: seeChua Choon Lim Robert v MN Swami and others[2000] 2 SLR 589. 25 The Plaintiff’s position is that no abuse of process arises on the facts. There is no clear evidence of abuse and the multiple suits are not intended to apply maximum pressure. The Plaintiff also highlights the differences between the proceedings in Singapore, Isle of Man and Norway. The Isle of Man proceedings concern derivative claims, and no substantive claims are being pursued there. In comparison, the present litigation in Singapore relates to injuries caused to the Plaintiff. The Norwegian proceedings can also be distinguished as they relate to an action against persons who are officers of Lime Norway and do not concern the Defendants. The foreign proceedings thus either concern different causes of action or involve action against different entities. There are hence no current proceedings in the other jurisdictions that cover the same claims as S 412/2016.",
        "Defendants’ case": "26 In SUM 5355/2016, the Defendants argued that the proposed amendment of pleadings should not be permitted. While the Defendants conceded that amendments are generally allowed on appeal, they sought to distinguish the present application on the basis that the AR below had specifically invited the Plaintiff to amend. A prior opportunity to amend was thus specifically given to the Plaintiff. The Plaintiff chose not to take up the AR’s invitation, waited for the AR’s decision, and only indicated its intention to apply for an amendment on the eve of the first hearing scheduled for RA 348/2016. The Defendants went further to assert that it was in fact mischievous for the Plaintiff to criticise the AR, who could not have forced the Plaintiff to amend. 27 With respect to RA 348/2016, the Defendants argue that a stay of S 412/2016 should be granted because the Plaintiff has an arbitration agreement with RME under cl 25.2 of the SHA. They submit that a stay in the interests of case management may be granted even if the applicant is not directly a party to the arbitration agreement, relying on the decisions inDanoneAsia Pacific Holdings Pte Ltd v Fonterra Co-operative Group Limited[2014] NZHC 1681 (“Danone”),Reichhold Norway ASA v Goldman Sachs International[2000] 1 WLR 173 (“Reichhold”) andShanghai Construction (Group) General Co Singapore Branch v Tan Poo Seng[2012] SGHCR 10 (“Shanghai Construction”). In particular, the Defendants highlight that the case ofShanghai Constructionwas not doubted by the Court of Appeal inTomolugen. The only change that came throughTomolugenwas the relevant threshold for granting a stay. 28 The Defendants argue that the claims made by the Plaintiff in S 412/2016,ie, conspiracy, wrongful interference, and unjust enrichment, are still premised on breaches of the SHA notwithstanding the amendments made to the pleadings. They reason that one cannot just look at the cause of action pleaded, otherwise, an artful pleader would be able to circumvent the arbitration agreement. The Defendants claim that everything alleged by the Plaintiff relates to the activities of Lime PLC and its subsidiaries. In considering the characterisation and scope of an arbitration clause, a practical and commonsensical inquiry ought to be adopted. In the present case, the Defendants take the position that the arbitration clause in the SHA has a wide scope because it covers disputes arising from or in relation to the subsidiaries of Lime PLC. 29 CitingTomolugen, the Defendants submit that the court must look at the substance of the controversy. Here, the claim is really about the relationship of the parties as the Shareholders of Lime PLC under the SHA – the allegations in S 412/2016 relate to the dilution of the Plaintiff’s indirect interest in Lime PLC. Allegations are also raised as to the management of MOL, the affairs of Lime PLC and Lime Norway. As such, the Defendants argue that the substance of the controversy is really the Shareholders’ dispute arising out of the SHA. They also claim that similar allegations were raised in the Isle of Man proceedings. 30 According to the Defendants, the rectification notice dated 25 March 2015 served by the Plaintiff on RME4Foot Note 4×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-13) at p 189.as well as that dated 2 November 2015 served by the Plaintiff on RME and Schroder5Foot Note 5×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-09) at p 85.(“the Rectification Notices”), where the Plaintiff alleged breaches of the SHA arising from the same facts, are strongly suggestive that the Plaintiff itself regarded the matter as a shareholders’ dispute covered by the SHA. 31 Applying the factors considered inDanone, the Defendants submit that the Plaintiff’s claims are derived from and subsidiary to the allegations of breaches of the SHA. For example, in relation to the Lime Norway Allegations, the Plaintiff has to show breach of cll 10, 12.1.4, and 14.1 of the SHA. Similarly, as regards MOL, cll 12.1.4 and 14.1 of the SHA have to be relied on. The allegations thus arise out of and concern the affairs of Lime PLC and its subsidiaries. Properly characterised, the nub of the Plaintiff’s complaints falls within the scope of the arbitration clause in the SHA. 32 Additionally, the Defendants claim that there is a significant area of overlap between the factual and legal issues raised in the court proceedings in S 412/2016 and any future arbitration between the Plaintiff and RME under the SHA. As there is no bar to raising in arbitration matters that have already been raised in S 412/2016, a stay should be granted to prevent inconsistent findings. The Defendants also argue that it would be more appropriate to stay the whole of the court proceedings as opposed to just some of claims in S 412/2016. 33 The Defendants highlight that the complaints in the Isle of Man proceedings were stayed because the arbitration clause was found to have applied. As for the Norwegian proceedings, the Plaintiff may now commence an action in the Norwegian district court, since the conciliation proceedings have ended there. The Defendants therefore maintain that there remains a risk of multiplicity of proceedings. 34 The Defendants also allege that there has been an abuse of process, by relying on the email dated 9 October 2015 that was sent by Dr Kenneth Pereira (“Dr Pereira”). In the email, Dr Pereira, who was the Plaintiff’s nominated director of Lime PLC, threatened to sue everyone “at all levels”.6Foot Note 6×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-08) at p 83.According to the Defendants, the Plaintiff’s several court actions in the different jurisdictions represent their making good of that threat.",
        "My decision": "35 After the hearings, I allowed the pleadings to be amended. The amendments essentially omitted from the pleadings the portions where the Plaintiff relied on the SHA to make out its case. As a result of the amendment, I also allowed the Defendants’ application for a further affidavit to be admitted into evidence. 36 I reserved my decision for the issue on stay in RA 348/2016. The present decision on whether a stay should be ordered is accordingly based on the amended pleadings. Notwithstanding the amendments made, I find that the court proceedings should be stayed on certain conditions. 37 I now set out my reasons for allowing the amendment of pleadings in SUM 5355/2016 and my decision as to the stay of court proceedings in RA 348/2016.",
        "The amendment of the pleadings": "38 The issue on the amendment of pleadings was whether the Plaintiff should be allowed to amend its pleadings so as to remove all references to breaches of the SHA, which contains the arbitration clause. 39 The possibility of amending pleadings to avoid a stay of court proceedings was suggested in the Court of Appeal’s decision inTomolugen. InTomolugen, the plaintiff-respondent, Silica Investors Ltd (“Silica Investors”) sought relief under s 216 of the Companies Act (Cap 50, 2006 Rev Ed) for oppressive or unfairly prejudicial conduct towards it as a minority shareholder of a Singapore listed company (“AMRG”). Shares in AMRG were purchased by Silica Investors from the second defendant, Lionsgate Holdings Pte Ltd (“Lionsgate”), pursuant to a share sale agreement that contained an arbitration clause. One of the allegations concerned the issuance of a large number of AMRG shares which allegedly had the effect of diluting Silica Investors’ shareholding in AMRG (“the Share Issuance Allegation”). At the hearing of the appeals inTomolugen, the Court of Appeal (at [131]) gave the opportunity for Silica Investors to amend its pleadings because the pleadings for the Share Issuance Allegation, as they stood, had engaged the warranties in the share sale agreement, giving rise to considerations of whether they had been breached. 40 In addition, Silica Investors had made another allegation (the “Management Participation Allegation”) that was also the subject of the arbitration agreement between Silica Investors and Lionsgate. The Court of Appeal held that if Silica Investors decidednotto pursue the Management Participation Allegation against Lionsgate, then there would be no need for the court proceedings to be stayed in favour of arbitration (at [190]). 41 The Plaintiff argued that applyingTomolugen, the Plaintiff should have been invited by the AR to amend its claims below. The Defendants counter-argued that the amendments should be disallowed, submitting that the Plaintiff had chosen not to amend when invited by the AR. It would thus be inappropriate to allow the amendment on appeal. 42 It is uncontroversial that a court can grant leave for amendments to pleadings “at any stage of the proceedings”: see O 20 r 5(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed). Amendments can accordingly be allowed evenduringappeals: seeChwee Kin Keong v Digilandmall.com Pte Ltd[2005] 1 SLR(R) 502 at [101]. As pointed out by the Court of Appeal inReview Publishing Co Ltd v Lee Hsien Loong[2010] 1 SLR 52 (“Review Publishing”) at [112(c)], amendments to pleadings have been allowed even “in the course of an appeal itself” in several local cases. 43 As a general rule, amendments to pleadings ought to be allowed if they would enable the real question and/or issue in controversy between the parties to be determined (Review Publishingat [113], citingWright Norman and another v Oversea-Chinese Banking Corp Ltd[1993] 3 SLR(R) 640 at [6]). In determining whether to grant a party leave to amend his pleadings, the court has regard to “the justice of the case” and amendments may be disallowed on appeal where any prejudice suffered is such that it cannot be compensable by an award of costs or where it would be akin to allowing the applicant a second bite at the cherry: seeAsia Business Forum Pte Ltd v Long Ai Sinand another[2004] 2 SLR(R) 173 at [12] and [18]. 44 In the present case, I found that there was no such prejudice or an attempt to revisit decided issues. The amendments sought by the Plaintiff were to reframe its claims to avoid the outcome of a stay in favour of arbitration. Such reframing did not amount to a revisiting of a decided matter – it involved the Plaintiff giving up parts of its initial claim (for instance, it entirely abandoned its claim for inducement by the Defendants for RME’s breach of contract,ie, the SHA) so as to not run afoul of the principle laid down inTomolugen. There was also no trial or evidential hearing, such that any changes to the pleadings would necessitate testimony and questioning to be run through again. Additionally, inTomolugenitself, the invitation to amend was similarly made at the appellate stage. The fact that these amendments may affect the outcome of RA 348/2016 is not a material consideration – as noted above, the courts have allowed amendments on appeal provided no prejudice is caused. 45 There thus did not appear to be much that stood in the way of allowing the amendments to be made, subject to the question of costs. 46 I do note that the Plaintiff’s actual arguments rested on the assertion that the AR’s conduct of the matter was incorrect – he should have effectively directed or strongly invited the amendment.7Foot Note 7×Plaintiff’s Supplementary Written Submissions dated 14 December 2016 at para 27.From a perusal of the notes of evidence below, it was clear that the AR had expressly asked the Plaintiff’s counsel whether the Plaintiff intended to amend its pleadings, to which the answer was that there were no present instructions from the Plaintiff to do so. Short of amending the pleadings himself, I was unable to determine what else the AR could have done in the circumstances. 47 In fact, when invited by the AR, the Plaintiff should have taken up this opportunity. This was the approach adopted by the Court of Appeal inTomolugen(at [131]–[132]): 131  At the hearing of these appeals,wesuggestedto counsel for Silica Investors, Mr Paul Ong, that the manner in which the Share Issuance Allegation had been pleaded appeared to engage the warranties in the Share Sale Agreement and give rise, at least indirectly, to considerations of whether they had been breached.Mr Ong resisted this suggestion vigorously.He contended that Silica Investors was not alleging that the warranties in the Share Sale Agreement had been breached; on the contrary, it was relying on the truth of those warranties to evidence its contention that the liabilities relating to the Solar Silica Assets had already been settled by the time the Share Sale Agreement was concluded. Mr Ong further contended that there was no need for Silica Investors to rely on the Share Sale Agreement to make good its allegation that the alleged debts were fictitious and the share issuance, improper. We did not, however, think that Silica Investors’ pleadings on the Share Issuance Allegation cohered entirely with Mr Ong’s position before us, and so, at the close of the hearing,we gave Silica Investorsan opportunityto amend its pleadings on that allegationif it desired. 132Silica Investors took up the opportunity.… [emphasis added in italics and bold italics]  The Plaintiff’s own failure to amend the pleadings could not be subsequently laid at the feet of the AR. 48 Nonetheless, the fact that the Plaintiff did not take up the invitation by the AR does not mean that they should now be precluded from doing so on appeal. I would note however that given these circumstances, there may be a case for adverse cost consequences being visited upon the Plaintiff. I will deal with this on a separate occasion.",
        "Effect of the amendments": "49 The pleadings, as they stood originally, made various references to the SHA, including specific clauses concerning the stipulation for a “Supra Majority” for certain decisions to be taken (cl 14.1),8Foot Note 8×Plaintiff’s original SOC at paras 13 and 215 –216.representation of the Plaintiff on associated companies (cl 12.1.4),9Foot Note 9×Plaintiff’s original SOC at para 147, 167 and 216.and the use of funds as required by the SHA (Schedule A to the SHA).10Foot Note 10×Plaintiff’s original SOC at para 167. 50 The amended pleadings omit these references and discontinue the claims founded upon breaches of the SHA. The amended pleadings allege the following wrongs committed by the Defendants:11Foot Note 11×SUM 5355/2016 (Statement of Claim (Amendment No. 1). (a) conspiracy (by both lawful and unlawful means) in relation to actions concerning the dilution of Lime PLC’s shares in Lime Norway, and the improper amendment of Lime Norway’s articles of association; (b) conspiracy (by both lawful and unlawful means) in respect of MOL by diluting Lime PLC’s interest in MOL, improper management of MOL and its operations, as well as its ownership; (c) conspiracy (by both lawful and unlawful means) in respect of Lime PLC, concerning protracted payment delays, exclusion of an officer of the Plaintiff from Lime PLC matters; bad faith withdrawal of funding commitments;  and conduct in respect of a claim made by MOL against Lime PLC; (d) unjust enrichment by the Defendants in gaining a higher effective interest in Lime Norway at the expense of the Plaintiff; and (e) wrongful interference in actions that should have been taken by Lime PLC, particularly in respect of Lime Norway. While the amended pleadings still contain a reference to the SHA,12Foot Note 12×Statement of Claim (Amendment No. 1) at paras 11–12 and 131.this appears to be only part of the background description of the relationship between the various parties concerned. The issue of whether the Plaintiff can successfully make out its case without reliance or invocation of the SHA is a separate matter, which I address further below. 51 Considering the state of the pleadings as they now stand after the amendments, I turn now to the important question of whether a stay of the court proceedings in S 412/2016 should be granted.",
        "Stay of court proceedings in S 412/2016": "52 After carefully considering the submissions made by the Plaintiff and the Defendants as well as the Court of Appeal’s decision inTomolugen, I affirm the AR’s decision for S 412/2016 to be stayed. I will however, vary the terms of the stay. 53 In my judgment, the stay of S 412/2016 is granted on the following conditions: (a) if the tiered dispute resolution under cl 25.2 of the SHA is not triggered by any of the parties to the SHAwithinthree monthsfrom the date of this judgment or an arbitration is not commencedwithinfive monthsfrom the date of this judgment, the parties shall be at liberty to apply to the court to lift the stay; (b) the Defendants be bound by the findings of fact made by the putative arbitral tribunal; (c) the parties shall be at liberty to pursue the court proceedings in S 412/2016 and apply to lift the stay if the putative arbitration is unduly delayed; and (d) following the conclusion of the arbitration proceedings, subject to anyres judicataissues, the parties are entitled to resume S 412/2016 against the Defendants.",
        "Reliance by non-parties to the arbitration agreement": "54 It is common ground between the parties, as found inTomolugenat [138], that the court has the inherent power to stay court proceedings in the interests of case management pending the resolution of a related arbitration. It is also common ground that such a stay can be granted even if the applicant is not directly a party to the arbitration agreement. 55 I am satisfied that the parties’ agreed position is correct. The consideration of the matter looks not only at whether the parties involved in the court proceedings are bound to each other in arbitration, but considers broader concerns including wider case management. That much is clear fromTomolugen: 188  … In this regard, we consider that the court’s discretion to stay court proceedings pending the resolution of a related arbitration,at the request of parties who are not subject to thearbitration agreement in question, can in turn be made subject to the agreement of those parties to be bound by any applicable findings that may be made by the arbitral tribunal. … [emphasis added] 56 InDanone,Venning J in the New Zealand High Court noted that the Arbitration Act 1996 (NZ) did not apply as the applicant in question and the defendant were not subject to an arbitration agreement between them. Nonetheless, Venning J found that the court had a discretionary power, supported by r 15.1 of the New Zealand High Court Rules, to allow a stay of proceedings instead of striking out. Venning J also found that there was an inherent power to order a stay. 57 The decision inReichhold,a decision of the Queen’s Bench Division, is to the same effect. The plaintiff’s action was stayed pending an arbitration between the defendant and a third party. Moore-Bick J noted (at 46–47) that the court’s power to stay proceedings is part of its inherent jurisdiction, covering a wide range of circumstances. 58 Such an inherent jurisdiction was also recognised inShanghaiConstruction,a pre-Tomolugencase. In that decision, Eunice Chua AR concluded that the inherent jurisdiction to stay proceedings in the absence of an arbitration agreement between the parties involved in the court proceedings would only be exercised in “rare and exceptional circumstances” (at [16]). Even though the threshold is now different given the decision inTomolugen(see [60] below),Shanghai Constructionremains valid for the proposition that a stay can be ordered in respect of court proceedings between parties who are not bound to an arbitration agreement with each other. 59 This must be correct. The power to order a case management stay is part of the court’s own inherent and immediate powers to control proceedings before it. While the existence of an arbitration agreement between the parties would give strong grounds for a stay of court proceedings taken in contravention of that agreement, there are already express statutory provisions conferring the power to stay under s 6 of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the IAA”) or s 6 of the Arbitration Act (Cap 10, 2002 Rev Ed) (“the AA”) (for domestic arbitrations). Instead, the inherent power is invoked to deal with situations without an express agreement between the relevant parties to the court proceedings. Furthermore, the jurisprudential basis for the exercise of the power to stay in the absence of an agreement is the wider need to control and manage proceedings between the parties for a fair and efficient administration of justice; it is not predicated on holding parties to any agreement – the absence of such an agreement is therefore irrelevant. 60 Accordingly, while the Defendants are not parties to the arbitration agreement with the Plaintiff, in principle, they may seek a stay of proceedings on the basis of case management, if it is established that it is necessary to “serve the ends of justice”: seeTomolugenat [188].",
        "Case management": "The law 61 After a comprehensive review of foreign authorities from England and New Zealand, the Court of Appeal inTomolugenmade the following observations in relation to the court’s exercise of inherent jurisdiction: 187  We would not set the bar for the grant of a case management stay at the “rare and compelling” threshold that the English and the New Zealand courts have adopted. We recognise that a plaintiff’s right to sue whoever he wants and where he wants is a fundamental one. But,that right is not absolute. It is restrained only to a modest extent when the plaintiff’s claim is stayed temporarily pending the resolution of a related arbitration, as opposed to when the plaintiff’s claim is shut out in its entirety:ReichholdNorway (HC)([165]supra) at 491perMoore-Bick J. In appropriate cases, that right may be curtailed or may even be regarded as subsidiary to holding the plaintiff to his obligation to arbitrate where he has agreed to do so. The strength of the plaintiff’s right of timely access to the court will therefore vary depending on the facts of each case. … 188  This does not mean that if part of a dispute is sent for arbitration, the court proceedings relating to the rest of the disputewillbe stayed as a matter of course.The court must in every case aim to strike a balance between three higher-order concerns that may pull in different considerations: first, a plaintiff’s right to choose whom he wants to sue and where; second, the court’s desire to prevent a plaintiff from circumventing the operation of an arbitration clause; and third, the court’s inherent power to manage its processes to prevent an abuse of process and ensure the efficient and fair resolution of disputes. The balance that is struck must ultimately serve the ends of justice.In this regard, we consider that the court’s discretion to stay court proceedings pending the resolution of a related arbitration, at the request of parties who are not subject to the arbitration agreement in question, can in turn be made subject to the agreement of those parties to be bound by any applicable findings that may be made by the arbitral tribunal. … [emphasis added in bold italics] 62 As evident from the above, the exercise of the inherent jurisdiction turns on the balance to be struck between the three higher-order concerns identified inTomolugen: (a) a plaintiff’s right to choose whom he wants to sue and where; (b) the court’s desire to prevent a plaintiff from circumventing the operation of an arbitration clause; and (c) the court’s inherent power to manage its processes to prevent an abuse of process and ensure the efficient and fair resolution of disputes. 63 In exercising the court’s discretion,Tomolugen(at [188]) also endorsed the set of factors adopted inDanone. In that case, Venning J laid out a number of criteria to indicate whether a stay should be ordered (at [54]–[92]): (a) whether the claims in the court proceedings were derived from the claims subject to arbitration; (b) whether there was overlap between the claims in the arbitration  and the court proceedings; (c) whether there was anything to bar claims in the court proceedings from being pursued in the arbitration; (d) whether the findings made in the arbitration would bind the parties to the court proceedings; (e) the risk of inconsistent findings between the arbitral tribunal and the court; (f) duplication of witnesses and evidence; and (g) whether there was agreement between the parties to resolve disputes by arbitration. 64 Essentially, these factors are concerned with the inquiry as to whether  the court proceedings in S 412/2016 are so connected to the SHA that stay should be granted. In the present case, the consideration of whether the SHA is engaged should be determined by considering whether the present dispute is within the scope of the arbitration clause. Evidently, this entails two distinct steps: (a) what is the nature of the claims pursued in the court proceedings; and (b) what is the scope of the arbitration agreement. 65 In undertaking the first inquiry, the Court of Appeal has helpfully identified from a survey of foreign cases that the court must determine what is the “substance” of the controversy before determining whether the arbitration agreement covers it (seeTomolugen): 125  When ascertaining whether a given matter is covered by an arbitration clause, the court must considerthe underlying basis and truenature of the issue or claim, and is not limited solely to the manner in which it is pleaded(see, for example,Larsen Oil vPetroprodat [7]–[10]). As Andrew Smith J stated inLombard North v GATX… at [14]: … The question of course depends upon the nature of the claim (or claims) made in the legal proceedings, but not, I think only on the formulation of it (or them) in the claim form and any pleadings. That would allow a claimant to circumvent an arbitration agreement by formulating proceedings in terms that, perhaps artificially, avoid reference to a referred matter, knowing that any application to stay them must be made before a defence is pleaded. … 126  Blair J approached the issue in the same way inPT Thiess ContractorsIndonesia v PT Kaltim Prima Coal[2011] Arb LR 26, where he emphasised at [35]: … the importance of identifying the ‘substance of the controversy’, rather than the formal nature of the proceedings … [T]he court must consider the substance of the controversy as it appears from the circumstances in the evidence on the application (and not just the particular terms in which the Claimant has sought to formulate its claim in court). … 127  We agree with both these statements as to the proper approach which a court should take. … … 133  In keeping with the authorities before us, our task is toexaminethe substance of the controversywithout paying undue attention to the details of how it has been pleaded. … [emphasis added in italics and bold italics] 66 Under the second inquiry, in ascertaining the scope of the arbitration agreement, the court will not adopt a technical approach, but will construe the clause based on the presumed intention of the parties as rational commercial parties (Tomolugenat [124], citingFiona Trust & Holding Corporation vPrivalov[2007] 2 Lloyd’s Rep 267 at [13]). 67 In summary, the approach inTomolugenrequires a consideration of the “substance of the controversy” as well as the ambit of the arbitration clause to determine whether the “substance of the controversy” falls within the scope of the arbitration agreement. 68 As an aside, I note, as did the AR, that the discussion inTomolugenwas primarily concerned with stay within the context of s 6 of the IAA, construing “matter” as used in s 6(2) of the IAA. However, as the AR found, I do not understand the principles laid out inTomolugenas being confined to disputes falling within the scope of the IAA. The approach laid down by the Court of Appeal in respect of case management powers is generally applicable where the dispute engages an arbitration agreement. In a similar vein, the approach inTomolugenhas been applied to stay of proceedings where the arbitration clause had been subject to the AA: seeMaybankKim Eng Securities Pte Ltd v Lim Keng Yong and another[2016] 3 SLR 431 (“Maybank”) at [22]–[24]. This is also not a point in dispute between the parties. 69 I note further that the Defendants had in fact initially put forward s 6 of the IAA as one of the grounds for a stay and then subsequently withdrew this.13Foot Note 13×SUM 2714/2016 at para 1.The abandonment of this point is explicable. Given that there is no arbitration agreement between the parties to the S 412/2016, s 6 of the IAA is not applicable and thus nothing turns on this in the present appeal. Instead, the key question is whether the court should exercise its inherent jurisdiction to stay the court proceedings in S 412/2016. Application to the facts 70 Here, the Plaintiff’s claims as they stand concern unlawful means and lawful means conspiracy in relation to various entities, unjust enrichment claims and wrongful interference. In applying the approach laid out inTomolugen, the essential question then is whether the SHA (which contains the arbitration clause) is engaged by these claims after the pleadings have been amended. 71 The Plaintiff argues that as a result of the amendments to the pleadings, the SHA will not be engaged by the court proceedings in S 412/2016 and there is thus no basis to grant the stay requested by the Defendants. The Defendants on the other hand maintain that even with the amended pleadings, the allegations raised touch on matters covered by the SHA, and which thus would properly be the subject of arbitration between the Plaintiff and RME. The Defendants argue that the heart of the Plaintiff’s suit arises from the relationship between the Plaintiff and RME as shareholders of Lime PLC and that the Plaintiff seeks to circumvent the arbitration agreement by framing its claims against RME’s parent companies, who are the present Defendants. 72 The Defendants argue that the arbitration agreement in cl 25.2 of the SHA is intended to cover disputes arising from or in relation to the subsidiaries such as disputes over their proper management and control. The Plaintiff however argues that the SHA is irrelevant in respect of the amended claims. For instance, the claim of conspiracy in respect of Lime PLC’s votes at company meetings did not invoke the obligations in the SHA, but relies instead on the general duties owed by directors. Similarly, the claims in relation to the unreasonable withholding of payments by Lime PLC from HOSL (the Plaintiff’s subsidiary) does not engage the SHA – there is nothing in the SHA to justify or support such conduct on the part of Lime PLC.14Foot Note 14×Plaintiff’s Written Submissions dated 19 October 2016 at para 41–44. 73 I shall begin the analysis by first ascertaining the scope of the arbitration agreement in the SHA. Clause 25.2 of the SHA provides for a tiered dispute resolution, starting first with amicable resolution, then negotiations between a principal officer from each of the Shareholders, and then arbitration under the then extant Rules of International Arbitration of the International Chamber of Commerce. The scope of the arbitration clause expressly covers:15Foot Note 15×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 65. …anydispute, controversy or claimarising under, out of or relating to this Agreement(and subsequent amendments thereof), its valid conclusion, binding effect, interpretation, performance, breach or termination,including tort claims(each, a “Dispute”)… [emphasis added] 74 The phrase “arising under, out of or relating” to the agreement is a very wide one. In this vein, the Defendants point to various other parts of the SHA as showing that the scope of the arbitration clause extended to matters relating to the subsidiaries of Lime PLC:16Foot Note 16×Defendants’ Written Submissions dated 19 October 2016 at para 25. (a) clause 2.1 defines “business” to include “other future businessof [Lime PLC] the exploration for and development and exploitation of oil and gas deposits and related sale or disposal of oil and gas products, wherever situated, onshore or offshore and all activities relating thereto” [emphasis added];17Foot Note 17×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 37. (b) clause 12.1.4 provides that the Plaintiff (after its subscription for shares in Lime PLC) may nominate a person to act as a representative of Lime PLC and as a director on the board or governing committees of Lime BVI, Dahan, Zubara and MOL (as well as all other subsidiaries of Lime PLC);18Foot Note 18×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at pp 45–46. (c) clause 14.1 provides that certain matters relating to the business of Lime PLC may be approved only by a “Supra Majority” (“a Board Reserved Matter”), and “any changes, amendments or variations to the terms of the existing concession agreements (including related agreements thereto)” involving Lime BVI, MOL, Dahan and Zubara “or any other subsidiary or subsidiary undertaking of the Company or Associate Company” is a Board Reserved Matter;19Foot Note 19×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at pp 48–51.and (d) clause 15 provides for consolidated accounts and refers to obligations which extend to Lime PLC’s subsidiaries.20Foot Note 20×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at pp 52–53. 75 I agree with the Defendants’ submission that the arbitration agreement in cl 25.2 must be read in light of the other clauses in the SHA. On a contextual reading of cl 25.2 in light of some of the other clauses in the SHA, which shed light on the intended scope of SHA, I am satisfied that the arbitration agreement does not only cover disputes concerning the specific parties to the SHA,ie, the Plaintiff, RME, Schroder and Lime PLC, but also disputes in relation to Lime PLC’s subsidiaries, including Lime Norway and MOL. 76 Even though the subsidiaries in question are not part of the SHA, and their affairs are also not directly dealt with in the SHA, the SHA does cover a number of matters involving the subsidiaries. One example is the ability given under cl 12.1.4 of the SHA to nominate a director directly to the board of the various subsidiaries of Lime PLC, which impacts on the oversight maintained over these subsidiaries, in terms of their activities, operations and management. Similarly, cl 14.1, which reserves certain matters to a “Supra Majority”, particularly reserves changes to concession agreements of Lime Norway, MOL, and other subsidiaries as a Board Reserve Matter (see cl 14.1(ii) of the SHA).21Foot Note 21×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 50.As defined in cl 2.1 of the SHA, the “Supra Majority” references the “collective express approval of each Director nominated by [the Shareholders]”. SHA thus governs the control exerted by the Shareholders over Lime PLC’s subsidiaries. These provisions show that the Shareholders did intend to regulate their disputes pertaining to thegeneral businessof Lime PLC,including its subsidiaries, under the framework of the SHA. 77 I am however not persuaded that cl 15, which provides for consolidation of accounts, and certain obligations covering the subsidiaries, lends support to the Defendants’ argument. This is because cl 15 only concerns Lime PLC’s activities and financial reporting,quaholding company. 78 Accordingly, the SHA itself covers: (a) the affairs of Lime PLC and its subsidiaries; (b) majority voting and other rights and obligations of the Shareholders; and (c) representation on boards of subsidiaries, including Lime Norway and MOL. 79 This means that issues in respect of the proper administration of the subsidiaries of Lime PLC that may arise from the control exerted by any of the Shareholders, fall within the ambit of the arbitration agreement. 80 On the face of it, the Plaintiff’s amended statement of claim does notdirectlyengage the SHA. However, the reduced reference to the SHA in the pleadings is not determinative of the appeal. As stated by the Court of Appeal inTomolugen, the crux of the inquiry on whether to order a stay requires an examination of the “substance” of the court proceedings, and not only on how it is presented at the surface level in the pleadings (see [64] above). 81 In the present case, I understand that this approach entails that each of the various categories of claims be considered separately, and its respective connection with the agreement discerned. 82 To recapitulate, the amended claims may be summarised as follows: (a) conspiracy (by both lawful and unlawful means) in relation to actions concerning the dilution of Lime PLC’s shares in Lime Norway, and the improper amendment of Lime Norway’s articles of association; (b) conspiracy (by both lawful and unlawful means) in respect of MOL by diluting Lime PLC’s interest in MOL, improper management of MOL and its operations, as well as its ownership; (c) conspiracy (by both lawful and unlawful means) in respect of Lime PLC, concerning protracted payment delays, exclusion of an officer of the Plaintiff from Lime PLC matters; bad faith withdrawal of funding commitments;  and conduct in respect of a claim made by MOL against Lime PLC; (d) unjust enrichment by the Defendants in gaining a higher effective interest in Lime Norway at the expense of the Plaintiff; and (e) wrongful interference in actions that should have been taken by Lime PLC, particularly in respect of Lime Norway. 83 It is true, as the Plaintiff submits, that the conspiracy claims do not directly invoke the SHA. Nonetheless, even after the amendments, these claims are still likely to involve a determination of the nature of the actions taken or omissions of various persons, including the directors and the Shareholders. In particular, the conduct of the Shareholders in this regard is a matter governed by the SHA. As submitted by the Defendants, the gravamen of the complaint by the Plaintiff is the dilution of its interests in Lime PLC and thus its say or participation in the various associated companies. In determining that essential issue, the findings of the court in the civil proceedings in S 412/2016 is likely to overlap with the various findings that may be made in the arbitration between the Plaintiff and RME in relation to the actions or omissions of the Shareholders. 84 Further, I also agree with the Defendants’ submission that the Rectification Notices showed that the Plaintiff’s own position was that key components of its claims stemmed from alleged breaches of the SHA. For instance, with respect to the conspiracy claim in relation to Lime Norway, the Plaintiff took the position in its Rectification Notice dated 2 November 2015 that the acts of RME leading to the alleged dilution of Lime PLC’s shareholding in Lime Norway were breaches under the SHA.22Foot Note 22×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-09) at p 87.The same points can be made in relation to the conspiracy claimsvis-à-visLime PLC and MOL. 85 At a holistic level, it is unlikely for the connections between the conspiracy claims here and the actions or omissions of the Shareholders as bound by the SHA to be untangled and separated. Furthermore, given that the risk of inconsistent findings between the arbitral tribunal and the court is a relevant consideration in determining whether stay should be granted (see [62(e)] above), another reason thus operates: there is to my mind a significant risk that there may be inconsistent findings between the court proceedings and arbitration. I am unable to find that, even after the amendments made by the Plaintiff, the significant overlap with any future arbitration has been minimised. 86 In particular, the conspiracy claim in respect of MOL and Lime PLC tangentially engage the PMTSA and OSA (both of which contain separate arbitration agreements to which neither the Plaintiff nor the Defendants are parties). In respect of the OSA, the Plaintiff alleges that the Defendants had conspired to compromise the Plaintiff’s interest in Lime PLC by improperly and unjustifiably terminating the OSA between MOL and Lime PLC.23Foot Note 23×Statement of Claim (Amendment No. 1) at paras 106–112.In respect of the PMTSA, the Plaintiff submits two claims. First, the Plaintiff alleges that the Defendants had conspired in the improper and unauthorised approval of MOL’s budget by the MOL board, which constituted a violation of the agreed process under the PMTSA.24Foot Note 24×Statement of Claim (Amendment No. 1) at paras 99–105.Second, the Plaintiff also alleges that the Defendants had conspired to unreasonably withhold payments owed by Lime PLC to HOSL under the PMTSA.25Foot Note 25×Statement of Claim (Amendment No. 1) at paras 131–133.Due to the presence of agreements other than the SHA to which neither the Plaintiff nor the Defendants are parties to, the Plaintiff argues that a stay cannot be ordered, at least in respect of these claims. 87 In my view, the Plaintiff’s argument misses the point. The conspiracy claim relating to MOL concerned the affairs of MOL, which is a vehicle set up by Lime PLC and thus forms part of the business affairs between RME and the Plaintiff in Lime PLC. The complaints are thus about the running of a joint venture, which is regulated under the SHA. In fact, the PMTSA is expressly referred to in the SHA26Foot Note 26×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at p 38.and any deviation from the PMTSA is subject to the requirement of “Supra Majority” approval under cl 14.1 of the SHA (see [75] above). Further, the Rectification Notices issued by the Plaintiff, alleging breaches of the SHA, contained references to several of these claims relating to the PMTSA and the OSA. This to my mind shows how these claims, even though they concern breaches of other related agreements, are all closely connected to the affairs of Lime PLC, which is regulated under the SHA. 88 As for the unjust enrichment and wrongful interference claims, the linkage to the shareholder relationship governed by the SHA is perhaps not as apparent as in the conspiracy claims. But I do find that the scope for overlap of facts and factual findings is nonetheless sufficiently significant so as to warrant a stay of those claims as well. The unjust enrichment claim is predicated on the alleged wrongful acts leading to the dilution of Lime PLC’s interests in Lime Norway and MOL, which are themselves components of the conspiracy claims relating to Lime Norway and MOL. It thus seeks recourse for similar injuries as is pleaded in relation to the conspiracy claims. The wrongful interference claim rests particularly on the Defendants’ alleged prevention of Lime PLC from voting against the Lime Norway proposals. This clearly overlaps with the issue as to whether there was any interference with Lime PLC’s actions in breach of the SHA. More critically, each of these claims seek to impugn the various actions of the Defendants and their associates. To my mind, it seems likely that the Defendants and their associates will point to the SHA and claim that it does not prohibit their actions,ie, they are likely to invoke the non-applicability of the SHA to justify their actions. 89 Considered holistically, I find that that the primary claims made by the Plaintiff are in the nature of disputes between the Shareholders under the SHA and pertain to alleged improper actions taken at the Lime PLC level. These are, in my view, disputes arising out of the SHA given that the SHA regulates the business of Lime PLC. All in all, several factors similar to those inDanonepoint towards a stay being the appropriate conclusion: (a) there is significant overlap between the factual issues in the arbitration with those in the court proceedings; (b) there are bound to be common issues in both forums, namely whether the dilution of Lime PLC’s interest in Lime Norway was wrongful; (c) there is a sufficient risk of inconsistent findings of fact between the court proceedings and the putative arbitration given these overlapping issues; (d) there is likely to be duplication of witnesses and evidence in both forums; (e) there is nothing to bar the claims made in relation to the activities of the Shareholders and directors in the court proceedings from being pursued in the putative arbitration. The arbitration clause is broad enough to encompass claims arising out of the SHA and associated tortious claims. As noted below at [101], the Defendants have confirmed on affidavit that they consider these issues to arise out of the SHA and are ready and willing for all disputes arising out of the SHA to be resolved pursuant to cl 25.2 of the SHA; and (f) the findings made in the arbitration would bind the parties to the court proceedings – the Plaintiff here is also a party to the arbitration agreement. Although the Defendants are not, given their request to stay the court proceedings, I find that they ought to be bound by the findings of fact reached by the arbitral tribunal (seeTomolugenat [188]). 90 I initially considered whether a stay could be refused on the imposition of a condition, namely that the SHA should not be invoked or relied upon by the Plaintiff in its case or at trial. In the end, however I do not consider this appropriate given my conclusion that the claims in the court proceedings do raise a risk of inconsistent findings. Such a risk would remain even if such conditions were imposed. In any event, it might be an artificial exercise and there is nothing to stop the Defendants from seeking refuge under the SHA. 91 I do not find that my approach here takes the position too broadly. The stay of S 412/2016 does not deprive the Plaintiff of his day in court; the resolution of matters in arbitration may instead clarify and delineate the issues, and avoid inconsistent findings. Just as inTomolugen, this is a case where there is a sole plaintiff,ie, the Plaintiff, who has contracted to arbitrate under the SHA. This obligation to arbitrate diminishes the force of any objection that its right of timely access to the courts is being compromised (Tomolugenat [187]). 92 At the end of the day, as noted inTomolugen(at [187]), a plaintiff’s right to proceed in the courts is not absolute. This right will not be unduly prejudiced in this case given the conditional nature of the stay, as well as the liberty of the Plaintiff to apply to court to reinstate the proceedings against the Defendants if the tiered dispute resolution under cl 25.2 of the SHA is not triggered within the specified period of three months from this judgment or a notice of arbitration is not issued within five months. Through this option, if the court proceedings are resumed, the Plaintiff is free to pursue its claims against whichever party it deems fit. 93 A conditional stay pending the resolution of a related arbitration also only restrains the Plaintiff’s right to sue to a limited extent. In my view, this is a case where the second and third higher order concerns inTomolugenshould take precedence over the first (see [62] above). Allowing the court proceedings to proceed in tandem may result in the court proceedings enveloping and effectively disposing of issues which are the subject matter of the arbitration orvice versa. This clearly undermines the second and third higher order concerns. In the present case, the ends of justice would be better served by upholding the agreement to arbitrate between the Plaintiff and RME and eliminating the procedural complexities that accompany parallel proceedings. 94 I also find that an opportunity for further amendments need not be offered. The point of the amendment mechanism inTomolugenis to allow the possibility of proceedings continuing in a manner that avoids inconsistency and inefficiency. I do not readTomolugenas stipulating that there be an open-ended ability to amend. That would leave proceedings hanging indefinitely. Rather, the opportunity to amend is given as the entanglement of court proceedings with arbitration claims may indeed only be clarified through the process of a stay application. That clarification should not entail more than a limited opportunity of amendment. If any, I find that any further amendment here would not likely tease out a free-standing court claim that could proceed on its own without touching or being touched by the arbitration proceedings. 95 That may not always be so across all cases. What effect any amendment of the pleadings may have will depend on the claims made in the specific case:  in some instances, such as perhaps that inTomolugen, it may be possible to carve out claims that do not conflict with the scope of the arbitration agreement. Here, however, even with the amendments, the nature of the claims that remain are such that they still entwined with the arbitration matters. Must a matter be brought against a defendant who is party to the arbitration agreement? 96 A final objection to stay that the Plaintiff makes is that a stay on the basis of case management can only be ordered if the dispute in the court proceedings has already been brought against a defendant who is a party to the arbitration agreement. This means that the dispute to be stayed must have already been brought against such defendant, whether in arbitral or court proceedings, such as to evince an intention of the plaintiff to commence legal proceedings against the particular defendant. In other words, a plaintiff cannot be compelled to bring claims against a party (even if it is a party to the arbitration agreement) when the plaintiff does not wish to even sue the party in the first place. The Plaintiff submits that this principle can be discerned from the facts of bothTomolugenandDanone.27Foot Note 27×Plaintiff’s Written Submissions dated 19 October 2016 at paras 45–52. 97 In my judgment, the Plaintiff’s argument is misplaced. It adopts an unprincipled chronological sequence as to thepriorexistence of legal proceedings against the defendant party, with whom the plaintiff is bound to arbitrate its disputes. It would be a significant constraint on the court’s discretion if it is able to stay the court proceedingsonlywhere legal proceedings have already commenced against the defendant party. This would mean that even where legal proceedings areimminentand where the parties have expressly indicated to the court that they will commence such proceedings, a stay cannot be ordered. There is no conceivable reason why a stay cannot be ordered where there is a strong possibility of multiplicity of proceedings arising in the future as a result of one of the parties (subject to the arbitration agreement) bringing a claim against the other. 98 Although the Plaintiff is correct to observe that the factual matrix in bothTomolugenandDanonewere such that the plaintiff had already commenced legal proceedings against the defendant party, I do not read these cases as laying down such a bright-line rule. In fact, the case ofShanghai Construction(which was cited by the High Court in theTomolugendecision (seeSilica Investors Ltd vTomolugen Holdings Ltd and others[2014] 3 SLR 815 at [133]) suggests the contrary. 99 InShanghai Construction, the plaintiff had a contractual agreement (which contained an arbitration clause) for certain building works to be performed by a construction company, Top Zone Construction & Engineering Pte ltd (“Top Zone”). The defendant was a director and shareholder of Top Zone. Subsequently, when a dispute arose between the plaintiff and Top Zone, the plaintiff commenced legal proceedings against the defendant. The defendant applied for a stay of the court proceedings pending the resolution of an “intended arbitration” between the plaintiff and Top Zone. The stay was granted. It is crucial to note that at the time the stay was granted, there were no existing legal proceedings between Top Zone and the plaintiff (seeShanghai Constructionat [9]). This decision makes eminent sense because if future proceedings are contemplated between the parties to the arbitration agreement, the proper recourse would be to stay the court proceedings where the factors weigh in favour of a stay as opposed to waiting until the relevant arbitration or court proceedings are commenced. 100 A similar outcome was reached in the decision ofMaybank. In that case, the first respondent entered into a series of contract (“the CFD transactions”) with the appellant, a securities brokerage. The CFD transactions were governed by,inter alia, a contract that contained an arbitration clause. The second respondent was the first respondent’s remisier for the CFD transactions under a remisier agreement containing an indemnity in favour of the appellant. When a subsequent dispute arose, the appellant then brought court proceedings against both respondents. It was common ground that the claims were governed by disparate dispute resolution mechanisms even though they were essentially for the same losses: the claim against the first respondent was subject to arbitration under the AA but the claim against the second respondent under the remisier agreement was subject to a non-exclusive jurisdiction agreement in favour of the local courts. At first instance, on an application to stay the court proceedings, the assistant registrar not only ordered the stay against the first respondent but also invoked the court’s case management powers to stay the court proceedings against the second respondent pending the outcome of the arbitration proceedings between the appellant and the first respondent. However, on appeal, the appellant was prepared to abandon its claims against the first respondent and expressed its intention to only proceed its claims against the second respondent. The observations made by Steven Chong J (as he then was) to this change in circumstances are worth quoting in full: 4  When the appeal came before me, the appellant, after some prevarication and in recognition of the difficulties in demonstrating any sufficient reason for refusing a stay under s 6 of the AA, elected to abandon the appeal against the first respondent. At the same time, the appellant’s counsel informed the court that it had no current instructions to commence any arbitration proceedings against the first respondent. This was clearly a tactical decision to aid the appellant’s argument that the claim against the second respondent, which is not subject to arbitration, should not be stayed since there will no longer be any pending arbitration proceedings between the first respondent and the appellant running in parallel with the court proceedings against the second respondent. 5  The respondents, who had no prior notice of the appellant’s decision to drop the appeal against the first respondent, were understandably taken by surprise. After taking instructions from the respondents following this development, the respondents’ counsel informed the court thatthe first respondent would initiate arbitration proceedings against the appellant under the CFD Terms and Conditions within 14 days of the hearing even if the appellant did not do so.Hence the issue of multiplicity of proceedingsprima facie remains alive. [emphasis added] 101 Chong J then proceeded to dismiss the appeal and accordingly upheld the stay of proceedings against the second respondent pending the resolution of the related arbitration between the appellant and the first respondent.Maybankdemonstrates that there is no prerequisite for an existing proceeding between the parties to the arbitration agreement before a case management stay can be ordered. More pertinently,Maybankshows that even if the plaintiff does not commence arbitration proceedings, the other party to the arbitration agreement can do so such that the issue of multiplicity of proceedings “remains alive”. 102 In the present case, the Defendants have confirmed on affidavit that the Defendants as well as RME are “ready and willing to do all things necessary to enable disputes that arise out of the SHA to be resolved expeditiously in accordance with the provisions of Clause 25 of the SHA”.28Foot Note 28×Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-05) at para 53.Thus, even if the Plaintiff does not initiate arbitration against RME, the Defendants can move RME to do so. Where such proceedings are brought, for the reasons stated above, a conditional stay is appropriate to serve the ends of justice. However, an undefined opportunity for arbitration to be commenced would also not be in the interests of justice. The best middle ground in such a case would be to stay the proceedings but for it to be lifted if the tiered dispute resolution under cl 25.2 of the SHA is not triggered within the specified period of three months from this judgment or a notice of arbitration is not issued within five months. This approach may cause a delay in the proceedings but it is the better approach to adopt in the circumstances, for the reasons explained above. In any event, the financial consequences of any delay can be addressed by an adequate award of interest: seeDanoneat [91].",
        "Abuse of process": "103 The Defendants raise abuse of process as another reason to stay the court proceedings in Singapore, pointing to the multiplicity of proceedings in Norway, the Isle of Man and Singapore. In this vein, they also rely on an email sent by Dr Pereira stating that the Plaintiff will commence “legal process against entities and individuals who have acted inappropriately at all levels, [Lime Norway, Lime PLC and the 1st Defendant]”.29Foot Note 29×Defendants’ Written Submissions dated 14 December 2016 at para 40; Dan Brostorm’s 3rd Affidavit dated 3 June 2016 (Exhibit DB-08) at p 83. 104 While there is potentially some overlap between the court proceedings, I could not find that there was such a degree of connection between these veracious claims that their institution in these different jurisdictions was such as to colour the Plaintiff’s actions with abuse. As the Plaintiff has shown, the Singapore proceedings are different from the foreign proceedings inone or moreof the following ways: they involve (a) different plaintiffs, (b) different defendants, (c) different causes of action and (d) different reliefs sought:30Foot Note 30×Plaintiff’s Supplementary Written Submissions dated 14 December 2016 at para 57. Singapore(S 412/2016)Isle of ManNorwayPlaintiffThe PlaintiffLime PLC (derivative action brought by the Plaintiff)The PlaintiffDefendantThe DefendantsCertain directors of Lime PLCCertain directors and the general manager of Lime NorwayCause(s) of action(1) Conspiracy(2) Unjust enrichment(3) Wrongful interferenceBreach of trust and/or directors’ fiduciary duties owed to Lime PLCBreach of Norwegian statutory duties and general duties under Norwegian tort lawRelief(s) sought(1) Damages for the loss in the value of the Plaintiff’s shares in Lime PLC and/or MOL, or in the alternative a declaration that the Defendants hold these shares on trust for the Plaintiff, or in the further alternative, a transfer of these shares to the Plaintiff(2) Damages for the loss in the value of the Plaintiff’s shares in HOSLDamages for the losses suffered by Lime PLC as a result of the breaches of the fiduciary dutiesDamages for the loss in value of the Plaintiff’s indirect shareholding in Lime Norway 105 As for the e-mail sent by Dr Pereira, a closer analysis of the contents of the email fails to satisfy the requisite threshold to demonstrate an abuse of process. Dr Pereira’s reference to suing “at all levels” was not unqualified – he qualified this statement by referencing that legal suits will be brought against three specified entities,ie, Lime Norway, Lime PLC and the 1st Defendant. I see nothing wrong with a plaintiff bringing claims against multiple defendants in a situation where each of them had participated in the wrongdoing caused to the plaintiff. In any event, there was no reference made to suing the Defendants inmultiple jurisdictions. Seen in this context, I fail to see how the email sent by him demonstrates that the suit brought against the Defendants in S 412/2016 is an abuse of process (in light of the foreign proceedings). It bears emphasis that the requisite threshold for staying proceedings which are an abuse of process requires “very clear evidence of such abuse” (see the Court of Appeal’s decision inManagement Corporation Strata Title Plan No 2285and others v Sum Lye Heng (alias Lim Jessie)[2004] 2 SLR(R) 408 at [15]). This threshold is clearly not met here based on the evidence before me. 106 Accordingly, I agree with the AR’s conclusion that there is insufficient basis shown by the Defendants for anymala fideson the part of the Plaintiff in instituting S 412/2016 and there is thus no reason to stay S 412/2016 on the basis of abuse of process.",
        "Effect of SUM 5355/2016 and SUM 5691/2016": "107 In SUM 5691/2016, an application for further evidence was made by the Defendants to have an additional affidavit to be admitted. Despite making arguments against its admission in its written submissions,31Foot Note 31×Plaintiff’s Supplementary Written Submissions dated 14 December 2016 at paras 59–67.this application was not actively resisted by the Plaintiff during the oral hearings after I had indicated that I was inclined to so allow if the pleadings were allowed to be amended. Having so allowed the amendments, I then allowed the Defendants’ further evidence to come in. 108 In the end, given my decision to conditionally stay S 412/2016, my decision on the amendment of pleadings and further evidence will only be of relevanceifthe court proceedings against the Defendants are resumed in the future,ie, the stay is lifted due to the non-satisfaction of any of the conditions of the stay. 109 As explained above at [46]–[48], I would finally note that no criticism can be made of the conduct of the proceedings by the AR; the Plaintiff elected not to put forward an amendment before him. Given thatTomolugenwas specifically cited as an authority during the proceedings below, the Plaintiff should have been prepared to make any necessary amendments at the earlier stage. While the amendments were eventually allowed by me on appeal, the consequence of the fact that it was not put forward during the proceedings below should be addressed in the arguments on costs.",
        "Conclusion": "110 The Plaintiff’s appeal is thus dismissed. Directions will be given for the submissions on costs. Aedit AbdullahJudicial Commissioner Jason Chan and Daniel Seow (instructed) (Allen & Gledhill LLP) and  Cai Enhuai Amos (instructing) (Tito Isaac & Co LLP) for the plaintiff;Jaikanth Shankar and Bryan Leow (Drew & Napier LLC) for the defendants."
    }
}