{
    "case_title": "Sit Kwong Lam vManagement Corporation Strata Title Plan No 2645",
    "ncitation": "[2017] SGHC 57",
    "coram": "Kannan Ramesh JC",
    "sections": {
        "Introduction": "1 Originating Summons 246 of 2016 (“the Application”) was the appellant’s appeal against the decision of the Strata Titles Board (“the Board”) in STB No 40 of 2015 (“the STB Application”) on points of law, pursuant to section 98(1) of the Building Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (“the Act”). The Application raises several interesting questions, the principal of which is the correct interpretation of common property in s 2(1) of the Act. 2 The appellant is the subsidiary proprietor of unit #29-01, a penthouse unit occupying the 29th and 30th floors of Tower 15 of the condominium at 13 Ardmore Park (“the Unit”). The respondent is the management corporation of the development. 3 The STB Application concerned the appellant’s installation of three works in different areas of the development. The respondent, upon discovering these works, demanded that the appellant remove the works and/or obtain the requisite approval. It took the position that the works had been installed on common property in breach of various by-laws. Substantial correspondence passed between the parties culminating in the appellant commencing the STB Application to obtain,inter alia, a declaration that he had not breached the by-laws by installing the works and in the alternative, an order that the respondent consent to the works. The Board dismissed the STB Application. 4 I dismissed the Application and gave detailed oral grounds. The appellant has appealed my decision, and I set out the full grounds of my decision.",
        "Background to the dispute": "5 Sometime around November 2011, the appellant submitted an application through his appointed representative, Glory Sky Technology Ltd (“Glory”), for the following works to be carried out at the Unit: 1. Demolition of non structural walls. 2. Removal of unwanted existing trunking, cable trays, wires, AC ductings. 3. Laying of new electrical, data, water, ACMV, telephony services. 4. Erection of new walls & partitions. 5. Replacement of doors & window panels. 6. Laying of new wall & floor finishes. 7. Install new ceiling, painting works & install new cabinetry. 6 The appellant had also indicated “Yes” in response to a question on the application form asking whether there would be any “Additions/alterations to electrical system including air-conditioning system”, but did not elaborate. 7 It wasnotstated in the application that the works were to be carried out in areasnotwithin the Unit. The works were to commence on 14 November 2011 and be completed by 13 March 2012. The application was approved but the works were not completed by the completion date and the appellant made numerous applications for extensions of time. 8 In August 2013, in the course of inspections, the respondent discovered that the fixed glass panels bordering two areas of the Unit had been replaced with sliding panels, and the appellant had installed timber decking on two wide ledges beyond those panels outside the Unit on the 29th floor (“Work 1”). Figures 1 and 2 depict Work 1:  Figure 1  Figure 2  9 The two wide ledges each ran along a segment of the Unit’s external façade and were enclosed by a low parapet merely 0.75m in height which it would appear had been constructed by the developer. Though the ledges resembled balconies, it was common ground that they were not. The parapet did not meet the required safety standards for balconies, not being of sufficient height. Fixed glass panels originally separated the wide ledges from the Unit such that they could not be physically accessed by the occupants of the Unit. It is clear that the wide ledges were not meant to be accessed by them. It was also common ground that the ledges were demarcated in the strata title plan as common property, as shown in Figure 3 (the respondent’s annotations in red):  Figure 3 10 The respondent sent an e-mail to Glory on 26 August 2013, stating that Work 1 was unauthorised and requesting that the appellant restore the fixed glass panels. The parties corresponded and on 28 August 2013, the respondent advised the appellant to submit a formal application to install timber decking on the ledges. The appellant submitted an application to the respondent by way of a letter dated 3 September 2013 from Glory to the respondent. However, the management council took the view that Work 1 was tantamount to exclusive use of common property, which it had no jurisdiction to authorise. The appellant was thus advised to sponsor a 90% resolution at the upcoming Annual General Meeting (“AGM”) in April 2014 to acquire exclusive use of the ledges pursuant to s 33(1)(c) of the Act. He did not do so. 11 Shortly after the AGM, around 5 May 2014, the respondent discovered that the appellant had installed timber decking on the flat roof on the 30th floor outside the Unit (“Work 2”), as seen in Figures 4 and 5 (respondent’s annotations in red):  Figure 4  Figure 5 12 The timber decking covered the flat roof entirely,including the floor trap and drainage system, thus making it difficult for the respondent to properly upkeep the area. The flat roof was accessible to the appellant via the back door of the kitchen of the Unit, and also accessible to all subsidiary proprietors in the condominium via a common staircase. It was common ground that the flat roof was in an area demarcated as common property in the strata title plan, as shown in Figure 7. 13 Around 12 May 2014, the respondent discovered that the appellant had installed an air-conditioning ventilation unit on the outside wall of Tower 15, the external wall enclosing the Unit, in the same vicinity as Work 2 (“Work 3”). Work 3 is shown in the following photograph:  Figure 6 14 Work 3 would have required the appellant to hack through the common property wall to connect the air-conditioning unit vent to the interior of the Unit. It was common ground that the flat roof was in an area demarcated as common property in the strata title plan, as shown below (the respondent’s annotations in red):  Figure 7 15 A closer view of the location of the air-conditioning ventilation unit can be seen in Figure 8 (the respondent’s annotations in red):  Figure 8 16 On 12 May 2014, the respondent wrote to Glory requesting the immediate removal of Works 1, 2 and 3 (collectively “the Works”). No reply was received. On 28 May 2014, the respondent again wrote to Glory, giving 14 days’ notice to remove the Works failing which the respondent would remove or demolish “all unauthorised works”. Glory replied on 30 May 2014, communicating the appellant’s intention to “table the appropriate proposal under Section 34 of [the Act] for the conversion of the common area to private usage”. The respondent advised the appellant to obtain the approval of the general body at a general meeting but he did not do so. 17 On 29 August 2014, the appellant was again given 14 days’ notice to remove the Works. More correspondence passed between the parties (and, subsequently, their appointed solicitors) but the Works remained unremoved. The appellant was again advised to table any necessary resolution at the AGM in April 2015. 18 At the AGM on 25 April 2015, the appellant tabled three motions seeking exclusive use and enjoyment and/or special privileges in respect of the common property where the Works had been carried out: (a) for more than three years (to be passed by a 90% resolution); (b) for three years (to be passed by a special resolution,ie, 75% vote); or (c) for one year (to be passed by an ordinary resolution,ie, a bare majority). He was unable to succeed on any of his three motions, with the vote count as set out below: NoResolutionVote count1Seeking exclusive use and enjoyment and/or special privileges of the relevant areas for more than three years26% for; 74% against2Seeking exclusive use and enjoyment and/or special privileges of the relevant areas for three years26% for; 74% against3Seeking exclusive use and enjoyment and/or special privileges of the relevant areas for one year30% for; 70% against 19 On 30 June 2015, the appellant commenced the STB Application seeking the following orders: (a) a declaration that he had not breached any by-laws by virtue of the Works; in the alternative, (b) a declaration that the Works did not amount to exclusive use and enjoyment of or the conferment of special privileges in respect of common property within the meaning of s 33 of the Act; (c) an order pursuant to s 111(a) of the Act that the respondent consent to the Works; (d) a declaration pursuant to s 101(1)(c) read with s 101(4) of the Act that the respondent failed to exercise its powers under s 37(4) of the Act; and (e) an order pursuant to s 111(b) of the Act that the respondent authorise the Works under s 37(4) of the Act, on such terms as the appellant or the Board proposed. 20 On 11 February 2016, the Board dismissed the STB Application with costs to the respondent. The Board expressed doubts regarding its competence to make declarations as sought by the appellant, but this did not arise for decision as the Board dismissed the application on its merits. The appellant filed the Application on 10 March 2016.",
        "The Board’s decision": "",
        "The Works were situated on common property": "21 The first issue the Board had to determine was whether the Works were situated on common property. This assumed greatest significance in relation to Work 1 as it was not a matter of serious disagreement that Works 2 and 3 were indeed situated on common property. 22 The Board construed the definition of “common property” in s 2(1) of the Act to mean any area which wasboth(i) not comprised in any lot or proposed lot in a strata title planand(ii) used or capable of being used or enjoyed by the occupiers of two or more lots. In other words, the Board read the twin limbs of s 2(1) as conjunctive requirements. As it was not disputed that none of the areas housing the Works was comprised in any lot in the strata title plan, the Board’s analysis necessarily focused and ultimately turned on the construction of limb (ii). Accordingly, the Board had to form a view as to what was meant by the area in question being used or capable of being used by the occupiers of two or more lots. 23 The Board acknowledged that the use or purpose of the wide ledges on which Work 1 was installed was “subject to speculation”. Nevertheless, the Board took the view that the ledges were “part and parcel of the fabric of the building” and “contribute[d] to the character and appearance” of the building, and that all subsidiary proprietors were entitled to “quiet enjoyment” of it. Moreover, the Board noted that the ledges served “as a shelter or sunshade to the unit/units below” and were demarcated as common property in the strata title plan. The Board was therefore of the view that the ledges were used or capable of being used by the occupiers of two or more lots in the development. 24 Works 2 and 3 were installed at the flat roof outside the appellant’s lot. This area was bordered by the outside wall of Tower 15 and was accessible to all subsidiary proprietors of the estate via a common staircase. The Board found that it was common property on that basis.",
        "Breaches under the by-laws": "25 The Board further found that by carrying out the Works, the appellant had breached by-laws 8.1.1 and 8.2.5 of the by-laws made by the respondent under s 32(3) of the Act (“Additional By-Laws”). He had also breached by-law 5 of the by-laws prescribed in the Second Schedule to the Building Maintenance (Strata Management) Regulations 2005 (GN No S 192/2005) (“Prescribed By-Laws”) as he had not applied for the requisite approval before commencing Works 2 and 3. The Board held (at [38]) that Works 2 and 3 did not fall within the works exempted from the requirement for approval in by-law 5(3) of the Prescribed By-Laws because they were not “locking or safety devices for the protection of the [a]ppellant’s lot against intruders”, “devices that could improve safety within the [a]ppellant’s lot” or “safety devices installed toprevent harmto the children” (emphasis in original). 26 The Board found that by installing Work 3, the appellant had arrogated to himself exclusive use and enjoyment of that section of the wall which the ventilation unit occupied, and which was common property, within the meaning of s 33(1) of the Act. This required authorisation by special resolution or 90% resolution as Work 3 was intended to last for more than a year. The respondent had therefore reasonably taken the view that it lacked jurisdiction to authorise the Works in the absence of such a resolution, as the Works were “restricted matter[s]” pursuant to s 58(1) read with s 58(4) of the Act. Moreover, s 111(a) of the Act contemplated the prospective grant of consent in respect of works that had been proposed but not yet carried out, whereas the Works had already been installed. Given these considerations, the Board declined to order the respondent to authorise the Works under s 111(a) of the Act. 27 Nor could the respondent authorise the Works under s 37(4) of the Act as these were not improvements “in or upon [the appellant’s] lot”, such works needing to beinthe lot as opposed toin respect ofa lot. As the Works were all on common property, they did not, in the Board’s view, satisfy the section. The Board therefore could not order the respondent to consent to the Works under s 111(b) or s 101(1)(c) read with s 101(4) of the Act.",
        "The parties’ cases": "",
        "The appellant’s case": "28 First, the appellant took the position that the Works had not been installed on common property, because the areas where they were carried out were “not visible or accessible to anyone”. Particularly, the wide ledges on which Work 1 had been installed could not be physically accessed or enjoyed by any subsidiary proprietor. The appellant thus submitted that they did not satisfy limb (ii) of the definition of “common property” in s 2(1) of the Act(ie,used or capable of being used or enjoyed by the occupiers of two or more lots). As regards Works 2 and 3, the appellant asserted that the respondent had been unable to furnish evidence as to the common purpose or common usage of the areas in question. Since central or common usage was an essential ingredient in common property, the areas where Works 2 and 3 were installed did not constitute common property. 29 Second, the appellant asserted that the Board was wrong to find him in breach of the Additional By-Laws. He claimed that he had complied with by-laws 8.1.1 and 8.2.5 by obtaining the necessary approval for the Works. The appellant also asserted that the Additional By-Laws were inconsistent with the Act and hence inapplicable. 30 Third, the appellant submitted that the Board had erred by conflating by-laws 5(3)(a) and 5(3)(c) of the Prescribed By-Laws. He asserted that Works 2 and 3 had been installed for his children’s welfare, health and/or safety and therefore did not require the respondent’s approval under by-law 5. 31 Fourth, the appellant submitted that the Board had erred in finding that Work 3 amounted to exclusive use and enjoyment of common property within the meaning of s 33 of the Act. Even if correct, this did not preclude the respondent from authorising Work 3 for a period not exceeding one year as it was not a “restricted matter” under s 58(4) of the Act. The Board had therefore erred in finding it reasonable for the respondent to withhold its consent to Work 3. The appellant also submitted that, in any event, the Board ought to have made a “declaration” that Works 1 and 2 did not amount to exclusive use within the meaning of s 33 of the Act, given its finding that this was so. 32 Fifth, the appellant argued that s 111(a) of the Act allowed the Board to order the respondent to retrospectively consent to works that had already been carried out without consent. The Board had erred by supposing that the fact the works had already been installed precluded reliance on s 111(a). 33 Sixth, the appellant submitted that the Board had erred in its interpretation of “improvement in or upon the lot” in s 37 of the Act. The appellant submitted that s 37 included improvements which, although not technically within a lot, were nevertheless “in respect of” the lot. The Works were therefore not excluded from s 37 purely by virtue of the fact that they were not installed within the Unit.",
        "The respondent’s case": "34 The respondent emphasised that s 98 of the Act did not permit the appellant to raise issues of fact. He had to show rather that there was an error of lawex facieor that the Board had made a determination that “no person acting judicially and properly instructed as to the relevant law could have come to” (Liu Chee Ming and others v Loo-Lim Shirley[2008] 2 SLR(R) 764 at [16],Dynamic Investments Pte Ltd v Lee Chee Kian Silas and others[2008] 1 SLR(R) 719 at [15]). In this regard, the Board’s findings that the relevant areas constituted common property; that the Works breached by-laws 8.1.1 and 8.2.5 of the Additional By-Laws; and that the Works were not devices to “prevent harm” to the appellant’s children within the meaning of by-law 5(3)(c) of the Prescribed By-Laws were all findings of fact not open to challenge. Moreover, these findings were substantiated by the evidence. 35 First, the strata title plan demarcated the relevant areas as common property. In respect of Work 2, the respondent added that “roofs” had been defined as common property under the Land Titles (Strata) Act (“LTSA”) (Cap 158, 1999 Rev Ed) before the Act came into force, and that this should still be the case as Parliament had not intended the Act to change the definition of common property (seeManagement Corporation Strata Title Plan No 367 v Lee Siew Yuen and another[2014] 4 SLR 445 (“Lee Siew Yuen”) at [22]–[23]). 36 Second, the Board was correct to find that the appellant had not submitted any application for the installation of the Works prior to commencing them. The respondent also maintained that the Additional By-Laws were not inconsistent with the Act but fell within the scope of s 32. In this regard, it highlighted Parliament’s intention for the Act to provide flexibility and promote self-regulation amongst management corporations. 37 Third, the appellant’s contention that Works 2 and 3 had been installed for his children’s health and safety (thus falling within by-law 5(3)(c) of the Prescribed By-Laws) surfaced belatedly for the first time in the STB Application and was unsubstantiated by evidence. There was no reason for his children to frequent the flat roof at level 30 when it was not part of the appellant’s lot and was intended to be accessed for maintenance purposes only. 38 Fourth, the Board’s finding that Work 3 amounted to exclusive use or enjoyment of common property within the meaning of s 33 of the Act was supported by the authorities ofMark Wheeler v The Management Corporation Strata Title Plan No. 751 and another[2003] SGSTB 5 (“Mark Wheeler”),Anne Lee Heng T/ATian Hup Chan Warehousing v Management Corporation Strata Title Plan No 1360[2011] SGSTB 1 (“Anne Lee”) andYap Sing Lee vMCST Plan No 1267[2013] SGSTB 10 (“Yap Sing Lee”). Given that the appellant’s proposed resolutions to acquire exclusive use of the relevant areas had been roundly rejected at the 2015 AGM, it was “hardly appropriate” for him to attempt to undermine the decision of the other subsidiary proprietors by means of an appeal to the High Court. 39 Fifth, s 111(a) of the Act could have no retrospective effect. The wording of s 111(a) contemplated a subsidiary proprietor’s proposal “to effect” alterations or additions to common property, and hence could not apply where the alterations or additions had already been effected. 40 Sixth, the Board was right to find that the Works had not been erected “in or upon” the appellant’s lot, and hence could not have been authorised by the respondent under s 37(4) of the Act, which was limited to works installedwithinthe subsidiary proprietor’s lot. The respondent moreover contended that s 111(b) of the Act was, like s 111(a), prospective in effect, and thus did not permit the Board to order that the respondent consent to works already installed.",
        "The issues": "41 Various issues were framed by the Application and raised in argument. The key questions of law raised by the appellant can be summarised as follows: (a) what was the correct interpretation and application of “common property”; (b) whether the appellant had breached by-laws 8.1.1 and 8.2.5 of the Additional By-Laws; (c) whether the Works fell within by-law 5(3)(c) of the Prescribed By-Laws; (d) what was the correct interpretation and application of ss 33 and 58 of the Act; (e) whether s 111(a) of the Act could apply retrospectively; and (f) whether improvements outside a lot could constitute improvements “in or upon” a lot within the meaning of s 37 of the Act.",
        "Issue 1: the meaning of common property": "42 This issue, on which both parties spilt much ink and spent much energy, was of central importance in particular as to Work 1. The principal discord between the parties was whether the twin limbs in the definition of “common property” in s 2(1) of the Act ought to be read conjunctively, as use of the word “and” in the section naturally suggests, or disjunctively. The appellant argued the former and the respondent the latter. Section 2(1) of the Act defines “common property” as: (a) in relation to any land and building comprised or to be comprised in a strata title plan, such part of the land and building — (i)  not comprised in any lot or proposed lot in that strata title plan; and (ii) used or capable of being used or enjoyed by occupiers of 2 or more lots or proposed lots; or (b) in relation to any other land and building, such part of the land and building — (i) not comprised in any non-strata lot; and (ii) used or capable of being used or enjoyed by occupiers of 2 or more non-strata lots within that land or building; 43 For present purposes, only sub-sub-s (a) is relevant. An interesting question which arose in the course of the proceedings, particularly in relation to Work 1, was whether “common property” included areas evidently not intended for the enjoyment ofanyoccupier (as opposed to areas intended for the enjoyment of the occupiers of two or more lots). Such an area wouldprima facieby definition be incapable of “being used or enjoyed by occupiers of 2 or more lots”, thereby failing limb (ii) of the definition of “common property”. In the final analysis, this question proved to be the turning point as regards Work 1. 44 The wide ledges, while demarcated as common property in the strata title plan, were not accessible to any subsidiary proprietors, the appellant included. While adjoined to the Unit, they were clearly not intended for the appellant’s personal use as they were originally sealed off from the Unit by fixed glass panels. It was the appellant who had taken matters into his hands and replaced those panels with sliding panels as part of Work 1. It is perhaps unsurprising that access had been blocked, as the ledges do not appear to have been safe for use. As noted earlier, the ledges were not meant to serve as balconies for the Unit – the height of the parapet and the fact that they were not reflected as part of the Unit in the strata title plan were dead giveaways in this regard. Indeed, the appellant did not argue that the ledges were meant for use by the occupants of the Unit. The respondent stated that the ledges were intended to be accessed from the external façade of the building by the respondent’s staff for maintenance purposes. This was not challenged by the appellant. 45 As noted earlier, the appellant asserted that the wide ledges did not constitute common property because they failed the second limb of s 2(1), which he argued must be interpreted conjunctively. The respondent argued instead for a disjunctive interpretation, such that any area constituted common property so long as it fulfilled either of the two limbs in s 2(1) (ie,eitherwas not comprised in any lot in the strata title planorwas used or capable of being used by the occupiers of two or more lots). 46 Having carefully considered the arguments and the rich vein of authorities that the parties most helpfully placed before me, I agreed with the appellant that the two limbs should be read as conjunctive requirements. This approach is borne out by case law and literature: see,eg,Lee Siew Yuenat [27];Lee Lay TingJane v MCST Plan No 3414[2015] SGSTB 5 (“Lee Lay TingJane”) at [31]; Teo Keang Sood,Strata Title in Singapore and Malaysia(LexisNexis, 5th Ed, 2015) at para 6.04;Halsbury’sLaws of Singaporevol 14 (LexisNexis, 2014) para 170.0206 n 4. As will become apparent, I believe it is also supported by the lineage of the definition in s 2(1). 47 Both parties took the position that Parliament did not intend to substantively vary the pre-2004 meaning of “common property” in the Act. They were correct. However, they adopted diametrically opposing interpretations of the pre-2004 meaning of “common property”. The respondent argued that the pre-2004 meaning of “common property” was simply all property not comprised in any lot; the appellant argued that the property must additionallyexist for common use by two or more subsidiary proprietors in order to be considered common property. In order to determine this dispute it would be helpful to delve into the legislative history of the definition. This originally borrowed heavily from New South Wales (“NSW”) legislation, which I will first sketch briefly before moving to the definition of common property in Singapore.",
        "Legislative history of the definition of “common property”": "48 NSW’s Conveyancing (Strata Titles) Act 1961 was enacted to address deficiencies in the methods of subdividing property in NSW at the time, which could not provide the individual occupant of a unit with the security of separate title and ownership. This was especially pressing in the surge of demand for multi-storey residential buildings and residential flats following the end of the Second World War: Alex Ilkin,Strata Title Management and the Law(The Law Book Company Limited, 1989) at pp 4–5. The Conveyancing (Strata Titles) Act 1961 enabled property to be subdivided into common areas and lots, with separate title and ownership of the lots, and provided the following definition of “common property” at s 2: “Common property” means so much of the land for the time being comprised in a strata plan as is not comprised in any lot shown in such plan. 49 Since then, the meaning of “common property” in NSW has not changed substantively despite minor amendments to the definition:cfs 5(1) of the Strata Titles Act 1973 (subsequently renamed the Strata Schemes (Freehold Development) Act 1973), s 4(1) of the Strata Schemes (Leasehold Development) Act 1986 and Part 1 of the Dictionary to the Strata Schemes Management Act 1996. 50 Presently, s 4(1) of the NSW Strata Schemes Development Act 2015 states: common property, in relation to a strata scheme or a proposed strata scheme, means any part of a parcel that is not comprised in a lot (including any common infrastructure that is not part of a lot). 51 In turn, “common infrastructure” is defined in s 4(1) as: (a) the cubic space occupied by a vertical structural member of a building, other than a wall, or (b) the pipes, wires, cables or ducts that are not for the exclusive benefit of one lot and are: (i) in a building in relation to which a plan for registration as a strata plan was lodged with the Registrar-General before 1 March 1986, or (ii) otherwise—in a building or in a part of a parcel that is not a building, or (c) the cubic space enclosed by a structure enclosing pipes, wires, cables or ducts referred to in paragraph (b). 52 The definition of “common property” in NSW has thus always been, and remains, all the land within the strata scheme not comprised in any lot. This simplicity of approach has much to commend it. It provided the basis for the definition of “common property” that was introduced in Singapore. 53 In Singapore, prior to 2004, “common property” was defined in two statutes: the LTSA and the Buildings and Common Property (Maintenance and Management) Act (“BCPA”) (repealed). The first edition of the LTSA (“1967 LTSA”), which was the earlier statute, was modelled on NSW’s Conveyancing (Strata Titles) Act 1961 (Strata Title in Singapore and Malaysiaat para 1.01). The need for the LTSA arose from the lack of a designated authority responsible for the upkeep of common areas in flats, and was described by then Minister for Law and National Development Mr E W Barker in the following terms (Singapore Parliamentary Debates, Official Report(27 February 1967) vol 25 at cols 1113–1114): Under existing practice, what the purchaser of a flat usually obtains is a 999-year lease in a building. The freehold title in the land above which the flat is built is either retained by the vendor who imposes on each of his lessees a service charge for the maintenance of common parts and property or is conveyed in proportionate shares to the purchasers of all flats built on the land as tenants in common. Experience has shown that it is difficult for tenants to get together and problems arise when lifts break down or pipes burst. This rather unsatisfactory state of affairs has impeded the development and sale of flats in the Republic and the Bill now before the House, which is based on Australian legislation, takes account of the comments of the former Bar Committee and seeks to remove these difficulties. 54 To combat these difficulties, the 1967 LTSA adopted the Australian strata title system. To address the issue of responsibility for common areas, the 1967 LTSA created the “management corporation”, a body comprising all the flat owners which would be responsible for the maintenance of common property. When the LTSA was first enacted in 1967, s 3 contained the following definition: “common property” means, in relation to a subdivided building, so much of the land for the time being comprised in a strata title plan as is not comprised in any lot shown therein; 55 It would be apparent that this definition adopted the simplicity of approach taken in the NSW’s Conveyancing (Strata Titles) Act 1961. In essence, all areas of the strata development which were not comprised in any individual lot were by definition common property. This definition was reproduced without amendment in the 1970 Revised Edition of the LTSA and persisted until 1976. 56 Unfortunately, the objectives of the LTSA were met with limited success. Six years after the LTSA was enacted, the BCPA was introduced to address the persisting neglect of common property. Mr E W Barker introduced the Buildings and Common Property (Maintenance and Management) Bill with the following words (Singapore Parliamentary Debates, Official Report(20 March 1973) vol 32 at col 1095): Large numbers of high-rise flats and other buildings have been constructed in Singapore in recent years, and many of them are not properly managed and maintained. In many cases, the owners, management corporations or persons responsible for their maintenance and management have not been discharging their functions properly and have allowed the buildings to fall into disrepair. Steps have to be taken to ensure that this unsatisfactory position is rectified before it further deteriorates.With the encouragement of condominium development, the need to ensure that the buildings and the amenities and facilities shared in common are properly managed and maintained has now become even more urgent.It is therefore proposed to set up a public authority with appropriate powers to deal with this problem. It is to this end that this Bill is now before the House. [emphasis added] 57 The BCPA was a short Act initially numbering only 11 sections (although by the date of its repeal it had expanded to 23 sections), and appears to have been largely supplementary to the LTSA. It was described as an “Act to provide for the proper maintenance and management of buildings and common property in Singapore” and its chief purpose appears to have been to establish the office of Commissioner of Buildings, who was charged with the administration of the BCPA and Part IV of the LTSA. The Commissioner’s primary function under the BCPA was to require owners of buildings to carry out repairs and maintenance to the buildings and common property. Curiously, for reasons unexplained, instead of adopting the LTSA’s definition of “common property”, s 2 of the 1973 edition of the BCPA (“1973 BCPA”) offered its own definition as follows: “common property” includes fixture and fittings (including lifts), refuse chutes, refuse bin compounds, drains, sewers, pipes, wires, cables and ducts, the exterior ofall common partsof the building, playing fields, driveways, car parks, open spaces, landscaped areas, walls and fences and all other facilities and installationsused, or capable ofbeing used or enjoyed in common; [emphasis added] 58 The element of common usage was therefore woven into the definition for the first time. This was a theme that had resonated in the parliamentary speeches on the bill. 59 As the parliamentary debates and Select Committee Report did not discuss the definition of “common property”, why the LTSA definition was not adopted is a matter for speculation. Given the BCPA’sraison d'êtreof ensuring that statutory duties concerning the maintenance and repair of common property would be actively enforced, it might be supposed that draftsmen hoped a more concrete definition of “common property” would clarify the duties of the management corporation and aid the Commissioner in the discharge of his duties. 60 Three years after the enactment of the 1973 BCPA, the 1967 LTSA’s definition of “common property” was substantially amended by the Land Titles (Strata) (Amendment) Act 1976. The 1976 version of the LTSA (“1976 LTSA”) appears to have gone the way of the 1973 BCPA, substituting the previous clean-cut definition of “common property” with the following: “common property” – (a) in relation to subdivided buildings in an approved plan bearing the title of ‘condominium’ and issued by the relevant authority, means so much of the land for the time being not comprised in any lot shown in a strata title plan or in any parts of any building unit (partially erected or to be erected) intended to be included as lots in a strata title plan to be lodged with the Registrar after strata subdivision of the building unit has been approved by the relevant authority; (b) in relation to any subdivided building which is comprised in any plan approved by the relevant authority other than a plan bearing the title of ‘condominium’, means so much of the land for the time being not comprised in any lot shown in a strata title plan; and (c) unless otherwise described specifically as comprised in any lot in a strata title plan and shown as capable of being comprised in such lot, includes – (i) foundations, columns, gardens and external beams, supports, main walls, roofs, walls, lobbies, corridors, stairs, stairways, fire escapes, entrances, exits of the building or buildings; (ii) car parks, recreational or community facilities, gardens, parking areas, roofs, and storage spaces; (iii) central and appurtenant installations for services such as power, light, gas, hot and cold water, heating, refrigeration, and air-conditioning and incinerators; (iv) escalators, lifts, tanks, pumps, motors, fans, compressors, ducts, and in general all apparatus and installations existing for common use; (v) all facilities described as common property in any plan approved by the relevant authority for a condominium development and all facilities which may be shown in a legend of a strata title plan as common property; and (vi) all other parts of the land not comprised in any lot necessary or convenient to the existence and maintenance and for the reasonable common use and safety of the common property. 61 Sub-ss (a) and (b) essentially retained the principle that land not comprised in any lot was common property, the only variant being whether the building was classified as a condominium or otherwise. Sub-s (c) deemed certain specified features to be common property unless the feature was specifically described as comprised in a lot and capable of being so comprised. 62 Unfortunately and somewhat surprisingly, the parliamentary debates and Select Committee Report again shed no light on the rationale behind the reworking of the definition. I surmise that three objectives were at play. The first was to make clear that the overarching requirement was that the area in question was not described as comprised in any lot in the strata title plan. The second was to facilitate the management corporation’s discharge of its day-to-day duties by giving it assurance that the specified features in sub-ss (c)(i) to (v) were indeed within its purview. Such guidance would have been vital, given that the distinction between common property and private property undergirds the division of responsibility for maintenance and care of areas in the development – responsibility for common property falling on the management corporation and responsibility for individual lots on the relevant subsidiary proprietor. The advent of strata-titled condominium developments perhaps made the need for clarity and guidance in this regard more urgent. The third objective was to emphasise the element of common use. Under the reworded definition, the mere fact that the land or area in question was not part of any lot did not automatically mean that it was common property. The land or area must also be meant for common use as opposed to the sole use of a lot. This is evident from the nature of the areas and installations identified in sub-ss (c)(i) to (v) and most so in relation to sub-s (c)(vi), which had common use as its central theme. It is quite clear that sub-s (c)(vi) would have served no purpose if the sole criterion was whether the area was comprised within a lot. That was already stated clearly in sub-ss (a) and (b). It appears clear that sub-ss (c)(i) to (vi) were an expansion of the definition of “common property” in s 2 of the 1973 BCPA. 63 In 1982, the definition of “common property” in the 1973 BCPA was partly revised in line with that in the 1976 LTSA. It is not necessary to set out the amended definition for my present purposes. It suffices to say that the effect of the 1982 amendment was to adopt the 1976 LTSA definition of “common property” in relation tocompletedstrata developments while retaining the definition of “common property” in the 1973 BCPA with cosmetic amendments in respect of non-strata developments anduncompletedstrata developments. This bifurcation persisted (with minor amendments to both the LTSA and BCPA definitions) until 2004. 64 In 2003, the prevailing LTSA definition of “common property” was consequentially amended by the Planning (Amendment) Act 2003. The amendment abolished the distinction between subdivided buildings bearing the title of “condominium” and those that did not, substituting the old sub-ss (a) and (b) with a new merged sub-s (a). The definition of “common property” in the 2003 version of the LTSA (“2003 LTSA”) immediately prior to its revision in the Building Maintenance and Strata Management Act 2004 largely mirrored the definition in the 1976 LTSA and was as follows:  “common property” – (a) in relation to any subdivided building, means so much of the land for the time being not comprised in any lot shown in a strata title plan or in any parts of any building unit (partially erected or to be erected) intended to be included as lots in a strata title plan to be lodged with the Registrar; and (c) unless otherwise described specifically as comprised in any lot in a strata title plan and shown as capable of being comprised in such lot, includes – (i) foundations, columns, beams, supports, walls, roofs, lobbies, corridors, stairs, stairways, fire escapes, entrances and exits of the building and windows installed in the external walls of the building; (ii) car parks, recreational or community facilities, gardens, parking areas, roofs, storage spaces and rooms approved by the relevant authority for the use of a management corporation and its members; (iii) central and appurtenant installations for services such as power, light, gas, hot and cold water, heating, refrigeration, air-conditioning and incinerators; (iv) escalators, lifts, tanks, pumps, motors, fans, compressors, ducts, and in general all apparatus and installations existing for common use; (v) water pipes, drainage pipes, sewerage pipes, gas pipes and electrical cables which serve 2 or more lots; (vi) all facilities described as common property in any plan approved by the relevant authority for a condominium development and all facilities which may be shown in a legend of a strata title plan as common property; and (vii)  all other parts of the land not comprised in any lot necessary or convenient to the existence and maintenance and for the reasonable common use and safety of the common property;",
        "Revision in the Building Maintenance and Strata Management Act": "65 That Parliament had no intention of substantively changing the meaning of “common property” in the Act from its meaning pre-2004 is evident from the progress of the draft bill, originally introduced as the Building Maintenance and Management Bill (Bill No 6/2004) (“the Draft Bill”). At the time of its first reading in Parliament on 6 February 2004, the Draft Bill proposed the following definition of “common property”: “common property”, in relation to any land and building not comprised in a strata title plan, means – (a) the foundations, columns, beams, supports, roofs, external walls (including any window installed in any external wall of the building), lobbies, corridors, stairways, fire escapes, entrances and exits of any building comprised in the parcel; (b) the car parks, gardens, recreational or community facilities for the common use of occupiers of lots or proposed lots within any such building; (c) the escalators, lifts, tanks, pumps, motors, fans, compressors, ducts and in general all apparatus and installations existing for the common use of occupiers of all lots or proposed lots within any such building; (d) the pipes, wires, cables, chutes, ducts and other facilities for the passage or provision of water, sewage, drainage, gas, oil, electricity, telephone, radio, television, garbage, heating and cooling systems, or other similar services, if they are located – (i) within a floor, wall or ceiling that forms a boundary – (A) between a lot or proposed lot and another lot or proposed lot in any such building; (B) between a lot or proposed lot and the common property; or (C) between a lot or proposed lot or the common property and another parcel; or (ii) wholly or partially within a lot or proposed lot, if they are capable of being and intended to be used in connection with the enjoyment of the common property; and (e) all other parts of the parcel not comprised in any lot or proposed lot and necessary for the common use of occupiers of all lots or proposed lots in that parcel, and in the case of any land and building comprised in a strata title plan, “common property” has the same meaning as in the Land Titles (Strata) Act (Cap. 158). [emphasis added] 66 The Draft Bill thus originally maintained a distinction between strata and non-strata developments. Strata developments would continue to utilise the 2003 LTSA definition of common property. Non-strata developments, on the other hand, would adopt a definition of common property substantially based on the 2003 LTSA definition, but which interwove elements which were either new or borrowed from the BCPA definition as amended. 67 As a segue, the evolution of the definition of “common property” from the LTSA in 1967 to the Draft Bill in 2004 shows that the element of common usage acquired growing significance over time. The 1967 LTSA had adopted NSW’s broad definition, by which all property not comprised in any lot was by definition common property. The 1973 BCPA introduced a far more practical definition which enumerated concrete examples of common property, presumably to aid management corporations and proprietors in distinguishing common property from individual lots on a day-to-day basis. The 1973 BCPA definition included “all other facilities and installations used, or capable of being used or enjoyed in common”. The LTSA followed suit in 1976, supplying its own expanded list of features that were deemed to be common property unless otherwise described (see [60] above). Some of these features implicitly or explicitly incorporated a reference to common usage. Sub-s (c)(ii), for example, referred to “recreational or community facilities” and other areas which were approved “for the use of a management corporation and its members”. Sub-s (c)(iv) referred to “all apparatus and installations existing for common use”. Sub-s (c)(v) referred to pipes and cables which “serve two or more lots”. In addition to listing specific instances of common property, the 2003 LTSA definition also stated in sub-s (c)(vi) that “common property” would include “all other parts of the land not comprised in any lot necessary or convenient to the existence and maintenance and for the reasonable common use and safety of the common property”. 68 The definition proposed in the Draft Bill continued this trend by adopting the 2003 LTSA definition for strata developments. The draft definition of “common property” for non-strata developments also incorporated this principle, adopting references to recreational or community facilities “for the common use of occupiers of lots or proposed lots” (sub-sub-s (b)), “all apparatus and installations existing for the common use of occupiers of all lots or proposed lots” (sub-sub-s (c)) and “all other parts of the parcel not comprised in any lot or proposed lot and necessary for the common use of occupiers of all lots or proposed lots” (sub-sub-s (e)). Notably, the definition further stated that pipes, wires, cables, chutes, ducts and other facilities for the provision of electrical, water, gas and other such services would be considered common propertyeven ifthey were located within a lot, provided they were “capable of being and intended to be used in connection with the enjoyment of the common property” (sub-sub-s (d)(ii)). The requirement of common use was thus firmly entrenched in the definition of “common property” proposed in the Draft Bill. 69 However, the proposed definition was eventually substituted with the current and sleeker s 2(1) definition. The rationale for the substitution can be gleaned from the following remarks in theReport of the Select Committee on the Building Maintenance and Management Bill(Bill No 6/2004)(Parl 5 of 2004, 7 October 2004) (“the Select Committee Report”): 10 Some representors felt that the definition of common property for non-strata developments in this Bill should be similar to that for strata developments in the LTSA.The definition of common property in theLTSA was well-accepted by the industry and it would cause less confusion if there was a standard definition. 11 The Committee accepted this suggestion and recommended that the Bill be amended to incorporate a generic definition of common property to cover both strata and non-strata developments. [emphasis added] 70 This move appears to have been in response to two papers presented to the Select Committee. One paper, submitted by the Singapore Institute of Surveyors and Valuers (“SISV”), contained the following comments: 2.1 The definition of “Common Property” as provided in this Bill makes a distinction between land and buildings not comprised in a strata title plan and those comprised in a strata title plan. ... 2.2 Common Property is defined to great technical details [sic] in this Bill.We are of the opinion that this very detailed definition of “common property” cancreate confusion and give rise to ambiguity in interpretation.This is particularly in relation to the definition as provided in (d)(i)(A) to (C), (d)(ii) and (e) which attempts to enumerate all types of scenarios with regard to the location of pipes, wires etc between lots, buildings, common property, another land parcel etc.It is envisaged that with changing technology and architecture, it isnot possible to be exhaustivein providing for all types of scenarios regarding common property. 2.3 We propose thatto avoid confusion, the Bill should adopt thesame definition of common property as in theLTSA which is already known and accepted by people in the industry. [emphasis added in italics and bold italics] 71 These comments were echoed in the paper submitted by the Association of Property and Facility Managers (“APFM”): 6.2.1 A new definition of common property has been included in the legislation which makes a distinction between land and building not comprised in a strata title plan and those comprised in a strata title plan. The definition further provides that in the case of land and building comprised in a strata title plan “common property” has the same meaning as in the Land Titles (Strata) Act.The current definition of common property under theLTSA is generally known to people in the industry. We suggest that the definition of common propertyprovided in the LTSA be adopted in order to avoid confusion.To cater for land and buildings which are not under the strata title legislation, the present definition of common property spelt out in the Buildings and Common Property (Maintenance and Management Act) (Cap 30) may be incorporated. [emphasis added in italics and bold italics] 72 Both papers thus stressed that members of the industry were familiar with the 2003 LTSA definition of common property, and that introducing a new and separate definition of common property for non-strata developments would cause confusion. The SISV also noted the complexity of the proposed definition and cautioned against attempting to be exhaustive. It was on account of this feedback that Parliament “decided to simplify the definition of common property without having to list any structure that are generally considered as part of common property” (Lee Siew Yuenat [22]). It did this by removing the lengthy list of features previously contained in sub-s (c) of the LTSA 2003 definition and harmonising the definitions of common property in strata and non-strata developments. It also introduced limb (ii) of the definition of common property in s 2(1)(a) of the Act (see [42] above). Limb (ii) encapsulated the concept of common usage that had run through sub-ss (c)(i) to (vi) of the 2003 LTSA definition, while limb (i) preserved the overarching requirement that the area was not part of any lot. 73 Thus, based on the Select Committee’s deliberations, I agree with the parties that despite rewording the definition of common property in s 2(1) of the Act, Parliament intended to essentially preserve the 2003 LTSA definition of common property as this was accepted by the industry. It is accordingly important to ascertain the pre-2004 meaning of common property not only with reference to the (admittedly unwieldy) 2003 LTSA definition, but also to its practical application, which would have guided the common understanding of industry stakeholders. In this regard, I found that the element of common usage was equally prominent in the cases pre-2004. Two cases are instructive: (a) InRe Faber Garden (Strata Titles Plan No. 1047)[1993] SGSTB 1 (“Re Faber Garden”), it fell to be determined whether a solar hot water heater, electrically heated hot water storage tank and water tank were common property. The three structures were situated on the apartment roof, which was common property. The water heater and storage tank served to supply hot water to the applicant’s apartment exclusively, but the water tank served more than one lot. The Board observed that “the requirement of central or common usage is repeated in many provisions of the Act”, citing the list of features in sub-s (c) of the 1988 Revised Edition LTSA definition of common property. The Board hence “interpret[ed] section 3 of the Act to require the ingredient of common usage for common property”. Since the water heater and storage tank served the applicant exclusively, they were not common property. (b) InTsuiSai Cheong and another v MCST Plan No. 1186(Loyang Valley) and others[1995] 3 SLR(R) 713 (“TsuiSai Cheong”), it fell to be determined whether a water pipe which had corroded was common property. The water pipe exclusively served the subsidiary proprietors’ unit and was embedded in the concrete floor both inside and outside the unit. The section of the pipe which had corroded was embedded in the concrete floor outside the unit, which parties agreed was common property. The High Court Judge held that the fact that part of the pipe was embedded in a concrete slab which was common property did not automatically turn that part of the pipe into common property. Instead he found that the pipe was the property of the appellants. This was consistent with the principle inRe Faber Gardenthat installations situated outside a lot but which serve the exclusive use of the proprietors of that lot are the property of the proprietors. I therefore found that the meaning of “common property” prior to 2004, and which is unchanged by the Act, required the area to be for common use. 74 This analysis is admittedly not without difficulty. On its face, the LTSA definitions state no requirement of common usage. Sub-ss (a) and (b) of the 2003 LTSA definition (see [64] above) appear to straightforwardly define “common property” as all property not comprised in any lot in the strata title plan, while the long list of facilities in sub-ss (c) seems to merely classify specific facilities as common property for the avoidance of doubt. (This interpretation appears to have been adopted byMCSTPlan No 958 v Tay Soo Seng[1992] 3 SLR(R) 818 (“TaySoo Seng”)at [13].) 75 However, this ignores sub-s (c)(vii) of the 2003 LTSA definition (see [64] above), which stated that common property included “all other parts of the land not comprised in any lot necessary or convenient to the existence and maintenance and for the reasonable common use and safety of the common property”. If the operative definition of “common property” stopped short at all land not comprised in any lot in the strata title as stated in sub-s (a), sub-s (c)(vii) would have been totally redundant. Sub-s (c)(vii) can only be read coherently if understood to incorporate an additional element of common use in the characterisation of common property, a theme which runs through sub-ss (c)(i) to (vi). I also do not considerTaySoo Sengto be authoritative on this point: since the court had found that the installation in question—a glass panel in that case—wascomprised in the subsidiary proprietor’s lot, the argument that it was common property fell at the first hurdle. The question whether propertynotcomprised in any unit, but nevertheless not intended not for common use, would still constitute common property did not arise on the facts. 76 I was further fortified in my analysis by the newly proposed amendments to the Act, which were available on the Building and Construction Authority’s website for the purpose of public consultation in February 2017 (the text of the amendment is reproduced at paragraph [87] below). The current meaning of “common property” under s 2(1) of the Act was described as follows: \"Common property\" in a strata development refers to an element in relation to any land and building shown in the strata title plan which is not comprised in any unitandis alsoused or capable of being used or enjoyed by occupiers of 2 or more units. [emphasis added] 77 In the final analysis, I agreed with the appellant that the two limbs in the definition of common property in s 2(1) of the Act are to be read conjunctively. Common property refers to that part of the land which isboth“not comprised in any lot or proposed lot in that strata title plan”,and“used or capable of being used or enjoyed by occupiers of 2 or more lots or proposed lots”.",
        "The proper application of s 2(1)": "78 Having established that the two limbs were to be read conjunctively, I was of the view that the correct way to apply the second limb of the definition was to ask whether the area/installation in question was for the exclusive use of the occupier of the unit in question (rather than whether it was for the use of the occupiers of two or more lots). If so, it followed as a matter of logic that it could not concurrently be used or capable of being used by two or more occupiers. There is a subtle but significant purpose to reading the second limb in this manner, which is believe is more consonant with the purpose of the definition. I will come to this shortly. 79 The principle underlying the definition of “common property” in s 2(1) of the Act was described in the following terms inLee Siew Yuenat [33]: The purpose behind the definition of common property under s 2(1) of the BMSMA is toexclude from common property those objects that are solely constructed within the subsidiary proprietor’s unit for the enjoyment of the subsidiary proprietor only. This is consistent with the term “common”, which indicates that the particular property must serve a common purpose. [emphasis added] 80 This same principle was echoed inStrata Title in Singapore and Malaysiaat para 6.22: Where the items in question are not described as comprised in any lot in a strata title plan,they would not be regarded as common property if they are not for common usage but are for the exclusive use of a lot, with the consequence that they are the responsibility of the subsidiary proprietor of the lot concerned. [emphasis added] 81 A long line of decisions by the Board also enshrines this principle (see [83] below). 82 While “exclusive use” and “common usage” are for the most part two sides of the same coin, one being the converse of the other, there is a subtle but significant difference in the application of the two tests. If the area or installation is intended for use by the occupiers of two or more lots, it follows that it could not have been meant for theexclusiveuse of any one lot. However, the fact that the area or installation cannot be used by the occupiers of two or more lots does nota fortiorimean that it is intended for the exclusive use of a single lot.It may not in fact be intended for the direct use of any occupier at all.The wide ledges on which Work 1 was located were a clear illustration of this – they were neither meant to be used nor capable of being used by the occupants of the Unit. 83 On the appellant’s approach, so long as the area or installation was incapable of being used by the occupiers of two or more lots, it would not be common property (even if the first limb in s 2(1) of the Act is satisfied). It would not be necessary to examine whether the area or installation is for the exclusive use of the occupants of a lot. I did not believe that was the correct way to read the second limb of the definition of common property in s 2(1). The primary question, as the authorities and lineage of the definition suggest, must be whether the area or installation is used or only capable of being used exclusively by the occupier of a lot, thereby negating common use. This requirement of exclusive use is inherent in limb (ii) of the definition of “common property” and represents the true legislative intention. Accordingly, the correct inquiry is whether the area or installation is for the exclusive use of the lot in question or not. This is borne out by the cases cited by the parties: (a) InTsuiSai Cheong(discussed at [73(b)] above), the water pipe was found notto be common property because it delivered water to one apartment exclusively. (b) Similarly, inReFaber Garden(discussed at [73(a)] above), the fact that the solar hot water heater and electrically heated hot water storage tank existed for the applicant’s exclusive use was critical to the Board’s finding that they were not common property. (c) InLee Siew Yuen, the question was whether beams that were located in between the respondent’s unit and the unit above, but which served the purpose of supporting the building blocks of the development, were common property. The High Court found that they were. The beams served no useful purpose to the respondent. While they could not be physically accessed by any of the other occupants of the development, the beams existed for their collective benefit. The beams were evidently not for the exclusive use of the respondent. (d) InSujitSingh Gill v MCST Plan No. 3466[2015] SGSTB 2, the Board held that a planter box on the balcony of the applicant’s unit was not common property. Unlike the present case, the balcony was openly accessible by the occupiers of that unit and intended for their private use. It was also demarcated as part of the applicant’s strata lot in the strata title plan. As such, the planter box was clearly for their exclusive use. The Board thus held that it was not capable of being used and enjoyed by other occupiers and was not common property. 84 I should add thatMCSTPlan No 3727 v Ho Kok Wei/Ng Xiang Rui[2015] SGSTB 7, on which the appellant relied heavily, was of no relevance here. In that case, the management corporation sought a mandatory injunction requiring the subsidiary proprietors to remove unauthorised installations on a flat roof which was adjacent to the roof terrace of the subsidiary proprietors’ lot. The Board’s refusal to grant the injunction wasnotpredicated on a finding that the flat roof was not common property. In fact, parties agreed that the flat roof was common property and it was referred to as “common property” throughout the Board’s grounds of decision. The Board’s remark at [26] that “it is clear that this area of the common property was not common property that was to be accessed and enjoyed by all the subsidiary proprietors in the estate” went rather to its assessment of whether it would be “just and fair” to grant the injunction. Given that the installations did not affect the access and enjoyment of the other subsidiary proprietors, were not visible to anyone else and had improved rather than damaged the property, the Board saw no point in granting the injunction. As the Board accepted that the installations had been done on common property, I did not see how this case could assist the appellant. 85 Moreover, the appellant’s approach would create an absurdity regarding the issue of ownership and responsibility for maintenance. For strata developments, only two forms of ownership are statutorily recognised: common ownership over common property and individual ownership in relation to the lot. This is not a distinction without difference but one of seminal importance. Responsibility for the former falls on the management corporation and the latter on the owner of the lot. The appellant’s approach would leave areas or installations which cannot be used by the occupiers of two or more lots, but which are not meant for the exclusive use of a lot, in a state of uncertainty. They would not be common property. At the same time, they could not be said to form part of a lot. In such a situation, in whom would ownership reside and on whom would responsibility for maintenance fall? By contrast, adopting the exclusive use approach that I have suggested removes any uncertainty as to the ownership and responsibility for maintenance. 86 I had posed this conundrum to counsel for the appellant. However, he was unable to satisfactorily resolve it. He suggested that there could be a third category of property (in addition to common property and individual lots) as regards which the legal title and responsibility for maintenance would be uncertain. Such speculation is not logical. The creation of such uncertainty would burden management corporations and subsidiary proprietors, and counteract the pursuit of clarity and certainty which motivated the definitional amendments from 1967 to 2004. Moreover, Parliament could not have intended to subvert, through a mere definitional amendment, the well-established scheme of dual property rights as regards common property and individual lots. No such third category of ownership existed under the LTSA prior to 2004. Had Parliament intended to enact any changes to the nature of ownership of strata-titled property, it would doubtless have done so expressly (as it in fact did in relation to the introduction of “limited common property” – see Division 7 of Part V of the Act). Parliament would undoubtedly not have intended to create an anomalous uncertain category for no good reason. A review of Hansard did not suggest that such a conclusion was warranted. 87 The proposed key amendments to the Act which underwent public consultation also supported my approach. The proposed amendment to the definition of “common property” is as follows: Existing provisionContent of amendmentRationale\"Common property\" in a strata development refers to an element in relation to any land and building shown in the strata title plan which is not comprised in any unit and is also used or capable of being used or enjoyed by occupiers of 2 or more units.(a) To make clearer the definition of “common property” to include key structural elements (foundations, beams, columns) of the building.(b) To make clear that fire sprinkler and central airconditioning systems are also part of common property to be maintained by the MCST.(c) To make clear that any conduit, pipe, cable, ducts that services two or more lots but may be embedded within one strata lot is to be considered common property.…Recognise that critical components such as structural elements and systems spanning across strata lots are better maintained by the MCST because MCSTs have a collective interest in maintaining these structures and systems. Also facilitate emergency repairs and minimise disputes between MCST and individual lot owner on which party is to maintain such common property rightfully. 88 The proposed amendment, particularly limb (c), reinforced the point that elements of the building which serve a common purpose and are not for the exclusive use of any particular subsidiary proprietor are common property.",
        "The Works were installed on common property": "89 Applying this approach, it became evident that the Works were situated on areas that satisfied the second limb of the definition and were hence common property. The wide ledges on which Work 1 was installed were clearly neither intended to be used nor capable of being used by the occupiers of the Unit. The position was even clearer as regards the openly accessible flat roof where Works 2 and 3 were installed. These areas were not for the exclusive use of the occupiers of the Unit. 90 Moreover, these areas were demarcated as common property in the strata title plan. Under sub-s (c)(vi) of the 2003 LTSA definition, “common property” included facilities which were demarcated or described as common property in the strata title plan. The development existed prior to 2004, at which time the 2003 LTSA definition of “common property” would have applied. The relevant areas would therefore have been the responsibility of the respondent. It was inconceivable that those areas were no longer the respondent’s responsibility as a result of the rewording of the definition of “common property” in the Act. It is clear from the foregoing discussion of “common property” that no such change was intended and I agree the Act “was not meant to exclude from the definition of common property the specific structures listed in the previous edition of the LTSA” (Lee Siew Yuenat [22]). Since the areas in question would have been common property under the 2003 LTSA definition due to their demarcation as such in the strata title plan, they should continue to be regarded as such under the reworded definition in the Act.",
        "Issue 2: whether the Additional By-Laws were breached": "91 The Board had found the appellant in breach of by-laws 8.1.1 and 8.2.5 of the Additional By-Laws and by-law 5 of the Prescribed By-Laws, which state: [Additional By-Laws] 8.0 RENOVATION 8.1Submission & Approval 8.1.1 The Subsidiary Proprietor shall submit to the Management the prescribed application form for renovation works together with a detailed work schedule at least 10 working days prior to commencement of any renovation works. … 8.2Type of Work … 8.2.5 The Subsidiary Proprietor and his contractor can only carry out the type of work specified in the approval letter given by the Management.  [Prescribed By-Laws] Alteration or damage to common property 5.—(1)  A subsidiary proprietor or an occupier of a lot shall not mark, paint, drive nails or screws or the like into, or otherwise damage or deface, any structure that forms part of the common property except with the prior written approval of the management corporation. … (3)  This by-law shall not prevent a subsidiary proprietor or an occupier of a lot, or a person authorised by such subsidiary proprietor or occupier from installing — (a) any locking or other safety device for protection of the subsidiary proprietor’s or occupier’s lot against intruders or to improve safety within that lot; (b) any screen or other device to prevent entry of animals or insects on the lot; (c) any structure or device to prevent harm to children; or (d) any device used to affix decorative items to the internal surfaces of walls in the subsidiary proprietor’s or occupier’s lot. … 92 The appellant argued that he had not breached these by-laws because he had obtained the necessary approval for the Works by his written application in November 2011 and his letter to the respondent on 3 September 2013. He also asserted that the Additional By-Laws were inapplicable in any event as they were inconsistent with the Act. This was because by-law 4 of the Additional By-Laws purported to govern “common areas”, which was defined as “all the area in the condominium with the exception of the strata lots”. This was, it was argued, wider than the definition of “common property” in the Act. According to the appellant, the two co-existing definitions gave rise to a situation where even if the Works were not installed on areas defined as “common property” under the Act, the appellant would still be in breach of the Additional By-Laws as the relevant areas would fall within the definition of “common areas”. 93 The respondent rightly submitted that the Board’s finding that the appellant had not obtained the necessary approval for the Works was a finding of fact not open to challenge under s 98 of the Act, which is limited to points of law. In any event, I found that the evidence did not support the appellant’s contention. By-law 5 of the Prescribed By-Laws made it amply clear that works installed on common property were prohibited. By-law 8.1.8.9 of the Additional By-Laws likewise stated: 8.1.8  The following alteration and relocation works are strictly prohibited: … 8.1.8.9   Any works that affect the structural integrity, and / or appearance of the façade and common property of the building. 94 The fact that the Works were carried out on common property ought therefore to have been specifically highlighted in any application under by-law 8.1.1 of the Additional By-Laws. The appellant’s reliance on the renovation application that he submitted in November 2011 was thus misconceived as the application omitted to mention that the Works were to be carried out on areas described as common property. On the contrary, a letter appended to the application form authorised Decolines Construction Pte Ltd to “carry out the renovation workin this flat” (emphasis added). Anyone reading the November 2011 application would reasonably have understood it as an application to renovate the Unit, and it was on that basis that the respondent approved it. The respondent could not be taken to have approved alterations to common property as that was not stated in the application. The 3 September 2013 letter was even less persuasive in this regard, as it only pertained to Work 1 and was never approved. The fact remained that the appellant installed the Works without having obtained the respondent’s approval to install them on common property. I therefore agreed with the Board that the appellant did not comply with by-laws 8.1.1 and 8.2.5 of the Additional By-Laws. 95 I did not accept the appellant’s argument that the Additional By-Laws were inconsistent with the Act because they purport to regulate “common areas” as opposed to merely “common property”. The Additional By-Laws define “common areas” as “all the area in the condominium with the exception of the strata lots”. This falls well within the management corporation’s authority to make by-laws “for the purpose of controlling and managing the use or enjoyment of the parcel comprised in the strata title plan” under s 32(3) of the Act. Given the sundry matters that may be regulated by by-laws under s 32, such as “safety and security measures”, “details of any common property of which the use is restricted”, “the keeping of pets”, “behaviour” and “such other matters as are appropriate to the type of strata scheme concerned”, it is evident that the management corporation’s power to make by-laws is a wide one. This power is “clearly intended for the purpose of controlling and managing the use or enjoyment of the strata scheme,includingthe common property” but not limited to it (Strata Title in Singapore and Malaysiaat para 15.25) (emphasis added). In any event, the Board did not find the appellant in breach of by-law 4 (which relates to “Common Areas”) but only of by-laws 8.1.1 and 8.2.5, which make no reference to “common areas”. Hence, it was difficult to see how the appellant’s argument that by-law 4 was beyond the scope of the respondent’s purview could assist it in the Application.",
        "Issue 3: whether Works 2 and 3 fell within by-law 5(3)(c) of thePrescribed By-Laws": "96 According to the appellant, the Board erroneously conflated the wording of by-law 5(3)(a) with 5(3)(c) of the Prescribed By-Laws, and thus wrongly stated by-law 5(3)(c) to be confined to “safety” devices or structures (as opposed to devices or structuressimpliciter) to prevent harm to children. The appellant submitted that this was not merely a semantic or technical error but one which directly led to the Board’s determination that the Works were not permitted under by-law 5(3)(c). Work 2 had been installed allegedly because the original cement screed flooring of the flat roof was prone to become slippery when wet, and the appellant’s children might slip and fall on it as a result. The appellant further asserted that Work 3 had been installed because the lack of proper ventilation in the Unit was harmful to his three children (aged five, three and one) who had sensitive throats and respiratory tract allergies. 97 By-law 5(3)(c) entitles a subsidiary proprietor to install “any structure or device to prevent harm to children” without the prior written approval of the management corporation. This is an exception to the general requirement that the management corporation must approve any alterations to common property and should therefore not be over-liberally construed. I did not think that by-law 5(3)(c) of the Prescribed By-Laws assisted the appellant here. 98 The Board’s adoption of the phrase “safety device” in [37]–[38] of its decision was not significant. The appellant did not explain what difference was alleged to exist between a “safetydevice to prevent harm to children” and a “device to prevent harm to children”simpliciter, or how that difference would have been material to the Board’s finding. At [34] of its decision, the Board accurately stated that “the subsidiary proprietor is also allowed to install any structure or device to preventharm to children” (emphasis in original), with no mention of such structure or device needing to be a “safety” device. At [35], the Board stated that a “safety device” would include “an object or piece of equipment that has been designed for or can be used […] to prevent harm to children”, essentially repeating by-law 5(3)(c) without superimposing any additional requirement. The relevant paragraph showed that the Board’s analysis focused primarily on whether Works 2 and 3 could be said toprevent harmto the appellant’s children, rather than on whether they were “safety” devices: 38.  The by-law allows a subsidiary proprietor to install a safety device toprevent harmto his children. Whilst an air-con and ventilation system can improve air quality, the Board cannot find that the air-con ventilation unit and timber flooring on the flat roof are safety devices installed toprevent harmto the children. [emphasis in original] 99 In my view, by-law 5(3)(c) must properly be construed as allowing a subsidiary proprietor to erect a structure or device that is necessary to prevent harm to the children residing with him in his lot, rather than children generally residing in the development. Whether the common property of the strata development poses a risk to the safety of children in general is the responsibility of the management corporation and a matter for its assessment and action. By-law 5(3)(c) cannot be a licence for individual occupiers to take matters into their own hands and reconstruct parts of common property to a standard of safety that they find satisfactory, simply because their children are amongst the possible users of those parts. 100 I saw no reason to disturb the Board’s finding that the Works did not fall within by-law 5(3)(c). The appellant did not challenge the Board’s finding as regards Work 1, and rightly so, since there was clearly no basis to conclude that the purpose of the timber decking was to prevent harm to the appellant’s children. The application submitted on the appellant’s behalf to the respondent on 3 September 2013—which, notably, referred to the wide ledges as “common areas”—acknowledged that the ledges were not accessible from the Unit. The appellant’s intentions appeared to have been primarily aesthetic. The application emphasised that the ledges were “clearly visible from the interior of the Penthouse Unit” and “not a pretty sight”, due to discoloured, cracked and dirty tiles, poor workmanship, a gap between the tiles and the parapet and crystallisation of the concrete edge at the flooring near the parapet. 101 I was similarly unpersuaded that Works 2 and 3 were intended to prevent harm to the appellant’s children. As regards Work 2, the respondent took the position that access to the flat roof was intended only for maintenance purposes by the respondent’s staff and there was hence no reason for the appellant’s children to frequent it for play. This seemed to be a fair point. The correspondence between the appellant (and/or Glory) and the respondent bore no mention of concern for his children’s safety, save for one vague allusion to the fact that “the original floor was very dirty and slippery when it was wet”. In fact, the appellant’s intention again appeared to have been primarily aesthetic. During the AGM on 25 April 2015, the appellant’s representative (Mr Sin Lye Kuen, the head of Glory’s legal department) described the flat roof as “one of those places that […] none of us will go to on an ordinary day” and “not a place that is really usable in any sense” as there was “no view, you get sun straight onto your head, and there is absolutely nothing”. He explained that Work 2 had been installed for “aesthetic and also for safety reasons because cement screed over time becomes slippery, becomes smooth if you walk on it”. He added that “I don’t think [the appellant] intends to come up there oh, he go up to 30th floor, look at the terrace area, no chairs, nothing […] I think there are better places for the [appellant] to rest and to enjoy the premises than to use that place and all”. He emphasised that the timber decking was “nice” and “aesthetically more pleasing”. There was no mention at all of the appellant’s children visiting the area, much less running around on wet ground and running the risk of falling and injuring themselves. 102 As regards Work 3, I agreed with the Board that there was insufficient evidence of a direct correlation between the installation of the air-conditioning ventilation unit and the prevention of harm to the appellant’s children. The appellant’s representative made no mention of any safety concerns during the AGM on 25 April 2015. No evidence was adduced to suggest that the air quality within the Unit posed a risk of harm to his children, or that the installation of Work 3 removed this risk. One moreover wonders why other options for improving the air qualityinas opposed to outside the Unit were not explored. In any event, this was a finding of fact not open to challenge by the appellant.",
        "Issue 4: whether the Board erred in its interpretation and application of ss 33 and 58 of the Act as regards Work 3": "103 The Board had found that Work 3 amounted to “exclusive use” within the meaning of s 33 of the Act, which states: Exclusive use by-laws 33.—(1) Without prejudice to section 32, with the written consent of the subsidiary proprietor of the lot concerned, a management corporation may make a by-law — (a) pursuant to anordinary resolution, conferring on the subsidiary proprietor of a lot specified in the by-law, or on the subsidiary proprietors of the several lots so specified,for a period not exceeding one year— (i) the exclusive use and enjoyment of; or (ii) special privileges in respect of, the whole or any part of the common property, upon conditions (including the payment of money at specified times or as required by the management corporation, by the subsidiary proprietor or subsidiary proprietors of the lot or several lots) specified in the by-law; (b) pursuant to aspecial resolution, conferring on the subsidiary proprietor of a lot specified in the by-law, or on the subsidiary proprietors of the several lots so specified,for a period which exceeds one year but does not exceed 3 yearsand cannot be extended by exercise of any option of renewal to exceed an aggregate of 3 years — (i) the exclusive use and enjoyment of; or (ii) special privileges in respect of, the whole or any part of the common property, upon conditions (including the payment of money at specified times or as required by the management corporation, by the subsidiary proprietor or subsidiary proprietors of the lot or several lots) specified in the by-law; (c) pursuant to a90% resolution, conferring on the subsidiary proprietor of a lot specified in the by-law, or on the subsidiary proprietors of the several lots so specified,for a period which exceeds 3 years— (i) the exclusive use and enjoyment of; or (ii) special privileges in respect of, the whole or any part of the common property, upon conditions (including the payment of money at specified times or as required by the management corporation, by the subsidiary proprietor or subsidiary proprietors of the lot or several lots) specified in the by-law; or (d) amending, adding to or repealing a by-law made in accordance with paragraph (a), (b) or (c), as the case may be. [emphasis added] 104 The appellant submitted that Work 3 did not amount to exclusive use since it “neither deprived other subsidiary proprietors from the use of the exterior wall, nor converted or earmarked any particular segment of the exterior wall for the [appellant’s] own exclusive use”. In this regard, he relied onAutomobile Association of Singapore vMCST Plan No. 918[2014] 1 SLR 164 (“AutomobileAssociation of Singapore”) andLee Lay Ting Jane. Even if Work 3 did amount to exclusive use, the appellant argued, relying on s 33(1) read with s 58(4) of the Act, that the respondent nonetheless had jurisdiction to authorise Work 3 for a period not exceeding one year. As the argument went, by-laws granting a subsidiary proprietor the exclusive use of common property for a period not exceeding one year need only be passed by ordinary resolution under s 33(1)(a) of the Act, which the appellant submitted did not fall within the definition of a “restricted matter” in s 58(4). 105 I agreed with the Board’s finding at [45]–[47] that there was exclusive use of the common property as regards Work 3 within the meaning of s 33 of the Act. The authorities cited by the respondent (Mark Wheeler,Anne LeeandYap Sing Lee) were analogous and helpful. In fact, the installation of an air-conditioning unit on a wall of the common property had been given as an example of exclusive use in Alex Ilkin,Strata TitleManagement and the Law(The Law Book Company Limited, 1989) at p 229, which was cited inMarkWheelerat [43]. On the other hand, the authorities cited by the appellant were clearly distinguishable: (a) InAutomobile Association of Singapore, the court held that by-laws allocating 66 of 94 car park spaces to the plaintiff did not have the effect of conferring exclusive use of those spaces on the plaintiff. The 94 car park spaces were available on a “first-come-first-available” basis, meaning that “no one particular space was earmarked for the exclusive use of any one subsidiary proprietor” (at [19]). In fact, each subsidiary proprietor was free to use any of the lots in the entire car park as long as he/she did not exceed the number of spaces allocated to him/her. This was unlike the present case, where as a result of the installation of Work 3, the area in question could no longer be used by any other subsidiary proprietor as it was permanently physically occupied by the air-conditioning ventilation unit. (b) InLee Lay Ting Jane, the Board found that upgrading the applicant’s units’ electricity supply from 63 Ampere Single Phase to 100 Ampere Three Phase did not amount to exclusive use of common property. Although the upgrading would require the applicant to make adjustments and connections to certain electrical switchboards and cables, which were common property, these adjustments and connections would not deprive other subsidiary proprietors of the use of the switchboards and cables. There was therefore no “exclusive” use of the switchboards and cables. As for the actual electricity to be supplied, this was to come from the development’s unused electricity supply and would not detract from other subsidiary proprietors’ existing electricity supply. Although the upgrading might have amounted to “exclusive” use of the spare electricity supply, which was finite, the electricity supplywas notcommon property (at [37]).Lee Lay Ting Janewas plainly distinguishable from the present case because the installation of Work 3 necessarily excluded other subsidiary proprietors from the area of the wall which it occupied, and which was common property. 106 Sections 58(1) and 58(4) of the Act did not assist the appellant for three principal reasons. These provisions state: Council’s decisions to be decisions of management corporation 58.—(1) Subject to the provisions of this Act, the decision of a council on any matter, other than a restricted matter, shall be the decision of the management corporation. … (4) In subsection (1), “restricted matter”, in relation to a council of a management corporation, means — (a) any matter a decision on which may, in accordance with any provision of this Act or the by-laws, only bemade by the management corporationpursuant to a unanimous resolution, special resolution, 90% resolution, comprehensive resolution, resolution by consensus orin a general meeting of the management corporation, or only by the council at a meeting; and (b) any matter referred to in section 59 and specified in a resolution of that management corporation passed for the purposes of that section. [emphasis added] 107 First, I take the view that a by-law falling within s 33(1)(a), which may be passed by ordinary resolution, is in fact a restricted matter within the meaning of s 58(4). I took this view tentatively when I gave oral grounds and have since become firm in my view. 108 Section 58(4)(a) restricts the council of the management corporation (“management council”) from taking decisions which may only be made,interalia, by the management corporationin a general meeting. Section 2(2) of the Act states that a motion is passed by ordinary resolution if it is passed at a “duly convened general meeting” of the management corporation with the requisite proportion of votes. An ordinary resolution must therefore be taken at a “general meeting of the management corporation”, and is hence a “restricted matter” within s 58(4) of the Act. A by-law conferring exclusive use not exceeding one year, which must be passed by ordinary resolution, is thus a restricted matter. 109 This is supported by the genealogy of s 33(1). Prior to the Act, s 41(8)(a) of the 2003 LTSA stipulated that a management corporation could only make by-laws conferring the exclusive use of common property on a subsidiary proprietor (“exclusive use by-laws”) pursuant to aunanimousresolution, regardless of the intended duration of that exclusive use. The making of “exclusive use by-laws” was thus clearly a “restricted matter” within the meaning of s 63(4)(a) of the 2003 LTSA (now s 58(4) of the Act) (see,eg,Mark Wheelerat [47]). InRe BukitTimah Shopping Centre (Strata Titles Plan No. 1601)[1996] SGSTB 6, the Board unambiguously held at [10] that a proposal for an exclusive use by-law under s 41(8) of the 1988 Revised Edition of the LTSA (now s 33(1) of the Act) could not be delegated to the management council for determination for precisely this reason: … [A]ny proposal for an alteration or addition to the common property of the order described in any of Sections 22(1), 23(1), 41(8) or 48(l)(d) must be subject to the procedure of a general meeting being properly convened to pass a unanimous or special resolution (as the case may be) to approve the adoption of such proposal. The language of the Sections is very clear. This statutorily mandated process of decision-making by the general body of the management corporation in [a meeting] cannot be short-circuited by the delegation of this decision-making function to the Council. It is clear why this must be so. Every subsidiary proprietor of a lot is also, together with his fellow subsidiary proprietors, an owner of the common property, albeit only proportional to the share value allotted to his lot, and fundamental to such ownership is the right to use and enjoy the common property. Any of the actions envisaged in Sections 22(1), 23(1), 41(8) or 48(l)(d) would take away or curtail or modify his said right. Therefore, if there is a proposal for any of the said actions to be taken, it must be ensured that such proposal is duly brought to his notice and the opportunity given to him to discuss it with his fellow subsidiary proprietors in general meeting before it is implemented. … Reading Sections 63(1) and 63 (4)(a) strictly, without exception a council may not on behalf of the management corporation make a decision on a restricted matter… 110 Section 41(8)(a) was repealed by the Act, which provides that only an ordinary resolution, special resolution or 90% resolution is necessary to make an exclusive use by-law, depending on the intended duration of the exclusive use. The Select Committee Report revealed (at para 14) that the purpose of introducing these resolutions was to moderate some of the difficulty that management corporations previously experienced in garnering the requisite percentage of votes: The Committee noted that the 2 new resolutions [ie,the 90% resolution and comprehensive resolution] were introduced to facilitate the MC’s decision-making on issues that normally required unanimous resolution or resolution without dissent (ie unanimous consent)... Unanimous resolution or resolution without dissent might be difficult to procure. As such, the 2 new resolutions should be retained to facilitate self-governance by MCs. 111 Indeed, the overarching objective of the Act was to “provide for more effective management and maintenance of strata developments, recognising differences in interests amongst stakeholders” and “provide flexibility by empowering MCs to make decisions, and therefore encourage self-regulation”:Singapore Parliamentary Debates, Official Report(19 April 2004) vol 77 at cols 2743–2744 (Mr Mah Bow Tan, then Minister for National Development). The Select Committee Report also included a paper dated 10 May 2004 from five residents of “Summerdale Executive Condominium”, complaining precisely of the difficulty of obtaining a unanimous vote for the installation of a window in a wall constituting common property. 112 The question therefore was whether Parliament, in moderating the difficulty of passing exclusive use by-laws, also intended to thereby remove by-laws conferring exclusive use not exceeding one year from the category of “restricted matters” altogether. I was of the view that it did not. 113 Interestingly, prior to the convening of the Select Committee, the Draft Bill did not originally include what is now s 33(1)(a). It provided only that an exclusive use by-law not exceeding three years must be made by special resolution (originally draft clause 32(1)(a)) and that an exclusive use by-law exceeding three years must be made by 90% resolution (originally draft clause 32(1)(b)). No mention was made of a resolution requirement for an exclusive use by-law not exceeding one year. The exact same approach was taken as regards leases of common property (now s 34 of the Act): leases exceeding three years required a 90% resolution and leases not exceeding three years required a special resolution, but leases not exceeding a year made no mention of a resolution requirement. This was deliberate, as seen from the comments of Mr Mah Bow Tan at the second reading of the Bill (Singapore Parliamentary Debates, Official Report(19 April 2004) vol 77 at col 2748): The Bill will also empower the MC to lease out common property or confer special privileges for its use to SPs and others.Decisions on short-term leases of up to one year can be made without the need for a resolution to be passed at a general meeting.However, leases up to three years will require a special resolution, ie, consent of 75% of valid votes, while longer leases will require 90% of valid votes. [emphasis added] 114 It therefore appears that the Draft Bill contemplated a uniform approach towards leases of common property and exclusive use by-laws, under which leases or by-laws not exceeding one year could be executed without the need for a general meeting. Critically, however, the position vis-à-vis exclusive use by-laws changed after the Draft Bill was committed to the Select Committee, following its consideration of a paper submitted by the APFM. The APFM’s paper noted at para 5.8.1 that “[t]he situation when the period of use or privileges for not exceeding one year has not been provided for”, and recommended for “clarity” that a new s 32(1)(a) be included, which would require an exclusive use by-law not exceeding one year to be made by ordinary resolution. 115 The Select Committee adopted this recommendation. At the clause-by-clause consideration of the Draft Bill on 27 September 2004, clause 32(1) was amended to include what is now s 33(1)(a) of the Act and agreed to as amended. Mr Mah Bow Tan explained that (Select Committee Report at p E23): Amendments (1) and (2) are in response to a representation from APFM.This is to enable a management corporation to make an exclusive use by-law for a period not exceeding one year, via ordinary resolution at a general meeting. [emphasis added] 116 Parliament’s decision to require majority approval of an exclusive by-law not exceeding one year, at a general meeting of the management corporation, was therefore evidently quite intentional. By legislating s 33(1)(a), Parliament clearly chose not to allow the management council to unilaterally convert common property to the exclusive use of individual proprietors. Section 33(1)(a) was inserted to retain a procedural safeguard for the making of exclusive use by-laws not exceeding one year in duration. Evidently, that purpose would be undermined if s 58(1) of the Act, a general provision allowing the management council to make decisions on behalf of the management corporation, were to override the more specific s 33(1)(a) and render it otiose. 117 It may be observed that this amendment created a divergence in the requirements for leases of common property and exclusive use by-laws. Under the Act, the management corporation does not require a general meeting to execute aleaseof common property not exceeding a year, but requires an ordinary resolution to make an exclusive use by-law not exceeding a year. This might seem strange given that a lease of common property may be thought to detract more significantly from other subsidiary proprietors’ ability to enjoy the common property than a by-law conferring special privileges. Nevertheless, strange though this may be, it does not affect the foregoing analysis. 118 Secondly, even if I was wrong in this view, the appellant’s argument presupposed that he was really only seeking an annual licence. This was a wholly inaccurate characterisation of the true state of play. Given the reasons advanced by the appellant for the installation of Work 3, it must follow he sought a licence for so long as he continued to occupy the Unit. There was nothing to suggest that the appellant intended to install the air-conditioning ventilation unit only temporarily. The licence sought therefore did not have a shelf life of one year. To require the respondent to authorise Work 3 would have allowed the appellant to circumvent s 33(1) of the Act, which requires the general body to approve such a significant derogation from communal access to common property, under the guise of an application for an annual licence. 119 Thirdly, the appellant had sought approval from the general body at the AGM on 25 April 2015, and had been roundly rejected (see [18] above). In the circumstances, it was clear that the management council could not arrogate to itself the right to grant the appellant’s request. It should be noted that s 58(3) of the Act prevents the management council from making a decision if it is opposed by subsidiary proprietors owning not less than one-third of the lots. This has the effect of removing seriously contested matters from the scope of the management council’s authority. It would have been inconsistent with that principle for me to find that the management council was wrong to deny the appellant exclusive use of common property, when that very issue had been decided quite conclusively against the appellant at a general meeting of the management corporation. 120 It behoves me to add that, whether or not Work 3 resulted in the exclusive use of the area in which it was situated, the appellant would not have been entitled to carry it out. Whether or not an installation results in exclusive use only goes to whether a by-law conferring such exclusive use is required under s 33 of the Act. Just because an installation does not result in exclusive use of common property does not automatically mean that it was authorised or permitted: the written approval of the management corporation is still required under by-laws 5 of the Prescribed By-Laws and 8 of the Additional By-Laws. The absence of exclusive use does notipso factocreate an entitlement to install works on common property. The fact remained that the appellant installed the Works on common property without any entitlement to do so. For this reason, I was of the view that there was no value in addressing prayer 1(f) of the application, which sought a declaration that the Board had erred in law by failing to make a declaration that Works 1 and 2 did not amount to exclusive use of the relevant areas.",
        "Issue 5: the proper interpretation of s 111(a) of the Act": "121 The appellant submitted that s 111(a) of the Act allowed the Board to order the management corporation to retrospectively consent to works that had already been carried out without consent. Section 111 states: Order with respect to consents affecting common property 111.Where, pursuant to an application by a subsidiary proprietor, a Board considers that the management corporation or subsidiary management corporation to which the application relates — (a) has unreasonably refused to consent to a proposal by that subsidiary proprietor to effect alterations to the common property or limited common property; or (b) has unreasonably refused to authorise under section 37(4) any improvement in or upon a lot which affects the appearance of any building comprised in the strata title plan, the Board may make an order that the management corporation or subsidiary management corporation, as the case may be, consents to the proposal. 122 The appellant citedMark Wheelerat [37]for the proposition that even where the proposed alteration works had already been effected, the proposal itself remained effective and could be approved or rejected notwithstanding the work already done. The appellant further submitted that the Board had erred in law by failing to authorise Works 1 and 2 despite having found that those works did not amount to exclusive use and enjoyment or conferment of special privileges. The respondent, on the other hand, argued that ss 111(a) and 111(b) had no application to works that had already been effected, citingMarkWheelerat [69]. As I do not see how the argument of prospective application can apply to s 111(b), which does not require a “proposal” for alterations, I will address the argument only in respect of s 111(a). 123 I am of the view that s 111(a) of the Act operates prospectively. However, that is not to say that an appellant could not avail himself of s 111(a) where the works had been carried out without prior approval. That said, where a court is invited to review the Board’s decision in respect of s 111(a), it must approach the application as if the work in question had not been carried out instead of accepting the work as afait accompli.The court must freshly consider the merits of the application without attributing any weight whatsoever to the fact that resources have already been expended on carrying out the work, since it was undertaken without sanction. 124 InMark Wheeler, the applicant (“Wheeler”) had wanted to install a retractable awning on common property in front of his unit to shield his unit from the sun’s heat and glare. Wheeler complained to a member of the management council about his problem and asked whether he could erect a shade. Wheeler claimed that the council member agreed to bring the matter before the management council for consideration; the council member denied this and testified that he had told Wheeler to write to the management council. Wheeler never submitted a written proposal to erect an awning and did not obtain the management corporation’s approval to do so, but proceeded to install the awning anyway. He subsequently sought from the Board an order that the management corporation consent to his proposal under s 104 of the LTSA, which wasinpari materiawith s 111(a) of the Act. The management corporation objected on the basis,inter alia, that Wheeler had already erected the awning and it therefore did not come within the ambit of s 104 of the LTSA. 125 Wheeler cited the NSW case ofProprietors of Strata Plan No 1627 v Schultz(1978) 2 BPR 9443 (“Schultz”), which the Board referred to at [37] of its decision. There, the defendant (“Schultz”) had fitted out a shop in a strata building as a coin-operated laundry. She installed ducts, pipes and vents in part of the common property to provide ventilation and exhaust for the laundry and attached an advertising sign to the building’s external wall. After the work was done, Schultz sought the body corporate’s permission for the work, which it refused. Schultz then applied to the Strata Titles Commissioner under s 106 of the NSW Strata Titles Act 1973 (corresponding to our s 111(a)). Holland J of the NSW Supreme Court held that s 106 applied to alterations proposed and not accomplished, and did not empower the Commissioner to make an order “approving or ratifying alterations already made to the common property”. However, the fact that the alterations proposed had already been effected did not necessarily mean that Schultz’s earlier proposal had ceased to exist. Schultz’s application could still be entertained notwithstanding that the works had already been installed. The proposal could be considered to have a life of its own. Nevertheless, the Commissioner would be bound to consider the application as one for consent to a proposal, disregarding the fact that the work already had been done except insofar as the work done was illustrative of the proposal. He could not, for example, have regard to any financial or other hardship that would be occasioned to Schultz if she had to remove the works. 126 The Board inMark Wheelerdid not expressly approve or disapproveSchultz, although it noted at [51] that the facts were distinguishable in that Wheeler had not submitted a written proposal to the management corporation either before or after installing the awning. Wheeler had therefore never made a “proposal” to the management corporation within the meaning of s 104 of the LTSA. Although this sufficed to dispose of Wheeler’s application under s 104, the Board went on to state at [69] that: In construing section 104 of the Act concerning alterations or additions to common property without consent, the Board will refuse to order a management corporation to give its consent where alterations or additions have already been carried out. The respondent relied on thisdictumfor the proposition that s 111(a) is unavailable to an applicant who has already installed the works proposed. I don’t believe this proposition is correct. 127 I do not agree that the Board lacks jurisdiction under s 111(a) to order the management corporation to consent to works that have already been effected. In my opinion, the decision inMark Wheelershould be viewed as grounded upon the Board’s findings that there was no “proposal” for the works in question and hence s 104 of the LTSA did not apply (at [52]) and that, even if it had, it would not have been unreasonable for the management corporation to refuse its consent (at [68]). I agree with the approach inSchultz: the fact that the works proposed have already been carried out cannot automatically deprive the Board of jurisdiction to consider the proposal. After all, it would be a needless waste of resources to require the subsidiary proprietor to first dismantle the installations before presenting a second application to the Board, only for the Board to then order the management corporation to consent to the works. It is far more sensible for the Board to consider the proposalde novo, without regard to any financial hardship that would be occasioned to the subsidiary proprietor in the event that consent is withheld. 128 At any rate, given my views on ss 58(1) and 58(4), I was unable to entertain any submission that Work 3 ought to have been authorised under s 111(a) of the Act. Should the Board have authorised Works 1 and 2 under s 111(a)? I was of the view that there was no basis to disturb the Board’s finding that the respondent’s refusal of consent to Works 1 and 2 was not unreasonable. The evidence did not, in my view, make a compelling case for the installation of Works 1 and 2 on the grounds alleged by the appellant. I have alluded at [100] and [101] above to the paucity of the evidence in this regard. It appeared that these works were to be installed primarily for aesthetic rather than health reasons. The respondent took the position that the areas on which Works 1 and 2 were to be installed were to be accessed by staff for maintenance purposes. Indeed the respondent asserted that the installation of Work 2 made it difficult for the respondent to properly upkeep the area as it obstructed the floor trap and drainage system. Moreover, the general body of subsidiary proprietors had withheld its support for the appellant’s intended use of the property during the AGM on 25 April 2015. 129 I make two further observations. First, the appellant had caused the fixed glass panels that separated the Unit from the wide ledges to be removed and replaced with sliding glass panels in order to carry out Work 1. It must be observed that the fixed glass panels were fixed for a purpose – to prevent access by the occupants of the Unit, presumably for safety reasons. They were therefore not meant to be removed and the ledges not meant to be accessed. It appeared that the appellant took matters into his own hands and acted inappropriately by doing something he was barred from doing whatever his motivations might have been. To hold that the respondent withheld consent unreasonably in such circumstances would countenance such conduct. That did not seem right. Second, the reason offered by the appellant for Work 2 was that of safety. No other reason was offered. I have found that reason to be unsustainable. It thus seems correct to conclude that there was no basis to say that the respondent withheld consent unreasonably. To say otherwise would imply that a sensible basis to install Work 2 existed in the first place. In light of these factors I saw no reason to disturb the Board’s decision.",
        "Issue 6: whether the Board erred in its interpretation of s 37 of the Act": "130 The appellant submitted that the Board had erred in finding that the respondent could not authorise the Works under s 101(1)(c) read with s 101(4) or s 111 of the Act because they were not improvements “in or upon” the Unit within the meaning of s 37(4). Sections 37 and 101 of the Act state: Improvements and additions to lots 37.— … … (3) Except pursuant to an authority granted under subsection (4), no subsidiary proprietor of a lot that is comprised in a strata title plan shall effect any other improvement in or upon his lot for his benefit which affects the appearance of any building comprised in the strata title plan. (4) A management corporation may, at the request of a subsidiary proprietor of any lot comprised in its strata title plan and upon such terms as it considers appropriate, authorise the subsidiary proprietor to effect any improvement in or upon his lot referred to in subsection (3) if the management corporation is satisfied that the improvement in or upon the lot — (a) will not detract from the appearance of any of the buildings comprised in the strata title plan or will be in keeping with the rest of the buildings; and (b) will not affect the structural integrity of any of the buildings comprised in the strata title plan. … General power to make orders to settle disputes or rectify complaints, etc. 101.—(1) Subject to subsections (4), (6) and (7), a Board may, pursuant to an application by a management corporation or subsidiary management corporation, a subsidiary proprietor, mortgagee in possession, lessee or occupier of a lot in a subdivided building, make an order for the settlement of a dispute, or the rectification of a complaint, with respect to — … (c) the exercise or performance of, or the failure to exercise or perform, a power, duty or function conferred or imposed by this Act or the by-laws relating to the subdivided building or limited common property, as the case may be. … (4) For the purposes of this section, where a management corporation or subsidiary management corporation has a discretion as to whether or not to exercise or perform a power, duty or function conferred or imposed on it by this Act or the by-laws, it shall be deemed to have refused or failed to exercise or perform that power, duty or function only if it has decided not to exercise or perform that power, duty or function. … 131 The appellant argued that to confine s 37 to works installed within a subsidiary proprietor’s lot would render the distinction between “in” and “upon” nugatory. He asserted that the language of s 37 (ie, improvements “in or upon [a] lot”) was broad enough to include improvements which, although not technically within a lot, were nevertheless “in respect of” the lot. In this regard, the appellant referred me to the following excerpts fromStrata Title in Singapore and Malaysia: [10.95]A subsidiary proprietor of a lot is not permitted to effect any improvement in or upon his lot for his benefit which increases or is likely to increase the floor area of the land and building comprised in the strata title plan. However, the management corporation may, at his request and upon such terms as it considers appropriate, by 90% resolution, authorise him to effect the improvementsin respect of his lot. … [10.96]A subsidiary proprietor is also prohibited from effecting any other improvementin respect of his lotfor his benefit which affects the appearance of the building unless he is authorised by the management corporation to do so and upon such terms as it considers appropriate. … [emphasis added] 132 The appellant submitted that the learned author’s references to improvements “in respect of [a] lot” supported his contention that the works need not be physically situated within the lot in question. 133 I did not accept the appellant’s argument that the term “improvement in or upon [a] lot” includes work carried out on common property so long as it is with reference to a lot. That term, in my view, must be read to be confined to works done “in” or “on”, as opposed to simply “in relation to”, the Unit. As much can be deduced from the heading of s 37, which is “Improvements and additionsto lots” (emphasis added). I do not think that the learned author ofStrata Title in Singapore and Malaysiaintended, by referring to improvements “in respect of” a lot, to encompass works installedoutsidethe lot. This would take the phrase “in or upon” beyond its natural meaning. 134 Section 37 was newly introduced in the Act and had no predecessor in either the LTSA or the BCPA. The Draft Bill originally only contained what are now sub-ss (1), (2) and (5) of s 37. Sub-ss (3) and (4) were only inserted after the Select Committee’s deliberations. Mr Mah Bow Tan’s comments in the Select Committee Report on ss 37(3) and 37(4) of the Act shed light on the reason for their insertion (at page E25): Sir, following the exclusion of external windows from the definition of “common property”, this change [ie,inserting ss 37(3) and 37(4)] is necessary so that management corporations retain the power to control changes to external windows, which will affect the appearance of buildings within the strata development. The provision also covers any improvement that will affect the appearance of the buildings. ... This is also an existing provision in the statutory by-laws, which is now transferred to the main Act. 135 The last sentence of his comments must be taken to refer to by-law 12 of the by-laws prescribed in the First Schedule of the LTSA 2003, as follows: A subsidiary proprietor or occupier shall not make any alteration to the windows installed in the external walls of the subdivided building without having obtained the approval in writing of the management corporation. 136 For context, the LTSA 2003 definition of “common property” had included windows installed in any external wall of the building (see [64] above). Section 2(9) of the Act altered this by providing that certain types of external windows (namely, louvres, casement windows, sliding windows and windows with any moveable part) would be part of the lot and not common property. This made sense because it would be practically easier for the subsidiary proprietor than the management corporation to maintain moveable external windows. However, this gave rise to concerns that subsidiary proprietors would alter such windows and thereby disrupt the consistency and aesthetic of the façade of the buildings within the strata title plan (see,eg, Select Committee Report at p B136, APFM’s paper at para 5.9.1). 137 In response to these concerns, ss 37(3) and 37(4) were inserted into the Draft Bill to ensure that the management corporation nevertheless retained control over the external windows even though they were no longer common property. The intended effect of these sub-sections was to subjugate a subsidiary proprietor’s right to make improvementstohis lotto the supervision of the management corporation insofar as they affected the appearance of the building. The insertion of ss 37(3) and 37(4) would not have been necessary had the external windows remained part of the common property, which was all along subject to the management corporation’s control by virtue of s 32 of the Act and by-law 5 of the Prescribed By-Laws. This analysis was supported by the very text ofStrata Title in Singapore and Malaysiawhich the appellant relied on, although the appellant’s submissions omitted to reproduce the following portion of para 10.96: [10.96]…the management corporation must be satisfied that the improvement in respect of the lot will not detract from the appearance of any of the buildings or will be in keeping with the rest of the buildings and will not affect the structural integrity of any of such buildings.Given that external windows that areopenable (such as louvres, casement or sliding windows or windows with any movable part) are excluded from the definition of common property, it is important that management corporations retain the power to control changes to such windows.… [emphasis added] 138 Given this background, it was clear that ss 37(3) and 37(4) were not intended to regulate improvements to common property, but to a subsidiary proprietor’s lot. In accordance with my foregoing analysis of common property, I was of the view that ss 37(3) and 37(4) should be restricted to improvements within a given lot, or within areas for the exclusive use of the appellant’s lot although not comprised in any lot. Such areas would not constitute common property. 139 Since s 37(4) did not apply to works on common property, the Board could not have ordered the respondent to consent to the Works under s 101 or s 111 of the Act.",
        "Conclusion": "140 Accordingly, I dismissed the Application with costs to the respondent. I wish to record my appreciation to both counsel for their carriage of this matter.     Kannan RameshJudicial Commissioner  Alvin Yeo SC, Candy Agnes Sutedja and Hannah Lee (WongPartnership LLP) for the appellant;Subramanian s/o Ayasamy Pillai and Perera Randall Mingyang (Colin Ng & Partners LLP) for the respondent."
    }
}