{
    "case_title": "Public Prosecutor vOng Say Kiat",
    "ncitation": "[2017] SGHC 221",
    "coram": "Sundaresh Menon CJ",
    "sections": {
        "Introduction": "1 Criminal Revision No 7 of 2017 (“CR 7”) was an application by the Prosecution for me to exercise my revisionary powers under s 401 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) to set aside a sentence of five years’ corrective training (“CT”) that had earlier been imposed on the respondent, and to impose, in its place, a sentence of at least nine months’ imprisonment. 2 At the hearing, the Prosecution applied to withdraw CR 7. I granted the Prosecution leave to do so. I also granted the respondent leave to appeal out of time and made an order under s 380 of the CPC dispensing with the need for him to file any other documents or written submissions. I treated the appeal as having been heard and allowed the appeal. Accordingly, I set aside the sentence of five years’ CT that had earlier been imposed on the respondent and sentenced him instead to a term of imprisonment of time already served. These are the grounds for my decision.",
        "Background": "3 The respondent pleaded guilty on 4 December 2014 to a single charge of theft in dwelling with common intention under s 380 read with s 34 of the Penal Code (Cap 224, 2008 Rev Ed) (“PC”). The facts giving rise to this charge were straightforward: on 18 September 2014, the respondent and his wife had committed theft of four pieces of apparel with a total value of $220.60 from a store. 4 When it came to sentencing, what stood out was the respondent’s notable criminal history. Just his theft-related antecedents were as follows: SNConviction dateOffenceSentence111 September 1998Theft with common intention18 months’ probation218 August 2005Theft in dwelling4 months’ imprisonment33 October 2008Theft in dwelling4 months’ imprisonment421 June 2013Theft1 week’s imprisonment530 June 2014Theft in dwelling with common intention9 weeks’ imprisonment 5 The respondent also had various other antecedents relating to drug and unlicensed moneylending offences, amongst others. 6 Upon the respondent’s conviction of the offence in question, the Prosecution urged the District Judge to call for a pre-sentencing report as to the respondent’s suitability for CT. The District Judge did so. The report indicated that the respondent was suitable for CT. When the matter was heard again on 31 December 2014, the Prosecution accordingly submitted that the respondent had a clear tendency towards crime and that a term of CT would be appropriate. The District Judge, having considered the matter, sentenced the respondent to five years’ CT on the same day. Five years was (and is) the minimum term of CT mandated by s 304(1) of the CPC. 7 On 3 March 2017, the Prosecution was informed of the respondent’s intention to file a criminal motion to appeal against his sentence out of time. The Prosecution then reviewed the sentence of five years’ CT that had earlier been imposed on the respondent. By this time, the three-judge panel of the High Court had issued its decision inSim Yeow Kee v Public Prosecutor and another appeal[2016] 5 SLR 936 (“Sim Yeow Kee”), which laid down guidelines applicable to the imposition of CT. The Prosecution considered the guidance provided inSim Yeow Keeand concluded that the sentence of five years’ CT that it had initially sought, and that had earlier been imposed on the respondent, should not be upheld. 8 CR 7 was therefore filed by the Prosecution on 4 May 2017. By it, the Prosecution sought to persuade me to exercise my revisionary powers under s 401 of the CPC to: (a) set aside the sentence of five years’ CT that had earlier been imposed on the respondent; and (b) impose, in its place, a sentence of at least nine months’ imprisonment backdated to 9 October 2014, the date of the respondent’s remand; and/or (c) make any other order which may be appropriate in the circumstances. The Prosecution contended that while the respondent’s antecedents and circumstances weighed in favour of the imposition of CT at the time the respondent was sentenced in the light of the then-prevailing jurisprudence, following the decision inSim YeowKee, the sentence of five years’ CT that had earlier been imposed on the respondent appeared to be “unduly disproportionatecompared to the likely term of regular imprisonment that would otherwise have been imposed” [emphasis in original]. The Prosecution submitted that this therefore resulted in “serious injustice” to the respondent and that, accordingly, the sentence of five years’ CT that had earlier been imposed on the respondent should be set aside and substituted with an appropriate and backdated sentence of imprisonment.",
        "Whether the respondent would have been sentenced to five years’ CT under the framework laid down inSim Yeow Kee": "9 The first step in the analysis was to consider whether the respondent would have been sentenced to five years’ CT under the framework laid down inSim Yeow Kee. I treated this as a threshold issue because if it was answered in the affirmative, then that would have been the end of the matter since there would then have been no basis at all for me to intervene. 10  InSim Yeow Kee, the court devised a two-stage sentencing framework to be adopted when considering whether to impose a sentence of CT. At the first stage, the court ascertains whether the offender meets the technical requirements for CT to be imposed, as set out in s 304(1) of the CPC (Sim Yeow Keeat [86]). There was no doubt that the respondent satisfied these technical requirements in the present case. 11 At the second stage, the court considers whether it is expedient with a view to the offender’s reformation and the prevention of crime that he be sentenced to CT (Sim Yeow Keeat [87]). This involves a three-step framework. 12 First, the court considers the imprisonment term that would likely be imposed on the offender in the circumstances of the case. Here, the court is assessing the sentence of imprisonment that it would likely impose on the offender for the offence that is before it, in the event it decides not to sentence the offender to CT. In this context, the court should take into account: (a) the principle of escalation; and (b) the consecutive sentence exception (Sim Yeow Keeat [99]). Either or both of these principles may be invoked in many of these cases, given that a necessary precondition to the imposition of CT is that the offender must meet the technical requirements I have referred to at [10] above. Those requirements will generally point towards a pattern of criminality based on the offender’s antecedents. This is what makes it appropriate to consider CT as a sentencing option in that the generally longer duration of CT might be justified by, among other things, the greater measure of specific deterrence that this might bring to bear on a recalcitrant offender. However, the court noted inSim Yeow Keethat the objective of specific deterrence could also be met by increasing the sentence of imprisonment (that is, the principle of escalation) or by running multiple sentences of imprisonment consecutively, where this is an available option and thought to be warranted in the circumstances (that is, the consecutive sentence exception). 13 In the present case, the Prosecution cited various precedents where sentences of between six and 15 months’ imprisonment had been imposed in somewhat similar circumstances, and submitted that an appropriate sentence would be at least nine months’ imprisonment. It is not necessary for me to refer to these precedents in detail. The respondent had spent over two and a half years in prison by the time CR 7 was heard on 20 July 2017, and this was even before his time spent in remand was taken into account. If the respondent was to be incarcerated any longer, this would have had to be on the basis of a sentence of imprisonment of around four years (after taking into account the likelihood of remission). The sentence urged by the Prosecution did not even approach this. By way of comparison, the respondent’s wife, who was his accomplice and who also had theft-related antecedents (although these were fewer in number), had been sentenced to imprisonment for a term of two months. It therefore seemed clear to me that, even after applying the principle of escalation, the sentence of imprisonment that would likely have been imposed on the respondent would have been for a duration that was far lower than four years. Perhaps,at its highest, it might have been as high as nine months, which was the minimum sentence urged by the Prosecution. 14 Next, the court considers, at the second step, whether the offender qualifies for the Mandatory Aftercare Scheme (“MAS”). If the MAS is applicable and if the court is of the view that it would benefit the offender in question, these factors could cumulatively militate against the imposition of a sentence of CT (Sim Yeow Keeat [101]–[102]). 15 The Prosecution submitted that the respondent would have qualified for the MAS. With respect, I did not think that this was entirely correct. The circumstances in which the MAS is applicable are set out in s 50U of the Prisons Act (Cap 247, 2000 Rev Ed) (“PA”). Relevantly for present purposes, s 50U(1)(c) of the PA states as follows: Application 50U.—(1)  This Division applies where — … (c) the prisoner’s sentence for the offence, aggregated with any other consecutive term of imprisonment (excluding a default sentence) to which he was sentenced, is longer than the minimum sentence (if any) which, at the time the offence was committed, is prescribed in the First Schedule in relation to the offence; … … 16 Under the First Schedule of the PA, the “minimum sentence” prescribed in relation to an offence under s 380 of the PC is one year. Even going by the Prosecution’s submitted sentence of at least nine months’ imprisonment, this would not necessarily be longer than the prescribed minimum sentence of one year. Consequently, the respondent would likely not have qualified for the MAS. However, it is also clear thatSim Yeow Keedid not contemplate that CT should automatically be imposed whenever an offender does not qualify for the MAS. Rather, this is just one of the factors to be considered. In fact, in the present case, the fact that the respondent did not qualify for the MAS because s 50U(1)(c) of the PA was not satisfied brought into sharp focus the principle of proportionality, which was to be considered under the third and final step of the analysis. 17 At the third and final step, if, despite: (a) applying the principle of escalation; (b) imposing two or more consecutive sentences on the offender concerned; and (c) taking account of the rehabilitation opportunities that come with the MAS, the court considers that a longer term of incarceration than the likely term of regular imprisonment is called for to specifically deter the offender, and that this would be preferable for the offender’s prospects of reformation, the court should then sentence the offender to CT if it is an available sentencing option (Sim Yeow Keeat [103]). In the present case, it was entirely conceivable that given the respondent’s notable criminal history, a sentencing judge might have concluded that a sentence of imprisonment, even for a period of nine months, would have been manifestly inadequate in the circumstances. This would have been a strong indicator in favour of sentencing the respondent to CT. 18 However, proportionality is incorporated as anegatingconsideration in this step of the analysis and it would justifynotimposing CT if the statutorily-prescribed minimum term of CT would result in a period of incarceration that isseriously orunduly disproportionateto the aggregate imprisonment term which has been arrived at in applying the first and second steps, and which would otherwise likely be imposed. As noted above, the minimum term of CT mandated by s 304(1) of the CPC is five years, and if this is substantially in excess of the likely imprisonment term for the underlying offence, a sentence of CT should not be imposed (Sim Yeow Keeat [105]). In the present case, the minimum term of CT mandated by s 304(1) of the CPC (that is, five years) was very substantially in excess of the likely imprisonment term for the respondent’s offence, which would have been nine monthsat most(see [13] above). It was therefore clear that the imposition of CT would have resulted in a period of incarceration that was seriously or unduly disproportionate to the imprisonment term which would otherwise likely have been imposed. 19 In the circumstances, I was satisfied the respondent would not have been sentenced to five years’ CT under the framework laid down inSim Yeow Kee.",
        "Whether the present case called for the exercise of my revisionary jurisdiction": "20 Given that I answered what I have referred to as the threshold issue in favour of the respondent, the next question for me was whether this called for the exercise of myrevisionaryjurisdiction. 21 It is settled law that the High Court’s powers of revision are to be exercised sparingly and would only be invoked to remedy a serious injustice (MdRafiqul Islam Abdul Aziz v Public Prosecutor[2017] 3 SLR 619 at [23]). InAngPoh Chuan v Public Prosecutor[1995] 3 SLR(R) 929 (“AngPoh Chuan”), the High Court held (at [17]) that: Thus various phrases may be used to identify the circumstances which would attract the exercise of the revisionary jurisdiction, but they all share the common denominator thattheremust be someserious injustice. Of course there cannot be a precise definition of what would constitute such serious injustice for that would in any event unduly circumscribe what must be a wide discretion vested in the court, the exercise of which would depend largely on the particular facts. Butgenerally it must be shown that there issomething palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below. [emphasis added in italics and bold italics] 22 The Prosecution’s contention, as I understood it, was that “serious injustice” arose because, following the decision inSim YeowKee, the sentence of five years’ CT that had earlier been imposed on the respondent appeared to be “unduly disproportionatecompared to the likely term of regular imprisonment that would otherwise have been imposed” [emphasis in original]. However, it is to be recalled that the respondent was sentenced on 31 December 2014. The decision inSim Yeow Keewas handed down almost 21 monthslater, on 29 September 2016. Crucially, the Prosecution accepted that the respondent’s antecedents and circumstances weighedin favour ofthe imposition of CT at the time the respondent was sentenced in the light of the then-prevailing jurisprudence. In my judgment, it simply could not be said that there was any serious injustice, or that there was something palpably wrong in the sentence imposed that struck at its basis as an exercise of judicial power by the District Judge,at the time the sentence was meted out. 23 In fact, to the extent thatSim Yeow Keerepresented a change in the law, the authorities militatedagainstthe exercise of my revisionary jurisdiction. InAngPoh Chuan, the court held (at [24]) that: … Additionally, in the view of this court, the jurisdiction oughtnot be exercised where any grievance allegedly suffered by the applicant arises out of a change in the law. If it were otherwise, then, notwithstanding the expiry of the appeal period, it would be open to persons to challenge decisions by way of revision. [emphasis added] 24 This was subsequently affirmed inNg Kim Han and others v Public Prosecutor[2001] 1 SLR(R) 397 (at [22]). The High Court added (at [23]) that: The High Court’s power of revision should not be exercised in such a manner that it paves the way for a flood of re-litigation every time the criminal law gets changed. … 25 In addition, I also had regard to s 400(2) of the CPC. Section 400 of the CPC provides as follows: Power to call for records of State Courts 400.—(1)  Subject to this section and section 401, the High Court may, on its own motion or on the application of a State Court, the Public Prosecutor or the accused in any proceedings, call for and examine the record of any criminal proceeding before any State Court to satisfy itself as to the correctness, legality or propriety of any judgment, sentence or order recorded or passed and as to the regularity of those proceedings. (2)Noapplication may be made by any party under this section in relation to anyjudgment,sentenceor orderwhich he could have appealed against but had failed to do so in accordance with the lawunless the application is made — (a) against a failure by a court to impose the mandatory minimum sentence or any other sentence required by written law; or (b) against a sentence imposed by a court which the court is not competent to impose. [emphasis added] 26 The sentence of five years’ CT that had earlier been imposed on the respondent was no doubt a “sentence”. It was also one which theProsecution“could have appealed against but had failed to do so in accordance with the law” (because the Prosecution is able to appeal a sentence not only on the ground that it is manifestly inadequate but also that it is manifestly excessive (Public Prosecutor v Lim ChoonTeck[2015] 5 SLR 1395 at [75])). Section 400(2) of the CPC therefore appeared to preclude the exercise of my revisionary jurisdiction. 27 In the light of these observations, I entertained serious doubts as to whether the present case was one which warranted the exercise of my revisionary jurisdiction. I therefore put this to the Prosecution by way of a letter sent from the Registry and copied to the respondent on 18 July 2017. I asked to be addressed on some of these observations, and also on whether the present situation would be more correctly dealt with by granting the respondent an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him. When the matter was heard on 20 July 2017, the Prosecution accepted that CR 7 did not meet the criteria set out inAngPoh Chuanand that the sentence of five years’ CT that had earlier been imposed on the respondent should more properly be addressed in an appeal brought by the respondent. Accordingly, the Prosecution applied to withdraw CR 7. For the reasons set out at [21]–[26] above, I granted the Prosecution leave to do so.",
        "Whether the present case called for the exercise of my appellate jurisdiction": "28 As noted at [27] above, the Prosecution accepted at the hearing that the sentence of five years’ CT that had earlier been imposed on the respondent should more properly be addressed in an appeal brought by the respondent. The next step in the analysis was therefore to consider whether the present case called for the exercise of myappellatejurisdiction.",
        "The thresholds for the exercise of my revisionary and appellate jurisdictions": "29 The limited circumstances which call for the exercise of my revisionary jurisdiction have already been set out at [21]–[26] above. This has to be contrasted with the circumstances which call for the exercise of my appellate jurisdiction. In this regard, s 377(1) of the CPC states the grounds on which an appeal may be founded: Procedure for appeal 377.—(1)  Subject to sections 374, 375 and 376, a person who is not satisfied with any judgment, sentence or order of a trial court in a criminal case or matter to which he is a party may appeal to the appellate court against that judgment, sentence or order in respect of any error in law or in fact, or in an appeal against sentence, on the ground that the sentence imposed is manifestly excessive or manifestly inadequate. … 30 This is mirrored in s 394 of the CPC, which sets out the grounds for reversal by the appellate court: Grounds for reversal by appellate court 394.Any judgment, sentence or order of a trial court may be reversed or set aside only where the appellate court is satisfied that it was wrong in law or against the weight of the evidence or, in the case of a sentence, manifestly excessive or manifestly inadequate in all the circumstances of the case. 31 Similarly, the case law establishes that an appellate court may interfere with a sentence meted out by the trial judge if it is satisfied that: (a) the trial judge made the wrong decision as to the proper factual matrix for sentence; (b) the trial judge erred in appreciating the material before him; (c) the sentence was wrong in principle; or (d) the sentence imposed was manifestly excessive, or manifestly inadequate (Public Prosecutor vKwong Kok Hing[2008] 2 SLR(R) 684 at [14]). 32 It is clear from this that the thresholds for the exercise of my revisionary jurisdiction, on the one hand, and my appellate jurisdiction, on the other, are plainly different.",
        "Whether there were grounds for appellate intervention in the present case": "33 Applying s 394 of the CPC, was the sentence of five years’ CT that had earlier been imposed on the respondent wrong in law and/or manifestly excessive? The answer to this called for some analysis. On the one hand, the sentence of five years’ CT that had earlier been imposed on the respondent was in line with the then-prevailing jurisprudence. On the other hand, this position was subsequently modified, if not displaced, bySim Yeow Kee. At the same time, ifSim Yeow Keewas itself based on a development that came aboutafterthe sentence had been handed down in the present case, then this should not, as a matter of law, have any bearing on that sentence. However, if the relevant factual and legal matrix that applied to the respondent was essentially thesameas that inSim Yeow Kee, then there was no reason to think that the law laid down inSim Yeow Keeshould not also apply to the respondent. 34 In that light, I turn toSim Yeow Kee, where, in devising its two-stage sentencing framework, the court had, as its foremost consideration (at [85]), the changes in the operating conditions that affected the sentence of CT. These changes comprised: (a) the introduction of the MAS and the Conditional Remission Scheme (“CRS”); and (b) the developments that led to the eradication of any “qualitative” differences between CT and regular imprisonment. The MAS and the CRS came into effect on 1 July 2014 (Sim Yeow Keeat [16(b)]) and were therefore well in place when the respondent was sentenced on 31 December 2014. It also seemed to be the case that any “qualitative” differences between CT and regular imprisonment were also non-existent by this time. Put simply, the factual and legal substratum that underlies the new sentencing approach to CT that was laid down inSim Yeow Keewas already existent at the time of the respondent’s sentencing. Seen from this perspective, and notwithstanding the then-prevailing jurisprudence, the sentence of five years’ CT that had earlier been imposed on the respondent was, for the reasons set out at [10]–[19] above, wrong in law and manifestly excessive (although, it has to be said, this was through no fault of the District Judge). I also noted that the Prosecution did not contest that an appeal brought by the respondent should be allowed. In my judgment, therefore, there were ample grounds for appellate intervention in the present case. 35 This analysis dovetailed with the decision inPublic Prosecutor v Hue An Li[2014] 4 SLR 661, where the three-judge panel of the High Court, in setting out a framework for prospective overruling, held (at [124]) that the tension between retroactivity and prospectivity “is best resolved by a framework in which judicial pronouncements are, by default,fully retroactivein nature” [emphasis added]. Another way to analyse this was to examine it from the perspective of the following hypothetical question. Suppose the decision inSim Yeow Keehad been handed down one week after the respondent was sentenced: would the respondent have been able to rely on it if he had duly filed an appeal? It was clear to me that the answer to this could only be in the affirmative. That being the case, and putting procedural matters aside for the moment, there was really no defensible reason why the respondent should not be allowed to now pursue an appeal on the basis of the decision inSim Yeow Keejust because that decision happened to have been handed down almost 21 months, instead of just one week, after the respondent was sentenced. 36 Flowing from this analysis, it should be noted that any basis for appellate intervention would only avail itself to a fairly narrow group of offenders who had been sentenced to CT after the MAS and the CRS came into effect on 1 July 2014 and before the decision inSim Yeow Keewas handed down on 29 September 2016. Additionally, and obviously, potential appellants would also have to satisfy the appellate court that they would not have been sentenced to CT under the framework laid down inSim Yeow Kee. It was therefore not the case that all offenders who had been sentenced to CT prior to the decision inSim Yeow Keewould automatically be entitled to be resentenced. 37 In the circumstances, I was satisfied that the present case called for the exercise of my appellate jurisdiction.",
        "Whether my appellate jurisdiction could be exercised at the hearing on 20 July 2017": "38 As noted above at [13] above, the respondent had spent over two and a half years in prison by the time CR 7 was heard on 20 July 2017, and this was even before his time spent in remand was taken into account. If the respondent was to be incarcerated any longer, this would have had to be on the basis of a sentence of imprisonment of around four years (after taking into account the likelihood of remission), which was far in excess of the sentence urged by the Prosecution. In short, I could see no basis in law for the respondent to be incarcerated any longer than was necessary. The final step in the analysis was for me to consider whether my appellate jurisdiction could be exercised at the hearing on 20 July 2017. Two aspects had to be considered: (a) whether the respondent should be granted an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him; and (b) whether the procedural requirements in the CPC could be dispensed with.",
        "Whether the respondent should be granted an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him": "39 To recapitulate, the respondent was sentenced on 31 December 2014. By the time he was before me on 20 July 2017, the 14-day timeline for the filing of a notice of appeal pursuant to s 377(2)(b) of the CPC was long past. In order for my appellate jurisdiction to be invoked, I had to be satisfied that the respondent should be granted an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him. 40 The starting point in this regard was s 380(1) of the CPC, which provides that: Appeal specially allowed in certain cases 380.—(1)  The appellate court may, on the application of any person debarred from appealing for non-compliance with any provision of this Code, permit him to appeal against any judgment, sentence or order if it considers it to be in the interests of justice, subject to such terms and conditions as the court thinks fit. … 41 Section 380(1) of the CPC does not prescribe themannerin which an application under it should be made. Therefore, although an application for an extension of time to appeal is usually brought by way of a criminal motion (presumably in the manner provided for by Form 77 in The Schedule of the Criminal Procedure Code (Prescribed Forms) Regulations 2010 (S 811/2010)), there is, in my judgment, nothing which precludes an application for an extension of time to appeal being brought by way of an oral application, at least in exceptional circumstances such as the present. 42 The case law establishes that in determining whether an extension of time to appeal should be granted, the court should apply an analytical framework that has regard to: (a) the length of the delay in the prosecution of the appeal; (b) the explanation put forward for the delay; and (c) the existence of some prospect of success in the appeal (Public Prosecutor v Tan PengKhoon[2016] 1 SLR 713 at [38]). 43 In the present case, the length of the delay in the prosecution of the appeal was no doubt substantial. Even if I gave the respondent the greatest benefit and took reference from the date the decision inSim Yeow Keewas handed down (that is, 29 September 2016), and the date the Prosecution was informed of the respondent’s intention to file a criminal motion to appeal against his sentence out of time (even though no such criminal motion was eventually filed) (that is, 3 March 2017), the delay still amounted to around five months. The respondent offered no explanation for the delay. However, I was also mindful of the reality of the respondent’s situation. As he was in prison at the material time, he might not have been apprised of the development inSim Yeow Keeand might not have had ready access to legal advice on this issue. Furthermore, the prospects of success in the appeal were exceptional (see [10]–[19] and [33]–[35] above). In the circumstances, I was satisfied that the respondent should be granted an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him. Significantly, the Prosecution also made it clear that it was not objecting to the respondent filing an appeal out of time. 44 Accordingly, I was satisfied that the respondent could make an oral application for an extension of time to appeal against the sentence of five years’ CT that had earlier been imposed on him, and that such an extension of time should be granted. I therefore granted the respondent leave to appeal out of time.",
        "Whether the procedural requirements in the CPC could be dispensed with": "45 The procedure governing criminal appeals is set out in Division 1 of Part XX of the CPC. Given how matters had developed, there was no doubt that many of the procedural requirements set out therein were not satisfied. Chief amongst these were the requirements to do with the filing of a notice of appeal (in s 377 of the CPC) and a petition of appeal (in s 378 of the CPC). Notwithstanding all that, s 380 of the CPC provides that: Appeal specially allowed in certain cases 380.—(1)  The appellate court may, on the application of any person debarred from appealing for non-compliance with any provision of this Code, permit him to appeal against any judgment, sentence or order if it considers it to be in the interests of justice, subject to such terms and conditions as the court thinks fit. (2)  The appellate court may, on the application of the accused or his advocate, or the Public Prosecutor, permit an appeal to proceed to hearing without the grounds of decision, if the court considers it to be in the interest of justice and for reasons beyond the control of either party, subject to such terms and conditions as the court thinks fit. 46 Before me, the Prosecution did not take issue with the applicability of s 380 of the CPC. On my part, I was satisfied that s 380 of the CPC allowed the procedural requirements in the CPC (including, especially, the filing of a notice of appeal and a petition of appeal) to be dispensed with. 47 Section 380(1) of the CPC provides that an appeal may proceed notwithstanding non-compliance withanyprovision of the CPC. Additionally, the discretion conferred by this provision is a wide one: the court need only be satisfied that this would be “in the interests of justice”. In my judgment, dispensing with the procedural requirements in the CPC would clearly have been in the interests of justice in the unique circumstances of the present case. Conversely, but equally clearly, insisting on the satisfaction of these procedural requirements in the present case wouldnothave been in the interests of justice. 48 Section 380(2) of the CPC pertains more specifically to dispensing with the grounds of decision. For similar reasons, there was no doubt that the “interest of justice” limb was satisfied. As to the “reasons beyond the control of either party” limb, this was, in my judgment, similarly satisfied. There were no grounds of decision because the Prosecution had mistakenly taken out CR 7 to address a matter that fell properly within my appellate jurisdiction instead. The respondent, on his part, had not applied to appeal out of time since the Prosecution had already filed CR 7. I was therefore satisfied that the absence of any grounds of decision at the time of the hearing on 20 July 2017 was beyond the control of either party. 49 Accordingly, I made an order under s 380 of the CPC dispensing with the need for the respondent to file any other documents. For good order, I also extended this to cover any written submissions which might ordinarily be filed.",
        "The disposition of the appeal": "50 In the circumstances, I was satisfied that my appellate jurisdiction could be exercised at the hearing on 20 July 2017. I therefore treated the appeal as having been heard and, for the reasons set out at [10]–[19] and [33]–[35] above, allowed the appeal. Accordingly, I set aside the sentence of five years’ CT that had earlier been imposed on the respondent and sentenced him instead to a term of imprisonment of time already served. Sundaresh MenonChief Justice Terence Chua and Rimplejit Kaur (Attorney-General’s Chambers) for the petitioner;The respondent in person."
    }
}