{
    "case_title": "BMOvBMP",
    "ncitation": "[2017] SGHC 127",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1 Originating Summons No 501 of 2016 (“OS 501”) is an application filed by the plaintiff, BMO, pursuant to s 10(3) of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the IAA”) opposing the ruling of a sole arbitrator (“the Tribunal”) on his jurisdiction (“Decision on Jurisdiction”) to adjudicate on disputes in an arbitration brought under the auspices of the Singapore International Arbitration Centre Arbitration on 12 March 2015 (“the Arbitration”). The defendant in OS 501 is BMP, a Malaysian incorporated company that was placed in receivership on 30 November 2006, and is acting through individuals appointed as receivers and managers (“the Receivers”).",
        "The dispute": "5 The substantive dispute in the BVI litigation and the Arbitration concerns the defendant’s ownership of the share capital of its subsidiary in Vietnam (“the Vietnam Subsidiary”). The defendant’s complaint against the plaintiff and two individuals, who are brothers and former directors of the defendant, is that through a series of share transfers that took place in 1999, 2007 and 2008 (collectively, “the Share Transfers”), the defendant’s shareholding in the Vietnam Subsidiary was substantially reduced to 0.19% whereas the plaintiff ended up as the major shareholder with 99.7 % interest in the Vietnam Subsidiary. The remaining 0.11% of the share capital is owned by a company incorporated in the British Virgin Islands (“BVI Company 1”). It is the defendant’s case that the brothers were responsible and complicit in the unauthorised and unlawful share transfers that eventually resulted in the plaintiff becoming the majority shareholder in the Vietnam Subsidiary. It is not disputed that, at all material times, the brothers were and are still the shareholders of the plaintiff. I will refer to the brothers individually as Shareholder 1 and Shareholder 2. The plaintiff has one director and he is Shareholder 2. The defendant’s case against the plaintiff is that the latter dishonestly assisted the brothers in respect of the Share Transfers thereby depriving the defendant of the bulk of its shares in the Vietnam Subsidiary. Furthermore, the plaintiff received those shares wrongfully with knowledge of the brothers’ breach of fiduciary duties and breach of trust. 6 The brothers were shareholders in several related companies that were incorporated in Taiwan, and they are identified here as Taiwan Company 1; Taiwan Company 2 and Taiwan Company 3. At all material times, Shareholder 1 was the controlling shareholder of these companies. He was also the Chairman of Taiwan Company 3.",
        "Changes to the Vietnam Subsidiary’s charter": "7 The Vietnam Subsidiary was first incorporated on 30 December 1993, and upon incorporation, a company charter was entered into (“the 1993 Charter”). In the 1993 Charter, the defendant was identified as the sole shareholder of the Vietnam Subsidiary, and was regarded as the defendant’s wholly-owned subsidiary. At all material times, Shareholder 1 was the Chairman of the Vietnam Subsidiary. 8 In February 2008, Shareholder 1 (purportedly acting for the defendant), the representative of the plaintiff and the representative of Taiwan Company 1 caused the Vietnam Subsidiary to be re-registered for the purposes of obtaining an amended investment certificate and changing the Vietnam Subsidiary’s corporate form. A new Charter (“the Revised Charter”) was adopted. The Vietnam Subsidiary, previously a wholly-owned private enterprise, became a limited liability corporation (“LLC”), with the defendant, the plaintiff and Taiwan Company 1 reflected in the Revised Charter as its members. 9 The arbitration agreement sought to be invoked in the Arbitration is Article 22(2) of the Revised Charter. Both the plaintiff and the defendant have adduced separate versions of the Revised Charter which contain differently-worded versions of Article 22(2). The variants of Article 22(2) will be addressed later in this judgment (see [56] below).",
        "Events leading to the Due Diligence Report": "10 The defendant suffered a liquidity crisis in late 1999, and sought from its creditors a moratorium on the repayment of its debt. Eventually, this led to the creditors’ approval of a scheme of arrangement on 25 August 2004. In addition, a debenture dated 27 August 2004 was furnished in favour of the Named Debenture Holder as trustee for the secured creditors. This debenture was subsequently amended. As the defendant’s financial situation did not improve, it was put into receivership on 30 November 2006, pursuant to the terms of the debenture. As stated, the defendant now acts through its Receivers. 11 After 30 November 2006, the Receivers were able to get hold of the defendant’s audited accounts from 1998 to 2005. The Receivers also began the lengthy process of understanding, amongst other things, the defendant company, details of all of the defendant’s assets and liabilities, its physical books and records, as well as its accounting system and internal controls. During this process, the Receivers discovered that there were unexplained reductions in the defendant’s share capital in the Vietnam Subsidiary. There were also other significant non-cash transactions that did not tally with the amounts stated in the defendant’s accounts. These discrepancies prompted the Receivers to commission a legal due diligence report. A Vietnamese law firm, IndoChine Counsel: Business Law Practitioners (“IndoChine Law”), was engaged in the matter. 12 On 3 February 2009, IndoChine Law’s proposed scope of service in respect of the Vietnam Subsidiary was,inter alia, “to obtain corporate records/legal documents related to the Company, including but not limited to: (a) Investment licenses/certificates and any amendments; (b) Company Charteror any amendment; (c) Latest information/documents on the shareholders/members of the Company and directors of the Company”. This proposal was accepted by the Receivers on 5 February 2009. IndoChine Law’s report dated 19 June 2009 (“the Due Diligence Report”) was sent to the Receiver’s under cover of IndoChine Law’s letter on 1 July 2009. 13 Two sections of the Due Diligence Report are relevant to the present application. First, Section 1.4 of Part A states that one of the purposes of the Due Diligence Report was to “[advise] on consequences and legal redress under the laws of Vietnam in respect of the transaction of transfer of the capital from [the defendant] to [the plaintiff] in the view that the authorized representative of the [defendant] is not authorized to act or has acted ultra vires.” The representative of the defendant who was not authorised is none other than Shareholder 1 (see [8] above). 14 Second, Section 6.2 of Part C states, in relation to the transfer of capital from the defendant to the plaintiff, the defendant has “the right to bring this matter to the authorized court/arbitration against such unauthorized representative in order to request the court to consider and judge invalidity of such fabricated capital assignment transaction.” Again, the unauthorised representative is Shareholder 1. 15 Prior to the appointment of IndoChine Law, the Receivers were embroiled for two years in litigation brought by the former directors of the defendant in Malaysia in January 2007 (“the Malaysian litigation”). In that litigation, the Receivers and the debenture holders were sued. The Malaysian litigation was finally struck out on 11 February 2009. 16 The Receivers commenced the BVI litigation on 22 July 2014, five years after the Due Diligence Report. The explanation provided by the Receivers was that the Due Diligence Report raised matters that needed further investigation. For instance, the Receivers needed to find out the individuals behind the plaintiff, a BVI company. The Receivers also had to verify and to confirm that no consideration was given for the Share Transfers. The task was difficult and protracted because the defendant’s corporate documents were disorganised and several of the defendant’s former officers were untraceable after returning to Taiwan. In addition, the Receivers did not know of the whereabouts of the brothers and it was only in 2014 that they learnt of the Hong Kong address of Shareholder 1.",
        "The BVI litigation and the Arbitration": "17 On 22 July 2014, the defendant commenced the BVI litigation against the plaintiff and the two brothers (Shareholder 1 and Shareholder 2) by filing a Claim Form and Statement of Claim with the Eastern Caribbean Supreme Court in the High Court of Justice (Virgin Islands) (Commercial) (“the BVI High Court”). In the Statement of Claim, the defendant alleged that it had suffered loss and damage by being wrongfully deprived of its shareholding in the Vietnam Subsidiary. The causes of action pursued against the brothers included breaches of statutory and fiduciary duties for effecting the Share Transfers, profiting from the transfers and for placing themselves in situations where there was a conflict between their personal interests and the defendant’s interests. In relation to the plaintiff, the defendant’s allegations were that the plaintiff had dishonestly assisted the two brothers in respect of the Share Transfers, knowingly received the defendant’s shares in the Vietnam Subsidiary, and that the plaintiff had thereby been unjustly enriched. 18 In the BVI litigation, the defendant sought the following reliefs. As against the plaintiff solely, it sought an order compelling the plaintiff to return by re-transferring its shareholding in the Vietnam Subsidiary to the defendant. As against the brothers and the plaintiff, it sought compensation in equity, an account of the misappropriated shareholding, an account of sums received in respect of the shareholding, a declaration that the plaintiff held on to any assets and sums received as constructive trustees for the defendant, a declaration that the plaintiff was to reconstitute those assets which it held on trust for the defendant, interests in equity and costs. 19 On 22 July 2014, the defendant made two interlocutory applications. First, it applied for leave to serve the cause papers and ancillary documents on the brothers out of jurisdiction. At the same time, it applied to the BVI High Court for an order restraining the plaintiff from registering any transfer of the brothers’ shareholding in the plaintiff, and from transferring, charging, parting with possession or disposing of any of its interests in the Vietnam Subsidiary (the “Interim Injunction”). In support of the Interim Injunction application, the defendant’s counsel in the BVI filed an affidavit and the exhibits to the affidavit included the Due Diligence Report and its annexures comprised the Revised Charter. Both applications were granted. 20 On 4 November 2011, the plaintiff acknowledged service of the Claim Form and Statement of Claim. There was a questionnaire to be filled on the Acknowledgment of Service form, and one of the questions raised was whether the plaintiff intended to defend the claim. The plaintiff ticked the “YES” box. 21 All the defendants in the BVI litigation then individually filed applications for declarations that the BVI was not the natural or appropriate forum to determine the dispute. Shareholder 2 filed his application on 18 December 2014 and Shareholder 1 followed suit on 6 January 2015. The plaintiff filed a similar application on 18 December 2014, but amended it subsequently on 26 January 2015 to include an application to discharge the Interim Injunction ordered on 22 July 2014 (see [19] above). 22 On 2 February 2015, the defendant sought leave to discontinue the BVI litigation as against the brothers. At that time, the brothers’ stay applications had yet to be heard. The reason for desiring discontinuance was the defendant’s belief that it would be a “better use of resources of the Court for [the defendant] to continue the claim against [the plaintiff] which currently holds the shares in [the Vietnam Subsidiary], the subject of the claim”. On 9 February 2015, the defendant obtained leave of court to discontinue the BVI litigation against the brothers. On that same day, the BVI High Court also heard the plaintiff’s applications for the discharge of the Interim Injunction and for a declaration that the BVI was not the natural and appropriate forum for the disputes to be heard. Both applications were dismissed. 23 On 6 March 2015, the plaintiff filed a fresh application to discharge the Interim Injunction. Its grounds of application were that the Interim Injunction was procedurally irregular, that the defendant’s Statement of Claim disclosed no serious issue to be tried, and that there was no risk of dissipation of assets. The plaintiff also argued that the defendant had no legitimate interest in restricting the ability of the brothers from dealing freely with their shares in the plaintiff since the brothers were no longer defendants in the BVI litigation. 24 According to the Receivers, they came to know about Article 22 of the Revised Charter after the BVI litigation had commenced. Soon after this discovery, the Receivers set the Arbitration in motion by filing a Notice of Arbitration against the plaintiff with the SIAC on 10 March 2015, relying on the arbitration agreement in Article 22(2). In its Notice of Arbitration, the same causes of action pursued in the BVI litigation were raised against the plaintiff (see [17] above). The same reliefs were sought as well. In its Notice of Arbitration, the defendant requested the arbitral tribunal to rule on the question of the Tribunal’s jurisdiction as a preliminary matter in an interim award, before dealing with the merits of the dispute. The Arbitration was deemed to have commenced on 12 March 2015. 25 I pause to observe that, broadly speaking, the facts will show that between March 2015 and March 2016, there were, ostensibly, parallel BVI litigation and SIAC arbitration proceedings. In March 2016, the BVI litigation came to an end after the defendant’s claim had been struck out and an appeal against the discharge of an Interim Injunction was thereby rendered otiose (see [32] below). 26 Returning to the chronology of events, on 13 March 2015, the defendant wrote to the plaintiff stating that notwithstanding its challenge to the validity of the Revised Charter, it accepted that the dispute resolution provision could nonetheless be valid. The defendant proposed that the BVI litigation be stayed pending the outcome of the Arbitration, save for its application for the continuation of the Interim Injunction in support of arbitral proceedings. 27 On 26 March 2015, the plaintiff applied to the BVI High Court for summary judgment on the basis that the defendant had no real prospect of succeeding. The plaintiff applied, in the alternative, for the BVI litigation to be struck out on the basis that no reasonable ground for the claim had been disclosed. This striking-out application was then amended on 11 May 2015 to include the argument that the defendant’s claim was time-barred. The plaintiff’s argument was that the defendant would have been aware or ought to have been aware of the 2008 Share Transfers on or before the board resolution on 12 February 2008 which recorded the transfer of shares from the defendant to the plaintiff. If this was established, the limitation period for the defendant’s claim would have expired on 11 February 2014 – before the matter was brought to the BVI courts. 28 On 20 April 2015, the defendant applied for a stay of proceedings in favour of the Arbitration. The stay application was heard on 18 May 2015, and the BVI court hearing the application reserved judgment. In the interim, the plaintiff’s applications for summary judgment, striking out, and discharge of Interim Injunction were adjourned. 29 Meanwhile, the Arbitration had commenced, and on 19 June 2015, the Tribunal was appointed. On 20 August 2015, the Tribunal issued its First Scheduling Directive, asking for submissions from the parties in relation to the assertion that the defendant had no grounds to bring the Arbitration. The plaintiff filed its submissions on 9 September 2015, the defendant filed its reply on 14 October 2015, and the plaintiff replied to the defendant’s reply submissions on 12 November 2015. 30 On 28 October 2015, the defendant filed a fresh application with the BVI High Court for a continuation of the Interim Injunction, and alternatively, for a fresh injunction to be given on similar terms to support the ongoing Arbitration. On 3 November 2015, the BVI High Court heard the plaintiff’s earlier application for a discharge of the Interim Injunction. The application was granted on 20 November 2015 (“the Discharge Order”). Notably, the defendant did not pursue the application it made on 28 October 2015. 31 Instead, on 11 December 2015, the defendant filed an appeal against the Discharge Order, and applied for the continuation of the Interim Injunction pending the determination of the defendant’s appeal. On 5 January 2016, the plaintiff filed a cross-appeal against certain findings made by the BVI High Court. The appeal against the Discharge Order was heard on 15 January 2016 by the Eastern Caribbean Court of Appeal, and judgment was reserved (see [32] below for outcome). 32 Earlier, on 19 November 2015, the plaintiff applied for security for costs against the defendant for the BVI litigation proceedings. This application was granted on 20 January 2016. The BVI High Court ordered the defendant to pay US$50,000 into court within 21 days (other payment tranches to follow), failing which the claim would be struck out. On 11 February 2016, the defendant applied for an extension of time to make payment for the first tranche and relief from sanction. It eventually made payment for the first tranche on 19 February 2016. The defendant’s application on 11 February 2016 for time extension was dismissed on 22 March 2016. The BVI High Court then struck out the defendant’s claim for non-compliance. Following this, the plaintiff applied to discharge the Interim Injunction (which was still in place pending the outcome of the appeal against the Discharge Order). On 12 May 2016, the Eastern Caribbean Court of Appeal granted the plaintiff’s application for the discharge of the Interim Injunction on grounds that the appeal had been rendered otiose since the claim had been struck out. 33 On 19 April 2016, the Tribunal issued its Decision on Jurisdiction. The Tribunal held that it had jurisdiction and ordered the Arbitration to proceed on the merits of the substantive disputes between the parties pursuant to the arbitration agreement in Article 22(2). On 9 May 2016, the plaintiff sent a letter to the Tribunal informing the Tribunal that it wished to apply to the Singapore High Court under s 10(3) of the IAA for a determination of the Tribunal’s jurisdiction. It also applied to the Tribunal to direct a stay of all further steps in the Arbitration in the interim. On 19 May 2016, the plaintiff filed OS 501. On 23 May 2016, the Tribunal rejected the plaintiff’s application to stay the Arbitration. The plaintiff then applied to the Singapore High Court by way of Summons No 2885 of 2016 to obtain a stay of the Arbitration pending this court’s decision on the Tribunal’s jurisdiction. The parties eventually agreed by consent not to proceed with the Arbitration pending this court’s decision on OS 501.",
        "Preliminary matters": "34 There are a few preliminary matters that are best raised at the outset, foremost of which ought to be the governing law of the arbitration agreement because the law of the arbitration agreement applies to the contentions raised by the plaintiff, which include arguments on the scope, breach and waiver of Article 22. The second is the plaintiff’s argument that the defendant should not be allowed to approbate and reprobate –ie, that it should not be allowed to challenge the validity of the Revised Charter in one breath, and rely on Article 22 in another. The third is the issue of the scope of Article 22(2). And finally, before transiting to the principal question which I have framed at [2], I will deal with the question of whether the arbitration agreement is mandatory, which involves a discussion on what the authoritative version of Article 22 is.",
        "Governing law of the arbitration agreement": "35 I now turn briefly to the law governing Article 22, the arbitration agreement. Normally, a three-stage enquiry is employed to determine the governing law of arbitration agreements: first, whether an express choice was made; second, in the absence of an express choice, whether an implied choice was made; and third, where parties had not made any choice, the proper law would be the law that the arbitration agreement has the closest and most real connection with:SulAmérica Cia Nacional de Seguros SA and others v Enesa Engelharia SA and others[2013] 1 WLR 102 (“SulAmérica”) at [9] and [25]. 36 In oral submissions made on 6 February 2017, Mr Philip Jeyaretnam SC (“Mr Jeyaretnam”) accepted that there was no express governing law clause in the Revised Charter and asserted that Vietnamese law would apply to theRevised Charteras the Revised Charter was a constituent document of a Vietnamese company. Counsel did not elaborate, but presumably he had in mind the parties’ implied choice of the governing law. The question that remains is what the governing law was for thearbitration agreementin Article 22(2) of the Revised Charter. In my view, the parties had made an implied choice that it would be Vietnamese law as well. 37 At the outset, I note that courts have adopted divergent approaches to the issue of the parties’ implied choice of law for the arbitration agreement. On the one hand,SulAméricastands for the proposition that there is a rebuttable presumption that the implied choice would be theexpresslychosen law of the substantive contract (at [26]). On the other hand, inFirstLink Investments Corp Ltd v GT Payment Pte Ltd and others[2014] SGHCR 12 (“FirstLink”), the Court took the position that in a competition between an expressly chosen substantive law and the law of the chosen seat of arbitration, it is the law of the chosen seat that prevails (at [16]). 38 InBCY v BCZ[2016] SGHC 249 (“BCY v BCZ”), Steven Chong J (as he then was) considered the two competing approaches and preferredSulAméricatoFirstLink.He found thatSulAmérica’sapproach was supported by the weight of authorities and preferable as a matter of policy (at [49]–[65]). In the subsequent decision ofDyna-Jet Pte Ltd v Wilson Taylor Asia Pacific Pte Ltd[2017] 3 SLR 267 (“Dyna-Jet (HC)”), Vinodh Coomaraswamy J followedSulAmérica, commenting that it would be “unduly parochial” to apply Singapore law merely because a stay application was made to a Singapore court (at [31]). Instead, he found the express choice of the substantive law to be the parties’ implied choice of law for the arbitration agreement. 39 Chong J’s endorsement ofSulAméricainBCY v BCZprovides useful guidance for courts tasked with determining the law governing arbitration agreements. But in the present case, the Revised Charter does not fit neatly into theSulAméricaanalysis for there was no express provision specifying the substantive law applicable to the underlying agreement. Instead, there were references to Vietnamese law in respect of employment matters (Article 27) and purchase of insurance from a foreign insurer approved under Vietnamese law (Article 28). Although these provisions do not operate as an express choice of law for the entire Revised Charter, it is unlikely that that the parties would intend for different laws to govern different parts of the Revised Charter, and these provisions therefore indicate that the parties impliedly chose Vietnamese law for the Revised Charter. Undergirding theSulAméricaapproach is the consideration that “parties intended the arbitration agreement to be governed by the same system of law as the substantive contract”:SulAméricaat [25]. Since the parties have chosen Vietnamese law to govern the Revised Charter, I find that the parties would have impliedly chosen Vietnamese law for Article 22(2) as well. 40 The fact that the seat of the arbitration is Singapore does not change my finding. First, it should be noted that BMP and BMO had not expressly indicated a seat of choice, and that the seat of the Arbitration was presumed to be Singapore in the absence of parties’ agreement by operation of Rule 18.1 of the SIAC 2013 rules. In this sense, this case is slightly removed from a scenario where parties had chosen the arbitral seat (this was also the case inFirstLink). Further, as I have noted above, the stance taken by the Assistant Registrar inFirstLinkhas not been followed in subsequent High Court decisions. Finally, I note that even inFirstLink, the Assistant Registrar had cautioned that “the determination of the implied proper law ultimately remains a question of construction; each case will have to turn on its own facts” (at [16]). I reiterate that the facts of the present case point towards Vietnam law instead. 41 I pause to note that the Tribunal had cited the decision ofHabasSinai Ve Tibbi Gazlar Istihsal Endustrisi AS v VSC Steel Company Ltd[2013] EWHC 4071 (Comm) (“VSC Steel Company”) in its Decision on Jurisdiction. In that case, Nicholas Hamblen J commented that in the absence of an express choice of law in the main contract,the applicable law of the arbitration agreement would be that of the seat(at [103]). However, Hamblen J’s comment at [103] ofVSC Steel Companymust be read in light of [101] and [104] which clarify that his analysis relates to the third stage –ie, the identification of the law with the closest and most real connection with the arbitration agreement. Since I find that there was an implied choice made by the parties, there is no need to proceed to the third stage of enquiry. 42 No evidence was led to prove the content of Vietnamese law even though Mr Jeyaretnam submitted that Vietnamese law should apply. Both sides were content to proceed on the basis that Vietnamese law was the same as Singapore law. As nothing appears to turn on this, I say no more on this matter.",
        "Withdrawal of the defendant’s challenge to the validity of the Revised Charter": "43 In the Statement of Claim filed in the BVI litigation and the Notice of Arbitration, the Receivers’ position was that after their appointment, Shareholder 1 was no longer a director of the defendant and he had no authority to deal with the defendant’s shareholding in the Vietnam Subsidiary. As such, the Revised Charter was not validly entered into. Before me, it was strongly argued that the defendant must not be allowed to approbate and reprobate by invoking Article 22, a provision contained within the Revised Charter itself. The principle of separability would not save Article 22 because the very reason for the invalidity of the parties’ underlying agreement – the lack of authority to enter into the Revised Charter – infected Article 22 as well. 44 I should mention that it was after Mr Jeyaretnam’s submissions on 6 February 2017 that counsel for the defendant, Ms Yogarajah Yoga Sharmini (“Ms Sharmini”) informed the court of her instructions not to challenge the validity of the Revised Charter in OS 501 and in the Arbitration. This change removes the foundational premise of Mr Jeyaretnam’s reliance on the doctrine of approbation and reprobation and this issue has now become moot. If, however, the doctrine of approbation and reprobation was a live issue, there is merit to Mr Jeyaretnam’s submissions that the defendant’s attack on the validity of the Revised Charter could not be dissociated from an attack on the validity of Article 22, the arbitration agreement. His reliance onPremium Nafta Products Limited and others v Fili Shipping Company Limited and others[2007] UKHL 40 (“Premium Nafta”) is relevant and persuasive. In that case, Lord Hoffmann held at [17] that there may be cases in which the ground upon which the main agreement is invalid is identical with the ground upon which the arbitration agreement is invalid. In such cases, an attack on the validity of the main agreement is also an attack on the arbitration agreement.",
        "Scope of Article 22(2)": "45 As stated, the plaintiff has changed the position it had taken previously before the Tribunal to now argue in OS 501 that that the claims raised by the defendant in the Arbitration do not fall within the ambit of Article 22(2). This is an interesting development because it is inconsistent with the plaintiff’s arguments on waiver, breach and estoppel (see [3] above). If a dispute fell outside the scope of the arbitration agreement, how could it be said that a party, by commencing litigation in respect of that said dispute, would be breaching or waiving the arbitration agreement? The only way to make sense of Mr Jeyaretnam’s arguments is that the scope of Article 22(2) is only a consequent subsidiary question to be explored if there is a finding that there was a binding arbitration agreement. However, I propose to deal with the scope of Article 22(2) at the outset because it is a short point that can be disposed of fairly easily. It was also the approach taken by Mr Jeyaretnam at the hearing before this court. 46 It is incontrovertible that the plaintiff may raise a different argument at thede novohearing before this court reviewing an arbitral tribunal’s decision on jurisdiction under s 10(3) of the IAA. InPT Tugu Pratama Indonesia v Magma Nusantara Ltd[2003] 4 SLR(R) 257, Judith Prakash J (as she then was) heard a similar application under Art 16(3) of the UNCITRAL Model Law on International Commercial Arbitration. Prakash J held (at [18]) that “parties are not limited to rehearsing before the court the contentions put before the tribunal butare entitled to put forward new arguments on the issue and the court is entitled to consider these” [emphasis added]. 47 As regards the scope of Article 22(2), the points of contention essentially relate to: (a) the subject matter of the dispute; (b) the fact that the Share Transfers predated the Revised Charter; and (c) the fact that the brothers were not parties to the arbitration agreement. 48 There is nothing to point (c). I will move on to point (a),ie, that the claims in the Arbitration are unrelated to the Revised Charter, which is an agreement governing the constitution of the Vietnam Subsidiary and the parties’ rights as shareholders in respect of the operations of the Vietnam Subsidiary. The plaintiff’s contention is that the defendant should invoke the jurisdiction clause contained within the agreements documenting the impugned Share Transfers instead. The plaintiff further argues that the defendant did not identify a term or obligation under the Revised Charter which it alleges was breached when the Share Transfers took place. 49 The present dispute in the Arbitration is between the defendant and the plaintiff as members of the Vietnam Subsidiary. I accept the defendant’s contention that the dispute is tied to Article 7 of the Revised Charter, which sets out the plaintiff’s shareholding of the members of the Vietnam Subsidiary on the date of the Revised Charter. Article 7 is a clause titled “Charter Capital – Contribution Capital”. It sets out the Vietnam Subsidiary’s Charter capital and the respective capital contribution of the parties. Each member to the Revised Charter held a share of the Vietnam Subsidiary that was proportional to their capital contribution. 50 In my view, the purpose of the Revised Charter was notonlyto registerthe Vietnam Subsidiary and reflect its new legal status as a LLC, but also to reflect a joint venture arrangement binding the members of the Vietnam Subsidiaryinter se. This can be gleaned not only from Article 7 but also Article 4 of the Revised Charter – the “Scope of Business” clause which sets out an extensive list of the company’s objects. As Ian Hewitt notes inHewitt on Joint Ventures(Sweet & Maxwell, 5th Ed, 2011) at para 2–45, the principal documentation for corporate joint ventures typically includes a joint venture agreement or shareholders’ agreementtogether with the relevant constitutional document establishing the joint venture company. Seen in this light, there is a sufficient nexus between the subject matter of the dispute,ie, share transfers between members of a joint venture made in breach of and/or fiduciary duties and the subject matter of the Revised Charter, a document forming part of the contractual framework of the joint venture. For all these reasons, I find that the dispute in the Arbitration is related to the Revised Charter and within the meaning of the phrase “[a]ll arising disputes” in Article 22(2) (see generallyDalian Hualiang Enterprise Group v Louis Dreyfus Asia Pte Ltd[2005] 4 SLR(R) 646 at [29];Tjong Very Sumito v Antig Investments Pte Ltd[2009] 4 SLR(R) 732 (“Tjong Very Sumito”) at [23] and [33]). 51 A related observation is the overarching recognition of arbitration as a form of dispute resolution. In this regard, it is important to bear in mind the approach of the Singapore courts in construing the scope of arbitration agreements. As V K Rajah JA commented inLarsen Oil and Gas Pte Ltd v Petroprod Ltd (in official liquidation in the Cayman Islands and in compulsory liquidation in Singapore)[2011] 3 SLR 414 (“Larsen Oil”) at [19], the courts favour the view that arbitration clauses should be generously construed such that all manner of claims, whether common law or statutory, should be regarded as falling within their scope unless there is good reason to conclude otherwise. This broad approach was subsequently affirmed by the Court of Appeal inRals International Pte Ltd v Cassa di Risparmio di Parma e Piacenza SpA[2016] 5 SLR 455 at [30]. 52 It follows as a matter of construction that the plaintiff’s second contention (point (b)) − that the first two tranches of Share Transfers (in 1999 and 2007) were transactions before the parties adopted the Revised Charter in February 2008 and were not disputes arising from the Revised Charter − is without merit. For one, Article 7 relates to the plaintiff’s total shareholding registered in its name which has nothing to do with when the majority stake was acquired. The complaint is that the defendant lost the bulk of its shareholding in the Vietnam Subsidiary. Such a claim would only have fully accrued after the Revised Charter was adopted and would come within the phrase“[a]ll arising disputes” in Article 22(2). Further, the argument that the scope of an arbitration agreement must necessarily be temporally confined to claims that accrue post-contractual formation is untenable. I accept the views expressed by Simon Greenberg, Christopher Kee, and J Romesh Weeramantry inInternational Commercial Arbitration: An Asia-Pacific Perspective(Cambridge University Press, 2011) at para 4.130: For something to arise out of a contract it was argued that it must have occurred post-contractual formation. If such a timing requirement existed then pre-contractual claims would fall outside the scope of that phrase in an arbitration agreement.Such an interpretation of an arbitration agreement would be devoid of common, commercial sense. Where commercial parties agree to arbitrate,the presumed desire is for all of their claims – pre-contractual or post-contractual – arising in any way from that relationship to be decided by arbitration. It is very unlikely that they would want to be engaged in a process where some claims relating to a dispute are resolved by a court and other claims in that dispute are determined by arbitration. Such an inefficient and unduly complex process should be avoided. [emphasis added] 53 The plaintiff’s argument that transfers occurring before the Revised Charter of February 2008 could not logicallyarise out ofthe same deserves further scrutiny. Article 22(2) of the Revised Charter uses the phrase “all arising disputes”, which could arguably refer to all disputes “arising under”, “arising out of”, “in connection with”, “connected with” or “relating to” the Revised Charter. In relation to the latter three possibilities, I note the High Court’s finding inManiach Pte Ltd v L Capital Jones Ltd and another[2016] 3 SLR 801 that the phrase “connected with” was capacious enough to include any subject matter with aprima facieconnection with the arbitration agreement, including what did not “arise under” a contract (at [145]). This finding was undisturbed by the Court of Appeal inL Capital Jones Ltd and another v Maniach Pte Ltd[2017] 1 SLR 312. 54 In any case, even if the phrase “[a]ll arising disputes” is construed to include disputes “arising under” or “arising out of” the Revised Charter, these phrases have been read expansively to covereverydispute except disputes relating to whether there was even a contract (or Revised Charter in this case) at all (seeFiona Trust & Holding Corporation and others v Yuri Privalov and others[2007] EWCA Civ 20 at [18]; David St John Sutton, Judith Gill and Matthew Gearing,Russell on Arbitration(Sweet & Maxwell, 23rd Ed, 2007) (“Russell on Arbitration”) at para 2-078). 55 All said, the words “all arising disputes” in Article 22(2) have a wide ambit and should be liberally construed so as to further the intent that the disputes should be susceptible to the forum chosen for the resolution of disputes. In my view, Article 22(2) is wide enough to extend to disputes between the members that are not directly premised on the rights and duties created by the Revised Charter. The claims brought by the defendant therefore fall within the ambit of Article 22(2).",
        "Is the agreement to arbitrate mandatory?": "56 Another related matter of concern is the authoritative version of Article 22. The determination of the matter will swiftly resolve the question as to whether the agreement to arbitrate is mandatory or not. 57 The defendant produced an uncertified and unofficial English translation of a Vietnamese version of Article 22. On the other hand, the plaintiff produced an English version of Article 22 that is found in the official Revised Charter lodged with the Vietnamese authorities. That official English version of Article 22 provides as follows: Article 22: Disputes settlement 1.  All arising disputes shall be first settled through amicable negotiation among the Parties; 2.  If no settlement is reached, the disputes shall be submitted by any Party for final settlement to Singapore International Arbitration Centre (“SIAC”) in accordance with the Rules of laws of SIAC. The award of the arbitrators is final and binding. In contrast, the defendant produced an uncertified translated version of the official Vietnamese version in the English language, and the translation reads: Article 22: Settlement of Disputes 1.  Disputes between the Members of the Company and between Members with the Company should be firstly resolved through negotiations and conciliation. 2. In the case the Members cannot negotiate and conciliate, the dispute may be entered into the Singapore International Arbitration Center (“SIAC”) for settlement under the rules of the SIAC. The decision of the arbitrator shall be final and binding. 58 The main difference between the two versions is in the usage of the word “shall” meant to impose a mandatory obligation to arbitrate and the operative word in the defendant’s version that used the more permissive “may” instead. 59 It bears mention that the plaintiff’s version is also identical to an English translation of the official Vietnamese version of the Revised Charter certified by a Vietnamese law firm, Gia Linh Law Corporation. The Tribunal made no finding as to whose version of Article 22 is authoritative. In my view, the plaintiff’s version is preferred because it is the official version in the English language lodged with the Vietnamese authorities. Article 33 of the Revised Charter (both the defendant’s and the plaintiff’s version of Article 33 are similar), an implementing provision which deals with conflict between “language versions” of clauses: This Charter includes 6 chapters, 33 articles and shall be made in five (5) original counterparts in both Vietnamese and English languages. All these counterparts have the same validity. In case of any conflict between the two language versions, the English version shall prevail. 60 Article 33 patently states that in a conflict between theofficialEnglish version and theofficialVietnamese version of a particular clause, it should be the English version that prevails. The intent of Article 33 would be defeated if the defendant’s version – atranslation of the official Vietnamese version– is preferred to the official English version of the Revised Charter merely because it was translated. I therefore find the plaintiff’s version of Article 22 to be the authoritative version. 61 I pause to note the significance of this finding. Both parties cited the Privy Council decision inAnzen Limited and others v Hermes One Limited[2016] UKPC 1 (“Anzen Limited”). In that case, the Privy Council held that the silent concomitant of using the words “should” or “shall” is that “neither party will seek any relief in respect of such disputes in any other forum” (at [12]). It would therefore be a breach of contract to litigate. However, when parties choose to use the phrase “any party may submit the dispute to binding arbitration”, these words would be purely permissive, leaving it open to one party to commence litigation, but giving the other party the option of submitting the dispute to binding arbitration nonetheless, such option being exercisable by making an unequivocal request to that effect or by applying for a corresponding stay (at [34]). Hence, on the defendant’s version of Article 22(2), the commencement of the BVI litigation in and of itself would not be a contractual breach, let alone arepudiatory breach(see [91] below). 62 InAnzen Limited,WSG Nimbus Pte Ltd v Board of Control for Cricket in Sri Lanka[2002] 1 SLR(R) 1088 (“WSG Nimbus”) was cited in support of the position that the word “may” is not to be seen as mandatory (at [30]). It should be emphasised, however, that Lee Seiu Kin JC (as he then was) inWSG Nimbusdid not think that the word “may” in the arbitration agreement is merely permissive in meaning– instead he held that a holistic approach ought to be adopted. He held (at [21]): In my view, this submission hinges on taking the word “may” out of the context of cl 19 and, after associating that word with notions of discretion and a lack of any mandatory meaning, these notions are then linked with the word “arbitration” to arrive at the conclusion that there is no compulsory arbitration clause.But in order to arrive at the proper construction of cl 19 it is necessary to consider the provision in its entirety and see how the words relate to one another to convey the intention of the parties…[emphasis added] 63 I agree that the meaning of the arbitration agreement or the dispute resolution clause has to be ascertained by considering the clause in its entirety, and against its surrounding context. While the choice of “may” or “shall” in the arbitration agreement is undoubtedly a useful starting point for the question as to whether arbitration is intended to be the parties’ exclusive dispute resolution mode of choice, departure from this starting position is warranted where there is clear indication that parties intended otherwise. The decision by Wayne Martin CJ inPipeline Services WA Pty Ltd v ATCO Gas Australia Pty Ltd[2014] WASC 10 (“Pipeline Services”) provides an illustration of this point. InPipelineServices, the court held that arbitration was an exclusive option notwithstanding the fact that the arbitration agreement in question (cl 25.4 of a contract to install underground pipelines in Yanchep) contained the phrase “either partymayby notice to the other party refer the dispute to arbitration”. Noting that Clause 25.1(b) of the same contract provided that “[u]nless a party has complied with this Clause 25 that party may not commence court proceedings relating to any dispute under this Agreement”, Martin CJ held that if a party decides not to refer the dispute to arbitration, it cannot thereafter commence court proceedings relating to that dispute – arbitration was, in that sense, mandatory (at [66]). 64 Returning to Article 22(2) and the finding that the plaintiff’s version is authoritative, the starting point is that Article 22(2) is mandatory and exclusive in the sense that if a party wishes to bring a dispute after negotiations to settle failed, it has to arbitrate (seeAnzenat [12]). Nothing in the Revised Charter or in the surrounding circumstances suggests otherwise. I am not required to deal with Article 22(1) since it was not an issue in OS 501.",
        "Is the arbitration agreement inoperative?": "65 The contractual right at issue is Article 22(2). The plaintiff’s contention is that an arbitration agreement may be rendered inoperative if the right to arbitrate is waived, or where the arbitration agreement is repudiated. The plaintiff also raised estoppel which is said to have been brought about by the representation of the defendant communicated to and acted upon by the plaintiff that the right to arbitrate would not be asserted.",
        "Waiver": "66 The plaintiff’s contention is that by commencing the BVI litigation, the defendant adopted a position that was inconsistent with the right to proceed to arbitration. Between the right to litigate in the BVI High Court and the right to proceed to arbitration in accordance with Article 22(2), the defendant had elected for the former and had thereby waived its right to arbitrate. Article 22(2) is therefore inoperative. The plaintiff’s argument is premised solely on “waiver by election”. 67 Before addressing the parties’ arguments, I start with some observations on the terms “waiver”, “election”, and “waiver by election” that were used in their respective submissions. In elucidating these concepts, it will become apparent that it is not appropriate for the plaintiff to raise the doctrine of waiver, or as the defendant puts it, the doctrine of waiver is not open to the plaintiff in the present case. Election as a response and the element of choice 68 The case ofAero-Gate Pte Ltd v Engen Marine Engineering Pte Ltd[2013] 4 SLR 409 (“Aero-Gate”) provides a useful starting point. InAero-Gate, Coomaraswamy J, citing Sean Wilken QC & Karim Ghaly,The Law of Waiver, Variation, and Estoppel(Oxford University Press, 3rd Ed, 2012) (“Wilken & Ghaly”), described waiver as a “voluntary or intentional relinquishment of a known right, claim or privilege”, an “informed choice manifested in unequivocal conduct”. Coomaraswamy J also observed that waiver could be classified into four types (at [39]). One of them is “waiver by election”. 69 For this type of waiver, “waiver” and “election” share an immediate and intimate link: theconsequenceof election, if established, is the abandonment,ie,the waiver, of a right (seeWilken & Ghalyat para 4.01). A party given a choice between two concurrent inconsistent rights (“X” and “Y”) waives Xbyelecting Y. 70 The leading authority on waiver by election isMotor Oil Hellas (Corinth) Refineries SA v Shipping Corporation of India (The “Kanchenjunga”)[1990] 1 Lloyd’s Rep 391 (“The Kanchenjunga”). Lord Goff of Chieveley held at 397–398: It is a commonplace that the expression “waiver” is one which may, in law, bear different meanings. In particular, it may refer to a forbearance from exercising a right or to an abandonment of a right.Here we are concerned with waiver in the sense of abandonment of a right which arises by virtue of a party making an election. Election itself is a concept which may be relevant in more that [sic] one context.In the present case, we are concerned with an election which may arise in the context of a binding contract, when a state of affairs comes into existence in which one party becomes entitled, either under the terms of the contract or by the general law, to exercise a right, and he has to decide whether or not to do so. His decision, being a matter of choice for him, is called in law an election. Characteristically, this state of affairs arises where the other party has repudiated the contract or has otherwise committed a breach of the contract which entitles the innocent party to bring it to an end, or has made a tender of performance which does not conform to the terms of the contract. But this is not necessarily so. [emphasis added] This holding quoted above was cited with approval in the Court of Appeal decision ofChai Cher Watt (trading as Chuang Aik Engineering Works) v SDL Technologies Pte Ltd and another appeal[2012] 1 SLR 152 at [33]. 71 There is noelectionto speak of when there is no choice to be exercised. There is only election “when a party with knowledge of its rights chooses between two inconsistent rights, this element of choice being essential” (seeWilken & Ghalyat para 6.04). The elements that must be satisfied for the doctrine of waiver by election to be invoked are fairly uncontroversial as enunciated inThe Kanchenjunga(at 398): … where with knowledge of the relevant facts a party has acted in a manner which is consistent only with his having chosen one of the two alternative and inconsistent course [sic] of action then open to him – for example, to determine a contract or alternatively to affirm it – he is held to have made his election accordingly… But of course an election need not be made in this way. It can be communicated to the other party by words or conduct; though, perhaps because a party who elects not to exercise a right which has become available to him is abandoning that right, he will only be held to have done so if he has so communicated that election to the other party in clear and unequivocal terms. 72Wilken & Ghalyalso suggests that waiver by election is, strictly speaking, aresponse,ie, the waiving party must beput to electionby a set of circumstances, which would typically be present when there is a breach of contract (at para 4.36). It follows that waiver by election focuses on the conduct of theinnocent partyafter thewrongdoing party’sbreach of contract. The choice between the two inconsistent rights that arise, by operation of law, after a contractual breach belongs to theinnocent party. From this perspective, waiver by election is, as a matter of law, rightfully for thewrongdoing partyto assert against theinnocent party, and not the other way around (see generallyThe Kanchenjungaat 397–398;Aero-Gateat [42]). 73 In the context of arbitration, the doctrine of waiver by election arises frequently in stay applications – the potential line of argument being that if one party commenced litigation proceedings in breach of the arbitration agreement and the counterparty took steps in the litigation, the counterparty may be said to havewaived its right to insist on arbitration, having elected – by its conduct – to litigate instead (see generally s 6(1) of the IAA;Tjong Very Sumitoat [53]). This was an observation made by the Tribunal as well at [116] of its Decision on Jurisdiction. 74 Significantly, this case is not about an application to stay proceedings. Instead, the party who initially breached the agreement to arbitrate is now re-asserting the right to compel the counterparty to arbitrate. As I have earlier stated, waiver by election is available only when there is an element ofchoiceand only as aresponse(typically, in relation to a contractual breach). On the facts of this case, there is noelectionto speak of that is available to the defendant as the party in breach of Article 22(2) since the inconsistent rights (affirmation or termination after the breach) reside with the innocent party who is the plaintiff. It also follows that the defendant had never beenputto election. 75 The plaintiff citedGranville Shipping Co v Pegasus Lines Ltd[1996] 2 FCR 853 (“Granville”) in support of its proposition that the defendant’s commencement of the BVI litigation proceedings amounted to a waiver is unhelpful. In that case, plaintiff (A) sought to refer a counterclaim to arbitration after commencing an action in the Federal Court of Canada. The arbitration agreement in question contained language stipulating a mandatory obligation to arbitrate. The court noted that plaintiff (A) had, by its own volition, chosen to litigate and cannot now request that the counterclaim be sent to arbitration – “[i]n essence, [plaintiff (A)] has waived its right to request a reference to arbitration” (at [24]). For the reasons stated above, I do not accept thatGranvilleis correct on this point. In any case, the facts are dissimilar since plaintiff (A) inGranvilledid not seek to refer the entire dispute to arbitration. Given the differences in procedural history, it is difficult to draw parallels. 76 In my judgment, the plaintiff’s argument on waiver by election fails for the reasons set out above. 77 Mr Jeyaretnam’s principal argument was on waiver by election, but I note that there can be aunilateralwaiverof a right if the right is entirely to the benefit of the waiving party. Unilateral waiver is referred to as another type of waiver (seeWilken & Ghalyat para 4.36). To illustrate, the arbitration clause inDyna-Jet (HC)can be characterised as a unilateral option to arbitrate, and the commencement of litigation proceedings could be regarded as a waiver of that option. The operative words of the relevant arbitration clause are as follows: … [i]f no amicable settlement is reached through discussions, at the election of Dyna-Jet, the dispute may be referred to and personally settled by means of arbitration proceedings, which will be conducted under English Law; and held in Singapore. 78 The Court of Appeal inWilson Taylor Asia Pte Ltd v Dyna-Jet Pte Ltd[2017] SGCA 32 (“Dyna-Jet (CA)”) agreed with the High Court that the clause constituted a valid agreement to arbitrate even though the clause entitled only Dyna-Jet but not Wilson Taylor to compel the other to arbitrate a dispute. The optionality characteristic of the clause meant that the clause existed as an option that Dyna-Jet alone could choose to invoke. The obvious distinction betweenDyna-Jet (CA)and the present case is that the defendant did not enjoy such a unilateral option since Article 22(2) is clearly for the benefit of the Vietnam Subsidiary and its members or between the membersinter se. What this means is that the contractual right as in the present case cannot be unilaterally relinquished by one party (ie,the defendant) without the other party’s consent (ie, the plaintiff’s):AAY v AAZ[2011] 1 SLR 1093 at [127]. In the absence of mutual consent, non-compliance of the term by one party is tantamount to a breach of contract. This is the issue I will discuss in the “Repudiation” section below. The element of knowledge 79 My finding that the doctrine of waiver by election is not open to the plaintiff disposes of the “waiver” argument. But for the sake of completeness, I will touch on the element of knowledge in the doctrine seeing that there were extensive arguments on the defendant’s requisite knowledge of Article 22(2) at the time it commenced the BVI litigation. I wish to make clear that in discussing the breach of Article 22(2) in [78] above, the working proposition proceeded on is that even if one of the parties does not know that the contract contains the arbitration clause in question or does not understand its consequences, the party will still be required to arbitrate disputes so long as there is a binding agreement to arbitrate between them. This perspective is different and it is to be distinguished from the element of knowledge under the doctrine of waiver. 80 I start with the standard of knowledge that has to be met for the doctrine to apply. The plaintiff took the view that either actual knowledge (including the standard of wilful blindness) or constructive knowledge would suffice. 81 Actual knowledge, in juxtaposition with constructive knowledge, refers to a situation where a person “must have known” as opposed to “should have known”. Actual knowledge” may be shown by using direct evidence, but it may also be inferred from all the surrounding circumstances:Chwee Kin Keong v Digilandmall.com Pte Ltd[2005] 1 SLR(R) 502 (“Digilandmall”) at [41]. The court has to go through a process of reasoning where it considers what a reasonable person, placed in a similar situation, would have known. Phrases such as “must have known”, “could not reasonably have supposed” are evidential factors or reasoning processes that the court may rely on. Put simply, it is only where the circumstances are such that the defendant “must have known” and not “should have known” will an inference of actual knowledge be permitted. Further, Nelsonian knowledge – or shutting one’s eyes to the obvious – can be regarded as actual knowledge too (seeDigilandmallat [35] and [42]). I agree with Ms Sharmini that actual knowledge and not constructive knowledge is required. (1) Attribution generally 82 It was argued that the Revised Charter was a public document filed with the Vietnamese Licensing Authority, and that since the defendant was a party to the Revised Charter and a shareholder in the Vietnam Subsidiary, the defendant could not disclaim knowledge of the Revised Charter’s contents. The plaintiff further argued that since the defendant was no longer challenging the validity of the Revised Charter, the defendant as a company must be taken to have known about Article 22 even if the Receivers did not know of Article 22 as claimed. There is nothing to this line of argument simply because as far as a corporate entity is concerned, it is necessary to point to the knowledge of a category of persons or an identified person before determining whether, as a matter of law, that knowledge also counts as the company’s via a process known as “attribution”. The plaintiff’s argument stops short of identifying who in the defendant company knew about Article 22 and whose knowledge should be regarded, as a matter of law, as the defendant’s knowledge. Obviously, the plaintiff would not point to the board of directors as the former directors had been replaced by the Receivers much earlier. In the present case, there was no reference to, let alone reliance on, the identification doctrine (also known as “the directing mind and will” or “alter ego” doctrines) which is another means by which a person’s knowledge may be attributed to the company. 83 Besides the identification doctrine, the rules of agency is a common means by which knowledge of the agent is to be regarded as the knowledge of the corporate principal. The position is stated inBowstead & Reynolds on Agency(Sweet & Maxwell, 20th Ed, 2014) at para 8-207: The law may impute to a principal knowledge relating to the subject matter of the agency which the agent acquires while acting within the scope of his authority. 84 It can be gathered from the thrust of Mr Jeyaretnam’s argument that he was relying on the rules of agency to attribute knowledge to the Receivers via what the defendant’s BVI Counsel supposedly knew. Mr Jeyaretnam contended that the defendant’s BVI Counsel had, in one of her affidavits filed in support of the defendant’s applications for service out of jurisdiction and an interim injunction, exhibited, amongst other documents, the Due Diligence Report and the Revised Charter. In doing so, as a matter of procedural law, the BVI Counsel would be deemed to know the contents of the exhibits, and in particular Article 22. The plaintiff relied on the proposition that where a deponent of an affidavit signs it, he or she is deemed to have signed all the documents exhibited to it as well (seeJet Holding Ltd v Cooper Cameron (Singapore) Pte Ltd[2006] 3 SLR(R) 769 at [36] (“Jet Holding”);In re Hinchliffe[1895] 1 Ch 117 at 120). The BVI Counsel’s affidavit was sworn on 22 July 2014. The BVI litigation proceedings were commenced on that very same day. The plaintiff submitted that on those facts, the BVI Counsel, and by extension the defendant, would have had knowledge of Article 22, at the very latest before it started the BVI litigation. 85 The BVI Counsel had filed an affidavit in these proceedings stating that she had not noticed Article 22 and it was overlooked in the course of preparing the papers for the BVI litigation. Ms Sharmini urged this court to accept the evidence of the BVI Counsel. She observed that in written submissions tendered on 15 September 2014 for the applications for service out of jurisdiction and interim injunction, the BVI Counsel had stated her belief that the BVI High Court alone had personal jurisdiction over the plaintiff. That was her submissions despite the inclusion of the Due Diligence Report and Revised Charter in one of the supporting affidavits. Ms Sharmini’s point is that the BVI Counsel, as she had truthfully claimed, was not aware of Article 22, when she submitted on jurisdiction to the BVI High Court. If she knew of Article 22, the BVI Counsel would have knowingly misrepresented to the BVI High Courts what was plainly untrue; and there was really no reason for her to lie. I agree with Ms Sharmini. I accept the improbability of the BVI Counsel lying at the expense of her professional reputation. There was no ostensible motive to lie to begin with. Besides, the probability that the BVI Counsel could have overlooked Article 22 was reasonable and not far-fetched. My conclusion is that the BVI Counsel had no actual knowledge of Article 22 at the time the BVI litigation was commenced. The proposition inJet Holdingis a legal imputation which would satisfy the notion of “constructive knowledge” but not “actual knowledge”. I have earlier concluded that “actual knowledge” is required to satisfy the element of knowledge for waiver by election to apply (see [81] above). The proposition inJet Holdingwill not assist the plaintiff. As stated, it is only where the circumstances are such as to conclude that the defendant “must have known”, and not “should have known”, will an inference of actual knowledge be permitted. 86 Even if I had arrived at the opposite conclusion that the BVI Counsel had known all along about Article 22 and had deliberately misrepresented to the BVI High Court on jurisdiction, it is arguable that the BVI Counsel’s knowledge of the existence of Article 22 would not be attributed to the defendant. This is because under the rules of agency, an agent’s misrepresentation would have been tantamount to an agent’s breach of duty owed to the principal (see the exception inRe Hampshire Land Company[1896] 2 Ch 743 and explained inThe Dolphina[2012] 1 SLR 992 at [225]–[229]).This area of law was not covered by the parties in submissions and I do not intend to say more. (2)  Receivers’ actual knowledge 87 The Receivers have denied any knowledge of the existence of Article 22 and their lawyers had not drawn their attention to Article 22 until well after the BVI litigation had commenced. According to the Receivers, they learnt about Article 22 towards the end of February 2015. In response, the plaintiff argued that “actual knowledge” of Article 22 may be inferred from the overall circumstances. Specifically, the plaintiff highlighted the instructions given to IndoChine Law (gleaned from the scope of the service proposal), the stated purpose in Clause 1.4 of the “Purpose” section of the Due Diligence Report, and the fact that the Due Diligence Report was only sought after audits revealed the Share Transfers. The plaintiff therefore submits that the Receivers must have had knowledge of the Revised Charter from the aforesaid matters. 88 Having regard to the overall evidence and the arguments of the respective parties based on extrapolations from the Due Diligence Report, I am still not persuaded by the plaintiff that the Receivers had actual knowledge of the existence of Article 22 prior to and at the commencement of the BVI litigation. It is evident that IndoChine Law’s advice in Section 6.2 of Part C of the Due Diligence Report was directed at the unauthorised representative and that in advising the defendant to sue that person in “the authorized court/arbitration”, IndoChine Law was not making specific reference to arbitration under Article 22(2). This view is easily inferred from the fact that the unauthorised representative in question was none other than Shareholder 1 and he was certainly not a party to the Revised Charter and Article 22. Bearing in mind that IndoChine Law was asked to advise on Vietnamese law in respect of the Share Transfers by an unauthorised representative, the IndoChine Law’s opinion referred to two modes of resolving the dispute over the Share Transfers, namely, under Vietnamese law the defendant could go to court or arbitrate the dispute. To this end, as Ms Sharmini submitted, it was a neutral statement advising on the modes of resolving disputes in Vietnam. 89 Whilst there is some force in the remarks that the Receivers would have had to study the Due Diligence Report and apprised themselves of the Revised Charter before instructing lawyers, it seems to me that the Receivers left the recovery of the shares to their lawyers who appeared to have overlooked Article 22, and their instructed lawyers did not alert the Receivers that the dispute with the plaintiff had to be resolved by arbitration in Singapore until sometime towards the end of February 2015. Above all, BVI Counsel’s corroboration of the Receivers’ position could not be criticised. I saw nothing fanciful or suspicious that hinted of behaviour that was lacking in candour on the part of the BVI Counsel and the Receivers. 90 It must be remembered that the Revised Charter, as a contractual document, is binding even if one of the parties does not know that the Revised Charter contains an arbitration clause or does not understand its consequences;ie, the party will still be required to arbitrate disputes. Most of the plaintiff’s arguments are in the realm of “constructive knowledge” and are not helpful to the analysis of “actual knowledge” required to invoke the doctrine of waiver by election. The distinction between the two concepts was not appreciated.",
        "Repudiation": "91 The plaintiff’s other contention is that the defendant’scommencementof the BVI litigation was a repudiatory breach of the arbitration agreement. There is no longer an agreement to arbitrate since the plaintiff had accepted the repudiatory breach through its participation in the BVI litigation. Relevant principles 92AAY and others v AAZ[2011] 1 SLR 1093 (“AAY v AAZ”) provides a convenient summary of the principles relating to the repudiation of arbitration agreements (at [90]): It is trite law that an arbitration agreement, like any contract, can be repudiated: seeBremer Vulkan Schiffbau und Maschinenfabrik v South India Shipping Corporation Ltd[1981] AC 909 at 980 (“Bremer Vulkan”);Al Thani v Steven Steel Company Incorporated(28 June 1996) (QB): … There are statementsin Chitty which summarise the effect of the cases that I have been referred to as follows. There is no principle that requires arbitration proceedings to terminate if a party to the arbitration resorts to court proceedings nor does resort to court proceedings by a party of itself constitute a repudiation of the arbitration agreement, although it might do so if he thereby unequivocally demonstrates an intention to renounce or abandon the agreement… 93Russell on Arbitrationreminds that a breach of the arbitration agreement is not necessarily repudiatory in nature if there is some explanation for the breach (at para 2-112). [2-112] Repudiation by commencing proceedings. A party may repudiate the arbitration agreement by commencement of proceedings in court in breach of its terms, but such breach will only be repudiatory if done in circumstances that show the party in question no longer intends to be bound by the agreement to arbitrate. Such an intention can only be inferred from conduct which is clear and unequivocal. If there was some reason for the breach, such as confusion as to the correct course, the court will not infer that the party bringing the proceedings intended to renounce its obligation to arbitrate. [emphasis added] 94 The key enquiry, which is relevant to the present case, is whether there is some explanation for the breaching party’s conduct and if there is, there can be no inference of an intention to repudiate (see alsoDubai Islamic Bank PJSC v PSI Energy Holding Co BSC[2011] EWHC 1019 (Comm) (“PSIEnergy”)). For repudiation to be established, it must be shown that the party in breach no longer intends to be bound by the agreement to arbitrate. This is the first stage of enquiry. A related principle is that the obligation on the parties to arbitrate remains in force despite a repudiatory breach unless and until the innocent party communicates, unequivocally, an acceptance of the repudiation (JohnDowning v Al Tameer Establishment[2002] EWCA Civ 721 (“Downing”) at [21];National Navigation Co v Endesa Generacion SA (The “Wadi Sudr”)[2009] EWHC 196 (Comm) (“The Wadi Sudr”) at [114]). Whether an unequivocal acceptance of repudiation had been communicated is the second stage. Plainly, the position of a party issuing proceedings simply to test whether the defendant would invoke the arbitration agreement or not is different from that of a party following a repudiatory breach of an agreement to arbitrate. InDowning,the Court of Appeal looked at the correspondence as a whole in that case and found that the plaintiff, John Downing, had resorted to court proceedings because of the corporate defendant’s refusal to cooperate or acknowledge the existence of the arbitration agreement, despite being invited, amongst other things, to submit its choice of arbitrators. Mark Potter LJ held that the question of whether the issue and service of proceedings was an unequivocal acceptance of repudiation depended on the previous communications of the parties and whether, on an objective construction of the state of play when proceedings were commenced, it amounted to an unequivocal communication that the corporate defendant’s earlier repudiatory conduct had been accepted. On the facts ofDowning, Potter LJ found that the resort to court proceedings was unequivocal acceptance. 95 Returning to the passage inChittycited inAAY v AAZ(at [92] above), it is clear that the act of issuing the court proceedings does notper seconstitute a repudiatory breach of the contract to arbitrate disputes between the parties. 96 A repudiatory intent should not be lightly inferred (see alsoThe Mercanaut[1980] 2 Lloyd's Rep 183 (“The Mercanaut”) at 185).Jeremy Cooke J inBEA Hotels NV v Bellway LLC[2007] EWHC 1363 (Comm) (“BEA Hotels”) made similar remarks (at [13] and [14]): 13 … It was undisputed that a breach of an arbitration agreement by bringing other proceedings was only repudiatory if it was done in circumstances that showed that the party in question no longer intended to be bound to arbitrate.It was also agreed that such an intention could not lightly be inferred and could only be inferred from conduct which was clear and unequivocal.If there was some other reason for the breaching of proceedings it would be hard to infer that the party bringing them intended to renounce its obligation to arbitrate. 14 Thus, if the conduct of that party in all the surrounding circumstances did not reveal a clear intention not to be bound by the agreement to refer the claims in question to arbitration, it could not be said that the arbitration agreement or reference had been repudiated. If it was clear that the party intended to pursue the arbitration, again there could be no repudiation… [emphasis in bold and italics] Explanation for the breaching party’s conduct 97 The Receivers’ explanation for the commencement of the BVI litigation is that it was simply not aware of its obligation to arbitrate having not been advised of the existence of Article 22 at the time the BVI litigation started. In addition, Shareholder 1 and Shareholder 2 were not parties to Article 22. That certain parties to the court proceedings were not parties to the arbitration agreement was a factor that the court inBEA Hotelsconsidered (see [98] below), though I accept thatBEA Hotelsis distinguishable since the claims pursued in the court and arbitration proceedings inBEA Hotelswere distinct. WhatBEA Hotelsadds to the present analysis is that in examining whether there was an unequivocal intent to renounce an obligation to arbitrate, the enquiry as to whether there was some other reason for resorting to court proceedings is relevant. 98 InBEA Hotels, the plaintiff there had challenged the arbitrator’s substantive jurisdiction on the basis that the arbitration agreement was repudiated by the defendant’s commencement of litigation proceedings in the Tel Aviv national courts after arbitral proceedings had commenced, and that such repudiation was accepted by letter. Cooke J found that there had beennorepudiation because: (a) the defendant had been “fighting” to have arbitration for the previous three years, and that it was the claimant that had thwarted arbitral proceedings by preventing the appointment of an arbitrator; (b) the court proceedings excluded claims against the claimant which were being pursued in arbitration; and crucially, Cooke J also noted that (c) the parties in the Israeli court proceedings were not limited to the parties to the arbitration agreement (at [17]–[25]). The court therefore concluded that there was no repudiatory intent. Instead, the intention of the defendant was for court proceedings to complement the existing arbitration. 99BEA Hotelswas subsequently applied inPSI Energyto the question of whether ajurisdictionclause was repudiated. The claimant in that case had commenced court proceedings in Bahrain in breach of the jurisdiction clause in favour of English courts. Noting that the same principles apply for jurisdiction and arbitration clauses, Jack Beatson J (as then was) found that there was no clear repudiatory intent as there was some explanation for the breaching party’s conduct. There were valuable assets in Bahrain that the claimant wanted to freeze, and the claimant’s Bahraini lawyer had advised the claimant that the only feasible way to do so was by instituting Bahraini court proceedings (at [59]). 100 English courts have, in situations where a party had launched litigation proceedings in breach of an arbitration agreement, found that no repudiatory intent was evinced when parties were uncertain about the proper forum to bring their claims and were anxious not to be time barred (seeThe Mercanautat 185); one party was not privy to the jurisdiction regime of the underlying contract, and evinced an intent to comply once apprised of it (seeThe Wadi Sudrat [117]); the writ issued was merely a protective writ, and the party commencing court proceedings had indicated a continuing intention to be bound by the arbitration agreement (seeThe Wadi Sudrat [114]). 101 All in all, the plaintiff here has not established that the defendant’s commencement of the BVI litigation was conduct consistent with the defendant intent to renounce its obligation to arbitrate. I find that the case on repudiation is not made out at the first stage of enquiry. 102 At this juncture, it is worth noting that the plaintiff’s case was that the defendant’s repudiatory intent was evincedsolelyby the commencement of the BVI litigation. The defendant, on the other hand, was content with ending the first stage of analysis for repudiatory breach with the filing of the Notice of Arbitration. I have earlier explained why the plaintiff’s case fails. In my view, the defendant’s cut-off point is also wrong. It is imperative to extend the enquiry beyond the commencement of arbitration because a repudiatory intent could still be evinced if the defendant had demonstrated an intention to maintain parallel proceedings in both the BVI courts and in the Arbitration – my comments earlier on the mandatory nature of Article 22(2) are pertinent in this regard. 103 That said, a study of the procedural history in both the BVI litigation and the Arbitration (explained earlier in [25]–[32] above) will reveal that the defendant had also not shown any intent to repudiate after the Notice of Arbitration was served. Its conduct remained consistent with its decision to arbitrate the dispute between the parties despite what may seem to be parallel court and arbitral proceedings. 104 Notably, after the Arbitration commenced, the defendant sent a letter dated 13 March 2015 proposing that the BVI litigation be stayed pending the outcome of the arbitration. The plaintiff did not concur to a stay. Instead, on 26 March 2015, the plaintiff applied for summary judgment and/or to strike out the action on the bases set out below at [110(d)]. On the other hand, the defendant filed its application to stay the BVI litigation pending outcome of the Arbitration on 20 April 2015. It was heard on 18 May 2015 and judgment was reserved. Although the defendant filed an application for an interim injunction on 28 October 2015 to support the Arbitration, it was not pursued because during the period between March 2015 and January 2016, the plaintiff’s adjourned application to discharge the Interim Injunction (filed on 6 March 2015, before the Notice of Arbitration was filed) came up for hearing on 3 November 2015, and the Discharge Order was made on 20 November 2015. 105 The defendant appealed against the Discharge Order. The plaintiff filed a cross-appeal on 5 January 2016, the appeal to the Eastern Caribbean Court of Appeal was heard on 15 January 2016, but judgment was reserved. Eventually, the BVI litigation came to an end because the defendant did not pay the security of costs ordered against it on time and the defendant’s claim was struck out. As such, the appeal against the Discharge Order was rendered otiose, and consequently, the Interim Injunction was discharged on 12 May 2016 since the claim had been struck out. 106 It is clear from the narrative of the BVI proceedings that steps taken by the defendant were not contradictory nor inconsistent with the arbitral proceedings before the Tribunal. This was not a case where the defendant was maintaining parallel proceedings in breach of the arbitration agreement. After the BVI court reserved its decision on the defendant’s stay application on 18 May 2015, the parties stepped out of the BVI litigation and concentrated on the Arbitration instead: the Tribunal was appointed on 19 June 2015 and issued its First Scheduling Directive on 20 August 2015. The BVI litigation only came alive again on 19 November 2015 (the date on which the plaintiff filed an application for security for costs in the BVI litigation) after the parties had finished filing their submissions on the Tribunal’s jurisdiction on 12 November 2015. 107 As the narrative further shows, in the period before and after parties were engaged in the Arbitration, it was the plaintiff that had taken active steps in the BVI litigation: from 26 March 2015, the date on which it filed its application for summary judgment/strike out up to 11 May 2015, the date on which the plaintiff introduced a time-bar defence; and from its application for security for costs onwards. In comparison, after the Notice of Arbitration was served, the defendant applied for a stay of the BVI litigationin favour of the Arbitrationon 20 April 2015 (the application was heard on 18 May 2015, and the court reserved judgment). The defendant also mounted an appeal against the Discharge Order on 11 December 2015, but this was also a step in support of the Arbitration since the Interim Injunction was put in place to freeze the shareholding interests in the Vietnam Subsidiary. 108 Finally, I would note that even though the BVI litigation took almost a year to sputter to a stop, a fair amount of time had been spent waiting for the parties’ respective applications to be heard and/or for a decision. Acceptance of repudiation 109 I go further to add that had the first stage of the enquiry been established, the plaintiff would not have been able to satisfy the second stage of enquiry. My reasons are as follows. 110 The plaintiff had admitted that it was aware of the Article 22 when the BVI litigation was commenced. Before the Tribunal, the plaintiff also accepted that the disputes were within the scope of Article 22. Despite this knowledge of the existence of Article 22 back in 2014, the plaintiff neither raised Article 22 with the defendant nor notified the defendant that it was agreeable to litigation instead of arbitration. Such direct notification would have expressly and unequivocally conveyed the plaintiff’s acceptance of the defendant’s breach. Needless to say, there is plainly a serious hole in the evidence, and the plaintiff is thus forced to put forward its participation in the BVI litigation as unequivocal acceptance of the defendant’s purported repudiation. The following steps in the BVI litigation are relied upon: (a) Accepting service of the claim form and Statement of Claim in the BVI litigation (4 November 2014); (b) Indicating in its Acknowledgment of Service that it would be filing a substantive defence (4 November 2014); (c) Filing two applications, affidavits, and submissions seeking the discharge of theex parteInterim Injunction (on 26 January 2015 and 6 March 2015 respectively); (d) Filing an application, affidavit and submissions seeking summary judgment against the defendant, or alternatively to strike out the defendant’s claim on its merits (26 March 2015). On top of refuting the defendant’s claims, the plaintiff’s grounds include averments: (i) that the Receivers had no authority to bring the dispute in the BVI courts; (ii) that no transfer of the defendant’s shares were reflected in the share register; and (iii) that the defendant’s claims were time-barred; (e) Opposing the defendant’s application to the BVI High Court for the BVI litigation to be stayed (18 May 2015); and (f) Applying for security for costs against the defendant in the BVI litigation (19 November 2015). 111 According to the defendant, not all of the identified steps in the BVI litigation could be taken into account. The cut-off date for acceptance of repudiation ought to be the date on which the defendant filed its Notice of Arbitration, 10 March 2015. As regards the steps taken before 10 March 2015, the defendant’s position is that the steps could not be construed as unequivocal acceptance of the repudiation. The defendant also adds that the plaintiff had challenged the jurisdiction of the BVI courts on the basis that the BVI was not the natural forum as Malaysia and Vietnam were more appropriate. An application for a declaration to that effect was filed by the plaintiff on 26 January 2015. 112 I will deal first with the issue of when the cut-off date ought to be for the examination of whether steps in the BVI proceedings can constitute acceptance. Although the defendant did not cite any authorities in support of its assertion that the cut-off date is the date on which the defendant filed the Notice of Arbitration, it seems logical enough. Arguably, unequivocal acceptance must be shown prior to the filing of the Notice of Arbitration because past that point, the defendant was not evincing an unequivocal intent to renounce its obligation to arbitrate – as I have found in [101] and [103] above. There would be no repudiatory intent for the plaintiff to accept. I therefore find that only steps (a) to (c) referred to at [110] above are relevant. That said, in appropriate cases, the nature of the participation in the judicial forum by the parties after arbitration has commenced would be relevant to demonstrate acceptance of the repudiatory breach. 113 The legal position on whether an act constitutes a “step in the proceedings” is set out in the case ofCarona Holdings Pte Ltd and others v Go Go Delicacy Pte Ltd[2008] 4 SLR(R) 460 (“Carona Holdings”). In that case, the Court of Appeal held that “step” must be understood in a practical and commonsensical way. A “step” is deemed to have been taken if the applicant employs court procedures to enable him to defeat or defend those proceedings on the merits, or if the applicant proceeds, from a procedural point of view, beyond a mere acknowledgment of service of process and evinces an unequivocal intention to participate in the court proceedings in preference to arbitration (at [52] and [55]). In addition, a step is taken if the act advances the hearing of the matter in court in contrast to one that serves to smother the action and stop the proceedings dead in its tracks (at [93]). 114 The following excerpt in David Joseph QC and David Foxton QC,Singapore International Arbitration: Law & Practice(LexisNexis, 2014) (“Joseph &Foxton”) is also helpful (at p 98): It is clear that an application for an extension of time to serve a defence will not constitute a step in the proceedings, nor will a request in correspondence for particulars of the claim.Taking defensive action to challenge an interim injunction does not involve a step in the proceedings(International SOS Pte Ltd v Overton Mark Harold George[2001] 2 SLR(R) 777 at [6]), and in considering whether a particular step has this effect, the emphasis is to be placed on theendof the application and not on themeans. An act done with the intention of preserving thestatus quopending the hearing of a stay application will not be a step in the proceedings.  [emphasis added] 115 I turn now to the BVI litigation. The two brothers and the plaintiff did not see the BVI High Court as the natural or appropriate forum to determine the dispute and the first step each took to have the action stopped was to file an application for a declaration that BVI wasforum non conveniens. The plaintiff’s application would shed light on its earlier acknowledgement of service of process and marking on the Acknowledgment of Service form. There is nothing to the plaintiff’s initial marking of the Acknowledgment of Service form that indicated an intention to file a defence. As stated, no defence on the merits was ever filed. To explain, a party served with originating process is required to fill up Acknowledgement of Service forms with questionnaires. On such questionnaire is the question “Do you intend to defend the claim?”, and the plaintiff ticked the “YES” box without indicating that it would be making a substantive defence. Clearly, the mere ticking of a checkbox in an Acknowledgement of Service form cannot be regarded as a step in the court process (seeCarona Holdingsat [55]). As held inCarona Holdings, only acts that advance court proceedings are “steps”.Forum non conveniensobjections are not acts that would advance the BVI proceedings; rather, they were acts that reject litigation before the BVI High Court as it was not the natural or appropriate forum to determine the disputes. 116 Finally, the plaintiff’s applications to discharge the interim injunction do not constitute steps in the proceedings. As the authors ofJoseph & Foxtonhad opined, citingInternational SOS Pte Ltd v Overton Mark Harold George[2001] 2 SLR(R) 777 at [6] (see above at [114]), a defensive challenge of an interim injunction is not a step in the proceedings. The objective of such a challenge is to undo the fetters imposed by the interim injunction – not to advance court proceedings. It cannot be construed to be an unequivocal intention to participate in the court proceedings in preference to arbitration. Further, I note that inDelta Reclamation Limited v Premier Waste Management Limited[2008] EWHC 2579 (QB), John Behrens J had held that even if court proceedings were launched in breach of an arbitration agreement, the defence of an application for interlocutory relief, without any further steps in the action, would not amount to an acceptance of the breach so as to bring the arbitration agreement to an end (at [35]). 117 All in all, the plaintiff’s participation in the BVI litigation as described is not demonstrable as an unequivocal acceptance of any purported repudiation.",
        "Estoppel": "118 As a separate and alternative challenge to the Tribunal’s jurisdiction, the plaintiff argues that the defendant is estopped from pursuing the Arbitration, contending that the defendant, having previously litigated in the BVI, cannot re-assert the right to arbitrate. I begin with the nature of the estoppel canvassed by either side. 119 The plaintiff apparently relied on the doctrine ofestoppel by representationwhereas the defendant had submitted on the doctrine ofpromissory estoppel. The case ofAero-Gateis instructive in resolving this conceptual misalignment. Coomaraswamy J inAero-Gateclarified that estoppel by representation relates to representation of present fact (at [37]). It operates to prevent the denial of the truth of a representation of fact, thereby setting up a state of affairs by reference to which the parties’ obligations are to be governed (seeWilken & Ghalyat para 8.05). In contrast, promissory estoppel relates to a representation as to future conduct. It relates to a promise thatrightswill not be enforced (seeAero-Gateat [37];Wilken & Ghalyat para 8.05). 120 In its submissions, the plaintiff citedYokogawa Engineering Asia Pte Ltd v Transtel Engineering Pte Ltd[2009] 2 SLR(R) 532 (“Yokogawa”), which was characterised as a case of estoppel by representation (seeYokogawaat [6]). In that case, the plaintiff had represented to the defendant that the operative dispute resolution mechanism was arbitration in Singapore under the Rules of Arbitration of the ICC International Court of Arbitration. The defendant relied on the plaintiff’s representation and duly commenced arbitration. The plaintiff was held to be estopped from taking a contrary position (seeYokogawaat [17]). 121 The present case is very different. The plaintiff’s case is that by commencing the BVI litigation, the defendant had represented that it would “no longer be relying on the arbitration agreement contained in the Revised Charter. This is tantamount to a prospective promise and the plaintiff’s argument is therefore one that is premised on promissory estoppel. 122 However, as mentioned at [119] above, the doctrine is applicable only in relation to a promise not to enforce legalrights. The authors ofWilken & Ghalyprefer the term “equitable forbearance” to “promissory estoppel” because the promise, such as it is, is not to perform but to temporarily halt a right to expect performance of a particular type from the other party (see para 8.06). Indeed, it has been said that the doctrine of promissory estoppel is “closely akin” to the doctrine of waiver by election except that waiver requires knowledge whereas promissory estoppel does not, and promissory estoppel requires detriment whereas waiver does not (seeWilken & Ghalyat para 8.06).The Kanchenjungaprovides useful guidance (at 399): There is an important similarity between the two principles, election and equitable estoppel, in that each requires an unequivocal representation, perhaps because each may involve a loss, permanent or temporary, of the relevant party's rights. But there are important differences as well. … [E]lection once made is final; it is not dependent upon reliance on it by the other party. On the other hand,equitable estoppel requires an unequivocal representation by one party that he will not insist upon his legal rights against the other party, and such reliance by the representee as will render it inequitable for the representor to go back upon his representation. No question arises of any particular knowledge on the part of the representor, andthe estoppel may be suspensory only. Furthermore, the representation itself is different in character in the two cases. The party making his election is communicating his choice whether or not to exercise a right which has become available to him.The party to an equitable estoppel is representing that he will not in future enforce his legal rights. His representation is therefore in the nature of a promise which, though unsupported by consideration, can have legal consequences; hence it is sometimes referred to as promissory estoppel.[emphasis added] 123 The doctrines of waiver by election and estoppel arose inPT First Media TBK (formerly known as PT Broadband Multimedia TBK) v Astro Nusantara International BV and others and another appeal[2014] 1 SLR 372 (“Astro”) as well. InAstro, the Court of Appeal dealt with the question of whether the appellant had waived its objections to the tribunal’s jurisdiction and joinder of the sixth to eighth respondents by its conduct after an award on preliminary issues, or alternatively, whether it was estopped from raising these objections on the same basis. The court found that there were substantial similarities in both concepts. Both require, as a requisite element, that the appellant had “made a clear representation that it will forego the right to challenge the Award on Preliminary Issues” (at [200]). 124 In my view, the defendant’s commencement of the BVI litigation cannot be characterised as aforbearanceorforgoingof any right. Again, this contrasts with a situation where a party has breached the obligation to arbitrate by commencing court proceedings, and the innocent party applying to stay court proceedings may be said to beestoppedfrom assertingits right to insist on arbitrationif it “demonstrates a willingness to seek recourse via the gates of litigation” (seeTjong Very Sumitoat [53];Carona Holdingsat [52]). In other words, estoppel, like waiver, is an argument that may be raised against a party seeking to enforce its rights in response to another party’s breach. In contrast, a party cannot be said to have breached anobligationto arbitrate under an arbitral agreement, and also estopped from asserting arightto arbitrate under that same agreement. 125 Even if the doctrine of promissory estoppel is applicable, the elements of promissory estoppel are not made out (seeAero-Gateat [37];The Kanchenjungaat 399). The plaintiff’s case on estoppel fails at the first requirement of a clear and unequivocal promise by the promisor. It must be borne in mind that while promises may be inferred from conduct, whether such a promise was made is an objective test of whether a promisee would reasonably interpret the promisor’s actions as a promise to forbear. There will only be a clear and unequivocal promise if the alleged promisee interpreting the conduct of the alleged promisor could not reasonably have arrived at any other conclusion (seeWilken & Ghalyat paras 8.17 and 8.19). As I have established, the defendant’s commencement of the BVI litigation could be explained. One feature of the case was that the two brothers were not party to Article 22, so court proceedings had to be resorted to for the defendant to get any redress from them. It would also have made more practical sense for the defendant to commence proceedings against all of the defendants at one forum instead of commencing multiple proceedings at the same time. I do not think that the defendant’s actions amount to a clear and unequivocal promise that it will never commence arbitration proceedings in Singapore. 126 In addition, the second requirement of reliance on the promise by the promisee is also not made out. Reliance connotes a change of position. The promisee must act in a different way to that which it would have done had the promise not been made (seeWilken & Ghalyat para 8.39). A causative link must be established between the promise and the conduct exhibited by the promisee. Even if the promise is not the sole cause of the change of position, it must “tip the balance” and influence the promisee to act in the way it did (seeWilken & Ghalyat para 8.40). In the present case, the plaintiff had not pointed to any change of position. All that the plaintiff has relied on to establish reliance is that the plaintiff had engaged solicitors in the BVI to participate in the BVI litigation. At the outset, the plaintiff had regarded the BVI asforum non conveniens. From this viewpoint, there was no reliance because the plaintiff had not regarded the BVI court as the natural or appropriate forum to determine the substantive merits. I also do not see the plaintiff’s subsequent conduct in the BVI litigation after the Notice of Arbitration as a change of position that stemmed from its earlier reliance of the defendant’s commencement of the BVI litigation once apprised of it. 127 On the first two requirements, the plaintiff fails on its promissory estoppel argument.",
        "Conclusion": "128 For all the reasons stated above, OS 501 is dismissed with costs. Belinda Ang Saw EanJudge Philip Antony Jeyaretnam SC, Paras Manohar Lalwani and Chua Weilin (Dentons Rodyk & Davidson LLP) for the plaintiff;Yogarajah Yoga Sharmini and Subashini d/o Narayanasamy (Haridass Ho & Partners) for the defendant;"
    }
}