{
    "case_title": "Telecom Credit Inc vStar Commerce Pte Ltd (Midas United Group Pte Ltd, garnishee)",
    "ncitation": "[2017] SGHC 300",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "Introduction": "1 This case involves a contested garnishee application relating to a Credit Card Processing Service Agreement dated 31 July 2012 as amended by a Memorandum dated 31 March 2015 (collectively “the Agreement”) made between Telecom Credit Inc (“the judgment creditor”) and Star Commerce Pte Ltd (“the judgment debtor”).",
        "The facts": "2 The garnishee Midas United Group Pte Ltd (“Midas”) and the judgment debtor are Singapore-incorporated companies while the judgment creditor is a Japanese company. The three companies sit in a downstream order relative to one another in terms of the flow of credit in the business of processing credit card payments in which all three companies are involved: monies which are   debited to a credit card customer’s account would be transmitted from Midas to the judgment debtor and then from the judgment debtor to the judgment creditor.1Foot Note 1×Takeuchi’s affidavit dated 15 Apr 2016 at p 49. 3 The judgment creditor’s general manager is Jun Takeuchi (“Takeuchi”) whilst Hyun Seung Moon (“Hyun”) is a director of Midas. The judgment debtor’s managing director is Toru Minamisawa (“Minamisawa”) who resides in Japan. 4 Pursuant to four service contracts signed between the two companies and variously dated between 20 February 2014 and 10 March 2015 (“the Midas Service Contracts”), monies collected by Midas from credit card transactions would be transferred to the judgment debtor after deducting Midas’ service fees. Although Midas was the party to the Midas Service Contracts, in practice the monies of Midas were held and transferred to the judgment debtor by IFKAP Pte Ltd (“IFKAP”), a wholly-owned subsidiary of Midas. According to Hyun’s first affidavit, Midas had entered into a cooperation agreement with IFKAP on or about 15 October 2011 (“the Cooperation Agreement”) pursuant to which IFKAP managed an account in accordance with Midas’ instructions and on behalf of Midas.2Foot Note 2×Hyun’s affidavit dated 28 Dec 2016 at paras 11 and 13. 5 Under the Midas Service Contracts, the judgment debtor agreed to pay Midas a fixed monthly fee with a minimum monthly amount in return for the provision of online payment services by Midas for three years.  Midas claimed that the judgment debtor was in breach of these contracts as it had failed to pay Midas the monthly fee/minimum monthly amount since about 23 January 2016.3Foot Note 3×Garnishee’s Skeletal Submissions at para 8. 6 Similar to what Midas did under the Midas Service Contracts, the judgment debtor had agreed, under the Agreement mentioned in [1] above, to collect for the judgment creditor credit card payments received from sales transactions between merchants and customers and forward the monies to the judgment creditor less the judgment debtor’s service fees. The payments included monies received from Midas. 7 The judgment creditor alleged that in breach of the Agreement, the judgment debtor had failed since October 2014 to make full payment of sums owed to the judgment creditor.  On 11 and 15 March 2016, the judgment creditor sent letters of demand to the judgment debtor for payment of US$853,128.88 and JPY648,118,964 respectively.4Foot Note 4×Takeuchi’s affidavit dated 15 Apr 2016 at para 38.The defendant did not respond to the letters of demand nor make payment of the sums demanded.  Apparently, Minamisawa became incommunicado around May 2015.5Foot Note 5×Plaintiff’s Submissions at para 3(iii). 8 On or about 28 March 2016, the judgment creditor executed a memorandum with IFKAP (“the Trading Performance Confirmation”) wherein IFKAP agreed to hold sums totalling JPY127,364,186 on behalf of the former instead of remitting the amount to the judgment debtor.  The sums comprised the following:6Foot Note 6×Takeuchi’s affidavit dated 28 Nov 2016 at para 5(c). (a) JPY90,324,586 being sums due to the judgment creditor for transactions made between 16 December 2015 to 31 January 2016; and (b) JPY37,039,602 being the estimated rolling reserve due to be paid to the judgment debtor when it becomes due in future. 9 On the same day the judgment creditor also entered into an agreement with IFKAP (“the Remittance and Deposit Agreement”) pursuant to which IFKAP agreed to hold the above two sums for the judgment creditor until the latter submitted:7Foot Note 7×Takeuchi’s affidavit dated 28 Nov 2016 at para 5(d). (a) a judgment or order of court from Japan or Singapore which proved that the judgment creditor is a creditor of the judgment debtor; or (b) a document proving that the judgment debtor had assigned its interests in the two sums to the judgment creditor. The agreements in [8] and [9] were signed on behalf of IFKAP by its director Hashimoto Yutaka (“Hashimoto”). However, it was Midas’s contention that Hashimoto had no authority to bind the judgment debtor as he was neither its employee nor its representative. 10 On 18 April 2016, the judgment creditor commenced Suit No 389 of 2016 (“this Suit”) against the judgment debtor for breach of contract. The judgment creditor also alleged that the judgment debtor was obliged to release to the judgment creditor rolling reserves after holding the monies for a period of six months. Rolling reserves are monies arising from the sales transactions which the judgment debtor is entitled to retain for a period of time as security for payment of any penalties. The amount of such reserves approximate 3% to 5% of the amount of sales in the credit card business flow per month.8Foot Note 8×Takeuchi’s affidavit dated 15 Apr 2016 at para 12. 11 On 22 April 2016, the judgment creditor obtained anexparteinjunction (“the Freezing Order”) to restrain the judgement debtor from disposing of, dealing with or diminishing the value of any of its assets in Singapore up to the value of the two sums claimed.  One of the assets identified in the injunction order was a debt of JPY127,364,188 was said to be owed by Midas. That sum was held by IFKAP.9Foot Note 9×HC/ORC 2502/2016. 12 The judgment creditor served the writ of summons in this Suit on the judgment debtor but the latter failed to enter an appearance within the timeline stipulated under O 13 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“the Rules of Court”). In the result, on 13 May 2016 the judgment creditor obtained final judgment in default of appearance against the judgment debtor in the sums of US$853,128.88 and JPY648,118,964 with interest and costs of $2,300 (“the Judgment”).10Foot Note 10×HC/JUD 344/2016. 13 As the judgment debtor failed to satisfy the Judgment, the judgment creditor by way of execution proceedings appliedexparteby way of Summons No 5729 of 2016 (“the garnishee summons”) under Order 49 of the Rules of Court to garnish all debts due or accruing due from Midas to the judgment debtor. 14 Separately, the judgment creditor applied in Summons No 5728 of 2016 (“Summons No 5728”) for a garnishee order against IFKAP.  Summons No 5728 has been adjourned pending the resolution of the garnishee summons. 15 An OrderNisiwas granted on the garnishee summons by an Assistant Registrar (“AR”) on 29 November 2016 (“the OrderNisi”).11Foot Note 11×HC/ORC 8012/2016.However, on the return day of the OrderNisi, Midas appeared and challenged the OrderNisicontending that it should be discharged as the debt sought to be garnished from Midas was not a “debt due or accruing due to the judgment debtor from the garnishee” under O 49 r 1(1) of the Rules of Court. 16 The AR accepted the arguments of Midas and declined to make the OrderNisiabsolute. Instead, he directed that the judgment creditor and Midas should proceed to trial to determine the issue of Midas’ liability to pay the sum of JPY127,364,188 to the judgment creditor with the judgment creditor standing in the position of judgment creditor and Midas standing in the position of the judgment debtor in those proceedings (“the AR’s Order”). 17 In the AR’s grounds of decision dated 29 March 2017 (seeTelecom CreditInc v Star Commerce Pte Ltd[2017] SGHCR 3), he stated that the burden of proof at the stage of the OrderNisiwas on the garnishee (ie, Midas) to show cause as to why it would be inequitable or unfair for the debt due to the judgment debtor to be attached. Taking into account that the judgment creditor’s judgment was by default and not obtained on its merits, the AR felt that Midas had raised an arguable defence and a trial should be ordered. 18 On 24 March 2017, Midas’ solicitors issued a notice of termination of the Midas Service Contracts and a letter of demand to the judgment debtor.12Foot Note 12×Hyun’s affidavit dated 11 May 2017 at para 14.This was followed by the filing on 13 April 2017 of Suit No 324 of 2017 (“Midas’ suit”) claiming damages against the judgment debtor for breach of the Midas Service Contracts. 19 The judgment creditor through their solicitors was unable to persuade Midas to agree to a voluntary stay of proceedings in the Midas’ suit. Consequently, it applied in Summons No 1847 of 2017 (which was granted on 9 May 2017), to be added as a party to and for a stay of Midas’ suit until after the determination of the garnishee summons and this Suit. 20 Dissatisfied with the AR’s Order, both the judgment creditor and the judgment debtor appealed to a judge in chambers in RA Nos 102 and 103 of 2017 respectively (“collectively the Appeals”). The Appeals came up for hearing and both were dismissed by this court. 21 This court subsequently acceded to the judgment creditor’s request to hear further arguments. After hearing the judgment creditor’s further arguments, this court affirmed its earlier decision for the Appeals. As the judgment creditor has appealed against the court’s decision (in Civil Appeal No 138 of 2017), I now set out the reasons for dismissing the Appeals.",
        "The judgment creditor’s affidavits": "22 Both the judgment creditor and Midas filed affidavits in support of their respective positions. The deponent for the judgment creditor’s five affidavits was Takeuchi while Hyun filed three affidavits on Midas’ behalf.  The court will only highlight some salient features in the parties’ affidavits that prompted the court to dismiss the Appeals. 23 In his first affidavit, Takeuchi claimed that he and other representatives of the judgment creditor had held several meetings with Minamisawa at which Minamisawa promised that the judgment debtor would pay the outstanding amounts owed to the judgment creditor. The judgment debtor did make some payments to the judgment creditor until 20 January 2016 when the judgment creditor received a letter from the judgment debtor’s Japanese lawyers stating that their client was unable to perform its payment obligations in the near future.13Foot Note 13×Takeuchi’s affidavit dated 15 Apr 2016 at para 27. 24 Subsequently, on 4 February 2016, Takeuchi (together with the judgment creditor’s president Mr Shirayama) met Hyun and Hashimoto of IFKAP. Takeuchi claimed that Hashimoto informed him that IFKAP had paid the judgment debtor for credit card transactions made between 1 August and 15 September 2014 which contradicted what Minamisawa had told him earlier; those sums should have been paid over to the judgment creditor by 15 October 2014 but were not. Takeuchi exhibited the transcripts (Exhibit JT-14) of that meeting in his first affidavit filed on 15 April 2016.14Foot Note 14×Takeuchi’s affidavit dated 15 Apr 2016 at paras 33–35. 25 Takeuchi took issue with the denial by Midas that Hashimoto had no authority to bind Midas since Hashimoto was from IFKAP not Midas when he signed the Remittance and Deposit Agreement in [9].15Foot Note 15×Takeuchi’s affidavit dated 18 Jan 2017 at para 16. 26 In his third affidavit (filed on 18 January 2017), Takeuchi produced the transcripts (with English translation) of his audio-recording of what transpired at a meeting held on 23 February 2016 which Hyun and Hashimoto attended. He asserted that the transcripts showed that both gentlemen accepted that the judgment debtor owed the judgment creditor sums which IFKAP retained and there was a likelihood that IFKAP would be sued by Midas for the same. Hashimoto had then reportedly stated that if IFKAP received an invoice “based on some kind of document, then we will transfer the payouts that we have suspended”.16Foot Note 16×Takeuchi’s affidavit dated 18 Jan 2017 at para 9.In his capacity as a director of both Midas and IFKAP. Hyun had then raised no objections to what Hashimoto said.  Indeed, Hyun apparently had advised the judgment creditor on how it could prove itself to be a legitimate creditor of the judgment debtor pursuant to Article 3 of the Remittance and Deposit Agreement which states:17Foot Note 17×Takeuchi’s affidavit dated 18 Jan 2017 at para 11. [The judgment creditor] in Japan or the Republic of Singapore must legally prove himself as the legitimate creditor. [IFKAP] shall check on the performance and review the same within 7 working days from the day lent and send the money within 3 working days from the day of review report completion to [the judgment creditor’s] bank account as instructed by [the judgment creditor]. 27 Not surprisingly, Takeuchi accused Hyun of lying in his affidavits in disclaiming knowledge of and disavowing Hashimoto’s comments at the meeting on 23 February 2016 and signing of the Remittance and Deposit Agreement.18Foot Note 18×Takeuchi’s affidavit dated 18 Jan 2017 at para 13.",
        "Midas’ affidavits": "28 In his affidavits filed on behalf of Midas, Hyun alleged that the judgment creditor had not commenced the garnishee summons in good faith and contended that the same were prejudicial to Midas’ contractual interest in the monies it held as a creditor of the judgment debtor.19Foot Note 19×Hyun’s affidavit dated 28 Dec 2016 at para 8.Hyun claimed Midas was unaware of the dispute between the judgment creditor and the judgment debtor until around January 2016 when he was told by the judgment creditor.  He alleged that the judgment creditor’s garnishee summons was based on “illegitimate” confirmation documents in [8] based on alleged representations made by Hashimoto which were neither true nor binding on Midas as:20Foot Note 20×Hyun’s affidavit dated 28 Dec 2016 at para 7. (a) there was no contractual relationship between IFKAP and the judgment debtor. The monies were received by IFKAP on behalf of Midas and were at all times subject to Midas’ instructions regarding payment to any third party; and (b) there was no justification for the judgment creditor to rely on or to proceed with any alleged IFKAP representations without first clarifying with Hyun or Midas. Hyun alleged that the authority of the “rogue staff” Hashimoto was challenged (and not sanctioned by the board of directors of IFKAP). Hashimoto had confirmed in a statement dated 21 December 2016 (“Hashimoto’s apology”) that the Trading Performance Confirmation dated 23 March 2016 in [8] had been signed without prior notice or approval from Hyun as the co-managing director of IFKAP or Midas, which is its parent company.21Foot Note 21×Hyun’s affidavit dated 28 Dec 2016 at para 42.The judgment creditor’s claim was therefore based on evidence that was not binding on Midas and which had been surreptitiously obtained from an individual who did not represent Midas.22Foot Note 22×Hyun’s affidavit dated 28 Dec 2016 at para 44. 29 Although he was present at the meeting on 23 February 2016, Hyun claimed he was not involved in the discussions which led to the signing of the Trading Performance Confirmation dated 23 March 2016 in [8].23Foot Note 23×Hyun’s affidavit dated 17 Feb 2017 at para 4(a). 30 Hyun pointed out that Midas was not informed by the judgment creditor of this Suit nor of the Freezing Order in [11].24Foot Note 24×Hyun’s affidavit dated 28 Dec 2016 at para 19.Further, on 9 May 2016, the solicitors for Midas had informed the judgment creditor that the amount of JPY127,364,188 alleged to be due and owing to the judgment debtor by Midas as stated in the Freezing Order was incorrect and disputed.25Foot Note 25×Hyun’s affidavit dated 28 Dec 2016 at para 20. 31 Hyun contended that there was no “pre-existing debt due and owing to the judgment debtor” as Midas had both a contractual interest and obligations in the monies it held as to how those monies should be dealt with. Midas was entitled to withhold the monies as security in accordance with the terms and conditions of the Midas Service Contracts and for breach of the same by the judgment debtor.26Foot Note 26×Hyun’s affidavit dated 28 Dec 2016 at paras 21–22. 32 Hyun disclosed that he had met with representatives of the judgment creditor in Japan between 13 June 2016 and 24 November 2016. Pursuant to those discussions, Midas initially withheld from commencing its own action against the judgment debtor and formally challenging the Judgment. However, it had now decided to commence the Midas suit in the light of the garnishee summons.27Foot Note 27×Hyun’s affidavit dated 28 Dec 2016 at paras 25–26. 33 Hyun contended that Midas like the judgment creditor, is also a creditor of the judgment debtor and has contractual rights and obligationsvis-à-visthe monies it/IFKAP held.  Therefore, the judgment creditor has nolocusstandito enhance its alleged rights over the monies held by Midas (and IFKAP) when the nature of the monies being held (whether it is a pre-existing debt) is disputed.28Foot Note 28×Hyun’s affidavit dated 28 Dec 2016 at para 32.",
        "The submissions": "",
        "The judgment creditor’s arguments": "34 Counsel for the judgment creditor (“Mr Sithawalla”) had cited TheState-Owned CompanyYugoimport SDPR v Westacre Investment Inc and other appeals[2016] 5 SLR 372 (“WestacreInvestment”)  to support his argument that a low threshold was required for the judgment creditor to cross in order to obtain a garnishee order.29Foot Note 29×Plaintiff’s Submissions at para 11.Relying onPaynaChettiar v Low Meng Seng and others[1998] 1 SLR(R) 657 (“PaynaChettiar”), he argued that the court was not obliged to and should not to look behind a validly issued judgment whether obtained on its merits or by default as a default judgment is no less a judgment and is good and enforceable unless and until it is set aside.30Foot Note 30×Plaintiff’s Submissions for Further Arguments at para 5. 35 Consequently, Mr Sithawalla argued that any challenge to the judgment creditor’s claim by Midas should be by way of an application to set aside the Judgment. However, the House of Lords decision inEmployers’ Liability Assurance Corporation, Limited v Sedgwick, Collins & Co[1927] AC 95 made it clear that garnishees had no such direct interest in a suit such as to entitle them to apply to set aside a judgment in default. Hence, Midas was bound by the Judgment.31Foot Note 31×Plaintiff’s Submissions for Further Arguments at para 7.In any event, Midas has never challenged the sums claimed by the judgment creditor and even acknowledged in its affidavits that sums were paid by Midas to the judgment debtor, who would in turn pay such sums to the judgment creditor.32Foot Note 32×Plaintiff’s Submissions for Further Arguments at para 8. 36 Mr Sithawalla took issue with the contents of Hyun’s three affidavits pointing out that nowhere had Hyun confirmed what sums Midas was actually holding on behalf of the judgment debtor; neither was it stated in Midas’ suit.  He added that the judgment creditor did not dispute that Midas has a right of set-off of its claim against the monies it held on behalf of the judgment debtor. He found it highly suspicious that the sum claimed in Midas’ suit was so similar to the sum the judgment creditor sought to garnish. The burden was on Midas to show how much monies it held and the amount that was owed to it by the judgment debtor. The judgment creditor was entitled to any surplus between the two amounts.33Foot Note 33×Minute Sheet dated 17 May 2017 at p 2 37 Mr Sithawalla questioned the credibility of all the documents produced by Midas. First, he referred to those exhibited in Hyun’s first “show cause” affidavit.  He contended that the Midas Service Contracts were suspect. As Midas provided essentially the same service under all four contracts, why was there a need for so many contracts? 38 Further, the Midas Service Contracts were neither properly dated nor executed. To elaborate, Mr Sithawalla pointed to the contract dated 20 February 2014 (at pp 19-20 of exhibit SH-1) between Midas and the judgment debtor exhibited in Hyun’s first affidavit.  It stated that the “Holdback/Security Deposit” of 3% can only be withheld for 180 days. That contract was not even signed by Midas and was also conditional upon the bank accepting the merchant. The other three contracts at pp 24-28 of the same exhibit were signed by Midas but not by the merchant and/or undated.34Foot Note 34×Minute Sheet dated 17 May 2017 at p 3. 39 Mr Sithawalla pointed to clause 15 of the terms and conditions governing the Midas Service Contracts. Under subclause (2), if there are breaches by the judgment debtor, Midas must first make a demand before it can levy penalty charges arising from the breaches. Under subclause (6), after termination of the contractual relationship, Midas can retain the Security Deposit for a further 9 months in order to secure any claims for recovery resulting from chargebacks. T hereafter, any credit balance shall be transferred to the account of the judgment debtor designated by Midas. If (as Midas contended) the judgment debtor had been in breach of its payment obligations to Midas since 23 January 2016 (see [5]), then the 180 days started from that date and ended on 22 April 2016. However, Midas’ solicitors only gave notice of termination on 24 March 2017.35Foot Note 35×Minute Sheet dated 17 May 2017 at p 3. 40 He then referred to clause 25 of the Midas Service Contracts headed “Limitation of Actions”. The clause states that all of the parties’ claims “shall be time-barred twelve (12) months after the respective creditor/obligee learned – or ought to have learned without gross negligence – of the circumstances giving rise to claim...” Midas’ suit was commenced on 13 April 2017 which was well past the time-bar date of 22 January 2017.36Foot Note 36×Minute Sheet dated 17 May 2017 at p 3. 41 Mr Sithawalla alleged that the invoices exhibited in Hyun’s third affidavit (filed on 11 May 2017) were generated to support Midas’ claims. Midas only produced those invoices on 11 May 2017 but there was no evidence to show they were sent to the judgment debtor.  If indeed it had a valid set-off, Midas should have produced the documents at the hearing before the AR.  Moreover, Midas did not previously claim a minimum transaction fee from the judgment debtor as it now did. He contended that the claims made by Midas were therefore an afterthought.37Foot Note 37×Minute Sheet dated 17 May 2017 at p 4. 42 Contrary to Hyun’s denials, Mr Sithawalla contended that the transcripts of the meetings on 23 February 2016 showed that he participated in the discussions.38Foot Note 38×Minute Sheet dated 17 May 2017 at pp 4–5.",
        "Midas’ submissions": "43 Mr Wendell Wong (“Mr Wong”), counsel for Midas, argued that the burden of proof was not on his client but on the judgment creditor to prove that his client owed a pre-existing debt of JPY127,000,000 to the judgment debtor on a balance of probabilities or, that there was an admission by Midas that it owed monies to the judgment debtor. He submitted that the judgment creditor had failed to discharge that burden of proof.  He relied onWestacreInvestmentand O 49 of the Rules of Court. 44 Mr Wong said it was telling that the judgment creditor did not know the relationship between Midas and IFKAP. Yet the judgment creditor was relying on the documents of IFKAP at [8] and [9] which company is a separate legal entity from Midas. He questioned how IFKAP could confirm the debt of Midas which is another legal entity.39Foot Note 39×Minute Sheet dated 17 May 2017 at p 6.Even then, those documents did not state that there was a debt due and accruing from Midas to the judgment debtor. 45 Mr Wong relied onTeleoptik-Ziroskopiv Westacre Investments Inc[2012] 2 SLR 177 to submit that the Court of Appeal held that summary disposal of garnishee proceedings was appropriate only when there was no arguable defence in fact and law which was not the case here. 46 He submitted that the judgment creditor cannot, on the one hand rely on the terms of the Midas Service Contracts for its submissions and yet on the other hand “rubbish” those contracts as lacking credibility. Although the judgmente Contracts  creditor itself obtained the Judgment by default, it criticised the basis of Midas’ claim.40Foot Note 40×Minute Sheet dated 17 May 2017 at p 5. 47 Mr Wong pointed out that nowhere in the judgment creditor’s submissions did it deal with the issue that the monies withheld by Midas were a security deposit.  Moreover, under clause 15(5) of the Midas Service Contracts, Midas was entitled to increase the Security Deposit in various circumstances including (i) where there was an increase in the security risk of  the judgment debtor and (ii) where the Midas Service Contracts were terminated.  He pointed out that once clause 15(5) is activated, Midas is entitled to and did hold back more than 3% as the Security Deposit.41Foot Note 41×Minute Sheet dated 17 May 2017 at pp 5–6. 48 Mr Wong disagreed that Midas’ claim was time-barred pointing out that after termination of the contracts, Midas can hold back the security deposit for another 9 months. He relied on clause 23(4) of the terms and conditions in this regard which states:42Foot Note 42×Minute Sheet dated 17 May 2017 at p 6. The right to extraordinary termination shall remain unaffected by the above [a reference to subclause 1]. [Midas] shall particularly have said right if a petition is filed for the opening of insolvency proceedings over the assets of [the judgment debtor] or if such insolvency proceedings are opened or if the opening is rejected because of a lack of assets. (Clause 23 is headed “Term, Right to Suspend the Services” and clause 23(1)inter aliastipulates that the Agreement will run for two years as the “initial term” unless terminated in writing by either party with three months’ notice).43Foot Note 43×Hyun’s affidavit dated 28 Dec 2016 at p 43. 49 Mr Wong submitted that the transcripts of the meeting on 19 May 2016 (attended by the same attendees of the 23 February 2016 meeting), showed that at best there was confusion and the parties were talking at cross purposes. Hyun was under the impression that the discussion had nothing to do with Midas because Hashimoto said it was between the judgment creditor and IFKAP.44Foot Note 44×Minute Sheet dated 17 May 2017 at p 6.",
        "The decision": "50 The relevant provision in the Rules of Court pertaining to ordersnisibeing made absolute in garnishee proceedings is O 49 r 5; it states: Where on the further consideration of the matter the garnishee disputes liability to pay the debt due or claimed to be due from him to the judgment debtor, the Court may summarily determine the question at issue or order in Form 104 that any question necessary for determining the liability of the garnishee be tried in any manner in which any question or issue in an action may be tried. 51 Mr Sithawalla had spent a considerable amount of time arguing that the Judgment cannot be impugned by Midas as a non-party to the suit, notwithstanding it was a default judgment. The Judgment was valid until it was set aside by the judgment debtor which the latter never did (seePaynaChettiar(infra[34] above)). This court did not disagree with the status of default judgments as pronounced in that case. 52 Equally, this court accepts that the burden of proof in garnishee proceedings is as stated inWestacreInvestment(see [34]) where the Court of Appeal held at [82]; It bears emphasis that a provisional garnishee order is usually obtained by way of anex parteapplication. In such circumstances, we consider that the legal burden remains on the judgment creditor to prove the existence of such a debt if this is disputed by the garnishee and the matter proceeds for determination either summarily or at trial. InZoom Communications Ltd v Broadcast Solutions Pte Ltd[2014] 4 SLR 500 (“Zoom Communications”) (at [75]), we held that a plaintiff retains the burden of showing that Singapore is the proper forum at theinterpartesstage if the foreign defendant who has been served, after the plaintiff succeeded at theex partestage to obtain leave to serve the originating process on a foreign defendant out of jurisdiction, challenges the jurisdiction of the Singapore court. We so held because we considered that in the final analysis, the party applying for the order at theex partestage of the proceedings had the same burden and the fact that it obtained the order at that stage does not mean it had discharged that burden. In our judgment the same principle applies in this case. 53 The appellate court continued at [83]: This conclusion is also borne out by the wording of the provisions that apply when the garnishee disputes liability. Pursuant to O 49 r 5 of the Rules of Court (Cap 322 r 5, 2014 Ed), a garnishee has the right to dispute liability to pay the debt to the judgment creditor after being served the provisional garnishee order.  54 The dilemma faced by this court and the AR below was quite simply this. It was well-nigh impossible to determine from the affidavit(s) whose version should be accepted as to what transpired at the meetings between the parties held on 23 February 2016 and 28 March 2016. The dispute revolved around what was said by Hyun and Hashimoto and whether the former knew and approved of the latter’s signing of the Remittance and Deposit Agreement in [9] regarding the debt owed to the judgment creditor by the judgment debtor and in turn by Midas to the judgment debtor. Moreover, the court cannot without more ignore Hashimoto’s apology dated 21 December 2016.  He should be afforded an opportunity to explain that along with his alleged oral commitment at the meetings to pay the judgment creditor’s claim. 55 The court noted that the English version of the Japanese transcripts of the audio-recordings taken by Takeuchi at those two meetings was done in Japan and not by certified translators recognised by Singapore courts. I was not prepared to accept the accuracy of either those Japanese transcripts or the English translations of the transcripts. As it was impossible for this court (and the AR) to determine which side’s version of what transpired at the meetings should be accepted, I agreed with the AR’s decision that the dispute should go to trial.  In this regard, I adopt the reasoning for the AR’s grounds of decision dated 29 March 2017. 56 The dispute between the parties extended to the rate that Midas could charge to the judgment debtor for its services, with the judgment creditor contending it was limited to 3% while Midas asserted it was a higher rate as penalty provisions had kicked in after the judgment debtor’s alleged breach of the Midas Service Contracts.  This dispute could not be resolved by affidavit evidence alone. 57 This court was further prompted to dismiss the Appeals because it was mindful of what the appellate court inWestacreInvestmentsaid at [86]:  We accept that after a provisional garnishee order has been obtained the legal burden toshow causeas to why the court should exercise its discretion not to make the order absolute lies with the garnishee or the judgment debtor.As a garnishee order is a formof equitable remedy, the court may refuse to make the order absolute if it finds that the attachment of the debt would be inequitable (such as, if it would affect the interests of other persons, prejudice the rights of other creditors, or cause the judgment debtor to be liable for the debt twice). However, this must be contrasted with a situation, such as the present, where the garnishee or the judgment debtor is disputing the liability of the garnishee as opposed to arguing that an attachment would be inequitable or unfair. In our judgment, where the primary liability that governs the intended garnishee proceedings is being disputed, the burden of proof remains on the judgment creditor to prove that a debt as against the garnishee exists. [emphasis added in bold] 58 It bears remembering that the judgment creditor took steps via Summons No 1847 of 2017 (see [19]) to stop Midas’s suit from proceeding further after it was filed. This was not done with altruistic intentions or in compliance with the AR’s directions as the judgment creditor claimed, but to steal a march on Midas, because the judgment creditor had already obtained the Judgment whereas the Midas suit had just commenced.  There was no reason at law for the court to prefer the judgment creditor’s claim over that of Midas as both were trade creditors of the judgment debtor. Midas should not be at a disadvantage just because it did not have a judgment for its claim. 59 I accept the judgment creditor’s complaint that Midas was less than prompt in pursuing its claim for breach of contract against the judgment debtor which to date it should but has yet to quantify. I do appreciate the difficulties Midas may face in maintaining an accurate running account with the judgment debtor relating to voluminous credit card transactions over a considerable period of time and computing the penalty interest rate chargeable. However, now that the AR and this court has made the order for the issue to be tried as to whether it owes a pre-existing debt to the judgment debtor, Midas cannot and can no longer afford to be tardy. Lai Siu ChiuSenior Judge   Moiz Haider Sithawalla and Lau Yu Don (Tan Rajah & Cheah) for the plaintiff;Wong Hin Phin Wendell, Denise Teo and Alexis Loo (Drew & Napier LLC) for the garnishee."
    }
}