{
    "case_title": "Tay Wee Kiat and another vPublic Prosecutor and another appeal",
    "ncitation": "[2018] SGHC 114",
    "coram": "See Kee Oon J (delivering the judgment of the court)",
    "sections": {
        "Introduction": "1 This is our supplementary judgment pertaining to the matter of compensation in respect of the offences committed by the appellants, Tay Wee Kiat (“Tay”) and Chia Yun Ling (“Chia”). Tay and Chia were convicted of various charges relating to their repeated physical abuse of a domestic helper over a span of two years. They were sentenced by the court below to 28 months’ imprisonment and two months’ imprisonment respectively. On appeal, we affirmed their convictions and increased Tay’s aggregate sentence to an imprisonment term of 43 months: seeTay Wee Kiat and another v Public Prosecutor and another appeal[2018] SGHC 42. 2 Following the delivery of our judgment on 2 March 2018, we gave the parties leave to file further submissions to address us on the matter of compensation under s 359 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”). Having considered their submissions, we order that Tay pay compensation to the victim in the amount of $5,900, and that Chia pay compensation to the victim in the amount of $1,900. In this judgment we set out the general principles underpinning criminal compensation, explain how these are to be implemented in practice, and apply those principles to the facts before us. 3 The recent suite of amendments to the CPC via the Criminal Justice Reform Act 2018 (No 19 of 2018), which was passed in Parliament on 19 March 2018, includes amendments to the compensation regime. However, these amendments have not yet come into force. The version of s 359 which is currently operative states: Order for payment of compensation 359.—(1) The court before which a person is convicted of any offence shall, after the conviction, consider whether or not to make an order for the payment by that person of a sum to be fixed by the court by way of compensation to the person injured, or his representative, in respect of his person, character or property by — (a) the offence or offences for which the sentence is passed; and (b) any offence that has been taken into consideration for the purposes of sentencing only. (2) If the court is of the view that it is appropriate to make such an order referred to in subsection (1), it must do so. … (4) Any order for compensation made under subsection (1) shall not affect any right to a civil remedy for the recovery of any property or for the recovery of damages beyond the amount of compensation paid under the order, but any claim by a person or his representative for civil damages in respect of the same injury arising from the offence, shall be deemed to have been satisfied to the extent of the amount paid to him under an order for compensation. (5) The order for compensation made under subsection (3) shall not affect any right to a claim for civil damages for malicious prosecution or false imprisonment beyond the amount of compensation paid under the order, but any claim by the accused for civil damages in respect of the malicious prosecution or false imprisonment shall be deemed to have been satisfied to the extent of the amount paid to him under an order for compensation. 4 When the relevant amendments come into force, s 359 will read as follows: Order for payment of compensation 359.—(1) The court before which an offender is convicted of any offence must, after the conviction, decide whether to make an order for the payment by the offender of compensation to any of the following persons: (a) a person who is injured (in respect of the person’s body, character or property) by any offence — (i) for which the offender is sentenced; or (ii) that is taken into consideration under section 148 when the offender is sentenced; (b) a representative of a person mentioned in paragraph (a); (c) a dependant of a person whose death was caused by any offence — (i) for which the offender is sentenced; or (ii) that is taken into consideration under section 148 when the offender is sentenced. (1A) An order under subsection (1) for the payment of compensation to a dependant of a person whose death was caused by any offence mentioned in subsection (1)(c) — (a) may only be made in respect of — (i) any damages for bereavement that may be claimed under section 21 of the Civil Law Act (Cap. 43) for the benefit of that dependant, in an action under section 20 of that Act; and (ii) if that dependant had incurred funeral expenses in respect of that person, any damages that may be awarded under section 22(4) of the Civil Law Act in respect of those funeral expenses, in an action under section 20 of that Act; and (b) may be made regardless of whether there is any action brought under section 20 of the Civil Law Act for the benefit of the dependants of that person. (1B) An order under subsection (1) for the payment of compensation must specify the amount of the compensation to be paid by the offender under the order. (2) If the court is of the view that it is appropriate to make an order under subsection (1), it must do so. (2A) In a case where subsection (1) empowers the court to make an order for the payment of compensation, the court must, on passing sentence, give reasons if the court does not make such an order. (2B) In deciding whether to make an order under subsection (1) for the payment of compensation, and in deciding the amount to be paid by the offender under such an order, the court must have regard to the offender’s means so far as those means appear or are known to the court. (2C) Before making an order under subsection (1) against an offender, the court may make a financial circumstances order in relation to the offender. (2D) Before the court decides whether to make an order under subsection (1) for the payment of compensation to a person mentioned in subsection (1)(a), a representative mentioned in subsection (1)(b), or a dependant mentioned in subsection (1)(c) — (a) the person, representative or dependant (as the case may be) must be notified, in the manner prescribed in the Criminal Procedure Rules, of the proceedings in which the court will decide whether to make the order; and (b) the person, representative or dependant (as the case may be) is entitled to adduce evidence, and to make submissions, in relation to the order, at those proceedings. (2E) Despite subsection (2D), none of the following persons may appeal under section 377 against an order under subsection (1): (a) a person mentioned in subsection (1)(a); (b) a representative mentioned in subsection (1)(b); (c) a dependant mentioned in subsection (1)(c). … (6) In this section — “dependant” means a person mentioned in section 20(8)(a) to (e) or 21(2)(a) to (e) of the Civil Law Act; “financial circumstances order”, in relation to an offender, means an order that — (a) requires the offender to give to the court, within a period specified in the order, any statement and evidence of the offender’s financial circumstances that the court may require; and (b) if the offender is below 18 years of age, requires a parent of the offender to give to the court, within a period specified in the order, any statement and evidence of the parent’s financial circumstances that the court may require; “parent” includes an adoptive parent.",
        "General principles underpinning criminal compensation": "5 The nature and purpose of the court’s power to order compensation under s 359 of the CPC (and its predecessor, s 401(1)(b) of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“the 1985 CPC”)) have been very helpfully discussed in the cases ofPublic Prosecutor v DonohueEnilia[2005] 1 SLR(R) 220 (“DonohueEnilia”) andSohMeiyun v Public Prosecutor[2014] 3 SLR 299 (“SohMeiyun”). A review of those and other cases reveals the following principles, which should guide the courts in their assessment of when it is appropriate to make such an order, whether under the present s 359 or under the amended s 359. 6 First, s 359 imposes two obligations upon a court before which an offender is convicted of any offence: (1) to consider whether or not to make a compensation order, and (2) to make such an order if it considers it appropriate to do so. There was no such requirement in s 401(1) of the 1985 CPC. Moreover, this duty applies to “anyoffence”, although compensation will not necessarily be appropriate in every case. The amendments to s 359 reinforce the importance of these obligations by requiring a court to give reasons if it choosesnotto make such an order even though s 359(1) empowers it to do so (s 359(2A) of the amended CPC). Should the issue of compensation escape the attention of the trial judge, the Prosecution and Defence should remind the trial judge of these obligations (SohMeiyunat [60]). 7 Secondly, a compensation order does not form part of the sentence imposed on the offender, nor is it an alternative to a sentence, and its purpose is not to punish (DonohueEniliaat [21];SohMeiyunat [56]). For that reason, aggravating factors relating to the offence should find expression in sentencing and not in the quantum of compensation ordered (DonohueEniliaat [61]). Rather, the purpose of compensation is to allow an injured victim or his representative (or, in the case of the amended s 359(1)(c), a dependant of a deceased victim) to recover compensation where a civil suit is an inadequate or impractical remedy. The paradigmatic example of this is where the victim is impecunious (DonohueEniliaat [19];SohMeiyunat [56]). Criminal compensation is a “convenient and rapid means of avoiding the expense of resort to civil litigation when the criminal clearly has means which would enable the compensation to be paid” (R vRoland Joseph Inwood(1974) 60 Cr App R 70 at 73, cited inPublic Prosecutor v Lee Meow Sim Jenny[1993] 3 SLR(R) 369 at [28] andPublic Prosecutor v AOB[2011] 2 SLR 793 at [23]). In brief, it is “a shortcut to the remedy that the victim could obtain in a civil suit against the offender” (SohMeiyunat [56]). 8 Thirdly, compensation ought only to be ordered in clear cases where the fact and extent of damage are either agreed or readily and easily ascertainable on the evidence. This is because compensation is an ancillary power of a criminal court and should not usurp its core functions of trying and sentencing accused persons. Though the court must consider the issue of compensation, this should not assume the proportions of a full-blown inquiry or take on a life of its own. It should not excessively protract the ultimate disposal of the case. Equally, the offender should not be disadvantaged by having the victim’s claim for compensation determined in a criminal forum instead of under the more formal and structured procedure in the Rules of Court (Cap 322, R 5, 2014 Rev Ed). 9 On this basis, the criminal court should adopt “a broad common-sense approach in assessing whether compensation should be awarded” and not allow itself to “be enmeshed in refined questions of causation which may arise in claims for damages under contract law or tort law” (DonohueEniliaat [22]). This means that compensation will usually be inappropriate where it requires the determination of complex issues of apportionment of liability and precise quantification of multiple specific heads of losses (seeDonohueEniliaat [23]–[24] andSohMeiyunat [58]). For example, the court should not order compensation in traffic accident matters where insurable losses need to be quantified, or where the Motor Insurers’ Bureau may step in to afford compensation. Such cases are more appropriately dealt with via civil proceedings. To be clear, this does not mean that the court should only order compensation where the offender agrees to it, since that would defeat the purpose of the provision. But the court should be able to say, with a high degree of confidence, that the damage in question has been caused by the offence under circumstances which would ordinarily entitle the victim to civil damages. 10 If the court determines that it is appropriate to order compensation, how should it quantify the amount? Since criminal compensation is essentially a proxy for civil damages, the amount of compensation ordered should not exceed what would be reasonably obtainable in civil proceedings. In other words, the court may make a compensation order only in respect of the injury or loss whichresults fromthe offence for which the accused is convicted (DonohueEniliaat [21] and [22]). At the same time, the order must not be oppressive, but must be realistic in that the court must be satisfied that the accused will have the means to pay the compensation within a reasonable time (DonohueEniliaat [26];SohMeiyunat [57]). This finds expression in s 359(2B) of the amended CPC, which requires the court to “have regard to the offender’s means so far as those means appear or are known to the court”. 11 Finally, we note that compensation does not necessarily have to be left to the tail-end of the criminal proceedings. Where the accused admits to the offence and is willing to compensate the victim, he should be encouraged to do so at an early stage, even before a plea is recorded. This affords the victim the benefit of early closure and may give him or her some much-needed financial relief, particularly if he or she is unable to work as a result of the offence.",
        "Brief observations on the mechanics of compensation": "12 In our view, a compensation order in a maid abuse case will usually be based on one or more of the following heads of damage: (a) pain and suffering caused to the victim (eg,Public Prosecutor v Foo Chee Ring[2008] SGDC 298 at [260]); (b) medical expenses incurred by the victim (eg,Public Prosecutor v Fok Jun Hong Johnson[2016] SGMC 19 at [117], though this case did not involve a domestic maid); (c) loss or damage to the victim’s property as a result of the offences; and (d) prospective earnings,ie, income that the victim would have earned but for her being unemployed pending the investigation and trial of the offences (eg,Public Prosecutor v Foo Chee Ring[2008] SGDC 298 at [260] andPublic Prosecutor vAnpalaki Muniandy Marimuthu and another[2016] SGMC 56 at [176]). 13 The assessment of loss or damage must be based on some credible evidence and not simply on the Prosecution’s representations (DonohueEniliaat [23]). For example, claims for medical expenses should be substantiated with the corresponding invoices. Where compensation is sought for the victim’s unemployment, as in the present case, some credible explanation should be put forth for the duration of unemployment, bearing in mind that the victim of a tort ordinarily has a duty to mitigate. Any medical reports that are available should be tendered to the court, though the absence of medical reports will not necessarily prevent an order of compensation, particularly where the victim was unable to seek timely medical treatment. 14 The experience of the courts in dealing with victim compensation over the years has shown that the assistance of the investigation officer (“the IO”) is often crucial to the implementation of the compensation regime. While the matter is ongoing, the Prosecution may direct the IO to obtain details of the loss or damage from the victim and guide the victim in compiling the necessary evidence to establish the injury suffered. After a compensation order is made, the IO continues to be involved in facilitating payment from the accused to the victim. IOs are uniquely situated to assist the victim as they are vested with investigative powers and will be familiar with both parties. Their involvement in this capacity will, we hope, be recognised not as a chore or imposition but as a fundamental facet of their role as enforcers of the law. In a well-functioning criminal justice system, thorough investigative work should ensure that factually guilty persons are convicted and sentenced, but this may afford little comfort in practical terms to the victim, who may be left to suffer the consequences of abuse. This is especially true in the case of domestic helpers who have come to Singapore for work, but instead find themselves jobless pending criminal investigations against their employers. An effective mechanism for collection and payment of compensation serves to achieve a more just outcome for such persons and there is no better person than the IO to see this through.",
        "Application to the facts": "15 As the Court observed inSohMeiyunat [56] and [60], criminal compensation isprima facieappropriate in maid abuse cases and should generally be a matter of course because the victims are often, if not invariably, impecunious. It will rarely be feasible for them to pursue civil proceedings while working full-time in their employers’ homes, particularly when they are unfamiliar with the legal system. We accept that that was the case for the victim here, who is now working for another employer. We also consider it appropriate to compensate her for the physical and psychological injuries inflicted by the offenders, for which they would have been liable in tort. 16 In particular, Tay was convicted of inflicting the following injuries on the victim: (a) slapping the victim once, hard, on her left cheek; (b) making the victim stand on a plastic stool on one leg and hold up another plastic stool with one hand while he pushed an empty plastic bottle into her mouth, and making her stay in this position for 30 minutes; (c) pulling the victim by her hand out of the car and onto the ground, causing her to feel pain in her chest; (d) hitting the victim on her head on four occasions, either with a bundle of three canes or with a bamboo stick; (e) kicking the victim on her left waist; (f) pulling the victim by her hair to a room, grabbing her chin and pushing her head such that it hit the edge of a cabinet; and (g) causing another maid, Moe Moe Than, to slap the victim 10 times. 17 Chia was convicted of slapping the victim twice and punching her thrice on her forehead. 18 In our assessment, the victim should be compensated for (1) the pain and suffering she underwent as a result of the offences, and (2) the salary that she would have earned but for being unemployed as a result of the offences. 19 Regarding compensation for pain and suffering, the Prosecution suggested a sum of $500 per incident of abuse, taking into account the physical and psychological harm suffered by the victim. We agree. TheGuidelines for the Assessment of General Damages in Personal Injury Cases(Academy Publishing, 2010) recommend $500 for a single abrasion or contusion and a starting award of $500 to $1500 for multiple contusions on any part of the body. The courts have also awarded similar sums for bruises – for example, $1,500 (bruise on the right side of the face), $1,500 (5cm x 5cm bruise over the medial edge of the left knee) and $500 (small 1cm bruise over left eyebrow) (seePractitioners’ Library – Assessment of Damages: Personal Injuries and Fatal Accidents(LexisNexis, 3rd Ed, 2017) at p 837). Adopting a rough-and-ready measure, since Tay has been convicted of hurting the victim on 10 occasions, this corresponds to a sum of $5,000. For Chia the sum is $1,000. 20 As for prospective earnings, the Prosecution submits that Chia (being the victim’s employer) should pay her $5,400. When the victim left the offenders’ household in December 2012, she had just re-contracted a further two-year employment term with the offenders at a salary of $450 per month. She left for Indonesia in April 2015 and returned to Singapore on 25 August 2015 to work for a new employer. She was therefore unemployed for a period of 32 months in total, of which 23 months could have been spent working for the offenders under her two-year contract. The Prosecution submits that the victim should be compensated for only one year of unemployment ($450 x 12 months = $5,400), bearing in mind that she may not have completed this contract in any event, and that she would have been required to mitigate her loss under the civil law. 21 In our assessment, it would not be right to order the appellants to compensate the victim for the entire period during which she was unemployed. There is no evidence as to why she did not seek or could not have sought alternative employment during that time. However, it is equally unrealistic to expect the victim to have found alternative employmentimmediately. This would have been practically impossible. Moreover, the victim may have needed time to recover from her serious psychological abuse at the offenders’ hands, and could have been understandably reluctant to resume work as a domestic helper in another household. Four months is, in our assessment, a reasonable estimation of the time she would reasonably have required to take on alternative employment. The appellants should therefore compensate the victim for four months of unemployment at her then-salary ($450 x 4 = $1,800). This amount is to be borne equally between Tay and Chia (ie, $900 each).",
        "Conclusion": "22 For the foregoing reasons, we order Tay and Chia to compensate the victim in the amounts of $5,900 (in default four weeks’ imprisonment) and $1,900 (in default ten days’ imprisonment) respectively. Sundaresh Menon  Tay Yong Kwang   See Kee OonChief Justice   Judge of Appeal   Judge Wee Pan Lee and Low Chang Yong (Wee, Tay & Lim LLP) for the appellants in MA 9079/2017/01 and MA 9080/2017/01 and the respondents in MA 9079/2017/02 and MA 9080/2017/02;Kwek Mean Luck, S.C., Tan Wen Hsien, Sarah Shi and Alexander Joseph Woon (Attorney-General’s Chambers) for the respondents in MA 9079/2017/01 and MA 9080/2017/01 and the appellants in MA 9079/2017/02 and MA 9080/2017/02; Monica Chong Wan Yee (WongPartnership LLP) as youngamicus curiae."
    }
}