{
    "case_title": "The “Tian E Zuo”",
    "ncitation": "[2018] SGHC 93",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1 This action arose out of two related collisions on 12 June 2014: (a) the plaintiffs’ vessel, theArcticBridgeof the port of Malta and theStena Provenceof the port of Bermuda; and (b) the defendant’s vessel, theTian E Zuoof the port of Hong Kong and theStena Provence. As a result of the related collisions, the three named vessels sustained hull damage to varying extent. The plaintiffs and the defendant settled with theStena Provencehaving accepted between themselves that theStena Provence, a vessel at anchor, was not at fault at all for the related collisions. In the settlement, both the plaintiffs and the defendant assumed equal responsibility for the damage sustained by theStena Provence. Notably, the settlement was without prejudice to the parties’ right to be indemnified by the other in respect of the claims by theStena Provence. In this action, the plaintiffs contend that the defendant is wholly to blame for the related collisions whereas the defendant by counterclaim argues that the plaintiffs are responsible for the related collisions and must bear 100% blame. 2 The series of events culminating in the related collisions that occurred in Singapore waters, in the Western Petroleum Anchorage B, may be described as most unusual. The detailed facts will be narrated in due course. It suffices to say for now that, factually, theArcticBridgewas a vessel underway when herport anchor or anchor chain entangled the port anchor or anchor chain of theTian E Zuo,which was a vessel at anchor. The entanglement started an involuntary towage of theTian E Zuothat culminated in the related collisions. The defendant contends that the involuntary towage effectively propelled theTian E Zuointo contacting theStena Provencetwice. This judgment will discuss whether there were serious faults in respect of each vessel. In terms of causative potency and blameworthiness, is one party wholly to blame or is one party by far the most at fault. The plaintiffs’ case is founded on the negligence of theTian E Zuoin permitting the vessel to drag her anchor initially and that the earlier anchor drag triggered a chain of events that culminated (about one hour 20 minutes later) in theArctic Bridge’s involvement in the related collisions. The plaintiffs’ reliance on the “but for” test focuses on earlier events and that test will be examined in the light of their argument that there was no break in the chain of events, seeing that theArcticBridgewas forced to move away from her safely anchored position and had to dredge her port anchor because of theTian E Zuo. If the court finds that there were faults on the part of theArctic Bridge, the plaintiffs will rely on the defence of agony of the moment. Whether it applies to the two occasions identified by the plaintiffs’ expert witness will be examined. If the court, on the evidence, is unable to determine the extent of the parties’ blameworthiness, then liability would be apportioned equally under section 1(1) of the Maritime Conventions Act 1911, (Cap IA3, 2004 Rev Ed) (“Maritime Conventions Act”). 3 All time references in this judgment are to Singapore local time (UTC +8). I note that the time points used in the various sources for the occurrence of certain events appear to differ between the parties. However, nothing turns on the differences since the exact timing of the occurrences are immaterial to the outcome of this action.",
        "Background facts leading to the dispute": "",
        "The vessels and her crew": "4 As stated, the related collisions involved first theStena Provenceand theTian E Zuo,and second theStena Provenceand theArcticBridge. Prior to the related collisions, there was an earlier collision that involved theTian E Zuo, theMarine Libertyand theDL Navig8. This earlier collision is not placed before this court as an issue for determination in the present case. TheMarine Libertyis a bunker barge that was supplying bunkers to theTian E Zuoat the material time. TheMarine Libertywas still securely moored to theTian E Zuowhen the latter’s anchor dragged in the prevailing squall. The two vessels drifted into close proximity with theDL Navig8,an oil tanker with a gross tonnage of 30,964 tonnes, breadth of 32.23 metres and an overall length of 189 metres. At 0308 hours theMarine Libertycollided with theDL Navig8. Subsequently, at about 0314 hours, theTian E Zuocollided with theDL Navig8. As a result, these three vessels became hampered by the presence of each other in a way that prevented them from unilaterally manoeuvring to clear and break free. This predicament was the state of affairs that existed from 0330 hours until sometime between 0402 and 0406 hours. TheMarine Libertywas freed at about 0402 hours. It is not clear precisely when theDL Navig8could safely move away from theTian E Zuo. It could have been any time from 0402 hours to 0406 hours. 5 TheArctic Bridgeis a Korean built chemical/oil tanker, constructed in 2005. She has a gross tonnage of 30,053 tonnes, a breadth of 32.2 metres, and an overall length of 183 metres. She is also equipped with a bow thruster of power 950 kW. She was partly loaded with 19,543 tonnes of gasoline at the material time. Two members of her crew testified at the trial. They are: the master of theArctic Bridge, Captain Erik Khuzhin (“Captain Khuzhin”), and the chief officer, Alexander Ignatyuk. 6 TheTian E Zuois a newer and larger Chinese built chemical/oil tanker. She was constructed in 2012, has a gross tonnage of 43,718 tonnes, breadth of 32.26 metres, and an overall length of 228.6 metres. She was loaded with 56,114.984 tonnes of naphtha at the material time. Four members of her crew testified at the trial. They are: (a) the master of theTian E Zuo, Captain Zou Zhizi (“Captain Zou”), (b) Wu Binggao who was the chief officer, (c) Liu Bo the second officer, and (d) Zhang Guangyan (“Zhang”), an able-bodied seaman.",
        "Relative position of the vessels prior to 0247 hours": "7 All the vessels mentioned earlier were in the Western Petroleum B Anchorage at the time theTian E Zuodragged her anchor. The movement of vessels in the anchorage falls under the oversight of West Control of the Maritime and Port Authority of Singapore (“West Control”). It is not disputed that the anchorage was congested at the material time. TheTian E Zuowas anchored by a single port anchor, six shackles deep. She had a north-westerly heading.  TheMarine Libertywas made fast to her starboard side. To the north of theTian E Zuowas the anchored vessel, theKingfisher, to the east was theDL Navig8and slightly further out north-east was theArctic Bridge. 8 The plot in Annex 1 depicts the relative locations of the six vessels(including theKingfisherand theStena Provence) on 12 June 2014 at 0239 hours.1Foot Note 1×DBAEIC Vol II, para 3.2.6 (HS’s Report).This plot was produced by the defendant’s expert, Mr Hakirat Singh s/o Harnek Singh (“Mr Singh”), using Automatic Identification System (“AIS”) data. For context, an AIS is a device that transmits information regarding a ship’s position to a network to allow maritime authorities to track and monitor vessel movements. I have also included other plots (also from Mr Singh’s report) illustrating the position of the vessels at different time periods in this judgment as a graphical reference. These other plots were drawn up with information from the Voyage Data Recorders on board theArctic Bridge, theTian E Zuoand theStena Provence.2Foot Note 2×DBAEIC Vol II, Tab 1, paras 3.5.2.7, 3.5.3.8 & 3.5.4.4 (HS’s Report).These Voyage Data Recorders store, in a secure and retrievable form, information regarding the movement and control of a ship over the period leading up to and following an incident (“VDR”). While these plots are useful, I am mindful of what I have said inThe “Dream Star”[2018] 4 SLR 473 at [13] (“The Dream Star”); that they show what might have happened, not what did happen. The same comments equally apply to the defendant’s video which is supposedly a video replay compilation using extracted VDR data from the VDRs of theArcticBridgeand theTian EZuo. I will elaborate on this video below.",
        "Weather and tide conditions": "9 At 0245 hours, in the light of a developing squall, West Control broadcasted a warning to all ships announcing that “the area [was] experiencing strong winds [, and advised] all vessels … to keep a good anchor watch”.3Foot Note 3×DBAEIC Vol IV, Tab B1, p 160 (HS’s Report).Both experts agreed that the sea was slight to rough after the onset of the squall. 10 According to the defendant’s Preliminary Act, the squall lasted from 0245 hours to 0320 hours. While there was a squall, visibility was moderate. Those on board theArcticBridgeand theTian E Zuowere able to visually see each other for the most part of the entire incident. While Captain Khuzhin claimed that visibility was reduced to a mile, he could nonetheless visually observe that the stern of theTian E Zuohad collided with the bow of theDL Navig8and that both vessels were dragging astern together. He also was able to see that at about 0330 hours, theTian E Zuohad stopped dragging astern with theDL Navig8but theTian E Zuo’sbow started to turn starboard towards theArcticBridge. Captain Khuzhin estimated the distance between his vessel and theTian E Zuoto be about 70 metres. However, Mr Singh has calculated the distance to be 95 metres based on VDR data. 11 Both experts agreed that the tidal steam direction was towards 119° true with a rate ranging 1.25 knots to 1.62 knots between 0245 hours and 0430 hours. While there was initially some dispute over the prevailing wind direction at the material time, I have accepted the prevailing wind direction to be, generally, westerly to south-westerly after 0246 hours. This was the direction stated by the experts in their joint statement. 12 As stated, theTian E Zuodragged her anchor in the early morning of 12 June 2014 during a squall. The plaintiffs’ expert witness, Captain Jonathan Mark Walker (“Captain Walker”) in his supplemental report depicted Captain Khuzhin taking navigational decisions “in a situation where it was dark, heavy rain, strong winds and in a very congested anchorage with another vessel nearby dragging its anchor and colliding”.4Foot Note 4×PBAEIC Vol I, Tab D, para 2.15.2 (HS’s Report).He appeared to suggest that these same conditions prevailed even at 0337 hours, after the squall ended. Captain Walker’s description of the conditions, however, is inconsistent with the other evidence before the court. In his earlier report, Captain Walker said that the winds had abated to a fresh breeze at 0337 hours. Further, the plaintiffs’ Preliminary Act records the visibility as moderate and Captain Khuzhin himself said that he could observe other vessels a mile out prior to 0337 hours.",
        "Factual narrative": "13 TheTian E Zuostarted to drag her port anchor at about 0247 hours. Along with theMarine Libertysecured by mooring lines to her starboard side, theTian E Zuomoved astern in the direction of theDL Navig8. At about 0300 hours, theTian E Zuo’s engines were setat dead slow ahead followed by slow ahead in an attempt to stop her astern movement. However, at about 0308 hours, theMarine Libertycollided into theDL Navig8and thereafter, at about 0314 hours, theTian EZuocontacted theDL Navig8. TheTian E Zuo’s engines stopped around the time of her contact with theDL Navig8.From the communication between the respective vessels and West Control, it is apparent that the three vessels could not unilaterally move apart – their respective mooring line(s) and anchor chain(s) had either become entangled or could become entangled as the vessels were too close to each other. TheTian E Zuo’sstern on the starboard quarter was close to theDL Navig8’s bow. TheTian E Zuocould not use her engines to move away for fear of entanglement as her propeller was too close to the anchor chain of theDL Navig8. 14 As theTian E Zuo,together with theMarine Libertyand theDL Navig8, continued to drift across the anchorage, theTian E Zuo,at about 0320 hours,dropped her starboard anchor. However, despite both anchors being in the water, the three vessels continued to drift together towards theArctic Bridge. At 0330 hours, the drifting ceased and the three vessels came to a stop. 15 TheArctic Bridgehad already noticed these three vessels drawing near and was making preparations to move away. At 0317 hours to 0320 hours, Captain Khuzhin ordered the chief officer to get the engines ready. At 0325 hours, the order to heave theArcticBridge’sport anchor was given and the order was carried out at 0329 hours. Eventually, this activity at the port anchor was abandoned as it was not possible to recover the remainder of the anchor chain in sufficient time and approximately three shackles of anchor cable remained in the water. At 0329 hours, her engines were ready. According to Captain Walker, just after 0331 hours, the engines were set to dead slow ahead. By 0333 hours, theArctic Bridgewas said to be “moving clear” of theTian E Zuo.5Foot Note 5×PBAEIC Vol I, Tab C, para 5.3.4 (JW’s Report).During the conversation with West Control (starting at 0334 hours), theArctic Bridgeconfirmed to West Control that she would be able to shift north-west to another location to anchor. 16 It is useful to set out the Very High Frequency (“VHF”) conversation between West Control and theArctic Bridge:6Foot Note 6×DBAEIC Vol IV, Tab B2, pp 271–272. West Control: ARCTIC BRIDGE currently you are too near to two vessels are you able to shift. Because these vessels are unable to move. Could you please shift? Arctic Bridge: Yes we are trying engines started and we working with the engine and trying to move our back. West Control: If able to could you move further north Sir. There is space uh north, northerly of your position Sir. Or if you want to shift westerly also can Sir. Arctic Bridge: Yes we can heave anchor and move to North West uh where there is a small place for our vessel. West Control: Ok Sir are you confident to shift? … ARCTIC BRIDGE are you confident to shift by your self? Arctic Bridge: …where to move…[inaudible]… Arctic Bridge: Please repeat where to move my vessel. West Control: ARCTIC BRIDGE are you able to shift by your self Sir? Arctic Bridge: Yes, Sir we can move [inaudible]. Now we heaving up anchor … [inaudible]. Arctic Bridge: Yes Sir we can move by our self. Now we heaving up anchor. West Control: Roger roger, thank you. 17 TheArctic Bridgewas to pass north of an anchored vessel, theKingfisherand proceed north-west. However, theArctic Bridgewas not able to do so and moved instead towards theKingfisher. In order to avoid a collision with theKingfisher, Captain Khuzhin said that at about 0337 hours, he ordered slow ahead on the engines and hard to port on the helm. According to the plaintiffs, as theArctic Bridgeturned to port, her bow went through the wind and the tidal stream. With her movement somewhat hampered by the action of the dredging port anchor, theArctic Bridgewas set towards theTian E Zuoin a south-easterly direction, astern. In going astern, theArctic Bridgecrossed the bow of theTian E Zuoat about 0343 hours. Subsequently, at about 0346 hours, theArctic Bridge’s engines were put to slow ahead. Moving ahead, she passed the bow of theTian E Zuoa second time. At about 0349 hours, theArctic Bridgecleared the bow of theTian E Zuo.According to the plaintiffs, theArctic Bridge’s intention was to increase her distance between theTian E Zuo,theMarine Libertyand theDL Navig8. The plaintiffs also indicated that 0350 hours was the most likely time at which the two vessels’ anchors or anchor chains became entangled. The entanglement resulted in theTian E Zuobeing towed by theArcticBridgefor about 20 minutes whilst she proceeded north-west from about 0350 hours. Captain Khuzhin’s affidavit evidence-in-chief stated that, at about 0408 hours, theArcticBridgewas parallel to theStena Provenceat a distance of about 50 metres. At 0410 hours, the bow of theTian E Zuocollided with the port quarter of theStena Provenceat a speed of about 3 knots over the ground. The impact caused the bow of theStena Provenceto turn to port, towards theArcticBridge. At about 0411 hours, the port bow of theStena Provencemade contact with theArcticBridge. At the time of the collision, theArcticBridgewas on a heading of about 284°. TheArcticBridgemaintained her forward movement, towing theTian E Zuoalong after the contact at 0411 hours. As a result, a second collision occurred between theTian E Zuoand theStena Provenceat about 0427 hours. TheArcticBridgecontend that there was also a second collision between theArcticBridgeand theStena Provence. The defendant do not accept this as the second collision was not pleaded at all. 18 I conclude the summary of the factual narrative with a few observations. First, the entire sequence of events spanned over the course of about one hour 40 minutes, from 0247 hours to 0430 hours, on 12 June 2014. Secondly, although theArctic Bridgewas dredging her anchor, she was a vessel underway since 0333 hours. In contrast, theTian E Zuowas a vessel at anchor from 0330 hours up until the time the involuntary towage started at 0350 hours (see [57] below). That theTian E Zuobecame a vessel underway during the period of the involuntary towage will be examined below. Finally, while there were events that occurred after 0430 hours, such as theArctic Bridgeslipping anchor after the related collisions to move away from theTian E Zuo, these events are not material to the question of fault of the two vessels.",
        "Preliminary evidentiary matters": "",
        "Expert opinion": "Divergence in expert opinion 19 Each side called expert evidence on matters of seamanship. The plaintiffs called Captain Walker and, as mentioned, Mr Singh was for the defendant. In urging the court to accept Captain Walker’s views, the plaintiffs compared Mr Singh’s expertise and experience with that of Captain Walker. Their point is that unlike Mr Singh, Captain Walker is an experienced mariner of 18 years who has had the opportunity to command a ship as a master and that his voice of experience should be given weight. 20 Despite the comparison, the plaintiffs did not object to Mr Singh being expert witness. Put simply, the plaintiffs in accepting Mr Singh as an expert to testify in this case were satisfied that the requirements of section 47(2) of the Evidence Act (Cap 97, 1997 Rev Ed) were met. The sub-section provides that a person is qualified to be an expert if he has “scientific, technical or other specialised knowledgebased on training, study or experience” [emphasis added]. In Mr Singh’s case, he acquired his expertise as a master mariner having undergone a formal course of study in nautical science to attain his qualifications, and experience through practice in the course of his work. In brief, Mr Singh has been a Master Mariner (Singapore, Class 1) since 2000. He received training at Singapore Polytechnic in Nautical Studies, and much later pursued further education and training as an expert witness at Bond Solon Cardiff University. He has also conducted a number of casualty investigations (no less than ten instances). I note, in particular, that for some of these investigations, Mr Singh has had to interpret AIS data; data which he is called upon to interpret in the present dispute. 21  The plaintiffs’ objections actually relate to how the court resolves conflicting opinions of expert witnesses. One approach is to consider whether the nature of the issue in question falls within the expert’s particular area of expertise. Yong CJ inTan Mui Teck v Public Prosecutor[2003] 3 SLR(R) 139 at [11] explained that weight may be assigned to the opinion of an expert where his familiarity with a subject is a relevant (though not sole) consideration. When an opinion on navigation of a vessel following the International Regulations for Preventing Collisions at Sea (“COLREGS”) (see the Merchant Shipping (Prevention of Collisions at Sea) Regulations (Cap 179, Rg 10, 1990 Rev Ed), The Schedule) and the dictates of good seamanship is firmly within the realms of navigational judgment, Captain Walker may have an edge over Mr Singh. However, the court will ultimately assess an expert’s opinion in the round, taking into account the independence of the expert and the underlying factual matrix of the case. In this case, for the reasons explained below, the differences of opinion of the experts, in most instances, could be resolved without preferring one view over the other. The differences of opinion between the experts did not have any material influence on the outcome of this action. An expert’s involvement in the casualty investigations 22 The plaintiffs submit that little or no weight should be ascribed to Mr Singh’s evidence as he had “a clear conflict of interest” in acting as an expert in the proceedings.7Foot Note 7×Plaintiffs’ Closing Submissions, para 140.He was criticised for failing to disclose his prior involvement in conducting casualty investigations on behalf of the defendant. There is no merit in the plaintiffs’ assertions. First, Mr Singh did disclose his involvement in the casualty investigations on at least two instances. It is only necessary to refer to the disclosure in Mr Singh’s affidavit dated 1 July 2017 at paragraph 2: “I was involved in the investigations into the collisionsbetween the vessels “STENA PROVENCE” and “TIAN E ZUO” and between “STENA PROVENCE” and “ARCTIC BRIDGE”” [emphasis added].8Foot Note 8×DBAEIC Vol II, Tab 1, p 4, para 2 (HS’s Report).Second, unlike the expert inThe Dream Star(see at [34]), Mr Singh had not improperly supplemented the factual evidence of the crew in his testimony. His evidence was limited to his opinion of the case based on his expertise.",
        "The Avenca video": "23 The plaintiffs introduced a video made by Avenca Limited at the trial (“the Avenca video”). This video was prepared by Dr Neil Baines (“Dr Baines”) along with the staff at Avenca Limited under his charge. The Avenca video purports to be a video replay compilation using extracted VDR data from the VDRs of theArcticBridgeand theTian E Zuo. The plaintiffs submit that the video was “the best objective and most accurate depiction of what happened” and the objections taken by the defendant in respect of the video were unreasonable.9Foot Note 9×Plaintiffs Closing Submissions, para 17.The plaintiffs therefore asked to be awarded all costs connected to the preparation of the video and for bringing Dr Baines to Singapore for the trial. 24 The defendant had identified discrepancies between the video and the VDRs and wished to cross-examine Dr Baines. As it transpired, the defendant’s stance on the matter was not unreasonable. At the trial proper, Dr Baines provided, in his supplemental affidavit of evidence-in-chief, additional information which sought to explain the discrepancy in the rudder angles. This was also the first matter he addressed in the witness box. He explained that there was incomplete information at the time when the video was made in 2015 and since then, had discovered the additional information contained in his supplementary affidavit:10Foot Note 10×Transcript Day 3, p 24, lines 30–31; p 25, lines 1–10. … when we put together the original video we could only find at that stage the actual rudder, well, the piece of data that is indicated to be the measured rudder---rudder angle rather than the ordered rudder angle. Wesubsequently realised that there was informationin the video data which related to the rudder order demands and those are plotted on page 8---on the graph on page 8. So, the blue line is the same rudder angle that appears in the video and the grey and sort of orangey-brown lines are themore recent found data. The point of including it was to illustrate that the rudder angle that was included in the video substantially mimics the other rudder information, but does not appear to have an offset associated with it. [emphasis added] 25 What was put in the video was only information of the rudder sensor angles and not the rudder orders as well. Instead of remaking the video with both information, Dr Baines explained that one would have to look at the video with the added graph from his supplemental affidavit. The graph shows a 7–8° variance in the rudder angle. 26 Dr Baines also accepted that the information that his company put in the video to produce a reconstruction of the events leading to the related collisions was not based entirely on the VDR data of theArcticBridgeand theTian E Zuoalone. For example, the anchoring circles around the bow of each vessel was not from the VDR data. It was based on information from the instructing lawyers and Dr Baines confirmed that he was in no position to verify the information given. In short, Dr Baines had used the information at face value to make the video. 27 In making the video, the defendant would not have had an opportunity to witness the reconstruction and is at liberty to test the common assumptions and premises. The Avenca video is demonstrative or illustrative evidence − demonstrative evidence is not the same thing as real evidence that has independent probative force especially where the basic facts have been proved in the usual way. Thus, “[t]he person who prepared the demonstrative evidence must be called or be available for cross-examination” to vouchsafe its accuracy or fidelity (seeHalsbury’s Laws of SingaporeVol 10 and 10(2) (LexisNexis Singapore, 2016) at para 120.368).",
        "Other preliminary matters": "",
        "Arguments on pleadings": "28 Both sides objected to certain submissions made by the other party on grounds of pleadings. For the plaintiffs, it was the defendant’s reliance onnovus actus interveniens. For the defendant, it was the plaintiffs’ submissions on the incompetence of theTian E Zuo’s crew and lack of bridge team management. 29 I start with the plaintiffs’ objection to the defendant’s reliance onnovus actus interveniensin their closing submissions. The objection on grounds of pleadings is surprising when the plaintiffs have clearly shown themselves to be sufficiently apprised ofnovus actus interveniensas an issue in their two earlier lead counsel’s statements (ie, 20 April 2017 and 2 May 2017) and later, in their opening statement for the trial. 30 I need only refer to one of the lead counsel’s statements and propose to quote the second lead counsel’s statement dated 2 May 2017 where counsel for the plaintiffs, Ms Magdalene Chew (“Ms Chew”), indicated the following as one of the “[a]dditional [i]ssues according to [the] Plaintiff[s]”: Was there anynovus actus interveniens? In particular, were manoeuvres of “AB” in avoiding collision with “TEZ” (which was dragging her anchor) and extracting herself (i.e. AB) from the situation prior to the said collision with SP so unreasonable that they could constitute beingnovus actus interveniensevent(s)? 31  Shortly thereafter, the plaintiffs filed their opening statement on 9 May 2017. Far from suggesting that they were taken by surprise, the plaintiffs developed substantive arguments along the following lines in their opening statement: In order to break the chain of causation, the claimant’s action ‘must constitute an event of such impact that it obliterates the wrongdoing’. It is unlikely that anything less than unreasonable conduct by the claimant will break the chain of causation. Reckless conduct will usually do so, although there is no rule of law that only recklessness is required (Lambert v Lewis[1982] AC 225 (“Lambert v Lewis”)). In the collision context, the principle was described by Lord Wright inThe Oropesa(1943) 4 Ll L Rep 86 at pg. 91 as follows: ‘To break the chain of causation it must be shown that there is something which I will call ultroneous, something unwarrantable, a new cause which disturbs the sequence of events, something which can be described as either unreasonable or extraneous or extrinsic.’ … The Plaintiffs will submit that the focus should not be placed on the individual aspects of the incident; the full circumstances leading up to the collisions must be considered. In other words, the collisions should not be taken in parts. The collisions stemmed from the negligence of TEZ in allowing herself to drag anchor. She was the vessel that created the situation of danger. Not only had AB reacted reasonably, the simple fact is that AB did not create the situation of danger and TEZ should be found liable for the collisions. AB was forced to react due to the negligence of TEZ. AB took reasonable action in the circumstances to avoid a collision with TEZ and there was no break in the chain of causation. 32 The paragraphs quoted above show that the plaintiffs have discerned a case ofnovus actus interveniensfrom the events pleaded in the defendant’s Preliminary Act. There is no merit in the plaintiffs’ objection on grounds of pleadings raised in closing submissions. It cannot be said that the plaintiffs were taken by surprised by the legal conclusion derived from the various intervening events pleaded and it is puzzling why an objection on pleadings is taken at all. As a matter of pleadings, the words of a legal defence need not be specifically pleaded (V Nithia (co-administratrix of the estate of Ponnusamy Sivapakiam, deceased) v Buthmanaban s/o Vaithilingam[2015] 5 SLR 1422 (“V Nithia”) at [43]). Order 18, r 11 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) makes clear that a partymayby his pleadings raise any point of law. It is sufficient that the pleadings disclose thematerial factsso as to give the opponent fair notice of thesubstanceof a case (V Nithiaat [43]). 33 I now turn to the defendant’s objection to the plaintiffs’ submission on the incompetence of the crew on board theTian E Zuo.The defendant observed in its reply submissions that:11Foot Note 11×Defendant’s Reply Submissions, para 4. where incompetency was not pleaded at all, the [defendant] had no opportunity to adduce evidence on the abilities or training of the ‘TEZ’ officers and crew, their knowledge of the vessel, their will, capacity and/or suitability to perform their job. 34 The plaintiffs’ pleaded case against the defendant was directed at the negligence of the crew. At first blush, the plaintiffs’ arguments on the crew’s lack of competency that rendered the crew unsuitable for the role on board in their closing submissions appeared to blur the distinction between negligence and incompetence. Ordinarily, “[i]ncompetence is to be distinguished from negligence”(The “Eurasian Dream”[2002] Lloyd’s Rep 719 at [129(3)]). The incompetence of a crew generally refers to the inadequate ability, training or proficiency of the crew. It usually goes towards issues relating to the seaworthiness of a vessel. Negligence, on the other hand, is concerned with whether the crew had acted in the manner that has fallen short of the standards expected of a seaman of ordinary care and skill in a given situation. While confusingly labelled as the crew’s incompetence, the “incompetence” of the crew on board theTian E Zuois liken to negligence in the circumstances and hence could be termed as negligence. 35 As regards the defendant’s objection to the plaintiffs’ closing submissions on the lack of bridge management, the plaintiffs in their closing submissions accepted that lack of bridge management was not a pleaded issue. Curiously, they urged this court to make a finding on lack of bridge management on the back of the following argument:12Foot Note 12×Plaintiffs’ Closing Submissions, para 60. … full weight should be accorded to this aspect of testimony of the [defendant’s witnesses] given in Court,despite not having been pleaded, as the evidence emerged from the cross-examination of the Defendants’ (sic) witnesses and hence the Court is entitled to make findings based on the same. [emphasis added] 36 Having not sought leave to amend the pleadings in the course of the trial, the plaintiffs’ submission that the court could make a finding on an issue that is not pleaded is plainly wrong.",
        "The plaintiffs’ reliance on the “but for” test": "37 The plaintiffs’ case is that theArcticBridgewas forced to extricate herself from a situation of danger created by the negligence of those on board theTian E Zuoand that the negligence set off a chain of events which culminated in the related collisions. Their approach is that but for theTian E Zuodragging anchor and coming close to theArctic Bridge,the latterwould not have been forced to manoeuvre from her safely anchored position. Thus what happened thereafter was causative of the defendant’s negligence as the entire sequence of events was one continuous incident. 38 The defendant who is represented by counsel, Mr Loo Dip Seng (“Mr Loo”), argues that theTian E Zuo’sanchor drag was causatively irrelevant to the related collisions. TheTian E Zuo’sanchor drag started at 0247 hours but theTian E Zuostopped dragging and drifting at 0330 hours. In short, theTian E Zuowas a vessel at anchor, and what happened after 0330 hours were the consequences of the acts or omissions of theArcticBridgeas the vessel underway in the anchorage. TheArcticBridgeentangled theTian E Zuo’sanchor or anchor chain by 0350 hours and towed theTian E Zuofor about 20 minutes before she was propelled towards the anchored vessel, theStena Provence. That theArctic Bridgecreated the situation described is relevant for it will assist in determining the relative causative potency of each of the vessel’s fault. This consideration is different from the plaintiffs’ reliance on the “but for” test. 39 It is convenient to deal with the plaintiffs’ reliance on the “but for” test at this stage bearing in mind that acceptance of this test as advocated by the plaintiffs would mean that the defendant’s negligence in permitting theTian E Zuoto drag her port anchor at 0247 hours is as a matter of fact and of law the single effective cause or even chronologically the last cause of the related collisions that occurred between theStena Provenceand theTian E Zuoat 0410 hours, theStena Provenceand theArctic Bridgeat 0411 hours, and a second contact between theStena Provenceand theTian E Zuoat 0427 hours. There might have been another second contact between theStena Provenceand theArcticBridgebut this collision, as stated, did not feature in the plaintiffs’ Preliminary Act. 40 There are two limitations with the “but for” test. The first is that there are exceptions to the “but for” test. The second is that the “but for” test is concerned with factual causation; there is a further need to establish legal causation. 41 On the first point, the commentary inMarsden and Gault on Collisions at Sea(Sweet & Maxwell, 14th Ed, 2016) (“Marsden”) is helpful.Marsdenobserved that “[a]lthough in general the principle is that a defendant is liable for damage only if it would not have happened but for his fault, this is not invariably so”. One instance where the “but for” test would be insufficient is where there are multiple causes arising from the faults of the claimant and defendant (seeMarsdenat para 15-005). 42 As stated, the plaintiffs have premised their case on a single causative event and criticises the defendant for “chop[ping] up” the sequence of events leading up to the related collisions.13Foot Note 13×Plaintiffs’ Closing Submissions, para 168(d).I disagree with the plaintiffs’ criticisms as the defendant was simply identifying the existence of other causal events that were left out in the plaintiffs’ analysis. Whilst the defendant accepts that theTian E Zuohad dragged anchor, the defendant drew attention to the other events that played out after theTian E Zuo’s initial negligence. By 0330 hours, theTian E Zuohad become an anchored vessel. At the same time, she could not move away unaided as she had at her stern theMarine Libertyand theDL Navig8. Factually, theArctic Bridgewas the only vessel underway in the vicinity of theTian E Zuo. Given how theTian E Zuoended up contacting theStena Provence, how and why the related collisions happened are relevant matters of fact and law which the plaintiffs have not factored in their reliance on the “but for” test. I will elaborate on this below. For present purposes, it is necessary to assess as a matter of fact, the causal effect of theTian E Zuo’s negligence arising from her dragging anchor on the subsequent manoeuvres of theArctic Bridge. 43 According to Captain Walker, theTian E Zuocommenced dragging anchor at about 0247 hours. She dragged astern and eventually collided into theDL Navig8. At about 0313 hours, theTian E Zuo, theMarine Libertyand theDL Navig8tracked towards theArctic Bridge. Once it became clear that a close quarters situation was developing between the three vessels and theArctic Bridge, the chief officer on board theArctic Bridgealerted Captain Khuzhin of the situation at 0317 hours and he started making preparations to move. However, Captain Walker’s report stated that while there was “sufficient concern on ‘ARCTIC BRIDGE’ for the crew to prepare the engine … the risk of collision had dissipated when the ‘TIAN E ZUO’ subsequently drifted to the south east”.14Foot Note 14×PBAEIC Vol I, Tab C, para 6.1.2 (JW’s Report).Arguably, this assessment goes against the plaintiffs’ depiction of theArctic Bridgeas a vessel that was thrust into a situation of danger that continued to operate throughout until the occurrence of the related collisions. On this alone, it follows that the initial negligence of theTian E Zuocan hardly be said to have an influence over the subsequent manoeuvres taken by theArctic Bridge. 44 Captain Walker, however, indicated a reappearance of a risk of collision between theTian E Zuoand theArctic Bridgeat about 0327 hours. Captain Walker said that at about 0327 hours, an order to heave port anchor was recorded on theTian E Zuo’s VDR transcript and that the heaving of the port anchor caused the vessel to move in a north-westerly direction, across a distance of 86 metres, towards theArctic Bridge.With that in mind, Captain Walker described 0327 hours as a critical period because from about 0327 hours, “[a] risk of collision … returned when those on ‘TIAN E ZUO’ decided to weigh their deployed port anchor”.15Foot Note 15×PBAEIC Vol I, Tab C, para 6.1.3 (JW’s Report).This risk of collision was then said to be the reason for theArctic Bridgehaving to move away from her anchored location and the consequential difficulties that followed:16Foot Note 16×PBAEIC, Vol I, Tab C, para 6.1.1 (JW’s Report). “ARCTIC BRIDGE” should not have needed to recover her anchor as it had been lying safely to anchor since the 10th June 2014. Moreover, “ARCTIC BRIDGE” had safely remained at anchor through the same squall which displaced the anchor of “TIAN E ZUO”. The direct cause of these collisions was the navigators on “TIAN E ZUO” did not exercise good seamanship and allowed their vessel to drag anchor effectively setting off a chain of events, ending with the collisions between the anchored “STENA PROVENCE” and anchored “TIAN E ZUO” and anchored “ARCTIC BRIDGE”. This resulted in “ARCTIC BRIDGE” being placed in a situation, through no fault of her own, so that its Master was forced to recover it anchor in difficult circumstances. Because of the actions on board “TIAN E ZUO” it was not possible for “ARCTIC BRIDGE” to fully recover the anchor to clear the approaching “TIAN E ZUO” so was forced to dredge it to keep clear. In other words, but for theTian E Zuocoming close, theArctic Bridgewould not be forced to dredge her anchor to move away from her anchored location and consequently, would not have experienced the various problems relating to the dredging of the anchor. 45 Mr Singh, in response, pointed out several problems with Captain Walker’s analysis:17Foot Note 17×DBAEIC, Vol V, para 4.4.12 (HS’s Report). Captain Walker refers to the fact that at 0327 hours TEZ’s drift to the east ceases, which I agree with. Further, that at that time the port anchor and cable was probably to the west of TEZ. I agree with this as well. … … Captain Walker also refers to TEZ moving to the north west between 0327 and 0332 hours. However, … the direction of movement is northerly and not north westerly. The distance moved forward, as estimated by me is, that TEZ was 108 metres and not 86 metres as is estimated by Captain Walker. What is baffling, however, is Captain Walker’s attempt to consider TEZ’s movement to the ‘north west’, as he described it, might be due to heaving of the vessel’s port anchor, which he suggests moved the vessel 86 metres in distance. I find this to be an illogical proposition. This is because, any successful heaving of TEZ’s port anchor while it was to the west of TEZ would simply have resulted in the vessel’s bow turning to port, i.e. towards the anchor and certainly not towards the north or northwest. To suggest otherwise would defy the elementary laws of physics. 46 I agree with Mr Singh. First, the allegation that theTian E Zuohad heaved anchorat about 0327 hours was not seriously pursued at trial. Secondly, Mr Singh’s point that as a matter of physics, an attempt at heaving the port anchor would cause theTian E Zuo’sbow to swing to port rather than starboard was not rebutted. Thirdly, in any event theTian E Zuoceased drifting by 0330 hours and this was noticed by Captain Khuzhin. Thus, even if there were an initial danger, this would have ceased after 0330 hours when theTian E Zuostopped drifting and theArctic Bridgeherself started to manoeuvre clear. The actions theArctic Bridgetook after West Control’s VHF conversation at 0334 hours would not have operated under the same circumstances as when theTian E Zuowas initially observed to have dragged anchor towards theArctic Bridge. By 0336 hours, theArctic Bridgehad managed to put some distance between the vessels but at 0341 hours, theArctic Bridgestopped her engines which caused her to be set back onto theTian E Zuo. With that set back, the distance between the two vessels was closer than when theArctic Bridgehad initially moved away from her anchored position. From 0343 hours to 0350 hours, theArctic Bridgetook a course that led to her fouling the anchor or anchor chain of the now anchoredTian E Zuo.Having failed to fully appreciate the fouling and picking up of the anchor or anchor chain of theTian E Zuo,theArcticBridgeended up towing theTian E Zuointo the port quarter of theStena Provence. By reason thereof, new circumstances developed from theArctic Bridge’s manoeuvres. In other words, factually, new causal events arose. 47 The second point on the limitations of the “but for” test relates to legal causation. Causation is made up of two elements – factual and legal causation. While factual causation is an important starting point to any inquiry of causation, it is not the end. Factual causation alone is insufficient to satisfy the second element of legal causation. The interplay between factual and legal causation was enunciated by the Court of Appeal inSunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR(R) 782 at [52]–[54]: The first broad inquiry involves causation, which, as alluded to earlier, is in turn made up of causation in fact and causation in law. Causation in fact is concerned with the question of whether the relation between the defendant’s breach of duty and the claimant’s damage is one of cause and effect in accordance with scientific and objective notions of physical sequence. It is concerned with establishing thephysical connectionbetween the defendant’s wrong and the claimant’s damage. The universally accepted test in this regard is the “but for” test, which we will elaborate on later. However, satisfying the “but for” test is by no means a sufficient condition because the all important “causation in law” test must be satisfied as well.The reason for this is that to adopt the “but for” test without limit would lead to absurd results. To illustrate the potential absurdity, we refer to the example provided byMcGregor on Damages([51]supra) at para 6-008. Consider that a mother gives birth to a son who, when he grows up commits murder. Adopting the question of factual causation, it is clear that if the mother had not decided to have a child in the first place, the murder would never have happened; the “but for” test is amply satisfied. She is thus a cause in fact of the murder by virtue of a physical sequence that is unbroken by scientific and objective notions of logic. Yet, it is equally true that the law regards the mother as bearing no responsibility for the murder on account of lack of negligence or other tortious activity on her part; it is thelawwhich removes her from being a cause of the murder. This is causationin law. The rationale is to prevent indeterminate liability resulting from causation in fact alone. This concern is most aptly summarised inProsser and Keeton on the Law of Torts(West Group, 5th Ed, 1984) at p 266, which we gratefully adopt: It should be quite obvious that, once events are set in motion, there is, in terms of causation alone, no place to stop. The event without millions of causes is simply inconceivable; and the mere fact of causation, as distinguished from the nature and degree of the causal connection, can provide no clue of any kind to singling out those which are held legally responsible. As illustrated by the example just discussed, sometimes, the defendant’s conduct sets off a sequence of events, each one of which is a necessary link in the causal chain between the initial wrong and the claimant’s damage. In such cases, the court has to determine whether any of the intervening events can be said to be so significant causally as to break the causal link to be regarded asnovus actus interveniens.There is usually no dispute as to what in fact happened to cause the claimant’s damage; rather the question is which event will be treated as the cause for the purpose of attributing legal responsibility. The court therefore has to decide whether the defendant’s wrongful conduct constituted the “legal cause” of the damage. This recognises that cause assumes significance to the extent that they assist the court in deciding how best to attribute responsibility for the claimant’s damage … [emphasis in original in italtics; emphasis added in bold-italics] 48 As highlighted by the Court of Appeal, a single act or omission may set in motion a chain of events that provides a factual link between the initial negligence and eventual damage. That said, the court must still determine the legal cause to attribute responsibility. 49  In my view, the problem with the plaintiffs’ case is their approach to the question of causation. They have focused on one single event as the primary causal fault, downplaying other significant events that demonstrate that this is a case involving multiple faults each capable of contributing to the related collisions. In doing so, they have assumed that factual causation as advocated would satisfy legal causation when this is not the case. The position as described is borne out in the plaintiffs’ closing submissions and Captain Walker’s reports. The upshot of this is that Captain Walker expressed minimum views on the entanglement of the anchors or anchor chains of theArcticBridge,a vessel underway, and theTian E Zuo,which was still at anchor, and the subsequent involuntary towage of 20 minutes leading to the related collisions. Expert’s opinion of the events on or after 0350 hours are to be gathered from Mr Singh’s reports. That said, I will have to weigh his evidence together with all the overall evidence when examining the matter. 50 Finally, there is one other related point, namely, the defendant’s reliance onnovus actus interviensraised in response to the plaintiffs’ primary case that the initial negligence of theTian E Zuowas the direct cause of the related collisions. For all the reasons stated in this judgment, it is not necessary to deal with the doctrine in this case. 51 I now turn to the various allegations of faults.",
        "Faults of theArctic Bridge": "52 The defendant draws a distinction between a vessel underway and a vessel at anchor. This distinction is important. A vessel underway is bound, as a matter of seamanship, to keep clear of a vessel at anchor (seeMardenat para 4-036;The“Viper”[1926] 24 Ll L Rep 10 at 11). Indeed, this flows from one of the most important principles underlying good seamanship – the duty to avoid, so far as possible, a close quarters situation (The Owners and/or Demise Charterers of the Ship or Vessel “MCC Jakarta” v The Owners and/or DemiseCharterers of the Ship or Vessel “Xin Nan Tai 77”[2017] HKCFI 981 (“MCC Jakarta”) at [72]). 53 The Hong Kong Court of First Instance in theMCC Jakartaexplained the structure, purpose and objective of the COLREGS as follows (at [71]): the structure of COLREGS is designed to ensure that, whenever possible, ships will not reach a close-quarters situation in which there is risk of collision and in which decisions have to be taken without time for proper thought. 54 Captain Walker references rule 2 of the COLREGS in his report since he regarded the events in this case as exceptional. Rule 2 reads as follows: Rule 2 Responsibility (a) Nothing in these Rules shall exonerate any vessel, or the owner, master or crew thereof, from the consequences of any neglect to comply with these Rules or of the neglect of any precaution which may be required by ordinary practice of seamen, or by the special circumstances of the case. (b) In construing and complying with these Rules due regard shall be had to all dangers of navigation and collision and to any special circumstances, including the limitations of vessels involved, which may make a departure from these Rules necessary to avoid immediate danger. 55 I can do no better than to adopt the explanation of Rix J inThe “Navios Enterprise” and “Puritan”[1998] 2 Lloyd’s Rep 16on this rule. After setting out rule 2 in full, Rix J said at 24: In my judgment these provisions show that they are intended to apply in all circumstances, including special circumstance, albeit due regard should be had to such special circumstances and to the possibility that they may require some departure from the rules in order to avoidimmediatedanger. These principles would seem to be reflections of and to be reflected in the general law. As Mr. Justice Willmer said inThe Velox[1955] 1 Lloyd’s Rep 376 at 382: In those circumstances, it seems to me that, although the measures demanded by the situation may be regarded as exceptional, nevertheless they were no more than those required of a seaman of ordinary care and skill, having regard to the exceptional conditions prevailing. In other words, although no seaman can be called upon to exercise more than ordinary care, when faced by exceptional circumstances he may be required by the standard of ordinary care to take exceptional precautions. 56 Rule 3 sets out the general definitions of the COLREGS. Rule 3(i) defines a vessel “underway” as a vessel that is not at anchor, or made fast to the shore, or aground. Hence, a vessel at anchor in the context of the COLREGS is simply a vessel that is made fast to the seabed by her anchor. Indeed, in the case ofThe“Palembang”[1929] 34 Ll L Rep 5 (“The Palembang”), the court there held that a vessel at anchor is a vessel that is “actually holden by and under the control of her anchor” (at 111). 57 I accept Ms Chew’s submission that theTian E Zuowas not a ship at anchor during the time she dragged her anchor in the prevailing squall (seeThe “Pearl”[2003] 2 Lloyd’s Rep 188 at [46]). It is not disputed that theTian E Zuowas a vessel at anchor from 0330 hours until 0350 hours. During this period, she had two of her anchors in the water. In contrast, theArctic Bridgewas a vessel at anchor before the period 0331 hours and after 0333 hours through to the related collisions, she was a vessel underway. I will explain later why I consider theTian E Zuoto bea vessel underway during the period of the involuntary towage (see [161]–[160] below). 58 Mr Loo, on behalf of the defendant, accepts that theTian E Zuofailed to prevent herself from dragging anchor towards theDL Navig8and that she collided with theDL Navig8at 0314 hours. Mr Loo also accepts that there was poor lookout on board theTian E Zuoduring this period, in breach of rule 5 of the COLREGS (see [95] below), but say that these faults did not result in the entanglement of the anchors or anchor chains of the two vessels, theArctic Bridgeand theTian E Zuo. The defendant further submits that the faults in navigation and seamanship that arose after 0330 hours fall entirely on theArctic Bridgeas the vessel underway. 59 Mr Loo’s concessions on the faults identified in [58] above were proper. With these faults in mind, I turn to the experts who were of the opinion that it was reasonable for theArctic Bridgeto move from her anchored position with three shackles of her anchor chain in the water. The implication of this opinion is that the experts accept that theArctic Bridge’s preparation to move away and her manoeuvres before 0334 hours were reasonable. 60 That said, theArctic Bridge’s manoeuvres and Captain Khuzhin’s decisions on navigational matters should be examined against the backdrop of the VHF conversation between West Control and theArctic Bridgestarting from 0334 hours, and the decision of theArctic Bridgeto shift to another location in the anchorage. As stated above, Captain Khuzhin noticed that theTian E Zuohad stopped drifting by 0330 hours. At 0334 hours to 0335 hours, any close quarters situation or risk of collision apprehended earlier by those on board theArctic Bridgewould have abated, judging from the VHF conversation with West Control (see [16] above). It would appear that theArctic Bridge’s decision to shift to a new location to anchor was not because theTian E Zuowas posing any immediate risk of collision. West Control’s intention at that time was to give theTian E Zuosea room to free herself from theMarine Libertyand theDL Navig8.I have already set out the transcript of the VHF conversation between West Control and theArctic Bridge(see [16] above). In that conversation, theArctic Bridgewas told that theTian E Zuotogether with the two other vessels could not extricate themselves from the aftermath of an earlier collision. I also note that, at the trial, Captain Khuzhin accepted the reason for West Control’s request to theArctic Bridgeto shift was to give sea room to theTian E Zuoto move away from theDL Navig8and theMarine Liberty. For completeness, I now set out the certified translated VDR transcript tendered by the plaintiffs between West Control and theTian E Zuo:18Foot Note 18×Affidavit of Li Yilin, p 23. West Control: Tian E-Zuo, the boat Arctic Bridge in front of you will go north-west for a little bit, can you shift after it goes? Tian E Zuo: The boat in front of me is extremely close to me. It is moving isn’t it? But here’s the problem, the anchor chain of the big boat is below my tanker. My shaft might get intertwined with its anchor chain if I move purposelessly. West Control: Message received, Captain. So now the boat behind you cannot move either, and it has to wait.The boat Arctic Bridge is going to move further, giving you more space, and we’ll see if you could move after it moves. [emphasis added] 61 West Control also informed theDL Navig8that “the ARCTIC BRIDGE [would be] shifting further north … [to] give sufficient space to the TIAN E ZUO” and that theTian E Zuowould thereafter move.19Foot Note 19×DBAEIC Vol IV, Tab B1, p 212 (HS’s Report). 62 Now it is clear that West Control had twice checked with theArctic Bridgewhether she was “confident” to shift to another location on her own, and theArctic Bridge’s reply was in the affirmative (see [16] above). Having seen West Control make similar queries of theMarine Liberty, theDL Navig8and theTian E Zuoin previous conversations, I interpret this query “to shift on your self” (sic) to mean without pilot on board. It was open to theArctic Bridgeto request pilot assistance if she needed it. In addition, theArctic Bridgetold West Control that she was heaving her anchor when in reality she did not complete the task and instead manoeuvred with three shackles of her anchor chain in the water. Thus, to focus on theTian E Zuo’s initial negligence without considering these further aspects of the caseunderscores the defendant’s point on why the present case, after taking into consideration the overall events, is not one involving a single continuous chain of events that originated from theTian E Zuo’s initial negligence. TheArctic Bridge’s faults, if any, must be viewed against the aforementioned circumstances. 63 The parties had devoted considerable time and effort in examining theArctic Bridge’s manoeuvres from 0334 hours to 0336 hours. According to Captain Khuzhin’s affidavit of evidence-in-chief, the manoeuvre to head north-west brought the ship “into the wind”. He ordered starboard 25° on the helm and the engines remained slow ahead. He tried to maintain a heading of about 300° to clear theKingfisher. However, at about 0336 hours, despite the starboard helm ordered, he noticed that theArctic Bridgehad an approximately 10° rate of turn to port in the direction of theKingfisher. He thus ordered the engines to stop as he was concerned with colliding into theKingfisher. Shortly after 0337 hours, he ordered slow ahead and the helm hard to port. He decided that it would be safer to pass to the south of theKingfisherinstead. As a result, theArctic Bridgefound herself in a passage between the stern of theKingfisherand the bow of theTian E Zuo. 64 TheArctic Bridge’sdifficulty in tracking north to a new anchor location north-west of theKingfisherand the reasons for the difficulty– whether it was theArctic Bridge’s dredging anchor action that affected her manoeuvrability or the speed at which she was proceeding on (dead slow ahead) or Captain Khuzhin’s decision not to use the bow thruster, among other things –are matters not determinative of the outcome this case. Hence, it is unnecessary for this court to make a finding on Captain Khuzhin’s seamanship or any breach of the rules in the COLREGS between 0334 hours to 0336 hours. This is because any finding on this point would simply serve to answer the question of why theArctic Bridgefound herself in the passage between the stern of theKingfisherand the bow of theTian E Zuorather than answer the key question as to why the related collisions occurred and who would be legally responsible for the occurrences. In this regard, it bears mentioning my view that the “but for” test as advocated by the plaintiffs does not answer the key question. The overall events show that this case is not one involving a single continuous chain of events that stemmed from theTian E Zuo’s initial negligence. In addition, only faults that are causative are relevant. Not every breach of seamanship or the COLREGS would give rise to a finding of causative fault (The DreamStarat [49]). 65 I now turn to the events that occurred after 0336 hours. TheArctic Bridgehadabandoned the plan to clear north-west of theKingfisherand Captain Khuzhin purportedly decided to clear south of theKingfisher(see [70] below). As mentioned, Captain Khuzhin adjusted his rudder from starboard to helm hard to port shortly after 0337 hours and ordered slow ahead. Between 0338 hours to 0339 hours, Captain Khuzhin ordered midships on helm. In his affidavit of evidence-in-chief, Captain Khuzhin explained that he did so having satisfied himself that theArctic Bridgehadcleared theKingfisher. However, as theArctic Bridgeturned to port, her bow passed through the wind and at about 0339 hours, the wind was almost at her starboard beam. As a result, theArctic Bridgebegan to set bodily to the south-east in the direction of theTian E Zuo. The defendant submits that theArctic Bridgewas at fault for failing to proceed south to clear the stern of theKingfisherbut instead continuing her turn to port, moving towards theTian E Zuo. In the defendant’s view, this constituted a breach of rules 8(a) and (d) of the COLREGS: Rule 8 Action to avoid collision (a) Any action to avoid collision shall be taken in accordance with the Rules of this Part and shall, if the circumstances of the case admit, be positive, made in ample time and with due regard to the observance of good seamanship. (b) Any alteration of course and/or speed to avoid collision shall, if the circumstances of the case admit, be large enough to be readily apparent to another vessel observing visually, or by radar; a succession of small alterations of course and/or speed should be avoided. (c) If there is sufficient sea-room, alteration of course alone may be the most effective action to avoid a close quarters situation provided that it is made in good time, is substantial and does not result in another close quarters situation. (d) Actions take to avoid collision with another vessel shall be such as to result in passing at safe distance. The effectiveness of the action shall be carefully checked until the other vessel is finally past and clear. 66 If theArctic Bridgehad cleared south of theKingfisher, so the argument developed, she would be sailing in the direction away from theTian E Zuoand would have cleared both theKingfisherand theTian E Zuo. In this regard, Captain Khuzhin, during cross-examination, testified as follows:20Foot Note 20×Transcript Day 2, p 55, lines 21–31 to p 56, lines 1–10. Mr Loo: Alright. Let’s go back to the position at 0339 hours. Alright, at this time, do you agree with me that if your vessel had maintained her course, alright, going southwest, she would have cleared both KINGFISHER as well as TIAN E ZUO? Captain Khunzhin: Yes, I agree with that. Mr Loo: Okay. Let’s look at the next minute, 03:40. Alright? Now, your heading has turned portside a little bit, but you’re still pointing southwest. So my question here for you is this, do you agree with me that even now, if you maintain ARCTIC BRIDGE course in this heading by increasing her engine speed, she would have cleared both KINGFISHER and TIAN E ZUO? Captain Khunzhin: Yes. Mr Loo: Alright. Let’s look at 0341, alright. At 0341, your vessel has now moved eastwards and gotten nearer to TIAN E ZUO, alright. But her heading is still southwest but more to the south, okay. So again, I ask you the same question, alright. If you had maintained your vessel’s forward movement with this heading you would have cleared TIAN E ZUO as well as KINGFISHER correct? Captain Khuzhin: Yes, correct. Mr Loo: Okay. Now, up to this point in time, do you agree with me that you never increased engine speed at all? Captain Khuzhin: Yes. 67 Captain Khuzhin accepted that had theArctic Bridgeproceeded forward at an increased engine speed, between 0339 hours to 0341 hours, theArctic Bridgewould have been able to clear both theKingfisherand theTian E Zuo. The significance of Captain Khuzhin’s testimony is that the related collisions would not have happened if the aforesaid manoeuvre were taken. 68 Ms Chew in re-examination sought clarification of Captain Khuzhin’s explanation for not clearing south of theKingfisher:21Foot Note 21×Transcript Day 3, p 15, lines 6–18. Ms Chew: … So can you explain to the Court what you were trying to say? So you’re question was, “Do you agree with me that if your vessel had maintained her course going southwest, she would have cleared both Kingfisher as well as TEZ”? So maybe you can explain to the Court now what you were trying to explain during cross. Captain Khuzhin: What I wanted to say at that moment, yes, I could have distanced myself if I went southwest. But becausethe picture is not representing the positioning of other vessels around this area, so you cannot judge whether this suggested a course heading of southwest was secure or not---safe or not. [emphasis added] 69 I find Captain Khuzhin’s answer in re-examination as an attempt to obfuscate his clear answer during cross-examination. As the radar screenshots of theArctic Bridgeshow, there were no nearby vessels that would have hindered a safe passage forward.22Foot Note 22×ACBOD, pp 178–184 (Radar).Moreover, Captain Khuzhin’s answer did not address his failure to employ a higher engine speed to successfully clear south of theKingfisher. 70 I pause here to note an inconsistency between Captain Khuzhin’s affidavit evidence-in-chief and his oral testimony on the matter of his failure to clear south of theKingfisher. Captain Khuzhin, in his affidavit of evidence-in-chief, expressed difficulty in clearing south of theKingfisherdue to the unfavourable elements that operated against theArctic Bridge. Captain Khuzhin’s answer during re-examination, however, had nothing to do with the wind conditions faced by theArctic Bridgeat the material time. It is clear that the answer he gave during re-examination was a mere afterthought. 71 In justifying theArctic Bridge’s failure to clear south of theKingfisher, Captain Walker opined on something that Captain Khuzhin did not talk about – that the port anchor of the vessel had caught on to something in the seabed and was holding fast:23Foot Note 23×Transcript Day 8, p 114, lines 12–22. Mr Loo: … But what we need to know is this: Had she used a higher engine power, could she have safely cleared both KINGFISHER and TIAN E ZUO? Captain Walker: Yah, but I---I---just saying--- Mr Loo: The answer is “Yes, possible,” right? Captain Walker: Yes, possible. But as I said, from what I have seen of the radar images and certainly the way the vessel was moving, there was a---the---the---the force of the anchor on that vessel was particularly powerful. Whether---whether it caught on something on the seabed, that is what it looks like very, very clearly. It’s caught something. 72 He also explained that under the circumstances, not only would theArctic Bridgebe hampered from proceeding forward, but that if she had done so, the vessel would only be pulled further to port thereby risking a collision with theTian E Zuo.I do not accept Captain Walker’s evidence: there is no factual basis for his opinion, and is at best speculative. 73 In his report, Captain Walker explained that theArctic Bridgewas unable to clear north of theKingfisheras the “dredging was either affecting progress or [the anchor] had been caught on an unknown subsea obstruction”.24Foot Note 24×PBAEIC Vol I, p 368, para 4.5.1.xv (JW’s Report).However, the contention in the report that the anchor had caught an unknown subsea obstruction was made without factual reference. It must be emphasised that in his report, Captain Walker was referring to the port anchor becoming embedded to explain why theArctic Bridgecould not proceed north of theKingfisher. However, at the trial, Captain Walker began to hinge his explanation for various other events on the same speculation. Apart from seeking to justify theArctic Bridge’s failure to clear south of theKingfisheron the basis of the embedded anchor, he later appeared to reason that the astern movement and forward movement of theArctic Bridgeat about 0341 hours to 0350 hours was theArctic Bridge’s attempt to dislodge the embedded anchor.25Foot Note 25×Transcript Day 9, p 134, lines 10–30.However, when asked if he could point out the factual basis of his explanations, Captain Walker could not provide an answer:26Foot Note 26×Transcript Day 9, p 133, lines 28–30; p 134, lines 1–12. Court: Show me the fact that the anchor caught something and impeded the navigation of it - ARCTIC BRIDGE, that is a new situation that the master found himself in and then everything else that happened thereafter was due to the fact that the anchor was imbedded (sic) and he couldn’t move? Captain Walker: Yah, yes. But---but what I would say about that is, like I’m again repeating, it’s not a normal usual thing to do with your anchor--- Court: Yes … But knowing that he had three shackles in the water, he moved and found that his movement was impeded, alright. And then whatever action he took subsequently was really to free his ship. Captain Walker: Yah. Well I think, what he was doing in that particular time, he was---he was very concerned about the close proximity with his bow with KING FISHER. 74 While the weight of the port anchor in the water might have somewhat hampered the manoeuvrability of theArctic Bridge, it is a different matter to assert that the anchor had become embedded into the seabed. An embedded anchor would have been a completely new development quite different from the earlier time theArctic Bridgedredged anchor to move away from theTian E Zuoat around 0331 hours. Moreover, Captain Khuzhin’s evidence did not extend so far as to suggest that the anchor was embedded in the seabed. All that was mentioned is that the weather conditions and the weight of the port anchor in the water had affected the manoeuvrability (or movements) of theArctic Bridge. In any event, had the anchor truly been embedded, theArctic Bridgewould not have been able to navigate as she would have effectively become a vessel at anchor. No such assertion was ever made. For these reasons, I do not accept Captain Walker’s opinion theArctic Bridge’s port anchor had become firmly embedded in the seabed. 75 Apart from his view that theArctic Bridgeought to have increased engine speed and cleared theTian E Zuo,Mr Singh did not provide further assistance in relation to the justifications mentioned by Captain Khuzhin and Captain Walker on the failure to clear south of theKingfisher. 76 With the finding that theArctic Bridge’s anchor was not embedded and was not holding fast to the seabed, coupled with the heading of theArctic Bridgeat the material time (ie, 280.9° at 0337 hours, 263.2° at 0338 hours, 240.9° at 0339 hours and 224.0° at 0340 hours), as well as the fact that it was open to theArctic Bridgeto employ a higher engine speed, it follows that the option to clear south of theKingfisher, putting herself away from theTian E Zuo, was available as a viable option, and I so find. There was no justification as to why theArctic Bridgedid not clear south of theKingfisher. In this regard, the composite failure of theArctic Bridgewas in her not taking this option and in continuing to turn to port, in the direction of theTian E Zuo. I find this to be poor seamanship on theArctic Bridge’s part. 77 Aside from the option to pass south of theKingfisher, the experts also discussed the possibility of theArctic Bridgeholding position to recover her port anchor between 0337 hours to 0341 hours. Although this opportunity to hold position was raised by Captain Walker, he opined that recovery of the port anchor would be difficult and that the decision of Captain Khuzhin’s hard to port order was reasonable in the circumstances. In this respect, Captain Walker in an earlier part of his report said:27Foot Note 27×PBAEIC Vol I, Tab C, para 5.4.5 (JW’s Report). [h]ad [Captain Khuzhin] tried to hold his vessel in position using engine and rudder in such a confined space, it is unlikely that the anchor could be recovered given the potential strain on the cable at this time. If he could only hold the vessel in a position between ‘KINGFISHER’ and ‘TIAN E ZUO’ using engine and helm, he would be reliant on other ships to give him space as he gave ‘TIAN E ZUO’ earlier. 78 He later concluded that:28Foot Note 28×PBAEIC Vol I, Tab C, para 6.1.9 (JW’s Report). However, whilst I believe that there was an opportunity to hold his vessel in position to allow recovery of his anchor after 0336 hours, I can understand the difficulties he faced which resulted in the actions he took at that time. 79 When it came to the trial, Captain Walker explained the difficulty of recovery citing the anchor as being well-embedded in the seabed:29Foot Note 29×Transcript Day 8, p 110, lines 18–28, Mr Loo: Alright? And we have looked at, just now, the relative positions of ARCTIC BRIDGE. Do you still hold that view, that during this period, he could have recovered his port anchor? Captain Walker: His---he would have great difficulty. That’s what I could say. What I---what I’m talking about is actually holding on to the anchor---holding on to the anchor. And if you’re going to hold on to the anchor, then it’s going to be very difficult to---to recover it to start heaving it in. You could try, but it would probably very difficult to do so. This anchor was---this anchor wasreally well-embedded, so it would clearly sh---be difficult to recover it. [emphasis added] 80 I have already rejected as speculative his view that theArctic Bridge’s anchor was well-embedded.Mr Singh’s evidence on the matter is unhelpful. Whilst he considers it pointless to hold position if the anchor cannot be recovered, he does not opine one way or the other whether the port anchor could be recovered if theArctic Bridgeattempted it at that time. I also note that this option was not asked of Captain Khuzhin much less stated in his affidavit of evidence-in-chief that he contemplated recovering the port anchor at that time. In the circumstances, I reach no conclusion on this particular option to recover the port anchor. 81 Continuing with the narrative, between 0341 hours to 0343 hours, theArctic Bridge’s engines stopped.30Foot Note 30×Transcript Day 3, p 56, lines 15–20This resulted in her going astern and eventually coming into close proximity with theTian E Zuo. At about 0344 hours, theArctic Bridgewas effectively in the same position as she was at when she first started to navigate from her anchored position to clear away from theTian E Zuo.The defendant submits that theArctic Bridge’s decision to stop her engines from 0341 hours to 0343 hours was a serious fault as this was the action that resulted in theArctic Bridgedrifting astern and coming into a close quarters situation with theTian E Zuo. The defendant, in particular, highlighted that the decision to stop engines was a breach of rule 8(d) of the COLREGS. 82 According to Mr Singh’s report, there was no reason to stop the engines for two minutes:31Foot Note 31×DBAEIC Vol II, Tab 1, para 4.1.1.17 (HS’s Report). I can see no reason for [theArctic Bridge] to keep engines stopped for two minutes, which in my view was an unwarranted delay given the need for timely actions when faced the scenario as had existed at the material time. Moreover, an experienced mariner would know that drift would be exacerbated if engines are stopped. 83 He further added in his supplemental report that the decision to stop the engines was unreasonable:32Foot Note 32×DBAEIC Vol V, Tab 1, para 4.5.14 (HS’s Report). In fact, [theArctic Bridge] would not have fallen back towards [theTian E Zuo]but for[theArctic Bridge’s master] stopping his engines at about 0341 hours. Because of that, the fact that [theArctic Bridge’s master] stopped his engine from about 0341 to 0343 hours was unreasonable and disclosed a lack of situational awareness. [emphasis in the original] 84 Captain Walker also accepted that it was wrong for Captain Khuzhin to have stopped theArctic Bridge’s engines but he sought to justify the decision:33Foot Note 33×Transcript Day 8, p 118, lines 26–30; p 119, lines 1–12 Mr Loo: Right? But having seen the plots, alright, do you think, alright, it was proper seamanship for him to stop engines for ARCTIC BRIDGE when ARCTIC BRIDGE had just cleared KINGFISHER? She has also got to clear TIAN E ZUO, alright. She had a current coming from northwest setting her southeast. You have the wind, right, ni---westerly. Was it correct decision on his part to stop engine? Captain Walker:Well, obviously, it wasn’t a correct decision because it went towards TEZ.But the---but when you look at the situation, you can actually see the movement of the rotor, the movement of this engine at that particular time. You can see he---that what he was planning was not working. And---and in that moment of time, he decided to stop his engine like he said in his evidence to---to assess his situation. It would have been best, like I earlier said is to---to keep the engine going and try to just hold on the anchor to understand what is going on. … Mr Loo: So whether the anchor was actually caught on something solid and could not be free or perhaps not so solid, do you agree with me that the right thing for him to do at that time was to try and go south-westwards without stopping his engine? Captain Walker: Yes. Yes, I do agree with you. But that is looking back in hindsight. At that particular time, well, the master was facing---he---he was facing a---a---an uncertain situation with an anchor down not knowing what that anchor would actually---how it would affect him at all, and it’s---it’s not going where it wants to go. [emphasis added] 85 Captain Walker’s justification for Captain Khuzhin’s decision to stop the engines – operating under the uncertainties that were the consequences of dredging anchor – is yet another attempt at drawing unwarranted links to the initial difficulties faced by theArctic Bridgewhen she had to dredge anchor to move away from theTian E Zuobefore 0334 hours. I am not persuaded by Captain Walker’s justification. 86 I find that the decision to stop the engines was a serious fault despite Captain Khuzhin’s insistence that having stopped the engines, he did not lose control of the vessel. During re-examination, Captain Khuzhin tried to justify his decision to stop the engines:34Foot Note 34×Transcript Day 3, p 16, lines 5–11. Ms Chew: Captain, why did you disagree with my learned friend when he suggested it was poor seamanship on your part to stop the engine when that meant you would lose control of your ship? Captain Khuzhin: I would have not lost control over my vessel at any time because the engine was ready and I could continue moving at any point in time. I stopped the engine so that I could evaluate the situation. And the main engine was stopped for only 2 minutes. 87 Quite clearly Captain Khuzhin’s claim that he had control of his vessel even though he had stopped the vessel’s engines is unbelievable. The fact of the matter is that having stopped theArctic Bridge’s engines for two minutes, theArctic Bridgedrifted astern and created a close quarters situation with theTian E Zuo, which was a vessel at anchor. As stated at [52] above, a vessel underway is to keep clear of a vessel at anchor. 88 To elaborate on the astern movement, the wind direction between 0341 hours to 0343 hours was in a general south-westerly direction with speeds between 17.5 knots to 25.40 knots; the tidal stream remained at 119° true with a speed of about 1.46 knots. In the two minutes during which her engines stopped, influenced by the elements, theArctic Bridgedrifted astern past theTian E Zuo’s bow. TheArctic Bridgewas observed to go astern, moving from port side to the starboard side of theTian E Zuo, ahead of theTian E Zuo’s bow. TheArctic Bridge’s bow was eventually observed to be almost perpendicular to that of the bow of theTian E Zuo. 89 According to Captain Khuzhin’s affidavit of evidence-in-chief, theArctic Bridge’s bow passed clear of theTian E Zuo’s bow by about 10 to 20 metres, at about 0344 hours. This appears to be Captain Khuzhi’s visual estimate. According to Captain Walker, theArctic Bridge’s port side was approximately 23 metres from the bow of theTian E Zuoat about 0343 hours, as measured from the Avenca video. On the other hand, Mr Singh calculated the distance between the two vessels to be approximately 42 metres at 0343 hours, and approximately 66 metres at 0344 hours (see annex 2 for a graphical depiction of relative position and distance between the vessels at 0344 hours as produced in Mr Singh’s report). Regardless of whichever distance is accepted by this court, in stopping her engines, theArctic Bridgecreated a close quarters situation; sheended up passing theTian E Zuoat an unsafe distance. Far from keeping clear of theTian E Zuo, theArctic Bridgenow found herself in a similar position as she was when theTian E Zuohad dragged towards her almost an hour earlier. I find this to be poor exercise of seamanship on theArctic Bridge’s part as well as failure to take appropriate action to keep clear of theTian E Zuoto avoid collision in accordance with rule 8. 90 Turning now to the events that transpired between 0344 hours to 0351 hours (the defendant uses the timeframe between 0345 hours to 0350 hours; in reality, nothing turns on this difference) when theArcticBridge, in passing ahead crossed the bow of theTian E Zuofor the second time. Between 0345 hours to 0346 hours, theArctic Bridgestopped her engines again andappeared to hold position momentarily. She then increased her engines to half ahead at 0347 hours causing her to move forward and crossed theTian E Zuo’s bow for a second time. According to Mr Singh’s calculations based on VDR data, the vessels were 25 metre apart at 0349 hours, barely an eighth of theArctic Bridge’s length. At 0350 hours, theArctic Bridgeclears theTian E Zuo. At 0351 hours, theTian E Zuo’s heading begins to change – her bow turned, signalling the start of the involuntary towage. After 20 minutes, at about 0410 hours, theTian E Zuowas towed into the port quarter of theStena Provence, a vessel at anchor. Annex 3 provides a graphical depiction, extracted from Mr Singh’s report, of the respective headings and movements of theArctic Bridgeand theTian E Zuobetween 0351 hours to 0408 hours. 91 I consider the manoeuvres and movements of theArctic Bridgefrom 0344 hours to 0410 hours to be critical. This was the period during which theArctic Bridgecrossed the bow of theTian E Zuoand proceeded in the direction of theStena Provencewithout appreciating that she had fouled and picked up theTian E Zuo’s anchor or anchor chain. TheTian Zuowas dragged by theArctic Bridgefor 20 minutes until the first contact between theTian E Zuoand theStena Provence. It is the plaintiffs’ case that throughout this period Captain Khuzhin did not realise that theTian E Zuowas being towed by theArctic Bridge. Even if, for the sake of argument, there were some situational awareness, Captain Khuzhin took no steps at all to avoid the related collisions. 92 For the reasons stated below, I find that the factual causative features of the case to be the crossing of the bow of theTian E Zuoat 0347 hours at an unsafe distance, the entanglement of the vessels’ anchors or anchor chains, the involuntary towage, the distance travelled during the involuntary towage, the speed and heading of theArctic Bridge, and the overall lack of or inadequate situational awarenesson the part of theArctic Bridgethat set theTian E Zuoon a collision course. 93 I must, however, highlight that while the entanglement is a key causal feature, the actual timing of the entanglement is immaterial. In this regard, Mr Singh opined that the anchors or anchor chains were fouled between 0343 hours to 0344 hours, whereas Captain Walker opined that the fouling occurred at around 0350 hours. While both experts could not agree on the precise time at which the anchors or anchor chains fouled, they agreed that this question was “academic”.35Foot Note 35×Transcript Day 9, p 38, lines 19–29; p 43, lines 6–9.I agree; the timing of the entanglement is not determinative of the outcome of this action for two reasons. First, it is not denied that theArctic Bridgefouled theTian E Zuo’s anchor or anchor chain. Secondly, the defendant’s primary case is not dependent on the timing of the entanglement. The defendant’s case is that the direct cause of the related collisions was Captain Khuzhin’s failure to heed West Control’s suggestion to maintain her heading of 245°, proceed for two and a half cables and stop. The point being that had theArctic Bridgestopped, theTian E Zuowould not have been towed towards theStena Provence, irrespective of when the anchors or anchor chains of the vessels had fouled. 94 Returning to the defendant’s submissions, it is the defendant’s case that theArctic Bridgebreached rules 5, 7(a), 7(b) and 8(a) of the COLREGS during this period as not only did theArctic Bridgecrossed ahead of theTian E Zuoat an unsafe distance, theArctic Bridgefailed to appreciate that the anchors or anchor chains of both vessels would likely have fouled as a result. 95 Rule 5 provides: Rule 5 Lookout Every vessel shall at all times maintain proper lookout by sight and hearing as well as all available means appropriate in the prevailing circumstances and conditions so as to make a full appraisal of the situation and of the risk of collision. 96 Rule 5 is an important provision. The failure to keep proper lookout would often mean that other provisions could be breached. To illustrate, if proper lookout were not maintained, the mariner denies himself the opportunity to use all available means appropriate to determine if a risk of collision exists in accordance with rule 7, and accordingly, is unable to take appropriate action to avoid collision in accordance with rule 8. 97 Proper lookout comprises the proper use of sight and hearing, andan appreciation of the situationand the risk of collision (seeMarsdenat para 5-184). I emphasise that merely keeping a lookout without applying one’s mind to the developing situation is not enough. As Gross J inThe “Global Mariner” and “Atlantic Crusader”[2005] Lloyd’s Rep 699 at [80] said: The philosophy of [Rules 5 and 7] is both well known and apparent. They emphasize the need for those on board a vessel tomake a proper appreciation of her situation; assumptions are to be avoided; where there is doubt, a risk of collision is deemed to exist. [emphasis added] 98 Rule 7 reads as follows: Rule 7 Risk of collision (a) Every vessel shall use all available means appropriate to the prevailing circumstances and conditions to determine if risk of collision exists. If there is any doubt such risk shall be deemed to exist. (b) Proper use shall be made of radar equipment if fitted and operational, including long-range scanning to obtain early warning of risk of collision and radar plotting or equivalent systematic observation of detected objects. … 99 Rule 8 (a) is already quoted above at [65]. 100 During cross-examination, Captain Khuzhin agreed that it is wrong to cross the bow of another vessel at close quarters, however highlighted that the circumstances were extraordinary:36Foot Note 36×Transcript Day 2, p 58, lines 12–15. Mr Loo: Okay. Now, would you also agree with me that it is poor seamanship to navigate a vessel, to cross ahead of another vessel’s bow at close quarters? Captain Khuzhin: I agree that it is not advisable to cross the heading of another vessel but you should understand that it was in extraordinary situation. 101  He did not elaborate on why he found the situation extraordinary between 0344 hours to 0350 hours. In Captain Walker’s view, Captain Khuzhin’s decision to cross the bow of theTian E Zuowas reasonable. And this view can be understood in two ways: (a) that the decision to cross the bow was not a fault at all; and (b) even if it were a fault, Captain Khuzhin was justified in doing so given the “extraordinary” circumstance. Taking on the second view (b) first, the plaintiffs’ submit that “[t]here was no other realistic option for [theArctic Bridge] at that time just as there was no other realistic option for [theArctic Bridge] at 0331 [hours]”.37Foot Note 37×Plaintiffs’ Closing Submissions, para 160.Their argument is essentially that at 0344 hours,theArctic Bridgehad found herself back in a position similar to the initial close quarters situation with theTian E Zuoat 0331 hours. Captain Khuzhin simply wanted to get away from theTian E Zuo. The plaintiffs contend that defendant’s criticism has the benefit of hindsight and urge the court to accept Captain Walker’s comparison between the aforesaid two scenarios in that they were both similar; the point being that in both instances theArctic Bridgewas only trying to extricate herself from a situation that started with theTian E Zuodragging anchor at the outset. 102 In reply, the defendant submits that the comparison advanced by Captain Walker is an inappropriate analogy and adds nothing to the analysis. I agree. While it is understandable that as a result of theTian E Zuo’sinitial negligence, theArctic Bridgehad to dredge anchor and thatshe continued to dredge her anchor throughout the events that culminated in the related collisions, the circumstances at 0331 hours and at 0347 hours are different. There are two points to note. First, the plaintiffs again seek to use the same argument which is that theArctic Bridgewas forced by the initial negligence of theTian E Zuoto dredge anchor and that continued to hamper theArctic Bridge’s manoeuvrability. In my view, inasmuch as the dredging of the anchor affected the manoeuvrability of theArctic Bridge, it was not and could not be taken as thesole causeof the difficulties encountered by theArctic Bridgefrom time to time. Secondly, the state of affairs from 0331 hours have changed. Certainly by 0347 hours, an appreciable interval of time has elapsed with different events occurring since 0330 hours, when theTian E Zuobecame a vessel at anchor. TheArctic Bridgeas the vessel underway was obligated to keep clear of the bow of theTian E Zuobut ended up in positions that would serve to compound the risk of fouling the anchors or anchor chains of both vessels; a view held by Mr Singh as well. These reasons reinforce my view that the “but for” test as advocated by the plaintiffs is insufficient to establish both factual and legal causation. As stated, the present case is not one involving a single causal event. 103 Unlike the situation at 0331 hours, where through no fault of her own, theArctic Bridgefound herself in a close quarters situation with three other vessels, the close quarters situation at 0347 hours arose out of her own decision to stop the engines at 0341 hours. In other words, the difference between 0331 hours and 0341 hours is in how the situation in which theArctic Bridgefound herself arose. 104 I now turn to the point at [101] above that the decision to cross the bow was not a fault at all. This relates to the suggestion by the plaintiffs that theArctic Bridgehad crossed or go round the bow of theTian E Zuoas Captain Khuzhin wanted to collect the vessel’s anchor:38Foot Note 38×Plaintiffs’ Closing Submissions, para 123. The Plaintiffs’ expert, JW, gave evidence that the Master of the AB’s decision to go around the bow of the TEZ at about 03:45hr was reasonable because at that time, that was where his anchor was, around the bow, and the Master wanted to go and collect his anchor. [emphasis added] 105 First, Captain Khuzhin’s decision to cross or go around theTian E Zuo’s bow was to get away from the three vessels, theTian E Zuo, theMarine Libertyand theDL Navig8, and not to “collect his anchor”. Accordingly, the suggestion that theArctic Bridgecrossed theTian E Zuo’s bow to collect anchor is an afterthought. Secondly, the mere fact of crossing at an unsafe distance and not keep clear of a vessel at anchor is poor seamanship. Thus whatever is the reason for crossing theTian E Zuo’s bow, and in this case, the reason given was Captain Khuzhin’s purported intention to collect theArctic Bridge’s anchor, is irrelevant. 106 Mr Singh also raised the option of theArctic Bridgeslacking her anchor chains to gain distance and thereafter re-assess the situation at 0347 hours, instead of going around theTian E Zuo’s bow. There was no agreement between the experts on its viability. Given my findings in this judgment, it is unnecessary for me to resolve this debate, which is a peripheral matter. 107 To sum up, in crossing theTian E Zuo’s bow at 25 metres, theArctic Bridgepassed theTian E Zuoat an unsafe distance and failed to fully appreciate the developing circumstances, and I so find. This is a breach of rule 5 and rule 8(a). 108 Turning to the defendant’s primary case (see [93] above), as theArctic Bridgewas crossing theTian E Zuo’s bow, at 0348 hours, West Control contacted theArctic Bridgeand the following conversation took place:39Foot Note 39×DBAEIC Vol IV, Tab B1, p 223 (HS’s Report). West Control: Where are you going to s..uh.. drop anchor over? Arctic Bridge: We are still heaving up anchor, we are have intention to move north west from my position now uh north west uh about uh about half mile to north west. West Control: Ok what is your heading now, what is your heading now? Arctic Bridge: 245° now. West Control: 245°, uhh suggest, ok you continue going 245° about two and a half cables you can drop. 109 The defendant submits that theArctic Bridge’s failure to heed West Control’s advice on where to anchor was a serious fault. This is because theArctic Bridgewas in a position where if she had kept her heading of 245°, proceeded forward and stopped two and a half cables away, theTian E Zuowould not have been eventually towed towards theStena Provence.40Foot Note 40×Defendant’s Closing Submissions, paras 71–72. 110 Captain Walker sought to characterise West Control’s advice as merely a suggestion and nothing more. However, as was pointed out by Mr Loo, regardless of whether West Control’s statement was a suggestion or an instruction, a prudent seaman would consider it since it came from the local port authority with knowledge of the anchorage and on matters of pertaining to navigation in the anchorage; a point which Captain Walker subsequently agreed. Further, if West Control’s suggestion were unsuitable for theArctic Bridge,Captain Khuzhinought to have responded by indicating so. 111 Captain Khuzhin, on the other hand, accepted during cross-examination that had theArctic Bridgecomplied with West Control’s aforesaid suggestion, the related collisions would not have happened:41Foot Note 41×Transcript Day 2, p 62, lines 2–5. Mr Loo: Alright, okay. So do you agree with me that if you had actually complied with West Control’s message, alright, ARCTIC BRIDGE would not have brought TIAN E ZUO into collision with STENA PROVENCE? Do you agree? Captain Khuzhin: Yes. 112 In re-examination, Captain Khuzhin attempted to undo his admission and claimed that he tried to proceed to the direction indicated by West Control but was hampered by the port anchor. This part of the evidence was not in his affidavit of evidence-in-chief. Furthermore, his oral explanation was with hindsight reasoning:42Foot Note 42×Transcript Day 3, p 17, lines 1–12. Captain Khuzhin: Yes, I can explain because we were trying to do so. … Ms Chew: Can you explain what you mean? Captain Khuzhin: We were trying to follow the directions and do 2½ cables in the directions that we were given, but did not manage to do so. Ms Chew: Is there any reason you did not manage to do so? Captain Khuzhin: I think that the reason is what happened later when we entangled the anchor chain of TIAN E ZUO. Ms Chew: Sorry. Can you elaborate? I don’t understand. Captain Khuzhin: In those weather conditions as well with the---our anchor behind the bolts, we were dredging the anchor. We did not manage to go those 2½ cables in the direction noted in a safe manner. To overcome Captain Khuzhin’s admission in cross examination (see [111] above), the plaintiffs resorted to using a list of rhetorical questions at paragraph 165 of their closing submissions. The essence of those questions is this – even if theArctic Bridgehadheeded West Control’s suggestion, the possibility of a collision between theTian E Zuo, theDL Navig8and theMarine Libertyand theArctic Bridgewould nonetheless exist. The rhetorical questions posed by the plaintiffs were most unhelpful and they miss the point. The court is not concerned with any collision, be it between theArctic Bridgeand theMarine Libertyor theArctic Bridgeand theTian E Zuoor theArctic Bridgeand theDL Navig8,but with the related collisions. In any case, the rhetorical questions would not have assisted in overcoming Captain Khuzhin’s admission. The pertinent point here is that theArctic Bridgedid not stop at any point in time prior to the first contact with theStena Provence; an involuntary towage developed at about 0351 hours, and theArctic Bridgeincreased engine speed thereafter – from half ahead at 0351 hours to full ahead at 0401 hours and she continued to go full ahead even after the first contact between theTian E Zuoand theStena Provence,and theArctic BridgeandStena Provence, respectively. 113 This leads me to my next point. The entanglement of the anchors or anchor chains alone would be insufficient to cause the related collisions. For the related collisions to occur, theTian E Zuomust necessarily have been towed from where she was at anchor since 0330 hours into the port quarter of theStena Provence. It would also mean that theArctic Bridgemust have towed theTian E Zuoin a certain direction, at a certain speed, over a certain distance. In this connection, there was sufficient opportunity in the 20 minutes during the towage for the crew on board theArctic Bridgeto have appreciated and avoided physical contact with theStena Provence. This raises the question of whether theArctic Bridgebreached rule 5 of the COLREGS to keep a proper lookout and consequently, rule 7. 114 The defendant’s raised at least three instances of theArctic Bridge’s failure to keep proper lookout; each adding up to the eventual related collisions. 115 First, having passed theTian E Zuo’sbow twice at an unsafe distance and not keeping clear of an anchored vessel, theArctic Bridgeought to have appreciated the risk of fouling anchors. This is especially so since theArctic Bridgewas dredging anchor and theTian E Zuohad both her anchors down. At trial, Captain Khuzhin and his chief officer claimed that they did not know theTian E Zuohad her anchors down. This cannot be true. First, the plaintiffs’ Preliminary Act indicated that theTian E Zuowas seen to be exhibiting anchor lights. Even if the anchor lights could not have been seen given the interference from other light sources, theArctic Bridgemust have known that theTian E Zuohad at least one anchor in the water since theArctic Bridgeknew that theTian E Zuowas dragging one anchor. The very anchor that theArctic Bridgefouled and picked up was the same anchor theTian E Zuohad dragged. Under these circumstances, any suggestion to excuse the fouling of the anchor is without merit. 116 Second, and quite critically, theArctic Bridgeought to have fully appreciated the fact that she was towing theTian EZuo. The plaintiffs submit that theArctic Bridgecould not have discerned the difference between dredging her anchor and towing theTian E Zuo. The plaintiffs further added that theArctic Bridgecould not tell if theTian E Zuowas moving on her own motive power even though Captain Khuzhin had acknowledged in his affidavit of evidence-in-chief that as theArctic Bridgemoved ahead and to the west, he noticed that “the bow of [theTian E Zuo] began to swing to port” and could see theTian E Zuo“follow” theArctic Bridge.43Foot Note 43×PBAEIC Vol I, Tab A, para 69 (Captain Khuzhin’s AEIC). 117 Dealing first with the plaintiffs’ second point that there no way of telling if theTian E Zuowas using her engines during the period of the towage, this assertion is not supported by the objective evidence. TheArctic Bridgewas clearly cognisant of theTian E Zuo’s inability to move. She had remained at the same position with the two vessels at her stern since 0330 hours. I also refer to the transcript of the conversation with West Control at 0334 hours (see [16] above). Under such circumstances, even if theArctic Bridgedid not know the state of theTian E Zuo’s engines, theArctic Bridgewould have, at the very least, observed at 0343 hours that theTian E Zuoand the two other vessels remained entangled and that theTian E Zuohad not moved, contrary to West Control’s earlier message at 0334 hours. In short, a reasonable inference to be drawn from these matters is that theTian E Zuowas incapable of propulsion on her own. 118 Turning to the plaintiffs’ other point, it must be remembered that for more than 20 minutes, approximately between 0351 hours to 0402 hours, theArctic Bridgewas not only towing theTian E Zuobut the two other vessels as well. TheTian E Zuois a significantly larger ship with a gross tonnage of 43,718 tonnes with cargo on board, theDL Navig8weighing 30,964 tonnes and theMarine Libertyweighing 3,828 tonnes. TheArctic Bridgehad steamed at full speed ahead for the most part during the 20 minutes of towing. Yet she did not appreciate that at full ahead she was making speeds of merely one to two knots, going down to a low of 0.9 knots at 0400 hours and a maximum speed of only 3.2 knots over the ground at the time of the first collision between theStenaProvenceand theTian E Zuoat 0410 hours. This in contrast to the vessel’s capacity to travel at 12.8 knots full speed ahead as indicated in the manoeuvring characteristics section of the vessel’s Capacity Plans. Mr Singh said that even taking into account the dredging action of the anchor, the greatly reduced speed of theArctic Bridgewould have been a red flag:44Foot Note 44×Transcript Day 9, p 120, lines 25–30; p 121, lines 1–12. Mr Singh: … It is about the issue of resistance that was just discussed in regards to the resistance from three shackles of an anchor cable and relative to towing TIAN E ZUO, DL NAVIG8 and MARINE LIBERTY. By the time the master of ARCTIC BRIDGE had half ahead or full ahead rpm, one would expect that a master who has been on board his ship for many months would know that given a particular engine order, notwithstanding the 7 or 8 tonnes of weight from an anchor and its shackle, would achieve a certain speed within a certain number of minutes and given that the very low speeds that we---we actually saw ARCTIC BRIDGE attain … it actually shows something is very seriously pulling back on the ARCTIC BRIDGE. So, whether or not the anchor chain could be visually checked is saying secondary. It’s the master’s knowledge of his characteristics and handling of his vessel. That would have told him this rpm has been going for too long and the speed is too low for this rpm. He should know his own ship. … 119 There were multiple indicators of the ongoing towing that ought to concern Captain Khuzhin. Yet Captain Khuzhin did not appreciate that theTian E Zuowas following theArctic Bridgeas the latter navigated westwards away from theTian E Zuo. This was despite knowledge that theArctic Bridgewas dredging anchor, that theTian E Zuohad at least one anchor in the water and that theArctic Bridgecould not achieve her expected engine speed. In these circumstances, a prudent seaman in Captain Khuzhin’s position would have appreciated that his vessel’s anchor chain might have fouled another vessel’s anchor chain. In the premises, I am unable to accept the plaintiffs’ submission that theArctic Bridgewas unaware that she was towing theTian E Zuo. 120 Captain Khuzhin was at fault in failing to observe the tow. Either there was no situational awareness or the lookout was simply inadequate to keep watch on theTian E Zuo, a vessel that theArctic Bridgehad passed and shortly after, noticed a change in the heading. In all probability, the reality was that on the basis of inappropriate factual assumptions as regards theTian E Zuo, Captain Khuzhin paid insufficient attention to the true situation of the towage and nothing was done on board theArctic Bridgeto alleviate the effect of theArctic Bridgepulling theTian E Zuo. As a result, theArctic Bridgedragged theTian E Zuoby her anchor or anchor chain over a distance of about one kilometre across the anchorage. This segues into the point below. 121 Third, theArctic Bridgesailed close to theStena Provenceand that was itself a breach of good seamanship. Those on board theArctic Bridgefailed to keep proper lookout for the presence of anchored vessels like theStena Provence. According to the chief officer of theArctic Bridge, he had theStena Provencein sight at 0400 hours. This was reported to Captain Khuzhin. At about 0408 hours, Captain Khuzhin candidly mentions in his affidavit of evidence-in-chief that theArctic Bridge“had moved up parallel to ‘STENA PROVENCE’ at about 50 metres distant” with theTian E Zuo“still following astern to the starboard” and concluded that theArctic Bridgehad “got closer to ‘STENA PROVENCE’ than … planned”.45Foot Note 45×PBAEIC Vol 1, Tab A, paras 70–71 (Captain Khuzhin’s AEIC).At trial, Captain Khuzhin accepted that his vessel had come into a close quarters situation and that it was wrong for his vessel to have done so. Yet there has been no evidence that at earlier points in time, the crew on board theArctic Bridgehad taken measures to determine her course. This is despite theStena Provenceattempting to contact theArctic Bridgeover VHF for at least five times at 0406 hours. Further, there was at least 10 minutes from the time the chief officer saw theStena Provenceto the point of first contact between theStena Provenceand theTian E Zuo. Had theArctic Bridgeplotted her course during this period, she could have determined a developing close quarters situation or a risk of collision between herself and theStena Provence. Steps could have then been taken to avoid a coming into close quarters with theStena Provence. As Mr Singh explained:46Foot Note 46×DBAEIC Vol II, Tab 1, para 4.7.9 (HS’s Report). had [theArctic Bridge] kept a safe distance from [theStena Provence] the collision with [theStena Provence] may have been prevented or a near miss may have ensued instead of [theTian E Zuo’s] bow colliding with [theStena Provence]. 122 As regards theStena Provenceattempting to contact theArctic Bridgeover VHF for at least five times at 0406 hours, there was no satisfactory explanation why those on board theArcticBridgedid not keep a rule 5 lookout by hearing. By hearing means continually listening to VHF. 123 In his affidavit of evidence-in-chief, Captain Khuzhin attempted to explain that theArctic Bridge’s navigation towards theStena Provencewasthrough no fault of theArctic Bridgeas the “wind in combination with dredging the anchor … made manoeuvring the vessel more difficult”.47Foot Note 47×PBAEIC Vol I, Tab A, para 71 (Captain Kuzhin AEIC).However, at trial, Captain Khuzhin accepted that the port anchor and the north-westerly wind (as he had then incorrectly assessed) would not have pulled the bow of theArctic Bridgeto starboard, closer to theStena Provencebut to port. TheArctic Bridge, therefore, cannot be excused for not keeping clear of theStena Provence,a vessel at anchor. 124 During re-examination Captain Khuzhin added that the anchor might have jumped over from the port side to the starboard side thus resulting in the turn towards theStena Provence. This explanation was neither pleaded nor mentioned in his affidavit of evidence-in-chief. I therefore reject this explanation. 125 In the light of abovementioned acts and/or omissions, I find that theArctic Bridgebreached rules 5 and 7 of the COLREGS. It was the composite failure in appreciating the risk of fouling, the commencement and continuance of the towage without appreciation and assessment of the situation, and not keeping clear of theStena Provencethat was the fault of theArctic Bridge. 126 Before I turn to examine the final timeframe of the incident, there remains the issue of the speed and course of theArctic Bridgemaintainedfrom the start of the involuntary towage to the first contact between theTian E Zuoand theStena Provence. As I mentioned above, the direction and speed at which theArctic Bridgewas sailing would be an important consideration as it is the combination of these factors that set theTian E Zuoon a collision course. In this connection, rule 6 of the COLREGS provides that “[e]very vessel shall at all times proceed at a safe speed so that she can take proper and effective action to avoid collision and be stopped within a distance appropriate to the prevailing circumstances and conditions”. In determining a safe speed, rule 6 also states the factors to be taken into account. These factors include “the state of wind, sea and current, and the proximity of navigational hazards” as well as “the traffic density including concentrations of… any other vessels”. In this vein, rule 8(e) adds that “[i]f necessary to avoid collision or allow more time to assess the situation, a vessel shall slacken her speed or take all way off by stopping or reversing her means of propulsion”. 127 From 0350 hours to 0410 hours, theArctic Bridge’s engine speed increased from slow ahead to full ahead. During this time, theArctic Bridgegradually came close to theStena Provence. The defendant contends that theArctic Bridgeought to have altered her course during this period. Specifically, the defendant highlighted that theArctic Bridgehad persisted on course for theStena Provencefrom 0401 hours to 0407 hours, maintaining helm on midship. TheArctic Bridgeonly went hard to port at 0407 hours. This change in direction would not have significantly altered the trajectory of theTian E Zuoand as matters turned out, the first contact between theTian E Zuoand theStena Provencewas at 0410 hours. As mentioned above at [121], the chief officer had theStena Provencein sight at 0400 hours. There would have been ample time for those on board theArctic Bridgeto appraise and appreciate the situation and for theArctic Bridgeto not only alter her course but also reduce her speed. As this was not done, I agree with the defendant’s contention. 128 Coming now to the final timeframe of the incident, at 0410 hours, theTian E Zuomade contact with the port quarter of theStena Provence. The impact caused theStena Provenceto turn to port towards theArctic Bridge, thereby making contact with theArctic Bridgeat 0411 hours. There was subsequently another set of collisions. While the plaintiffs did not plead any damage in relation to the other set of collisions, this was present in the defendant’s pleadings. According to the defendant, theArctic Bridgecontinued to proceed forward after the first set of collisions and it caused theTian E Zuoto come into contact for the second time with theStena Provenceat 0427 hours.48Foot Note 48×DBAEIC Vol I, Tab 1, p 15, para 50 (Captain Zou’s AEIC); Defendant’s Closing Submissions, para 95.The defendant contends that theArctic Bridgefailed to appreciate the risk of further collisions. I agree. 129 TheArctic Bridgewas sailing full ahead at 0410 hours during the first set of collisions and maintained this speed all the way up to 0414 hours before reducing her speed to below half ahead, and at 0433 hours, to dead slow ahead. At trial Captain Khuzhin accepted that in continuing forward, theArctic Bridgecaused the second set of collisions:49Foot Note 49×Transcript Day 2, p 75, lines 6–16 Mr Loo: Ok, Captain, you see all that? So do you agree with me that in not stopping engines and continuing northwest wards, you had caused the second contact between TIAN E ZUO and STENA PROVENCE? Captain Khuzhin: (no audible answer) Mr Loo: Do you accept that? That is the result of your action in going northwest? Captain Khuzhin: Yes I agree. But after the second contact, I could not stop my vessel. Mr Loo: Alright. That is what you say. Okay. Do you agree with me that if a vessel encounters a collision, alright, the master or the officer in command should assess the situation, and ordinarily he should stop his vessel so as to minimise or mitigate the impact of the collision? Captain Khuzhin: Yes. Mr Loo: Alright. And you agree with me that you did not do this on that occasion, right? Captain Khuzhin: Yes. I thought that there would be more material damages, so how do I stop at that moment? 130 While Captain Khuzhin did express the concern that he was not able to stop theArctic Bridge, he accepted that there were steps he could have taken to have alleviate the situation. In failing to do so, I find that theArctic Bridgehad failed to display good seamanship in the circumstances. 131 In summary, I have found the following to constitute the faults of theArctic Bridge: (a) The failure to clear south of theKingfisherbetween 0336 hours to 0341 hours; (b) The order to stop engines between 0341 hours to 0343 hours which caused theArctic Bridgeto drift into a close quarters situation with theTian E Zuo; (c) The passing ahead and crossing of theTian E Zuo’s bow at close quarters between 0344 hours to 0351 hours thereby increased the risk of fouling and picking up the anchors or anchor chains of both vessels; (d) The failure to stop at any point in time as she proceeded towards theStena Provence. (e) The composite breaches of rule 5 of the COLREGS for failing to appreciate the risk of fouling, the commencement and continuance of the involuntary towage, and the navigation into a close quarters situation with theStena Provencethat was the fault of theArctic Bridge(between 0351 hours to 0410 hours); (f) The speed and direction of theArctic Bridgewhich set theTian E Zuoon a collision course (0351 hours to 0410 hours); and (g) The failure to appreciate a further risk of collision after the first contact between theTian E Zuoand theStena Provence, and theArctic Bridgeand theStena Provencerespectively (between 0410 hours to 0427 hours). Of the faults listed in this summary, only the specific faults that go towards the issue of causative potency or the apportionment of liability will be discussed in this judgment.",
        "Agony of the moment as a defence": "132 The plaintiffs submit that the faults of theArctic Bridgeought to be excused as they were made in the agony of the moment. In thelocus classicuscase ofThe Bywell Castle(1879) 4 PD 219 (“The Bywell Castle”) (seeThorben Langvad Linneberg v Leong Mei Kuen[2013] 1 SLR 207at [82] where the Court of Appeal acknowledgedThe Bywell Castleto have been the likely origin of the doctrine), Cotton LJ enunciated the principle as follows (at 228): For in my opinion the sound rule is, that a man in charge of a vessel is not to be held guilty of negligence, or as contributing to an accident, if in a sudden emergency caused by the default of negligence of another vessel, he does something which he might under the circumstances as known to him reasonably think proper; although those before whom the case comes for adjudication are, with a knowledge of all the facts, and with time to consider them, able to see that the course which he adopted was not in fact the best. 133 In the words of James LJ (at 223): … But I desire to add my opinion that a ship has no right, by its own misconduct, to put another ship into a situation of extreme peril, and then charge that other ship with misconduct. My opinion is that if, in that moment of extreme peril and difficulty, such other ship happens to do something wrong, so as to be a contributory to the mischief, that would not render her liable for the damage, inasmuch as perfect presence of mind, accurate judgment, and promptitude under all circumstances are not to be expected. … 134 And in the speech of Brett LJ (at 226–227): I am clearly of the opinion that when one ship, by her wrongful act, suddenly puts another ship into a position of difficulty of this kind, we cannot expect the same amount of skill as we should under other circumstances. The captains of ships are bound to shew such skill as persons of their position with ordinary nerve ought to shew under the circumstances. But any Court ought to make the very greatest allowance for a captain or pilot suddenly put into such difficult circumstances; and the Court ought not, in fairness and justice to him, to require perfect nerve and presence of mind, enabling him to do the best thing possible. 135 In their submissions, the plaintiffs contend that the agony of the moment “principle applied to two timings”, from 0329 hours to 0331 hours and from 0336 hours to 0343 hours and “continued all the way”.50Foot Note 50×Plaintiffs Closing Submissions, para 133.Having regard to their entire submissions, it is unclear how the plaintiffs have understood the agony of the moment. On the one hand, the plaintiffs seem to suggest that the two time points above frame the period during which the agony of the moment operated. On the other hand, the plaintiffs could have meant that two time points represented separate periods during which the agony of the moment principle applied. The introduction of the phrase “continued all the way” in their closing submissions is an extension which is imprecise. In the light of the aforesaid ambiguities, and to make sense of the arguments, I have viewed the plaintiffs’ case on the agony of the moment as a response to the defendant’s counterclaim. In this regard, insofar as the plaintiffs’ case is that theArctic Bridgewas operating under the agony of the initial negligence of theTian E Zuoin dragging anchor, this would simply be a re-characterisation of the “but for” test as advocated by the plaintiffs and for reasons stated above, the contention is rejected. If the defence of agony of the moment is raised in respect of individual faults of theArctic Bridgeas described above, the defence as a matter of law is not made out. I shall now elaborate. 136 As regards the faults of theArctic Bridgebetween 0337 hours to 0351 hours, the principle is inapplicable because the agony of the moment is a relational concept. As quoted above at [132], “a vessel is not to be held guilty of negligence, or as contributing to an accident, if in a sudden emergencycaused by the default of negligence of another vessel” (emphasis added) (see also the speeches of James LJ and Brett LJ quoted above at [133]–[134]). At 0330 hours, theTian E Zuobecame a vessel at anchor and remained so until the start of the involuntary towage. TheTian E Zuo, at anchor,committed no faults during this period and hence no agony of the moment situation could have arisen. As regards the faults of theArctic Bridgefrom 0351 hours onwards, an agony of the moment situation never arose. There was no sudden emergency during the involuntary towage; theArctic Bridgehad sufficient time to react to the developing close quarters situation with theStena Provencebut simply failed to do so for want of situational awareness and breach of the lookout rule. In any event, the plaintiffs were not specific in the application of the principle during this timeframe. Accordingly, I reject the plaintiffs’ submissions on the agony of the moment defence.",
        "Faults of theTian E Zuo": "137 Having addressed the issue of pleadings and the plaintiffs’ advocated position on the “but for” test, and having regard to the fact that some of the allegations initially pleaded in the plaintiffs’ Preliminary Act were not pursued in their submissions, I now turn to examine the alleged breach of rule 5 by those on board theTian E Zuoafter theArcticBridgefouled and picked up the port anchor or anchor chain of theTian E Zuo(ie, during the period of the involuntary towage). 138 The plaintiffs contend that theTian E Zuowas in a better position to have been aware that she was being towed. Had those on board theTian E Zuobeen keeping proper lookout, they would have noticed that theTian E Zuowas being towed and could have alerted theArctic Bridge. The contention is that theArcticBridgedid not know that theTian E Zuo’sengines was stopped, or if theTian E Zuowas moving on its own engine propulsion. In response, the defendant submits that because theTian E Zuohad two of her anchors in the water andhad been at anchor since 0330 hours, those on board did not expect theTian E Zuoto move and did not immediately understand the reason for her forward movement. The defendant further submits that as a vessel at anchor, she could not be faulted. 139 I propose to deal first with the dispute relating to the lookout on board theTian E Zuobefore turning to address the defendant’s further submissions that as a vessel at anchor, she could not be faulted. For the reasons I will come to in due course, my findings on the faults of theTian E Zuodepart from how the parties have interpreted the evidence; which I do not accept as correct. As I have said elsewhere, “[t]his is not controversial since the court is not bound to confine its decision to the version advanced by the parties, if, as was the case here, the evidence or the reading of it showed otherwise” (KoonSeng Construction Pte Ltd v Chenab Contractor Pte Ltd[2008] 1 SLR(R) 375 at [9]). 140 As stated, the plaintiffs’ position is that those on board theTian E Zuodid not realise that they were being towed as none of the crew members kept a proper lookout. They highlighted that Captain Zou failed to realise that theTian E Zuostarted to move at 0350 hours and that he only noticed that the vessel was moving at 0404 hours. They also emphasised that the second officer, who was supposed to be monitoring the radar, had failed to notice the movement of theTian E Zuo. The chief officer, who was supposed to keep a lookout at the bow of theTian E Zuo, likewise failed to notice that the vessel was moving forward. Captain Zou claimed, in his affidavit of evidence-in-chief, to have only realised that his vessel was moving at 0404 hours and was confused by what was causing the vessel to move ahead. 141 Having examined the overall evidence on this area, I am not persuaded by the plaintiffs’ arguments on poor lookout as they saw it. In this regard, I also do not believe Captain Zou’s testimony that he had only realised that his vessel was moving at 0404 hours and that he was earlier confused by what was causing the vessel to move ahead.51Foot Note 51×Transcript Day 4, p 74, lines 4–29; DBAEIC Vol I, Tab A, para 42.In my judgment, the evidence is to be explained on the footing that those on board theTian E Zuo,to begin with, were more interested in monitoring theMarine Libertyand theDL Navig8as they cleared theTian E Zuo’sstern during the period of time unexpected assistance was being rendered by theArctic Bridge, as she pulled theTian E Zuoaway from her anchored position. Viewed from this assessment of the evidence, it can fairly be said that theTian E Zuofailed in due time to use her engines to keep clear of theStena Provence. Neither did theTian E Zuouse sound signals to warn theArctic Bridge, whose engines had been kept at full ahead all the time that she was pulling theTian E Zuotowards theStena Provence. Specifically, I find that at about 0355/0400 hours Captain Zou appreciated that theTian E Zuowas moving and heading in a similar direction as theArcticBridge. I also find that those on board theTian E Zuohad appreciated the appearance of opportune moments represented by her trailing behind theArcticBridgethat could and did enable theTian E Zuoto come clear of theMarine Libertyand theDL Navig8. I further find that those on board theTian E Zuowaited for theMarine Libertyand theDL Navig8to clear away from her stern and that theTian E Zuo’s engines was ready for use before and by the time Captain Zou gave astern orders at 0407 hours in an attempt to avoid theStena Provence. And I find that theTian E Zuotook belated actions to avoid a collision and that she made contact with the port quarter of theStena Provence. In the context of good watch keeping to determine if any risk of collision exists, I find that theTian E Zuo’s appraisal of the developing situation at her stern did not include a lookout and assessment of the situation in front of her as theArcticBridgenavigated ahead and the presence of the anchored vessel, theStenaProvence. I shall now elaborate on the evidence and the breach of rules 5 and 7 bearing in mind the failures to keep a proper lookout and availability of information to negate the risk of collision. 142 I begin with the question posed by Ms Chew to Captain Zou as to what he was doing at about 0350 hours, when the heading of theTian E Zuowas observed to have changed due to the commencement of the involuntary towage:52Foot Note 52×Transcript Day 4, p 74, lines 4–8. Ms Chew: Yes. That was at 0350. And then at paragraph 40, at 0404, you suddenly realised your own vessel is moving. What were you doing before 0404? Captain Zou: I was observing ARCTIC BRIDGE but at the same time I was also trying to contact the control so that they could send a tug boat because I wanted to move away from DL Navig8. 143 Captain Zou explained that he was trying to contact West Control to arrange for a tugboat to assist theTian E Zuoin moving away from theDL Navig8. This is also borne out in the VHF conversation between West Control and theTian E Zuoas recorded in the certified transcript tendered by the plaintiffs (the transcript records West Control as Port Control; this difference is immaterial).Captain Zou was advised to seek the assistance of an emergency tug to pull theTian E Zuoclear of the two vessels at her stern:53Foot Note 53×Affidavit of Li Yilin, p 56. Port Control: That is feasible if you have ___. You can apply for a pilot if the timing is appropriate, Captain. You know the situation better than me because you are at the scene. I suggest that you use the boat thruster to get your bow out first. Over. Crew 6: But I don’t have a boat thruster. Port Control: Then you should call your agent, if you need an emergency tug. And you can arrange-- Crew 6: I want to apply for a boat thruster and a pilot. Without a thruster, everything would be stuck, and I cannot move. We are seriously too close. Once I move and intertwined its anchor chain, we will all be doomed. 144 At round about the same time, theTian E Zuofound herself moving forward with her anchor cables pulling in opposite directions. As I have mentioned above, at about 0350 hours, the heading of theTian E Zuobegan to turn to port. Her change of heading was a sign of manoeuvring. By 0351 hours, the anchors or anchor chains of both vessels had become entangled. Around this time, those on board began raising suspicions that they were being towed. According to Captain Walker, the second officer was heard on the VDR making the following statements at about 0352 hours: “How come the ship shake so violently”; “The ship shake”; and “It is hit the anchor chain, that ship in the front”.54Foot Note 54×PBAEIC Vol I, Tab C, para 4.4.33 (JW’s Report).However, despite the concerns raised by the second officer in the bridge, there appeared to be no response from Captain Zou who was also there in the bridge. As these statements were made in mandarin, Captain Walker had a colleague provide the translation. At the trial, Mr Loo raised certain doubts as to the accuracy of the translation from Mandarin to English. While the statements highlighted by Captain Walker were not tendered as translations of a qualified translator, I note that Mr Singh, in his report, had also picked up on a similar conversation and indicated that the conversation took place at about 0351 hours:55Foot Note 55×DBAEIC Vol II, Tab 1, para 4.6.1.3 (HS’s Report). Is the anchor caught? Caught the anchor? Is the front anchor? Is it because of the ship in front? No, no, no it left already. 145 Similarly, in a certified translated VDR transcript tendered by the plaintiffs, the conversation on board theTian E Zuowas consistent with a suspicion that the anchor chains of theTian E Zuohad become entangled:56Foot Note 56×Affidavit of Li Yilin, p 56. Master: Is our anchor chain intertwined with the boat in front of us? Crew 1: Is the front boat responsible? Crew 6: No. 146 Although the speakers in the transcript was not clearly identified and that the possibility of entanglement was dismissed, it is plain that the possibility of entanglement was raised and had, at the very least, come to Captain Zou’s attention. 147 As stated, Captain Zou claimed, in his affidavit of evidence-in-chief, to have only realised that his vessel was moving at 0404 hours and was confused by what was causing the vessel to move ahead. He further claimed that he only appreciated that his vessel was being towed after the first contact between theTian E Zuoand theStena Provence, and theArctic Bridgeand theStena Provence, respectively. Captain Zou’s evidence, however, is untenable and I find his testimony unbelievable in the light of the other objective evidence before me. I find that Captain Zou appreciated that theTian E Zuowas moving forward at an earlier point in time, at about 0355/0400 hours, and he also appreciated that his vessel was being towed by theArctic Bridge. Apart from the VDR conversations I have highlighted above indicating suspicion that theArcticBridgehad entangled theTian E Zuo’sanchor chainand was being towed, the affidavits of evidence-in-chief of at least two of the defendant’s witnesses show that those on board noticed signs of the entanglement as early as 0400 hours and that they reported these developments to Captain Zou. The chief officer, who was stationed at the bow of the vessel, in his affidavit of evidence-in-chief, said:57Foot Note 57×DBAEIC Vol I, Tab 2, paras 20–22 (TEZ’s CO AEIC). The “ARCTIC BRIDGE” then went astern, moving back across “TIAN E ZUO”’s bow, passing very close ahead of our ship’s bow at 30 to 40 metres distant. I continued to report the situation to the Master concerning the “ARCTIC BRIDGE”’s movement as she was very close ahead of our ship. After that, as I was standing on the port, Isaw our port anchor cable become very tightand I could see another Kenter shackle above the water level. I was concerned that there was too much weight on our port anchor cable andreported the situation to the Master… … [emphasis added] 148 In short, the chief officer reported two matters to Captain Zou: theArctic Bridgemovement close ahead of theTian E Zuoand the port anchor cable (which was the same anchor that was fouled) becoming “very tight”. 149 Zhang, the able-bodied seaman, stated in his affidavit of evidence-in-chief that he had noticed theTian E Zuomove forward at about 0400 hours:58Foot Note 58×DBAEIC Vol I, Tab 4, paras 16–17 (TEZ’s AB’s AEIC). I was relieved of my duty as helmsman at about 0400 hours by able bodied seaman Deng Zihui. I then went to the bridge wing and saw the “TIAN E ZUO”moving away from the bunker barge and the first vessel we had a collision with. I saw that the “TIAN E ZUO wasmaking way in a forward direction. I went back to the bridge and saw on the radar that “TIAN E ZUO” was moving ahead but that our main engine was on astern movement at that time. 150 Notably, Zhang went off duty when he was stationed at the bow. It was more probable than not that Zhang went to the bridge to report what he saw earlier to Captain Zou. When he got to the bridge wing, he saw theTian E Zuomoving away from theMarine Libertyand theDL Navig8. Inside the bridge, he saw on the radar theTian E Zuomoving forward but the main engine was on astern movement. 151 Besides the crew on board theTian E Zuo,the vessels anchored close by theTian E Zuoalso contemporaneously noticed her moving forward around 0401 hours. Indeed, theDL Navig8was observed to have called West Control at that time stating:59Foot Note 59×DBAEIC Vol IV, Tab B1, p 236 (HS’s Report). DL Navig8: Yes I report again the situation now. So TIAN E ZUOis uh moving. Moving. His vessel and my anchor shackle just holding so just I follow his vessel, just I follow his vessel. So I cannot clear from him. I cannot clear the proper. 152 Shortly thereafter at about 0403 hours, theKingfishercalled West Control regarding the similar sighting:60Foot Note 60×DBAEIC Vol IV, Tab B1, p 238 (HS’s Report). Kingfisher: Yes Sir just wanted to know that the vessel on my port quarter TIAN E ZUO whether the vessel has a pilot on board and they are picking up anchor. 153 Interestingly, the incident report of theTian E Zuosigned by Captain Zou recorded that the following matters happened at 0355 hours:61Foot Note 61×Affidavit of Li Hua, p 30. ARCTIC BRIDGE passed over the bow of the Vessel at a distance of 40 meters (it is estimated that the propeller or the rudder twined onto the port anchor chain of the Swan Vessel), and the Vessel started moving forward. This report, written on the day of the Incident and signed off by Captain Zou, was an exhibit to Captain Zou’s affidavit of evidence-in-chief. This incident report contradicts his affidavit of evidence-in-chief,ie, that he noticed the vessel moving only at 0404 hours. 154 In the light of the overall evidence above, it was more probable than not, and I find, that by about 0400 hours, Captain Zou, the chief officer, the second officer and Zhang were aware that theTian E Zuowas being towed and Captain Zou permitted the towage to continue for a duration of 20 minutes to enable theTian E Zuoto become free of theMarine Libertyand theDL Navig8.I also find the conversations in the bridge telling of the sentiments of those on board even though the time of the conversations and the speakers (in particular crew 6) were not identified by name. The fact of the matter is that the conversations took place:62Foot Note 62×Affidavit of Li Yilin, p 59. Crew 3: The boat is pushed away right? Crew 6:Captain, over here. The boat is leaving. If the situation is steady then things will be solved. The stern is coming out, it’s good. Now the boat… Only if the situation can be steady. Crew 1: How are we supposed to operate with this boat going forward? Master:The power is strong, dragging the anchor forward. Crew 6:This is good. Crew 6:It’s coming out. Crew 6: Noour vessel is still going forward, its moving. Master: No it’s not. Crew 6: No way. There is something wrong. Go ask Chief Officer. Master: Chief Officer, how are the two anchors? Crew 6:It’s too fast. Master: How are the two anchors? Crew 6:We need to astern. We can’t hold on. Master:Can we astern? Crew 6: Yes,yes we can. Too fast, this can’t be good. Master: How many shackles now? Master: The anchor needs to be release. Crew 1: Answer the phone for me. Put the anchor chain backwards. We astern first. Master: We can’t start the engine. Crew 6: Yes we can. Master: It won’t start. [emphasis added] 155 The statement by crew 6 that the stern was “coming out” and that if the “situation” continued to develop favourably, “things will be solved” (meaning the situation with theMarine Libertyand theDL Navig8at her stern) lends support to the view that those on board theTian E Zuowere opportunistic in the circumstances. As it turned out, from the period between 0402 hours to 0406 hours, theMarine Libertyand theDL Navig8were able to disengage from theTian E Zuo. In his affidavit of evidence-in-chief, Captain Zou stated that at 0407 hours, he checked the stern of theTian E Zuobefore ordering slow astern. The time at which Captain Zou checked the stern of theTian E Zuowas after theMarine Libertyand theDL Navig8departed. In short, Captain Zou had hitherto focused on theMarine Libertyand theDL Navig8and I find that Captain Zou had waited for “things to be solved” before deciding to take action to counter the forward movement of the vessel which he, all the while, had appreciated. By the time the astern orders were taken, it was too late and the collision with theStena Provencehappenedat 0410 hours. 156 The plaintiffs, as well as Captain Walker, criticised theTian E Zuo’s crew for failing to keep a lookout and to alert theArcticBridgeof the entanglement and the involuntary towage. It was argued that the crew’s inaction was consistent with incompetence, lack of situational awareness and poor bridge management. In my view, the plaintiffs and Captain Walker, had simply misinterpreted the evidence: what played out was Captain Zou’s decision to capitalise on the unexpected opportunity to free his vessel from theMarine Libertyand theDL Navig8. When queried by Ms Chew on the violent shaking as identified by Captain Walker above,Captain Zou said that he might have been busy at that point in time. On further questioning, he explained that he did not pay attention as he could have been attempting to arrange for a tugboat assistance todisengage theTian E Zuofrom the two other vessels:63Foot Note 63×Transcript Day 4, p 75, lines 10–19. Ms Chew: Right. Okay. Now, there is also some audio captured on the VDR where the officer on watch asked why the ship is shaking so violently around 03:52. Captain Zou: I did not notice this at that time. Maybe I was busy with something at that time. Ms Chew: So you don’t remember anyone telling you the ship is shaking violently? Captain Zou: Yes. … Ms Chew: So what do you think you were busy with at that time? Captain Zou: I was trying to get a tugboat so that I could---we could be separated from DL NAVIG8. 157 His answers are plainly evasive. The testimony of the second officer, the chief officer, and Zhang at trial suggested that those on board theTian E Zuoknew about the towage but simply deferred to Captain Zou’s decision on the towage. The second officer alluded to Captain Zou’s knowledge of the situation and that the crew had to follow Captain Zou’s instructions and could not do things on their own:64Foot Note 64×Transcript Day 6, p 10, lines 1–5; lines 9–15. Ms Chew: Alright. Now between the ARCTIC BRIDGE crossing your bow, 22(b) which is 03:45, and the collision, 22(c) which was at 04:10, can you confirm what you were doing on the bridge? Second officer: I was following the master’s instruction and I was doing what the master told me to do. … Ms Chew: Were you keeping---were you monitoring the ship’s position on the radar still? Second officer: Yes. I was monitoring the movement of the vessels on the radar but I did not record down the exact position of the vessel. Ms Chew: Okay, why did you not notice that your vessel was moving between 03:52 and 04:10? Second officer: Because at that time, the master was also on the bridge and we had to follow the master’s instruction on the bridge, we could not just do things on our own. 158 Similarly, when queried if he found it unusual that the vessel was moving forward despite having two anchors in the water and that the anchors were pulling in opposite directions, the chief officer simply replied stating that he awaited Captain Zou’s orders:65Foot Note 65×Transcript Day 5, p 27, lines 16–22. Ms Chew: Did you not think it was strange that your vessel was moving forward even though the engine was stopped and you had two anchors deployed and that your port anchor chain was forward of your vessel, and your starboard anchor chain was aft of your vessel and both were tight? Did you not find this whole situation very strange? Chief officer: I didn’t really think much about this. I only report this to the master and I waited for his order. 159 The defendant in its closing submissions contends that there was no reasonable opportunity to take steps to alleviate the situation prior to 0407 hours as theMarine Libertywas tied alongside her and theDL Navig8was close to her stern. In other words, theTian E Zuocould not have used her propellers prior to 0407 hours as the two other vessels had not moved away from theTian E Zuo’s stern. I am not persuaded for the reason already stated above. Besides, between 0400 hours to 0410 hours, theTian E Zuocould have contacted theArctic Bridge. In this regard, defendant argues that any attempts to contact theArctic Bridgewould have been in vain as demonstrated by theArctic Bridge’sunresponsiveness to previous attempts. In my view, theArctic Bridge’s unresponsiveness is hindsight reasoning; it does not excuse theTian E Zuofor not contacting theArcticBridge. After all good watch keeping requires the mariner to use all available means and this includes the use of VHF to contact theArcticBridgeor West Control. Moreover, it was open to theTian E Zuoto have sounded warning signals during the period that she was being towed. Indeed, Mr Singh held the opinion that theTian E Zuocould have sounded the appropriate signal when in doubt. In this relation, Rule 34 of the COLREGS provides that: when vessels in sight of one another are approaching each other and from any cause either vessel fails to understand the intentions or actions of the other, or is doubt whether sufficient action is being taken by the other to avoid collision, the vessel in doubt shall immediately indicate such doubt by giving at least five short and rapid blasts on the whistle … 160 As stated earlier, a good watch keeping is to determine if any risk of collision exists. TheTian E Zuodid not keep a proper lookout of what was in front of her, namely the direction of theArcticBridgeand theStena Provence.Those on board theTian E Zuowere concerned with the disengagement of the two vessels at the stern. A good lookout means appreciating and assessing the presence of theStena Provence.In this case, the lookout and consideration of the presence of theStena Provencefell short of good watch keeping. TheStena Provencewas already too close to theTian E Zuoby the time the astern orders were made. Accordingly, theTian E Zuobreached rule 5 and consequently, rule 7 of the COLREGS. 161 I now come to the defendant’s argument that theTian E Zuois to be regarded as a vessel at anchor during the period of the involuntary towage. The defendant, in its submissions, referred me toThe“Foreric”[1926] 24Ll L Rep 329 (“The Foreric”) which was a case involving three vessels and the fouling of anchors. TheSedburghhad anchored too close to theForericand in the course of attempting to move away, picked up theForeric’s anchor and towed the latter into collision with theBelvedere, which was at the relevant time at anchor. In addressing the contention that theForericshould have displayed signals to alert others that they were being towed, the Lordships said that they (at 332): do not consider that this involuntary dragging was ‘towing’ within the meaning of the regulations, and vessels quietly at anchor cannot be expected to have two red lights trimmed for hoisting to show that they are out of control in case of a stranger coming in the night and starting them on an involuntary voyage. 162 TheForericdecision does not assist the defendant. Having had her anchor fouled and finding herself dragged away from her anchored position by theSedburghtowards the direction of theBelvedere, their Lordships began their analysis by treating theForericas a vessel underway (at 331): After the cable connecting theSedburghand theForerichad fouled theBelvedere’s cable, as it must have done, theForericwould have proceeded under the way already on her, and the strain on the cable across her stern, as well as across theBelvedere’scables, would have increased considerably, and probably it then parted and left its mark on theForerics’s stern before the actual collision between the vessels. Having done so, the precise question for their Lordships was whether the manner in which theForericas a vessel underway could be considered a vessel involved in “towing” within the meaning of the relevant regulation and if so, whether she had to exhibit regulation lights. In my view, applying the test inThe Palembang(see [56]) above), a vessel whose anchor has been fouled and picked up by another vessel and consequently dragged away from her anchored position is no longer holden by and under control of her anchor and is therefore not a vessel at anchor. Accordingly, theTian E Zuowas a vessel underway during the period of the involuntary towage. 163 Now the related collisions comprise of two sets of collisions: (a) the contact between theTian E Zuoand theStena Provenceat 0410 hours, and the contact between theArctic BridgeandStena Provenceat 0411 hours; and (b) the contact between theTian E Zuoand theStena Provenceat 0427 hours. I have already dealt with the circumstances leading to the first contact between theTian E Zuoand theStena Provenceabove. As regards the second contact, the collision at 0427 hours was the result of theArctic Bridgecontinuing to navigate full ahead despite having already made contact with theStena Provenceearlier at 0411 hours. After the first contact, theTian E Zuowas observed reducing her engine speed before coming to a complete stop at 0418 hours. TheTian E Zuoremained at the stern of theStena Provenceduring this time; theTian E Zuostopped her engines even though she was still being dragged along by theArctic Bridgeat full ahead. TheArctic Bridgetowed her into a second collision with theStena Provenceat 0427 hours. A good lookout means appreciating and assessing the presence of theStena Provenceand to determine if a risk of collision exists. Not only was there a breach of rule 5, Captain Zou’s decision to stop her engines at 0418 hours meant that he would have no control of theTian E Zuo. There is therefore fault on the part of theTian E Zuofor the collision with theStena Provenceat 0427 hours.",
        "Causative potency and apportionment of liability": "164 I now come to the question of liability. In apportioning liability, the court considers the relative blameworthiness and causative potency of the faults of each vessel. As summarised inThe“Samco Europe” and “MSC Prestige”[2011] 2 Lloyd’s Rep 579 at [81], and subsequently adopted inThe“Nordlake” and the “Seaeagle”[2016] 1 Lloyd’s Rep 656 (“The Nordlake”): Apportionment of [liability] for a collision depends upon an assessment of the blameworthiness and causative potency of both vessels: see theBritish Aviator[1965] 1 Lloyd’s Rep 271 at 277 per Willmer J. The assessment is of the relative degree of responsibility of each vessel … 165 In relation to the relative blameworthiness of the vessels, this is a qualitative as opposed to a quantitative assessment. As Teare J inTheNordlakeputs it, “[th]e number of faults on one side or the other is not decisive. It is the nature and quality of a ship’s faults, rather than their number, that matter” (at [149(i)]). 166 In relation to causative potency, the court is concerned with the causative impact each fault has on the eventual collision and loss. To use the words of the court inThe Nordlake(at [149(iii)]): Causative potency has two aspects. The first is the extent to which the fault contributed to the fact that the collision occurred. The second is the extent to which the fault contributed to the damage. 167 I have earlier identified the factual causative features of this case that culminated in the related collisions (see [92] above); namely, the crossing of the bow at 0347 hours, the entanglement, the involuntary towage, the distance travelled during the towage, the speed and heading of theArctic Bridge, and overall lack of situational awarenessand manifest inaction(s) that set theTian E Zuoon a collision course. This is because it is the accretive effect of each of these features present in this case that resulted in the related collisions and the damage sustained by the vessels. Thus, in terms of the causative potency of theArctic Bridge’s faults, it is theArctic Bridgein crossing port to the bow of theTian E Zuoat an unsafe distance, at about 0347 hours, and thereafter, proceeding full ahead in the direction of theStena Provencewithout stopping and without keeping a good visual lookout and monitoring the progress of theTian E Zuoat her stern, that were the faults that linked theArctic Bridge’s negligence with the damage sustained in the related collisions. By so doing, the effect of the entangled anchor chains on the related collisions manifested: the entangled anchors or anchor chains enabled theArctic Bridgeto drag theTian E Zuofrom her anchored position, and without fully appreciating that theArctic Bridgewas dragging theTian E Zuo, an involuntary towage lasting 20 minutes at full ahead in the direction of theStena Provenceensued, and culminated in the first contact at 0410 hours. Further, despite having contacted theStena Provenceherself at 0410 hours, theArctic Bridge(whether or not fully appreciating that she was still towing theTian E Zuo) continued to navigate full ahead thereby dragging theTian E Zuointo a second collision at 0427 hours. The causal link to the further damage to theStena Provenceand theTian E Zuo,was theArctic Bridge’s failure to take preventive action(s) to prevent the second collision. 168 Turning then to the causative potency of the faults of theTian E Zuo, her failureto keep proper lookout ahead of theTian E Zuofor theArctic Bridgeand theStena Provencemust be taken to be causatively potent as it contributed to the eventual related collisions. I have earlier found that theTian E Zuowas a vessel underway during the involuntary towage and also explained that vessels underway have an obligation to keep clear of other anchored vessels. In taking advantage of the involuntary towage, theTian E Zuo’sattention was focused on disengaging herself from the two other vessels at her stern and failed to fully appreciate the presence and proximity of theStena Provence. Put another way, Captain Zou had not given particular attention to theStena Provenceany earlier than 0407 hours. Whilst Captain Zou took no action with reference to theArctic Bridge,theTian E Zuotook action with reference to theStena Provencetoo late to be effective to avoid the eventual collision. Thus inasmuch as theArctic Bridgeis to be blamed for the dragging theTian E Zuointo the port quarter of theStena Provence, theTian E Zuo’s delayed action to avert a collision with theStena Provencealso reflects her contribution to the related collisions. I have also considered theTian E Zuostopping her engines at 0418 hours when theArctic Bridgestill continued to sail at full ahead pulling theTian E Zuoas a fault that is causatively potent as this contributed to the second contact between theTian E Zuoand theStena Provence. 169 In terms of the relative blameworthiness, there were serious faults as described in respect of each vessel. Having regard to the causative potency and blameworthiness, both vessels are equally to blame and a fair apportionment is 50:50.",
        "Conclusion": "170 For the reasons stated, I concluded that responsibility for the collision must be divided equally between both vessels for the related collisions. There will be judgment on the claim and counterclaim accordingly. As the issues in the main action and the counterclaim overlap, there ought to be one set of costs. The parties are to make submissions by letter (limited to two pages) on how the issue of costs should be dealt with, bearing in mind that damages have to be assessed before the Registrar. The submissions on costs are due ten days from this judgment. Belinda Ang Saw EanJudge Chew Sui Gek Magdalene, Lee Soo Pin Victoria and Wong Teck Ming (AsiaLegal LLC) for the first and second plaintiff;Loo Dip Seng and Tan Siew Chi (Ang & Partners) for the defendant.",
        "Annex": "A.1 Annex 1: Relative position of the vessels as produced in Mr Singh’s report.   A.2 Annex 2: Relative position and distance between the vessels at 0344 hours as produced in Mr Singh’s report.   A.3 Annex 3: Graphical depiction of the movement of theArctic Bridgeand theTian E Zuobetween 0351 hours to 0408 hours as produced in Mr Singh’s report."
    }
}