{
    "case_title": "Zolton Techs Singapore Pte LtdvTan Chew Sim(Chow Hoo Siong, third party)",
    "ncitation": "[2018] SGHC 160",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Facts": "3 The plaintiff to this suit is Zolton Techs Singapore Pte Ltd, a company set up by the third party in 2004 and involved in the business of supplying and maintaining machineries used for the production of food and beverages. The third party is a director and majority shareholder of the plaintiff, holding 90% of its shares. 4 The defendant, Ms Tan Chew Sim who is also known as Zoanne, was appointed a director of the plaintiff sometime in October 2006, shortly prior to her marriage to the third party. 5 Unfortunately, the marriage between the defendant and the third party did not last, with the defendant obtaining an expedited personal protection order against the third party in April 2011 and subsequently filing for divorce in September 2011. Interim judgment for divorce was granted in December 2013, and the parties’ appeals relating to ancillary matters were disposed of in May 2016 (seeTDT v TDS and another appeal[2016] 4 SLR 145). This present suit was commenced in July 2011, but was stayed in January 2014 pending the resolution of the parties’ appeals relating to their divorce. 6  The present claim arose out of a business opportunity involving a contract with 7-Eleven for the supply of mashed potato machines. The plaintiff had provided maintenance services to 7-Eleven’s mashed potato machines since 2008, when these machines were supplied by Nestlé Singapore together with the powdered ingredients for the mashed potato food product sold at 7-Eleven outlets. In 2009, Nestlé decided to stop supplying the machines and sold all its existing machines to 7-Eleven for a token sum. As such, 7-Eleven had to source for a new supplier to replace its existing machines as each one reached the end of its life cycle. The plaintiff company had some spare parts with which to maintain the existing machines, but it soon became apparent that a more sustainable solution was required. 7 Hence, sometime in 2009, 7-Eleven’s manager Mr Lim Jit Sing (“Lim”) discussed with the defendant the possibility of having the plaintiff company supply 7-Eleven with new mashed potato machines. The defendant then spoke to the third party about this business opportunity, and the third party expressed interest for the plaintiff to take up the opportunity, especially since it meant that the plaintiff would be able to continue profiting from the maintenance contract with 7-Eleven. The defendant subsequently sourced for machines from China, together with another employee Eric Zhou (“Eric”), and obtained quotations from three different Chinese suppliers – Bianchi, FLZD and Happy Line. 8 What happened after that is in serious dispute between the parties, but it is clear that on or around 15 July 2010, Lim sent the defendant an email requesting the plaintiff to arrange to install and demonstrate one mashed potato machine by the next week. Further, a purchase order for 100 machines dated 12 July 2010 was sent by Lim to the defendant, which purchase order was addressed to the plaintiff. The parties agree that it was the third party’s instruction for this purchase order to be obtained before the plaintiff company committed to purchasing the mashed potato machines from their sourced supplier. Subsequently, between September 2010 and May 2011, mashed potato machines were supplied to 7-Eleven by Stellar Corporate Management Pte Ltd (“SCM”), a company controlled by the defendant. This formed the basis of the plaintiff’s claim for breach of fiduciary duty. 9 As for the plaintiff’s second claim, this concerns a loan of $4,399.60 for the down-payment of the defendant’s personal vehicle and personal expenses amounting to $12,684.48 that the defendant incurred on the plaintiff’s corporate credit card. This latter sum included charges for gas and various spa and wellness expenses.",
        "The parties’ cases": "",
        "The defendant’s case": "The first claim 10 The defendant’s case on the first claim is essentially that there was no breach of fiduciary duty on her part, as the third party had consented to her supplying mashed potato machines to 7-Eleven via a different company, and for her to keep the profits arising therefrom. 11 The chronology of material events according to the defendant is as follows. After the discussion with Lim in 2009 regarding the possibility of the plaintiff supplying the machines to 7-Eleven, the defendant and Eric started sourcing for possible suppliers, and Eric flew to China from 30 September 2009 to 5 October 2009 to visit the sales offices of Bianchi, FLZD and Happy Line,1Foot Note 1×Defendant’s affidavit of evidence-in-chief (“DAEIC”) at para 47.and obtained quotations by November 2009. FLZD was later dropped as a potential supplier in the same month because the plaintiff company could not transact in the volume required.2Foot Note 2×DAEIC at para 50.By January 2010, it became clear that the plaintiff had insufficient spare parts in its warehouse to continue maintaining the existing mashed potato machines in 7-Eleven, and there was clear imperative to secure a more permanent solution.3Foot Note 3×DAEIC at paras 55–58.In April 2010, Lim asked Eric to show him “the new equipment costing and the catalogue urgently”,4Foot Note 4×DAEIC at para 59.and a meeting was set up on 26 May 2010 where the quotations for the Bianchi machine were communicated to Lim, with the third party’s approval.5Foot Note 5×DAEIC at para 62.After this meeting, the defendant informed the third party of Lim’s positive reaction, and the third party agreed for the defendant to order a test machine from Bianchi but asked for a formal purchase order to be obtained from 7-Eleven before more machines are ordered.6Foot Note 6×DAEIC at para 63. 12 The defendant informed Lim sometime in July 2010 that the plaintiff company required a formal purchase order before proceeding with the ordering of machines, and Lim told her to make arrangements to demonstrate the test machine to 7-Eleven’s management so that Lim can obtain their authorisation for a purchase order.7Foot Note 7×DAEIC at para 65. 13 According to the defendant, at the meeting with Lim sometime after the week of 15 July 2010 where the defendant demonstrated the test Bianchi machine, 7-Eleven expressed the concern that the Bianchi machines were too bulky to fit in some of the smaller 7-Eleven outlets.8Foot Note 8×DAEIC at para 66.The defendant also realised that the Nestlé mashed potato powder was incompatible with the Bianchi machine as the powder had a tendency to get clogged up in the pipes. The defendant therefore asked Eric to source for another supplier who could customise the machines as necessary. Eric soon discovered that Happy Line was willing to customise its existing machines at no extra cost save for the price of a mould.9Foot Note 9×DAEIC at para 69. 14  The defendant then took this proposal to the third party. However, according to the defendant, the third party raised serious concerns over the reliability of Happy Line, given that it was an unknown Chinese supplier located in a remote part of China. The third party was adamant that the plaintiff should not procure the machines from Happy Line, as the remoteness of its manufacturing plant would make it difficult to troubleshoot any problems that may arise.10Foot Note 10×DAEIC at para 71.The defendant claimed that the third party was unmoved despite her assurances that she would be able to manage the Happy Line machines, and despite the risk that the plaintiff company could lose its goodwill with 7-Eleven and its maintenance contracts if it did not proceed with supplying the machines as agreed. Furthermore, Lim had gone to great lengths to obtain the purchase order from his superior, and failing to secure the machines would be a serious loss of face for him.11Foot Note 11×DAEIC at para 74. 15 The defendant testified that she and Eric then met Lim to convey the bad news, in response to which Lim was furious. To placate him, the defendant asked Lim whether he would mind if the defendant supplied the machines through another company instead of the plaintiff. Lim replied that it did not matter which company did so as long as 7-Eleven could look to the defendant personally for the reliability of the machines.12Foot Note 12×DAEIC at para 76. 16 The defendant then met with the third party alone as she suspected that the third party had issues with Eric. Despite the defendant expressing concern that the plaintiff could lose an important customer or even face legal action, the third party was not keen to proceed, and even said that he “did not care about the consequences” or words to that effect.13Foot Note 13×DAEIC at para 78. 17 The defendant testified that at this point, she and the third party orally agreed that the defendant would assume responsibility for the performance of the purchase order through another business entity, in return for which she would be entitled to keep the profits arising from the supply of the said machines (“the Mashed Potato Agreement”). The defendant claimed that this arrangement would be beneficial for all parties involved as the plaintiff would continue to earn money from the maintenance contract without incurring potential liabilities for the supply of the machines. The third party indicated his agreement to the proposal, and mentioned that he “did not care so long as [the plaintiff company] was not supplying the machines”.14Foot Note 14×DAEIC at para 79. 18 The defendant’s case was hence that the only directors of the plaintiff company, being the defendant and the third party, had entered into the Mashed Potato Agreement for the defendant to supply mashed potato machines to 7-Eleven through another entity, and that as the third party held 90% of the plaintiff’s shares, there was no further need to call a general meeting of the shareholders to approve of this agreement.15Foot Note 15×DAEIC at para 80. 19 In support of her case, the defendant relied primarily on several facts. Firstly, that the new mashed potato machines that were subsequently supplied by SCM to 7-Eleven were conspicuously housed in the plaintiff’s warehouse, and thus the third party was clearly aware of their existence in the months following the Mashed Potato Agreement.16Foot Note 16×DAEIC at paras 115–120.Secondly, that the third party was the administrator of all email accounts of the plaintiff company, and therefore had full access to and knowledge of emails sent and received by those email accounts, including those sent and received by the defendant’s email account.17Foot Note 17×DAEIC at paras 127–133.Thirdly, that the plaintiff company had continued to maintain the new mashed potato machines after the Mashed Potato Agreement, and this is evidenced by invoices issued by the third party to 7-Eleven.18Foot Note 18×DAEIC at paras 93–95. The second claim 20 The defendant’s case in relation to the second claim for the “loan” of $4,399.60 for the down-payment of her vehicle and personal expenses amounting to $12,684.48 charged to the plaintiff’s corporate credit card is essentially that these payments were consistent with an arrangement and understanding between her and the third party when they were still married (“the Marriage Agreement”). According to this Marriage Agreement, the defendant was entitled to certain matrimonial maintenance expenses as the third party’s wife, and the third party would ensure that the plaintiff company did not seek to claim these sums back from the defendant.19Foot Note 19×DAEIC at para 21.In support of this, the defendant reliedinter aliaon the third party’s admissions in his affidavits filed for the matrimonial proceedings to the effect that the plaintiff company was the “cash cow” that afforded the parties’ lifestyles,20Foot Note 20×DAEIC at para 204.and that the third party had similarly used the plaintiff company to pay for his personal car.21Foot Note 21×DAEIC at para 206.The defendant also pointed to her relatively low salary as the plaintiff’s director to support the existence of an understanding that she would be compensated instead by being allowed to charge her expenses to the plaintiff company.22Foot Note 22×DAEIC at paras 208–209. The counterclaim 21 The defendant counterclaims against the plaintiff for the sum of $25,072.60, comprising one month’s salary in lieu of notice for the termination of her employment, accrued annual leave from October 2006 to May 2011, and accrued salary from 1 to 9 May 2011. The defendant further claims an additional 5% of the plaintiff’s gross sales revenue for the year 2010 as per an oral agreement allegedly made between the defendant and the third party, which entitles her to a sum of $60,901.49. 22 In the absence of a written contract of employment, the defendant relies on the common law presumption that employment contracts for an unspecified period gives rise to a common law inference that employment can be terminated by reasonable notice, and submits that one month’s salary in lieu of notice is reasonable.23Foot Note 23×Defendant’s closing submissions (“DCS”) at para 141.The defendant further submits that she did not take any leave since her employment with the plaintiff, and her absence from work from 4 April to 9 May 2011 was because of the incident on 4 April 2011 during which she was attacked by the third party at the plaintiff’s premises.24Foot Note 24×DCS at paras 147–150. 23 As for the 5% sales commission, the defendant’s case is that she, the plaintiff and third party reached an oral agreement in or around early 2010 wherein the plaintiff would pay her a sum equivalent to 5% of the gross sales achieved by the plaintiff for 2010,25Foot Note 25×DAEIC at para 237.and that this was intended as a performance incentive for her as well as a compromise for certain marital disagreements they had at that period of time.",
        "The plaintiff’s case": "The first claim 24 The plaintiff and third party’s case is that whilst there were some initial discussions pertaining to the supply of mashed potato machines to 7-Eleven, the third party was not kept fully informed thereafter and had not entered into the Mashed Potato Agreement as alleged by the defendant. The third party had indeed expressed his interest for the plaintiff to supply the machines to 7-Eleven when the idea was broached to him by the defendant in late 2009, but he did not recall being informed of any meetings with Lim or instructions given to Eric to source for suppliers.26Foot Note 26×Third party’s affidavit of evidence-in-chief (“TPAEIC”) at paras 47–50. 25 The third party recalled that in early 2010, the defendant sought his approval to obtain mashed potato machines from a factory in Xinjiang, but that he was concerned about the reliability of their products given the remoteness of the plant.27Foot Note 27×TPAEIC at paras 53–54.The third party recalled that a sample machine was brought into the plaintiff’s warehouse sometime after that conversation with the defendant, and that he was informed by another 7-Eleven employee a few days later that the test machine “cannot make it”.28Foot Note 28×TPAEIC at paras 55–56.The third party was absent from the plaintiff’s premises for about a month in March 2010 due to chicken pox, but he was aware that during the same period of time the plaintiff’s reserve of spare parts for the Nestlé machines was running low, and that 7-Eleven was urgently requesting for the plaintiff to supply new mashed potato machines.29Foot Note 29×TPAEIC at paras 60–66.On or around 31 May 2010, the third party tasked another employee of an associated company, one Ms Sunny Qi (“Sunny”) to research into possible Chinese suppliers of mashed potato machines, and he forwarded a quotation sent to him by Eric for FLZD’s machines to Sunny.30Foot Note 30×TPAEIC at paras 68–69.Both Bianchi and FLZD remained viable options over the next few months, and the third party was unaware that Eric had sent specifications of Happy Line machines to 7-Eleven in July 2010.31Foot Note 31×TPAEIC at paras 71–87.The third party was similarly unaware that the defendant and Eric had met with 7-Eleven to demonstrate the Bianchi machine the week after 15 July 2010, and was unaware that the purchase order dated 12 July 2010 was sent to the defendant.32Foot Note 32×TPAEIC at paras 93g-h. 26 The third party denies having entered into the Mashed Potato Agreement, and denies there having been a discussion in July 2010 pertaining to the management viewing of the test machine or Happy Line.33Foot Note 33×TPAEIC at paras 100–101.Whilst the third party agrees that he had expressed reservations about the suitability of a “Xinjiang supplier”, he claims that that discussion took place much earlier in 2010.34Foot Note 34×TPAEIC at para 101.The third party claims that the defendant started becoming secretive after that initial discussion, and that there were no further discussions concerning the mashed potato machines business opportunity,35Foot Note 35×TPAEIC at para 116.much less any private meeting with the defendant where she proposed for her to supply the machines via a separate entity.36Foot Note 36×TPAEIC at para 323.As such, the third party was unaware of the existence of SCM and the fact that the defendant had been supplying machines to 7-Eleven via SCM until early May 2011, when he arrived in the office one morning and was informed of “suspicious activity” going on at the warehouse.37Foot Note 37×TPAEIC at para 119. 27 The third party denies that he had access to and knowledge of all emails sent to and received by email accounts with the suffix “@chowiz.com.sg”, as the administration of email addresses was outsourced to an IT company and he had no reason nor time to check the email accounts of the plaintiff’s employees daily.38Foot Note 38×TPAEIC at paras 35–36. The second claim 28 The third party claims that the sum of $4,399.60 was loaned to the defendant by the plaintiff as the defendant needed a loan for the down-payment of her personal vehicle, and that the defendant had informed the third party that she would pay the loan back.39Foot Note 39×TPAEIC at para 286. 29 The third party denies that the defendant was authorised to incur personal expenses on the corporate credit card, and denies there being a Marriage Agreement.40Foot Note 40×TPAEIC at para 302.The plaintiff argues in the alternative that any such Marriage Agreement is void pursuant to s 172 of the Companies Act (Cap 50, 2006 Rev Ed), and that there was insufficient consideration for the Marriage Agreement to be enforceable.41Foot Note 41×TPAEIC at para 316. The counterclaim 30 The plaintiff argues that part of the defendant’s pro-rated salary from 1 to 9 May 2011 is already set off in the amount of $1,185 from the plaintiff’s second claim.42Foot Note 42×Plaintiff’s closing submissions (“PCS”) at para 287.The plaintiff denies that the defendant is entitled to payment of salary in lieu of notice for termination, since she has no such entitlement under contract or statute.43Foot Note 43×PCS at para 290.The plaintiff further asserts that it was entitled to dismiss the defendant without notice on the ground of misconduct due to her breach of fiduciary duties and her failure to report for work from 4 April to 9 May 2011.44Foot Note 44×PCS at para 291. 31 The plaintiff denies having agreed to pay the defendant 5% of its gross sales, and emphasised the defendant’s inability to pinpoint the timing of such an agreement during trial.45Foot Note 45×PCS at para 309.The third party testified that there was some discussion in 2010 about bonuses based on the profits of the company, but no binding promise as to any payment thereof.46Foot Note 46×PCS at para 316.",
        "Issues to be determined": "32 In view of the parties’ respective cases as summarised above, the issues for my determination can be framed as follows: (a) Firstly, did the defendant breach her fiduciary duties as a director of the plaintiff by diverting the business opportunity to SCM, or was such diversion consented to by the third party by virtue of the Mashed Potato Agreement? (b) Secondly, can the plaintiff recover the sum of $15,899.08 from the defendant, or were the sums incurred pursuant to the Marriage Arrangement made between the defendant and the third party? (c) Thirdly, ought the defendant succeed in her counter-claim for wrongful termination, owed salaries and 5% of the plaintiff’s revenue for the year 2010?",
        "Whether the defendant diverted the business opportunity to supply mashed potato machines to 7-Eleven": "33 As it is not denied that the business opportunity of supplying mashed potato machines to 7-Eleven belonged originally to the plaintiff, the main question was whether the defendant and the third party had entered into the Mashed Potato Agreement for the defendant to divert this opportunity to SCM. The case turned on the evidence of the defendant versus the third party, as well as various objective facts adduced by each side. Having considered the evidence in its entirety, I decided that the defendant’s evidence is to be preferred for its internal consistency as well as corroboration by external facts.",
        "Placement of mashed potato machines in the plaintiff’s warehouse": "34 A key factor that the defendant emphasised in support of its case, and which weighed on my mind in arriving at my findings, is the fact that the mashed potato machines which SCM eventually supplied to 7-Eleven were routed through the plaintiff’s warehouse. The defendant had deposed in her affidavit of evidence-in-chief (“AEIC”) that the machines were routinely routed through the plaintiff’s warehouse where they were openly calibrated at the doorstep of the warehouse by the plaintiff’s technicians, and that this was clearly visible to and was in fact witnessed by various employees of the plaintiff, including the third party himself.47Foot Note 47×DAEIC at paras 115–118.It should be highlighted that this was not a matter of a few small machines being stored temporarily at the warehouse for a short period of time, but a total of 130 rather sizable machines being routed through and stored at the plaintiff’s warehouse over the course of about seven months. 35 The defendant’s evidence on this point was corroborated to a certain extent by the evidence of Ms Phang Yoke Hua Joyce (“Joyce”), one of the plaintiff’s witnesses, who deposed that she was aware that the defendant was arranging for a “large number of new mashed potato machines” to be delivered at the plaintiff’s warehouse, and that she saw the new machines in their boxes when she visited the warehouse on some occasions.48Foot Note 48×Phang Yoke Hua Joyce’s affidavit of evidence-in-chief (“JAEIC”) at paras 13–14.Joyce further testified on cross-examination that the boxes of machines were not concealed from view and were visible “whenever you go to the warehouse”.49Foot Note 49×Notes of Evidence (“NE”), Day 5 Page 16 Lines 23–29.Joyce later seemed to qualify this by suggesting somewhat enigmatically that the third party would only see the machines if he “enter[ed] the warehouse specially”50Foot Note 50×NE, Day 5 Page 18 Line 1.and that the third party would not be able to differentiate between the machines as “he is not in charge of these things”,51Foot Note 51×NE, Day 5 Page 28 Lines 21–32.although this does not sit well with her concession that the third party would have seen the machines if he were to enter the warehouse. 36 The plaintiff and third party sought to undermine the defendant’s evidence on this issue by pointing to,inter alia, the fact that the third party was away or otherwise occupied during the periods of September to December 2010 and hence would not have seen or paid close attention to the existence of the machines.52Foot Note 52×PCS at para 123.Even if this were true, it does not explain how the third party could have failed to notice the presence of the machines for the subsequent months. The plaintiff also submitted that the appearance of the Happy Line machines was not necessarily easily distinguishable from that of the old Nestlé machines which were located in the same warehouse, especially since the machines could be made to bear any label desired by the defendant.53Foot Note 53×PCS at para 124g. 37 In framing their case as such, the plaintiff overlooks that what is pertinent for present purposes is not only whether the third party actually saw the mashed potato machines. Even in the absence of any finding on whether the third party saw the mashed potato machines or realised their significance, what the evidence before me clearly shows is that the defendant in routing the machines through the plaintiff’s warehouse, did not behave in a surreptitious manner. This is wholly inconsistent with the plaintiff’s case that the defendant had diverted the business opportunity behind the third party’s back. On the contrary, the circumstances suggest that the defendant at the very least had the sincere and genuine belief that she had entered into the Mashed Potato Agreement. It is difficult to imagine why she would be so reckless and foolhardy as to carry out acts of brazen thievery in broad daylight and on the plaintiff’s very premises, without taking any precaution against the discovery thereof by the third party or any of the plaintiff’s employees. It should also be kept in mind that there are CCTV cameras around the warehouse, even though the defendant claims not to have ever looked at the recordings.54Foot Note 54×NE, Day 3 Page 139 Lines 22–26. 38 The inescapable conclusion from the above is hence that the third party did in fact consent to the defendant supplying the mashed potato machines using a separate entity other than the plaintiff. This would explain why the defendant had no qualms about routing the machines through the plaintiff’s warehouse and taking no steps to conceal this.",
        "The emails sent and received by the plaintiff’s corporate email accounts": "39 I turn now to address another area of considerable contention between the parties and on which considerable time was spent during trial. As alluded to above, the defendant took pains to emphasise that the third party allegedly had direct and automatic access to all work email accounts of the plaintiff’s employees, including that of the defendant’s. The defendant testified that she rarely used her own email account “zoanne@chowiz.com.sg”, and that it was the third party who would handle such correspondence in her name.55Foot Note 55×NE, Day 6 Page 79 Lines 12–31.The defendant drew attention to various instances where emails sent to the defendant’s email address were subsequently acted upon a short while later by the third party via his own email address, which would seem to suggest that the third party had automatic access to the defendant’s email account.56Foot Note 56×DCS at paras 32–50.This, the defendant submits, would mean that the third party at all material times had knowledge of the correspondence between the defendant and Lim pertaining to the mashed potato machines. 40 The third party’s explanation for his prompt follow-up on emails apparently sent to the defendant’s email account was not the most consistent. When cross-examined as to how he could have forwarded an email sent by Lim to the defendant on 5 July 2010 when he was not copied in that email, the third party struggled for a cogent response:57Foot Note 57×NE, Day 2 Page 101 Line 25–Page 102 Line 11. Q: Why did you forward it to Jeff? Was it to ask him to deal with the problem raised by Mr Lim? A: Well, yes, Your Honour, if---it will be---it must be I have accessed Zoanne’s email on the desktop, you know. There must be a complaint because it’s---it’s in a very rare occasions that, you know, I would---I will attend to such thing, you know. Q: So your testimony is that you accessed Zoanne’s desktop to get this email. A: It must be. Yes, Your Honour. Q: Why did you access Zoanne’s desktop to get this email? A: I think probably at that time, Zoanne is asking me to access her desktop, Your Honour. Q: So you are not saying that Zoanne forwarded to you by email or that anyone else forwarded it to you by email. A: I could be. It could be some---somebody were asking me to---to forward this particular email, you know. Q: Who, sorry? A: It could be. It could be somebody is forwarding this email to me, you know. Q: But you have not produced this intervening email. A: No, I’ve not. I cannot find it, Your Honour. 41 When questioned about why there was no such intervening email (forwarding the email from the defendant’s account to the third party’s account) in the chain of emails, the third party could do no better than to assert that he had no explanation or that he could not recall, although he seemed to accept at one point that he must have deleted the intervening email for unclear reasons.58Foot Note 58×NE, Day 3 Page 9 Line 23–Page 11 Line 9. 42 That being said, whilst the defendant’s explanation for the pattern of correspondence seemed logical, it is not the only possible explanation. As the plaintiff submitted, it is possible that someone drew the third party’s attention to such emails and asked the third party to attend to it physically or through his email,59Foot Note 59×PCS at para 142.although I would not go as far as to say that this was equally plausible. The third party maintains that even though he was capable of accessing employee emails, there was no reason for him to monitor all correspondence sent to and from these employee accounts, and that he certainly did not have the time to do so.60Foot Note 60×PCS at para 144. 43 On the totality of the evidence concerning the email correspondence, I hesitate to make any conclusive finding as to whether the third party had direct and automatic access to the defendant’s email account, and whether the third party did make use of his ability to access employee emails. What is clear, however, is that once again the circumstances suggest at the very least that the defendant was not behaving surreptitiously. As the third party does not dispute that he was able to and did at times access the defendant’s email account as he knew her password,61Foot Note 61×NE, Day 2 Page 15 Lines 10–28.and it is clear that some correspondence regarding the supply of new mashed potato machines went through the defendant’s email account,62Foot Note 62×DCS at paras 35–36.the evidence would suggest that the defendant did not take precautions to hide what she was doing, at least not in July 2010. As such, this again supports the conclusion that the defendant was behaving in a manner consistent with the existence of the Mashed Potato Agreement.",
        "Corroboration by the testimonies of other witnesses": "44 Ms See Siok Sin (“Stella”) was called as a defence witness regarding her involvement in the alleged diversion of business opportunity and the involvement of SCM, which was a company incorporated by her. Stella’s evidence as deposed in her AEIC, and which was largely unchallenged on cross-examination, is relevant in two material aspects. Firstly, Stella testified that the defendant had approached her sometime in July or August 2010 to seek her assistance, as the defendant wished to use Stella’s business entity (SCM) to import mashed potato machines from a Chinese supplier to supply to 7-Eleven.63Foot Note 63×Stella’s AEIC (“SAEIC”) at para 12.Stella testified that the defendant had explained to her that the third party had initially agreed for the plaintiff to supply these machines and that the defendant had obtained a purchase order from 7-Eleven pursuant to this understanding, but that the third party had subsequently changed his mind as he was concerned about the plaintiff being exposed to product liability risks from these Chinese machines.64Foot Note 64×SAEIC at para 12(a).The defendant had explained that 7-Eleven was upset with the plaintiff as a result, and that the defendant had proposed the Mashed Potato Agreement in an attempt to salvage the situation and prevent the plaintiff from losing an important customer.65Foot Note 65×SAEIC at paras 12(b)–(c).Secondly, Stella also deposed that when she was confronted by the third party on 6 May 2011 regarding the involvement of SCM, the third party had informed her that he did not want the plaintiff to supply the machines because he was concerned about the reliability of the machines manufactured in China. That the third party had informed her of this was not something that arose in evidence at trial as an afterthought, as it was corroborated by the transcript of a telephone conversation between Stella and another employee sometime in November 2012, which transcript was produced by the third party.66Foot Note 66×SAEIC at para 26. 45 To my mind, Stella’s unchallenged evidence goes a long way to corroborate the defendant’s version of events. Stella’s evidence is in all material aspects consistent with the defendant’s case, and the natural conclusion for this is that the defendant was telling the truth. The only other explanation for this consistency, which is highly unlikely, would be that the defendant had the amazing foresight to develop a highly elaborate scheme back in 2010 in which she left a trail of corroborating evidence with various would-be witnesses. 46 Joyce was called as a witness for the plaintiff, but her evidence actually corroborated the defendant’s case on the Mashed Potato Agreement in some aspects. In particular, Joyce testified that the defendant had mentioned to her that Lim was about to retire and had asked the plaintiff not to “hurt” his career, which is why the defendant felt that the only alternative was to supply the machines using a different company.67Foot Note 67×JAEIC at para 12.Even though Joyce testified that this conversation took place in May 2010, she appeared to concede later on that it could have occurred in June or July 2010 instead, as is consistent with the defendant’s evidence.68Foot Note 68×NE, Day 5 Page 7 Lines 14–24.During cross-examination, Joyce also agreed that the defendant did not appear to be furtive when the two of them spoke, and that the defendant was very transparent about her intentions.69Foot Note 69×NE, Day 5 Page 12 Line 32 to Page 14 Line 3.Not only does Joyce’s evidence corroborate the defendant’s position on why she had diverted the business opportunity to SCM, it also suggests that the defendant believed at that point of time that she was doing so with the third party’s knowledge and consent. If she had been secretly diverting the business opportunity behind the third party’s back and in breach of her fiduciary duties to the plaintiff, it is hard to imagine why she would have spoken so candidly to the plaintiff’s employee without exercising greater discretion, especially since Joyce was a relatively new employee who only joined the plaintiff company in May 2010.70Foot Note 70×NE, Day 4 Page 100 Lines 17–20.",
        "Corroboration by the compensation for installation services and subsequent maintenance invoices": "47 It is the defendant’s case that one of the terms of the Mashed Potato Agreement was that the plaintiff company would continue to provide maintenance services for the new mashed potato machines supplied to 7-Eleven, and as such it would be a “win-win” situation for everyone involved: 7-Eleven obtains its supply of new machines, the defendant profits from supplying these machines through SCM, and the plaintiff profits from the maintenance contract of these machines without having to incur the risk of potential product liability. 48 Consistent with this case is the unchallenged evidence by the defendant that she had paid the plaintiff the sum of $1,712 for the installation of the new machines.71Foot Note 71×DAEIC at para 87.This is strong corroborative evidence that the parties had entered into an agreement that was beneficial to all involved, and that the defendant had acted in accordance with this agreement. 49 Further, the defendant adduced in support of her case a series of invoices issued by the plaintiff to 7-Eleven for the maintenance of mashed potato machines, which invoices were signed by the third party. 50 On cross-examination, the third party was confronted with various of these invoices and agreed that the plaintiff had charged 7-Eleven for maintenance work done on the mashed potato machines supplied by the defendant through SCM:72Foot Note 72×NE, Day 4 Page 4 Line 1–19. Q My instructions are that the serial numbers---the long serial numbers that are more than three digits long are the old mashed potato machines, correct? A  Correct. Q  Which was supplied by Nestle, correct? A  That’s right. Q  And the short serial numbers – either single, double or triple digits – would be the new mashed potato machines, correct? A  Correct. Q  And these are the new mashed potato machines that were supplied by Stellar Corporate Management Pte Ltd, correct? A  Correct. Q  So by issuing this maintenance invoice to 7-Eleven, you are authorising Zolton Techs to charge 7-Eleven for corrective work done, correct? A  Correct. Q  And 7-Eleven paid for this invoice, correct? A  Correct. Q  So in other words, Zolton Techs earned the maintenance fees for this invoice, correct? A  Correct. 51 The third party asserted that he did not realise the differences in the length of the serial numbers on the invoices and as such was unaware that the plaintiff was providing maintenance services for the new mashed potato machines supplied through SCM,73Foot Note 73×NE, Day 4 Page 7 Line 28–Page 9 Line 12.at least not until May 2011. The third party’s case is that when he discovered the defendant’s scheme, the plaintiff continued to provide maintenance services to 7-Eleven for those new mashed potato machines for a few more months, since the plaintiff’s technicians were the ones attending to the maintenance work anyway.74Foot Note 74×NE, Day 4 Page 22 Lines 11–23. 52 Be that as it may, the fact that the plaintiff company did in fact provide maintenance services for the mashed potato machines supplied through SCM, and that it profited therefrom, goes towards corroborating the existence of the Mashed Potato Agreement. It would be hard to imagine that the third party would let the defendant divert a business opportunity away from the plaintiff if the plaintiff had nothing to gain from it, but the objective evidence suggests that the plaintiff did in fact benefit from the Mashed Potato Agreement.",
        "Conclusion on the diversion of business opportunity issue": "53 The totality of the objective evidence discussed above, together with the material consistency between the testimonies of the defendant and the other witnesses, leave no doubt in my mind that the Mashed Potato Agreement did exist. 54 Given my finding that the defendant and the third party, who were the only directors of the plaintiff company, did in fact enter into the Mashed Potato Agreement, there is no breach of fiduciary duty on the defendant’s part, and consequently no need for any ratification of such breach by the shareholders. In any case, since the third party was a party to the Mashed Potato Agreement and a 90% shareholder of the plaintiff, any such ratification would have been easily obtained and calling a general meeting to obtain such ratification would have been a foregone conclusion. 55 As such, the plaintiff is not entitled to damages or compensation from the defendant for any breach of fiduciary duty. However, as it is not disputed that the defendant used the plaintiff’s premises and employees for the supply and installation of the mashed potato machines supplied by SCM, the plaintiff is entitled to payment for these services on aquantum meruitbasis to be assessed.",
        "Whether the plaintiff ought to recover the sum of $15,899.08 from the defendant": "56 It is undisputed that the sum of $15,899.08 can be broken down into a sum of $4,399.60 which went towards the down-payment of the defendant’s car, and a total sum of $12,684.48 which consists of a series of 37 transactions for various types of expenditure incurred on the plaintiff’s corporate credit card, minus the sum of $1,185.00 being the defendant’s pro-rated salary from 1 to 9 May 2011.",
        "The sum of $4,399.60": "57 As the bulk of the trial had been focused on the plaintiff’s first claim, it is unsurprising that neither party offered much by way of evidence at trial in relation to the payment of $4,399.60 for the defendant’s car. This short exchange took place during cross-examination of the defendant on this issue: Q: Now, the company had paid a down payment of $4,399.60 for this vehicle SJV7766J. Correct? A: I guess so. Q: And therefore, since you’ve left the company, you ought to refund this sum to the company, isn’t it? A: No, he bought it for me to drive it. Q: I put it to you that since the company funds were used towards this down payment, you ought to refund that sum to the company. You may either agree or disagree. A: I don’t---I disagree. I don’t know that he used the company funds to buy. 58 In its submissions, the plaintiff asserted that there was no evidence that the plaintiff intended to gift the sum to the defendant.75Foot Note 75×PCS at para 286.Quite understandably, the defendant adopted the opposite stance in arguing that there was no evidence that the payment was intended as a loan.76Foot Note 76×DCS at paras 120–121.In the absence of any positive objective evidence by either side as to the intended nature of this payment, I am inclined to prefer the defendant’s side of the story, since there is nothing on the face of the payment voucher to suggest that the payment was intended to be anything beyond a straightforward payment with no strings attached. That the payment was not intended as a loan is further bolstered by the undisputed fact that the plaintiff also made payments towards the third party’s personal car.",
        "The credit card expenses amounting to $12,684.48": "59 On the issue of the credit card expenses, the defendant has raised some preliminary objections on cross-examination and in her submissions that the plaintiff has not adduced evidence that it had in fact made payments for those expenses to the bank, whereas the defendant had produced some evidence to show that at least two-thirds of the sum had been paid by an associated company, not the plaintiff.77Foot Note 77×DCS at para 132.The plaintiff submits on the other hand that this is an irrelevant objection, given that such payments were made on behalf of the plaintiff and not the defendant, and that the plaintiff would eventually make repayment to the associated company.78Foot Note 78×PCS at para 282.Given the following findings, it is not necessary for me to arrive at a conclusion on this point. 60 I am persuaded that the third party and the defendant did in fact come to the Marriage Agreement that the defendant could use the plaintiff’s corporate credit card to incur expenses both for the household and for her own personal benefit. It is not disputed that the third party himself similarly treated the plaintiff as a “cash cow” to fund his own expenses. It is only natural to expect that prior to the breakdown of their marriage, the third party and the defendant both formed the habit, pursuant to an understanding, to charge their personal expenses to the company accounts of the various associated companies, including the plaintiff. That the defendant was unable to recall the precise date of the Marriage Agreement does not suggest that it did not exist, but simply that it was not an express one. 61 The plaintiff appears to argue in its submissions that it is irrelevant whether or not the parties have the habit of treating the plaintiff as a “cash cow” to fund their personal expenses, as the defendant owes a fiduciary duty to the plaintiff to incur only expenses for the benefit of the plaintiff,79Foot Note 79×PCS at paras 152, 160.whereas it is clear on the undisputed facts that the expenses incurred were neither incidental to the defendant’s role as a director of the plaintiff nor for the plaintiff’s benefit. 62 I have certain difficulties with the plaintiff’s position. Firstly, it is not evident from the face of the pleadings that the plaintiff’s second claim is based on an alleged breach of fiduciary duty. Rather, the statement of claim suggests that the second claim is a claim for a liquidated sum owed. Secondly, it must be kept in mind that the third party and defendant were the sole directors of the plaintiff company, and the third party a 90% shareholder. Even though the expenses incurred were not for the benefit of the plaintiff and were not incidental to the business of the plaintiff, the third party would have had the authority to ratify these charges in his capacity as the 90% shareholder. 63 The plaintiff has also sought to argue that even if the third party and the defendant had reached an understanding whereby the defendant was allowed to incur personal expenses on the plaintiff’s corporate credit card, such an understanding was at best a “domestic arrangement not intended to create any legal consequences”, relying onBalfour v Balfour[1918] All ER Rep 860. This argument is a misguided one. We are not concerned here with whether or not a legal contract exists by virtue of the Marriage Agreement – it is clear that the defendant is not seeking to enforce the Marriage Agreement as if it were a contract, but rather relying on it as a defence to the plaintiff’s second claim. The defendant relies on the Marriage Agreement as evidence of the third party’s consent to the defendant incurring personal expenses on the plaintiff’s corporate credit card, and to show that he would have ratified these charges as shareholder if necessary. As such, whether or not the agreement was reached in a domestic setting is of no relevance. For similar reasons, the plaintiff’s argument that the Marriage Agreement is void for want of consideration or for being contrary to s 172 of the Companies Act is equally misplaced. 64 As such, I dismiss the plaintiff’s second claim accordingly.",
        "Whether the defendant ought to succeed in her counter-claim": "65 As the parties are in agreement that the defendant is entitled to pro-rated salary from 1 to 9 May 2011, the main points of contention concern the defendant’s entitlement to salary in lieu of one month’s notice for her termination from the plaintiff, her entitlement to accrued annual leave as well as her entitlement to 5% of the plaintiff’s sales revenue for the year 2010.",
        "Salary in lieu of notice": "66 In the absence of any formal employment contract, I agree that this court should be guided by common law principles. The defendant has citedJames v Thomas H. Kent & Co[1951] 1 KB 551 andChitty on Contracts, Volume 2 (Sweet & Maxwell) 1989 Edition for the proposition that a contract of employment for an unspecified period gives rise to the inference that the employment can be terminated by reasonable notice, and that one month’s notice is eminently reasonable. The plaintiff has argued that any notice period that the defendant was entitled to would have in any case been offset by her absence from work from 4 April to 9 May 2011.80Foot Note 80×PCS at para 292.But as an altercation occurred on 4 April 2011 which led to the defendant filing for and obtaining an expedited personal protection order against the third party, it is clear the defendant’s subsequent absence from work was not from a wilful refusal to report for duty. In all the circumstances, I find for the defendant’s counterclaim of one month’s salary in lieu of notice.",
        "Entitlement to accrued leave": "67 There is considerable dispute as to the defendant’s entitlement to leave and payment for accrued leave, with each side arguing that the burden is on the other side to produce records of leave taken.81Foot Note 81×DCS at para 146; PCS at para 294.The plaintiff has pointed to several admissions by the defendant in her affidavits for the divorce proceedings to the effect that she has taken various holidays with the third party and other family members over the years,82Foot Note 82×PCS paras 294–301.whereas the defendant submits that these were work trips that were at times extended on the third party’s say-so.83Foot Note 83×Defence reply closing submissions at paras 102–105.On the whole, I found the defendant’s evidence regarding these overseas trips to be credible as she had consistently maintained in her affidavits that the holidays were mixed with business trips, and the third party similarly took this position in his 2012 affidavit.84Foot Note 84×4AB2297–4AB2299. 68 It is however also clear that the defendant had taken some liberties with her position as director in failing to keep records of her travels. There was further the issue of an email sent by an employee Ms Yang Yuying (“Amy”) to the effect that the defendant was away on leave from 2 to 6 December 2009, but Amy denied sending the email and in fact even denied ever having the address (yuying.yang@chowiz.com.sg) from which that email was sent.85Foot Note 85×NE, Day 9 Page 77 Lines 1–21.Amy maintained this position on the stand even when she was confronted with other emails sent toyuying.yang@chowiz.com.sg, which emails had been admitted into evidence as part of the agreed bundle:86Foot Note 86×NE, Day 9 Page 79 Line 29–Page 80 Line 18. Q: Page 186, please. 1AB186. If you look at the bottom-up in terms of the email thread, you will see that zoanne@chowiz.com.sg has [sent] out this email to Mr Lim Jit Sing, whom the record within has made clear that he’s from 7-Eleven and cc yuying.yang@chowiz.com.sg as well as Eric Zhou. And the email says: [Reads] “Dear Mr. Lim To facilitate operations and service matters, please direct email your request to Ms Amy Yang Yuying…Operations Executive…and myself. Please email or call Amy at”---this number---“we could be of service to you. Thank you. Best regards, Zoanne”. So this is an authentic, genuine email that sent out by Zoanne Tan, okay, to Mr Lim and it copies you in at this chowiz.com.sg email address, you see that? A: Based on my memory, I have not seen this email before. Q: Alright. On the face of this document which is admitted as genuine, authentic, it is clear that you at that time while working with Zoanne at Chowiz clearly had a chowiz.com.sg email account. That’s what Zoanne herself gave by---when sending out this email, okay, state so by copying you in at that email address, you see it? A: Like I said I do not recall having this email. I also do not recall having this email address because I only do the work of Zolton Tech[sic] and my email address is Zolton Tech[sic] something. 69 I am disinclined to believe Amy’s evidence in this regard, as the only other explanation for the emails would be that they were deliberately doctored, which is a serious allegation that the defendant has not taken up. Further, during Amy’s oral testimony I got the distinctive sense that she was being rather uncooperative and particularly partial to the defendant. As such, I find that the defendant has failed to prove her entitlement to accrued leave on a balance of probabilities.",
        "The 5% incentive bonus": "70 The third party’s testimony on the existence of an agreement for the defendant to be paid some sort of incentive bonus for her performance was a rather confused one. He appeared to deny at times that the defendant was entitled to any sort of bonus,87Foot Note 87×NE, Day 4 Page 41 Lines 11–15.yet conceding at other times that there was some sort of agreement for a performance bonus to be paid.88Foot Note 88×NE, Day 4 Page 42 Lines 8–13. 71 The third party initially appeared to suggest that the issue of bonus was first broached on 4 April 2011 during the course of the altercation, as evident from the following extract:89Foot Note 89×NE, Day 4 Page 43 Line 25–Page 44 Line 6. Q: I put it to you, Mr Chow, that in fact what happened was that in order to incentivise her to perform and make profit for Zolton Techs Pte Ltd, you told her that if she hit the $1 million mark in sales for the year - and the year we’re talking about is 2010 - she would be paid a 5% bonus based on sales achieved. You can agree or disagree. A: Disagree, and if I may elaborate a little---you know, highlight some points, Your Honour? Your Honour, this so-called, you know, paying the bonus, it should be in---I---it---it---I think it’s meant to be 4th of April 2011, Your Honour, and earlier on--- Court: Sorry. When you say “meant to be 4th of April”, what do you mean by that? Witness: I---no. I think it happens on 4th of April 2011 when this discussion---this a---a---alleged discussion took place. Court: This discussion? Alright. Alright. 72 It was brought to the third party’s attention that it made no sense for the issue to have been first broached in April 2011 when the discussion pertained to performance incentive for the year 2010, and an agreement reached in 2011 would clearly have no effect on incentivising the defendant to work hard in 2010. The third party however maintained his position without advancing a cogent reason for doing so:90Foot Note 90×NE, Day 4 Page 52 Line 25–Page 53 Line 27. Q: Mr Chow, I put it to you that you just concocted this story because if you read your paragraph 24 and 25 together, at page 1854 of the same bundle, you will see that any agreement to pay bonus to somebody based on the performance of a company in a particular year if it was to incentivise that person to perform and make profits for the company has to be made before the year is up. You agree or disagree? A: I---I---I disagree, Your Honour Q: On 4th April 2011, which you say was the date when you agreed to pay her a bonus out of the profits of the company, the year 2010 would already have passed. The company’s performance would already be done as of the end of 2010. There would no longer be any incentivising purpose in such an agreement. You agree or disagree? A: I’m sorry, Your Honour. Did I hear like the year 2011 has passed? I mean--- Q: The year 2010 has passed. Court: 2010 has passed. A: 2010, okay. Okay. Q: It’s already passed. A: Okay. Q: Performance has been done, dusted, right? A: Yes. Q: So if you make an offer in 4th April 2011 to pay a bonus for performance in 2010, it is meaningless in a sense that there is no incentivising factor. You agree or disagree? A: I disagree. And if I may allow to elaborate just two points, Your Honour. Okay. The first point is the accounts then was not out. That’s the truth. Court: No, but the point is that it doesn’t act to incentivise her to perform in 2010 because 2010 is already over. Witness: That’s right. Court: So the offer---I mean, bonus, if it’s meant to be an incentive, would not be effective. Witness: Yes. Court: That’s the point. Witness: Yah, okay. Yah, but I da---I disagree, your---Your Honour. Yah, Yah. 73 The third party finally agreed that there was indeed an initial discussion in 2010 when it was pointed out to him that he said as much in his earlier affidavit.91Foot Note 91×NE, Day 4 Page 55 Line 26–Page 56 Line 26.In view of his inconsistent and vacillating evidence on this point, I found his credibility as a witness to be lacking. The defendant’s evidence on the other hand, even though she admitted not to be able to recall when exactly the agreement was reached,92Foot Note 92×NE, Day 6 Page 66 Line 28–Page 67 Line 13.was at least largely internally consistent. 74 Given that the third party at the very least accepted that there was a discussion on a performance bonus, I am inclined to believe the defendant that such an agreement was reached. The only question then was whether or not it was for the defendant to receive 5% of the plaintiff’s revenue or profits. The plaintiff has submitted that in view of the relatively small profits earned in 2010, it was unlikely for the defendant to have been promised what amounted to half of the plaintiff’s profits, when it was unclear at the time of the agreement whether the plaintiff would make any profits at all and whether the defendant would have contributed to this profit.93Foot Note 93×PCS at paras 317–320.However, as the parties have agreed that the bonus was meant at least partially as an incentive for performance, I find it much more believable that 5% of the plaintiff’s revenue or sales was the agreed bonus, since 5% of the plaintiff’s profit would have been a meagre sum that would have had no incentivising effect at all.",
        "Conclusion": "75 For the foregoing reasons, I find that the defendant has not breached her fiduciary duties as the plaintiff’s director in supplying mashed potato machines via SCM. I also find that she is not obliged to repay the sums of $4,399.60 and $12,684.48 allegedly owed to the plaintiff, as there was an agreement for her to be entitled to the same. Hence, I dismiss the plaintiff’s first and second claims against the defendant. However, as elaborated at [55] above, the defendant is liable to the plaintiff for use of the plaintiff’s premises and labour for the installation of the new mashed potato machines on aquantum meruitbasis, with such quantum to be assessed. 76 I allow the defendant’s counter-claim with regard to the 5% performance bonus of the plaintiff’s revenue as agreed between her and the third party, as well as her counter-claim for one month’s salary in lieu of notice. For the reasons above (at [67]–[69]), I disallow her claim for accrued leave. 77 I will hear parties as to costs. Lee Seiu KinJudge Fong Lee Cheng Jennifer, Koh Choon Guan Daniel and Ng Jia En (Eldan Law LLP) for the plaintiff and third party;Chong Siew Nyuk Josephine and Yeo Fang Ying, Esther (Josephine Chong LLC) for the defendant."
    }
}