{
    "case_title": "Solomon Alliance Management Pte LtdvPang Chee Kuan",
    "ncitation": "[2018] SGHC 139",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 By way of an agreement dated 17 August 2009 (“the Contract”), the defendant (“the Defendant”) was engaged as an independent contractor and Vice President by the plaintiff (“the Plaintiff”) to market products promoted and sold by the Plaintiff. In this action, the Plaintiff sued the Defendant for breach of the Contract, claiming that the Defendant had diverted sales to other entities by promoting certain products on behalf of other entities. The Defendant denied the Plaintiff’s claim and in turn advanced a counterclaim for defamation. 2 After hearing the arguments of parties, I allowed the Plaintiff’s claim against the Defendant for breach of contract, and dismissed the Defendant’s counterclaim for defamation.",
        "Background": "3 The Plaintiff is a company incorporated in Singapore which is in the business of promoting, marketing and selling assets-backed investment products, including land acquisition and joint-development projects.1Foot Note 1×Statement of Claim (Amendment No. 1) dated 8 February 2017 (“SOC (Amendment No. 1)”) at para 1. 4 The Defendant is one of the founders of the Plaintiff, together with, amongst others, Chong Chin Fook (“Desmond Chong”), Helen Chong Kwai Leng and Goh Yam Sim who became acquainted with each other when they were employees of another company.2Foot Note 2×SOC (Amendment No. 1) at para 2.A day after the Plaintiff company was incorporated, the Defendant was appointed as the Vice President of the Plaintiff and an independent contractor by way of the Contract concluded between the parties on 17 August 2009. Under the Contract, the Defendant was to market certain product(s) promoted, marketed and sold by the Plaintiff according to terms and conditions stipulated in the Contract.3Foot Note 3×Agreed Bundle (“AB”) Vol X at p 4631. 5 Sometime in 2014, Desmond Chong suspected that the Defendant was diverting business to other entities and engaged the services of a private investigation company (“the private investigation company”). The private investigation company deployed one Loke Yoke Fun (“the Private Investigator”) to meet with the Defendant under the pretext of being interested in purchasing certain products.4Foot Note 4×SOC (Amendment No. 1) at para 9.During the meetings between the Defendant and the Private Investigator, which were video-recorded, the Defendant was said to have told the Private Investigator that he was representing a company known as Megatr8 Inc Pte Ltd (“Megatr8”) and recommended the Private Investigator to consider investing in a particular product. 6 On 5 March 2015, the Plaintiff commenced the present suit against the Defendant. The Plaintiff claimed that in 2014, the Defendant had breached the terms of the Contract by diverting business away from the Plaintiff, in particular, by marketing products covered under the Contract on behalf of entities other than the Plaintiff, while the Contract was in force. The Plaintiff’s primary claim against the Defendant concerned a product which the Plaintiff had marketed on behalf of a company called Dolphin Capital Asia Pacific Pte Ltd (“Dolphin Capital”) (“the Dolphin Product”).5Foot Note 5×SOC (Amendment No. 1) para 3, 3F 7 On the basis of the alleged diversion, the Plaintiff suspended the Defendant by way of a letter dated 4 March 2015 signed by Desmond Chong (“the Suspension Letter”). On or about 6 March 2015, the Plaintiff also sent a letter to 107 recipients with the heading “change of servicing consultant” (“the letter dated 6 March 2015”).6Foot Note 6×Defendant’s closing submissions dated 27 October 2017 (“DCS”) at para 4; Defence and Counterclaim dated 31 March 2017 (“Defence and Counterclaim”) at paras 37–40.The content of the letter dated 6 March 2015 is the subject of the counterclaim by the Defendant against the Plaintiff for defamation. The Defendant also joined Desmond Chong as a defendant to the counterclaim. 8 InChong ChinFook v Solomon Alliance Management Pte Ltd and others and another matter[2017] 1 SLR 348, the Court of Appeal granted Desmond Chong conditional leave under s 216A of the Companies Act (Cap 50, 2006 Rev Ed), permitting him to control the conduct of the present suit on behalf of the Plaintiff subject to certain conditions imposed by the Court of Appeal (at [96]). 9 The main issues in this suit included whether products other than that listed under Schedule A of the Contract fell within the scope of the Contract, whether the Contract had been terminated or frustrated, whether the relevant terms in the Contract were unenforceable for being in unreasonable restraint of trade, and whether the Contract had been breached. The Defendant argued,inter alia, that the Contract was frustrated in March 2012 when the sale of the sole product listed under Schedule A of the Contract had ceased. The Plaintiff on the other hand argued, amongst others, that the scope of the Contract was not limited only to the product listed under Schedule A, and that the Contract continued to operate between the parties even after March 2012.",
        "Summary of the Plaintiff’s case": "10 The Plaintiff argued that the Contract was not limited to the single product listed under Schedule A,ie, the Villages of Aina Le’a (“the Villages Product”), but covered other products which the Defendant was appointed to market on behalf of the Plaintiff. Therefore, the Contract was not discharged when the sale of the Villages Product ceased, and instead continued in operation after March 2012. The Contract had been breached by the Defendant given that he had promoted products sold by the Plaintiff on behalf of other entities, and in this regard breached the non-compete clauses in the Contract, which were valid restraint of trade clauses.",
        "The proper interpretation of the Contract": "24 The Defendant argued that the express wording of the Contract, specifically, the preamble and Schedule A, showed that the Defendant was appointed to market only the Villages Product.29Foot Note 29×Defendant’s reply submissions dated 24 November 2017 (“DRS”) at paras 28–29, 45, 63.The Plaintiff’s interpretation of cll 1, 10(a) and 10(c) of the Contract as having the effect of bringing other products aside from the Villages Product within the scope of the Contract was an unnatural reading of the express provisions of the Contract30Foot Note 30×DCS at paras 50–55; DRS at paras 31(4), 32(1), 32(4).and was in any event not sufficiently pleaded by the Plaintiff.31Foot Note 31×DCS at para 56; DRS at paras 19-25. 25 The context also showed that only one product was intended to be covered under the Contract. The parties had intended to only include the Villages Product under Schedule A, while allowing the Defendant to market other products for the Plaintiff outside the scope of the Contract.32Foot Note 32×DRS at para 36.The fact that the contracts for other independent contractors had been expressly amended and updated after they had been concluded to add other products showed that the Plaintiff knew and accepted that the scope of all of the contracts was limited to products expressly specified in the respective schedules thereto.33Foot Note 33×DRS at para 31(7), 32(5), 37, 58–60.The Defendant also submitted that its interpretation of the Contract was simple and accorded with commercial common sense.34Foot Note 34×DRS at paras 62–65. 26 Contrary to the argument of the Plaintiff, the sale by the Defendant of other products aside from the Villages Product prior to March 2012 did not show that he acknowledged that other products were included in the Contract, since in relation to those products, he was acting as a free agent and not pursuant to the Contract.35Foot Note 35×DRS at para 46–49.In relation to the Plaintiff’s claim that the October 2014 email sent by the Defendant giving notice of termination constituted an acknowledgement that the Contract continued to be in operation even after March 2012, the Defendant was aware that the Contract was no longer in operation then and his notice was for withdrawal as a shareholder of the Plaintiff and to leave the Plaintiff in order to start out on his own.36Foot Note 36×DCS at para 229; DRS paras 54–55. 27 In addition, in the event of any ambiguity, thecontraproferentemdoctrine applied such that the Defendant’s interpretation of the Contract should be preferred.37Foot Note 37×DCS at paras 58–60; DRS at para 31(8), 32(6).",
        "No frustration of the Contract": "14 The Plaintiff submitted that there was no discharge of the Contract by frustration as there had been no supervening event which rendered the contractual obligation radically or fundamentally different from what the parties had agreed. The cessation of the sale of the Villages Product was not a supervening event leading to frustration of the Contract as it was an event which was within the contemplation of the parties.12Foot Note 12×PCS at paras 52–59; PRS at paras 18–19.",
        "Restraint of trade clause valid": "15 According to the Plaintiff, the restraint of trade clauses in the Contract should be upheld given that the clauses (a) were intended to protect the Plaintiff’s legitimate proprietary interests, and (b) were reasonable between the parties and also from the perspective of the interests of the public.13Foot Note 13×PCS at paras 60–83.The relevant legal test for upholding the restraint of trade clauses was thus satisfied.",
        "Breach of the Contract": "112 Having found that the Contract covered other products aside from the Villages Product and continued to be in operation after March 2012, and that there was no vitiating factor, the next question was whether there was breach of the Contract by the Defendant of cll 10 and 11. Admissibility of evidence 113 I was satisfied at the start of trial following submissions from parties98Foot Note 98×NE dated 8 August 2017 at pp 80–81.that the video evidence recording the meetings between the Defendant and the Private Investigator pretending to be interested in the purchase of investment products from him was admissible. I was also satisfied that the transcripts of the video recordings and reports from the private investigation company were admissible. Nothing came up in the trial that required a reconsideration of the admissibility of these sources of evidence and I remained of the view at the end of trial that the sources of evidence were admissible. Neither was I convinced that there was anything that rendered these pieces of evidence unreliable. The Defendant took issue with various aspects of the video evidence, including that they were copies rather than the originals, that there was a break in the chain of custody as the maker of the recordings had not been called as witnesses, and that there were breaks and skips in the recordings. I found however that the various steps taken by the private investigation company including in copying from the recording device and storing the footage on other devices did not render the footage inadmissible or unreliable. Similarly, the transcripts were largely reliable and accurate records of what transpired on the video. 114 Taking first the videos, I was satisfied that the videos were reliable evidence which the best evidence rule did not exclude. The video recordings could be adduced though the actual recording device was not available. It falls on the adducing party to make out that the recording adduced was a faithful and unaltered recording of what was recorded. I was satisfied that this was shown and I did not readJet HoldingLtd and others v Cooper Cameron (Singapore) Pte Ltd and another and other appeals[2006] 3 SLR(R) 769 as requiring a contrary conclusion. 115 Contrary to the Defendant’s submissions, the video recordings were in my view primary evidence and therefore fulfilled the requirements of best evidence.99Foot Note 99×DCS at para 134.The relevant sections are ss 63–67 of the Evidence Act which concern proof of documentary evidence. “Document” is defined under s 3 of the Evidence Act to include, in addition to a document in writing, … (d) any disc, tape, sound-track or other device in which sounds or other data (not being visual images) are embodied so as to be capable (with or without the aid of some other equipment) of being reproduced therefrom; (e) any film … tape, disc or other device in which one or more visual images are embodied so as to be capable (with or without the aid of some other equipment) of being reproduced therefrom; … 116 Section 63 states that the content of documents may be proved by primary or secondary evidence. Section 66 encapsulates the best evidence rule and states that “[d]ocuments must be proved by primary evidence except in the cases mentioned in section 67”. 117 Section 64 of the Evidence Act defines primary evidence as being the document itself. Section 64, read with the definition of “document” under s 3, therefore treats any device in which visual and sound images “are embodied” as being primary evidence. Therefore, copies of video or sound recordings produced in court are “document[s]” and as such primary evidence. This is to my mind a reflection of the fact that any copy of a video or sound recording which captures events contemporaneously is in itself essentially real evidence and should be treated as such. 118 In addition, Explanation 3 to s 64 of the Evidence Act also specifies that a copy can be primary evidence: Explanation3.—NotwithstandingExplanation2, if a copy of a document in the form of an electronic record is shown to reflect that document accurately, then the copy is primary evidence. “Electronic record” is in turn again defined under s 3 of the Evidence Act as being “a record, generated, communicated, received or stored by electronic, magnetic, optical or other means in an information system or transmitted from one information system to another”. Thus, an alternative ground to that under [117] for admission of the copies of video or sound recordings is that they are accurate copies and thus primary evidence for that reason. 119 The evidence from the private investigators was to the effect that the copies of the video recordings came from the recording device, in that the original recordings were copied from the recording device to various devices. After the files had been copied to other devices, they were deleted from the recording device to free up space on the recording device.100Foot Note 100×NE dated 8 August 2017 at pp 112–123, 126–129; NE dated 10 August 2017 at pp 67–69There was nothing which showed that such copying,ie, the transferring of the files from the recording device to other devices, resulted in an inaccurate copy being created, rendering the copied version inadmissible. 120 The Defendant suggested that the videos had been tampered with. Questions were posed on why certain videos which were originally in distinct parts in the device showed up in the DVD tendered in discovery as continuous footage.101Foot Note 101×NE dated 8 August 2017 at pp 147–154; DCS at paras 114–116, 122-–123.The Defendant also took issue with the presence of some skips in the videos, for instance, the video recording of the meeting on 19 November 2014 appeared to skip from the 16:05:47 mark to the 16:05:51 mark and again from the 16:32:20 mark to the 16:32:24 mark.102Foot Note 102×DCS at para 127; NE dated 8 August 2017 at pp 177–180.This same video also ended abruptly while the Defendant was speaking.103Foot Note 103×Plaintiff’s transcript of audio recording dated 19 November 2014 marked 3PT at p 149.These were all to my mind immaterial and insufficient to render the recordings inadmissible. None of the skips in the videos which were of short durations could point to deliberate tampering of the evidence or undermine the reliability of the recordings as a whole. The skips, abrupt endings and differences in the nature of the files (distinct parts rather than continuous streams) did not show that there had been deliberate tampering of the video recordings and likely arose due to technical issues with the recording devices. 121 Further, nothing was put to the Plaintiff witnesses that there was any portion that was inaccurate in reflecting the true events. The Defendant when he testified did not raise anything material that put the accuracy of these recordings into doubt – his primary contention was that he was merely playacting during the meetings, not that the recordings were inaccurate or that they were false in anyway. The Defendant did not suggest for instance that the video recordings, in ending abruptly or containing short skips, failed to portray the true events that occurred during the meetings; or that his conduct as reflected in the videos and relied on by the Plaintiff as constituting breach of the Contract were inaccurate or taken out of context. For this same reason, the fact that another video recording of the meeting on 19 November 2014 recorded by the Private Investigator was not produced in evidence (see [32] above) was immaterial. Indeed, the Defendant himself accepted that the video recordings were accurate, at least as to the material portions.104Foot Note 104×NE dated 18 August 2017 at pp 32–33; NE dated 15 September 2017 at pp 26–30. 122 In relation to the transcripts, I accepted that these were also admissible since they were made with reference to the video recordings. A translation certificate pursuant to Order 92 Rule 1 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) was also not necessary. Many conversations are conducted in a mixture of languages and so long as the predominant language used is English, it is not necessary, to my mind, for certification to be done. In any event, this has been addressed through the production of the relevant translation certificate by the Plaintiff, although at a relatively late stage.105Foot Note 105×Plaintiff’s letter to court dated 7 August 2017. 123 Finally, as regards the reports from the private investigation company, I did not see that there was anything in the nature of these reports that supported their exclusion. The reports were properly adduced. While the reports were not written by the Private Investigator who attended the meetings with the Defendant but someone else from the private investigation company, the former appeared as a witness during the trial and testified as to how she conducted her investigations during her meetings with the Defendant.106Foot Note 106×NE dated 10 August 2017. NE dated 11 August 2017.There was little or no inconsistency between the reports and her testimony. It was also clear that the reports were prepared based on what the Private Investigator had narrated and reported internally.107Foot Note 107×NE dated 8 August 2017 at p 94; NE dated 10 August 2017 at pp 41–45; AEIC of Philip Tan See Wei dated 13 June 2017 at para 5.Given that the evidence of the Private Investigator was tested under cross-examination, the rule on hearsay evidence therefore did not apply to exclude the reports prepared by persons other than the Private Investigator herself. As the Court of Appeal noted inSoon PeckWah v Woon Che Chye[1997] 3 SLR(R) 430 (at [27]): The rationale for the hearsay principle is that the witness cannot verify the truth of the facts of which he has no personal knowledge. As the person who does have personal knowledge of the facts is not in court, the accuracy of his perception and his veracity cannot be assessed and tested in cross-examination. Such evidence is unreliable and should hence be excluded from consideration. … For reasons explained, these concerns underlying the rule against hearsay evidence did not apply in relation to the reports prepared by the private investigation company. Assessment of evidence 124 While the Defendant claimed, in relation to his conduct during the Private Investigator’s sting operation, that he was merely playacting, to find out whom the Private Investigator was working for and for what purpose, on viewing the video recordings of the meetings, and considering the transcripts and reports of the private investigation company, I was of the view that the Defendant had indeed treated the Private Investigator as a genuine potential client, and that what was portrayed in the video recordings reflected his true intentions. 125 In particular, there was simply nothing to show that there was any actual attempt to dig into the facts or verify the identity of the Private Investigator, which would have been expected had the Defendant truly been suspicious. Against this, that there may have been some issue with the backstory given by the Private Investigator, which the Defendant said led to his suspicions on her identity, did not assist his case.108Foot Note 108×NE dated 10 August 2017 at pp 157–158; NE dated 18 August 2017 at pp 101–112; NE dated 15 September 2017 at pp 34–39.That the Defendant had appended a fake signature (ie, one of a non-existent person) as a witness to the Private Investigator’s signature109Foot Note 109×AEIC of Loke Yoke Fun dated 13 June 2017 at p 33; NE dated 14 September 2017 at p 25.was also not enough to support the Defendant’s contention of only playing a role. There could have been other reasons for the Defendant having appended a fake signature, rather than his own. 126 The fact that the sale with the Private Investigator was not completed did not assist the Defendant either as that did not necessarily show that he did not treat his discussions with the Private Investigator as genuine at the time. On the balance of probabilities, I was satisfied that the dealings with the Private Investigator were thought by the Defendant to be genuine at least on the occasions captured on video. 127 The private investigation videos, transcripts and reports showed that the Plaintiff had promoted the Dolphin Product on behalf of entities other than the Plaintiff. That the Defendant had informed the Private Investigator that he “will be” (in contrast to “is”) a representative of Megatr8 was immaterial as the conversations were consistent with the Defendant promoting the product on behalf of an entity other than the Plaintiff.110Foot Note 110×Plaintiff’s transcript of audio recording dated 2 October 2014 marked 1PT at pp 50–54, 71; AEIC of Philip Tan See Wei dated 13 June 2017 at PT1 paras 17–23; NE dated 18 August 2017 at pp 59–64.Such activity breached the non-compete clauses under cll 10(a) and 11(b) of the Contract, specifically, the obligation not to promote or market a product that was competing with the Plaintiff’s own offering. That the sale was not eventually completed did not assist the Defendant in this regard. I was satisfied that the Defendant was indeed marketing the Dolphin Product for entities other than the Plaintiff, and this breached cll 10(a) and 11(b) of the Contract. 128 The Defendant argued that he could not have been representing Megatr8 due to restrictions on his ability to do so, as he did not have the requisite licence.111Foot Note 111×AEIC of Pang Chee Kuan dated 19 June 2017 at para 54.In addition, according to the Defendant, under the Securities and Futures Act Megatr8 could not sell to the Private Investigator as she was a non-accredited investor.112Foot Note 112×DCS at paras 157–161; DRS at para 143(1)–143(5)These arguments could not assist the Defendant. The fact of the matter was that the Defendant had promoted the Plaintiff’s products on behalf of entities other than the Plaintiff and this in itself constituted a breach of the Contract. Whether or not he had the legal capacity to and could legally represent these entities in the sale of the products were irrelevant. 129 The Defendant also submitted that Megatr8 and the Plaintiff were not competitors and therefore there was no breach of the Contract even if the Defendant had represented Megatr8 in the sale of the Dolphin Products. This was since the Plaintiff and Megatr8 had a different business model,ie,Megatr8 sold under a regulated and structured fund while in the Plaintiff’s case, all investment moneys were paid directly to the developer.113Foot Note 113×DCS at paras 176–194; DRS at para 143(6).I rejected the Defendant’s narrow construction of activities competing with the Plaintiff under the Contract. While the product may be structured or packaged differently, what mattered as the Plaintiff had argued, was that the Dolphin Product sold by both companies were essentially substitutable, in that clients who would have otherwise invested in the Plaintiff’s Dolphin Product had the Defendant been representing the Plaintiff were diverted to Megatr8 for the purchase of the Dolphin Product. 130 I note for completeness that while the Plaintiff argued that an adverse inference should be drawn against the Defendant under s 116, illustration (g) of the Evidence Act for not having produced his income tax statements and bank statements for 2014 in order to show that he did not receive income from diverting business,114Foot Note 114×PCS at paras 148-153.there was sufficient evidence from the video recordings, transcripts and reports from the private investigation company to establish breach of Contract by the Defendant, even without any adverse inference being made against the Defendant. I was satisfied in any event that an adverse inference should not be drawn, given that the Plaintiff had taken out a discovery application for the statements and the Defendant was ordered to provide only limited discovery115Foot Note 115×HC/ORC 5229/2016.which he complied with.116Foot Note 116×Affidavit of Pang Chee Kuan for SUM 3288/2016 dated 12 August 2016. 131 In sum, I found that the Defendant had breached the Contract. The extent and consequence of such breach will have to be examined at the quantification hearing.",
        "Implied agency": "21 In the alternative, should this court find that the Contract was discharged since March 2012, the Plaintiff submitted that an implied agency arose thereafter such that the Defendant had a duty not to put himself in conflict with the interests of the Plaintiff, as his principal. Diversion of business would in this regard entail a breach of the fiduciary duty owed by the Defendant to the Plaintiff as his principal and an account had to be ordered as to any profits that he may have made from that breach.24Foot Note 24×PCS at paras 158–163.",
        "Defamation counterclaim": "132 The defamation counterclaim by the Defendant was in respect of the letter dated 6 March 2015 issued by the Plaintiff on Desmond Chong’s instructions. This letter was issued to 107 of the Defendant’s clients.117Foot Note 117×Defence and counterclaim (amendment no. 1) dated 31 March 2017 at para 40.The letters to each recipient read in material parts:118Foot Note 118×AB Vol VIII at pp 3977–4053; AB Vol IX at pp 4053-–4085. CHANGE OF SERVICING CONSULTANT We write to inform you that the appointments [sic] of [the Defendant] as our representatives have [sic] been suspended with immediate effect on 4 March 2015. We have assigned … to be your new servicing consultant with immediate effect. Rest assured that we have the best interests in your investment with [the Plaintiff], and will accord the same professional services that [the Defendant] has given to you. We thank you for your confidence in us, and look forward to your continuous support in the years ahead. Please do not hesitate to contact … should you require any clarifications. It was argued by the Defendant that the natural and ordinary meaning of the letter was that the Defendant had committed civil and criminal wrongs leading to his suspension, and that the letter was thus defamatory.119Foot Note 119×Defence and counterclaim (amendment no. 1) at p 21 133 For defamation to be made out, the following requirements must be established (seeGabriel Peter & Partners (suing as a firm) v Wee Chong Jin and others[1997] 3 SLR(R) 649 at [24];LohSiew Hock and others v Lang Chin Ngau[2014] 4 SLR 1117 at [18]): (a) The statement must be defamatory. (b) Such a statement must refer to the plaintiff. (c) The statement must be published or caused to be published by the defendant. In relation to the requirement in (a), a statement is defamatory in nature if it is one that tends to lower the reputation of the plaintiff in the esteem of right-thinking members of society generally; causes the plaintiff to be shunned or avoided; or exposes the plaintiff to hatred, contempt or ridicule (seeGolden Season Pte Ltd and others vKairos Singapore Holdings Pte Ltd and another[2015] 2 SLR 751 at [36]). As noted in Gary Chan Kok Yew & Lee Pey Woan,The Law of Torts in Singapore(Academy Publishing, 2nd Ed, 2016) at para 12.017, the test of lowering the reputation of the plaintiff appears to be that most widely referred to in Singapore, and will be the test considered here. 134 In the assessment of the meaning of the words claimed to be defamatory, the test to be applied is an objective one. The court decides the meaning the words would have conveyed to an ordinary, reasonable person using his general knowledge and common sense; the meaning intended by the maker of the defamatory statement is irrelevant (Microsoft Corp and others v SM Summit Holdings Ltd and another and other appeals[1999] 3 SLR(R) 465 at [53]). 135 I found that the remarks made in the letter dated 6 March 2015 would not be understood to carry a defamatory meaning. The ordinary meaning would simply be that there was some incident or event that gave rise to the suspension of the Defendant. What the incident or event was which gave rise to the suspension was not expanded upon in the letter, and the letter could not without more be given a meaning that would lower the esteem of the Defendant in the eyes of right-thinking members of the society. A suspension could for instance be simply on the basis that there was some dispute or disagreement or a parting of ways. 136 The Defendant contended that the wording of the letter dated 6 March 2015 meant or were understood to mean that the Defendant had committed either a criminal or civil wrong. That was not to my mind a conclusion that would be drawn. An ordinary reasonable person would consider that suspension may arise from matters falling short of the actual commission of a criminal or civil wrong. 137 In any event, in relation to the commission of civil wrong, a breach of contract itself would not, unless particularly egregious, be conduct that would lead to a lowering of reputation and therefore be defamatory. Contractual breaches may arise for many reasons including differing interpretations of obligations or possibly even the pursuit of better economic gains. In addition, even if the remarks were in its natural meaning defamatory, the defence of justification would be made out in the light of my conclusion that there was indeed breach of the Contract by the Defendant. 138 Therefore, I found that the statements were not defamatory in nature as they did not, unlike argued by the Defendant, convey that criminal or civil wrongs had been committed by the Defendant and there was no lowering of the reputation of the Defendant in the esteem of right-thinking members of society.",
        "Summary of the Defendant’s case": "23 The Defendant argued that the Contract only included the sole product listed under Schedule A of the Contract,ie, the Villages Product. Therefore, the Contract was no longer in operation after the Plaintiff ceased selling the Villages Product in March 2012. The Defendant became a “free agent” thereafter.27Foot Note 27×Defendant’s closing submissions dated 27 October 2017 (“DCS”) at paras 61–68.This is since, amongst others, the Contract had not been extended by the parties after March 2012.28Foot Note 28×DCS at paras 69–78There was thus no breach by the Defendant of the non-compete clauses in the Contract which were in any event unreasonable restraint of trade clauses which were unenforceable. The Defendant’s conduct also did not constitute diversion.",
        "Frustration of the Contract": "86 The Defendant argued that the Contract had expired and was no longer in operation when the sale of the sole product listed under Schedule A,ie, the sale of the Villages Product came to an end. This, it argued, meant that the Contract was frustrated in March 2012 when the sale of the Villages Product ceased.83Foot Note 83×DRS at para 70. 87 Frustration requires the occurrence of a supervening event after the formation of the contract which renders the contractual obligation “radically or fundamentally different” from what had been agreed in the contract (seeAlliance Concrete Singapore Pte Ltd v Sato Kogyo (S) Pte Ltd[2014] 3 SLR 857 at [33]). Such a supervening event arises through no fault of either party. The effect of frustration is to discharge both parties from their contract automatically by operation of law. The doctrine is applied strictly based on a multi-factorial assessment, and operates to discharge the parties from their contract only in exceptional cases. As Rix LJ articulated in the English Court of Appeal decision ofEdwintonCommercial Corporation, v Tsavliris Russ (Worldwide Salvage & Towage) Ltd (The Sea Angel)[2007] 2 Lloyd’s Rep 517 at [111]: In my judgment, the application of the doctrine of frustration requires a multi-factorial approach. Among the factors which have to be considered are the terms of the contract itself, its matrix or context, the parties’ knowledge, expectations, assumptions and contemplations, in particular as to risk, as at the time of contract, … and then the nature of the supervening event, and the parties’ reasonable and objectively ascertainable calculations as to the possibilities of future performance in the new circumstances. … [T]he test of ‘radically different’ is important: it tells us that the doctrine is not to be lightly invoked; that mere incidence of expense or delay or onerousness is not sufficient; and that there has to be as it were a break in identity between the contract as provided for and contemplated and its performance in the new circumstances. 88 As explained above, I rejected the Defendant’s interpretation of the Contract as covering only the Villages Product and found that the Contract covered all of the products which the Defendant was tasked with, given or undertook to promote, market or sell for the Plaintiff. In addition, the Contract, which took the form of a letter of appointment appointing the Defendant as a Vice President and independent contractor, governed the whole of the relationship between the Plaintiff and the Defendant. It therefore could not be said that the cessation of the sale of the Villages Product on its own rendered the obligations under the Contract radically different. 89  In any event, I would not have found, even on the Defendant’s interpretation of the Contract as covering only the Villages Product, that there was frustration. Even if the Defendant’s interpretation of the Contract were accepted, the cessation of the sale of the Villages Product would not have amounted to a supervening event which frustrated the Contract. It may have released the Defendant’s obligation under the Contract to market the Villages Product but it did not follow that such cessation resulted in the Contract as a whole being frustrated. Exhaustion of the subject matter of the contract does not necessarily itself lead to frustration of the contract. For frustration to be applicable, it must be shown that the unavailability of the subject matter of the contract or the product(s) essential for the performance of the contract (in this case the Villages Product based on the Defendant’s interpretation of the Contract) was not within the contemplation of parties and thus had the effect of radically changing the obligation under the contract. 90 Here, I found that the cessation of the sale of the Villages Product was an event that was within the contemplation of the parties. The Villages Product is a land-based product. The sale of the Villages Product was essentially the sale of land that is to be developed in a particular area in Hawaii.84Foot Note 84×AEIC Chong Chin Fook dated 15 June 2017 at para 11; AEIC of Pang Chee Kuan dated 19 June 2017 at para 9; NE dated 17 August 2017 at pp 105–106.Due to the nature of the Villages Product as land-based immoveable property within a designated area, it would have naturally been within the contemplation of the parties that it may eventually sell out. 91 In addition, given that the focus of the Contract was on delineating the parties’ rights and obligations in respect of the continuous relationship between the parties, as opposed to in respect of a specific product (see above at [67]), even on the Defendant’s single-product interpretation of the Contract, the cessation of the sale of the Villages Product by the Plaintiff did not have the effect of rendering the parties’ obligation under the Contract radically different. 92 Had the Defendant’s single-product interpretation of the Contract been accepted, an argument could potentially have been made that there was an implied term that the Contract was to be terminated when the Villages Product was no longer being sold by the Plaintiff. If the Contract were to be terminated in such circumstances, it would be due to the operation of such an implied term and not because of the operation of the doctrine of frustration. The existence of such an implied term was not argued by the Defendant and in the absence of any such argument or pleading, I could not find, even if I had accepted the Defendant’s interpretation of the Contract, that the Contract had been terminated on the grounds of such an implied term.",
        "Unreasonable restraint of trade": "29 The Defendant also argued that the non-compete clauses in the Contract,ie, cll 10–11 were unenforceable as they were unreasonable restraint of trade clauses. This is since the clauses did not protect any legitimate proprietary interest.40Foot Note 40×DRS at paras 80–84.The test of reasonableness was also not fulfilled due to the significant geographical area covered by the clauses and the wide product coverage.41Foot Note 41×DCS at paras 63–64; DRS at paras 85–91; Defence and counterclaim (amendment no. 1) dated 30 March 2017 at para 44(1)(c)",
        "No breach of the Contract": "30 The Defence submitted that the reports from the private investigation company as well as the video recordings and transcripts of the meetings between the Defendant and the Private Investigator should not be admitted.42Foot Note 42×DCS at paras 80–142. 31 In relation to the reports of the private investigation company, these were not prepared by the Private Investigator who attended the meetings with the Defendant, but by someone else from the private investigation company who did not have direct knowledge of the meetings. The rule against hearsay evidence was triggered and rendered the reports inadmissible.43Foot Note 43×DCS at paras 82-97. 32 The Defendant further argued that the video recordings should not be admitted into evidence given that the integrity of the video recordings was in doubt.44Foot Note 44×DCS at paras 98–138; DRS at para 111–115, 117.This was since the original recordings were destroyed, deleted or lost.45Foot Note 45×DCS at paras 106–138.There were also numerous breaks and skips in the videos and it could not be ascertained whether these were in the original footage or if the videos had been tampered with.46Foot Note 46×DCS at paras 100–103, 127The video of the meeting on 19 November 2014 which was relied on by the Plaintiff was not taken by the Private Investigator herself but by a person who was not called.47Foot Note 47×DCS at para 98–99.Another video recorded by the Private Investigator during the same meeting on 19 November 2014 was not produced in evidence.48Foot Note 48×DCS at paras 105. 33 In respect of the transcripts of the video recordings, these should likewise not be admitted given that they were prepared on the basis of copies of the recordings, and not from the original recordings.49Foot Note 49×DCS at paras 139. 34 In any event, according to the Defendant, the evidence stemming from the investigations by the private investigation company did not assist the Plaintiff’s case. The materials did not show that the Defendant had diverted business. In relation to the Plaintiff’s alleged claim that the Defendant had diverted business to Megatr8, the videos showed that the Defendant had not held himself out as a representative of Megatr8 but only that he “will be” a representative of Megatr8.50Foot Note 50×DCS at paras 155–156, 201; DRS at paras 96–108.The Defendant was also exaggerating during his meetings with the Private Investigator as he knew that she was not a genuine investor or potential client and had wanted to fish out information and find out who she really was.51Foot Note 51×DCS at paras 201–216. DRS at paras 125–132.There was no evidence of any diversion by the Defendant either. He had no intention of making a sale to the Private Investigator. No product was in fact purchased by the Private Investigator.52Foot Note 52×DCS at paras 217–227; DRS at paras 124, 135–142. 35 In addition, regardless of whether the Defendant was promoting products for Megatr8, the Defendant could not have been and was not a representative of Megatr8. This is because, amongst others, Megatr8 was a registered fund management company regulated by the Monetary Authority of Singapore (“MAS”) and under the provisions of the Securities and Futures Act (Cap 289, 2006 Rev Ed) (“Securities and Futures Act”), Megatr8 could not sell to non-accredited investors such as the Private Investigator.53Foot Note 53×DCS at paras 157–161; DRS at para 143(1)–143(5)Further, if the Defendant was a representative of Megatr8, Megatr8 would have been required by law to inform MAS.54Foot Note 54×DCS at paras 158, 162–167.Megatr8 was in any event not a competitor to the Plaintiff as it had a different business model and marketed different products. In particular, the Plaintiff was prohibited by law from engaging in the sale of regulated products, while Megatr8 on the other hand, was only allowed to sell or market regulated products. The funds sold by Megatr8 were placed in a fund lodged with MAS,ie, Megatr8 sold under a regulated and structured fund while in the Plaintiff’s case, all investment moneys were paid directly to the developer.55Foot Note 55×DCS at paras 176–194; DRS at paras 143(5), 143(6). 36 Further, the dip in the Defendant’s sales in 2014 did not stem from the Defendant diverting sales away from the Plaintiff but rather from the personal trials and tribulations the Defendant was facing at the time which affected his performance. There had also been a dip in the sales of other individuals representing the Plaintiff and not just the Defendant during that period.56Foot Note 56×DCS at paras 259–265. 37 In addition, no adverse inference should be drawn against the Defendant under s 116, illustration (g) of the Evidence Act for not having produced his income tax statements and bank statements for 2014. Pursuant to the Order of Court that was issued in Summons 3288 of 2016 in respect of the Plaintiff’s application for discovery of these documents, the Defendant filed an affidavit confirming that all of his income tax and bank statements of 2014 did not show any payments received in relation to work done for Megatr8 and the other entities pleaded in the Plaintiff’s statement of claim.57Foot Note 57×DCS at paras 288–296; DRS at paras 151–162.",
        "No implied agency": "38 The Plaintiff’s alternative submission that an implied agency arose after the Contract was discharged could not succeed given that cll 7 and 9 of the Contract disallowed an agency. In any event, there was no evidence adduced by the Plaintiff to show that the Plaintiff and the Defendant were ever in a principal-agent relationship.58Foot Note 58×DRS at paras 167–169.",
        "The decision": "40 Having considered the evidence and submissions, I found that the Contract did indeed cover other products aside from the Villages Product, including the Dolphin Product, and that the Contract remained in force after the cessation of the sale of the Villages Product in March 2012. I found also that the Defendant breached the Contract by his actions, and therefore damages were to be assessed. No vitiating factors operated. 41 The Defendant’s defamation counterclaim was not made out as the letter dated 6 March 2015 was not defamatory. In any event, the defence of justification would have been established in the light of the finding that there was breach of the Contract.",
        "Analysis": "42 The following analysis will consider in turn: (a) the proper interpretation of the Contract; (b) whether there was frustration of the Contract; (c) whether the Contract had been terminated; (d) whether the restraint of trade clauses were enforceable; (e) whether the Contract was breached; and (f) the Defendant’s defamation counterclaim.",
        "Interpretation of the Contract": "43 The first issue that had to be considered was the contractual obligation of the Defendant. The question of the proper interpretation of the Contract in the present case involved some intricacy. 44 I had some sympathy for the Defendant’s submissions on the proper interpretation of the Contract which focused on its plain wording. That the preamble of the Contract tasked the Defendant with marketing the products stipulated in Schedule A, and that Schedule A only listed the Villages Product, seemed to suggest on its face that the Contract only covered the Villages Product. Such an interpretation of the Contract carried the force of simplicity and certainty. It also left the consequences for any shortcoming in the express wording of the Contract on its drafter, in this case the Plaintiff. 45 Nevertheless, however attractive as this approach may be, I was satisfied that applying the current law on the interpretation of contracts which requires the assessment of both text and context, the proper interpretation is that the Contract covered all of the products which the Defendant was tasked with, given or undertook to promote, market or sell for the Plaintiff, including the Dolphin Product. This flowed from the context of the Contract as a whole, as well as the commercial objective of the Contract. Law on contractual interpretation 46 In interpreting a contract, the court should balance both the text and the context of the agreement. The starting point of contractual interpretation is the text of the agreement (seeY.E.S. F&B Group Pte Ltd v Soup Restaurant Singapore Pte Ltd (formerly known as Soup Restaurant (Causeway Point) Pte Ltd)[2015] 5 SLR 1187 (“Y.E.S. F&B Group Pte Ltd”) at [32];Ngee Ann Development Pte Ltd v Takashimaya Singapore Ltd[2017] 2 SLR 627 at [61]). However, where the text concerned is ambiguous, the relevant context would be of first importance (Y.E.S. F&B Group Pte Ltdat [34]). 47 In addition, even where the text itself may appear plain and unambiguous, where the unambiguous meaning of the text would lead to an absurd result, the court should undertake an examination of the context in order to determine if the text were indeed unambiguous as originally thought to be the case. This is since if the text of the agreement were indeed clear and unambiguous, there would be a confluence with context, in that the context would not call into question the plain meaning of the text itself (seeY.E.S. F&B Group Pte Ltdat [31]). 48 The context must however be weighed in the light of the objective evidence. InY.E.S. F&B Group Pte Ltd, the Court of Appeal reiterated that the context cannot be used to justify the avoidance of a seemingly absurd result arising from a textual interpretation at all costs. In particular, a seemingly absurd result should not be evaded if the objective evidence shows that the absurd result was indeed within the contemplation of the parties at the time of contracting. In other words, context should not be used as a basis for the court to rewrite the contract. The court has to determine the intentions of the parties at the time they entered into the contract. The Court of Appeal stated at [32]: [T]here must be abalancebetween the text and the context. In other words, the contextcannotbe utilised as an excuse by the court concerned torewritethe terms of the contract according toits(subjective) view of what it thinks the result ought to be in the case at hand. … More specifically, whilst there is a need to avoid an absurd result, this aim cannot be pursued at all costs; it must necessarily give way if the objective evidence clearly bears out acausative connectionbetween the absurd result or consequences on the one hand and the intention of the parties at the time they entered into the contract on the other. What we mean by this, essentially, is that if the objective evidence demonstrates that the parties had contemplated the absurd result or consequence, the court is not free to disregard this to reach what may seem to it to be a more commercially sensible interpretation of the contract. Avoiding an absurd result is thusone factor(albeit a not unimportant one) which is considered in the entire process of interpretation by the court. Put simply, the courtmustascertain, based onall the relevant objective evidence,the intention of the partiesat the time they entered into the contract. In this regard, the court shouldordinarilystart from the working position that the parties did not intend that the term(s) concerned were to produce an absurd result.However, this isonlyastarting point–and no more. It might, for example, well be the case that theobjectiveevidence demonstrates that the parties wereaware ofthe absurd result that might ensue from the said term(s), butnevertheless proceededto enter into the contract in question … [emphasis in the original] 49 With these principles in mind, I consider in the following analysis the proper interpretation of the Contract. Relevant clauses in the Contract 50 Several clauses in the Contract had to be interpreted in the present dispute. 51 The preamble of the Contract reads:63Foot Note 63×AB Vol X at p 4631. We are please [sic] to inform you that with effect from the date of this letter, you are being appointed to the position of a Vice President of [the Plaintiff] to market product(s) stipulated in Schedule A as an Independent Contractor (hereinafter “IC”), on the following terms and conditions which you are required to strictly adhere to and to treat as confidential. 52 The clauses that restricted the activities of the Defendant which the Plaintiff relied on for its claim that the Defendant had breached the Contract were as follows:64Foot Note 64×Statement of claim (amendment no. 1) dated 8 February 2017 at paras 4–8. (a) Clause 10 which read:65Foot Note 65×AB Vol X at p 4633. 10. Exclusive Service and Conflict of Interest a. As an appointed independent contractor, you acknowledge to devote your working time and attention to the performance of your work as an independent contractor … and shall not engage in any other business duties, activities or employment which competes or conflicts with the business or activities of [the Plaintiff], or may limit work availability, during the term of the [Contract]. In particular, you shall not be involved in any way, manner or form, in the promotion, marketing or sale of any other products that compete directly or indirectly with [the Plaintiff’s] products. This includes but not restricted to the following: i. property; ii. insurance; iii. stocks, bonds, private placement, unit trusts and/or any other forms of securities product(s). Otherwise, the Company shall have the right to immediately terminate the [Contract]. b. [The Plaintiff] shall have full discretion to determine whether a particular product does or does not fall within this definition and [the Plaintiff’s] decision shall be final and conclusive. … d. The IC [ie, the Defendant] further agrees to truly and faithfully serve the best interests of [the Plaintiff] at all times during the term of the [Contract]. (b) Clause 11 which reads:66Foot Note 66×AB Vol X at p 4634–4635. 11. Confidential Information Non-Compete and Non-Solicitation a. The IC [ie, the Defendant] acknowledges that pursuant to the terms of the [Contract], he will acquire information of a confidential nature relating to the business of [the Plaintiff], including, without limitation: any trade secrets or confidential information relating to or belonging to [the Plaintiff] … including but not limited to any such information relating to customers, customer lists or requirements, price lists or price list structures, marketing and sales information, business plans or dealings, employees or officers, financial information and plans, designs, formula, product lines, prototypes, services, research activities … which is the exclusive property of [the Plaintiff] … Accordingly, the IC [ie, the Defendant]  agrees and undertakes that during the term of the [Contract], and following the termination of the [Contract] for any reason, the IC [ie, the Defendant] shall: i. treat confidentially and protect against disclosure all Confidential Information belonging to [the Plaintiff]; and ii. shall not use or disclose the Confidential Information to any third party, except for the purpose of carrying out the work as an IC under the [Contract] or as may be required to be disclosed by law. b. The IC [ie, the Defendant] further agrees and undertakes that he shall not, either individually or in partnership or jointly or in conjunction with any person or persons, firm ... company, corporation, as principal, agent, shareholder, employee, consultant … : i. During the term of the [Contract] and for a period of one (1) year from the date of termination of the [Contract] for any reason compete with [the Plaintiff] in respect of similar business anywhere in Asia; … 53 Other clauses in the Contract were also relied on by the Plaintiff as supporting its submission that other products aside from the Villages Product fell within the scope of the Contract. These were: (a) Cl 1 You will receive a personal commission which shall be based on a percentage of the invested amount and/or selling price (after deducting any expense relating to administrative costs, if any) stipulated in Schedule B in accordance to the type of product sold. (b) Cl 10(c) c. As an independent contractor, you shall retain control over your schedule and number of hours worked, jobs accepted, and performance of your job. … Sufficiency of pleadings 54 The Defendant argued that the Plaintiff’s submission that other products fell within the scope of the Contract based on a proper interpretation of the terms of the Contract,  was not pleaded by the Plaintiff. In particular, the Plaintiff had not pleaded cll 1, 10(a) and 10(c) in the relevant paragraph of its statement of claim containing this submission. The proper interpretation of these clauses was not put by the Plaintiff in the cross-examination of the Defendant either, violating the rule inBrowne v Dunn(1893) 6 R 67 (“Browne v Dunn”).67Foot Note 67×DRS at paras 30(2), 31(3)Any argument or point of law which is not pleaded cannot be considered and on this basis alone, the Defendant argued that the court should refuse to accept the Plaintiff’s submission in this respect.68Foot Note 68×DRS at paras 19–25. 55 I was unable to accept the Defendant’s contentions in this regard. The role of pleadings is to outline the party’s case in order to inform the court of the parameters of the dispute and the opponent party of the case it had to meet (seePT Prima International Development vKempinski Hotels SA and other appeals[2012] 4 SLR 98 at [35]). InSIC College of Business and Technology Pte Ltd v YeoPoh Siah and others[2016] 2 SLR 118, at [46], the Court of Appeal explained in relation to the law on pleadings that a court should not adopt an overly formalistic and inflexible rule-bound approach which might result in injustice. The Court of Appeal added that “Ultimately, the underlying consideration of the law of pleadings is to prevent surprises arising at trial…” 56 The Plaintiff had sufficiently pleaded its case. The statement of claim (amendment no. 1) stated the following: 3B Although the [Contract] mentioned only a single product, namely, [the Villages Product] that the Defendant was appointed to market, it was intended to, and did extend to other products which the Plaintiff would be appointed to market subsequent to 17 August 2009 including relevantly, the products of Dolphin Capital. PARTICULARS RELIED UPON BY THE PLAINTIFF TO SHOW THAT THE [CONTRACT] WAS INTENDED TO EXTEND TO SUBSEQUENT PRODUCTS MARKETED BY IT … (b) The Plaintiff was incorporated for the promotion, marketing and/or sale of asset backed investment products including land acquisition and joint-development projectsgenerally,andnot just for a single product. … (d) The Plaintiff will further rely on the express terms of the [Contract]. … [emphasis in the original] 57 It was sufficiently clear from the above-quoted paragraphs that the Plaintiff’s case was that on a proper interpretation of the terms of the Contract, other products aside from the Villages Product fell within the scope of the Contract. It therefore could not be said that the Defendant was taken by surprise by the Plaintiff’s line of argument in this regard. In this case, there was no need for the Plaintiff to have listed in its statement of claim all of the relevant terms in the Contract which it sought to rely on to support its understanding of the scope of the Contract. The lack of the complete details of a party’s case in its pleadings is to be expected in the light of the role of pleadings as explained at [55]. 58 There was no infringement of the rule inBrowne v Dunneither. Counsel for the Plaintiff had cross-examined the Defendant on specific terms in the Contract to a sufficient extent.69Foot Note 69×See for example Notes of Evidence (“NE”) dated 17 August 2017 at pp 112-–114, 132–133, 138–140.The Plaintiff had also put its case to the Defendant in the following terms:70Foot Note 70×NE dated 14 September 2017 at p 85. [Plaintiff counsel]: I will put the plaintiff's case to you and you can agree, or disagree. Mr Pang, I put it to you that the [Contract] was not limited to the villages product and therefore did not expire in March 2012. You can agree, or disagree?  COURT: Mr Pang? A. I am reading. Disagree. [Plaintiff counsel]: Mr Pang, I put it to you that the [Contract] was still in force when the diversion activities complained of took place in 2014. You can agree, or disagree? COURT: The \"diversion activities\" meaning ...? [Plaintiff counsel]: The \"diversion activities\" meaning the sales by yourself on behalf of other companies, other than Solomon. A. I disagree. 59 There was therefore no reason to reject the Plaintiff’s submissions on the scope of the Contract on the basis that it was not sufficiently pleaded. I shall now consider the interpretation of the Contract based on its text and context. Interpretation based on text 60 The preamble of the Contract read with Schedule A suggested that only the Villages Product fell within the scope of the Contract. 61 What was material from the text of the preamble of the Contract (see above at [51]), and in particular, the phrase “you are being appointed … to market product(s) stipulated in Schedule A as an Independent Contractor”, was that the product(s) that the Defendant was to market were those in Schedule A. Schedule A in turn only listed one product,ie, the Villages Product.71Foot Note 71×AB Vol X at p 4637. 62 The preamble and Schedule A of the Contract therefore point to the Defendant being required to market only one product. On a plain reading of just those provisions, the marketing of the Villages Product would be the whole of the extent of the Defendant’s obligation under the Contract. 63 The fact that the Contract was drafted by a layperson could not delimit the textual interpretation of the preamble read with Schedule A, though it may be a factor that may be taken into account in assessing the context of the Contract. The Plaintiff cited the case ofXiaZhengyan v Geng Changqing[2015] 3 SLR 732 for the proposition that strict construction of the language and structure of the agreement should not be applied where the contract is drafted by a layperson without the benefit of legal advice.72Foot Note 72×PCS at para 26(c).Here, at this stage of the interpretation, the question was not one of strict construction, but simply what the plain and ordinary meaning of the preamble read with Schedule A was. Unlike the contractual term that had to be interpreted inXiaZhengyan v Geng Changqing[2015] 3 SLR 732, the preamble read with Schedule A of the Contract, on its face, unambiguously suggested that the Contract only covered product(s) listed under Schedule A,ie, the Villages Product. 64 The Plaintiff submitted that its interpretation of the Contract as covering other products aside from the Villages Product was supported by the wording of a number of clauses which it argued reflected the intention of the parties for more than one product to fall within the scope of the Contract. In particular, the Plaintiff made the following arguments:73Foot Note 73×PCS at para 23. (a) Clause 1: Clause 1 stated that the Defendant would receive a personal commission “in accordance to the type of product sold”, showing that more than one product was envisaged by the parties. (b) Clause 10(a): The products under cl 10(a) which the Defendant was prohibited from engaging in competing activities in included “insurance, stocks, bonds, private placement, unit trusts and/or any other forms of securities product(s)” which were non-land based products. The Villages Product was a land-based product and if the Contract were indeed intended to cover only the Villages Product, the inclusion of non-land based products under cl 10(a) would be inexplicable. (c) Clause 10(c) refers to the Defendant retaining control over, amongst others, “jobsaccepted” [emphasis added]. 65 However, while all of these provisions may have showed that parties contemplated a variety of different products as falling within the scope of the Contract, they did not expressly exclude the possibility that there would only be one product included in the Contract, as specified by the text of the preamble and Schedule A. Therefore, it could not be said that cll 1, 10(a) and 10(c) plainly and unambiguously meant that the scope of products covered under the Contract extended to products other than that listed under Schedule A. 66 The text of cll 1, 10(a) and 10(c) did suggest however that the relationship between the parties persisted and went beyond the marketing of the sole product listed under Schedule A. Therefore, while the text of the preamble and Schedule A were on its face plain and unambiguous and suggested that only one product was covered under the Contract, read with other clauses of the Contract, including cll 1, 10(a) and 10(c), the scope of products covered under the Contract was not clear cut. The text of the Contract was however not the end of the matter and the context had to be considered. Interpretation based on context 67 The most crucial contextual factor that had to be taken into account was that the Contract, which took the form of a letter of appointment appointing the Defendant as Vice President and an independent contractor of the Plaintiff, was to govern the entirety of the relationship between the Plaintiff and the Defendant. While it is possible for a relationship to be concerned with only a single product, this conclusion would be less likely where there are indications that a continuous, prolonged relationship was intended to exist between the parties. Here, I found that the rest of the terms of the Contract pointed to such a relationship and that the focus of the Contract was on the relationship between the parties rather than on a specific product. Based on an examination of the Contract as a whole, the objective of the Contract was the delineation and governance of an ongoing relationship between the parties. That also to my mind accorded with the commercial objective of the parties. 68 As the Contract was one which governed the appointment of the Defendant to a post within the Plaintiff company, in particular as a Vice President (albeit also as an independent contractor), I was of the view that the parties’ intention was not to have Schedule A which lists only one product, to delimit the entirety of the relationship between the parties. It would be incongruous for a contract intended to govern the entirety of a long-term relationship between the parties to have included only obligations relating to one product. 69 The express inclusion of only the Villages Product under Schedule A could be explained as reflecting the fact that the Villages Product was the only product sold by the Plaintiff at the time of the conclusion of the Contract.74Foot Note 74×NE dated 17 August 2017 at p 102; SOC (amendment no. 1) dated 8 February 2017 at para 3B(c).This was since the Contract was concluded only one day after the incorporation of the Plaintiff.75Foot Note 75×Statement of claim (amendment no. 1) dated 8 February 2017 at para 3; NE dated 17 August 2017 at p 102.Therefore, I found that the preamble read with Schedule A reflected the existing state, but was not intended by the parties to delimit the entirety of the relationship thereafter. 70 It is against this context of the relationship between the parties that aspects of the wording of cll 1, 10(a) and 10(c) (see above at [64]) was supportive of a conclusion that the parties did not intend, despite the plain words of the preamble read with schedule A, to limit the scope of the Contract to only one product,ie, the Villages Product. This included the fact that the Contract prevented the Defendant from engaging in competing activities across various types of products marketed by the Plaintiff as listed in cll 10(a)(i)–(iii) which covered property, insurance, and securities. The scope of confidential information protected under cl 11(a) was also much broader than would be the case if the Contract was intended by the parties to be limited to the single product listed under Schedule A. 71 Against this context, the fact that subsequent amendments in the form of the addition of other products were made in relation to other third parties with whom the Plaintiff had entered into similar contracts, did not sway the matter – that exercise put the question beyond any doubt for those whose contracts were indeed amended and updated after the conclusion of the contract; it did not show however that the Contract between the Plaintiff and the Defendant which was not amended after its conclusion should be interpreted in the manner contended for by the Defendant. 72 The Plaintiff pointed to the fact that the Defendant sold other products not listed under Schedule A on behalf of the Plaintiff prior to March 2012, in support of its interpretation.76Foot Note 76×PCS at paras 28–36.Subsequent conduct may be considered in the interpretation of a contract, but with due caution. As the Court of Appeal stated inHewlett-Packard Singapore (Sales) Pte Ltd v Chin Shu Hwa Corinna[2016] 2 SLR 1083 (“Hewlett-Packard”) at [56]: ... we are not endorsing a blanket prohibition on the use of subsequent conduct. Like the question of the admissibility of prior negotiations, the question of the admissibility of subsequent conduct remains an open one that should be decided on a more appropriate occasion (see the decision of this court inXiaZhengyan v Geng Changqing[2015] 3 SLR 732 at [62]). We do, however, reiterate that any such evidence must satisfy the tripartite requirements of relevancy, reasonable availability and clear and obvious context mentioned inZurich Insurance([52]supra) before it may be admitted to interpret a contract. The requirements of civil procedure established in the decision of this court inSembcorpMarine Ltd v PPL Holdings Pte Ltd[2013] 4 SLR 193 at [73] must also be borne in mind. … The Court of Appeal further noted inHewlett-Packardthe potential for an examination of subsequent conduct to add a layer of uncertainty to contractual interpretation as, amongst others, the inferences to be made from subsequent conduct may be ambiguous (Hewlett-Packardat [57]). In addition, inCentre for Laser and Aesthetic Medicine Pte Ltd v GPK Clinic (Orchard) Pte Ltd and others and another appeal[2018] 1 SLR 180, the Court of Appeal stated that while there is no blanket prohibition on the use of subsequent conduct in contractual interpretation, it is in general only of relevance if the subsequent conduct provided cogent evidence of the parties’ agreement at the time when the contract was concluded (at [51]). 73 In the present case, in relation to the subsequent conduct of the parties in the form of the sale by the Defendant of other products aside from the Villages Product and receipt of commissions from the Plaintiff for such sales, I found that the tripartite requirements of relevancy, reasonable availability, and clear or obvious context as established inZurich Insurance(Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”) at [132(d)] were met. Such subsequent conduct was relevant since it shed light on what the parties had regarded their obligationsvis-a-viseach other under the Contract to be. In this regard, it assisted in the determination of what the parties’ objective agreement was at the point of conclusion of the Contract (as opposed to parties’ subjective intentions post-contract). That products other than the Villages Product were sold by the Defendant on behalf of the Plaintiff was also information that was reasonably available to both of the parties. The subsequent conduct here also related to a clear or obvious context. 74  The requirements inSembcorpMarine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 at [73] were also met since the relevant factual circumstances pertaining to the Defendant’s sale of other products on behalf of the Plaintiff had been sufficient pleaded by the Plaintiff.77Foot Note 77×SOC (amendment no. 1) dated 8 February 2017 at paras 3C, 3D, 3E, 22, 25. 75 I note also that subsequent conduct cannot be used to support an interpretation that is in direct contradiction to the express terms (Gay ChoonIng v Loh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332 at [88];Hewlett-Packardat [56]). In this case, I found that the subsequent conduct invoked was not in direct contradiction with the express terms of the contract, for the reasons stated above at [66]. 76 I was thus of the view that the relevant subsequent conduct relied on by the Plaintiff could be referred to as part of the interpretation of the Contract based on context. 77 That the Defendant sold other products for the Plaintiff for a number of years even before the cessation of the sale of the Villages Product, for which he was remunerated in a manner consistent with the Contract78Foot Note 78×Bundles of commission and management fee statements dated 17 August 2017; NE dated 17 August 2017 at pp 110–124.suggested that the parties intended the Contract to cover more than one product at the time of the conclusion of the Contract. 78 While it may be argued that this could be explained by an informal unwritten contract arising independently of the Contract in which, in the Defendant’s words, he had sold these products “as a free agent” with no terms or conditions governing his relationship with the Plaintiff,79Foot Note 79×DRS at para 48–49.such an explanation encounters too many difficulties to be viable. The Defendant argued that in relation to the Villages Product, the relationship between the Plaintiff and Defendant was governed by the Contract but in relation to other products, the arrangement wasadhocand there were no express terms or conditions governing the relationship.80Foot Note 80×DRS at paras 48–49.However, any informal contract or implied contract on the marketing of the other products would have to contain terms covering similar areas as those under the Contract, including terms concerning the payment of commissions, non-compete, and so on. In fact, though the Defendant’s case was that the Contract covered only the Villages Product, the Defendant’s testimony suggested that when he sold other products on behalf of the Plaintiff before March 2012, the Defendant did not consider himself free to sell those same products on behalf of other companies:81Foot Note 81×NE dated 17 August 2017 at pp 94–95. COURT: Mr Pang, Ms Chong's question is that, before March 2012, in relation to products other than [the Villages Product], let's say we're looking at the Dolphin products, when you were selling it, did you regard yourself as free to sell it for anyone, whether it's Solomon, or the other companies -- MS CHONG: Cedarich. COURT: -- Cedarich, or -- MS CHONG: Shenton Wealth. COURT: -- Shenton Wealth? Could you also have sold it on their behalf? A. Not that I know of. … COURT: All right, so I think we need to have some clarity on this. So the point of it is before March 2012 for, let’s say, the Dolphin product, if it had been marketed, or was being sold by some other company other than [the Plaintiff], would you have really considered yourself as being able to sell it for the other company? A. I think no, your Honour. 79 I found that it was implausible for the parties to have intended their relationship to be governed by two separate arrangements in relation to the Villages Product and other products,ie, one based on the express terms in the Contract and one based on informal arrangements. There was no evidence showing that such an arrangement was indeed intended by the parties. 80 The sale of other products on behalf of the Plaintiff by the Defendant was therefore indicative of the objective intention behind the Contract and how the parties mutually viewed their obligations. It showed that the parties intended and considered other products aside from the Villages Product as falling within the scope of the Contract. Certainly had any dispute arisen between the parties concerning the sale of the other products, it was more probable than not that both parties would have looked to the terms of the written Contract, which showed that they mutually regarded themselves bound by the terms of the Contract in relation to those other products. Conclusion on interpretation 81 In coming to these conclusions, I was mindful that the commercial objective of the parties should not be overly strained and that the court is not free to disregard the parties’ intentions based on its own view of what is the more commercially sensible interpretation of the contract. 82 The Contract as a whole in this case pointed to the entirety of the relationship between the Plaintiff and the Defendant being governed by that Contract and this suggested that more than one product was included within its scope. This was in my view not a strained determination of the commercial objective which was not aligned with the parties’ intentions. This was especially since the Contract took the form of a letter of appointment, making the Defendant a Vice President, with the objective of marketing the product or products as an independent contractor. These various aspects are not usually contracted together, but that was the Contract as it stood. It was certainly not a contract drafted in the best possible way. 83 Since the ambiguity in the Contract could be resolved by interpreting the Contract based on its context, thecontraproferentemrule, invoked by the Defendant to argue that its interpretation should be accepted, was not applicable (seeHewlett-Packardat [51]). 84 Therefore, based on an interpretation of the Contract, I found that the Contract was not limited to the Villages Product and that other products marketed by the Plaintiff fell within its scope. In particular, though not expressly included under Schedule A, the Contract included the Dolphin Product which the Defendant marketed and sold on behalf of the Plaintiff.82Foot Note 82×Statement of claim (amendment no. 1) dated 8 February 2017 at para 3D; AEIC of Pang Chee Kuan dated 19 June 2017 at para 19. 85 Based on the interpretation of the Contract, as will be explained in the following sections, the cessation of the sale of the Villages Product did not have the effect of discharging the Contract.",
        "Termination of the Contract": "93 The Defendant suggested that he had given notice of termination pursuant to cl 5 of the Contract in the October 2014 email which he had sent to the directors of the Plaintiff.85Foot Note 85×DRS at para 56.I found that the email did not have the effect of terminating the Contract. The October 2014 email stated:86Foot Note 86×AB Vol VIII, pp 3801–3802. Dear Directors of [the Plaintiff] After much consideration and months of agony, I have decided to withdraw my shares from [the Plaintiff] with effect from 20 October, since I have different views with the company’s operations. Like Hock Kee, I would like to start out on my own[,] and have the same arrangement with Hock Kee, please do not touch my set of clientele. I take this opportunity to thank Management for giving me the opportunity to work with your company. [the Defendant] 94 Clause 5 of the Contract states: This appointment as an IC may be terminated by either party without assigning any reason whatsoever by giving a twenty-four (24) hours written notice to the other party. Effective immediately upon the date of such termination, you shall refrain from any representation whatsoever that you are affiliated with [the Plaintiff] … 95 Although the Defendant testified that the October 2014 email was in his view a notice of termination pursuant to cl 5 of the Contract,87Foot Note 87×NE dated 18 August 2017 at pp 7–8, 17–18.the Defendant’s own case was that the October 2014 email conveyed the Defendant’s intention to withdraw as a shareholder of the Plaintiff and not as an independent contractor. According to the Defendant’s case, by this time, the Contract was no longer in operation and the only relationship he had with the Plaintiff was that of a shareholder.88Foot Note 88×DCS at paras 229; DRS paras 54–55; DRS Defence and counterclaim (amendment no. 1) dated 31 March 2017 at para 28. 96 The October 2014 email sent by the Defendant to the Plaintiff thus did not constitute notice of termination pursuant to cl 5 of the Contract. Given that the email sent concerned the share position of the Defendant, the email was not a notice of termination of the Contract sent in the manner stipulated under cl 5. One would have expected in the normal course of things that resignation would follow on the heels of such an email but the email itself could not have such effect. 97 The Contract was therefore not terminated in October 2014. 98 As I found that the Contract had not been terminated or frustrated, there was thus no need for me to address the Plaintiff’s alternative argument that there was an implied agency between the parties, which existed after the discharge of the Contract.",
        "Restraint of trade clauses": "99 The Defendant argued that even if the Contract were to be interpreted in the manner advocated by the Plaintiff, the relevant non-compete clauses relied on by the Plaintiff to establish breach of contract were unenforceable by virtue of being in unreasonable restraint of trade.89Foot Note 89×DCS at paras 63–64; DRS at paras 85–91; Defence and counterclaim (amendment no. 1) dated 30 March 2017 at para 44(1)(c).The relevant clauses which the Plaintiff argued were breached by the Defendant and which the Defendant argued were in unreasonable restraint of trade were cll 10 and 11:90Foot Note 90×Statement of claim (amendment no. 1) dated 8 February 2017 at paras 4–8; Defence and counterclaim (amendment no. 1) dated 30 March 2017 at paras 10, 14, 44, 46. 10. Exclusive Service and Conflict of Interest a. As an appointed independent contractor, you acknowledge to devote your working time and attention to the performance of your work as an independent contractor … and shall not engage in any other business duties, activities or employment which competes or conflicts with the business or activities of [the Plaintiff], or may limit work availability, during the term of the [Contract]. In particular, you shall not be involved in any way, manner or form, in the promotion, marketing or sale of any other products that compete directly or indirectly with [the Plaintiff’s] products. This includes but not restricted to the following: i. property; ii. insurance; iii. stocks, bonds, private placement, unit trusts and/or any other forms of securities product(s). Otherwise, the Company shall have the right to immediately terminate the [Contract]. b. [The Plaintiff] shall have full discretion to determine whether a particular product does or does not fall within this definition and [the Plaintiff’s] decision shall be final and conclusive. … d. The IC [ie, the Defendant] further agrees to truly and faithfully serve the best interests of [the Plaintiff] at all times during the term of the [Contract]. 11. Confidential Information Non-Compete and Non-Solicitation a. The IC [ie, the Defendant] acknowledges that pursuant to the terms of the [Contract], he will acquire information of a confidential nature relating to the business of [the Plaintiff], including, without limitation: any trade secrets or confidential information relating to or belonging to [the Plaintiff] … including but not limited to any such information relating to customers, customer lists or requirements, price lists or price list structures, marketing and sales information, business plans or dealings, employees or officers, financial information and plans, designs, formula, product lines, prototypes, services, research activities … which is the exclusive property of [the Plaintiff] … Accordingly, the IC [ie, the Defendant]  agrees and undertakes that during the term of the [Contract], and following the termination of the [Contract] for any reason, the IC [ie, the Defendant] shall: i. treat confidentially and protect against disclosure all Confidential Information belonging to [the Plaintiff]; and ii. shall not use or disclose the Confidential Information to any third party, except for the purpose of carrying out the work as an IC under the [Contract] or as may be required to be disclosed by law. b. The IC [ie, the Defendant] further agrees and undertakes that he shall not, either individually or in partnership or jointly or in conjunction with any person or persons, firm ... company, corporation, as principal, agent, shareholder, employee, consultant … : i. During the term of the [Contract] and for a period of one (1) year from the date of termination of the [Contract] for any reason compete with [the Plaintiff] in respect of similar business anywhere in Asia; … 100 The Plaintiff argued that the clauses were valid and should be upheld as they were not unreasonable and protected legitimate proprietary interests.91Foot Note 91×PCS at paras 60–83. 101 A restraint of trade clause will be upheld only where (a) legitimate proprietary interests are protected from upholding the clause; and (b) it satisfies the twin test of reasonableness,ie, the clause must be reasonable between the parties concerned and reasonable in the interests of the public (seeMan Financial (S) Pte Ltd (formerly known as E D & F Man International (S) Pte Ltd) v Wong Bark Chuan David[2008] 1 SLR(R) 663 (“Man Financial”) at [69]–[79]) The assessment of whether a restraint of trade clause is to be upheld involves a balancing between the freedom to contract and the freedom to trade (seeNational Aerated Water Co Pte Ltd v Monarch Co,Inc[2000] 1 SLR(R) 74 at [31]). 102 The present consideration of the enforceability of the restraint of trade clauses is confined to the restraints as operative during the currency of the Contract rather than post-termination of the Contract. This is since the Plaintiff sought to enforce cll 10 and 11 of the Contract in respect of breaches committed by the Defendant during the operation of and not post-termination of the Contract.92Foot Note 92×Reply to defence and counterclaim (amendment no. 1) dated 10 April 2017 at para 6.2.In addition, as I accepted the Plaintiff’s interpretation of the Contract and did not find that the Contract had been terminated or otherwise discharged, no issue arose as to the validity or enforceability of cll 10 and 11 insofar as the clauses sought to curtail the Defendant’s activities post-termination of the Contract. 103 The doctrine of restraint of trade applies not just to contractual clauses that seek to restrict liberty in trading post-termination of the agreement but also to those that restrict trading during the currency of the agreement (National Aerated Water Co Pte Ltd v Monarch Co,Inc[2000] 1 SLR(R) 74 at [30]). I agreed however with the Plaintiff’s suggestion93Foot Note 93×PCS at para 66.that while the doctrine of restraint of trade is equally applicable to a clause that restricts trading during the currency of the agreement, an approach leaning more towards freedom to contract as opposed to freedom to trade should be taken in relation to such clauses (as opposed to those that restrict trade post-termination of the relationship or agreement). In other words, primacy should be given to the contractual bargain struck between the parties in relation to a restraint of trade clause that operates during the continued existence of a relationship of employment, work or service between the parties. 104 I found that the non-compete clauses in the Contract were enforceable as they protected legitimate proprietary interests of the Plaintiff and fulfilled the twin test of reasonableness. Legitimate proprietary interest 105 On the facts, I found that the Plaintiff had a legitimate interest in ensuring that an independent contractor and Vice President it had hired to market products sold by the Plaintiff did not market those same products on behalf of other companies while the contract was still in operation between the parties. Cll 10 and 11 also protected the Plaintiff’s legitimate interest in safeguarding and maintaining its trade connections with its product suppliers and in preventing the use of its confidential information including price lists, marketing, sales information and business plans from being used by its own representative on behalf of other companies. These factors fell within the interests in protecting trade secrets and trade connections which the courts have recognised as legitimate proprietary interests justifying protection (seeMan Financialat [81]) Reasonableness 106 The test for reasonableness in relation to a restraint of trade clause is two-pronged. First, the court considers whether the clause is reasonable as between the parties themselves. Second, the court considers whether the clause is reasonable in the interests of the public (Man Financialat [75]–[76]). 107 According to the Defendant, in terms of the scope of the products covered under cll 10 and 11, the clauses were too wide to be reasonable as they prevented him from trading with third parties even where such trade did not involve any product in competition with the Villages Product.94Foot Note 94×Defence and counterclaim (amendment no. 1) dated 30 March 2017 at para 44(1)(c).In addition, according to the Defendant, under the clause, he was prevented from engaging in any business relating to property, insurance, stocks, bonds, private placement, unit trusts and/or any other forms of securities products and the clause was therefore too wide.95Foot Note 95×Defence and counterclaim (amendment no. 1) dated 30 March 2017 at para 44(1)(e). 108 However, the Plaintiff’s case was not that the Defendant breached cll 10 and 11 of the Contract by selling property which had no relation to the Plaintiff. Instead, the Plaintiff’s case was that the Defendant breached the terms of the Contract in relation to his conduct in marketing the Dolphin Product and/or any other product promoted, marketed or sold by the Plaintiff.96Foot Note 96×Statement of claim (amendment no. 1) at para 15.3.Indeed, the wording of cll 10 and 11 limited the Defendant’s activities to those in competition with the Plaintiff. The clauses were thus reasonable as between the parties since the product coverage was not excessively wide. It was also reasonable in the interests of the public given that the Plaintiff did not have a monopoly in the industry or over the sale of the products, and companies selling the same products could engage persons other than the Defendant to sell the products on their behalf. 109 In terms of the geographical scope, the Defendant argued that the scope of cl 11(b)(i) which extended to Asia, was too wide to be reasonable since he was Singaporean and had only worked in Singapore.97Foot Note 97×DCS at paras 63–64; DRS at paras 89–91.However, the Plaintiff’s case was confined to the Defendant’s sale of products in Singapore on behalf of other entities. That cl 11 prohibited the Defendant from engaging in competing business in Asia, and not just Singapore was of little relevance in the present case given that the relevant events which the Plaintiff alleged as constituting breach were events that occurred in Singapore. 110 The question of the reasonableness of the clauses in terms of temporal scope did not arise since as explained above at [102], the breach claimed by the Plaintiff occurred during the currency of the Contract. 111 Therefore, I found that cll 10 and 11 of the Contract were enforceable as the clauses protected a legitimate proprietary interest and were reasonable.",
        "Conclusion": "139 In conclusion, I found that the Contract was breached by the Defendant. The extent and consequence of such breach will be examined at a quantification hearing. I also dismissed the Defendant’s counterclaim for defamation as the letter dated 6 March 2015 were not defamatory in nature. 140 For completeness, I note that in the Defendant’s closing submissions, claims were also made that the Plaintiff had defamed the Defendant not just to the 107 recipients of the letter dated 6 March 2015 but that Desmond Chong and/or the Plaintiff had also defamed the Defendant to the Plaintiff’s staff in an announcement made to the staff of the Plaintiff at a meeting.120Foot Note 120×DCS at paras 257–258.In addition, in the closing submissions, the Defendant prayed for its counterclaim for wrongful suspension to be allowed with damages to be assessed.121Foot Note 121×DCS at para 306(5); DRS at paras 193, 194(5).As both of these claims had not been pleaded by the Defendant in his counterclaim,122Foot Note 122×Defence and Counterclaim (Amendment No. 1) dated 31 March 2017.I made no findings on these two claims. Aedit AbdullahJudge Josephine Chong Siew Nyuk & Esther Yeo Fang Ying (Josephine Chong LLC) (instructed counsel), Lee Ming Hui Kelvin & Ong Xin Ying Samantha (WNLEX LLC) for the plaintiff in main action and defendants in counterclaim;Andrew Ohara (Eden Law Corporation) for the defendant in main action and plaintiff in counterclaim."
    }
}