{
    "case_title": "Sunray Woodcraft Construction Pte LtdvLike Building Materials (S) Pte Ltd",
    "ncitation": "[2018] SGHC 200",
    "coram": "Ang Cheng Hock JC",
    "sections": {
        "Introduction": "1 This was an application to set aside an adjudication determination that was made under the Building and Construction Industry Security of Payment Act (Chapter 30B, 2006 Rev Ed) (the “Act”).  The ground for the application was that the adjudicator acted without jurisdiction because a mandatory condition under the Act for the adjudication application had not been satisfied.  After hearing the parties, I set aside the determination and provided the parties with brief oral grounds for my decision.  I now set out the detailed grounds of my decision.",
        "Background to the dispute": "2 Sunray Woodcraft Construction Pte Ltd (“the Applicant”) and Like Building Materials (S) Private Ltd (“the Respondent”) are both construction companies incorporated in Singapore. 3 The Applicant was a sub-contractor for a project named “Proposed Marina South Mixed Development – Residential & Commercial Tower for Marina One – Hyundai-GS Joint Ventures” (the “Project”).  By a Letter of Award dated 22 June 2015 (the “LOA”), but which was only executed and issued on 14 August 2015 for the reasons I will explain later, the Applicant awarded the Respondent the sub-contract works for the design, supply and installation of metal ceiling and secondary supports for the Project (the “Sub-Contract”).  The Project has since been completed and the temporary occupation permit issued. 4 On 22 March 2018, the Respondent served its Payment Claim No. 27 (“PC 27”) for the sum of S$680,441.12 (inclusive of 7% GST) on the Applicant by way of email. 5 On 11 April 2018, the Respondent served on the Applicant its intention to apply for adjudication.  The Respondent filed an adjudication application with the Singapore Mediation Centre on the same day.  This was Adjudication Application No. 143 of 2018.  The adjudication application was served on the Applicant on 12 April 2018 and the SMC appointed the adjudicator for the application that same day. 6 On 13 April 2018, the Applicant served its Payment Response No. 17 (“PR 17”) on the Respondent. 7 On 18 April 2018, the Applicant lodged its adjudication response with the SMC. 8 The adjudication conference took place on 25 April 2018. 9 On 4 May 2018, the adjudication determination was issued.  The adjudicator allowed the amount claimed in full.  She found as follows: (a) The Sub-Contract did not provide for when a payment response ought to be served by the Applicant on the Respondent in respect of a payment claim. (b) This meant that, under s 11(1)(b) of the Act, the Applicant’s payment response was due within seven days after being served with the Respondent’s payment claim, that is, by 29 March 2018.  No payment response was served in accordance within this timeline. (c) The Applicant also failed to serve its payment response within the dispute settlement period, which was the period of seven days after 29 March 2018, that is, from 30 March to 5 April 2018. (d) While PR 17 “clearly had the attributes of a payment response with the meaning of” the Act1Foot Note 1×See Wu Siew Koon’s 1st affidavit, p285, para 25 of Adjudication Determination., it was served on the Respondent only on 13 April 2018, after the time permitted under the Act. (e) The contents of PR 17 should thus be disregarded as required under s 15(3) of the Act because it was not a valid payment response. 10 In short, the adjudicator was of the view that she was prohibited by the provisions of the Act from considering the reasons set out in PR 17 because it was served out of time.  Implicit in her determination was that the Respondent’s entitlement to make the adjudication application had arisen by 6 April 2018, and the application lodged on 11 April 2008 was not premature.  This, in turn, was because she had found that there was no provision in the Sub-Contract setting out when the Applicant ought to have served its payment response.",
        "The parties’ cases": "11 The Applicant’s case was that the parties had contractually agreed to a timeline for a payment response.  While a draft of the LOA was ready on 22 June 2015, what in fact happened was that parties continued to negotiate until 14 August 2015 when the LOA was finally signed and issued by the Applicant and acknowledged by the Respondent.  During the course of these negotiations, the parties had agreed to certain additional terms and variations to the unit rates for the materials used in the Project.  Agreement on these changes were recorded in two documents called the Base Tender Offer (“BTO”) and the Technical Bid Evaluation (“TBE”). 12 In the TBE, item A.12 provided: 1) Payment Claim: the 25th day of each month 2) Payment Certification: within 21 days of receipt of payment claim 3) Payment: within 35 days from the date of receipt of the Sub-Contractor’s tax invoice. The Applicant argued that the reference to “payment certification” was intended by the parties to refer to the payment response to be issued by the Applicant in the context of the circumstances of the case and the terms of the Sub-Contract. 13 Based on this, the Applicant argued that the deadline for the service of its payment response to PC 27 was on 12 April 2018, which was 21 days from the date of service of PC 27.  Thus, the Respondent’s entitlement to apply for an adjudication determination had not yet arisen as at the date it filed the application, which was on 11 April 2018.  It followed that the adjudicator had acted without jurisdiction given that the Respondent did not have the right to seek an adjudication determination on the date that it did so.  I should add that no issue was taken by the Applicant at the adjudication proceedings or before me that PC 27 was served on 22 March 2018, rather than on 25 March 2018 as per item A.12(1) of the TBE.  The Applicant also proceeded on the basis that it had 21 days from 22 March to serve its payment response, and not from 25 March. 14  The Respondent’s case was that the TBE was not a contractual document.  The LOA specifically set out, at clause 2.1, the documents which together represented the entire agreement between the parties and the TBE was not listed as one of the documents.  Alternatively, even if the TBE was part of the Sub-Contract, the parties never intended for “payment certification” to mean “payment response”.  Thus, according to the Respondent, there was in fact no agreement between the parties as to when the Applicant must serve its payment response to a payment claim.  Under the Act, therefore, such payment response should have been served by 29 March 2018, or at the latest, within the seven-day dispute settlement period that followed. 15 The Respondent’s entitlement to apply for adjudication had thus arisen since 6 April 2018, the day after the seven-day dispute settlement period.  It follows that the Respondent was entitled to apply for an adjudication application on 11 April 2018, which was within seven days of when the entitlement to make the application first arose.  Since the Applicant only served its payment response on 13 April 2018, this was rightly disregarded by the adjudicator when she made her determination.",
        "Issues to be determined": "16 The overarching issue before me was whether the adjudicator had jurisdiction to make the adjudication determination pursuant to the Respondent’s application made on 11 April 2018.  This depended on whether the parties had contractually agreed to when the Applicant had to serve a payment response to a payment claim from the Respondent. 17 To answer this question, I had to decide the following sub-issues: (a) Was the TBE part of the agreement between the Applicant and the Respondent? (b) If the answer to (i) was affirmative, was the phrase “payment certificate” at A.12 of the TBE a reference to the “payment response” to be served by the Applicant, as stipulated by the Act, in reply to a payment claim from the Respondent?",
        "The relevant provisions of the Act": "18 Given that much of this case turns on the provisions of the Act as to when a claimant becomes entitled to apply for an adjudication application, it would be apposite to carefully examine the relevant statutory provisions in question. 19 Section 10(2) sets out when a payment claim can be served.  It provides: (2) A payment claim shall be served – (a) at such time as specified in or determined in accordance with the terms of the contract; or (b) where the contract does not contain such provision, at such time as may be prescribed. 20 Section 11(1) sets out when the respondent who has been served with a payment claim must respond.  It provides: (1) A respondent named in a payment claim served in relation to a construction contract shall respond to the payment claim by providing, or causing to be provided, a payment response to the claimant – (a)by the date as specified in or determined inaccordance with the terms of the construction contract, or within 21 days after the payment claim is served under section 10, whichever is the earlier; or (b) where the construction contract does not contain such provision, within 7 days after the payment claim is served under section 10. [emphasis added] 21 Section 12 then provides when the claimant’s right to apply for an adjudication determination arises.  The relevant portions state: (1) Subject to subsection (2), a claimant who, in relation to a construction contract, fails to receive payment by the due date of the response amount which he has accepted is entitled to make an adjudication application under section 13 in relation to the relevant payment claim. (2) Where, in relation to a construction contract – (a) the claimant disputes a payment response provided by the respondent; or (b)the respondent fails to provide a payment response to the claimant by the date or within the period referred to in section 11(1), the claimant is entitled to make an adjudication application under section 13 in relation to the relevant payment claim if, by the end of the dispute settlement period, the dispute is not settled or the respondent does not provide the payment response, as the case may be. … (4) During thedispute settlement period, in addition to any other action that the claimant or the respondent may take to settle the dispute – … (b) the respondent may provide the claimant with a payment response where he has failed to do so under section 11(1), or vary the payment response provided under that section. (5)In this section, “dispute settlement period”, in relation to a payment claim dispute, means the period of 7 days after the date on which or the period within which the payment response is required to be provided under section 11(1). [emphasis added] 22 As to the time within which a claimant may make an adjudication application, s 13(3) of the Act provides that: (3) An adjudication application – (a) shall be made within 7 days after the entitlement of the claimant to make an adjudication application first arises under section 12; ... 23 The importance of the contents of the payment response is made clear by s 15(3) of the Act, which provides that the adjudicator shall not consider any reasons in the adjudication response that is not also found in the payment response.  The relevant portion states: (3) The respondent shall not include in the adjudication response, andthe adjudicator shall not consider, any reason for withholding any amount, including but not limited to any cross-claim, counterclaim and set-off, unless– (a)Where the adjudication relates to a construction contract,the reason was included in the relevant payment response provided by the respondent to the claimant; or … [emphasis added] 24 From a review of these statutory provisions, it was clear that, if it had indeed been the case that there was no agreed term as to when the Applicant had to serve its payment response to a payment claim, then the Applicant would have had to serve its payment response within seven days as stipulated by s 11(1)(b) of the Act.  Then, the Respondent’s entitlement to apply for an adjudication determination would have arisen after the further seven-day dispute settlement period: see s 12(2) of the Act.  The window for the Respondent to make its application was thus 6 to 12 April 2018: see s 13(3)(a) of the Act.  As the Respondent made its application on 11 April 2018, it was in compliance with the timing requirements.  According to the Respondent, therefore, the adjudicator had jurisdiction to make her determination. 25 However, if the parties had agreed to a contractual term that allowed the Applicant 21 days to respond to PC 27, that is, by 12 April 2018, then the Respondent’s entitlement to apply for adjudication would only have arisen on 20 April 2018, which is the day after the seven-day dispute settlement period.  In such circumstances, the application would have been premature. 26 I should add that it was common ground between the parties that an adjudication application that was made before the entitlement of the Respondent arose would be a breach of s 13(3)(a) read with s 12(2) of the Act, and that this was a mandatory condition under the Act.  Parties were also in agreement that such a breach would result in the adjudicator being deprived of jurisdiction and her adjudication determination being null and void. 27 This position taken by the parties is in fact supported by the jurisprudence on the Act. 28 Where there was no purported payment claim or no service of a purported claim, any appointment of an adjudicator would be invalid, and any adjudication determination made pursuant to such an appointment would be null and void:GrouteamPte Ltd v UES Holdings Pte Ltd[2016] 5 SLR 1011 (“Grouteam”).  In that case, the Court of Appeal held that s 10(2) of the Act was a mandatory provision, breach of which would render an adjudication determination invalid (at [53]).  Further, an adjudicator under the Act had the power to decide matters which went towards his substantive jurisdiction, including whether mandatory provisions had been complied with:Audi Construction Pte Ltd v KianHiap Construction Pte Ltd[2018] 1 SLR 317 at [45]. 29 InNewconBuilders Pte Ltd v Sino New Steel Pte Ltd[2015] SGHC 226 (“NewconBuilders”), the issue before Quentin Loh J was whether an adjudication application which had been filed before the entitlement of the applicant to do so had arisen was a breach of a mandatory condition of the Act.  An Assistant Registrar had declined to set aside the adjudication determination on the grounds that the lodging of such a premature application did not result in a breach of a mandatory condition under the Act.  On appeal, Loh J stated (at [30]): Section 13(3)(a)of the Act makes clear that an adjudication application: shall be made within 7 daysafter the entitlementof the claimantto make an adjudication applicationfirst arises under section 12 [emphasis added]. Although s 13(3)(a) prescribes, in mandatory terms, a time limit beyond which the right to make an adjudication application is lost, when the time starts to run is an equally important milestone; that is governed by the phrase “after the entitlement… first arises” [emphasis added].  The “entitlement” must first have arisen.  One must then turn to s 12, which prescribes when there is an “entitlement” to make an adjudication application. Section 12(1) unambiguously provides that,subject tos 12(2), a claimant who has made a payment claim under s 10 is entitled to make an adjudication application under s 13 if he fails to receive payment by the due date.  Section 12(2), the important and relevant provision here, governs when a party is entitled to make an adjudication application.  It provides that where (a) the claimant disputes a payment response by the respondent, or (b) the respondent fails to provide a payment response by the date or within the period referred to in s 11(1), then the claimant “… isentitledto make an adjudication application under s 13 … if, by the end of the dispute settlement period, the dispute is not settled or the respondent does not provide the payment response …” [emphasis added].Just as an adjudication application which has not been made within the seven days after the entitlement of the claimant to make an adjudication application first arises is not a valid adjudication application, an adjudication application made before the entitlement to do so arises is similarly not a valid adjudication application.  Section 12 governs when the entitlement first arises.  Inmy judgment, both premature and late adjudication applications are not valid as they do not comply with both ss 12 and 13. [emphasis added in bold italics] 30 Loh J went on to hold that s 13(3)(a) read with s 12(2) created a mandatory condition that had to be complied with for an adjudication application to be valid.  At [45], Loh J stated: I therefore find and hold first, that there is no entitlement to make an adjudication application during the dispute settlement period and any such application is an invalid adjudication application.  Secondly, I find that in such an event, the court is entitled, as part of its supervisory jurisdiction, to set aside an adjudication determination which has been rendered pursuant to a premature adjudication application in breach of ss 12(2) and 13(3)(a) of the Act. The same approach was taken by the High Court inLinkforcePte Ltd v Kajima Overseas Asia Pte Ltd[2017] SGHC 46. 31 Before I turn to address the issues identified, there are two other points that I should mention.  The first relates to the question of waiver.  InGrouteam, the Court of Appeal observed that it was in line with the legislative purpose of the Act that a party who was not in breach could waive the other party’s breach of a mandatory provision of the Act, and that parties could also waive the right to object to an adjudicator’s lack of jurisdiction (at [63]).  Parties should not be permitted to argue that an adjudicator lacked jurisdiction or that a breach of a mandatory provision of the Act had occurred if such objections were not raised at the earliest possible opportunity (at [64]). 32 In the application before me, the Respondent did not take the point that, if it were to be found that s 13(3)(a) and s 12(2) of the Act had been breached, the Applicant had waived the breach and had also waived its right to object to the adjudicator’s lack of jurisdiction.  In fact, the Respondent did not even put a copy of the Applicant’s adjudication response before me, nor a full set of the parties’ submissions before the adjudicator.  I was therefore not in a position to determine any possible question of waiver even if it had been raised. 33 Having said that, I noted that the adjudication determination itself had recorded that the Applicant unsuccessfully argued that the provision in the TBE permitted it to serve its payment response to PC 27 within 21 days, that is, by 12 April 2018.  This was an argument that was predicated on the fact that the parties had agreed to a 21-day timeline for the Applicant to serve its payment response, and must consequentially mean that the adjudication application lodged on 11 April 2018 was premature as it was lodged before the entitlement to make such an application arose.  Thus, there would have been no basis to argue any waiver by the Applicant of its right to object to the jurisdiction of the arbitrator in any event. 34 The other point related to s 15(3)(a) of the Act.  Both parties appeared content to proceed on the basis that s 15(3)(a) prohibited the adjudicator from having regard to the contents of PR 17 that was served by the Applicant on 13 April 2018.  That meant that parties regarded the phrase “relevant payment response” in s 15(3)(a) to mean a payment response that was served within the time permitted by the Act.  Given that no arguments were made by parties as to whether, if the adjudication application was not premature and the adjudicator had jurisdiction to deal with the adjudication application, she should have had regard to the contents of PR 17 even if it had been served out of time, I express no views about this, save that it appeared from the case ofNewconBuildersthat Loh J had also proceeded on the basis that the contents of a payment response served out of time should properly be disregarded by an adjudicator (at [36]).",
        "Is the TBE a contractual document?": "35 The evidence before me in relation to the BTO and TBE was as follows. 36 On 22 June 2015, the representatives of the Applicant and Respondent met to discuss the terms of the LOA to be issued by the Respondent.  By then, a draft of the LOA had been prepared.  It was then orally agreed that additional terms were to be added to the Sub-Contract and certain variations made to the unit rates for the materials to be used in the Project.  The evidence suggested that the parties had intended to record these additional terms and changes in the BTO and the TBE. 37 The document described as the “BTO” was prepared by the Respondent and discussed at the 22 June 2015 meeting.  It bore the Respondent’s letterhead and set out a table which appeared to record the parties’ agreement on the materials to be used for the metal ceiling and secondary structure, as well as the required quantity and unit costs of these materials.2Foot Note 2×See Wu Siew Koon’s 1st affidavit of 17 May 2018 at p 290-291.Under the heading “Notes” below the table, it was stated, amongst other things, that “[i]tems not stated / mentioned in the above breakdown deemed to be excluded and subject to VO”.  There were numerous handwritten notations on this version of the BTO.  It was subsequently amended as explained below (at [39]). 38 The document described as “TBE” was of a different nature.  It was also discussed by the parties at that meeting on 22 June 2015 but appeared to have been prepared by the Applicant.  It set out, in table format, a long list of items for which the Respondent’s answers were sought.3Foot Note 3×See Wu’s 1st affidavit at p 292.For example, item A.06 “Retention” under the heading “Conditions of Contract” asked the bidder, that is, the Respondent, to confirm that 10% of each interim payment would be subject to retention.  The TBE provided an empty column for the bidder to set out its answer.  It was clear from a draft version of the TBE that there had been a discussion between the parties on each of the items on the list because there were either handwritten ticks against the items or some other written comments.  At the bottom of the page, there was a handwritten notation that stated “Discussed and agreed by ChuiMeng 22/06/2015” followed by an initial.  According to the Respondent, it did not put its company stamp on this version of the TBE on 22 June 2015 because it needed more time to consider its terms.4Foot Note 4×Wu’s 1st affidavit, para 19. 39 On 23 June 2015, the Respondent sent to the Applicant an amended BTO incorporating the changes that had been discussed and agreed at the meeting the day before.  In its covering email, the Respondent described the BTO as “our finalrevived [sic] quotation” and the attached document bore the Respondent’s letterhead.5Foot Note 5×Wu’s 1st affidavit, p 294 – 299.Stamped on both pages of the BTO was the Respondent’s company stamp and a signature of one of the Respondent’s representatives. 40 What happened next in relation to the finalisation of the TBE was, in my view, important.  On 6 July 2015, the Applicant sent an email to the Respondent attaching the TBE and asked for the Respondent’s reply.  The Applicant’s Maria Sevilla Interino’s email stated: “Please see attached and kindly reply soonest.  I’m preparing the LOA and will issue to you ASAP”.  Quite clearly, the Applicant was chasing the Respondent for its response to the list of items set out in the TBE.6Foot Note 6×Wu’s 1st affidavit, p 302. 41 There was another chaser by the Applicant on the next day, 7 July 2015, asking for the Respondent’s reply on the TBE itemsby that day.  That evening, the Respondent replied with the completed TBE.7Foot Note 7×Wu’s 1st affidavit, p 301 – 303.That document set out the Respondent’s response to each of the items in print.  The respondent answered “ok” to many of the items.  This included item A.12 “interim payment” under the heading “Conditions of Contract”, the full details of which has been set out above at [12].  For some other items, the Respondent answered by, for example, stating that certain works were excluded.  Significantly, the completed TBE sent over on 7 July 2015 bore the Respondent’s company stamp, its representative’s signature, and below both, a handwritten notation “07/07/2015”. 42 It was only after this had happened that the LOA was issued to the Respondent on 14 August 2015, with the Respondent acknowledging acceptance of the LOA’s terms that same day.8Foot Note 8×Wu’s 1st affidavit, p 20.The Respondent also affixed the company’s stamp with an initial on every page of the LOA on the same day.  However, the LOA continued to be dated 22 June 2015.9Foot Note 9×Wu’s 1st affidavit, p 14. 43 The Respondent’s argument was a straightforward one.  It simply referred to clause 2 of the LOA which, in its material parts, stated: (2) DOCUMENTS TO BE READ WITH LETTER OF AWARD AND FORMING PART OF SUB-CONTRACT The following documents shall be read with the Letter of Award and the Appendices hereto, which together represent the entire agreement between us and shall be regarded as part of the Sub-Contract Documents; 2.1 Correspondence and Documents a) Quotation submitted to Sunray dated 27th April 2015. b) SWC email correspondence with regards to mock-up  submission dated 11 May 2015 c) Like Building Materials (S) Pte Ltd’s reply dated 11  May 2015. d) Like Building Materials (S) Pte Ltd’s Final revise quote  submission dated 23rd June 2015 … 2.4 Except as provided above in the list of correspondences and documents forming the Sub-Contract,all other correspondences with the Employer and/or Consultants and/or us shall be excluded from this Sub-Contract.  Similarly, all representations, statements and/or prior negotiations are specifically excluded. 2.5 In addition, where your responses to the various questionnaires, clarifications and addenda include the phrases “We Confirm” or “We noted” or “Yes” or “We agree” or “We Comply” or any other phrases construed to have the same meaning and/or intention; it shall be deemed to mean your unconditional confirmation at no extra costs or time to the Sub-Contract. [emphasis added] 44 The Respondent argued that clause 2.4 made clear that all other correspondence which formed part of the “prior negotiations”, meaning prior to 14 August 2015, which was the date on which the LOA was issued and signed, were to be specifically excluded from the Sub-Contract.  The dateonthe LOA, namely 22 June 2015, was to be ignored.  According to the Respondent, since the TBE was not specifically mentioned at clause 2.1 of the LOA, and the completed TBE was sent over by the Respondent on 7 July 2015, it was rightly found by the adjudicator to be a document that did not have any contractual effect. 45 The effect of an entire agreement clause is a matter of contractual interpretation.  The relevant principles to be applied in the construction of contracts are well established in Singapore.  The starting point is that the court looks to the text that the parties have used (seeLucky Realty Co Pte Ltd v HSBC Trustee (Singapore)Ltd[2016] 1 SLR 1069 at [2]).  In relation to entire agreement clauses specifically, the court would, in the interests of certainty, strive to give effect to the parties’ expressed intent and legitimate expectations if they are found in a clearly worded entire agreement clause that “clearly purports to deprive any pre-contractual agreement of legal effect” (Lee Chee Wei v TanHor Peow Victor and others and another appeal[2007] 3 SLR(R) 537 (“Lee Chee Wei”)at [25] and [35]).  At the same time, it is permissible to have regard to the relevant context as long as the relevant contextual points are clear, obvious and known to both parties (seeZurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 at [125], [128] and [129]).  This is because doing so would place the court in “the best possible position to ascertain the parties’ objective intentions by interpreting the expressions used by [them] in their proper context” (seeSembcorp Marine Ltd v PPL Holdings Pte Ltd[2013] 4 SLR 193 at [72]).  An entire agreement clause would not prevent a court from adopting a contextual approach in contract interpretation (Lee Chee Weiat [41]).  Ultimately, the question to be determined is whether the agreement in its final form isintendedto constitute the entire agreement, thereby superseding and replacing all representations that might have inspired and culminated in such an agreement in the first place, but which were never actually incorporated in the written agreement (Lee Chee Weiat [35]). 46 Clause 2.4 of the TBE specifically excluded “representations, statements and/or prior negotiations” between the parties.  In my judgment, the TBE could not be described as part of the “representation, statements and/or prior negotiations”.  Instead, it was a document that recorded an agreement that had been reached by the parties on certain terms after negotiations between them. The TBE would thus not be excluded based on the text of clause 2.4. 47 In any case, the timeline of events was key and formed part of the context which would aid the interpretation of clause 2.4, should there be any ambiguity.  It was clear from the evidence that, although the LOA was first discussed on 22 June 2015, the parties only executed the LOA on 14 August 2015.  Between 22 June 2015 and 14 August 2015, the parties continued to negotiate the terms in the BTO and the TBE.  First, the terms in the BTO were only finalised on 23 June 2015 and sent over by the Respondent to the Applicant that day.  Second, the Applicant chased the Respondent by email for the completed TBE after that.  This was evidenced by the two emails sent by the Applicant to the Respondent dated 6 July 2015 and 7 July 2015 with the latter email requesting that the Respondent complete and return the TBE on the same day.  It was so returned, stamped and signed by the Respondent.  In my judgment, there would have been no reason for all this to have happened if the parties had intended for the TBE to have no contractual effect whatsoever. 48 The Respondent’s Tonny Neo’s affidavit glaringly did not offer any other explanation as to why the TBE would need to be completed, stamped, signed and sent back to the Applicant on 7 July 2015, and why the Applicant would be chasing for this to be done if parties did not intend for the TBE to form part of the contract between the parties.  When I asked counsel for the Respondent why the TBE had to be signed by the Respondent’s representative if it was not intended to have any legal effect, all she could muster in response was that the TBE was just a document which was being negotiated.  But this simply begged the question why the TBE had to be negotiated and finally agreed if the parties could simply disregard its terms.  Not only that, there was also no evidence that there were any further negotiations on the TBE after the completed document was sent back to the Applicant on 7 July 2015. 49 The entirety of the LOA also formed part of the relevant context in interpreting clause 2.4.  My view that the TBE formed part of the contract between the parties was fortified by clause 2.5 of the LOA which referred to the Respondent’s responses to “various questionnaires, clarifications and addenda”.  The TBE was precisely such a document, where the Applicant had set out a list of terms and the Respondent’s answer or confirmation was required for each of those listed terms.  The fact that clause 2.5 was necessary is a reflection of the commercial reality that, in domestic construction contracts, parties are often happy to proceed using a combination of schedules, programs, drawings and standard terms as forming the contact, and the requirement for these answers or confirmations by a sub-contractor is usually intended by parties to signify agreement to specific terms not found in the other documents.  For example, item A.15 provided that all costs incurred to rectify defects “shall be deemed to be included in the Sub-Contract prices” and item A.23 prohibited “[a]ny works which generate noise” beyond the normal working hours and on Sunday and Public Holiday, and that the “limitation of works to such hours shall not be a reason for any progress failure on the part of the Sub-Contractor”.  In my view, it was more likely than not that these are terms that the parties would have intended to be legally binding.  In short, the presence of clause 2.5, as well as the other items in the TBE, indicated to me that the clause 2.4 was not intended to exclude the TBE. 50 The Respondent relied on the decision ofEncusInternational Pte Ltd (in compulsory liquidation) v Tenacious Investment Pte Ltd and others[2016] 2 SLR 1178 (“Encus International”) and submitted that the existence of the entire agreement clause was inconsistent with an intention to keep any part of the TBE alive.  Thus, according to the Respondent, the TBE was superseded and should be deprived of all legal effect.  I disagreed.  The parties inEncusInternationalagreed to a term sheet some two weeks before entering into a convertible loan agreement with an entire agreement clause.  The question that arose inEncusInternationalwas whether the entire agreement clause had superseded the term sheet.  Judith Prakash J (as she then was) held that it did because the wording of the entire agreement clause clearly purported to deprive any previous agreement concerning the same subject matter of legal effect. Prakash J found that the term sheet related to the same subject matter as the convertible loan agreement.  It was held that the term sheet had therefore been superseded and deprived of all legal effect after the execution of the convertible loan agreement.  InEncusInternational, there did not seem to be a draft convertible loan agreement that was in discussion before the term sheet was agreed to.  Prakash J noted that, if the parties had truly intended to keep any part of the term sheet alive, there would be no reason why they would have included the entire agreement clause when drafting the convertible loan agreement.  I was unable to draw the same conclusion here from the presence of clause 2.4 given the facts of the present case.  Here, clause 2.4 had already been drafted into the LOA as at 22 June 2015, even before the TBE was discussed and agreed to by the parties.  In my view, the mere fact that the entire agreement clause was retained did not necessarily mean that the TBE, which was discussed and agreed after clause 2.4 was first drafted into the LOA, was intended to have no legal effect. The evidence before me showed that the Applicant was not prepared to proceed with the finalisation of the award of the sub-contract to the Respondent until all the contractual terms, which included the TBE, had been finalised and agreed by the Respondent in writing.  In my judgment, it was clear that the parties had intended for the TBE to form part of the Sub-Contract. 51 For all the reasons above, I found that the TBE formed part of the agreement between the Applicant and Respondent.",
        "Did item A.12 of the TBE apply to payment responses?": "52  Having found that the TBE formed part of the contract between the parties, the next issue was whether the “payment certificate” referred to in item A.12 of the TBE was a “payment response” for the purposes of adjudication claims under the Act. 53 Section 11 sets out the content of a payment response under the Act. Payment responses, etc. 11.— (1) A respondent named in a payment claim served in relation to a construction contract shall respond to the payment claim by providing, or causing to be provided, a payment response to the claimant – (a) by the date as specified in or determined in accordance with the terms of the construction contract, or within 21 days after the payment claim is served under section 10, whichever is the earlier; or (b) where the construction contract does not contain such provision, within 7 days after the payment claim is served under section 10. ... (3) A payment response provided in relation to a construction contract – (a) shall identify the payment claim to which it relates; (b) shall state the response amount (if any); (c) shall state, where the response amount is less than the claimed amount, the reason for the difference and the reason for any amount withheld; and (d) shall be made in such form and manner, and contain such other information or be accompanied by such documents, as may be prescribed. ... 54 Item A.12 of the TBE provided for a “payment certificate” to be issued within 21 days of the receipt of a payment claim.  The Respondent argued that “payment certificates” and “payment responses” were two separate types of documents in the construction industry.  Also, “payment response” had a specific meaning as agreed to by parties in the definitions section of the “General Conditions of Sub-Contract”, which was that it would have the same meaning and effect as the phrase “payment response” in the Act and its regulations.10Foot Note 10×Wu’s 1st affidavit, p 95.On the other hand, the Applicant submitted that parties must have intended “payment certificate” to mean “payment response” because there was no mechanism under the Sub-Contract for “payment certificates” to be issued. 55 I noted from the outset that there was no rule that a “payment certificate” cannot also be a “payment response” under the Act.  It was clear to me that parties could agree that the payment response under the Act shall take the form of a payment certificate (see Chow Kok Fong,Security of Payments and Construction Adjudication(LexisNexis, 2nd Ed, 2013) at para 6.32).  The Act allows for a dual track regime whereby a claimant can make separate claims under the contract between the parties and under the Act, or make a claim that has both contractual and statutory force.  In the same way, the respondent may provide separate responses pursuant to the contract and under the Act, or issue a response that has both contractual and statutory force (seeTienruiDesign & Construction Pte Ltd v G & Y Trading and Manufacturing Pte Ltd[2015] 5 SLR 852 (“Tienrui”) at [31]).  In certain cases, there may be a distinction between the requirements provided for by the contract and that under the Act whereby two different timelines and formats apply under the contract and under the Act.  In other cases, the parties may agree to contractually supplant the default timeline in the Act.  In the present case, the question is whether the timeline provided for in item A.12 of the TBE was intended tosupplantthe default timeline in the Act. 56 I found the most assistance fromNewconBuildersbecause of the similarities in the facts presented.  InNewconBuilders, the contract provided for an “interim certificate” to be submitted within a certain time period.  The question was whether the parties intended for the “interim certificate” to function as a “payment response” and consequently, whether the time period for the submission of the “interim certificate” could be construed as stipulating the time period for the submission of a “payment response”, thus supplanting that provided in the Act.  Quentin Loh J first observed (at [70] and [73]): 70 Interim certificates can and do function as payment responses in the building and construction industry. The common standard form contracts in use were amended to cater for the grafting of the adjudication regime under the Act onto their standard form conditions of contract. ... ... 73 In principle and in practice therefore, there can be no impediment or objection to an interim certificate functioning as a payment response... 57 Loh J then noted that the interim certificates inNewconBuilderswere not to be issued by a third party, such as an architect, but by the main contractor itself, and also made the observation that in domestic sub-contracts, “the documentation is often less formal” and there is typically “a paucity of correspondence and paperwork between the parties” (at [72]).  Loh J proceeded to examine the actual interim certificates that were issued and found that they provide “fairly detailed responses to the amounts claimed for under the various payment claims” (at [75]).  It was held that the interim certificates were payment responses for the purposes of the Act. 58 Similarly, I considered that the contract between the Applicant and Respondent was not one which provided for a process of certification of payment by an architect or an engineer.  Instead, the parties appeared to envisage that the “payment certificate” was to be issued by the Applicant, although there was no specific process by which it was to issue such a certificate.  There were also no terms of the Sub-Contract which explained the purpose of such a certificate or provided a definition of what such a certificate was to include.  In my judgment, the parties in this case could not have intended that the Applicant would have to issue two different documents to a payment claim – a payment response within seven days of being served with the payment claim and a “payment certificate” within 21 days of being served with that payment claim.  This was especially when counsel for the Respondent was not able to explain to me what the content of the “payment certificate” would be given that the Applicant would have, according to counsel’s argument, already set out its position on the payment claim in its payment response that was to be served earlier. 59  I then considered the parties’ conduct and, in particular, the “payment certificates” that had been issued under the contract. 60 InTienrui, Lee Seiu Kin J held that it was unlikely that the reference to “interim certificate” in the contract imported with it a reference to a statutory payment response under the Act.  In coming to his decision, Lee J considered the clear distinctions between the “interim certificate” under the contract and a “payment response” under the Act.  For example, s 11(3)(c) of the Act required the respondent to state its reason for withholding payment in its payment response but the “interim certificate” as defined under the contract between the parties did not require it.  Lee J held that this was “one of the most critical elements of the statutory payment response”.  It was also significant that theactualinterim certificates which had been issueddid notinclude reasons for withholding payment (at [47]). 61 The same was not true in the present case.  For all the previous payment claims before PC 27, the Applicant did not respond by issuing a payment response and then later a “payment certificate”.  Prior to this, there was never any suggestion by the Respondent that the Applicant should have done so.  The payment certificates (in cases where that was one) were all issued on an average of 24.5 days after receipt of the payment claim.11Foot Note 11×Tonny Neo’s affidavit of 30 May 2018, p 472-473, 578-579In my judgment, each of the “payment certificates” that was issued under the contract satisfied the statutory requirements of a “payment response” as set out in s 11(3) of the Act.  Each “payment certificate” clearly identified the payment claim to which it related and stated the response amount in a table form.  The format of the “payment certificate” also made clear, in my view, that the difference between the response amount and that claimed was due to a difference in valuation.  The Act and its regulations do not require any more than that.  I also noted that the “payment certificates” were almost always titled “payment response sheet”. 62 Having said this, I must emphasise that the phrase “payment certificate” in the TBE must be interpreted objectively in accordance with the context and circumstances at the time the Sub-Contract was concluded.  This included a consideration of the other terms of the Sub-Contract. 63 In our case, unlike inTienrui, there was no definition of “payment certificate” in the contract between the parties.  I derived little assistance from the definition of “payment response” at clause 1.1(j) of the “General Conditions of Sub-Contract” at Appendix D to the LOA because that simply described “payment response” as having the meaning as that stated in the Act12Foot Note 12×Wu’s 1st affidavit, p 95..  There was thus no inconsistency if the terms “payment certificate” and “payment response” in the context of the Sub-Contract was read as being synonymous.  Furthermore, having gone through the General Conditions of Sub-Contract, I was satisfied that there were no references to “payment response” or “payment certificate” which would make it incoherent or absurd to understand the two as meaning the same thing.  My view that the parties must have understood the two to mean the same was simply confirmed by (i) the Respondent’s inability to explain how the content of the payment certificate was intended to be different from that of a payment response and why the parties may have intended for there to be two different payment documents to be issued by the Applicant (see [58] above) and (ii) the conduct of the parties in seemingly treating the payment certificates as payment responses (see [61] above). 64 For the above reasons, I found that parties had agreed, pursuant to item A.12 of the TBE, that the Applicant had 21 days to serve its payment response to a payment claim served by the Respondent.",
        "Conclusion": "65 In the result, I found that the Applicant had 21 days from 22 March 2018 to serve its payment response, that is, by 12 April 2018, to PC 27.  The Respondent’s entitlement to make an adjudication application thus only arose after the dispute settlement period ended on 19 April 2018.  Thus, the adjudication application filed by the Respondent on 11 April 2018 was premature.  It was in breach of s 13(3)(a) read with s 12(2) of the Act.  As this was a mandatory condition that had been breached, I found that the adjudicator had no jurisdiction in respect of the adjudication application that the Respondent filed.  The adjudicator should have dismissed the application on that basis. 66 Accordingly, I allowed the Applicant’s application and set aside the adjudicator’s determination made on 4 May 2018. Ang Cheng HockJudicial Commissioner Valliappan Subramaniam (United Legal Alliance LLC) for the applicant;Lew Chen Chen (Chambers Law LLP) for the respondent."
    }
}