{
    "case_title": "Haw Wan Sin David and another vSim Tee Meng and another",
    "ncitation": "[2018] SGHC 272",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "IN THE HIGH COURT OF THE REPUBLIC OF SINGAPORE": "[2018] SGHC 272 District Court Appeal No 16 of 2018 Between  (1)Haw Wan Sin, David(2)Yee Ai Moi, Cindy …Appellants  And  (1)Sim Tee Meng(2)Seah Beng Hoon …Respondents Judgment [Tort] – [Misrepresentation] – [Negligent misrepresentation] [Tort] – [Negligence] – [Breach of duty]",
        "The facts": "",
        "The parties": "2 The appellants are Haw Wan Sin, David (“David Haw”) and Yee Ai Moi, Cindy (“Cindy Yee”). They are husband and wife, and are both registered property agents.1Foot Note 1×GD at [66].They claimed against three parties for damages resulting from misrepresentation: Sim Tee Meng (“Jimmy Sim”), Seah Beng Hoon (“Belle Seah”), and Faber Property Pte Ltd (“Faber”). The District Judge allowed the appellants’ claim against Faber, but dismissed the claims against Jimmy Sim and Belle Seah. The appellants appealed against the decision in respect of Jimmy Sim and Belle Seah, who are the respondents in this appeal. 3 Faber is a licensed estate agency. At all material times, Jimmy Sim was the Key Executive Officer (“KEO”), sole shareholder and director of Faber. Belle Seah was an Associate Director of Faber, and a licensed real estate salesperson. 4 The appellants were retail investors who entered into agreements with a New Zealand company called Albany Heights Villas Limited (“the Developer”) for the “First Right of Refusal” (“FRR”) to purchase units in a residential housing project in New Zealand (“the Project”). Faber was involved in the marketing activities in Singapore in respect of investment in the Project. Unfortunately, the Developer went into liquidation due to insolvency and it appears that the persons behind the various New Zealand companies that came up with the FRR scheme had siphoned off substantial sums paid by purchasers such as the appellants. In the Suit, the appellants sought to recover the sums of S$15,000 and US$142,656.76 which they had paid towards obtaining the FRR.2Foot Note 2×GD at [1]-[2].",
        "Background facts": "5 Much of the background facts are as set out in the GD and were not contested on appeal. The chronology of events leading up to the making of the alleged misrepresentations is as follows:3Foot Note 3×GD at [3]-[4]. (a) On 14 December 2011, Belle Seah met with a director of the Developer, Christoper Cook (“Cook”). Cook sent Belle Seah a proposal which was subsequently brought to Jimmy Sim’s attention. Faber then entered into an agreement with the Developer and Hunter Sterling & Company Pte Ltd (“Hunter Sterling”) on 7 January 2012 to market the Project.4Foot Note 4×GD at [13].Hunter Sterling was the Developer’s Singapore entity.(b) On or around 12 January 2012, advertisements were placed in local newspapers which led to the appellants attending a marketing event at The St Regis Hotel regarding the FRR investment in the Project. The details of these advertisements are set out in the GD at [16] and [17], but are not material for present purposes. The marketing event was later held on 14 January 2012.(c) Prior to the marketing event, the Developer engaged William Wai (“Wai”) to conduct a training session with Faber’s personnel in relation to selling the FRR investment in the Project. Wai was at the time a business development manager of a Hong Kong real estate agency that had previously marketed the Project in Hong Kong.5Foot Note 5×GD at [14].(d) On 16 January 2012, the appellants attended at the office of Faber, and entered into various agreements in relation to three units in the Project. The following documents were signed in respect of each unit (collectively, “the FRR Agreements”):(i) A Reservation Form on the letterhead of Faber as representative of the Developer, and signed by Belle Seah as a representative of Faber;(ii) An agreement between the Developer and the appellants titled “First Right of Refusal” on the letterhead of the Developer, dated 16 January 2012 (“the FRR Agreement”); and(iii) An agreement between the Developer and the appellants titled “On-Sale Agreement”, dated 16 January 2012.(e) The appellants later made the following payments:(i) S$15,000 by way of a cheque dated 18 January 2012 made out to “Hunter Sterling & Company Pte Ltd” ($5,000 being the reservation deposit for each of the three units); and(ii) US$142,656.76 by way of a cheque dated 31 January 2012 made out to “Hunter Sterling & Company Client Account (Albany Heights Villas Ltd)” as the balance of the FRR price for the three units. 6 It later turned out that the Developer had neither the title nor the resource consent to develop the relevant plot of land that the Project was supposed to be developed on. Neither Belle Seah nor Jimmy Sim knew that this was the case.6Foot Note 6×GD at [5].",
        "The alleged misrepresentations": "7 The appellants alleged that Belle Seah made the following three misrepresentations at the marketing event on 14 January 2012:7Foot Note 7×GD at [6]. (a) The owners of the Developers had a good track record of successful developments (“Representation 1”);(b) Phase 1 of the Project was fully sold and construction was already in progress, while Phase 2 was 60% sold (“Representation 2”); and(c) Investment moneys paid by any investor would be held in a trust account by a New Zealand firm of lawyers, which was as safe as a Singapore lawyer’s client account, and that the Developer would only have access to the moneys according to the progress of construction (“Representation 3”). 8 As against Jimmy Sim, the appellants alleged that the following misrepresentations were made when they attended at Faber’s office on 16 January 2012:8Foot Note 8×GD at [6]. (a) The representations made by Belle Seah at the marketing event were true and correct (“Representation 4”);(b) The respondents and Faber had performed checks on the ownership and legality of the Project in accordance with the strict requirements of the Council of Estate Agencies (“the CEA”) (“Representation 5”); and(c) The respondents and Faber had done all relevant and necessary due diligence checks on the Developer, and details such as title to the Project and the building approval for marketing, and that everything was in order (“Representation 6”).",
        "The District Judge’s findings and decision": "9 At the outset, the learned District Judge took the view that Representations 5 and 6 were effectively representations that due diligence checks had been done. She noted that the obligation to undertake due diligence checks is “implicit within the duty of care”. Thus, in her view, it was not necessary for her to make a specific finding as to whether each of the two representations were made to the appellants. Nevertheless, she stated that the undisputed evidence of Jimmy Sim was that he did make the representations to the appellants that due diligence checks had been conducted by Faber. However, he maintained that the details of the due diligence conducted were not included in the representation.9Foot Note 9×GD at [7]. 10 In respect of Faber, the learned District Judge held that Faber owed a duty of care to the appellants, which it breached: (a) The advertisements placed in the newspapers made it clear that Faber was involved in the Project, albeit with other entities such as Hunter Sterling and the Developer. It was therefore not open to Faber to deny liability simply on the basis that they were not the entity that placed the advertisements in the newspapers. Consequently, a comprehensive analysis of all relevant facts and circumstances had to be taken to determine whether a duty of care was owed by Faber.10Foot Note 10×GD at [18].(b) It was undisputed that Faber’s agents and salespersons were present at the marketing event.11Foot Note 11×GD at [21].There was a system whereby potential investors who turned up at the marketing event were approached by Faber’s representatives to market investment in the Project to them, such as by walking visitors through the information on exhibition boards that were put up.12Foot Note 12×GD at [22].(c) It was fair to infer that because there were representatives from various entities present at the marketing event, the different representatives would have worn name tags that would state which entity each person was representing. Consequently, representations made by Faber’s representatives would have been considered representations made on behalf of Faber.13Foot Note 13×GD at [23].(d) Faber ought to have known that the appellants would suffer damage from its carelessness.14Foot Note 14×GD at [27].This was because it was the instrument through which the masterminds behind the Project used to reach out to local investors in Singapore. It was Faber that brought the Project into Singapore to be marketed, and it was Faber’s salespersons who distributed the Project’s brochures at the exhibition.15Foot Note 15×GD at [26].(e) There was sufficient legal proximity between the appellants and Faber. It was clearly foreseeable that potential investors would rely on representations made by Faber. There was also an assumption of responsibility by Faber to exercise care to avoid loss or damage to investors, and there was reliance by such investors that Faber had exercised care in presenting information about the Project to them.16Foot Note 16×GD at [27]-[29].(f) There were no policy considerations that militated against the imposition of a duty of care on Faber.17Foot Note 17×GD at [29].(g) The evidence showed that Belle Seah had attended to the appellants during the marketing event. It was highly likely that Representations 1 and 2 were made as part of the “sales talk” between Belle Seah and the appellants. The training notes showed that Belle Seah, Jimmy Sim, and all of Faber’s agents were in fact specifically trained by Wai to make representations along the lines of Representations 1 to 3. It was also Wai’s evidence that many potential investors were asking about how the monies would be handled, and he expected that Faber’s agents would reply that the money was held in a trust account as this was what he had trained them to say.18Foot Note 18×GD at [33].Consequently, the learned District Judge found that Representations 1 to 3 were made on behalf of Faber.19Foot Note 19×GD at [35].(h) On the issue of whether Faber had breached its duty of care, it was necessary to examine the actions of the persons running Faber, namely Jimmy Sim as KEO. The learned District Judge thus adopted the standard of a “reasonably competent and prudent KEO”.20Foot Note 20×GD at [37].Faber, through Jimmy Sim, owed an obligation to investors to obtain relevant accurate facts about the Project before Faber embarked on selling the Project to the public. The scope of due diligence work that Faber was obliged to do would include taking reasonable steps to check that the underlying facts as stated in the representations regarding the Project were true.21Foot Note 21×GD at [38].(i) Faber had fallen short of the standard of care in the following respects:(i) Faber had failed to check that the Developer had title to the land on which the Project was to be developed. The land title document sent to Jimmy Sim was for another plot of land, for another venture owned by another company, and not the land the Project was purporting to develop.22Foot Note 22×GD at [44].Jimmy Sim had understood that he needed to verify the land title information, as indicated from the fact that he had expressly asked for the information, but he did not query further about the difference in the plot of land as reflected in the land title document.23Foot Note 23×GD at [46].(ii) Faber had failed to check that planning consent had been obtained for the Project land. In response to Jimmy Sim’s request for “Plan approval”, he was given the Planner’s Report and a Consent Order. However, both documents did not relate to the land on which the Project was to be developed. The Planner’s Report instead related to a separate plot of land, and was an application by an entity other than the Developer.24Foot Note 24×GD at [48].In fact, it expressly stated that while the Project wasinitiallyincluded in the application for resource consent, it had “dropped out” of the application. Jimmy Sim knew that this meant that no consent had been sought in relation to the site that Faber was supposed to market.25Foot Note 25×GD at [49].(iii) Faber had failed to check that investors’ monies paid into the trust account would be secure. Faber did not take any steps to verify the truth of what Cook had said about the trust account. In fact, the trust arrangement was nowhere to be found in any of the documents that Cook had sent to Jimmy Sim, and a “Sample S&P” that was sent in fact made clear that there wasnotrust arrangement.26Foot Note 26×GD at [52]-[53].(iv) Faber had failed to verify the track record of the Developer as represented. This representation was in reality completely untrue. There was however not a shred of evidence to show that Faber took any steps to verify this representation.27Foot Note 27×GD at [55].(v) On the basis of these failures, Faber had breached its duty of care owed to the appellants by making Representations 1-3, 5 and 6. It followed that Faber was liable for the loss that the appellants had suffered by relying on those representations.28Foot Note 28×GD at [58] and [61].(j) Faber’s defence that the appellants had not relied on the representations made but had been drawn to the FRR by virtue of the returns promised was rejected. It was the sum total of all the representations made that induced the appellants to enter into the FRR Agreements.29Foot Note 29×GD at [59]. 11 These findings are not disputed given that Faber is not a party to this appeal. I have set them out in some detail because, as will be seen, they are highly relevant to whether Jimmy Sim had breached any duty of care owed to the appellants. 12 In respect of Jimmy Sim, the learned District Judge held that Jimmy Sim was not liable for any loss suffered by the appellants in respect of the representations made to them. She reasoned as follows: (a) It was undisputed that the only time that Jimmy Sim met appellants was when they had visited Faber’s office to sign the FRR Agreements. The purpose behind the meeting was for Cindy Yee to speak to Jimmy Sim about the possibility of receiving a co-broking commission if she were to recommend investors to invest in the scheme (as noted above the appellants are both registered property agents).30Foot Note 30×GD at [66].(b) The appellants’ evidence on what transpired at that meeting was “rather inconsistent”, and their version of events was likely concocted as an afterthought so as to pin personal liability on Jimmy Sim.31Foot Note 31×GD at [70] and [74].Instead, it was more likely than not that the conversation between the appellants and Jimmy Sim had been a short one, the main purpose of which was for the appellants to find out about the possibility of co-broking. In this regard, the learned District Judge accepted Jimmy Sim’s evidence that, when asked whether due diligence checks had been performed, he responded that Faber had done due diligence checks and there was no particularisation of the extra checks conducted. It was unlikely that the appellants had asked Jimmy Sim to confirm that the representations made by Belle Seah were true.32Foot Note 32×GD at [75].The representation that due diligence had been conducted by Faber is different from the alleged representations (ie, Representations  to 6) on which the appellants had premised their case against Jimmy Sim.33Foot Note 33×GD at [76].(c) The learned District Judge therefore turned to consider whether there was a duty of care that arose in respect of the (singular) representation found to have been made by Jimmy Sim,ie, that due diligence had been done. This representation was made on behalf of Faber. It was obvious that the parties were not talking about due diligence by Jimmy Sim because there was no relationship between Jimmy Sim and the appellants. In making these representations, he was making them in his capacity as director of Faber, and not in his personal capacity. Similarly, the appellants had relied on these representations as coming from Faber, and not from Jimmy Sim as an individual.34Foot Note 34×GD at [77].Consequently, the nexus between Jimmy Sim and the appellants was “too tenuous” to impose a tortious duty of care on Jimmy Sim. In the view of the learned District Judge, if there were to be a tortious duty of care on the part of Jimmy Sim, that would result in the imposition of a similar duty of care on any director involved in any commercial transaction. This was untenable as a director of a company cannot be held personally liable for all the statements made on behalf of a company in the course of a company’s business. In any event, even if there were sufficient proximity between Jimmy Sim and the appellants, policy considerations would result in such a duty being negated. Liability for negligent misstatements made in the course of the company’s business attaches only to the company, and not to the director of the company.35Foot Note 35×GD at [80].(d) It followed that Jimmy Sim was not liable to the appellants in making the representation that Faber had conducted due diligence checks.36Foot Note 36×GD at [81]. 13 Finally, in respect of Belle Seah, the learned District Judge held that she was not liable to the appellants. Her reasons were as follows: (a) In all likelihood, the exhibition boards put up at the marketing event displayed information akin to Representations 1 to 3, and Belle Seah walked through the exhibition boards with the appellants.37Foot Note 37×GD at [89].She attended to the appellants, and made Representations 1 to 3.38Foot Note 38×GD at [90].(b) However, the representations were made at a marketing event organised by Faber and the Developer. It would be plain to the appellants and anyone that Belle Seah, as an individual, was not the organiser behind the marketing event. Thus, when Belle Seah repeated those representations, it would have been obvious that she was making those representations on behalf of the entities behind the marketing event. She was “merely a mouthpiece”, and her representations merely corroborated those made by the entities behind the marketing event.39Foot Note 39×GD at [90].(c) Belle Seah had not acted as an “independent contractor” vis-à-vis Faber. There was evidence that it is the norm for associates from real estate agencies to be involved in the marketing of property projects for developers. Associates would be expected to make representations regarding the project to the public, and those representations are those they would have been told to make either on behalf of the real estate agency, or on behalf of the developer. When it comes to representing that due diligence had been done, the property associates would generally trust that the company “had done it”. The learned District Judge therefore found that, in such scenarios, property associates do not assume personal responsibility for ensuring due diligence. Except where the property associate has gone outside the scope of instructions to make representations of his or her own accord, such a property associate does not owe a personal duty of care to potential buyers.40Foot Note 40×GD at [93].(d) Similarly, the appellants had not relied on Representations 1 to 3 as representations made by Belle Seah, but as representations made by Faber even though they were made through Belle Seah. The evidence showed that the representations made by Belle Seah were precisely those she was trained to make. Belle Seah thus did not voluntarily assume responsibility for the statements made.41Foot Note 41×GD at [94].In the circumstances, Belle Seah did not owe a personal duty of care to the appellants, and the claim against her was dismissed.42Foot Note 42×GD at [95]-[96].",
        "Parties’ cases": "",
        "The appellants’ case": "14 The appellants appealed against the dismissal of their claims against Jimmy Sim and Belle Seah. 15 In relation to Jimmy Sim, the appellants have two main submissions: (a) First, Jimmy Sim owed a personal duty of care to the appellants.43Foot Note 43×Appellants’ Case at para 2(a).In support of this submission, the appellants raise three points:(i) The applicable test was that inSpandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”), which the District Judge did not apply.44Foot Note 44×Appellants’ Case at para 21.Under theSpandeckanalysis, there was physical and circumstantial proximity between Jimmy Sim and the appellants,45Foot Note 45×Appellants’ Case at paras 54-55.Jimmy Sim had voluntarily assumed responsibility,46Foot Note 46×Appellants’ Case at paras 56-66.and the appellants had relied on Jimmy Sim.47Foot Note 47×Appellants’ Case at paras 67-69.(ii) The District Judge was wrong to conclude that Jimmy Sim, as a KEO and agent of Faber, cannot be held liable for the statements made on behalf of Faber.48Foot Note 48×Appellants’ Case at para 23.Instead, the correct legal principle is that an agent is personally liable for his torts, unless he can show that he had expressly or impliedly negatived personal liability.49Foot Note 49×Appellants’ Case at para 22(a).(iii) On the facts, the appellants met Jimmy Sim for the very purpose of having him, as KEO, confirm Representation 3 and that the requisite due diligence had been done.50Foot Note 50×Appellants’ Case at para 30.The District Judge erred in concluding that the main purpose had been to discuss the possibility of a co-broking arrangement. Further, Jimmy Sim had not simply informed the appellants that Faber had conducted due diligence checks without particularisation, but had affirmed Belle Seah’s representations, and made the due diligence representations (ie, Representations 5 and 6). In this regard too, the District Judge erred.51Foot Note 51×Appellants’ Case at paras 33-35.(b) Second, if Jimmy Sim owed a personal duty of care to the appellants, it followed from the trial judge’s findings that Jimmy Sim breached his duty of care.52Foot Note 52×Appellants’ Case at para 76. 16 In relation to Belle Seah, the appellants submitted as follows: (a) Belle Seah owed the appellants a personal duty of care. Again, the applicable framework was that laid down inSpandeck, and the District Judge erred in not applying that.53Foot Note 53×Appellants’ Case at para 80.Applying theSpandeckframework, there was physical and circumstantial proximity between Belle Seah and the appellants,54Foot Note 54×Appellants’ Case at paras 85-87.Belle Seah had voluntarily assumed responsibility towards the appellants,55Foot Note 55×Appellants’ Case at paras 88-92.and the appellants had relied on Belle Seah.56Foot Note 56×Appellants’ Case at paras 93-97.(b) Belle Seah breached her duty of care by failing to take reasonable steps to verify that the underlying facts were true.57Foot Note 57×Appellants’ Case at para 100.This was not a difficult or burdensome duty.58Foot Note 58×Appellants’ Case at para 101.",
        "Jimmy Sim’s case": "17 Jimmy Sim essentially supports the findings of the District Judge, and submits as follows: (a) The factual finding of the District Judge that Jimmy Sim only made a general representation that due diligence had been conducted by Faber, as opposed to Representations 4 to 6 is not “plainly wrong” or “against the weight of the evidence”.59Foot Note 59×Jimmy Sim’s Case at paras 58 and 69.(b) In the event that Jimmy Sim is found to have made Representations 4 to 6, the District Judge was correct in finding that Jimmy Sim does not owe a personal duty of care to the appellants.60Foot Note 60×Jimmy Sim’s Case at para 12.In this regard, Jimmy Sim also relies on theSpandeckanalysis, but contends that its application shows insufficient proximity between himself and the appellants.61Foot Note 61×Jimmy Sim’s Case at paras 83-124.Further, policy considerations militate against the imposition of such a duty of care.62Foot Note 62×Jimmy Sim’s Case at paras 125-132.",
        "Belle Seah’s Case": "18 Belle Seah appeared in person for the appeal, as she did at the trial below. She made the following submissions: (a) She did not owe the appellants a personal duty of care. In particular, there was insufficient proximity between the parties as she had not voluntarily assumed any responsibility towards the appellants.63Foot Note 63×Belle Seah’s Case at paras 10 and 13.(b) Further, the responsibility of verifying the facts underlying the representations lay with Faber as estate agent, and not with her as a salesperson acting on behalf of Faber.64Foot Note 64×Belle Seah’s Case at paras 5-8.",
        "Issues to be decided": "19 In my view, four issues arose to be decided. The first two relate to the appellants’ claim against Jimmy Sim, and the other two to their claim against Belle Seah. 20 As against Jimmy Sim, the two issues are: (a) First, whether the District Judge erred in finding that Jimmy Sim did not make Representations 4 to 6.(b) Second, assuming that Jimmy Sim made Representations 4 to 6, whether Jimmy Sim owed a personal duty of care towards the appellants when making those representations. 21 As against Belle Seah, the two issues are: (a) First, whether Belle Seah owed a personal duty of care to the appellants when making Representations 1 to 3.(b) Second, assuming that she owed a personal duty of care to the appellants, whether she had fallen below the standard of care expected of her when she made Representations 1 to 3.",
        "Whether Jimmy Sim made Representations 4 to 6": "22 The first issue that arises in respect of the appellants’ claim against Jimmy Sim is whether he even made the alleged representations to them. As noted above, the learned District Judge found that Jimmy Sim had not made Representations 4 to 6, and only represented that due diligence had been conducted by Faber. This finding was based principally on two reasons: (1) the meeting was likely a short one because the main purpose was for Cindy Yee to discuss the possibility of a co-broking arrangement with Jimmy Sim; and (2) the appellants’ evidence as to what Jimmy Sim had told them at this meeting was inconsistent. 23 The appellants submit that the District Judge’s findings in this regard were against the weight of the evidence, and invite me to overturn those findings. I first set out the general principles applicable to an appellate court’s intervention in factual matters before moving to consider the reasons the District Judge had relied upon.",
        "Applicable principles for appellate intervention": "24 I consider it appropriate to set out the applicable principles for appellate intervention in findings of fact made by a trial judge. Counsel for Jimmy Sim, Mr Akesh Abhilash, submitted that I should not overturn any of findings of fact made by the learned District Judge because they are not “plainly wrong” or “against the weight of the evidence”. 25 I agree that those are the accepted standards by which an appellate court should consider findings of fact made by a trial judge. The starting point is that the trial judge is generally better placed to assess the veracity and credibility of witnesses, especially where oral evidence is concerned. However, that is not an immutable rule. Where the trial judge’s assessment is “plainly wrong” or “against the weight of the evidence”, the appellate court can, and should, overturn such findings:Sandz Solutions (Singapore) Pte Ltd and others v Strategic Worldwide Assets Ltd and others[2014] 3 SLR 562 (“Sandz Solutions”) at [37]; and more recently endorsed inTurf Club Auto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal[2018] 2 SLR 655 at [368]. 26 It is also clear that where a finding of fact is not based on the veracity or credibility of the witness, but based on aninferencedrawn from the facts, or evaluation of primary facts, the appellate court is in as good a position as the trial judge to undertake that exercise. In such instances, the appellate court is entitled to undertake ade novoreview:Sandz Solutionsat [38]. 27 Even when it comes to the credibility of a witness, the appellate court need not invariably defer to the trial judge’s assessment. Where the assessment of a witness’s credibility is based oninferences, the appellate court is in as good a position as the trial judge to make that assessment, provided the appellate court has access to the same material as the trial judge. The inferences that might allow a trial judge to make an assessment as to a witness’s credibility can be drawn from internal inconsistencies in the content of a witness’s testimony, and external inconsistencies between the content of a witness’s testimony and extrinsic evidence:Sandz Solutionsat [39]. 28 Mr Abhilash cited the Court of Appeal decision inTeo Ai Choo v Leong Sze Hian[1986] SGCA 4 (“Teo Ai Choo”) and the decision of See Kee Oon J inGBR v Public Prosecutor and another appeal[2018] 3 SLR 1048 (“GBR v PP”). I do not think these cases detract from the principles as set out above. It is clear that the latter similarly adopted the standards of “plainly wrong” or “against the weight of the evidence” as the applicable standards (seeGBR v PPat [18]). As for the former, while the language used is slightly different, I do not think that the Court of Appeal was setting out a different test. The passage relied upon was as follows (Teo Ai Chooat [9]): In a case such as the instant case, where there were two directly contradictory versions the acceptance or rejection of which significantly depended on the oral testimony of the protagonists, the role of an appellate court is clear. We have to accord to the findings of facts of the learned trial judge the greatest respect and ought not disturb themunless we are satisfied that the learned trial judge had reached a wrong decisionand that in the context of this case “any advantage enjoyed by the trial judge by reason of having seen and heard the witnessescould not be sufficient to explain or justify the trial judge’s conclusion” … [emphasis added] In my view, the italicised phrases make clear that the Court of Appeal inTeo Ai Choowas similarly holding that the trial judge’s findings are to be deferred to unless they are plainly wrong or against the weight of the evidence. In any event, I did not understand Mr Abhilash to be advocating for a different standard of review, given that his written case similarly applied the standards of “plainly wrong” or “against the weight of the evidence”.65Foot Note 65×Jimmy Sim’s Case at para 58.It is on these standards that I approach the two findings of fact disputed by the appellants on appeal.",
        "Purpose of the meeting": "29 With respect, it is not clear to me how the learned District Judge arrived at the conclusion that the main purpose of the meeting (or “context of the meeting” as she had put it)66Foot Note 66×GD at [66].was for Cindy Yee to discuss the possibility of a co-broking arrangement with Jimmy Sim. The learned District Judge had relied on portions of the cross-examination of Cindy Yee which no doubt showed that Cindy Yee had told Jimmy Sim that she was a real estate agent, that she had asked Jimmy Sim if she could receive a commission for successfully introducing buyers to Faber, and that she was trying to co-broke sales with Faber.67Foot Note 67×GD at [66]-[68].However, there is a crucial leap of logic that is not supported by this evidence. Although they go to show that the topic of a co-broking arrangement had been broached, they do not show that that was themainpurpose behind the meeting. In fact, Cindy Yee haddeniedin cross-examination by Mr Abhilash, that that was the purpose behind meeting Jimmy Sim in the following terms:68Foot Note 68×Transcripts, 29 November 2017, pp 39-40. Q Did you ask if you could receive a commission for successfully introducing buyers to Faber Property? A Yes, I did ask for commission. Q You were trying to co-broke sales with Faber Property? A Yes, Your Honour. … Q But on the 16th of January 2012, you were trying to co-broke property sales with Faber Property? A Yes, I have the licence, if there’s a chance, I can still work on a co-broking basis. QSo the opportunity to co-broke properties with Faber Property was why you wanted to meet Jimmy? ANo, that is not true. [emphasis added] 30 When asked directly in cross-examination whether the purpose behind the meeting with Jimmy Sim was to discuss a co-broking arrangement, she flatly denied it. Yet this was not further pursued. While I note that she had also stated that she was “trying to co-broke sales” with Faber just a few questions before, this does not mean thatthepurpose of the meeting with Jimmy Sim was to discuss the co-broking arrangement. Indeed, it would have been inaccurate for her to say that she did not try to co-broke sales with Jimmy Sim. 31 Cindy Yee in fact went on to explain that she had wished to meet Jimmy Sim to receive assurances about the investment she and her husband were about to enter into:69Foot Note 69×Transcripts, 29 November 2017, p 40 lines 10-32. Q You did not need Jimmy to confirm what Belle had allegedly said? A Uh, I---I need to speak to Jimmy mainly because my husband, Mr. David Haw, he insisted that we need to see Jimmy because Belle being just real estate agent with Faber, she may transfer to other agency to work 1 day, we cannot catch her. But, uh, Jimmy being the CEO---KEO, he will be with the company. Q So you claim you wanted to meet Jimmy because the salesperson might leave but the KEO was unlikely to do so? A Yes, Your Honour. Q You wanted to speak with the KEO because if a salesperson left, you knew that you may have difficulty making a claim against Faber Property? A Yes, Your Honour. Q You know that real estate salespersons are not employees of estate agencies? A Yes, Your Honour. Q You were also concerned about due diligence checks when you met Jimmy? A Yes, Your Honour. Q You asked him if due diligence had been conducted? A Yes, Your Honour. 32 It is thus evident from Cindy Yee’s answers here that she had at least a second purpose in meeting Jimmy Sim, namely, to check with him whether due diligence checks had been conducted. It was also never put to Cindy Yee that she was lying as to such an intention behind the meeting. 33 In the circumstances, I have unable to see how the learned District Judge could have reached the conclusion that the main purpose behind the meeting was to discuss the co-broking arrangement. At the very most, she had before her evidence that Cindy Yee hadtwoobjectives for the meeting – trying to co-broke sales with Faber, and checking whether due diligence checks had been conducted. As between the two, Cindy Yee expressly denied that the former was the reason behind her wanting to meet Jimmy Sim, both in cross-examination and on affidavit.70Foot Note 70×Cindy Yee’s Supplemental AEIC at para 10.There was nothing to suggest Cindy Yee was untruthful about this. Accordingly, the learned District Judge had no basis to conclude that the main purpose of the meeting was to discuss the co-broking arrangement. In my view, this finding was against the weight of the evidence. 34 In any event, I have my doubts to the significance of this point. Even if Cindy Yee’s main purpose for the meeting had been to discuss the possibility of a co-broking arrangement, the question as to whether Jimmy Sim had in fact made the alleged representations is a separate factual matter altogether. The learned District Judge had relied on the main purpose of the meeting being to discuss the possibility of a co-broking arrangement to infer that the meeting “had been a short one”, and therefore it was less likely that Jimmy Sim made the alleged representations instead of the general representation that Faber had conducted due diligence checks.71Foot Note 71×GD at [75].That is a tenuous inference. A short meeting may well have involved Jimmy Sim making the alleged representations nonetheless. Whether he did so should (and can) be determined on the evidence about the meeting, which is what I consider now.",
        "Whether Jimmy Sim’s evidence is to be preferred over the appellants’": "35 The other basis for the learned District Judge’s finding that Jimmy Sim did not make the alleged representations is that there were inconsistencies in the appellants’ evidence as to what transpired at the meeting. The learned District Judge preferred Jimmy Sim’s account, which is that he merely made a general representation that due diligence had been conducted by Faber, without particularisation of the exact checks conducted.72Foot Note 72×GD at [75].It is this finding I now consider. In brief, I am of the view that there were no such inconsistencies in the appellants’ evidence. To the contrary, it was Jimmy Sim’s evidence that was lacking in this regard. The appellants’ evidence 36 Considering the appellants’ evidence altogether, I am of the view that the appellants have given fairly consistent evidence that Jimmy Sim made Representations 4 to 6. The sequence of events, according to the appellants, seems to me as follows: Cindy Yee asked Jimmy Sim generally whether due diligence checks had been conducted, Jimmy Sim replied in general terms that checks had been conducted, Cindy Yee began asking specific questions as to the particulars of the checks conducted, and Jimmy Sim replied to each of these queries by affirming that those checks had been conducted. In my view, and with respect to the learned District Judge, it was a failure to appreciate the distinction between Jimmy Sim volunteering particulars and Cindy Yee asking questions to obtain such particulars that led to the finding that appellants had inconsistencies in their evidence. 37 The abovementioned sequence of events is borne out clearly by Cindy Yee’s evidence. On affidavit, Cindy Yee stated that after meeting with Belle Seah on 16 January 2012, David Haw suggested meeting with Jimmy Sim to confirm the representations made by Belle Seah at the marketing event, and also seek Jimmy Sim’s assurance that the necessary due diligence checks had been performed. David Haw wanted to speak with Jimmy Sim about the investment as he was concerned that a salesperson like Belle Seah might leave Faber, and that it would be more unlikely for the KEO to leave Faber.73Foot Note 73×Cindy Yee’s AEIC at para 35.Subsequently, the appellants met with Jimmy Sim, and Jimmy Sim assured them that all the representations made by Belle Seah at the marketing event were true, that the monies would be paid into a lawyer’s account in New Zealand and held on trust, and that Faber had conducted all necessary due diligence checks on the development.74Foot Note 74×Cindy Yee’s AEIC at para 36. 38 It is true that Cindy Yee did not specify in her affidavit the exact sequence of events as mentioned above. But there was no reason for her to do so – it was not a material issue at the time she deposed her affidavit. The point was that the appellants had good reason to wish to speak to Jimmy Sim, and Jimmy Sim had made the alleged representations. 39 When Cindy Yee was pressed in cross-examination by Mr Abhilash on what transpired at the meeting with Jimmy Sim, she explained the sequence of events as I stated above. She first explained that she had asked Jimmy Sim the general question whether due diligence had been conducted, and Jimmy Sim replied generally:75Foot Note 75×Transcripts, 29 November 2017, p 43 at lines 25-27. Q Did Jimmy Sim tell you that due diligence had been conducted? A Yes, I asked him, he answered, his answer is yes. 40 Cindy Yee also gave some answers which may seem to suggest that Jimmy Sim had not given any particulars whatsoever as to the checks that were conducted:76Foot Note 76×Transcripts, 29 November 2017, p 44 at lines 18-29. Q And you say that he told you that he had performed due diligence checks on the project? A Yes, Your Honour. Q And what he told you was fairly detailed? What he told you was fairly detailed? A He just answer me that all the due diligence check has been done. He did not give detail. He keeps--- Q He did--- A saying that,“Yes---yes, already done, all done.” Q Thank you. So all Jimmy said was that due diligence had been conducted? A Yes, Your Honour. [emphasis added] 41 However, these answers, in my view, should be understood to mean that Jimmy Sim did notvolunteerthese details initially. This was made clear in the questions immediately following the above exchange:77Foot Note 77×Transcripts, 29 November 2017, pp 44-45. Q [Referring to Cindy Yee’s affidavit] Why then here do you say that Jimmy represented that all necessary due diligence checks on the project including land title, the background and credentials of the developer, the financial standing of the developer, as well as approvals from the various authorities had been conducted.Why do you particularise the examples of due diligence when you just told me that all Jimmy say was that due diligence had been conducted? A I wanted him to be very sure what he has been telling us. Q But did Jimmy--- A Hmm. Q list these examples to you in his representation? A I mentioned it to him that he will need to check on this, title check, approval, and then, uh, our payment must be very secure. That, uh, the---the developer shouldn’t be just running away with our money. Q Now, it is Jimmy’s evidence that at this meeting, you only asked if Faber Property had conducted checks in the project. A Again? Q Did Jimmy give you-did Jimmy give you details of the checks conducted? A No, it was me asking. [emphasis added] 42 When Cindy Yee’s evidence in cross-examination is considered in totality and in context, it appears clear to me that she was describing the sequence of events as mentioned above. When Cindy Yee initially asked Jimmy Sim, he gave broad sweeping statements, such as “yes, already done, all done” (see italicised extract above at [40]). This was understandably unsatisfactory to Cindy Yee, and so she pressed Jimmy Sim further to elicit responses regarding specific checks that she had in mind (given her background as a registered property agent). In her words, she “wanted him to be very sure” what Jimmy Sim had been saying, so she particularised the examples of due diligence (see italicised extract above at [41]). All this was summed up in the final question in the extract above – Jimmy Sim did not give details of the checks conducted, which I read as “volunteer details”, because it had been Cindy Yee asking. Understood in this way, Cindy Yee gave a consistent account of the meeting with Jimmy Sim. The learned District Judge, with respect, did not appreciate the distinction between Jimmy Sim failing to volunteer information initially and Cindy Yee later asking for particulars when she found that Cindy Yee’s evidence was inconsistent in this regard.78Foot Note 78×GD at [71] and [72].For the same reason, I do not accept Jimmy Sim’s submission that Cindy Yee’s evidence on this point was inconsistent.79Foot Note 79×Jimmy Sim’s Case at para 42. 43 Turning to David Haw’s evidence, I do not see how it contradicted Cindy Yee’s. His evidence on affidavit essentially repeated Cindy Yee’s account of the meeting with Jimmy Sim. He stated that he had wanted to meet Jimmy Sim to get assurances from him that all due diligence checks had been performed because Jimmy Sim was “senior management”.80Foot Note 80×David Haw’s AEIC at para 25. 44  In cross-examination by Mr Abhilash, David Haw reiterated that he was concerned to confirm Belle Seah’s representations with the KEO. In particular, he was concerned to know that his money was safe, and that due diligence had been done.81Foot Note 81×Transcripts, 26 February 2018, p 14 at lines 15-28.He specifically wanted to meet with the KEO because he was concerned that a salesperson might leave the company, but the KEO was unlikely to do so.82Foot Note 82×Transcripts, 26 February 2018, p 26 at lines 12-20.David Haw affirmed that the appellants had asked Jimmy Sim the general question of whether due diligence checks were conducted, to which Jimmy Sim replied that “all has been done”.83Foot Note 83×Transcripts, 26 February 2018, pp 26-27.Thus far, David Haw’s evidence was entirely consistent with Cindy Yee’s evidence in respect of the reasons behind meeting Jimmy Sim, and the sequence of events except for the point that Cindy Yee had asked specific questions about the precise checks conducted. Several questions later, David Haw again affirmed that they had “asked [an] overall question” whether Jimmy Sim conducted the due diligence checks, and whether the money was in a safe account.84Foot Note 84×Transcripts, 26 February 2018, p 29 at lines 3-7. 45 The part of David Haw’s evidence, which troubled the learned District Judge, and on which Jimmy Sim relies as an inconsistency between David Haw and Cindy Yee’s evidence, is in a single answer given by David Haw just a few questions after he said that they asked Jimmy Sim an “overall question”. The exchange was as follows:85Foot Note 85×Transcripts, 26 February 2018, p 29 at lines 12-30. Q Sure. Now Jimmy’s evidence in his AEIC is that at the meeting on the 16th of January 2012 you or Cindy had only asked if Faber Property had conducted checks on the project. Is that correct? A Okay, what happened was after we reconfirm with Belle on the 16th January in Faber Property’s office, we further want to re-confirm with Jimmy’s---Jimmy Sim and we asked Belle to introduce the KEO, actually I didn’t know who is KEO then. After that Belle introduced us to Jimmy Sim then I knew, oh, Jimmy Sim is the KEO.Then I asked him---we asked him ag---asked him again, “Have you done the due diligent [sic]?” Q Hmm. A Yes--- Q Okay. A and he say yes. Q Thank you.Did Jimmy give you any details or particulars of due diligence checks that were conducted? A Uh, no, Your Honour. [emphasis added] 46 Jimmy Sim claims that the concession by David Haw that Jimmy Sim did not give any details or particulars of the due diligence checks that were conducted contradicts Cindy Yee’s evidence that such details were given by Jimmy Sim upon her asking.86Foot Note 86×Jimmy Sim’s Case at para 44.The learned District Judge accepted Jimmy Sim’s submission, and took the view that David Haw’s evidence affirmed Jimmy Sim’s version of events,ie, that Jimmy Sim simply said that due diligence had been conducted without any specifics.87Foot Note 87×GD at [73]. 47 With respect, such a view of David Haw’s evidence fails to take into account the distinction I highlighted above between Jimmy Sim initially volunteering particulars, and Jimmy Sim later giving particulars in response to Cindy Yee’s probing. This is evident when David Haw’s evidence, in particular the answer that Jimmy Sim did not give particulars, is read in context. Immediately prior to the question of whether Jimmy Sim gave particulars, David Haw was in the midst of recounting how the appellants had been introduced to Jimmy Sim as KEO, and had asked him the general question of whether he did the due diligence checks. It was at this juncture that Mr Abhilash asked if Jimmy Sim provided specifics. It is entirely possible that David Haw understood this question to be whether Jimmy Sim’s reply to the general question contained specifics, and he therefore answered in the negative. That is not inconsistent with Cindy Yee’s version of events, which is that Jimmy Sim initially gave a blanket answer that due diligence checks had been done, and it was only upon further probing that he particularised the checks. David Haw was not asked in cross-examination whetherCindy Yeehad asked specific questions of Jimmy Sim, and what answers Jimmy Sim had provided in response to Cindy Yee’s questions following the initial general question. 48 For these reasons, I do not accept that the appellants’ evidence was inconsistent. To the contrary, I find that their evidence was mostly consistent, albeit not as clear as it could have been, though this is attributable to the fact that the distinction between Jimmy Sim volunteering information and later answering specifics was not fleshed out in the course of cross-examination. Consequently, I would be inclined to believe the appellants’ evidence that Jimmy Sim had made Representations 4 to 6. That said, I am bolstered in my conclusion that the appellants’ evidence is more credible by the fact that Jimmy Sim’s evidence on this point was plagued with difficulties, although the learned District Judge did not seem to think so. Jimmy Sim’s evidence 49 On Jimmy Sim’s evidence, I start by reiterating the principles for appellate intervention in findings of fact. As mentioned above at [27], where the credibility of a witness is based on inferences drawn from inconsistencies, the appellate court is in as good a position as the trial judge to draw the appropriate inference about the witness’s credibility. In relation to Jimmy Sim, I am satisfied that there are severe internal inconsistencies in his evidence from which I am entitled to infer that his evidence is simply not credible on this point. 50 I start by considering his first affidavit of evidence-in-chief (“AEIC”). It would not be an exaggeration to say that it is very surprising that he made no mention whatsoever about the meeting between him and the appellants on 16 January 2012. That meeting formed the crux of the case against him, and was expressly pleaded in the statement of claim filed 28 October 2015.88Foot Note 88×Statement of Claim, paras 8 and 9.In his AEIC, Jimmy Sim entirely glossed over the meeting, going from the marketing event held on 14 and 15 January 2012, to a site visit he made to New Zealand on 27 to 31 January 2012.89Foot Note 89×Jimmy Sim’s AEIC at paras 30-36.His silence on this meeting in his AEIC was raised by counsel for the appellants, Mr Harish Kumar, in the course of cross-examination, which I will come to below. 51 Jimmy Sim only gave evidence on the meeting of 16 January 2012 in his Supplemental AEIC filed some five months later. In his Supplemental AEIC, Jimmy Sim stated that Cindy Yee had introduced herself as a real estate salesperson and had asked if she could receive a commission for successfully introducing buyers to Faber Property. They had a “casual conversation” about the location of the development and the surrounding amenities, but did not affirm the representations made by Belle Seah at the marketing event. Cindy Yee then asked whether Faber had conducted checks on the property.  He replied that they had performed due diligence checks, but did not particularise the checks conducted, and Cindy Yee did not ask about the checks that were conducted.90Foot Note 90×Jimmy Sim’s Supplemental AEIC at paras 4-6. 52 Given his evidence in his Supplemental AEIC, it was somewhat surprising that Jimmy Sim was quick to say, and adamant, in cross-examination that he could not really recall whether he made the alleged representations to the appellants at the meeting:91Foot Note 91×Transcripts, 27 February 2018, p 15 at lines 17-29; p 17 at lines 9-13. Q And they alleged here that you made certain representations to them. A I cannot remember. Q Sorry--- A The--- Q you cannot remember what? A This. Q You cannot remember that you made certain representations--- A Uh--- Q to them? A Uh, I mean---of course, we---we were talking about ---chit chatting---but---certain representation, I cannot remember. … Q We’re not talking about what---whatever they want to say. I’m testing whether you understand what [the appellants’] case against you is. A Yah, but they are using what? I can’t even remember what I said--- 53 Further, when Mr Kumar queried Jimmy Sim as to why he was able to recall the facts of the meeting some five months later in his Supplemental AEIC, Jimmy Sim was unable to give a clear answer. His reasons ranged from having forgotten initially, not thinking it was important, to later being “required” to put in the details of the meeting. As will be seen from the extract below, his answers were highly unsatisfactory:92Foot Note 92×Transcripts, 27 February 2018, p 21 at lines 13-21; p 23 at lines 4-11; p 24 at lines 3-6; p 25 at lines 11-22. Q … Why didn’t you address [the meeting]? You had a chance to do it. You had lawyers representing you. A I don’t know. I just put it in and--- Q What, you forgot? You didn’t think it was important? A Maybe. Q Maybe? A I don’t know---I don’t know. … A Now the---the 1st affidavit is I---I---I don’t know why I did not put it in. Maybe---like I said, I don’t know--- Q No, I’m asking what happened between January and July or January or June that you suddenly remembered all these things that you have previously forgotten? A Suddenly remembered---but I---I---but this affidavit is because I---I---I was required to put in. So that’s why I just --- … Q …  You want to try it again? You wanna be more specific, please? A I think there’s some requirement that I need to answer what happened on the---this meeting. That’s why I try to recall. … Q Sim, this is not a recollection. This is not just “try to recall”. This is a very specific recollection of a conversation. They are very---very specific facts. Which even based on your earlier evidence, you’re having difficulty understanding how you’re able to relate these things which such clarity when you can’t even do that it Court. A So, how you want me to answer? Q I’m asking you how you are able to do it, Mr. Sim. And if you can’t answer that question, you can say, “I can’t answer that question” and I’ll move on. A Hmm. I---I really cannot remember why this, uh, 2nd affidavit is out. And I have to address it. 54 After the above exchange, that line of inquiry in cross-examination was promptly halted following an objection by Mr Abhilash on the basis that the issue of timing of the inclusion of facts in the Supplementary AEIC is not relevant to the matters pleaded, and if the appellants had any objections, those should have been made at the time of filing. The learned District Judge agreed with Mr Abhilash on that point.93Foot Note 93×Transcripts, 27 February 2018, p 26 at lines 6-27. 55 In my view, while it was unfortunate that the line of cross-examination by Mr Kumar was halted, I am of the view that on balance enough had been done. It showed that Jimmy Sim had no satisfactory reason as to how he was able to come up with a detailed recollection of the events of the meeting some five months later in the Supplemental AEIC, despite having been completely silent on it in his initial AEIC. I say that it was unfortunate that the cross-examination was stopped because, and I agree with the appellants, that the focus of the inquiry was not so much the technical matter of the Supplemental AEIC having been filed late, but that the late and detailed recollection coupled with the complete silence on a crucial event reasonably casts doubt on the veracity of Jimmy Sim’s evidence on that point. 56 A final point that I would make is that Jimmy Sim’s evidence as to what transpired at the meeting is completely at odds with his pleaded defence. In his defence, he denied that he made the alleged representations, and stated that he “merely greeted the [appellants]”.94Foot Note 94×Defence of the 1st and 2nd Defendants (Amendment No 1) at para 10.This is inconsistent with his own evidence in his Supplemental AEIC that there was a conversation about a commission for Cindy Yee introducing buyers to Faber, the location and amenities surrounding the development, and that Faber had conducted due diligence checks. When pressed on this in the course of cross-examination, Jimmy Sim offered no explanation other than stating that the “whole thing [was] very casual”.95Foot Note 95×Transcripts, 27 February 2018, p 30 at lines 15-26.In fact, he refused to even accept that the two were inconsistent.96Foot Note 96×Transcripts, 27 February 2018, p 35 at lines 14-18. 57 In summary, Jimmy Sim’s evidence was as follows: (a) In his pleaded defence, he stated that he merely greeted the appellants.(b) In his AEIC, he was completely silent on the meeting.(c) In his Supplemental AEIC, he stated that there was a conversation about a commission for Cindy Yee introducing buyers to Faber, the location and amenities surrounding the development, and that Faber had conducted due diligence checks.(d) In cross-examination, he stated that he could not recall what he had said to the appellants at the meeting. He was also unable to explain why he was initially silent on the meeting in his AEIC, and why his evidence on the meeting in his Supplemental AEIC was inconsistent with his pleaded defence. 58 Considering his evidence in totality, I am satisfied that based on the numerous inconsistencies identified above, and the unsatisfactory explanations that Jimmy Sim has given, Jimmy Sim’s evidence on the meeting as stated in his Supplemental AEIC was a self-serving afterthought, concocted so as to minimise his personal liability to the appellants. This is based simply on the internal inconsistencies of the various positions he has taken on the matter. As noted above, when it comes to assessing the credibility of a witness based on inferences drawn from internal inconsistencies, the appellate court is as well placed as the trial judge. For these reasons, I am of the view that the finding of the learned District Judge that Jimmy Sim’s account is to be preferred over the appellants’ is, with respect, against the weight of the evidence. I therefore find that Jimmy Sim made Representations 4 to 6 to the appellants at the meeting.",
        "Whether Jimmy Sim owes a personal duty of care to the appellants": "59 Having determined that Jimmy Sim in fact made the alleged representations to the appellants, I turn to consider whether Jimmy Sim owes a personal duty of care to the appellants. The learned District Judge took the view that no such duty of care arose, and so Jimmy Sim could not be personally liable. With respect, I disagree and now give my reasons. 60 It is not disputed that the general framework to be applied to the question of whether Jimmy Sim owed a personal duty of care is that laid down inSpandeck.Spandeckputs forth a two-stage test premised on proximity and policy consideration which is preceded by a preliminary requirement of factual foreseeability. It is not disputed that the preliminary requirement of factual foreseeability is satisfied here. Consequently, only the issues of proximity and policy considerations arise. Jimmy Sim contends that at both stages of theSpandecktest, the appellants would fail to establish a personal duty of care on the part of Jimmy Sim.",
        "Proximity": "61 Proximity in theSpandecktest refers to the need for sufficientlegalproximity between the claimant and the defendant for a duty of care to arise. The focus is therefore the closeness of the relationship between the parties:Spandeckat [77]. It is ultimately a fact-sensitive question, and various factors are relevant. Proximity includes physical, circumstantial and causal proximity, and also the twin criteria of voluntary assumption of responsibility and reliance:Spandeckat [81]. 62 The learned District Judge took the view that there was no proximity between Jimmy Sim and the appellants because the representation was made on behalf of Faber. She was therefore of the view that there was no relationship whatsoever between Jimmy Sim in his personal capacity and the appellants.97Foot Note 97×GD at [78].She also relied on the decision of Judith Prakash JA, sitting in the High Court, inMax-Sun Trading Ltd and another v Tang Mun Kit and another (Tan Siew Moi, third party)[2016] 5 SLR 815 (“Max-Sun Trading”). The learned District Judge interpretedMax-Sun Tradingto stand for the proposition that the court must determine whether parties intended to exclude a tortious duty of care based on how they structured their commercial relationship.98Foot Note 98×GD at [79].It seemed implicit in her reasoning that she considered the appellants and Jimmy Sim to have excluded a tortious duty of care on the part of Jimmy Sim personally. 63 Counsel for Jimmy Sim takes a similar view. On the first stage of proximity, the main thrust of Jimmy Sim’s argument is that there was no voluntary assumption of risk by Jimmy Sim in his personal capacity (as opposed to his capacity as director of Faber). Jimmy Sim similarly relied onMax-Sun Trading, pointing to the fact that the use of the corporate structure of Faber should limit Jimmy Sim’s liability.99Foot Note 99×Jimmy Sim’s Case at paras 88-89.Further, contractual clauses in the FRR Agreements served to exclude Jimmy Sim’s tortious liability.100Foot Note 100×Jimmy Sim’s Case at para 104. 64 Counsel for the appellants submits there was physical and circumstantial proximity, Jimmy Sim assumed responsibility for the representations, and the appellants relied on Jimmy Sim making those representations. The appellants contend that the reliance onMax-Sun Tradingby both the District Judge and Jimmy Sim was misplaced.Max-Sun Trading, it is argued, stands for the exception to the general rule that an agent remains personally liable for his torts, unless he can show that he had expressly or impliedly negatived liability. 65 Having considered parties’ submissions, I am of the view that there are two sub-issues to determine whether there is sufficient proximity between Jimmy Sim and the appellants. The first sub-issue is whether Jimmy Sim can be said to have assumed responsibility for the representations in his personal capacity, or whether he merely made them on behalf of Faber. Assuming that the appellants succeed on the first sub-issue, the second sub-issue is whether parties intended to exclude Jimmy Sim’s personal liability in tort. Capacity in which the representations were made 66 This sub-issue is, on the present facts, determinative of whether there was sufficient proximity between Jimmy Sim and the appellants since it disposes of the twin criteria of voluntary assumption of risk and reliance. As for the other factors, I accept the appellants’ submission that there was physical proximity. The appellants met with Jimmy Sim at Faber’s office on 16 January 2012, at which meeting Jimmy Sim made the material representations. I am doubtful however if it can be said that there was circumstantial proximity in the sense of an overriding relationship between Jimmy Sim and the appellants (seeSpandeckat [78]), but that is ultimately not material. 67 The main contention, as mentioned, lay with the twin criteria of voluntary assumption of risk, and reliance. Jimmy Sim’s submission is that even if hefactuallymade the representations,legallythey should be attributed to the company (ie, Faber), and therefore did not assume responsibility in his personal capacity for those statements. The corollary is that the appellants could not have relied on his representations as coming fromhim personally, as opposed to coming from Faber. Though I appreciate the force of this submission, I do not accept it. 68 I accept the appellants’ submission on this point. The appellants relied on a passage in the Court of Appeal decision ofAnimal Concerns Research & Education Society v Tan Boon Kwee[2011] 2 SLR 146 (“Animal Concerns”). In that case, the appellant had engaged a contractor to construct a shelter for animals. The contractor in turn appointed its director, the respondent, as the clerk of works for the construction project. The appellant sued the contractor for breach of contract, and the respondent, in his capacity as clerk of works, for negligence. The Court of Appeal appliedSpandeckand concluded that the respondent owed the appellant a duty of care. The argument was raised that the imposition of a duty of care would amount to an unwarranted lifting of the corporate veil. However, this argument was rejected by the Court of Appeal in the following terms (at [84]): This would only be true, however,if the Respondent was being sued for the tortious acts or omissions of [the contractor], rather than for his own tort(see, for example, the House of Lords decision ofStandard Chartered Bank v Pakistan National Shipping Corpn (Nos 2 and 4)[2003] 1 AC 959 at [22] (perLord Hoffmann) and [40] (perLord Rodger)). AsCompany Directors: Duties, Liabilities and Remedies(Simon Mortimore ed) (Oxford University Press, 2009) states (at para 27.22): A director is personally liable for his own torts committed in relation to the company’s affairs, whilst acting as a director or employee of the company. In such circumstances the company will also be vicariously liable for the director’s torts. In other words, the corporate veil argument depends on the Respondent acting as [the contractor], rather than as its employee or agent (or indeed in a personal capacity). On the facts of the present appeal, however, the Respondent’s liability is not predicated on any corporate actsquaorgan of [the contractor], but on his personal actsquaclerk of words (albeit therefore as an employee of [the contractor] … ).If all the elements of the tort of negligence can be established against the Respondent, he will be personally liable, andthe fact that he is also a director of a company is irrelevant to his personal liability, although it may be relevant to the company’s vicarious liability, depending on whether (as here) the tort was committed in the director’s course of employment. [emphasis added in bold italics] 69 It is evident that a principal authority relied upon wasStandard Chartered Bank v Pakistan National Shipping Corpn and others (Nos 2 and 4)[2003] 1 AC 959 (“Pakistan National Shipping”) which concerned the deceit of a director through fraudulent misrepresentation. Nonetheless, the Court of Appeal considered it appropriate to adopt the more general proposition that a director is liable for his own tort, even though, on the facts ofAnimal Concerns, the Court of Appeal was dealing with the tort of negligence. There is no reason for me not to apply the proposition here as well. 70 Put simply, the Court of Appeal inAnimal Concernsmade clear that thepersonalliability of an individual is not precluded just because he is a director of a company. The Court of Appeal concluded by holding that the separate legal personality of the contractor was irrelevant, and a duty of care could not be denied on that ground (Animal Concernsat [85]). 71 For completeness, I have also considered the decision of the House of Lords inWilliams and another v Natural Life Health Foods Ltd[1998] 1 WLR 830 (“Williams”), an authority cited in the speeches of both Lord Hoffmann and Lord Rodger of Earlsferry inPakistan National Shipping. In both their speeches, they took the view that the court below was wrong to applyWilliamsbecause it dealt with a negligent misstatement, as opposed to deceit (as was the case inPakistan National Shipping) (seePakistan National Shippingat [21] and [41]). I consider it appropriate to set out my views onWilliamsas I found it entirely consistent with the approach inAnimal Concerns. 72 InWilliams, the plaintiffs approached the first defendant company to franchise the concept of retail health food shops. The second defendant was the managing director and principal shareholder. The plaintiffs dealt with another employee of the first defendant, who gave them a brochure advertising the second defendant’s expertise in the health food trade. The first defendant company also sent the plaintiffs certain financial projections. Crucially, the plaintiffs did not know the second defendant and had no material pre-contract dealings with him. The plaintiffs’ shop eventually did not bring in the turnover predicted by the first defendant company. When the first defendant company went insolvent, the plaintiffs joined the second defendant to the action, their claim against him being based on an assumption of personal responsibility. 73 Lord Steyn, delivering the leading judgment of the House of Lords, dismissed the claim against the second defendant. He first made the following observations about the second defendant’s position as director of the first defendant company (at 835): For present purposes, his position is the same as if he had sold his business to another individual and agreed to act on his behalf.Thus the issue in this case is not peculiar to companies. Whether the principal is a company or a natural person, someone acting on his behalf may incur personal liability in tort as well as imposing vicarious or attributed liability upon his principal. But in order to establish personal liability under the principle ofHedley Byrne, which requires the existence of a special relationship between plaintiff and tortfeaser, it is not sufficient that there should have been a special relationship with the principal.There must have been an assumption of responsibility such as to create a special relationship with the director or employee himself. [emphasis added in bold italics] 74 Lord Steyn made two critical points in the passage above. The first is that this issue of capacity, in the context of a director’s torts, is not to be confused with the concept of the company’s separate legal personality. Rather, it is a matter of agency, and Lord Steyn accepted the principle that an agent may be personally liable, as well as imposing vicarious or attributed liability to the principal. This is entirely in line with the Court of Appeal’s views cited above inAnimal Concernsat [84]. The second is Lord Steyn’s view of the appropriate test for when personal liability can be imposed on the director – it is essentially the assumption of responsibility. As forhowthe court should determine whether the director assumed personal responsibility, Lord Steyn held as follows (at 835–836): The inquiry must be whether the director, or anybody on his behalf, conveyed directly or indirectly to the prospective franchisees that the director assumed personal responsibility towards the prospective franchisees. An example of such a case being established isFairline Shipping Corporation v. Adamson[1975] Q.B. 180. The plaintiffs sued the defendant, a director of a warehousing company, for the negligent storage of perishable goods. The contract was between the plaintiff and the company. But Kerr J. held that the director was personally liable.That conclusion was possible because the director wrote to the customer, and rendered an invoice, creating the clear impression that he was personally answerable for the services. If he had chosen to write on company notepaper, and rendered an invoice on behalf of the company, the necessary factual foundation for finding an assumption of risk would have been absent.[emphasis added in italics] 75 Considering both points together leads to the conclusion that the mere fact that an individual is concurrently a director of a company does not preclude a duty of care from arising if he assumed responsibility for his statements. This is, again, consistent with the views expressed inAnimal Concernsas I have stated above at [70]. 76 On the facts ofWilliam, the director never assumed responsibility for the statements made in the brochure. Significantly, there were never personal dealings between the director and the plaintiffs. There were no exchanges which “could have conveyed to the plaintiffs that [the second defendant] was willing to assume personal responsibility to them” (Williamsat 838). There was therefore no basis for the plaintiffs’ claim against the second defendant. 77 I pause to note that a proper understanding ofWilliamsalso explains why Lord Hoffmann and Lord Rodger inPakistan National Shippingheld thatWilliamshad no application in their case. The thrust of Lord Steyn’s judgment inWilliamswas on the requirement for an assumption of risk on the part of the director before he could be found liable for negligent misstatement, yet that is not an element of the tort of deceit which the House of Lords was concerned with inPakistan National Shipping.WilliamsandPakistan National Shipping(and indeedAnimal Concerns) are therefore all entirely consistent in holding that a director can be personally liable for his torts, whether fraudulent or negligent representation. 78 Finally, I also found the decision of Belinda Ang Saw Ean J inSu Ah Tee and others v Allister Lim and Thrumurgan (sued as a firm) and another (William Cheng and others, third parties)[2014] SGHC 159 (“Su Ah Tee”) to be of assistance. As will be seen below, it is relevant not just to the instant issue of whether a duty of care can arise. 79 InSu Ah Tee, the plaintiffs claimed damages for breach of contract and negligence from the defendants who acted as their solicitors in the purchase of property. The plaintiffs had discovered after purchase that the property had a shorter lease than they had expected, and it was subject to a head tenancy agreement instead of two separate tenancy agreements. The defendant solicitors in turn brought third party proceedings for an indemnity or contribution against the vendor of the property, the plaintiff’s property agent Ng Sing, and Ng Sing’s then-employer. The defendants’ case against the third parties was that they had each fraudulently and/or negligently misstated that the property had a longer lease remaining, and that it was being sold subject to two tenancy agreements when that was not the true position (Su Ah Teeat [1], [3] and [5]). Ang J found that the defendant solicitors were liable to the plaintiffs, and therefore went on to consider the third party action brought by the defendants (Su Ah Teeat [175]). 80 In so far as the defendants’ third party action against Ng Sing was concerned, Ang J held that although Ng Sing did not make fraudulent misrepresentations to the plaintiffs (Su Ah Teeat [211]), he was however liable for negligent misrepresentations. There was sufficient proximity between Ng Sing and the plaintiffs given, in particular, an assumption of responsibility by Ng Sing towards the first plaintiff, and reliance by the first plaintiff on Ng Sing, such that a tortious duty of care wasprima facieestablished (Su Ah Teeat [216]). 81 Ng Sing’s then-employer, SGR Property, was also part of the third party action. The defendants argued that SGR Property should be held vicariously liable for Ng Sing’s negligent misrepresentations as Ng Sing was employed by SGR Property at the material time. SGR Property did not participate in the action and was not present at trial. In the circumstances, Ang J ordered judgment in default of SGR Property’s appearance at trial (Su Ah Teeat [225], [226] and [227]). 82 In my view, although not explicitly stated inSu Ah Tee, the fact that Ng Sing and SGR Property werebothparty to the third party action is the crucial point for present purposes. I draw a parallel in this regard to Jimmy Sim (and Belle Seah, who stands in the same position as Jimmy Sim for the purposes of this comparison) and Faber. The defendants inSu Ah Teewere seeking to claim an indemnity againstbothNg Sing (the property agent)andSGR Property (the real estate agency, or employer), but Ang J did not consider this submission to be flawed. She certainly did not consider the potential vicarious liability of SGR Property to be a hindrance to finding that Ng Sing could be liable, or that proximity could exist as between him and the plaintiffs. In fact, she considered the question of whether Ng Sing had a duty of carepriorto considering whether SGR Property was liable. It should be noted that there was no appeal against these findings. 83 From a review of these authorities, it is clear to me that there is nothing preventing Jimmy Sim from having assumed personal responsibility towards the appellants for the representations he made. The fact that he was KEO of Faber is not dispositive of the matter either way. Instead, the inquiry is, as Lord Steyn put it, whether it was conveyed to the appellants that Jimmy Sim assumed personal responsibility towards them. On the facts, I am satisfied that he did. Jimmy Sim spoke directly and personally to the appellants. In those circumstances, it should have been obvious to Jimmy Sim that the appellants might reasonably rely on his word as a personal assumption of responsibility on his part. Yet there was nothing to suggest that he prefaced his statements with a disclaimer that he was speaking solely as the company, Faber, rather than in his personal capacity. Things would be completely different if, for instance, Jimmy Sim had written to the appellants in the company’s name. Whether a duty of care was excluded 84 Having established that there is sufficient legal proximity in the circumstances, I turn to consider whether other factors nonetheless indicate that parties intended to exclude a duty of care from arising. Jimmy Sim has in this regard pointed to several aspects of the parties’ relationship. 85 It is clear that the way in which parties structured their relationship can exclude a tortious duty of care from arising. That was the case inSpandeck. The appellant was awarded a contract based on a tender by the Government of Singapore. The respondent was the superintending officer for the project and was responsible for certifying interim payments in respect of the appellant’s work. Clause 34 of the contract provided that the appellant had the right to claim amounts under-certified and interest thereon by commencing arbitration proceedings against the Government of Singapore. The Court of Appeal accepted that the presence of cl 34 meant that the respondent had not assumed any responsibility for the appellant for the consequences of any under-certification, and consequently there was no legal proximity for a duty of care to arise (seeSpandeckat [108]). 86 InMax-Sun Trading, Prakash JA similarly found that the parties had excluded a tortious duty of care by the way in which they structured their commercial relationship. The plaintiffs were two Hong Kong companies. The first plaintiff’s representative had discussions with the first defendant about the possibility of setting up a factory in Vietnam. The first defendant then involved his spouse, the second defendant. The defendants, with some others involved in the discussions, incorporated a company in Singapore (“Elda Singapore”), which then incorporated a subsidiary in Vietnam (“Elda Vietnam”). The first plaintiff extended two loans to Elda Singapore, which channelled the funds to Elda Vietnam. The second plaintiff was incorporated to contract, and did contract, with Elda Vietnam. Eventually, relations broke down, Elda Singapore failed to repay the two loans, and the first plaintiff served a statutory demand on Elda Singapore, which was eventually wound up. The plaintiffs then brought proceedings against the defendants (who incorporated Elda Singapore in the first place) on the basis of,inter alia, the tort of negligence. The plaintiffs argued that the defendants had a duty of care to take appropriate care in performing their duties relating to the fulfilment of Elda Vietnam’s obligations, which breach prevented Elda Singapore from fulfilling its contractual obligations to the plaintiffs (Max-Sun Tradingat [88]). 87 Prakash JA noted that where parties chose to structure their commercial relationship by way of a contract, the court must ask whether the parties intended, by that structure, to exclude a tortious duty of care. If they did so intend, then there would be insufficient proximity to impose a tortious duty of care (Max-Sun Tradingat [90]). On the facts, although there was no express exclusion of the defendants’ liability in tort, it was clear that the parties chose to structure their commercial relationship as a series of supply contracts between the second plaintiff and Elda Singapore, and with two loan agreements between the first plaintiff and Elda Singapore. Such a structure of transactions would necessarily insulate the defendants from the liabilities undertaken by the Elda companies. Prakash JA thus could not see how there could be sufficient proximity to justify imposing a tortious duty of care on the defendants (Max-Sun Tradingat [91]). 88 That said, it is also clear that the mere presence of a pre-existing contractual relationship or backdrop between the parties is not, in itself, sufficient to exclude a duty of care. Instead, the true principle in determining whether or not any contractual arrangement has the effect of preventing a duty of care from arising is whether the parties structured their contracts intending thereby to exclude the imposition of a tortious duty of care (seeAnimal Concernsat [71] and [72]). On the facts ofAnimal Concerns, the Court of Appeal found that there was nothing to suggest that the appellant and the contractor had deliberately organised their contractual arrangements to exclude any potential tortious liability on the respondent clerk of works. There was no inconsistency between, one the one hand, the contract between the appellant and the contractor, and on the other, a duty of care owed by the respondent to the appellant (Animal Concernsat [73]). 89 With these principles in mind, I turn now to examine the facts of the relationship between Jimmy Sim and the appellants. Jimmy Sim and the learned District Judge relied onMax-Sun Trading, arguing that the parties’ relationship similarly excluded a tortious duty of care from arising. I do not agree. What is clear fromMax-Sun TradingandAnimal Concernsis that there needs to be shown somedeliberatedecision, or parties’intention, to organise the relationship in a particular way which excluded a duty of care. I accept the appellants’ submission that this crucial element is lacking in the relationship between Jimmy Sim and the appellants.101Foot Note 101×Appellants’ Case at para 27.UnlikeMax-Sun Trading, it is not the case here that Jimmy Simspeciallyincorporated a company as the entity through which he wanted to deal with the appellants. It is true that Jimmy Sim is the KEO and sole shareholder of Faber, and that the appellants dealt first with Faber. But that is not the same as saying that Jimmy Simintendedto deal exclusively with the appellants through the entity of Faber. 90 At this juncture, I would also address a separate point made by the learned District Judge. She had adopted the following observation of Prakash JA inMax-Sun Tradingat [92]:102Foot Note 102×GD at [80]. If I were to accept the plaintiffs’ submission that this nexus is sufficient to give rise to a tortious duty of care on the part of the defendants, I do not see how I could avoid imposing a similar duty of care onanydirector involved inanycommercial transaction. Not only would such a position radically expand the domain of the tort of negligence, it would also erode the principle of separate corporate personality that undergirds contemporary commerce. That cannot be allowed. [emphasis in original] 91 This must be read in the context of the specific facts ofMax-Sun Trading. As mentioned above, the parties in that case hadspecificallychosen to structure their relationship through entities the defendant incorporated for the particular transactions that they had in mind. It is inthosecircumstances that Prakash JA considered, rightly so, that to impose a tortious duty of care would be so broad and sweeping as to result in imposing a duty of care onanydirector inanycommercial transaction – indeed, the facts inMax-Sun Tradingwere thea fortiorisituation where one would imagine no duty of care could be imposed. This concern does not arise in the present case given the materially different facts. As for the concern about imposing a personal tortious duty of care on a director of a company, I have already considered this above and concluded that there is no bar to such a duty of care provided that there is sufficient indication the directorpersonallyassumed responsibility. 92 Jimmy Sim further relied on two clauses in the contractual documents that the appellants had signed. They are: (a) Clause 9.2 of the FRR Agreement (see [5(d)(ii)] above);103Foot Note 103×Jimmy Sim’s Case at para 91.and (b) Clause 9.3 of the FRR Agreement.104Foot Note 104×Jimmy Sim’s Case at para 99. 93 Clauses 9.2 and 9.3 of the FRR Agreement state:105Foot Note 105×ROA Part III Vol 1, p 205. 9.2 The parties acknowledge that this Agreement and the Schedules and attachments to this Agreement contain the entire agreement between the parties, notwithstanding any prior negotiations or discussions and notwithstanding anything contained in any brochure, report or other document. The FRR Holder acknowledges that: (a) it has not been induced to enter into this Agreement by any representation, verbal or otherwise,made by or on behalf of the FRR Issuerwhich is not set out in this Agreement; and (b) it has read and understood the terms and conditions of this Agreement. 9.3 This Agreement and the Sale Agreement shall be governed by the laws of New Zealand. Any dispute arising under this Agreement or the Sale Agreement (notwithstanding any other dispute resolution provisions in the Sale Agreement) shall be resolved by arbitration completed pursuant to the provisions of the Arbitration Act 1996. The arbitration shall take place in Auckland, New Zealand before a single arbitrator appointed by the FRR issuer with expertise in similar disputes. The arbitrator shall not have the right to award punitive damages. Notwithstanding the foregoing the FRR Issuer shall have the right to bring an action in New Zealand courts to recovery [sic] any amounts due to the FRR Issuer and not paid by the FRR Holder pursuant to this Agreement or the Sales Agreement. No party shall be liable to the other for indirect or consequential damages. [emphasis added] 94 There is no merit in Jimmy Sim’s reliance on these two clauses. It must first be noted that the FRR Agreement is a contract between the appellants and the Developer. Neither Faber nor Jimmy Sim is party to it. As a starting point, it is therefore difficult to see how the FRR Agreement can be said to be an instance by which Jimmy Sim and the appellants intended to structure their relationship. This was not a case likeMax-Sun Tradingwhere although the contracts were between the plaintiffs and a third party entity (Elda Singapore), the third party entity was set up by the defendants to structure their relationship. 95 Turning to cl 9.2 specifically, I am of the view that it is simply inapplicable to the present situation. Clause 9.2 applies in relation to representations made “by or on behalf” of the Developer. Jimmy Sim’s representations were not on behalf of the Developer; they were made in his personal capacity. On a broader level, the FRR Agreement was intended to govern the relationship between the Developer and the appellants, and I therefore find that it has no bearing on the relationship between Jimmy Sim and the appellants. Accordingly, cl 9.2 does not exclude a tortious duty of care on Jimmy Sim’s part from arising. 96 As for cl 9.3, it appeared to me that the reliance on this clause stemmed from a failure to appreciate the facts ofSpandeck. Not every arbitration clause will prevent a tortious duty of care from arising. Jimmy Sim relied onSpandeck,106Foot Note 106×Jimmy Sim’s Case at para 100.where as noted above at [85], the Court of Appeal held that the presence of an arbitration clause in the contract meant that there was no assumption of responsibility on the part of the respondent. However, the crucial point inSpandeckwas that the arbitration clauses provided the appellant with a means of proceeding against athird party, namely, the Government of Singapore, in respect of claimsagainst the respondentfor under-certification. It is in those circumstances that the Court of Appeal found that the respondent did not assume responsibility. Those facts are not present here. The arbitration clause in cl 9.3 is for disputes between the appellants and the Developer to be resolved by arbitration. It says nothing about disputes between Jimmy Sim and the appellants; indeed, Jimmy Sim is not bound by the arbitration clause as he is not party to the FRR Agreement. 97 For these reasons, I am satisfied that there is nothing in the parties’ relationship that precludes a duty of care from arising as between Jimmy Sim and the appellants. There was no intentional or deliberate structuring of the relationship to preclude a tortious duty of care. Nor can the provisions in the FRR Agreement, which govern the relationship between the Developer and the appellants, be relied upon to preclude a duty of care owed by Jimmy Sim to the appellants.",
        "Public policy considerations": "98 There was a significant degree of repetition in the parties’ submissions on policy considerations in that material relied upon on the proximity stage was also relied upon as indicating that public policy considerations militated against imposing a duty of care. 99 Jimmy Sim submits that it would be untenable for a company director to be held liable forallstatements made on behalf of a company in the course of a company’s business, and this should militate against the imposition of any duty of care on Jimmy Sim.107Foot Note 107×Jimmy Sim’s Case at para 125.The learned District Judge took a similar view as well.108Foot Note 108×GD at [80].I do not accept this submission. There is no doubt that the proposition as framed by Jimmy Sim would be untenable, and would militate againstsucha duty of care. But that is not the proposition that would result from imposing a duty of care in the present case; it has a more limited scope. As I noted above (at [74]), a director will only be personally liable where there is an indication that he has assumedpersonalresponsibility. Contrary to the fears of Jimmy Sim and of the learned District Judge, the upshot of such a finding is not that directors are personally liable forallstatements made on behalf of a company. 100 I would go further and note that the proposition that Jimmy Sim contends for is in fact the more dangerous one. As the appellants put it, at its logical conclusion, it would mean that any director of a company has complete immunity against any statements he or she makes in the course of the company’s business.109Foot Note 109×Appellants’ Case at para 72.That seems to be, by far, the more untenable position. As the Court of Appeal inAnimal Concernsnoted, theSpandecktest does not prohibit the court from having regard topositivepolicy considerations so as to reinforce the finding of a duty of care (seeAnimal Concernsat [77]). 101 Jimmy Sim also relies on the arbitration clause in cl 9.3 of the FRR Agreement. He submits, with reliance onSpandeckagain, that a duty of care should not be superimposed onto the parties’ contractual framework. I find no merit in this submission for the same reasons I have outlined above at [96]. 102 Finally, Jimmy Sim submits that it would be an untenable policy for an estate agent to be made to indemnify investors in property against the fraud of developers, where representations made by the marketing agent were based on the instructions of the developer. Jimmy Sim contends that the proper party should be the developer. To impose a duty of care on estate agents in such circumstances would open the floodgates to claims against them. I do not accept this submission. It fails to recognise that finding a duty of care is not in itself sufficient to say that estate agents are being made to “indemnify” investors in property for the fraud of developers. It is merely a duty to take reasonable care. If the estate agent is negligent and does not do the necessary checks, I do not see why investors should not have a claim against estate agents. If, on the other hand, reasonable checks are conducted, then estate agents have no cause for concern because they would not be found to have been negligent. They would thus not be made to “indemnify” investors. The fear of an “indemnity” is premised on the concept of strict liability, but the tort of negligence is not about strict liability. 103 For all these reasons, I find that Jimmy Sim owed the appellants a personal duty of care when he made Representations 4 to 6. As I noted above, the findings that Jimmy Sim failed to check the various documents sent to him are not challenged on appeal (see [10(i)] above). There is no real argument that if a duty of care arises, Jimmy Sim breached that duty of care by failing to make reasonable checks before making Representations 4 to 6. In the circumstances, I find that Jimmy Sim was in breach of his duty of care towards the appellants. I therefore allow the appellants’ appeal against Jimmy Sim.",
        "Whether Belle Seah owes a personal duty of care to the appellants": "104 The appellants submit that the learned District Judge erred in finding that Belle Seah owed no personal duty of care. In particular, they submit that the learned District Judge wrongly relied onYuen Chow Hin and another v ERA Realty Network Pte Ltd[2009] 2 SLR(R) 786 (“Yuen Chow Hin”) to find that Belle Seah had not acted as an “independent contractor”, but was an agent for the real estate agency, Faber.110Foot Note 110×Appellants’ Case at para 79.This led her to conclude that Belle Seah therefore did not assume personal responsibility for the representations made on behalf of the real estate agency in marketing the development. 105 Belle Seah submits that she owed no duty of care towards the appellants. She points to the fact that there was no contract or commercial relationship between the appellants and herself, as the contract was between the appellants and the Developer.111Foot Note 111×Belle Seah’s Case at para 12.She had merely acted within the authority of the Developers, and there was thus no legal proximity between the appellants and her. She also did not voluntarily assume any responsibility towards the appellants.112Foot Note 112×Belle Seah’s Case at para 13.Further, she had not acted as an “independent contractor”, but as an agent of Faber.113Foot Note 113×Belle Seah’s Case at para 15. 106 In my judgment, the learned District Judge erred in adopting the analysis of an “independent contractor”. I accept the appellants’ submission that that was not the focus of the decision inYuenChow Hin. The individual property agents were not party to the action at all. Instead, it was the real estate agency that was being sued. As a result, it was necessary for the court to ascertain whether the real estate agency could be attributed liability as a result of actions of its agents (which would not be the case if they had acted as independent contractors). All this does not mean that the property agents did not have a personal duty of care towards the plaintiffs. 107 Bearing in mind the need to first refer to decided cases in analogous situations, I am of the view that Belle Seah did owe a personal duty of care to the appellants. There is no need to resort to the application of theSpandecktest afresh in relation to Belle Seah. As the Court of Appeal inSpandecknoted, theSpandecktest is to be applied incrementally, where there is an absence of a factual precedent which implies the presence of a novel situation. Analogous precedents should be relied upon where available, as they determine the current limits of liability (seeSpandeckat [73]).Su Ah Teeis a decision on an analogous situation. Ang J held that property agents owe a duty of care towards purchasers, finding that there is sufficient proximity in such a relationship, and that there are no policy considerations militating against the imposition of such a duty of care (seeSu Ah Teeat [214]–[217]). There is no dispute that Belle Seah was a property agent. On this basis, I find that she did owe a personal duty of care to the appellants. That said, the issue of whether she breached this duty of care is a matter that has to be considered on the precise facts of the present case. It is this which I now address.",
        "Whether Belle Seah breached her duty of care to the appellants": "108 Unlike Jimmy Sim’s case, it does not necessarily follow from a finding that Belle Seah owed a duty of care that she breached it. In Jimmy Sim’s case, the issue of breach was not in dispute given the findings of the learned District Judge that Faber (acting through Jimmy Sim) had failed to conduct the relevant due diligence checks, and he therefore had no reasonable basis on which to make the representations. In Belle Seah’s case, it is not disputed that she also did not conduct reasonable checks. The issue, however, is whether the standard of care expected of her required her to do so. In my view, it did not, and she therefore did not fall below the standard of care expected of her. 109 The appellants submit that Belle Seah’s duty of care required her to take reasonable steps to check that the facts underlying the representations were true. This, it is said, was “not a difficult or burdensome duty at all”.114Foot Note 114×Appellants’ Case at paras 101 and 102.In relation to Representation 1, Belle Seah could have conducted a simple search on the internet to verify if the Developer had a history of successful developments. For Representation 3, she simply needed to contact the New Zealand lawyers, which contact she had, to verify the protection of the investors’ monies. Yet none of this was done. Further, even though Belle Seah had received from Cook some documents relating to land title and resource consent, she did not scrutinise the documents to satisfy herself that all was in order. 110 In response, Belle Seah submits that it would not be reasonable for her to assume personal responsibility for the representations made by her, as a salesperson, on behalf of the estate agent (Faber) and the Developer. The representations made by her were precisely those she had been trained to make.115Foot Note 115×Belle Seah’s Case at paras 5 and 6.Put differently, it was not her role or within her job scope to perform due diligence checks on the Project, and she had totally relied on Faber to perform the necessary checks.116Foot Note 116×Belle Seah’s Case at para 17(2). 111 Although couched in the language of a duty of care, I understood the gist of Belle Seah’s case to be that she had effectively relied on Faber to perform the necessary due diligence checks. Her role at the marketing event was simply to deliver the representations which she had been trained and instructed to make. It should be noted that this was a finding of fact made by the learned District Judge, and it is not challenged on appeal.117Foot Note 117×GD at [94]. 112 InSu Ah Tee, Ang J held that the Code of Ethics and Professional Client Care set out in the First Schedule of the Estate Agents (Estate Agency Work) Regulations 2010 (GN No S 644/2010) (“the Code”) was indicative of a standard that had to be met as a salesperson (Su Ah Teeat [218]). The Code required a salesperson not to mislead the client, or provide any false information to the client (see para 6(3) read with para 6(4) of the Code). On the facts ofSu Ah Tee, Ang J found that the property agent had fallen below the requisite standard of care as he accepted what the vendor of the property had told him without making any independent verification. He also failed to verify discrepancies in documents which ought to have alerted him to the fact that there was another tenancy agreement (Su Ah Teeat [220] and [222]). 113 I accept that the Code is indicative of the standard that a property agent is supposed to meet. It does not, however, detract from the need to consider the specific facts in each case to determine whether the property agent breached his or her duty of care. Put differently, although the Code requires, through para 6(3) read with para 6(4), that a salesperson not mislead or misrepresent to any client, that cannot be construed as a strict liability standard. The touchstone still remains whether the salesperson, in the circumstances, acted reasonably. 114 On that note, I am of the view that although the Code applies as an indication of the standard Belle Seah was supposed to meet as a salesperson, in the specific facts of her case, she did not fall below the requisite standard of care owed to the appellants. The facts ofSu Ah Teeare distinguishable on the basis that the property agent there, Ng Sing, was not acting under the instructions of his real estate agency in brokering the purchase for his clients, the plaintiffs. He was therefore responsible for checking that his representations were true, as he had no basis for believing that they were true otherwise. 115  Belle Seah, on the other hand, was not brokering the purchase for the appellants as a deal for herself; she was merely conveying certain statements that she had been trained to make by Wai (the business development manager from the Hong Kong real estate agency that had marketed the Project there). In that context, I see her as no different from a promoter at a fair (who may also be termed a “salesperson”, but I shall avoid that term as it is also being used in a different context here to refer to property agents). Such individuals may or may not be hired on a part-time basis, and it may well be that they are simply given a fact-sheet to represent to potential buyers. It cannot be said that these promoters are required to verify that the facts underlying the representations they are instructed to make are true. That would simply be unduly onerous. Instead, they are entitled to expect that the company providing the fact-sheet has done its due diligence. That is not to say that these promoters have no duty of care at all. They do, but the point is it is not an onerous duty. They would, conceivably, fall below their duty of care if they misrepresent what they aresupposedto say,eg, reciting the fact-sheet wrongly. 116 In my view, Belle Seah’s role at the marketing event was similar. She was trained to make certain representations, and she did precisely that. She did not deviate from what her training taught her to say. It seems to me highly artificial to expect that if, hypothetically, Faber had 100 property agents to help out at the marketing event, thateach and every oneof those 100 property agents would be required toindependentlycarry out their own due diligence checks to verify for themselves that the representations that they were being taught to make in formal training sessions were true. It must be that the real estate agency, Faber, assumes the responsibility of verifying the facts, and its property agents, in this situation, are entitled to assume that Faber had done its job. Delegation of responsibility and the chain of command are part and parcel of any business.  117 For these reasons, I therefore find that Belle Seah did not fall below the standard of care expected of her. It must be recalled that the tort of negligence requires only that an individual actedreasonably, and not that the individual acted above all reproach. Just because morecouldbe done does not mean that the individual was negligent. The appeal against Belle Seah is therefore dismissed.",
        "Conclusion": "118 As the appeal is allowed against Jimmy Sim but not Belle Seah, Jimmy Sim is jointly and severally liable with Faber in respect of the appellants’ claims for S$15,000 and US$142,656.76. Consequently, the judgment in the court below in favour of Jimmy Sim is reversed in favour of the appellants. The appellants are further awarded interest on the two judgment sums at 5.33% from the date of the writ (28 October 2015) until judgment. 119 The appellants are entitled to their costs against Jimmy Sim to be taxed if not agreed. The order for costs in the court below in favour of Jimmy Sim is reversed in favour of the appellants, such costs are to be taxed unless agreed. Although Belle Seah is also entitled to her costs, she was however not legally represented. I therefore fix her costs at $1,000.00 to cover the time she expended on the appeal. The costs awarded to her below remains. The appellants’ solicitors are released from their undertaking for security for costs dated 27 June 2018 that they furnished for the appeal. Lai Siu Chiu Senior Judge Harish Kumar s/o Champaklal and Toh Jun Hian, Jonathan (Rajah & Tann Singapore LLP) for the appellants;Akesh Abhilash and Surenthiraraj s/o Saunthararajah (Eversheds Harry Elias LLP) for the first respondent;the second respondent in person."
    }
}