{
    "case_title": "Re IM Skaugen SE and other matters",
    "ncitation": "[2018] SGHC 259",
    "coram": "Kannan Ramesh J",
    "sections": {
        "Introduction": "1 Originating Summonses No 673, 674 and 675 of 2018 were filed by IM Skaugen SE (“IM Skaugen”) and its subsidiaries SMIPL Pte Ltd (“SMIPL”) and IMSPL Pte Ltd (“IMSPL”) (collectively, the “applicants”) respectively for moratorium relief pursuant to s 211B(1) of the Companies Act (Cap 50, 2006 Rev Ed) (“the Act”). OS 673 and 675 were opposed by MAN Energy Solutions SE (previously known as MAN Diesel & Turbo SE) (“MAN”). MAN was a creditor of IMSPL, but not a creditor of IM Skaugen and SMIPL. 2 The applications brought into sharp focus the approach that the court should take when dealing with applications for relief under s 211B(1) of the Act by related companies that are seeking breathing space to develop a group restructuring plan. Each company seeks a moratorium on an individual basis either to formulate a compromise or arrangement to propose to its creditors for consideration, or having proposed a compromise or arrangement, time for the creditors to consider, and negotiate revisions to the same. Notwithstanding that the separate legal personality of each company requires separate applications to be made, each compromise or arrangement is intertwined with and interdependent on the others, and forms part of a master restructuring plan – the group restructuring plan – that paves the way for the rehabilitation of the group as a whole, or that part of it that is sought to be rehabilitated. This is a reflection of the economic reality that the group functions as an economic unit with varying levels of economic integration amongst its constituent entities, notwithstanding the separate legal personality of each entity. A scenario such as this raises important questions on the interpretation of ss 211B(4)(a) and 211B(4)(b) of the Act, and how the court should weigh creditor support and resistance when faced with an application for relief under s 211B(1). 3 After considering the submissions of the parties, I granted the applicants moratorium relief. The substantive portions of the moratorium orders made in relation to OS 673 to 675, which were broadly identical in terms, were as follows: (a) Pursuant to s 211B of the Act, for a period of three months from 28 June 2018: (i) No resolution shall be passed for a winding up of the applicants; (ii) No appointment shall be made of any receiver or manager over any property or undertaking of the applicants; (iii) No proceeding, whether before a court, arbitral tribunal or administrative agency, and whether current, pending or threatened against the applicants, shall be commenced or continued against the applicants (other than proceedings under s 211B or ss 210, 211D, 211G, 211H, or 212) except with the leave of the court and subject to such terms as the court may impose; (iv) No execution, distress, or other legal process against any property of the applicants shall be commenced, continued, or levied, except with the leave of the court and subject to such terms as the court may impose; (v) No step to enforce any security over any property of the applicants, nor any step to repossess any goods held by the applicants under any chattels leasing agreement, hire-purchase agreement or retention of title agreement, shall be taken except with the leave of the court and subject to such terms as the court may impose; (vi) No right of re-entry or forfeiture under any leases in respect of any premises occupied by the applicants (including any enforcement pursuant to ss 18 or 18A of the Conveyancing and Law of Property Act (Cap 61, 1994 Rev Ed)) shall be enforced, except with the leave of the court and subject to such terms as the court may impose; and (vii) Notwithstanding order (a)(iii) above, MAN and IMSPL shall be granted leave to commence or continue the proceedings in HC/OS 731/2017 (“OS 731”), including any interlocutory order in, and appeal arising from, OS 731 (including but not limited to HC/SUM 2612/2018 (“SUM 2612”)) but MAN shall not enforce any judgment or arbitration award during the period in which the moratorium remains in force. 4 On the conditions accompanying the moratoria, I made the following orders pursuant to s 211B(6) of the Act: (a) If the applicants acquire or dispose of any significant property or grants security over any significant property, such information relating to the acquisition, disposal or grant of security shall be submitted to the court not later than 14 days after the date of the acquisition, disposal or grant of security; (b) The applicants shall provide to the court the following information relating to the applicants’ financial affairs within two weeks from the date of the order: (i) Audited annual financial reports of the applicants for the financial years 2014, 2015 and 2016; (ii) Unaudited annual financial reports of the applicants for the financial year 2017; (iii) Latest management accounts of the applicants as at 31 May 2018. (c) The applicants shall provide to the court the following information relating to the applicants’ financial affairs by the earlier of eight weeks from the day this order is made or when the applicants apply for leave to hold a meeting of the creditors and/or members of the applicants pursuant to s 210(1) of the Act: (i) A report on the valuation of the applicants’ significant asset, which shall be a report providing an estimate of the net proceeds recoverable by the applicants under the MAN Assignment Agreements as defined in paragraph 28 of the first affidavit of Bente Karin Flo filed in OS 673 on 31 May 2018. 5 MAN has appealed against the order granting the moratorium in OS 675,ierelating to IMSPL. However, as noted earlier, OS 673 to 675 were applications for moratorium relief by related entities in order to propose a compromise or arrangement to their respective creditors as part of a group restructuring plan. Individual applications were necessitated given the separate legal status of each entity, and consequently its separate community of creditors. However, as the compromise or arrangement proposed or intended to be proposed under each of the three applications was a piece of a single tapestry represented by the group restructuring plan, it would be only looking at part of the picture if one were to consider OS 675 in isolation. These are therefore grounds of decision for all three applications. 6 It should be noted that since the filing of MAN’s appeal on 27 July 2018, the moratorium orders have lapsed on 28 September 2018, which was three months from the date of the orders I made. The applicants have not filed applications for further extension of the moratoria as their restructuring efforts have failed. There were pending winding-up applications against IMSPL and SMIPL in HC/CWU 236/2018 (“CWU 236”) and HC/CWU 243/2018 respectively that had been stayed by the moratoria that had been ordered. Given that the moratoria had lapsed, on 16 November 2018 I heard the winding-up applications brought against IMSPL and SMIPL, and granted the winding-up orders sought. This state of affairs which took place after the hearing of the moratorium applications is elaborated on at [96]–[100] below. As a result of the winding-up order made against IMSPL, MAN’s appeal against my order in OS 675 has been stayed, unless of course leave of court is obtained.",
        "Background facts and procedural history": "7 IM Skaugen is a holding company incorporated in Norway. It has several wholly-owned subsidiaries including SMIPL, IMSPL, and Somargas II Pte Ltd (“Somargas”), collectively known as the IMS Group. A chart identifying the entities in the IMS Group can be found at Annex A. The IMS Group owned and operated a pool of multigas carriers and vessels which were Singapore flagged. IMSPL is incorporated in Singapore, and was registered with the Maritime and Port Authority of Singapore as an Approved International Shipping (“AIS”) enterprise from 2005 to 2015. Subsequently, SMIPL and several other entities in the IMS Group became the vessel-owning companies, and they applied for renewal of the AIS status in place of IMSPL, obtaining such approval on 19 January 2015. 8 The IMS Group has faced dire financial straits in recent times. As such, the applicants sought moratorium relief under s 211B(1) of the Act for breathing space, to allow IMSPL and SMIPL to propose a compromise or arrangement to their respective creditors, and to allow the creditors of IM Skaugen time to consider the compromise or arrangement which had been proposed. The applicants sought a six-month moratorium from the date of the application (31 May 2018),iesix months inclusive of the automatic 30-day moratorium that would apply under s 211B(8) upon filing a s 211B(1) application (“the Automatic Stay”). In addition, the applicants sought the appointment of Mr Morits Skaugen, CEO of IM Skaugen, as the IMS Group’s foreign representative. 9 MAN, a German company under the Volkswagen group of companies, is in the business of providing marine engines and turbomachinery. It opposed OS 675 on the basis that it was the principal creditor of IMSPL. MAN also opposed OS 673 even though it was not a creditor of IM Skaugen, apparently because it had an interest in IMSPL’s assets, which had been purportedly dissipated by way of assignment from IMSPL to IM Skaugen. MAN had nolocus standito oppose OS 674 as it was not a creditor of SMIPL. 10 Although IMSPL did dispute the validity of MAN’s debt, it was not a matter of serious dispute that MAN was to be treated as a creditor of IMSPL for the purpose of the application in OS 675. MAN was a creditor by reason of an arbitration award dated 4 April 2017 that it had obtained in its favour against IMSPL (“the Award”), in the sum of around €2m. MAN had commenced arbitration proceedings in 2014 against IMSPL for,inter alia,damages in respect of wrongful avoidance of a sale and purchase contract for two-stroke engines. The arbitration was seated in Denmark and administered by the Danish Institute of Arbitration (Case No E-2230). After obtaining the Award, MAN subsequently commenced enforcement proceedings on the Award in OS 731 against IMSPL. A provisional enforcement order was made on 28 June 2017, following which IMSPL applied to the Danish courts to set aside the Award, and also sought via HC/SUM 3315/2017 (“SUM 3315”) filed in OS 731 to set aside the provisional enforcement order. SUM 3315 was dismissed on 28 May 2018 by the High Court, the judgment for which was reported atMan Diesel Turbo SE v IM Skaugen Marine Services Pte Ltd[2018] SGHC 132. At the time of hearing, IMSPL had filed SUM 2612 for leave to appeal against the dismissal of SUM 3315. SUM 2612 has since been dismissed, and IMSPL has filed for further leave to appeal against the dismissal of SUM 3315 in the Court of Appeal (CA/OS 35/2018). This application is pending at the time of writing. 11  On the other hand, claims were also asserted by the applicants against MAN in separate proceedings. In brief, MAN sold or chartered out to IMSPL and SMIPL vessel engines that it had manufactured. IMSPL and SMIPL alleged that MAN manipulated test results in order to conceal the true fuel consumption of the engines, which were in fact higher than that warranted by MAN. IMSPL and SMIPL asserted that they suffered losses as a result of MAN’s breach. IMSPL and SMIPL’s rights in these claims against MAN were assigned to IM Skaugen, under which assignment they were entitled to a 5% share of the proceeds realised from the assigned claims.",
        "The parties’ cases": "",
        "The applicants’ arguments in support of OS 673 to 675": "The requirements under s 211B had been complied with 12 The applicants submitted that the requirements under s 211B of the Act had been fully complied with. MAN’s principal objection was that the applicants had not complied with the requirements of s 211B(4), and the disagreement centred on whether ss 211B(4)(a) and 211B(4)(b) were disjunctive or conjunctive requirements. The applicants submitted that they were disjunctive requirements turning on whether a compromise or arrangementhadbeenproposed or wasintendedto be proposed. MAN on the other hand asserted that the requirements were conjunctive regardless. The text of s 211B(4) is reproduced below at [45]. 13 Accordingly, on the applicants’ case, satisfying either limb (a) or (b) of s 211B(4) would suffice depending on the scenario that was in play. The question of which limb applied would depend on whether a compromise or arrangement wasintendedto beproposed orhad beenproposed. Section 211B(4)(b) would apply in the former situation and s 211B(4)(a) would apply in the latter situation. It was common ground that IMSPL and SMIPL were in the former situation and IM Skaugen was in the latter situation. As IM Skaugen had proposed a compromise or arrangement to its creditors, s 211B(4)(a) would apply and had been complied with as its secured creditors, Nordea Bank Finland plc (“Nordea”) and Swedbank AB (“Swedbank”) as well as its unsecured creditors, namely its IMSK14 bondholders and Gasmar AS (“Gasmar”), had either given letters of support or at the very least had indicated that they had no objections to the moratorium. On the other hand, as SMIPL and IMSPL hadnotproposed a compromise or arrangement butintended to doso, s 211B(4)(b) would apply. SMIPL and IMSPL submitted that they had complied with s 211B(4)(b) because a brief description of the principal features of the intended compromise or arrangement was set out in the affidavits filed in support of their respective applications. In gist, the features provided for payment to the creditors, on aparipassubasis, proceeds from SMIPL and IMSPL’s 5% share of the claims against MAN. In addition, creditors would receive distributions, in the case of IMSPL, from the proceeds of a contingent United States (“US”) claim (see [17] below) and in the case of SMIPL, from the proceeds of sale of shares in the Wuhan University of Technology-Skaugen Training and Consultancy Co Ltd. In return, SMIPL and IMSPL would be released from any claims by their creditors, including contingent claims under guarantees. There was no disagreement of any substance that SMIPL and IMSPL had complied with s 211B(4)(b). 14 There was also no dispute that the other limbs of s 211B(4), namely limbs (c) and (d), had to be and had been complied with. The applicants stated that to the best of their knowledge and wherever applicable, they had provided information of their secured and unsecured creditors in accordance with ss 211B(4)(c) and 211B(4)(d) respectively. In summary, the secured creditors of IM Skaugen were Nordea, in the sum of about US$34.4m, and Swedbank, in the sum of around US$20.2m. Gasmar was an unsecured creditor of IM Skaugen in the sum of US$937,081, as were bondholders of the IMSK14 bond which amounted to US$57m and which had fallen due on 6 April 2018. Whereas IMSPL and SMIPL were stated not to have any secured creditors, I noted at the time of the hearing, that in so far as unsecured creditors were concerned, Nordea was also a creditor of IMSPL and SMIPL, as IMSPL and SMIPL were guarantors of Somargas’s liabilities to Nordea. These liabilities had crystallised on 6 April 2018. On balance, it seemed apparent to me that Nordea was the single largest creditor of the IMS Group, and its support for the restructuring efforts of the group as a whole and the relevant entities of which it was a creditor specifically, was critical. I return to the significance of this at [61] below. The court should exercise its discretion to grant the moratoria as the applicants were making a bona fide attempt at restructuring 15 The applicants argued that the IMS Group’s business had long-term viability, notably because the group had committed substantial resources to develop its expertise and to effect a business transformation, the latter of which included shifting the group’s focus from seaborne transportation of liquefied petroleum gas to the regional distribution of liquefied natural gas. 16 In order to realise this transformation and to deal with short-term fiscal pressure from its creditors, the IMS Group had begun its restructuring efforts at an early stage with the formulation of a group restructuring plan. The plan would see the incorporation of a new corporation (“NewCo”) which would issue preference shares to a white knight investor guaranteed by a Norwegian investment company. Proceeds from the issue would be used to pay accrued interest and instalments due on secured debt. Unsecured creditors would be offered a one-for-one conversion of their debts for notes issued by NewCo. Shareholders of IM Skaugen would be offered shares in NewCo in an exchange for their existing shares. According to the applicants, the group restructuring plan received a favourable response from the shareholders and bondholders of IM Skaugen. They therefore submitted that the NewCo model had the potential to succeed. As noted earlier, a letter of support from IM Skaugen’s secured creditor Swedbank was tendered. Further, Nordea and Gasmar, secured and unsecured creditor of IM Skaugen respectively, indicated that they had no objections to the moratorium. The IMSK14 bondholders were also supportive of the NewCo plan when it was presented to them. It was emphasised that the support of the secured creditors – Nordea and Swedbank – was critical to the success of the group restructuring plan, as they controlled the vessels which were integral to the IMS Group’s ability to continue its commercial activities. 17 Apart from the viability of the IMS Group’s core business and the NewCo plan sketched above, the applicants argued that the IMS Group’s financial situation would be improved by successful outcomes in several claims. First, the aforementioned claims by IM Skaugen against MAN, of which 5% would be paid out to each of IMSPL and SMIPL. Second, the setting aside application pending in the Danish courts in relation to the Award. Third, a separate claim in a second arbitration proceeding seated in Denmark and administered by the Danish Institute of Arbitration (Case No E-2635), commenced by IMSPL against MAN in June 2017, pertaining to MAN’s purported non-compliance with the terms of the Award. Fourth, the claim by IMSPL against an ex-agent in the US of about US$2m. 18 Further, to explain the need for moratorium relief, the applicants made reference to claims brought in arbitrations seated in London by entities from a group helmed by Teekay Corporation and Teekay LNG Partners LP (“the Teekay Group”) against companies in the IMS Group. The applicants alleged that these claims were a coordinated attack by the Teekay Group to eliminate the IMS Group as a market competitor. The claims had apparently taken a significant toll on the IMS Group by diverting its resources and management time from the group’s rehabilitation efforts. The applicants submitted that granting the moratorium would allow the IMS Group relief from Teekay Group’s legal proceedings so that it could focus on formulating the group restructuring plan. It should be noted that there were also counterclaims brought by IMS Group companies against the entities from the Teekay Group. 19 The applicants rejected any allegation that the applications were an attempt to avoid enforcement of the Award, since they had taken steps to restructure their business since 2017, before the Award was issued on 4 April 2017. They also denied transferring their assets, namely vessels, to other companies in order to place them beyond the reach of creditors, and argued that any transfers of the vessels were for sound commercial reasons and made with the approval of the creditors which held the vessels as security, in particular Nordea.",
        "MAN’s objections to OS 675": "The requirements of s 211B(4)(a) had not been complied with 20 While this was not discussed in any detail in its written submissions, during the hearing MAN advanced the argument that ss 211B(4)(a)and 211B(4)(b) were conjunctive requirements regardless of whether a compromise or arrangementhad beenproposed or wasintended to beproposed. As such, the applicants had to satisfy both ss 211B(4)(a) and 211B(4)(b). In the case of IMSPL, even though it had not proposed a compromise or arrangement but intended to do so, for the purpose of limb (a),it had to produce evidence of support for the intended compromise or arrangement fromitscreditors together with an explanation of how such support would be important to its success. MAN submitted that IMSPL had not done so and indeed could not do so, since MAN as its principal and majority creditor would not provide such support, and therefore the application ought to be dismissed. Any intended scheme was doomed to fail 21 MAN further submitted that any compromise or arrangement that might be proposed by IMSPL had no prospect of success given MAN’s opposition. The predicate of this submission was that MAN was the principal creditor of IMSPL by reason of the Award. MAN asserted that as the Award constituted about 76% of IMSPL’s unsecured debt, this meant that IMSPL could not cross the statutory threshold of 75% in value required for a scheme vote to be carried. The applicants attempted to meet this argument by asserting that there was a real possibility that the Award would be set aside, and that claims against MAN would succeed. In such circumstances, MAN might not be a creditor of IMSPL by the time the intended compromise or arrangement was proposed, considered by the creditors and put to a vote at a duly called scheme meeting. Of course, this argument has been materially undermined by the outcome of SUM 3315 and SUM 2612 on the enforcement of the Award, although I note that the application for leave to appeal against the dismissal of SUM 3315 in the Court of Appeal is still pending at the time of writing (see [10] above). IMSPL was a shell entity and the application was an abuse of process 22 MAN also questioned thebona fidesof IMSPL’s application. It contended that the application was an abuse of process and an attempt to stymie the claims of legitimate creditors. In support of this argument, MAN pointed to IMSPL’s supposed admission that it was a mere shell with no active business or operation to be rehabilitated, and that the sole purpose of the moratorium sought in OS 675 was so that IMSPL could redistribute any proceeds arising from its share of the claim against MAN. As such, since IMSPL was not a going concern but a mere litigation vehicle, there was nothing to rehabilitate or resuscitate via any intended compromise or arrangement. Thus, allowing the moratorium would not further the legislative intent behind s 211B to provide an active business with the breathing space to formulate a rescue plan. 23 MAN further pointed out that the applications were filed three days after the dismissal of the application in SUM 3315 to challenge the enforcement of the Award. MAN thus suggested that the applications were a mere tactic to delay the enforcement of the Award, rather than anybona fideattempt at rehabilitating the business of the IMS Group. MAN buttressed this argument by again making the point that any restructuring effort, at least in so far as IMSPL was concerned, was an exercise in futility given MAN’s resistance to the same.",
        "Issues to be determined": "24 In view of the nature of the applications and the parties’ arguments as presented, the key issues that arose for determination were as follows: (a) Should the requirements under ss 211B(4)(a) and 211B(4)(b) be read disjunctively or conjunctively,ie, was an applicant under s 211B(1) required to fulfil both ss 211B(4)(a) and 211B(4)(b) or simply one or the other? (“the s 211B(4) issue”) (b) What constituted evidence of creditor support for the purpose of s 211B(4)(a) particularly in the context of a group restructuring? (“the Creditor Support issue”) (c) Were the applicationsbona fide? (“thebona fidesissue”) 25 As will soon become apparent, there were some areas of overlap between the three issues. Most notably, the presence of creditor support was relevant to the s 211B(4) issue as well as the Creditor Support issue. I propose nonetheless to deal with them separately for the sake of clarity.",
        "Legal framework and principles": "",
        "Approach to statutory interpretation": "26 As the determination of some of the issues in this case would involve the interpretation of salient provisions in s 211B, a brief summary of the approach to statutory interpretation is apposite to set a framework for the legal analysis that follows. 27 It is trite that statutory interpretation is a purposive endeavour, in that an interpretation that would promote the purpose or object underlying the written law must be preferred to an interpretation that would not do so (s 9A(1) Interpretation Act (Cap 1, 2002 Rev Ed)). The manner in which such an exercise should be undertaken has been expounded in several recent judgments by the Court of Appeal, perhaps most notably inTan Cheng Bock v Attorney-General[2017] 2 SLR 850 (“Tan Cheng Bock”). The correct approach to purposive interpretation can be summarised as a three-step approach as follows: (a) First, a court should ascertain the possible interpretations of the provision in question, by determining the ordinary meaning of the words in the provision, aided by rules and canons of statutory construction (Tan Cheng Bockat [38]); (b) Second, a court should then formulate the legislative purpose of the provision. In this regard, it may be necessary to consider the specific purpose of the particular provision in question, although it should be presumed that a statute is coherent as a whole, such that its individual provisions should be as far as possible read consistently with both the specific purpose of the provision and the general purpose of the underlying statute (Tan Cheng Bockat [40]–[41]). In ascertaining the legislative purpose, extraneous material may be a useful aid to interpretation, but primacy must be accorded to the text of the provision (Tan Cheng Bockat [43]), and hence extraneous material should not contradict the express text of the provision except in very limited circumstances (Tan Cheng Bockat [50]); (c) Third, a court should compare the possible interpretations of the provision against the purpose of the relevant provision, and prefer the interpretation which furthers the purpose of the written text (Tan Cheng Bockat [54(c)]).",
        "The legal framework and legislative purpose behind s 211B(1) of the Act": "28 Since the legislative purpose of a provision is important in arriving at its proper interpretation, I propose to deal briefly with the legal framework in s 211B, which was only recently introduced via the Companies (Amendment) Act 2017 (No 15 of 2017) (“the Amendment Act”), before embarking on an analysis of the issues. 29 The changes brought about by the Amendment Act were undertaken in an attempt to enhance Singapore’s restructuring framework and to further Singapore’s capabilities in managing cross-border insolvencies. The key changes related to the framework for schemes of arrangement and judicial management, rescue financing, pre-package schemes, and cram-down provisions as well as the adoption of the UNCITRAL Model Law on Cross-Border Insolvency (seeSingapore Parliamentary Debates, Official Report(10 March 2017) vol 94 (Indranee Rajah, Senior Minister of State for Finance)). The changes enacted by the Amendment Act were based on the recommendations of the Insolvency Law Review Committee (“the ILR Committee”) in its 2013 report (Report of the Insolvency Law Committee,2013) (“the ILRC Report”) as well as the recommendations of the Committee to Strengthen Singapore as an International Centre for Debt Restructuring (“the Restructuring Committee”) in its 2016 report(Report of the Committee to Strengthen Singapore as an International Centre for Debt Restructuring,2016) (“the Restructuring Report”). 30 I shall focus on the changes that were made to the scheme of arrangement regime as the applications were made under that regime. The scheme of arrangement provisions are now found in ss 210, 211, 211A–J and 212 of the Act. The scheme of arrangement as originally designed was not intended as an insolvency regime, but a means of facilitating the adjustment of shareholders’ rights, or creditors’ rights, without the need for unanimity from the shareholders or creditors as the case may be. It allowed for a statutory cram-down of contractual rights, provided that minimum thresholds of support had been obtained. It was a hybrid mechanism that allowed the implementation of debt restructuring arrangements, without being seen as making an insolvency application, under a process that involved a layer of judicial oversight to ensure that the rights of minority creditors were not unfairly or oppressively subjugated. As such, it fell short of formal insolvency proceedings. This to some extent explained why it resides in Part VII of the Act concerning “Arrangements, Reconstructions and Amalgamations” rather than the parts of the Act that contain the provisions on insolvency. This will of course change with the new Insolvency, Restructuring and Dissolution Act which consolidates Singapore’s personal and corporate insolvency, and debt restructuring laws into an omnibus statute. The scheme of arrangement regime will then migrate from the Act to the new omnibus statute. 31 Notwithstanding the originally conceived purpose of the scheme of arrangement, debtors and creditors, in no small part due to the creativity of practitioners, have customised it as a debtor-in-possession restructuring regime. This filled a lacuna in the Act – the absence of a debtor-in-possession restructuring framework. Accordingly, when considering the reforms that were needed, the ILR Committee and the Restructuring Committee settled on the scheme of arrangement as the debtor-in-possession regime, and accordingly recommended enhancements to it. 32  An immediate shortcoming that was identified by the two committees was that the moratorium available under the Act for a scheme of arrangement was not as robust as that available in liquidation and judicial management. The ILR Committee had observed (at p 136 of the ILRC Report) that “the protection afforded by the statutory moratorium provided at section 210(10) of the Act was relatively weak compared with the moratoriums found in the liquidation or judicial management regimes”. To address this, it had recommended (at p 142 of the ILRC Report) that “the scope of the statutory moratorium should be no narrower than that in judicial management”. 33 In particular, two weaknesses in the moratorium for a scheme of arrangement were identified. First, that the moratorium for a scheme of arrangement was not available upon filing and only on application, unlike the automatic moratorium which applied upon filing for judicial management pursuant to s 227C of the Act, a non-debtor-in-possession insolvency regime. A company that proposed a scheme of arrangement could, pending the filing and disposal of an application for a scheme meeting to be called, and if one was called, pending the holding of that meeting, apply for moratorium relief under s 210(10) of the Act which reads as follows: Power of Court to restrain proceedings (10) Where no order has been made or resolution passed for the winding up of a company and any such compromise or arrangement has been proposed between the company and its creditors or any class of such creditors, the Court may, in addition to any of its powers, on the application in a summary way of the company or of any member, creditor or holder of units of shares of the company restrain further proceedings in any action or proceeding against the company except by leave of the Court and subject to such terms as the Court imposes. 34 It was evident that s 210(10) existed to ensure that restructuring efforts were not scuttled or rendered nugatory, by preserving the status quo pending the filing and disposal of an application for a scheme meeting to be called under s 210(1), and if such a meeting was called, pending the holding of that meeting. Thus, the moratorium under s 210(10) served two important functions. First, it allowed the company the breathing space to develop and refine a compromise or arrangement that had been proposed to its creditors pending an application under s 210(1) for the calling of a scheme meeting. This was important as at that stage, the court had to be satisfied that it would not be futile to call the scheme meeting (Re Ng Huat Foundations Pte Ltd[2005] SGHC 112 (“Re NgHuat”) at [9];The Royal Bank of Scotland NV and others v TT International Ltd and another appeal[2012] 2 SLR 213 at [64]). Second, in the event a meeting of creditors was called pursuant to s 210(1), the moratorium allowed the status quo as between the company and its creditors to be maintained, to enable the creditors to decide whether to approve the proposed compromise or arrangement with or without further modifications and refinements. In either scenario, the moratorium allowed the applicant time and space to refine the compromise or arrangement to a level of maturity to enable the creditors to take a view on its acceptability, and to express their position through a vote at a scheme meeting if one was ordered. It also allowed the applicant the time and space to secure sufficient creditor support for the compromise or arrangement. 35 The second weakness that was identified was the precondition that a moratorium might only be ordered under s 210(10) if a compromise or arrangement “had been proposed” between the company and its creditors. In other words, a compromise had to be first proposed before an application under s 210(10) could be made. To ameliorate the rigours of the requirement, the courts had clarified this requirement in two important respects. First, that an application for moratorium relief under s 210(10) was not dependent on a prior application to convene a scheme meeting under s 210(1) having been made (seeRe Conchubar Aromatics Ltd and other matters[2015] SGHC 322 (“Conchubar”) at [8]–[11]). Second, and as a consequence of the first, the proposed compromise or arrangement was not required, for the purpose of an application under s 210(10), to have the level of detail or maturity that would be necessary for the court to convene a scheme meeting under s 210(1) (seePacific AndesResources Development Ltd and other matters[2016] SGHC 210 (“PacificAndes”)at [55]–[68]). It sufficed that the proposal contained sufficient particularity for the court to make a broad assessment that there was a reasonable prospect of the scheme working and being acceptable to the general run of creditors (Conchubarat [12]). However, the fact remained that the moratorium was only available where a compromise and arrangementhad beenproposed,as opposed to where one had not been but wasintended to be proposed. 36 The Amendment Act left s 210(10) intact. Instead, it introduced a new and independent scheme of arrangement regime in ss 211A to 211J, replete with powerful new restructuring tools and enhanced moratorium features. The newly introduced s 211B(1) reads as follows: Power of Court to restrain proceedings, etc., against the company 211B.—(1) Where a company proposes, or intends to propose, a compromise or an arrangement between the company and its creditors or any class of those creditors, the Court may, on the application of the company, make one or more of the following orders, each of which is in force for such period as the Court thinks fit: (a) an order restraining the passing of a resolution for the winding up of the company; (b) an order restraining the appointment of a receiver or manager over any property or undertaking of the company; (c) an order restraining the commencement or continuation of any proceedings (other than proceedings under this section or section 210, 211D, 211G, 211H or 212) against the company, except with the leave of the Court and subject to such terms as the Court imposes; … 37 Section 211B which introduced enhanced moratorium relief had four significant changes. First, relief was now available not only where a compromise or arrangement had been proposed but also where one wasintended to be proposed. Thus, the provision also applied where the company had not yet proposed a compromise or arrangement but was taking concrete steps to do so. This addressed the weakness identified above in [35], and was based on the recommendations of the ILR Committee (at pp 143–144 of the ILRC Report): ... the statutory moratorium under section 210(10) of the Companies Act can currently only be invoked if a scheme “has been proposed between the company and its creditors or any class of such creditors”. The Committee is of the view that this requirement that a scheme must have been “proposed” before a moratorium can be granted may in some instances be counterproductive:in some cases, the moratorium is needed precisely because the company needs time to work out a scheme to propose to its creditors. The Committee therefore recommends that the court should have the power to grant a statutory moratorium where there is an intention to propose a scheme of arrangement, subject to such terms as the court sees fit to impose… [emphasis added] 38 Second, s 211B provided for the Automatic Stay, subject to fulfilment of statutorily prescribed requirements (see s 211B(8) read with s 211B(9) and s 211B(13)). This reconciled the disparity highlighted above (at [33]) between an application for judicial management and scheme of arrangement. Further, if the s 211B(1) application was allowed, the court would extend the moratorium beyond the Automatic Stay for such periods and on such terms as the court deemed fit pursuant to s 211B(5)(a). The court could again extend this moratorium even further on terms, on application made before the expiry of the moratorium (see s 211B(7)). As the Automatic Stay could apply in a situation where a compromise was only intended to be proposed but had not actually been proposed, and recognising that the scheme was a debtor-in-possession regime, safeguards were introduced to prevent abuse. That such safeguards were necessary was made clear in the Restructuring Report (at paras 3.8–3.10): 3.8 … The Committee notes that the ILRC considered and declined to recommend that the moratorium in schemes of arrangement be triggered automatically upon the filing of an application for an order to call a meeting of creditors to consider and approve a scheme …the ILRC noted that an automatic moratorium could lead to abuse. Obtaining a moratorium, or at least an interim order pending the hearing of an application for a moratorium under section 210(10) of the Companies Act, is relatively easy and quick. 3.9In the Committee’s view, the procedure for obtaining an interim moratorium should be streamlined by providing that the moratorium arises automatically upon the filing of an application for a moratorium under s 210(10) of the Companies Act. 3.10To safeguard against abuse, the Committee recommends the following: (a) … (b) basic information to be provided with the application should include: (i) a brief description of the scheme which the applicant intends to propose; (ii) evidence of support for the moratorium from creditors of sufficient importance to the restructuring of the debtor (such as secured creditors whose assetsare integral to the operations of the debtor or constitute all or substantially all of the debtor’s assetsand/or significant unsecured creditors in terms of the value of their debt) … [emphasis added] It is clear from the above that one of the key safeguards was support from creditors of sufficient importance, particularly where a compromise or arrangement had not been proposed. The other safeguard was the requirement that there be a brief description of the intended compromise or arrangement. These safeguards were eventually introduced as ss 211B(4)(a) and 211B(4)(b) respectively of the Act. 39 Third, unlike the moratorium previously available under s 210(10) which restrained conduct within jurisdiction (seePacific Andesat [17]), the moratorium under s 211B(1) could be extended on application to restrain conduct outside jurisdiction as long as the party sought to be enjoined was in Singapore or within the jurisdiction of the court (see s 211B(5)(b)). However, it should be noted that this did not mean that the moratorium in such a case was “extra-territorial”. To describe it as such would be incorrect and would be to misunderstand the nature of and the jurisdictional touchstone for the relief. The jurisdictional touchstone for the moratorium to be extended under s 211B(5)(b) was that the court had to havein personamjurisdiction over the party sought to be restrained. Thus, the provision specifically stipulated that the moratorium would only be granted if the party wasin Singaporeorwithin the jurisdiction of the court. This is a common basis for exercise of jurisdiction in civil proceedings. Accordingly, the moratorium when ordered operatedin personamagainst the party enjoined. In this regard, it is pertinent that the Restructuring Committee specifically considered and declined to recommend the introduction of an automatic extra-territorial moratorium regardless of whether the court had jurisdiction over the party, similar to that in Chapter 11 proceedings in the US. Instead, the Restructuring Committee modelled its recommendations on the anti-suit injunction, which is predicated on there beingin personamjurisdiction. This is consistent with the nature of the relief operatinginpersonam. Also consistent with this, and given the parallels with the anti-suit injunction, the Restructuring Committee also recommended that the moratorium only be available on application, rather than under the Automatic Stay (at paras 3.12–3.14 of the Restructuring Report): 3.12 The Committee agrees thatexpress provisions for extra-territorial moratoriums have limited effect, as they are unlikely to be recognised in foreign jurisdictions. However, the Committee is of the view that there is merit in providing that the Singapore courts may grant injunctive relief against the pursuit of foreign proceedings by creditors who have been guilty of oppressive, vexatious or otherwise unfair or improper conduct in judicial management or schemes or arrangement proceedings. This is because the relief is based on English case-law and the Singapore courts may not necessarily adopt the same position absent specific provisions in this respect. 3.13 In addition, the Committee is of the view that the availability of injunctive reliefs against the pursuit of foreign proceedings by creditors need not be limited to circumstances where the creditor to be restrained has been guilty of oppressive, vexatious or otherwise unfair or improper conduct.This is because the success of a restructuring process very much depends on its effectiveness in staying creditor action, including actions commenced overseas. 3.14The Committee recognises that there is a natural reluctance to provide for extra-territorial stay of proceedings arising predominantly from the principle of comity amongst States. The Committee suggests that an appropriate balance could be struck by enabling the Singapore courts to grant injunctive reliefs in judicial management and schemes of arrangement proceedings against creditor action so long as the creditors in question are subject to thein personamjurisdiction of the Singapore courts. Express provisions for this injunctive relief should therefore allow the Singapore courts to make an order to stay creditors, who are based in Singapore or having sufficient nexus to Singapore such as to invoke the jurisdiction of the Singapore courts, from taking action globally (i.e. similar in nature to thein personameffect of an anti-suit injunction). This injunctive relief is useful as it leverages on Singapore’s status as an international financial hub and can bind creditors registered in and/or operating from Singapore from taking actions that might frustrate a restructuring. [emphasis added] Thus, the court’s jurisdiction to grant a moratorium restraining acts outside Singapore is really in substance akin to granting injunctive relief in an anti-suit injunction. Indeed, seen this way, it is also not dissimilar to granting aMarevainjunction that restrains conduct outside jurisdiction. These points become relevant in relation to how the relief should be calibrated, which I consider at [85]–[86] below. 40 Fourth, where an order under s 211B(1) had been made in relation to a company, the subsidiary or holding company of that company could also apply for similar moratoria under s 211C(1). This was introduced to facilitate group restructuring where the related companies do not seek to restructuring their liabilities but are instead an important cog in the applicant’s restructuring plan. 41 In explaining the expansion of the circumstances under which a company could obtain a moratorium under s 211B(1), Mr Edwin Tong SC, who was a member of the ILR Committee and the Restructuring Committee, said the following during the second reading of the Companies (Amendment) Bill 2017 (Singapore Parliamentary Debates, Official Report(10 March 2017) vol 94): The moratorium is crucial because it suspends actions against a debtor company. Without a moratorium, a scramble usually takes place when creditors think that someone else is going to steal a march on them, and consequently everyone moves in to liquidate the company. This undermines any prospect of being able to reach a more beneficial arrangement. It drives a company towards litigation and ultimately kills value in the company.In contrast, a moratorium holds the line and keeps allcreditors on an even keel. This is vital, so that companies in distress can have some “breathing space” in order to put in place an effective and mutually beneficial rescue plan. [emphasis added] 42 The legislative purpose was therefore clear. An applicant was allowed a default 30-day breathing space – the Automatic Stay – which could be extended on terms if the s 211B(1) application was allowed and thereafter for further periods also on terms, in order to either develop and propose a restructuring plan, or if one had been proposed, to refine and mature it based on engagement with the relevant creditor community, with the end objective in both situations being a vote on the plan at a scheme meeting if one was ordered under s 210(1). This explained why one of the statutory preconditions for an application under s 211B(1), regardless of whether a compromise or arrangement had been or was intended to be proposed, was an undertaking by the applicant that an application under s 210(1) for the calling of a scheme meeting would be made (see s 211B(2)(b)), which the court when making an order under s 211B(1) could regulate by setting a deadline for the filing of the s 210(1) application.To ensure that there was no abuse of the regime, safeguards were worked into the new provision, one of which was s 211B(4). 43 Having briefly sketched the legal framework and the legislative purpose for moratorium relief under s 211B(1), I now move on to consider the three issues at hand.",
        "My decision": "",
        "The s 211B(4) issue": "44 This was a significant issue not only for the purposes of the applications but also as a matter of general importance, as it concerned the statutory conditions that must be satisfied before moratorium relief might be granted under s 211B(1) in relation to the two scenarios envisaged under the section – where a compromise or arrangementhadbeenor wasintendedto be proposed. At the outset, I was informed by counsel for the applicants that there were differing approaches on this issue taken in past applications, resulting in inconsistency in the application of the provision, although no specific precedent was brought to my attention. A moratorium is an extraordinary relief holding in abeyance the enforcement of the legitimate rights of creditors against the company that is seeking to restructure. Accordingly, certainty in the application of the statutory requirements was critical. 45 As noted earlier, the issue essentially centred on the proper interpretation of ss 211B(4)(a) and 211B(4)(b). For ease of reference, s 211B(4) provides as follows: (4) The company must file the following with the Court together with the application under subsection (1): (a) evidence of support from the company’s creditors for the intended or proposed compromise or arrangement, together with an explanation of how such support would be important for the success of the intended or proposed compromise or arrangement; (b) in a case where the company has not proposed the compromise or arrangement to the creditors or class of creditors yet, a brief description of the intended compromise or arrangement, containing sufficient particulars to enable the Court to assess whether the intended compromise or arrangement is feasible and merits consideration by the company’s creditors when a statement mentioned in section 211(1)(a) or 211I(3)(a) relating to the intended compromise or arrangement is placed before those creditors; (c)a list of every secured creditor of the company; (d) a list of all unsecured creditors who are not related to the company or, if there are more than 20 such unsecured creditors, a list of the 20 such unsecured creditors whose claims against the company are the largest among all such unsecured creditors. 46 As noted above at [12], the applicants and MAN essentially diverged on whether the requirements in ss 211B(4)(a) and 211B(4)(b) were to be read conjunctively or disjunctively. On the applicants’ view, the requirements were disjunctive, and it sufficed that either s 211B(4)(a) or s 211B(4)(b) was satisfied depending on which scenario was engaged. Accordingly, in the case of a company intending to propose a compromise or arrangement, such as SMIPL and IMSPL, it was sufficient to satisfy s 211B(4)(b) by providing a brief description of the intended compromise or arrangement. It was not necessary to also satisfy s 211B(4)(a) by providing evidence of support from creditors and an explanation of the importance of such support. On the other hand, MAN’s view was that the two limbs should be read conjunctively. As such, IMSPL’s application should fail since it had failed to provide evidence of support from its creditors and an explanation of the importance of that support for the purpose of s 211B(4)(a). Indeed, on MAN’s view, there was no way IMSPL could fulfil the criteria in s 211B(4)(a), since IMSPL would not be able to furnish evidence of creditor support given the opposition of its majority creditor, MAN. As noted earlier, MAN did not raise any serious issue with regard to s 211B(4)(b). Having considered the parties’ respective views on the s 211B(4) issue, I was of the opinion that neither perspective was correct. 47 As a preliminary observation, it should be recalled that s 211B(1) differs from its s 210(10) counterpart most notably in that an applicant in the case of the former need onlyintendto propose a compromise or arrangement, without having yet done so (see [36] above). This was made clear from the text of s 211B(1), where a distinction was drawn between the scenario where a company “proposes…a compromise or an arrangement”, and where a company merely “intends to propose…a compromise or an arrangement”. I shall refer to the scenario in which a company has proposed a compromise or arrangement as the First Scenario, and where a company intended to do so as the Second Scenario. 48 The first step to statutory interpretation involves ascertaining the possible interpretations of the provision in question (see [27(a)] above). At the risk of over-simplification, I was of the opinion that s 211B(4) lent itself to three possible interpretations: (a) On the first interpretation, which was the one adopted by the applicants, the requirements in ss 211B(4)(a)and 211B(4)(b) were to be read disjunctively, and they applied to the First Scenario and Second Scenario respectively. In other words, under the First Scenario where an applicant had proposed a compromise or arrangement, it would need to furnish evidence of creditor support for the proposed compromise or arrangement, together with an explanation of how such support would be important for the success of the proposed compromise or arrangement as required under s 211B(4)(a). On the other hand, under the Second Scenario, an applicant intending to propose a compromise or arrangement would need to fulfil s 211B(4)(b) and provide a brief description of the intended compromise or arrangement. (b) On the second interpretation, which was the one adopted by MAN, the requirements under ss 211B(4)(a) and 211B(4)(b) were to be read conjunctively, regardless of whether one was concerned with the First Scenario or the Second Scenario. An applicant who proposed a compromise or intended to do so must furnish both evidence of creditor support and a brief description of the compromise. (c) The third interpretation, which I believed was the correct one, was that the requirements in ss 211B(4)(a) and 211B(4)(b) applied disjunctively in the First Scenario and conjunctively in the Second Scenario. In other words, a company which had proposed a compromise or arrangement needed to only furnish evidence of creditor support and an explanation of the importance of that support, thereby satisfying s 211B(4)(a). There was no need to also satisfy s 211B(4)(b). On the other hand, a company whichintendedto propose a compromise or arrangement would need to show both creditor support and the importance of the same,andprovide a brief description of the intended compromise or arrangement. 49 I will explain why I preferred the third interpretation. In arriving at my conclusion, I bore in mind the principles of statutory interpretation summarised at [27] above. First of all, I think it was fairly obvious that the first interpretation was untenable as it flew against the plain text of the statute. The first interpretation might appear to have some intuitive appeal in that it would mean that the requirements in ss 211B(4)(a) and 211B(4)(b) mapped neatly onto the First and Second Scenarios envisaged in s 211B(1). However, this meant that an applicant under the Second Scenario, that is, a company thatintendedto propose a compromise or arrangement, needed to only fulfil s 211B(4)(b) and not s 211B(4)(a). Yet, the text of s 211B(4)(a) clearly refers to evidence of creditor support for the “intendedorproposedcompromise or arrangement” [emphasis added]. In other words, the fact that an applicant companyintendedto propose a compromise or arrangement but had not yet done so did not excuse the company from the need to comply with s 211B(4)(a). The first interpretation must hence be rejected, as it could not be reconciled with the express language of s 211B(4)(a). 50 Rejecting the first interpretation might cause some discomfort – if no compromise or arrangement had been proposed to the creditors, how would the applicant in the Second Scenario fulfil s 211B(4)(a) by showing evidence of creditor support? What exactly was the support for? In my view, this question was in fact a red herring. Clearly, creditor support in the Second Scenario could not be for the compromise or arrangement, as one had not been proposed. But as noted above, the text of s 211B(4)(a) specifically states that evidence of creditor support and an explanation of the importance of that support is required in the Second Scenario. In my view, the support that the applicant must show wasfor the moratorium,as opposed to the compromise or arrangement itself (which was pertinent for the First Scenario). This seemed reasonably clear from the language of s 211B(4)(a), which speaks of creditor support for theintendedcompromise or arrangement. This could only be a reference to support for the breathing space given by the moratorium in order to give effect to that intention, since a compromise or arrangement had not as yet been proposed. In this regard, it is worth emphasising again that creditor support was introduced as a safeguard against abuse of the moratorium relief particularly where a compromise or arrangement had not been proposed (see para 3.10(b)(ii) of the Restructuring Report, quoted above at [38]). At the same time, the legislative purpose of the moratorium in s 211B(1) was to allow embattled companies breathing space to undertake restructuring efforts but onlyif there was sufficient creditor support. In the First Scenario, the breathing space allowed the applicant to engage the relevant creditor community on the compromise that had been proposed. At the same time, it allowed the creditors to consider and evaluate, and decide on the efficacy of the compromise for the purpose of a vote at a scheme meeting if one was ordered. If the applicant’s creditors were supportive of the proposed compromise or arrangement, it implicitly meant that there was concomitant support for the moratorium. Likewise, in the Second Scenario, the breathing space allowed the applicant who intended to propose the compromise the time to do so, and thereafter for the same process as that in the First Scenario to take place. Here too, the creditor support must be for the moratorium, which then allowed the applicant’s intention to manifest itself by the compromise being formulated and proposed to the creditors for consideration and evaluation, and to be voted on at a scheme meeting if one was ordered. The creditors’ desire for this to happen is evidenced by their support for the moratorium. That this interpretation was correct was evident from the link drawn in s 211B(4)(a) between the creditor support and its importance to the success of the restructuring efforts. It seemed clear to me that at the stage where a companyintendedto propose a compromise or arrangement but had not yet done so – the Second Scenario – evidence of creditor support for the moratorium necessarily constitutes evidence of creditor support for the applicant’s intention and effort to do so. That was what an applicant in the Second Scenario must satisfy for the purpose of s 211B(4)(a). 51 I should add that adopting the first interpretation would lead to the strange result of an applicant in the First Scenario (one who had proposed a compromise or arrangement) being subject to a more onerous requirement of evidencing creditor support as opposed to an applicant in the Second Scenario (one who had not but intended to propose a compromise or arrangement). If at all, one would have thought that the latter should be subject to more stringent requirements. In my view, not only was the first interpretation incongruent with the language of s 211B(4)(a), it would also draw an unprincipled and indeed illogical distinction between the First and Second Scenarios. On the other hand, the interpretation that s 211B(4)(a) applied to both the First and Second Scenarios achieved consistency with the text of the provision, consistency with the objective of the provision and consistency in the application of the provision to the First and Second Scenarios. Further, it also advanced the legislative purpose of s 211B(4) as a mechanism to prevent abuse of the moratorium. Given that the Automatic Stay arose upon application for the moratorium, and the ability of the court to extend the said moratorium, some safeguards were needed to protect the interests of the creditors. This is particularly where a debtor was in possession and sought moratorium relief without having proposed a compromise or arrangement,iethe Second Scenario. By requiring in the Second Scenario evidence of creditor support for the moratorium, coupled with an explanation of the importance of such support, s 211B(4)(a)ensured that the interests of creditors were taken into consideration when moratorium relief, automatic or otherwise, was granted to the applicant. 52 There were also sound reasons for rejecting the second interpretation which MAN had advanced. First, the language of s 211B(4)(b)made it clear that the requirement to furnish a brief description of the intended compromise only applied where the company had not but intended to propose a compromise or arrangement to its creditors,iethe Second Scenario. Hence, where the applicant had already proposed a compromise or arrangement, s 211B(4)(b) was not triggered. 53 Second, reading ss 211B(4)(a) and 211B(4)(b) conjunctively in the First Scenario would lead to a strange result. Let me explain. In the First Scenario, the applicant would have proposed a compromise or arrangement, and produced evidence of creditor support for that compromise or arrangement. The creditors would therefore have had the terms of the compromise or arrangement before them, with sufficient detail for them to evaluate it and to indicate their support. As such, it was difficult to see what purpose would be served by requiring the applicant to nonetheless provide a brief description of the compromise or arrangement to enable the court to assess whether the compromise or arrangement was feasible and merited consideration by the creditors. It seemed that the court was already doing exactly that for the purpose of s 211B(4)(a), by assessing the importance of the creditors’ support for the compromise or arrangement that had been proposed. The court’s task in the First Scenario was to assess whether creditor support was adequate and important for the purpose of s 211B(4)(a), which meant that it was assessing whether the compromise was “feasible” and merited consideration by the creditors. On the other hand, s 211B(4)(b) served two quite different purposes. First, the brief description of the compromise allowed the court to assess whether, at least on aprima facielevel, the compromise was feasible and merited consideration by the creditors. Second, it enabled the creditors to assess whether they should apply to set aside the Automatic Stay. This was clear from the Explanatory Statement to the Companies (Amendment) Bill 2017, which stated the following: The requirement for the brief description to contain sufficient particulars to enable the Court to assess whether the intended compromise or arrangement is feasible and merits consideration by the creditors when subsequently placed before the creditors in a prescribed statement is similar to the approach in the case ofRe Conchubar Aromatics Ltd and other matters[2015] SGHC 322. The information provided by the company under new section 211B(4) will assist the Court in deciding whether any order under new section 211B(1) should be made, and will also allow creditors of the company to determine if they should apply under section 211B(10)(b) for a termination of the automatic moratorium under section 211B(8). Thus, it was clear that s 211B(4)(b) served the purpose of safeguarding the interests of creditors and enabling the court to assess whether the application under s 211B(1) ought to be allowed,where a compromise hadnot yet been proposed. Accepting the second interpretation appeared to me not only to introduce a meaningless requirement but one that did not square with the language and intent of s 211B(4)(b). 54 Hence, in the round, I favoured the third interpretation. I was of the opinion that the requirements in ss 211B(4)(a) and 211B(4)(b) should be read conjunctively in the Second Scenario. As regards the First Scenario, I was of the opinion that only s 211B(4)(a) would apply. This meant that in the instant case, IM Skaugen, which was in the First Scenario, would have to fulfil s 211B(4)(a); whereas SMIPL and IMSPL, which were in the Second Scenario, would have to fulfil both ss 211B(4)(a) and 211B(4)(b). With these conclusions, I now move to the discussion of what creditor support in the context of s 211B(4)(a) meant, and the issue of whether creditor opposition by a majority creditor was fatal to an application under s 211B(1) particularly in the context of a group restructuring.",
        "The Creditor Support issue": "The appropriate test to assessing creditor support for the purposes of a s 211B(1) application 55 I was of the opinion that in determining what constituted relevant evidence of creditor support for the purpose of s 211B(4)(a), considerable insight could be gleaned from an analysis of the cases relating to the grant of a moratorium under s 210(10). I took this view given the parallels between an application for a moratorium under s 210(10) and one under s 211B(1). 56 As briefly discussed above at [35], the cases ofConchubarandPacific Andeshave established that in relation to an application under s 210(10), close scrutiny of the merits of the proposed compromise or arrangement or its viability and likely acceptance by the creditors should not be carried out at that stage. Hence, the test is for the court to determine whether on a broad assessment, “there was a reasonable prospect of the scheme working and being acceptable to the general run of creditors” (seeConchubarat [12];Pacific Andesat [65]). I believed that with some adjustment, the same test should apply to applications under s 211B(1). 57 In a s 211B(1) application, the court is concerned with determining whether an applicant company should be given breathing space to undertake restructuring efforts. In making that determination, the court undertakes a balancing exercise between allowing the applicant the requisite breathing space and ensuring that the interests of creditors are sufficiently safeguarded. It is not uncommon to expect that the restructuring efforts of an applicant under s 211B(1) are nascent or certainly not at a level of maturity to be placed before a duly called scheme meeting. The fact that s 211B(1) contemplates the Second Scenario, and does not require the application to be coupled with an application under s 210(1) for a scheme meeting to be called, speaks to this. That being the case, as a matter of approach, it seemed incorrect for the court to engage in a close scrutiny of the proposed compromise (in the First Scenario) or intended compromise (in the Second Scenario). This balance between giving the debtor adequate breathing space and ensuring that the creditors’ rights were not excessively restrained was best served by applying a test similar to that for a s 210(10) application with some modifications,iewhether on a broad assessment, there was a reasonable prospect of the proposed or intended compromise working and being acceptable to the general run of creditors. It should be noted in this regard that the test under s 211B(4)(b) – whether the intended compromise or arrangement was feasible and merited consideration by the company’s creditors – was intended to be similar to the test inConchubar(see the Explanatory Statement to the Companies (Amendment) Bill 2017 at [53] above). 58 The requirement for evidence of creditor support in s 211B(4)(a) should hence be applied with this test in mind. This meant that where a compromise had been proposed (iethe First Scenario), evidence of creditor support and the importance of that support should assist the court to make a broad assessment as to whether there was a reasonable prospect that the proposed compromise or arrangement would work and be acceptable to the general run of creditors. Similarly, where a compromise or arrangement was intended to be proposed (iethe Second Scenario), the court should make a broad assessment, based on the brief description of the intended compromise or arrangement, whether it was feasible and merited consideration by the creditors. In doing so, the court must take into account evidence of support of the creditorsfor the moratorium(see above at [50]) and the attendant explanation of the importance of that support to the success of the intended compromise or arrangement. This was evident from the Restructuring Report, which spoke (at para 3.10(b)(ii), quoted at [38] above) for example on the importance of the support of secured creditors “whose assets are integral to the operations of the debtor”. In the present case, the support of Nordea was important with regard to how this test ought to be applied, which I discuss below at [62]–[64]. Therefore, in substance, the court was really doing no more than making a broad assessment of whether there was a reasonable prospect of the intended compromise working (“feasible”) and being acceptable to the general run of creditors (“merits consideration by the company’s creditors”). I should add that in both situations, the court should at that stage, refrain from undertaking a vote count, restricting itself to making a broad assessment as to the feasibility of the compromise and its acceptability to the creditors (seePacific Andesat [65]). In this regard, when analysing the support from the creditors, the quality of the support is important. Section 211B(4)(a) speaks to that by expressly linking the importance of the creditor support to the success of the rehabilitation efforts. Accordingly, if significant or crucial creditors were supportive, that would be a material consideration. That perhaps explained the requirements for the applicant to furnish a list of all secured creditors (see s 211B(4)(c)) and twenty of the largest unsecured creditors (see s 211B(4)(d)) so that the court could properly weigh the support and the explanation of the importance of that support provided by the applicant. This was of relevance in the context of IMSPL, which I explain below at [61]. Applying the test to the present facts 59 In the instant case, IM Skaugen had shown that its secured creditors, Nordea and Swedbank as well as its unsecured creditors, namely the bondholders and Gasmar, had either given letters of support or at least indicated that they had no objections to the moratorium. These four creditors were the largest creditors of IM Skaugen in value. It would hence seem indisputable that there was a reasonable prospect that the compromise would work and be acceptable to the general run of its creditors. Similarly, for SMIPL, its creditors Gasmar and Nordea had indicated that they had no objections to the moratorium, and it appeared from the brief details furnished of the intended compromise that there was equally a reasonable prospect that the scheme would work and be acceptable to the general run of creditors. Notably, in the case of both IM Skaugen and SMIPL, there was no creditor opposition to their applications. 60 The point of contention that remained was thus IMSPL. MAN argued that IMSPL had not and could not provide evidence of creditor support within the meaning of s 211B(4)(a)as it had not and could not furnish evidence of support from its majority creditor MAN.This argument was inextricably tied to MAN’s assertions that allowing the IMS Group to pursue its restructuring efforts would be futile, since any such compromise or arrangement proposed would need to obtain the requisite approval of IMSPL’s creditors, and MAN as IMSPL’s main creditor would certainly vote down any such compromise or arrangement. To my mind, this objection was not sustainable in the circumstances, as it was simply premature to consider MAN’s opposition as being fatal to any intended compromise at this stage. Weighing the relative importance of different creditors 61 But before I explain why, it is worth pointing out that MAN’s submission was undermined by the fact that it was not, it would appear, in actual fact the majority creditor of IMSPL. Entities from the Teekay Group had also made various demands against IMSPL, in claims of between US$16m and US$25m each and amounting to almost US$100m in total. If these claims were well substantiated, they would render these various entities legitimate creditors of IMSPL, each with a bigger debt than MAN. 62 Further, it was crucial to note that Nordea was also a creditor of IMSPL as IMSPL was a guarantor of Somargas’s liabilities to Nordea pursuant to a guarantee entered into on 12 April 2013. IMSPL’s liabilities to Nordea under this guarantee had crystallised as the amounts outstanding had fallen due and payable on 6 April 2018, and Nordea had sent a letter dated 10 April 2018 to IMSPL reserving its rights. The total debt owed to Nordea was in the sum of around US$34.4m, which dwarfed the debt owed to MAN of around €2m. Not only did this to a large extent put paid to MAN’s point that it was the majority creditor of IMSPL, it must further be noted that Nordea was also the largest creditor of the IMS Group, and that Nordea raised no objection to the moratorium and the group restructuring efforts. For this reason alone, it seemed that there was basis to conclude that IMSPL had satisfied s 211B(4)(a). 63 There is a further point that is worth making on the issue of creditor support, a point that is particularly relevant in the context of a group restructuring efforts. Typically, in a group restructuring, there are individual plans formulated by the entities within the group that are seeking to restructure collectively. The individual plans are necessitated by the separate legal identity of each entity and therefore its community of creditors. However, each of these plans is interrelated and interdependent, and fold into a group restructuring plan. As I noted earlier, this reflects the economic integration of the group. Thus, the success of the group restructuring efforts is contingent on approval being obtained for each plan that is a constituent part of the group restructuring plan. Indeed, s 211C recognises this by making available moratorium relief to related companies of the applicant – subsidiaries, holding company or ultimate holding company – if those companies play a necessary and integral role in the compromise of the applicant (see s 211C(2)(c)). As such, when the court makes the broad assessment as to whether there is a reasonable prospect of the compromise working and being acceptable to the general run of creditors for the purpose of a s 211B(1) application, the court cannot ignore and indeed must pay heed to the overall support of the creditors for the group restructuring efforts, of which the compromise, proposed or intended, is a part. Indeed, that is the very assessment the creditors themselves will make when they decide whether they should support the compromise. Without the support of key creditors of the group for the group restructuring efforts, it is questionable that there is a reasonable prospect: (a) of the plan workingiebeing carried through in terms of the commercial assumptions being realistic or feasible; and (b) the plan being acceptable to the general run of the creditors. Thus, by throwing their support behind an individual plan, the creditors are implicitly supportive of the group restructuring efforts and plan in so far as the individual plans are intertwined. I would emphasise that it is the quality of the support that is most important here. If the biggest creditors of the group as a whole are behind the group restructuring efforts, that does point to the conclusion that the efforts have a reasonable prospect of working and being acceptable to the creditors. Of course, it must not be forgotten that the key requirement remains that of support from the applicant’s own creditors as stipulated in s 211B(4)(a). But that does not mean that in weighing creditor support for the purpose of s 211B(4)(a) and the resistance that the applicant faces, the court should not have regard to support for the overall group restructuring efforts by the group’s principal creditors. 64 This assumed relevance in the context of the IMSPL. As noted earlier, Nordea, Swedbank, the bondholders and Gasmar were the biggest creditors of the IMS Group. In particular, it should be recalled that Nordea and Swedbank were secured creditors of the revenue-generating assets of the IMS Group. They were either supportive of or not objecting to the moratorium and the group restructuring efforts. This spoke to the sustainability of the restructuring efforts. Whether opposition by a major creditor is fatal to an application under s 211B(1) 65 I now explain why it was premature of consider whether MAN’s objection to the moratorium was fatal. My observations inPacific Andeswere relevant and apposite to this issue. In that case, the application for moratorium relief under s 210(10) was opposed by creditors who collectively held more than 25% of the debt owed by the applicant. The creditors argued that due to their opposition, the scheme would never receive the approval of the requisite majority of creditors at a scheme meeting, and as such it would be futile to grant a moratorium under s 210(10). In support of their argument, the creditors relied on the case ofRe Ng Huat, which held that a court in determining whether to convene a scheme meeting, should consider whether there is a realistic prospect of approval of the requisite majority of creditors both in terms of value and numbers. InPacific Andes,I declined to extend that requirement to an application under s 210(10) for the following reasons (at [70]): ... I do not believe that it would be appropriate or indeed correct to applyRe Ng Huatto a s 210(10) application. It seems self-evident that if the plan that is before the Court for the purpose of a s 210(10) application is liable to or capable of evolution and change because it is nascent and subject to discussion and negotiation, taking a straw poll of creditors at that stage would not be justified.Conchubar(at [12]) has warned against this, suggesting that a close scrutiny of the likely acceptance of the plan by creditors ought to be avoided when the Court makes the broad assessment. It is a matter of common logic that as the plan evolves, creditors are prone to change their position based on their commercial motivations. Indeed, I note that one creditor, UOB, has changed its position from unequivocal opposition to neutrality. Accordingly, to make an assessment of creditor support at the stage of a s 210(10) application is premature. If close scrutiny of the likelihood of a proposed scheme obtaining the requisite creditor support for a s 210(10) application was premature, it was difficult to see why a different analysis would apply for the purpose of s 211B(4)(a) in the First and Second Scenarios. As I have noted inPacific Andes, a clear line should be drawn between the assessment made for the purpose of granting the moratorium under s 210(10) and the assessment made when deciding whether a scheme meeting should be called under s 210(1). The issue of futility as described inRe Ng Huatassumes far greater relevance in the latter case. The same line has been drawn in the statutory construct of s 211B(1). Like the application for a moratorium under s 210(10), as read by the cases, there is no requirement for a s 211B(1) application to be coupled with an application under s 210(1) for a scheme meeting to be called. It suffices that an undertaking to file an application under s 210(1) is given as part of the application under s 211B(1). The statutory focus at the point of application is whether the prerequisites for the Automatic Stay and the continuation of the moratorium have been met. That being the case, it seemed evident the relevant question that the court should ask, for the purpose of s 211B(4)(a), was not whether it would be futile to extend the moratorium, but whether there was sufficient support for the restructuring efforts to warrant the continuation of the moratorium. As I noted inPacificAndes(at [65]), while creditor opposition is relevant, that must be weighed in the face of the significance of the creditor support. 66 There is a further point that must be made. While MAN was a creditor of IMSPL, and a major one, which could potentially withhold its approval for any compromise or arrangement proposed by IMSPL and as such steamroll its restructuring efforts, there was no certainty that this state of affairs would remain down the line. Indeed, MAN’s opposition might not necessarily prove to be an insurmountable obstacle that would render any attempt at restructuring futile. Again, my observations inPacific Andes(at [70], quoted above at [65]), in relation to the change of a major creditor’s position from unequivocal opposition to neutrality, were pertinent. 67 In other words, as the plan evolved, the circumstances including the creditors’ seemingly entrenched positions might change. Resistance of creditors might be neutralised in various ways. In this case, it was conceivable that MAN’s interest in IMSPL might be bought out by a white knight investor, other substantial creditors or debt funds in order to ensure that the group restructuring efforts were not scuppered, or for MAN to otherwise cease being a creditor of IMSPL, such as if the Award were to be set aside or if IM Skaugen succeeded in the claims against MAN that had been assigned to it by IMSPL and SMIPL. In short, the die was not cast or certainly did not take shape until the court considered the application under s 210(1). 68 Hence, I was of the view that MAN’s opposition to the moratorium was not necessarily fatal to the application under s 211B(1), and that the appropriate test remained that of whether on a broad assessment, there was sufficient evidence for the court to determine that there was a reasonable prospect of the compromise or arrangement working and being acceptable to the general run of creditors. On a broad assessment, there was sufficient evidence before me to suggest that the intended compromise or arrangement had a reasonable prospect of working and being acceptable to the general run of creditors.",
        "Thebona fidesissue": "69 I move now to the last substantive issue for determination namely, whether the applications were broughtbonafide.The parties were agreed that an application brought under s 211B must be broughtbona fide, notwithstanding the silence of the statute on this issue. The requirement that an application bebona fidewas made clear in relation to applications under s 210(10) even though that provision similarly makes no such stipulation (seeConchubarat [14], which I endorsed inPacific Andesat [59]–[61]) and I agreed that having such a requirement for s 211B(1) applications was consistent with the purpose of the statute and the general interest of the court in preventing abuses of process. In fact, the requirement that applications be broughtbona fideis even more justified in the case of applications under s 211B(1), given the enhanced scope of moratorium thereunder and the fact that application triggers the Automatic Stay. 70 As is often the case in such types of assessment, whether or not an application is boughtbona fidewill ultimately be a multifactorial assessment conducted in the particular context of each case. In this regard, MAN had cited various US authorities pertaining to the assessment of good faith in Chapter 11 petitions for bankruptcy protection. The observations from those cases would appear to be equally applicable to applications under s 211B(1). For instance, the court when faced with a Chapter 11 application should ensure that the applicant had “an honest intent and genuine desire … to use the statutory process to effect a plan of reorganisation” (In re Metropolitan Realty Co433 F 2d 676 (5th Cir, 1970) at 678), and that the real purpose of the application was not “to hold the debtor in its present status for the purpose of restraining, delaying and hindering its creditors and to escape from proceedings in other courts” (Southern Land Title Corporation v Mitchell375 F 2d 874 (5th Cir, 1967) at 877). 71 As summarised above at [22]–[23], MAN’s main contention that IMSPL’s application in OS 657 was notbona fideappeared to rest on two grounds; first, that IMSPL was a mere shell or a mere litigation vehicle with no operating business to resuscitate; secondly, that the timing of the application suggested that it was an collateral attack on and a further attempt to delay enforcement of the Award. 72 It seemed correct as a matter of principle to say that in determining whether an applicant was motivated by a genuine desire to restructure its business, a court should have regard to factors such as whether the applicant had “real debt and real creditors”, and also whether the timing of the application was such as to suggest that the applicant was simply trying to buy time (Furness v Lilienfield35 BR 1006 (D Md, 1983) at 1012). These are important but perhaps not conclusive factors. 73 Whereas IMSPL did not appear to have any substantial operating business or tangible assets, it must be kept in mind that it was part of the larger IMS Group, which did have both. It is not out of the ordinary for a business group to structure itself such that its operating business is carried on by one entity while other entities serve various investment or litigation purposes, and such arrangements do not necessarily detract from the genuine desire of the business group as a whole to restructure in times of financial distress, nor does it reduce the necessity for each entity of the group to be granted some relief from its creditors in order to advance the restructuring efforts of the business group as a whole. As such, I did not think that the mere fact of IMSPL not having any active business or tangible assets sufficed to show that the application was brought in bad faith. 74 Similarly, I did not find that the timing of the application in this case was such as to cast doubt on the sincerity of IMSPL or of the IMS Group to undertake restructuring efforts. Even though the application was filed shortly after the dismissal of SUM 3315 which sought to refuse the enforcement of the Award, the evidence before me was that the IMS Group had for some time sought to restructure its business and had taken concrete steps in this regard, such as by engaging financial advisers and seeking support from creditors. This was not a case of an application being filed as a last-ditch attempt to prevent enforcement of an arbitral award when all other avenues of legal recourse had been exhausted. The timing of the application should simply be understood on the basis that it was necessary after the dismissal of SUM 3315 for the applicants to seek immediate relief against the enforcement of any debt that would seriously undermine any ongoing restructuring efforts. It is not uncommon for an applicant mired in a compulsory winding-up application to file an application under s 211B(1) to stave off a winding-up order. It surely cannot be said that that in and of itself made the application notbona fide. 75 Further, I should add that if the restructuring efforts of the IMS Group were notbona fideand were a mere delaying or litigation tactic, it seemed unlikely that it would have obtained any support from significant creditors of the IMS Group, as it was certainly in the creditors’ interest to only supportbonafideattempts at restructuring. Yet, MAN was the only creditor who had raised any objection to the moratorium or questioned thebona fidesof the applications. 76 Hence, based on the evidence before me, I had no reason to believe that the application was not broughtbona fide. In any case, if there were any genuine concerns about the integrity of a particular application, one way to alleviate these concerns would be for the court to impose conditions on the moratorium pursuant to s 211B(5)(a), a point which I return to at [91] below.",
        "The scope of the moratorium": "77 There were some disagreements between the parties and some clarifications sought in relation to the scope of the moratorium under s 211B(1) if granted. I make some tentative observations. Whether the moratorium extended to arbitrations 78 The first issue pertained to whether a s 211B(1) moratorium would apply to stay current and future arbitrations involving the applicants, or whether it would be restricted only to in-court litigations. In this regard, the answer might be ascertained from the decision of the Court of Appeal inElectro Magnetic (S) Ltd (under judicial management) v Development Bank of Singapore Ltd[1994] 1 SLR(R) 574, which interpreted the comparable moratorium provision in s 227C(c) and s 227D(4)(c)inthe context of companies under judicial management. The Court of Appeal in holding that “proceedings” did not extend to the exercise of a right of set-off, opined as follows (at [18]): In our opinion, the word “proceedings” connotes a process initiated whether in court or by way of arbitration or a step in such process. 79 In finding as such, the Court of Appeal also endorsed the dicta of Sir Nicholas Browne-Wilkinson VC (as he then was) inBristol Airport Plc v Powdrill[1990] 2 All ER 493 at 765, that “the natural meaning of the words ‘no other proceedings … may be commenced or continued’ is that the proceedings in question are either legal proceedings or quasi-legal proceedings such as arbitration”. I saw no reason to deviate from this interpretation of “proceedings” in the present case simply because we were concerned with a scheme of arrangement rather than a judicial management. Hence, the moratorium under s 211B(1) would also stay the arbitration proceedings against the applicants. Whether the moratorium extended to OS 731 and SUM 2612 80 There was also some disagreement between the parties as to the extent to which the moratorium would affect the case in OS 731 and specifically SUM 2612. To recap, OS 731 was brought by MAN against IMSPL to enforce the Award. IMSPL then brought SUM 3315 to seek that the enforcement of the Award be refused or alternatively that enforcement be stayed pending the application to set aside the Award before the Danish courts. SUM 3315 was dismissed, and IMSPL then brought SUM 2612, after its application for the moratorium in OS 675, for leave to appeal against the dismissal of SUM 3315. 81 The applicants took the position that since OS 731 had been commenced by MAN against IMSPL, it was a proceeding “against” IMSPL that would be stayed by virtue of s 211B(1)(c), and SUM 2612 being an application within the wider proceedings in OS 731 would naturally also be stayed even though it was broughtbyIMSPL and notagainstIMSPL. MAN on the other hand, took the position that since a moratorium was meant to shield the debtor company from proceedings by creditors which might usurp the debtor’s resources, it should not be extended to applications such as SUM 2612 which were pursued by the debtor company for its own benefit, and where the creditor’s position was merely defensive rather than to seek any further substantive relief against the debtor. 82 The parties both relied on the same authorities from the US pertaining to the applicability of automatic stays against appeals filed by the debtor against decisions in cases originally commenced against the debtor. InAssoc of St Croix Condominium Owners v St Croix Hotel Corp682 F 2d 446 (3rd Cir, 1982) (“St Croix”), the United States Court of Appeals (3rd Circuit) considered that s 362 of the US Bankruptcy Code should be read to stay all appeals in proceedings originally brought against the debtor, regardless of whether the debtor was the one who brought the appeal. A similar result was reached in the case ofIn re Capgro Leasing Associates169 BR 305 (ED NY, 1994) (“In re Capgro”), where the court held that no party to an action initiated against the debtor may appeal absent relief from the automatic stay. 83 I was of the opinion that the position taken in the US authorities above was the correct one and should be similarly adopted in relation to moratoria under s 211B, be it for the Automatic Stay or for the extended moratorium under s 211B(1). Firstly, although the moratorium is primarily for the benefit of the debtor in enabling it to pursue its restructuring efforts without the constant threat of litigation, it also protects the interests of creditors generally by precluding certain creditors from acting unilaterally in self-interest to obtain payment from a debtor to the detriment of other creditors (St Croixat 448). Since the moratorium is not for the sole benefit of the debtor, a debtor who has been granted a moratorium should not be entitled to unilaterally waive the applicability of the moratorium by commencing an appeal (In re Capgroat 310). Secondly, if a moratorium were to extend only to appeals filed against the debtor but not appeals filed by the debtor, an uncomfortable situation would arise in caseswhere cross-appeals were filed both by and against the debtor, which was the situation inSt Croix. In other words, adopting the position that a moratorium applied in equal measure to appeals filed by and against a debtor in a case where initial proceedings were commenced against the debtor, at least where leave of the court had not been obtained, accorded with pragmatic sense. 84 In the present case, although the moratorium sought would ordinarily extend to OS 731 and SUM 2612 according to the principles above, I was of the opinion that a carve-out for IMSPL and MAN to pursue those actions would be appropriate. This was in part because MAN’s status as a creditor of IMSPL and its involvement in subsequent restructuring efforts would depend to a large extent on the outcome of OS 731 and SUM 2612. Effect of the moratorium 85 As noted earlier (see [39] above), the new s 211B(5)(b) allowed a moratorium to be expressed to apply to any act of any person in Singapore or within the jurisdiction of the court, whether the act took place in Singapore or elsewhere. Given the international nature of the business of the IMS Group, and the fact that it faced various arbitrations and court proceedings in other countries, limiting any moratorium to proceedings commenced in Singapore would not provide much assistance at all to the IMS Group’s restructuring efforts. I was hence of the view that the moratorium should be extended to court proceedings and arbitrations seated outside Singapore. 86 Having said that, I was also of the opinion that the court should not make an omnibus order under s 211B(5)(b). That this was so seemed clear from the language of s 211B(5)(b) itself and the recommendation in the Restructuring Report. Section 211B(5)(b) stipulates that the moratoriummay be expressedto apply to “any act” of any person whether “the act” took place in Singapore or elsewhere. The section is clearly targeted at restraining specific conduct or a specific party. This interpretation is also consistent with the recommendation in the Restructuring Report (at para 3.14) (see above at [39]) that the moratorium is akin to an anti-suit injunction which again restrains specific conduct. Accordingly, the moratorium pursuant to s 211B(1), if extended on application under s 211B(5)(b), must be with respect to a specific act or acts of a specific party who is in Singapore or within the jurisdiction of the court. 87 I hence ordered that the moratorium in the present case should be extended, pursuant to s 211B(5)(b), to stay the arbitration and court proceedings commenced in England by entities of the Teekay Group against the applicants, specifically, arbitration and court proceedings commenced against IM Skaugen and SMIPL as spelt out in Schedule 1 to the court orders in OS 673 and 674. 88 I note lastly that counsel for the Teekay Group informed at the hearing before me that they had no instructions to concede that the entities within the Teekay Group to which the orders related were subject to the jurisdiction of the court. As this issue was not argued, I declined to make any observations in this regard, save as to note that the order was made with the proviso that the Teekay entities were at liberty to apply for any order or direction as may be necessary to set aside the order on the basis that they were not to subject to the jurisdiction of the court. I did however remark that having participated in the hearing and having made submissions on whether the moratorium relief ought to be extended to the entities from the Teekay Group without any reservation of position, it seemed odd for this point to have been made late in the day. There was of course the question of whether participating in this manner amounted to submission to jurisdiction by these entities. These are points of significance which will have to be developed and decided at the appropriate time and in the appropriate case. Length of the moratorium 89 The applicants sought a moratorium of six months inclusive of Automatic Stay. However, given that IMSPL and SMIPL had not proposed a compromise, and IM Skaugen’s proposed compromise required a fair degree of maturation, I took the view that six months was too long. I took on board the applicants’ concern that anything less than six months would make it difficult for them to formulate a comprehensive plan. However, I was cognisant that the restructuring efforts had been underway since 2017 and IM Skaugen had already proposed a compromise to its creditors. I was also cognisant of the fact that the applicants were debtors in possession and the court should manage the restructuring efforts as a carefully calibrated and narrowly circumscribed exercise, with tight judicial oversight. 90 In the circumstances, I was of the opinion that a three-month moratorium was appropriate. Conditions attached to the moratorium 91 A scheme of arrangement being a debtor-in-possession regime also meant that the court must closely scrutinise the restructuring efforts to ensure that the right balance between the competing interests of the debtor and its creditors are struck. I had previously expressed the view inPacific Andesthat there was nothing in the language of s 210(10) that restricted the court’s power to grant the moratorium thereunder subject to terms as it deemed fit (at [61]): … This is a necessary adjunct of the power under s 210(10) as s 210 is a debtor-in-possession regime. The Court is able to ensure that he debtor is making abona fideeffort at restructuring by making such orders as it thinks appropriate to ensure close scrutiny of such effort. These could include – as a condition to the grant of a moratorium – directing an application under s 210(1) to be filed by a certain date, requiring regular disclosure of information to the court and creditors, providing regular updates to the Court on the status of the restructuring plan and of satellite proceedings in other jurisdictions, and where relevant, the formation of creditor committees, and the appointment of a court representative (at the applicant’s cost) to oversee and report to the Court and the creditors on the restructuring efforts. In addition, case management techniques such as cases docketed to judges and case managing the proceedings through regular and frequent case management conferences increase the depth of scrutiny. The debtor is kept on a fairly tight leash, particularly where there is a s 210(10) application without a s 210(1) application. 92 In this regard, s 211B(6) now mandates such judicial scrutiny, by requiring the court to order the applicants to submit sufficient information relating to the company’s financial affairs to enable the creditors to assess the feasibility of the intended or proposed compromise or arrangement, and lists four non-exhaustive examples of the type of financial information that the court may order to be submitted. I hence made orders for the applicants to furnish financial information as at [4] above. 93 I should emphasise that the court is empowered to couple the moratorium with such terms and conditions as it feels is necessary to give the moratorium greater efficacy. Apart from the requirements for disclosure of information or for frequent updates on the restructuring attempts to be provided to the court, there could in the appropriate case be an additional requirement for the appointment, at the debtor’s or creditor’s costs, of a monitoring accountant or a Chief Restructuring Officer (“CRO”) who would be answerable to the court and directed to report to the creditors. Such a role could be filled by an external party such as, for example, a member from the panel of well-qualified insolvency mediators maintained by the Singapore Mediation Centre. This would be one way of assuaging creditors’ concern that the debtor applicant was not being adequately policed while it remained in possession. Further, it could be particularly valuable in the context of a complex restructuring involving a group of companies. The monitoring accountant or CRO could in such a case help exercise oversight over the entire restructuring process of the constituent entities of the group, to ensure that the restructuring is carried out in a cohesive and comprehensive manner, and that the assets and cash are properly utilised and accounted for. The appointment of a monitoring accountant or CRO is of course one of many options open to the court. The point is that instead of pre-emptively stifling restructuring efforts entirely by disallowing a moratorium application, the trust deficit that arises from concerns over thebona fidesof the applicant could be addressed by the courts utilising a range of tools at their disposal to develop a pragmatic solution that strikes the right balance between facilitating genuine restructuring efforts and safeguarding the legitimate interest of creditors. 94 Another aspect, which surprisingly has not been resorted to by debtors and creditors, is to enlist the help of an experienced and skilled insolvency mediator to develop the restructuring plan, whether it be an individual or group restructuring plan. This was one of the recommendations of the Restructuring Committee (see para 3.54 of the Restructuring Report). Frequently, the discussions on the plan are partisan, and the positions adopted are therefore reflective of that. I see tremendous utility in deploying the services of a neutral third party skilled in mediation techniques, and with the relevant domain knowledge. Such a party can play the invaluable role of building consensus between the debtor and the creditors in the development of the restructuring plan, and build trust in the process. In this way, the mediator can assist to iron out many of the wrinkles and creases that frequently erupt in a restructuring and which perhaps are not best resolved in the adversarial cauldron of the court. It is important that this be explored with vigour, as it seems to me to be self-evident that bridging differences and the trust divide is fundamental to a successful restructuring outcome. While there is always a place for the jousting that is typical of an adversarial process, a more considered, constructive and measured approach in restructuring can often lead to better outcomes for all parties involved. One must not lose sight of the fact that the end objective of the process, after all, is to make a considered assessment of whether a feasible and acceptable economic solution to the financial problems of the debtor is possible, and if so, how that can be facilitated with the interests of the relevant stakeholders in mind. To this end, facilitating discussions between the debtor and creditors, secured and unsecured, and promoting a more cooperative, collaborative and transparent environment wherein all parties involved work towards a common objective of attaining an effective and sustainable restructuring, seems to be quite clearly the correct approach.",
        "Conclusion": "95 For the foregoing reasons, I granted the moratorium orders on the terms sought, with the amendments and additional conditions imposed as at [3]–[4] above. I also granted the application for Mr Morits Skaugen to be appointed as the applicants’ foreign representative.",
        "Post-script": "96 There have been certain developments in the parties’ dealings, after the hearing for the present applications and before the release of these grounds for decision, that I shall briefly address here for completeness. 97 On 20 September 2018, which was shortly before the expiry of the three-month moratorium from the date of the orders which arose out of the present applications, the applicants filed affidavits to inform that they would not be able to seek an extension of the orders granted on 28 June 2018, as recent events have made it impossible for the IMS Group to implement the restructuring or refinancing plan in the NewCo model. In gist, this was as a result of the demands made by Nordea and the lenders it represented, in relation to the outstanding debt of some US$34.4m. Nordea’s debt was secured by mortgages over vessels held by Somargas which were integral to the NewCo plan, and its debt was owed or guaranteed by the applicants. According to the applicants, their financial adviser Borrelli Walsh Pte Ltd (“BW”) approached Nordea the day after the grant of the moratorium orders in this case to commence negotiations, but Nordea refused to be involved in any negotiations that involved BW. Nordea also refused to accept any extension of the loan tenure, and insisted that IM Skaugen continued to service the interest payments, which IM Skaugen was unable to do. Nordea maintained nonetheless that it was open to negotiations. After several months of silence and without forewarning, Nordea then issued on 15 August 2018 a notice of enforcement of account charge and demanded repayment of US$34.9m plus interest with immediate effect. Further correspondence and attempted negotiations ensued, but with no success. In addition, Nordea sent a letter on 31 August 2018 instructing Somargas and IM Skaugen not to conclude any charterparty for the Somargas vessels without prior consent of Nordea, and to procure the Somargas vessels to sail to Gibraltar and Singapore. This prevented the applicants from utilising the Somargas vessels for other revenue-generating endeavours, and also affected their negotiations with other business partners. In the circumstances, the applicants considered that it was no longer feasible for them to proceed with the restructuring. 98 On 4 October 2018, Norgas Carriers Pte Ltd (“Norgas”), which was at the time of this hearing part of the IMS Group, filed the application in CWU 236 to wind up IMSPL, and to appoint Mr Jason Kardachi of BW as liquidator. MAN filed an affidavit in response to the application, stating that whilst it did not object to the winding-up order being made in principle, it had concerns as to Norgas’ standing as a purported creditor of IMSPL and to the appointment of Norgas’ nominee as liquidator. After hearing CWU 236 on 16 November 2018, I granted the winding-up order on the terms sought by Norgas, save that I agreed to appoint Mr Bob Yap Cheng Ghee, Mr Wong Pheng Cheong Martin and Ms Toh Ai Ling of Messrs KPMG Services Pte Ltd, who were MAN’s nominees, as the liquidators in place of Norgas’ nominee Mr Kardachi. 99 The bulk of the issues raised by MAN in CWU 236 were not of relevance to the present applications and I need not deal with them here. However, MAN took issue with IMSPL’s portrayal of Nordea’s behaviour subsequent to the moratorium orders as avolte face, and claimed that Nordea had in fact steadily objected to the proposed restructuring even before the hearing of the present applications. Specifically, MAN pointed out that Nordea had sent a letter to the applicants prior to the hearing for the present applications, requiring the applicants to undertake not to cause, support or pass any application or resolution that would include or affect any security or undertaking of Nordea, without Nordea’s express prior written approval. According to MAN, this foreshadowed that Nordea would initiate enforcement of its security rights following the present applications, and that disclosure of this information at the hearing would have made it clear that the moratorium applications were futile. 100 To the extent that the above letter of undertaking was not placed before me at the hearing for the present applications, I did not and could not have taken account of its contents. That being said, I do not believe in any case that it would have affected my decision. Firstly, it appeared that the applicants were willing to sign the undertaking required by Nordea, albeit on slightly different terms, and it was plausible that in such circumstances Nordea would have taken a neutral stance in relation to the moratorium applications. Secondly and more importantly, counsel for the applicants had informed me during the hearing that Nordea had no objections to the moratorium. Nordea was also represented at the hearing by counsel, who did not correct this assertion. As such, as far as the facts before the court during the hearing were concerned, there was nothing to indicate that Nordea was unsupportive of the moratorium or the restructuring efforts. Kannan RameshJudge Balakrishnan Ashok Kumar, Tay Kang-Rui Darius, Lee Lieyong Sean and Koh Wei Lun (BlackOak LLC) (instructed counsel) / Lauren Tang (Virtus Law LLP) (instructing counsel) for the applicants;Ong Tun Wei Danny, Yam Wern-Jhien and Tay Shi Ing (Rajah & Tann Singapore LLP) for Man Energy Solutions SE; David Chan, Zhang Yiting and Daryl Fong (Shook Lin & Bok LLP) for Zhonghua Hull No 451 LLC, DHJS Hull 2007-001 LLC, DHJS Hull 2007-002 LLC, Taizhou Hull No WZL 0501 LLC, Taizhou Hull No WZL 0502 LLC, Taizhou Hull No WZL 0503 LLC and Teekay Group; Tan Hui Tsing (Gurbani & Co.) for Gasmar AS; Alexander Yeo (Allen & Gledhill LLP) for Nordea Bank Finland plc, Singapore branch; Cassandra Goh (Allen & Gledhill LLP) for Alameda Shipping Company Pte Ltd, Conception Shipping Company Pte Ltd, Innovation Shipping Company Pte Ltd, Orinda Shipping Company Pte Ltd and Shasta Shipping Company Pte Ltd; and Daniel Tan (WongPartnership LLP) for IM Skaugen Nordic Trustees Bondholders.",
        "": "",
        "Annex A: IMS Group chart": ""
    }
}