{
    "case_title": "Public Prosecutor vS K Murugan Subrawmanian",
    "ncitation": "[2018] SGHC 71",
    "coram": "Foo Chee Hock JC",
    "sections": {
        "Background facts": "3 On 6 January 2015, at about 12.15pm, a party of Central Narcotics Bureau (“CNB”) officers conducted a drug bust operation at the vicinity of Greenwich Drive.2Foot Note 2×Ee Guo Dong’s statement in Agreed Bundle at p 122 (paras 2 and 3); Chin Chee Hua’s statement in Agreed Bundle at p 129 (paras 2 and 3).There, the CNB officers spotted a cargo trailer bearing registration number JNX 4481 (“Cargo Trailer”). They saw a male subject wearing a red polo t-shirt and black pants (“Hisham”) board the Cargo Trailer via the front passenger side door at about 12.47pm.3Foot Note 3×Ee Guo Dong’s statement in Agreed Bundle at p 123 (paras 5 and 7); Chin Chee Hua’s statement in Agreed Bundle at p 129 (para 4).After a while, Hisham alighted from the Cargo Trailer and was seen carrying a blue plastic bag.4Foot Note 4×Ee Guo Dong’s statement in Agreed Bundle at p 123 (paras 5–6); Chin Chee Hua’s statement in Agreed Bundle at p 129 (para 4).The Cargo Trailer then drove away.5Foot Note 5×Dadly Bin Osman’s statement in Agreed Bundle at p 140 (para 7). 4 Thereafter, at about 12.55pm, the CNB officers proceeded to arrest Hisham. With Hisham in tow, the CNB officers found the blue plastic bag on top of some wooden pallets.6Foot Note 6×Ee Guo Dong’s statement in Agreed Bundle at p 123 (paras 7 and 8); Chin Chee Hua’s statement in Agreed Bundle at p 130 (paras 4 and 5).Within the blue plastic bag were five bundles wrapped in black tape (“Five Bundles”).7Foot Note 7×Ee Guo Dong’s statement in Agreed Bundle at p 124 (para 9); Chin Chee Hua’s statement in Agreed Bundle at p 130 (para 6).Shortly thereafter, at about 1.10pm, Hisham displayed signs of discomfort and shortness of breath. He was conveyed by ambulance to Changi General Hospital, and was subsequently pronounced dead at about 2.03pm.8Foot Note 8×Ee Guo Dong’s statement in Agreed Bundle at p 124 (paras 10–11); Chin Chee Hua’s statement in Agreed Bundle at p 131 (paras 7–8). 5 At about the same time, another party of CNB officers followed the Cargo Trailer to Prima Tower along Keppel Road.9Foot Note 9×Dadly Bin Osman’s statement in Agreed Bundle at p 140 (para 7).The driver of the Cargo Trailer was ascertained to be the accused, who was arrested in the toilet near Prima Tower’s security post.10Foot Note 10×Dadly Bin Osman’s statement in Agreed Bundle at p 140 (para 8).A search was conducted on the Cargo Trailer, and two plastic bags were recovered from behind the driver seat: (i) one black plastic bag containing two bundles of cash collectively amounting to S$8,650, and (ii) one red plastic bag containing S$13,000.11Foot Note 11×Dadly Bin Osman’s statement in Agreed Bundle at p 140 (para 9). 6 The Five Bundles in the blue plastic bag were later analysed by the Health Sciences Authority,12Foot Note 12×Certificates from the Health Sciences Authority (Exhibits “P56”-“P60”) in Agreed Bundle at pp 285–289.and they were found to collectively contain not less than 66.27 grams of diamorphine.13Foot Note 13×Prosecution’s WS (Main Trial) at para 9(g).",
        "The Charge": "7 The Prosecution brought the Charge against the accused in respect of the Five Bundles. The elements of the offence of trafficking in a controlled drug under s 5(1)(a) of the MDA were: (i) possession of a controlled drug, (ii) knowledge of the nature of the drug, (iii) proof that possession of the drug was for the purpose of trafficking which was not authorised (MuhammadRidzuan bin Md Ali v Public Prosecutor and other matters[2014] 3 SLR 721 at [59]). In the course of the trial, an ancillary hearing was also held to determine the admissibility of some of the accused’s statements for reasons that will be elaborated below. 8 A pillar of the Prosecution’s case was the accused’s statements (“P78”–“P84”)14Foot Note 14×Prosecution’s Supplementary Bundle.recorded under s 22 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”) (“Long Statements”).15Foot Note 15×Prosecution’s WS (Main Trial) at paras 10–24.The Long Statements showed that the accused had received the Five Bundles from one “Kumar” in Malaysia. The accused then hid the Five Bundles in the Cargo Trailer before driving to Singapore. And upon reaching Singapore, the accused met up with Hisham at Greenwich Drive, where Hisham handed the accused S$13,000 in exchange for the Five Bundles.16Foot Note 16×Prosecution’s WS (Main Trial) at paras 4–5. 9 At this juncture, I noted that the Prosecution also sought to rely on the surveillance evidence of the CNB officers to show that Hisham collected the Five Bundles from the accused in the Cargo Trailer.17Foot Note 17×Prosecution’s WS (Main Trial) at paras 39–46.The Defence pointed out that18Foot Note 18×Defence’s WS (Main Trial) at paras 37 and 43.none of the CNB officers could be certain that Hisham was not in possession of the Five Bundles when he boarded the Cargo Trailer.19Foot Note 19×Transcript (20 Sep 2017) at p 25 (lines 24–27); Transcript (21 Sep 2017) at pp 26 (line 6) to 27 (line 11).Therefore, I found that on the evidence of the CNB officers alone, the Prosecution failed to prove that the CNB officers saw Hisham board the Cargo Trailer without the Five Bundles.",
        "Accused’s statements": "10 In his contemporaneous (“P67”) and cautioned (“P77”) statements, the accused denied that he had given Hisham the Five Bundles. He stated that he had merely collected S$13,000 from Hisham, and that he had only provided the blue plastic bag to Hisham.20Foot Note 20×Contemporaneous statement (Exhibit P67) in Agreed Bundle at pp 277–278; Cautioned statement (Exhibit P77) in Agreed Bundle at p 73. 11 However, his Long Statements painted a vastly different picture. Sometime around Christmas in 2014, the accused met up with Kumar. The accused needed money to pay for his children’s school fees, and Kumar offered to pay the accused RM1,000 for every bundle of “porul”21Foot Note 21×Prosecution’s Supplementary Bundle at paras 6 and 69; Transcript (30 Jan 2018) at p 37 (lines 21–29).that he delivered to Singapore.22Foot Note 22×Prosecution’s Supplementary Bundle at para 9.Porulisa street name for heroin, of which diamorphine is a known active ingredient.23Foot Note 23×Prosecution’s WS (Main Trial) at para 1.The accused agreed, and thereafter helped Kumar to bringporulinto Singapore from Malaysia on a number of occasions prior to the incident that led to his arrest on 6 January 2015.24Foot Note 24×Prosecution’s Supplementary Bundle at paras 10–11. 12 On 6 January 2015, at about 6.00am, the accused drove the Cargo Trailer to deliver prefabricated concrete walls to a company located at Sungei Kadut Street 5, Singapore.25Foot Note 25×Prosecution’s Supplementary Bundle at para 13.While he was driving to the Johore Cargo Customs, he received a call from Kumar, who arranged to meet the accused.26Foot Note 26×Prosecution’s Supplementary Bundle at para 13.A while later, Kumar met up with the accused and boarded the passenger side of the Cargo Trailer.27Foot Note 27×Prosecution’s Supplementary Bundle at paras 14–15.Kumar was carrying a black plastic bag containing the Five Bundles. Kumar then instructed the accused to deliver the Five Bundles to a person at Greenwich Drive, Singapore, to collect an unspecified amount of money from the same person,28Foot Note 28×Prosecution’s Supplementary Bundle at para 15.and to call Kumar after that was done.29Foot Note 29×Prosecution’s Supplementary Bundle at para 15.The accused was also instructed to collect money from somebody else at Woodlands.30Foot Note 30×Prosecution’s Supplementary Bundle at para 15. 13 The accused then travelled into Singapore. At about 11.00am, he delivered the concrete walls at Sungei Kadut Street 5.31Foot Note 31×Prosecution’s Supplementary Bundle at para 17.Thereafter, the accused drove to Turf Club Avenue,32Foot Note 32×Transcript (20 Sep 2017) at p 43 (lines 3–24); Dadly Bin Osman’s statement in Agreed Bundle at p 139 (para 5).where he collected money from one “Pirakashkon”.33Foot Note 33×Prosecution’s Supplementary Bundle at para 19.The accused then left for Greenwich Drive before calling Hisham to inform the latter that he was reaching the destination.34Foot Note 34×Prosecution’s Supplementary Bundle at para 20. 14 Hisham came to the front passenger seat and passed the accused several bundles of money.35Foot Note 35×Prosecution’s Supplementary Bundle at para 20.The accused told Hisham that the Five Bundles were in a black plastic bag under the front passenger seat. As Hisham was retrieving the plastic bag, it tore slightly.36Foot Note 36×Prosecution’s Supplementary Bundle at para 21.The accused handed Hisham a blue plastic bag, which Hisham then transferred the Five Bundles into. Hisham threw away the empty black plastic bag onto the ground before closing the passenger door.37Foot Note 37×Prosecution’s Supplementary Bundle at para 21. 15 The accused then left Greenwich Drive for Keppel Road where he was to collect animal feed from Prima Flour Mills.38Foot Note 38×Prosecution’s Supplementary Bundle at para 21.As he was reaching Prima Flour Mills, he received a call from Kumar, who advised the accused to be careful of the authorities.39Foot Note 39×Prosecution’s Supplementary Bundle at para 23.After the call, the accused became more alert as he drove to his destination. Upon reaching Prima Flour Mills, he alighted from the Cargo Trailer to go to the toilet.40Foot Note 40×Prosecution’s Supplementary Bundle at para 23.There, he was arrested by a number of CNB officers.41Foot Note 41×Prosecution’s Supplementary Bundle at para 24.",
        "Admissibility of the statements": "16 The Defence submitted that the accused’s Long Statements were inadmissible under s 258(3) of the CPC. The Defence contended that the statements were given involuntarily and were induced by the recorder.42Foot Note 42×Defence’s WS (Ancillary Hearing) at paras 40–64.First, Investigation Officer Shafiq Basheer (“IO Basheer”) told the accused that he would be allowed to make a phone call once the statements had been recorded.43Foot Note 43×Defence’s WS (Ancillary Hearing) at paras 43–49.Second, IO Basheer represented to the accused that the Cargo Trailer had been returned to the accused’s employers after the accused had requested for the lorry to be returned, thereby gaining the accused’s trust.44Foot Note 44×Defence’s WS (Ancillary Hearing) at paras 50–53.Third, the accused asked IO Basheer to bring Hisham before him to be questioned, and IO Basheer said, “You admit first. You admit first, then I will bring him.”45Foot Note 45×Transcript (29 Jan 2018) at p 88 (lines 23–25). 17 The Defence also argued that the Long Statements ought to be excluded because they were taken under oppressive circumstances where the recorder, IO Basheer, refused to record the accused’s denials of having committed the offence.46Foot Note 46×Defence’s WS (Ancillary Hearing) at paras 34–39.At trial, much was also made about the statement taking process being so lengthy as to impugn its integrity.47Foot Note 47×Transcript (2 Feb 2018) at pp 24 (lines 1–5), 140 (lines 3–10), and 141 (lines 22–26). 18 The Defence further sought to invoke the court’s discretion to exclude the Long Statements on the basis that their prejudicial effect exceeded their probative value. It essentially did so on the basis that the accused allegedly suffered from mild intellectual disability and interrogative suggestibility, which put him at risk of giving false confessions.48Foot Note 48×Defence’s WS (Ancillary Hearing) at paras 82–157. 19 At the conclusion of the ancillary hearing to determine the admissibility of the Long Statements, I held that they were admissible. I found that the accused was not suffering from mild intellectual disability or interrogative suggestibility, and there was also no room for me to exercise my discretion to exclude the Long Statements on the basis that their prejudicial effect exceeded their probative value. In my judgment, the Prosecution had proved beyond a reasonable doubt that the Long Statements were given voluntarily in the absence of oppression, and without any threat, inducement or promise (“TIP”) within the meaning of s 258 of the CPC.",
        "Accused’s credibility": "20 After observing the accused and reflecting on his testimony in the light of the entire evidence, I found that the accused was an untrustworthy and unreliable witness in the ancillary hearing. Here, it must be highlighted that the accused selectively claimed thatonlythe inculpatory portions were untrue and involuntarily fabricated, while other parts of his Long Statements were voluntarily given and true in fact.49Foot Note 49×Prosecution’s WS (Ancillary Hearing) at paras 49–50; See alsoeg,Transcripts (30 Jan 2018) at pp 17 (lines 3–13), 26 (lines 26–30); 27 (lines 26–31); 29 (lines 4–8); 32 (lines 1–10); 36 (lines 22–27); 37 (lines 20–21); 38 (lines 4–8); 39 (lines 1–4); 41 (lines 25–30); 42 (lines 10–12); 51 (lines 8–11); 61 (lines 23–24); and 62 (lines 15–20).I found this hard to believe. The account in the statements as to how the Five Bundles were obtained, concealed and delivered in his Cargo Trailer were highly detailed and textured. His narrative includedinter aliahow and where he had received the Five Bundles from Kumar, how the black plastic bag tore as Hisham retrieved them, the blue plastic bag that he had given to Hisham into which Hisham transferred the Five Bundles, and how this transaction was the last of the occasions where he had worked with Kumar. In my view, the parts regarding the Five Bundles fit in snugly with the other parts of the Long Statements which he claimed were true. This militated heavily against the accused’s contention that he had fabricated the parts about the Five Bundles. 21 I also noted that the accused was inconsistent in his evidence. On the stand, he claimed that IO Basheer was the one who taught him the words “Ice,porulandganja”,50Foot Note 50×Transcript (30 Jan 2018) at p 9 (lines 18–19).and that he was completely unaware that it was illegal to bring drugs into Singapore.51Foot Note 51×Transcript (30 Jan 2018) at p 44 (lines 19–21).But in the Long Statements, he stated that he had initially rejected Kumar’s offer to bringporulinto Singapore because he knew that it was illegal to do so.52Foot Note 52×Prosecution’s Supplementary Bundle at para 4; Transcript (30 Jan 2018) at p 45 (lines 4–6).Moreover, in his cautioned statement, wherein he claimed that Hisham was the one who brought the Five Bundles into the Cargo Trailer, he stated that “[i]mmediately on seeing the items [he] told [Hisham] to alight from [his] lorry”. This suggested that he must have known that trafficking in drugs was illegal in Singapore, which contradicted his testimony that he was unaware that trafficking was an offence. 22 Further, as the Prosecution argued,53Foot Note 53×Prosecution’s WS (Main Trial) at para 51.the accused had made inconsistent statements about the offence to the doctors who assessed his mental state. For example, in his account to Dr Jaydip Sarkar (“Dr Sarkar”), he claimed that aChinese manhad instructed him to collect money in Singapore.54Foot Note 54×Sarkar’s report at p 2.He also claimed that the Chinese man was importing fruits from New Zealand.55Foot Note 55×Transcript (8 Feb 2018) at p 72 (lines 23–28).But in his account to Dr Patricia Yap (“Dr Yap”) and Dr Jacob Rajesh (“Dr Rajesh”),56Foot Note 56×Yap’s report at p 2; Rajesh’s report at p 6.he said that it wasKumarwho had instructed him. And he told Dr Rajesh that the money he had collected was being used to invest in shares and in an investment scheme.57Foot Note 57×Rajesh’s report at p 6.These inconsistencies demonstrated to me that the accused’s credibility was suspect.",
        "Accused’s mental capacity": "23 I now examine the question of whether the accused suffered from mild intellectual disability and interrogative suggestibility such that I ought to exercise my discretion to exclude the Long Statements.",
        "Defence’s experts": "24 The Defence sought to rely on the medical reports and views of the following experts:58Foot Note 58×Defence’s WS (Ancillary Hearing) at para 85.(i) Dr Bruce Frumkin (“Dr Frumkin”), a clinical and forensic psychologist;59Foot Note 59×Transcript (2 Feb 2018) at p 3 (lines 23–24).(ii) Dr Rajesh, a senior consultant psychiatrist with the Winslow Clinic;60Foot Note 60×Transcript (5 Feb 2018) at p 3 (lines 8–9).and (iii) Dr Rebecca Giess (“Dr Giess”), a clinical psychologist with the Winslow Clinic.61Foot Note 61×Transcript (6 Feb 2018) at p 2 (lines 10–12).All three defence experts were of the view that the accused suffered from an intellectual disability. I summarise here their respective reports: (a) Dr Frumkin observed that the accused had “great difficulty understanding and expressing himself”.62Foot Note 62×Frumkin’s report at p 5.The accused appeared to Dr Frumkin as someone who was suffering from significant intellectual deficiency, and it was noted that the accused was an “extremely poor historian”63Foot Note 63×Frumkin’s report at p 2.whose “immediate, short-term, and long-term memories were impaired”.64Foot Note 64×Frumkin’s report at p 5.Dr Frumkin also administered a number of cognitive assessment tests on the accused, and concluded that the accused suffered from “both an intellectual disability and a mental disorder”.65Foot Note 65×Frumkin’s report at p 9.He further reported that the accused had a “high degree of interrogative suggestibility”, which meant that there was a high risk that the accused would confess to things that he might not have committed.66Foot Note 66×Frumkin’s report at p 9. (b) Dr Rajesh noted that during his assessment, the accused took a long time to answer questions and had difficulty comprehending questions. The accused was also assessed as having difficulty remembering dates and significant events.67Foot Note 67×Rajesh’s report at p 8.In Dr Rajesh’s view, the results from the tests administered by Dr Giess showed that he was suffering from an intellectual disability.68Foot Note 68×Rajesh’s report at p 9.Further, he opined that the accused suffered from an “abnormality of mind” that “substantially impaired his mental responsibility for his actions amounting to the alleged offence”.69Foot Note 69×Rajesh’s report at p 10.Dr Rajesh also observed that an MRI scan of the accused’s brain revealed a condition called “leukoaraiosis”, which suggested that the accused had a “cognitive impairment”.70Foot Note 70×Rajesh’s report at pp 10-11.However, Dr Rajesh accepted that he was not an expert in leukoaraiosis, which fell more properly in the domain of a neurologist.71Foot Note 71×Rajesh’s report at p 11. (c) Dr Giess administered a number of cognitive tests on the accused, and she reported that the results “indicate significant impairments in his intellectual and adaptive functioning, suggestive of an intellectual disability”.72Foot Note 72×Giess’s report at p 7.At this juncture, I pause to note that Dr Rajesh’s conclusions on the accused’s intellectual ability were partly based on the results from the tests administered by Dr Giess.",
        "Prosecution’s experts": "25 In rebuttal, the Prosecution relied on the following experts:73Foot Note 73×Prosecution’s WS (Ancillary Hearing) at para 6.(i) Dr Sarkar, a consultant psychiatrist with the Institute of Mental Health (“IMH”);74Foot Note 74×Transcript (8 Feb 2018) at p 17 (lines 20–23).(ii) Dr Yap, a principal clinical psychologist at the IMH;75Foot Note 75×Transcript (6 Feb 2018) at p 63 (lines 31–33).and (iii) Dr Tan Tiong Yong (“Dr Tan”), a radiologist with Changi General Hospital.76Foot Note 76×Transcript (8 Feb 2018) at p 2 (lines 9–11).The Prosecution’s experts disclosed a wholly different profile of the accused. I briefly set out their views as follows: (a) In Dr Sarkar’s report, the accused was reported as having struggled to comprehend questions, and took a long time to provide answers. However, “his speech was relevant even though a little bit disjointed”. Further, Dr Sarkar observed “no abnormalities of thought, perception or cognition”.77Foot Note 77×Sarkar’s report at p 3.He also reported that the accused “was not suffering from any mental disorder or intellectual disability at the time of alleged offence”.78Foot Note 78×Sarkar’s report at p 3.And although the accused had claimed that he suffered from memory problems, Dr Sarkar reported that the accused’s “self-reported memory impairment is not borne out in clinical reviews or psychometric testing”.79Foot Note 79×Sarkar’s report at p 3. (b) Dr Yap administered a number of psychiatric tests on the accused, noting that “regardless of the length of the session, his attention and concentration was reasonable”.80Foot Note 80×Yap’s report at p 3.She also noted that the accused could understand instructions without extra explanation.81Foot Note 81×Yap’s report at p 3.His expressive language skills were also reportedly good, with the interpreter being able to understand him easily. Dr Yap concluded that based on the tests for cognitive and adaptive functioning, the accused’s intellectual functioning was “highly variable and spans the Mildly Intellectually Disabled to Above Average ranges”.82Foot Note 82×Yap’s report at p 8.But she observed that while the accused was illiterate and had slow processing speed, he did not satisfy the criteria for intellectual disability because his cognitive and adaptive functioning was “at a low average to above average level”.83Foot Note 83×Yap’s report at p 8. (c) Dr Tan’s report noted that the accused was suffering from leukoaraiosis, and the abnormality indicator in the report was stated as “Known/Minor”.84Foot Note 84×Tan’s report at p 2.At trial, Dr Tan explained that this meant that the scan revealed certain changes in the accused’s brain. But such changes were considered minor,85Foot Note 85×Transcript (8 Feb 2018) at p 4 (lines 12–13).and “should not lead to cognitive impairment”.86Foot Note 86×Transcript (8 Feb 2018) at p 4 (lines 14–17).",
        "My decision on the accused’s mental condition": "26 After carefully considering the views of both sides’ experts in the light of the totality of the evidence, I found that the accused was not suffering from an intellectual disability such that the veracity of his Long Statements was in doubt or that he had an abnormality of mind. 27 First, I noted that Dr Frumkin’s and Dr Giess’s evaluations of the accused were aided by an uncertified Tamil interpreter, Ms Nithya Devi (“Ms Devi”), who was working as a legal intern in the Defence’s law firm at the material time.87Foot Note 87×Transcript (2 Feb 2018) at pp 40 (line 27) to 41 (line 9); Transcript (6 Feb 2018) at p 17 (lines 3–9).In my view, this impugned the accuracy of Dr Frumkin’s report. In his own words, such a practice ought to be avoided because “[attorney staff] may consciously orunconsciouslymisinterpret statements in a more positive light for the individual’s legal case” [emphasis added].88Foot Note 88×Tab F of Prosecution’s Supplementary Bundle II at p 6.It was therefore surprising that Dr Frumkin had failed to take the elementary precaution of utilising a certified interpreter that would have immunised his tests from such problems arising from the use of a non-certified interpreter with a potential conflict of interest. 28 Putting aside the question of bias (conscious or otherwise), there was also the question of language and subject matter competency. I acknowledged Ms Devi’s high proficiency in the Tamil language.89Foot Note 89×Defence’s WS for Main Trial at paras 109–115.But as Dr Yap and Dr Sarkar both testified, the translation of cognitive tests was an exercise that required substantial expertise.90Foot Note 90×Transcript (6 Feb 2018) at pp 39 (lines 26–29) and 64 (lines 10–26); Transcript (8 Feb 2018) at p 38 (lines 10–19).While this was not determinative of the issue, the unfortunate choice of an interpreter was a factor to be considered in assessing the expert evidence. I found that the reliability of Dr Frumkin’s and Dr Giess’s reports was tempered because this fundamental requirement was not followed. That said, no questions were raised at trial as to the interpreters assisting the Prosecution’s experts. 29 Second, by his own admission, Dr Frumkin’s report was limited by the inherent cultural biases in some of the tests that were administered to the accused.91Foot Note 91×Frumkin’s report at p 6.For example, to assess the accused’s interrogative suggestibility using a test called the Gudjonsson Suggestibility Scale (“GSS”), Dr Frumkin related a story to the accused about a British woman who went on holiday in Spain. He then tested the accused by asking leading and misleading questions about the story.92Foot Note 92×Frumkin’s report at p 8.Based on this test, Dr Frumkin concluded that the accused had a “high degree of interrogative suggestibility”.93Foot Note 93×Frumkin’s report at p 9.However, as Dr Sarkar pointed out firmly, the test was simply not “culturally fair”.94Foot Note 94×Transcript (8 Feb 2018) at p 40 (lines 9–11).Such cultural limitations were also alluded to in Dr Frumkin’s own evidence that there was an objection against the GSS being used in America because norms from the United Kingdom were being applied.95Foot Note 95×Transcript (2 Feb 2018) at p 171 (lines 21–26).And yet it was applied to the accused, who was an illiterate “Tamil man from JB”.96Foot Note 96×Transcript (8 Feb 2018) at p 41 (line 2).It was hence unsurprising to me that the accused performed poorly in a test where he was expected to recollect details about a story concerning a culture that he was unacquainted with. 30 At this juncture, I noted that the Defence submitted that the cultural limitations of the GSS were not squarely put to Dr Frumkin in cross-examination, and that this was in contravention of the rule inBrowne v Dunn(1893) 6 R 67 (“Browne v Dunn”).97Foot Note 97×Defence’s WS (Ancillary Hearing) at para 145.I disagreed, and was careful to rely only on evidence that had been put to the witnesses. As noted inHong Leong Singapore Finance Ltd v United Overseas Bank Ltd[2007] 1 SLR(R) 292 at [42], the rule was one of fairness, and was not a “rigid, technical rule”. And it was clear from the Prosecution’s cross-examination of Dr Frumkin that the cultural limitations of the tests that he had administered to the accused were squarely put in issue.98Foot Note 98×Seeeg, Transcript (2 Feb 2018) at pp 36 (lines 21–29) and 54 (line 31).Accordingly, I did not think that the Defence’s reliance on the rule inBrowne v Dunnbrought it very far in this respect. 31 Third, Dr Frumkin appeared to have been selective about the test scores in assessing the accused. For example, in his report, Dr Fumkin stated that he did not take into account the results from a test called the Gudjonsson Compliance Scale (“GCS”), in which the accused scored well:99Foot Note 99×Frumkin’s report at p 7. An attempt was made to administer the GCS test, a test designed to measure compliance. Because of the problem inadequately interpreting the statementson the test from English to Tamil and Mr. Murugan’s inability to understand many of the 20 statements presented (many of the items had to be repeated several times),I am putting no weight on his higher than average Compliance score of 12 (75% range). [emphasis added] No satisfactory explanation was offered as to why the results of the GCS were rejected whereas the results of the GSS were accepted when the GCS (which measured compliance)100Foot Note 100×Transcript (2 Feb 2018) at p 71 (lines 1–5).was the logical counterpart to the GSS (which measured suggestibility).101Foot Note 101×Transcript (2 Feb 2018) at p 71 (lines 25–28).Moreover, the problem of adequately translating the test from English to Tamil must have applied to both the GSS and the GCS, and the decision to disregard the GCS raised serious questions about Dr Frumkin’s selectivity and objectivity, and in particular on the suggestibility issue. 32 Fourth, I did not think that the leukoaraiosis found in the accused’s brain proved that he was suffering from intellectual disability. To begin with, Dr Rajesh conceded that he was not an expert in leukoaraiosis, and that he based his views on “literature search and the informal consultation with two neurologists”.102Foot Note 102×Transcript (5 Feb 2018) at p 22 (lines 6–8).Moreover, it was both Dr Tan’s and Dr Sarkar’s evidence that the leukoaraiosis in the accused was not to such an extent as to warrant concern. Dr Tan testified unequivocally that it was not unusual for someone of the accused’s age to suffer from minor leukoaraiosis,103Foot Note 103×Transcript (8 Feb 2018) at pp 9 (lines 1-9) and 11 (lines 11–18).which was a view that was consistent with Dr Sarkar’s evidence that incidences of leukoaraiosis were common in middle-aged men.104Foot Note 104×Transcript (8 Feb 2018) at p 37 (lines 1–6).Dr Sarkar was totally confident that the presence of leukoaraiosis was a red herring when he said anecdotally that one in three of his patients would have such a condition.105Foot Note 105×Transcript (8 Feb 2018) at p 37 (lines 1–6).On this issue, I was firmly of the view that the accused was not suffering from any abnormality of mind. 33 Fifth, in relation to the test results obtained by Dr Yap and Dr Giess, I acknowledged the Defence’s criticism of Dr Yap’s methodology.106Foot Note 106×Defence’s WS for Ancillary Hearing at paras 128–138.However, in the round, I found Dr Yap’s report to be more persuasive. Putting aside the fact that Dr Giess used Ms Devi as a Tamil interpreter,107Foot Note 107×Transcript (6 Feb 2018) at p 17 (lines 3–9).I noted that Dr Giess had asked the accused’s wife to score the accused on his adaptive functioning ability as part of the assessment of the accused.108Foot Note 108×Transcript (6 Feb 2018) at p 28 (lines 6–11).The wife scored the accused poorly, but this was a result that was fraught with problems. Not only did Dr Giess concede that the accused’s wife had toguesson a number of questions,109Foot Note 109×Transcript (6 Feb 2018) at p 29 (lines 1–28).it must be remembered that Dr Frumkin noted in his report that the accused’s wife was anunreliablehistorian.110Foot Note 110×Frumkin’s report at p 2. 34 In this respect, I found that the accused’s wife was also an unreliable witness. On the stand, she was obviously desirous of giving evidence to assist her husband (see [54] below). And it was evident to her that by the time Dr Giess interviewed her the accused needed expert evidence to support his case. For example, she conceded at trial that the accused had many friends whom she did not know about. It was also clear from her testimony that she was unclear about many aspects of the accused’s work.111Foot Note 111×Transcript (14 Feb 2018) at p 21 (lines 22–24).These limitations would have affected the accused’s wife’s ability to properly assess the accused’s adaptive functioning,112Foot Note 112×Transcript (14 Feb 2018) at p 9 (lines 3–5).and it seemed that Dr Giess was oblivious to these considerations when she accepted the wife’s account in good faith as part of her assessment of the accused. 35 Further, Dr Giess accepted that her finding of the accused having had cognitive difficulties when he was younger was basedsolelyon his educational history.113Foot Note 113×Transcript (6 Feb 2018) at p 24 (lines 5–6).But as Dr Sarkar noted, the accused was raised in a family that was illiterate, and his poor educational history must be viewed in the context of him being raised in a family that did not prize education and studies.114Foot Note 114×Transcript (8 Feb 2018) at pp 30 (lines 4–6) and 60 (lines 6–13).For these reasons, I preferred Dr Yap’s views over Dr Giess’ findings. 36 Sixth, Dr Frumkin testified at trial that an assessment of intellectual disability required one to look at how a person functioned in the real world.115Foot Note 115×Transcript (2 Feb 2018) at p 101 (lines 10–13).This evidence was consistent with Dr Sarkar’s opinion that psychological testing was not the “sine qua nonof making a diagnosis of intellectual disability”. There also had to be comprehensive clinical assessment and feedback from people who knew the accused.116Foot Note 116×Transcript (8 Feb 2018) at p 32 (lines 4–9).In other words, whether a person was intellectually disabled was a question that I had to answer against the ascertained facts of his everyday functioning. 37 In this regard, it was undisputed that the accused had a wife, with whom he raised five children. It was also undisputed that he was capable of driving a large vehicle through customs, and to deal with money matters. Indeed, it was his case that he was tasked to collect large sums of money from Hisham and Pirakashkon. Taken together with the medical reports examined above, the picture that emerged was not of a person who was suffering from intellectual disability; it was of a person who was “careful”, “cautious”, and “worldly-wise”.117Foot Note 117×Transcript (8 Feb 2018) at pp 30 (lines 17–18), 35 (lines 12–13), and 71 (lines 5–11).As Dr Sarkar highlighted:118Foot Note 118×Transcript (8 Feb 2018) at pp 31 (line 9) to 32 (line 2). [W]e come to the practical domain; conceptual, social, practical.As I said, he can shop. He can navigate. He can count money. He is trusted with large sums of money. … [T]here is nothing in his practical abilities, day-to-day abilities which shows that he is performing at a very low.… You cannot come from JB wherever he starts from – to all the different places in Singapore where he drops off his loads and then picks up from other places without having a mental map and that requires memory. You need to remember where you have been before, in order to get there again, otherwise you would get lost.So, psychological testing at best try to replicate what happens from the outside world for testing, but it’s not a substitute for testing. It’s like, like I say,the map is not the [territory]. [emphasis added] 38 Further, in stressing that the accused was not intellectually disabled, Dr Sarkar pointed out a number of germane factors.119Foot Note 119×Transcript (8 Feb 2018) at pp 89–91.First, there was a wide discrepancy in how the accused presented himself to people in his everyday life and the Defence’s experts. Second, the memory problems reported by the accused and his wife were not supported by evidence of impairments, and were inconsistent with him being able to do his job. Third, there were no behavioural problems observed in the accused while he was in prison. Fourth, his alleged mental and memory problems were not obvious to anyone and only came to the fore after he had been arrested.120Foot Note 120×Transcript (8 Feb 2018) at p 31 (lines 2–3). 39 Moreover, in preferring Dr Sarkar’s clinical assessment over those of Dr Rajesh and Dr Frumkin, I had reflected on the accused’s demeanour and evidence on the stand. Of course, I was by no means doing a clinical assessment, but I could not ignore the manner in which he gave evidence and the substance of his evidence. Dr Sarkar’s clinical assessment of the accused and grounds of his professional opinion resonated most with my observations and analysis. In my view, Dr Sarkar had applied his real world experience, professional expertise and common sense in amply justifying his assessment of the “territory” without being bound by the “map” (see quotation at [37] above). 40 Crucially, the accused’sselectionof portions of the statements that were not true showed his “mental dexterity” and acute appreciation of the situation.121Foot Note 121×Transcript (2 Feb 2018) at p 152 (lines 1–11).It also showed that he was not suffering from the extent of intellectual impairment that the Defence sought to portray. And if it were the case that he had indeed fabricated the parts of his statements concerning the Five Bundles, such a feat would have necessitated mental dexterity that the accused allegedly did not have.122Foot Note 122×Transcript (2 Feb 2018) at p 152 (lines 1–11).It was true that he was illiterate, and certain environments, such as psychological testing, fell well outside his comfort zone.123Foot Note 123×Transcript (8 Feb 2018) at p 31 (lines 15–22).But Dr Sarkar was prepared to stand by his professional judgment that the accused was malingering in his tests.124Foot Note 124×Transcript (8 Feb 2018) at p 91 (lines 7–12).It was also clear to me thatat the time of the offence, the accused knew what he was doing, could distinguish right from wrong,  and was in control of his impulses. To quote Dr Sarkar:125Foot Note 125×Transcript (8 Feb 2018) at p 36 (lines 1–27). And can he control his impulses? Again, answer is yes. So there is no cognitive impairment. … I do not believe that there was any cognitive impairment that was relevant to the issue at hand. [The accused] may be a little slow in processing things, as Dr Patricia Yap says. He may be a little variable in his memory, Dr Geiss [sic]says. He certainly isn’t as unreliable as Dr Frumkin made him out to be, but none of that, those are relevant to the issue. Those are sort of testing, trying to pick something up. At the time, at the material time, in my opinion, he was intact andcompos mentisas we say. 41 I therefore agreed with the Prosecution that his attempt to impugn the veracity of his statements stemmed from his realisation that Hisham had passed on and could not testify against him.126Foot Note 126×Transcript (30 Jan 2018) at p 66 (lines 10–13).",
        "Inducement and oppression": "42 Having established that the accused was neither suffering from an intellectual disability nor interrogative suggestibility, I move on to examine whether there was any inducement or oppression that rendered his Long Statements inadmissible. 43 The test for whether a statement was admissible had two parts. First, whether the confession was made as a consequence of any TIP. Second, did the accused make the confession in circumstances that led him to reasonably suppose that he would gain some advantage for himself or avoid some evil of a temporal nature? Further, there was an objective and subjective component in determining whether there was any TIP (Sharombin Ahmad and another v Public Prosecutor[2000] 2 SLR(R) 541 at [46]): The question of whether a statement is voluntary is essentially a question of fact and the test of voluntariness is both objective and subjective. The query of whether there is an inducement, threat or promise is objectively determined while the question of whether such inducement, threat or promise has operated on the mind of the accused must be subjectively answered from the perspective of the particular accused... 44 On the facts, I did not find that any of the alleged inducements were made out. With regard to the allegations in relation to the phone call and the Cargo Trailer, IO Basheer maintained that the accused did not ask for a phone call,127Foot Note 127×Transcript (29 Jan 2018) at p 37 (lines 2–29).and that he did not inform the accused that the Cargo Trailer had been returned to his employer.128Foot Note 128×Transcript (29 Jan 2018) at p 49 (lines 1–7). 45 In this vein, I noted that the interpreter, Mr V I Ramanathan (“Mr Ramanathan”) conceded on the stand that he did not remember precisely what had transpired on this issue during the recording of the statements.129Foot Note 129×Transcript (7 Feb 2018) at pp 82 (line 8) to 83 (line 3).Nevertheless, even if IO Basheer had indeed made the alleged representations about the phone call and the Cargo Trailer, I did not think that they could have objectively induced the accused to give the Long Statements. It defied belief that the accused, who was facing the death sentence, would have confessed to the offence for a mere phone call, no matter how important it was to him. Similarly for the allegation about the Cargo Trailer. If it were the Defence’s case that the accused was told about its returnbeforethe Long Statements were recorded,130Foot Note 130×Defence’s WS (Ancillary Hearing) at paras 50–51.then it could not be said that the representationvis-à-visthe Cargo Trailer reasonably operated to induce the accused to confess. 46 I also found that there was no merit to the alleged representation that Hisham would be brought forward after the accused had confessed. IO Basheer was consistent in his evidence that he did not inform the accused that Hisham had been arrested,131Foot Note 131×Transcript (29 Jan 2018) at p 70 (lines 28–31).and he stated that he refrained from doing so as part of his “investigation technique”.132Foot Note 132×Transcript (29 Jan 2018) at p 69 (lines 9–14).More importantly, as the Prosecution submitted,133Foot Note 133×Prosecution’s WS (Ancillary Hearing) at para 33.the accused’s allegation was intrinsically illogical. Not only was the accused unable to satisfactorily give a reason why Hisham would have exonerated him,134Foot Note 134×Transcript (30 Jan 2018) at p 5 (lines 2–24).there was no logic behind having Hisham brought forwardafterthe accused had already confessed to committing the offence. 47 I also did not find that the allegations of oppression were made out. As held inTeyTsun Hang v Public Prosecutor[2014] 2 SLR 1189 (“TeyTsun Hang”) at [113]: The litmus test for oppression is whether the investigation was, by its nature, duration or other attendant circumstances, such as to affect the accused’s mind and will such that he speaks when he otherwise would have remained silent. 48 I found that the Defence’s submission that IO Basheer had refused to record the accused’s denials was not borne out by the evidence. The only evidence that the accused’s proclamations of innocence were rejected came from the accused himself. And as I have indicated above at [20]–[21], I found that he was a self-serving and unreliable witness. In contrast, I did not find anything to support the Defence’s case that IO Basheer had suffered from “investigative bias”.135Foot Note 135×Transcript (29 Jan 2018) at p 31 (lines 18–20).From the accused’s cautioned statement, which was also recorded by IO Basheer, it was clear that IO Basheer was willing to record any denial of guilt from the accused. And he was resolute in maintaining that he did not refuse to record any proclamations of innocence from the accused during the taking of the Long Statements.136Foot Note 136×Transcript (29 Jan 2018) at p 51 (lines 16–26). 49 Further, as the Prosecution highlighted,137Foot Note 137×Prosecution’s WS (Ancillary Hearing) at paras 21(4) and 44.there were no allegations that the accused was fatigued or sleep-deprived throughout the recording of the Long Statements. The accused also did not allege that he was under any threat of physical assault. Thus, even if IO Basheer had initially refused to record a denial, it was inconceivable to me that the accused would give a false confession instead of remaining silent. Certainly, it was noteworthy that the accused was faced with the prospect of being sentenced todeath. The fact that the accused did not report any discomfort (beyond what was to be reasonably expected during the interviews) also led me to find in these circumstances that the length of the statement recording process could not have sapped his free will. 50 Accordingly, I found that the Long Statements were given voluntarily. In reaching my decision, I took into account the accused’s consistent admission throughout trial that the words in the seven statements were his own. He contested the truth of the Long Statements where they concerned the Five Bundles, and claimed that he had fabricated those facts.138Foot Note 138×Prosecution’s WS (Ancillary Hearing) at paras 49–50; See alsoeg,Transcripts (30 Jan 2018) at pp 17 (lines1–13), 26 (lines 26–30); 27 (lines 26–31); 29 (lines 4–8); 32 (lines 1–10); 36 (lines 22–27); 37 (lines 20–21); 38 (lines 4–8); 39 (lines 1–4); 41 (lines 25–30); 42 (lines 10–12); 51 (lines 8–11); 61 (lines 23–24); and 62 (lines 15–20).But the fundamental point remained that the words in the Long Statements came voluntarily from him. Taking a step back and assessing the evidence in its entirety, the ineluctable conclusion was that the accused was focussed and strategic in his defence and in his testimony, carefully denying the truth of the statements which dealt with the drugs while maintaining that the rest of his Long Statements (including the portions about collecting money for Kumar) were in fact true.",
        "Accuracy and reliability of the statements": "51 Having found that the Long Statements were admissible, the next question was theweightto be given to them. And notwithstanding the Defence’s attempt to cast shadows of doubt on the accuracy of the Long Statements, I found that there was no reason for me to give them less than full weight. 52 As a start, I noted the Defence’s argument that best practices were not followed when the Long Statements were recorded, with neither Mr Ramanathan nor IO Basheer taking down any notes of the exact questions posed to the accused (seeAzmanbin Mohamed Sanwan v Public Prosecutor[2012] SGCA 19 at [25]).139Foot Note 139×Transcript (29 Jan 2018) at p 54 (lines 2–6); and Transcript (7 Feb 2018) at p 79 (lines 1–26).This was regrettable and was not to be condoned. It also meant that the court had to scrutinise the evidence more carefully before coming to a conclusion. In my judgment, after assessing Mr Ramanathan’s testimony and also considering his 40 years’ experience as a court interpreter, I was prepared to say that Mr Ramanathan would have raised any irregularities to the court’s attention.140Foot Note 140×Transcript (7 Feb 2018) at p 43 (lines 13–15). 53 As part of its case that the accused was intellectually disabled, the Defence pointed out that the accused got his mother’s age, his children’s names, and the order of his children’s birthdates wrong in his Long Statements.141Foot Note 141×Defence’s WS (Ancillary Hearing) at para 74.But as I found on the relevant evidence above, the accused was not suffering from an intellectual disability. The accused’s mistakes also indicated that IO Basheer had recorded the accused’s words, warts and all, and had not authored any part of the Long Statements. Moreover, these mistakes, while elementary, did not fundamentally affect the overall veracity of the Long Statements. 54 At trial, the Defence also disputed the fact that the accused was in financial difficulties,142Foot Note 142×Transcript (14 Feb 2018) at p 28 (lines 28–30).and that therefore the accused had no reason to help Kumar deliver drugs to Singapore. But as I had observed above, the evidence of the accused’s wife was interested and therefore unreliable, in that in her own way, she was trying to assist the accused. I found that she could not justify her assertion that they had no financial problems as the numbers did not add up.143Foot Note 143×Transcript (14 Feb 2018) at p 23 (lines 8–10); Prosecution’s WS (Main Trial) at para 48.When pressed during cross-examination, she was forced to concede that they faced “a little bit” of financial difficulties before her son started working in December 2014 and early January 2015.144Foot Note 144×Transcript (14 Feb 2018) at p 25 (lines 6–9). 55 On this note, I also observed that the accused denied passing drugs to Pirakashkon in the Long Statements.145Foot Note 145×Prosecution’s Supplementary Bundle at para 42.This was at odds with Pirakashkon’s evidence on the stand that he had ordered “Erimin-5” pills from the accused, who passed him the pills on 6 January 2015.146Foot Note 146×Transcript (20 Sep 2017) at p 35 (lines 10–27).Curiously, this was also at odds with the accused’s own account of the offence to Dr Rajesh during his clinical assessment, which took placeafterPirakashkon had taken the stand. In Dr Rajesh’s report, it was noted that the accused admitted to passing a small bundle of “Disco medicines” to Pirakashkon.147Foot Note 147×Rajesh’s report at p 7.It was quite manifest thatafterhearing Pirakashkon’s evidence, the accused adopted a different line from his Long Statements, and took the position that he had given drugs to Pirakashkon and merely collected money from Hisham. In my view, this vacillation in the accused’s position in this regard was symptomatic of the accused’s penchant for being selective about the truth. On this note, I also took into account SSI Tony Ng’s evidence that the accused said that he had drugs upon being asked by the arresting officers whether he had anything.148Foot Note 148×Transcript (27 Sep 2017) at p 3 (lines 15–23).Albeit an oral statement, his utterance that he had “dada” with him was quite material in the context of the accused’s assertion that he was only collecting money for Kumar. It turned out that the Cargo Trailer did not contain any more drugs, but I nevertheless considered this as a factor in assessing the accused’s credibility. 56 My assessment that the Long Statements were true was underscored by the fact that the most material parts were corroborated by objective evidence. For example, the times at which the accused claimed to have received calls from Kumar and Hisham were consistent with his phone records.149Foot Note 149×Prosecution’s WS (Main Trial) at para 21.The evidence also showed that the S$13,000 collected by the accused from Hisham was consistent with the estimated market price of heroin at the material time, which was about S$2,300 to S$3,200 per pound.150Foot Note 150×Prosecution’s WS (Main Trial) at paras 29–30.",
        "Conviction": "57 At the close of the Prosecution’s case, I was satisfied that the Prosecution had made out a case against the accused under s 230(j) of the CPC. When the accused was called to give his evidence, he elected to remain silent.151Foot Note 151×Transcript (13 Feb 2018) at p 21 (lines 24–31). 58 In the circumstances, the accused’s silence suggested guilt. His Long Statements established that he was in possession of the Five Bundles, that he did actually know the nature of the drugs contained within the Five Bundles,152Foot Note 152×Prosecution’s Supplementary Bundle at paras 6 and 69; Transcript (30 Jan 2018) at p 37 (lines 21–29).and that he passed the Five Bundles to Hisham. In any event, the presumption under s 18(2) of the MDA raised by the Prosecution153Foot Note 153×Prosecution’s Opening Address at paras 14–15.effectively foreclosed any argument as to the accused’s knowledge of the nature of the drugs. These were facts that cried out for an explanation, and the accused’s refusal to take the stand pointed to the conclusion that he was guilty.154Foot Note 154×Prosecution’s WS (Main Trial) at para 37.I pause to note that in coming to a decision on the accused’s conviction, I was mindful that this was a capital charge. The adverse inference drawn from the accused’s silence added to the level of assurance that the totality of the evidence, minus the accused’s evidence in the main trial, had discharged the Prosecution’s burden of proof. I should add that I had assessed the accused’s evidence in the ancillary hearing regarding the admissibility of the Long Statements, which was permissible under s 279(5) of the CPC. Mindful of the rule against similar fact evidence, I was also careful to ensure that I did not take into account the accused’s admission that he had previously delivered drugs to Singapore in finding that he had delivered the Five Bundles to Hisham. 59 Finally, the Defence contended that the Prosecution had failed to challenge the accused’s evidence during the ancillary hearing that nothing could be placed under the Cargo Trailer’s passenger seat.155Foot Note 155×Defence’s WS (Main Trial) at para 78.However, I agreed with the Prosecution that this was an issue for the main trial, and the Prosecution could not be faulted for not challenging the accused, because he decided not to take the stand.156Foot Note 156×Prosecution’s Reply WS (Main Trial) at para 10(b).Similarly, the opportunity to put important aspects of the Prosecution’s case to the accused was forever lost. 60 On the morning of 1 March 2018 before I pronounced judgment, the accused made two applications. First, he applied to discharge his counsel. Second, he applied to give evidence in his own defence. Upon clarification, it appeared that the accused still had confidence in his counsel, and that the discharge application had more to do with the professionally uncomfortable position of his counsel caused by the change of position in the second application.157Foot Note 157×Transcript (1 Mar 2018) at pp 3 (line 28) to 4 (line 6).In that light, I declined to discharge the accused’s counsel, especially since there was no doubt that he could competently represent the accused till the end of the proceedings. 61 As for the accused’s change of mind to give evidence, I ascertained from him that the reason was that he “had made a mistake insofar as electing not to take the stand”.158Foot Note 158×Transcript (1 Mar 2018) at p 2 (lines 8–10).At his meeting with his counsel on 28 February 2018, the accused indicated that he did not have sufficient time to consider his decision as to whether to give evidence. It also turned out that the accused had written to his counsel on 19 February 2018 indicating that he wished to give evidence. That was five days after the completion of all the witnesses’ testimonies, including two Defence witnesses. But his counsel only received the letter on 22 February 2018, which was after the day I had directed written submissions to be filed (ie, 21 February 2018). 62 Indeed, the submissions of both parties were filed on the basis that (subject to exigencies) there would be no oral final submissions. The Defence’s written submissions were already filed via eLitigation at 1.39am on 22 February 2018; counsel could only meet the accused on 28 February 2018, one day before the hearing on 1 March 2018. In other words, by the time that the accused’s letter reached his counsel, the trial had been completed for all intents and purposes. 63 The Prosecution submitted that it was not possible for the accused to change his mind at the eleventh hour because s 230(1)(p) of the CPC mandated that the accused must take the stand before all other witnesses.159Foot Note 159×Transcripts (1 Mar 2018) at p 4 (lines 23–30).I did not think that there was a need to go so far. Even if it were discretionary for the court to permit the accused to change course, the accused gave no good reason for me to reopen the evidentiary phase of the trial when all the arguments had been placed before the court. Quite apart from the possibility of the accused tailoring his evidence to answer the shortcomings of the Defence witnesses, as well as the Prosecution’s arguments on the case, including those on the adverse inference to be drawn from his election to remain silent, the accused could not overcome the basic hurdles which were really safeguards to prevent abuse of the court’s process. 64 As amply demonstrated above, the accused put up a vigorous and substantive defence with counsel’s assistance. Before the accused made his election to remain silent, the Defence took extra precautions and the accused was given sufficient time to come to his decision. As a fact, the accused’s decision to remain silent was surprising and the possibility of a change of mind was contemplated. Hence, I had asked the accused numerous times whether he was certain that he would not give evidence in his defence.160Foot Note 160×Transcript (13 Feb 2018) at p 21 (lines 21–31); Transcript (14 Feb 2018) at p 1 (lines 4–28).The position was also explained to the accused in the terms of the standard allocution which made it abundantly clear that the accused’s silence may give rise to adverse inferences being drawn. I was thus satisfied after all the precautions were taken (including by Defence counsel) that the accused made a voluntary, informed and unequivocal “election” (s 230(1)(m) of the CPC) not to give evidence in his own defence. Indeed, he admitted that he had made the decision to remain silent with the benefit of legal advice.161Foot Note 161×Transcript (1 Mar 2018) at p 4 (lines 13–16).The accused also told me that there was no new development on which he could give evidence.162Foot Note 162×Transcript (1 Mar 2018) at p 4 (lines 17–21). 65 I was therefore drawn to the ineluctable conclusion that there was no operative mistake or misunderstanding that would invalidate the accused’s election. It was also clear beyond any doubt that the accused made the decision without requiring more time for consideration. 66 The present application was made without good reason or any valid ground, and struck me as nothing more than a tactical decision. In the circumstances, I refused the accused’s application to give evidence. 67 Upon consideration of the evidence and final submissions, including the Long Statements, the objective evidence and the evaluation of the accused’s credibility, I found the accused guilty and convicted him on the Charge.",
        "Sentence": "68 For the reasons above at [26]–[41], I found that the accused was not suffering from an abnormality of mind under s 33B(3)(b) of the MDA. I found that the accused’s involvement in the offence was that of a “courier” under s 33B(2)(a) of the MDA, but the Prosecution decided not to issue a certificate of substantive assistance under s 33B(2)(b). Accordingly, I imposed the sentence of death on the accused, which I was bound to do by law.  Foo Chee HockJudicial Commissioner April Phang, Tan Yanying and Rimplejit Kaur (Attorney-General’s Chambers) for the Prosecution;Thrumurgam s/o Ramapiram, A Sangeetha and Sherrie Han (Trident Law Corporation) for the accused."
    }
}