{
    "case_title": "ULA vUKZ",
    "ncitation": "[2018] SGHCF 19",
    "coram": "Tan Puay Boon JC",
    "sections": {
        "Introduction": "1 This case concerns a boy (“R”) born of the relationship between the appellant and the respondent (“the Mother” and “the Father” respectively), who have never been married to each other. R, who is nine years old, has lived with the Mother in Singapore for the past eight years. The Father lives in New Zealand with his wife and their two children. The Mother, who is unmarried, applied to the Family Court for permission for R to relocate to London with her. The Father opposed R’s relocation to London on various grounds, including that it would adversely affect his relationship with R by making it more difficult for him to spend time with and contact R. The District Judge refused the application and the Mother appealed. 2 The facts of this case are unlike most other relocation applications, where relocation would result in the physical separation of the child from the non-relocating parent. In this case, the Father and R have not lived in the same country for the past eight years. The parties were unable to find any authorities in which the non-relocating parent lived in a different country from the child. As will be seen, I considered this living arrangement significant in reaching my decision on the facts of this case. Having considered all the circumstances of the case, I take the view that relocation should be allowed, and therefore allow the Mother’s appeal. The reasons for my decision are set out herein.",
        "Facts": "3 The Mother is Singaporean and resides in Singapore, where she works in a senior position in the legal department of a subsidiary of a multinational company. The Father, who is an Irish citizen, lives with the woman he married and their two children in New Zealand. He is a consultant in a property development consultancy company and also the Chief Executive Officer of another property investment company there. 4 R was born in Australia in July 2009. Two months later, the Mother returned to Singapore with R. The Father remained in New Zealand but visited Singapore twice or thrice between September 2009 and January 2010.1Foot Note 1×Appellant’s Case at para 11; Record of Appeal (“ROA”) Vol 3, Tab 14, para 7; ROA Vol 2, Tab 8, para 7.In January 2010, the Mother and R returned to New Zealand and lived there with the Father until December 2010 (unbeknownst to the Father’s wife and other children, who were then in Ireland).2Foot Note 2×Appellant’s Case at para 12.In December 2010, the Mother and R moved to Singapore, where they have been living since.3Foot Note 3×Appellant’s Case at para 9; Respondent’s Case at para 8.Besides their cohabitation in 2010, the Father has always lived apart from the Mother and R. However, the parties continued their relationship, and the Father visited the Mother and R in Singapore at least once every three months. In 2012, the Mother informed the Father’s wife about her and R’s existence and their relationship to the Father. Until then, the Father had not told his wife about them.4Foot Note 4×Appellant’s Case at para 17. 5 In early 2016, the Mother and the Father discussed plans for the Mother and R to move to London. (The Father said the intention was for himalsoto move to London to be with them as a family unit, but the Mother disputed this.) However, these plans did not advance because the Mother’s company had no firm plans to place her overseas. In September 2016, the Mother ended her relationship with the Father.5Foot Note 5×Respondent’s Case at para 9.From November 2016 to April 2017, the Father had no access to R, though the parties gave conflicting accounts of why this was so.6Foot Note 6×Respondent’s Case at para 10. 6 On 13 March 2017, by way of Originating Summons (Family Justice Courts) No 53 of 2017 (“FC/OSG 53/2017”), the Father applied for joint custody of R, with care and control to the Mother and liberal access to the Father (amongst others).7Foot Note 7×ROA Vol 3, Tab 13.Contact between the Father and R was re-established in April 2017. On 14 June 2017, a consent order was recorded for the parties to have joint custody of R, with care and control to the Mother and liberal access to the Father (“the Consent Order”).8Foot Note 8×ROA Vol 2, Tab 8, pp 27–35.In essence, the Father was to have physical access to R on an average of once every six to eight weeks and half of the school holidays. He would also have physical access whenever the Mother was overseas for more than three days, and liberal phone/Skype access (“remote access”) at least thrice a week on Mondays, Wednesdays and Fridays from 4.30pm to 5.30 or 6pm.9Foot Note 9×Respondent’s Case at para 73.Also, Singapore was to be R’s habitual residence unless parties agreed or the Court ordered otherwise. 7 R presently attends an international school in Singapore. The Mother is his primary caregiver, although her work commitments sometimes prevent her from fetching R to and from his after-school activities. The Mother’s mother (ie, R’s maternal grandmother) and helper also help to look after R, including when the Mother is travelling. 8 The Mother claimed that in July 2017, about one month after the Consent Order was entered into, she was informed by her employer that the next step in her career with the company was for her to embark on an international assignment in London from 1 January 2018 to 31 December 2019, whilst holding her current position.10Foot Note 10×ROA Vol 2, Tab 8, para 25.She subsequently received an assignment letter from her employer dated 22 August 2017 containing “the general terms and conditions applicable” to her “global assignment to the United Kingdom” for a period of two years effective from 1 January 2018.11Foot Note 11×ROA Vol 2, Tab 8, p 36. 9 On 5 October 2017, the Mother applied to the Family Court by way of Summons (Family Justice Courts) No 3409 of 2017 pursuant to s 5 of the Guardianship of Infants Act (Cap 122, 1985 Rev Ed) for a variation of the Consent Order, amongst other things. In particular, she sought permission for R to relocate to London with her from December 2017, as well as amendments to the access arrangements recorded in the Consent Order. The District Judge refused the application for relocation on 11 December 2017 and gave the grounds of her decision on 23 March 2018 inUKZ v ULA[2018] SGFC 32 (“the GD”). 10 I now briefly outline the parties’ cases before summarising the reasons for the District Judge’s decision.",
        "The Mother’s case": "11 The Mother argued that, should she not relocate, her career path would stagnate. She would risk being overlooked for promotions, and might even be at risk of losing her job. Although she might be able to be re-employed, she would most likely suffer a pay cut. Moreover, if she remained employed in Singapore, her current work schedule would affect her health and she might burn out. Since her well-being and financial circumstances had a direct impact on R, any adverse impact on her career and health would likewise affect him negatively (the GD at [26]). 12 On the other hand, if she and R relocated to London, the Mother would be able to spend more quality time with him, which would benefit him. She would also hire nannies and housekeepers for support (the GD at [20]). The move would give R an opportunity to be closer to the Father’s family in Ireland and learn more about his European heritage (the GD at [21]). The Mother had also enrolled R in a London school which offered the International Baccalaureate Programme (“IB programme”) (like R’s Singapore school), had an after-school soccer programme and a nearby park, and which she described as “intimate and caring” (the GD at [23] and [37]). The Mother sought to minimise the significance of any disruption to R’s life by characterising him as young and easily adaptable, and by emphasising that she was R’s sense of security on a day-to-day basis and his primary caregiver (the GD at [38]). Moreover, R’s friends were mostly international students and might themselves relocate one day (the GD at [52]). 13 As for R’s relationship with the Father, the Mother did not dispute that this was a loving one. However, she submitted that the 12-hour time difference between New Zealand and London would allow calls between them before R slept and before the Father went to work (R would sleep at 9pm London time, which was 9am New Zealand time). She further alleged that the Father had business interests in London, such that travelling to London to meet R would pose no inconvenience to him. Moreover, she was willing to offer the Father even more access than currently provided in the Consent Order (the GD at [22], [25] and [39]). The Mother further pointed out that the Father had in 2015 and 2016 agreed for R to relocate to London, thus implicitly recognising that it was in R’s best interests (the GD at [40]).",
        "The Father’s case": "14 The Father disputed the Mother’s claim that relocation would give her a better work-life balance. He claimed that she “relished” the nature of her work and its long hours. Her claims of ill health were unsubstantiated and could in any event be addressed by restructuring her current role or seeking alternative employment in Singapore (the GD at [28] and [29]). Even if she relocated, there was no evidence that she would have a lighter workload or more quality time with R (the GD at [35] and [41]). 15 The Father further submitted that it would be traumatising for R to be uprooted from Singapore, where his family and friends were, particularly as the Mother did not intend to bring R’s other caregivers (ie, the maternal grandmother and helper) to London with her (the GD at [30]). 16 The Father also feared that relocation would reduce his access to R. Instead of taking a ten-hour flight from New Zealand to Singapore to visit R, the Father would have to fly at least 30 hours one way from New Zealand to London. This would make regular physical contact impractical. The Father denied having business interests in London. The 12-hour time difference was also not conducive for remote access, as either one of them would be rushing to school or work, given that R sleeps at 9pm (the GD at [25], [31] and [33]). As for prior plans for R to relocate to London, those plans envisaged the Father, the Mother and R living together in London as a family. Now that the parties were no longer together, those plans had fallen apart (the GD at [42]). 17 The Father also did not approve of the school the Mother had enrolled R in, as it lacked outdoor areas or physical education facilities, whereas R was active and enjoyed playing soccer. The school was found to have failed independent school standards and did not feature on recent IB league tables. Moreover, the accommodation which the Mother sought was located in an area that had been subjected to a number of terrorist attacks (the GD at [36]).",
        "The District Judge’s decision": "18 The District Judge rightly recognised that the welfare of the child is paramount in relocation applications (BNS v BNT[2015] 3 SLR 973 (“BNS vBNT”) at [19]). She took the view that relocation would not be in R’s interests for the following reasons. 19 For one, the District Judge thought that the Mother’s wish to relocate was unreasonable and motivated primarily by the Mother’s professional ambition rather than R’s best interests (the GD at [6], [26], [46] and [55]). The evidence did not show that the Mother’s health was suffering or that failure to relocate would jeopardise the Mother’s prospects of promotion. Nothing suggested that the assignment was foisted upon her and she was hard-pressed to reject it. There was also no evidence that the Mother had sought out alternative pathways and less drastic avenues than relocation (the GD at [6], [46] and [47]). 20 Separately, there was no evidence that relocation would be in R’s best interests (the GD at [7]). There was no evidence that the Mother would be able to spend more time with R in London, given that there was no firm indication that the Mother would be working only conventional office hours (the GD at [48]–[49]). Nor did the Mother have a clear plan of how she would spend any additional time with R. Her proposed daily schedule for R was “little more than a recitation of a basic daily routine a child can be expected to undergo, devoid of details” (the GD at [51]). The school that the Mother had enrolled R in was, according to a regulatory report produced by the Father, not one of the top IB schools and had several safety issues (the GD at [57]). 21 There was also evidence that relocation could be detrimental to R. First, there was a real risk of adversely impacting the Father’s relationship with R (the GD at [59]–[60]). It did not matter that the Mother was willing to give the Father more access, as there was no certainty as to when exactly the Father could have physical access (at [60]). Even if the Father flew into London frequently, there was no guarantee he would be able to meet R; the District Judge “appreciated the Father’s concern that he had little confidence in the Mother adhering to her proposals given the acrimony between parties and the fact that no specified timings had been suggested by her for any access” (at [62]). Moreover, jetlag would affect the quality of any physical access the Father enjoyed with R (at [61]). As for remote access, no timings were proposed, and the 12-hour time difference left the Father and R with only “a sliver of time to talk”, compared with the current five-hour difference between New Zealand and Singapore (at [9] and [64]). 22 Finally, the transition would be disruptive to R’s life. He was used to spending his weekends with the Mother’s family and most of his weekdays with the Mother’s mother and helper. The Mother had no support network in London, and did not intend to bring R’s other two caregivers along (at [8], [52] and [54]). The Mother appeared dismissive of the Father’s concerns that R might find the transition difficult. However, R was a sociable boy and could be expected to find leaving behind his friends destabilising (the GD at [52] and [54]). For these reasons, the District Judge considered that the relocation would not be in R’s interests and dismissed the Mother’s application. 23 The parties’ cases on appeal were essentially the same as those they mounted before the District Judge. Rather than repeat them here, I will describe their submissions in greater detail in my consideration of each of the factors which the parties have raised as relevant to the inquiry into R’s interests.",
        "The law on relocation": "24 The principles on relocation may be stated fairly succinctly and are not in dispute between the parties. It is well-established that the welfare of the child is paramount in relocation applications and ought to override every other consideration (BNS v BNTat [19]). There is no presumption in favour of allowing relocation where the primary caregiver’s desire to relocate is reasonable. Rather, the relocating parent’s reasonable wish to relocate is only relevant to the extent that there would be a transference of the relocating parent’s insecurity and negative feelings onto the child, since it is the child’s welfare that lies at the heart of the inquiry, and not the interests of the relocating parent (BNS v BNTat [20]; see alsoTAA v TAB[2015] 2 SLR 879 (“TAA v TAB”) at [17]). There is no pre-fixed precedence or hierarchy amongst the various factors to be weighed in the overarching inquiry into the child’s welfare. Where the factors stand in relation to one another depends, finally, on a consideration of all the facts of the case (BNS v BNTat [22]). 25 As I am dealing with this matter on appeal, I am conscious that the principles governing appellate intervention in cases involving the welfare of children are the same as those that apply to appellate intervention generally (CXv CY (minor: custody and access)[2005] 3 SLR(R) 690 at [15]). The appellate court should play a “limited role”, reversing or varying the decision of the judge below only if it was exercised on wrong principles or if the decision was plainly wrong, as would be the case if the judge had exercised his discretion wrongly (BG v BF[2007] 3 SLR(R) 233 at [12]). That said, where no trial took place below and the parties gave their evidence by affidavit and through the production of documents – as was the case here – the appellate court may be said to be in as good a position as the first-instance court to draw inferences and conclusions from the evidence (TSF v TSE[2018] 2 SLR 833 at [50]).",
        "My decision": "26 In my view, taking into account all the relevant factors, the relocation application should be allowed. I will address the following factors in turn: (a) the significance of the Consent Order recording that Singapore should remain R’s habitual residence; (b) the effect of relocation upon the Mother’s health, her time with R and her career; (c) the effect of relocation upon R’s relationship with the Father; (d) the potential disruption to R’s life; (e) R’s education in London; and (f) the parties’ prior discussions about relocating to London.",
        "The significance of the Consent Order": "27 I first briefly address the Father’s argument that the Consent Order, which provided that R’s habitual residence is Singapore, implicitly acknowledges that it is in R’s best interests to remain in Singapore. He also argues that the Consent Order was recorded fewer than four months before the Mother’s relocation application and should not be varied at the Mother’s whim.12Foot Note 12×Respondent’s Case at para 73; Minute Sheet (13 August 2018) in HCF/DCA 174/2017 at pp 6, 7, 10 and 13. 28 In my judgment, the fact that the parties previously agreed that Singapore would be R’s habitual residence is a relevant factor. Butequallyrelevant is the fact that they agreed that the order is subject to any further order of court. The paramount consideration is simply whether relocation would be in R’s best interests (see [24] above). The fact that the parties previously agreed that Singapore would be R’s habitual residence cannot change this. Moreover, all the Consent Order stated was: Unless expressly agreed to by parties or pursuant to an Order of Court, Singapore shall remain [R’s] habitual residence and neither party is to remove [R] from Singapore for a period of more than one (1) month without the leave of Court, save for parties’ school holiday access. 29 The parties’ agreement that Singapore shall remain R’s habitual residence wasexpresslymade subject to any further order of court and agreement by the parties otherwise. The parties thus clearly contemplated the possibility of change. Moreover, the Consent Order was recorded at a time when the Mother had not yet received the assignment letter from her employer. The assignment letter, which appeared to have prompted the Mother’s relocation application, was only issued around August 2017. Although the parties had contemplated moving to London in 2016, this plan was abandoned and the Mother informed the court in April 2017 that she wasnotrelocating because her employer had no firm plans at that point in time for her to relocate.13Foot Note 13×Respondent’s Case at para 40; ROA Vol 2, Tab 9, pp 140–145; ROA Vol 3, Tab 11, para 48.I therefore do not take the Consent Order as a concession on the Mother’s part that it would be in R’s interestspermanentlyto stay in Singapore rather than move to London.",
        "The Mother’s working hours": "30 Much of the parties’ dispute centred on (a) whether a move to London would improve the Mother’s working conditions; and (b) if so, what effect this would have on (i) her health, and (ii) the amount of time she would be able to spend with R. The Mother submits that the District Judge should not have faulted her for the lack of evidence that her working hours in London would improve, or that her health would suffer from a failure to relocate, since such evidence would be impossible to obtain until it actually happened.14Foot Note 14×Appellant’s Case at para 26. 31 Unfortunately, the assignment letter from the Mother’s company does not give a very good idea of what her work schedule in London would be like. The first paragraph of the letter states, “The terms set out in this letter together with the terms contained in your Home Country Employment Contract shall govern your employment.”15Foot Note 15×ROA Vol 2, Tab 8, p 36.Her Singapore contract reflects her working hours as 8.30am to 5.30pm on Mondays to Fridays,16Foot Note 16×Appellant’s Case at para 58.but it is the Mother’s own evidence that she usually has to work much longer hours than that. The assignment letter alone therefore does not reliably indicate what her actual working hours in London will be. 32 On the other hand, it is not disputed that the Mother’s job requires her to provide legal support to clients from Europe, Africa, Middle East, the Americas and Singapore. This means that she works during the day in Singapore and, after attending to R’s “night routine”, resumes work again, with conference calls with her overseas colleagues and clients, which can last past midnight. She therefore effectively works 15 to 18 hours a day.17Foot Note 17×Appellant’s Case at para 46; ROA Vol 2, Tab 8 at para 26.The following table shows the time differences between Singapore/London and where her colleagues and clients are located:18Foot Note 18×ROA Vol 2, Tab 8 at para 27. Work day (8.30am–5.30pm) in locationCorresponding time in SingaporeCorresponding time in LondonLondon/Africa3.30pm–12.30am(7 hours ahead)8.30am–5.30pmEurope2.30pm–11.30pm(6 hours ahead)7.30am–4.30pm(1 hour behind)South America8.30pm–5.30am(12 hours ahead)1.30pm–10.30pm(5 hours ahead)North America9.30pm–6.30am(13 hours ahead)2.30pm–11.30pm(6 hours ahead)The Middle East12.30pm–9.30pm(4 hours ahead)5.30am–2.30pm(3 hours behind)Singapore8.30am–5.30pm1.30am–10.30am(7 hours behind) 33 According to the Mother, at least 75% of her meetings and calls are with colleagues and clients in the Europe or United Kingdom (“UK”) time zone.19Foot Note 19×Appellant’s Case at para 65; Respondent’s Case at para 51.By relocating to the UK, she would be in an adjacent time zone to that of her colleagues in Europe, and would be able to make such calls during the day.20Foot Note 20×GD at [19] and [26]; Appellant’s Case at paras 46–47.The Mother has explained that her Asian clients can be supported by her Singapore team members, and her American clients by her Argentinian and American team members. In any event, she would be able to call them during UK working hours, rather than at night from Singapore.21Foot Note 21×ROA Vol 3, Tab 11 at para 72. 34 I recognise that the Mother has not adduced documentary evidence that her working hours in London would be an improvement over her working hours in Singapore. However, this is understandable because much would depend on her working conditions when she is there – including her ability to manage her time and workload – and she is unlikely to be able to obtain a firm indication from her company about the hours she would have to work.22Foot Note 22×Appellant’s Case at paras 48–53, 57 and 65.The Father does not dispute that the Mother’s work has a strong international focus and that she spends much of her time (particularly in the latter half of the day and at night) liaising with clients in the UK/Europe time zone. In the circumstances, I accept that relocating to London would spare the Mother, at the very least, from having to make so many conference calls late at night, and for that reason would likely afford her a better work-life balance. I now go on to consider the effect that this might have on two factors which the Mother relied on to support her application, namely, her health and her time with R. Effect on the Mother’s health 35 First, I agree with the District Judge that the evidence does not substantiate the Mother’s claim that her health wouldnecessarilysuffer and that she would burn out should she continue in her present job in Singapore.23Foot Note 23×Appellant’s Case at para 26.As the District Judge observed, the Mother had not taken any steps to reduce her workload and was, apparently, content with thestatus quountil being informed of the posting to London (the GD at [46]). The Mother does not appear to have sought any medical attention, an alternative work schedule or alternative employment to address her health concerns, and there is no evidence that she is on medication for stress-related ailments. That said, I accept that it is difficult for the Mother to show concrete evidence that her health would suffer until it actually does, by which point it may be too late. Moreover, it is not unreasonable to think that sustaining a 15- to 18-hour work day over the long term can be deleterious to the Mother’s health, and affect her ability to care for R. By contrast, as mentioned above, the move to London would better align her working hours with that of her clients in Europe/UK, and likely to improve her working hours. The Mother’s time with R 36 The Mother is R’s primary caregiver. She buys his clothes and books, organises playdates for him, attends his parent-teacher conferences and takes him to appointments, save when she is travelling and when R is with the Father. The Mother describes their daily schedule as follows. The Mother gets R ready for school in the morning and sees him off on the school bus, before she goes to work. She tries to send R to school two to three days a month. After school, the school bus drops R off at his maternal grandmother’s home and the Mother tries to picks him up after his after-school activities between 6.30pm and 7pm. On Wednesdays and Fridays, the Mother sends R for soccer practice and they have dinner together. They also aim to have dinner with R’s grandmother on average at least twice a week. Except when she has evening commitments, which are infrequent, the Mother puts R to bed by 9pm and then makes work calls ending between 11pm and 1am most nights. She travels once every two to three months to London for work for about a week each time, during which time R stays with his maternal grandmother.24Foot Note 24×ROA Vol 3, Tab 11, paras 65 and 129. 37 Due to the Mother’s current work schedule, she is busiest from 3pm onwards and is usually not available to pick R up from school or send him to and from some of his after-school activities. A Private Investigation report adduced by the Father, which describes the Mother’s and R’s schedules from 6 to 24 February 2017, supports the Mother’s assertion that she is often unable to spend as much time with R as she would like due to work commitments. The report observed that the Mother was overseas from 6 to 12 February, and that of the days which she spent in Singapore, she was often at work until R’s bedtime or would only return home at around 7.30pm to 8pm. R spent all his weekday afternoons and evenings at his maternal grandmother’s place and the Mother only took R out for dinner once, on a Sunday night. On 16 of 19 nights, R had dinner without the Mother at his maternal grandmother’s place.25Foot Note 25×ROA Vol 3, Tab 14, paras 40–42. 38 The Mother submits that, by relocating, she would be able to spend more time with R and personally attend to his needs. She would also not have to travel to London for work, as a lot of her current days away from R are for trips to London (for example, three of her four trips from May to November 2017). Relocation, on the other hand, would allow her to work hours that coincide much better with R’s school hours and would allow her to pick him up and drop him off to and from school and his after-school activities on most if not all school days.26Foot Note 26×ROA Vol 3, Tab 11, para 67. 39 I accept the Mother’s submission that she would be able to spend more time with R if she works in London, both because she would be able to liaise with clients and colleagues during the work day, and because she would not have to travel to London for work. Importantly, any improvements to the Mother’s well-being and psychological and emotional health as a result of a better work-life balance would also indirectly benefit R, as she is his primary caregiver and the parent on whom he depends for his daily needs. I therefore find that relocation would benefit R insofar as it allows the Mother to spend more time caring for and nurturing R. This would also help to mitigate the absence of R’s grandmother from his daily life.",
        "Effect on the Mother’s career": "40 The Mother also contends that her career would be adversely affected if the relocation application were to be dismissed. The Mother has been working for her present employer since July 2012 and has held her present position since April 2014.27Foot Note 27×ROA Vol 2, Tab 8, para 26.She claims that the London posting is a company assignment, not an option that she can accept or reject. By turning it down, she may be at risk of losing her job and would most likely suffer a pay cut. As the Mother is R’s sole financial caregiver, she cannot risk losing her job.28Foot Note 28×Appellant’s Case at paras 39–43. 41 The assignment letter from the Mother’s company, dated 22 August 2017, is titled “International Assignment Letter”. This letter purports to “confirm the general terms and conditions applicable to [her] global assignment to the United Kingdom” and the terms and conditions applicable to “give effect to [her] planned secondment”.29Foot Note 29×ROA Vol 2, Tab 8, pp 36–39.The letter concludes, “May we offer our congratulations on your international assignment and wish you every success in the next step of your career with [the company]. Please confirm your acceptance by signing the enclosed letter …” 42 The Mother relies on the words “planned secondment” and “next step of your career with [the company]” to buttress her argument that she risks losing her job by refusing the posting.30Foot Note 30×Appellant’s Case at paras 41–42;On the other hand, the letter seems to treat the posting as an advancement or promotion, because it congratulates her on the assignment and wishes her “every success in the next step of [her] career with [the company]”. There is certainly nothing to suggest that declining the offer would occasion such severe consequences as potentially losing her job.31Foot Note 31×ROA Vol 2, Tab 8, p 36.In fact, this seems very unlikely given the Mother’s seniority and income. 43 That said, I accept that the Mother stands to gain by accepting the posting to London and embarking on this next step of her career. Insofar as the posting would advance the Mother’s career while also affording her a better work-life balance, it would indirectly benefit R as well. Conversely, if the Mother is prevented from accepting the posting, the frustration and regret that she would feel – as well as any adverse impact on her career – would also be felt by R to some degree, because he depends on her. As the Court of Appeal observed inBNSv BNTat [20]: … [T]he child’s emotional and psychological welfare is, generally speaking, intertwined with that of the primary caregiver. Hence, if the primary caregiver reasonably wishes to relocate because he or she is not emotionally and psychologically stable in his or her present environment, that has to be sensibly weighed in the balance. … [T]he relocating parent’s reasonable wish to relocate is … relevantonly to the extentthat it is found that there will be a transference of his or her insecurity and negative feelings ontothe child. [emphasis added] 44 Similarly, the High Court observed inAZB v AYZ[2012] 3 SLR 627 (“AZB v AYZ”) at [14]: … [I]t is frequently the indignant retort of the parent opposing a relocation application (as the husband is doing in the present case), to emphasise that it is the welfare of the child which is the paramount and overriding consideration, not the interests of the primary caregiver. Indeed it is; I do not think that the cases suggest otherwise. What the cases do suggest, however, is that the welfare of the child is often so inextricably intertwined with the general well-being and happiness of the primary caregiver that the court is loath to interfere with important life decisions of the primary caregiver, so long as they are reasonably made and are not against the interests of the child. 45 The High Court also cited (at [15]) the following observations of Ormrod LJ inChamberlain v de la Mare(1983) 4 FLR 434at 442: … [I]f the court interferes with the way of life which the custodial parent is proposing to adopt so that he or she and the new spouse are compelled to adopt a manner of life which they do not want, and reasonably do not want, the likelihood is that the frustrations and bitterness which would result from such an interference with any adult whose career is at stake would be bound to overflow on to children. … 46 In other words, “the well-being of the child and that of the primary caregiver are inextricably tied together” (AZB v AYZat [34]). 47 In my view, the District Judge erred by not giving due weight to the Mother’s desire to relocate and the ways in which the relocation would benefit her well-being and career. The District Judge was fairly critical of the Mother’s relocation application, which she saw as being “run on a very individual-centric, rather than child-centric basis”, to which R’s interests were incidental rather than primary (the GD at [67]). As a result, the District Judge appeared to have undervalued the ways in which the Mother might benefit from relocation. Whatever one might think of the Mother’s motivations for relocating, the fact remains that the Mother is R’s primary caregiver. She is the parent whom he sees daily and who cares for him constantly, not the Father. The Mother bears sole responsibility for bringing R up, with little support from the Father beyond the maintenance he may be ordered to pay and his occasional visits to see R. R’s well-being and happiness are profoundly connected to the Mother’s and cannot be divorced from hers. In my view, this is a factor which favours relocation, although it is not capable of precise quantification.",
        "The Father’s relationship with R": "48 I now turn to the strongest factor in the Father’s favour, which is that relocation might adversely affect his relationship with R. InBNS v BNT, the Court of Appeal emphasised the importance of giving proper weight to the child’s loss of relationship with the left-behind parent, particularly because it is generally in the child’s interests to continue enjoying a meaningful relationship withbothparents (at [25] and [27]). Relocation “represents a serious threat to [the] ideal state of joint parenting since the left-behind parent would … become less of a presence in the child’s new life” (at [25]). That said, the Court also emphasised that this factor, like the wishes of the primary caregiver, was not to be treated as having determinative weight or as being decisive in every case. The weight to be attributed to this factor “depends on the facts,in particular, the strength of the existing bond between the left-behind parent and the child” and the “resultant void in the child’s life if relocation is allowed” [emphasis in original] (at [26]). For example, severing an already-functioning relationship would “generally be both more agonising and disruptive to the child” than hindering the creation of such a relationship (at [26]). With that, I turn to the nature of the relationship between R and the Father, before examining the effects that relocation would likely have on that relationship. Quality of relationship 49 I am satisfied that the relationship between R and the Father is a positive and loving one. I am not persuaded by the Mother’s attempts to downplay the closeness and love between the Father and R. She raises in particular the following points: (a) The Father did not inform his wife of R’s birth and existence.32Foot Note 32×Appellant’s Case at paras 12, 16, 18 and 34. (b) She was R’s primary caregiver during the one year in 2010 that all three of them lived together in New Zealand. The Father was allegedly busy managing his multiple businesses and was not a hands-on father to R or close to R. She also claims that he chose to prioritise spending key holidays and his birthday with the children from his marriage.33Foot Note 33×Appellant’s Case at para 14. (c) In October 2016, the Father insisted that he and the Mother go on a holiday together, without R, during almost the entire duration of R’s school holidays. She submits that the Father was “not interested in spending time with [R] during his October 2016 holidays”.34Foot Note 34×Appellant’s Case at para 21. (d) The Consent Order permitted the Father overnight access to R when the Mother was overseas for more than three days, subject to the Father securing rented residence at a condominium in the neighbourhood of R’s residence. However, the Father had yet to secure such residence.35Foot Note 35×Appellant’s Case at para 24. (e) The Father “refused to provide any payment of maintenance” and had “not volunteered any maintenance payments” since November 2016.36Foot Note 36×Appellant’s Case at paras 31 and 34. 50 I do not give much weight to these allegations. The court must assess the merits of the relocation application on the facts as theypresentlyare. Matters to do with R’s birth and his early years do not provide much insight into the nature of the currentrelationship between R and the Father. In that regard, the Mother did not “deny or debate [R’s] affection and love for his Father” and recognised that R “enjoys his father’s company and the lavish holidays he showers on [R]”.37Foot Note 37×ROA Vol 3, Tab 11, para 33.She also admitted that “[R] loves his Father and actively seeks his father’s approval hence the need to show his Father how his [s]occer or [s]wimming skills have improved”.38Foot Note 38×ROA Vol 3, Tab 11, para 44.Nor was the relationship at all one-sided. The Father made a ten-hour flight (one-way) to Singapore from New Zealand on an average of once every six to eight weeks to visit R and spend time with him. He also brought R for holidays.39Foot Note 39×Respondent’s Case at paras 69 and 72.It certainly seems that the Father and R both love each other dearly. 51 As for the issue of maintenance, it was not disputed that the Father has not maintained R since November 2016, when the Mother ended their relationship.40Foot Note 40×Appellant’s Case at para 29.However, I do not think this suggests a lack of love or care for R, for the following reasons: (a) First, the Father sent monthly maintenance of NZ$9,000 from mid-2011 to November 2016 for the Mother and R. The Mother was the one who, when she ended the relationship, instructed the Father to stop making these payments.41Foot Note 41×ROA Vol 3, Tab 14, para 16; see also the GD at [16]. (b) Secondly, as part of the relocation application, the Mother sought an order that the Father provide reasonable monthly maintenance for R, to be backdated to November 2016. The District Judge has adjourned her decision on that prayer pending the outcome of this appeal.42Foot Note 42×Appellant’s Case at paras 2 and 5.I also recognise that there is no urgent need for the Father’s financial assistance given that the Mother is very well-paid (see the GD at n 1) and it was not her case that she could not afford household goods or family expenses. (That said, I do think that the Father’s passiveness in maintaining R shows that he was content for the Mother to shoulder primary responsibility for R’s daily needs and well-being, and to himself take the backseat in R’s care, which I return to at [80]–[81] below.) (c) Thirdly, the Father appeared to be willing in principle to maintain R. In his affidavit filed in OSG 53/2017, the Father stated that he was “prepared to accept [R’s] total monthly reasonable expenses” as S$3,000 per month, and asked that this be shared equally between the parties.43Foot Note 43×ROA Vol 2, Tab 9, para 110.The Mother points out that his estimate of $3,000 per month excludes R’s school fees, which amount to about $34,000 a year.44Foot Note 44×Appellant’s Case at para 32.Be that as it may, the Father has not taken the position that he would refuse to pay maintenance over and above the figure he has suggested; he was merely making submissions on the proper sum to be ordered as maintenance. I have no reason to doubt his willingness to contribute to the maintenance of R. 52 I also do not think anything can be made of the fact that the Father had not secured rented residence at the neighbourhood condominium. There was no obligation for him to do so. Moreover, as his counsel explained at the hearing before me, the Father was understandably reluctant to rent a residence there for a fixed term given the uncertainty (pending this appeal) of whether R will be permitted to relocate. 53 For these reasons, I am not persuaded that the relationship between the Father and R is less than loving and caring. The question, then, is what effect relocation would have upon their relationship in terms of physical and remote access. Physical contact 54 It is largely undisputed that from 2011 to 2014, the Father visited Singapore every 8 to 12 weeks and from 2014 to 2016, he visited every 4 to 8 weeks.45Foot Note 45×Appellant’s Case at para 20; Respondent’s Case at para 8; the GD at [14].Under the Consent Order, he is to have physical access to R on an average of once every 6 to 8 weeks and half the school holidays. 55 The Father submits that it would be unreasonable and impractical for him to exercise any form of regular access if R were to relocate to London.46Foot Note 46×Respondent’s Case at paras 75, 81 and 86.It is not disputed that a one-way trip from Auckland to London would take at least 30 hours and require at least one stopover.47Foot Note 47×Respondent’s Case at para 75.The Mother counters that the Father has business interests in London and it would pose no inconvenience for him to travel to London for access to R. Further, he has travelled to London fairly often since 2016, including twice in 2017. Should relocation be granted, the existing access orders could be varied to give the Father additional physical access to R whenever the father is in London, subject to him giving prior notice. In an affidavit filed below, the Mother offered the Father holiday access for 75% of R’s year-end holidays and half of his summer holidays, and said that she was willing to facilitate access if the Father should visit London outside of his access period, provided he gives two weeks’ prior notice. The Mother even offered to fly R to Singapore for holiday access with the Father for up to three of the five holiday access periods.48Foot Note 48×Appellant’s Case at paras 61, 81, 86–88; ROA Vol 3, Tab 11, paras 104–105. 56 I accept the Father’s submission that the increase in travel time would make it harder for him to have physical contact with R as often as he presently does. The Father denies that he ever had or continues to have any business interests in London, and asserted in his affidavit filed in October last year that he had only travelled to London once in the last 18 months.49Foot Note 49×Respondent’s Case at para 77; ROA Vol 2, Tab 9, para 91.However, I do not think that the increased difficulty of visiting R would be as drastic as the Father suggests. The Mother makes the point that the Father travels frequently to London and made some 11 trips from 2009 to 2017 involving London either as a destination or as a stopover. Five of these trips were made in 2016 and 2017.50Foot Note 50×Appellant’s Case at para 82.The Father claims that two of the trips in 2016 were made for the purpose of exploring opportunities in London when the parties were still planning to move there, and that these opportunities were discontinued when their relationship ended.51Foot Note 51×ROA Vol 2, Tab 9, para 91.Even if that is so, this suggests that the Father’s business may well take him to London or other parts of the world in future, which will make travelling to London less of an inconvenience. The Father also travels to other parts of Europe (eg, to France in July 2015, July 2016 and August 2017; and to Frankfurt in 2015), from which it will not be difficult to fly to London. Moreover, the Father acknowledges that he travels frequently. The frequency and duration of his trips – which, by the Father’s own evidence, were not for work purposes52Foot Note 52×Respondent’s Case at para 78.– contradict his assertion that it would be difficult for him to visit R in London because he is “just an employee of a company with a fixed number of leave days” and “cannot possibly be expected to take leave from work frequently and for long durations on a regular basis”.53Foot Note 53×Respondent’s Case at para 86.Indeed, the fact that the Father was able to plan a relocation to London in 2016 and took steps to organise his work commitments on that basis54Foot Note 54×ROA Vol 3, Tab 11, p 155.suggests that he exercises substantial control over his work and the projects he is involved in. 57 Moreover, even if the Father is not able to travel to London as often as he presently travels to Singapore, he might possibly compensate for this by spending more time with R on each occasion. I also note that the Mother was willing to fly R to Singapore to meet the Father. The District Judge was skeptical about this proposal because it “would entail R flying to New Zealand thereafter”, and “[h]aving to endure such long flights and the ensuing jet lag could not be in R’s best interests” (the GD at [63]). However, the Father need not fly R back to New Zealand. He could, for example, spend time with R in Singapore (where R’s friends and maternal relatives would be), or bring R for holidays to nearby destinations. This would allow the Father to see R without having to fly all the way to London. While such a proposal might not be feasible on a regular basis, and is dependent on R’s school schedule, it is an arrangement which can be properly planned and has the advantage of relative certainty. Remote access 58 In my view, the Father overstates the difficulty of remotely contacting R in London. Presently, by the time R is done with his after-school activities, it is past 7pm in Singapore and midnight in New Zealand. However, if R relocates to London, the Father could call R before R sleeps and before the Father goes to work. Instead of calling R at 9pm local time, which would only give them a short time to talk, the Father could easily call R earlier (eg, 7am New Zealand time and 7pm London time) so that there would be less of a rush. It may also be envisaged that sustained or increased remote access would help the Father to maintain his relationship with R even if physical access were to occur less frequently. Conclusion on this factor 59 There is no doubt that a loving relationship subsists between the Father and R. Nevertheless, the case for refusing relocation on this basis is not as compelling as it would be if R had grown up with the Father. InBNS v BNT,for example, the father played “an active, involved role” in the children’s lives, allowing them to “enjoy, to the fullest extent possible, a normal family life in which they [could] benefit from the input ofbothparents” [emphasis in original] (at [32]). The relationship between the children and the father in that case was described as “strong, vibrant”, “good and close” (at [30] and [31]). The Court found that, “given the very nature of the relationship”, it was preferable for the children to continue to havepersonalcontact with their father (at [34]). Technological communication would be a poor substitute for the vibrancy of “[n]ormal family life”, which did not consist solely of spoken communication but also “joint activities, routines, projects, discipline and learning from the examples set by the parents in all sorts of situations” (BNS v BNTat [34]). Similarly, inTAA v TAB, it was said that the children would “lose out on other aspects of family life such as enjoying activities with the left behind parent … as well as the closeness which comes only with face-to-face interactions, hugs and loving touches” (at [28]). 60 In this case, by contrast, R does not share a family life with the Father as they live in different countries. The three of them have never lived together as a family, except for the first year of R’s life. R only meets the Father once every six to eight weeks and they have managed to develop a loving relationship through the remote and physical contact permitted under current access arrangements. Any decrease in physical contact between R and the Father would not be as substantial in this case as it would be if the Father had been residing in Singapore. Less regular physical contact (particularly in conjunction with equal or increased remote contact, and physical contact for a longer duration each time) would not, I think, be as disorienting and traumatising for R as it might be if he had grown up with the Father and seen him daily. The Mother is and will continue to be R’s primary caregiver, and she has had primary care of R’s daily and long-term needs for nearly his entire (if not his entire) life. Although the Father may see R less regularly if R moves to London, they could still maintain a positive and loving relationship through a combination of physical and remote access. 61 I acknowledge that the quality of the Father’s access to R would in all likelihood be poorer in the event of R’s relocation to London than it presently is. However, this factor is not decisive. It must be balanced against the benefits (if any) that R might receive by relocating to London.",
        "The disruption to R’s life": "62 I next address the factor of disruption to R’s life, which the District Judge thought would be significant (see [22] above). The Mother reiterates that there is no evidence that relocation would be stressful or traumatic for R given his youth and adaptability, the possibility of connecting with old friends via social media, and the fact that the Mother is his primary caregiver and sense of security.55Foot Note 55×Appellant’s Case at paras 70–73.Moreover, he has a cross-cultural background and no one single culture governs his upbringing.56Foot Note 56×Appellant’s Case at paras 76–77.The Mother also claims that she would not need to bring her mother and her helper to London because she would be able to spend more time looking after R, though she may hire a nanny to assist with household chores (not to care for R). In any event the court may specifically order that the maternal grandmother and/or helper accompany R to London.57Foot Note 57×Appellant’s Case at paras 65–67. 63 I take the Father’s point that the move to London would involve quite a dramatic change for R. R has spent the past eight years in Singapore and has never lived in London. He would also no longer see his uncles and cousins, with whom he usually has dinner on Sundays, often.58Foot Note 58×ROA Vol 3, Tab 11, para 129(i).However, given his youth, I consider that R would be able to adapt. The fact that R is “sociable” (the GD at [51] and [54]) may even be favourable, and is at worst neutral, to the Mother’s relocation application because it bodes well for R’s ability to make new friends in London, as compared to a child who is more introverted. I also consider that the extra time and love the Mother would be able to give him in London would help to ease the transition. That said, I take the view that the Mother should bring her mother and helper along for the initial transition period, particularly as the Mother herself would be acclimatising to work. As the District Judge said, the face of a familiar family member in a foreign land would likely bring R some measure of assurance and comfort (see the GD at [54]). The Mother has stated that she would be willing to make such arrangements if the court takes the view that the maternal grandmother and/or helper should accompany them for the initial transition period.59Foot Note 59×Appellant’s Case at para 68. 64 For the avoidance of doubt, I place no weight on the Mother’s argument that relocation would allow R to get to know his paternal relatives (particularly his paternal grandmother, paternal aunt and three cousins).60Foot Note 60×ROA Vol 2, Tab 8, para 37.They reside in Ireland, not London, and it would take a day’s travel to reach them (the GD at [58]).61Foot Note 61×Respondent’s Case at para 66.Interaction between R and his paternal relatives is unlikely to be regular and would not, as far as is reasonably foreseeable, have a significant impact on R’s well-being.",
        "R’s education in London": "65 Next, I note that the Father has expressed concerns about the school in which the Mother has enrolled R. Before the District Judge, the Father also tendered two regulatory reports by the UK Office for Standards in Education, Children’s Services and Skills (“Ofsted”), as well as an article showing that the school does not feature on recent league tables for IB schools.62Foot Note 62×ROA Vol 2 Tab 9, para 84.The Mother relied on an article of “unknown reliability” to show that the school was a good school, even though the article stated that the school’s own website claimed that it was in the top 20% for IB results (the GD at [56]). 66 I first address the two Ofsted reports. The first was based on an inspection conducted on 20 May 2016. The second was dated 9 November 2016. The District Judge observed that the reports “showed that the said school was not one of the top IB schools and the said report also cited several safety concerns” (the GD at [57]). However, these safety concerns appear to relate to the inadequacy of the school’s risk assessment for one particular trip (a residential trip to India). Most of Ofsted’s feedback regarding the school was positive and complimentary. This is shown by the “Main findings” of the Ofsted report:63Foot Note 63×ROA Vol 2, Tab 9, pp 273–274 (exhibit Tab 13). Main findings  Leaders work hard to provide pupils with enriching learning experiences, including trips abroad. These are generally well planned, enjoyed by pupils and successful in meeting their aims.  Most arrangements for safeguarding in the school are strong. The school’s policy meets requirements and is published on the school’s website, alongside all other relevant policies. The designated safeguarding lead has implemented clear, detailed and reliable safeguarding procedures. Safeguarding training goes beyond what is expected of schools … The school’s safeguarding culture, ably led by the designated safeguarding lead, is one in which ‘anybody can make a referral’ and where staff are continuously encouraged to ‘think the unthinkable’.  The school’s arrangements for first aid, including on school trips, meet requirements … any medical incident could be appropriately cared for. Accidents, incidents and any action taken by first aiders are well documented.  Health and safety laws are complied with in line with the school’s clear health and safety policy, which is followed by all staff.  The school has appropriate risk assessments in place for a range of school activities.However, for a residential trip to India, a generic risk assessment provided by the external company organising the trip was relied on as the school’s only written risk assessment. While conversations were had, and useful information gathered about pupils andany additional needs before the trip, there was no system to record these and assess the risks as a result. Furthermore, although there were enough staff on the trip, they could have been deployed more effectively, especially if some specific risks arising during the trip had been more actively considered. The school has not ensured that those with leadership and management responsibilities demonstrate good skills and knowledge appropriate to their role and fulfil their responsibilities so that the independent school standards are met consistently and that they actively promote the well-being of pupils. [emphasis added] 67 As can be seen, Ofsted’s findings were generally positive. The school’s arrangements for safeguarding and first aid, and its health and safety policy, were adequate and even praiseworthy. The only negative comments about the school are those which I have emphasised in italics above, but even those were addressed by the time of Ofsted’s second report in November 2016. That report recounted a slew of measures which the school undertook to remedy the lapses discovered as a result of Ofsted’s May 2016 inspection, and concluded that the school met all the relevant requirements in respect of the welfare, health and safety of pupils, as well as the quality of leadership in and management of the school. The report concluded that the school staff, proprietor and governors had been “successful in addressing the remaining unmet parts of the standards that were highlighted at the emergency inspection in May 2016” and that all the relevant requirements were satisfied.64Foot Note 64×ROA Vol 2, Tab 9, pp 273–279 (exhibit Tab 13).It therefore appears that the school has taken Ofsted’s concerns seriously and worked very hard to address them. 68 Secondly, I note the Father’s remark that the school “is a small school of very average repute” with “a very limited range of amenities that is substantially below that which [R] enjoys in [his school in Singapore]”.65Foot Note 65×ROA Vol 2, Tab 9, para 85.He adduced a print-out of an article ranking the top 45 “large cohort” IB schools and the top 10 “small cohort” IB schools in the UK in 2017. The school selected by the Mother is not ranked among these. However, the article does not state how many IB schools there are, so it is impossible to know how the school fares in comparison to the average. 69 Thirdly, the Father tendered photographs he had taken of the exterior of the school.66Foot Note 66×ROA Vol 2, Tab 9, exhibit Tab 11.However, not much can be deduced from these photographs regarding the quality of teaching, the extra-curricular activities available or what R’s educational experience there would be like. 70 There is no other evidence that the school is a poor choice for R, that better options were feasible and available, or that the Mother did not have his interests at heart in selecting this school. In any event, the District Judge noted that the Mother was “open to exploring alternative schools” in the light of the Father’s concerns (the GD at [37]). The choice of school is an important decision as it will affect the Mother’s and R’s lives significantly. It invites many considerations, such as location, admission criteria, curriculum and affordability. In the absence of any evidence that the school chosen by the Mother is patently unsuitable, I do not think that the relocation application should be dismissed on this basis.",
        "Prior discussions about a relocation to London": "71 Another fact which the Mother relies on to support the relocation application is that the parties seriously discussed her relocation with R to London in March 2015 to help her achieve a better work-life balance.67Foot Note 67×Appellant’s Case at paras 35 and 38.In 2015, the parties sought the approval of the Ministry of Education for R to continue his studies at an international school in Singapore because of their intention to relocate to New Zealand or the UK within the next two to four years. The parties travelled to London in 2016 to further explore relocation, and the Father made arrangements in March 2016 for them to explore London schools. There are also e-mails which refer to the Father planning to set up offices in London and making site visits to various property developments that he had a business interest in.68Foot Note 68×ROA Vol 3, Tab 11, pp 65–66, 68 and 155. 72 The Mother claims that only she and R were to relocate to London, and that the Father was to remain in New Zealand, commuting to London to visit them periodically. The Mother cites the fact that the Father had not divorced his wife as evidence that he did not plan to move to London with the Mother and R.69Foot Note 69×Appellant’s Case at paras 60, 62 and 64; ROA Vol 3, Tab 11, para 37.Her argument is that, if the Father was agreeable at that time to R relocating to London, he must have accepted that relocation would be in R’s best interests.70Foot Note 70×Appellant’s Case at para 63. 73 I do not place much weight on this factor. First, the parties dispute whether the move to London was meant to include the Father. From the evidence, it seems likely that the parties intended the Father to move to London. For example, the Mother’s draft e-mail to the Ministry of Education requesting permission for R to study at an international school states:71Foot Note 71×ROA Vol 2, Tab 8, p 62. 4.Weintend to relocate out of Singapore to New Zealand or UK within the next 2 to 4 years. This is entirely feasible based on[the Father’s] business plansand [the Mother’s] career path. 5. We also plan to obtain for [R] an Irish passport within the next 24 months to facilitateourrelocation. [emphasis added] 74 Another e-mail drafted by the Father to a business associate states:72Foot Note 72×ROA Vol 3, Tab 11, p 155. You know that I am keen to relocate to London for personal reasons and I have been looking at options to achieve this … my relocation needs to operate around school terms and ideally we would need to be based in London from next September. 75 If the plan was for the Father to move to London with the Mother and R, then R would have benefited from the relocation by being able to live withbothhis parents, whom he loves. That situation would likely be more beneficial for R than moving to London with the Mother only, with his Father remaining in New Zealand. Assuming the plan was for all three of them to live in London, the fact that the Father was agreeable to R moving to Londonunder those circumstancesdoes not necessarily mean that he ought to be agreeable to R moving to Londonunderthe present circumstances. Moreover, even if the plan at the time was only for the Mother and R to relocate to London (without the Father), the court must still arrive at an independent determination of whether such relocation wouldin factbe in R’s interests. The fact that both the parties think it would be in R’s interests does not necessarily mean that it is. Now that the relocation application is before the court, the court must decide it with reference to the child’s welfare as the paramount consideration (see [24] above), which is a matter to be decided objectively rather than by reference to what the parties may at some point in the past have agreed.",
        "The duration of the relocation": "76 One of the Father’s concerns was that the Mother’s posting to London would be permanent (the GD at [34]). The assignment letter from the Mother’s company dated 22 August 2017 referred to an “assignment period … from 1 January 2018 to 31 December 2019”, but para 8 titled “End of Assignment” stated that at the conclusion of her international assignment, the company would “consider possible options available to [the Mother]” as follows:73Foot Note 73×ROA Vol 2, Tab 8, p 38. (a) the company would take reasonable steps to identify “a suitable role”, but if a suitable role was not available in any location, then the redundancy process would commence; (b) the Mother might be offered a new international assignment; or (c) she might be asked to agree to localise in the UK, resulting in the termination of her employment contract in Singapore. She would then enter into a regular contract of employment “of indefinite length” with the company in the UK. 77 In my judgment, the possibility of the relocation being permanent does not carry much weight. It involves a great deal of speculation because it is simply not known whether the company will want the Mother to stay on in London after her two-year assignment. Indeed, it is impossible to predict with certainty what changes the next two years may bring about in terms of the Mother’s career prospects, R’s assimilation in London, his response to his new school and environment, and the Mother’s and R’s well-being generally. It would therefore be speculative to say that it would be in R’s interests to move back to Singapore at the end of two years in London. If anything, relocating permanently or for a longer duration might be less disruptive for R than relocating for just two years, which would mean uprooting him twice within a relatively short span of time. R may end up returning to Singapore anyway in order to serve National Service, but that will occur when he is nearer adulthood. Aside from the fact that a shorter relocation may be more disruptive to R’s life, the duration of the relocation does not affect my analysis of the factors above one way or the other. It merely prolongs the period during which both the positive and negative effects of relocation will be felt on R. The ultimate question is still whether these various effects tilt the balance in favour of or against R’s interests.",
        "Balancing the factors": "78 The foregoing factors do not all point in one direction. On one hand, moving to London would benefit R through benefiting the Mother. Taking up the position in London would in all likelihood advance her career, improve her work-life balance, contribute to her well-being, and enable her to spend more time with R. R’s well-being and health are inextricably intertwined with the Mother’s, and her desire to relocate to London should be weighed seriously for that reason. On the other hand, relocation would make it difficult for the Father to have regular physical access to R. 79 On balance, I consider that relocation to London with the Mother would be  in R’s interests. The Father is not a typical left-behind parent in that he lives in a different country from R and the Mother, and he and R have developed a loving relationship through a combination of physical and remote access. Being further away from the Father would not, I think, be as disturbing or disorienting for R as it would be if he were used to living in the same house or country as the Father. Moreover, R’s relocation to London need not erode the quality of their relationship, provided the parties endeavour to ensure that R is able to continue spending a substantial amount of time with his Father (for example by seeing him less frequently, but for a longer duration each time) and remain in regular remote contact with him. The Father’s main objection to relocation is that it would take him 30 hours to travel from New Zealand to London. However, this inconvenience would be mitigated on the (apparently not infrequent) occasions that the Father travels to London or nearer London for work or personal purposes. It could also be further mitigated by the Mother flying R to Singapore or other locations that the Father can have access to more easily. These difficulties are not insurmountable and, in my view, should not stand in the way of a relocation which appears to otherwise be in R’s interests.",
        "Conclusion": "80 It is useful to put into perspective what this case is about. It is about the Mother who is the caregiver of a young child whom she has brought up on her own for the last 7½ years, with help from her mother and helper. The Father, who never married the Mother, lives with his own wife and children some ten hours away by flight. As I said earlier, the fact that he lives remotely from the child is a factor that I considered significant in reaching my decision (see [59]–[61] above). He has not asked for the care of the child. His role in the child’s life was limited to periodic visits and holidays with him and financial contributions towards his maintenance. These contributions, while voluntary, were limited. It was fortuitous that the Mother was well paid and did not really have to depend on them. To earn that salary, her job was no doubt a demanding one, and her time at work went beyond the conventional office hours as she had to deal with matters relating to her company’s various offices, which spanned a wide range of time zones. This has resulted in her having less time to spend with her child. 81 The Mother has now been offered a move to the London office of her company, which she said would help her in her career. Being based in London, the range of time zones of the same offices whose matters she has to deal with would be narrower, and her working hours would more closely match the conventional office hours. If the Mother relocates with the child, she would be able to spend more time with him as she would have to spend less time in the office. The other differences between that arrangement and the currentstatus quoare that the maternal grandmother and helper would no longer be able to help the Mother with the child’s care; the child would have to leave his school and friends here behind, and go to a new school and make new friends in a new country. While the Father would have to fly 30 hours instead of ten to see the child, so that the frequency of these visits would in all likelihood reduce, he would  still be the distant father he has always been. 82 Finally, I should reiterate that the decision below was made on affidavit evidence. There was no trial. I therefore considered myself to be in as good a position as the District Judge to draw conclusions from the evidence adduced (see [25] above). I disagreed with her conclusions on some matters, such as whether the Mother would be able to spend more time with R in London and whether the 12-hour time difference would impede remote contact between R and the Father. The District Judge’s conclusions on these and other matters led her to exercise her discretion in a manner which was, in my view, plainly wrong. In particular, she significantly undervalued the ways in which the Motherandconsequently Rmight benefit from relocation (see [47] above), and thus wrongly attributed decisive weight to the increased difficulty of physical contact between the Father and R and to the disruption that relocation would cause to R’s life. 83 For the reasons I have given, I allow the appeal and order that R be permitted to relocate to the United Kingdom with the Mother. 84 I also consider it advisable for the Mother to bring the maternal grandmother and helper with her to London, at least for the initial transition period, provided they are able and willing to do so. I think their presence would be in R’s interests. The duration of their stay in London, however, is a matter best left to the Mother’s discretion. 85 In the event of relocation, the Mother seeks to vary the orders for access to the extent that: (a) the school holidays be shared equally with the Father and, in addition, that the Father have access during the following school holidays: (i) one week during the February school holidays; (ii) two weeks during the April school holidays; and (iii) one week during the October school holidays; (b) if the Father is travelling to London during the school term, the Mother will facilitate access to the Father upon the Father providing prior written notification of at least two weeks prior to his arrival; and (c) there be regular contact through Skype, Facetime, WhatsApp or other electronic means between the Father and R, the timing of which is to be scheduled around R’s school schedules and taking into account the time difference between New Zealand and London. 86 The Father takes issue with the access arrangements proposed by the Mother because they would essentially require him to “shuttle between New Zealand and London [five] times a year”, which he claims is not feasible. The holiday access periods which she has proposed are each at least a week long, requiring him to “take long periods of absence [from] work”, which he says is “impractical”.74Foot Note 74×Respondent’s Case at paras 85 and 101.The Father’s position in these proceedings has consistently been that the relocation application should be dismissed because it would be impractical for him to maintain regular contact with R if R moves to London. He has not himself proposed any access arrangements. Given my decision to allow R to relocate, it would be profitable for the parties to try to agree on a set of physical and remote access arrangements that would meet R’s needs and that would be workable for the Father. If the parties are unable to agree, they may apply to the District Judge for an order varying the terms of access. 87 I therefore make the order that the Father’s access arrangements, the date of relocation, R’s school in London and other necessary details pertaining to the relocation are to be agreed between the parties, failing which they are to address the District Judge on them. 88 I will hear the parties on costs. Tan Puay BoonJudicial Commissioner Yap Teong Liang and Tan Hui Qing (T L Yap Law Chambers LLC) for the appellant;Ivan Cheong and Eugene Chan (Eversheds Harry Elias LLP)for the respondent."
    }
}