{
    "case_title": "Public Prosecutor vTangaraju s/o Suppiah",
    "ncitation": "[2018] SGHC 279",
    "coram": "Hoo Sheau Peng J",
    "sections": {
        "Introduction": "1 The accused, Tangaraju s/o Suppiah (“the accused”), claimed trial to a charge of abetting by engaging in a conspiracy with one Mogan Valo (“Mogan”) to traffic in cannabis by delivering 1017.9g of cannabis to himself, an offence under s 5(1)(a) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“MDA”), read with s 5(2) and s 12 of that same Act. 2 At the conclusion of the trial, I found that the charge against the accused had been proved beyond a reasonable doubt, and convicted him accordingly. 3 Under s 33(1) read with the Second Schedule to the MDA, the prescribed punishment for the offence is death. However, s 33B(1)(a) provides the court with a discretion not to impose the death penalty if the two requirements set out within s 33B(2) of the MDA are met. 4 I found that the accused met neither of the requirements set out in s 33B(2) of the MDA. Therefore, I passed the mandatory death sentence on the accused. 5 The accused has filed an appeal against conviction and sentence. I now provide the reasons for my decision.",
        "The Prosecution’s case": "",
        "Events leading to Mogan’s arrest": "6 According to Mogan, sometime prior to his arrest on 6 September 2013, a Malaysian man known to Mogan as “Selva” gave Mogan the contact number of a person whom “Selva” said could help Mogan find a job in Singapore. The person’s contact number was 83567639 (“the first number”).1Foot Note 1×Agreed Bundle (“AB”) 105 at para 4; Transcript (“Tr”)/06.10.17/4/16–18, 25. 7 Mogan called the first number and was told by the person on the line that he could get Mogan a job at a mini-mart in Tuas.2Foot Note 2×AB 105 at para 4; Tr/06.10.17/5/4–11.Mogan saved the first number under the name “India”, as he thought the person sounded like an Indian national.3Foot Note 3×AB 105 at para 4.Thereafter, “India” also gave Mogan a second number which Mogan could contact him at, being 90356293 (“the second number”). Mogan saved this number under the name “India.jus”.4Foot Note 4×AB 105 at para 5; Tr/06.10.18/8/22–32. 8 Mogan saved the first and second numbers under the names “India” and “India.jus” respectively on the mobile phone given to him by “Selva” for use in Singapore (marked as “MV-HP1”).5Foot Note 5×AB 118, s/n 62, 74.He also saved the first number under the name “Indian.jus” in his personal mobile phone, which he used in Malaysia (marked as “MV-HP3”).6Foot Note 6×AB 164, s/n 8.Mogan confirmed that both the first and second numbers were used by the same person – “India”.7Foot Note 7×Tr/06.10.17/6/13–16. 9 On 5 September 2013, “Selva” instructed Mogan to deliver “ya lei”(which translates to “leaves” in Tamil, but which Mogan understood to mean cannabis) from Malaysia to “India” in Singapore at the carpark of PSA Vista, or, failing which, the McDonald’s outlet at West Coast Park (“McDonald’s”). For the job, “Selva” gave him $900.8Foot Note 8×AB 105 at para 3; Tr/06.10.17/3–4. 10 On 6 September 2013, Mogan drove into Singapore in a black Proton Persona bearing registration number JNV 6167 along with his girlfriend, one Salina Binte Salim. He was carrying two rectangular-shaped blocks wrapped in white packaging, which he knew to be cannabis.9Foot Note 9×AB 105–106 at paras 6–7.Mogan had been given these two blocks of cannabis by a runner of “Selva” on the same day.10Foot Note 10×AB 105 at para 6.He cleared the Woodlands Checkpoint at around 9.00pm.11Foot Note 11×AB 106 at para 7. 11 At around 9.25pm, Mogan received a call from “India”, using the first number. During this call, “India” asked Mogan where he was, and Mogan replied that he was on his way to PSA Vista.12Foot Note 12×Exhibit F, s/n 30; AB 106 at para 10; Tr/06.10.18/9/28 – 10/4. 12 Along the way, Mogan realised that he was being followed. He attempted to leave Singapore via the Tuas Checkpoint. However, at around 10.10pm, he was arrested by officers from the Central Narcotics Bureau (“CNB”).13Foot Note 13×AB 106 at para 11; P89T 2210A search of Mogan's vehicle uncovered two blocks of vegetable matter (marked “A1A1” and “A2A1”).",
        "The follow-up operation": "13 Upon his arrest, Mogan informed the CNB officers that he had instructions to deliver the cannabis to “India”, whose number he had saved on his mobile phone. Although Mogan had never met “India”,14Foot Note 14×Tr/06.10.17/4/14–15.he had been told that “India” was in his thirties, was about 1.76m tall, had a long fringe, wore a lot of gold jewellery and drove a white van.15Foot Note 15×P89T 2350; Tr/06.10.17/11/15–26.Mogan could not remember if it was “Selva” or “India” who had given him this description.16Foot Note 16×Tr/06.10.17/11/13–14, 27/10–24, 41/29–31. 14 Mogan agreed to assist in a follow-up operation against “India”, the intended recipient of the drugs. Under the direction of Station Inspector Tay Cher Yeen (“SI Tay”), Mogan arranged to meet “India” at the toilet of the McDonald’s at West Coast Park through a series of phone calls. 15 The details of the operation and the contents of the calls were recorded in SI Tay’s field diary (Exhibit P89). The accuracy of SI Tay’s records was not challenged at trial. 16 At 11.50pm, under SI Tay’s supervision, Mogan called “India”, and they arranged to meet at the McDonald’s at West Coast Park.17Foot Note 17×AB 106 at para 13; Tr/06.10.17/10/12–14, 27/1–9.At 12.33am on 7 September 2013, Mogan received a call from “India” and was told that “India” was waiting at the McDonald’s. Mogan said that he would proceed to the venue as soon as possible.18Foot Note 18×P89T 0035; AB 107 at para 14At 12.55am, the CNB party, along with Mogan, left Tuas for the McDonald’s. 17 At 1.14am, just as the CNB party was arriving at the McDonald’s, Mogan received a call from “India”. Mogan informed “India” that he was at the toilet in the McDonald’s.19Foot Note 19×P89T 0120; Exhibit F, s/n 14; AB 107 at para 16; Tr/06.10.17/13, 28.Shortly after, at around 1.19am, one Suresh s/o Subramaniam (“Suresh”) was arrested whilst walking out of the toilet at the McDonald’s.20Foot Note 20×Tr/06.10.17/13/23–24; Tr/05.10.17/70/29 – 71/8; Tr/21.11.17/34/13–16.Mogan confirmed that he did not know Suresh and had never had any contact with Suresh prior to his arrest.21Foot Note 21×Tr/06.10.17/13/27–30. 18 Mogan then made two further calls to “India” and informed him that he was at the toilet at the McDonald’s. At 1.38am, “India” told Mogan that he was no longer at the McDonald’s, and had asked his friend, whom “India” described as a “fat Indian”, to collect the “ya lei” from Mogan. In the field diary, SI Tay recorded as follows:22Foot Note 22×P89T 0135; AB 107 at para 17; Exhibit F, s/n 7; Tr/06.10.17/13/31 – 16/26. [Mogan] called “India” asked where id [sic] he. “India” replied he is not around, he had ask another Indian friend to go collect the “Ya Lei” (leaves) from [Mogan]. [Mogan] asked which friend “India” says he is a fat Indian. 19 SI Tay confirmed that he had personally heard the words “ya lei” mentioned during this conversation, and that he was certain that it was “India” who had made reference to the “ya lei”.23Foot Note 23×Tr/05.10.17/11/1–16.As stated above at [9], Mogan understood “ya lei” to mean cannabis. 20 Three further calls were made to “India” at 1.46am, 1.57am and 2.00am. During the 2.00am call, “India” said he would be at the McDonald’s in 10 to 15 minutes. However, he did not turn up.24Foot Note 24×P89T 0150; Ex F, s/n 5, 2, 1; Tr/06.10.17/3–9.",
        "Events leading to Suresh’s arrest": "21 Suresh is a friend of the accused, and knew him as “Appu”.25Foot Note 25×Tr/05.10.17/51/15–29.The two have known each other since childhood, although they lost contact over time. They reconnected during a chance encounter in July 2013 and would meet occasionally in August and September 2013 for drinks.26Foot Note 26×Tr/05.10.17/58/22 – 59/1. 22 Sometime in July 2013, the two exchanged phone numbers.27Foot Note 27×Tr/21.11.17/6/26–28.According to Suresh, the accused gave Suresh two phone numbers: 83567639 and 90356293.28Foot Note 28×Tr/05.10.17/56/4–27; Tr/22.11.17/3/30–32.These correspond to the first and second numbers that Mogan used to contact “India”. Suresh saved these numbers as belonging to “Appu bro” and “Apu2” respectively.29Foot Note 29×AB 155, s/n 7, 8. 23 During the period from 1 September to 5 September 2013, Suresh and the accused were communicating daily, using both the first and second numbers. According to Suresh, this was just “[n]ormal casual talk”, the specific details of which he could not remember. Suresh said that he was sure that it was the accused on the line, as he could recognise the latter’s voice.30Foot Note 30×Tr/05.10.17/58/8–19; Exhibit F, s/n 32–43 24 On 6 September 2013, sometime in the evening, Suresh met the accused by chance at the void deck of Block 34, Dover Road.31Foot Note 31×Tr/05.10.17/59/20–21, 60/1–2.Suresh could not remember what they discussed at the void deck, except that both he and the accused were due to report for a urine test at Clementi Police Station on that same day.32Foot Note 32×Tr/05.10.17/60/18–20.After the two parted ways, Suresh met his friend, one Shashi Kumar (“Shashi”), who had the use of a car. At 7.57pm, Suresh sent the accused a text message to the second number (ie,to “Apu2”), stating “Car stan by ready”.33Foot Note 33×Supplementary FORT Report (Exhibit P90) at p 18, s/n 6.According to Suresh, he had thought of giving the accused a lift since they both had to go for their urine test. However, he received no reply from the accused.34Foot Note 34×Tr/05.10.17/60/7–14. 25 At around 8.00pm, using Shashi’s car, Suresh and Shashi went to Clementi to obtain medical certificates to excuse themselves from attending the urine tests they were due to go for.35Foot Note 35×Tr/05.10.17/61–63.Sometime around 9.00pm, they left the clinic and headed to Pasir Panjang to buynasi lemakfor dinner. However, as it was raining heavily and they could not find a place to park Shashi’s car, they decided to buy dinner at the McDonald’s drive-through instead.36Foot Note 36×Tr/05.10.17/63/1–19. 26 At around 11.27pm, while he was at the McDonald’s, Suresh called the accused on his first number. The conversation lasted 52 seconds.37Foot Note 37×AB 353; Tr/05.10.17/24–29; Exhibit F, s/n 26–28.Suresh could not remember what they spoke about, although he mentioned that he had intended to ask the accused to join him for drinks at Block 34, Dover Road.38Foot Note 38×Tr/05.10.17/64/9–23. 27 At 11.52pm, Suresh received a call from the accused using the first number. The call lasted 42 seconds.39Foot Note 39×AB 353; Exhibit F, s/n 24.Suresh could not remember what the conversation was about.40Foot Note 40×Tr/05.10.17/65/13–17. 28 From 12.05am to 1.16am on 7 September 2013, Suresh spoke with the accused in a series of nine further phone calls. According to Suresh, the accused informed him that the accused’s friend would be arriving at the McDonald’s, and asked Suresh to call the accused to inform him if he were to see a silver car bearing a certain vehicle registration number.41Foot Note 41×Tr/21.11.17/32/28 – 33/11.Over the course of the night, the accused called Suresh repeatedly to check if he had seen a car matching the description.42Foot Note 42×Tr/05.10.17/69/1–8.Each time, Suresh would reply that he had not.43Foot Note 43×Tr/21.11.17/34/22–24. 29 Subsequently, the accused asked Suresh, “Is there anyone in the toilet?” According to Suresh, since he had to use the toilet at the time, he decided to go to the toilet at the McDonald’s to check.44Foot Note 44×Tr/05.10.17/69/29 – 70/1.At 1.19am, Suresh received a call from the accused, who asked him if there was anyone in the toilet. Suresh replied in the negative, and was walking out from the toilet when he was arrested by officers from the CNB.45Foot Note 45×Tr/05.10.17/70/28 – 71/13. 30 At the time of his arrest, one Nokia mobile phone was seized from him (marked as “SS-HP1”) bearing the phone number 93792362.46Foot Note 46×Tr/05.10.17/54/23 – 55/12; AB 346, s/n 2.",
        "The mobile phone records": "31 The mobile phones seized from Mogan and Suresh were sent for analysis. I set out in the table below the key call records between the mobile numbers of Mogan or Suresh on the one hand and the first number on the other. I note that the first number was saved as belonging to “India” and “Appu bro” by Mogan and Suresh respectively:   S/nTime of callCaller and recipientRemarks6 September 201319.25pmMogan received a call from “India”-211.27pmSuresh called “Appu bro”-311.50pmMogan called “India”Mogan has been arrested; this call was made under CNB direction411.52pmSuresh received a call from “Appu bro”-7 September 2013512.05am to 12.31amSuresh and “Appu bro” speak on five further occasions-612.33amMogan received a call from “India”Under CNB direction712.34amSuresh received a call from “Appu bro”-812.40am to 1.13amSuresh received two calls from “Appu bro”-91.14amMogan received a call from “India”Under CNB direction101.16amSuresh received a call from “Appu bro”-111.19amSuresh received a call from “Appu bro”Suresh is arrested after this call121.26amMogan called “India”Under CNB direction131.28am to 1.35amSuresh received three missed calls from “Appu bro”47Foot Note 47×AB 154, s/n 27–29.-141.38amMogan called “India”Under CNB direction151.41amSuresh received a missed call from “Appu bro”48Foot Note 48×AB 154, s/n 31.-161.46amMogan called “India”Under CNB direction171.50amSuresh received a missed call from “Appu bro”49Foot Note 49×AB 154, s/n 35.-181.57amMogan called “India”Under CNB direction192.00amMogan called “India”Under CNB direction",
        "Analysis of the drugs": "32 After the two blocks of vegetable matter marked “A1A1” and “A2A1 were seized from Mogan’s vehicle, they were subsequently sent to the Health Sciences Authority for analysis, and they were found to contain a total of 1017.9g of cannabis.50Foot Note 50×AB 336–337",
        "Events leading to the accused’s arrest": "33 The accused was not apprehended along with Mogan and Suresh on 6 and 7 September 2013. 34 The accused was first placed under arrest for failing to report for a urine test and for drug consumption on 23 January 2014.51Foot Note 51×Tr/26.04.18/17/8–9; Exhibit P92.He was charged in court on 1 February 2014 and subsequently released on bail on 3 February 2014.52Foot Note 52×Tr/26.04.18/18/4–25.At this point, he had yet to be linked to the arrests on 6 and 7 September 2013. 35 After being released on bail, the accused continued to fail to report for his urine tests. At a further court mention, bail was denied and he was placed under arrest on 3 March 2014.53Foot Note 53×Tr/26.04.18/20/23–25.Sometime in March 2014, the accused was identified as a person potentially linked to the arrests on 6 and 7 September 2013.54Foot Note 54×Tr/22.11.17/29/30–32.By that time, the accused was already in remand and none of his mobile phones could be recovered for analysis.55Foot Note 55×Tr/22.11.17/29/22–23.",
        "The accused’s 24 April 2014 statement": "36 After the accused was linked to the arrests on 6 and 7 September 2013, five statements were recorded from him by Inspector Ng Pei Xin (“Insp Ng”). Pursuant to s 258(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”), the Prosecution sought to admit one of the accused’s long statements recorded under s 22 of the CPC on 24 April 2014.56Foot Note 56×AB 382.The accused did not object to the admissibility of the statement.57Foot Note 57×Tr/22.11.17/27/15–17. 37 In the 24 April 2014 statement, the accused gave his version of the events which transpired on 6 September 2013. I outline the salient points: (a) In the personal particulars section of the statement, the accused declared his occupation as “Shop owner” and his place of employment as “Mahendran Provision Shop at 115 Tuas South Avenue 1”.58Foot Note 58×AB 382. (b) The accused first got to know Suresh when he was about 13 or 14 years old. He knew Suresh as “Don”. He had run into Suresh sometime in 2013 at a coffeeshop at Block 34, Dover Road, and would have a drink and chat with Suresh occasionally. The accused and Suresh exchanged phone numbers. He knew Shashi as “Warrior”.59Foot Note 59×AB 382 at para 2. (c) Sometime in August or September 2013 (which the accused confirmed in a subsequent statement to be 6 September 2013), the accused reported to Clementi Police Station for a urine test. As he was walking out of Clementi Police Station at around 9pm, he saw Suresh and Shashi. They asked him to join them for dinner, but he declined as he needed to return to his mini-mart at Tuas. The accused then took a taxi to his mini-mart at Tuas, and remained there until about 2.00am, when he closed the shop and returned to his home in Bukit Merah.60Foot Note 60×AB 383 at para 3. (d) The accused had run into Suresh at Dover the day before he was to report for the urine test. While the two talked about going for the urine test the next day, no arrangements were made for them to go together.61Foot Note 61×AB 383 at para 4. (e) The accused stated that he had two mobile phone numbers:62Foot Note 62×AB 383 at para 5. (i) The number 90356293 was given to the officer he reported to for his urine tests, and was also the number he used in respect of matters relating to the mini-mart. I pause to note that this number corresponds to the second number,ie, the number saved by Mogan as “India.jus” which was used to contact “India”, and saved by Suresh as “Apu2” which was used to contact the accused. (ii) The number 81787447 was for his personal use, and was used to contact friends and family. (iii) The accused said that he did not recall using the first number, 83567639. (f) The accused denied having asked Suresh to collect drugs or having arranged to meet somebody to collect drugs on 6 September 2013 at the McDonald’s at West Coast Park.63Foot Note 63×AB 383 at para 6.",
        "": "",
        "Close of the Prosecution’s case": "38 At the close of the Prosecution’s case, I found that there was sufficient evidence against the accused and called upon him to give evidence in his own defence.",
        "The defence": "",
        "The remaining four statements": "39 At the trial, the Defence sought to admit the remaining four statements made by the accused. The Prosecution did not object to the admission nor the admissibility of these statements.64Foot Note 64×Tr/22.11.17/38/1–7.The four statements were: (a) The cautioned statement recorded under s 23 of the CPC by Insp Ng on 19 May 2014 (marked “D1”). (b) Three long statements recorded under s 22 of the CPC by Insp Ng on 22 May 2014 at 11.43am and 5.24pm, and on 23 May 2014 at 11.08am (marked “D2”, “D3” and “D4” respectively). 40 In his cautioned statement, after having been read the charge, the accused said, “I do not know about this. I am not involved in this thing.”65Foot Note 65×D1 at p 4. 41 In his two long statements recorded on 22 May 2014, the accused gave further details of the points he had outlined in the 24 April 2014 statement: (a) The accused had been working at the “Mandaran Provision Shop” since January 2013. The shop belonged to his uncle, Mandaran.66Foot Note 66×D2 at para 7.His sister often helped him out at the shop. (b) After the accused and Suresh had met about three or four times, they exchanged mobile phone numbers. The accused gave him the number 90356293 (the second number).67Foot Note 67×D3 at para 19According to the accused, besides chatting with Suresh at the coffeeshop, he would not specially contact Suresh to arrange meetups.68Foot Note 68×D3 at para 20. (c) On 5 September 2013, after closing the shop, the accused went with his sister to her home at Dover as she needed help with carrying some of the provisions home. On the way to his sister’s apartment, he saw Suresh and two of Suresh’s friends drinking beer at the coffeeshop at Block 34, Dover Road. Suresh told the accused that he would also be going for his urine test on 6 September 2013. The accused told Suresh that he would be going around 8pm to 9pm, and Suresh said that he would meet him there.69Foot Note 69×D2 at para 14. (d) On 6 September 2013, the accused went for his urine test at Clementi Police Station at around 9.00pm. He did not contact Suresh, and simply waited for about five to ten minutes outside Clementi Police Station. When Suresh did not arrive, he went for the urine test alone.70Foot Note 70×D2 at paras 13, 15.When he left Clementi Police Station at around 9.15pm, he saw Suresh and Shashi. They spoke briefly. The accused declined their invitation to go for dinner together, and instead took a taxi to the mini-mart at Tuas, where he celebrated his sister’s birthday together with either his nephew or his niece.71Foot Note 71×D2 at paras 16–17. 42 The accused’s long statement dated 23 May 2014 was recorded in a “question and answer” format: (a) When asked how Mogan could have obtained the second number,ie,90356293, the accused said that he did not know why Mogan had his number. When asked why there were so many calls between him and Mogan on 6 and 7 September 2013, the accused again replied that he did not know why.72Foot Note 72×D4 at A1, A3. (b) When asked why, on 6 September 2013 at 7.57pm, Suresh had sent a text message to the second number,ie,90356293 saying “Car stan by ready”, the accused said that he has lost his mobile phone on numerous occasions, and that someone else might have been using his number:73Foot Note 73×D4 at A4. I don’t know if someone used my number. This is because I have lost my number many times. When I took taxi, I misplace my handphone. This has happened many times. I usually hold onto my handphone when I go into the taxi. This happened mostly at Tuas. I used my handphone to call a taxi and then placed it at the busstop and misplaced it.",
        "The accused’s evidence": "43 In essence, the accused’s defence was that he was not the person communicating with Mogan and Suresh on 6 and 7 September 2013 using the first and second numbers.74Foot Note 74×Tr/26.04.18/48/5–9, 44/1–4.He denied knowing Mogan prior to his arrest,75Foot Note 75×Tr/26.04.18/48/5–9.and insisted that he had not spoken to Mogan on 6 and 7 September 2013, or indeed at any time before that.76Foot Note 76×Tr/26.04.18/48/22–24.Further, the accused denied that he had contacted Suresh on 6 or 7 September 2013 after they parted ways at Clementi Police Station,77Foot Note 77×Tr/26.04.18/44/1–4.and said that in any case he had only given Suresh the second number.78Foot Note 78×Tr/26.04.18/37/16–21.In short, he denied having anything to do with the first number.79Foot Note 79×Tr/26.04.18/36/2–3. 44 In respect of Suresh’s evidence that the accused was the person using the first number on 6 and 7 September 2013, the accused claimed that Suresh was giving false evidence so as to implicate the accused and thereby exculpate himself.80Foot Note 80×Tr/26.04.18/49/27–32. 45 As for the second number, the accused admitted to having used that number from May 2013, but claimed that he had lost the corresponding mobile phone on 7 August 2013, and had not used the second number thereafter.81Foot Note 81×Tr/26.04.18/34/9–18, 36/10–12.He surmised that someone else may have recovered the mobile phone and thereafter used it to contact Suresh, although he had absolutely no idea who that person might be.82Foot Note 82×Tr/30.04.18/7/26–30. 46 When he was asked why he had not stated the loss of the phone bearing the second number,ie,90356293 in his 24 April 2014 statement, he claimed that hehadtold Insp Ng about it after the recording of the statement had been completed.83Foot Note 83×Tr/26.04.18/63/23 – 64/14.He also claimed that he had asked for a Tamil interpreter for the recording of that same statement, but was not provided with one, with the result that he did not fully understand the statement when it was read back to him. He claimed that he had informed Insp Ng of his request, and that he had been unable to understand the certain parts of the statement.84Foot Note 84×Tr/26.04.18/62/4–6.",
        "Decision on conviction": "47 I shall now state the law applicable to the charge against the accused, analyse the relevant evidence and state my findings.",
        "The law": "48 Section 12 of the MDA states as follows: Abetments and attempts punishable as offences 12.Any person who abets the commission of … any offence under this Act shall be guilty of that offence and shall be liable on conviction to the punishment provided for that offence. Further, s 107(b) of the Penal Code (Cap 224, 2008 Rev Ed) provides the elements of a charge of abetment by conspiracy:  Abetment of the doing of a thing 107.A person abets the doing of a thing who — … (b) engages with one or more other person or persons in any conspiracy for the doing of that thing, if an act or illegal omission takes place in pursuance of that conspiracy, and in order to the doing of that thing; … 49 Therefore, the two elements which must be proved beyond a reasonable doubt for the charge to be made out are as follows: (a) The accused had engaged in a conspiracy for Mogan to deliver 1017.9g of cannabis on 6 September 2013 to himself; and (b) An act was committed in pursuance of the aforementioned conspiracy. 50 In addition, the Court of Appeal has affirmed that where the accused person is himself the intended recipient of the offending drugs (as was the case here), an additionalmens reaelement must be proved –viz, that the accused, as abettor, himself intended to traffic in the offending drugs (Ali bin Mohamad Bahashwan v Public Prosecutor and other appeals[2018] 1 SLR 610 at[75]–[78]). Thus, the Prosecution also had to prove that the accused, as the intended recipient of the offending drugs, intended to traffic in those drugs.",
        "Conspiracy to traffic in cannabis": "51 The crux of the Prosecution’s case was that the accused used the first number to communicate with both Mogan and Suresh to coordinate the delivery of cannabis to himself. The crux of the defence was that the accused was not involved at all in the transaction; he had nothing to do with the first number. Whether the accused had used the first number on 6 and 7 September 2013 52 Having reviewed the evidence, I found that the accused was using the first number on 6 and 7 September 2013. My reasons are as follows. Mogan’s evidence 53 Mogan’s clear evidence was that the first and second numbers belonged to the same person. Indeed, Mogan testified that he had communicated with the person known to him as “India” usingboththe first and second numbers. It was quite telling thatbothMogan and Suresh had saved the first and second numbers with names that indicated that they were alternate contact numbers for the same person. Mogan saved the numbers in MV-HP1 as “India” and “India.jus” respectively, and Suresh saved the numbers as “Appu bro” and “Apu2” respectively. I accepted this important aspect of Mogan’s evidence. The accused’s admission 54 The fact that the first and second numbers belonged to the same person was crucial to the Prosecution’s case because by the accused’s admission in the 24 April 2014 statement set out below, he was using the second number. Admittedly, he only claimed to use it to communicate with the officer he reported to for his urine test, as well as for business relating to the shop as follows:85Foot Note 85×AB 383 at para 5. I have two handphone numbers – one for the shop and one for my personal use. The number 90356293 is used to give to my urine test officer and for my shop … I only have 2 handphone numbers. 55 In a bid to further distance himself from the second number, the accused claimed that he had lost the mobile phone bearing the number 90356293 on 7 August 2013, and had not used that number since. I was unable to accept his evidence. The accused first mentioned that he had lost that mobile phone only in his final long statement recorded on 23 May 2014. If it were true that he had lost that mobile phone, and was no longer using the second number at all, one would have expected him to mention that fact in the 24 April 2014 statement. Instead, the accused’s unqualified position at that time was that “the number 90356293 is used to give to my urine test officer and for my shop”. 56 In fact, his allegation in his final long statement on 23 May 2014 that he had lost the mobile phone only came in response to asubsequentquestion that Insp Ng asked him about the second number 90356293. Her first question had been: “If you don’t know Mogan before you entered Changi Prison Complex this year, how come he has your number 90356293?” To this, he simply said “I don’t know how come he hasmynumber” [emphasis added], again, without any qualification as to his ownership of and use of that number. In asubsequentquestion, Insp Ng asked him about the message sent by Suresh “Car stan by ready” to the second number on 6 September 2013. It was only then that the accused sought to explain that he had lost the mobile phone bearing the number 90356293, and that someone else might have used the number afterward. 57 When confronted with his omission to state that he had lost that mobile phone on 7 August 2013 in his 24 April 2014 statement, the accused alleged that he had informed Insp Ng about that fact after the conclusion of the recording of the statement. This was a spurious and baseless allegation which was first brought up during cross-examination of the accused. No mention of Insp Ng’s failure to record what he had stated was made in the accused’s examination-in-chief. Further, the accused did not explain the loss of the mobile phone in any of the subsequent statements that the accused gave (which the Defence adduced at the trial), and only raised this in response to a subsequent question asked by Insp Ng in the final long statement. On her part, Insp Ng maintained that the accused had said no such thing to her, and gave clear evidence that she would have amended the statement to add the accused’s further comments had he made them. 58 The accused also alleged that his repeated requests for the assistance of an interpreter during the recording of his 24 April 2014 statement had been denied. As a result, he did not fully understand Insp Ng’s questions, nor the recorded statement when it was read back to him. Again, this was a bare allegation raised for the first time during his cross-examination, which I found rather disingenuous given the accused’s admission that he had made no such request for any of the other statements subsequently recorded from him.86Foot Note 86×Tr/30.04.18/10/18–20. 59 For the foregoing reasons, I rejected the accused’s claim that he had lost the mobile phone bearing the second number on 7 August 2013. In my view, that claim was nothing more than an afterthought concocted to distance himself from the second number after he became aware of its potential to incriminate him, because of the message sent by Suresh to the second number on 6 September 2013. I further rejected his evidence that he no longer had use of the second number from 7 August 2013. Suresh’s evidence 60 The Prosecution’s case was further corroborated by Suresh’s direct evidence that the accused was the person using both the numbers, and that in particular, the accused was the person using the first number on 6 and 7 September 2013 as follows: (a) First, Suresh was categorical in stating that he could recognise the accused’s voice and was certain that it was the accused and no one else on the line in all of his communications with the first number on 6 and 7 September 2013. (b) Second, while “Appu” is a fairly common name or term of address, the names under which Suresh had saved the first and second numbers – “Appu bro” and “Apu 2” respectively – further indicated that they belonged to the accused, whom Suresh knew as “Appu”.87Foot Note 87×Tr/21.11.17/7/20–21. 61 In response, the Defence sought to cast doubt on the credibility of Suresh’s account. First, the Defence pointed to inconsistencies in Suresh’s evidence as to whether and when he had called the accused to inform him that he was at the McDonald’s.88Foot Note 88×DCS at paras 24–26.The Defence also raised inconsistencies in Suresh’s testimony as to whether he (Suresh) had thought what he was doing was illegal.89Foot Note 89×DCS at paras 37–39.In my view, these were minor inconsistencies which did not detract from the main thrust of Suresh’s evidence – that he was in communication with the accused on 6 and 7 September 2013 using the first number. 62 Second, the Defence submitted that Suresh’s evidence that the accused had instructed him to check the toilet at the McDonald’s was incredible, given his admission that the accused had not told him which toilet to look into nor given him any description of who he was to look out for.90Foot Note 90×DCS at paras 28–31.However, Suresh’s evidence on this point was corroborated by SI Tay’s records of “India’s” instructions to Mogan. The entry for “0120” stated that Mogan informed “India” that he was at the toilet in the McDonald’s, and the entry for “0135” stated that “India” informed Mogan that he had asked a “fat Indian” friend of his to collect the cannabis from Mogan on his behalf. It was undisputed that Suresh weighed some 110kg at the material time,91Foot Note 91×Tr/21.11.17/46/6–11.and therefore fitted “India’s” description to Mogan of the person whom “India” had sent to collect the cannabis from him. 63 While there was another public toilet in the vicinity, that public toilet was not in theimmediatevicinity of the McDonald’s, as can be seen from the sketch plan made of the area. That sketch plan showed that there was only one male toilet in the McDonald’s.92Foot Note 92×AB 48–51.Given that Suresh had informed “Appu bro” that he was at the McDonald’s, it was not surprising that Suresh understood “Appu bro’s” reference to a “toilet” to mean the toilet in the McDonald’s. 64 Finally, it was argued that Suresh had a motive to falsely implicate the accused to exculpate himself as he too was facing a capital charge arising from the events of 6 and 7 September 2013, and had only been given a discharge not amounting to an acquittal in respect of that charge.93Foot Note 93×DCS at paras 52–54.Further, it was pointed out that Suresh was himself involved in the drug trade, and admitted to having collected drugs for others in return for payments in kind.94Foot Note 94×DCS at paras 45–49.While I appreciated Suresh’s background, I did not accept that Suresh would profit from falsely implicating the accused in the transaction. As I explain at [66]–[69] below, it was clear to me that Suresh could not have been the person using the first and second numbers, and he need not have fabricated evidence against the accused as the user of the numbers in order to save himself. Given that Suresh and the accused had been longstanding friends with no history of hostility or ill-will,95Foot Note 95×Tr/05.10.17/52/11–13.I did not see any basis for the accused’s allegation that Suresh’s evidence was given with the intent of falsely implicating him. The accused’s defence 65 I turn now to the accused’s case. In its written submissions, the Defence took the position thatSureshwas the person who had coordinated the transaction using the first number, and not the accused. First, Suresh largely fitted the description of “India” given to Mogan (see [13] above);96Foot Note 96×DCS at paras 16–22.it was undisputed that Suresh was 37 years old at the material time, was about 1.76m in height, and wore three pieces of gold jewellery.97Foot Note 97×Tr/22.11.17/11/1–30.In contrast, the description of “India” given to Mogan did not fit the accused at all. Also, the call records showed that Suresh had dialled Mogan’s number on two occasions; once on 5 September 2013 and once again on 6 September 2013, less than three hours before his arrest.98Foot Note 98×DCS at paras 50–51.This showed that Suresh was associated with Mogan. 66 Having considered Suresh’s and the accused’s evidence at the trial, as well as the call records, I rejected the Defence’s argument that it wasSureshwho had been the person coordinating the transaction. First, the Defence’s position that Suresh was “Appu bro” was never put or suggested to Suresh in cross-examination. In my view, this was an allegation of such grave importance that it should have been raised to him. 67 Second, the objective evidence (in the form of call records) showed that Suresh could not have been the user of the first number. On 6 and 7 September 2013, Mogan communicated with “India” exclusively over the phone using the first number to coordinate the intended drug delivery. The user of the first number could not have been Suresh, since Suresh’s mobile phones were seized upon his arrest at the McDonald’s, and subsequent verification showed that Suresh’s phone number was 93792632. After Suresh’s arrest, SI Tay directed Mogan to call “India” to ascertain whether the police had arrested the right person. However, the call was received by another person, meaning that “India” and Suresh could not have been the same person:99Foot Note 99×Tr/05.10.17/9/23–24, 10/1–6. A: … shortly after we arrived, I’d heard over the radio set that there was one Indian who was arrested … at the McDonald’s. … A: Shortly after we arrived at the car park … in order to ascertain that the person who was arrested to be the “India”, I … dialled that number, and before that, I informed the arresting party … to look out for the arrested guy’s handphone, see whether will it ring so that it would tally that he’s the intended recipient. So after I dial the number, apparently the “India” pick up the call … and immediately Mogan spoke to him. … 68 After Suresh was arrested at around 1.20am on 7 September 2013, he would not have been in any position to receive any calls. The fact that Mogan spoke to “India” a further five times from 1.20am till 2.00am100Foot Note 100×Exhibit F, s/n 1, 2, 5, 7, 11.served as further confirmation that Suresh could not be “India”. This was further bolstered by the call records preceding Suresh’s arrest, which disclosed a total of three calls made between Mogan and the first number, followed quickly by calls between the first number and Suresh’s mobile phone. There was no reason in fact or logic to believe that Suresh would have made multiple calls to himself after each call with Mogan. Suresh and the user of the first number were different persons. 69 I come to the Defence’s point that Suresh had dialled Mogan’s number twice in the days leading up to his arrest on 7 September 2013. In this regard, Suresh vehemently denied that he had dialled Mogan’s number in the face of irrefutable objective evidence to the contrary. While this might have cast some doubt on whether Suresh knew of or about Mogan prior to his arrest, the important point remained that Suresh did not speak to Mogan during these two calls. It was undisputed that while the call records showed that Mogan’s number had been dialled, the calls never went through; Suresh did not speak to Mogan. Therefore, for the transaction, there was no objective evidence of any arrangement made by Suresh with Mogan. As I stated above, apart from this aspect as to whether Suresh knew of or about Mogan, I found Suresh’s evidence to be reliable. 70 In sharp contrast, I found the accused not to be a credible witness. As detailed in [55]–[58] above, he attempted to distance himself from the second number by claiming that he had lost his mobile phone. In doing so, he made unwarranted allegations against Insp Ng in relation to the recording of the 24 April 2014 statement. In addition, there were these two clearly unsatisfactory aspects of his evidence: (a) First, the accused claimed that when he reconnected with Suresh in July 2013, he only gave the second number to Suresh. If his version that he lost his mobile phone on 7 August 2013 were to be believed, Suresh would not have been able to contact the accused thereafter. Yet, there were occasions in August 2013 when they met up for drinks. Even then, the accused did not inform Suresh that he had lost his mobile phone, or inform Suresh of his other number being 81787447. Indeed, according to the accused, they met on 5 September 2013, and arranged to go for the urine test at around 8pm to 9pm on 6 September 2013. They also met on 6 September 2013. Still, the accused did not furnish Suresh with a contact number. His evidence defied logic. (b) Second, in line with the contents of his statements, the accused stated in his oral testimony that he reported for his urine test on 6 September 2013. As he left the police station, he noticed Suresh and Shashi at a car parked along the road. He then added that Suresh informed him that Suresh had obtained a medical certificate. Suresh then walked to the guard post to submit the medical certificate to a police officer there. Suresh denied meeting the accused at Clementi Police Station. Indeed, having obtained a medical certificate to avoid taking the urine test, there was no reason for Suresh to submit it on the same day, risking detection and arrest by the police. In this regard, the unchallenged evidence of Nurazhar bin Sadikin, the accused’s supervision officer, was that supervisees need to submit their medical certificates personally to the supervision officers. Furthermore, Suresh’s medical certificate was seized upon his arrest at the McDonald’s. Clearly, the accused had not been truthful about his interactions with Suresh that night. Viewed in totality, the accused’s evidence was unbelievable. Conclusion 71 Based on all of the foregoing, I found that it was the accused who was using the first number on 6 and 7 September 2013 to communicate with both Mogan and Suresh. On the accused’s own admission, he was the user of the second number, which in turn linked him to the first number, given Mogan and Suresh’s clear evidence that both the first and second numbers were used by the same person. This evidence was corroborated by direct evidence from Suresh that the person he had been in communication with on 6 and 7 September 2013 was none other than the accused. 72 For completeness, I should add that another piece of evidence from Mogan reinforced this finding. Mogan stated that initially, he had called the first number, and “India” had told him that he could secure a job for Mogan at a mini-mart in Tuas. The accused, of course, operated a mini-mart in Tuas and by his own evidence had the power to engage help as he saw fit.101Foot Note 101×D2 at paras 8–9.This strengthened the case that “India” was in fact the accused. As stated, I also rejected the accused’s submission thatSureshhad been the user of the first number at the material time.",
        "Whether the accused coordinated the delivery of cannabis to himself": "73 Having established that it was the accused who was the person using the first number, I proceed to deal with whether the accused had engaged in the conspiracy to traffic in cannabis. 74 In this regard, based on the evidence adduced from Mogan, he was instructed by “Selva” to deliver the cannabis to “India” in Singapore. Further, based on the evidence of Mogan, Suresh and SI Tay, the accused’s plan for the delivery of cannabis had evolved over the course of 6 and 7 September 2013. Initially, the plan was for Mogan to pass the cannabis to “India” (ie, the accused) at the toilet at McDonald’s. Subsequently, the accused informed Mogan that he would be asking his “fat Indian” friend to collect the cannabis. The accused coordinated the delivery by Mogan on the one hand, and the receipt by Suresh on the other. He did so by checking that Mogan was still at the toilet of the McDonald’s, before asking Suresh to check if there was anyone in the toilet at the said McDonald’s. 75 It was also clear that the accused knew that the delivery was of a consignment of cannabis. SI Tay testified that he had heard “India” (ie, the accused) specifically mention the word “ya lei”: Q: Now, I note that there is reference to these words “ya lei” at the third line. How did this come about? A: During the conversation between Mogan and the “India”, I heard “ya lei” was being brought up a couple of times. … so I asked [Mogan] what does “ya lei” means and he said, “Leaves”. … Q: Who had mentioned the words “ya lei”? A: “India” did mention “ya lei”. … 76  “Ya lei”, or “yellai”, transliterated, means “leaves” in Tamil. This was a term which the accused himself had used during the phone conversation when referring to the thing which his friend was to collect from Mogan at the toilet at the McDonald’s. In my view, given the context of the discussion, “ya lei” could mean nothing other than the cannabis, and the accused would have known this, being a user of cannabis himself. I did not accept the accused’s bare denial that he did not know that “ya lei” meant cannabis.102Foot Note 102×Tr/26.04.18/69/24–26. 77 By all of the above, I found that the accused knew that Mogan was delivering cannabis, and that he had coordinated the delivery of the said cannabis to himself by instructing Mogan to pass the cannabis to Suresh, who was to collect the cannabis on the accused’s behalf. The accused had engaged in a conspiracy with Mogan for Mogan to deliver the 1017.9g of cannabis to himself. 78 To round off, I should deal with the Defence’s argument that the Prosecution ought to have called Shashi as a witness, since he was in the car with Suresh at the material time and would have been privy to the conversations (at least from Suresh’s end) between Suresh and “Appu bro”.103Foot Note 103×DCS at paras 32–36.While Shashi’s evidence would have been relevant in that it would have either corroborated or contradicted Suresh’s evidence, I accepted that the Prosecution had taken reasonable steps to locate Shashi, including calling him on his mobile phone and sending him letters at his registered address. The mere fact that the Prosecution had not made attempts to call on himin personat his registered address did not undermine the Prosecution’s case. Moreover, I should stress that in finding that the accused was the user of the first number, I had relied not just on Suresh’s evidence, but also on Mogan’s evidence and the accused’s own admission.",
        "Act pursuant to conspiracy": "79 Next, it was undisputed that Mogan had brought into Singapore 1017.9g of cannabis, and was on the way to deliver the cannabis to “India” (which, as I have found, referred to the accused) when he was arrested. This constituted an act committed in pursuance of the aforementioned conspiracy, and satisfied the second element of the charge.",
        "Intention to traffic": "80 Finally, the Prosecution must prove the additionalmens reaelement of an intention to traffic, since the intended recipient of the drugs was the accused himself. Where the quantity of the drug possessed is many times what a typical addict would be able to consume on a daily basis, the likelihood is that the offender has the drug in his possession not for personal consumption, but for the purpose of trafficking (Ong Ah Chuan v Public Prosecutor[1979–1980] SLR(R) 710 at [29]). Here, a large quantity of cannabis was involved, being more than twice the amount which would attract the death penalty. It was not argued that the cannabis was intended for the accused’s own consumption, nor was any evidence led by the Defence in that respect. Therefore, I found that given the large quantity of cannabis involved, the accused had intended to traffic in the said cannabis.",
        "Conclusion": "81 By the foregoing, I found that the Prosecution had proved the charge against the accused beyond a reasonable doubt. I found him guilty and convicted him of the charge.",
        "Decision on sentence": "82 As I had earlier mentioned, the prescribed punishment under s 33(1) read with the Second Schedule of the MDA is death, although the alternative sentencing regime in s 33B(1)(a) of the MDA provides the court a discretion to impose a mandatory term of life imprisonment and 15 strokes of the cane where (i) the offender satisfies the court that his acts fall within s 33B(2)(a)(i)–(iv) of the MDA, and (ii) the Public Prosecutor certifies that the offender has substantively assisted the CNB in disrupting drug trafficking activities within or outside Singapore. 83 Here, the accused was meant to take delivery of the cannabis, and, as I have found above, this was meant for the purpose of trafficking, and not for his own consumption. Given the nature of his defence, the accused did not give any evidence that he was merely todeliverthe cannabis. I therefore found that he has not proved on a balance of probabilities that he was a mere courier. Also, the Public Prosecutor has not issued a certificate of substantive assistance. Therefore, the alternative sentencing regime was not available. Accordingly, I imposed the mandatory sentence of death on the accused. Hoo Sheau PengJudge Anandan s/o Bala and Kee Yongwen Kenneth (Attorney-General’s Chambers) for the Public Prosecutor;Ram Goswami (Ram Goswami) and Cheng Kim Kuan (KK Cheng & Co) for the accused."
    }
}