{
    "case_title": "Re the Attorney-General",
    "ncitation": "[2018] SGHC 49",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "The law": "4 I start with the law, which is not controversial. 5 State Counsel for the Attorney-General, Mr Khoo Boo Jin (“Mr Khoo”), accepted that the court has case management discretion to adjourn or stay the hearing of the committal proceedings, citingChan Chin Cheung v Chan Fatt Cheung and ors[2010] 1 SLR 1192 at [15] in support. He then drew my attention toBNP Paribas Wealth Management v Jacob Agam and anor[2016] SGHC(I) 5, where the court took into account the bona fides of the stay application (or the lack thereof) and the need to balance the advantages and disadvantages to each of the parties, among other factors. Mr Khoo also citedEleven Gesellschaft Zur Entwicklung und Vermarktung Von Netzwerktechonologien MBH v Boxsentry Pte Ltd[2014] SGHC 210 for the proposition that the mere existence of simultaneous proceedings did not necessarily mean that a stay would be granted as of right. I should add that the parties’ conduct is an important consideration and that the decision whether or not to grant a stay application must fundamentally depend on whether it is fair to the parties. The burden is on Mr Ong to persuade the court to stay proceedings in exercise of the court’s case management discretion.",
        "Main reasons advanced for a stay": "",
        "Undivided attention": "6 Mr Ong is a litigant in person and has no legal representation. He said that he is the personal representative of his mother’s estate in the ongoing OS 763/2014 proceedings. As there is a pending appeal, namely CA 178, Mr Ong argued that he would only be able to attend to the committal proceedings after the conclusion of OS 763/2014 and CA 178, since both matters require his undivided attention. 7 The question raised by Mr Khoo was whether Mr Ong has done enough to persuade the court to exercise discretion in his favour. Mr Khoo pointed out that Mr Ong had not substantiated his assertion that OS 763/2014 and CA 178 needed his undivided attention. Nothing was adduced in Mr Ong’s affidavits to show the existence of timelines to meet or that hearing dates had been given for OS 763/2014 and CA 178. 8 I accepted Mr Khoo’s submissions that there is nothing on the evidence to support Mr Ong’s point that CA 178 and OS 763/2014 required his undivided attention, and that he could not prepare for the committal proceedings. In fact, there is no time pressure on him in respect of the CA 178, which is an appeal against some orders made by Judicial Commissioner Pang Khang Chau in OS 763/2014 relating to a dispute involving Mr Ong and his siblings in respect of their mother’s estate. As stated, Pang JC gave various orders on 25 September 2017 and adjourned certain outstanding matters to a date to be fixed by the Registry. Two days later, on 27 September 2017, Mr Ong filed CA 178 against three matters alleged to be part of the decision given on 25 September 2017 in OS 763/2014. Pang JC has yet to release his written grounds in relation to OS 763/2014 and, no directions and no hearing date have been given for CA 178. 9 Bearing in mind that there was no other evidence identified or provided at the time of the hearing to show that CA 178 and OS 763/2014 required Mr Ong’s undivided attention, I concluded that this was not an appropriate case to stay the committal proceedings until after the disposal of CA 178 and OS 763/2014. Further, the court documents for the committal proceedings were served on Mr Ong on 7 September 2017. It was not disputed that Mr Ong had been on notice of the committal proceedings for months. Notably, it is not Mr Ong’s case that he has no time to prepare for the hearing of the committal proceedings. In these circumstances, there is no merit in the suggestion that Mr Ong will be put at a disadvantage by a refusal to adjourn the hearing of the committal proceedings until the disposal of CA 178 and OS 763/2014.",
        "CA 178 and OS 763/2014 are connected to the committal proceedings": "10 In argument, Mr Ong referred to three paragraphs of the Attorney-General’s statement (the “Statement”) supporting the committal proceedings. I will set out the details of paragraphs 20(e), 61(c) and 63(d) of the Statement shortly. Suffice to say for now that the argument is premised on alleged overlaps between the issues in the committal proceedings and those in OS 763/2014 and CA 178. This is because the Attorney-General is relying on matters that transpired in OS 763/2014 in the Statement, and it stands to reason that OS 763/2014 and CA 178 should be disposed of before the hearing of the committal proceedings. In short, the Attorney-General’s reliance on OS 763/2014 necessitated a stay of the committal proceedings until after the disposal of CA 178. 11 Furthermore, to Mr Ong, CA 178 is a substantive appeal. It should therefore proceed first. It would be akin to putting the cart before the horse if the committal proceedings were to be heard first. He maintained that he would suffer prejudice as a consequence. Mr Ong, however, did not elaborate on the prejudice he had in mind. The essential point underlying this ground is that it would be unfair to Mr Ong if a stay of the hearing of the committal proceedings were disallowed. 12 Responding, Mr Khoo pointed out that CA 178 was filed in September 2017 soon after the papers for the committal proceedings were served on Mr Ong and questioned Mr Ong’s choice to appeal before the conclusion of OS 763/2014. And he further explained that Mr Ong’s choice to appeal was motivated by Mr Ong’s desire to delay the committal proceedings. 13 Apart from the choice and timing to appeal, Mr Khoo characterised CA 178 as a sham appeal given the subject matter of the appeal. The appeal pertained to three things, according to Mr Ong’s Notice of Appeal in CA 178: (a) the award of non-testamentary cash gifts; (b) the legitimacy of medical claim; and (c) “[c]osts issues, amongst which are the executor’s costs, including professional accounting costs are to have priority in accordance with pecking order of payment”. Mr Khoo relied on Pang JC’s Notes of Arguments of the hearing on 2 November 2017 for OS 763/2014 to support his assertion that CA 178 was a sham. On point (c), Pang JC said that he had not made any ruling on costs and would clarify this in his Grounds of Decision when issued. On points (a) and (b), Pang JC said that leave to appeal to the Court of Appeal would be required as the total sum involved was less than $250,000. 14 In the context of the stay application, my view is that it is not necessary to deal with the question of whether or not CA 178 was taken out prematurely or was a sham. This is a matter for the appellate court in CA 178. On the issue of whether or not to grant a stay sought by Mr Ong on the ground that CA 178 and OS 763/2013 are connected to the committal proceedings and that it would be premature for the committal proceedings to proceed before the conclusion of CA 178, I disagreed with Mr Ong’s contentions. There is nothing to the contentions for the following reasons. 15 OS 763/2014 is a dispute involving the mother’s estate and not the father’s estate. Matters involving the father’s estate were litigated in Suit No 385 of 2011 and was heard by Justice Woo Bih Li and concluded in 2012. In contrast, OS 763/2014 is a matter assigned to another judge, Pang JC. 16 Mr Ong did not appeal against Woo J’s decision. It was an outcome whereby Mr Ong won in part. Even though Mr Ong now claims that the issues in CA 178 are common to both the mother’s and father’s estates, the fact of the matter is that there was no appeal against Woo J’s decision and the decision in CA 178 would not change the outcome, effect and consequence of Woo J’s decision. 17 I agreed with Mr Khoo that there are no common issues that warrant a stay of the committal proceedings. Above all, the committal proceedings relate to Mr Ong’s contemptuous allegations against Woo J and have to do with the court’s contempt jurisdiction rather than a review of the merits of Suit No 385 of 2011. By way of background, Mr Ong applied in OS 165 of 2016 (“OS 165/2016”) to disqualify Woo J from hearing four legal actions involving the mother’s estate, including OS 763/2014. After the hearing of OS 165/2016, Woo J decided to recuse himself for the reasons explained in his decision reported asOng Wui Teck v Ong Wui Swoon[2016] 2 SLR 1067. 18 I now turn to Mr Ong’s reliance on paragraphs 20(e), 61(c) and 63(d) in the Statement for the committal proceedings to support his contention that OS 763/2014 and CA 178 are connected to the committal proceedings. Paragraphs 20(e) and 63(d) of the Statement point out that the proceedings regarding the mother’s estate, including OS 763/2014, have since carried on before different judges without any judge doubting Woo J’s ruling. Further, paragraphs 20(e) and 61(c) of the Statement point out that Mr Ong did not take any steps to vary or set aside Woo J’s rulings for alleged bias. Mr Ong’s position is that he does not need to wait until the conclusion of OS 763/2014 and CA 178 in order to respond to these paragraphs of the Statement. His position is self-evident. These paragraphs are factual narratives and do not serve as grounds to support a stay of the committal proceedings. In my view, no injustice will be caused if the committal proceedings are heard first, before CA 178 and OS 763/2014. As stated, the committal proceedings arose from a different set of proceedings, namely OS 165. In the circumstances, there was no reasonable basis to grant a stay of the committal proceedings. It would be appropriate to proceed with the determination of the issue of contempt. Leave to appeal 19 At the conclusion of the hearing, Mr Ong sought leave to appeal to the Court of Appeal. I granted him leave to appeal. I also confirmed that the hearing date of the committal proceedings would remain as 13 March 2018. Belinda Ang Saw EanJudge Khoo Boo Jin, Elaine Liew Ling Wei and May Ng  (Attorney-General’s Chambers) for the applicant;The respondent in person."
    }
}