{
    "case_title": "Chee Yin Mehv Sim Guan Seng and others",
    "ncitation": "[2018] SGHCR 14",
    "coram": "Justin Yeo AR",
    "sections": {
        "Background": "3 The piece of property in question (“the Property”) was purchased and registered in the sole name of Mr Fan Koh Him (“Mr Fan”) in May 2011. The payments towards the purchase price and renovation costs of the Property were made out of the following bank accounts and loans: (a) 1% of the purchase price (iethe option fee) was paid out of an Oversea-Chinese Banking Corporation account held jointly in the names of Mr Fan and the Plaintiff (“the OCBC Joint Account”) in May 2011, with another 15% of the purchase price paid out of the same account in August 2011. (b) 4% of the purchase price (iethe exercise fee) was paid out of a Post Office Savings Bank account held jointly in the names of Mr Fan and the Plaintiff (“the POSB Joint Account”) in May 2011. (c) 80% of the purchase price was to be paid by way of a mortgage loan from DBS Bank, which was taken out in Mr Fan’s sole name (“the DBS Mortgage Loan”). (d) The renovation costs were paid entirely from a separate loan from DBS Bank, which was also taken out in Mr Fan’s sole name (“the DBS Renovation Loan”). 4 Mr Fan was subsequently adjudged bankrupt on 30 March 2017. Mr Sim Guan Seng, Mr Khor Boon Hong and Mr Goh Yeow Kiang Victor (“the Defendants”) were appointed as private trustees pursuant to the bankruptcy order.  The Defendants sold the Property in the process of realising the assets of Mr Fan’s estate. 5 On 25 July 2017, the then-solicitors for Mr Fan’s wife, Mdm Chee Yin Meh (“the Plaintiff”), wrote to the Defendants, demanding that the Defendants account for the sale proceeds of the Property and distribute half of the sale proceeds to the Plaintiff on the basis that the Plaintiff had a beneficial interest in a half-share of the Property. In the letter, the Plaintiff’s then-solicitors emphasised that Mr Fan and the Plaintiff had “shared the cost of purchasing and renovation expenses of the [Property]”, and that at all times, Mr Fan intended to acquire the Property jointly and equally with the Plaintiff notwithstanding his sole legal title to the Property. The Plaintiff’s then-solicitors further emphasised that the Plaintiff would be “collating documents evidencing loan servicing payments and her financial contributions to the payment of the Purchase Price of the [Property]”. The letter enclosed more than 30 pages of documents, which included cheque stubs, cashier’s orders, mortgage loan agreements and a summary of cash transfers by the Plaintiff to one of the accounts. 6 On 11 October 2017, the Plaintiff’s then-solicitors wrote to the Defendants’ solicitors, enclosing another 100 pages of documents “evidencing loan servicing payments, [the Plaintiff’s] financial contributions to the payment of the Purchase Price of the [Property] and further relevant documents”. 7 On 24 July 2018, the Plaintiff brought an Originating Summons (“the OS”), seeking a declaration of her beneficial interest in a half-share of the Property on the basis of a common intention constructive trust. She further sought an order that the Defendants transfer half of the sale proceeds to her, after giving an account of the costs and disbursements incurred in the sale process. In the Plaintiff’s affidavit filed in support of the OS (“the Plaintiff’s OS Affidavit”), she averred that both she and Mr Fan had a common intention for the Property to be jointly owned by both of them. She also set out in considerable detail the financial arrangements in relation to the payment of the purchase price and renovation costs of the Property. This revealed a complex web of financial arrangements involving several bank accounts and loans, which allegedly underlay the payment arrangements stated in [3] above. A brief summary of these underlying financial arrangements is as follows: (a) From 2011 to 2015, the 15% paid out of the OCBC Joint Account came from a CIMB Bank account held jointly in the names of Mr Fan and the Plaintiff (“the CIMB Joint Account”). The funds for the CIMB Joint Account, in turn, came from a term loan from CIMB Bank (“the CIMB Loan”). The DBS Loan, the CIMB Loan and the DBS Renovation Loan were serviced by the balance of the disbursement under the CIMB Loan itself, as well as funds from the POSB Joint Account. (b) From 2016 to 2017, the DBS Loan and the DBS Renovation Loan were serviced by funds from the POSB Joint Account and a POSB account held solely in Mr Fan’s name (“Fan’s POSB Account”). In turn, the funds in the POSB Joint Account and Fan’s POSB Account allegedly came from the Plaintiff’s cash deposit as well as other DBS and UOB accounts held solely in the Plaintiff’s name. 8 In the light of the web of financial arrangements, the Defendants’ solicitors repeatedly requested the Plaintiff to furnish documents required for identifying the transactions and the source of the funds in the various accounts. The most recent request was made on 17 August 2018. The Plaintiff again objected to providing the documents sought, thus resulting in the Application being taken out on 13 September 2018. 9 As a footnote, given the extent of factual disagreement in relation to the Plaintiff’s financial contributions, it was somewhat puzzling that the substantive dispute was proceeding by way of an OS rather than a writ. However, the distinction did not have any impact on my decision, as neither party contended that discovery principles operated differently in an OS situation. Indeed, O 24 r 4(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“Rules of Court”) specifically states that the court may make a discovery order under O 24 r 1 of the Rules of Court regardless of the mode of commencement of proceedings (ie“whether begun by writ, originating summons or otherwise”).",
        "The Application": "10 By way of the Application, the Defendants sought specific discovery of documents that would enable them to determine the sources of the funds for the OCBC Joint Account (from 1 January 2011 to 30 September 2011), the POSB Joint Account (leading up to and after May 2011), the DBS Loan (from 2011 to 2017) and the CIMB Loan (from 2011 to 2017). The Defendants specified that the documents sought included documents that would enable the identification of those who had deposited money into or received monies withdrawn from the accounts in question. 11 In the lead up to the hearing, the Defendants independently managed to obtain account statements for some of the accounts held solely and in joint names by Mr Fan, as set out in the 4 October 2018 affidavit of Mr Goh Yeow Kiang Victor. As such, they were able to reduce the scope of the requests to the account statements which they had hitherto been unable to obtain from the various banks. 12 The Plaintiff resisted the Application on the basis that the documents sought were irrelevant for determining whether a common intention constructive trust arose, and that the discovery sought was in any event unnecessary.",
        "Issues": "13 The Application gave rise to two issues: (a) First, whether documents relating to the Plaintiff’s financial contributions in the purchase and renovation of the Property were relevant for determining the existence of the alleged common intention constructive trust. (b) Second, whether the discovery sought was necessary.",
        "First Issue: Whether the documents sought were relevant": "14 The main issue in the OS concerned whether the Plaintiff had a beneficial interest in a half-share of the Property on the basis of a common intention constructive trust. The first issue in the Application was therefore whether documents relating to the Plaintiff’s financial contributions in the purchase and renovation of the Property were relevant for determining the existence of the alleged common intention constructive trust.",
        "Parties’ Arguments": "33 Ms Lee contended that the discovery sought was oppressive as it required the Plaintiff to account for every transfer made in and out of multiple personal and joint accounts, over a period of one to seven years. It would also unjustifiably intrude into the Plaintiff’s personal matters, given that the discovery requests required her to identify the persons or entities who deposited money into or received money withdrawn from the accounts, even where these had nothing to do with the Property. In addition, she contended that the discovery requests were vague and unspecified, and that the Defendants were obliged to clearly delineate the documents required and to ensure that the requests were not wider than necessary. Ms Lee also surmised that even if discovery was ordered, it would be “almost certain” that the Defendants would have to inquire into the purpose of each deposit and withdrawal (iewhether it was for the benefit of the Plaintiff, Mr Fan, or both). As a result of all of the above, the probative value of the documents sought would be so slight such that, even if they existed, this would not justify the inconvenience that such discovery would cause to the Plaintiff. 34 Mr Yeo pointed out that as a starting point, the court may order discovery even if it would cause inconvenience to the Plaintiff (citingSingapore Court Practice 2018(Jeffrey Pinsler gen ed) (LexisNexis, 2018) at paragraph 24/1/5). He further went on to argue that the requests were not oppressive at all, raising four arguments: (a) First, the Plaintiff had already gone through the transfers and transactions and exhibited those favourable to her case in the Plaintiff’s OS Affidavit (while,inter alia, redacting the unfavourable portions). (b) Second, the alleged complexity of the discovery exercise arose entirely from the very nature of the Plaintiff’s own claims in the OS, where she delved into a complex web of financial arrangements. The complexity involved made it even more necessary for proper discovery to be given, so as to ensure that the Plaintiff’s financial contributions could be accurately assessed. (c) Third, the contention that the Defendants had to inquire into the purpose of each deposit and withdrawal was “bizarre”, because the Plaintiff had seen no need to provide any explanations for the transfers or transactions which she had exhibited in support of her position. Furthermore, such a contention would only suggest that the documents provided would be insufficient, and might well be a basis for further rather than less discovery. (d) Fourth, the Defendants had successfully obtained most of the relevant account statements involved, and had specifically listed the account statements that remained outstanding (see [11] above). This narrowed the scope of discovery sought, and undermined the Plaintiff’s arguments on oppressiveness.",
        "Decision": "35 It could hardly be said that the discovery sought was oppressive, particularly when keeping in view that the Defendants had proactively narrowed the scope of discovery (see [11] and [34(d)] above). The remaining discovery requests generally required the Plaintiff to request for her account information from the respective banks to, which does not appear to be a particularly onerous task. Indeed, the fact that the Plaintiff had already exhibited redacted versions of some of her account statements in her OS Affidavit suggested that she may already be in possession of the relevant information. 36 The requirement of necessity in O 24 r 7 of the Rules of Court is assessed at the particular “stage of the cause or matter” (see [32] above). This permits the court to calibrate discovery orders as necessary for the present stage of the proceedings, without prejudice to a wider scope of discovery being sought subsequently. In this regard, I was minded to limit the scope of discovery to transactions of a more significant value, as these would more likely have a greater bearing on the Plaintiff’s financial contributions to the Property. The narrowed scope would also help to minimise the costs involved in disclosing information and conducting further inquiries on the lower-value transactions, and would also provide some safeguard against unnecessary intrusion into the Plaintiff’s personal matters. 37 I therefore sought Mr Yeo’s submissions on a reasonable “floor” for the value of transactions for which discovery ought to be given at the present stage of the proceedings. Mr Yeo suggested the value of $20,000. Having considered a sampling of the account statements that had been independently obtained by the Defendants, I agreed that $20,000 would be a reasonable “floor” for discovery at this time. 38 I therefore found that the specific discovery sought, limited to the account statements that remained outstanding and to transactions of or exceeding $20,000, was necessary for the fair disposal of the OS and for the saving of costs. This would be without prejudice to the Defendants’ right to apply for a fuller scope of discovery should it become necessary to do so at a subsequent stage of the proceedings.",
        "Second Issue: Whether the discovery sought was necessary": "32 The second issue in the Application concerned the requirement of necessity in O 24 r 7 of the Rules of Court: Discovery to be ordered only if necessary (O. 24, r. 7) 7.On the hearing of an application for an order under Rule 1, 5 or 6, the Court may, if satisfied that discovery is not necessary, or not necessary at that stage of the cause or matter, dismiss or, as the case may be, adjourn the application and shall in any case refuse to make such an order if and so far as it is of opinion that discovery is not necessary either for disposing fairly of the cause or matter or for saving costs.",
        "Conclusion": "39 For the foregoing reasons, I granted the Application subject to the limitations described in [38] above. I further directed the Plaintiff to make the necessary requests to the banks within two weeks and to file and serve a list of documents within two months of the specific discovery order, with liberty to apply for a reasonable extension of time if so required. Justin YeoAssistant Registrar Ms Lee Ping and Ms Shirin Swah (Shook Lin & Bok LLP)for the Plaintiff;Mr Alexander Yeo and Mr Chew Jing Wei (Allen & Gledhill LLP)for the Defendants."
    }
}