{
    "case_title": "Sim Tian Siang (administrator of the estate of Shoo Hui Meng, deceased)vAw Yong Chyn Long and another",
    "ncitation": "[2018] SGHC 244",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "Introduction": "1 At the conclusion of the trial on liability in Suit No 1267 of 2016 (“the Suit”), I awarded to Sim Tian Siang (“the plaintiff”) interlocutory judgment against Aw Yong Chyn Long (“the first defendant”) and Thien Chin Tin (“the second defendant”) in the proportion of 10% and 90% liability respectively. I further ordered damages for the plaintiff to be assessed by the Registrar with the costs of trial reserved to the Registrar.1Foot Note 1×NE 20 July 2018, pp 36-38.As the second defendant has appealed against my decision (in Civil Appeal No 129 of 2018). I now set out the grounds for my judgment.",
        "The facts": "2 The facts are fairly straightforward.  On 27 June 2014 at about 10.20am, Shoo Hui Meng (“the deceased”) was riding pillion on Malaysian registered motorcycle no. JKK 2870 (“the motorcycle”) along the Pan Island Expressway (“the PIE”) when it was involved in a collision (“the accident”) with motor vehicle no. SJF 8171L (“the car”) driven by the second defendant. The motorcycle belonged to the deceased but it was the first defendant who was riding it at the time of the accident.2Foot Note 2×AEIC of Sim Tian Siang dated 4 August 2017 (“AEIC of Sim”) at para 7. 3 The first defendant and the deceased were then colleagues working at a restaurant called Magic Chongqing Hot Pot (“the Restaurant”) located at Tanglin Shopping Centre.3Foot Note 3×AEIC of Sim at para 9; NE 19 Jul 2018, p 33 at lines 7-11.The deceased had started working at the Restaurant as a waitress about two months earlier followed shortly by the first defendant. As both were Malaysians and resided in Johor Bahru, they travelled to Singapore together to get to work. According to the plaintiff (who was the deceased’s husband) and the first defendant, the deceased and the first defendant would take turns to ride and be pillion riders, of the motorcycle.4Foot Note 4×AEIC of Sim at paras 9-11. 4 At the time of the accident, the motorcycle was travelling in the third lane of the PIE in the direction of Changi Airport and was approaching the exit to Lornie Road when the car driven by the second defendant (who was in the lane to the right of the motorcycle) cut abruptly into the path of the motorcycle. The first defendant was unable to avoid the car even with braking and the rear of the motorcycle collided into the car as a result. The impact of the collision was so severe that both the first defendant and the deceased were flung off the motorcycle and caused them to roll on the ground. The deceased’s helmet fell off in the process with the result that she suffered serious head injuries. She was unconscious and did not regain consciousness despite being warded and treated at Tan Tock Seng Hospital (“TTSH”) for 47 days.5Foot Note 5×AEIC of Sim at para 19.She was then transferred to a hospital in Johor Baru Malaysia. The deceased passed away on 19 August 2017. 5 The second defendant lodged a police report on the day of the accident while the plaintiff lodged a police report of the accident a day later, based on what the first defendant told him.6Foot Note 6×AB7-12.The first defendant herself only lodged a police report some five months later on 3 December 2014.7Foot Note 7×AB18-20.In court, the first defendant explained her delay in lodging the police report - she only lodged the report after being told to do so by the police.8Foot Note 8×NE 19 July 2018, p 35 at lines 1-2. 6 Due to the deceased’s mental incapacity, the plaintiff applied to the High Court of Malaya at Johor Bahru on 26 October 2015 and obtained an order of court to be her litigation representative.9Foot Note 9×AB40-43.",
        "The pleadings": "7 On 30 November 2016, the plaintiff commenced the Suit against both defendants. In the statement of claim, the plaintiffinter aliaalleged that the first defendant was riding at an excessive speed while the second defendant was driving at an excessive speed. Further, they failed to keep a proper lookout, failed to maintain a safe and/or reasonable distance from each other’s vehicles and failed to take steps to avoid a collision.10Foot Note 10×Statement of Claim at para 8. 8 The first defendant accepted service of the proceedings in Singapore on 13 December 2016 but failed to enter an appearance. Apparently the insurers of the motorcycle were not prepared to assist the first defendant to defend the Suit as they took the position that insurance coverage of the motorcycle did not extend to the pillion rider.11Foot Note 11×AEIC of Sim at para 27.Consequently, the first defendant did not take part in these proceedings. 9 The second defendant on the other hand entered an appearance to the proceedings and filed a defence wherein he denied he was negligent and caused the accident. He put the blame for the accident squarely on the first defendant alleginginter aliathat the motorcycle had collided into the rear of the car which was proceeding straight in the right lane, that she failed to maintain a safe distance from the car and failed to keep a proper lookout for the car.12Foot Note 12×Defence at para 7. 10 After the accident, the police brought criminal charges against the first defendant on 12 March 2016 under s 337(b) of the Penal Code (Cap 224, 2008 Rev Ed) (“the criminal charge”).13Foot Note 13×AB34.On 11 April 2016, the first defendant pleaded guilty to the charge, and was convicted and fined $2,500.14Foot Note 14×AB38-39. 11 After the deceased passed away on 19 August 2017, the plaintiff applied for letters of administration of her estate to be granted to him; the grant was issued on 24 January 2018. The plaintiff further obtained an order of court on 14 February 2018 to continue the proceedings in the Suit which eventually came on for trial before this court.15Foot Note 15×HC/ORC 1204 of 2018.",
        "The evidence": "12 The witnesses who testified at the trial for the plaintiff’s case were the plaintiff, the first defendant, and a third party witness. The third party witness for the plaintiff was one Mageshwaran Jayaraman (“Jayaraman”) who was called at the court’s behest.  Jayaraman was the officer from Certis CISCO who prepared the sketch plan of the accident scene at the material time.16Foot Note 16×AB17.The first defendant’s evidence was not by way of an affidavit of evidence in chief (“AEIC”) but adducedviva voceas she was subpoenaed by the plaintiff. 13 The second defendant was the only witness for his own case. He produced a video recording of the accident which was played in court and which played a crucial role in the court’s findings. (i) The plaintiff’s case 14 The plaintiff was then also working in Singapore as a construction worker on a site in Toa Payoh. In his AEIC, the plaintiff deposed that on the morning of 27 June 2014, he received a telephone call from the deceased’s younger sister informing him that the deceased was involved in an accident. He rushed to the scene of the accident on his motorcycle but was told by people at the scene that the deceased had been conveyed to TTSH. He then went to TTSH where upon arrival, he found that the deceased had undergone emergency surgery for her serious injuries.17Foot Note 17×AEIC of Sim at paras 16-17. 15 While waiting at TTHS for the deceased’s operation to be over. the plaintiff met the first defendant who briefed him on how the accident happened.18Foot Note 18×AEIC of Sim at para 17.Subsequently, the first defendant gave him a statement in Mandarin giving greater details of the accident.19Foot Note 19×AEIC of Sim at pp 21-22.The defendant had informed him she was not at fault in regard to the accident and that she pleaded guilty to the criminal charge (at [10]) out of convenience. Based on what the first defendant told him, the plaintiff lodged a police report of the accident on 28 June 2014.20Foot Note 20×AB10-11 16 Nothing turned on the plaintiff’s testimony as his evidence with regard to the accident was hearsay based on what was told to him by the first defendant. However, notwithstanding the fact that he did not witness the accident, the plaintiff disagreed with counsel for the second defendant when it was put to him that the first defendant was responsible for causing the accident.21Foot Note 21×NE 19 July 2018, p 15 at lines 14-19.The plaintiff had seen the second defendant’s video and noted therefrom that the second defendant was driving the car at an excessive speed and changed lanes suddenly. He had then applied the brakes and lost control of the car.22Foot Note 22×NE 19 July 2018, p 15 at lines 24-29. 17 The plaintiff testified that when he arrived at the accident scene within 20 - 30 minutes after the accident, the car was no longer at the scene. He noted that there were skid marks caused by the pedal of the motorcycle.23Foot Note 23×NE 19 July 2018, p 15 at lines 24-29.If the first defendant was to be blamed for the accident, the plaintiff opined it was for a “minor” part.24Foot Note 24×NE 19 July 2018, p 22 at lines 18-21. (ii) The first defendant’s case 18 The first defendant was a witness for the plaintiff without having filed an AEIC and without legal representation due to her lack of means. The court had directed counsel for the plaintiff at an earlier pre-trial conference to prepare a list of questions to be put to the first defendant. The first defendant’s testimony was adduced based on that questionnaire. 19  According to the first defendant, when she first saw the car, it was traveling in the extreme right (fast) lane in the direction of Changi Airport while she was riding in the motorcycle at 80-90 kph in the adjoining second lane alongside and about one motorcycle length behind the car.25Foot Note 25×NE 19 July 2018, p 35 at lines 23-30.Suddenly, the car shifted to her lane at an excessive speed without signalling.26Foot Note 26×NE 19 July 2018, p 37 at lines 12-14, p 38 at lines 9-11, 21-27.She applied the brakes of the motorcycle and turned the motorcycle to the right to try to maintain her balance but the front of the motorcycle collided into the rear of the car with a loud bang.27Foot Note 27×NE 19 July 2018, p 38 at lines 28-30, p 39 at lines 4-7, 23-26.Immediately thereafter, the car moved back to the first lane and sped off. 20 The first defendant and the deceased were both flung off when the motorcycle fell on its right side into the first lane.28Foot Note 28×NE 19 July 2018, p 40 at line 6-15.The first defendant closed her eyes until she stopped rolling on the ground for 1-2 minutes (which she estimated may have been a distance of 3-4 metres).29Foot Note 29×NE 19 July 2018, p 41 at lines 7-10, p 42 at lines 11-19, p 43 at lines 14-21.She then went over to the deceased whose eyes were totally closed. The first defendant repeatedly called the deceased’s name but the former did not respond.30Foot Note 30×NE 19 July 2018, p 44 at lines 1-10.The first defendant noticed the deceased’s helmet had fallen off her head and her ear was torn.31Foot Note 31×NE 19 July 2018, p 42 at lines 4-10.She stayed with the deceased until an ambulance came and took the deceased to TTHS.32Foot Note 32×NE 19 July 2018, p 44 at lines 11-13. 21 Although she only suffered bruises and abrasions from the collision, the first defendant testified she hurt her right shoulder when she fell from the motorcycle and to-date her shoulder still hurts whenever it rains.33Foot Note 33×NE 19 July 2018, p 41 at lines 12-31. 22 When questioned on why she pleaded guilty to the criminal charge (of causing hurt by an act which endangers life or the personal safety of others), the first defendant explained she was afraid she would have to keep attending court otherwise. Hence, she pleaded guilty even though she blamed the second defendant for the accident.34Foot Note 34×NE 19 July 2018, p 44 at lines 5-8.She pointed out that the Statement of Facts (“the Statement”) prepared by the prosecution for her to plead guilty to the criminal charge was incorrect when it stated (at para 4) that she was riding the motorcycle in lane 1 – she was in lane 2 before the accident.35Foot Note 35×NE 19 July 2018, p 45 at lines 16-21.The first defendant was unable to recall whether the Statement was interpreted to her at the material time.36Foot Note 36×NE 19 July 2018, p 45 at lines 23-26.She was assigned a counsel who acted on apro bonobasis as she did not have the means to engage a lawyer to represent her in the criminal proceedings.37Foot Note 37×NE 19 July 2018, p 48 at lines 15-22. 23 In cross-examination, the first defendant disclosed she was originally riding the motorcycle in lane 4 before slowly shifting to the right to lane 2.  She did so because there were other vehicles in lanes 3 and 4.38Foot Note 38×NE 19 July 2018, p 52 at lines 11-18. 24 Counsel for the second defendant drew the first defendant’s attention to her police report wherein she made no mention that she applied the brakes of the motorcycle or that she swerved the motorcycle to the right before the collision.39Foot Note 39×NE 19 July 2018, p 56 at lines 14-18.Given that her police report was made six months after the accident (see [5]) and that the first defendant neither reads, writes nor speaks English and was educated in Malaysia in the Malay language, it is not surprising that her police report contained errors. The objective evidence from the sketch plan showed skid marks made by the motorcycle over quite a distance which clearly indicated that the first defendant did apply the brakes of the motorcycle to no avail.40Foot Note 40×AB17. (iii) The second defendant’s case 25 In his AEIC, the second defendant (who is a freelance photographer) deposed that on the morning of the accident, he was driving to his office at Great Easten Life Building at 200, Changi Road on the PIE travelling in the first (right most) lane. Near the exit to Lornie Road, a red vehicle no SDX 2369A (“the red car”) in the first lane ahead of him stopped suddenly. The second defendant braked the car and slowed down. As he applied his brakes, the motorcycle collided into the rear right side of the car. He heard a skidding sound and an impact to the rear of the car.41Foot Note 41×AEIC of Thien Chin Tin dated 11 August 2017 (“AEIC of Thien”) at paras 4-13.As a result of the collision, the rear right portion of the car was dented and scratched while the front part of the motorcycle was badly damaged.42Foot Note 42×AB25-26, AEIC of Thien at para 16. 26 The second defendant deposed he was shocked and drove to the chevron near the Lornie Road exit before he called for the police.43Foot Note 43×AIEC of Thien at para 13-14.He waited and when the police did not contact him, he went back to the scene of the accident where the police recorded a statement from him.44Foot Note 44×AEIC of Thien at para 15.As instructed by the police, the second defendant drove the car to the police academy at Thomson Road and left it there for purposes of investigations.45Foot Note 45×AEIC of Thien at para 18.Subsequently, the car was returned to him. 27 The second defendant also informed the police that he had an in-vehicle camera that captured footage of the traffic ahead of him. The police took away the video footage which was later returned to him. Due to a glitch in the in-vehicle camera, the date shown in the footage was 26 June 2014 but the second defendant deposed that the video footage was indeed taken on 27 June 2014.46Foot Note 46×AIEC of Thien at paras 19-20. 28 On the afternoon of the accident, the second defendant lodged a police report followed by a Singapore Accident Report on 4 August 2014.47Foot Note 47×AB7-9; AEIC of Thien at Tab E.The second defendant deposed that he found out from a letter dated 25 April 2016 from the police that the first defendant was convicted of the criminal offence (see [10]).48Foot Note 48×AEIC of Thien at paras 21-23. 29 In cross-examination, the second defendant maintained he kept quite a distance with the red car in the first lane while travelling at about 88-90 kph.49Foot Note 49×NE 19 July 2018, p 76 at lines 18-27.He swerved to the left and stepped on his brakes when the red car suddenly braked.50Foot Note 50×NE 19 July 2018, p 72.He noticed from his rear view mirror that all the other vehicles behind him were similarly braking. He then heard a skidding sound and felt an impact presumably when the motorcycle hit the car.51Foot Note 51×NE 19 July 2018, p 73 at lines 15-21, p 75 at lines 21-26.The second defendant said he slowly filtered to the left (second) lane.52Foot Note 52×NE 19 July 2018, p 75 at lines 1-7.He claimed it was his practice to signal when changing lanes53Foot Note 53×At N/E 75 on 19 July 2018although he could not recall whether he signalled in this case when he filtered to the second lane. 30 Questioned by counsel for the plaintiff as well as the court on why he did not stop the car as would be expected of anyone involved in a road accident, the second defendant claimed it was because he was “shocked”.54Foot Note 54×NE 19 July 2018, p 76 at lines 1-17.That was why he moved to the shoulder of the road. 31   The second defendant disagreed with counsel’s suggestion that he cut into the second lane and that was why the collision took place. Counsel pointed out that the video footage showed a jerk which was when the car cut into the second lane and was hit by the motorcycle.  The second defendant disagreed and claimed that the jerk was due to his braking immediately when the red card braked.55Foot Note 55×NE 19 July 2018, p 77 at lines 21-27. 32 Although in his AEIC and in court the second defendant deposed he waited a while/quite long for the police to arrive (and called them a few times as well),56Foot Note 56×AEIC of Thien at para 15.he was unable in cross-examination to give any estimate at all of how long he waited for the police.57Foot Note 57×NE 19 July 2018, p 79 at lines 15-18.Even more strange was the fact that his AEIC made no mention whatsoever of where the deceased and the first defendant landed after the collision nor of the position of the motorcycle or of the arrival of the ambulance. Indeed, the second defendant testified he did not see either the deceased or the ambulance when he returned to the scene of the accident.58Foot Note 58×NE 19 July 2018, p 79 at lines 19-32.He did not even know who was riding the motorcycle at the time of the accident. Counsel drew the second defendant’s attention to his police report where it was stated that he “called for police and made a check on both the rider and the pillion. Ambulance and Traffic Police came to the incident location. Both the rider and the pillion of JKK2800 was (sic) conveyed to hospital by ambulance”.59Foot Note 59×AB8. The second defendant testified the above extract from his police report was incorrect – he was given the information by the police, he himself did not see what happened after the accident.60Foot Note 60×NE 19 July 2018, p 81 at lines 8-30, p 83 at lines 14-32. 33 The second defendant admitted the fact of his swerving left (as he claimed) was also not stated in his police report.61Foot Note 61×NE 19 July 2018, p 84 at lines 29-31.Questioned on this glaring omission and despite being pressed by the court for an answer,62Foot Note 62×NE 19 July 2018, p 85.the second defendant could not explain his omission, after considerable prevarication. However, he denied counsel’s suggestion that the accident happened because he had swerved abruptly into the second lane. He further disagreed that had he told the police that fact, the subsequent investigations would have focussed along those lines and he may perhaps have been found largely or solely responsible for the accident.63Foot Note 63×NE 19 July 2018, p 86 at lines 3-11. 34 The court had also questioned the second defendant on how the accident occurred. The court pointed out to the second defendant that if his version of the accident (that the collision was when the car was in the first lane) was to be believed, the damage to the car from the front to rear collision would have been more to the middle portion of the back of the car.64Foot Note 64×NE 19 July 2018, p 93.Instead, the damage to the car (more to the right of the rear) suggested that it was consistent with the first defendant’s version that the car suddenly cut into the path of the motorcycle in the second lane causing the motorcycle to collide into the car’s right rear end despite her swerving to avoid the collision. The second defendant disagreed with the court’s analysis.65Foot Note 65×NE 19 July 2018, p 93 at lines 26-32. 35 Counsel for the second defendant had questioned the second defendant and the latter confirmed that he did not know where the motorcycle was just before the accident.66Foot Note 66×NE 19 July 2018, pp 95-96.It was obvious to the court that this was due to the fact that the motorcycle was in a blind spot or too close to the car where neither the rear view mirror nor the car’s side mirrors could capture its location. 36 The last witness called by the plaintiff was Jayaraman (see [12]), the Certis CISCO officer who at the material time prepared the sketch plan.67Foot Note 67×AB 17.Jayaraman testified that his services would have been activated by the Land Transport Authority.68Foot Note 68×NE 20 July 2018, p 3 at lines 18-22.He revealed that the motorcycle was not in its original position when he arrived at the accident scene (someone at the scene must have told him) but the car was in its original position.69Foot Note 69×NE 20 July 2018, p 4 at lines 13-21.Jayaraman testified he made the sketch plan based on what he saw at the accident scene.70Foot Note 70×NE 20 July 2018, p 4 at lines 13-21.He was not aware nor was he told that the car had been driven off after the accident and that it returned subsequently and was parked in the first lane, not where the collision took place.71Foot Note 71×NE 20 July 2018, p 5 at lines 21-24. 37 Significantly, the sketch plan showed a long skid mark made by the motorcycle that swerved to the right from the second lane to the first (fast) lane.",
        "The video footage": "38 As alluded to earlier (at [13]), the video footage from the second defendant’s in-vehicle camera played a significant role in the court’s findings that the second, not the first, defendant was largely responsible for causing the accident. It was after the court had reviewed the video footage that it arrived at its findings on liability. Based on the video footage, the collision took place at 0.05 timing when the car was travelling at 87 kph and there was a sudden jerk when the motorcycle hit the car’s rear. The impact even caused the second defendant’s earphones to be flung forward as they appeared next to his glasses on the dashboard where previously only his glasses were placed there. Consistent with the first defendant’s testimony, the video showed the collision took place when the car was in the second lane where the motorcycle was being ridden. 39 Consequently, based on the video footage, the court concluded that the second not the first defendant was largely responsible for the accident that took the life of the plaintiff’s wife and caused the innocent first defendant to be subject to and convicted of the criminal charge. 40 The court was of the view that the second defendant stage-managed the accident scene and in doing so, he threw the police authorities off their track in their investigations into the accident.72Foot Note 72×NE 20 July 2018, p 37. 41 The court accepted the first defendant’s version of how and where the accident happened because her version was consistent with the video footage and the sketch plan. The car which was travelling in the first (fast) lane had cut abruptly into the path of the motorcycle when the red car in front braked suddenly. The second defendant similarly braked his car but decided to switch lanes either to overtake the red car or to avoid colliding into it.  In so doing, he could not/did not see the motorcycle which just before the collision was almost alongside the car. 42 As the first defendant had testified, she swerved to the right to try to avoid the car but the front of the motorcycle hit the right side of the car that had encroached into her path from the first lane. The first defendant and the deceased were flung off the motorcycle to the right and rolled on the road for some  distance. When she opened her eyes, she saw the car speeding off. 43 In contrast, the second defendant’s version of events was not credible, especially if seen against the backdrop of his less than honest account provided to the police in his report made in the afternoon of 27 June 2014.73Foot Note 73×AB8.Although he clearly did not stop at the accident scene, he told the police that he “called for the police and made a check on both the rider and the pillion”. While he claims that those words were not his, his explanation was not credible. First, the police would not have known whether he stopped to check on the deceased and first defendant or not, and the only way they would have obtained this information is if it came from the second defendant. Second, this statement was clearly part of an attempt by the second defendant to evade criminal responsibility for his actions. He had also omitted to mention that he abruptly swerved left into the second lane before the motorcycle collided with his car. His explanation for this omission was that the police did not ask about him swerving left and because he did not know this was an important fact.74Foot Note 74×NE 19 July 2018, p 85 at lines 9-26.It was unbelievable. Any reasonable person would know that the second defendant’s leftward swerve before the accident was an important, indeed critical, fact for any inquiry meant to establish the true sequence of events leading up to and immediately after the accident. The only reason why he did not mention this fact to the police was because he wanted to push the blame for the accident onto the first defendant. 44 Although the second defendant did return to the scene of the accident after leaving the chevron and volunteered his in-vehicle camera footage to the police officers present, the footage would not have shown how the motorcycle came to make contact with his vehicle. It would not have stood in the way of his attempts to absolve himself of any fault. 45 Thus, on a balance of probabilities, the court found that the second defendant was not a credible witness. Instead, his version of events to the police and to this court were attempts to evade criminal and civil liability for the accident. They were calculated moves by the second defendant who managed thereby to push the entire responsibility for the accident onto the innocent first defendant. As I said in court, the second defendant’s conduct was reprehensible to say the least.",
        "Conclusion": "46 If any liability was to be pinned on the first defendant, it would be very minimal as the plaintiff testified, in that she reacted too slowly and she did not brake quick enough and/or hard enough to stop the motorcycle from hitting the car. The court took into account that possibility by holding the first defendant liable for 10% and the second defendant liable for 90%, for the accident. Lai Siu ChiuSenior Judge Ranvir Kumar Singh (UniLegal LLC) for the plaintiff;first defendant in person;Appoo Ramesh (Just Law LLC) for the second defendant."
    }
}