{
    "case_title": "Lim Ah Leh vHeng Fock Lin",
    "ncitation": "[2018] SGHC 156",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 From 1993 to 2007, the plaintiff paid various sums of money in different currencies to the defendant for her to manage and invest on his behalf. He paid the money to the defendant either himself or through family members and either in the form of traveller’s cheques purchased in New Zealand or as cash. The total sum of money paid in this way is about S$3.5m at today’s exchange rates. In 2014, the plaintiff commenced this action seeking an order that the defendant account to him for all of that money. 2 The plaintiff is a citizen of New Zealand and carries on business there. The defendant is a citizen of Singapore and carries on business here. The defendant and the plaintiff are in-laws: the plaintiff’s wife is the defendant’s sister. Sadly, this suit has caused a permanent rift between the defendant and five of her seven siblings – including the plaintiff’s wife – most of whom gave evidence for the plaintiff at trial.1Foot Note 1×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 4. 3 The plaintiff’s case in this action is simple: (i) the defendant became the trustee of all of the money which she received from him; (ii) she therefore owes him a number of fiduciary duties, including a duty to account for how she managed and invested the money; and (iii) she is in breach of those fiduciary duties. 4 The plaintiff’s claim rests on events which took place as long ago as 1993. The oral evidence before me is stale and the documentary evidence is limited. The passage of time also raises interesting questions at the intersection of the law of limitation and the law of trusts. Those questions have ultimately proved to be determinative of this action. 5 I have found that the plaintiff’s action for an account is time-barred by s 6(2) of the Limitation Act (Cap 163, 1996 Rev Ed) (“Limitation Act”). In any event, I would have exercised my discretion not to grant an order for an account.  The plaintiff has appealed against my decision. I therefore now set out my reasons.",
        "Summary of my findings": "6 The following is a summary of my findings. The defendant did receive substantially all of the sums of money which the plaintiff claims to have paid to her. It is common ground that the plaintiff did not intend to make a gift of these sums to the defendant. She therefore held each sum, as and when received, on a presumed resulting trust for the plaintiff. That does not mean, in itself, that the defendant owed the plaintiff any fiduciary duties. But she did owe the plaintiff at least a duty to account and a duty not to place herself in a position of conflict between her personal interests and the plaintiff’s interests. 7 The plaintiff’s claim, however, is time-barred. The plaintiff commenced this action on 28 April 2014. It is common ground that the plaintiff last paid a sum of money to the defendant in 2007. Section 6(2) of the Limitation Act bars a claim for an account in so far as the plaintiff seeks to go back more than six years before the action was commenced. That section applies to an action for an account arising from a resulting trust as it does in the case of one arising from an express trust. 8 None of the exceptions to s 6(2) created by s 22(1) of the Limitation Act apply. First, the defendant, although in breach of her duty to account, is not in fraudulent breach of that duty. Second, the defendant did not breach her duty not to place herself in a position of conflict between her own interests and those of the plaintiff. Finally, the plaintiff has failed to prove that any of the trust property remains in the defendant’s possession or has been converted by her to her own use. 9 Finally, quite apart from s 6(2) of the Limitation Act, I would have exercised my discretion not to order the defendant to render an account to the plaintiff because it would be oppressive to do so and because there is no good reason to order the defendant now to render an account going back almost a quarter century which would justify the time, cost and effort which the defendant would have to incur in preparing it. The evidence before me does not indicate that the defendant has committed a possible fraud which taking an account might uncover. Further, the plaintiff was aware at all times of how the defendant was managing and investing his money. Indeed, he took an active role in considering and approving certain investments which she made on his behalf.",
        "Factual background": "",
        "The parties": "10 The plaintiff and his wife, Mdm Heng Fock Too (also known as Elina Lim) married in or around 1990.2Foot Note 2×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 5.They live in New Zealand. From 1983 to 2011, the plaintiff managed a number of businesses in New Zealand, including a business exporting wool and sheepskin and an associated retail business in the tourism sector. Both businesses were conducted through a company incorporated in New Zealand known as The Woolbarn Ltd. 11 The plaintiff and his wife visited Singapore regularly.3Foot Note 3×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 7.The plaintiff’s wife had family here and the plaintiff attended travel fairs here. During one of these visits to Singapore in the early 1990s, the plaintiff became acquainted with the defendant. At that time, he was about 50 and she was in her early thirties. She was then a young partner in a book-keeping business called Heng Management Services (“Heng Management”) which she had founded in 1988.4Foot Note 4×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 63.She was also a director and a shareholder of a company incorporated in Singapore in 1992 known as Vescoplastics (SEA) Pte Ltd (“Vescoplastics”).5Foot Note 5×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 67.",
        "The parties enter into an arrangement": "12 It is not disputed that the parties soon entered into an arrangement as a result of which the plaintiff sent various sums of money from New Zealand to the defendant in Singapore. To this end, in August 1994, both parties opened a joint account in Singapore with United Overseas Bank (“UOB”) in order to hold the money. The defendant wanted to open a new account so as not to mix the plaintiff’s money with her own.6Foot Note 6×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 24; Certified Transcript, 3 August 2016, Day 4, p 38 at line 31 to p 39 line 2. 13 The arrangement between the parties involved, at the very least, the defendant investing the plaintiff’s money and paying the proceeds to the plaintiff from time to time. The defendant made two main investments with the plaintiff’s money.",
        "The Shanghai properties": "14 The first main investment was to purchase an office unit in a Shanghai development. The defendant wanted to set up an office in Shanghai for Vescoplastics and decided to buy an office unit. At the same time, she told the plaintiff that this was an opportunity for him to buy an office unit in the same development. He agreed to invest in two office units. I will call the plaintiff’s two office units the “Shanghai properties”. The purchase of the Shanghai properties was completed in 1998. The defendant’s staff in Shanghai assisted in letting the Shanghai properties and collecting the rent. 15 The defendant sold the Shanghai properties in 2004. The proceeds of sale were, however, repatriated to Singapore only in 2008. The delay was due to the strict capital controls in place in China. 16 The money due to the plaintiff from the sale of the Shanghai properties was eventually paid out of China into an account in Singapore with Citibank in the joint names of the defendant and her husband. The defendant kept the plaintiff aware of this.7Foot Note 7×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 426.The defendant then used the money in that account to trade in foreign exchange on the plaintiff’s behalf. 17 The defendant closed this Citibank account in early 2009 and transferred the balance into a new Citibank account in the joint names of the plaintiff, his wife and the defendant. The defendant continued to use the plaintiff’s money in this new Citibank account to trade in foreign exchange. In addition, she used some of the money to invest in gold and to buy shares in Citibank. She did so under the plaintiff’s directions.8Foot Note 8×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 434.",
        "The Rochor property": "18 The second main investment which the defendant made with the plaintiff’s money was in shares in a company called GK Holding Pte Ltd (“GK Holding”). The main asset of GK Holding was a commercial property in Sim Lim Square at 1 Rochor Canal Road which was let to retail shops and a food court. I shall call this the “Rochor property”. 19 The parties invested in shares in GK Holding in two tranches. They acquired the first tranche in 1994. At that time, a shareholder of GK Holding was offering 15% of the company for sale. The defendant told the plaintiff about this opportunity. The plaintiff agreed to buy 10% of GK Holding out of the 15% on offer. The defendant agreed to buy the remaining 5%. The defendant paid Teo Chye Har, a minority shareholder of GK Holding, for these shares. As a result of this purchase, the plaintiff became the legal owner of 15% of GK Holding. He held 10% for himself and the additional 5% for the defendant. In 1999, he transferred that 5% to the defendant. 20 The parties acquired their second tranche of shares in GK Holding in 2000, when the majority shareholder sold all his remaining shares. The plaintiff purchased an additional 15% of GK Holding and the defendant purchased an additional 20%. As a result, they each now held 25% of GK Holding. Teo Chye Har purchased the remaining shares on offer and increased her shareholding to 50%. The defendant and her husband then took over the day to day management of GK Holding. 21 At that time, the defendant was also managing a business called Yi Kang Food & Beverage (“Yi Kang”). Yi Kang’s business was running a drinks stall from a unit at the Rochor property which it had leased from GK Holding. In 2005, when Yi Kang’s business picked up, the defendant began to share a portion of its profits with the plaintiff out of goodwill. The defendant later started two other food and beverage ventures which each leased a unit at the food court in the Rochor property from GK Holding. They were known as Dessert@Sim Lim Square LLP and Sleek Espresso Bar. 22 In 2012, GK Holding sold the Rochor property for about S$39m. The net proceeds of sale were distributed among the shareholderspro rata. The defendant and her husband then bought all the remaining shares in GK Holding from the plaintiff and Teo Chye Har. The plaintiff’s share of the proceeds from the sale of the Rochor property combined with the proceeds of the sale of his shares in GK Holding totalled about $8.75m. He and his wife visited Singapore to collect the money.",
        "The plaintiff seeks an account": "23 In 2012, the plaintiff began agitating for records of the money which he had paid to the defendant and of the investments which she had made on his behalf. He asked for all bank statements, cheques and deposit records, all “inwards cash records, either in Singapore and [sic] foreign currencies”, all “outwards cash payments records” and any relevant financial records “from beginning to now”.9Foot Note 9×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 417. 24 The defendant was able to send him only documents relating to the Citibank shares, a cashier’s order for the balance sum in the joint UOB account, and bank statements for the joint Citibank account for the period 2010 to 2012. She said that the remaining documents had been disposed of during a “spring cleaning” exercise some years earlier.10Foot Note 10×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 420.She said she was unable to furnish to the plaintiff any documents relating to the Shanghai properties or GK Holding.11Foot Note 11×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 120. 25 On 28 April 2014, the plaintiff commenced this action.",
        "Summary of parties’ cases": "26 The plaintiff’s case is as follows. He paid the money to the defendant because she had asked him to let her manage and invest his money for him. He completely trusted the defendant and was not actively involved in selecting or managing the investments which she made on his behalf. She held the money for him on a resulting trust and owed him fiduciary duties. But she breached her duty to account and her duty not to place herself in a position of conflict between her personal interest and that of the plaintiff. 27 Although s 6(2) of the Limitation Actprima facielimits the plaintiff’s entitlement to an account to matters arising six years before he commenced this action, the plaintiff argues that the exceptions in s 22(1) apply. In particular, the plaintiff argues that: (i) the defendant committed fraudulent breaches of trust; (ii) still has trust property in her possession; and (iii) may have converted trust property to her own use. Accordingly, the plaintiff prays for the following principal relief: (a) an order that the defendant account for all money which the plaintiff paid to her; (b) an order that the defendant pay to the plaintiff all money which is found to be due to him upon taking the account; and (c) an order that the defendant pay to the plaintiff all of his money which is still in her possession. 28 The defendant’s response is as follows. She did not receive significant parts of the total sum which the plaintiff claims to have paid her.12Foot Note 12×Defence and Counterclaim (Amendment No 3) dated 22 June 2016 at para 18.It was the plaintiff who asked her to help him manage and invest his money. She agreed to do soex gratiabecause he was married to her sister. She was not his trustee and did not assume the duties and responsibilities of a trustee. The plaintiff in fact played an active part in managing and investing his money. In any event she has accounted for all the money which she received. Finally, the plaintiff’s action is time-barred by s 6(2) of the Limitation Act and none of the exceptions apply. 29 The defendant also brings a counterclaim against the plaintiff to recover the sum of S$378,103.88 which she paid to the plaintiff as a goodwill payment,iewithout legal obligation, out of her profits from Yi Kang. The defendant indicated, however, that if the plaintiff’s claim fails, she does not intend to pursue her counterclaim.13Foot Note 13×Certified Transcript, 5 August 2016, Day 6, p 90 at lines 19 to 23.As the plaintiff’s claim has indeed failed, I need say no more on the merits of the defendant’s counterclaim.",
        "Issues to be determined": "30 Five key issues arise for my decision in this action: (a) whether the defendant paid to the plaintiff between 1993 and 2007 the sums of money which he claims to have paid;(b) if so, whether the defendant thereby became a resulting trustee of the money;(c) if so, whether the defendant, as a trustee under a resulting trust, owes the plaintiff any fiduciary duty or duties, including the duty to account for the money;(d) if so, whether the plaintiff’s action is caught by s 6(2) of the Limitation Act; and(e) if so, whether the plaintiff comes within any of the exceptions set out in s 22(1) of the Limitation Act. 31 I deal with each issue in sequence.",
        "Issue 1: Receipt of money": "32 The plaintiff pleads that between 1993 and 2007, he paid to the defendant in total about US$1.7m, S$2m and RMB 100,000 either in traveller’s cheques or cash.14Foot Note 14×Plaintiff’s Statement of Claim (Amendment No 2) dated 26 August 2015 at para 11(22); Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 36.I have found, for the reasons which follow, that the defendant did receive about US$1.4m, S$1.6m and RMB 100,000 of the plaintiff’s money during this period. 33 To explain my findings, I shall first assess the general credibility of both parties’ evidence on the twenty or so transactions by which the plaintiff alleges he paid this money to the defendant. I will then turn to analyse whether each alleged transaction took place and then calculate the total amount which I have found the plaintiff to have paid to the defendant.",
        "Evidence of the payments": "34 The plaintiff’s evidence on the payments is largely his own oral evidence and the oral evidence of the defendant’s siblings who delivered traveller’s cheques or cash to the defendant on the plaintiff’s behalf. The defendant attacks the credibility of both classes of witness. I therefore consider their credibility in turn. The plaintiff’s credibility 35 The defendant attacks the credibility of the plaintiff’s evidence on two grounds. 36 First, the defendant asserts that the plaintiff is unworthy of credit because he used false names to purchase traveller’s cheques15Foot Note 15×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at pp 38 to 50.with no good reason for doing so.16Foot Note 16×Defendant’s Closing Submissions dated 3 November 2016 at para 61; Certified Transcript, 3 August 2016, Day 4, p 105 at line 28 to p 106 at line 3, p 107 at lines 13 to 16, and p 109 at lines 8 to 9.The defendant also correctly points out that the plaintiff’s use of false names was merely the first stage of an elaborate process by which the plaintiff sent substantial sums of his money from New Zealand to Singapore in the form of cash or traveller’s cheques and then had those sums sent back to him in New Zealand.17Foot Note 17×Certified Transcript, 4 August 2016, Day 5, p 52 at line 28 to p 53 line 11. 37 I accept the defendant’s contention that the plaintiff had no good explanation for purchasing traveller’s cheques in false names. The only plausible reason was that the plaintiff applied for traveller’s cheques in false names to ensure that the cheques could not be traced back to him.18Foot Note 18×Certified Transcript, 3 August 2016, Day 4, p 109 at lines 19 to 30.By way of explanation, the plaintiff repeatedly said in cross-examination that he did not think that it was important for him to use his own name when purchasing traveller’s cheques.19Foot Note 19×Certified Transcript, 3 August 2016, Day 4, p 105 at line 25, p 106 at lines 15 to 22, p 108 at line 30, and p 109 at line 14.That is disingenuous. Using a false name is not what an honest man typically does, regardless of whether the underlying matter is important or unimportant. And common sense suggests that even a dishonest man tells the truth when a matter is unimportant to him and lies only when a matter is important to his dishonest intent. 38 I also find that the plaintiff had no good reason for sending money from New Zealand to Singapore and back to New Zealand. He repeated many times that there was nothing wrong with doing so.20Foot Note 20×Certified Transcript, 4 August 2016, Day 5, p 49 at lines 2 and 4, p 51 at line 22, and p 55 at line 6.He attempted to explain that he did so “to get a better rate”. I took that to mean a better exchange rate.21Foot Note 21×Certified Transcript, 3 August 2016, Day 4, p 110 at line 1.I do not understand that explanation. While profiting from movements in foreign exchange rates, or hedging against those movements, is a plausible reason for converting money back and forth between currencies, that does not require the money to travel literally from New Zealand to Singapore and back again. 39 The plaintiff was defensive and evasive when cross-examined both about his reason for using a false name to buy the traveller’s cheques and his reason for moving his money from New Zealand to Singapore and back again. To that extent, I consider that the defendant has successfully shown that there is a basis for approaching the plaintiff’s oral evidence with some caution. 40 Having said that, I do not think that this point ought to affect my assessment of the plaintiff’s oral evidence on the issue I am now considering,iewhether the plaintiff paid this money to the defendant, either personally or through family intermediaries. This is because this point, made in the way the defendant has made it, entails the defendant’s implicitly accepting that the plaintiff did pay money to the defendant and suggests only that he did so for clandestine or illicit reasons. 41 Moreover, even if I find that the plaintiff purchased travellers’ cheques in false names to ensure that they could not be traced back to him, that finding is no indication of the plaintiff’s ultimate purpose in moving money from New Zealand to Singapore and back again. 42 So attacking the plaintiff’s credibility in the way that the defendant has done does not assist to prove that the plaintiff did not pay a particular sum of money to the defendant. It assists only to prove that the plaintiff had a dishonest or unlawful ultimate purpose for doing so. But that is no part of any of the defendant’s pleaded defences. Accordingly, I shall not speculate or make any finding on what the plaintiff’s ultimate purpose might be. It suffices to say that the plaintiff’s impaired credibility has only limited effect on how I assess his evidence of his payments to the defendant. 43 The second way in which the defendant attacks the plaintiff’s credibility is by arguing that he did not have the financial resources to pay the large sums of money which he claims to have paid her.22Foot Note 22×Defendant’s Closing Submissions dated 3 November 2016 at para 60.In this regard, the defendant submits that the plaintiff changed his evidence on his income and net worth between 1983 and 2011 (the period during which he ran The Woolbarn Ltd).23Foot Note 23×Certified Transcript, 3 August 2016, Day 4, p 8 at lines 1 to 3; Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 6.The defendant observes that in cross-examination, the plaintiff initially testified that he had a net worth of NZ$2m to NZ$3m between 1993 and 2003.24Foot Note 24×Certified Transcript, 3 August 2016, Day 4, p 60 at lines 1 to 8.It was then pointed out to him that he claimed to have paid in total the equivalent of NZ$3.8m – in excess of his stated net worth – to the defendant during the same period. The plaintiff then adjusted his evidence and claimed that his net worth during this period was NZ$6m, comprising NZ$3.5m in movable assets and NZ$2.5m in real property.25Foot Note 25×Certified Transcript, 3 August 2016, Day 4, p 61 at lines 20 to 28.The plaintiff also made the further claim – characterised by the defendant as “ludicrous” – that before he started his business in 1983, he already had liquid assets valued at NZ$13m.26Foot Note 26×Certified Transcript, 3 August 2016, Day 4, p 71 at lines 25 to 32. 44 While I accept that the plaintiff did modify his evidence,27Foot Note 27×Certified Transcript, 3 August 2016, Day 4, p 61 at lines 20 to 28.I also accept that he was a man of sufficient means to have made these payments to the defendant. I find that he changed his evidence because he genuinely could not remember the specific details of his financial position from 1983 to 2003 and was attempting to square his memory with the facts presented to him in cross-examination. The plaintiff was asked in cross-examination about matters which took place more than two decades earlier. The deterioration of memory which accompanies that length of time more plausibly explains his inability to recall accurately the details of his historical financial position and to calculate his historical net worth than a supposed desire to conceal the fact that his wealth was more limited than implied by his alleged payments to the defendant. 45 Moreover, as the plaintiff submits, it is no part of the defendant’s pleaded case that the plaintiff could not have paid the sums of money to her as he alleges because he did not have the financial resources to do so.28Foot Note 28×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 79 to 81.Had the defendant, through her pleadings, given the plaintiff reasonable notice that she intended to dispute his capacity to pay these sums of money to her, the plaintiff may well have put in additional documentary evidence of his historical financial position to prove that he had the resources to make the payments. 46 Accordingly, I hold that the defendant’s two principal submissions against the plaintiff’s credibility have a minimal effect on my assessment of that evidence in so far as I am considering the first issue before me,iewhether he paid money to the defendant as he claims. However, as a result of the defendant’s first principal submission, I accept that the plaintiff’s credibility is diminished on the disputed facts which are relevant to the other issues before me. The plaintiff’s witnesses’ credibility 47 The plaintiff’s second source of evidence is the oral evidence of the defendant’s relatives who physically delivered cash or traveller’s cheques to the defendant on the plaintiff’s behalf. Specifically, the plaintiff relies on the evidence of Heng Fock Whatt, Heng Fook Seng, Heng Pock Kam, Ting Teng Teow, and Heng Fock Too, who comprise the defendant’s older siblings and one of their spouses. 48 The defendant did not suggest to any of these witnesses in cross-examination that they had any ulterior motive for testifying against her or for supporting the plaintiff’s case, or that any of them would receive any form of benefit for giving false evidence. In her closing submissions, the defendant suggests that there is a rift in her family which has led the older siblings to ally themselves with the plaintiff.29Foot Note 29×Certified Transcript, 1 December 2016, Day 10, p 48 at lines 28 to 32.It could be that the defendant is correct. Or it could be that the plaintiff has influenced the defendant’s older siblings to take a position against her. But, as the defendant concedes, no ulterior motive was put to the plaintiff’s witnesses in cross-examination.30Foot Note 30×Certified Transcript, 1 December 2016, Day 10, p 50 at line 9 and line 30.So the defendant cannot advance that submission now. 49 There is therefore nothing before me to suggest that any of the defendant’s relatives who testified for the plaintiff have any personal interest in the outcome of this litigation or are motivated by animosity towards the defendant. With the exception of Heng Fock Whatt’s evidence (which I deal with below), the defendant has not, in my view, put forward any plausible basis on which to undermine the credibility of these witnesses. I therefore find their evidence to be credible.",
        "Examining the transactions": "50 The transactions by which the plaintiff paid money to the defendant can be divided into three categories, which I shall refer to as Categories A, B and C respectively. Category A comprises those transactions which the defendant accepts. Category B comprises those transactions which the defendant denies or claims to have no knowledge of, and for which there is evidence other than and in addition to the oral evidence of the plaintiff or his wife. Category C comprises those transactions which the defendant denies and for which the only evidence is the word of the plaintiff or his wife. Category A (1)  S$460,000 in December 1993 51 The plaintiff claims that in 1993, he paid a sum of S$460,000 to the defendant using a traveller’s cheque dated 2 December 1993.31Foot Note 31×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 12.The traveller’s cheque was addressed to the defendant and sent to her office at Heng Management. The plaintiff has produced a copy of the cheque.32Foot Note 32×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 38.The defendant does not deny that she received the cheque or its proceeds.33Foot Note 33×Defendant’s Closing Submissions dated 3 November 2016 at para 19.I therefore find that the defendant did receive S$460,000 from the plaintiff in or around December 1993. (2)  S$8,367.40 in May 1995 52 The plaintiff claims that in May 1995, he paid a sum of S$8,367.40 to Heng Management,iethe defendant’s business, using a traveller’s cheque dated 17 May 1995.34Foot Note 34×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 19.He could not recall in cross-examination what he paid this sum for.35Foot Note 35×Certified Transcript, 3 August 2016, Day 4, p 121 at lines 10 to 13.The defendant’s case is that the plaintiff paid the sum to her office as reimbursement of a sum paid to the travel company Chan Brothers Travel Pte Ltd (“Chan Brothers”) for the plaintiff’s participation in a travel fair. The plaintiff accepted that that could have been the reason for the payment of that sum, but could not be sure. 53 There is no evidence of a debt owed by the plaintiff to Chan Brothers which Heng Management paid on the plaintiff’s behalf. In the absence of such evidence, I find that the defendant did receive this traveller’s cheque from the plaintiff in or around May 1995. I make no finding as to what happened after that, including how long she was in possession of the cheque or what she did with it or its proceeds, if she did anything at all. (3)  S$128,000 in November 1995 54 The plaintiff claims that in November 1995, he paid a sum of S$128,000 to the defendant using a traveller’s cheque dated 17 November 1995.36Foot Note 36×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 20.The cheque was drawn in favour of the defendant and was sent to her office at Heng Management. The plaintiff has produced a copy of the cheque.37Foot Note 37×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 48.The defendant does not deny that she received it.38Foot Note 38×Defendant’s Closing Submissions dated 3 November 2016 at para 19.I therefore find that the defendant did receive the sum of S$128,000 from the plaintiff in or around November 1995. (4)  S$208,000 in May 1996 55 The plaintiff claims that in May 1996, he paid a sum of S$208,000 to the defendant using a traveller’s cheque dated 30 May 1996.39Foot Note 39×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 22.The plaintiff has produced a copy of the cheque.40Foot Note 40×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 50.The defendant does not deny that she received it.41Foot Note 41×Defendant’s Closing Submissions dated 3 November 2016 at para 19.I therefore find that the defendant did receive the sum of S$208,000 from the plaintiff in or around May 1996. (5)  S$460,000 in November 1994 56 The plaintiff claims that in November 1994, he paid a sum of S$460,000 to Teo Chye Har, the minority shareholder of GK Holding, using a traveller’s cheque dated 7 November 1994.42Foot Note 42×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 14.The plaintiff has produced a copy of the cheque.43Foot Note 43×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 40.It is not the plaintiff’s case that he sent the cheque to the defendant. Instead, he says that he sent it directly to Teo Chye Har on the defendant’s instructions. Strangely, it appears from the plaintiff’s evidence that the defendant, in giving him those instructions, did not specify the amount to be paid,ieS$460,000.44Foot Note 44×Certified Transcript, 3 August 2016, Day 4, p 93 at lines 20 to 25. 57 Nevertheless, the defendant acknowledges the existence of this cheque and explains that it was payment to Teo Chye Har for the first tranche of shares which he purchased in GK Holding.45Foot Note 45×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 50.The evidence is clear that the defendant did not receive this cheque or its proceeds, and I so find. (6)  S$168,000 in February 1995 58 The plaintiff claims that in February 1995, he paid a sum of S$168,000 to Teo Chye Har using a traveller’s cheque dated 17 February 1995.46Foot Note 46×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 15.The plaintiff has produced a copy of the cheque.47Foot Note 47×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 42.Again, it is not the plaintiff’s case that he sent this cheque to the defendant. Instead, again, he says that he sent it to Teo Chye Har on the defendant’s instructions. In this case the defendant did specify the amount to be paid,ieS$168,000.48Foot Note 48×Certified Transcript, 3 August 2016, Day 4, p 95 at lines 29 to 32.The defendant acknowledges the existence of this cheque and once again explains that it was payment to Teo Chye Har for the first tranche of shares which he purchased in GK Holding.49Foot Note 49×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 50. 59 As with the previous transaction, the evidence shows that the defendant did not receive this cheque or its proceeds, and I so find. Category B (7)  S$29,000 in April 1995 60 The plaintiff claims that in April 1995, he paid a sum of S$29,000 to one Uno Cafim using a traveller’s cheque dated 28 April 1995.50Foot Note 50×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 9 June 2016 at para 18.The plaintiff has produced a copy of the cheque.51Foot Note 51×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 44.It is not the plaintiff’s case that he sent the cheque to the defendant. Instead, he says that he sent it to Uno Cafim on the defendant’s instructions.52Foot Note 52×Certified Transcript, 3 August 2016, Day 4, p 119 at lines 27 to 32.The defendant claims to have no knowledge of this cheque whatsoever.53Foot Note 53×Defence and Counterclaim (Amendment No 3) dated 22 June 2016 at para 10(v). 61 As with the cheques addressed to Teo Chye Har, the only finding I need to make here for the purposes of this case is that the defendant did not receive the cheque or its proceeds. I so find. (8)  US$10,000 in December 1995 62 The plaintiff claims that in or around December 1995, he paid US$10,000 in cash to the defendant through his sister-in-law, Ting Teng Keow (“Mdm Ting”).54Foot Note 54×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 21.The defendant denies having received this payment.55Foot Note 55×Certified Transcript, 11 August 2016, Day 9, p 53 at lines 16 to 19. 63 Mdm Ting’s evidence is that in or around December 1995, she travelled to New Zealand with her daughter to visit the plaintiff and his feng-shui master.56Foot Note 56×Ting Teng Keow’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 4.On the evening she was to return to Singapore, the plaintiff handed her a bundle of cash which he instructed her to deliver to the defendant in Singapore. The plaintiff told Mdm Ting that the bundle of cash amounted to US$10,000. As Mdm Ting trusted the plaintiff, she did not count the cash herself. She produced a copy of a page of her passport which shows that she cleared immigration in New Zealand on 9 December 1995.57Foot Note 57×Ting Teng Keow’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 4.I accept that she was in New Zealand at the time of this alleged payment. 64 Mdm Ting further testified in cross-examination that after she had returned to Singapore, she duly delivered the bundle of cash to the defendant. In her recollection, the defendant “just take [sic] the money” and gave no acknowledgment in writing that she had received the money.58Foot Note 58×Certified Transcript, 26 July 2016, Day 1, p 79 at lines 24 to 30.The defendant denies having received this sum of money. But she has not given me any reason not to take Mdm Ting’s evidence at face value. 65 I therefore find on the balance of probabilities that the defendant did receive a sum of US$10,000 in cash from the plaintiff through Mdm Ting in or around December 1995. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (9)  RMB100,000 in December 1998 66 The plaintiff claims that in or around December 1998, he paid the sum of RMB100,000 to the defendant in cash through his brother-in-law, Heng Fook Seng, also known as Vincent. The plaintiff was cross-examined on why this sum was denominated in renminbi and not in US dollars, which was the usual currency for the cash to be delivered to the defendant. The plaintiff explained that the renminbi came from a Chinese tour group who had paid for souvenirs at his shop in in renminbi.59Foot Note 59×Certified Transcript, 3 August 2016, Day 4, p 131 at lines 4 to 8.The plaintiff explained further that he had kept the renminbi notes and asked Vincent to give them to the defendant so that she could deposit the renminbi in bank accounts in China owned by the plaintiff and the defendant’s businesses there.60Foot Note 60×Certified Transcript, 3 August 2016, Day 4, p 131 at line 17 to 20. 67 Vincent’s evidence is that in December 1998, he and his family travelled to Australia for a holiday and went on to New Zealand to visit the plaintiff.61Foot Note 61×Heng Fook Seng’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 4.A day before his return flight to Singapore, the plaintiff asked him to deliver RMB100,000 in cash, comprising 1,000 RMB100 notes, to the defendant in Singapore. Vincent recalls clearly that he duly delivered the cash to the defendant upon his return to Singapore, although he could not recall the location of the delivery. 68 Vincent produced a copy of a page in his passport showing that he cleared immigration in New Zealand on 19 December 1998. I accept that he was in New Zealand at the time of this alleged payment. 69 The defendant denies receiving this sum of money. But she has not given me any reason not to take Vincent’s evidence at face value. I therefore find on the balance of probabilities that the defendant did receive the sum of RMB100,000 in cash from the plaintiff through Vincent in or around December 1998. Again, I make no finding on what happened after that, including how long the defendant was in possession of that cash or what she did with it, if she did anything with it at all. (10)  US$20,000 in April 1999 70 The plaintiff claims that in or around April 1999, he paid the defendant US$20,000 in cash through his brother-in-law, Heng Fock Whatt, also known as Andrew.62Foot Note 62×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 26.Andrew’s evidence is that in late March 1999, he visited the plaintiff and his wife in New Zealand.63Foot Note 63×Heng Fock Whatt’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 4.While Andrew was there, the plaintiff handed him US$20,000 in cash and asked Andrew to deliver it to the defendant in Singapore. Andrew recalls that the cash was in denomination of US$100. He recalls the transaction because he recalls being concerned that he might not make it through New Zealand customs with that amount of cash. Nevertheless he agreed to do what the plaintiff asked.64Foot Note 64×Heng Fock Whatt’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 5.In the event, Andrew cleared customs without difficulty. The plaintiff called Andrew to check if there had been any problems. When Andrew returned to Singapore, he delivered the US$20,000 to the defendant at her house. 71 Andrew has produced a letter dated 24 February 2014 which he wrote to the plaintiff65Foot Note 65×Heng Fock Whatt’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 4.confirming that he visited the plaintiff in late March 1999 and delivered US$20,000 in cash to her as requested by the plaintiff. He also stated in the letter that he could not find his old passport which would have contained evidence of his visit to New Zealand at the relevant time. 72 The defendant rejects Andrew’s account. She points to an earlier letter drafted by the plaintiff’s solicitors and dated 24 September 2013.66Foot Note 66×Defendant’s Closing Submissions dated 3 November 2016 at para 17.The earlier letter stated that Andrew had given the defendant US$80,000 in cash on this occasion, not $20,000.67Foot Note 67×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016, p 84 at para 12.The defendant invited the plaintiff to explain this discrepancy in cross-examination. The plaintiff’s response was terse. He said only that the solicitors’ letter had been drafted without Andrew’s confirmation of the amount. The plaintiff testified that he and his wife later realised US$80,000 was not “feasible”, and they obtained confirmation from Andrew that he had actually carried only “two bundle [sic]”, which indicated a sum of US$20,000.68Foot Note 68×Certified Transcript, 4 August 2016, Day 5, p 31 at lines 8 to 17. 73 It appears to me that the plaintiff has a reason for revising the figure from US$80,000 to US$20,000 but is unwilling to testify as to what that reason is out of fear that he would reveal the true purpose behind asking Andrew to deliver his money to the defendant. I say this for two reasons. 74 First, one of the plaintiff’s answers to the defendant’s questions on why he revised the figure was that “Andrew is new to the games [sic]”.69Foot Note 69×Certified Transcript, 4 August 2016, Day 5, p 28 at line 25.When asked what “game” the plaintiff was referring to, he quickly said, “Er, I mean, Andrew to---er, er, they were---he---he---it’s first time he’s carried money for us.”70Foot Note 70×Certified Transcript, 4 August 2016, Day 5, p 28 at lines 29 to 30.It is suspicious that the plaintiff would characterise the physical delivery of cash from New Zealand to Singapore as a “game”. I need not speculate what that “game” might be. The point is that the plaintiff’s evidence suggests that the novelty of the “game” to Andrew meant that the plaintiff would not have entrusted Andrew with carrying as large an amount in cash as US$80,000. 75 Second, this reading of the plaintiff’s evidence explains why he thought it was not “feasible” for Andrew to have carried US$80,000. It was not feasible in the sense that the plaintiff would not have thought it appropriate to give Andrew such a large sum of money if that was his first time delivering money to the defendant. That to my mind is a very specific reason that is consistent with the plaintiff’s reticence on the ultimate purpose in sending his money from New Zealand on a return journey to Singapore. That is not, however, the concern of this case. Accordingly, I accept that the defendant has a basis for revising the figure from US$80,000 to US$20,000. His evasiveness on what that basis is says more to me about its propriety than about its absence. 76 Next, the defendant contends that the letter is self-serving because it was drafted and signed for no purpose other than to support the plaintiff’s case.71Foot Note 71×Defendant’s Closing Submissions dated 3 November 2016 at para 18.The defendant’s counsel highlighted to the plaintiff in cross-examination that the wording of parts of the letter is very similar to the wording of the relevant section of the plaintiff’s affidavit of evidence-in-chief. The letter states that the plaintiff had handed Andrew the cash with the “specific request” that the cash be given to the defendant. The plaintiff’s affidavit similarly uses the words “specific request”, albeit to describe how the defendant asked the plaintiff to pay specific sums of money to her.72Foot Note 72×Certified Transcript, 3 August 2016, Day 4, p 134 at lines 20 to 22.The plaintiff claims not to know the reason for the similar wording.73Foot Note 73×Certified Transcript, 3 August 2016, Day 4, p 134 at line 23.He also denies instructing Andrew to draft the letter.74Foot Note 74×Certified Transcript, 3 August 2016, Day 4, p 133 at lines 21 to 25. 77 There is some, albeit limited, force in the defendant’s submission on this point. While the plaintiff denies having a hand in drafting Andrew’s letter, he has volunteered the fact that he confirmed the amount of US$20,000 with Andrew at or around the date of the letter. The use of the term “specific request” could have arisen out of their discussions. And that term on its own is in any event insufficient grounds for the inference that the plaintiff directed Andrew to draft the letter. 78 In view of both the plaintiff’s and Andrew’s evidence, I find that the defendant did receive a sum of US$20,000 in cash from the plaintiff through Andrew in or around April 1999. Again, I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. Category C 79 I pause here to make a general point about the evidence on Category C transactions. A substantial part of the plaintiff’s evidence consists of his general description of his usual practice in giving the defendant cash, with no specific evidence of specific details of specific instances in which he did so. In other words, his evidence is based on reconstruction rather than recollection. 80 Reconstructed evidence is of limited value. It is self-serving and is particularly susceptible to the influence of hindsight. It is therefore a significantly weaker form of evidence than evidence from actual recollection. Saying it has limited value is not, however, to say it has no value whatsoever. 81 A case like the present involves an allegation of repeated transactions which occurred over a long period of time. It is natural in those circumstances for a witness to have difficulty retrieving specific recollections of specific details of specific transactions. Further, the transactions in this case took place a decade or more in the past. It is therefore also natural that recollections will have faded. In cases of this type, evidence from reconstruction rather than recollection is likely to be all that a witness can offer the court. I cannot, therefore, discount credibility simply because the plaintiff or his witnesses gives evidence from reconstruction rather than recollection. I bear these considerations in mind in my assessment and description of the witnesses’ evidence. 82 It is also useful first to describe the parties’ evidence on the Category C transactions before each of the transactions is analysed. 83 The plaintiff’s evidence is that it was his practice to pay the defendant US$100,000 every year.75Foot Note 75×Certified Transcript, 3 August 2016, Day 4, p 85 at lines 28 to 30.He would withdraw the sum from his savings account in New Zealand, convert it into US dollars, and then bring the cash to Singapore in bundles of US$100 notes. If he travelled from New Zealand to Singapore in the middle of the year, it would have been winter in New Zealand, and so he and his wife would carry the bundles of notes in their winter jackets.76Foot Note 76×Certified Transcript, 3 August 2016, Day 4, p 87 at lines 27 to 29.When he arrived in Singapore, he would give the cash to the defendant. He, his wife and the defendant would then count the money together.77Foot Note 77×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 33.They would then visit a money changer to convert the cash into the desired currency. 84 The plaintiff’s wife’s evidence is to similar effect. She cannot recall how many times they delivered cash to the defendant in Singapore, only that they did so every time they visited Singapore until 2005.78Foot Note 78×Heng Fock Too’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 15; Certified Transcript, 27 July 2016, Day 2, p 49 at lines 15 to 18.The defendant would pick them up from the airport and they would stay at the defendant’s house for the duration of their visit.79Foot Note 79×Heng Fock Too’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 17.They would hand the cash to the defendant at her house and count it there. They would then visit money changers at People’s Park and Parkway Parade to survey the exchange rates on offer before converting the cash into Singapore dollars at the best available rate.80Foot Note 80×Heng Fock Too’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 18. 85 In view of these two accounts, which are of some generality, the defendant questions the plaintiff’s evidential basis for the specific amounts of cash which he alleges he handed to the defendant annually from 1994 to 2005. That basis, as it emerged from the cross-examination of the plaintiff, comprises two aspects. First, the plaintiff assumes a starting point of US$100,000 for each year. He then adjusts that value up or down according to whether, in his recollection, his business in New Zealand did well that year.81Foot Note 81×Defendant’s Closing Submissions dated 3 November 2016 at para 75; Certified Transcript, 3 August 2016, Day 4, p 118 at lines 24 to 31.Second, the plaintiff assumes that he would have made up for any shortfall in any given year in a subsequent year. Thus, if the plaintiff’s business did badly one year and, as a result, he gave the defendant only US$80,000 for that year, he assumes that he would have given her US$120,000 the next. 86 The defendant characterises this reconstruction of events as “interesting and ingenious”82Foot Note 82×Defendant’s Closing Submissions dated 3 November 2016 at para 75.but stops short of submitting that it is not worthy of belief for being too convenient or unreliable. 87 In my judgment, the defendant’s objections to plaintiff’s evidence for Category C transaction are valid but not fatal. The method by which the plaintiff attempted to recall the amounts which he handed the defendant is naturally reconstructive because those transactions were repeated and happened a decade more earlier, as I have explained. 88 Moreover, notwithstanding her submissions, the defendant’s own evidence corroborates the plaintiff’s and his wife’s evidence that it was their practice to bring cash into Singapore and visit money changers. First, she says in her affidavit of evidence in chief that after the plaintiff delivered the first S$460,000 in December 1993, “he would still send funds over either by bank draft or by cash”.83Foot Note 83×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 10.Second, in cross-examination, the defendant testified that she drove the plaintiff and his wife to visit money changers.84Foot Note 84×Certified Transcript, 5 August 2016, Day 6, p 116 at lines 11 to 15.She recalled that, after they converted the money into Singapore dollars, they would visit a bank either to purchase a bank draft or to deposit the cash into an account. I discuss this further at [126] below. The defendant also gave evidence that the plaintiff sometimes required her to count the cash he had brought. This was a frustrating activity for her as the counting could have been done at a money changer.85Foot Note 85×Certified Transcript, 5 August 2016, Day 6, p 117 at lines 5 to 9.In fact, it appeared to me when she was cross-examined on this aspect of the case that she was more concerned to minimise her role in whatever it was she thought the plaintiff was doing by moving his money from New Zealand in Singapore in this way than to deny that she received any cash in this way from the plaintiff.86Foot Note 86×Certified Transcript, 5 August 2016, Day 6, p 115 at lines 30 to 32, p 116 at lines 29 to 32, p 117 at lines 19 to 21. 89 I now turn to examine the specific transactions under Category C. To avoid repetition, I state from the outset that the analysis of each transaction takes into account the reconstructive nature of the evidence of the plaintiff and his wife, as I have just explained. It also takes into account the basic import of that evidence, namely, that the plaintiff and his wife had an established practice of bringing cash to the defendant in Singapore, and that the defendant at the very least participated in counting that cash and driving the plaintiff and his wife to money changers to convert the cash into the desired currency. Finally, it takes into account the evidence, what little there is, on what happened to this cash. I have found it appropriate to discuss this separately at [126] below only after I have examined the evidence specific to the defendant’s receipt of all the plaintiff’s money. (11)  US$100,000 in August 1994 90 The plaintiff claims that in August 1994, he and his wife travelled to Singapore and delivered to the defendant a sum of US$100,000 in cash.87Foot Note 87×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 13.The plaintiff’s wife remembers that August 1994 was the first time she and her husband brought US$100,000 in cash from New Zealand to Singapore.88Foot Note 88×Certified Transcript, 27 July 2016, Day 2, p 46 at lines 22 to 24.Corroborating her husband’s evidence, she also says that they each carried a portion of that cash in their winter jackets, and that she also put some of it in her bag. 91 The defendant denies having received this sum.89Foot Note 89×Defence and Counterclaim (Amendment No 3) dated 22 June 2016 at para 10(ii). 92 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$100,000 in August 1994 and therefore did receive that sum from the plaintiff. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. In this connection, I note that the defendant’s evidence is that on that occasion, the plaintiff and his wife proceeded to purchase either a bank draft or cashier’s order for the converted money to be paid to New Zealand, and that the defendant was not involved in this transaction.90Foot Note 90×Certified Transcript, 5 August 2016, Day 6, p 115 at lines 25 to 29.At the very least, this evidence from the defendant must be regarded as being consistent with the plaintiff’s evidence that his money went from New Zealand to Singapore and back again. (12)  US$110,000 in March 1995 93 The plaintiff claims that in March 1995, he and his wife travelled to Singapore and delivered to the defendant a sum of US$110,000 in cash.91Foot Note 91×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 17.The plaintiff testified that 1995 was an “average” year for his business, and he therefore brought the defendant S$110,000.92Foot Note 92×Certified Transcript, 3 August 2016, Day 4, p 118 at lines 28 to 29.The defendant denies that she received that sum. 94 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$110,000 in March 1995 and therefore did receive that sum from the plaintiff. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (13)  US$140,000 in October 1996 95 The plaintiff claims that in October 1996, he and his wife travelled to Singapore and delivered to the defendant a sum of US$140,000 in cash.93Foot Note 93×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 23.The plaintiff testified that 1996 was a “very good year” for his business, and he therefore brought the defendant the higher than average sum of US$140,000.94Foot Note 94×Certified Transcript, 3 August 2016, Day 4, p 128 at lines 19 to 23.The defendant denies that she received that sum. 96 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$140,000 in October 1996 and therefore did receive that sum from the plaintiff. Again, I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (14)  US$100,000 in August 1997 97 The plaintiff claims that in August 1997, he and his wife travelled to Singapore and delivered to the defendant a sum of US$100,000 in cash.95Foot Note 95×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 24.The plaintiff testified that 1997 was an “okay” year for his business, and he therefore brought the defendant US$100,000.96Foot Note 96×Certified Transcript, 3 August 2016, Day 4, p 130 at lines 12 to 17.The defendant denies that she received that sum. 98 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$100,000 in August 1997 and therefore did receive that sum from the plaintiff. Again, I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (15)  US$180,000 in September 1999 99 The plaintiff claims that in September 1999, he and his wife travelled to Singapore and delivered to the defendant a sum of US$180,000 in cash.97Foot Note 97×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 27.The defendant’s counsel pointed out to the plaintiff in cross-examination that this was significantly larger than the average US$100,000 which the plaintiff would usually pay to the defendant at one instance.98Foot Note 98×Certified Transcript, 4 August 2016, Day 5, p 31 at lines 22 to 27.The plaintiff gave three reasons for the larger sum. First, he did not give the defendant US$100,000 in 1998. He did however give the defendant US$20,000 in cash in April 1999. So it made sense for him to hand her a further US$180,000 in 1999 so that the average annual sum delivered for the years 1998 and 1999 would be US$100,000.99Foot Note 99×Certified Transcript, 4 August 2016, Day 5, p 32 at lines 2 to 5.I note that this disregards the RMB100,000 given to the defendant through Heng Fook Seng in December 1998. Second, 1999 was also a “good year” for his business.100Foot Note 100×Certified Transcript, 4 August 2016, Day 5, p 32 at line 20.Third, he had consulted the defendant, who commented that she needed more money that year.101Foot Note 101×Certified Transcript, 4 August 2016, Day 5, p 32 at line 32 to p 33 at line 6. 100 These three reasons do not appear in the plaintiff’s affidavit even though they are quite specific and therefore might reasonably have been expected to have been set out there. But the defendant too did not pursue this point in cross-examination or in her submissions. I also note that these reasons were offered by the plaintiff in a piecemeal fashion and only when it was suggested to him that he was retrospectively apportioning the amount of cash he might have handed the defendant in September 1999.102Foot Note 102×Certified Transcript, 4 August 2016, Day 5, p 32 at line 19.But the defendant has placed before me nothing to contradict the plaintiff’s assertions in this regard. In the circumstances, I consider that the plaintiff’s manifest attempt here to reconstruct what happened in 1999 does not, in itself, lead to the inference that his account is untrue. 101 I also bear in mind the plaintiff’s and his wife’s evidence on how they delivered cash to the defendant over the years, and the defendant’s concession that she took them to money changers to convert that cash into local currency. 102 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$180,000 in September 1999 and therefore did receive from the plaintiff that sum. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (16)  US$80,000 in August 2000 103 The plaintiff claims that in August 2000, he and his wife travelled to Singapore and delivered to the defendant a sum of US$80,000 in cash.103Foot Note 103×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 28.The plaintiff testified that he handed a lower sum of US$80,000 to the defendant in 2000 because “there was no project”, and as a result, the defendant told him to “bring in lesser [sic] money”.104Foot Note 104×Certified Transcript, 4 August 2016, Day 5, p 33 at lines 25 to 30. 104 The defendant denies that she received this sum. 105 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$80,000 in August 2000 and therefore did receive from the plaintiff that sum. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (17)  US$80,000 in May 2001 106 The plaintiff claims that in May 2001, he handed the defendant a briefcase containing cash in the sum of US$80,000 at Changi Airport in Singapore.105Foot Note 105×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 29.The briefcase had a combination lock and he told the defendant the combination. He put the cash in a briefcase because he was going to give it to the defendant in a public place and not in her house where it was usually done.106Foot Note 106×Certified Transcript, 4 August 2016, Day 5, p 35 at lines 21 to 22.He wasen routeto Bangalore, India with his wife and friends to see a Hindu guru. The plaintiff recalled that this was the only time he, his wife and the defendant did not count the cash together. He testified that the defendant later informed him that it was US$100 short of US$80,000.107Foot Note 107×Certified Transcript, 4 August 2016, Day 5, p 36 at lines 5 to 6. 107 The defendant denies that she received that sum. 108 I find on the balance of probabilities that the defendant did at least handle cash from the plaintiff in the sum of US$80,000 sometime in May 2001 and therefore did receive it from the plaintiff. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (18)  US$120,000 in June 2002 109 The plaintiff claims that in June 2002, he and his wife travelled to Singapore and handed the defendant a sum of US$120,000 in cash.108Foot Note 108×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 30.The plaintiff explains that amount on the basis that he had given the defendant only S$80,000 the previous year. 110 The defendant denies that she received that sum. 111 In my judgment, the plaintiff has satisfied me on the balance of probabilities that the defendant did at least handle the US$120,000 in June 2002 and therefore did receive from the plaintiff that sum. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (19)  S$230,000 over early 1998, early 2000 and mid 2007 112 The plaintiff claims that the defendant and her family visited him in New Zealand on three separate occasions: first, in January or February 1998; second, in February or March 2000; and third, in May 2007. The plaintiff’s evidence is that he delivered to the defendant S$230,000 in cash “[d]uring the course of” these three visits.109Foot Note 109×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 31. 113 The defendant denies that she received this sum. 114 It was further established in cross-examination that the plaintiff gave the defendant S$120,000 on the first visit, S$110,000 on the second visit, and nothing on the third visit.110Foot Note 110×Certified Transcript, 4 August 2016, Day 5, p 37 at lines 12 to 22.This, I note, is not strictly inconsistent with the plaintiff’s evidence. What does seem unusual is that these sums were in Singapore dollars whereas the plaintiff usually handed the defendant cash in US dollars. The defendant spotted this unusual feature but did not pursue it substantially in cross-examination.111Foot Note 111×Certified Transcript, 4 August 2016, Day 5, p 39 at lines 6 to 15. 115 I find that the plaintiff did hand the defendant S$230,000 in early 1998, early 2000 and mid-2007. I make no finding on what she did with the cash, if she did anything with it at all, and whether it remains in her possession. (20)  S$550,000 and US$436,000 on unknown dates 116 The plaintiff’s evidence is that he sent the defendant three other traveller’s cheques112Foot Note 112×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 34.in the total sum of S$550,000. The plaintiff is unable to produce copies of these cheques as evidence. He also refers to two bank drafts issued by the Rotorua National Bank which he purchased in favour of the defendant in the total sum of US$436,000.113Foot Note 113×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 35.One draft was in the sum of US$168,000 and the other was in the sum of US$268,000. 117 The defendant denies having received any of these instruments. 118 This plaintiff’s case on these five instruments is unsupported by documentary evidence, unlike his case on the instruments in Category A and B. However, I note that the plaintiff admits that he did not keep a full record of all his transactions with the defendant.114Foot Note 114×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at para 40.He states that by the time he thought that something was amiss, it was too late to retrieve the records for some of these transactions. In cross-examination, the plaintiff explained why it was too late by alluding to the fact that the Rotorua National Bank had been acquired by ANZ Bank New Zealand.115Foot Note 115×Certified Transcript, 4 August 2016, Day 5, p 42 at lines 13 to 15. 119 Despite the absence of documentary evidence, I accept the plaintiff’s evidence on these five instruments. I do so on three grounds. First, I rely on the available evidence relating to the other transactions by which the plaintiff moved money out of New Zealand. That evidence shows that the plaintiff did want to move significant sums of money out of New Zealand, although I make no finding on why. The point here is that this desire makes the plaintiff’s claim that he paid S$550,000 and US$436,000 to the defendantprima faciecredible. Second, the plaintiff has been candid about the fact that he is unable to produce documentary evidence for these transactions. Third, as with many of the transactions I have examined, the defendant has produced no evidence to contradict the plaintiff’s claim. 120 I therefore find that at some point between 1993 and 2007, the plaintiff did pay to the defendant S$550,000 by way of traveller’s cheques and US$436,000 by way of bank drafts over and above all of the other money which I have found that he paid to her above. I make no finding on what she did with these sums, if she did anything with them at all, and whether they remain in her possession.",
        "Total sums received": "121 I now summarise in three tables the total sum which the plaintiff paid to the defendant from 1993 to 2007. I start with Category A. The only sums in this category on which I have rejected the plaintiff’s case are the traveller’s cheques he sent to Teo Chye Har: see [56]–[58] above. The sums in Category A which I have found the plaintiff paid to the defendant are therefore as follows. DateMode of TransferSumDecember 1993Traveller’s chequeS$460,000.00May 1995Traveller’s chequeS$8,367.40November 1995Traveller’s chequeS$128,000.00May 1996Traveller’s chequeS$208,000.00TotalS$804,367.40 122 The second table is for Category B. The only sum in this category on which I have rejected the plaintiff’s case is the traveller’s cheque he sent to Uno Cafim: see [60] above. The sums in Category B which I have found the plaintiff paid to the defendant are therefore as follows. DateMode of TransferSumDecember 1995CashUS$10,000December 1998CashRMB100,000April 1999CashUS$20,000TotalUS$30,000RMB100,000 123 The third and final table is for Category C: DateMode of TransferSumAugust 1994CashUS$100,000March 1995CashUS$110,000October 1996CashUS$140,000August 1997CashUS$100,000September 1999CashUS$180,000August 2000CashUS$80,000May 2001CashUS$80,000June 2002CashUS$120,000Early 1998, early 2000 and mid 2007CashS$230,000Unknown datesTraveller’s cheques and cashUS$436,000S$550,000TotalUS$1,346,000 S$780,000 124 The grand total for all three categories is US$1,376,000, S$1,584,367.40 and RMB100,000. These are the same total figures which the plaintiff’s forensic accounting expert, Mr Leow Quek Shiong (“Mr Leow”), has arrived at in his report.116Foot Note 116×Leow Quek Shiong’s Affidavit of Evidence-in-Chief dated 9 June 2016, p 16 at para 5.1.Mr Leow too did not take into account money which the plaintiff paid to Teo Chye Har and Uno Cafim. 125 Mr Leow’s figures are, however, different from the total sums which the plaintiff claims in his pleadings. Those sums are US$1,656,000, S$2,011,367.40, and RMB100,000. The difference between the sums is US$280,000 and S$427,000. Neither party has explained the difference in these two sums to me. I disregard the differences and consider only those sums in US dollars and in Singapore dollars which I have found the plaintiff paid to the defendant.",
        "How the defendant dealt with the sums": "126 The relief which the plaintiff seeks from the defendant is an account of how she has dealt with these sums. I do not intend to make any conclusive finding on what the defendant did with them. But I consider that her evidence on this aspect of the case corroborates my finding that she did receive these sums. That evidence can be summarised in four points: (a) First, the defendant and plaintiff opened a joint account with UOB in August 1994, when they first met.117Foot Note 117×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 24; Certified Transcript, 3 August 2016, Day 4, p 38 at line 31 to p 39 line 2.This was to hold the plaintiff’s money, because the defendant did not want to mix his money with hers. (b) Second, the defendant said that she deposited into this account three sums she received under three Category A transactions.118Foot Note 118×Certified Transcript, 5 August 2016, Day 6, p 120 at line 24 to p 121 at line 17.The first is an unquantified portion of the proceeds of the traveller’s cheque dated 2 December 1993 in the sum of S$460,000 which was left in the defendant’s hands after paying for the Shanghai properties. The second is the proceeds of the traveller’s cheque dated 17 November 1995 in the sum of S$128,000. And the third is the proceeds of the traveller’s cheque dated 30 May 1996 in the sum of $208,000. (c) Third, the defendant admits that she deposited the plaintiff’s cash into the UOB joint account. She testified not only to chauffeuring the plaintiff and his wife to money changers to convert the cash they brought in to Singapore, but also to receiving the converted cash in Singapore dollars.119Foot Note 119×Certified Transcript, 5 August 2016, Day 6, p 125 at lines 6 to 27.They would then together deposit the converted cash into the UOB joint account.120Foot Note 120×Certified Transcript, 5 August 2016, Day 6, p 126 at lines 3 to 5.This corroborates the plaintiff’s and his wife’s evidence on the same topic: see [88] above. I find that this cash is very likely to be the same cash which I have found the defendant to have received pursuant to the Category B and C transactions, although the evidence is not clear on how much of that cash was in fact deposited into the UOB joint account. (d) Fourth, there is documentary evidence that the defendant purchased demand drafts in favour of the plaintiff. Copies of the application forms for these demand drafts was produced at trial. These copies all name the defendant as the applicant and the remitter, although the defendant claims that others helped the plaintiff purchase demand drafts.121Foot Note 121×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 12.The face value of these drafts were usually debited either from the parties’ joint account with UOB or from the defendant’s sole account with UOB.122Foot Note 122×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 11 and pp 47, 48, 50 and 56; Leow Quek Shiong’s Affidavit of Evidence-in-Chief dated 9 June 2016, p 26 at para 6.13.In this connection, the defendant’s evidence was that she transferred the plaintiff’s money from the joint account with UOB into her sole account with UOB to purchase demand drafts for the plaintiff. On the other hand, some of these drafts were paid for in cash.123Foot Note 123×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at pp 52 to 53.In cross-examination, the defendant denied having used cash at the bank to purchase demand drafts, although she had no good explanation for why the application forms nevertheless said that the draft had been paid for in cash.124Foot Note 124×Certified Transcript, 5 August 2016, Day 6, p 126 at lines 20 to 22 and p 128 at line 10 to p 131 line 10.If however she was the applicant, she must have had cash on hand to make the application, cash which she in all likelihood received from the plaintiff.",
        "Decision": "127 For all these reasons, I find that from 1993 to 2007, the plaintiff paid to the defendant U$1,376,000, S$1,584,367.40 and RMB100,000.",
        "Issue 2: Resulting trust": "128 The next issue is whether the defendant became a resulting trustee of these sums by virtue of her having received them from the plaintiff with no donative intent on his part. The answer must be that she did. Before supplying my reasons, I should foreshadow that the proper analysis of the resulting trust in the present case, which I undertake in this section, will have some (albeit limited) effect on whether the defendant may be said to owe the plaintiff any fiduciary duties and on the content of those duties, which I shall examine in due course. 129 The Court of Appeal has expressed a preference for Professor Robert Chambers’ view that a resulting trust arises whenever the intention of a transferor to benefit a transferee is vitiated or absent:Lau Siew Kim v Yeo Guan Chye Terenceand another[2008] 2 SLR(R) 108 (“Lau Siew Kim”) at [35]perV K Rajah JA;Chan Yuen Lan v See Fong Mun[2014] 3 SLR 1048 (“Chan Yuen Lan”) at [44]perV K Rajah JA. That preference, however, has not led to an abolition (Lau Siew Kimat [51]) of either the doctrine of presumed resulting trust or the classical distinction between presumed and automatic resulting trusts. Those terms, of course, are the labels for the two sets of circumstances identified by Lord Browne-Wilkinson inWestdeutscheLandesbank Girozentrale v Islington London Borough Council[1996] AC 669 (“Westdeutsche”)at 708A–B as giving rise to a resulting trust: Under existing law, a resulting trust arises in two sets of circumstances: (A) where A makes a voluntary payment to B or pays (wholly or in part) for the purchase of property which is vested either in B alone or in the joint names of A and B, there is a presumption that A did not intend to make a gift to B: the money or property is held on trust for A (if he is the sole provider of the money) or in the case of a joint purchase by A and B in shares proportionate to their contributions. It is important to stress that this is only apresumption, which presumption is easily rebutted either by the counter-presumption of advancement or by direct evidence of A’s intention to make an outright transfer … (B) Where A transfers property to Bon express trusts, but the trusts declared do not exhaust the whole beneficial interest … 130 The case before me does not, on any account, involve an automatic resulting trust. The plaintiff accepts that there is insufficient evidence – nor is it is his case – that he created an express trust which failed.125Foot Note 125×Certified Transcript, 1 December 2016, Day 10, p 6 at lines 16 to 19 and p 9 at lines 17 to 20.It is, however, common ground that the plaintiff paid money to the defendant voluntarily, not intending to make a gift to her of the money. Therefore, the correct analysis of the resulting trust which arose in this case is that it is a presumed resulting trust,iethe first type of resulting trust which Lord Browne-Wilkinson describes inWestdeutsche. 131 Since it is common ground that the plaintiff had no donative intent, there is no need to consider whether the presumption that Lord Browne-Wilkinson speaks of has been rebutted. In any event, it would have been an uphill task. The Court of Appeal has held that the strength of the presumption of a resulting trust varies with the circumstances in which the resulting trust arises, and correspondingly, the quality of evidence required to rebut the presumption varies with the strength of the presumption:Lau Siew Kimat [52]perV K Rajah JA. As I will show below, the defendant was actively involved in managing and investing the plaintiff’s assets in a manner which demonstrated her full awareness that the plaintiff had no intention of vesting in her the beneficial interest in his money or in the assets which she acquired with his money. The defendant would have been hard-pressed to rebut the plaintiff’s presumed lack of donative intent. 132 The defendant argues, however, that a further requirement for a resulting trust is that the transferor must have transferred property into the transferee’s sole name and not into their joint names.126Foot Note 126×Defendant’s Closing Supplementary Submissions dated 23 January 2017 at para 13.The defendant appears to suggest that because some, if not all, of the money which the defendant received was deposited into the UOB joint account, there can be no resulting trust. 133 I have no hesitation in rejecting this submission. It is inconsistent with Lord Browne-Wilkinson’s authoritative description of the presumed resulting trust, in which he specifically contemplates the gratuitous transfer of property into sole or joint names:Westdeutscheat 708A (see the block quote at [129] above). The submission is also inconsistent with the premise of many family trust cases, including the Court of Appeal’s decision inLau Siew Kim, in which a frequent bone of contention is whether the presumption of resulting trust over property transferred into joint names is rebutted by the counter-presumption of advancement. Finally, the submission is inconsistent with the early authorities. InIn re Vinogradoff; Allen v Jackson[1935] WN 68, a testatrix transferred without consideration war stocks into the joint names of herself and her four-year-old granddaughter. The testatrix continued to receive the income on the stocks until her death. Farwell J held that a presumption of a resulting trust arose, such that “[t]he stock was not the property of the infant, but formed part of the testatrix’s estate”. The principle behind these cases should not be missed. A joint owner of property for which she did not pay, like a sole owner of such property, is vested with legal title to the property. Equity, which will not aid a volunteer, presumes her to be a resulting trustee of that property. 134 The defendant relies onAlagappaSubramanian v Chidambaram s/o Alagappa[2003] SGCA 20 (“Alagappa”) to support her position. She says that Court of Appeal in that case held that there was a resulting trust “because” the trust funds were deposited into the trustee’s sole account.127Foot Note 127×Defendant’s Closing Supplementary Submissions dated 23 January 2017 at para 14.This is a misreading of the case.Alagappaconcerned a family trust managed by two brothers, C and S. One of the issues was whether S was in an overdrawn position with regard to a family account held in their joint names which they were entitled to draw on for their personal expenses. On appeal, S challenged the amount by which the trial judge had found him to be overdrawn. S succeeded by showing that the judge had failed to credit to S, among other sums, a sum of $109,902 in four cheques which S had given C for the purpose of the family account. S was able to prove that C had instead deposited these cheques into his sole account for his own use. So the court found that C was a resulting trustee of the sum of $109,902:Alagappaat [50]perJudith Prakash J (as she then was). Accordingly, it is plain that the existence of the resulting trust had nothing to do with whether that sum was transferred into a joint or sole accountper seand everything to do with S’s presumed lack of donative intent in relation to C in giving him the cheques.Alagappatherefore provides no support to the defendant’s submission. 135 Finally, I note that the defendant did not receive the sums of US$1,376,000, S$1,584,367.40 and RMB100,000 from the plaintiff all at once. That can mean one of two things. First, it can mean that a single resulting trust arose upon the first payment, with every subsequent payment being an accretion to the trust property which was the subject-matter of that single trust. Or it could mean that a separate and fresh resulting trust arose every time the plaintiff paid a sum to the defendant, with that single sum as the trust property. The former analysis might have been correct if I had found that the plaintiff intended to create an express trust by his payment to the defendant in 1993 and continued contributing to the trust property over the years until the trust failed sometime after 2007 and a resulting trust arose. But that is not what happened and not what I have held. I have held that the money was held on a presumed resulting trust, not an automatic resulting trust. The latter is therefore the correct analysis in this case. Conceptually speaking, the series of sums which the plaintiff, acting with no donative intent, paid to the defendant as a volunteer from 1993 to 2007 became the subject-matter of a series of separate resulting trusts, all of which had the defendant as the resulting trustee and the plaintiff as thecestui que trust. 136 It is, however, also the case that the defendant has not rebutted any of the presumptions of resulting trusts with regard to the twenty or so transactions through which she received the plaintiff’s money. One piece of evidence that the defendant relied on in this regard is her evidence that the plaintiff repaid her in cash a debt which he owed to her arising from her payment on his behalf when he purchased his second tranche of shares in GK Holding.128Foot Note 128×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 60.But it is not the defendant’s evidence that any of Category A, B or C transactions was a repayment of this nature. And the plaintiff denies that the debt was even incurred. So the first point I make is that the evidence on which the defendant relies is inconclusive. Second, even if the plaintiff did have donative intent in giving the defendant some money (to pay off his debt to her), there is no evidence that that cash was any part of the total sums which I have found the plaintiff to have paid the defendant. 137 For these reasons, I conclude that the defendant held the sums of US$1,376,000, S$1,584,367.40 and RMB100,000 on resulting trust for the plaintiff. For convenience, I will consider these sums in the analysis below as being subject to a single resulting trust in favour of the plaintiff. Where however there is a need to analyse allegations of breaches of fiduciary duties in respect of specific sums, I will analyse the individual resulting trust over that sum and the fiduciary duties which go with it: seeeg[217] below.",
        "Issue 3: Fiduciary duties": "138 The third issue which I have to determine is whether the defendant, as a trustee under a resulting trust, owes the plaintiff any fiduciary duty or duties, including the duty to account for the money. The proper approach to this issue was set out in the Court of Appeal’s recent decision inTan Yok Koon v Tan Choo Suanand another and other appeals[2017] 1 SLR 654 (“Tan Yok Koon”), which I will discuss first. I will then consider the existence and nature of the fiduciary relationship between the plaintiff and the defendant, and whether that relationship gave rise to any fiduciary duties on the part of the defendant.",
        "Tan Yok Koon": "139 It is common ground that a resulting trustee has a duty to account by virtue of her trusteeship. The High Court has also taken this position. InCheong Soh Chinand others v Eng Chiet Shoong and others[2015] SGHC 173 (“Cheong Soh Chin”), I took the view at [38] that a trustee’s duty to account is so fundamental that it is part of the irreducible core of a trust, such that a resulting trust must also be taken to encompass such a duty. A number of Canadian cases also adopt a similar analysis: seeMacQuarrie v Barber(1993) 146 AR 81;Archer v St John[2008] AJ No 446 (“Archer”). InArcher,the defendant gratuitously received a plot of land from the deceased and was by virtue of that fact held to be a resulting trustee of it. The court held that the defendant owed a duty to the estate to account for the revenue she received on the land, and that that duty arose together with the resulting trust. 140 That analysis has now to be revised in the light ofTan Yok Koon. In that case,the Court of Appeal examined the question of whether a resulting trust is capable of encompassing fiduciary duties. The court observed that the concept of an irreducible core of trustee’s duties was developed in the context of express trusts and does not apply to all trusts, and certainly not to resulting trusts. This is because resulting trusts arise in a variety of situations, not all of which affect the conscience of the resulting trustee in such a way as to require her to act like an express trustee. Moreover, fiduciary obligations are voluntarily undertaken, in the sense that they arise as a consequence of the fiduciary’s conduct and are not imposed by law independently of the fiduciary’s intentions. Therefore, a resulting trustee will be burdened with only those fiduciary duties which she expressly or implicitly assumes. The court must examine objectively her conduct to determine whether she assumed such duties. Further, the precise content of the duties are not fixed but are to be deduced from the surrounding circumstances, including and especially any relationship between the parties. 141 The Court of Appeal came to these conclusions after analysing a comprehensive number of authorities. It distilled its analysis to the following test (at [206]perAndrew Phang Boon Leong JA): The real question, in our view, is whether,objectivelyspeaking, the resulting trustee can be said to have undertaken (whether expressly or impliedly) to act in a particular way which is fiduciary in nature. In this regard, the knowledge that one does not hold the beneficial interest in the property is, whilenotasufficientcondition by itself, strictlynecessarybecause the conscience cannot otherwise be affected in a way that equity can take cognisance of. The duties that are applicable to each resulting trustee will vary significantly, and are veryfact-specific. The duties owed by a resulting trustee to the settlor-beneficiary will, however, almost invariably be narrower than the duties owed by an express trustee in relation to the beneficiaries. [emphasis in original] 142 In formulating this test, the court relied on the work of Professor Robert Chambers – as it did inLau Siew KimandChan Yuen Lan– among other academic writers. The court made reference to Chambers’ theory of a scale of resulting trust obligations that corresponds to the circumstances in which resulting trusts arise:Tan Yok Koonat [200]. Chambers draws a broad distinction between fiduciary obligations at the higher and lower end of the scale. That distinction did not ultimately feature in the Court of Appeal’s test (cited in the preceding paragraph) although it no doubt informed the content of that test. But the Chambers’ scale played a significant role in the court’s application of the test to the facts of the case. I therefore find it appropriate to set out the relevant part of Chambers’ analysis, which can be found in Robert Chambers,Resulting Trusts(Oxford University Press, 1997, reprinted 2006) at pp 198–199: At the lower end of the scale are cases where the resulting trust arises in the absence of any pre-existing fiduciary relationship and without the knowledge of the resulting trustee.Sinclair v. Broughamwas just such a case and, although it has been overruled with respect to whether a payment under a void contract gives rise to a resulting trust, it contains valuable insights into the consequences of resulting trusts in situations involving innocent recipients. InChase Manhattan Bank N.A.v.Israel-British Bank (London)Ltd., Goulding J. usedSinclairv.Broughamto support his conclusion that ‘a person who pays money to another under a factual mistake retains an equitable property in it and the conscience of the other is subject to a fiduciary duty to respect his proprietary right’. In other words, an event gives rise to the recipient’s fiduciary obligation to respect the provider’s proprietary right. As the Texas Supreme Court stated, the resulting trust is ‘a fiduciary relationship … insofar as the trust property is concerned’. The fiduciary obligations need not extend beyond those necessary to protect the provider’s interest in that property. There is no reason to involve the strict duties of loyalty applicable to an express trustee. InSinclair v. Brougham, Viscount Haldane L.C. held that there had ‘been no breach of fiduciary duty on the part of the society’ even though the society had received the depositors’ money on resulting trust and used it for its own benefit. At the higher end of the scale are cases where the resulting trust arises on the failure of an express trust. The resulting trustee has agreed to obey strict rules of fidelity and exercise a certain standard of care as an express trustee and there is no reason for those obligations to cease when the express trust fails (unless the resulting trustee reasonably believes himself or herself to be entitled to the surplus). The trustee is already in a fiduciary relationship when the resulting trust arises (albeit with the beneficiaries of the express trust and not the settlor). Although the resulting trustee is a fiduciary only ‘insofar as the trust property is concerned’, that must involve the same duties of loyalty and care he or she has previously consented to observe with respect to that same property. As Ford and Lee state: ‘Where the resulting trust arises in relation to an express trust the trustee’s duties of administration under the express trust will be owed as much for the benefit of the person entitled under the resulting trust as for the benefit of any beneficiaries under the express trust’. 143 On the facts ofTan Yok Koon, the Court of Appeal found that the eldest sister in a family held, among other things, certain shares on resulting trust for her four siblings, all of whom had earlier transferred those shares to her. One of the issues was whether she owed her siblings any fiduciary duties as a resulting trustee. The court held that as a resulting trustee, she had impliedly undertaken to act honestly and in good faith in relation to her siblings in dealing with those shares, at least to the extent that her conduct ought not to be for her own benefit. Focusing on her knowledge of the circumstances, the court found that she knew that the beneficial ownership of the shares vested not in her but in her four siblings. And she knew specifically that the beneficial ownership of the shares transferred to her by two of those siblings belonged to each of them respectively. This is because she knew that those transfers were made pursuant to family arrangements which never eventuated. 144 InTan Yok Koon, the court further examined the resulting trustee’s state of mind under two alternative legal analyses of the transfers of shares to her (at [213]–[214]). Each analysis corresponds to one of the two classical circumstances in which resulting trusts are said to arise according to Lord Browne-Wilkinson inWestdeutscheat 708A–B: see [129] above. Under the first analysis, the resulting trust is said to arise from the failure of an express trust. Such a case, in Chambers’ view, more readily supports fiduciary duties owed by the resulting trustee because she was already in a fiduciary relationship with the settlor-beneficiary as express trustee. Thus, if the transfers of shares inTan Yok Koonwere made to set up an express trust (or a non-charitable purpose trust) which subsequently failed, then the trustee would be taken to have undertaken to the settlors to administer the trusts in good faith for the benefit of whoever was to be the beneficiary of the trust and, at the very least, not to do so for her own benefit. Under the second analysis, the resulting trust is said to arise from a gratuitous transfer of property. In such a case, Chambers holds that the resulting trustee’s fiduciary duties generally need not extend beyond those necessary to protect the transferor’s interest in that property. But inTan Yok Koon, the trustee was on the facts fully aware that the transferors did not intend her to be the beneficial owner of the shares. She also did not give any indication that she was unwilling to be a trustee of those shares. In any event, the trustee was not an innocent recipient of the shares. 145 The circumstances inTan Yok Koonrelieved the court from having to choose between the two analyses of the resulting trust which arose in that case. On the facts, both analyses led to the conclusion that the resulting trustee was subject to a fiduciary duty to act honestly and in good faith. But it seems to me that even if a case permits the court only one possible way of characterising the resulting trust, the effect ofTan Yok Koonis to make that characterisation only aprima facieindication of the existence of and content of any fiduciary duties to which the resulting trustee is subject, the only decisive inquiry being her conduct and especially her state of mind. 146 In my view, while this fact-centric approach is useful for determining the existence of fiduciary duties, particularly in a case which falls somewhere in the middle of Chambers’ scale of resulting trust obligations, there are surely limits to how it can be applied meaningfully to determine even the content of those fiduciary duties. It is not clear to me whether Chambers means to say that in a case at the lower end of his scale of resulting trust obligations, a resulting trustee (a) generally has no fiduciary duties beyond protecting the trust property or (b) could have any number of --fiduciary duties, but their content is generally attenuated by the circumstances of the case. By making the “precise content” of the fiduciary duties owed by a resulting trustee contingent on the circumstances (at [205]),Tan Yok Koonseems to have accepted both (a) and (b). But there are problems of theory and logic with the latter whichTan Yok Koondid not fully explore. 147 At a theoretical level, even an express trustee – who is the paradigm voluntary acceptor of fiduciary obligations – does not knowingly consent to the “precise content” of the fiduciary duties which she undertakes upon appointment and is obliged to discharge. Consider for example her duty to account. The content of the duty does not originate from the trustees’ explicit or implicit voluntary assumption of the duty. It is surely equity which imposes upon her a duty to keep clear and accurate accounts of the trust property and of her management of it, and to present the accounts at the beneficiary’s request together with supporting documentation: see David Hayton et al,Underhill and Hayton: Law of Trusts and Trustees(LexisNexis, 19th Ed, 2016) (“Underhill”) at para 56.1. Equity fills the duty to account with this content for two purposes: first, to ensure that the beneficiary is kept apprised of the status of the trust fund and the transformations it has undergone; and second, to ensure that any personal liability which a custodial fiduciary may have as a result of maladministration is ascertained and determined:LalwaniShalini Gobind and another v Lalwani Ashok Bherumal[2017] SGHC 90 at [16]perAedit Abdullah JC. 148 Next, from a logical standpoint, even if the “precise content” of a fiduciary duty owed by a resulting trustee depends on the circumstances, how the circumstances supply content to the duty is itself a legal question. It is the law which decides how an “is” leads to an “ought”. SoTan Yok Kooncannot be read to prescribe a reductionist focus on the facts of the case, eschewing all reference to the established content of fiduciary duties. That would not only create the risk of opaque reasoning by the courts but would also deprive the concept of a fiduciary duty of its normative content. That normative content is determined by the law and is declared and developed by the courts of equity. 149 If, therefore, a resulting trustee is found to have voluntarily assumed a duty to account, there is no reason to hold that the resulting trustee’s duty to account is any different in content from an express trustee’s duty to account. However, to the extent that there is, I have provided an alternative analysis of the facts of this case on that approach at [210]–[211] below, and it is sufficient to state here that that analysis does not at all change the outcome. 150 In the light of these principles, I turn to analyse the facts of the present case.",
        "Parties’ fiduciary relationship": "151 The parties made their submissions without the benefit ofTan Yok Koon, as it was handed down too close to the date on which I heard submissions. They have, however, addressed the substance of the issue, which is whether there was a fiduciary relationship between the plaintiff and the defendant which gave rise to fiduciary duties on the defendant’s part. In particular, the plaintiff has proceeded on the basis that he has to show how the defendant acted as if she was his fiduciary129Foot Note 129×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 175 and 193.– which is consistent withTak Yok Koon’s approach of asking whether, based on the resulting trustee’s conduct and state of mind, she can be said to have assumed any fiduciary duties to the beneficiary. In my judgment, there was a fiduciary relationship and the defendant does owe the plaintiff a number of fiduciary duties, including the duty to account for the money she held on resulting trust. There are three principal pieces of evidence which support this conclusion. 152 First, the parties had an ongoing arrangement pursuant to which the defendant undertook to assist the plaintiff in managing and investing the money which he paid her. The defendant admitted that even before she received the first traveller’s cheque for S$460,000 from the plaintiff in December 1993, she had a conversation with the plaintiff and his wife in which they asked her to hold the sum for a suitable property investment.130Foot Note 130×Certified Transcript, 5 August 2016, Day 6, p 101 at line 23 to p 102 line 8.She then looked for an investment for the plaintiff. That led to the defendant recommending to the plaintiff that he use that sum to purchase the Shanghai properties. Her recommendation is set out in a facsimile which she sent the plaintiff dated 17 December 1993.131Foot Note 131×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 97. 153 The defendant continued to act on the arrangement by recommending at least two further investments to the plaintiff and then applying his money to make the investments. The first investment was the acquisition of shares in GK Holding in two tranches: the first in 1995/1996 and the second in 1999/2000.132Foot Note 132×Leow Quek Shiong’s Affidavit of Evidence-in-Chief dated 9 June 2016 at pp 37 to 40.It was on the defendant’s recommendation that the plaintiff bought the shares.133Foot Note 133×Certified Transcript, 10 August 2016, Day 8, p 3 at lines 14 to 19.The defendant does not deny that the plaintiff relied on her recommendation and judgment in deciding to invest in GK Holding shares. In particular, the defendant admits that the plaintiff asked her to analyse the purchase price in connection with the purchase of the second tranche of shares.134Foot Note 134×Certified Transcript, 10 August 2016, Day 8, p 30 at lines 7 to 16; Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 56. 154 The second investment is the purchase of 100,000 Citigroup shares worth US$389,400. The defendant appears to have informed the plaintiff that she purchased these shares with his money by an email dated 27 January 2010.135Foot Note 135×Leow Quek Shiong’s Affidavit of Evidence-in-Chief dated 9 June 2016 at p 134.This investment was made over a period of about three months between November 2009 and January 2010.136Foot Note 136×Leow Quek Shiong’s Affidavit of Evidence-in-Chief dated 9 June 2016, p 33 at para 7.34. 155 It can be seen that these investments occurred during or soon after the period in which I have found that the defendant received the plaintiff’s money,ie1993 to 2007. With the exception of the first US$460,000 which she used to purchase the Shanghai properties, it is not possible to identify which sums she applied to which investment. But the point here is that the plaintiff voluntarily undertook an ongoing arrangement with the defendant to manage and invest his money. Part of that arrangement permitted her to exercise a degree of discretion in managing and investing his money. I find that degree of discretion also to be a relevant consideration. 156 Second, and this follows naturally from the previous strand of evidence, the plaintiff clearly reposed a high degree of trust in the defendant to manage and invest his money. I draw this inference from a number of facts. The plaintiff paid the defendant the substantial sum of S$3.5m over a period of nearly 15 years. Further, the plaintiff was eager to move his money out of New Zealand, even if only temporarily. He therefore needed a person outside New Zealand whom he could trust to receive the money. That person was the defendant. Finally, the plaintiff said that he treated the defendant like a trustee.137Foot Note 137×Certified Transcript, 4 August 2016, Day 5, p 64 at lines 27 to 28.While that would ordinarily be dismissed as a self-serving statement designed for litigation, the defendant herself accepted in cross-examination that the plaintiff had reposed a degree of trust in her by permitting her over a long period of time to manage large quantities of his money and assets.138Foot Note 138×Certified Transcript, 11 August 2016, Day 9, p 49 at lines 17 to 27.There is no doubt, therefore, that equity affected the defendant’s conscience from the outset. 157 Third, between 1993 and 2007, the defendant updated the plaintiff on the status of his investments whenever he asked her for information. As the plaintiff correctly says, the defendant did not deny then, as she does now, that she had a duty to account for the plaintiff’s investments.139Foot Note 139×Plaintiff’s Closing Submissions dated 29 September 2016 at para 175.She also did not appear to draw a distinction between her duty to account for the plaintiff’s investments and her duty to account for money which the plaintiff paid to her only to be paid back immediately to the plaintiff. Thus, when in 2012 the defendant asked for all his “inwards cash records, either in Singapore and [sic] foreign currencies”, all his “outwards cash payments records”, and any relevant financial records, “from beginning to now”,140Foot Note 140×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 417.she did not deny that she had an obligation to produce those records. She said only that the records had been disposed of during a spring cleaning exercise.141Foot Note 141×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 420.Further, the fact that she retained the records at all implies that she acknowledged a duty to retain them, at least for some time. 158 In the light of this evidence, I find that the defendant knew from the outset of the parties’ arrangement,iefrom 1993, that the money she was to receive from the plaintiff – and which she actually did receive from the plaintiff over the years – was always to remain beneficially the plaintiff’s and not hers. This satisfies the necessary, albeit insufficient, condition for the existence of fiduciary duties owed by the defendant as a resulting trustee. Next, I find that the defendant was a fiduciary in relation to the defendant on the basis of the arrangement between them under which the defendant would manage and invest his money and on the basis of the trust the plaintiff reposed in her to have dominion over large quantities of his money and the assets in which the money was invested. 159 Accordingly, I find that the defendant at least implicitly undertook from 1993 – and therefore owed and continues to owe the defendant – a number of fiduciary duties in respect of the money which I have found to be the subject of the resulting trust. These include, for the purposes of the present case, the duty to account for the money she received, the duty to act honestly and in good faith, the duty not to profit from the trust property and the duty not to place herself in a position where her personal interest actually conflicts or may conflict with her fiduciary duties. These are among duties which the plaintiff has pleaded that the defendant owes him.142Foot Note 142×Statement of Claim (Amendment No 1) dated 26 August 2015 at para 24.I elaborate on the content of these duties when I consider below whether the defendant has breached them in a way which entitles the plaintiff to surmount the applicable limitation period. 160 In deciding that the defendant as resulting trustee owes these fiduciary duties to the plaintiff, I have conceptually placed this resulting trust on the high end of Chambers’ scale of resulting obligations. In accordance with the spirit ofTan Yok Koon, I do so not primarily because of how I have analysed the resulting trust, which I will come to in a moment, but because of my findings on the defendant’s knowledge concerning the beneficial interest of the money under her charge and her conduct in relation to the plaintiff from 1993 to 2007. It is these facts which have persuaded me that the defendant was effectively acting as a full trustee of the money which she had received from the plaintiff. 161 In addition, although the resulting trust in the present case is a presumed resulting trust – and therefore did not leave property in an express trustee’s hands as a result of a failed express trust – it is not the type of presumed resulting trust which leaves property in the hands of a resulting trustee in the absence of any pre-existing fiduciary relationship and without her knowledge or consent. In fact, the resulting trust in this case arose in quite the opposite circumstances. Therefore, like the Court of Appeal inTan Yok Koon, I do not think that a presumed resulting trust analysis necessarily means that the resulting trustee has absolutely no fiduciary duties or is subject to fiduciary duties with attenuated content. It seems to me that the concept of a presumed resulting trust is relevant mainly for its association in the ordinary case with the absence of a prior fiduciary relationship between the parties before the trust arises. But it would be a mistake to read Chambers’ broad distinction between fiduciary obligations at the higher and lower end of the scale as corresponding strictly to the conceptual distinction between automatic and resulting trusts. Rather, it is the facts which lie behind these trusts which are important and which differ from case to case. Therefore, it is on the facts of this case that I hold the defendant a fiduciary with fiduciary duties of the kind I have enumerated above.",
        "Issue 4: Section 6(2) of the Limitation Act": "162 I turn now to the effect of the Limitation Act on the plaintiff’s case. There are two questions which arise. The first is whether the Limitation Act applies to resulting trusts at all. The second is whether s 6(2) of the Limitation Act applies to a beneficiary’s action for an account. In my judgment, both questions should be answered in the affirmative. I turn now to examine the questions in sequence.",
        "Application of the Limitation Act": "163 The starting point for the first question is s 2(1) of the Limitation Act. That section provides that the word “trust” and “trustee” in the Limitation Act has the same meaning as in the Trustees Act (Cap 337, 2005 Rev Ed) (“Trustees Act”). Section 3 of the Trustees Act explains the meaning of those words as follows: “trust” does not include the duties incident to an estate conveyed by way of mortgage, but with this exception “trust” and “trustee” extend to implied and constructive trusts, and to cases where the trustee has a beneficial interest in the trust property, and to the duties incident to the office of a personal representative, and “trustee’ where the context admits includes a personal representative, and “new trustee” includes and additional trustee 164 InTan Chin Hoon and others v Tan Choo Suan (in her personal capacity and as executrix of the estate of Tan Kiam Toen, deceased) and others and other matters[2016] 1 SLR 1150 (“Tan ChinHoon”) I observed that this definition neither mentions nor includes resulting trusts or resulting trustees. I nevertheless took the view that “the weight of authority suggests that resulting trusts are dealt with on the same footing as express and constructive trusts” for the purposes of s 22(1)(b) of the Limitation Act. This was not a live issue in the appeal from my decision inTan Chin Hoonand the Court of Appeal did not therefore address it inTan Yok Koon(at [55]). 165 I note that at least one academic text has suggested a different view, albeit in tentative terms, as a matter of statutory interpretation. Andrew McGee,Limitation Periods(Sweet & Maxwell, 7th Ed, 2014) (“McGee”) considers s 68(17) of the Trustee Act 2000 (c 29) (UK) (in pari materiawith the definition of “trust” in s 3 of our Trustees Act) and s 21 of the Limitation Act 1980 (c 58) (UK) (“English Limitation Act 1980”) (inpari materiawith s 22 of our Limitation Act), and states at para 14.031: Two problems remain in this area. Section 68(17) of the Trustee Act does not mention trustees holding on a resulting trust. By application of the maximexpressio unius, exclusion alterius, it might be argued that s.21 [of the English Limitation Act 1980] has no application to such trustees. 166 I respectfully disagree. I hold the same view I did inTan ChinHoon, albeit as a matter of principle and without the benefit of appellate endorsement inTan Yok Koon. ApplyingTan Yok Koon, I consider that if a resulting trustee voluntarily undertakes the fiduciary duties of an express trustee, and is liable to be sued for breach of those duties, it would be unjust to treat such a trustee differently from an express trustee by withdrawing from her a limitation defence. That is not an effect which I think Parliament intended. Hence, I take the view that such resulting trustees – and I express no view about other resulting trustees – can claim the benefit of the Limitation Act. 167 I do not consider that theexpressio uniusmaxim whichMcGeerelies on prevents me from adopting this interpretation, for two reasons. First, principles of statutory interpretation are not absolute but are merely tools for ascertaining Parliament’s intent. And second, the definition in s 3 of the Trustees Act is an inclusive definition and not an exhaustive one. My interpretation does not, therefore, contradict it. For these reasons, the Limitation Act in my judgment applies to resulting trusts and to resulting trustees.",
        "Beneficiary’s action for an account and s 6(2)": "168 I turn now to the issue of whether a beneficiary’s action for an account is caught by s 6(2) of the Limitation Act. This is a question of some conceptual importance because it affects what the plaintiff needs to prove in order to obtain an account. 169 I am of the view that the plaintiff’s action is indeed caught by s 6(2). In order to succeed, therefore, he must bring his case within one of the exceptions set out in s 22(1) of Limitation Act. That is something which the plaintiff has failed to do, as will be seen. If, however, I am wrong on this point, then it is within my discretion whether to grant the plaintiff the remedy of an account. 170 Under s 6(2), an action for an account shall not be brought in respect of any matter which arose more than six years before the commencement of the action. An action for an account here refers to an action for relief in the form of an account rendered by a defendant of the administration of property which is under her responsibility:Attorney-General for Ireland(at the Relation of McMullen and others) v Dublin Corporation[1824–34] All ER Rep 82 at 86–87perLord Redesdale. Such an account is therefore also known as an “account of administration”. That is to be distinguished from accounts for specific equitable wrongdoing (egan account for secret profit earned as a fiduciary:Attorney-General for Hong Kong vCharles Warwick Reid and Others[1994] 1 AC 324 (“Reid”) at 331CperLord Templeman):Glazier HoldingsPty Ltd v Australian Men’s Health Pty Ltd (No 2)[2001] NSWSC 6 at [36]perAustin J. 171 Section 6(2) is unusual in that it prescribes a limitation period not by reference to a cause of action but by reference to the remedy sought, regardless of the cause of action. It applies to any action which seeks the remedy of an account of administration. The claim for that remedy could be founded on a right at common law, as in the case of a principal’s action against her agent for an account. Or it could be founded on a right in equity, as in the case of a beneficiary’s action against his trustee for an account. Section 6(7) of the Limitation Act makes clear that s 6(2) applies to the remedy of an account in equity as it does to the remedy of an account at common law, and that it does so regardless of whether the claim for an account in equity is founded on a common law right or an equitable right. Section 6(7) provides: (7) Subject to sections 22 and 32, this section shall apply to all claims for specific performance of a contract or for an injunction or for other equitable relief whether the same be founded upon any contract or tort or upon any trust or other ground in equity. 172 InYong Kheng Leongand another v Panweld Trading Pte Ltd and another[2013] 1 SLR 173 (“Yong Kheng Leong”), the Court of Appeal said that “[t]he effect of s 6(7) is that ‘this section’,ie, the entirety of s 6, applies to all claims for equitable relief, whether these be founded upon contract, tort,a trustor other ground in equity” [emphasis added] (at [69]perSundaresh Menon JA (as the Chief Justice then was)). A beneficiary’s action against his trustee for an account is, therefore, “equitable relief” which is “founded upon … [a] ground in equity” within the meaning of s 6(7). The ground in equity is the trustee’s fiduciary duty to account for the trust property, which is a duty he owes to his beneficiary. That duty alone suffices to entitle the beneficiary to an account without any need to prove a breach of fiduciary duty:Foo Jee Sengand others v Foo Jhee Tuang and another[2012] 4 SLR 339 (“Foo Jee Seng”) at [87]perChao Hick Tin JA. 173 I pause here to note that there is one High Court decision –Wong Chong Yue v Wong Chong Thai[2011] 2 SLR 804 (“Wong Chong Yue”) – in which Philip Pillai J, having referred to English case law, held that “[a] claim for accounting under an express trust would … not be subject to any time bar, whether under s 6(2) or anywhere else in the Limitation Act” (at [9]). I respectfully decline to follow that approach. That is not because this case concerns a resulting trust andWong Chong Yueinvolved an express trust. In this context, in the light of s 6(7), that is a distinction without a difference. I decline to follow the approach inWong Chong Yuefor two reasons. First,Wong Chong Yuewas decided before the Court of Appeal unequivocally pronounced inYong Kheng Leongthat s 6(7) renders claims for all equitable relief, even those founded on a trust, subject to the limitation provisions in s 6. As a matter of authority, therefore, the view inWong Chong Yuehas been superseded to the extent that it is inconsistent with the Court of Appeal’s view inYong Kheng Leong. Second, as I shall explain at [179]–[185] below, the English position on whether a beneficiary’s action for an account is limited by time is, as a matter of statute and case law, in fact different from the Singapore position. So the English cases cannot be taken to set out the position in Singapore. 174 Accordingly, the six-year limitation period in s 6(2) of the Limitation Act applies to a beneficiary’s action against a trustee for an account unless the beneficiary can bring himself within one of the exceptions set out in s 22 of the Limitation Act. So if the plaintiff in this case cannot bring himself within those exceptions, he can obtain an account only of the defendant’s dealings with trust property which she received in the six years before he commenced this action. Given that the plaintiff filed this suit on 28 April 2014, the six-year period in question would run from 28 April 2008 to 27 April 2014, both dates inclusive: (see s 50(a) of the Interpretation Act (Cap 1, 2002 Rev Ed)). 175 That this is how the limitation period operates in respect of an action for an account is not in doubt. It is also the basis upon which the parties in this case have proceeded.143Foot Note 143×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 299–300; Defendant’s Closing Submissions dated 3 November 2016 at paras 114–115.As Judith Prakash J (as she then was) said inAng Toon Teck v Ang Poon Sin[1998] SGHC 67 (“Ang Toon Teck”)at [65]–[67]: I agree with the submission made on behalf of the defendant that any order in respect of the monies should properly be for an account of monies belonging to the patriarch’s estate which were received by the defendant as a trustee. This being the case, one has to look at s 6(2) of the Limitation Act (Cap 163) (‘the Act’) which states that ‘an action for an account shall not be brought in respect of any matter which arose more than six years before the commencement of the action’. The plaintiff argued that even if s 6(2) applied to this case, his claims were not time barred because the action was commenced on 14 June 1995 which was only 14 months after the beneficiaries had demanded that the defendant render them accounts. He obviously took the position that time starts to count from the date of the demand for accounts. This does not, however, appear to the legal position. Preston & Newsom’s Limitation of Actions[3rd Ed] states at p 56: ‘The cause of action for an account arises when the defendant has assets of the plaintiff in his hands in respect of which he is liable to account. Normally, he is so liable, if at all, from the moment he receives them; but there may be circumstances in which the express agreement between them is that he is only to be accountable at some later date or where the court can infer such an arrangement (Topham v Braddick[1809] 1 Taunt. 571 …’ [emphasis added] 176 This must be correct. Liability to account arises upon receipt of the trust property. Time for the purposes of s 6(2) must therefore also begin to run upon receipt. This approach is consistent with how the limitation period for an action for an account is understood in other areas of substantive law as well. For example, in the law of partnership, the House of Lords inBrownlow William Knox v Frederick Gye(1871) LR 5 HL 656 held that the defence of limitation applied to a suit brought by an executor of a deceased partner against the surviving partner demanding an account of the partnership concerns, and that “in the general case, thepunctum temporisfrom which the statutory period of six years begins to run, is the date at which the partnership estate came to bevestedin the surviving partner” [emphasis added] (at 677–678perLord Colonsay). This passage was cited with approval by the High Court inLai Hoon Woon (executor and trustee of the estate of Lai Thai Lok, deceased) v Lai Foong Sin and another[2016] SGHC 113 at [262]perKannan Ramesh JC. 177 It might be thought that this position causes difficulties. A trustee of an express trust settled more than six years ago – and who was therefore vested with all of the trust property outside the limitation period – might rely on this principle to argue that her beneficiary’s action for an account is time-barred. But that argument would not succeed. In the ordinary case, the express trustee continues to hold that property. The property would still be in the trustee’s “possession” within the meaning of s 22(1)(b). The beneficiary would therefore be within an exception to the time bar. In the unfortunate case where the trustee has dealt fraudulently with the property or has converted it to her own use, the beneficiary would again be within an exception to the time bar under either s 22(1)(a) or s 22(1)(b). The only case in which the beneficiary would find his action for an account time-barred would be where it appears that the trust property has left hands of the trustee innocently, and there is no evidence to the contrary. As I shall suggest below at [188], it is perfectly sensible for Parliament to have intended that a trustee in this situation ought not to be put to undue expense in having to give an account of something he no longer has in his possession, when the beneficiary had every reasonable opportunity to compel him to do so within the limitation period. 178 I turn now to the present case. It is common ground that the defendant did not receive any trust property during the period six years before the plaintiff commenced this suit,iefrom 28 April 2008 to 27 April 2014. Therefore, the plaintiff’s claim for an account of the money he paid to her from 1993 to 2007 is time-barred under s 6(2) unless he can bring his case within s 22(1). 179 If, however, I am wrong on the scope of s 6(7), the other possible position is that a beneficiary’s action for an account is not subject to any limitation period at all. This appears to be the position in English law, at least in relation to express trusts: seeUnderhillat para 94.34. I say “appears” because there is an ongoing controversy over whether a beneficiary’s action for an account is an “action for an account” within the meaning of s 23 of the English Limitation Act 1980 (the counterpart to s 6(2) of our Limitation Act): William Swadling, “Limitation” in Peter Birks and Arianna Pretto,Breach of Trust(Hart Publishing, 2002) (“Swadling”) at p 335. 180 At least one English case has been decided on the assumption that s 23 of the English Limitation Act 1980 applies to a beneficiary’s action for an account:In re Howlett(William Henry) (Dec’d)[1949] 1 Ch 767 (“In re Howlett”). But the weight of English authority suggests the English equivalent of s 6(2) applies only to actions for an account founded on common law legal rights:ParagonFinance plc v DB Thakerar & Co[1999] 1 All ER 400 (“Paragon Finance”) at 415h–416bperMillett LJ. That would leave an action such as this one, under English law, subject to no limitation period at all. The only qualification in English law is that, where all of a beneficiary’s other claims against a trustee are time-barred, an English court will not order an account if the account would serve no useful purpose:Barnettand another v Creggy[2014] EWHC 3080 (Ch) (“Barnett”) at [82]perDavid Richards J. The practical effect is that English law by a different process achieves very nearly the same result as Singapore law. The rationale for this result is relevant to this case and is best appreciated from a historical perspective. 181 The time bar in English law for actions for an account originated as a manifestation of what William Swadling has called the “no side-stepping rule”:Swadlingat p 323. That rule stipulated that, where the courts of equity had concurrent and auxiliary jurisdictions over a claim with the courts of common law, the claimant could not “side-step” a common law limitation period by suing in equity’s exclusive jurisdiction:Lockey v Lockey(1719) Prec Ch 518. The rule survived the fusion of the administration of common law and equity in the Judicature Acts of 1873 and 1875 and was crystallised legislatively in s 8(1)(a) of the Trustee Act 1888 (c 59) (UK) (“English Trustee Act 1888”). And it was clear that s 8(1)(a) did not impose a time bar on a beneficiary’s action for an account. Thus, inRe Richardson[1919] 2 Ch 50, the court ordered an account without limit of time so that the beneficiary could ascertain the facts. 182 Nevertheless, a practice emerged by which a defendant trustee could, by proving that there was no fraudulent breach of trust beyond six years before the action was commenced, persuade the court to restrict the temporal scope of the account:Re Williams[1916] 2 Ch 38. As no genuine purpose would be served by an account in such a case, the court would order an account limited to trust property in the trustee’s hands within six years before the action was commenced and of other trust property that came to the trustee in the same period:How v Earl Winterton[1896] 2 Ch 626. Effectively, the courts sought to relieve the trustee from the costly undertaking of providing an account if it was persuaded that the beneficiary had no real prospect of surmounting the time bar applicable to innocent breaches of trust (then s 8(1)(b) of the English Trustee Act 1888 and now s 22(3) of English Limitation Act 1980). 183 This result was explained by Preston and Newsom in their text,Limitation of Actions, which Prakash J cited with approval inAng Toon Teckat [70]: Preston & Newsom’s Limitation of Actions also states at p 184 that: In theabsence of fraud, thepractical effectis that a beneficiary will be entitled to an account against a trustee (a) of all moneys received by him within six years, as in the case of any other accounting party, and (b) of all moneys in his hands within the six years, under s 19(1) (How v Winterton (Earl)[1896] 2 Ch 626). [emphasis added] 184 English law nevertheless maintained in theory a beneficiary’s perpetual entitlement to bring an action for an account. Section 2(2) of the Limitation Act 1939 (c 21) (UK) (“English Limitation Act 1939”) enacted for the first time a six-year time bar specifically for actions for an account. Section 2(2) isin pari materiawith s 6(2) of our Limitation Act. Significantly, s 2(7) of the English Limitation Act 1939 effectively disapplied s 2 to claims for equitable relief except in certain limited cases: This sectionshall not applyto any claim for specific performance of a contract or for an injunction or for other equitable relief, except in so far as any provision thereof may be applied by the court by analogy in like manner as the corresponding enactment repealed by this Act has heretofore been applied. [emphasis added] Thus, s 2(7) of the English Limitation Act 1939 is framed in quite the opposite way to s 6(7) of our Limitation Act: see [171] above. Our section sets out the classes of case to which s 6 “shallapply” [emphasis added]. 185 Thus, inTitoand Others v Waddell and Others (No 2)[1977] 1 Ch 106 (“Tito v Waddell”) at 250D–251F, Megarry V-C heldobiterthat the combined effect of ss 2(2) and 2(7) of the English Limitation Act 1939 was to bar claims for an equitable account where the underlying cause of action was breach of contract, but not to bar claims against what might be called “pure” fiduciaries, such as trustees. Section 2(7) of the English Limitation Act 1939 has been preserved in s 36(1) of the English Limitation Act 1980, which is the limitation statute in force in England today. So the position in England has remained unchanged to the present day. 186 Yet, in English law, judicial discretion continues to temper the beneficiary’s perpetual right to an account. Thus inBarnettat [82], David Richards J took the view that where all other actions by a beneficiary against a trustee are time-barred, the court will not grant an order for an account unless such an order would serve a “useful purpose”. So too, in Singapore, George Wei J accepted that a beneficiary who would otherwise be entitled to an account may be denied the remedy where “it would be oppressive to require the [fiduciary] to so account, or for some other good reason, the court in its discretion thinks it wrong to make an order”:Foo Jee Booand another v Foo Jhee Tuang and others[2016] SGHC 260 (“Foo Jee Boo”) at [81]perGeorge Wei J, citingAttorney-General v Cockeand Another[1988] Ch 414 at 420HperHarman J. 187 The law in this area reflects a balance struck between two competing interests. The first is the beneficiary’s right to an account of trust property. That right is free-standing in the sense that it subsists without any breach of fiduciary duty:Underhillat para 94.34. Further, a trustee has a “continuing duty” to account:Chiang Shirley v Chiang Dong Pheng[2015] 3 SLR 770 at [88]perJudith Prakash J (as she then was). A beneficiary should therefore be entitled to the remedy of an account as long he retains his status as a beneficiary; after all, the account is the central mechanism by which the trustee is held accountable. This is doubtless a reflection of the ancient rule, developed by the courts of Chancery, that in the absence of laches or acquiescence, an express trustee is accountable without limit of time: seeParagon Financeat 408fperMillett LJ. 188 The second competing interest is the desire not to subject a trustee to the burden of having to give an account of a trust when it would operate oppressively or would serve no useful purpose. By enacting s 6(7) of the Limitation Act, Parliament seems to have entrenched the latter as decisive in a case where all other actions by a beneficiary are time-barred. But even if my view of s 6(7) is wrong, balancing these two competing interests is still the objective of the discretionary exercise contemplated byBarnettandFoo Jee Boo. Therefore, even if s 6(2) of the Limitation Act does not apply to the plaintiff’s action, the question whether to order an account in his favour is still a matter of judicial discretion, which I must exercise according to the parameters set out inFoo Jee Boo. This is an alternative analysis I undertake below after examining the plaintiff’s case under s 22(1) of Limitation Act.",
        "Issue 5: Section 22(1) of the Limitation Act": "",
        "Beneficiary’s action for an account and s 22(1)": "189 Before I examine and apply the criteria under each exception in s 22(1), it is necessary first to explain the relationship between a beneficiary’s action for an account and s 22(1). This is not an entirely straightforward matter for three reasons. The first is this. A beneficiary’s action for an account in respect of matters arising up to six years before the action may be founded purely on the trustee’s duty to account without any need to assert any other claim against the trustee. But a beneficiary’s action for an account in respect of matters arising more than six years before the action cannot be founded purely on the trustee’s duty to account. The beneficiary must successfully bring a claim which falls within s 22(1) and then seek, as a form of relief for that claim, an account of the trust property. That is the effect of ss 6(2) and 6(7). 190 Second, the position is complicated by the fact that not all beneficiaries who seek an account are seeking that account from a trustee of an express trust or who is subject to the irreducible core duties of an express trustee. If, as in the present case, the trust in question is a resulting trust, then the beneficiary must first establish under theTan Yok Koontestthat the resulting trustee owes him a duty to account in order even to be entitledprima facieto the remedy of an account. And if he relies on s 22(1)(a), he must also establish under theTan Yok Koontest that the resulting trustee owes him the fiduciary duty which the beneficiary alleges that the trustee has breached fraudulently. 191 Third, the position is further complicated by the fact that there are two forms of account, the stricter of which may be ordered only upon the court’s being satisfied of certain additional conditions. The two forms of account are the common account and the account taken on the footing of wilful default: H G Hanbury, “Forms of account against executors and trustees” (1936) 52 LQR 365 (“Hanbury”);Ong Jane Rebecca v Lim Lie Hoaand Others[2005] SGCA 4 at [55]perJudith Prakash J (as she then was). The difference between the two is the basis upon which the account is taken. An order for a common account requires the trustee to account for the property she has received and how it has been applied. An order for an account on the footing of wilful default requires the trustee to account not only for what she has received and how it has been applied, but also for what she might have received had it not been for her “wilful default”. Because the account on the footing of wilful default is stricter, additional requirements must be met before the court will order a trustee to account on that basis. 192 Bearing these considerations in mind, I now summarise the general position of a beneficiary who seeks an account from his trustee: (a) To obtain an account on the common basis in respect of matters no more than six years before the action was commenced, a beneficiary simply needs to establish that his trustee owes him a duty to account:Foo Jee Sengat [87]perChao Hick Tin JA;Panweld Trading Pte Ltd v Yong Kheng Leongand others (Loh Yong Lim, third party)[2012] 2 SLR 672 at [60]perSteven Chong J (as he then was). In the case of an express trust, this is axiomatic. In the case of a resulting trust, the beneficiary must show that the resulting trustee is subject to a duty to account on theTan Yok Koontest (at [206]). No breach of trust or wilful default needs to be shown because the order for an account “supposes no misconduct”:Partington v Reynolds(1858) 4 Drew 253 at 256perKindersley V-C. Once the beneficiary establishes that he is owed a duty to account, the court will order a common account unless such an order would be oppressive to require the fiduciary to account or the court considers in its discretion that it would be wrong to do so for some other good reason not to grant it:Foo Jee Booat [81]perGeorge Wei J. (b) To obtain an account on the common basis in respect of matters more than six years before the action was commenced, a beneficiary must bring an action which is within the scope of the exceptions in s 22(1) of the Limitation Act:Ang Tin Geev Pang Teck Guan[2011] SGHC 259 at [112]–[117]perBelinda Ang J. He must also, if it is not an express trust, establish that the trustee owes him a duty to account. If the action succeeds, the beneficiary may seek an order for a common account as his remedy. The court may then, in its discretion, grant the order. (c) To obtain an account on the basis of wilful default in respect of matters no more than six years before the action was commenced, a beneficiary must establish that the trustee has committed at least one instance of wilful default which has caused loss to the trust property:Re Tebbs(deceased); Redfern v Tebbs and another[1976] 1 All ER 858 at 863perSlade J;Re Ellis[2015] WASC 77 at [132]perHeenan J. A breach of trust may amount to a wilful default, but not necessarily:Inre Wrightson; Wrightson v Cooke[1908] 1 Ch 789 at 799perWarrington J;Hanburyat p 368;Bartlett& others v Barclays Bank TrustCo Ltd (No 2)[1980] 2 All ER 92 at 97perBrightman LJ. Because the two concepts are not co-extensive, a beneficiary cannot secure an account on the wilful default basis simply by establishing that the trustee has committed a breach of trust:Meehan v Glazier Holdings Pty Ltd(2002) 54 NSWLR 146 at [65]–[66]perGiles JA. (d) To obtain an account on the basis of wilful default in respect of matters more than six years before the action was commenced, a beneficiary must bring an action which is within the scope of the exceptions in s 22(1) of the Limitation Act. In addition, the beneficiary must establish that the trustee has committed at least one instance of wilful default which has caused loss to the trust property. 193 The plaintiff does not seek an account on the wilful default basis. And the account which the plaintiff seeks goes back to the day on which the plaintiff received each of his payments to her, all of which she received more than six years before he commenced this action. So the present case is concerned with the second of the four positions I have just described. 194 I turn now to consider the requirements under each limb of s 22(1) of the Limitation Act before applying them to the facts.",
        "Fraud or fraudulent breach of trust": "Applicable principles 195 Section 22(1)(a) of the Limitation Act reads as follows: Limitation of actions in respect of trust property 22.—(1) No period of limitation prescribed by this Act shall apply to an action by a beneficiary under a trust, being an action— (a) in respect of any fraud or fraudulent breach of trust to which the trustee was a party or privy; or … 196 The meaning of “fraud” and “fraudulent” for the purposes of s 22(1)(a) is well established. InArmitage v Nurseand Others[1998] Ch 241 at 260F (“Armitage”), Millett LJ held that for the purposes of s 21(1)(a) of the English Limitation Act 1980 (which isin pari materiawith s 22(1)(a) of our Limitation Act), “fraud” requires dishonesty and that dishonesty is defined as follows (at 251E–F): “[i]f [a trustee] acts in a way which he does not honestly believe is in the interests of the beneficiaries then he is acting dishonestly”. 197 Millett LJ’s test inArmitagewas approved by our Court of Appeal inYong Kheng Leong([172]supra) at [52]–[53]perSundaresh Menon JA. The court also held that the applicable test for dishonesty was the “combined test” which Lord Hutton articulated inTwinsectra Ltd v Yardleyand others[2002] 2 AC 164 (“Twinsectra”) at [27]. This test requires that: (a) the defendant’s conduct must be dishonest by the ordinary standards of reasonable and honest people; and (b) the defendant himself must have realised that by those standards his conduct was dishonest. Hence, it appears that whereas the content of “fraud” is to be derived from Millett LJ’s definition inArmitage, the perspective from which the central concept of dishonesty should be assessed is informed by Lord Hutton’s test inTwinsectra. That is how the Court of Appeal’s approval of both tests inPanweld(CA)for the purposes of s 22(1)(a) might be meaningfully rationalised. 198 I am aware that inLim Siew Bee v Lim Boh Chuanand another[2014] SGHC 41 Belinda Ang J gave a different explanation of the meaning of “fraud” in s 22(1)(a) of the Limitation Act. Relying on Lord Denning MR’s judgment inApplegate v Moss[1971] 1 QB 406 (“Applegate”) at 413C,Ang J said at [112] that “fraud” in the context of s 22(1)(a) means “conduct of the defendant … [which] has been such as to hide from the plaintiff the existence of his right of action, in such circumstances that it would be inequitable to allow the defendant to rely on the lapse of time as a bar to the claim.” 199 I respectfully disagree with Ang J’s definition of fraud. Lord Denning MR inApplegatewas actually explaining what “concealed fraud” meant under s 26(b) of the English Limitation Act 1939, which later became s 32(1)(b) of the English Limitation Act 1980, and which isin pari materiawith s 29(1)(b) of our Limitation Act. That provision postpones the applicable limitation period where the plaintiff’s right of action is concealed by the fraud of the defendant or his agent. However, Millett LJ makes it clear inArmitageat 260H that this special concept of concealed fraud does not affect the meaning of fraud in the general sense as it is used in s 21(1)(a) of English Limitation Act 1980: The meaning of the words “fraud” and “fraudulent” in section 21(1)(a) is not distorted by the meaning of the expression “concealed fraud” formerly used in s 26 of the Act of 1939 and which was given a very special meaning but has been replaced in the Act of 1980 by the more accurate expression “deliberate concealment.” 200 The other issue relating to s 22(1)(a) of the Limitation Act is whether it requires fraud to be an element of the plaintiff’s cause of action. There seems to be a near consensus in the textbooks that it does: Terence Prime and Gary Scanlan,The Law of Limitation(Oxford University Press, 2nd Ed, 2001) (“Prime andScanlan”) at p 294; David Oughton, John Lowry and Robert Merkin,Limitation of Actions(Lloyd’s Commercial Law Library, 1998) at p 373.McGee([165]supra) at para 14.005 takes a more tentative view in the affirmative, albeit without explanation. All the textbooks simply citeArmitageas authority for that view. 201 I have my doubts about whether that view is correct. InArmitageat 260, Millett LJ observes that s 21(1)(a) of the English Limitation Act 1980 (no limitation period for action by beneficiary in respect of fraud) originates from the predecessor to s 32(1)(a) of the English Limitation Act 1980 (postponement of limitation period for action based upon fraud). Because the cases on the latter provision require fraud to be an element of the cause of action, so also, Millett LJ reasons, must fraud be an element of the cause of action under s 21(1)(a). I do not think this follows, for three reasons: (a) First, whereas s 32(1)(a) of the English Limitation Act 1980 and its Singapore equivalent, s 29(1)(a) of the Limitation Act, use the words “based upon … fraud”, s 21(1)(a) of the English Limitation Act 1980 and its Singapore equivalent, s 22(1)(a) of the Limitation Act, use the words “in respect of fraud”. “Based upon” suggests fraud as the very basis of the action, whereas “in respect of” suggests it suffices if fraud is present even if it is not an element of the cause of action. None of the textbooks seem to have noticed the significance of this difference in wording. (b) Second, the alternative trigger for the exception in s 22(1)(a) is “an action in respect of any … fraudulent breach of trust …”.  That suggests that the beneficiary has first to establish a breach of trust (which would be the cause of action), and then establish that the breach was committed fraudulently (which is here a statutory requirement to operate the exception, separate from the cause of action). (c) Third, a breach of trust as a cause of action has no fixed set of elements. Thus, inTito v Waddell, Megarry V-C famously declined to decide on the meaning of breach of trust under the predecessor of s 21 of the English Limitation Act 1980. That is quite unlike, say, a cause of action in tort such as conversion or a cause of action for breach of contract where the elements of the cause of action are generally well established. The point here is that in all cases, whether there is a breach of trust is highly fact-dependent: seeInre Chapman; Cockes v Chapman[1896] 2 Ch 763 at 774perLindley LJ and 780perLopes LJ. Sometimes “fraud” is necessary, sometimes it is simply present. 202 Bearing these considerations in mind, it appears to me that for the purposes of s 22(1)(a) the better view is to ask whether a breach of trust has been established and, if so, whether it is “fraudulent” within the meaning of s 22(1)(a) rather than to ask whether fraud is an “element” of the beneficiary’s cause of action. 203 I turn now to consider whether the plaintiff has brought his case within s 22(1)(a) of the Limitation Act. The plaintiff’s arguments are best analysed according to the different fiduciary duties which he has alleged that the defendant has breached. For the reasons below, the plaintiff has failed to establish any of his allegations of fraudulent breach of trust. Duty to account 204 The plaintiff submits that the defendant breached her duty to account for all of the sums which I have found she received.144Foot Note 144×Plaintiff’s Closing Submissions dated 29 September 2016 at para 199.I have found that she does owe the plaintiff a duty to account: see [159] above. There are two possible analyses of this breach in view of my analysis on how the court should determine the content of that duty: see[140] and [146]–[148] above. On both analyses, however, I find that the plaintiff fails to come within s 22(1)(a) of the Limitation Act. 205 On the first analysis, the content of the defendant's duty to account is precisely the same as that of an express trustee. The basis for that is that she voluntarily assumed a duty to account to the plaintiff and the law steps in to supply the content of that duty. Equity requires every trustee to keep clear and accurate accounts of the trust property and of her management of it, and to present them to the beneficiary at his request together with supporting documentation: see [147] above. Satisfying the latter aspect of this duty requires an account in the sense of formal accounts, not in the sense of an informal explanation. 206 If this analysis is correct, the defendant has undoubtedly breached her duty to account. I have found that the defendant did receive substantial sums of money from the plaintiff between 1993 and 2007. There is no evidence that the defendant ever kept proper accounts of how she dealt with these sums, let alone that she ever prepared for and presented to the plaintiff formal accounts of how she did so.145Foot Note 145×Plaintiff’s Closing Submissions dated 29 September 2016 at para 295.Indeed, the defendant does not even suggest that she did. The defendant’s only explanation is what records she kept of her dealings with sums she received from the plaintiff were disposed of during a spring cleaning exercise a few years before 2012, which is when the plaintiff started asking for those records.146Foot Note 146×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 420.But the defendant’s duty to account is a continuing duty. Those records were essential for her to discharge her duty to account. Disposing of those records rendered her permanently incapable of discharging that duty and is, in itself, a further aspect of her breach of that duty. 207 Consequently, her approach in these proceedings towards demonstrating that she had “accounted” for the sums she received was fundamentally flawed. It consisted not in showing how over the years she had documented for the plaintiff how she had received and managed the sums she received from him. Rather, it was an attempt to show how the limited amount of primary evidence which remains intact,iecopies of cheques and bank statements, considered together with a circumspect interpretation of Mr Leow’s expert report, supports the explanation which she is now giving of the sums she received and what she did with them.147Foot Note 147×Defendant’s Closing Submissions dated 3 November 2016 at paras 22, 34 and 51 to 52.These were reconstructive explanations after the fact. They served only to re-emphasise that the defendant did not discharge her duty to account. 208 Having said this, I do not find that the defendant’s breach of her duty to account – on this analysis of the content of that duty – was fraudulent. It is important to note that the plaintiff does not submit that the defendant committed this breach dishonestly in theTwinsectrasense. The plaintiff does not suggest that the defendant subjectively believed her failure to account from 1993 to 2007 was dishonest. Further, her evidence is that she disposed of her means to account some time before the plaintiff commenced this action. There is no suggestion that the defendant disposed of those records otherwise than in the course of a routine spring-cleaning exercise and otherwise than because she believed she no longer needed to render an account to the plaintiff. The plaintiff has failed to prove on the balance of probabilities that the defendant breached her duty to account fraudulently. 209 The plaintiff’s case on the duty to account is simply that the defendant never rendered a proper account and that the account which she now attempts to provide is inadequate.148Foot Note 148×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 204, 236, 246 and 250.The plaintiff can show only that the defendant’s memory now of what she did with the plaintiff’s money does not square with Mr Leow’s figures or with some of the available documentary evidence. That does not justify an inference that the defendant fraudulently or dishonestly failed account for the trust property. In fact, the plaintiff’s supplementary submissions, which deal exclusively with the requirements of s 22(1) of the Limitation Act, do not allege that the defendant’s breach of her duty to account was a fraudulent breach of trust.149Foot Note 149×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 15 to 44.These submissions raise other alleged breaches, mainly concerning the duty of a trustee not to place herself in a position where her personal interest conflicts or may conflict with her duty. I consider these allegations in the next section. 210 I turn to the alternative analysis of the content of the defendant’s duty to account. If I am wrong to hold that the content of the defendant’s duty to account is the same as that of an express trustee, and if whatTan Yok Koonrequires is that the “precise content” of the duty should correspond with what she voluntarily agreed to do, then the plaintiff’s position is even weaker. On this less stringent analysis, I find that there has been no breach of duty in the first place, let alone one which is fraudulent. I accept the defendant’s explanation that one reason for her failure to keep proper accounts was that she conducted business in the “Chinese way”.150Foot Note 150×Certified Transcript, 10 August 2016, Day 8, p 22 at line 4.This was the reason the defendant offered for not properly documenting the payments made in the first purchase of the GK Holding shares. I take the defendant’s explanation to mean that she dealt with the plaintiff’s money informally, in reliance on oral arrangements and understandings. 211 That degree of informality is very common in dealings between family members, regardless of their ethnic group. I therefore accept that there was a degree of mutual informality between the plaintiff and the defendant in how the defendant was expected to account to him for his money and investments. On this analysis ofTan Yok Koon, the plaintiff must show that the defendant assumed a duty to render formal accounts to the plaintiff. Having examined the evidence on the defendant’s fiduciary relationship with the plaintiff at [151]–[159] above, I find that the plaintiff has not discharged this burden. On this alternative analysis of the content of the defendant’s duty to account, therefore, I would have found there to be no duty to keep proper accounts and to render formal accounts at all. The question of breach of duty, anda fortiorifraudulent breach of duty, therefore does not even arise. Conflict of interest 212 The plaintiff submits that the defendant breached her duty not to place herself in a position where her personal interest conflicts or may conflict with her fiduciary duties to the plaintiff. I have found that the no conflict duty, as I shall call it, does apply to the defendant: see [159] above. The general effect of this duty is that a trustee is not allowed to derive any personal advantage from the administration of the trust property that is not expressly authorised: Lynton Tucker et al,Lewin on Trusts(Sweet and Maxwell, 19th Ed, 2015) (“Lewin”) at para 20-001;GeorgeBray v John Rawlinson Ford[1896] AC 44 at 51perLord Herschell. If a trustee breaches the no conflict duty, she will be strictly liable to account for the profit derived from the breach, of which she will be a constructive trustee:Reid([170]supra) at 331C–EperLord Templeman. 213 I should say that I do not think that the content of the no conflict duty is susceptible to an alternative analysis in the way I have analysed the content of the duty to account. This is because of the binary nature of the no conflict duty: there is either a conflict or there is no conflict; and if there is a conflict, there is either authorisation or no authorisation. So there is no sensible scope for an alternative analysis involving the determination of the “precise content” of the no conflict duty. 214 The plaintiff alleges four principal breaches of the no conflict duty on the part of the defendant. I examine each of them in turn. 215 The first alleged breach of the no conflict duty is connected to the defendant’s personal business interests. The plaintiff’s position on this allegation is not consistent. In his pleadings, he states that the defendant breached the duty by allowing Heng Management, her firm, to carry out book-keeping services for GK Holding and by overcharging GK Holding for those services after she had invested the plaintiff’s money in GK Holding.151Foot Note 151×Statement of Claim (Amendment No 1) dated 26 August 2015 at para 27(d)–(e).In his closing submissions, the plaintiff argues that the defendant breached the duty by leasing premises from GK Holding in her personal capacity to conduct her food and beverage businesses.152Foot Note 152×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 281 to 289.In his supplementary submissions, the plaintiff argues that the defendant breached this duty by failing to disclose her interest in these businesses to the plaintiff.153Foot Note 153×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 41 to 42. 216 The defendant’s submission is that all of the plaintiff’s allegations are really allegations that she breached duties which she owed to GK Holding as one of its directors and not that she breached any duty which she owed to the plaintiff as a beneficiary under a resulting trust. Therefore, GK Holding is the only proper plaintiff to pursue these allegations, either in its own right or as the nominal plaintiff in a derivative action.154Foot Note 154×Certified Transcript, 1 December 2016, Day 10, p 73 at lines 4 to 8.The defendant’s submission implies that these allegations are incapable of amounting to a breach of the fiduciary duties which the defendant owed to the plaintiff as a resulting trustee. 217 The defendant is correct. At no point in time did she hold the plaintiff’s shares in GK Holding on any sort of trust for him. The first tranche of shares in GK Holding were indeed purchased with the plaintiff’s money. But those shares were transferred immediately and directly into his name. Not only legal title but absolute title to those shares thereby vested in him.155Foot Note 155×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 286.With that, the defendant’s status as a resulting trustee of the purchase money for those shares ceased, as did any fiduciary duties she owed the plaintiff under that resulting trust. So the only possible breach of the no conflict duty in relation to the first tranche is in the very fact that the defendant directed trust money into shares in GK Holding in the first place. But it is not the plaintiff’s pleaded or argued case that that amounted to a breach of any of her fiduciary duties to him. 218 The defendant was equally never the trustee of the second tranche of shares in GK Holding which the plaintiff acquired. In fact, on the available evidence – mainly from the defendant – the defendant and her sisters-in-law may have paid for his shares first: see [223] below. So it could plausibly be argued that the plaintiff was a resulting trustee of those shares for them. And again, it is not the plaintiff’s case that the defendant breached the no conflict duty simply by making the investment in the first place. 219 My rejection of this alleged breach of the no conflict duty is supported by a passage inLewinat para 20-051 which addresses thelocus standiof a beneficiary where a trustee derives a profit from a company in which the trust is interested: In a case where the trust fund comprises shares in a company and a trustee who is a director of the company derives a profit from the company, it is necessary to consider whether the beneficiary haslocus standito pursue a claim in respect of the profit. The profit may be one which the trustee in his capacity as director is authorised to retain as between himself and the company, yet be one for which the trustee in his capacity as trustee is liable to account to the trust fund, for instance director’s fees paid by the company. In such a case there is no doubt that a beneficiary of the trust haslocus standito pursue a claim against the trustee in his capacity as such: the beneficiaries are the only persons who have a claim and the company has none. The profit may, however, be one that the trustee is unauthorised to retain, in whole or in part, both as between himself in his capacity as director and the company, and as between himself in his capacity as trustee and the beneficiaries. If so, there are, potentially, claims by both the company and the beneficiaries, and the question arises whether a claim by a beneficiary is precluded by the reflective loss principle that a person interested in a company through a shareholding in the company cannot bring a claim in respect of an injury to the company merely because the value of the shareholding is prejudiced by that injury. A claim by a beneficiary in respect of the profit is not precluded by the reflective loss principle unless it can be shown by the defendant trustee that (i) the whole of the claimed profit reflects what the company has lost and what it has a cause of action to recover and (ii) such a claim is available on the facts. Hence, if the profit is one that the trustee is or may be entitled to retain as to part in his capacity as director, but not in his capacity as trustee, a beneficiary may bring a claim in respect of the profit, though his claim will be subject to the company’s claim (if brought) to recover the profit so far as due to be restored to the company. Similar considerations apply where the trustee is not a director of the company but has some other capacity in relation to the company which imposes on him fiduciary duties to the company as well as to the beneficiaries. 220 It will be appreciated that the issues relating to the beneficiary’slocus standidiscussed in the passage above arise only when the trustee of his shares is concurrently a director of the company in which those shares are held. That situation raises issues of (a) whether the beneficiary haslocus standias beneficiary to sue the trustee-director and (b) whether, even if he haslocus standi, he would be precluded by the principle of reflective loss from suing her. 221 Since the defendant in the present case was never a trustee of any of the plaintiff’s shares in GK Holding, her position isa fortioriof all of the various scenarios which are contemplated in the passage fromLewincited above. The plaintiff as beneficiary has nolocus standito sue the defendant for conduct in relation to GK Holding after he became a shareholder and is bound strictly by the principle of reflective loss if he wishes to recover a loss in the value of his shares by reason of her conduct. A claim on that footing is not, in any event, particularised in his pleadings. And the plaintiff cannot complain that he is thereby left without a remedy, because he had rights as a shareholder of GK Holding which he could have exercised to obtain a suitable remedy. 222 But even if the plaintiff had argued that the defendant as trustee breached the no conflict duty simply by directing the plaintiff’s money into GK Holding, I would have rejected that argument. There is no evidence that the defendant had any personal dealings with GK Holding at the time the plaintiff acquired his first tranche of shares in 1994/1995. The earliest instance of the defendant’s personal dealings with GK Holding appears to be Yi Kang Food & Beverage, which was established in 1998 as a sole proprietorship156Foot Note 156×Heng Fock Lin’s 2nd Affidavit of Evidence-in-Chief dated 11 July 2016 at p 40; Certified Transcript, 10 August 2016, Day 8, p 80 at line 16 and p 81 lines 1 to 4.and converted into a private limited company in 2009.157Foot Note 157×Heng Fock Lin’s 2nd Affidavit of Evidence-in-Chief dated 11 July 2016 at p 42.Dessert@Sim Lim Square LLP was registered in 2006.158Foot Note 158×Heng Fock Lin’s 2nd Affidavit of Evidence-in-Chief dated 11 July 2016 at p 38.Heng Management provided book-keeping services to GK Holding from 2006 to 2012.159Foot Note 159×Lim Ah Leh’s Affidavit of Evidence-in-Chief dated 8 June 2016 at p 315.And there is no evidence when Sleek Espresso Bar was established. There is therefore no basis to say that the defendant breached the no conflict duty when the plaintiff acquired the first tranche of shares in 1994/1995. 223 Next, the plaintiff has not satisfied me that the second tranche of shares which he purchased in GK Holding in 1999/2000 was actually purchased with trust money. The defendant’s evidence is that she and her sisters-in-law, on behalf of the plaintiff, made the initial payment of S$835,000 for the 15% of GK Holding which the plaintiff acquired in the second tranche.160Foot Note 160×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at paras 57 to 58.I make no finding on whether this averment is true. But I note that it is supported by four cheques and one bank draft collectively in that amount, all drawn in favour of Teo Chye Har and issued by the defendant and her sisters-in-law.161Foot Note 161×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at pp 299 to 301.The plaintiff has characterised the defendant’s claim that the plaintiff became indebted to her as a result of this purchase a “fictitious loan”. But he could not seriously question the authenticity of the five cheques. Neither did he dispute the figure of S$835,000. Indeed, he relies on that very figure to argue that the defendant, in breach of the no conflict duty obtained a better price in that purchase for her own shares. I deal with that argument below. In the result, the plaintiff has not proved on the balance of probabilities that the defendant used trust money to make the second purchase. 224 But even if the second purchase was made with trust money, I would have, for two reasons, found that the defendant did not breach the no conflict duty because the plaintiff authorised the investment even though she had by then dealings with GK Holding in her personal capacity. First, there is objective evidence, in the form of a handwritten note, to show that the defendant discussed that investment with the plaintiff and provided him an analysis of the costs.162Foot Note 162×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 297.That analysis adopted as its yardstick the gross floor area of the properties held by GK Holding,163Foot Note 163×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at para 56.including the property which had been leased to Yi Kang Food & Beverage. Second, the plaintiff knew that the defendant had an existing shareholding in GK Holding from the first tranche, because he was initially her nominee for those shares.164Foot Note 164×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 287.He must have known that she was, through the second tranche, intending (like him) to increase her shareholding. I therefore find it difficult to believe that the plaintiff was in the dark about any of the defendant’s personal dealings with GK Holding. In these circumstances, there could have been no breach of the no conflict duty on the defendant’s part. 225 Third, the plaintiff submits that the defendant must have used trust money to make investments for herself165Foot Note 165×Plaintiff’s Closing Submissions dated 29 September 2016 at para 280.because she did not herself have the financial resources to pay for her own investments in GK Holding shares or in commercial property in Shanghai.166Foot Note 166×Certified Transcript, 11 August 2016, Day 9, p 57 at lines 23 to 26.The GK Holding shares cost the defendant S$322,000 in 1994/1995 and S$315,000 in 1999/2000.167Foot Note 167×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at paras 51 and 62.The commercial property in Shanghai cost her about S$200,000.168Foot Note 168×Plaintiff’s Closing Submissions dated 29 September 2016 at paras 276 to 279.The plaintiff’s only evidence that the defendant lacked the means to make these investments from her own resources is that, in or around 2000, the defendant’s personal account was overdrawn in the sum of $161,000.169Foot Note 169×Certified Transcript, 11 August 2016, Day 9, p 61 at lines 1 to 4.The plaintiff invites me to infer that she must therefore have used trust money for these purchases. 226 I reject this allegation for want of evidence. The plaintiff, in his own pleadings, seems to accept that he lacks the evidence to make this allegation good. His pleaded case is not that the defendantdiduse the plaintiff’s money to finance her purchase of shares. His statement of claim pleads baldly that she “may” have done so.170Foot Note 170×Statement of Claim (Amendment No 1) dated 26 August 2015 at para 27(c).The plaintiff’s counsel explained candidly that he has taken this position “because we have no evidence” that the defendant misappropriated the plaintiff’s money.171Foot Note 171×Certified Transcript, 11 August 2016, Day 9, p 62 at line 26 to p 63 at line 7.In any event, on the merits of the allegation itself, the mere fact that one account of the defendant was overdrawn at one point in time does not prove – or even justify an inference – that the defendant did not have the means to make these investments from her own resources. The plaintiff has failed to prove that she used trust money for her own investments, let alone that she did so fraudulently. 227 Second, the plaintiff points to the fact that he paid more per share when he acquired the second tranche of his GK Holding shares than the defendant did.  He paid S$835,000 for 15% of the company while the defendant paid only S$315,000 for 20% of the company. The plaintiff submits that this shows that the defendant was dishonest in her dealings with the plaintiff because it was the defendant who arranged the purchase of the second tranche.172Foot Note 172×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 44.I reject this submission. I accept the defendant’s evidence that part of the purchase consideration which she gave for the 20% of GK Holding which she acquired was not paid in cash but was her agreement to take over liability for a personal guarantee in the sum of S$6.5m for the company’s debts. The plaintiff has produced no evidence to contradict this assertion. Further, Mr Leow accepted in cross-examination that it was possible to provide part of the purchase consideration for a tranche of shares in this manner.173Foot Note 173×Certified Transcript, 2 August 2016, Day 3, p 115 at lines 1 to 11.I therefore find that the plaintiff has failed to establish on the balance of probabilities that the defendant was in fraudulent breach of trust by obtaining a lower price for these shares for herself or by falling to obtain the same lower price for the plaintiff. 228 Fourth, the plaintiff submits that the defendant dishonestly misappropriated the plaintiff’s share of dividends declared by GK Holding in 2003 (S$126,750), 2005 (S$25,000) and 2007 (S$44,000),174Foot Note 174×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 36.thereby bringing his action within s 22(1)(a) of the Limitation Act. This allegation was not pleaded.175Foot Note 175×Statement of Claim (Amendment No 1) dated 10 June 2010 at para 27.In any event, it is misconceived. Even if it were true, those dividends were due to the plaintiff in his capacity as the absolute owner of shares in GK Holding. The dividends arise from his shares, and are not any part of and do not arise from the money which the defendant held on resulting trust for the plaintiff. So the plaintiff’s proper remedy for any failure to receive these dividends lies in his rights as a shareholder. 229 In any event, there is no evidence for this allegation. The defendant’s case is that she simply set off the dividends due to him against a debt which the plaintiff owed to her and her sisters-in-law and another debt which he owed to GK Holding. The former debt arose when the defendant and her sisters-in-law paid, on behalf of the plaintiff, the purchase price of S$835,000 for his second tranche of shares in GK Holding:176Foot Note 176×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at paras 57 to 58.see [223] above. The latter debt arose after the plaintiff asked the defendant, who was then managing GK Holding, to cause the company to invest in his New Zealand business. She acceded by causing GK Holding to extend a loan to the plaintiff. At the same time, the company extended proportionate loans to Teo Chye Har and the defendant. The loan to the plaintiff is evidenced by a company cheque issued to the plaintiff in the sum of S$262,500 and dated 11 September 2000. 230 The plaintiff admits receiving the sum of S$262,500 from the company. The dispute is for what purpose. The plaintiff said that he received the cheque in payment for property which he had sold to GK Holding.177Foot Note 177×Certified Transcript, 4 August 2016, Day 5, p 149 at line 14 to p 140 at line 9.There is no evidence of any such sale. This sale features nowhere in the plaintiff’s affidavit of evidence-in-chief. He gave this sale as the reason for the cheque for the first time in cross-examination. To support her case, the defendant produced in evidence an acknowledgement dated 11 September 2000 apparently signed by the plaintiff in which he confirms receiving the cheque and records that he would use the money to pay the deposit for a property in New Zealand.178Foot Note 178×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at pp 350 to 351.The plaintiff denies that he signed the acknowledgment. But he produced no forensic evidence that his signature had been forged. I do not accept that it is a forgery. I find that the purpose stated in the acknowledgment was the true reason for the payment and that it resulted in the plaintiff being indebted to GK Holding in the sum of S$262,500. At trial, Mr Leow accepted that the cheque and the plaintiff’s written acknowledgment evidenced a loan from GK Holding to the plaintiff.179Foot Note 179×Certified Transcript, 2 August 2016, Day 3, p 131 at lines 28 to 32. 231 The defendant’s account of the two debts owed by the plaintiff which she set off against the dividends due to the plaintiff is supported by documents. It features in in her affidavit of evidence in chief. Her account therefore appears to me to be the more consistent and credible. 232 The effect of all this is that the plaintiff has failed to produce any evidence of fraudulent conduct, much less fraudulent breach of trust, on the defendant’s part in dealing with the plaintiff’s dividends. Other allegations 233 The plaintiff also submits that the defendant’s conduct in these proceedings is evasive and dishonest and his action therefore falls within s 22(1)(a) of the Limitation Act. The plaintiff raises three examples of the defendant’s evasive and dishonest behaviour: the defendant’s initial denial and subsequent acceptance of the fact that she received money from the plaintiff;180Foot Note 180×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 15 to 20.her tardy compliance with discovery orders;181Foot Note 181×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 21 to 24.and her evidence concerning an alleged loan that she and her sisters-in-law extended to the plaintiff for his purchase of the second tranche of shares in GK Holding.182Foot Note 182×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 27 to 35. 234 This submission is misconceived. It identifies no fraudulent breach of the trust which is the subject-matter of this action. The defendant’s compliance with her discovery obligations and her demeanour at trial are, on their own, not breaches of trust let alone fraudulent breaches of trust. Even if one accepts that the defendant fabricated the evidence of a fictitious loan of S$262,500 in order to “obfuscate or deal with the receipt of a significant sum of money”,183Foot Note 183×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 32.as the plaintiff puts it, this does not entail that the defendant dealt with that sum of money fraudulently. I therefore reject this argument.",
        "Recovery of trust property": "Applicable principles 235 Section 22(1)(b) of the Limitation Act reads: Limitation of actions in respect of trust property 22.—(1) No period of limitation prescribed by this Act shall apply to an action by a beneficiary under a trust, being an action— … (b) to recover from the trustee trust property or the proceeds thereof in the possession of the trustee, or previously received by the trustee and converted to his use. 236 The effect of s 22(1)(b) is that no limitation period applies to a beneficiary’s action to recover from his trustee the trust property or its proceeds in two broad situations: (i) where the property or proceeds are still “in the possession of the trustee” (“the possession limb”) or (ii) where either was “previously received by the trustee and converted to his use” (“the conversion limb”). The plaintiff relies on both limbs, but primarily on the possession limb. 237 The plaintiff’s case on the possession limb turns, not surprisingly, on the meaning of “possession” in s 22(1)(b). The plaintiff submits thatYong Kheng Leongstands for the proposition that direct possession or actual control is not necessary.184Foot Note 184×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 47.This seems correct. InYong Kheng Leong, a director of a company was held to have misappropriated the company’s funds by causing the company to pay his wife a salary even though the wife provided no services to the company in return. The court saidobiterthat the money which he had misappropriated in this way was still in his “possession” within the meaning of s 22(1)(b) even though it had been “parked” with his wife (at [54]): As for s 22(1)(b), if, as we think is the case, the Judge had made a finding that Mdm Lim was merely a proxy … then Mr Yong would equally be caught by this section. For all intents and purposes, and in substance, the misappropriated funds were in Mr Yong’s possession or for his benefit. It ought not to make a difference that the funds were parked with his wife. The court inGwembe Valleymade similar observations about the irrelevance of the director having parked the secret profits in his other company. … Nonetheless, there is no need for us to reach a final conclusion on this because as noted in [53] above, Mr Yong had acted fraudulently as a Class 1 constructive trustee and that would be sufficient to deny him the limitation defence. 238 The principle therefore seems to be that where the trust property or its proceeds are tangible, or can readily be rendered into the direct possession or actual control of the trustee, the requirement of “possession” in s 22(1)(b) is satisfied:Prime and Scanlanat p 297. 239 A further illustration isThorn v Heard and Marsh[1894] 1 Ch 599. In that case, the mortgage money which the beneficiary was seeking to recover was never in the trustee’s hands. Instead, the trustee’s solicitor had wrongfully retained the money and dissipated it. The case was decided under the English Trustee Act 1888, the relevant provision of which turned on the concept of continued retention rather than continued possession. But I do not consider there to be a distinction of substance between the two concepts for present purposes. The beneficiary argued in that case that the trustee had a legal entitlement to call on the solicitor to hand over the money, and that the trustee was therefore to be treated as though he “still retained” the money. The English Court of Appeal rejected this argument, holding that the phrase “still retained” covered cases where the trustee had the money or could readily get it, but did not extend to cases where the money had been lost, so that the trustee could no longer get it. 240 The defendant says that the burden lies on the plaintiff to prove that the defendant is still in possession of trust property.185Foot Note 185×Defendant’s Closing Supplementary Submissions dated 23 January 2017 at para 34.Their position is supported byMcGee([165]supra) at para 14.015. The plaintiff, on the other hand, argues that the burden is on the defendant, relying onIn re Howlett([179]supra).186Foot Note 186×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 48.The defendant is correct. The plaintiff’s submission is based on a misreading ofIn re Howlett. In that case, the defendant trustee occupied trust property rent-free even though he was liable to pay an occupation rent for it. The beneficiary brought an action seeking an account of the rent. The trustee raised the defence of limitation and argued that he did not in fact receive any rent and therefore had no proceeds of trust property in his possession within the meaning of s 19(1)(b) of the English Limitation Act 1939. That section isin pari materiawith s 22(1)(b) of our Limitation Act. Danckwerts J rejected this argument (at 778–779): There is, however, in my view, force in [the beneficiary’s] contention that a trustee who remains in occupation of trust property for his own purposes—and undoubtedly, I think, the husband did so remain—cannot be heard to say that he has not received any rents or profits in respect of the property. Having received, therefore, in theory rents and profits, because he is chargeable with an occupation rent, he cannot discharge himself unless he can show that he has paid moneys away and therefore either discharge himself by proper payments or, indeed, perhaps escape under the Limitation Act having made improper payments. But here the trustee, it seems, did not make any payments out of any kind at all. He merely used the property for his own purposes, and I think the submission of [the beneficiary] is justified, that, having received the occupation rent, for which he is chargeable, he must be considered as still having it in his own pocket at the material date and therefore cannot escape under the provisions of the Limitation Act, 1939. … … I take the view that a trustee who has occupied the trust property for himself and is therefore chargeable with an occupation rent and therefore notionally has received the rent of the property on behalf of the beneficiary, and who cannot discharge himself by showing any contra payments, cannot take advantage of s. 19, sub-s. 1(b), and that therefore the defence of the Statute of Limitations does not succeed. 241 Factually, therefore, the rule inIn re Howlettis confined to a case where a trustee has made use of trust property for herself, as a result of which the trust is deprived of the income which that property would otherwise have generated. In such a case, the law treats the trustee as having notionally received and converted the income and treats it as trust property:McGeeat para 14.015. The basis for that treatment, it seems to me, is that the trustee has derived a benefit by virtue of his use of the trust property. The value of that benefit may reasonably be equated to the income which the property ought otherwise to have generated (Inre Howlettat 779) and treated as the proceeds of trust property in her possession, since she has enjoyed that benefit. In conceptual terms, the rule inIn re Howlettreconceives an issue under the possession limb as an issue under the conversion limb. Decision on s 22(1)(b) of the Limitation Act 242 I consider first the plaintiff’s case on the possession limb. In my judgment, the plaintiff has adduced no evidence to show that any of the trust money was in the defendant’s possession when he commenced this action. It is not sufficient for the plaintiff to rely simply on the fact that the defendant did receive substantial sums from the plaintiff in the past.187Foot Note 187×Plaintiff’s Supplementary Submissions dated 23 December 2016 at paras 50 and 58.The fact that a trustee has received trust money cannot, in itself, justify an inference that the trustee is still in possession of trust money. That is particularly the case when a beneficiary allows so much time to elapse between receipt and the claim for an account. In any event, both parties agree that at least some portion of the trust money was invested and some portion of it was paid back to the plaintiff in New Zealand. It is not entirely clear what the precise figures are on the evidence before me. This is no doubt at least in part because the defendant did not keep and furnish to the plaintiff clear and accurate accounts of that money from 1993 to 2007. But it is also the case that the plaintiff could have obtained accounts if he had sought them promptly. 243 There is also no merit to the plaintiff’s submission that the rule inInre Howlettcovers the rent from the Shanghai properties.188Foot Note 188×Plaintiff’s Supplementary Submissions dated 23 December 2016 at para 55.It is not the plaintiff’s case that the defendant derived a benefit by occupying the Shanghai properties herself rent-free. The plaintiff’s case is simply that the defendant has not accounted to him for the rent which she received as his trustee for the Shanghai properties. That is not the concern of the rule inIn re Howlett.Neither canIn re Howlettconceivably apply to any of the trust money which the defendant invested on his behalf. That is for the reasons I have set out at [241] above. Accordingly, the burden remains on the plaintiff to prove that the defendant is still in possession of trust property or its proceeds. In my judgment, he has failed to discharge that burden. 244 I turn next to the conversion limb. Again, the plaintiff has adduced no evidence to show that the defendant has converted to her use any of the trust money. I have considered and rejected for want of evidence the plaintiff’s argument that the defendant had no means to make the purchases that she did out of her own financial resources and therefore must have misappropriated the plaintiff’s money to do so: see [226] above. I have also rejected as irrelevant the argument, even if correct, that she misappropriated the dividends declared by GK Holding because she never held those shares giving rise to those dividends on trust for the plaintiff: see [228] above. In my judgment, therefore, the plaintiff also fails on the conversion limb.",
        "Conclusion on the Limitation Act": "245 For the reasons I have given, I hold that the plaintiff’s action for an account against the defendant is barred by s 6(2) of the Limitation Act and that  the plaintiff has proven no breach of an equitable duty on the defendant’s part which brings this case within s 22(1) of the Limitation Act and for which the remedy of an account can be awarded. That suffices to dismiss the plaintiff’s claim in its entirety.",
        "Discretion": "246 Even if I am wrong in my analysis of the interplay between ss 6(2), 6(7) and 22(1) of the Limitation Act, I retain a discretion not to order an account of the trust money,iean account of how the defendant dealt with that money which carries back from the present day all the way to the date on which the defendant received each of the plaintiff’s payments between 1993 and 2007. That discretion is to be exercised on the parameters set out inFoo Jee Booand in consideration of the competing interests I have explained at [187] above. 247 I would have exercised my discretion against the plaintiff and decline to order the defendant to provide an account of the trust money. That account would reach more than 24 years back, to 1993. It would no doubt be a protracted, costly and laborious undertaking. There is no evidence to indicate any possible fraudulent dealing in the trust money which an account might uncover and which would justify the time, expense and labour to which the defendant would be put in order to prepare such an account. 248 In fact, I am prepared to draw the inference from the evidence that the plaintiff was aware of the key features of what happened to his money from 1993 to 2007. This is one of the reasons for which I believe that ordering the defendant to render an account would serve no useful purpose. Two examples will illustrate this point. 249 First, the evidence shows that the plaintiff took an active role in instructing the defendant on trading foreign currencies with his with money in the Citibank joint account. This is apparent from a chain of email correspondence between the defendant and the plaintiff. In one of these emails, dated 10 June 2009, the plaintiff wrote to the defendant:189Foot Note 189×Heng Fock Lin’s Affidavit of Evidence-in-Chief dated 10 June 2016 at p 439. Hi Emily For your info: US Gold Dollar is a America’s new legal tender dollar, just out on the market not that long as far as I knew. This is an US government approved money spends like regular dollars. But it is backed by physical bars of 24-karat gold controlled by the US government. The exercise we do in Singapore now is a currency pairing, used quite commonly in the international banking or merchandised banking sectors. It is not the US gold dollar we are talking about. In the long term, I think the stronger currencies in the world, would be Chinese Yuen, Australian Dollars, then Japanese and Euro dollar. Australian dollar is getting stronger because of Chinese. China is also keeping BRIC under control if the world oil price getting out of hand. So Chinese Yuen and Australian Dollar could be both good currency to hold in the future but not Yuen just yet. Good luck to our venture, just a small fish but we will grow, eh. Ha ha …….. 250 Second, the plaintiff gave the defendant advice on the valuation of the Rochor property while its sale by GK Holdings was being negotiated in 2011. He wrote the following in an email to the defendant dated 14 July 2011:190Foot Note 190×Agreed Bundles of Documents, Volume 1 at p 446. Hi Emily There are many methods of commercial property valuation. The most common one and most people used it as a rule-of-thumb method of quick valuation or guidance to the value of most commercial property is a capitalisation rate of valuation. This method is mainly based on earnings of a particular commercial property concerned. Examples bellowed are the formula of how to calculated it. a) Formula is: Earnings divided by capitalization rate. Earnings is net trading profits, usually before deducting mortgage interest, depreciation and other non-trading expenses. And the capitalization rates are usually determined by the economy condition of the time, the type of industry, location, the age of the building, the construction of the building, etc. Most bankers, land agents, or valuers have these rates on hand. … e) I think we discussed this before, when our Bank presented us with a valuation of the food court property, remembered. f) All the best and good luck. I prayed to Baba mornings and nights for S$41 millions. Is that a correct figure! Well, that would be good enough for a poor kiwi like me in Rotorua … 251 These emails suggest to me that the plaintiff was aware of what the defendant was doing with his money. Although the defendant has not adduced evidence of this type in relation to other investments which she made for the plaintiff, it would have been inconsistent and thus uncharacteristic of the plaintiff to have permitted the defendant full control over those investments with no degree of instruction or supervision. I do not accept that the plaintiff, an experienced businessman, sent the defendant significant sums of money without keeping his own records about how that money was being managed and invested or that he would have remained silent for so long – notwithstanding the family relationship – if he felt that he needed information which he considered to be relevant about how the plaintiff was dealing with his money but was not being supplied it. 252 In my view, the plaintiff was not a babe in the woods who reposed absolute trust in the defendant to manage and invest the money he paid over to her, as he claims to be. Moreover, his refusal to explain the true purpose for circulating the trust money between New Zealand and Singapore makes me wonder whether he has sought equitable relief with clean hands, although I come to no firm conclusion on this point. In any event, had it been necessary, I would have held that he had not shown any good reason to burden the defendant with the oppressive time, expense and labour of rendering an account of all the money she received from him beginning more than 24 years ago to the present day. 253 For these reasons, in the exercise of my discretion, I would have declined to order the defendant to produce an account of the US$1,376,000, S$1,584,367.40 and RMB100,000 which I have found her to have received from the plaintiff between 1993 and 2007.",
        "Conclusion": "254 In conclusion, for all the reasons above, I have dismissed the plaintiff’s action. As a result of the position the defendant has taken on her counterclaim, the counterclaim thereby falls away and must be treated as having been dismissed: see [29] above. 255 I have ordered that the plaintiff to pay the defendant 80% of her costs of and incidental to this action. The plaintiff is obliged in principle to pay the defendant’s costs because there is no reason to depart from the usual principle that costs follow the event. And the event on the claim is decidedly in the defendant’s favour.  However, I have discounted the costs which the plaintiff will have to pay the defendant by 20% in order to reflect the wasted costs which the plaintiff incurred in dealing with the defendant’s counterclaim. That counterclaim was live right up until the trial of this action, when the defendant withdrew it in all but name. It appears to me that that counterclaim was put forward purely tactically and with no serious intent to submit it for adjudication. However, rather than putting the parties to the time and expense of having two bills of costs taxed – for the costs of the claim and of the counterclaim – I have discounted the costs which the defendant is to pay the plaintiff by 20% as a reasonable approximation of the costs of the counterclaim.  Vinodh CoomaraswamyJudge Tan Sia Khoon Kelvin David and Sara Ng Qian Hui (Vicki Heng Law Corporation) for the plaintiff;Yeo Choon Hsien Leslie and Shriveena Naidu (Sterling Law Corporation) for the defendant."
    }
}