{
    "case_title": "Cheong Wei Chang vLee Hsien Loong and another matter",
    "ncitation": "[2018] SGHC 217",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 Access to the courts is a fundamental aspect of the rule of law. At the same time, the services provided by the courts are the resource of the community as a whole. Litigants who pursue claims with vexatious persistence take up a disproportionate amount of attention, to the detriment of other claims and the needs of other litigants. For the vexatious litigant himself, and often his family, such continuous litigation also exacts a financial, emotional and mental cost. 2 Section 74(1) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed) (“SCJA”) addresses a part of this concern by requiring vexatious litigants to first seek the leave of the court before filing further action. Section 74 of the SCJA reads as follows: Vexatious litigants 74.—(1) If, on an application made by the Attorney-General, the High Court is satisfied that any person has habitually and persistently and without any reasonable ground instituted vexatious legal proceedings in any court or subordinate court, whether against the same person or against different persons, the High Court may, after hearing that person or giving him an opportunity of being heard, order that — (a) no legal proceedings shall without the leave of the High Court be instituted by him in any court or subordinate court; and (b) any legal proceedings instituted by him in any court or subordinate court before the making of the order shall not be continued by him without such leave, and such leave shall not be given unless the High Court is satisfied that the proceedings are not an abuse of the process of the court and that there is prima facie ground for the proceedings. (2) If the person against whom an order is sought under subsection (1) satisfies the High Court that he lacks the means to retain an advocate and solicitor, the High Court shall assign one to him. (3) No appeal shall lie from an order under subsection (1) refusing leave for institution or continuance of legal proceedings. (4) A copy of any order under subsection (1) shall be published in the Gazette. (5) In this section, “legal proceedings” includes any proceedings, process, action, application or appeal in any civil matter or criminal matter 3 The use of this statutory mechanism carries specific criteria and outcomes. This judgment considers, taking into account the court’s statutory powers, the reach of the court’s inherent powers to regulate and restrain proceedings by vexatious litigants.",
        "Background": "28Chee Siok Chinheld at [34] that the bringing of “multiple or successive proceedings which cause or are likely to cause improper vexation or oppression” enables a court to use its inherent power. V K Rajah J (as he then was) inChee Siok Chinat [32] referred to an article by Sir Jack I H Jacob (“Sir Jack Jacob”), “The Inherent Jurisdiction of the Court” (1970) 23 CLP 23. Sir Jack Jacob describes abuse of process at pp 40–41: From the earliest times, the court exercised the power under its inherent jurisdiction by summary process to terminate proceedings which were frivolous or vexatious or which were an abuse of process. … … [Abuse of process] connotes that the process of the court must be used properly, honestly and in good faith, and must not be abused. It means that the court will not allow its function as a court of law to be misused, and it will summarily prevent its machinery from being used as a means of vexation or oppression in the process of litigation. Unless the court had power to intervene summarily to prevent the misuse of legal machinery, the nature and function of the court would be transformed from a court dispensing justice into an instrument of injustice. It follows that where an abuse of process has taken place, the intervention of the court by stay or even dismissal of proceedings may often be required by the very essence of justice to be done, and so to prevent parties being harassed and put to expense by frivolous, vexatious or groundless litigation. 29 Therefore it is clear that in this case the court may exercise its inherent power to strike out the Statement of Claim. The issue is whether the court should go a step further to restrain future litigation. 30 The remedy initially sought by the AG (set out at [11] above) draws reference from what is known in the English courts as an “extended civil restraint order”, devised by the English Court of Appeal inEbert v Venvil and Another[2000] Ch 484 (“Ebert”)to prevent the initiation of fresh proceedings without leave of court in relation to matters that had already been adjudicated upon in a prior suit. This power has been further extended in later English decisions, and also dealt with by courts in Australia, Hong Kong and Canada. It would be useful to reference these developments before coming to the position in Singapore.",
        "Issues": "16 Summarising the various strands presented in Suit 489 and OS 1071, the issues for my decision may be distilled as follows: (a) whether the Statement of Claim in Suit 489 should be struck out; (b) whether I should exercise the court’s inherent power to restrain Mr Cheong from commencing any further similar action without the leave of court; and (c) in the event that I do not find it appropriate to make the order on the basis of the court’s inherent power, whether I should make an order under s 74 of the SCJA. 17 By this judgment, I strike out the Statement of Claim. I also restrain Mr Cheong from filing any further similar action without first seeking the leave of court, using the court’s inherent power to do so. The facts are not appropriate for the exercise of s 74 of the SCJA, and in any event its use is unnecessary in the light of the AG’s stance. I explain my reasons in turn, starting with the application to strike out the Statement of Claim.",
        "The application to strike out the Statement of Claim": "18 O 18 r 19 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”) sets out four grounds upon which a striking out order can be made: (a) it discloses no reasonable cause of action or defence; (b) it is scandalous, frivolous or vexatious; (c) it may prejudice, embarrass or delay the fair trial of the action; or (d) it is otherwise an abuse of process of the Court. 19 For the reasons below, all four grounds apply in this case.",
        "No reasonable cause of action": "20 In my judgment, the claim in Suit 489 discloses no cause of action. Mr Cheong believes that Mr Lee or the Prime Minister’s Office is regulating his activity. This purportedly causes technical errors in software programs, health problems and unsolicited emails (among other assorted problems). He appears to request a contract. There is no factual basis pleaded, nor is there any legal premise for the request for “contractual documents”. As such, it is vexatious, and would render a fair trial of the action impossible.",
        "Abuse of process of the court": "21 In addition, this Statement of Claim is essentially the same claim that was advanced in the previous suit. The doctrine ofres judicataprecludes later claims for matters that have already been adjudicated upon. This is an abuse of the process of the court. In addition to the statutory basis highlighted above, the court also retains the inherent power to strike out an action on the basis that the proceedings are an abuse of the process of the court (seeChee Siok Chin and others v Minister for Home Affairs and another[2006] 1 SLR(R) 582 (“Chee Siok Chin”)at [29]). The fact of abuse of process is a crucial factor in the consideration of the application to restrain Mr Cheong from further action without the court’s leave, either pursuant to the court’s inherent powers, or the later application by the AG under s 74 of the SCJA. I therefore detail here the reasons for my finding thatres judicatain the form of cause of action estoppel applies in this case. 22 There are four requirements for cause of action estoppel (seeManharlal TrikamadasMody and another v Sumikin Bussan International (HK) Ltd[2014] 3 SLR 1161 at [136]): (a) identity of parties; (b) identity of causes of action; (c) the court pronouncing the earlier judgment must have been a competent court; and (d) the judgment must be final and conclusive on the merits. All four requirements are satisfied on the facts of this case. As far as the first three are concerned, the parties are identical, Mr Cheong is relying on the same causes of action and there is no dispute that Suit 125 was before a competent court. 23 It is the fourth requirement that gives rise to dispute by Mr Cheong. At the hearing, Mr Cheong queried how cause of action estoppel could apply when there has been no trial in the earlier suit. There is no need, however, for a full trial in order for a decision to be final and conclusive on the merits. While in Suit 125, I struck out the claim without a trial, the decision is nonetheless final and conclusive. A precedent in point isSetiadi Hendrawan v OCBC Securities Pte Ltd and others[2001] 3 SLR(R) 296 (“Setiadi Hendrawan”). In that case, Woo JC (as he then was), had to decide whether a plaintiff was estopped from bringing a second action against the defendants because an earlier action had been struck out. The trial for the prior action was in progress when the plaintiff applied for leave to discontinue. The trial judge however, denied leave to discontinue and struck out the claim instead. The trial was never concluded. The notes of proceedings appeared to suggest that counsel for the defendant had urged the court to dismiss the claim rather than discontinue the claim in order to make it difficult for the plaintiff to commence similar claims again. Hence Woo JC concluded that the trial judge in the previous claim intended to preclude any fresh action, and held that cause of action estoppel applied (seeSetiadi Hendrawanat [36], [64] and [65]). 24 InTurf Club Auto Emporium Pte Ltd and others v Yeo Boong Hua and others and another appeal and other matters[2017] 2 SLR 12 at [94], the Court of Appeal endorsed the observations made inGoh Nellie v Goh Lian Teck and others[2007] 1 SLR(R) 453 at [28] (which in turn endorsedSetiadi Hendrawan) and highlighted that finality for the purposes ofres judicatarefers to a determination made by a court of a party’s liability or his rights or obligations that leaves nothing else to be judicially determined. This may be ascertained from the intention of the judge as gathered from the relevant documents filed, the order made and the notes of evidence taken or arguments made. The Court of Appeal’s guidance inThe Royal Bank of Scotland NV (formerly known as ABN Amro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 at [99] is also pertinent in this regard: In our judgment, in determining whether cause of action estoppel applies, the central inquiry will be directed at whether the later action is in substance a direct attack on and seeks to reverse, other than by way of a permitted appeal, an earlier decision made in relation to a disputed matter between the same parties. 25 Here, Suit 125 was struck out on the basis that it disclosed no reasonable cause of action and was obviously unsustainable. The point was that such an incoherent claim must proceed no further, because a fair trial was illusory in such a case. The substance of the claim advanced now remains the same, being “regulations” imposed on Mr Cheong by Mr Lee or the Prime Minister’s Office, and the supporting documents are, he contends, evidence of these regulations. The issues that plagued Mr Cheong’s claim in Suit 125 remain in the present suit. There were no facts pleaded that demonstrate the existence of an agreement between Mr Lee and Mr Cheong. Mr Cheong cannot unilaterally impose a contract on Mr Lee merely because he faces a variety of problems and issues. Trial Documents 1 (May 2018), too, was in all material aspects identical to Trial Documents 1. It likewise contained similarly incoherent allegations of wrongdoing and did not provide a sound factual basis for his claim (see [8] above). In submitting almost exactly the same Statement of Claim, with exactly the same supporting documents before the court, Suit 489 is obviously a direct attack upon and seeks to reverse the earlier decision in Suit 125. Cause of action estoppel squarely applies. 26 Indeed, Mr Cheong stated at the hearing on 24 September 2018 that Suit 489 is the same action that was filed earlier.12Foot Note 12×HC/S 489 Minute Sheet 24 September 2018, p 3.In his Statement of Reply filed in response to the AG’s submissions, he states that the present Statement of Claim was “re-filed after clearing out the problems about the previous Statement of Claim”.13Foot Note 13×Statement of Reply for HC/S 489/2018 filed on 3 April 2018, p 2.I disagree that the issues that the previous Statement of Claim pose have been resolved by the present Statement of Claim. 27 With this finding on prayer 1, I turn now to prayer 2.",
        "The application to restrain Mr Cheong from further like action": "",
        "The English position on the inherent power": "31 Mr Ebert was adjudged bankrupt on 22 July 1997. Over the course of the next few years, Mr Ebert made a large number of applications to the English courts seeking in one way or another to have the bankruptcy order annulled. Mr Ebert was initially subject to what was then known as a “Grepe v Loamorder” or a “civil restraint order”. The English decision ofJ S Grepe v Loam(1887) 37 ChD 168 (“Grepe v Loam”) authoritatively decided that the court had the inherent power to prevent further applications in existing proceedings being made without the leave of court. The English Court of Appeal was of the opinion that: “Mr Ebert has already brought vexatious proceedings, and that he will continue to bring such proceedings unless he is restrained from doing so” (seeEbertat 489). The question before the court was whether a civil restraint order could be extended to restrain future proceedings. 32 The court-appointedamicus curiaeinEbertargued that the court had no inherent power to make an extended civil restraint order, relying on the High Court of Australia’s decision inCommonwealth Trading Bank v Inglisand another(1974) 131 CLR 311 (“Inglis”).The court inInglisdeclined to extend civil restraint orders beyond existing proceedings, reasoning that the court had no inherent power to do so because it was only with the enactment of legislation to restrain vexatious litigants that the courts were empowered to restrain future proceedings. This was supported by the absence of reported cases in which extended civil restraint orders were made (Inglisat 314–319). The court inEbertrejected this argument. With the assistance of counsel, the court inEbertretrieved records that showed that English courts had made at least six orders restraining future proceedings prior to the enactment of the Vexatious Actions Act 1896 (UK) (“VAA”), the precursor to s 74(1) of the SCJA and other vexatious litigant provisions in other common law jurisdictions. The records also demonstrated that there were various English cases after the enactment of the VAA in which courts appeared to have restrained future proceedings without recourse to the VAA (Ebertat 495–496). The court highlighted that the retrieved records demonstrated that the reasoning inIngliscould not be accepted uncritically. Nevertheless, it was cognisant that the issue of extended civil restraint orders did not appear to be fully argued in the cases that were retrieved, and hence found it necessary to approach the issue on a matter of principle. 33 Lord Woolf MR, at 496–497, framed the starting point as the extensive inherent power of the court to prevent its processes from being abused: … the starting point must be the extensive nature of the inherent jurisdiction of any court to prevent its procedure being abused. We see no reason why, absent the intervention of a statute cutting down the jurisdiction, that jurisdiction should apply only in relation to existing proceedings and not to vexatious proceedings which are manifestly threatened but not yet initiated. … … In relation to specific anticipated proceedings both in this jurisdiction or abroad, the court can and does grant an injunction to stay the proceedings. … The ability of the court to operate in this way when the proceedings are only anticipated is no more than an example of the court being prepared to protect an applicant from anticipated damage when that damage is sufficiently imminent and serious. The court undoubtedly has the power to stay or strike out vexatious proceedings when they are commenced under its inherent power. We can see no reason in principle why it should not also, in accord with the general approach to the granting of quia timet injunctions, exercise that power to prevent the serious loss that anticipated but unidentified proceedings could cause the defendants to those proceedings. … 34 The court thus found that it was necessary to grant the extended civil restraint order to prevent future abuse of the court’s process by a vexatious litigant who has given every indication of continuing to vex the court and its users. The use of an injunction was not a new power, but merely a natural extension of the court’s existing power to stay or strike out vexatious proceedings and the power to stay anticipated proceedings to protect an applicant from anticipated damage when the damage is sufficiently imminent and serious. 35Ebertwas subsequently endorsed and applied in the English Court of Appeal decision ofBhamjee. The court inBhamjeeexpressly highlighted at [24] that s 42 of the Supreme Court Act 1981 (UK) (“SCA UK”), the successor to the VAA in the UK, was a harsh remedy: 24 A section 42 order has been described as a draconian order. It covers all the litigation and all the applications a vexatious litigant may wish to bring, and if a High Court judge refuses permission in relation to any attempt the litigant may wish to make to bring a matter to the attention of a court that is the end of the matter. It involves the publication of the litigant’s name on a list which receives widespread circulation, and although some recent orders have been made for a fixed period of time, by July 2000 only one ten-year order and one 15-year order had fallen into this category… It is therefore a form of relief which has a long term effect. 36 At [33] ofBhamjeeLord Phillips MR summarized the applicable principles relating to the court’s inherent jurisdiction as follows: 33 It is therefore well established on authority that: (i) this court, like any court, has an inherent jurisdiction to protect its process from abuse; (ii) the categories of abuse of process will never be closed; (iii) no litigant has any substantive right to trouble the court with litigation which represents an abuse of its process; (iv) so long as the very essence of a litigant’s right to access the court is not extinguished a court has a right to regulate its processes as it thinks fit (absent any statute or rule or practice direction to contrary effect) so long as its remedies are proportionate to the identified abuse (whether it is existing or threatened); (v) one way in which a court may legitimately regulate its processes is by prescribing a procedure to be conducted entirely in writing. 37Bhamjeerecognised that the inherent powers of the court could provide a flexible remedy to balance the needs of protecting the court from abuse, and at the same time ensuring that litigants are not burdened with a disproportionate order that may be unsuited to the unique circumstances. The court put in place comprehensive directions for the use of the inherent powers in this area. Endorsing civil restraint orders and extended civil restraint orders (at [39]–[42]), it also created a new category of civil restraint orders termed “general civil restraint orders” (seeBhamjeeat [43]–[47]). A two-year time limit on extended and general civil restraint orders, which could be extended in appropriate circumstances, was put in place (seeBhamjeeat [53]). 38 The various civil restraint orders and their guiding principles were subsequently codified in the Civil Procedure Rules 1998 (UK) in Rule 3.11 and Practice Direction 3C (UK). These rules are similar in substance to the proposals contained in the Ministry of Law Consultation Paper.",
        "Australia": "39 As alluded to above at [32], the High Court of Australia inInglishas refused to grant extended civil restraint orders. However, the decision has been distinguished in several Australia states. In the Queensland Court of Appeal case ofVon Risefer v Permanent Trustee Co Pty Ltd[2005] QCA 109 (“VonRisefer”),Ingliswas distinguished on the basis that there was no Queensland legislation that had cut down the inherent power of the courts to prevent abuse of the processes of the court. The court noted that the Vexatious Litigants Act 1981 (Qld) was “concerned with the creation of the status of a vexatious litigant and the restriction of the person’s ability to institute any proceedings, save by leave of the Supreme Court, while the status subsists” (seeVon Riseferat [16]). 40 The Victoria Court of Appeal inVelissaris v Dynami Pty Ltdand Another[2013] VSCA 299 (“Velissaris”) highlighted that “it [could not] ignore the deficiencies in the material before the High Court [inInglis], as pointed out inEbert”. The court stated that but forInglis, it would have adopted the approach inEbert. However, it considered that it was bound byInglis. To resolve this conundrum, it interpretedVon Riseferas being distinguishable fromInglison the basis that the order sought inVon Riseferwas confined to proceedings that were in substance an attempt to overturn a judgment already given and re-litigate a matter already decided. In contrast, the order inIngliswas framed “in the widest of terms”. It then endorsed the approach inVon Riseferand held that it had the inherent power to restrain litigants from commencing fresh proceedings where it is determined that those proceedings constituted an attempt to re-litigate a dispute that had already been concluded.(seeVelissarisat [139]–[143]). A similar approach was endorsed in the Supreme Court of South Australia case ofManolakis v Commonwealth Director of Public Prosecutionsand others[2009] SASC 193 at [22]–[23]. 41  The Australian cases demonstrate that the courts have found a need to fashion a remedy founded on the inherent powers of the court to protect the process of the court from abuse through the imposition of what is akin to an extended civil restraint order. This was done in spite of the position of the High Court of Australia inInglis.",
        "Hong Kong": "42 The Hong Kong Court of Final Appeal’s decision inNg Yat Chi v Max ShareLtd and Another[2005] HKCU 69 (“Ng Yat Chi”) also endorses extended civil restraint orders. 43 InNg Yat Chi,the courtadopted much of the reasoning inEbert, holding that there was no reason in principle to confine the inherent powers of the court to dealing with anticipated abusive applications in existing proceedings and that this power extended to preventing abusive proceedings which have not been commenced but are anticipated (at [8]).Chua Choon Limwas mentioned at [100] as an example of a “soundly based jurisdiction”. The court also addressed the argument that s 27 of the High Court Ordinance (Cap 4) (HK) (“HCO”), the Hong Kong equivalent of s 74 of the SCJA, had abrogated the inherent powers of the court by implication, which it termed the “statutory displacement argument”. Chief Justice Li stated at [10]: 10. The question arising … is whether the suggested inherent jurisdiction to make [a civil restraint order] has been abrogated by implication by s.27 of the High Court Ordinance, Cap 4. Under this provision, on an application by the Secretary for Justice and upon being satisfied of the prescribed criteria, the court may make an order prohibiting any new proceedings without leave. Such an order is a blanket order prohibiting all new proceedings in the absence of leave. The smaller the difference between the statutory jurisdiction and the inherent jurisdiction contended for, the stronger is the argument of implied abrogation. Here, having regard to the material differences between the statutory jurisdiction to make a blanket order and the inherent jurisdiction to make [a civil restraint order], including the differences between the two kinds of order, the statutory provision has not ousted the court’s inherent jurisdiction in this regard. 44 The court inNg Yat Chifound that the scope of the extended civil restraint order was “significantly narrower” than the statutory order pursuant to s 27 of the HCO. Unlike the “blanket effect of statutory orders prohibiting any kind of legal proceedings without leave against any person”, the extended civil restraint order was confined to fresh proceedings which are an attempt at re-litigating specified proceedings which have already been determined. Hence, the statutory displacement argument was inapplicable (seeNg Yat Chiat [89]–[90]). In contrast, the court at [105], questioned whether there was a proper basis to invoke a general civil restraint order, given that “[a] general civil restraint order may be thought to come uncomfortably close to the blanket statutory orders presently obtainable under HCO, s 27.” This particular issue was not before the court and hence the point was not conclusively decided. 45 The court also recommended at [106] that s 27 of the HCO be amended to allow any affected person to apply under that provision: It would in any event be advisable to give urgent consideration to amending HCO, s 27 with a view to widening its scope. … the court should have power to make statutory orders upon the application of any person directly affected by the vexatious conduct without the intervention or consent of the Secretary for Justice. 46 The legislative council of Hong Kong duly took up the suggestion and s 27 of the HCO was subsequently amended in 2008 to allow for “an affected person” to apply for a statutory order under the section. Under s 27(5) of the HCO, an “affected person” is defined as a person who is or has been a party to any of the vexatious legal proceedings, or has directly suffered adverse consequences resulting from such proceedings.",
        "Canada": "47 The courts in the Canadian province of Alberta have regarded extended civil restraint orders and general civil restraint orders as being consistent with the court’s exercise of its inherent powers. InHok v Alberta(2016) ABQB 651 (“Hok”) the Alberta Court of Queen’s Bench relied on the cases ofEbertandBhamjeefor the proposition that the VAA and its successors do not codify the court’s authority, “but instead legislative and common-law inherent jurisdiction control processes co-exist” (seeHokat [17]). This was supported by the historical research undertaken by the court inEbert(see [32] above). 48 The court also examined the Canadian authorities and highlighted that the Alberta Court of Appeal had issued a general civil restraint order in the case ofDykun v Odishaw(2001) ABA 204 (“Dykun”). This was not done in accordance with the procedure for the vexatious litigant restrictions contained in the Alberta equivalent of the VAA, and instead was styled as an injunction. Leave to appeal to the Supreme Court of Canada on the validity of the order inDykunwas denied (seeHokat [19]–[20]). The court inHokthus concluded on the strength of English and Canadian authority that the court’s authority to restrict court access was neither solely derived from, nor restricted by any legislation but rather co-existed with it (seeHokat [25]). 49 This position was subsequently endorsed and applied in later Alberta Court of Queen’s Bench cases such as1985 Sawridge Trust v Alberta (Public Trustee)(2017) ABQB 548 (“Sawridge”)at [42]–[47]. InSawridge, the court also stated at [49]: [49] The question, then, is whether theJudicature Act, ss 23-23.1 procedure is an adequate one, or does the Court need to draw on its “reserve” of “residual powers” to design an effective mechanism to control abusive litigants and litigation. I conclude that it must. A critical defect in this legislation is that section 23(2) defines proceedings that are conducted in a “vexatious manner” as requiring “persistent” misconduct, for example “persistentlybringing proceedings to determine an issue that has already been determined by a court of competent jurisdiction”:Judicature Act, s 23(2)(a). [emphasis in original] 50 The court inSawridgehighlighted the problems of what it labelled as the “persistence-driven approach”. It found that the persistence-driven approach limited the courts to only fully reining in worst-case problematic litigants after their litigation misconduct had metastasized into a cascade of abusive actions and applications (Sawridgeat [53]). It highlighted that there were various instances where the behaviour of certain litigants had yet to result in persistent applications or proceedings, but in all likelihood would eventually manifest in such persistence. The court highlighted some possibilities including: (a) Cases where the litigants made express statements of intent indicating that the litigant intended to commence fresh proceedings on the same matter (Sawridgeat [55]); (b) Cases where there was an abuse of the litigation process due to underlying mental health issues (Sawridgeat [63]–[67]); and (c) Cases where there was an abuse of the litigation process motivated by ideology (Sawridgeat [68]–[74]. 51 The court concluded at [76]: The reason that I and other Alberta Court of Queen’s Bench Judges have concluded that this Court has an inherent jurisdiction to limit court access to persons outside theJudicature Act, ss 23-23.1 scheme is not simply because the UK appeal court have concluded that this jurisdiction exists,but also because that authority is necessary. … the Supreme Court has instructed that trial courts conduct a “culture shift” in their operation towards processes that are fair and proportionate, without being trapped in artificial and formulaic rules and procedures. This isan obligationon the courts. The currentJudicature Act,ss 23-23.1 process is an inadequate response to the growing issue of problematic and abusive litigation. [emphasis in original] 52 The court thus approved of the approach inHokand endorsed the existence of extended and general civil restraint orders, independently of the scheme under the equivalent of s 74 of SCJA.",
        "The position in Singapore": "53 I have summarised, at [12]–[13], the relevant judicial use and comment regarding the existence of the inherent power to restrain future litigation in Singapore. I therefore analyse their effect here without repeating the background again. I should mention that in the present inquiry, whilst courts elsewhere have variously used the terms “inherent jurisdiction” and “inherent powers”, I am guided by the Court of Appeal’s view inRe Nalpon Zeroat [36]–[41], that the exercise of the right to regulate matters before the court should be properly referred to as the exercise of the court’s inherent powers, rather than its inherent jurisdiction. 54 I start with the Court of Appeal’s guidance inLinda Lai. In that case, after Ms Lai had instituted and conducted numerous proceedings over 16 years, the AG successfully applied to restrain Ms Lai under s 74 of the SCJA. Judith Prakash, JA, delivering the Court of Appeal’s judgment dismissing the appeal, stated at [18]: Although this issue did not arise in this case, we add for completeness that it may be possible for the court to make a restraining order against a vexatious litigant on its own accord even if the AG has not made any application under s 74(1) of the SCJA. The English courts have taken the position that the court has an inherent jurisdiction to do this as it must be able to protect its processes from abuse, but this power must be exercised only in exceptional circumstances (seeBhamjee v Forsdick[2004] 1 WLR 88). This issue was discussed inTee Kok Boon, but it was not decided as the court there did not have the benefit of arguments by counsel. For the same reason, we leave this issue open to be decided in a future case that engages it. 55Tee Kok Boon, highlighted in the above extract, concerned a litigant who filed numerous criminal motions after his appeal against his conviction under s 193 of the Penal Code (Cap 224, 1985 Rev Ed) was dismissed. At the application of the AG, Woo J granted an order under s 74 of the SCJA. He also considered briefly the inherent power of the court to restrain proceedings, as the relief was pursued in the alternative. Assigned counsel for the litigant, on the other hand, advanced the view that the court had no such power under its inherent jurisdiction (see [123]). Woo J stated at [124]: In the light of my conclusion on s 74(1), these submissions were academic. Indeed, one may ask whether the court’s inherent jurisdiction to make a restraining order against a vexatious litigant, even if it existed, has been superseded, wholly or partly, by s 74(1) especially if the applicant is the Attorney-General. As I did not have the benefit of full arguments, I will not attempt to answer that question. 56 After dealing with the English and Australian authorities, Woo J then consideredChua Choon Lim, on which Mr Sivakumar relies, in the following way at [131]: It is true that in the Singapore case of [Chua Choon Lim], Amarjeet Singh JC ruled that the High Court has the power under its inherent jurisdiction to make a restraining order in the context of civil proceedings. He also said that such a power is in addition to that under s 74(1). However, the subject matter before him was not the restraint of criminal proceedings. Neither was the subject matter before him an application by the Attorney-General under s 74(1). 57 A similar view was expressed inAG v Tham, where the AG brought a successful application against three members of the Tham family under s 74 of the SCJA. Ramesh J was of the view that a wide order covering all future proceedings was necessary to prevent the defendants from commencing further vexatious legal proceedings (seeAG v Thamat [71]). In concluding remarks, he dealt with the alternative application relating to the exercise of the court’s inherent powers, which was no longer necessary, in the following terms, at [72]: …In the premises, I did not need to decide whether similar orders could be granted on the basis of the court’s inherent powers to prevent the abuse of its process. I raised with Ms Liew the question of whether the court had inherent powers to make orders of the wide scope described above. In this regard Ms Liew relied onEbert([40]supra).However,Ebertdoes not stand for the proposition that the court’s inherent powers extend to restraining proceedings other than the vexatious proceedings before it,and to protecting parties other than the vexed defendants before the court.If the court’s inherent powers were so broad, s 74 would seem somewhat otiose. … The position is at the very least unclear to me. As it was unnecessary for me to decide these points, I did not do so. [emphasis added] 58 Mr Sivakumar, in advocating thatChua Choon Limshould be applied, attempts to distinguishAG v Thamon the basis that the cases were querying the existence of the inherent power to grant a general civil restraint order, but did not call into question inherent power to grant a narrower extended civil restraint order.14Foot Note 14×Defendant’s Supplementary Submissions, at paras [32]–[36].This assertion appears to gloss over the sentence highlighted in italics in the extract above. 59 In respect ofLinda Laiand Prakash JA’s reference to “exceptional circumstances”, Mr Sivakumar’s contention was that those were only applicable to the general civil restraint order, which he characterised as exceptional, rather than the extended civil restraint order. This was because Prakash JA citedBhamjee. He argues from there that becauseBhamjeeis the English decision which established the new category of general civil restraint orders, the court inLinda Laiwas only leaving open the existence of general civil restraint orders and not extended civil restraint orders. I find that I am not able to make the same deduction from the citation ofBhamjeewithin [18] of the Court of Appeal’s judgment. In my view, an objective reading is that the court inLinda Laiwas considering the existence of the inherent power to restrain future proceedingsgenerallyand not limited to only the existence of a wider general civil restraint order. First, the passage above does not cite any particular portion ofBhamjeespecific to general civil restraint orders. Second, the judgment inBhamjeeitself discussed the full range of remedies a court can take to protect itself from abuse of process and was not solely focussed on one particular remedy (seeBhamjeeat [53]). 60 Turning toBhamjee,there the court considered that the unlimited nature of its inherent powers went hand in hand with the exceptional nature of its exercise. The court inBhamjeeat [11] described the starting point of the exercise of its discretion as such: The power to protect its processes from abuse is vested in every court. The starting point is the judgment of Alderson B inCocker v Tempest(1841) 7 M & W 502, 503–504: “The power of each court over its own process is unlimited; it is a power incident to all courts, inferior as well as superior; were it not so, the court would be obliged to sit still and see its own process abused for the purpose of injustice. The exercise of the power is certainly a matter for the most careful discretion” 61 Again the exceptional and yet unlimited nature of inherent power over procedural matters was emphasised inAB v John Wyeth & Brother Ltd(1996) 8 Med LR 57, which the court cited with approval at [13] ofBhamjee: 13 InAB v John Wyeth & Brother Ltd (1996) 8 Med LR 57,70Brooke LJ drew three themes from a number of authorities on this topic. He said: “The first is that the court has an inherent jurisdiction to step in and prevent its process being abused for the purpose of injustice, or in order to maintain its character as a court of justice. The second is that the court should be very slow to exercise this summary power (see alsoMetropolitan Bank Ltd v Pooley(1885) 10 App Cas 210, per Lord Blackburn at p 22I: ‘it should not be lightly done’). The third is that the category of case in which the court should be willing to exercise this power is, almost by definition, never to be closed.” 62 These views reflect those ofEbert: see [33] above. The English courts view the inherent powers as powers that would only be exercised exceptionally, but where exercised, are of unlimited nature. It was on this basis that the court inBhamjeeat [43]–[44] decided that there were circumstances in which it would be appropriate for the court to invoke its inherent powers to grant a general civil restraint order. It follows thatanyexercise of the court’s power would be exceptional, whether for civil restraint orders, extended civil restraint orders, or general civil restraint orders. 63 Indeed, and as I will explain in the next section, this too is the position of the Singapore courts in any exercise of our inherent powers. The Court of Appeal inRe Nalpon Zero,at [42], referred to “exceptional circumstanceswhere there is a clear need for it and the justice of the case so demands” [emphasis in original]. Any application in the area of restraining further proceedings must be consistent with the Court of Appeal’s general views as to its inherent powers. It is crucial, therefore, to assess the use and boundaries employed in Singapore cases on inherent powers generally, before considering whether they may be used, in this particular case, to restrain future proceedings. Inherent powers generally 64 InRoberto BuildingMaterial,the Court of Appealat [16]–[17], building on its earlier view inWee Soon Kim Anthony v Law Society of Singapore[2001] 2 SLR(R) 821 (“Wee Soon Kim”) at [27], stated: 16 By its very nature, the inherent jurisdiction of the court should only be exercised in special circumstances where the justice of the case so demands. This court had, inWee Soon Kim Anthony v Law Society of Singapore[2001] 2 SLR(R) 821 cited a passage from Sir Jack Jacob published in (1970) 23 Current Legal Problems 23, indicating how this jurisdiction should be exercised: This [inherent] jurisdiction may be invoked when it is just and equitable to do so and in particular to ensure the observance of the due process of law, to prevent improper vexation or oppression and to do justice between the parties. Without intending to be exhaustive, we think an essential touchstone is really that of ‘need’. 17 Accordingly, this inherent jurisdiction should only be invoked in exceptional circumstances where there is a clear need for it and the justice of the case so demands. … 65 In considering whether there is a “clear need” to invoke the inherent power of the courts, Andrew Phang J (as he then was) emphasised, inWellmix Organicsthe importance of any relevant legislative intention and the pre-existing statutory framework, at [81]: … What does appear clear is that if there is an existing rule (whether by way of statute or subsidiary legislation or rule of court) already covering the situation at hand, the courts would generallynotinvoke its inherent powers under O 92 r 4, save perhaps in the most exceptional circumstances. … It is commonsensical that O 92 r 4 was not intended to allow the courtscarte blancheto devise any procedural remedy they think fit. That would be the very antithesis of what the rule is intended to achieve. The key criterion justifying invocation of the rule is therefore that of “need” – in order that justice be done and/or that injustice or abuse of process of the court be avoided. 66 The various cases may be summarised into two primary requirements: (i) there must be no statutory exclusion of the inherent power; and (ii) there must be exceptional circumstances where there is need for the court to use its inherent powers in order for justice to be done or injustice to be averted. 67 I turn first to the issue of statutory exclusion. Associate Professor Goh Yihan (“Prof Goh”) in his article, “The Inherent Jurisdiction and Inherent Powers of the Singapore Courts: Rethinking the Limits of Their Exercise” (2011) SJLS 178 at pp 200–208, makes the helpful distinction between express statutory exclusion and implied statutory exclusion. In the present case, there is no express statutory exclusion. Only the issue of implied statutory exclusion is relevant, because of the existence of s 74 of the SCJA. Mr Sui cogently points out that it is important to consider the source for s 74 of the SCJA, the VAA. During the Second Reading for the VAA in the House of Lords and House of Commons, nothing was said about restricting this inherent power, nor was it ever implied that the courts did not have such a power prior to the enactment of the VAA: See United Kingdom, House of Lords,Parliamentary Debates(14 July 1896), Vol 42 cols 1410-1413; United Kingdom, House of Commons,Parliamentary Debates(10 August 1896), Vol 44 cols 456–457. In fact, as established inEbert, the inherent power existed prior to the VAA, and continued to co-exist with the VAA after (see [32] above). The parliamentary statements on s 74 of the SCJA similarly do not demonstrate any legislative intention to cut down the inherent powers of the court. During the debate on the amendment to SCJA in 2010, s 74 was briefly mentioned, however, the discussion merely related to the proposed codification of a principle established inTee KokBoonat [82], that s 74 applied to both civil and criminal proceedings. There was no discussion on the inherent powers of the court or that s 74 should be the only remedy available to prevent the commencement of future proceedings (seeSingapore Parliamentary Debates,Official Report(18 October 2010), Vol 87 at col 1373 (Associate Professor Ho Peng Kee, Senior Minister of State for Law)). 68 How should we deal with legislative silence on the matter? Here again, Prof Goh provides a useful suggestion (see pp 202–207) that there should be an assumption of implied exclusion in such circumstances. Prof Goh then draws a distinction between three categories: inherent jurisdiction (the authority to hear a particular matter), inherent substantive powers and inherent procedural powers. He suggests that the assumption of implied exclusion is the strongest when the court is seeking to invoke its inherent jurisdiction, followed by inherent substantive powers, with the weakest assumption of implied exclusion being reserved for the inherent procedural powers. Prof Goh scoped the strength of these assumptions based on an analysis of various Singaporean authorities as well as parliamentary statements. His research suggests that the courts and parliament regard a court’s authority to hear a particular matter as being primarily an issue for parliament to decide. In comparing between inherent substantive powers and inherent procedural powers, Prof Goh notes that the court has been regarded as the master of its own process, whereas the power to affect substantive rights is mainly within the province of parliament. 69 Using his framework, the strength of the implied assumption of exclusion is weak in the present case, for two reasons. First, the power sought to be invoked in the present case is procedural in nature.Black’s Law Dictionary(Thomson Reuters, 10th Ed, 2014) at p 1519 defines a procedural right as “a right that helps in the protection or enforcement of a substantive right”. In the context of construing a statutory provision, the Court of Appeal inStar City Pty Ltd (formerly known as Sydney Harbour Casino Pty Ltd) v Tan HongWoon[2002] 1 SLR(R) 306 at [12] stated: …If the provision regulates proceedings rather than affects the existence of a legal right, it is a procedural provision. A distinction is drawn between the essential validity of a right and its enforceability. 70 It was on this basis that the court held that s 5(2) of the Civil Law Act (Cap 43, 1999 Rev Ed) which states that “no action shall be brought or maintained in the court” in respect of certain wagering agreements, was a procedural provision, since it did not extinguish the essential validity of the right but merely rendered the right unenforceable. Similarly, in the present case, in only allowing Mr Cheong to commence future proceedings in certain matters with leave of the court, the essential validity of Mr Cheong’s rights have not been affected and only the mode of enforcing his rights have been adjusted, with the requirement of leave. Hence this power is properly characterised as a procedural power. 71 Second, the power sought to be invoked is not new. Rather, as highlighted by the English court inEbert(see [33] above), this power is merely an application of the well-established power to prevent anticipated harm throughquia timetinjunctions, in combination with the equally well-established power for the court to protect its own processes.Chua Choon Limwas also decided prior to the 2010 amendments to s 74 of the SCJA and yet there were no statements made during the parliamentary debate on the 2010 amendments that suggested that parliament intended to abrogate this power. 72 Having ruled out statutory exclusion, I turn, then, to the second issue of need, which the courts have variously described as a need created by special circumstances, where justice demands, or where injustice is threatened. On this point,Ebert,SawridgeandBhamjeewell put the genuine need for courts to devise flexible means to address an intermediate range of abusive conduct in a proportionate and nuanced manner (see [49]–[51] above). Within our jurisdiction, it is important that there are significant areas of distinction between an order under s 74 of the SCJA and a civil restraint order. Five particular points of distinction stand out: (a) Most importantly, there is no other mechanism for a private party to avoid being harassed by vexatious litigants through the institution of multiple fresh proceedings. (b) Section 74(4) requires the publication of the individual’s name in the Gazette, declaring and labelling the individual as a “vexatious litigant”. (c) Pursuant to s 74(3), there is no appeal from an order refusing leave for orders made under s 74, whereas there is no such requirement for an extended civil restraint order. (d) The precise remedy can be fashioned in a nuanced and appropriate manner in light of the circumstances. Whereas s 74 lays out a fixed order that can be made pursuant to that provision (although, as clarified byLinda Lai, the scope of the order may be varied), the inherent powers of the court can grant a wider range of orders. For example, the court inBhamjeeat [57] allowed for the abusive litigant to apply for leave by way of letter, as opposed to a formal application, and also set out the specific process by which the litigant could appeal his decision. In another example, Mr Ebert’s extended civil restraint order was subsequently varied such that he could only apply for leave once every two months, unless he could demonstrate that a more urgent application was called for (seeBhamjeeat [29]). (e) Lastly, in line with the general flexibility of the inherent powers of the court, the threshold for granting an extended civil restraint order may be lower than that of the “habitual and persistent” threshold found in s 74. This distinction is made explicit inSawridge(see [50] above). Substantive need presented by this case 73Roberto Building MaterialandWee Soon Kimmake clear that “need” is always specific to the circumstances of the case, and to be drawn prudently. In the present case, the need arises because Mr Cheong is unable to understand that his claim is incoherent. A perusal of the documents filed, and an observation of his behaviour during the hearings indicate that there are underlying issues that hinder his ability to realise the vexatious and futile nature of his actions. At the same time, he is unable to listen to legal advice. He said in court that he had visited 30–50 lawyers.15Foot Note 15×HC/S 489 Minute Sheet 24 September 2018, p 3.He is also unwilling to listen to the counsel of his concerned family members, who support the application of the AG.16Foot Note 16×HC/S 489 Minute Sheet 24 September 2018, p 14.The justice of the case does demand exercise of the court’s inherent power. Injustice would otherwise result, in the use of state and court resources, and the toll on the other members of his caring family. His father expressed a desire for closure.17Foot Note 17×HC/S 489 Minute Sheet 24 September 2018, p 14. 74 At the same time, this is not a case appropriate for s 74 of the SCJA. Instead the present scenario falls squarely in the gap identified bySawridge(see [50] above). While there is no “magic number” as to how many proceedings have to be brought before a litigant’s conduct would constitute habitual and persistent conduct (seeLinda Laiat [14]), I hesitate to classify Mr Cheong’s conduct as being of similar gravity and scale as previous recipients of orders under s 74 of the SCJA. InAG v Barker[2000] 1 FLR 764, Lord Bingham of Cornhill CJ gave the following illuminating explanation of “habitually and persistently”, which Mr Cheong does not fulfil: The essential vice of habitual and persistent litigation is keeping on and on litigating when earlier litigation has been unsuccessful and when on any rational and objective assessment the time has come to stop. What if the AG is the applicant? 75 The query posed byTee Kok BoonandAG vThamremain. What if the AG, who is empowered to, and has, as in this case, taken out an application under s 74 of the SCJA? Mr Sui’s submission, taking on board the concern that an inherent power cannot render the statute otiose, is that the AG may not seek the inherent powers of the court when he is a party to litigation. The court’s inherent power to grant civil restraint orders can only be invoked by private parties or by the court acting on its own motion. If this were so, the AG’s only recourse, in this case, where his view is that he is the rightful defendant, would be s 74 of the SCJA. 76 My concern with such a distinction is that there is no principled reason that may form a premise for it. Mr Sui’s explanation was that this would be the only way to make sense of the statute. The Hong Kong Court of Final Appeal, it will be recalled, was also concerned to draw a bright line with the statutory provisions. Mr Sivakumar answers Mr Sui’s point well by pointing out that the AG discharges various roles. When he applies under s 74 of the SCJA, he acts as the custodian of the public interest (and dicta of the High Court of Hong Kong inSecretaryfor Justice v Ma Kwai Chun[2005] HKCU 1808 at [8] supports this). As legal advisor to the Government the AG has, however, other roles, and in these other roles, he ought not to be disallowed the rights of other private parties to litigation. He may represent the Government under the GPA. This is the present frame of reference. But the AG may also instruct counsel under s 24(3) of the GPA. Statutory boards, too, may be represented by the AG where he chooses to do so under ss 3 and 4 of the Attorney-General (Additional Functions) Act (Cap 16A, 2017 Rev Ed). Mr Sui’s submission would result in an arbitrary situation where the availability of the remedy turns on whether the Government or a statutory board is represented by the AG or other counsel. In this context, inMahajan v Department of Constitutional Affairs[2004] EWCA Civ 946, the Department of Constitutional Affairs successfully applied for a restraining order under the inherent powers of the court while represented by the Treasury Solicitor. 77 Mr Sivakumar’s response is to scope the inherent power to the extent of the extended civil restraint order, disagreeing withBhamjee. The AG is required for any order that comes close to that given under s 74 of the SCJA. His rationale is that a s 74 application is properly the province of the AG as the guardian of the public interest. For this, he relies also onNg Yat Chi. While such an approach suffices for a remedy on the facts of the present case, I do not think it sits well with local jurisprudence on the ability of the courts to address the justice of the case in procedural matters where, on the exceptional facts presented, relief is necessary. The crucial inquiry posed byRoberto Building MaterialandWee Soon Kimis that of the need arising on the special circumstances of the case. On the issue of need, the need for general civil restraint orders, while not arising on the facts of this case, has been anticipated by the Ministry of Law Consultation Paper, which proposes to allow private parties to ask the court for relief to the extent of a general civil restraint order as set out inBhamjee. This perspective, shared by Hong Kong, Canada and the United Kingdom, assumes that the AG need not always be troubled even where orders of a general nature are requested. Be that as it may, the need may no longer arise in future: future cases will likely have the benefit of the Supreme Court of Judicature (Amendment No 2) Bill (No 33 of 2018), passed by Parliament three days ago. 78 I prefer to see the AG’s powers under the statutory regime as the final step in an escalating series of measures that may be taken to address the problem of a vexatious litigant. Seen in this light, the extended civil restraint order exists as an intermediate measure, available even to the AG. This is consistent withBhamjeeat [58], where the court considered it timely to first impose an extended civil restraint order as an intermediate step prior to the AG’s planned intervention: 58 We were told that the Attorney General will be applying in the near future for a section 42 order against Mr Bhamjee and that he is likely to seek interim relief in those proceedings. The order we are making today will stand notwithstanding any interim order the Divisional Court may hereafter make. Unless and until a final section 42 order is made we consider that our order provides more flexible and appropriate protection for these defendants and for the courts themselves than any interim order the Divisional Court may consider it has power to make. 79 This approach is also congruent with the litigation pertinent to the Tham family, the defendants inAG v Tham. The family had taken out bankruptcy applications against 21 individuals, including nine Cabinet Ministers. 11 of the 21 individuals applied to strike out the application. They also sought an injunction to restrain the plaintiffs from filing any further bankruptcy applications against any of the individuals without the leave of the High Court. InTham Yim Siongand others v Tan Chuan-Jin and othersHC/B 1051/2016 (20 May 2016)(“Tham v Tan”), Woo J, delivering an oral judgment, struck out the bankruptcy application and granted the injunction sought as he was of the view that the application was an illegitimate attempt to pressure the individuals to meet the Tham family’s rambling and unclear demands and an abuse of the process of the court (Tham v Tanat [8], [11] and [13]). Woo J also gave an order that the Tham family had to seek leave of the High Court before serving any other statutory demand on any of the Defendants in question (at [14]). Unfortunately, that did not end the matter. Between 1 June 2016 and 23 March 2017, the Tham family sent a variety of letters and emails to various members and staff of the Supreme Court, government officials as well as members of the media alleging misconduct on various parties, including Woo J and the Second Solicitor-General. Between 15 August 2016 to 15 March 2017, the Tham family also filed a barrage of applications and proceedings in both the State Court and the High Court essentially raising the same facts that they had relied on in the bankruptcy application, but disguised as other applications such as applications under the Legal Profession Act (Cap 161, 2009 Rev Ed). Throughout the period, one member of the Tham family also published several posts on her Facebook account detailing the steps she had taken in court and narrating the events from her perspective. Finally, on 27 March 2017 the AG filed the application that was the subject matter ofAG v Tham. A wide order against all three family members, prohibiting all future proceedings against any persons, was granted by Ramesh J, at [71]. 80 This then, is the delineation between the statutory power and the power which the court retains as its inherent power. Where the AG has obtained the statutory remedy of unlimited nature and indefinite period from the court, another order, whether from the AG or any private party, may not be entertained. There would simply be no need for the exercise of the inherent powers of the court if the circumstances were such that the s 74 remedy is appropriate. This, in my judgment, is the better manner in which to approach the reservations expressed inTee Kok BoonandAG v Tham(see [13] above). It should also be noted that within our jurisdiction, in contrast to the practice in England, the Court of Appeal has made clear that more limited orders may be sought and imposed under s 74 of the SCJA (seeLinda Laiat [17]). This gives the AG greater flexibility in the remedies available under the statute but constrains him similarly where the use of the statute is appropriate. Conclusion on the use of the court’s inherent power 81  Drawing together the various strands, I conclude with a grant of the remedy requested by the AG. The form of the prayer follows the orders used inEbert(seeEbertat 491–492) andTham v Tan. As the present order deals with matters raised by the present Statement of Claim and similar Statements of Claim, this order is indefinite in time period. For this particular circumstance, there is no need to impose time limits as suggested byBhamjeefor extended civil restraint orders.",
        "Application under s 74 of the SCJA": "82 In the light of my decision to exercise the court’s inherent power, it is no longer necessary to deal with the application under s 74 of the SCJA, which in any event I have decided is not appropriate. There is no need, at this juncture, to determine that Mr Cheong is a habitual and persistent vexatious litigant as defined under the section or to list him in the Gazette as one. The court encourages him to seek the medical treatment that his supportive family has expressed desire to assist him with. If the source of his incoherence is addressed and he is able to delineate sustainable causes of action, he is at liberty to file such a suit. If, on the other hand, his behaviour escalates, it may yet prove timely for the AG to seek a stronger remedy. Mr Sivakumar requested leave to withdraw the OS if I should exercise the court’s inherent power and I so order.",
        "Conclusion": "83 I grant an order in terms of prayers 1 and 2 of Summons No 2809 of 2018 in Suit 489. Leave is granted to the AG to withdraw OS 1071. Mr Sivakumar stated at the hearing that he does not seek costs and I make no order as to costs. Valerie TheanJudge The plaintiff in Suit 489 of 2018/defendant in Originating Summons 1071 of 2018 in person;Sivakumar Ramasamy and Gabriel Lim (Attorney-General’s Chambers) for the defendant in Suit 489 of 2018/plaintiff in Originating Summons 1071 of 2018;Sui Yi Siong (Eversheds Harry Elias LLP) as YoungAmicus Curiae."
    }
}