{
    "case_title": "H&C S Holdings Pte Ltd vGabriel Law Corp",
    "ncitation": "[2018] SGHC 168",
    "coram": "George Wei J",
    "sections": {
        "Background to the dispute": "",
        "Genesis of the dispute": "5The Client is a Singapore-incorporated company dealing with, amongst other things, the trading and sale of iron ore to buyers in the People’s Republic of China.9Foot Note 9×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 6. 6This dispute arose in the aftermath of various SIAC arbitrations in which the Client was involved. The Disputed Invoices were issued by the Firm to the Client solely in respect of the work it did for the Client in SIAC arbitration number 123 of 2010 (“SIAC 123”). The Client had commenced SIAC 123 on 25 June 2010 against Metalloyd Ltd (“Metalloyd”). The details of the dispute in SIAC 123 are irrelevant for the present purposes. Suffice to say that the award for SIAC 123 (“the 123 Award”) was eventually rendered on 2 January 2014 in favour of the Client.10Foot Note 10×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 11. 7Thereafter, the Client engaged the Firm on or about 15 January 2014 to enforce the 123 Award in Singapore and in the United Kingdom (“the 123 Award Enforcement Proceedings”). The 123 Award Enforcement Proceedings were effectively completed in September/October 2015 when the Firm received the sum of US$2.459 million from Metalloyd on behalf of the Client in full satisfaction of the 123 Award. The Disputed Invoices were rendered in connection with the 123 Award Enforcement Proceedings. 8The Client also engaged the Firm as its solicitors for SIAC arbitration number 200 of 2013 (“SIAC 200”) and SIAC arbitration number 223 of 2013 (“SIAC 223”). Both SIAC 200 and SIAC 223 were matters in relation to a dispute between the Client and Mount Eastern Holdings Resources Co. Limited (“the Mount Eastern Matter”).11Foot Note 11×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 3.The Mount Eastern Matter is unrelated to SIAC 123. It is noted that there was a period when the Firm was handling and doing work on the Mount Eastern Matter and SIAC 123 (including the 123 Award Enforcement Proceedings) at the same time. 9On 8 January 2016, slightly over two years after the 123 Award was handed down, the Firm issued Invoice number 97 (“Invoice 97”) for work done in relation to the Mount Eastern Matter.12Foot Note 12×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 48.Invoice 97 is not one of the Disputed Invoices. As Invoice 97 remained unpaid, the Firm took out OS 216/2016 on 4 March 2016 for Invoice number 97 to be taxed.13Foot Note 13×First Affidavit of Zhu Xiao Dong (14 September 2016) at pp 83–84. 10It was around this period that the Client realised that it was not able to account for a balance sum of US$172,670.56 held by the Firm.14Foot Note 14×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 49.According to the Client’s records, this balance sum ought to have been held by the Firm for the Mount Eastern Matter.15Foot Note 15×Second Affidavit of Zhu Xiao Dong (19 December 2016) at p 164.The Client then engaged its present solicitors, Rajah and Tann (“R&T”), on or about 15 March 2016, to begin looking into its past financial transactions with the Firm, including transactions relating to the Firm’s work in SIAC 123.16Foot Note 16×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 50. 11Eventually, by way of an email dated 5 May 2016, R&T sought the return of the balance sum of US$172,670.56. This was still in relation to the Mount Eastern Matter; there was no mention of SIAC 123. The next day, the Firm replied with an email containing a breakdown of the funds used for the Mount Eastern Matter. The Firm’s breakdown suggested that the balance sum ought to be S$71,364.58 instead of US$172,670.56.17Foot Note 17×Second Affidavit of Zhu Xiao Dong (19 December 2016) at p 168. 12Thereafter, on 9 May 2016, R&T emailed the Firm seeking an itemised breakdown of the Firm’s charges for the Disputed Invoices and the 123 Award Enforcement Proceedings. This led to a series of correspondences culminating in the bringing of this application, OS 931/2016, on 14 September 2016. 13I pause to make the observation that since the Firm was handling a number of files or matters for the Client, it is apparent that invoices and requests for deposits were made for all the different files and matters (SIAC 123, SIAC 200 and SIAC 223). Whilst it is unclear whether a separate client account was opened in respect of each file or matter, it stands to reason (barring some contrary agreement) that sums provided as deposit for a particular file should only be used for the costs and disbursements for that very file. Further, work done for one particular file should be charged (accounted) to the client in respect of that file. If the position was otherwise, it is not difficult to imagine the confusion that may arise. In making this comment by way of general observation, I say nothing about any right of set-off that a law firm may possess. I note also that this point was not addressed or raised by the parties. 14Whilst the present dispute before this court concerns invoices rendered for the 123 Award Enforcement Proceedings, I note that the Client’s current solicitors, R&T, were not engaged to conduct an “audit” of the invoices that were rendered by the Firm. Instead, R&T was engaged to represent the Client in respect of the Invoice 97 taxation application brought by the Firm (see [9] above). It was during the collation of the records on the various payments to the Firm that the Client started to have concerns over the invoices and sums paid for the 123 Award Enforcement Proceedings.",
        "Dramatis personae": "15The key individuals in this dispute are the following: (a) Mr Zhu Xiao Dong (“Mr Zhu”), who is from the People’s Republic of China, is the Client’s Deputy General Manager. Mr Zhu is the Client’s main representative in charge of the conduct of SIAC 123, including liaising with the Firm and dealing with the invoices raised by the Firm.18Foot Note 18×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 7.Mr Zhu joined the Client in 2009 and was based in the Singapore office from 2009 to 2014. Mr Zhu relocated to the Client’s Shanghai Office in July 2014 but still works out of the Singapore office for about a week every two months or so. The evidence is that Mr Zhu was responsible for the trade(s) that were the subject-matter of the SIAC 123 arbitration. Although Mr Zhu was experienced in his line of work,19Foot Note 19×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 2.he was unfamiliar with the Singapore legal system and the practices of international arbitration. Indeed, SIAC 123 was his first experience with litigation and the legal system in Singapore, and the Firm was the first law firm in Singapore that he had worked closely with. Due to his inexperience, Mr Zhu asserts that he left the running of SIAC 123 to the Firm and would stand guided by the Firm’s recommendations. Mr Zhu also takes the position that he was never informed of the Client’s right to send the bills for taxation.20Foot Note 20×First Affidavit of Zhu Xiao Dong (14 September 2016) at paras 8–9 and 25. (b) Mr Gabriel Wang Kaiyang (“Mr Wang”) is a former private banker who joined the Client in April 2011 as the special assistant to the Client’s Chairman. Mr Wang was also a director of the Client at the relevant time. Mr Wang was one of the Client’s bank signatories and signed the cheques that were issued in respect of the Disputed Invoices. Mr Wang conducted internal investigations of the Disputed Invoices between March and April 2016. That said, it is apparent that unlike Mr Zhu, Mr Wang did not personally handle SIAC 123 or the 123 Award Enforcement Proceedings. (c) Ms Jessica Cao Ye (“Ms Cao”), the Client’s assistant finance manager from December 2014 to April 2016.21Foot Note 21×First Affidavit of Cao Ye (19 December 2016) at para 1.Ms Cao provided two affidavits but was not cross-examined before me (see below at [16]). (d) Mr Peter Gabriel (“Mr Gabriel”), the Managing Director of the Firm.22Foot Note 22×First Affidavit of Peter Gabriel (30 June 2017) at para 1.Mr Gabriel acted for the Client in SIAC 123 and its related proceedings before the Singapore courts. (e) Mr Nandwani Manoj Prakash, a director with the Firm.23Foot Note 23×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 1. 16Whilst this application was commenced by originating summons, leave was granted to the parties to cross-examine Mr Zhu (for the Client) and Mr Wang (for the Client), as well as Mr Gabriel (for the Firm). The cross examination was, however, to be limited to Invoice 86 and the circumstances surrounding an alleged oral agreement between the parties concerning payment and deduction of S$300,000 by way of a final payment for work done in connection with the 123 Award.",
        "The general relationship between the Client and the Firm": "17The evidence is that sometime in late 2009 the Client decided to appoint the Firm in place of another firm of solicitors to act for it in connection with SIAC 123. No formal letter of engagement, however, was signed or in evidence.  There is also no evidence that the Firm provided the Client with information on its charge rate or cost estimates.24Foot Note 24×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 10.Mr Zhu was the Client’s representative who instructed the Firm on matters relating to SIAC 123. It is apparent that the decision to engage the Firm was taken by the Chairman of the Client.25Foot Note 25×NOE 8 February 2018 at p 86 (line 27–29). 18Mr Zhu did give instructions to the Firm on issues arising in SIAC 123. These included issues in relation to the invoices raised by the Firm.26Foot Note 26×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 7.That said, whilst the evidence could have been clearer, it appears that when invoices were presented to Mr Zhu, he would simply pass these to the Client’s accounting department for processing, approval and payment.27Foot Note 27×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 25.Whilst Mr Zhu’s evidence is that he left the matter of the Firm’s fees or rate of fees to the Client (the Chairman and accounts department) it is apparent (for reasons set out immediately below) that Mr Zhu was not unconcerned or disinterested in the Firm’s fees. 19The gist of Mr Wang’s evidence was that the question of fees for work done by solicitors was something that was decided by the Chairman possibly with inputs from the trader whose trade was the subject matter of the litigation. Mr Wang’s evidence was that whilst he signed on the invoices (as placed before him by the accounts department) this was purely as an administrative matter and did not mean that he was personally approving the sum actually charged. He also stated that that he was not responsible for approving legal fees charged; in any case, he was not Mr Zhu’s supervisor. I also note Mr Wang’s evidence that the trader had an interest in the cost of the legal fees because the cost of litigation would be a factor in determining the trader’s discretionary bonus.28Foot Note 28×NOE 8 February 2018 at pp 87 (line 16) – 93 (line 18).However, it was unclear from the evidence how much influence (if any) the individual trader actually had over the position that the Client took on the fees of a law firm in respect of work done in a dispute arising out of a trade that he was responsible for. 20What is clear is that over the course of several years and several different matters on which the Firm was instructed by the Client, the Firm was accustomed to asking for deposits for costs and disbursements that were expected to be incurred. Sometimes, a general indication of the type of disbursements that were likely to be incurred (such as overseas travel in connection with the matter) might be provided. In other cases, it appears that there would be no indication at all as to the general nature of the costs and disbursements to which the deposit would be applied. In addition, it appears that the Firm would, from time to time, issue particular invoices seeking specific sums in respect of various items of work that had been performed. The evidence is that once the Firm sent Mr Zhu a request for a deposit or an invoice, Mr Zhu would pass the same to the Client’s accounting department for processing and approval. The accounting department would then prepare payment vouchers against the documents to be signed by Mr Wang. So long as the payment vouchers and documents were regular on their face, Mr Wang would sign the cheques.29Foot Note 29×NOE 8 February 2018 at pp 94 (lines 10–16, 19–27) and 95 (lines 1–5, 10–27). 21There is no evidence before the court that any of the Client’s officers made a “positive” decision at the time when cheques were issued as to whether the fees charged by the Firm for any piece of work were reasonable and proper or were, on the contrary, objectionable as being excessive or without basis. Mr Zhu’s evidence is that whilst he was aware of the invoices (after all, he passed them to the accounting department for processing) he did not challenge or query the amount charged and generally assumed that the Firm would be charging fairly. 22On the evidence before me, it appears that it was only when Invoice 97 for the Mount Eastern Matter was raised in January 2016 (see [9] above) that frictions started to surface. Initially these were concerned with the invoices and accounts for work done for the Mount Eastern Matter. As noted, it was during this exercise that the Client realised there were issues with the Disputed Invoices in respect of the 123 Award Enforcement Proceedings. The end result is the present application before this court.",
        "The relief sought": "23Section 122 of the LPA provides that “[a]fter the expiration of 12 months from the delivery of a bill of costs, or after payment of the bill, no order shall be made for taxation of a solicitor’s bill of costs, except upon notice to the solicitor and under special circumstances to be proved to the satisfaction of the court.” 24The Client first seeks a declaration that it is not liable to pay the Disputed Invoices, as the Disputed Invoices are not proper bills within the meaning of s 122 of the LPA. 25It is only in its alternative case that the Client seeks an order for the Disputed Invoices to be taxed.",
        "Applicable law": "",
        "Meaning of a proper bill": "26Section 118(1) of the LPA provides that no solicitor shall, except by leave of the court, commence or maintain any action for the recovery of any costs due until the expiration of one month after delivery of a bill of those costs. Section 118(3) goes on to state that where a bill of costs is proved to have been delivered in compliance with s 118(1), it is not necessary in the first instance for the solicitor to prove the contents of the bill and that it shall be presumed until the contrary is shown to be a bill bona fide complying with the LPA. 27I pause to observe that although the bill of costs contemplated under s 118 of the LPA is a “final bill” and not a “bill of account”, the common law right of a solicitor to deliver an interim bill of costs following a natural break in the work carried out, or pursuant to an agreement, is not inconsistent with this section: Tan Yock Lin,The Law of Advocates and Solicitors in Singapore and West Malaysia(Butterworths, 2nd Ed, 1998) (“The Law of Advocates and Solicitors”)at p 697. 28In the present case, the dispute concerns six invoices with the Firm taking the position that the sixth invoice was the final bill for all the work done in respect of the 123 Award Enforcement Proceedings. The Firm asserts that some the previous invoices were akin to interim bills in that the Firm reserved the right to deliver a subsequent bill for disbursements that had been omitted. It says this in relation to Invoice 15,30Foot Note 30×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 34; Respondent’s Written Submissions (4 April 2018) at para 97.and 54.31Foot Note 31×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 64; Respondent’s Written Submissions (4 April 2018) at para 108.The latter invoice is expressly headed “(Interim) Tax Invoice” and states that it was for part payment of service charges incurred for,inter alia, meetings with English solicitors over stated periods. Section 2 of the LPA provides that “‘costs’ includes fees, charges, disbursements, expenses and remuneration”. It follows that a bill for disbursements or a request for a deposit to meet future disbursements is also a bill or request in respect of costs. 29In the present case, the Client seeks a declaration that the Disputed Invoices are not proper bills in circumstances where (i) it has already paid in full on some of the invoices; and (ii) the amounts due under some of the invoices were satisfied by the Firm making deductions against the Client’s funds held by the Firm. 30It is convenient to deal first with the issue of what constitutes a proper bill under the LPA before touching on matters relating to the fact of payment and/or satisfaction by deduction. A client who disputes the validity of the bill must seek a declaration that the bill is not a proper bill under the LPA. This is important since a dispute over the validity of a Bill is different from an application for taxation. As will be seen (infra[35]), once a client applies for taxation of a Bill, it will be too late to challenge the validity of the Bill as such. 31The procedure for taxation of costs is governed by O 59 r 20 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed), which requires a party entitled to require any costs to be taxed to begin the proceedings by filing the bill of costs at the Registry within the applicable time limit. The form of the bill of costs is dealt with by O 59 r 24, which provides that the bill must set out: (i) the work done in the cause or matter, (ii) the work done for and in the taxation of costs; and (iii) all disbursements. O 59 r 24(2) states that the costs claimed for all work done in the cause or matter must be indicated as one global sum, whereas for disbursements, the sum claimed for each item is to be set out.  Appendix 1 to O 59, which deals with costs on taxation, requires that the bill of costs must set out sufficient information to enable the Registrar to have regard to the matters set out in the rule, including the complexity and difficulty of the matter, the skill required, the number and importance of the documents, and the urgency of the matter to the client. 32Singapore Civil Procedure 2018, Vol 1 (Foo Chee Hock gen ed) (Sweet & Maxwell, 2018) (“Singapore Civil Procedure”) at para 59/24/1states that the form of the bill of costs must also comply with the applicable practice directions and that failure to do so amounts to non-compliance with the Rules of Court and may result in rejection of the bill. 33I note, however, that O 59 of the Rules of Court applies to billsdrawn for taxation, and that the Rules of Court do not address the requirements applicable to bills which are not drawn for taxation (seeHo Cheng Lay v Low Yong Sen[2009] 3 SLR(R) 206 (“Ho Cheng Lay”) at [13]). Nevertheless, the requirements in O 59 shed light on what solicitor-and-client bills, even if not drawn for taxation, should contain. In this regard, it is worth noting the following observations inSingapore Civil Procedureat para 59/24/2: A lawyer owes a duty to his client to draw up his (commercial) bill clearly and accurately and with such attention to detail as he would do in undertaking any work on behalf of his client 34One might also note the comments inThe Law of Advocates and Solicitors in Singapore and West Malaysiaat p 699, where, citingCook vGillard(1852) 1 E & B 26 (“Cook v Gillard”), it is stated that the degree of itemization required of a bill of costs is a question of degree,  but the general question is whether from the point of view of the client, the client is able to ascertain by perusing the bill what business was done for him and whether the charges wereprima faciereasonable.) 35InHo Cheng Lay,the plaintiff brought an application for certain bills to be taxed. However, in the course of submissions before Kan Ting Chiu J,  the plaintiff’s solicitor sought to introduce an argument that his client was not liable to pay the disputed bills, as they were not proper bills under s 122 (at [10]). Kan J found that the plaintiff could not take this point after making an application for taxationalone, because by making such an application, the plaintiff had acknowledged that therewerebills to be taxed (at [11]). Instead, the court considered the lack of detail in the bills which the plaintiff complained of as a factor in deciding whether to send the bill for taxation. Following the English Court of Appeal inRalph Hume Garry (a firm) v Gwillim[2003] 1 WLR 510 (“Garry”), Kan J found that the skeletal bills that were presented by the defendant solicitor to the plaintiff fell short of the standard that was required. 36InGarry, Ward LJlaid down the following principles to be applied in deciding whether a proper bill had been presented (at [32]): (1) The legislative intention was that the client should have sufficient material on the face of the bill as to the nature of the charges to enable him to obtain advice as to taxation. The need for advice was to be able to judge the reasonableness of the charges and the risks of having to pay the costs of taxation if less than one-sixth of the amount was taxed off. (2) That rule was, however, subject to these caveats: (a)precise exactness of form was not requiredand the rule was not that another solicitor should be able on looking at the bill,and without any further explanation from the client, see on the face of the bill all information requisite to enable him to say if the charges were reasonable; (b) thusthe client must show that further information which he really and practically wanted in order to decide whether to insist on taxation had been withheld and that he was not already in possession of all the information that he could reasonably want for consulting on taxation. (3) The test, it seems to me, is thus,notwhether the bill on its face is objectively sufficient, but whether the information in the billsupplemented by what is subjectively known to the clientenables the client with advice to take an informed decision whether or not to exercise the only rightthenopen to him, viz, to seek taxation reasonably free from the risk of having to pay the costs of that taxation. (4) A balance has to be struck between the need, on the one hand, to protect the client and for the bill, together with what he knows,to give him sufficient information to judge whether he has been overchargedand, on the other hand, toprotect the solicitor against late ambushbeing laid on a technical point by a client who seeks only to evade paying his debt. [emphasis in original in italics, emphasis added in bold italics] 37Flowing from these principles, Ward LJ concluded that whether a solicitor’s bill is sufficiently particularised as to be a proper bill complying with the UK Solicitors Act 1974 (c 47) (UK) (“the 1974 UK Act”) “will vary from case to case” (at [70]) The client can show that the bill is not proper if the bill does not have a “sufficient narrative” to allow the client to identify what he is being charged for, and if “[the client] does not have sufficient knowledge from other documents in his possession or from what he has been told reasonably to take advice whether or not to apply for that bill to be taxed”. Ward LJ added (at [70]): The sufficiency of the narrative and the sufficiency of [the client’s] knowledge will vary from case to case, and the more he knows, the less the bill may need to spell it out for him. The interests of justice require that the balance be truck between protection of the client’s right to seek taxation and of the solicitor’s right to recover not being defeated by opportunistic resort to technicality. 38The decision inGarryconcerned the question of whether a solicitor’s bill is “a billbona fidecomplying with [the 1974 UK Act]” within the meaning of s 69 of that statute, which is the English equivalent of s 118(3) of the LPA. Although the case concerned a different statutory provision, its statement of the level of particularisation and itemisation required of a solicitor’s bill has been accepted by our courts in the context of s 122 of the LPA (seeHo Cheng Lay([33]supra) at [16],Sports Connection Pte Ltd v Asia Law Corp and another[2010] 4 SLR 590 (“Sports Connection”) at [42] andKosui Singapore Pte Ltd v Thangavelu[2015] 5 SLR 722 at [89]). 39These then are the principles this court will apply when deciding whether the Disputed Invoices are “proper” bills under the LPA.",
        "“Special circumstances” under s 122 of the LPA": "40In the event that this court finds that the Disputed Invoices are proper bills under the LPA, the question that arises is whether the Client is entitled to have the bills sent for taxation under s 120. 41The difficulty the Client faces is that there are two disqualifying events under s 122 of the LPA. The first disqualifying event is the expiration of 12 months from the delivery of a bill of costs (“the time limit disqualification”). The second disqualifying event is the payment of a bill of costs (“the payment disqualification”). If either one or both of these disqualifying events have occurred, the court must be satisfied that there are special circumstances justifying an order for taxation before it can make an order for the bill of costs to be taxed. 42Leaving aside the time-limit disqualification, it is noted that a question has also arisen as to whether the payment disqualification is applicable. The payment disqualification is based on (i) payment by the Client of certain invoices by cheques; and (ii) deduction by the Firm of certain amounts from monies held in the Firm’s client account by way of deposit and/or from the proceeds of the 123 Award. 43The Client’s claims that it had been requested on two occasions to provide deposits: (i) S$50,000 in January 2014 and (ii) S$100,000 in January 2015. Leaving aside the details (which will be gone into later), on both occasions, the Client was basically asked to pay these sums to meet disbursements and costs that may be incurred. As will be seen, in both cases, the Firm subsequently made deductions against the deposits held in the client account without first raising invoices or bills or seeking the Client’s specific consent to the deductions. 44The Client’s position was that it was not aware of the specific deductions at the time when they were made. It was only later (in some cases very much later) that they were provided with accounts, in the sense of invoices, to explain how the funds had been used. The Client alleges that it was never asked if it consented, and that it did not consent, to the Firm making deductions from its moneys held in the Firm’s client account in this manner. 45In addition, on one occasion the Firm also deducted or retained the sum of S$300,000 from the 123 Award monies which they had received from Metalloyd in the SIAC 123 arbitration. Once again, leaving aside the details, which are disputed, the Client’s basic position is that this deduction was improper and done without their consent. Accordingly, it is argued that they did not “pay” this amount so as to trigger the payment disqualification under s 122. 46It is convenient to examine in detail the legal principles regarding what amounts to payment later, in connection with the relevant invoices. That said, I make the following observation at the outset: It appears that law firms frequently require clients to place deposits to be held in the firm’s client account against that firm’s fees and disbursements. Thereafter, specific sums are deducted or set-off against the deposits as and when bills or invoices are issued to the client. Under the applicable legal professional rules (which will be examined later) the law firm must raise a bill of costs with the client prior to making the deduction. In short, the client’s consent is needed if monies held in the client account are used. 47For example, inKosui([38]supra), a total of eight bills were paid by deductions from the client’s deposit held by the law firm. Whilst there was a dispute as to whether the law firm had obtained the client’s approval to make the deduction for the last bill, it was common ground that, for the purposes of the application for leave to tax, all the bills were to be treated as having been paid (seeKosuiat [20]). The court inKosuidid not have to consider the question of what constitutes payment by the client such as to trigger the payment disqualification. In the case at hand, however, it is not common ground that all the bills were paid by the Client. Instead, as will be examined in more detail later, the Client’s basic position is that many of the “payments” were unilateral deductions made without its consent. 48There is no strict rule as to what constitutes special circumstances within the meaning of s 122 of the LPA. It is for the court to decide on the facts of every case whether there are special circumstances which make it right to refer the solicitor’s bill for taxation (Kosuiat [61]). As summarised by the court inKosuiat [61], some of the instances in which special circumstances justifying taxation were proven include: (a) Prolonged negotiation over fees between solicitor and client after which the client applies for taxation (seeWee Harry Lee v Haw Par Brothers International Ltd[1979–1980] SLR(R) 603 at [14]). (b) A disciplinary committee’s finding that the solicitor has in fact overcharged (seeHo Cheng Lay([26]supra) at [5]). (c) An impecunious client who requires time to secure a grant of legal aid in order to apply under s 120 of the LPA for an order of taxation of a delivered bill of costs (seeHo Cheng Layat [6]). (d) A bill which fails to provide sufficient information, even when supplemented by what is subjectively known to the client, to enable the client to take an informed decision on whether to seek taxation (seeHo Cheng Layat [17]). (e) The fact that the solicitor, without his client’s knowledge or consent, appropriated funds belonging in equity to the client in order to pay the bill (seeHo Cheng Layat [23]). (f) Duress, pressure or fraud by the solicitor (seeSports Connection, ([38]supra) at [35], citingIn re Hirst & Capes[1908] 1 KB 982 at 996. 49The list of special circumstances set out above is not exhaustive. As helpfully explained by Vinodh Coomaraswamy J inKosuiat [62]–[63], what counts as special circumstances in any given case will depend on how the facts in that case justify referring the bill to taxation even though one or both of the disqualifying events under s 122 has already set in: 62 … More importantly, special circumstances in any given case cannot be asserted or proved in a vacuum but must,in some rational way, address thefundamental questionwhich s 122 poses:Why is it right to refer the solicitor’s bill for taxation even though the client has allowed one or both of the disqualifying events under s 122 to be triggered? 63One of the waysin which a client can answer this fundamental question is by showinghow the special circumstances explain and excuse his conduct in allowing the disqualifying event to set in. How the special circumstances do that will, to a large extent, depend on theparticulardisqualifying event which is in play. That is becauseeach disqualifying event serves a distinct underlying purpose. [emphasis added] 50What is worth noting from this passage is the principle that each disqualifying event serves a distinct underlying purpose, and that the facts cited as “special circumstances” must, “in some rational way”, excuse the applicant’s conduct in allowing that disqualifying event to set in. 51The requirement that the client apply for taxation within 12 months of the bill’s delivery serves the same purpose as a limitation period (Kosuiat [64]). In other words, it is intended to “prevent stale claims, to relieve a potential defendant of the uncertainty of a potential claim against [him] and to remove the injustice of increasing difficulties of proof as time goes by” (Kosuiat [64], citingTeh Siew Hua v Tan Kim Chiong[2010] 4 SLR 123 at [25]perSteven Chong J (as he then was), citing Mummery LJ inRidgeway Motors (Isleworth) Ltd v ALTS Ltd[2005] 1 WLR 2871 at [31]). 52As for the requirement that the client should apply to tax the bill before he pays it, this serves to discourage the client from approbating and reprobating and upholds the solicitor’s interest in security of receipt for his fees (Kosuiat [64]). 53Thus, inKosui(at [65]), Coomaraswamy J gave the example of a client who does not pay his solicitor’s bill but allows the 12-month period to elapse. In this example, the client is likely able to satisfy the court that it is right to refer the bill to taxation if he can show that he failed to apply in time because he was engaged in prolonged negotiations with the solicitor over the bill. In contrast, if a client pays his solicitor’s bill and then applies to tax it within the 12-month period, it would be immaterial for the client to show that he paid the bill after a period of prolonged negotiations with the solicitor. This is because those negotiations do not explain the relevant disqualifying event: that the bill has been paid. The client must instead show special circumstances excusing his decision to pay the bill. As earlier stated (Kosui at[64]), there must be a rational connection between the special circumstances and the disqualifying event which is in play. Coomaraswamy J also held that if both disqualifying events are in play, then the special circumstances advanced must have a rational connection to both events (Kosuiat [65]). 54At the same time, it must be recognised that taxation proceedings serve a very limited and distinct purpose. According toThe Law of Advocates and Solicitors( [27]supra) at pp 708–709: Taxation of costs is simply the ascertainment by an officer of the court, the taxing master, of the proper remuneration of a solicitor for business transacted. ‘[It] is … a quantification machinery by means of which the recoverable amount of costs, disbursements, expenses, etc is ascertained.’ For those purposes, the taxing master has incidental jurisdiction to take an account of such sums of money as may have been paid or duly appropriated towards satisfaction of the bill of costs; but he has no jurisdiction to order an account of dealings and pecuniary matters unconnected with the bill to be taxed. This is consistent with what the Court of Three Judges had to say about taxation proceedings inLaw Society of Singapore vAndre Ravindran Saravanapavan Arul[2011] 4 SLR 1184 (“Andre Ravindran”) at [32]: that “[t]axation provides the best means for an aggrieved clientto determine what the proper fee is for the actual work done by his lawyer” [emphasis added]. 55Taxation by the court accordingly provides a conclusive and objective method of determining what fees the solicitor is entitled to. Further, inAndre Ravindran, it was noted that all solicitors should act on the basis that they can have their bill of costs taxed and they must remember that many clients do not know this (at [33]). For this reason, the court warned that solicitors have an obligation to inform their clients of this option and they fail or omit to do so at their peril. 56Thus where a client is unhappy with the bill of costs that he has been presented with, for example, because of the amount charged or because of suspicion that unnecessary work was performed, the best course of action and, indeed, the first port of call, should be to have the bill of costs taxed. The amount of fees awarded after taxation would then enable the Law Society to assess if the overcharging was such as to merit investigation. 57Further, as stated inKosui([38]supra)at [57], a well-founded complaint of overcharging lodged with the Law Society undoubtedly carries serious disciplinary and reputational consequences for a solicitor, but the Law Society disciplinary procedure does not serve the goal of rectifying the consequences of overcharging for the client. Only taxation under s 120 of the LPA can yield for the client a refund or a remission of overcharged fees. 58Before I turn to consider each of the Disputed Invoices in detail, I underscore some points on “special circumstances” in respect of: (i) the scenarios under which a dispute may arise between a solicitor and client over monies held by the solicitor for the client and fees due to the solicitor; (ii) allegations of overcharging; (iii) breach of the legal professional rules; and (iv) making an improper deduction from a client’s account. Disputes over deposits, client’s monies and fees 59The circumstances under which a dispute can arise between a client and his solicitor regarding deposits and monies in the client’s account are varied. Not all disputes are amenable to be “solved” by means of taxation of a bill of costs. In the first place, the dispute over monies may not be a dispute over a bill of costs. Where a solicitor wrongly retains monies belonging to a client (for example, where the solicitor wrongly retains the fruits of successful litigation or the proceeds from the sale of a property) the claim may lie in breach of fiduciary duty, or monies had and received. If the solicitor’s defence is that he is owed costs for fees and disbursements, as a result of which he claims some right to deduct the appropriate sum from the client’s monies held by the firm under some principle of set-off or agreement, it does not seem that an application to have the bill of costs taxed is the appropriate course of action as such (at least not on its own). 60The existence of a right to deduct or set-off the solicitor’s claim against the client’s monies is not a matter that can be properly addressed by taxationper sebefore the Registrar. It seems to me that in such a situation the proper course of action is to (i) establish the existence of a right of deduction or set-off; and (ii) apply for taxation of the bill of costs to establish what are the appropriate fees which the lawyer can claim. 61Indeed, I observe that making unilateral deductions from a client’s account without first raising a bill or otherwise obtaining consent from the client may be a breach of legal professional rules of conduct. For example, the client may have transferred large sums to the solicitor by way of deposit for future expenses and disbursements in connection with the case being handled by the solicitor. If a solicitor makes deduction against the deposit without issuing any bill of costs to the client, whether at the time of the deduction or thereafter, then as noted previously, it seems there is no bill of costs to be sent for taxation as such. Other forms of legal proceedings may have to be considered in such a scenario. Allegations of overcharging 62Reference has already been made to the issue of whether the court can have regard to allegations of overcharging. Whilst it is rightly said that taxation provides the best way of determining what the solicitor is entitled to claim as fees, overcharging is a matter that is best raised and addressed prior to payment and/or expiration of the 12-month period under s 122. Once a disqualification event has set in, it cannot be assumed that the law should lean in favour of granting leave where overcharging is raised. In some cases, the allegation may be nothing more than a bare complaint or an expression of regret for having paid a fee now felt to be on the “high side.” When a client alleges “overcharging” against his lawyer, it should be borne in mind that legal fees charged for work can and will vary between lawyers and firms. Viewing the issue through the lens of reasonableness, it is likely that there will always be a band of reasonableness into which a fee will fit. Just because the client feels he has paid on the high side does not necessarily mean that he has been overcharged. Indeed, as pointed out inAndre Ravindran([54]supra) at [32]–[33], where a client takes the view that there is overcharging, the bill should be taxed by the court first before a complaint is made to the Law Society. 63That said, the court hearing an application for leave to have bills taxed after payment or expiration of the 12-month period may find that it is in an awkward position. Taxation, to be sure, provides the most objective method of determining what is the reasonable fee that the lawyer is entitled to for the work in question. But if a bare allegation of “overcharging” constitutes special circumstances justifying the grant of leave to tax a bill that has already been paid, or in respect of which the 12-month period has expired, the statutory disqualifications will have little meaning as they will be readily bypassed. It follows that care must be taken where a client seeks to dispute the reasonableness of the bill after one of the disqualifying events has set in. Merely to make a general assertion that the bill of costs is unreasonable or unfair will not ordinarily be sufficient. Breach of legal professional rules 64It is clear from theKosuicase ([38]supra) that there is a sharp distinction between the procedure for resolving a complaint of professional misconduct and the procedure for resolving a fee dispute. For example, just because the lawyer was guilty of some professional misconduct (such as misapplication of client’s deposit against fees) does not mean that the fees were excessive or unreasonable. Indeed, asKosui’scase points out, a client who accepts the fee is reasonable but is objecting to the misapplication of the client deposit is unlikely to establish special circumstances. As Coomaraswamy J states(at [66]), in such a situation, the special circumstance advanced has nothing to do with the object of taxation. 65On the other hand, if the client’s case is that he had been deceived by the lawyer into paying the bill because he had been told the work was done by a senior lawyer with specialist knowledge of the area of dispute when in factallthe work was done by an unsupervised junior lawyer with only 1-year post-qualification experience, such a client may well be able to establish special circumstances. Quite apart from professional misconduct, in such a scenario, the rationale of applying the disqualification to discourage the client from approbating and reprobating will likely rapidly fade away. Misapplying client’s deposit against fees 66What I have said thus far should not be taken to mean that rules of professional conduct may never be relevant to the consideration of special circumstances under s 122 of the LPA. Consider r 7(1)(a)(iv) of the Legal Profession (Solicitors’ Accounts) Rules (Cap 161, R 8, 1999 Rev Ed) (“LP(SA)R”). That rule provides that once a client’s money is in a firm’s client account, it can be withdrawn to pay the solicitor’s costs where a bill of costs or other written intimation of the amount of costs incurred has been delivered to the client and the client has been notified that the money held for him in the client account will be used to pay such costs. 67The point of r 7(1)(a)(iv) is that the client ought to be notified of how the money he deposits with his solicitor is being put to use by his solicitorbeforethe solicitor actually puts that money to use. The first point of overlap with s 122 of the LPA is, obviously, that when such a bill of costs is delivered to the client, the 12-month limitation period under s 122 begins counting. The other point of overlap concerns the issue of when, if ever, a bill of costs can be said to be paid by the client where it is the solicitor who, in order to satisfy his costs, draws down on the initial deposit that the client pays to account. 68InHo Cheng Lay([33]supra), Kan J held that payment under s 122 of the LPA must be an act of the paying party. The paying party can make direct payment of the costs after receiving the bill. He can also agree that the solicitor pay himself out of funds that the solicitor is holding for him (Ho Cheng Layat [18]). But inHo Cheng Lay, since the solicitor’s deductions from the sale proceeds to satisfy his bills were madewithoutthe client’s agreement and consent, Kan J found that the bills werenotpaid within the meaning of s 122 (at [23]). 69It follows that a client can be said to have paid a bill of costs where a solicitor draws down on the client’s money in accordance with the procedure envisaged under r 7(1)(a)(iv) of the LP(SA)R –ie, having obtained the client’s consent. Indeed, the emphasis on client’s consent to payment is also seen from r 7(1)(a)(iii) of the LP(SA)R, which permits drawdowns on a client account of “money drawn on the client’s authority”. 70Conversely, if the solicitor does not follow the procedure envisaged under r 7(1)(a)(iv) of the LP(SA)R, unless the solicitor can show through some other means that the client is aware and has consented to the payment of that particular bill of costs from the monies held by the solicitor on account, it is unlikely that the client can be said to havepaidthat particular bill.  In such a case, the solicitor will also have breached the LP(SA)R by deducting from the client’s account without first raising a bill or otherwise informing the client of the deduction or obtaining his consent. But as noted (see [64] above), the question on taxation remains whether the fees deducted were, in any case, reasonable. The fact that the solicitor may have breached the professional rules by making the unilateral deduction will not, in itself, justify referring a bill for taxation if the fees have been accepted as reasonable.",
        "The Disputed Invoices": "",
        "The 15 January Invoice": "71After the 123 Award was issued on 2 January 2014, discussions over the question of enforcement soon took place between the Client and the Firm. On 15 January 2014, Mr Zhu met with Mr Gabriel to discuss enforcement options.32Foot Note 32×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 13; First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 17.Following this meeting with Mr Gabriel, the Client agreed to enforce the 123 Award in both Singapore and England.33Foot Note 33×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 13.The Firm then sent the Client an email, dated 15 January 2014, confirming that the Client will pay a deposit of S$50,000.00 “towards initial cost [sic]and disbursements.” 72There is some dispute over whether this email is a bill that is capable of being taxed.34Foot Note 34×Respondent’s Written Submissions (4 April 2018) at para 90.I shall return to this point shortly. The next day, the Client deposited S$50,000 in the Firm’s client account by a cheque dated 16 January 2014.35Foot Note 35×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 19; First Affidavit of Zhu Xiao Dong (14 September 2016) at para 29 andp 73. 73After the S$50,000 was deposited on 16 January 2014, it appears that the Client never got an account from the Firm on how the funds deposited were used. It was only when R&T came into the picture more than two years later, in the midst of the exchange of correspondences between R&T and the Firm, that the Firm provided such an account, by way of a letter dated 23 May 2016.36Foot Note 36×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 22.It was also only through this exercise that the Client realised that a balance of S$14,522.63 of its monies was held by the Firm for over 2 years.37Foot Note 37×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 15. 74For convenience, I reproduce the account provided on 23 May 2016 in respect of the use of this S$50,000 deposit:38Foot Note 38×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 23. Deposit$50,000.00Disbursements:Jackson Parton - £2,500.00S$5,339.50- Bank Commission on TTS$30.00- Bank Telex ChargesS$10.00Mr Gabriel Travel ExpensesS$8,885.80- Accommodation -£101.00S$207.00Jackson Parton - £868.03S$1,759.95- Bank Commission on TTS$30.00- Bank Telex ChargesS$10.00Mr Gabriel Travel ExpensesS$7,679.10Mr Gabriel Travel ExpensesS$9,577.06Mr Gabriel Travel ExpensesS$1,948.96Balance:S$14,522.63       The Firm has since returned to the Client this balance sum on 1 July 2016.39Foot Note 39×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 23. 75Subsequently, when asked for the supporting documents to justify the disbursements from the S$50,000,40Foot Note 40×First Affidavit of Zhu Xiao Dong (14 September 2016) at pp 101–102.the Firm produced the following list of documents by email on 26 July 2016:41Foot Note 41×First Affidavit of Zhu Xiao Dong (14 September 2016) at pp 115–129. (a) four bills from English solicitors in respect of the registration of an arbitration award, for work done between: (i) 1 June 2014 to 31 October 2014, amounting to £3,368.03 (Bill No. 15/243, dated 31 October 2014); (ii) 1 November 2014 to 23 December 2014, amounting to £9,801.79 (Bill No. 15/305, dated 31 December 2014); (iii) 1 January 2015 to 30 January 2015, amounting to £9,440.75 (Bill No. 15/355, dated 30 January 2015); and (iv) 1 February 2015 to 27 February 2015, amounting to £7,089.18 (Bill No. 15/381, dated 27 February 2015). (b) three sets of Singapore-London return flight tickets from: (i) 15 January 2014 to 4 February 2014, amounting to S$8,067.50; (ii) 28 September 2014 to 7 October 2014, amounting to S$8,885.80; and (iii) 5 February 2015 to 19 February 2015, amounting to S$7,679.10. (c) hotel stays from: (i) 25 January 2014 to 29 January 2014, amounting to S$1,509.56; (ii) 5 February 2015 to 7 February 2015, amounting to £259.00; and (iii) 9 February 2015 to 10 February 2015, amounting to £419.00; and (d) a 4 October 2014 restaurant bill from the Hilton London Green Park hotel amounting to £101.00. 76In any event, it appears that up until 26 July 2016, whilst the Client was aware that the 123 Award Enforcement Proceedings would include steps to be taken in the UK and that Mr Gabriel would very likely travel to UK to instruct legal professionals there, the Client was wholly unaware of the details of how the S$50,000 was used (ie, what specific costs or expenses were incurred and what and when the deductions were made against this deposit). 77There is no dispute that the S$50,000 was paid on 16 January 2014 in response to the Firm’s email dated 15 January 2014 requesting for payment of the same “towards initial cost [sic] and disbursements”.42Foot Note 42×First Affidavit of Zhu Xiao Dong (14 September 2016) at paras 27–29.That email specifically referred to a meeting in the morning between Mr Gabriel and Mr Zhu, where it was agreed that Mr Gabriel “would proceed to London to discuss with English solicitors to register the award in London”. The email also noted that the award would also be registered in Singapore. The email continued that “for the purpose of registration it is agreed you will pay S$50,000 towards initial costs and disbursements”. 78Although the Client first seeks a declaration that it is not liable to pay any of the Disputed Invoices (on the grounds that they are not proper invoices), it seems that by the time of its closing submissions, it had taken a different stance at least on the 15 January Invoice.  Its main complaint now is that no account of these funds was provided by the Firm. As a result, the Client says that it had no way of disputing the reasonableness of the costs incurred. It was only in May 2016, when R&T wrote to the Firm asking about this payment, that the Firm provided an account in an email on 23 May 2016 (see [73] above). 79Paradoxically, on its part, the Firm says that the Client had intentionally mischaracterised the 15 January 2014 email as an “invoice” so as to persuade the court that there is a bill capable of being taxed. The Firm argues that this email was merely an email for disbursements and not an invoiceper se.43Foot Note 43×Respondent’s Written Submissions (4 April 2018) at para 90.The Firm also says that the Client was well aware that Mr Gabriel would be travelling to London in or around September to October 2014 to instruct English solicitors in registering the arbitration award. It bases this claim on an email it had sent to the Client on 24 September 2014.44Foot Note 44×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 28.Thus, it says that the Client had made a false allegation that it was not informed of Mr Gabriel’s trip to London. The Firm does not make any submissions on the rest of the disbursements. 80I pause to note thatSingapore Civil Procedurestates (at para 59/24/3) that the ambit of “disbursements” is not defined in the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (nor, indeed, in the LPA). That said, inOng Jane Rebecca v Lim Lie Hoa & Ors[2008] 3 SLR(R) 189 at [11], the High Court held that the word “disbursements” was wide enough to include loans or debts properly incurred by a party for the purposes of the litigation, provided that it is proven that these loans or debts are due and payable and would be paid after taxation. 81Looking at the evidence as a whole, I am of the view that the sum of S$50,000 that the Client then paid to the Firm on 16 January 2014 is what r 2(1) of the LP(SA)R calls “client’s money”, that is, “money held or received by a solicitor on account of a person for whom he is acting (in relation to the holding or receipt of such money) either as a solicitor, or in connection with his practice as a solicitor”. The sum of S$50,000 was basically a deposit to be held in the client account against the Firm’s fees and costs. 82Rule 3(1) of the LP(SA)R mandates that client’s money shall be paid without delay into a client account. The Firm did this.45Foot Note 45×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 23.And as noted, once the money is in the client account, it can be withdrawn to pay the solicitor’s costs only where a bill of costs or other written intimation of the amount of costs incurred has been delivered to the client and the client has been notified that the money held for him in the client account will be used to pay such costs (r 7(1)(a)(iv) of the LP(SA)R). 83It follows that the Firm ought to have issued and delivered a proper bill of costs when it sought to utilise the Client’s funds in the client account for costs and disbursements. The 15 January Invoice is not properly a bill of costs; it is merely a friendly reminder by email to pay an agreed sum as a deposit. 84The Firm had only been just briefed in January 2014 on the enforcement matters. The costs had not yet been incurred (although they clearly would be in the near future). The amount of costs and disbursements was unknown at that stage. The S$50,0000 was paid into the Firm’s client account and ordinarily would have been drawn down subsequently against proper bills/invoices raised by the Firm. 85The problem, however, is that after the Client deposited the S$50,000 with the Firm, it never got an account or other notice of the costs or disbursements to which this deposit was put to use until R&T wrote to the Firm more than two years later. The Client may have been aware that a portion of the S$50,000 put into the client account would be used to cover travel to the UK to engage solicitors. But it would not have any inkling of the amount of costs and disbursements that were going to be claimed for this. 86For example, suppose that in a similar (but hypothetical) case, a solicitor had withdrawn the bulk of the funds represented by a S$50,000 deposit to reimburse himself for first class air travel to and from London such as to exhaust the deposit. If the client is not informed of this expenditure, he would not have been in the position to challenge the expense as being unreasonable and excessive. The fact that the client may have been generally aware that the solicitor was going to visit legal professionals in the UK to consult on the matter does not mean that he has consented to the expenditure in question in the example that I have set out. 87Returning to the case before me, the Firm then adduced supporting documents to justify its disbursements from the deposit. In the case of travelling expenses to London, I note that Mr Gabriel made three trips over the following periods: (i) 15 January 2014 to 4 February 2014; (ii) 28 September 2014 to 7 October 2014; and (iii) 5 February 2015 to 19 February 2015 (see [75(b)] above). 88Whilst it is clear that Mr Zhu knew that trips to the UK would take place, it appears that he did not receive any specific information on the trips aside from being told of the trip to London in or around September to October 2014.  The email of 24 September 2014, by which the Firm had informed the Client that Mr Gabriel would be travelling to London in or around September to October 2014, is not a bill of costs. It merely informed the Client of the impending trip but did not provide any breakdown of the costs that were or would be incurred on this trip. 89As noted previously (at [68] above), payment under s 122 of the LPA concerns the act of the paying party. A client can either (i) make a direct payment of the costs after receiving the bill; or (ii) agree that the solicitor can pay himself out of the funds that the solicitor is holding for him.  Where monies are deducted unilaterally from monies held by a solicitor for a client to meet the costs or disbursements of the solicitor, such a deduction will not ordinarily constitute payment by the client under the LPA. 90Whilst Mr Zhu was aware that the S$50,000 would be used to meet the costs and expenses of registering the 123 Award in Singapore and the UK, the Client was never told or provided with a bill of costs in respect of how the S$50,000 had, in fact, been used. I note also that there is no suggestion (nor indeed any basis for a suggestion) that when the Client provided the S$50,000 deposit, it had agreed with the Firm or had otherwise given a general approval to the Firm to make unilateral deductions from the deposit to meet particular items of expenditure, without any need to raise a bill or obtain the Client’s consent. 91On the material before me, the only time that a bill of costs (or invoice) was issued in respect of this S$50,000 was on 23 May 2016, when the Firm eventually provided to R&T a breakdown of the costs and disbursements paid out of the initial deposit of S$50,000. It is not clear on the evidence whether this was also the date on which the bill of costs was delivered to the Client. By this time the Client was questioning the invoices through its new law firm. 92Accordingly, I find that there was no payment of any bills of costs here. I note also that the 12-month time bar does not apply becausethe only bill that was issued in respect of the S$50,000 deposit was the bill dated 23 May 2016, which evidenced the particular uses to which the initial deposit of S$50,000 was put to by the Firm. Based on this date, the 12-month period would not have expired since the present application, OS 931/2016, was brought by the Client on 14 September 2016 (see [12] above). 93I accordingly need not consider whether special circumstances arose within the meaning of s 122. 94In the event I am wrong, I make clear that in any case, even if the payment of S$50,000 to cover costs and expenses incurred for the 123 Award Enforcement Proceedings carried with it the Client’s implied consent for the Firm to make deductions without first sending an invoice prior to the deduction (with the effect that the Client is deemed to have paid by the deduction), I find that special circumstances exist which support the grant of leave for taxation. On the evidence, the Client was not provided with any information on the details (the amounts and specific purposes) at the time of deduction. Indeed, it is not even clear when the deductions were made. Whilst it may be said that the Client could have objected to any deductions at the earliest by 23 May 2016 when it was provided with an account by the Firm, and hence that it is deemed to have paid by not so objecting, I am of the view that special circumstances exist because the Client was not in possession of the relevant information and details to question the reasonableness of the expenses. The present case is different in this way fromKosui’scase, where the court found at [72] that the client had allowed each bill to be paid without objection out of the client’s deposit in circumstances where it was intimately aware of the work being done and was already in a position to raise a complaint if it thought the sums were unreasonable. In the present case, the earliest time that the Client would reasonably have knowledge of how the S$50,000 was specifically put to use, and thus would be able to dispute the reasonableness of those expenses, would be on 23 May 2016 itself. By then, however, it is clear that sums had already been paid out of the S$50,000 deposit to meet the Firm’s costs and disbursements. 95The difficulty, however, is that the Client has not applied to tax the email dated 23 May 2016 as a bill of costs. The application is for taxation of the 15 January Invoice, which “invoice” is simply an email request for S$50,000 by way of a deposit for future costs and disbursements. On this basis, the Firm takes the position that the application to tax the 15 January Invoice must fail as there is in reality no bill of costs to tax. 96I note that the 15 January 2014 email is similar to another email sent to the Client on 9 December 2014 which requested the transfer of “about S$100,000 to our account towards further costs and disbursements which may be incurred in England.” This was subsequently followed by Invoice 46 dated 5 January 2015 for S$100,000.46Foot Note 46×First Affidavit of Zhu Xiao Dong (14 September 2016) at ZXD-1 p.25Invoice 46 is headed: “Re: ARB No. 123 of 2010 (OS 304 of 2014).” “OS 304 of 2014” refers to Metalloyd’s application to set aside the 123 Award in Singapore.  The invoice simply states that the S$100,000 is “for disbursements.” No specific disbursements are referred to at all. There is no reference made to trips to the UK or consultations with UK solicitors over registration and enforcement of the 123 Award in the UK. It was only on 13 March 2015 that the Firm by email provided information on how S$55,271.82 (out of the S$ 100,000) had been wired 3 days before to the UK solicitors to meet the UK solicitor bills’ 15/305, 15/355 and 15/381. 97The short point is that the Firm does not contend that Invoice 46, as a request for a deposit, is not an invoice that is capable of being taxed. Instead it takes the position that there is no reason for taxation since the Client was informed on 13 March 2015 how a portion had been spent to meet the English bills (referred to) leaving a balance of S$44,629.21. The Client did not appear to object to this expenditure at the time when it was informed. I shall examine Invoice 46 in more detail below. The point that might be made is that given the position the Firm has taken on Invoice 46 (it could have been taxed but there are no special grounds for leave) might it not be wholly inconsistent for the Firm to take the position that the January 2014 invoice for S$50,000 is not taxable as it was just a request for a deposit? Whilst there is something to be said for this, the conclusion I have come to is that the email of 15 January 2014, being a request for a deposit, is not a bill of costs capable of taxation as such.",
        "Invoice 15": "98On 1 April 2014, Metalloyd took out Originating Summons 304 of 2014 (“OS 304/2014”) in the Singapore Courts to set aside the 123 Award.47Foot Note 47×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 14.By an email dated 15 April 2014 and addressed to Mr Zhu, the Firm informed Mr Zhu that it had drafted a reply affidavit in response to Metalloyd’s setting aside application. This email also informed Mr Zhu that the Firm had drafted a summons and supporting affidavit for the Client’s own application to enforce the 123 Award in Singapore. The email ended by asking whether Mr Zhu could attend at the Firm’s office the next day to affirm both affidavits.48Foot Note 48×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at pp 94–95. 99On 17 April 2014, the Client took out Summons 1942 of 2014 (“SUM 1942”) in OS 304/2014 seeking leave to enforce the 123 Award against Metalloyd in Singapore.49Foot Note 49×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 15. 100Invoice 15 for S$54,113.20, dated 8 May 2014, was issued to the Client through a 9 May 2014 email from the Firm.50Foot Note 50×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at pp 85–86.Invoice 15 was titled “RE: ORIGINATING SUMMONS 304 OF 2014”,51Foot Note 51×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at p 53.and provided that sums were payable: TO OUR PROFESSIONAL chargers [sic] for services rendered in connection with the above matter including (where applicable) correspondence, court attendances, telephone calls, examination and drafting of documents, inquiries and all incidental work necessary for carrying out the business entrusted to us in your matter. 101Mr Zhu subsequently replied in an email on 9 June 2014 asking for details of the work done under Invoice 15 so that he could provide an account to the Client’s financial department.52Foot Note 52×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at p 85.The email was sent to Ms Erin Marie, Mr Gabriel’s secretary at the time, in the following terms: dear Erin, could you please give me more details of the invoice (under which cases?),so i can explain to my financial department to arrange the payment. 102On the same day, the Firm replied in two separate emails. First, Ms Marie replied explaining that Invoice 15 was for work done in OS 304/2014:53Foot Note 53×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at p 87. The interim invoice is for OS 304 of 2013 (Arb 123 of 2010). Hope this helps. Should you require further assistance, please do not hesitate to contact myself or Mr Peter Gabriel. 103Mr Gabriel himself then followed up with an email about half an hour later explaining that Invoice 15 was for the interim fees in respect of work done in resisting OS 304/2014 as well as commencing SUM 1942:54Foot Note 54×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at pp 90–91. This is the application for setting aside by Metalloyd in Singapore of the award we had obtained against them. We had replied to their application with your affidavit. We also had made an application to register the award as a judgment in Singapore and for its enforcement after that. The bill is for the interim fees. 104There is no evidence of any reply from Mr Zhu after this. Invoice 15 was duly paid on 19 June 2014 by cheque.55Foot Note 55×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 32; First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 36.Both disqualifying events under s 122 of the LPA are accordingly in play. 105It appears there are three planks to the Client’s case on Invoice 15: (a) First, there was no itemisation, particularisation or breakdown of Invoice 15 to explain what work was done, who did the work, and what rate was applied. Without these particulars, the Client could not have formed a view as to whether to have the bill taxed.56Foot Note 56×Plaintiff’s Written Submissions (4 April 2018) at para 56. (b) Secondly, and in any event, the Client was unaware of its right to have the bill taxed.57Foot Note 57×Plaintiff’s Written Submissions (4 April 2018) at para 56. (c) Thirdly, Mr Zhu was inexperienced in matters of legal costing and had no sense of whether the Firm’s charges were reasonable. He did not challenge or query the Firm’s charges because he trusted it to charge a reasonable and fair amount.58Foot Note 58×Plaintiff’s Written Submissions (4 April 2018) at para 57. Again, whilst the Client does dispute its liability to pay under Invoice 15 (on the basis that it is not a proper bill), it appears that the main submission before me is that there are special circumstances justifying sending Invoice 15 for taxation. 106To show that those arguments constitute special circumstances justifying an order for taxation, the Client must show how they have a rational connection to both the expiration of the 12-month period as well as the payment of the bill itself. 107I have set out above the description of Invoice 15, the circumstances surrounding its issuance, as well as the two emails from Ms Marie and Mr Gabriel dated 9 June 2014 explaining what Invoice 15 was for. 108It bears repeating that there is no hard-and-fast rule as to what constitutes sufficient particularisation. What may be a sufficient bill on the facts of one case may not be a sufficient bill on the facts of another. At the end of the day, the question is whether the client, armed with the knowledge that he has, would know enough by looking at the narrative in the bill, so that he can arrive at an informed view of whether to apply for taxation if he disputes the reasonability of the charges in the bill (see [37] above). 109In this context, I note that r 17(5) of the Legal Profession (Professional Conduct) Rules (Cap 161, R 1, 2010 Rev Ed) (“the LP(PC)R”) states that if a client disputes or raises a query about a bill of the legal practitioner in a matter, the legal practitioner must inform the client in writing of the client’s right to apply to the court to have the bill taxed or to review any fee agreement, unless the legal practitioner believes that the client knows or reasonably ought to know of that right. 110In the present case, I accept that Mr Zhu and the Client were not aware and were not informed of the right of taxation.That said, I also accept that Mr Zhu did not indicate any concern over the bill such that r 17(5) was operative. In any case, even if I am wrong, a breach of the LP(PC)R does not on its own address the rationale of the special circumstances requirement for leave under s 122 of the LPA. 111To begin with, in light of Ms Marie’s and Mr Gabriel’s emails explaining to Mr Zhu the charges under Invoice 15 for OS 304/2014, as well as his own involvement in affirming the affidavits in that application, I find that Mr Zhu must have had sufficient knowledge of the scope of work done by the Firm. And although Mr Zhu now says that he did not raise any issues with the Firm over its charges because he trusted that it would charge fairly, this is not sufficient for me to find that there are special circumstances under s 122 of the LPA. 112Nowhere is there any evidence of Mr Zhu taking the slightest issue with the Firm’s costs. And this is in spite of Ms Marie making it known in her email to Mr Zhu that he could contact her or Mr Gabriel for further clarifications on the charges in Invoice 15 (see [102] above). The clarification that Mr Zhu sought in his 9 June 2014 email in no way expressed an issue with the reasonability of the Firm’s charges: dear Erin, could you please give me more details of the invoice (under which cases?),so i can explain to my financial department to arrange the payment. [emphasis added] To my mind, the italicised words show that Mr Zhu was not thinking so much about the reasonableness of the charges, as much as he was concerned with the administrative task of arranging for payment from the Client’s financial department, which apparently required him to know about the case for which Invoice 15 was issued. 113In the circumstances, I find that Invoice 15 is a proper bill that the Client is liable to pay and which has been paid. I also find that there are no special circumstances justifying an order for Invoice 15 to be referred to taxation.",
        "Invoice 39": "114On 28 October 2014, the Firm issued Invoice 39 for S$107,809.47 to the Client.59Foot Note 59×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 33; First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 44.The description of the work done in respect of Invoice 39 read as follows:60Foot Note 60×First Affidavit of Zhu Xiao Dong (14 September 2016) at p 24. RE: ORIGINATING SUMMONS NO. 304 OF 2014 ARBITRATION NO. 123 OF 2010 TO OUR PROFESSIONAL CHARGES for services rendered in connection with the above matter including: 1) Preparation and Exchange of AEIC; 2) Preparation of Opening Statement; 3) Oral Hearing to be held in November 2014; and 4) All incidental work necessary for carrying out the business entrusted to us in your matter. 115Invoice 39 purported to bill for work done by the Firm between the day subsequent to the date of the last invoice (Invoice 15) and the date of Invoice 39, namely, between 9 May 2014 and 28 October 2014.61Foot Note 61×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 28. 116Broadly speaking, the major billable work carried out by the Firm in respect of the 123 Award during this period were: (a) preparing for and attending a 12 August 2014 hearing before Justice Steven Chong (as he then was), in which Metalloyd’s application to set aside the 123 Award in OS 304/2014 was dismissed pursuant to ORC 5434/2014,62Foot Note 62×First Affidavit of Zhu Xiao Dong (14 September 2016) at pp 64–65.and the Client’s application for leave to enforce the 123 Award in SUM 1942/2014 was granted pursuant to ORC 5438/2014;63Foot Note 63×First Affidavit of Zhu Xiao Dong (14 September 2016) at pp 66–67. (b) instructing English solicitors on the enforcement proceedings in the UK in relation to the 123 Award;64Foot Note 64×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at p 83.and (c) taking out an application in 2014 Folio 1276, on or about 21 October 2014, for leave to enforce the 123 Award in England in the same manner as a Judgment of the English High Court.65Foot Note 65×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 18. 117Based on the events then taking place for OS 304/2014, the Client was advised by R&T, after the latter came on board in 2016 as described earlier (see [10] above), that there could not have been preparation of any AEICs, any opening statement, or any oral hearing to be held in November 2014, as was stated in Invoice 39.66Foot Note 66×Plaintiff’s Written Submissions (4 April 2018) at para 61.The Client accordingly took the position that it was billed for non-existent items. 118It is crucial to note that in response, the Firm does not dispute that there was no work done for any of the stated items in Invoice 39 in relation to OS 304/2014. Instead, it takes the position that Invoice 39 was wrongly-titled. According to the Firm, Invoice 39 is supposed to bill for work done in relation to SIAC 200, a separate matter that the Firm was handling concurrently for the Client. 119Mr Zhu was also in charge of SIAC 200 for the Client and had been giving evidence as a key witness in those proceedings.67Foot Note 67×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at paras 44–46.The Firm says that Mr Zhu, having given evidence as a witness in SIAC 200, ought to have known that the items set out in Invoice 39 were meant to be in relation to the proceedings in SIAC 200 instead of OS 304/2014. In other words, the Firm says Mr Zhu ought to have known that Invoice 39 was wrongly-titled. 120The problem, however, is that the Firm only took the position that Invoice 39 was wrongly-titled, for the very first time, in a letter dated 27 September 2016. This was not justafterthe Client commenced this application on 14 September 2016, it was also more than four months after R&T’s initial email of 9 May 2016 requesting an itemised breakdown of the Firm’s charges for the Disputed Invoices.68Foot Note 68×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 29. 121But the Firm does not stop there. It goes on to say that because Mr Zhu knew that Invoice 39 was wrongly-titled, the Client was thus acting in bad faith and was in fact dishonest when it went on to say that the Firm may have charged for non-existent items in relation to OS 304/2014.  I find the Firm’s position on this rather startling. Even if I were to assume for a moment that the Firm is correct insofar as Invoice 39 was indeed wrongly-titled, I did not think it supports the assertion that the Client was dishonest or acting in bad faith. 122The question inevitably comes to mind: in respect of which matter, SIAC 200 or the 123 Award Enforcement Proceedings, is Invoice 39 (for the sum of S$107,809.47 and paid on 24 November 2014) charged, paid and attributed towards the Client, in the accounts between the parties? 123If the sum is indeed accounted for as a sum paid for the 123 Award Enforcement Proceedings, it appears to follow that a similar amount remains due and owing in the accounts for SIAC 200. On the other hand, if the sum was properly attributed and accounted for by the Firm to SIAC 200 and was not charged to the accounts for the 123 Award Enforcement Proceedings, the titling error appears to be nothing more than that: an error that has no real consequence on the state of affairs between the parties aside from the confusion that has been caused. 124Without knowing which set of proceedings (and what work) Invoice 39 was intended for, the Client would not be in a position to assess the reasonableness or otherwise of the fees sought. To say that Invoice 39 was wrongly-titled and to resist an application for its taxation by alleging that the Client was dishonest and acting in bad faith ignores the fact that it was the Firm which made the “error” in the first place. 125I have noted already that the Firm was handling a number of separate matters for the Client at or about the same time in respect of which fee invoices were being sent (see [8] above). It is odd for the Firm that was conducting the work to assert that it should have been clear to the Client that Invoice 39 was for SIAC 200, when the Firm itself was responsible for drawing up and delivering Invoice 39 for the 123 Award Enforcement Proceedings. I am of the view that the Firm cannot excuse its very late attempt to clarify the position on the basis that the Client did not raise any issues regarding Invoice 39 in its correspondence with the Firm.69Foot Note 69×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 47.The primary duty must rest on the Firm to raise proper bills of costs that identify clearly and accurately the matter (for example the case name or file) to which they relate. This is especially so where there are a number of concurrent active files of the Client being handled by the Firm. 126I note also that in the present case, R&T, on behalf of the Client, did ask for an itemised breakdown of the Disputed Invoices (including Invoice 39) on 9 May 2016.70Foot Note 70×Second Affidavit of Zhu Xiao Dong (19 December 2016) at pp 173–183.The Firm only clarified on 27 September 2016 that there was a titling error for Invoice 39 (see [120] above). 127This leaves the question of whether there are special circumstances justifying an order for the taxation of Invoice 39. Plainly, there are. Although the limitation period of 12 months has set in and Invoice 39 has been paid, the Client had gone out of pocket for non-existent work at least insofar as the 123 Award Enforcement Proceedings are concerned. The Firm was responsible for the confusion over the matter to which Invoice 39 related. Even if the Client might have queried Invoice 39 much earlier, the fact remains that any confusion was caused by the Firm itself. If, on taxation, it is established that Invoice 39 was in fact intended for work done in respect SIAC 200, the appropriate order and directions will have to be sought from the taxing registrar. 128Finally, I note that inre G B B Norman(1886) 16 QBD 673, special circumstances justifying taxation were found because the bill of costs included a charge for shorthand notes of the proceedings at a reference where no professional shorthand writer had been employed. Instead, the clerk to the solicitor had taken the notes, and it did not appear that the solicitor had given his clerk any part of the amount charged. 129Whilstre G B B Normanis not on all fours with the present case, it supports the conclusion that a solicitor ought not to be entitled to security of receipt for fees charged in relation to non-existent work. In particular, I note Lord Esher’s comment at pp 675–676 that even if the bill of costs had been paid, there is no hard and fast rule as to what constitutes special circumstances. There,the fact that the total amount of charges was large and a “gross blunder” had been committed (in respect of the shorthand fees) constituted special circumstances for the bill to be sent for taxation. In the case at hand, I am of the view that it is not a sufficient response to say that the work charged was performed but in respect of a completely different matter being handled by the Firm for the Client. I accordingly order that Invoice 39 be sent for taxation.",
        "Invoice 46": "130Invoice 46 for the payment of S$100,000.00 was dated 5 January 2015 (see [2(d)] above), but it can be traced back to an email dated 9 December 2014 sent by Mr Gabriel to Mr Zhu.71Foot Note 71×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 49.In that email, Mr Gabriel requested for the $100,000 in the following terms: Dear Mr Zhu, … 2. In the meantime I would be grateful if you kindly transferaboutS$100,000 to our account towardsfurthercosts and disbursementswhichmaybe incurred in England. [emphasis added] 131It is not disputed that the S$100,000 was paid for Invoice 46. Mr Zhu describes Invoice 46 as a deposit.72Foot Note 72×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 37.At the time when Mr Gabriel first requested this deposit, the Client had already agreed to instruct Queen’s Counsel in England for the proceedings in Folio 1276.73Foot Note 73×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 51.Eventually, after several reminders from the Firm, the Client paid for Invoice 46 by a cheque on or about 13 February 2015.74Foot Note 74×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 38. 132I pause to underscore the point that the email of 9 December 2014 states the sum of S$100,000 was required for “further costs and disbursements that may be incurred in England”. It will be recalled that the 15 January Invoice (for a deposit payment of S$50,000) was paid on 16 January 2014. The cheque for Invoice 46 was essentially the second deposit payment to meet further costs and disbursements that may be incurred in England. By this time then, the Client had placed a total of S$150,000 with the Firm as deposit to meet costs and disbursements for the 123 Award Enforcement Proceedings. This is apart from the specific sums paid for Invoice 15 (S$54,113.20) and Invoice 39 (S$107,809.47), the latter of which the Firm says was actually meant for SIAC 200 (see [118] above). 133One month after the Client paid Invoice 46 by cheque, in an email dated 13 March 2015, the Firm provided Mr Zhu with a breakdown of how the S$100,000.00 deposit was put to use.75Foot Note 75×Respondent’s Written Submissions (4 April 2018) at para 107; First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 60 and at pp165–166.The information provided in this email showed that on 10 March 2015, three daysbeforethe breakdown was provided to Mr Zhu, a total sum of S$55,271.82 was wired to the English solicitors to pay their bills in respect of work done in the enforcement proceedings in England.76Foot Note 76×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at p 166.There was also a separate bank charge of S$98.97 deducted. In other words, the Firm drew down on the deposit to pay its disbursementsbeforeinforming and obtaining the Client’s consent for doing so. Additionally, the Firm also clarified in a follow-up email on 13 March 2015 that the balance of S$44,629.21 was held in its office account.77Foot Note 77×Second Affidavit of Zhu Xiao Dong (19 December 2016) at pp 121–122. 134The English solicitors’ bills which the Firm claimed the sum of S$55,271.82 went towards were bills numbers 15/305, 15/355, and 15/381.78Foot Note 78×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at pp 162–164.I note that these are the very same bills that the Firm,one year later, in response to R&T’s queries, provide together with a fourth English bill (15/243) to explain the usage of the sum of S$50,000 (see [75(a)] above), which was the deposit made in January 2014. 135The English solicitors 4 bills total approximately £29,699.75. At current exchange rates this is about S$53,000. At the exchange rates prevailing around 1 January 2015 this is roughly equivalent to S$60,000–S$62,000. 136The fact that the same English solicitors’ bills were referred to in the explanations for how the sums deposited by the Client in January 2014 (S$50,000) and January 2015 (S$100,000) were used does not necessarily mean there has been any double payment for the same disbursements. Nevertheless, it is not surprising that the Client now takes the position that it was not in the position to object to the use of the S$55,271.82 that was said to have been paid out of the S$100,000 deposit. After all, when it received the breakdown in respect of Invoice 46 on 13 March 2015, the Client had no idea that three of the same English bills would also be referenced as explanations for the use of the first S$50,000 deposit. 137The S$100,000 paid for Invoice 46 is similar to the S$50,000 paid under the 15 January Invoice. The Client accepts that the S$100,000, paid on 13 February 2015, was meant as a deposit to be applied towards disbursements to be incurred. The chief complaint is that it ought to have been informed of any deductionsbeforethose deductions were made.79Foot Note 79×Plaintiff’s Written Submissions (4 April 2018) at para 73.If they had been informed, they would have been able to take a view as to whether they had any issues with the deduction. 138The difficulty however is that as discussed earlier in connection with the 15 January invoice, the email of 9 December 2014 is not on its face a bill of costs that is capable of being taxed as such. It is a request for a deposit. That said, Invoice 46, which is dated 5 January 2015 and which is connected to the email of 9 December 2014 hasnotbeen challenged by the Firm as an invoice that is not capable of being taxed. Indeed, the Firm says that the Client was informed of the disbursements towards which the deposit was applied. But I have already noted that the Client was only informed of the disbursementsafterthey had been paid out by the Firm’s unilateral deduction. The Client had no opportunity to agree to or dispute the sums quoted by the Firm. 139On this basis, it appears that the only bill of costs delivered during this period then, would be the breakdown the Firm provided in its email of 13 March 2015. 140The problem, however, is that there isnoapplication to tax the 13 March 2015 bill. Whilst the matter of granting leave to tax 13 March 2015 invoice is not before me, it may be convenient if I set out some passing observations that may assist in the event the matter is taken further and Invoice 46 is found to be capable of being taxed. 141First, since this breakdown (13 March 2015) was provided to the Client onlyafterthe relevant disbursements had been paid out of the S$100,000 deposit, and there is no evidence showing that the Client knew of those disbursements to begin with, itappearsthat the Client had not agreed to the payment of those disbursements at the time of the deduction. As a client’s consent is necessary for the payment of a bill of costs, the pointappearsto arise that the bill of costs here, as evidenced in the Firm’s email of 13 March 2015, was accordingly not paid. On this basis, the only disqualifying event under s 122 that is in play is the 12-month limitation period. 142Second, in regard of the 12-month limitation, the question to consider is whether, having seen the breakdown of disbursements provided in the Firm’s email of 13 March 2015, in circumstances where there is no evidence showing any disagreement from the Client with how the deposit was then put to use, the Client was justified in allowing more than 12 months to elapse. Looking at the facts and circumstances as a whole, it appears that even if one or more disqualifying events were applicable, special circumstances might be established to refer 13 March 2015 bill for taxation. The Client did not know that the first deposit of S$50,000 had also been used (at least in part) to meet the English solicitors’ bills. To be clear, I emphasise that the repeat quotation of the English solicitors’ bills does not mean that there was a case of deliberate double charging. The point is that there appears to be a good case for saying that the Client was not in the position whereby it could take an informed view on the reasonableness or otherwise of 13 March 2015 Bill and how the S$100,000 had been utilised. 143On this I note in passing that inKosui, the client also raised an argument that special circumstances existed with respect to two bills, on account of the fact the invoices contained exactly the same description of the work done and period covered by the bill. The court found at [99] that the point raised was a “technicality” and devoid of merit because the client had never previously made an assertion that this amounted to overcharging by double or overlapping billing. The allegation was an afterthought, especially given that the client accepted that the fees charged as a whole were reasonable. The concession that the fees charged were reasonable as a whole precluded any inference of overcharging. In the present case, the position is different. There is no concession by the Client that the total fees charged and “paid” for the 123 Award Enforcement Proceedings are reasonable. Further, the Client was not in the position to even note the possible overlap between the 15 January Invoice and Invoice 46 until 26 July 2016. That said, I stress the above comments are simply by way of passing observation. 144I further note that the Firm had also confirmed in a follow-up email on 13 March 2015 that a sum of S$44,629.21 remained in its office account.80Foot Note 80×Second Affidavit of Zhu Xiao Dong (19 December 2016) at pp 121–122.This was the sum after the English solicitors’ bills were paid from the S$100,000 deposit. The Client says that this money ought to have been kept in the Firm’s client account instead of its office account. It points out that to date, the Firm has not explained why the money is kept in the Firm’s office account.81Foot Note 81×Plaintiff’s Written Submissions (4 April 2018) at para 74.In response, the Firm asserts that “[i]t is trite law and practice that once there is a disbursement bill rendered, the sums received have to be credited into the office account.”82Foot Note 82×Respondent’s Written Submissions (4 April 2018) at para 106.The Firm did not cite any authority for this proposition. It appears to take the view that Invoice 46 is not a deposit but a bill for disbursements incurred.83Foot Note 83×Respondent’s Written Submissions (4 April 2018) at para 106.But this does not sit well with the fact that Invoice 46 relates back to the email which is for costs and disbursements thatmaybe incurred (see [130] above). 145Nevertheless, as noted already, issues relating to professional conduct and proper accounting have to answer the question of why the breach amounts to a special circumstance that excuses the client for allowing one or both of the disqualifying events under s 122 of the LPA to set in. Even if the S$44,629.21 should not have been placed in the Firm’s office account, it seems to me that that is a matter which does not address the taxation issue that is before this Court.",
        "Invoice 54": "146Soon after Invoice 46 was issued and paid for, the Firm issued Invoice 54 for the payment of S$107,535.00 on 19 March 2015. This was also for work done in Folio 1276 for leave to enforce the 123 Award in England (see [116(c)] above).84Foot Note 84×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 39. 147Invoice 54 lists the following items covered by the bill: (a) 3 meetings with English solicitors in London (each spanning several days); (b) Correspondence with English solicitors, reviewing documents, witness statements, the draft consent order, the draft order of claims, response to queries as well as discussion over engagement of an English leading counsel. 148The Firm provided an itemised breakdown of its charges, showing that Mr Gabriel alone had incurred a total of S$149,000 in time costs.85Foot Note 85×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 39 and p 28; First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 64.The items included a charge of $10,000 per day for a total of 10 days arising from Mr Gabriel’s meetings with English solicitors. 149However, the itemised breakdown of the Firm’s charges is inconsistent with the Statement of Costs for Folio 1276 (“the Statement of Costs”), which Messrs Jackson Parton, the instructed English solicitors, had submitted to the English High Court. According to the Statement of Costs, Mr Gabriel only incurred time costs amounting to S$14,500.86Foot Note 86×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 40.Indeed the Statement of Costs sets out two hours as the time spent by Mr Gabriel meeting with English solicitors. 150At the time the Client received Invoice 54, Mr Zhu did not query the discrepancy in the charges reflected in the Firm’s itemised breakdown and the Statement of Costs, as he was not aware of the significance of the Statement of Costs until R&T came on board.87Foot Note 87×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 42.The Firm’s explanation for this discrepancy is that the Statement of Costs was prepared for the limited purpose of seeking costs in the English proceedings. The English solicitors were of the view that the Firm’s costs, as costs for Singapore solicitors, would not be claimable in the English proceedings. A decision was hence taken to try for a smaller sum as reflected in the Statement of Costs.88Foot Note 88×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 65.The difficulty, however, is that there is no independent evidence to corroborate the Firm’s explanation as to why a much lower time cost period (two hours as opposed to 10 days) was claimed in the Statement of Costs. 151The Firm applied the balance of S$44,629.21 in its office account after Invoice 46 was paid to partially satisfy Invoice 54.89Foot Note 89×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 66.Whether the Client had agreed for the balance sum from Invoice 46 to be used in this manner is a matter of dispute between the parties.90Foot Note 90×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 40.In any case, the remaining S$62,905.79 under Invoice 54 was fully satisfied by way of a cheque dated 12 May 2015.91Foot Note 91×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 67. 152Additionally, I note that there was a balance of S$98.00 of the Client’s money held with the Firm arising out of extra bank charges. This was not known until after R&T started inquiring into the Client’s past transactions with the Firm for SIAC 123. The Firm stated in an email dated 23 May 2016 that it had “just discovered that there is a balance of S$98.00 being extra bank charges”.92Foot Note 92×Second Affidavit of Zhu Xiao Dong (19 December 2016) at p 186.This money was returned to the Client on 1 July 2016.93Foot Note 93×First Affidavit of Nandwani Manoj Prakash (7 November 2016) at para 68. 153The Client’s main argument on Invoice 54 is that it had been overcharged. The Client accepts that, unlike the other Disputed Invoices, Invoice 54 provides an itemised breakdown of the Firm’s charges.94Foot Note 94×Plaintiff’s Written Submissions (4 April 2018) at para 77.Its chief issue with Invoice 54 is that the time costs of S$149,000 reflected therein considerably exceeded those reflected in the Statement of Costs submitted to the English High Court in Folio 1276 for assessment. This, the Client says, shows that Invoice 54 was inflated and that it had thus been overcharged.95Foot Note 95×Plaintiff’s Written Submissions (4 April 2018) at para 80. 154Yet, a mere allegation of overcharging without more cannot amount to special circumstances. In this regard, it is worth quoting, in full, the remarks of Chong J inSports Connection([38]supra) at [37]: In my view, an allegation of overcharging by reference to the quantum of the total fees is generally not sufficient to amount to special circumstancesper se. Typically a client seeks an order for taxation of the solicitor’s fees because he is dissatisfied with the quantum charged,ie, he believes he has been overcharged. The law allows such a client the right to tax any bill raised within 12 months from the delivery of the bill provided it has not been paid. Outside the 12-month window or after payment, the law requires the client to demonstrate special circumstances. It seems to me that to treat a general allegation as opposed to a specific allegation of overcharging as special circumstances would almost invariably lead to an order for taxation even if it is applied for outside the 12-month period or after payment.Such an approach would have the effect of rendering the restriction to tax such bills outside the 12-month window or after payment otiose. Clearly the objective behind s 122 of the LPA is to cut down the client’s entitlement to tax the bill as of right. [emphasis added in bold italics] 155Indeed, what Chong J had to say is entirely consistent with what I have repeatedly emphasised above. A client is entitled to tax his solicitor’s bill of costs if he feels that he has been overcharged. But his right to do so is circumscribed by statute. Clearly, the legislature saw good reason to circumscribe what a client is otherwise entitled to do as of right. If the client is concerned that he had been overcharged, he should not then have paid the bill without requesting for it to be taxed or without indicating, in any other way, that he had an issue with the reasonability of his solicitor’s charges in the first place. He should also not wait until the claim becomes stale before deciding that he wants to take it up with his solicitor. 156Here, although the Client says it did not question the differences between the charges as reflected in Invoice 54 and the Statement of Costs because it could not appreciate the significance of the latter, I find that this is does not amount to a special circumstance which would outweigh the legislature’s concern to prevent stale claims from being brought. To be clear, even if it was a breach of applicable rules for the Client to seek to claim, in the English proceedings, Mr Gabriel’s costs of attendance and meetings with UK solicitors in London (as to which I am not making any finding), this does not affect the question of taxation that is before me. 157The Client also raised the point that the sum of S$44,629.21 remaining in the Firm’s office account after payment of Invoice 46 was applied, without the Client’s knowledge and consent, to partially satisfy invoice 54 (see [151] above). Again, the Client does not explain, and I cannot see, how this can amount to special circumstances under s 122.",
        "Invoice 86": "158Invoice 86 was dated 28 September 2015 and was thus meant to cover work done by the Firm between 20 March 2015 (ie, the day subsequent to the date of the last invoice) and 28 September 2015.96Foot Note 96×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 43. 159Following the success of the enforcement proceedings in England (ie,Folio 1276), the Firm received a sum of US$2,342,920.92 from Metalloyd in satisfaction of the 123 Award on 22 September 2015.97Foot Note 97×First Affidavit of Zhu Xiao Dong (14 September 2016) at para44.The next day, Mr Zhu sent a message by SMS to Mr Gabriel asking whether the Firm had received the monies. Mr Gabriel replied confirming receipt of the same. 160On 28 September 2015, the Firm retained US$210,649.90 (equivalent to S$300,000.00 at the time) out of the US$2,342,920.92 received from Metalloyd and remitted the remainder to the Client.98Foot Note 98×First Affidavit of Zhu Xiao Dong (14 September 2016) at para 45.Also on this day, the Firm issued Invoice 86 for S$321,000.00. According to Mr Gabriel, the sum retained was kept in the Firm’s client account. It had not yet been transferred to the Firm’s office account. 161It is common ground that Mr Zhu met Mr Gabriel on or around 25 September 2015 at the Firm’s office.99Foot Note 99×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 45; NOE 8 February 2018 at p 20 (lines 20–21).The Firm’s case is that Mr Zhu went to the Firm’s office to confirm the “figures” with Mr Gabriel’s secretary.100Foot Note 100×NOE 8 February 2018 at p 21 (lines 31–32).There was, however, no evidence on this from the secretary. The Firm also takes the position that an agreement was reached at the meeting of 25 September 2015 concerning the payment of the final bill of S$300,000.00. Moreover, Mr Gabriel also asserts that he did not suggest the figure of S$300,000.00. Instead, he says that this was a figure that Mr Zhu himself proposed and that there was, in fact, much more than S$300,000 that was due to the Firm in respect of the 123 Award Enforcement Proceedings. By this, what is meant is that the Firm was prepared to accept a final global payment of S$300,000 on account of its past relationship with the Client, in full satisfaction of the outstanding costs and disbursements for the 123 Award Enforcement Proceedings. Crucially, however, no contemporaneous evidence or documents were adduced to support the Firm’s position on any of its assertions. 162Evidently, Invoice 86 was the most significant invoice not just in terms of quantum, but also because of the substantial disputes of fact between the parties over the circumstances surrounding its issue and payment. On 18 May 2017, I ordered discovery and limited cross-examination for certain disputes of fact arising out of Invoice 86. In particular, I had ordered cross-examination on the following issues:101Foot Note 101×Order of Court in RA 88/2017 (18 May 2017). (a) Whether Mr Zhu had offered the sum of S$300,000.00 for the final bill as reflected subsequently in Invoice 86; and (b) Whether there was an agreement reached between the Client and the Firm for the final bill of S$300,000.00. 163The Firm points to Mr Gabriel’s email dated 6 October 2015 to the Client’s assistant finance manager at the time, Ms Cao, which states that the payment of S$300,000 was towards the payment of the Firm’s fees “as agreed” with Mr Zhu. Mr Zhu was copied in that email. Mr Zhu by this time was no longer based in the Client’s Singapore Office. He had returned to China and was now attached to and mainly working out of the Client’s office in China.102Foot Note 102×NOE 8 February 2018 at p 26 (lines 2–15). 164The Firm’s position is that if there had been no agreement, as the Client now says, Mr Zhu would have disputed the statement made that the S$300,000 was “as agreed” between the parties.Yet, Mr Zhu’s responses to the following questions in cross-examination were telling:103Foot Note 103×NOE 8 February 2018 at pp 31 (lines 9) – 32 (line 2). Q: ... The email states clearly there’s an agreement between you and Mr Gabriel for the 300,000. The attachment says that. Why didn’t you send an email saying, “Mr Gabriel is not telling the truth. I made no such agreement.” Not difficult to write that. Why didn’t you do that? … A: Because I---I trust you. You---you give your number and then you give your invoice, I think the--- Q: I will repeat the question the third time … . Mr Gabriel said in the email that he had the agreement with you. Why didn’t you write back soon after, if you didn’t see it at the right time, saying you had made no such agreement and that Mr Gabriel is lying? Why didn’t you do that? … A: At that time, I definitely wouldn’t have done it. Gabriel---Mr Gabriel had been fighting this case for us for many years and at that time we had already received the money. I considered the case closedand since he decided to deduct the money,I agreed with him because I felt that it would definitely be reasonable and at that time I didn’t pay much attention to the invoices. [emphasis added] 165Whilst the Firm’s case is that there was an agreement reached for the final payment of S$300,000.00 at the meeting of 25 September 2015, I am of the view that the evidence does not support such a conclusion. 166Mr Gabriel’s own evidence was that he did not know, on 25 September 2015, what were the outstanding costs and disbursements owing in respect of the 123 Award Enforcement Proceedings.104Foot Note 104×NOE 8 February 2018 at p 103 (lines 1–15).According to his evidence, he only knew he could have charged considerably more than $300,000 if he had wanted as the final bill of costs for the 123 Award Enforcement Proceedings.105Foot Note 105×NOE 8 February 2018 at p 153 (lines 2–10).In light of this, whilst Mr Gabriel asserts that it was Mr Zhu who came up with the figure of S$300,000 as a final payment, I find this most improbable. As Mr Zhu said, he had no basis for knowing what costs and disbursements were still owing or chargeable.106Foot Note 106×Second Affidavit of Zhu Xiao Dong (19 December 2016) at para 47. 167What Mr Zhu did know is that many invoices had already been submitted and paid by the Client, his employer, in respect of the 123 Award Enforcement Proceedings. Mr Zhu was undoubtedly pleased that SIAC 123 was finally concluded. He was now based in Shanghai, China. As with all the previous invoices, I find that in all probability he was not involved in discussions with the Firm on what was the appropriate fee to be charged. 168To be sure, assuming that Mr Zhu’s visit to Singapore on 25 September 2015 was, as the Firm asserts, for the purpose of finalising the fees or costs due for the 123 Award Enforcement Proceedings, it is odd that the Firm did not prepare in advance proper accounts and bills for the purposes of discussion on the final invoice. Invoice 86 was rather large (as compared to the earlier invoices). Whilst Mr Zhu was the head trader responsible for the trade leading to SIAC 123, it does not appear that the Firm had ever sought clarification as to whether Mr Zhu had authority to commit the Client to a global sum of S$300,000 on the final invoice. 169As noted already (at [132] above), it is apparent that in the past, the Firm had on several occasions asked for and was provided with deposits totalling some S$150,000, against which it had made deductions for various disbursements and costs without obtaining the Client’s prior approval on the specific amounts to be deducted. In the case of Invoice 86, I note that the S$300,000 charged was once again satisfied by the Firm’s unilateral deduction – this time, from the monies the Firm had received from Metalloyd and which were due to the Client under the 123 Award. 170Looking at the evidence as a whole, including the oral testimony, I find that Mr Zhu did not, on 25 September 2015, come to any agreement on behalf of his employer (the Client) for a final payment of S$300,000 to the Firm. To be sure, it appears that Mr Zhu was aware that a final invoice would be sent and that some figures may have been mentioned. Nevertheless, I am of the view that Mr Zhu did not make any agreement on behalf of the Client committing the Client to pay a final fee of S$300,000 (bearing in mind that there was no discussion at all of what work or disbursements remained outstanding at that date), and that this sum could be deducted from the arbitration award that had been obtained. 171To be clear, it may well be that the question of a final invoice or bill was raised in the course of the meeting at the Firm’s office on 25 September 2015. Nevertheless, it is evident that any discussions would have been brief and lacking in detail (to say the least). Leaving aside any issue of Mr Zhu’s authority to enter into a fee agreement on behalf of the Client, I find that the failure of Mr Zhu to respond to the emails (in which he was copied) is at most “acquiescence” based on the past practice of the Firm making unilateral deductions from deposits or monies held by on behalf of the Client. It does not mean that he was agreeing that the S$300,000 was a reasonable sum. After all, he had no basis or detailed information by reference to which he could make an informed decision on what would be a reasonable final sum to close the accounts between the Client and the Firm for the 123 Award Enforcement Proceedings. It is also apparent from these series of emails that the Client’s accounting department was merely querying the basis of the deduction by the Firm (as opposed to its quantum), and that Mr Gabriel had not raised or discussed the matter directly with Mr Wang or the Client’s Chairman. 172In coming to my decision, I note that in the case ofre G B B Norman([128]supra), Lord Esher’s view at p 676 (by way ofdicta) was that even if a bill of costs had been paid, acquiescence does not necessarily deprive the client of taxation. Thedictadoes not, at first sight, sit easily with the Singapore case law referred to which identifies the policy concern behind the disqualifying event of payment as being one of preventing approbation and reprobation on the client’s part. Nevertheless, the key point is that such a disqualifying event is not absolute, especially in a case where the client simply acquiesces in his solicitor’s decision to withhold sums to satisfy its fees. 173Further, even if the Client can be said to have “paid” the S$300,000 within the meaning of s 122 of the LPA, I find that there are special circumstances justifying the grant of leave to tax Invoice 86. With respect to the Firm, the circumstances under which the S$300,000 was deducted from the 123 Award on the back of an alleged oral agreement or understanding obtained from Mr Zhu leaves much to be desired. No final account was prepared for Mr Zhu. Mr Gabriel was also not aware of what costs and disbursements remained outstanding in respect of the work done in the 123 Award Enforcement Proceedings. 174It is worth repeating that the Disputed Invoices were not billed in respect of the SIAC 123 arbitration proceedings that led up to the 123 Award. What is in issue is simply the bills raised in respect of the 123 Award Enforcement Proceedings. The legal costs and disbursements awarded to the Client in SIAC 123 (a 4-year arbitration) was S$355,000.107Foot Note 107×Plaintiff’s submissions at para 3. 175By 25 September 2015 when the alleged oral agreement for the S$300,000 was made, the Firm had already raised five invoices totalling S$419,457.67. Under cross-examination, this was accepted by Mr Gabriel although the point was made that he was not sure at that time how much had been paid.108Foot Note 108×NOE, 8 February 2018 at p 103 (lines 1–14).Even if Invoice 39 is taken out of the equation, S$311,648.20 had already been invoiced by the Firm for work done in enforcement proceedings alone. To be sure, a portion of the sums previously raised were to meet the bills of the English solicitors. The four English solicitors’ bills raised a total sum of £29,699.75. At the prevailing exchange rate in May 2016, that sum would roughly equate to a total of about S$60,000. Even affording the Firm the benefit of the doubt and taking the sum billed under Invoice 39 out of the equation, a total of S$251,548.20 was paid to the Firm for enforcement proceedings alone, which occurred over a span of slightly under two years. As stated above, the legal costs and disbursements awarded to the Client in a full-blown 4-year arbitration was S$355,000. 176It appears that Mr Gabriel’s position is that Invoice 86, as the final invoice, was intended to cover not just new work done in the period between Invoice 54 and Invoice 86, but also items dating back to earlier periods of the 123 Award Enforcement Proceedings and which had not yet been billed for.109Foot Note 109×NOE, 8 February 2018 at p 133 (lines 20–32).Yet, at the time of the alleged oral agreement, Mr Gabriel had not prepared or shown to Mr Zhu anything like a final account for the 123 Award Enforcement Proceedings. All that Mr Gabriel claims to have done was to step out of his office to confer with his secretary (or personal assistant) on the costs and disbursements due. Even so, his evidence is that the sum of S$300,000 was on the low side and that he could have charged much higher but did not because of the past relationship between the Firm and the Client.110Foot Note 110×NOE 8 February 2018 at pp 129 (line 27) – 130 (line 5). 177In short, I find that even if Mr Zhu should have emailed a response to the emails that he was copied on and referred to above (at [171]) (for example, by querying the reference to the agreement for S$300,000), this is not a case where the deduction and retention by the Firm constitutes a payment that equates to a clear case of approbation by the Client, which will then lead to reprobation if the Client now seeks and obtains leave to tax. 178Indeed, the history of requests for deposits, deductions, invoicing and billing between the Firm and Client and the pockets of confusion that only came to light late in the day (as for example, the alleged error in the title of Invoice 39) are part of the backdrop against which I have come to the decision that leave to tax Invoice 86 should be granted in any event. 179I also add that if Invoice 86 is the “final invoice” which looks back over the entirety of the 123 Award Enforcement Proceedings, it is hard to see how the reasonableness of Invoice 86 can be assessed in a meaningful manner without factoring in the prior invoices that were raised.",
        "Conclusion": "180In summary, I grant leave to the Client to have the following invoices taxed: (i) Invoice 39 for S$107,809.47; (ii) Invoice 86 for S$321,000. 181Even though the Client did not succeed in obtaining leave for all the invoices to be taxed, I am of the view that in the circumstances, it is proper that  the Firm is to pay the Client the costs of this application, with such costs to be taxed if not agreed. George WeiJudge Vellayappan Balasubramaniyam and Davis Tan (Rajah & Tann Singapore LLP) for the plaintiff;Peter Gabriel, Manoj Nandwani Prakash, Charmaine Jin Jing Xian and Lee Mei Zhen (Gabriel Law Corporation) for the defendant."
    }
}