{
    "case_title": "Public Prosecutor vBNO",
    "ncitation": "[2018] SGHC 243",
    "coram": "See Kee Oon J",
    "sections": {
        "Introduction": "1 BNO (“the Accused”), claimed trial to the following three charges (“the Charges”): You … are charged that [1st Charge]on the 31st day of October 2015, at or about 11.15 p.m., at … Singapore, did use criminal force on [the victim], a male under 14 years of age, intending to outrage his modesty,to wit, by touching the said [Victim]’s penis, and you have thereby committed an offence punishable under Section 354(2) of the Penal Code, Chapter 224 (2008 Rev. Ed.). [2nd Charge]on the 31st day of October 2015, at or about 11.15 p.m., at … Singapore, did cause [the Victim], a male under 14 years of age, to penetrate, with his penis, your mouth, without his consent, and you have thereby committed an offence under Section 376(1)(b), and punishable under Section 376(4)(b) of the Penal Code, Chapter 224 (2008 Rev. Ed.). [3rd Charge]on a second occasion on the 31st day of October 2015, at or about 11.15 p.m., at… Singapore, did cause [the Victim], a male under 14 years of age, to penetrate, with his penis, your mouth, without his consent, and you have thereby committed an offence under Section 376(1)(b), and punishable under Section 376(4)(b) of the Penal Code, Chapter 224 (2008 Rev. Ed.). 2 The Victim was a nine-year-old boy. He was the schoolmate of the Accused’s youngest son (“E”) at the material time.1Foot Note 1×An order prohibiting publication or disclosure of the name of the Accused and the Victim, and any information that might lead to disclosure of the Victim’s identity, was made at the commencement of the trial. For convenient reference, Annex A lists the abbreviated and redacted names of the witnesses and entities mentioned in this grounds of decision.The Prosecution’s case was that the Accused had outraged the modesty of the Victim by touching the Victim’s penis before causing the Victim’s penis to penetrate the Accused’s mouth, without the Victim’s consent, on two separate occasions on the night in question. On the first occasion, the Accused caused the Victim’s penis to penetrate his mouth two times. On the second, the Accused caused the Victim’s penis to penetrate his mouth once. Both occasions took place in the bedroom of the Accused’s youngest son during a sleepover.",
        "The Prosecution’s case": "3 The Prosecution tendered evidence from a total of 18 witnesses, with the key witness being the Victim. The Prosecution sought to corroborate his evidence with that of his parents, his teacher (“JR”) and his counsellor (“CF”) from his school, a senior consultant forensic scientist from the Health Sciences Authority (“HSA”) (Peter Douglas Wilson) and an Emeritus Consultant from the Department of Child and Adolescent Psychiatry of the Child Guidance Clinic of the Institute of Mental Health (Dr Cai Yiming).",
        "The Victim’s evidence": "The Victim’s acquaintance with E’s family 4 The Victim and E were classmates from August 2014 to June 2015. According to the Victim, they were “really good friends” and they remained as friends even though they went to different classes after June 2015. The Victim first met the Accused either in school or at the Accused’s residence, and he found the Accused to be “a nice, funny, trustworthy person”.2Foot Note 2×NE 3/10/2017, at p 37 lines 25–30.The Victim first met the Accused’s wife (“AW”) when he was either in kindergarten or in first grade. AW worked in the cafeteria at the Victim’s school. The Victim found AW to be “nice”.3Foot Note 3×NE 3/10/2017, at p 38 lines 1–5. Events prior to 31 October 2015 5 The Victim had been to the Accused’s residence for playdates with E about four or five times, including the last occasion on 31 October 2015. Three of these occasions were sleepovers, the first of which took place in May and the other two in October 2015,4Foot Note 4×NE 3/10/2017, at p 40.and one was an after-school playdate on 30 October 2015.5Foot Note 5×NE 3/10/2017, at pp 37–39.He thought that the playdate on 30 October 2015 was “enjoyable and fun”, and he “really enjoyed” the sleepovers at the Accused’s residence “because [E would invite] some of [their] other friends and also [the Accused] would play with [them] and [they] played with Nerf guns”.6Foot Note 6×NE 3/10/2017, at p 40 lines 10–13. 6 During the first sleepover, the Victim was invited to celebrate E’s birthday and he slept in the living room of the Accused’s house with E and his friends. The second sleepover was sometime in early October 2015. E had also invited two other friends, BE and RF, for this sleepover. After dinner, the Accused told the Victim to take a shower. The Victim felt surprised as the Accused went into the bathroom while he was naked in the shower and said something along the lines of “[h]ere’s the soap”. The Accused also told him “not to wear underwear” before going to sleep “as it [would let his] body breathe” either when he was taking the shower or just before.7Foot Note 7×NE 3/10/2017, at pp 44–46.The Victim did as he was told. Subsequently, after playing and watching television, the Accused told E, BE, RF and the Victim that he had a scary story to tell them, and told them to go to the upper bunk of the bunk bed in E’s older brother’s (“R”) room. After they climbed up, the Accused switched off the lights, closed the door and also went up to the upper bunk. He sat cross-legged and told the Victim to sit on his lap while he told the scary story.8Foot Note 8×NE 3/10/2017, at p 48.Thereafter, all of them played the word game known as Mad Libs.9Foot Note 9×NE 3/10/2017, at p 50.The Victim informed his father (“B’) after the second sleepover that the Accused got him to sit on his lap. B told him right away that it was “not correct” for someone to ask the Victim to sit on his lap. B gave a similar account when he testified.10Foot Note 10×NE 5/10/2017, at p 14 line 25 to p 15 line 2. Events on 31 October 2015 7 The Victim’s evidence was that he had gone to the Accused’s residence, in Singapore, for a trick-or-treat party followed by a sleepover on 31 October 2015, Halloween night, at the invitation of E’s parents. Two other friends of E and friends of E’s brothers were also invited to the Accused’s residence for the party. Among them, only the Victim and R’s two friends stayed for the sleepover after the Halloween party. The Victim arrived at the Accused’s residence at about 3.00pm that day and wore an Obi-wan Kenobi costume during the party. The Accused was dressed as a zombie pirate.11Foot Note 11×NE 4/10/2017, at p 45, lines 1–2. 8 After taking part in trick-or-treating around the neighbourhood, the Victim returned to the Accused’s residence at about 9.00pm. E’s two other friends left the Accused’s residence after the trick-or-treating.12Foot Note 12×Victim’s conditioned statement (“CS”), at para 4.From 9.00pm to about 10.30pm, E and the Victim counted the number of candies they had collected from trick-or-treating and traded them, and played a game of Mad Libs with the Accused in E’s room that lasted about 5 to 10 minutes.13Foot Note 13×NE 3/10/2017, at p 57E’s room was on the third floor of the residence. Before going to bed, the Victim changed into his pyjamas, which consisted of a pair of shorts and a t-shirt, but did not wear his underwear14Foot Note 14×Victim’s CS, at para 6.because he recalled that the Accused had told him during the second sleepover that he should not do so in order to let his body breathe. The Victim did what he was told as he assumed that it was a habit in the Accused’s family not to wear underwear.15Foot Note 15×NE 3/10/2017 at p 58 line 27 to p 59 line 5.The Accused then asked the Victim whether he was a light or heavy sleeper. The Victim replied that for the first two hours after he fell asleep, he could be a deep sleeper, but he could wake up anytime nearer to the morning. 9 At about 10.30pm, the Accused told E and the Victim to go to bed. The Victim slept on the upper bunk of E’s bunk bed (“the bunk bed”) while E slept on the lower deck. The bunk bed was positioned against the wall of the room. The Accused then left the room, leaving the door to E’s room slightly ajar.16Foot Note 16×Victim’s CS, at para 7.The Victim talked to E for a short while before E stopped responding. The Victim inferred that E was tired and wanted to sleep.17Foot Note 17×NE 4/10/2017, p 58 lines 14–18.E fell asleep soon. As the room felt warm, the Victim was unable to fall asleep. He called E’s name three times but there was no response.18Foot Note 18×Victim’s CS, at para 8. 10 At or about 11.15pm on the same day, the Victim saw a dark figure entering the bedroom. The Victim estimated the time to be around 11.15pm because he had checked his watch approximately 10 or 15 minutes before and he saw that it was 11.00pm or 11.05pm.19Foot Note 19×NE 3/10/2017, at p 61.He saw that the figure was wearing a pair of spectacles and had short hair resembling the Accused. The light from the hallway allowed him to see that it was indeed the Accused when the door opened wider. The Accused entered the room and then closed the door, leaving it ajar with light coming in from the hallway.20Foot Note 20×Victim’s CS, at para 9.The Victim stated in his Conditioned Statement (“CS”) that he was then lying on the bed with his back facing the ceiling.21Foot Note 21×Victim’s CS, at para 9.He clarified when testifying in court that he was lying on the bed with his head near the ladder. He was lying sideways22Foot Note 22×NE 4/10/2017, at p 42.with his chest facing the wall, but with his head facing up and tilted slightly to the left and his face aligned with the ladder. His left shoulder blade and his rib cage were facing the ceiling.23Foot Note 23×NE 4/10/2017, at p 59, lines 22–28, p 60 lines 3–5.His body was closer to the wall than to the outer edge of the bed.24Foot Note 24×NE 3/10/2017, pp 62–63. 11 The Victim feigned sleep out of respect for the Accused’s earlier instruction for him to sleep. Nevertheless, he opened his eyes a little to see what was going on.25Foot Note 25×Victim’s CS, at para 9.The Accused then stepped onto the lower deck of the bunk bed on which E was sleeping and the Victim heard a very soft “crack” sound.26Foot Note 26×NE 3/10/2017, at p 64 lines 2–4.The Accused was standing towards the end of the bed away from the ladder.27Foot Note 27×Victim’s CS, at para 10.The Victim saw his face above the railing of the upper bunk and observed him to be checking on whether E and the Victim were asleep by looking up and down.28Foot Note 28×NE 3/10/2017 at p 65 lines 17–19.According to the Victim, the mattress of the upper bunk reached approximately the Accused’s upper chest.29Foot Note 29×Victim’s CS, at para 12; NE 4/10/2017, at p 46 at lines 24–26.The Accused dragged the Victim by his kneecaps, causing his whole body to move closer to the railing of the bunk bed.30Foot Note 30×NE 4/10/2017, at p 42 line 23.The Accused then spread the Victim’s legs. He proceeded to touch the Victim’s penis from outside his shorts by moving one finger around his penis in a circular motion for a few seconds. The Victim tried to move closer to the wall hoping that the Accused would stop but he was not able to do so because the Accused held his kneecap “pretty tightly”.31Foot Note 31×NE 3/10/2017, at p 66 lines 1–5. 12 Thereafter, the Accused pulled the Victim’s shorts down to his thighs and exposed the Victim’s penis. The Accused then touched the Victim’s exposed penis with his finger (subject of the first charge). The Victim testified that he was “shocked” and felt “frightened of what he [was] going to do next”.32Foot Note 32×NE 3/10/2017, at p 66.The Accused subsequently left E’s room and the bedroom door was left ajar.33Foot Note 33×NE 4/10/2017, at p 66 lines 9–11.The Victim did not pull up his shorts because he did not want the Accused to know that he was awake earlier on should the Accused return.34Foot Note 34×Victim’s CS, at para 11; NE 3/10/2017, at pp 65–66. 13 About a minute later,35Foot Note 35×NE 3/10/2017, at p 67.the Accused did return. Once again, he stepped onto the lower deck of the bunk bed and stood on it. The Accused leaned forward and bent his neck over the Victim’s groin area. He closed his mouth around the Victim’s exposed penis. According the Victim, it was “like he was going to eat something” and he did so for a few seconds (subject of the second charge).36Foot Note 36×Victim’s CS, at para 12.The Accused stopped momentarily and repeated the same action.37Foot Note 37×Victim’s CS, at para 12.He then left E’s room for a short while before returning to place his mouth around the Victim’s penis in the same manner again (subject of the third charge). He then pulled up the Victim’s shorts and left the room.38Foot Note 38×Victim’s CS, at para 13.The Victim was “really shocked” by what the Accused did.39Foot Note 39×NE 3/10/2017, at p 68.All this time, the Victim’s face was in the same position.40Foot Note 40×NE 3/10/2017, at p 67. 14 The Victim decided that he did not want to stay at the Accused’s residence any longer and climbed down the bunk bed. He “wanted to go to a safe place straightaway”.41Foot Note 41×NE 3/10/2017, at p 68 lines 19–21.He checked on E and found that E was lying close to the wall and facing the wall.42Foot Note 42×NE 3/10/2017, at p 69.He knelt on the mattress and tapped E on the shoulder three times. E did not respond, so he whispered E’s name but there was again no response. After he packed his belongings inside E’s room,43Foot Note 43×NE 3/10/2017, at p 69.he proceeded to the Accused’s bedroom on the second floor of the residence with the intention of telling him that he wanted to go home because he was not feeling well.44Foot Note 44×Victim’s CS, at para 14.There, he saw the Accused lying on the bed using his laptop on his knees. He informed the Accused that he wished to call his father (B) to send him home because he had a headache and a stomach ache. The Accused told him that it might be migraine. AW then came out of the attached bathroom and said that it might be too late to contact B. The Victim nonetheless insisted on calling him. AW then passed their home telephone to the Victim who called B and told him in French to pick him up. The Victim went to retrieve his belongings from E’s room where E was still sleeping in the same position.45Foot Note 45×NE 3/10/2017, at p 72.Thereafter, the Victim went downstairs to the first floor with the Accused and AW to wait for B to arrive.46Foot Note 46×Victim’s CS, at paras 14–15. 15 I flesh out the reactions of the Victim upon B’s arrival in greater detail at [106] to [109]. It will suffice to note at this point that when B arrived shortly after, B reminded the Victim to watch his manners and thank his hosts. The Victim gave the Accused a high five and got into B’s car. Once in the car, he told B what had happened to him. B confronted the Accused and his wife. The Accused flatly denied the Victim’s allegations. B and the Victim then left to return home. Events subsequent to 31 October 2015 16 The Victim stated that he stopped being friends with E because E stopped talking to him on 2 November 2015, which was the Monday after the incident.47Foot Note 47×NE 3/10/2017, at pp 37 lines 11–14 and 77 lines 21–23. 17 The Victim did not speak to his parents about what had happened on the night of 31 October 2015 after that night because it was “a sensitive topic” and he preferred not to talk about it.48Foot Note 48×NE 3/10/2017, at p 78 lines 17–21 .",
        "Evidence of the Victim’s father (B)": "18 B first received a text message from AW on the night of 31 October 2015 regarding the Victim. B replied by a text message to ask AW to tell the Victim to call him. Over the phone, the Victim told B to come and pick him up fast. Sensing that something was wrong, B immediately drove to the Accused’s residence.49Foot Note 49×NE 5/10/2017, at p 18 lines 2–26. 19 When B arrived at the Accused’s residence, he found that the Victim did not look normal and was eager to leave. B recalled that he had asked the Victim to say goodbye to the Accused before leaving, but did not recall how the Victim did this.50Foot Note 50×NE 5/10/2017, at p 58 line 23 to p 59 line 14.Once outside, he recalled that the Victim “just disappeared” and “swiftly went into the car”.51Foot Note 51×NE 5/10/2017, at p 21 lines 7–14.In the car, the Victim asked B to promise that he would not disclose what he was about to hear to anyone and the Victim then told him what the Accused had done in E’s bedroom.52Foot Note 52×NE 5/10/2017, at p 21 line 28 to p 22 line 5.B was shocked and alighted from the car to confront the Accused. At this time, the Victim was crouched on the floorboard of the backseat of the car. 20 When B confronted the Accused, the Accused claimed that B’s accusations were untrue as he had been in his room using his computer at the material time. Although angry, B left the Accused’s residence to tend to the Victim who was “scared” and “hiding” in the car.53Foot Note 53×NE 5/10/2017, at p 22 lines 23–30.Subsequently, B called his wife (“C”), who was in New York at that time, to inform her of what had happened. B later contacted CF, the counsellor from the Victim’s school, and informed him of what had happened. On 2 November 2015, B lodged a police report in relation to the incident at the Accused’s residence.",
        "Evidence of the Victim’s mother (C)": "21 On 31 October 2015 at noon, New York time, C received a call from B and was shocked to hear that E’s father had touched the Victim’s penis and put the Victim’s penis in his mouth. B informed her that he had been watching rugby at home when the Victim called and “insisted” to be picked up from E’s house.54Foot Note 54×C’s CS at para 6, found at Agreed Bundle (“AB”) 22.She also gathered that when B reached the Accused’s residence, he observed that the Victim was “not his usual cheerful self”.55Foot Note 55×C’s CS at para 7.The Victim went straight to the rear seat of the car, and told B what happened as he was about to drive off. B then went to confront the Accused and the Accused did not say much, but AW intervened.56Foot Note 56×C’s CS at paras 8 and 9, AB 23.B then drove the Victim home and upon reaching home, the Victim asked to take a shower.57Foot Note 57×C’s CS at para 10. 22 The following day, C emailed the Victim’s teacher (JR) to seek help as to what to do. JR suggested speaking to the school counsellor CF. B spoke to CF and the latter suggested lodging a police report. B informed C that he did so.58Foot Note 58×C’s CS at para 11.",
        "Evidence of the Victim’s teacher (JR) and counsellor (CF)": "23 JR corroborated that C did call her on 1 November 2015 and informed her that the Victim had been molested at a sleepover at a friend’s house the previous night. JR stated that C was in shock, and she told C that she would call the Victim’s school counsellor, CF, as quickly as she could, and assured C that the school would do everything to help. 24 JR recounted that the next day, she and CF met the Victim. They told the Victim that his parents had informed them about what happened, and assured the Victim that he could speak to them if he needed. JR opined that in the first two weeks following the incident, the Victim seemed “very serious” and “was not smiling for those weeks”; they knew “something was different about him because he looked very preoccupied” and there were “times where [the Victim] was so needy that he insisted on seeing [CF] right away”. On those occasions, the Victim “appeared agitated and as though there was something he needed to share with [CF]”.59Foot Note 59×JR’s CS at para 9, found at AB 25. 25 CF confirmed that JR had told him what had happened to the Victim. He then received a call from B on the night of 1 November 2015, who informed him about what had happened to the Victim. B told him that after picking the Victim up, the Victim’s first words were something to the effect of “[he was] never sleeping here again” or “[he did not] want to sleep there again”. 26  CF recounted that B had told him that he had tried contacting staff from the Victim’s school because he was lost as to what he should do. CF then informed the principal of the school.60Foot Note 60×CF’s CS at para 9.The next day, on 1 November 2015, CF met the Victim with JR, and he recalled that the Victim “looked very tentative and nervous”. The Victim wanted to tell two of his friends what had happened, but CF counselled him not to. CF was advised by an officer from the Ministry of Social and Family Development (“MSF”) that the case should be reported to the police, and CF conveyed this to B. CF added that later that afternoon, the Victim approached him and told him that he was nervous about talking to the police. The Victim also kept asking if the Accused had done what he did to the Victim to other kids. Subsequently, the police contacted the school and came down to speak to some of the parents and the students. The Victim also told his two friends what had happened, in CF’s presence. 27 CF reported that the Victim raised a lot of questions such as “why [him]” and “why did [the Accused] choose [him]”, and was fearful that the Accused would retaliate and go over to his house at night. The Victim had a very obvious fear that the Accused was “watching him and waiting to have revenge”. He also expressed that he looked forward to leaving Singapore during summer break and felt “frustrated” at the number of times he had to recount the events.61Foot Note 61×CF’s CS at para 16.C also recounted the Victim having said similar things to her.",
        "Expert evidence": "28 The Prosecution produced a report from Peter Douglas Wilson (“Wilson”) from the HSA, who conducted experiments on whether E’s bed could support the different combinations of weights resultant from the alleged actions, and sound experiments on the level of noise produced during the alleged offences. The Prosecution also sent the Accused’s laptop to the Technology Crime Forensic Branch (“TCFB”) for analysis.62Foot Note 62×AB 51.Sixty-seven obscene images (“the obscene images”) were found in the laptop. Activity logs were found on the laptop as stated in Annex A, B and D of the report by TCFB (“the TCFB report”).63Foot Note 63×TCFB Report at para 12, AB 53.",
        "The Defence’s case": "29 The Accused’s defence was a complete denial of what the Victim claimed had happened in E’s room.",
        "The Accused’s evidence": "30 The Accused agreed that the three sleepovers did take place at his residence. During the first sleepover, the Victim, E and two other boys played with Nerf guns and light sabers while he was sitting on the ground floor doing his work. Occasionally, E would ask him to join the games. All he did was to hold the Nerf guns while seated on the sofa to shoot bullets at the boys.64Foot Note 64×NE 1/2/2018 at p 35 line 17 to p 36 line 2.During the second sleepover, the Accused denied ever going up to the upper bunk of any bed, telling the boys a scary story and having the Victim sit on his lap. He also denied asking the Victim to take a shower, and denied that there was any practice of his sons sleeping without underwear.65Foot Note 65×NE 1/2/2018 at p 36 line 22 to p 37 line 32. 31 AW had invited the Victim and two other boys for a sleepover on 30 October 2015, but due to conflicts in scheduling, C asked if the Victim could stay over at the Accused’s residence for a sleepover on 31 October 2015, Halloween night, instead. AW agreed.66Foot Note 66×NE 1/2/2018, at p 38 lines 23–31.On 31 October 2015, the Victim, E and two other boys went trick-or-treating in the neighbourhood around the Accused’s residence, and came back to the Accused’s residence at about 9.30pm. At 10.11pm, the Victim and E were counting the number of sweets that they had collected, and this was evidenced by a photograph taken in E’s room with a time stamp of 10.11pm.67Foot Note 67×Exhibit D2; Exhibit D13.At 10.13pm, the Accused sent the photograph and a text message stating the number of sweets the Victim and E had collected to B.68Foot Note 68×NE 1/2/2018, at p 43 lines 15–23; Exhibit D13.According to the Accused, he went down to the ground floor after that and relaxed on the sofa.69Foot Note 69×NE 1/2/2018, at p 44 lines 27–28.Thereafter, E and the Victim asked him to play Mad Libs with them. The Accused told them he was too tired but E pleaded with him to go up to his room in eight minutes, seeing that the StarHub cable box placed at the landing of the staircase showed the time as 10.32pm.70Foot Note 70×NE 1/2/2018, at p 45 lines 21–30. 32 The Accused testified that he went up to E’s room at about 10.50pm.71Foot Note 71×NE 1/2/2018, at p 46 line 6.When he reached the room, E was already on the lower bunk bed and the Victim was on the upper bunk bed. During the game of Mad Libs, the Accused remembered the Victim yelling out “penis” and “sexy” “very clearly and loudly” every time.72Foot Note 72×NE 1/2/2018, at p 46 line 30 to p 47 line 3.The game lasted for about two to four minutes. The Accused then switched off the lights and left. He closed the door to E’s bedroom fully when he left.73Foot Note 73×NE 1/2/2018 at p 47 lines 12–13.He could still hear E and the Victim giggling inside the room.74Foot Note 74×NE 1/2/2018, at p 47 lines 8–21.According to the Accused, he did not ask the Victim whether he was a light or heavy sleeper.75Foot Note 75×NE 1/2/2018, at p 47 lines 22–23. 33 Subsequently, the Accused went to the ground floor and saw four boys still playing PlayStation games. He remembered that at exactly 10.58pm, the boys reminded one of them that he had two minutes to get home before he got into trouble with his parents.76Foot Note 76×NE 1/2/2018, at p 48 lines 21–27.That boy went home, and the rest of the boys went up at about 11.10pm. The Accused followed them up. The Accused’s eldest son (“S”) went to his own bedroom on the second level, and AW picked up spare toothbrushes from the master bedroom for R’s two friends who decided to sleepover. Eventually R, his two friends, the Accused and AW were all on the third floor. The Accused sat on the edge of R’s lower bunk bed and the boys started bouncing balls in the basketball hoop area in the hallway outside R’s room while taking turns to use the bathroom. AW was tidying up the hallway. R’s bedroom was across the hallway from E’s room.77Foot Note 77×NE 1/2/2018, at pp 50 lines 1–5.Eventually, the boys went to R’s room and closed the door. The Accused could still hear them laughing and talking in the room. The Accused testified that he went down to S’s room on the second floor but AW stayed on the third floor to continue tidying up.78Foot Note 78×NE 1/2/2018, at p 50 line 28 to p 51 line 2.After speaking to S for a short while, he crossed the hallway to his own room just as AW was coming down the stairs from the third floor. Both of them proceeded to their bedroom, and the Accused laid down on the bed to use his laptop.79Foot Note 79×NE 1/2/2018, at p 51 lines 6–21.The Accused said that this was at 11.21pm since the TCFB report stated that his laptop resumed from “suspend” mode at 11.21pm. 34 According to the Accused, he heard a soft knock on the door after that, and the Victim walked in. The Victim requested to call B because he had a stomach ache and a headache. While AW helped the Victim to call B, the Accused offered to get some water for him. He went down to the ground floor, and the Victim followed him down voluntarily.80Foot Note 80×NE 1/2/2018, at p 53 lines 1–18.On the ground floor, the Accused handed the Victim a glass of water and the Victim drank it. They did not “really talk”. The Victim then went back up to the master bedroom and the Accused followed him. The Accused testified that the Victim appeared “totally calm” and “very friendly”.81Foot Note 81×NE 1/2/2018, at p 53 lines 22–29.Thereafter, the Victim called B and spoke to him in French. The Accused, AW and the Victim then proceeded to the ground floor to wait for B.82Foot Note 82×NE 1/2/2018, at p 54 lines 5–10. 35 The Accused recounted that the Victim was “actually quite talkative” and “actually asked if he could come over for another sleepover” while waiting for B to arrive. The Victim also described his symptoms in more detail to the Accused and AW, and told them that his younger brother was ill.83Foot Note 83×NE 1/2/2018, at p 54 lines 20–32.After a while, B arrived. B thanked the Accused and AW and was apologetic for causing them to stay up late. The Victim also thanked the Accused and AW for hosting him, and gave the Accused a high five before they left.84Foot Note 84×NE 1/2/2018, at p 55 lines 6–16. 36 About three or four minutes later, the Accused saw B’s car coming back to his residence. The Accused opened the front door and B got out of his car. B reported that the Victim said that the Accused had touched his private parts.85Foot Note 85×NE 1/2/2018, at p 55 lines 18–30.The Accused was shocked. B requested to see AW, and later repeated the Victim’s allegations to AW.86Foot Note 86×NE 1/2/2018, at p 56 lines 1–5.AW then asked to speak to the Victim. B opened the backdoor of the car and they saw the Victim on the floorboard behind the driver’s seat. B asked the Victim to repeat what he had said and told him that he was there to protect him, but the Victim did not say anything. AW was also asking the Victim what had happened. The Accused testified that he was getting “a little bit angry” and told the Victim that he “must [have been] dreaming or imagining or something”. The Accused said that what was alleged did not happen, and the Victim “actually nodded”.87Foot Note 87×NE 1/2/2018, at p 56 lines 8–23.The Accused recalled that the Victim “seemed embarrassed” and “looked to be more scared of his father than anybody else”. He “seemed terrified of his father”, and was not crying.88Foot Note 88×NE 1/2/2018, at p 56 line 28 to p 57 line 4. 37 The Accused denied all the allegations made by the Victim. He stated that E always slept on the outer edge of the lower bunk bed because he always felt that the upper bunk bed was going to collapse on him and because he got a better draft from the air-conditioning if he slept on the outer edge.89Foot Note 89×NE 1/2/2018, at p 48 lines 7–14.",
        "The Accused’s spinal injury": "38 A substantial ground of the Defence was that it was highly improbable that the Accused had committed the alleged offences on account of the spinal injury that he had been suffering from since 2011 when he fell off an elephant while holidaying in Thailand. Dr Yegappan Muthukaruppan (“Dr Yegappan”), who had been treating the Accused since March 2011, testified that the Accused had nerve impingements at his lower back and neck and that his condition had been getting progressively worse.90Foot Note 90×NE 7/2/2018, at pp 5 lines 30–32; 6 lines 1–4.The Accused had been prescribed a brace, strong painkillers and a nerve stabiliser for his spinal injury, and had discussed the option of undergoing spinal fusion surgery although it was decided that the surgery should be postponed.91Foot Note 91×NE 7/2/2018, at p 11.Dr Yegappan testified that stepping up onto the mattress of the lower bed from the floor, which was about 57cm above the floor, would have caused the Accused “quite a lot of pain”.92Foot Note 92×NE 7/2/2018, at p 12 lines 24–25.It was “highly unlikely” for the Accused to have leaned over the upper bunk and brought his mouth down over the penis of someone lying on the mattress and it would have caused him “moderate to severe pain”.93Foot Note 93×NE 7/2/2018, at p 14 lines 1–21.If the person lying on the mattress was lying on his side with his body facing the wall, it would have “even more unlikely” for the Accused to have put his mouth over the person’s penis.94Foot Note 94×NE 7/2/2018, at p 15 lines 1–2.It was highly improbable for the Accused to have dragged a person who weighed about 27.6kg for about 40 to 50cm across the mattress. This would have caused the Accused “moderate to severe back pain”.95Foot Note 95×NE 7/2/2018, at p 16 lines 23–27.Running would also have been very unlikely for the Accused, given his condition.96Foot Note 96×NE 7/2/2018 at p 17 lines 24–26. 39 Dr Yegappan also opined that the Accused had not overstated the severity of his condition in the three letters he had sent to Dr Yegappan in 2012, statinginter aliathat he could not sit in one position for long, that the pain was getting worse over the past few months, and that he still could not have his children or anything heavy on his lap.97Foot Note 97×NE 7/2/2018, at p 37 line 6.Dr Yegappan concluded that while it was nevertheless possible for the Accused to have done the actions alleged by the Prosecution, doing them would have caused him moderate to severe pain.98Foot Note 98×NE 7/2/2018, at p 38 lines 1–5.",
        "Evidence of E, R and AW": "40 The accounts of E, R and AW were substantially the same. E testified that during the second sleepover, none of his friends, including the Victim, took a shower. His father did not go up to the upper bunk of any bunk bed, nor did he tell a scary story, nor did he have the Victim sit on his lap.99Foot Note 99×NE 5/2/2018, at p 109 lines 9–20.As for the third sleepover, E testified, similarly to the Accused, that he saw the time was 10.32pm when he asked the Accused to play Mad Libs with him and the Victim in eight minutes.100Foot Note 100×NE 5/2/2018, at p 113 lines 3–8.After a while, the Accused went up to play Mad Libs and E recalled that the Victim kept shouting “penis” and “sexy” during the game.101Foot Note 101×NE 5/2/2018, at p 114 lines 1–18.Thereafter, E stated that his father switched off the lights and left the room. He did not ask the Victim if he was a light or deep sleeper.102Foot Note 102×NE 5/2/2018, at p 116 lines 1–3.E testified that after his father left, he talked with the Victim for a while before the Victim started “tossing and turning” as if he was having a “seizure”. He stood up and checked that the Victim was okay. He saw that the Victim was lying close to the wall and was lying on his stomach, with his head at the headboard end.103Foot Note 103×NE 5/2/2018, at p 116 lines 12–32. 41 E further testified that while in his room, he could hear balls being bounced, the toilet flushing and his mother talking to his brother and his friends. Thereafter, his mother popped her head into his room and then left without saying anything.104Foot Note 104×NE 5/2/2018, at p 117 lines 23–32.E recalled the Victim climbing down the ladder and leaving after that. He thought that the Victim was going to the bathroom. The Victim never tapped him nor called out his name. He remembered the clock in his room showing 11.30pm.105Foot Note 105×NE 5/2/2018, at p 118 lines 8–16.E then fell asleep.106Foot Note 106×NE 6/2/2018, at p 47 lines 1–32.E also added that he was “not really good friends” with the Victim even before the material night.107Foot Note 107×NE 6/2/2018, at p 5 lines 14–16. 42 AW remembered that the time was 10.58pm when one of R’s friends was reminded that he had two minutes to get home.108Foot Note 108×NE 2/2/2018, at p 96 line 23;After that boy left at 10.58pm, the rest of the boys went upstairs at about 11.00pm or 11.10pm. Her eldest son (S) went to his room on the second floor, while AW went to get toothbrushes for R’s two friends. Thereafter, on the third floor, R and his two friends, J and N, bounced balls where the basketball hoop was and took turns to use the bathroom.109Foot Note 109×NE 2/2/2018, at p 97 lines 17–30.The Accused was sitting on R’s bed while AW was tidying up the hallway on the third floor. After getting R and his two friends to go to bed, the Accused and AW switched off the lights. The Accused went down to S’s room while AW stayed on the third floor to clean up. She then went to check on E and the Victim. She saw that E was still awake, and saw the Victim tossing. The Victim was lying on his stomach, with his face facing the wall. He was close to the wall and his head was at the headboard end (the end furthest away from the ladder).110Foot Note 110×NE 2/2/2018, at pp 98–99.She testified that the door to E’s room was fully closed before she checked on them, and she similarly closed the door when she left.111Foot Note 111×NE 2/2/2018, at p 99 lines 8 and 31.When she went down the stairs, she met the Accused at the hallway of the second floor and both of them then went to the master bedroom.112Foot Note 112×NE 2/2/2018, at p 101 lines 1–7.The rest of her testimony was essentially the same as the Accused’s. She reiterated that the Victim’s demeanour when he wanted to contact B to go home was “calm”, and it was “impossible” for a nine-year-old to remain so calm if what he alleged had actually happened to him.113Foot Note 113×NE 5/2/2018, at p 44. 43 Both E and AW also gave the same evidence as the Accused, that E ordinarily slept on the outer edge of the lower bunk bed because he was afraid of the upper bunk bed collapsing and to get a better draft from the air-conditioning.114Foot Note 114×NE 2/2/2018, at p 96 lines 7–16; NE 5/2/2018, at p 117 lines 5–18. 44 R gave evidence that he remembered the time to be 10.58pm when one of his friends had to leave.115Foot Note 115×NE 6/2/2018, at p 88 lines 1–12.After proceeding to the third floor, R and his two friends bounced balls at the hallway on the third floor and took turns to use the bathroom.116Foot Note 116×NE 6/2/2018, at p 98 lines 1–27.He also testified that after his parents closed the door to his room and switched off the lights, he opened the door to check if anyone was outside and then continued chatting with his friends.117Foot Note 117×NE 6/2/2018, at p 90 lines 1–13.",
        "Inconsistencies in the Victim’s testimony": "45 The Defence submitted that there was no corroborating evidence or DNA or fingerprint evidence, and the Victim’s testimony was not credible and did not meet the threshold of being unusually convincing because of numerous inconsistencies in his evidence. The alleged timings of incidents 46 The Defence pointed to different timings in the Summary of Facts and the Victim’s conditioned statement as to when Mad Libs was played in E’s bedroom. In his cross-examination, the Victim testified that it was possible that it was about 10.50pm when he played Mad Libs with E and the Accused in E’s room.118Foot Note 118×NE 4/10/2017, at p 8 line 18.However, upon his attention being drawn to his conditioned statement, he changed his testimony and stated that he had played Mad Libs before 10.30pm.119Foot Note 119×NE 4/10/2017, at p 51 line 2.In the Summary of Facts prepared by Investigation Officer Dave Ng Soon Tien (“IO Ng”) on 2 November 2015, it was stated that the Accused left the bedroom around 9.30pm.120Foot Note 120×Exhibit D8, at para 5.In the report produced by Dr Cai Yiming (“Dr Cai”) after interviewing the Victim to determine if he was fit to give evidence in court, it was stated that the Accused entered E’s room at around 11.00pm and not 11.15pm, as claimed by the Victim on the stand.121Foot Note 121×NE 4/10/2017, at p 63 lines 12–13.The Defence submitted that the Victim was unable to give any explanation for the inconsistencies.122Foot Note 122×Defence’s closing submissions at para 6 and 7. What happened during each entry by the Accused 47 The accounts given in the Victim’s conditioned statement and in his oral testimony differed (see [11] above) from the Summary of Facts, which stated that the first entry by the Accused took place at about 9.50pm and that the Accused merely entered and left the room.123Foot Note 123×Exhibit D8, at para 6.The Summary of Facts further stated that during the second entry, the Accused touched the Victim’s penis outside his clothes; during the subsequent occasions, the Accused put his mouth around the Victim’s penis once during each re-entry. It was not stated in the Summary of Facts that the Accused had pulled up the Victim’s shorts after the last re-entry. The Victim testified during cross-examination that the Summary of Facts was incorrect.124Foot Note 124×NE 4/10/2017, at p 76.The Defence submitted that the Summary of Facts would have been based on what the Victim said when the alleged accounts were still fresh in his mind.125Foot Note 125×Defence’s closing submissions at para 30. 48 Reference was again made to the report prepared by Dr Cai which sets out the Victim’s account of the offences. Only two entries into the bedroom appeared to have been recorded.126Foot Note 126×Psychiatric report prepared by Dr Cai, found at AB 76; NE 4/10/2017, at p 78 lines 1–2.The Victim disagreed with this detail in Dr Cai’s report.127Foot Note 127×NE 4/10/2017, at p 77.But this detail was similar to the version CF provided: his evidence was that the Victim reported only two entries into the bedroom.128Foot Note 128×CF’s CS, at para 6.Furthermore, the text message sent by B to AW the following day after the incident suggested that the Accused had pulled down the Victim’s shorts only on the second entry and not the first entry. The Victim’s explanation for this was that there must have been a misunderstanding between him and B.129Foot Note 129×NE 4/10/2017, at p 71 line 8. The Victim’s sleeping position 49 The Defence submitted that there was a material change in the Victim’s evidence regarding his sleeping position when the alleged first entry by the Accused took place.130Foot Note 130×Defence’s closing submissions at paras 62–67.In his conditioned statement, the Victim stated that he was sleeping with his back facing the ceiling.131Foot Note 131×Victim’s CS, at para 9.This gelled with E’s testimony that he saw the Victim lying close to the wall, and “lying on his belly”.132Foot Note 132×NE 5/2/2018 at p 116 lines 16–32.It was also corroborated by AW, who testified that when she checked on them, she saw the Victim lying in the same position as E had described.133Foot Note 133×NE 2/2/2018 at p 99 line 10–13.However, during cross-examination, the Victim explained that he was sleeping with his left shoulder blade and rib cage facing the ceiling; thus, he was lying on his right, with his chest facing the wall. Other instances showing that the Victim was not credible 50 Apart from various “improbabilities” in the Victim’s account, some of which I shall address in due course in evaluating the Victim’s testimony (see [101]–[102] below), the Defence pointed to the following instances which showed that the Victim was not credible: (a) The Victim claimed in his conditioned statement that when the Accused stood on the lower bed, the mattress on the upper bunk was at the level of the Accused’s upper chest.134Foot Note 134×Victim’s CS at para 12.However, as the Reach Experiment conducted by the HSA (exhibit P43) showed, the level of the mattress would only be at the belly button of someone of the Accused’s height. (b) The Victim testified that he had told his parents upon returning home after the second sleepover that the Accused had entered the bathroom while he was having a shower.135Foot Note 135×NE 3/10/2017 at p 51 lines 4–12.However, B and C recalled only being told about this after the incident on 31 October 2015.136Foot Note 136×NE 5/10/2017 at pp 15 lines 24–31; 16 lines 3–12; 75 lines 8–13.. (c)  The Victim’s testimony that the Accused got him and two other boys onto the upper bunk in R’s bedroom during the second sleepover was contradicted by the evidence of IO Then Lee Yong (“IO Then”). IO Then testified that he was told that the incident took place in E’s bedroom instead.137Foot Note 137×NE 3/10/2017 at pp 15 lines 11–13; 16 line 1.Moreover, the two boys who were present were not called by the Prosecution to testify. (d) Although the Victim had been taught by the school counsellor to shout “no” and get away from anyone who was about to touch him inappropriately,138Foot Note 138×NE 4/10/2017, at pp 26–28.he did not follow what he had been taught and instead kept quiet when the alleged incidents occurred.",
        "Possible reasons for the Victim to fabricate the allegations": "51 The Defence offered three possible reasons why the Victim would falsely implicate the Accused. I shall go through them in detail below at [114] to [122]. I summarise these reasons here. First, it was suggested that the Victim was afraid for having disturbed B when B was watching the “live” telecast of the rugby World Cup final that night. Second, it was suggested that the Victim had made up these allegations as a form of attention-seeking behaviour because of his emotional distress at his parents undergoing a divorce. Third, it was suggested that the Victim had been shaken by the Halloween atmosphere that night, and could thus have imagined the sexual assault. 52 The Defence further suggested that the Victim could have imagined acts of a sexual nature occurring because he had been sexualised at school, for example, by being exposed to discussions about oral sex in the social media group chats among students of his school.139Foot Note 139×NE 6/2/2018 at p 91 line 29.",
        "The Victim’s father (B) was not entirely truthful": "53 The Defence submitted that although B was quick to bolster the Victim’s allegations, his evidence revealed inconsistencies with that of other witnesses. For instance, the Victim admitted that he did give a high five to the Accused and had thanked him before leaving the house. However, B testified that he could not recall the Victim giving the Accused a high five nor saying goodbye to the Accused and AW.140Foot Note 140×NE 5/10/2017 at pp 20 line 25; 58 lines 25–26.Another instance related to the Victim’s reaction upon being asked to repeat what he had said to his father to the Accused and AW. The Victim’s account was that he had refused to do so; this was corroborated by the Accused and AW.141Foot Note 141×NE 3/10/2017 at p 75 lines 1–7; NE 4/10/2017 at p 21 lines 14–20.However, according to B, the Victim responded by pointing to the Accused or saying something along the lines of “he was the one”.142Foot Note 142×Victim’s father’s CS at para 8. 54 B further testified that he told AW that he was going to report the matter to the police on the night of the incident.143Foot Note 143×NE 5/10/2017 at p 33 lines 28–31.This was denied by AW. Subsequently, B testified, to the contrary, that calling the police was not even on his mind at that time because he had to deal with the situation that his son had been sexually abused.144Foot Note 144×NE 5/10/2017 at p 35 lines 1–4.He stated that it was only on the following day that he was advised by CF to lodge a police report.145Foot Note 145×NE 5/10/2017 at p 38 line 3–4.He also gave evidence that contradicted the Victim’s testimony in respect of having thrown away the pyjamas he had worn on the night of the incident and having told B so. B testified that he did not know what had happened to the Victim’s pyjamas;146Foot Note 146×NE 5/10/2017 at p 41 lines 6–9.he assumed that the pyjamas had been washed, and this was what he told the police.147Foot Note 147×NE 5/10/2017 at p 1 line 20.In the light of the inconsistencies, the Defence submitted that B was not entirely truthful.",
        "Explanations for the obscene images": "55 The Accused also objected to the admissibility of the obscene images found in his laptop. In the event, I held that the obscene images were inadmissible. Nevertheless, the Defence sought at length to provide explanations for their existence in the Accused’s laptop. The Accused claimed that the obscene images were “temporary internet files from browsing websites” related to a sexual performance-enhancing drug (“affected research websites”) which he had accessed in the course of his research work at his previous company (“MAP”) or after he left his company when he was working on a case study on the launch of the drug (“P”).148Foot Note 148×NE 2/2/2018, at p 53 lines 1–3; p 56 lines 1–2.The Accused claimed that he had purchased his laptop from MAP when he left, and there was no total reformat of it. To support his allegation that he continued to access such websites after he left MAP, the Accused produced his report titled “A Unique Perspective on the [MAP] Launch of [the drug “P”] – Perspectives as of September 2015” (“the Report”),149Foot Note 149×Exhibit D3.which he had sent to his company’s headquarters in Italy on 10 January 2016, which was a year after he left MAP. Before the obscene images were ruled to be inadmissible, the Defence called upon its expert witness Chu Yan Ting Frances (“Frances Chu”) to give evidence that reformatting a laptop might not remove all data, and Alessandro Forlin as well as Professor Peter Lim Huat Chye (“Professor Peter Lim”) to give evidence in support of the Accused’s positionie,that affected research websites were accessed to gain insight into the potential homosexual customer base in the process of marketing P.",
        "Prosecution’s application to admit Annex C of P54": "56 I turn now to set out the detailed reasons for my rulings on two applications made in the course of the trial by the Prosecution and the Defence respectively. The first of these was the Prosecution’s application to admit Annex C of P54 as rebuttal evidence. Annex C consisted of the obscene images (67 obscene photographs in total) retrieved from the Accused’s laptop depicting persons, mostly males, engaged in sexual acts. The Prosecution based this application on two grounds: (a) to disprove the Accused’s evidence of good character,ie, that he was only sexually interested in women, pursuant to s 56 of the Evidence Act (Cap 97, 1997 Rev Ed); and (b) to rebut the specific argument of the Accused that he was not sexually interested in males.150Foot Note 150×Prosecution’s submissions on the admission of Annex C, at para 3. 57 With regard to the first ground, the Prosecution argued that by testifying on the stand that he was a heterosexual with strong family ethics/Asian values, the Accused had lowered his character shield so his character was liable to being attacked by virtue of s 56 of the Evidence Act. In relation to the second ground, the Prosecution argued that Annex C was relevant to rebutting the Accused’s allegation that he was not sexually interested in males, thus satisfying the criterion of relevance for admission of evidence under s 5 of the Evidence Act. It was also submitted that Annex C satisfied s 14 of the Evidence Act since it would go towards showing the “existence of any state of mind”, the state of mind in the present case being the Accused having homosexual tendencies.151Foot Note 151×Prosecution’s submissions on the admission of Annex C, at para 8. 58 It was only well after the defence was called that counsel challenged the admissibility of Annex C as rebuttal evidence, on the basis that this was not a matter arisingeximproviso,ie, a matter which the Prosecution could not have reasonably have foreseen,152Foot Note 152×Accused’s submissions on the admissibility of P54-I (Annex C) at paras 3 and 4.and that there was no lowering of the Accused’s character shield because evidence regarding his sexuality and family ethics were only adduced through cross-examination by the Prosecution.153Foot Note 153×NE 2/4/2018 at pp 11 and 12.Defence counsel submitted that Annex C did not arise from anything which the Prosecution could not reasonably have foreseen, and the Prosecution had been in possession of Annex C since the time a forensic examination was conducted on the Accused’s laptop (the forensic report being dated 13 May 2016). Defence counsel also submitted orally that the character of the Accused was not put in issue by him since it was the Prosecution who had led the Accused to testify about his character during his cross-examination.154Foot Note 154×NE 2/4/2018 at p 11. 59 After hearing the parties’ submissions, I dismissed the Prosecution’s application to adduce Annex C as rebuttal evidence. I opined that character was put in issue, and Annex C might be potentially relevant as a specific rebuttal in relation to the Accused’s assertions of being a family man with strong moral or ethical values. But in any event, I dismissed the application on the basis that the prejudicial effect of its admission might be higher than the probative value. Upon further consideration of the parties’ submissions, I will now elaborate on and clarify my decision to dismiss the application. 60 The statutory basis for the admission of rebuttal evidence is s 230(1)(t) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”). Section 230(1)(t) gives the Prosecution the right to call a person as a witness or recall a witness for the purpose of rebuttal, and is intended to allow the calling of rebuttal evidence based on the long-standing practice in the courts (Jennifer Marie & Mohamed Faizal Mohamed Abdul Kadir,The Criminal Procedure Code of Singapore(Academy Publishing, 2012) at paras 12.060 and 12.061). The admission of rebuttal evidence is a matter for the court’s discretion, and the threshold for allowing rebuttal evidence for both civil and criminal proceedings has been set out conclusively inPublic Prosecutor v Bridges Christopher[1997] 3 SLR(R) 467 at [51] as follows: … [the calling of rebuttal evidence] will be allowed only in the case of a matter arisingeximproviso,ieone which the plaintiff could not reasonably have foreseen. In other words where the plaintiff has been misled or taken by surprise or in answer to evidence of the defendant in support of an issue the proof of which lay upon the defendant. 61 I agreed with the Defence that the threshold for allowing rebuttal evidence was not met in the present case. Firstly, the present case did not involve a matter arisingeximproviso. The Prosecution was in possession of Annex C all along, ever since the forensic examination report was produced on 13 May 2016. Annex C was served on the Accused on 26 September 2017 before the trial commenced on 3 October 2017. On 6 October 2017, Neo Poh Eng testified on the stand that the Prosecution would not be adducing Annex C of the forensic examination report.155Foot Note 155×NE 6/10/2017 p 43, line 24.No formal application to admit Annex C was made at the close of the Prosecution’s case. Nevertheless, the Prosecution subsequently decided to refer to Annex C during the cross-examination of the Accused. The eventual attempt to adduce Annex C was made in order to rebut the Accused’s claim that he was not sexually interested in males, but this was an issue which was brought up by the Prosecution itself during its cross-examination of the Accused. The Accused did not bring up the issues regarding his family values or his sexuality at all, and his testimony in relation to these issues only arose upon being questioned by the Prosecution during his cross-examination.156Foot Note 156×NE 2/2/2018 pp 45–48.In these circumstances, it could not be argued that the matters of the Accused’s sexuality and family values aroseeximproviso, and had taken the Prosecution by surprise. Secondly, the present case did not involve an issue in respect of which the burden of proof lay upon the Accused. This was far from the situation inOsman bin Ali v Public Prosecutor[1971–1973] SLR(R) 503, where rebuttal evidence was allowed in relation to the defence of diminished responsibility, for which the burden of proof was on the defendant. In the present case, it was not the Defence that sought to show in the Defence case that the Accused had no interest in males and was a family man with strong moral or ethical values. 62 The present situation is distinguishable from a case where a defendant seeks to prove his good character; in the latter case, it is likely that the Prosecution would be allowed to adduce rebuttal evidence in reply because the situation is one arisingeximproviso, provided that the Prosecution did not foresee the Defence raising the issue. In the present case, the failure to meet the threshold for allowing rebuttal evidence alone is sufficient to dispose of the Prosecution’s application to adduce Annex C. Nevertheless, for completeness, I go on to address the other issues brought up by the Prosecution. 63 The Prosecution argued that the Accused had testified as to his good disposition or reputation and it could therefore adduce evidence as to his bad character pursuant to s 56 of the Evidence Act. The prohibition of questions as to his bad disposition and character under s 122(4) of the Evidence Act (setting out what is commonly known as the character shield) would therefore not apply. The context however was that the Prosecution had produced a document titled “Selection of … Family Pictures” depicting photographs of the Accused’s family and his annotated descriptions of them being “[a] solid family unit with a very happy, loving, 14-year marriage” with “3 wonderful children loved by their parents and raised with strong family ethics/Asian values” during the cross-examination of the Accused (later admitted into evidence and marked as P55). Upon being questioned by the Prosecution, the Accused stated that he had produced the document and sent it to IO Ng while investigations into this case were ongoing.157Foot Note 157×NE 2/2/2018, at p 47.The Accused explained that his family had “strong ethical values”, and would “always do the right thing, tell the truth”, and that he and his wife are “on top of what [their] kids do”.158Foot Note 158×NE 2/2/2018, at p 47.Unrelated to P55, the Prosecution also cross-examined the Accused as to his sexuality, whereupon he testified that he was heterosexual and had no sexual interest in males.159Foot Note 159×NE 2/2/2018, at p 45.Based on these answers to questions regarding his sexuality and P55 posed by the Prosecution, the Prosecution argued that the Accused had lowered his character shield. 64 It is unnecessary for me to make any comment as to whether being heterosexual is evidence of a person’s good character or disposition; I will analyse the parties’ submissions in the framework of s 56 because the parties had presented their submissions as such. In any event, the Accused’s evidence of having “strong ethical values” was arguably an assertion of good disposition.  I opined that character was put in issue as a result. However, upon further deliberation and analysis, I have come to the position that the Accused’s character shield was not lowered. Although P55 was produced by the Accused and P55 was intended to show that he was a person of good disposition, the Accused did not tender this document to court nor seek to have it admitted. I would not have had sight of this document and would not have known of the Accused’s claim to having strong ethical values had the Prosecution not tendered P55 to court. Similarly, the Accused’s testimony as to his sexuality only arose upon being cross-examined by the Prosecution. None of this testimony was offered by the Accused of his own accord. In such a situation, where the Prosecution has elicited this evidence through cross-examination, it may be said to have forced the Accused’s hand, and thus it could not be said that the Accused had lowered his character shield. 65 This position is in line with a purposive reading of s 56(1) of the Evidence Act, which sets out the exhaustive scenarios where the Prosecution can call evidence to establish that the accused is a person of bad disposition or reputation. Section 56(1) states: In any criminal proceedings, the accused may – (a)  personally or by his advocate ask questions of any witness with a view to establishing directly or by implication that he is generally or in a particular respect a person of good disposition or reputation; (b) himself give evidence tending to establish directly or by implication that he is generally or in a particular respect such a person; or (c) call a witness to give any such evidence. Sections 56(1)(a) and 56(1)(c) envision active steps being taken by the accused to adduce evidence as to his good character or disposition. Section 56(1)(b) uses the phrase “himself give evidence”, which may encompass giving evidence during cross-examination, but it would be consistent with the other sections to interpret s 56(1)(b) as also requiring an active step initiated by the accused to testify as to his good disposition or reputation. This must be distinguished from a situation where the Accused is simply answering questions from the Prosecution under cross-examination; such a situation is not the same as one where the accused volunteers evidence as to his good disposition or reputation of his own accord. Moreover, a restrictive interpretation of s 56(1)(b) is also warranted because s 56 is an exception to the prohibition of questions as to an accused’s bad disposition and character under s 122(4) of the Evidence Act. It is only where the three scenarios set out in s 56(1) apply that an accused’s character shield is lifted. 66 As far as I am aware, there is no Singapore authority on this particular issue,ie, whether evidence given by an accused during cross-examination as to his alleged good disposition or reputation in response to questions posed by the Prosecution can be considered a lowering of his character shield. The English case ofR v Henry Beecham[1921] 3 KB 464 (“Henry Beecham”) is helpful in this regard. In that case, the defendant in cross-examination was repeatedly asked and pressed to answer the question whether he bought the motor-car in question because it was capable of being driven at high speed and he replied at last that it “did not appeal to [him] for that reason, because [he did] not care for driving at a high rate of speed [himself]”. The Prosecution latched onto this answer and treated it as evidence given by the defendant of his good character as a driver, and sought to question him about his prior driving convictions. On appeal, the Court of Criminal Appeal held that with regard to the cross-examination, they were “bound to say that [they could not] approve of the manner in which the defendant was led by counsel for the Prosecution to give an answer which in [their] view virtually amounted to putting his character as a driver in issue. If the method by which this defendant was induced to bring his character into question were to be held legitimate, the result would be that practically any defendant might be forced into the same position”. Therefore, the court held that the defendant’s answer did not amount to him giving evidence of his good character within the meaning of s 1(f)(ii) of the Criminal Evidence Act 1898 (c 36) (UK),160Foot Note 160×The law in the UK has changed since then and currently s101 of the Criminal Justice Act 2003 (c 44) (UK) governs the admissibility of an accused’s bad character in the UK.a section similar to s 56 of the Evidence Act. 67 Similarly, in the present case, the Accused was induced to testify as to his strong ethical values and sexual orientation by the Prosecution’s questions and production of P55. Admittedly, it was the Accused who had created P55 with all its attendant annotations in the first place; however, he did not seek to adduce it in court and nothing was mentioned of P55 until the Prosecution adduced it in court. I agree with the court’s holding inHenry Beechamthat under such circumstances, it could not be said that the Accused had given evidence tending to establish his good disposition or reputation within the meaning of s 56 of the Evidence Act. 68 In the circumstances, the Prosecution cannot then rely on their second ground, which was that Annex C ought to be admissible for the purpose of rebutting the specific argument of the Accused that he was not sexually interested in males, to circumvent the prohibition on adducing evidence as to the bad disposition of the Accused after characterising the issue as a matter of character evidence pursuant to s 56 of the Evidence Act. 69 In any case, even if the Accused’s character shield was lowered and Annex C was admissible as evidence of the Accused’s bad disposition or reputation, or to rebut the specific argument that the Accused was not sexually interested in males, I found that the court should exclude Annex C in the exercise of its judicial discretion because it had greater prejudicial effect than probative value. The existence of this exclusionary discretion of the court was confirmed inMuhammad bin Kadar and another v Public Prosecutor[2011] 3 SLR 1205 (“Kadar”), where the Court of Appeal (at [51] and [53]) approved of the holding inLaw Society of Singapore v TanGuat Neo Phyllis[2008] 2 SLR(R) 239 (“Phyllis Tan”) that the court has a discretion to exclude any evidence that had more prejudicial effect than probative value.Phyllis Tanwas in turn based on the first limb set out by Lord Diplock (with whom the other judges agreed) inR v Sang[1980] 1 AC 402 (“Sang”) at 437,ie, that a trial judge in a criminal trial always has a discretion to refuse to admit evidence if in his opinion its prejudicial effect outweighs its probative value. 70 The exclusionary discretion was applied to the admission of accused persons’ statements inKadar, and it is also equally applicable in the area of character evidence, as in the present case. In fact, the area of character evidence was where the concept of excluding evidence based on its probative value being less than its prejudicial effect first took root, as canvassed by Lord Diplock inSangat 433. In the present case, the probative value of Annex C was low. Even if the contents of Annex C might be suggestive of the Accused’s homosexual tendencies, they did not necessarily indicate that he must have been sexually attracted to pre-pubescent males. The prejudicial effect outweighed the probative value since the photographs might nevertheless colour the court’s view as to the Accused’s sexual orientation and suggest that he was therefore more predisposed to commit the offences he was charged with. For the above reasons, I therefore refused the Prosecution’s application.",
        "Defence’s Kadar application": "71  I shall now address the application made by the Defence. After the defence was called on 1 Feb 2018, Counsel for the Accused applied for a copy of the Victim’s statement recorded by the Police on 2 November 2015, pursuant toKadarand s 147 of the Evidence Act. There were two grounds cited for this application: (a) the alleged material discrepancies and contradictions between the Victim’s testimony in court and the Summary of Facts produced by IO Ng, and between IO Ng’s testimony in court and the Victim’s testimony; and (b) the subsequent amendment of the first charge to remove the words “over his shorts” from the charge as originally framed.161Foot Note 161×Charge dated 4 October 2016 (exhibit D1).The alleged discrepancies between the Summary of Facts and the Victim’s testimony have been set out above at [47]. The defence also contended that IO Ng testified that during the second sleepover at the Accused’s residence, the Accused, the Victim and two other children were on the upper deck of the bunk bed in E’s room and not in R’s room.162Foot Note 162×Accused’s submissions on the application for production of the Victim’s statement(s) at paras 25 and 26. 72 The Prosecution resisted the application, on the basis that the grounds for disclosing witness’ statements under s 259 of the CPC were not applicable and that there had been no breach of the disclosure obligations set out inKadar. 73 After hearing submissions from both parties, I dismissed the Accused’s application for the disclosure of the Victim’s statement recorded on 2 November 2015. It is apposite to emphasise that what was at issue was a disclosure application. The CPC does not prescribe a statutory obligation to disclose unused material (Kadarat [102]). Section 259(1) of the CPC, as cited by the Prosecution, and s 147 of the Evidence Act, as cited by the Defence, govern the admissibility of witnesses’ statements, which is a separate issue from disclosure. The Prosecution’s duty of disclosure is purely rooted in general principles of common law (Kadarat [110]) and the court’s power to enforce this duty arises from the inherent jurisdiction of the court to prevent injustice or an abuse of process (Kadarat [112]). 74 The court inKadarhas set out the materials that the Prosecutionmustdisclose to the Defence, but these do not include material which is neutral or adverse to the accused. It only includes material that tends to undermine the Prosecution’s case or strengthen the Defence’s case (Kadarat [113]). In relation to the phrase “material … that might reasonably be regarded as credible and relevant”, it refers to material that isprima faciecredible and relevant based on an objective test (Kadarat [114]). There is a presumption that the Prosecution has complied with the disclosure obligation and this presumption is only displaced if the court has sufficient reason to doubt that the Prosecution has complied with the disclosure obligation (Lee Siew Boon Winston v Public Prosecutor[2015] 4 SLR 1184 (“Winston Lee”) at [184]). 75 In the present case, the Accused failed to raise a sufficient reason for the court to doubt that the Prosecution had complied with its disclosure obligation. The first ground raised concerned the alleged discrepancies between the Summary of Facts and the Victim’s testimony in court, as well as between IO Ng’s testimony and the Victim’s testimony. From the outset, the Prosecution rightly pointed out that the Summary of Facts was not prepared or produced by the Victim, but by IO Ng. The Victim had no knowledge as to how it was produced and no control over its contents. IO Ng testified on the stand that he had prepared the Summary of Facts on 2 November 2015 and had included information from both the Victim and the Victim’s father (ie, not solely from the Victim).163Foot Note 163×NE 9/10/2017, p 37 line 13 and p 41 lines 3–8.Thus, defence counsel rightly conceded during the trial that the words in the Summary of Facts were not necessarily the Victim’s.164Foot Note 164×NE 4/10/2017, at p 76 lines 5–12.Any inconsistency in the Summary of Facts could not be directly attributed to the Victim. The Summary of Facts was produced for investigative use, and its purpose was to provide a quick brief to any officer assigned to the case and to Dr Cai for him to have some brief background facts to assess the Victim’s fitness to testify in court. For the purpose of this assessment, Dr Cai’s own report was a brief one-page summary of the interview. It was notable in this regard that Dr Cai had also not relied on the Summary of Facts, but had obtained facts required for his assessment directly from the Victim.165Foot Note 165×Dr Cai’s clerking sheet (exhibit P53).Moreover, the account of the events that the Victim gave on the stand remained consistent under cross-examination, and he consistently testified that the version in the Summary of Facts was not correct.166Foot Note 166×NE 4/10/2017, at pp 53 lines 1–24; 56 lines 1–18.The Victim testified that he could not remember whether he gave the police the account contained in the Summary of Facts, but the account did not seem correct.167Foot Note 167×NE 4/10/2017, at p 76 line 17.In addition, the Defence did not cross-examine IO Ng as to whether he had accurately prepared the Summary of Facts and as to which information in the Summary of Facts came from the Victim. 76 Highlighting the inconsistencies between the Victim’s testimony in court and the Summary of Facts, which was not prepared by him and not entirely based on information provided by him, is not sufficient to bring the Victim’s statement recorded on 2 November 2015 into the two categories set out inKadarat [113]. InWinston Lee, the High Court held that the “shifts” in the victim’s evidence from “touching, to pressing down to squeezing are not material nor do they alter the main thrust of the complaint’s version of events” and “the use of the word chest and breast are not sufficiently material to raise reasonable grounds for belief that the complainant had told differing versions about the incidents to the police” (at [190]). Thus, the High Court inWinston Leefound that there were no reasonable grounds for the belief that the Prosecution had not complied with itsKadarobligation. Similarly, the inconsistencies in the present case were not sufficiently material to raise reasonable grounds for belief that the Victim must have told widely differing versions about the incidents to the police. The allegations of fellatio and outrage of modesty were stated in both accounts to have taken place on the night of 31 October 2015, and the differences in the timing and the attributions of a particular act to a particular re-entry were insufficient to raise reasonable grounds for the belief that the Victim had told a materially different version in his statement recorded on 2 November 2015. This was even more so given that the Summary of Facts was not produced by the Victim and the Victim had no control over how it was produced. 77 The present case was different fromAOF v Public Prosecutor[2012] 3 SLR 34 (“AOF”), where the Court of Appeal held that the Prosecution should have disclosed the victim’s police statements in the light of,inter alia, the significant discrepancies in the frequency of the alleged rapes (at [152]). InAOF, the victim’s testimony regarding the frequency of alleged rapes over a few years was internally inconsistent (at [130] and [144]). In the present case, on the other hand, the Victim was consistent in his oral testimony regarding his account of exactly what had happened, and all the accounts pointed to fellatio and outrage of modesty having taken place on the night of 31 October 2015. 78 In relation to IO Then’s testimony that the Victim told him that the Accused went up to the upper bunk bed of E’s room (instead of R’s room), I did not place weight on this discrepancy because IO Then testified in re-examination that he had conducted the same experiment on both the bunk beds in E and R’s rooms, and all these experiments were based on the boys’ accounts.168Foot Note 168×NE 3/10/2017, at p 28 lines 11–14 and p 29 lines 1–7.The Victim was clear and consistent in his testimony that it was the bunk bed in R’s room that he had climbed on with the Accused and two other boys during the second sleepover.169Foot Note 169×NE 3/10/2017 p 44 lines 13–20.The Prosecution offered reasonable explanations why the two other boys were not available to testify and I did not think their absence during the hearing was material. In any event, any discrepancy as to which bed was involved during the second sleepover did not go so far as to show that the Victim’s statement recorded on 2 November 2015 would be exculpatory material that was likely to be admissible and objectivelyprima faciecredible and relevant to the guilt or innocence of the Accused, or material likely to be inadmissible but yet provide a real chance of pursuing a line of inquiry that leads to material likely to be admissible and that might reasonably be regarded as credible and relevant to the guilt or innocence of the accused. 79 The Prosecution did not specifically address the second ground of the application submitted by the Defence,ie, the subsequent removal of the words “over his shorts” from the first charge as it was originally phrased. Nevertheless, I found that this amendment to the first charge was insufficient to show that the Victim’s statement recorded on 2 November 2015 would fulfil either of the twoKadardisclosure thresholds. A similar argument was also raised inWinston Lee, where the accused submitted that the change in the content of the charge, from one that stated that the accused “had slid his hand into [the victim’s] left brassiere cup to touch her left breast while pressing down” to one that stated “inserted his hand into the complainant’s left brassiere cup and touched her left breast and nipple” (at [152(b)]), was one ground for the disclosure of the victim’s police statements. The court held that the change was not material and did not alter the main thrust of the complainant’s version of events (at [190]). Similarly, in the present case, the main thrust of the Victim’s version of events that the Accused had touched his penis remained the same. 80 On a related note, the Defence suggested in its closing submissions that the first charge was not made out because the words “over his shorts” were removed from the original charge.170Foot Note 170×Defence’s Reply Submissions at para 5.I rejected this contention. The present case was unlikeXP v Public Prosecutor[2008] 4 SLR(R) 686, where the court found that the complainant had failed altogether to mention a crucial detail which was stated in the charge that was proceeded with at trial. In contrast, the first charge in the present case was amended before the trial commenced. The Prosecution retains the discretion to proceed with any amended charge at trial. The Victim’s evidence was consistent with the particulars in the amended first charge. This was not an instance of the Victim failing to mention any detail in the proceeded charge at trial. 81 In all the circumstances, I was not satisfied that the Defence had raised sufficient reason to doubt that the Prosecution had complied with the disclosure obligation set out inKadar. I therefore dismissed the Defence’s application for disclosure of the Victim’s statement recorded on 2 November 2015.",
        "My decision (I): evaluation of the Prosecution’s case": "82 The present case centred on my evaluation of the quality of the evidence, and whether there was adequate proof of the charges beyond reasonable doubt. Essentially, it was the word of the Victim against that of the Accused. 83 The Defence was a complete denial of the Victim’s allegations. Much of the trial involved attempts to show that the Victim had purportedly given differing accounts of the incident to different witnesses at different times, and that he was not a credible witness.",
        "The corroborative evidence": "84 I begin by examining two related facets – whether there was corroboration of the Victim’s allegations, and whether his testimony was “unusually convincing”. 85 Our courts have rejected the strict approach to corroboration laid down inThe King v Baskerville[1916] 2 KB 658, in favour of a more liberal approach as laid down inPublic Prosecutor vMardai[1950] MLJ 33 (“Mardai”), at 33. The Court of Appeal inAOF v Public Prosecutor[2012] 3 SLR 34 (“AOF”) at [173] reiterated the endorsement of the more liberal approach, quotingMardaiwith approval: It would be sufficient … if that corroboration consisted only of a subsequent complaint by complainant herself provided that the statement implicated the Appellant and was made at the first reasonable opportunity after the commission of the offence. 86 Whether a complainant’s previous statement can be corroborative evidence is also codified in s 159 of the Evidence Act, which states: Former statements of witness may be proved to corroborate later testimony as to same fact 159.In order to corroborate the testimony of a witness, any former statement made by such witness, whether written or verbal, on oath, or in ordinary conversation, relating to the same fact at or about the time when the fact took place, or before any authority legally competent to investigate the fact, may be proved. 87 However, even if the complainant’s statement can be corroboration, it might be of less additional evidential value because it is not independent corroboration. The court inKhooKwoon Hain v Public Prosecutor[1995] 2 SLR(R) 591 expressed a caution along these lines (at [49]): although s 159 has the effect of elevating a recent complaint to corroboration, the court should nevertheless bear in mind the fact that corroboration by virtue of s 159 alone is not corroboration by independent evidence because it is self-serving. The Court of Appeal inAOFconcluded that “whilst the failure to meet the strict standards ofBaskervillecorroboration does not rule out the relevance of evidence, this deficiency is likely to adversely affect the weight of the evidence which the court concerned may accord to it” (at [177]). 88 Applying the law to the present case, I found that the Victim’s contemporaneous complaint to B as soon as B arrived at the Accused’s residence was corroborative evidence. It satisfied s 159 of the Evidence Act: the Victim’s complaint to B was a statement made in ordinary conversation relating to the same sexual assaults about the time when the sexual assaults took place. There was no delay between the offences and the statement – it was made at the earliest opportunity that the Victim had. However, keeping in mind that the statement was not wholly independent, I placed reduced weight on it. Coupled with my assessment of the Victim’s demeanour and his credibility, as I shall explain below, the corroborative statement strongly buttressed the veracity of the Victim’s account. 89 There was further corroboration in the form of the observations of the Victim and his reactions immediately after B had picked him up from the Accused’s residence. Reasonable explanations were also given by IO Then and B as to why further potentially corroborative DNA and fingerprint evidence were not obtained in the course of investigations. The presence or absence of DNA evidence in the Accused’s own residence was neither here nor there, and as B had explained, he had told the police that the Victim’s pyjamas had been washed, unaware that they had actually been disposed of.",
        "The Victim’s testimony and demeanour": "90 Where there is a lack of corroborative evidence, the testimony of a victim of a sexual assault must be “unusually convincing”. InHaliffiebin Mamat v Public Prosecutor and other appeals[2016] 5 SLR 636, the Court of Appeal explained at [28]: InPP v MohammedLiton Mohammed Syeed Mallik[2008] 1 SLR(R) 601 (“Liton”) at [38], this court held that to be “unusually convincing”, the witness’s testimony must be “so convincing that the Prosecution’s case was proven beyond reasonable doubt, solely on the basis of the evidence”. Elaborating further at [39], the court held that a complainant’s testimony would be usually convincing if the testimony, “when weighed against the overall backdrop of the available facts and circumstances, contains that ring of truth which leaves the court satisfied that no reasonable doubt exists in favour of the accused”. As this court held inAOFat [115], the relevant considerations in determining whether a witness is unusually convincing arehis or her demeanour, as well as the internal and external consistencies found inthe witness’ testimony. [emphasis added] 91 There was no independent corroboration in the present case. Yet even if little or no weight was placed on the Victim’s corroborative statement to B, I found that the Victim’s testimony was unusually convincing. The Victim was a credible witness who gave evidence in a frank and forthright manner. His evidence withstood the test of rigorous cross-examination and was consistent in all material particulars. From my observation of his demeanour, he was candid and showed no tendency whatsoever towards embellishment, exaggeration or pretense. 92 When confronted with the inconsistent versions in the Summary of Facts (see [46]–[47] above), the Victim was firm in pointing out which parts were not accurate, and maintained his account of events on the stand.171Foot Note 171×NE 4/10/2017, at p 75.Under fairly intense cross-examination, the Victim remained firm and measured in his testimony. His account of the three offences was unshaken under cross-examination. He was able to point out exactly what was erroneous in the Summary of Facts and correct them. One such instance from his cross-examination is illustrated below:172Foot Note 172×NE 4/10/2017, at p 75 lines 10–18. Q Alright, and at the second re-entry, it says: ''He moved his finger in the victim's groin area when he was fully clothed before he left the bedroom.\"  So, at the second re-entry, all that is alleged here is that he moved his finger around your groin area. Correct? Nothing else is said here.  A No, this is incorrect. As I've mentioned before, this is supposed to go on the first time he came in, not the second time, and on the first time, he also pulled down my shorts and touched my private part without my clothes on---without my shorts on. 93 Another similar instance is as follows:173Foot Note 173×NE 4/10/2017, at pp 75 at lines 27–30; 76 at lines 1–4. Q And then, if I read on: \"'The defendant continued doing the same act another two more times with an interval of a few seconds before the victim went to the defendant’s master bedroom.”  Right? So after the third re-entry, there were another two more times of re-entries.  A But this is incorrect. The sequence is incorrect of what he did and when he did it. 94 The Victim was very clear in his testimony that there were three separate instances of the Accused entering E’s room and committing the offences particularised in the charges (see [11]–[12] above). He refuted attempts by the Defence to suggest that he had described up to five separate instances of entry into the bedroom. He was also unfazed when the Defence attempted to attack his evidence by pointing out that the report produced by Dr Cai stated the timing of the first offence to be around 11.00pm instead of 11.15pm. He testified that when he told Dr Cai 11.00pm, he was referring to the time he checked his watch, which was about 10 minutes before the first offence. If Dr Cai meant that the offence took place at 11.00pm, he maintained that it was “incorrect”.174Foot Note 174×NE 4/10/2017, at p 63 lines 12–23.Dr Cai’s clerking sheet for the Victim indeed recorded that “… around 11.05pm (he pressed light on watch & saw the time) accused touched his pp; ‘using fingers to tickle’ his penis”.175Foot Note 175×Exhibit P53This showed that the Victim had told Dr Cai that he had checked his watch at around 11.05pm, so there was no discrepancy between what he had told Dr Cai and his account on the stand. Instead, Dr Cai’s clerking sheet corroborated the Victim’s testimony. I would also add that Dr Cai was not cross-examined by the Defence on this aspect of his report and this appeared to be an attempt at splitting hairs over minor variations in the description of timings. 95 The inconsistencies that the Defence pointed out at [46]–[49] and [50(b)]–[50(c)] above related primarily to the discrepancies between the Victim’s testimony and the reports by other Prosecution witnesses. I begin by observing that there would almost inevitably be discrepancies when the Victim’s accounts and the reports of other persons who had obtained information from him are compared and examined. He had after all been asked to provide detailed information on numerous different occasions to different persons, and at times, he had to repeat his story as well. There would invariably be differences in the details each time the incident was described. 96 Moreover, the accounts of the other Prosecution witnesses such as Dr Cai and CF were second-hand information, and could have been shaped by their own perception and understanding as to what had happened. As the court inCheanSiong Guat v Public Prosecutor[1969] 2 MLJ 63 explained, “[s]ometimes what appears to be discrepancies are in reality different ways of describing the same thing, or it may happen that the witnesses who are describing the same thing might have seen it in different ways and at different times”. Those witnesses might also differ in how they chose to record or digest the Victim’s account as narrated to them. For example, in the report by Dr Cai, he stated that the incident took place at about 11.00pm, although he recorded in his clerking sheet that the Victim had checked his watch at “around 11.05pm”. As for CF, his evidence was that he spoke first with B, before speaking separately with the Victim. CF’s account of the events would therefore have been shaped and influenced by these two accounts, and thus might appear to contain discrepancies. Witnesses such as Dr Cai or CF were not undertaking the role of investigation officers, and their records understandably might not be absolutely precise or comprehensive. The Summary of Facts, although produced by IO Ng, served the purpose of a preliminary document to aid Dr Cai in conducting his assessment, and might not be pinpoint accurate as to the exact timings and the exact sequences of events. As IO Ng described, the Summary of Facts was prepared for the purpose of allowing anyone who was assigned to the case to have a “quick run” of the case and contained “raw information”.176Foot Note 176×NE 9/10/2017, at p 35 lines 29–32. 97 Further, some of the discrepancies pointed out by the Defence were to my mind either overstated or inconsequential. I have earlier explained why I dismissed theKadarapplication made by the Defence as I did not think there was a proper basis for the application; the alleged inconsistencies were not sufficiently material to raise reasonable grounds for belief that the Victim had told widely differing versions about the incidents to the police. For example, with regard to the Victim’s testimony that he saw the railing of the upper bunk bed to be at the upper chest level of the Accused (see [50(a)] above), it could be due to a parallax error in his perception given that he was lying down when looking at the Accused. Moreover, the railing could be more accurately described as being at the stomach level of someone similar to the Accused’s height in the Reach Experiment instead of at the belly button level as described by the Defence. 98 In another instance, it was highlighted that JR, the Victim’s teacher, had mentioned in her conditioned statement that the Victim was awakened upon being touched by someone,177Foot Note 177×JR’s CS, at para 4.and that this differed from the Victim’s claim that he had not fallen asleep.178Foot Note 178×NE 3/10/2017 at p 62 lines 12 – 14.This, however, ignored the fact that JR’s account was based on what she had heard from C, and was multiple hearsay – the Victim had related his account to B, who in turn conveyed it to C, who in turn conveyed it to JR. Discrepancies were thus unavoidable and indeed to be expected. 99 I was also fortified in my findings as to the Victim’s credibility because he did not seek to embellish his answers and was a forthcoming witness. He was not evasive. He was ready to admit that he could not remember certain details and conceded that some things alleged by the Defence could have been correct. For example, he testified that he could not remember whether the Accused had told him not to wear underwear when the Accused came into the bathroom while he was showering or before his shower.179Foot Note 179×NE 3/10/2017, at p 46 lines 16–22.He also conceded that it could have been possible that he played Mad Libs with the Accused and E at about 10.50pm, instead of 10.30pm as he had suggested.180Foot Note 180×NE 4/10/2017, at p 8 lines 15–19.However, he remained resolute when testifying on the areas that he could remember, such as the fact that he checked his watch at about 11.05pm and what happened exactly during each of the Accused’s entries into E’s bedroom. 100 A number of “improbabilities” in the Victim’s account were alleged. I shall deal with them briefly. 101 First, I did not find it improbable that the Accused would commit the offences with the door to E’s bedroom ajar, or with E present on the bunk below. The Victim’s evidence was that the door was only kept slightly ajar.181Foot Note 181×NE 4/10/2017, at p 58 line 8.Although the light from outside was streaming in, no one from outside was likely to have been able to see what was taking place in E’s bedroom, as the Accused’s back was facing the door. As I shall explain later (at [161] below), E was unlikely to have been aware of what was going on either because he was fast asleep. Even if E had woken up, from his sleeping position on the lower bunk, he would not immediately have realised what the Accused was doing. It might be said that it was improbable for the Accused to have stepped on the lower bunk if E was sleeping on the outer edge of the bunk; the Accused would conceivably have stepped on E. As I explain below at [133] to [134], however, I did not accept the claim that E was sleeping on the outer edge of the lower bunk to be true. 102 Second, I did not accept that it was unbelievable that the Accused could have pulled down the Victim’s shorts without lifting his hip, or that the Accused could have dragged the Victim’s body by pulling him by the kneecaps. Neither of these actions was inherently incredible given that the Victim was a young boy who was hardly overweight or hefty. It was certainly not impossible for the Accused to have carried them out, as even his own doctor, Dr Yegappan, testified (see below at [129]).",
        "The Victim’s behaviour was consistent with that of a victim of sexual assault": "103 The Defence alleged that the Victim was not believable because he did not do as he was taught in school to deal with “bad touch” encounters,ie, to shout and push the Accused away. The Victim testified convincingly that he was afraid that the Accused would realise he was awake, and “could, like, hurt [him] because [the Accused] would be scared that [he] would tell someone else”.182Foot Note 182×NE 4/10/2017, at p 28 lines 6–14.The Victim also testified that he had tried to move closer to the wall when the Accused committed the first offence to avoid the Accused, but to no avail. It is important to keep in mind the context in which the offences occurred in determining whether the behaviour of a victim was odd. In the present case, the Victim was a nine-year-old boy spending the night in his good friend’s bedroom as a guest for a sleepover when his friend’s father, someone whom he liked and trusted, sexually assaulted him. It was highly probable that when confronted with such circumstances, a boy his age would not remember, much less put into practice, what he had been taught to do. He would not know how to react, and it would not be reasonable to expect him to be quick-witted enough to resist, let alone to confront and shout or push his friend’s father away. I found that there was nothing unusual about the Victim’s feeble and futile attempts to avoid the Accused. 104 I also found that it was not odd or surprising at all for the Victim to have gone to the Accused’s bedroom so that he could call his father to bring him home. The Victim “wanted to go to a safe place straightaway”,183Foot Note 183×NE 3/10/2017, at p 68 lines 20-21.and he did not have any means to contact B. The only way he could think of to get away from the Accused’s residence was to contact B, and to do that, the Victim needed to inform E’s parents and ask to use their phone. The Victim sought help from B immediately after the sexual assaults, using the only obvious means available to him at that time. 105 It was significant that the Victim insisted on calling B even when AW told him it was too late at night. Quite significantly, he spoke to B in French as he did not want E’s parents to know what he was telling B, and so he used French even though he usually communicated with B in English.184Foot Note 184×NE 3/10/2017, at p 71 lines 22–24, p 35 lines 23–28.According to B, French was used as a kind of “code language” used by his children.185Foot Note 185×NE 5/10/2017, at p 18 lines 13–15.The Victim recalled telling B in French to “come and pick [him] up … and … to hurry up”.186Foot Note 186×NE 3/10/2017, at p 71 lines 24–30.B similarly testified that his son had used the French words “[s]ors-moi de la”, which means “get me out of there”,187Foot Note 187×NE 5/10/2017, at p 18 lines 2–26.and the Victim sounded like he was in “distress”.188Foot Note 188×NE 5/10/2017, at p 18 lines 9–11. 106 After B arrived at the Accused’s residence, the succession of events that rapidly unfolded strongly buttressed the Victim’s allegations against the Accused. The Victim felt “relieved” and “secure” when B arrived because he “finally felt safe”.189Foot Note 189×NE 3/10/2017, at p 74.The Victim’s relief at seeing B and his reluctance to acknowledge the Accused when leaving (see [15] above), combined with his hurried entrance into the car similarly corroborated that he was in distress at that time and had wanted to get away quickly from the Accused. Subsequently, while in the car, the Victim asked B to promise him that he would not share with anyone what he was about to tell him, before disclosing that the Accused had touched his private part and put it into his mouth in E’s bedroom. B also gave the same evidence. 107 After B left the car to confront the Accused about what the Victim had said, the Victim hid on the floor of the backseat of the car because he was scared, and testified that he “went into a small [ball] because [he] got scared that something bad was going to happen”.190Foot Note 190×NE 3/10/2017 at p 75 lines 1-8.He gave evidence that he did not want to tell the Accused and AW what he had told B because he was “scared”, so he “started to cry”.191Foot Note 191×NE 3/10/2017, at p 74 line 20 to p 75 line 8.He was afraid that if he said anything, “something bad”, like “a fight” would break out, and he “just wanted to leave the unit”.192Foot Note 192×NE 4/10/2017, at p 21 lines 24–28.The Accused said something to the effect that the Victim must have been dreaming, but the Victim told B in French that he wanted to leave.193Foot Note 193×NE 4/10/2017, at p 23.B then drove him home.194Foot Note 194×Victim’s CS, at para 16; NE 3/10/2017, at p 75. 108 On the road home from the Accused’s residence, B called C, informing her of what the Accused had done to the Victim. This was corroborated by C, who testified that B sounded “panicky” and was just “shooting information”. She testified that she was left in shock and found it difficult to understand how something like that could have happened at a sleepover party.195Foot Note 195×NE 5/10/2017, at pp 77 and 78. 109 The behaviour of the Victim in taking a shower when he reached home even though it was already 1.00am in the morning was also consistent with his having been the victim of sexual assault. His explanation for doing so also reinforced his evidence that he had been sexually assaulted: he explained that he took a shower because he thought he was “all dirty, because someone’s mouth went onto my body and there were a lot of germs”.196Foot Note 196×NE 3/10/2017 at p 76 lines 14 – 15.B corroborated the fact that the Victim insisted on taking a shower, and found it unusual because it was usually difficult to get the Victim to take a shower.197Foot Note 197×NE 5/10/2017, at p 27 lines 24–30.The Victim also hid the pair of pyjamas he wore at the Accused’s residence and threw it in the garbage chute after a few days. He testified that he threw it away because it was “dirty and … would bring back bad memor[ies]”.198Foot Note 198×NE 3/10/2017, at p 77 lines 10–15. 110 Even after the incident, the Victim remained traumatised and afraid of the Accused and took steps to avoid coming into contact with him. B testified that the Victim was afraid to go by the exit of the school because it was near the Accused’s residence, and he would not play in the area of the playground closer to the Accused’s residence.199Foot Note 199×NE 5/10/2017, at p 43 line 17 to p 44 line 5.C also testified that the Victim would keep questioning why God chose him to be the one to be “punished”, that it was “really unfair” that he had to go through what he did.200Foot Note 200×NE 5/10/2017 at p 81 lines 14 – 29.He expressed suicidal thoughts. According to her, the 31st day of each month was a “sensitive date” for the Victim.201Foot Note 201×NE 5/10/2017 at p 83 lines 5 – 11.On the night of Halloween the following year, he had cried uncontrollably for three hours.202Foot Note 202×NE 5/10/2017, at p 83 lines 11–31.She further stated that the Victim would not let her park her car outside the school along the road close to the Accused’s residence.203Foot Note 203×NE 5/10/2017, at p 83 lines 11–31.Both C and CF gave evidence that the Victim felt tired and frustrated at having to repeat his account multiple times.204Foot Note 204×NE 9/10/2017, at p 17 lines 1–5; NE 5/10/2017, at p 83 lines 1–11. 111 Reference was also made in the Accused’s Reply Submissions to scientific literature which was purportedly “at odds” with the Victim’s behaviour being attributable to sexual abuse.205Foot Note 205×Accused’s Reply Submissions at p 12 para 30.This was raised to support the Accused’s attempt to show that the Victim was the “same boy”, quoting B’s words in evidence-in-chief.206Foot Note 206×NE 5/10/2017, at p 43 line 16.What B said was understood by the Accused to mean that the Victim remained unaffected after the incident. However, in my view, this was a complete mischaracterisation of B’s evidence – reading the entire context of B’s testimony, B had been commenting about the Victim’s mood changes, and his tendency not to open up readily in talking to B but to only do so “a little bit more with his mum”. Properly understood, B was therefore speaking about the Victim being “the same boy” in that context. 112 As for the references to the said scientific literature purporting to attribute the Victim’s possible behavioural issues, attention-seeking behaviour and fabrication of sexual abuse allegations to his troubled domestic situation and parental conflict, certain selected passages from various texts and online articles were cited at length in the Accused’s Reply Submissions.207Foot Note 207×Accused’s Reply Submissions at para 30, at pp 12 – 15; para 38, at pp 17 – 20.I placed no reliance on these references. Their provenance and authoritativeness was unproven and unknown. More importantly, no scientific or expert evidence was adduced at the hearing to support the Accused’s theories. The literature was injected only at the eleventh hour within the tail-end of closing submissions and was wholly untested. There was no reason why such evidence could not have been introduced earlier and appropriate witnesses called to support these theories if they were indeed relevant and reliable.",
        "The Victim had no motive to fabricate allegations against the Accused": "113 The Prosecution was correct to point out that prior to the offences committed on 31 October 2015, there had been absolutely no animosity between the Victim and the Accused. This was a particularly compelling and cogent consideration, especially when viewed alongside the Victim’s spontaneous and near-contemporaneous complaint. The Victim enjoyed going to the Accused’s residence and playing with the Accused (see [4] and [5] above), which was why the Victim had looked forward to the sleepover on 31 October 2015. B also corroborated that the Victim liked the Accused. B testified that after returning home from his first sleepover at the Accused’s residence, the Victim was “very excited from that sleepover because he said he had so much fun”.208Foot Note 208×NE 5/10/2017, at p 13 lines 13-14.The Victim shared with his parents that the Accused was “running with them, playing with them, like, he was, like, all over the place”. While B found it “weird” that an adult would spend so much time with the kids during a sleepover, he thought the Accused must be such a “great dad”.209Foot Note 209×NE 5/10/2017, at p 13 lines 10–29.B further testified that after the second sleepover, the Victim recounted that he had “the time of his life” playing with light sabers and watching movies.210Foot Note 210×NE 5/10/2017, at p 14 lines 16–25.C also testified that after the second sleepover, the Victim shared that he had a “wonderful time” and that “the father of [E was] so nice”.211Foot Note 211×NE 5/10/2017, at p 74 lines 4–15.Even E had testified that the Victim had pestered him to arrange another sleepover after the second one.212Foot Note 212×NE 5/2/2018, at p 110 lines 1–4.All this suggested that there was no reason for the Victim to bear any negative views towards the Accused. 114 The Accused offered three possible motives why the Victim would have falsely implicated him, which I have summarised above at [51]. The law, however, is not that the Prosecution must bear the burden of proving a lack of motive to falsely implicate the appellant. Rather, the Prosecution would only bear that burden if an accused is able to adduce sufficient evidence of such a motive so as to raise a reasonable doubt in the Prosecution’s case (Goh Han Heng v Public Prosecutor[2003] 4 SLR(R) 374 (“Goh Han Heng”) at [33]). It is not enough for the accused to merely allege that the victim has a motive to falsely implicate him. If it were otherwise, then, as Yong CJ pointed out, “the Prosecution would have the burden of proving a lack of motive to falsely implicate the accused in literally every case, thereby practically instilling a lack of such motive as a constituent element of every offence”:Goh Han Hengat [33]. 115 I found the motives suggested by the Defence to be baseless conjectures bordering on the absurd. The Defence adduced no evidence to support any of the motives suggested. 116 The first reason offered by the Defence was that the Victim was scared for having disturbed his father, B, when B was watching the “live” telecast of the rugby World Cup final. The suggestion was that B was angry with the Victim at having to miss the broadcast because he had to pick up the Victim from the Accused’s house, which explained why the Victim looked terrified in B’s car. There was thus a possibility that the Victim fabricated the sexual allegations against the Accused to escape B’s wrath.213Foot Note 213×NE 2/2/2018 at p 21 lines 9–14.In support of this, the Defence pointed to a previous occasion when B had yelled at the Victim during a sleepover at the Victim’s residence. According to E, B then proceeded to punish the Victim for misbehaving by pulling the Victim out of the bedroom and not letting him sleep with his friends that night.214Foot Note 214×NE 5/2/2018 at p 106 line 25. 117 I had no hesitation dismissing this outlandish suggestion. B testified clearly and consistently that he was never angry at the Victim for making him fetch him home while the rugby match was being broadcast.215Foot Note 215×NE 5/10/2017 at p 51 lines 14 – 20.He gave evidence that he recorded the match so that he could watch it with his sons the next day.216Foot Note 216×NE 5/10/2017, at p 52.It was contended that B had yelled angrily at the Victim for causing him to miss the “live” rugby match, but this was not put to the Victim. As for the prior occasion when B had yelled at the Victim, I failed to see how this was relevant; it was hardly unusual for a father to discipline his child in this way for his misconduct, especially in his own home. 118 The second reason suggested was that the Victim had made up allegations to seek attention from his parents whose divorce was having a major impact on him.217Foot Note 217×Defence’s closing submissions at para 112.But this allegation was also never put to the Victim on the stand; the issue of his parents’ divorce was briefly touched upon but the Victim’s alleged emotional distress arising from his parents’ divorce was never raised in cross-examination.218Foot Note 218×NE 4/10/2017 at p 24 line 18 to p 26 line 23.I found no basis to support this alleged motive either. 119 The third reason the Defence proposed was that the Victim might have been influenced by the Halloween atmosphere and environment while out trick-or-treating. The Victim could have been frightened by the Accused’s zombie pirate costume, or suffered a “sugar high” from eating too much candy, and either of these, or both, induced him into imagining the sexual assault. But the evidence simply did not support this notion. The Victim gave evidence that he thought Halloween was a “fun, exciting game” because he “[got] to collect candy” and “hang out with [his] friends”.219Foot Note 219×NE 3/10/2017 at p 53 line 4 – 7.He never once said that he was terrified or frightened, and he denied having eaten a lot of candy because he knew that if he had too much sugar, he would not be able to sleep.220Foot Note 220×NE 4/10/2017 at p 11 lines 22 – 25.He also indicated that he wished to keep some candy to trade with his siblings. I found absolutely no merit in the Accused’s suggestions that the Victim could have had a vividly lurid nightmare about being sexually abused, on account of being traumatized by the frenetic Halloween atmosphere or by the sight of the Accused in a zombie pirate costume with fake blood on his face. Indeed, the Accused’s case was so weak on this score that he had to resort to making annotations on photographs taken that Halloween night to suggest that children were “terrified” by the Halloween environment. As I note below at [156], the annotations were self-serving, and it could not be said that the children in the photograph looked positively terrified. 120 It bears recalling that the Defence’s theories were founded on the notion that the Victim had been sexualised at school, and could thus have imagined the sexual assault. This too was totally baseless. There was no evidence that the Victim was aware of or even privy to the online chats on oral sex in the mass chat groups that were allegedly formed by certain groups of students at his school. 121 I found that the Victim had absolutely no reason nor any incentive to falsely incriminate the Accused. It was quite inconceivable given that the Victim was good friends with E and enjoyed going to the Accused’s residence for sleepovers. The Victim “could not believe [the Accused] [did] that to [him]”,221Foot Note 221×Victim’s CS at para 12.and “felt like he sort of betrayed [him] because [he] trusted him”.222Foot Note 222×NE 3/10/2017 at p 68 lines 6–10. 122 To sum up, the Defence adduced no evidence in support of the Victim’s alleged motives for falsely implicating the Accused. In the circumstances, the burden did not shift to the Prosecution to disprove the motive:Goh Han Hengat [33].",
        "The credibility of B": "123 From my observation of B as he testified, he struggled at times to manage his emotions in recounting what the Victim had told him and how he attempted to make sense of the incident and deal with its aftermath in the wake of his troubled marriage. He came across as a completely candid witness. Like the Victim, he made no attempt to embellish his evidence and readily conceded what he did not know or recall. I accepted that he spoke truthfully and objectively. 124 The Defence highlighted the discrepancies in B’s evidence having regard to the testimonies of other Prosecution witnesses (at [53]–[54] above). However, I found that the discrepancies were not so material as to erode the credibility of B. As held inLohKhoon Hai v Public Prosecutor[1996] 2 SLR 321 at 329, in the process of testimony, “minor inconsistencies were often inevitable”, so “[t]he crux was whether the totality of the evidence was believable”. The crux of the accounts given by B and the rest of the Prosecution witnesses was materially the same. The differences in details, such as B being unable to remember that the Victim had told him that he had disposed of the pyjamas, and B testifying that the Victim had pointed a finger at the Accused outside his residence when asked to repeat what he had told B, were not consequential. They were explicable on account of B’s state of shock and confusion at the material time after the Victim revealed what had happened. It was hardly surprising that B might not have been able to remember all the details accurately because he was struggling that night to come to terms with the situation.",
        "Whether it was physically possible for the Accused to have carried out the acts": "125 The Prosecution called Wilson to give evidence that it was not physically impossible for the Accused to have carried out the alleged acts of fellatio and touching the Victim’s penis. Wilson conducted tests on E’s bunk bed with regard to: (a) whether the bed could withstand the combined weight of the Victim, the Accused and E; (b) whether any sound would be produced when an adult of the Accused’s weight stepped onto the lower bunk bed; and (c) the reach of the hand and mouth of someone of the Accused’s height over the upper bunk bed.223Foot Note 223×Peter Douglas Wilson’s HSA Report, AB 31 at para 3.Wilson’s findings were that the lower bunk bed and the ladder of the bunk bed were able to withstand the weight of the Accused; the sound produced when someone of the Accused’s weight stepped onto the lower bunk bed was between 47 to 53 decibels; and the reach of the hand of a person of the Accused’s height over the upper bunk bed was 75cm and the reach of the person’s mouth over the upper bunk bed was 23cm.224Foot Note 224×Expert report by Wilson (exhibit P47) at pp 9 and 10, AB 41 – 42.The width of the upper bunk bed was measured to be 101cm.225Foot Note 225×Expert report by Wilson (exhibit P47) at p 8, AB 40.It was also found, in relation to the Victim’s allegation that the Accused had gone up the upper bunk bed in R’s room with the Victim and two other children during the second sleepover, that both the upper bunk bed in R’s room and in E’s room could support the weight of the Accused, the Victim and two other persons of the Victim’s weight.226Foot Note 226×Expert report by Wilson (exhibit P47) at para 9, AB 34. 126 The experiments conducted by the HSA showed that it was possible for someone of the Accused’s height and weight to carry out the actions alleged by the Victim.227Foot Note 227×Expert report by Wilson (exhibit P47), see Table 4, AB 40, and Appendix 3, AB 45.Although the reach of the mouth was 23cm and the Victim testified that he was closer to the wall when the Accused entered the room, the Victim stated that the Accused had dragged him by the kneecap towards the edge of the bunk bed before spreading his legs (see [11] above). It was physically possible, given that the reach of the mouth would be 23cm (which was about one quarter of the width of the upper bunk bed), for the Accused to have fellated the Victim after dragging the Victim towards him. 127 The sound of a person of the Accused’s weight stepping onto the lower bunk bed recorded during the experiment corroborated the testimony of the Victim who said he had heard a “very soft” “crack” sound when the Accused stepped onto the lower bunk bed.228Foot Note 228×NE 3/10/2017, at p 63 line 29 to p 64 line 4.Given that the background sound level was measured by Wilson229Foot Note 229×Expert Report by Wilson (exhibit P 47) at para 30, AB 37.to be between 28 to 31 decibels with the air-conditioning switched on and 26.8 decibels by Dr Tan, the Defence sound expert,230Foot Note 230×Noise Assessment Report (exhibit D11).the sound of between 47 to 53 decibels would be soft but loud enough for the Victim to hear, as testified by the Victim.231Foot Note 231×NE 3/10/2017, at p 64 lines 2–4.Nothing much else turned, in my view, on the evidence adduced on sound levels. 128 The Accused’s main argument was that he was unable to step up onto the lower bunk bed due to the spinal fracture which he suffered from falling off an elephant in 2011. He claimed that his spinal condition had been worsening since then. I agreed with the Prosecution that the Accused’s assertions were very much exaggerated. I observed that he was able to remain seated for fairly lengthy durations throughout the course of his trial, including up to nearly two hours at a stretch, despite his claims that he could not sit in one position for durations exceeding 15 or 20 minutes on account of his spinal condition. By his own admission, the Accused did not take any painkillers when testifying in court and on the material night. He also testified that he did not wear his brace that night as it did not “look right” with his Halloween costume.232Foot Note 232×NE 1/2/2018, at p 44 line 32 to p 45 line 18.His description of his symptoms also contradicted the Victim’s account of how he (the Accused) was “running around” when playing Nerf guns with him and other boys during the two other sleepovers in 2015. The Accused denied this and then claimed not to understand the meaning of “running around”.233Foot Note 233×NE 1/2/2018, at p 88 lines 1-13.Even after being told by the Prosecution that “running around” meant literally “using the legs to run”, the Accused avoided the issue by countering that it could mean “hovering around” or “running an errand”, which were the meanings of “running around” according to American usage.234Foot Note 234×NE 2/2/2018 at p 61 lines 17 – 28. 129 The testimony of Dr Yegappan also showed that it was physically possible for the Accused to have carried out the offences. Dr Yegappan agreed with the Prosecution that the Accused’s spinal condition did not prevent him from using the stairs in his three-storey terrace house on a daily basis for two years, and this showed that his condition was “manageable” with “a large amount of painkillers”.235Foot Note 235×NE 7/2/2018, at p 21 lines 6–21.Dr Yegappan acknowledged that the Accused’s pain was “managed very well”, and agreed that his condition was under control with painkillers and physiotherapy236Foot Note 236×NE 7/2/2018, p 31 at lines 27–31 and p 32 at lines 1–12.. Dr Yegappan agreed with the Prosecution that the Accused could sit for a long period of time given that he was able to sit in the witness box for approximately two hours at a stretch.237Foot Note 237×NE 7/2/2018, at p 21 line 23 to p 22 line 3.Dr Yegappan further testified that the Accused’s spinal injury would limit his ability to go up and down a double decker bed; however, it was “not impossible” for him to do so.238Foot Note 238×NE 7/2/2018, at p 21 lines 19–26.Moreover, the Accused might have experienced pain or discomfort in standing on the lower bunk bed in committing the offences, but he would still have been able to do so.239Foot Note 239×NE 7/2/2018, at p 30 lines 7–21.The main thrust of Dr Yegappan’s evidence therefore was that while committing the offences could have caused the Accused moderate to severe pain, it was not impossible for him to have done the acts as alleged.240Foot Note 240×NE 7/2/2018, at p 38 line 1.",
        "My decision (II): evaluation of the Defence": "130 Having regard to the medical evidence, as well as the Accused’s and the Victim’s testimonies, I found that the Accused’s spinal condition was not incapacitating to the point as to render it highly improbable for him to have committed the offences. It may have required some effort on his part, but that did not mean that he could not have done the acts as alleged. Weighing this consideration against the remaining evidence adduced in support of the charges, I turn to examine various aspects of the Accused’s defence and determine whether he had succeeded in raising any reasonable doubt. 131 In evaluating the merits of the defence, the Prosecution urged the Court to focus on the Accused’s behaviour post-offence, his inconsistent evidence and vacillating explanations for the presence of obscene images found in his laptop, and his change of tactics pertaining to the admissibility of the said obscene images. The Prosecution submitted that the Accused’s evasiveness, selective recall of events and his propensity for engaging in speculation and exaggeration all pointed to a manufactured defence borne out of his consciousness of guilt.",
        "The Accused’s testimony": "132 The Accused’s testimony was often rambling and off-tangent. He did not respond in a direct manner to straightforward questions posed to him. He would interject and offer unsolicited evidence and opinions even when questions were not being posed to him.241Foot Note 241×NE 2/2/2018, at p 68 line 29 and p 83 line 27.At one point in his re-examination, I stepped in to request counsel’s assistance in guiding him before he continued to sidetrack and further expound on irrelevant matters.242Foot Note 242×NE 2/2/2018, at p 70 at line 29.His replies came across as calculated and contrived and at times inappropriately flippant. An obvious illustration of this can be seen in an instance I had earlier recounted (at [128] above). His facetious explanation of what he understood “running around” to mean in vernacular American usage was plainly inappropriate. It was no answer to speculate that this might be because “Americans are more outspoken than Asians”.243Foot Note 243×Accused’s Reply Submissions, at para 85. 133 Various aspects of his defence case were afterthoughts. An example was when he claimed in examination-in-chief that his son E would always sleep on the outer edge of the lower bunk of his bed becauseinter aliaE feared that the upper deck would somehow collapse on him. Despite the fact that this could be crucial to his defence, specifically that he could not have stepped onto the lower bunk in view of where E was allegedly sleeping, it was never put to the Victim when he was testifying that E had been sleeping on the outer edge of the lower bunk. 134 When it was pointed out to the Accused in cross-examination that the Victim was never challenged on the fact that the Victim had to place his knee onto the lower bunk in order to reach into the lower bed to tap E’s shoulder to rouse E, and that he had fabricated evidence that his son E would always sleep on the outer edge of the bunk, he disagreed and immediately attempted to refer to the contents of an art therapist report prepared on behalf of the Victim.244Foot Note 244×NE 2/2/2018, at pp 7 lines 1–6; 31–32; and p 8 at lines 1–6.The maker of this report was not called as a witness; neither was the said report admitted in evidence. There was also no explanation why this aspect of his case was again never put to the Victim. 135 In recounting the three sleepovers that the Victim had at his home, the Accused was apparently able to recall a number of details with precision only when it came to exculpating himself. For example, he offered no details in relation to the first sleepover to celebrate E’s birthday in May 2015, or for the second sleepover which took place on 10 October 2015.245Foot Note 245×NE 1/2/2018 at p 34 lines 27 – 30.He claimed that he did not recall what time the boys had slept or when they played Mad Libs, or whether the Victim had taken a shower.246Foot Note 246×NE 1/2/2018, at p 37 lines 2–6.He claimed that he did not recall when he had retired to his master bedroom, with the indignant  retort in cross-examination to the effect that he was “not walking under the stopwatch or clock”.247Foot Note 247×NE 1/2/2018, at p 97 lines 15–17.Yet he could distinctly remember only sitting on the sofa on the ground floor of his house shooting at the boys with Nerf guns248Foot Note 248×NE 1/2/2018, at p 35 lines 29–32.(as opposed to running and playing with the boys as the Victim recalled). He flatly denied ever entering the bathroom when the Victim was taking his shower and thereafter telling the Victim not to wear underwear when sleeping so that he could let his body breathe. He also denied going up to the upper bunk bed in R’s room to tell the boys a scary story and having the victim sit on his lap then. 136 Notably, when it came to furnishing details of the third sleepover, just 21 days after the second sleepover, the Accused’s memory was somehow fully intact. He offered detailed and exact timings for each activity right down to the minute. He was able to recall that at exactly 10.32pm, he was downstairs in his home when the Victim and E asked him to go upstairs to play “Mad Libs” with them. He said this was because E had specifically looked at the StarHub Cable Box to ask him if he could he could “come up in 8 minutes at 10.40”.  The Accused claimed further that he went upstairs at 10.50pm249Foot Note 249×NE 2/2/2018, at p 5 lines 20–23.and that by 11.15pm he was already in his bedroom and had not entered E’s bedroom where the Victim was sleeping on the upper bunk bed.250Foot Note 250×NE 2/2/2018, at p 8 lines 10–18. 137 The late objections raised by the defence to the admissibility of the obscene images as well as thead hocapplication for disclosure of the Victim’s police statement both pointed to these being desperate afterthoughts. At subsequent junctures, I shall address various other afterthought defences in more detail, such as his attempts to explain away the discovery of the obscene images found in his laptop, and his strenuous efforts to marshal support for his defence from his family members. I have also already explained why I disallowed the Prosecution’s application to admit Annex C of P54, which consisted of the obscene images. For the avoidance of doubt, as Annex C was not admitted in evidence, I placed no reliance on the obscene images themselves in assessing the credibility of the Accused and I did not have regard to them to ascertain whether he had any homosexual proclivities. I took the view that such an exercise was not necessary in the circumstances.",
        "The Accused’s explanations for the obscene images detected in his laptop": "138 The undisputed fact was that the obscene images were retrieved from the Accused’s laptop. Prior to his counsel raising objections to their admissibility, he had insisted that the obscene images found in his laptop were “temporary internet files from browsing websites related to [P]” which were “never downloaded or saved”251Foot Note 251×NE 2/2/2018, at p 53 lines 2–3., and had somehow emerged in his laptop “sometime between 2012 and 2015”252Foot Note 252×NE 2/2/2018, at p 77 lines 10–21.through “pop-ups” which he had not viewed. They arose either in the course of research done related to P253Foot Note 253×A prescription drug that is indicated for premature ejaculation during sexual intercourse.for MAP (Explanation 1) or alternatively after he left MAP and when he was working on a self-initiated “case study” on the MAP launch of P (Explanation 2).254Foot Note 254×NE 2/2/2018, at p 55 line 20 - 56 line 2.He qualified this by stating that if his laptop’s hard disk had been completely reformatted, the images could have entered it in the summer of 2015 when he was in the United States.255Foot Note 255×NE 2/2/2018, at p 77 lines 26–31. 139 In respect of Explanation 1, the Prosecution called Christopher Tay to give rebuttal evidence, which was not challenged by the Defence, that under MAP’s Code of Conduct256Foot Note 256×Exhibit P59.and its Web Policy,257Foot Note 257×Exhibit P60.accessing pornography, sex forums or adult websites in the course of an employee’s work was prohibited. The Accused was well aware of these prohibitions and was never granted an exemption from them.258Foot Note 258×NE 2/4/2018, at p 28 lines 13–19.Moreover, a total reformat of the Accused’s laptop had been done before his last day in the office.259Foot Note 259×NE 2/4/2018, at p 30 lines 11–12.I shall address the contentious point of reformatting further in due course. 140 It bears recalling that the Accused had initially denied flatly under cross-examination that he had to browse homosexual pornography for work.260Foot Note 260×NE 2/2/2018, at p 48 lines 30–31.He then backtracked on this answer261Foot Note 261×NE 2/2/2018, at p 59 lines 5–11.and equivocated in his defence. Significantly, when asked in re-examination how the images had appeared in his computer, the accused abandoned his claim that they were unsolicited “pop-ups”, and instead asserted that he had in fact deliberately accessed pornographic websites as part of “more targeted” online market research when marketing P.262Foot Note 262×NE 2/2/2018, at p 74 lines 23–30.He further testified that he was not surprised to learn that these images had been recovered from his laptop by the TCFB.263Foot Note 263×NE 2/2/2018, at p 69 lines 5–8.He pointed to a portion in the Report (see Exhibit D3 at page 3 of the attachment) in which he had drawn up a table of “consumer segmentation”264Foot Note 264×NE 2/2/2018, at p 69 lines 15–18.pertaining to different age groups and sexual orientation as well as different forms of sexual activity engaged in by each group which purportedly dealt with how P could be better marketed. Using this, he sought to draw a co-relation to Exhibit D20 which was another table compiled by him to deal with the obscene images found in his laptop by the TCFB to show how they fitted exactly into his “consumer segmentation” model. This was the Accused’s rather involved endeavour to convince the Court that he needed to access pornographic websites for purposes of his work. 141 When he was reminded of his initial “pop-up” claim,ie, that the said images were mere temporary pop-ups and not downloaded or accessed by him,265Foot Note 265×NE 2/2/2018 at p 84 lines 22 -26.he conveniently and quickly switched tack and explained that he had used the table found in the Report to classify the images266Foot Note 266×NE 2/2/2018, at p 84 lines 28–29.to buttress his point that he had actually accessed pornographic websites purely for work purposes. 142 Following from this, the Accused was asked how much time he had spent compiling the table in Exhibit D20 to deal with the images he had neither deliberately accessed nor downloaded or seen. The Accused’s tone and demeanour then immediately changed from his enthusiastic narrative (on how he had diligently sorted and categorised the 67 recovered images) to a repeated and stoic “I cannot recall”267Foot Note 267×NE 2/2/2018, at p 84 lines 30–32; p 85 lines 1–6.and “I answered your question” when by his own account, he had in fact prepared the document just a few days before the trial began on 3 October 2017, when he came to know of Annex C.268Foot Note 268×NE 2/2/2018, at p 67 at lines 22–29. 143 The evidence of a witness who is demonstrably economical with the truth without any good reason ought to be treated with a healthy level of caution,a fortiori, if it indicates a propensity to change his evidence as the trial proceeds:Public Prosecutor vIlechukwu Uchechukwu Chukwudi[2015] SGCA 33 at [62].  The Accused’s shifting and contradictory evidence on how the obscene images had entered his laptop showed that he was not a credible witness. He had no compunction in changing his evidence to suit his purposes. His testimony about unsolicited images spontaneously popping-up in his laptop morphed readily to him actively accessing adult websites and sex forums for purposes of market research.269Foot Note 269×NE 2/2/2018, at p 59 lines 5–11; p 74 lines 23–30.These two explanations are diametrically opposed and showed him to be a wholly unreliable witness. 144 As for the Report purportedly dated September 2015,270Foot Note 270×Exhibit D3.the Prosecution’s submission was that this was a pointless exercise borne out of a consciousness of guilt. In my assessment, it was yet another smokescreen concocted by the Accused to exculpate himself, after his laptop was seized by the investigating officer on 14 December 2015. The Accused had been terminated from his employment with MAP by end January 2015.271Foot Note 271×NE 2/4/2018 at p 24 lines 1 – 6.The Report, said to be written “as of September 2015”, was not sent by email to his company HQ until January 2016. The Accused himself conceded that he was already no longer working for MAP for a year and was not engaged as a consultant for the company HQ. He was never asked to write the Report. I agreed with the Prosecution that the Report must have been created only after October 2015 and falsely antedated by the Accused as an afterthought.",
        "Reformatting of the accused’s laptop": "145 A fair amount of time was spent at the trial on establishing whether there was a complete reformat of the accused’s laptop after he left MAP. The Accused’s explanation was that even if there was a total reformat of his laptop after he left MAP, he had still continued his research in marketing P by accessing adult websites and sex forums to write the Report. I have explained why I rejected his claims pertaining to the authenticity and purpose of the Report, and why I found his explanations for the presence of the obscene images in his laptop to be inconsistent and unconvincing. 146 Going back to Explanation 1, the accused claimed that whilst marketing P for MAP from 2012 to January 2015, he had to access such websites. Evidence was led by the Prosecution that just before his termination from MAP, a reformat of the hard disk of his laptop had been done such that if there were any images whether obscene or otherwise existing in his laptop, the reformat would have removed them and rendered them unrecoverable. And in any event, there was no reason for obscene images to be found in his laptop prior to his leaving MAP to begin with, as access to such online material in the course of work was prohibited and he had not received any exemption to do so – see [139] above. The only logical inference therefore was that the obscene images found their way into his laptop after he was terminated from his employment at MAP. 147 The Accused called a consultant in Computer Forensics, Frances Chu, as his witness. She maintained that the reformatting process would not completely erase the data in the hard disk in his laptop. However, her evidence was speculative at best and highly suspect, as she admitted that she had neither seen the Accused’s laptop nor done any tests on it. Yet she remained adamant that the laptop had not undergone a total reformat.272Foot Note 272×NE 15/3/2018, at p 110 lines 12–18. 148 Frances Chu maintained that she was correct in her opinion thatsomedata would still continue to reside in the hard disk after it has been reformatted. When she was confronted with Exhibit P58 which states specifically that from the launch of Windows Vista operating systems onwards (ie, including Windows 7), the regular reformat would write zeroes to the entire hard disk,273Foot Note 273×NE 15/3/2018 at p 116 lines 11 – 19.she was compelled to concede this based on the incontrovertible evidence.274Foot Note 274×NE 15/3/2018 at p 122 lines 2 – 32. 149 It was clear that Frances Chu did not know what the reformatting process on the Windows 7 operating system entailed. She did not test the reformatting process on the operating system to ascertain if her assumptions were correct. Further, her experience on matters involving computer forensics was limited. She had, after all, only started to delve into computer forensics in late 2012 before obtaining her Masters qualification from the University of Glamorgan in 2016.275Foot Note 275×NE 15/3/2018, at p 96 lines 12–17.She testified that in the six years since she picked up computer forensics work, she had only done 30 to 40 cases which involved data recovery from computers and handphones.276Foot Note 276×NE 15/3/2018, at p 100 lines 28–31.Despite what her CV suggested, she conceded that she was never actually called upon to do any work in the capacity of a forensic examiner during her time with the Hong Kong Police Force.277Foot Note 277×NE 15/3/2018, at p 96 lines 1–11. 150 Neo Poh Eng was recalled as a rebuttal witness by the Prosecution to prove that all the data in the Accused’s laptop was completely wiped out pursuant to the total reformat. He had been with the TCFB since 2010. He had performed over 300 examinations and data extraction of computers and handphones, of which 62 related specifically to examinations and data extractions of a computer.278Foot Note 278×NE 30/4/2018, at p 2 lines 12–14. 151 Neo Poh Eng testified that there are two forms of the reformatting process for the Accused’s laptop which was installed with the Windows 7 operating system – quick reformat and regular reformat.279Foot Note 279×NE 30/4/2018, at p 2 lines 24 – 27.From his examination of the laptop and his conduct of tests to verify his assumptions, a regular reformat had been done, and every byte in the hard disk was rewritten with a zero, thereby wiping out the existing data and rendering it unrecoverable.280Foot Note 280×NE 30/4/2018, at p 2 lines 29–31.A quick reformat would not delete all the data. Without delving fully into his detailed technical explanations, it would suffice for me to note that Neo Poh Eng’s explanations were logical and convincing and I was in full agreement with the Prosecution’s submissions in this regard. 152 For the above reasons, I placed no weight on the evidence of Frances Chu. I found that there was a complete reformatting of the Accused’s laptop which wiped out all pre-existing files, rendering them unrecoverable. This fortified my finding of the Accused’s lack of credibility in maintaining that he did not actively download any obscene images and that residual “pop-ups” must have remained within his laptop. Even if such “pop-ups” appeared in the course of accessing adult websites for research, it bears reiterating that he had flatly denied browsing homosexual pornography for work purposes to begin with, and then shifted his evidence further under cross-examination and re-examination.",
        "The evidence of Alessandro Forlin and Professor Peter Lim": "153 Prior to raising his belated objection to the admissibility of the obscene images, the Accused had called Alessandro Forlin and Professor Peter Lim to support his claim that those images were detected in his laptop because: (a) he had to access adult websites and sex forums to better market P; and (b) that homosexuals suffering from premature ejaculation should be the target demographic for marketing P as such persons would access such Internet sites to look for relevant information. 154 I mention the evidence of Alessandro Forlin and Professor Peter Lim purely for the sake of completeness. It will suffice to state that I obtained no assistance whatsoever from both witnesses. They were far from objective or reliable, venturing to put forward little more than speculative personal opinions. I was not persuaded that there was any sound basis for the entire thesis put forth by the Accusedie, of having to access adult websites at work for research and marketing purposes, and specifically targeting the homosexual/gay market segment. The proposition was dubious and fanciful and I need say no more about it or about the evidence of the two witnesses.",
        "The annotations on the exhibits": "155 The Accused tendered Exhibit D17 as proof of rectification of damage to E’s bunk bed. D17 was purportedly written by one Richard Lim, a handyman, who was not called as a witness. The Accused confirmed that the receipt was issued by Richard Lim. A close inspection of the original exhibit however revealed differences in handwriting, which were not obvious at first blush. It was only upon the Prosecution’s probing that the Accused admitted that he himself had written in details of the repair works onto the receipt. He claimed that he did not know he was doing anything wrong by doing so as he was “trying to be thorough”.281Foot Note 281×NE 2/2/2018, at p 81 lines 17–18. 156 The Accused had also annotated various other exhibits including photographs (egExhibit D2) and SMS messages (egExhibit D9) with his own comments and observations. To be fair, this was his attempt to put across his position and his own subjective interpretations, but these must also have been meant to colour the court’s assessment of the evidence. For instance, he gratuitously added his annotation of a child (not the Victim) supposedly appearing “terrified” in a photograph taken on the Halloween night in question (exhibit D2 pg 6). This could only have been intended to bolster his suggestion that the Victim was similarly affected by the Halloween atmosphere. I should add that it was not at all obvious to me that the child in question appeared “terrified”. 157 In another instance, the Accused sought to place before the court Instagram posts and related comments from various social media accounts (egSnapchat) to show the comments posted by account holders and their “friends” or “followers” purporting to have “homosexual” inclinations.282Foot Note 282×NE 4/10/2017, at p 32–34 and 5/10/2017 at p 8.The Accused again added his own annotations to the curated “examples” he had collated, to suggest that the Victim was familiar with such matters through his exposure to social media. However, the Victim had emphatically stated that he was not a “follower” of any of these social media accounts. There was also nothing to suggest that the Instagram or Snapchat accounts in question were open to “public” access or that the Victim had even viewed them. The Accused was obviously attempting to mislead the court in seeking to introduce these “examples” of the Victim’s “social media network”.",
        "Credibility of the Accused’s family members": "158 Three of the Defence witnesses called by the Accused were his own family members. I found that their evidence was rehearsed and contrived in a concerted effort to protect the Accused. I shall outline a few of my observations in this connection, focusing in particular on the evidence of E. 159 E sought to distance himself from the Victim, claiming that they were “not really good friends”.283Foot Note 283×NE 6/2/2018, at p 5 line 15.I found this to be completely at odds with the objective evidence, particularly considering that the Victim had attended at least four playdates (including a birthday celebration for E), of which three were sleepovers, at E’s residence. E’s recollection of only very specific incidents on the night in question was highly suspect. He had said that it was an uneventful night, yet he could distinctly remember looking at the StarHub Cable box and noting that it was 10.32pm when he asked his father to play Mad Libs with him. He said that he told his father to come to his bedroom in eight minutes,ie, at 10.40pm284Foot Note 284×NE 5/2/2018, at p 112 lines 18–32 and p 113 lines 1–15.and was able to recall these timings accurately even though the incident happened more than two years ago. 160 According to E, he was awake all throughout the material time until after the Victim left his bedroom. His father never came into his bedroom again after the brief game of Mad Libs. E was also certain that the clock in his room showed 11.30pm when the Victim left the bedroom, but this was the only time that he checked the clock throughout the entire night.285Foot Note 285×NE 6/2/2018, at p 49 lines 16–20.I found it difficult to accept that E was able to recall three specific timings with such precision but could not remember whether the Victim had packed his bags or was carrying or holding anything when he left the room.286Foot Note 286×NE 6/2/2018, at p 49 line 32 to p 50 line 1.Conveniently, E claimed to have fallen asleep by the time the Victim returned to retrieve his bags. He claimed that he thought the Victim was only leaving the bedroom to go to the bathroom but he did not bother to check whether the Victim needed any help, despite recalling that the Victim was repeatedly tossing and turning fitfully in bed “like he was having a seizure” and with such great intensity that it caused E to fear that the upper bunk bed would collapse on him. If so, it was unbelievable that E did nothing more than stand on his bunk to look at the Victim and then simply go back to bed again. In addition, he claimed that his mother had opened the bedroom door to check on them, but he did not convey anything to her about his observations of his friend purportedly thrashing violently on the bed “like he was having a seizure” or his fear that the upper bunk bed might collapse on him as a result. 161 Not surprisingly, E struggled to explain under cross-examination why he was able to recall only certain specific details with remarkable clarity. He was very selective in his purported recollection of what he claimed to have done, observed and remembered. The plain inference was that he was tailoring his recollection of details to support the Accused’s story. In my view, it was more likely that, as the Victim clearly and cogently testified, E was fast asleep throughout the material time, and not awake as he had claimed. 162 In certain key aspects, E’s evidence chimed all too perfectly with what the Accused had said,eg, he ascertained the time to be 10.32pm from looking at the StarHub Cable box; the Victim repeatedly used words such as “penis” and “sexy” when playing Mad Libs in his room;287Foot Note 287×NE 5/2/2018, at p 114 lines 1–21.and the Victim slept closer to the wall on his stomach, facing the wall, while he (E) slept close to the edge of his bed.288Foot Note 288×NE 5/2/2018, at p 116 lines 20–32. 163 Like E, R was somehow able to recall minor details as well as the precise timings of uneventful matters that took place more than two years ago. This echoed his parents’ evidence that the third floor was a hive of activity up to 11.15pm after R’s friend K had left at exactly 10.58pm. R also volunteered evidence of a sexually-charged school environment where risqué and dubious-sounding games like “rape tag” were played during the students’ lunch break and group chats about oral sex were purportedly common.289Foot Note 289×NE 6/2/2018, at p 91 lines 16–32.This found its way into the Defence’s Closing Submissions under the heading “[The Victim’s] Familiarity with Sexual Matters”. The only inference I could draw, however, was that R had mentioned these matters because he was put up to it by the Accused. There was no evidence whatsoever that the Victim had ever participated in these activities or was even aware of them. The evidence in this regard was never put to the Victim or any other Prosecution witness. It was plainly another afterthought. 164 Like her two sons, AW was uncannily able to remember certain very specific timings that night. She claimed that she knew that at 10.58pm, one of R’s friends (K) left.290Foot Note 290×NE 2/2/2018, at p 96 lines 20–25.R and his two other friends, J and N then went to the third floor while her eldest son (S) went to his bedroom on the second floor at 11.05 to 11.10pm.291Foot Note 291×NE 2/2/2018, at p 97 lines 20–21.She then tidied up the third floor and went to check on the Victim and E “after 11.15 pm, maybe”.292Foot Note 292×NE 5/2/2018, at p 37 lines 16–21.She claimed that the bedroom door was closed and when she went in, she saw that E was awake whilst the Victim was tossing on the upper bunk while lying on his stomach with his head at the headboard facing the wall.293Foot Note 293×NE 2/2/2018, at p 99 lines 6–13.She then maintained that she and her husband were in the master bedroom “the whole time” after she had checked on E and the Victim and switched off the light in the hallway. She insisted that it was “impossible” for a nine-year-old child to remain so calm if he had truly been sexually assaulted as alleged. 165 I concluded that the evidence of AW, E and R was stitched together to fit the Accused’s story. It was simply unbelievable that they could have genuinely recalled so many details from an otherwise uneventful night with such precision and confidence. Their testimonies smacked of collusion and could only have been planned and practised in an endeavour to assist the Accused. In this connection, E, to his credit, was honest enough to admit that his parents had convened a discussion the very next night (1 November 2015) pertaining to what had allegedly happened the night before.294Foot Note 294×NE 6/2/2018 at p 55 line 16.They instructed their sons that the Victim’s complaint was false and that they were to close ranks and not to further communicate or interact with the Victim or his close friends.295Foot Note 295×NE 6/2/2018 at p 57 lines 2-13.Evidently, they continued to maintain this stance at the trial.",
        "Objective evidence showing that the accused did not have an alibi": "166 The Prosecution compiled the following table showing the chronology of events from 31 October 2015 to the early hours of 1 November 2015 pertaining to the laptop activity and handphone text messages sent and received by both the Accused and AW.  This objective evidence did not support the Accused’s claim that he was not in E’s bedroom at 11.15pm. DateTimeIncidentRemarks31 October 20158.44:05 a.m.Laptop went into hibernation modeSee ExhibitP51, Annex A, S/N 39296Foot Note 296×NE 6/10/2017, at p 46 lines 27–31.31 October 201511.21:05 p.m.Accused’s laptop booted upSee ExhibitP51, Annex A, S/N 39297Foot Note 297×NE 6/10/2017, at p 46 lines 7–24.31 October 201511.21:11 p.m.Windows resumed31 October 201511.21:47 p.m.Accused accessed the internet (1st time)Richmedia Ad website (see ExhibitP51, Annex D, S/N 1-8)31 October 201511.28 p.m.AW contacted Victim’s father (B)“Hi [B]! I think [the Victim] is not feeling well. Do you want to talk to him.”(see ExhibitP44)31 October 201511.28 p.m.B replied almost immediately“Sure”; “Ask him to call mobile”(see ExhibitP44)31 October 201511.29 p.m. – 11.59 p.m.B arrived and interacted with the Accused31 October 201511.59 p.m.AW texted B“Please call me anytime.” (see ExhibitP44)1 November 201512.10:38 a.m.Accused accessed the internet (2nd time)Facebook, Yahoo Finance (see ExhibitP51, Annex D, S/N 9)1 November 201512.14:27 a.m.Accused accessed the internet (3rd time)LinkedIn (see ExhibitP51, Annex D, S/N 10)1 November 201512.21 a.m.AW texted B“Ask [the Victim] carefully. My husband was with me the whole time in our room with our door closed. Call me anytime.” (see ExhibitP44)1 November 201512.29 a.m.Accused texted B“Hi, [B]. Please feel free to discuss with us anytime. [AW] and I were absolutely together in our room since [E] and [the Victim] went to sleep upstairs. [The Victim] suddenly came down, knocked on our door, and said he was feeling unwell…Then [AW] had him call you with her phone… What he said is really confusing to us.”(see ExhibitP45)1 November 201512.31 a.m.B texted AW“I did check and he said your Husband came first to see if asleep. Then [the Victim] pretend he’s asleep and [then] he got his penis rubbed. Then he disappeared and then came back took [the Victim’s] Pant down and put [the Victim’s] penis in his mouth.”(see ExhibitP44)1 November 201512.56:41 a.m.Laptop entered ‘sleep’ modeSee ExhibitP51, Annex A, S/N 1-3298Foot Note 298×NE 6/10/2017, at p 51 lines 7–17. 167 The fact that the Accused’s laptop was only booted up at 11.21pm would indicate that in all likelihood he only entered his room close to that time. This was wholly consistent with the Victim’s evidence that the offences occurred at about 11.15pm. 168 The text messages sent by AW to B at 11:59pm and 12:21am showed that from the very outset, AW had sought to protect her husband without question. She made no effort to verify the grave accusations made against him. In the second text, she volunteered that she and the Accused were together “the whole time in our room with our door closed”.  The Accused echoed this in his 12:29am text which claimed that he and AW were “absolutely together in our room since E and (the Victim) went to sleep upstairs”. This, however, contradicted the Accused’s evidence of the events of the night of 31 October 2015. In his evidence-in-chief, the Accused said that after he had settled E and the Victim for the night, he had gone to get his two other sons and R’s two friends (J and N) to go to bed.  He then went up to the third floor at 11.10pm with R and his two friends and AW. He claimed that R, J and N took turns using the bathroom and playing basketball on the third floor; that after he sent them to bed, he eventually left for the second floor to talk to S in his room, leaving his wife on the third floor cleaning up the mess from the Halloween party; and that he only met up with AW thereafter on the second floor after he had left S’s room.299Foot Note 299×NE 1/2/2018, at p 49 line 4 to p 51 line 14.J and N were not called to corroborate this account, which was designed to show that the third floor was still abuzz with activity even at that hour, giving the Accused no opportunity to commit the offences at 11.15pm. He had however completely overlooked the fact that this account contradicted the text messages sent to B stating that he and AW were together “the whole time” after E and the Victim had gone to bed. Clearly, when a patchwork of lies and afterthoughts is cobbled together, some cracks will inevitably show on closer examination.",
        "Attacks on the Victim’s credibility": "169 Finally, I address how the Accused sought to turn defence into attack by impugning the Victim’s credibility in various ways. He labelled the Victim a liar, maintaining his case theory that the Victim had no qualms fabricating serious allegations of sexual assault. 170 The following instances demonstrate the extremes that the Accused was prepared to go to in painting a picture of a hyper-sexualised nine-year-old boy who had falsely accused him of sexual assault by penetration and aggravated outrage of modesty due to his overactive imagination, his “familiarity with sexual matters”, his school and/or Halloween environment and his attention-seeking behaviour. He attempted to link the Victim to social media posts commenting on “homosexual” activity (see [52] and [157] above). He put up his son R to mention the “rape tag” game and oral sex chats in school, and then suggested that the Victim would have known of or even participated in them (see [163] above). In all these aspects, there was no evidence at all to suggest that the Victim was aware of these activities or had participated in them. 171 The Accused further insisted that the Victim’s use of the word lick” to describe how he was sexually assaulted betrayed his “familiarity with sexual matters”. Even a popular song (“Party Rock Anthem”) which contained explicit lyrics became the focus of the Accused’s submissions. The song lyrics were annexed as “Exhibit B” to the Accused’s Closing Submissions, together with “Urban Dictionary” definitions (presumably sourced from the Internet) of “relevant words” from the song. 172 I saw nothing untoward in the Victim’s use of the word “lick”. It was certainly over-imaginative of the Accused to read a sexual connotation into it. The Victim had in fact alluded to a perfectly simple and innocent literal meaning when he described the Accused’s act of fellating him as follows: “like he was going to eat something” (see [13] above).300Foot Note 300×Victim’s CS, at para 12.As for the lyrics of the song “Party Rock Anthem”, this was neither referred to nor adduced in the course of cross-examining the Victim, who had said that this was his favourite song at the time where he had heard the word “sexy” used.301Foot Note 301×NE 4/10/2017 at p 10 lines 1–2.The Accused however subsequently made reference in his own cross-examination to the “explicit” lyrics in the song, which he said mentions things ranging from “oral sex to prostitution to whores”.302Foot Note 302×NE 1/2/2018 at p 91 lines 8 – 10.It will suffice to note that no formal application was made to adduce evidence of this set of song lyrics during the trial and the Victim was never given any opportunity to refer to these lyrics in “Exhibit B” while he was testifying. Moreover, there could conceivably be different versions of lyrics for popular music, including versions without explicit lyrics that are intended for general airplay. There was no basis to suggest that the Victim would have known about oral sex through his familiarity with this set of song lyrics. 173 Next, I address the Defence’s argument that the Victim was familiar with sexual matters because he used the phrase “blow me” in his evidence. This argument was founded on the Notes of Evidence of 4 October 2017 at page 42, line 12 – where the Victim is recorded as having said: “So he didn’t have to flip me over when he blow me. I was already sideways” (“the Transcribed Notes”). This point was specifically raised in a subsequent discussion in chambers mid-way through the trial when the Prosecution highlighted the likelihood of an unfortunate but inadvertent error in this segment of the Transcribed Notes. 174 I recall that I had pointed out during our discussion in chambers that I did not record the Victim saying the word “blow” in my own notes. Thus, this was a point which I had honestly not expected the Accused to take further. Regrettably, it was ultimately resurrected by the Accused, who suggested in his closing submissions that “it is difficult to imagine what other word [the Victim] could have used in that sentence”.303Foot Note 303×Closing Submissions of the Accused, p 19 at footnote 118.In any case, to lay the matter to rest, I have verified from the audio recording of the Victim’s evidence on 4 October 2017 that the actual word the Victim used was “pulled” and not “blow”. The relevant sentence thus reads: “So he didn’t have to flip me over when he pulled me. I was already sideways”. This is perfectly grammatical and entirely coherent and consistent with the context of the Victim’s evidence, where he spoke of how the Accused dragged him away from the part of the bed which was closer to the wall. It was not “difficult to imagine” the word “pulled” (or some other word for that matter, such as “turned” or “moved” etc.) being used. To my mind, this was a most telling illustration of a Defence that was desperately grasping at straws, straining to make every conceivable effort to discredit and disparage the Victim. 175 Finally, at [123] and [124] of the Defence’s Closing Submissions, the Defence argued that a procedural defect in not cautioning the Victim to speak the truth (as he did not take an oath) “[struck] at the very heart of the Prosecution’s case”. This is not supported by s 6 of the Oaths and Declarations Act (Cap 211, 2001 Rev Ed) which gives the judge the prerogative whether to caution a witness or not. More significantly, the argument that this was a fatal omission affecting the Prosecution’s case is met by s 8(a) of the Oaths and Declarations Act which states: Proceedings and evidence not invalidated by omission of oath, etc.  8.No omission to take an oath, make an affirmation or administer a caution, and no irregularity in the form or manner in which an oath is taken, an affirmation is made or a caution is administered, shall —  (a) invalidate any proceedings or render inadmissible any evidence in or in respect of which the omission or irregularity took place…",
        "Summary of findings on conviction": "176 I concluded that for all his strenuous endeavours to discredit the Victim and paint his version as a complete fabrication, the Accused had only revealed the glaring inadequacies of his own case.  At the end of the day, the Defence remained a bare denial and the Accused did not raise any reasonable doubt. No plausible reason was advanced as to why the Victim would have falsely complained that the Accused had fondled and fellated him at the sleepover on 31 Oct 2015 when he had thoroughly enjoyed previous sleepovers and the Halloween party and activities that night. 177 Having carefully considered the totality of the evidence, I found that the Victim’s testimony was unusually convincing and amply supported by objective evidence. His account was described simply, honestly, and assuredly. There was a palpable ring of truth resonating in his testimony which was internally and externally consistent in material areas. I was satisfied that the three charges were established beyond a reasonable doubt. Accordingly, I convicted the Accused.",
        "Submissions on sentence": "178 The Prosecution drew guidance from the Court of Appeal decisions inNg Kean Meng Terence v Public Prosecutor[2017] 2 SLR 449 (“Terence Ng”) andPram NairvPublic Prosecutor[2017] 2 SLR 1015 (“Pram Nair”). In these cases, the Court of Appeal laid down the revised sentencing framework for rape and sexual assault by penetration (ie,digital penetration). Reference was also made to my decision inGBR v Public Prosecutor[2018] 3 SLR 1048 (“GBR”) which introduced a sentencing framework for outrage of modesty of persons under 14 years of age. The Prosecution submitted that the sentencing frameworks from these cases were applicable in the present case. 179 InTerence Ng,the Court of Appeal adopted a two-step sentencing band approach for sentencing rape offences at [39]. The first step is to identify the sentencing band the offence falls into by considering the presence of any “offence-specific” factors. These factors relate to the manner and mode by which the offence was committed and the harm caused to the victim. Once the appropriate sentencing band has been identified, the court should derive an “indicative starting point” by determining precisely where within the range of sentences the present case falls. The second step is to identify “offender-specific” aggravating and mitigating factors relating to the circumstances personal to the offender and balance these so as to calibrate the appropriate sentence. 180 The sentencing bands for digital penetration, an offence punishable under s 376 of the Penal Code, were laid down by the Court of Appeal inPram Nairas follows (at [159]): (a)  Band 1: seven to ten years’ imprisonment and four strokes of the cane; (b)  Band 2: ten to 15 years’ imprisonment and eight strokes of the cane; (c)  Band 3: 15 to 20 years’ imprisonment and 12 strokes of the cane. 181 The Court of Appeal explained further at [160] ofPram Nairthat in formulating these sentencing bands, it was conscious that where the offence of sexual penetration discloses any of the two statutory aggravating factors in s 376(4) of the Penal Code, there is a prescribed minimum sentence of eight years’ imprisonment and 12 strokes of the cane, and that these cases should fall within Band 2. 182 A similar “sentencing bands” framework scaled appropriately for aggravated outrage of modesty offences under s 354(2) of the Penal Code was laid down inGBR. 183 Having regard to these frameworks, the Prosecution submitted that a global sentence of 15 years’ imprisonment and 24 strokes of the cane304Foot Note 304×Having regard to s 328 of the CPC which states that where an accused is sentenced in the same sitting for two or more offences punishable by caning, the aggregate sentence of caning imposed by the court in respect of these offences is capped by the specified limit of 24 strokes for an adult.was warranted to reflect the totality of the Accused’s criminal conduct as well as the harm suffered by the Victim. This was premised on the following analysis:305Foot Note 305×Prosecution’s Submissions on Sentence at para 75. (a) The sexual assault by penetration (“SAP”) charges should fall within the higher end of Band 2 (based on the framework inPram Nair). The indicative starting point should be 14 years’ imprisonment and 12 strokes of the cane, per charge; (b) The outrage of modesty (“OM”) charge should fall within the middle to the higher end of Band 2 (based on the framework inGBR). The indicative starting point should be two years’ imprisonment and three strokes of the cane; (c) An uplift from 16 to 17 years is necessary on account of the offender-specific aggravating factor (namely, evident lack of remorse). The appropriate sentence should therefore be 17 years’ imprisonment and 24 strokes of the cane; and (d) Having regard to the totality principle, as well as the fact that the three offences took place within a short span of time, the global sentence should be calibrated to 15 years’ imprisonment and 24 strokes of the cane. 184 The Prosecution highlighted the following offence-specific aggravating factors: (a) The Accused had abused his position and breached the trust placed in him by the Victim and his parents;(b) The Accused had sexually violated a young and vulnerable victim without his consent;(c) Careful planning and premeditation was involved;(d) Severe harm was caused to the Victim. 185 In mitigation, the Accused pointed to personal hardship and the physical hardship and suffering he would face in prison as a result of his back injury. However, these were not exceptional circumstances justifying a more lenient sentence. I noted that the Accused was a first offender but this was a neutral consideration in the circumstances. 186 In addition, it was submitted that the Accused ought to be deemed to have committed the offences in the second and third (SAP) charges in one transaction, and hence should only face one sentence for these two charges. With respect, I was not persuaded by the Defence submission that only one offence was in effect committed in respect of the second and third charges. The offences therein could not properly be characterised as involving repetition of several acts of the same character in a single transaction. There were separate and distinct instances involved.",
        "Determining the appropriate sentences": "187 I accepted that the relevant offence-specific aggravating factors in the present case were the Accused’s abuse of his position and breach of trust, sexual violation of a young and vulnerable victim, planning and premeditation, and the severe harm caused to the Victim. These cumulative factors brought the SAP charges within the middle to higher end of Band 2 of the sentencing framework introduced by the Court of Appeal inPram Nair. 188 The Accused’s actions were a flagrant abuse of the trust reposed in him by the Victim and his parents.  There was a significant amount of deliberation and premeditation in his conduct, which was aimed at winning the Victim’s trust and taking steps to facilitate his commission of the offences. There was also palpable psychological harm caused to the Victim, who remained fearful of the Accused and requested to be allowed to testify through a video-link facility to avoid being in the presence of the Accused and having to face him within the courtroom. The adverse impact the offences have had on the Victim was further illustrated by the pointed observations of his parents and his school counsellor. 189 As for the offender-specific mitigating factors, I was unable to discern any of note. The abhorrent nature of the offences on a young and vulnerable victim called for the sentence to be retributive, but more importantly, to have an appropriate deterrent effect, to serve both the ends of general and specific deterrence. 190 With reference to the Court of Appeal’s observations inPram Nairat [150], the Prosecution submitted that SAP (fellatio) should be considered more serious than SAP (digital-vaginal), but less serious than rape. I accepted the Prosecution’s argument that the sentencing benchmark set out inPram Nairwhich concerns digital-vaginal penetration would be equally applicable to an offence of fellatio. Its application to the present case would not cause the Accused to be prejudiced. 191 The sentencing precedents tendered by the Prosecution showed that the courts would typically impose a custodial sentence of between 10 to 12 years’ imprisonment with the mandatory minimum 12 strokes of the cane,even for offenders who plead guilty. Pertinent (unreported) precedents includePublic Prosecutor vSelvaraju Jayaselvam(Criminal Case No 14 of 2009),Public Prosecutor v Chan Kok Weng(Criminal Case No 24 of 2009), andPublic Prosecutor v PetersonEbah Jr(District Arrest Case No 32797 of 2011 and ors). 192 Of particular note wasPublic Prosecutor vChua Hock Leong[2018] SGCA 32 (“Chua Hock Leong”). In this case, the offender, a 61-year-old male, was convicted after trial for fellating a 12-year-old boy who was of low IQ, without his consent, in a male toilet within Tampines Eco Park.The offenderhad no antecedents. Hewas sentenced to the mandatory minimum term ofeight years’ imprisonment. No caning was imposed due to his age. On the Prosecution’s appeal, the Court of Appeal enhanced the sentence to 10 years and six months’ imprisonment, with an additional six months’ imprisonment in lieu of caning. 193Chua Hock Leongwas a useful comparator in my view because it involved a) a claim-trial situation, b) a young and vulnerable victim and c) psychological harm to the victim as a result of the offender’s acts. Crucially, the offence-specific factors such as abuse of trust and premeditation, which featured prominently in the present case, were not present in that case. Therefore, I agreed with the Prosecution that the sentence for SAP in the present case should exceed that inChua Hock Leong, and the aggregate sentence should correspondingly be significantly higher given that three charges were involved as compared to only one. In my view, the indicative starting point for the SAP charges should be 12 years’ imprisonment and 12 strokes of the cane per charge. 194 In addressing the offender-specific aggravating factors, the primary consideration was the Accused’s lack of remorse. The Court of Appeal inTerence Ngexplained that an offender’s evident lack of remorse can be discerned from the fact that he has made scandalous allegations in respect of the victim. In the present case, the Accused had similarly displayed a marked lack of remorse. First, he claimed trial to the offences:Terence Ngat [64(c)]. He did not spare the Victim the ordeal of testifying. The Victim had to tell his story yet again and relive the painful details of the incident while testifying in court. InChang Kar Meng v Public Prosecutor[2017] 2 SLR 68, the court recognised at [46] that victims of sexual offences are made to relive the trauma of their sexual assault when they have to attend court to give evidence and be cross-examined on it. I should add that there is no “double-counting” as this consideration is distinct from the assessment of the harm caused to the Victim, which was accounted for among the offence-specific aggravating factors arising from the commission of the offences themselves. 195 Second, the Accused’s lack of remorse was apparent from the bold and extravagant manner in which he chose to conduct his defence. He engaged in victim-shaming tactics to portray the Victim as a hyper-sexualised boy who had fabricated or imagined the sexual acts due to his alleged “familiarity with sexual matters”. He made numerous spurious allegations in a bid to discredit the Victim. This was clearly aggravating and I took this into account in arriving at the appropriate indicative starting sentence. InChua Hock Leong, the Court of Appeal had similarly noted how lack of remorse was evident from the manner in which the offender chose to conduct his defence at trial (at [9]). I bore in mind the aggregate sentence of 11 years’ imprisonment that was imposed inChua Hock Leong’scase, while noting that in both instances, the offenders were convicted after trial, and had not shown any evident remorse. 196 I turn next to consider the appropriate sentence for the OM charge. InGBR, I proposed a sentencing framework for offences involving aggravated OM under section 354(2) of the Penal Code. Three sentencing bands were suggested, and the present facts would bring this case within the middle to higher end of Band 2, as there was skin-to-skin contact involving the Victim’s private parts. Taking into account the offence-specific factors discussed above, as well as the sentence imposed inGBR, I agreed with the Prosecution that the indicative starting point should be two years’ imprisonment and three strokes of the cane. 197 InMohamedShouffee bin Adam v Public Prosecutor[2014] 2 SLR 998, Sundaresh Menon CJ laid down the applicable principles pertaining to the totality principle in sentencing where a judge is obliged to impose consecutive sentences. After giving due consideration to the totality principle, I saw no reason to make further adjustments to the indicative starting points. They were fair and proportionate to the totality of the Accused’s criminal behaviour. 198 Having regard to the sentencing precedents as well as the relevant fact-specific sentencing considerations, I considered it appropriate to impose a sentence of 12 years’ imprisonment and the mandatory minimum of 12 strokes of the cane for each of the SAP charges under s 376(1)(b) punishable under s 376(4)(b) of the Penal Code, and a sentence of two years’ imprisonment and three strokes of the cane for the OM charge. At least two of the sentences would have to be ordered to run consecutively. In my view, an aggregate sentence of 14 years’ imprisonment and 24 strokes of the cane was sufficient to send a strong deterrent message.",
        "Bail pending sentence and appeal": "199 Upon the Accused’s conviction on 6 August 2018, the Prosecution applied for the Accused’s bail to be revoked. Counsel for the Accused objected strenuously to the application for bail revocation, but I agreed with the Prosecution that the Accused was a real and substantial flight risk. His wife and children had already relocated back to the United States and they evidently had no intention to return to Singapore. He had no other kith or kin here. He was not employed, did not own any property and had no roots or relevant remaining connections in Singapore. Hence there was no reason for him to feel compelled to stay on to face his sentence. I therefore allowed the Prosecution’s application to revoke his bail. 200 After the Accused was sentenced on 31 August 2018, an application for bail pending appeal was made. There was no change to the relevant considerations which had been surfaced earlier. As the risk of the Accused absconding remained real and substantial, I refused bail.",
        "Gag order": "201 A gag order prohibiting publication or disclosure of the name of the Accused and the Victim, and any information that might lead to disclosure of the Victim’s identity, was made at the commencement of the trial. After securing the Accused’s conviction, the Prosecution sought to lift the gag order on publication of the Accused’s name so that his identity would become disclosable. I declined to do so. I was of the view that if his identity were to be made public, it would almost certainly make it much easier to ascertain the identity of the Victim, since the Accused’s immediate family including his sons who were the Victim’s schoolmates could in turn be readily identified.",
        "Conclusion": "202 For the above reasons, I was satisfied that the three charges were proven beyond reasonable doubt and I convicted and sentenced the Accused accordingly. 203 I ordered the global sentence of 14 years’ imprisonment and 24 strokes of the cane to be backdated to 6 August 2018. The Accused was denied bail pending appeal and is presently serving his sentence. The gag order prohibiting disclosure of the identity of the Victim and any information that might lead to his identification remains in force. See Kee OonJudge Christina Koh, Raja Mohan and Nicholas Lai (Attorney-General’s Chambers) for the prosecution;Selva K Naidu (Liberty Law Practice LLP) for the accused.",
        "ANNEX A – Abbreviations": "AW  – The Accused’s wife B  – The Victim’s father BE  – E’s friend (second sleepover) C  – The Victim’s mother CF  – The Victim’s school counsellor E  – The Accused’s youngest son J  – R’s friend (third sleepover) JR  – The Victim’s fourth grade teacher MAP  – The Accused’s former employer N  – R’s friend (third sleepover) P  – Sexual performance enhancement drug for premature ejaculation R  – The Accused’s second son RF  – E’s friend (second sleepover) S  – The Accused’s eldest son"
    }
}