{
    "case_title": "Public Prosecutor vShah Putra bin Samsuddin",
    "ncitation": "[2018] SGHC 266",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 This is the trial of Shah Putra bin Samsuddin (“Shah”), a 30-year-old Malaysian national.  Shah faces one charge under s 7 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (“the MDA”). The charge states that in a motor trailer bearing license plate number JJQ 4179 (“the Trailer”) at 2.20pm on 4 December 2015, at Woodlands Checkpoint, Singapore, Shah imported three packets of granular powdery substance, which was analysed and found to contain not less than 54.69 grams of diamorphine.1Foot Note 1×Exhibit A.Shah claimed trial and contested the charge by arguing that he did not have the requisite level of knowledge for the charge to be made out. 2 At the end of the trial, I reserved judgment. I now set out my decision.",
        "Background": "",
        "The undisputed facts": "3 Most of the material facts are set out in a Statement of Agreed Facts. I recount the relevant portions below. 4 Shah was 27 years old when he was arrested on 4 December 2015. At the time of his arrest, he was working as a trailer driver for Kuan Seng Transport & Trading Sdn Bhd.2Foot Note 2×Statement of Agreed Facts (“SOAF”), para 2.About a week prior to his arrest, Shah received a call from an unknown male, whom he addressed as “Boss”, requesting for help to deliver some “stuff” to Singapore. Boss offered to pay RM1000 for every delivery made by Shah. Shah agreed to perform the delivery.3Foot Note 3×SOAF, para 18. 5 Shah performed his first delivery for Boss on 3 December 2015 (“the first delivery”). On that day, Boss called Shah and informed him that he would be giving Shah’s mobile phone number to another person. An unknown Indian male (“the first unknown Indian male”) then called Shah and agreed to meet Shah at a place in Malaysia called “Pandan R&R”. Shah drove the Trailer to “Pandan R&R” and met the first unknown Indian male there. The first unknown Indian male was driving a white Perodua Viva car. At the location, the first unknown Indian male opened the Trailer’s passenger door and threw a red plastic bag towards Shah. He then closed the door and left. After this, Shah drove the Trailer containing the red plastic bag into Singapore.4Foot Note 4×SOAF, para 19. 6 At about 9.00am on 4 December 2015, Boss called Shah and asked the latter to perform another delivery to Singapore (“the second delivery”). After much persuasion, Shah agreed to do so and drove the Trailer to a bus stop near Giant Hypermart in Tampoi, Malaysia (“the Giant bus stop”). Boss told Shah to wait for two persons there. At the Giant bus stop, another unknown Indian male (“the second unknown Indian male”) riding a red and black motorcycle approached the Trailer. The second unknown Indian male opened the Trailer’s passenger door and placed a red plastic bag (“A1”) inside a compartment under the passenger seat before leaving.5Foot Note 5×SOAF, paras 20–21. 7 After about 30 minutes later, the first unknown Indian male from the previous day approached the Trailer, opened the passenger door, and threw another red plastic bag (“B1”) towards Shah. In an angry tone, he told Shah not to “give him any problem next time”. He then slammed the passenger door shut and left.6Foot Note 6×SOAF, para 22.Shah looked into B1 and saw that it contained “ganja”. “Ganja” is a street name for cannabis. Shah placed B1 in the slot above the Trailer’s radio communication console, and drove towards Singapore. 8 Shah’s arrest took place at about 2.20pm that same day. He drove the Trailer into Singapore via the Woodlands Checkpoint. At the Woodlands Checkpoint, he was stopped by officers from the Immigration and Checkpoints Authority (“the ICA”).7Foot Note 7×SOAF, para 3. 9 The ICA officers conducted a search of the Trailer, and recovered A1 from under its passenger seat. A1 contained one red plastic bag (“A1A”). Within A1A, there were three packets of granular/powdery substance (“A1A1”; A1A2”; A1A3”; collectively “the A1 packets”). The A1 packets contained the drugs that form the subject matter of the charge against Shah.  From the inside slot above the radio communication console of the Trailer, the ICA officers recovered B1. B1 contained one plastic bag (“B1A”). Within B1A, there was one block of vegetable matter (“B1A1A”) wrapped in cling wrap (“B1A1”).8Foot Note 8×SOAF, paras 3–4. 10 Shah admitted to possession and ownership of the drugs listed above. Shah was referred to officers from the Central Narcotics Bureau (“the CNB”) and was placed under arrest by the CNB officers.9Foot Note 9×SOAF, para 5.The drug exhibits were also seized by the CNB officers, and the exhibits were subsequently sent to the Health Sciences Authority on 7 December 2015 for analysis. A1A1 was found to contain not less than 18.43 grams of diamorphine. A1A2 was found to contain not less than 18.23 grams of diamorphine. A1A3 was found to contain not less than 18.03 grams of diamorphine. The drug exhibits found within A1 contained a total of not less than 54.69 grams of diamorphine. B1A1A was found to be one block containing not less than 220.3 grams of cannabis and not less than 743.8 grams of cannabis mixture.10Foot Note 10×SOAF paras 7–8. 11 The Statement of Agreed facts states that the integrity and custody of all the drug exhibits were not compromised in any way at any point of time. It also states that Shahknewthat the A1 packets contained controlled drugs, and that block B1A1A contained cannabis.11Foot Note 11×SOAF, paras 6 and 25.",
        "Statements recorded from Shah": "12 In the course of investigations, the CNB officers recorded six statements from Shah.12Foot Note 12×SOAF, para 15.There is no dispute as to the admissibility of the statements and both parties agree that the statements were given voluntarily.13Foot Note 13×SOAF, para 16,The account given in the six recorded statements generally corresponds with the facts as set out in the Statement of Agreed Facts. However, certain details from the recorded statements are absent from the Statement of Agreed Facts and I set them out below. 13 In Shah’s statement recorded under s 22 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) by Assistant Superintendent Michelle Sim on 6 December 2015 at 10.00am, Shah gave details on what transpired during the first delivery for Boss on 3 December 2015. Shah stated that after he had cleared the Woodlands Checkpoint that day, he travelled to Woodlands Avenue 6 to unload certain pre-cast concrete slabs that he was also delivering to a construction site. He was then told by Boss to wait outside the construction site. Throughout this period, Boss called him repeatedly to ask for his location. Shah “felt really uncomfortable” because he thought there was “something fishy about the red plastic bag that [he was] holding”. He then “quickly put the red plastic bag under a tree nearby” before standing about a metre away from the red plastic bag. Eventually, about 40 minutes later, a Malay male showed up. Shah picked up the bag and handed it over to the Malay male.14Foot Note 14×Agreed Bundle (“AB”), p 216. 14 In the same statement, Shah also revealed that he initially did not agree to conduct the second delivery because he felt “uncomfortable”. Apparently this was because he had not been paid for performing the first delivery on 3 December 2015.15Foot Note 15×AB, p 213.Shah revealed that Boss called him repeatedly, trying to convince him to make the second delivery. Shah initially refused, but eventually relented after Boss told him that he would be paid for the first delivery as well as the second one.16Foot Note 16×AB, pp 213–214.",
        "Shah’s testimony at trial": "15 Shah’s testimony at trial generally corresponded with the events as set out in the Agreed Statement of Facts and the six recorded statements. He did not dispute being in possession of the A1 packets.17Foot Note 17×Notes of Evidence (“NE”) Day 2, pp 15–17.His defence was that he did not know what was inside A1, because he never checked the plastic bag.18Foot Note 18×NE Day 2, p 17. 16 Shah clarified that Boss told him prior to the first delivery that the items he would be delivering were “not illegal items”, but “books and chocolates”.19Foot Note 19×NE Day 2, p 14.He also testified that he felt “uncomfortable” with making the second delivery not only because he had not been paid for the first delivery, but also because he was uncomfortable about the legality of the items he had brought in on the first delivery.20Foot Note 20×NE Day 2, pp 37–38Shah agreed that he had the opportunity to check A1 before entering Singapore.21Foot Note 21×NE Day 2, p 40.",
        "The applicable legal principles": "17 Section 7 of the MDA provides: Import and export of controlled drugs 7.Except as authorised by this Act, it shall be an offence for a person to import into or export from Singapore a controlled drug. 18 Section 2 of the Interpretation Act (Cap 1, 2002 Rev Ed), states that to import means “to bring or cause to be brought into Singapore by land, sea or air”. There are two elements to the offence of importing a controlled drug (seePublic Prosecutor vKhor Chong Seng and another[2018] SGHC 219 at [44]): (a) the controlled drug was brought into Singapore without authorisation; and (b) the accused had the knowledge that the said controlled drug was being brought into Singapore or the intention to bring the said controlled drug into Singapore. 19 InPublic Prosecutor v Adnan BinKadir[2013] 3 SLR 1052 at [70], the Court of Appeal confirmed that s 7 of the MDA did not require the Prosecution to prove that the importation of a controlled drug was for the purposes of trafficking.",
        "The key issue in dispute": "20 It is not in dispute that Shah was in physical possession of not less than 54.69 grams of diamorphine within the A1 packets at the relevant time. It is also not disputed that he had brought the diamorphine into Singapore (see [9]–[11] above). Hence, only the second element of the charge,ie, the knowledge that the drug was being brought into Singapore or the intention to bring the drug into Singapore, is in dispute. 21 The Prosecution invokes the presumption of knowledge under s 18(2) of the MDA, and argues that Shah has failed to rebut that presumption.22Foot Note 22×Prosecution’s Submissions, paras 4–5.The Defence submits that although Shah “did think [A1] may also contain cannabis or ganja”, he did not know that A1 contained diamorphine, and hence the presumption was rebutted.23Foot Note 23×Defence Closing Submissions, paras 25–26.According to the Defence, Shah did not know that A1 contained diamorphine because he did not check A1. 22 Therefore, the key issue in the present case is whether Shah had knowledge that he was importing the diamorphine contained within the A1 packets into Singapore.",
        "My decision": "23 Having considered all the available evidence, I find that Shah was wilfully blind to the fact that he was importing diamorphine into Singapore and this amounts to actual knowledge that the said drugs were diamorphine. In any case, I find that the presumption under s 18(2) of the MDA applies, and Shah has failed to rebut the presumption.",
        "Wilful blindness": "24 The Court of Appeal inTanKiam Peng v Public Prosecutor[2008] 1 SLR (R) 1 (“TanKiam Peng”) at [123] to [127] extensively considered the concept of wilful blindness in the context of the criminal law: 123 The first is that wilful blindness is treated, in law, as being theequivalent of actual knowledge… 124 … the accused is under no legal obligation not to turn a blind eye. However, if he does in fact turn a blind eye, that could, on the facts, be taken to be wilful blindness on his part. If so, this would be tantamount to actual knowledge in law… 125 The second central principle is thatsuspicionis legally sufficient to ground a finding of wilful blindness provided the relevant factual matrix warrants such a findingandthe accused deliberately decides to turn a blind eye.However, that suspicion must, as Lord Scott perceptively points out inManifest Shipping(see at [113] above), “be firmly grounded and targeted on specific facts”. Mere “untargeted or speculative suspicion” is insufficient … alowlevel of suspicion premised on a factual matrix that wouldnotlead a person to make further inquiries would be insufficient to ground a finding of wilful blindness where the person concerned did not in fact make further inquiries. What is of vital significance, in our view, is the substance of the matter which (in turn) depends heavily on theprecisefactsbefore the court. It is equally important to note that in order for wilful blindness to be established, the appropriate level of suspicion (as just discussed) is a necessary, but not sufficient, condition, inasmuch as that level of suspicionmust then lead to a refusal to investigate further, thus resulting in “blind eye knowledge” … 126 That having been said, the requirement ofsuspicionis nevertheless a vital (and, indeed, threshold) one. So, for example, if the accused makes merely token inquiries because he suspects that making more substantive inquiries might lead him to the truth which he does not want to know, that is wilful blindness. If the factual matrix was such that the accused ought to have been suspicious, the court must then consider the accused’s reasons for not making further inquiries. … 127 We would venture to state a third central principle. … it is clear that wilful blindness, being (as we have seen) the equivalent of actual knowledge, is distinct from recklessness which, theoretically at least, falls short of actual knowledge. Indeed, wilful blindness necessarily entails an element ofdeliberateaction inasmuch as to the extent that the person concerned hasa clear suspicionthat something is amiss but then embarks on a deliberate decision not to make further inquiries in order to avoid confirming what the actual situation is, such a decision is necessarily adeliberateone. …wilful blindness is a combination of suspicioncoupled with a deliberatedecisionnot to make further inquiries, whereas the recklessness that has been referred to by Prof Williams refers to recklessness in terms of the accused’s conduct in the context of circumstanceswhich would not otherwise have aroused suspicionon the part of the accused. … [emphasis in original] 25Tan Kiam Pengthus makes clear that wilful blindness is made out when suspicion which exceeds a particular threshold is combined with a deliberate decision not to make further inquiries in order to avoid the truth which one does not wish to know. The appropriate level of suspicion is an issue which turns on the precise facts of each case. 26 The Court of Appeal inTan Kiam Pengalso stated at [130] that if an accused already knows that he is carrying controlled drugs and he chooses to take an enormous risk by proceeding without establishing the true nature of the drugs, this would constitute wilful blindness. It is not disputed that Shah knew that A1 contained controlled drugs (see [11] above), and the only point of contention is that he did not have knowledge of the specific drug he was carrying because he did not check A1. This fact alone puts Shah’s conduct squarely within the definition of wilful blindness as set out inTanKiam Peng. 27 An examination of the precise factual matrix of the present case fortifies this conclusion. The overall circumstances of the first and second delivery were highly suspicions. Shah’s conduct in the face of these circumstances was a deliberate decision to turn a blind eye to the glaringly suspicious nature of the enterprise and amounted to wilful blindness. I highlight four points that demonstrate this. 28 First, Boss offered Shah a large amount of money to make an ostensibly innocuous delivery of “books and chocolates”. Shah testified that as a trailer driver, he would earn RM120 per trip for every delivery of goods made for his company.24Foot Note 24×NE Day 2, p 14.The sum of RM1000 per delivery that Boss offered to Shah was more than eight times the usual amount that Shah would earn per trip as a trailer driver for his company. 29 Second, Boss himself was a highly suspicious character. Shah testified that he had only met Boss when Boss called him one week before his arrest. Shah also did not know how Boss got hold of his number, and Boss repeatedly called Shah many times in an attempt to convince him to do a delivery. Disturbingly for Shah, Boss knew intricate details about Shah’s family circumstances, despite being completely unknown to Shah at the time.25Foot Note 25×NE Day 2, p 26.Shah himself explained that he initially rejected the offers from Boss several times because he “wasn’t confident about him”.26Foot Note 26×NE Day 2, p 27.This initial rejection indicates that Shah was well aware, even at this early stage, that the circumstances surrounding the deliveries were suspicious. 30 Third, the manner in which the first delivery was conducted, had, by Shah’s own admission, raised significant suspicions and made him feel uncomfortable on its legality  (see [13] and [16] above). To put the matter into perspective, this was plainly not a normal delivery job. It involved unknown items given to Shah by unknown persons. Shah was not told who the items were to be delivered to, but was only told to wait at specific locations for unknown persons to show up to collect the goods. Throughout the entire period, Shah was repeatedly hounded by Boss, who kept asking Shah for his location.27Foot Note 27×NE Day 2, p 31.Shah was so perturbed by nature of the first delivery that he put the red plastic bag under a tree and waited a distance away from the plastic bag. 31 Fourth, the second delivery was clearly of a similarly clandestine nature as the first delivery. It was the same suspicious character requesting for Shah’s assistance in a similar delivery. Worse still, Shah managed to confirm his suspicions that the second delivery was illegal, by checking B1 and realising it was cannabis. At this point, it was plainly obvious to Shah that Boss’s assurances that the goods were merely “books and chocolates” was an outright lie and that A1 was exceedingly likely to contain controlled drugs as well. 32 Despite all this, Shah chose not check the contents of A1, even though he had the opportunity to do so (see [16] above). He continued to bring both A1 and B1 into Singapore. Shah’s refusal to check A1 under these circumstances, which would have driven any reasonable person to examine the contents of A1 before bringing them into Singapore, entailed a deliberate decision by Shah to turn a blind eye to the situation. 33 For all the reasons given above, I find that Shah was wilfully blind to the fact that A1 contained diamorphine and hence he possessed the requisite level of knowledge for the charge to be made out.",
        "The presumption of knowledge under s 18(2) of the MDA.": "34 In any case, I find that the presumption of knowledge under s 18(2) of the MDA applies and the Defence has failed to rebut the presumption. 35 As a preliminary, I note that the Defence makes the argument that the presumption under s 18(2) of the MDA does not apply because “knowledge” is required for possession within meaning of s 18(2), and because Shah “did not get to see the contents of the parcels that were handed to him”, there was no “knowledge”.28Foot Note 28×Defence Closing Submissions, para 17–20.I reject this submission. 36 Section 18(2) of the MDA reads: Presumption of possession and knowledge of controlled drugs … (2) Any person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug. 37 The Defence has conflated two different aspects of knowledge that are relevant for any charge of possession or importation. The first is the accused’s knowledge that he was in control or possession of an object. The second is the accused’s knowledge that the object in question was a controlled drug or contained controlled drugs. The former is a critical part of proving the element of possession (seePublic Prosecutor v Ng Pen Tine and Another[2009] SGHC 230 at [103]), whereas the latter is only relevant to the knowledge of the nature of the drug (ie, part of the second element in the present charge). To raise a reasonable doubt on the former, the Defence could, for example, raise evidence which suggests that the object was slipped into the accused’s bag without his knowledge (see, in the context of rebutting the presumption of possession under s 18(1) of the MDA,ObengComfort v Public Prosecutor[2017] 1 SLR 633 (“Obeng”) at [35]). However, in the present case, the Defence’s contention is simply that Shah did not know what type of drug was inside A1. This does not pertain to the knowledge that Shah was in control or possession of A1 and its contents, but rather as to whether he knew of the nature of what was inside A1. 38 If knowledge that the object in question was a controlled drug was required as part of the element of possession, it would render s 18(2) entirely otiose. Section 18(2) of the MDA entitles the court to presume that the accused had knowledge of the nature of the controlled drug. If possession for the purposes of s 18(2) requires proof of knowledge of the nature of the controlled drug, then the provision would require proof of the very fact that it allows the court to presume. It is well established that generally, parliament does not legislate in vain and the court should therefore give significance to every word in an enactment (seeTan Cheng Bock v Attorney-General[2017] 2 SLR 850 at [38]). Hence, I do not think that the Defence’s arguments on this point can be sustained. 39 In any event, I note that within the Statement of Agreed Facts, it is stated that:29Foot Note 29×SOAF, para 5. 5 The abovementioned drug exhibits were in the possession of the accused. The accused admitted ownership of the abovementioned drug exhibits to ICA officer Inspector Shahdan bin Sulaiman … 40 The “abovementioned drug exhibits” refers to A1 and B1 and the contents within the two red plastic bags. This admission in itself suggests that the Prosecution and Defence have agreed that the element of possession is not in dispute. 41 Therefore, the presumption under s 18(2) of the MDA correctly applies. I now turn to consider whether the presumption has been rebutted.",
        "The Defence’s case, taken at its highest, cannot rebut the presumption under s 18(2) of the MDA": "42 A curious feature of the present case is that the Defence has conceded that Shah knew that the A1 packets contained controlled drugs (see [11] above). The thrust of the Defence case is that Shah did not know precisely what type of  controlled drug was within A1, because he did not look within A1 and he did not know what diamorphine looked like.30Foot Note 30×Defence Closing Submissions, paras 19 and 25. 43 In my view, even taking the Defence’s case at its highest (ie, assuming that it is proven on a balance of probabilities that Shah only knew that A1 contained controlled drugs but had no knowledge of the precise type of drug within), I find that this isper seinsufficient to rebut the presumption of knowledge under s 18(2) of the MDA. I shall explain why this is so. 44 InPublic Prosecutor v Gobi a/lAvedian[2018] SGCA 72 (“Gobi”), the Court of Appeal reiterated some key principles in relation to rebutting the presumption under s 18(2) of the MDA at [32] to [35]: 32 The starting point is what this Court said inObengabout the effect of s 18(2). The presumption in s 18(2) operates to vest an accused person with knowledge of the nature of the drug which he is in possession of and to rebut this,he must give an account of what he thought it was. Since the respondent was in possession of the drugs found in the motorcycle, the law presumes that he knew the said drugs were diamorphine. 33 Similarly, as this Court said inObeng, an accused person would not be able to rebut the presumption as to knowledge by merely claiming that he did not know the proper name of the drug that he was asked to carry. The law also does not require him to know the scientific or the chemical name of the drug or the effects that the drug could bring about.Since he knew that he was carrying illegal drugs and wished to show that he did not know they werediamorphine, then it was incumbent on him to tell the Court what he thought or believed the drugs were. … 35 In order to rebut the presumption in s 18(2), which vests the respondent with the knowledge that the drugs imported were diamorphine, it is not enough for the respondent, who knew that he was transporting illegal drugs, to state merely that he did not know what sort of drugs they were or that hehad never heard of diamorphine or heroin.If he did not know whatdiamorphine was, he could not possibly claim that the drugs he was carrying were not diamorphine.Similarly, he would not be able to say whether diamorphine was a dangerous drug or not (according to his definition of dangerous drugs). The presumption in s 18(2) is placed in the MDA precisely to address the difficulty of proving an accused person’s subjective state of knowledge with regard to any specific type of drug. It also takes care of the case of a trafficker or an importer of drugs who simply does not bother or does not want to know what drugs or even what goods he is going to carry. Allowing the respondent in these circumstances to rebut the presumption of knowledge by merely stating that he did not know what drugs he was carrying save that they were not dangerous drugs and therefore could not be diamorphine would, as we mentioned inObeng(at [39]), make the presumption of knowledge all bark and no bite. … [emphasis added]  45 InGobithe Prosecution was appealing an acquittal on a charge relating to the importation of diamorphine. The accused’s defence was that he believed the drugs he had brought in were “chocolate drugs” that were illegal but not “serious drugs”, and they would have occasioned only a fine or a light sentence if he was caught carrying them (seeGobiat [31]). Applying the abovementioned principles to the facts, the Court of Appeal thus held that the accused failed to rebut the presumption of knowledge. This was because he did not bother to find out exactly what he was tasked to carry across state boundaries into Singapore, despite knowing that they were illegal drugs. He did not know the name of the drugs that he was to carry and he therefore could not possibly verify whether the drugs were dangerous or serious drugs which could lead to the death penalty or long term imprisonment (seeGobiat [36] to [37]). 46 Based on the principles laid out by the Court of Appeal inGobias set out above, the presumption of knowledge in s 18(2) of the MDA vests the accused with the knowledge that he knew the nature of the specific controlled drug he was charged for importing. Where an accused admits that he knows that he had imported illegal drugs, but wishes to rebut the presumption of knowledge, he must prove on the balance of probabilities that he did not have knowledge that the nature of the illegal drugs in his possession was the specific type of controlled drug as stated in the charge. This means that the accused must prove that he believed that the drug he imported was not that specific controlled drug for which he was charged.  In order to do this, the accused must state exactly what he believed he was carrying and provide reasons for his belief. 47 InGobi, the accused’s case was that he did not believe that the illegal drugs he had imported were dangerous drugs, which the accused defined as types of drugs which would entail a heavy sentence if he was caught carrying them. Because his definition of what he believed the drug contained excluded the drug for which he was caught (ie, it excluded diamorphine because that was a drug that would entail a heavy sentence if he was caught carrying them), the Court of Appeal thus had to consider the veracity of this alleged belief. 48 In the present case, Shah, unlike the accused inGobi, has not even alleged that he believed the drugs in A1 to be drugs other than diamorphine. The Defence’s position is that “Shah honestly did not know that the contents were heroin though he only knew what cannabis (ganja) looked like”.31Foot Note 31×Defence Closing Submissions, para 25.The Defence also states that Shah did “admit in cross-examination that after he saw the contents of [B1], he did think that [A1] may also contain cannabis or ganja”.32Foot Note 32×Defence Closing Submissions, para 26.Hence, Shah’s case is that although he knew A1 contained controlled drugs and  he speculated that it might have been cannabis, he did not in fact know what type of controlled drug was actually inside A1. However, this does necessarily mean that Shah knew that the drug inside A1 wasnotdiamorphine because the definition of a controlled drug is wide enough to include diamorphine. His knowledge that A1 contains a controlled drug therefore extends to knowing that A1 could perhaps also contain diamorphine. In other words, Shah was fully cognizant of the fact that he could not exclude the possibility that A1 might in fact contain diamorphine and not cannabis. If so, the presumption of his knowledge of the actual nature of the drug in A1 is not rebutted. It would be a different matter if Shah’s case is that he honestly believed that A1 contained cannabis and not diamorphine, because if it is proved on a balance of probabilities that he in fact believed that A1 containedonlycannabis and nothing else, this necessarily implies that he believed that A1 did not in fact contain diamorphine. 49 On this basis alone, I find that Shah has failed to rebut the presumption of knowledge under s 18(2) of the MDA, because his case taken at its highest does not disclose a belief sufficient to rebut the presumption. 50 In any event, leaving aside the abovementioned difficulties with Shah’s case, I am of the view that Shah has not rebutted the presumption of knowledge under s 18(2) of the MDA because based on a consideration of the circumstances and facts listed above at [26]–[32], there is insufficient evidence to prove on the balance of probabilities that Shah did not have knowledge that the controlled drug in his possession was diamorphine.",
        "Conclusion": "51 Therefore, I find that Shah possessed actual knowledge that he was importing diamorphine. I also find that the presumption under s 18(2) of the MDA applies and Shah has failed to rebut the presumption. As the first element of the charge is not in dispute and the second element of the charge has been proven, I find that the Prosecution has proved its case against Shah beyond a reasonable doubt, and I convict Shah accordingly. 52 I shall hear submissions on sentence from the parties. Chan Seng OnnJudge Andrew Tan and Michelle Lu (Attorney-General’s Chambers) for the Public Prosecutor;Amolat Singh (Amolat & Partners) and Lau Kah Hee (Derrick Wong & Lim BC LLP) for the accused."
    }
}