{
    "case_title": "Ermgassen & Co LtdvSixcap Financials Pte Ltd",
    "ncitation": "[2018] SGHCR 8",
    "coram": "Colin Seow AR",
    "sections": {
        "Introduction": "1 On 25 March 2015, Singapore signed the Convention on Choice of Court Agreements done at The Hague on 30 June 2005 (“the Hague Convention”). Following Singapore’s ratification of the same on 2 June 2016, the Hague Convention entered into force for Singapore on 1 October 2016. 2 1 October 2016 was the same day the Choice of Court Agreements Act (Cap 39A, 2017 Rev Ed) (“the Act”) and new Order 111 (“O 111”) of the Rules of Court (Cap 322, R5, 2014 Rev Ed) (“Rules of Court”) were brought into effect in Singapore, following the passing of the Choice of Court Agreements Bill by Parliament on 14 April 2016. The Act together with O 111 give domestic effect to the Hague Convention and for connected purposes. 3 The Hague Convention had earlier in accordance with its Article 31 entered into force for Mexico and the European Union (“EU”) (except Denmark1Foot Note 1×Denmark has since acceded to the Hague Convention on 30 May 2018.) on 1 October 2015, after the EU (who was a signatory since 1 April 2009) deposited its instrument of approval on 11 June 2015. Mexico previously acceded to the Hague Convention on 26 September 2007. 4 On 31 May 2018, pursuant to O 111 r 2 of the Rules of Court read with section 13 of the Act, Ermgassen & Co Limited (“the Plaintiff”), a company registered in the United Kingdom (“the UK”), filed anex parteOriginating Summons No 680 of 2018 (“the Enforcement Application”) in the High Court of Singapore seeking the recognition and enforcement of a summary judgment (“the Summary Judgment”) made by the High Court of Justice of England and Wales, Queen’s Bench Division against a Singapore registered company known as Sixcap Financials Pte Ltd (“the Defendant”) in the amount of €1,013,536.48 plus costs assessed at £38,635. This appeared to be the first application brought under the Act since its enactment. 5 On 12 June 2018, an oral hearing was conducted in Chambers for the Plaintiff to satisfy this Court, on anex partebasis, on the merits of the Enforcement Application. At the end of the hearing, judgment was reserved. I now render my decision on the Enforcement Application.",
        "General overview of the legal framework for the recognition and/or enforcement of foreign judgments under the Act": "6 First and foremost, the Act applies to foreign judgments obtained from the courts of Contracting States of the Hague Convention. “Contracting State” has been defined under section 2(1) of the Act to mean “a State that is a party to the Convention”, and it “includes, in an appropriate case … a Regional Economic Integration Organisation that is a party to the Convention; and … a member State, of a Regional Economic Integration Organisation that is a party to, and has made a declaration under Article 30(1) of, the Convention”. 7 Section 8 of the Act provides that the Act applies in every “international case” where there is an “exclusive choice of court agreement” concluded in a “civil or commercial matter”, subject to certain exceptions stipulated in sections 9, 10 and 22. The relevant definitions of “exclusive choice of court agreement” and “international case” are contained in sections 3(1) and 4(2) as follows: Meaning of “exclusive choice of court agreement” 3.—(1) An exclusive choice of court agreement is an agreement between 2 or more parties that — (a) is concluded or documented — (i) in writing; or (ii) by any other means of communication that renders the information communicated accessible so as to be usable for subsequent reference; and (b) designates, for the purpose of deciding any dispute that arises or may arise in connection with a particular legal relationship, the courts, or one or more specific courts, of one Contracting State to the exclusion of the jurisdiction of any other court. … Meaning of “international case” 4.—(1) … (2) For the purposes of Part 3, a case is an international case if the claim is for — (a) the recognition, or recognition and enforcement, of a foreign judgment; or (b) the enforcement of a judicial settlement recorded before a court of a Contracting State (other than Singapore). 8 The expression “civil or commercial matter”, although not defined in the Act, derives its meaning as understood under the Hague Convention. In theExplanatory Report on the 2005 Hague Choice of Court Agreements Convention (2013)published by the Hague Conference on Private International Law (“the Hartley/Dogauchi Report”), the expression has been explained as follows (at [49]): 49Civil or commercial matters.Like other concepts used in the Convention, “civil or commercial matters” has an autonomous meaning: it does not entail a reference to national law or other instruments. The limitation to civil or commercial matters is common in international conventions of this kind. It is primarily intended to exclude public law and criminal law. The reason for using the word “commercial” as well as “civil” is that in some legal systems “civil” and “commercial” are regarded as separate and mutually exclusive categories. The use of both terms is helpful for those legal systems. It does no harm with regard to systems in which commercial proceedings are a sub-category of civil proceedings. However, certain matters that clearly fall within the class of civil or commercial matters are nevertheless excluded from the scope of the Convention under Article 2. 9 Part 3 of the Act sets out the provisions relating to the recognition and enforcement of foreign judgments, and the enforcement of judicial settlements. The term “foreign judgment” has been defined under section 2(1) of the Act as “a judgment given by a court of a Contracting State (other than Singapore), being … a chosen court; or … a court to which a chosen court has transferred, in accordance with the law or practice relating to the allocation of jurisdiction or transfer of cases among courts in that Contracting State, the case to which the judgment relates”. The word “judgment” is, in turn, defined as “a final court decision (by whatever name called) on the merits, a consent order, a consent judgment or a judgment given by default; or … a determination by a court of any costs or expenses relating to any such court decision, consent order, consent judgment or judgment given by default”. Additionally, the Hartley/Dogauchi Report clarifies the meaning of “judgment” as follows (at [116]): … It excludes a procedural ruling, but covers an order as to costs or expenses (even if given by an officer of the court, rather than by a judge) provided it relates to a judgment that may be recognised or enforced under the Convention. It does not cover a decision to grant interim relief (provisional and protective measures), as this is not a decision on the merits. 10 Indeed, section 10(1) of the Act expressly states that the Act does not apply to any interim measure of protection. 11 It is important to also set out what is meant by the terms “recognition” and “enforcement”, which are not defined in the Act. Again, the Hartley/Dogauchi Report is instructive (at [170]-[172]): 170“Recognition” and “enforcement”.Article 8(3) provides that a judgment will be recognised only if it has effect in the State of origin, and will be enforced only if it is enforceable in the State of origin. This raises the distinction between recognition and enforcement. Recognition means that the court addressed gives effect to the determination of the legal rights and obligations made by the court of origin. For example, if the court of origin held that the plaintiff had, or did not have, a given right, the court addressed accepts that this is the case. Enforcement means the application of the legal procedures of the court addressed to ensure that the defendant obeys the judgment given by the court of origin. Thus, if the court of origin rules that the defendant must pay the plaintiff 1000 euros, the court addressed will ensure that the money is handed over to the plaintiff. Since this would be legally indefensible if the defendant did not owe 1000 euros to the plaintiff, a decision to enforce the judgment must logically be preceded or accompanied by the recognition of the judgment. In contrast, recognition need not be accompanied or followed by enforcement. For example, if the court of origin held that the defendant did not owe any money to the plaintiff, the court addressed may simply recognise this finding. Therefore, if the plaintiff sues the defendant again on the same claim before the court addressed, the recognition of the foreign judgment will be enough to dispose of the case. 171 In the light of this distinction, it is easy to see why Article 8(3) says that a judgment will be recognised only if it has effect in the State of origin. Having effect means that it is legally valid and operative. If it does not have effect, it will not constitute a valid determination of the parties’ rights and obligations. Thus, if it does not have effect in the State of origin, it should not be recognised under the Convention in any other Contracting State. Moreover, if it ceases to have effect in the State of origin, the judgment should not thereafter be recognised under the Convention in other Contracting States. 172 Likewise, if the judgment is not enforceable in the State of origin, it should not be enforced elsewhere under the Convention. It is of course possible that the judgment will be effective in the State of origin without being enforceable there. Enforceability may be suspended pending an appeal (either automatically or because the court so ordered). In such a case, enforcement will not be possible in other Contracting States until the matter is resolved in the State of origin. Moreover, if the judgment ceases to be enforceable in the State of origin, it should not thereafter be enforced in another Contracting State under the Convention. 12 This understanding appears to be enshrined in section 13(2) of the Act, which essentially draws the same distinction between when a foreign judgment is to be recognised and when the same is to be enforced under the Act. At the same time, section 13 of the Act is also key in providing the following rules that apply in an application seeking recognition and/or enforcement of a foreign judgment in Singapore: (a) In determining whether to recognise or enforce a foreign judgment, the High Court must not review the merits of the foreign judgment, except to the extent necessary to apply the provisions of Part 3 of the Act (see section 13(3)(a) of the Act). (b) In determining whether to recognise or enforce a foreign judgment, the High Court is bound by any findings of fact on which the court of origin assumed jurisdiction, unless the foreign judgment was given by default (see section 13(3)(b) of the Act). (c) Where a foreign judgment satisfies the requirements for recognition, or for recognition and enforcement, under Part 3 of the Act, the High Court must recognise, or recognise and enforce, as the case may be, the foreign judgment, except in the circumstances provided under Part 3 of the Act for the refusal of such recognition or enforcement (see section 13(4) of the Act). 13 Chief among the circumstances provided under Part 3 of the Act for the refusal of recognition or enforcement of a foreign judgment are those stipulated in sections 14 and 15 of the Act, which are the key legislative provisions setting out the limited grounds on which the High Courtmustormay,inter alia, refuse to recognise or enforce a foreign judgment. 14 The procedural rules relating to an application seeking recognition and/or enforcement of a foreign judgment in Singapore under the Act is set out in O 111 of the Rules of Court. In particular, O 111 r 2(1) provides that such an application must be made by way of anex parteoriginating summons supported by an affidavit, and O 111 rr 2(2)-(3) further stipulate what must be stated and exhibited in the supporting affidavit. O 111 rr 6 and 8 prescribe the procedural rules relating to a Court order granting such an application, including matters relating to when the Court order takes effect. Finally, any application to set aside such a Court order must be made in accordance with the provisions in O 111 r 7. 15 On a related note, it should also be highlighted that, with effect from 1 October 2016, a new section 2A was introduced to both the Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264, 1985 Rev Ed) (“RECJA”) and the Reciprocal Enforcement of Foreign Judgments Act (Cap 265, 2001 Rev Ed) (“REFJA”), providing that the RECJA and REFJA do not apply to any judgment which may be recognised or enforced in Singapore under the Act. 16 Against this backdrop, I turn to address the Enforcement Application before me.",
        "The Enforcement Application": "",
        "Applicability of the Act to the Summary Judgment": "17 The Summary Judgment appears to fall within the scope of the Act for the following reasons: (a) The Summary Judgment is a judgment of the High Court of Justice, Queen’s Bench Division (see [4] above), and the UK is a “Contracting State” as defined under section 2(1) of the Act (see [6] above). In this regard, it is noted that: (i) recital (6) of Council Decision 2014/887/EU on the decision on behalf of the EU to approve the Hague Convention states that “When signing the Convention, the Union declared under Article 30 of the Convention that it exercises competence over all the matters governed by the Convention. Consequently, the Member States shall be bound by the Convention by virtue of its approval by the Union.”; and (ii) recital (8) of Council Decision 2014/887/EU on the decision on behalf of the EU to approve the Hague Convention states that “The United Kingdom and Ireland are bound by Regulation (EC) No 44/2001 and are therefore taking part in the adoption and application of this Decision.” (b) The Enforcement Application is an “international case” within the meaning in section 4(2)(a) of the Act, given that the claim in the Enforcement Application is for the recognition and enforcement of a foreign judgment (see [7] and [9] above). (c) There appears to be an “exclusive choice of court agreement” within the meaning in section 3(1) of the Act (see [7] above) which is applicable to the dispute in relation to which the Summary Judgment was obtained. In this regard, the Plaintiff has exhibited in its supporting affidavit (i) the Plaintiff’s Engagement Letter to the Defendant’s Executive Chairman dated 28 June 2016, (ii) a confirmation of the Engagement Letter signed by a director of the Defendant and dated 22 July 2016, and (iii) the Terms of Engagement in which clause 8.6 stipulates the following: The Engagement Letter and these Terms of Engagement shall be governed by and construed in accordance with English law.Ermgassen& Co and the Client irrevocably submit to the exclusive jurisdiction of the English courts to settle any disputes in connection with any matter arising out of the Engagement Letter and/or these Terms of Engagement. [emphasis added] The Plaintiff has also exhibited in its supporting affidavit the pleadings filed by the Plaintiff and the Defendant in the UK proceedings, wherein the Plaintiff alluded to the aforementioned documents as the basis of its claim against the Defendant. (d) The exclusive choice of court agreement appears to be concluded in a “civil or commercial matter” (see [8] above). According to the parties’ pleadings in the UK proceedings, the Plaintiff’s claim was for unpaid invoices issued to the Defendant for financial advice and related professional services rendered to the Defendant pursuant to the Engagement Letter and the Terms of Engagement. The subject matter of the UK proceedings therefore appeared to be purely commercial in nature. Furthermore, the case does not appear to fall within any subject-matter exclusions set out in section 9 of the Act. (e) The Enforcement Application does not seek the recognition and enforcement of any interim measure of protection, which is excluded by virtue of section 10 of the Act. As mentioned earlier, the Enforcement Application seeks the recognition and enforcement of a summary judgment obtained in UK proceedings (see [4] above). 18 For completeness, I have also considered section 24(2) of the Act, which provides that the Act does not apply to an exclusive choice of court agreement that designates a court of another Contracting State as a chosen court,if the agreement is concluded beforethe Hague Convention enters into force in that Contracting State. I find that section 24(2) does not apply in the present case because the exclusive choice of court agreement applicable to the dispute in relation to which the Summary Judgment was obtained appears to be concluded on or around 22 July 2016 (see [17(c)] above), well after the Hague Convention entered into force for the EU (including the UK) (see [3] and [17(a)(i)]-[17(a)(ii)] above).",
        "Merits of the Enforcement Application": "19 Having found that the Summary Judgment falls within the scope of the Act, I now consider the merits of the Enforcement Application. In particular, the overarching issue that is to be determined is whether the Plaintiff has succeeded in satisfying this Court, on anex partebasis, that the Enforcement Application should be granted. 20  At the oral hearing conducted on 12 June 2018, the Plaintiff’s counsel tendered for the Court’s perusal a bundle containing,inter alia, the original copies of the documentary exhibits attached to the Plaintiff’s supporting affidavit. These included the following documents: (a) The Plaintiff’s Application Notice dated 21 December 2017 seeking summary judgment on its claim in the UK proceedings (“the Summary Judgment Application”). (b) An Order by Senior Master Fontaine of the High Court of Justice, Queen’s Bench Division dated 20 March 2018 ordering,inter alia, that “Summary judgment shall be entered for the Claimant on the entirety of the claim” (“the Summary Judgment Order”). (c) An Order by Master Cook of the High Court of Justice, Queen’s Bench Division dated 23 May 2018 ordering,inter alia, that the Summary Judgment Order be certified “for the purpose of enforcement out of the jurisdiction in Singapore” (“the Certification Order”). (d) A Certificate for enforcement of the Summary Judgment in a foreign country signed by Master Cook on 23 May 2018 and sealed by the High Court of Justice, Queen’s Bench Division on 25 May 2018 (“the Certificate for Enforcement”). 21 Upon my review of the documents, I am satisfied that the Enforcement Application ought to be granted, having regard to the following key considerations. 22 First, the Plaintiff states in its supporting affidavit that although neither the Defendant nor its solicitors appeared at the hearing of the Summary Judgment Application, the Senior Master heard the Plaintiff’s counsel on that application before granting it. I find that the Plaintiff’s averment in this regard is supported on the face of the Summary Judgment Order where its preamble states,inter alia, “AND UPON HEARING Counsel for the Claimant …” The Summary Judgment entered against the Defendant thus appears to be in the nature of a judgment on the merits of the case, as opposed to a default judgment. Accordingly, for the purposes of the Enforcement Application, it may be assumed that the Defendant was duly notified of the Summary Judgment Application which led to the Summary Judgment. Such an approach is in line with what is envisaged in the Hartley/Dogauchi Report, which states that (at [211]): … Article 13(1)(c) requires documentary evidence that the defendant was notified, but this applies only in the case of a default judgment.In other cases, it is assumed that the defendant was notified unless he or she produces evidence to the contrary. … [emphasis added] 23 Second, O 111 r 2(3)(a) of the Rules of Court provides that the Plaintiff’s supporting affidavit “must” exhibit “a complete and certified copy of the foreign judgment (including the reasons, if any, for the decision of the court which gave the judgment)”. This provision appears to beinpari materiawith Article 13(1)(a) of the Hague Convention, which provides that the party seeking recognition or applying for enforcement shall produce “a complete and certified copy of the judgment”. In relation to Article 13(1)(a), the Hartley/Dogauchi Report states as follows (at [211]): … Article 13(1)(a) requires the production of a complete and certified copy of the judgment. This refers to the whole judgment (including, where applicable, the court’s reasoning) and not just to the final order (dispositif). … 24 A question thus arises as to whether the Summary Judgment Order amounts to “a complete and certified copy of the foreign judgment (including the reasons, if any, for the decision of the court which gave the judgment)” under O 111 r 2(3)(a) of the Rules of Court. In my view, while it can be said that the Plaintiff could have done better by producing more material (for example, a certified copy of the Senior Master’s notes of arguments in respect of the hearing of the Summary Judgment Application, assuming that such may be obtained by a party in UK proceedings) to supplement the Summary Judgment Order as a whole, such omission on the part of the Plaintiff is not fatal in the present case. My reasoning is as follows: (a) The Hartley/Dogauchi Report (at [211]) clarifies that, notwithstanding Article 13(1) of the Hague Convention requiring the production of certain documents in an application for the recognition or enforcement of a foreign judgment, “[t]he law of the requested State determines the consequences of failure to produce the required documents”. This suggests that the failure to produce a required document is not envisaged to be invariably fatal in all cases. (b) O 111 r 2(3)(a) represents a direct, but in no way the exclusive, means by which the High Court can be satisfied on one or more of the requirements for the recognition and/or enforcement of a foreign judgment under Part 3 of the Act. This view appears to be supported by virtue of the closing sub-paragraph (d) of O 111 r 2(3) which wording suggests that “other documents” may similarly be adduced to establish one or more of the requirements for recognition and/or enforcement. I further find this view to be consistent with the guidance provided in the Hartley/Dogauchi Report (at [211]) which highlights that “[e]xcessive formalism should … be avoided: if the judgment-debtor was not prejudiced, the judgment-creditor should be allowed to rectify omissions”. (c) Thus, even though it is arguable that the Summary Judgment Order may not have been adequately supplemented by intrinsic documents to formally constitute “a complete and certified copy of the foreign judgment (including the reasons, if any, for the decision of the court which gave the judgment)”, the Plaintiff may at this stage nevertheless be regarded as having sufficiently discharged its burden by adducing extrinsic documents that corroborate its claim on the existence (as well as the effect and enforceability) of the Summary Judgment in the UK. In this connection, the Certification Order issued by adifferentMaster of the High Court of Justice, Queen’s Bench Division (see [20(c)] above) clearly states in its preamble that its issuance is upon “the Court considering the Court File”. The Certificate for Enforcement (see [20(d)] above), in turn, certifies in some detail the following salient points in no uncertain terms: (i) that the Plaintiff’s claim form in the UK proceedings was served on the Defendant; (ii) that the Defendant acknowledged service of the claim form with no objection made to the jurisdiction of the English court; (iii) that the Plaintiff obtained judgment against the Defendant on its claim in the same principal amount and costs as that indicated in the Summary Judgment; (iv) that the judgment has been served on the Defendant; (v) that no  application to set aside the judgment has been made; (vi) that no appeal against the judgment has been brought within the time prescribed; (vii) that enforcement of the judgment has not been stayed or suspended; (viii) that the time available for the enforcement of the judgment has not expired; and (ix) that accordingly, the judgment is enforceable in the UK. 25 Finally, I have not detected any grounds on which this Courtmustormay, at this stage, refuse to recognise or enforce the Summary Judgment under section 14 or section 15 of the Act. However, I say this without prejudice to the right of the Defendant to pursue any actual grounds for determination on aninterpartesbasis in any setting aside application that it may subsequently bring in accordance with O 111 r 7 of the Rules of Court.",
        "Conclusion": "26 For the reasons stated above, the Enforcement Application is granted, with the necessary consequential directions such as those provided under O 111 rr 6 and 8 to follow. I will hear the Plaintiff’s submissions on costs. Colin SeowAssistant Registrar Jamal Siddique Peer (Shook Lin & Bok LLP) for the Plaintiff."
    }
}