{
    "case_title": "Tang Ying and others vChen Mingliang and others",
    "ncitation": "[2018] SGHC 226",
    "coram": "Lai Siu Chiu SJ",
    "sections": {
        "Introduction": "1 In Suit No 89 of 2018, Tang Ying (“the first plaintiff”) and six other individuals (collectively all seven plaintiffs are referred to as “the plaintiffs”) sued Chen Mingliang (“the first defendant”), Niu Liming (“the second defendant”) and a Singapore company Furong Investments Pte Ltd (“Furong”) (collectively “the defendants”) for,inter alia, (i) misrepresentation, (ii) breach of fiduciary duties and (iii) conspiracy in relation to certain investments. 2 In Summons No 499 of 2018 (“the injunction application”), the plaintiffs applied to court for a Mareva injunction and ancillary orders, against the first defendant and Furong in the amount of US$2.44m. The injunction application was heard and granted by this court on 29 January 2018 (this order is referred to as “the injunction order”). 3 On 6 March 2018, by way of Summons No 1135 of 2018 (“the Discharge Application”), the first defendant applied,inter alia, to set aside the injunction order and for an inquiry to be held to ascertain whether damages are payable to the first defendant resulting from the granting of the injunction order and, in the alternative, that a variation be granted of the injunction order. 4 The Discharge Application was heard by this court over two days. The injunction was not discharged but varied such that the injunction order granted against the first defendant’s penthouse located at 539 East Coast Road, The Sound, #05-02, Singapore 429069 (“the Sound Property”) was lifted and in its place, the plaintiffs were granted liberty to file a caveat against the Sound Property. The court declined to grant the other prayers sought in the Discharge Application. 5 The first defendant then applied, by way of Summons No 1823 of 2018 (“the Leave Application”), for leave to appeal to the Court of Appeal against this court’s decision in the Discharge Application under s 34(2)(d) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed). This court heard and granted the Leave Application. 6 Pursuant to the granting of the Leave Application, the first defendant filed his Notice of Appeal (in Civil Appeal No 107 of 2018).",
        "The facts": "",
        "The plaintiffs’ case": "64 Not surprisingly, the first plaintiff submitted arguments which were contrary to the first defendant’s submissions. It serves little purpose to rehash those arguments as they were diametrically opposite to what the first defendant stated in his two affidavits and in his counsel’s submissions.",
        "The first defendant’s case": "53 Aside from the affidavits filed by the parties, lengthy arguments were raised at the hearing especially on behalf of the first defendant. 54  In support of the argument that the injunction order was brought for a collateral purpose (allegedly to bring the first defendant to his knees) and therefore ought to be discharged, counsel for the first defendant citedArt TrendLtd v Blue Dolphin (Pte) Ltd and others[1981–1982] SLR(R) 633 andBouvier, Yves Charles Edgar andanother v Accent Delight International Ltd and another and another appeal[2015] 5 SLR 558.104Foot Note 104×The first defendant’s submissions at para 4. 55 It was submitted that the sequence of events outlined in the first defendant’s affidavit revealed that the true aim of the injunction was to ensure that Furong and the first defendant did not have ready access to funds necessary to finance the investigations into the wrongdoings of the first plaintiff and the second defendant while they were with Furong.105Foot Note 105×The first defendant’s submissions at para 7(a).For that reason, the plaintiffs restricted the injunction order to the first defendant and Furong notwithstanding the clear incriminating evidence against the second defendant.106Foot Note 106×The first defendant’s submissions at paras 7(b), 44.That was also the reason why the second defendant filed the winding-up proceedings.107Foot Note 107×The first defendant’s submissions at para 25. 56 The first defendant contended that the ongoing investigations he initiated after the second defendant’s dismissal uncovered the latter’s scheme (in which the first plaintiff was involved) of a wide-ranging marketing plan to illegitimately boost the sales of the Furong Bonds by misrepresenting that the bonds were capital guaranteed and came with guaranteed coupon payouts.108Foot Note 108×The first defendant’s submissions at para 12.The duo even made sure that the misrepresentations could not be dismissed as mere sales “puff” by enshrining them in various publicity materials (including pamphlets, facts sheets and Furong’s official website). Further, between April 2016 and January 2017, they unilaterally amended the contractual terms of the Furong Bonds that had been previously drafted by Furong’s solicitors and approved by the board of directors around 12 December 2015. Indeed, they made extravagant promises on behalf of Furong which (i) the board of directors did not authorise and (ii) were contrary to legal advice from Furong’s lawyers Continental and (iii) contrary to the actual terms of the Furong Bonds, in particular the default clause (see [10] above) and the non-reliance clause (see [33] above).109Foot Note 109×The first defendant’s submissions at para 13. 57 The first defendant referred to the default clause. He explained that the “Closing Amount” was defined in Section I para 1 of the unauthorised Amended Memoranda as “the amounts payable upon the redemption or termination of the Investment Bonds pursuant to Paragraphs 8.4 and 8.5 of Section IV, respectively”.110Foot Note 110×The first defendant’s submissions at para 16; see,eg, the first plaintiff’s first affidavit at p 53.If the “Closing Amounts” are not recovered from CVHT, Furong’s obligation to redeem the Furong Bonds ceases.111Foot Note 111×The first defendant’s submissions at para 17.He submitted this was fatal to the plaintiffs’ contention that they had a good arguable case. 58 The first defendant opined that it was both misleading and ironic that the first plaintiff was relying on the unauthorised Amended Memoranda in which she had a hand in producing to found her claim in misrepresentation against Furong and the first defendant.112Foot Note 112×The first defendant’s submissions at para 18. 59 The first defendant noted that the second defendant did not deny that the five trading accounts (see [27] above) were opened in his name.113Foot Note 113×The first defendant’s submissions at para 20.The first defendant submitted there was a real risk that the second defendant would dissipate the moneys from the Furong Bonds that had been diverted to those five accounts.114Foot Note 114×The first defendant’s submissions at paras 21, 40. 60 It was also submitted that the unauthorised Amended Memoranda were never sent to the first defendant for his approval.115Foot Note 115×The first defendant’s submissions at para 14.He was not copied in the emails wherein the second defendant and Furong employees were making the unauthorised amendments to the contractual documents and promotional materials.116Foot Note 116×The first defendant’s submissions at para 92.The second defendant’s claims that the first defendant was kept informed by telephone calls and WeChat conversations were not substantiated by any evidence – because no such conversations took place.117Foot Note 117×The first defendant’s submissions at para 14.The first defendant pointed out that the first plaintiff failed to disclose that he had never met any of the plaintiffs until well after they had purchased the Furong Bonds.118Foot Note 118×The first defendant’s submissions at para 90.In fact, he met the first plaintiff for the first time on 29 November 2017 and later on 7 December 2017 whilst the first and only time he met the seventh plaintiff was in May 2017. 61 The first defendant argued that there was no urgency in applying for the injunction order as the first plaintiff’s first affidavit in which she deposed that her application was prompted by “the sudden closure of … Furong’s Office and also, [the first defendant’s] sudden decision to sell [the Sound Property]” was proved to be untrue.119Foot Note 119×See the first defendant’s submissions at paras 27–30. 62 The first defendant citedMeespierson NV v Industrial and Commercial Bank of Vietnam[1998] 1 SLR(R) 287 to contend that a Mareva injunction should not be used to obtain security for a plaintiff’s claim unless there was a real risk of the defendant dissipating his assets in order to avoid satisfying any judgment which the plaintiff might eventually obtain.120Foot Note 120×See the first defendant’s submissions at para 47.“There must be some ‘solid evidence’ to substantiate the alleged risk” (perChao Hick Tin JA inGuan Chong Cocoa Manufacturer Sdn Bhd v Pratiwi Shipping SA[2003] 1 SLR(R) 157 at [18]).121Foot Note 121×See the first defendant’s submissions at para 5(a).Indeed, the Court of Appeal inChoy Chee Keen Collin v Public Utilities Board[1996] 3 SLR(R) 812 at [24] held it was an abuse of process to use a Mareva injunction to obtain security for a claim.122Foot Note 122×See the first defendant’s submissions at para 46. 63 In lieu of discharging the injunction and to allay the first plaintiff’s fears, the first defendant submitted that he was prepared to have the Mareva injunction varied such that he could not dispose of the Sound Property without giving seven days’ advance notice to the plaintiffs.123Foot Note 123×See the first defendant’s submissions at para 99.",
        "The reply affidavits": "40 In the first plaintiff’s affidavit filed on 26 March 2018 (“the first plaintiff’s reply affidavit”) to resist the Discharge Application, she denied she was acting in concert with the second defendant (or anyone else) to stop the first defendant from conducting further investigations into Furong’s affairs.83Foot Note 83×The first plaintiff’s reply affidavit at para 4.She claimed that the plaintiffs were unaware of the winding-up proceedings before they were commenced and she only learnt of those proceedings just before the injunction application was filed.84Foot Note 84×The first plaintiff’s reply affidavit at para 7. 41 The first plaintiff explained that she did not file an injunction application against the second defendant because the plaintiffs did not have evidence that showed there was a risk that he was dissipating his assets.85Foot Note 85×The first plaintiff’s reply affidavit at para 10. 42 Although the first plaintiff reported to the second defendant at Furong, she alleged that the first defendant was the ‘big boss’ to whom the second defendant reported because the first defendant was the majority shareholder.86Foot Note 86×The first plaintiff’s reply affidavit at para 12(a).All payments made by Furong however small had to be approved by the first defendant and his signature was required on all of Furong’s cheques.87Foot Note 87×The first plaintiff’s reply affidavit at para 12(b). 43  The first plaintiff added that CVHT was the first defendant’s business contact and it was he who brought CVHT/Lee to the table to negotiate with Furong.88Foot Note 88×The first plaintiff’s reply affidavit at para 12(c).In that regard, she had met Lee at least once. Lee had told her and other employees of Furong that they should be confident of selling the Furong Bonds because the first defendant was a man of substantial means and he was their boss. Hence, it did not lie in the first defendant’s mouth to say that he did not authorise and did not know (i) the contents of the facts sheets in relation to the Furong Bonds that stated the bonds were capital guaranteed; (ii) the representations that the Furong Bonds were capital guaranteed were on Furong’s website; and (iii) the contents of the Memoranda given to and accepted by Furong’s customers.89Foot Note 89×The first plaintiff’s reply affidavit at para 13.The Furong Bonds were sold to the public in Singapore for about a year at least and the first plaintiff found it inconceivable that the first defendant, as a director of Furong, did not know of and did not authorise the statements that the Furong Bonds were capital guaranteed.90Foot Note 90×The first plaintiff’s reply affidavit at para 14. 44 The first plaintiff noted that the first defendant was able to procure Lee’s statutory declaration (see [28] above) in Singapore despite CVHT having defrauded Furong.91Foot Note 91×The first plaintiff’s reply affidavit at para 19.She questioned why neither Furong nor the first defendant had taken legal action against CVHT, after lodging (late) a police report.92Foot Note 92×See the first plaintiff’s reply affidavit at paras 16, 18. 45 The first plaintiff denied she had made secret profits in selling the Furong Bonds, other than receiving her commission and salary from Furong.93Foot Note 93×The first plaintiff’s reply affidavit at para 21.She explained that she could not have had a hand in altering the terms of the Furong Bonds when she herself lost US$400,000 of her own money. 46 The first plaintiff further denied she had made unauthorised amendments to any of the Memoranda as she had no say in their contents.94Foot Note 94×The first plaintiff’s reply affidavit at para 25.At most, she helped to translate or check the translation of the Chinese portions of the documents. She deposed that at all times she acted on the second defendant’s instructions which she believed the first defendant sanctioned. 47 As for Nutryfarm, she disclaimed involvement in the N loan although she had heard about it.95Foot Note 95×The first plaintiff’s reply affidavit at paras 26–27.She did not know the first and second defendants would incorporate Furong Corpbond to make the N loan to Nutryfarm. She was shocked as it meant the first and second defendants were effectively ‘ring-fencing’ Furong’s assets. 48 The first plaintiff disclosed that assets-wise, neither the first defendant nor Furong would likely have sufficient assets to satisfy a judgment against them, pointing out that Furong had less than $100,000 in cash while the first defendant only had about $98,956.12 in his Singapore bank accounts and a net value (less mortgage loan outstanding) of $942,033.01 for the Sound Property.96Foot Note 96×See the first plaintiff’s reply affidavit at paras 26–27.The plaintiffs on the other hand had invested US$2.44m in the Furong Bonds. 49 In the first defendant’s affidavit filed on 3 April 2018 (“the first defendant’s reply affidavit”), he not surprisingly denied the first plaintiff’s allegations. He asserted there was no real risk of dissipation of his assets and that the first plaintiff was giving the excuse that she could not have known that he had been attempting to sell the Sound Property since September 2017 with a view to move to a property nearer to his son’s school.97Foot Note 97×See the first defendant’s reply affidavit at paras 4–5. 50 The first defendant noted that in the second defendant’s defence (at paras 12(d), 21), the latter had identified the first plaintiff as one of the persons who helped to structure, prepare and finalise the facts sheets and the Memoranda.98Foot Note 98×See the first defendant’s reply affidavit at para 12. 51 Contrary to the first plaintiff’s allegation that the first defendant took no action to recover from CVHT the losses on Furong’s investment, he deposed that after he found out about the losses in June 2017, he engaged solicitors in Hong Kong and Singapore in August 2017 and chased Lee for payment of the losses Lee had promised to meet in his message dated 25 June 2017.99Foot Note 99×See the first defendant’s reply affidavit at para 15.CVHT in fact did make one payment of US$25,000 on 31 July 2017. However, Furong’s Hong Kong solicitors raised issues of recoverability given that CVHT and Lee had no known assets.100Foot Note 100×The first defendant’s reply affidavit at para 16.The first defendant deposed that it was only when it was apparent that no further payments were forthcoming from Lee/CVHT that he requested the second defendant to lodge a police report in November 2017. 52 The first defendant noted that the first plaintiff had changed her tune. From claiming in the first plaintiff’s first affidavit that she was shocked to discover about the N loan to Nutryfarm, she had in the first plaintiff’s reply affidavit claimed that she knew about the N loan but not that another BVI company Furong Corpbond would be incorporated.101Foot Note 101×The first defendant’s reply affidavit at paras 17–18.He said that was a lie as the first plaintiff was intimately involved together with the second defendant in putting together the documentation to be signed by Furong Corpbond.102Foot Note 102×See also the first defendant’s reply affidavit at para 19.He pointed out that he was/is not a director of Furong Corpbond.103Foot Note 103×The first defendant’s reply affidavit at para 21.",
        "The arguments": "",
        "The decision": "65 As the plaintiffs themselves submitted (at para 49 of their submissions), “there is more than meets the eye as to the true account behind the whereabouts of the Plaintiffs’ monies”. The court had, at the conclusion of the hearing of the Discharge Application, said to counsel that based on the affidavits, it was impossible for the court to determine who was speaking the truth and who was being scammed. 66 However, what was clear to the court was the fact that neither side could claim to be the innocent party in the entire scheme of things. This observation will be elaborated upon below. 67 First, the court was sceptical of the first plaintiff’s claim that as an employee of Furong at the material time (who claimed she took instructions from the second defendant), she did not know whether any of the Furong Bonds were/were not capital guaranteed. Her professed ignorance defied belief. 68 If indeed the first plaintiff was a party to the misrepresentation (that the Furong Bonds were capital guaranteed when they were not) and/or she had a hand in the unauthorised Amended Memoranda that stated the Furong Bonds were capital guaranteed, there was no question that the injunction order should be discharged. Injunctive relief is an equitable remedy and should be/would be denied to the first plaintiff if she did not come to court with “clean” hands. 69 However, there was a factor in this case which the first defendant overlooked altogether in his submissions. Assumingarguendothat the first plaintiff came to court without “clean” hands, that only meant that the court should deny her the injunction. Looking at the table set out earlier at [32] above, the first plaintiff held US$400,000 bonds in her own name. She beneficially owned the bonds (US$75,000) held in Tang’s name as well as the US$200,000 bonds held in the name of her aunt Peng. That meant US$675,000 bonds should be deducted from the injuncted sum of US$2.44m leaving a balance of US$1,765,000 as the claims of the second to seventh plaintiffs. 70 As counsel for the plaintiffs pointed out in his submissions, what about the claims of the second to seventh plaintiffs? Were they to be denied interim injunctive relief just because the first plaintiff’s hands were tainted? The first plaintiff’s first affidavit was affirmed on her own behalf as well as on behalf of the six other plaintiffs. Even if she was not entitled to an injunction, there was no reason to tar the other plaintiffs with her brush. Why should the first plaintiff’s sin of commission and/or omission be visited on the six other plaintiffs? Nothing in the affidavits filed by the first defendant raised one iota of complaint and/or criticism against those persons. It would be unfair and inequitable for the court to deny the six plaintiffs an injunction if it was justified, merely because of the first plaintiff’s conduct. 71 Was it wrong of the court to have exercised its discretion in favour of the plaintiffs? To answer that question the court turned to certain disquieting aspects it had noted in the affidavits filed for the injunction application as well as for the Discharge Application. 72 The first defendant had repeatedly claimed that he left the running of Furong to the second defendant who left him in the dark as to what transpired in the company. The first defendant’s professed ignorance must be seen in the light of the following facts: (a) Furong’s fact sheet (exhibited at pp 411–414 of the first plaintiff’s first affidavit) referred to Furong’s 2-year 9.6% FX Bond that was released to the general public. The fact sheet clearly stated this bond was capital guaranteed. It was hard to believe that the first defendant would not be aware of such a fact sheet where similar information was posted on Furong’s website too.124Foot Note 124×The first plaintiff’s first affidavit at pp 424–425. (b) The first defendant’s claim that the second defendant with the assistance of the first plaintiff had made unauthorised amendments to the First Memorandum must be seen in the light of the fact that although the email from Continental dated 26 April 2016 to Furong advised against the use of the capital guarantee provision (due to Furong’s possible inability to honour the guarantee),125Foot Note 125×The first defendant’s affidavit at para 25.5.1.Continental did not make any comment or advise against the use of the following cl 3 (as part of tracked changes forwarded by Continental to Furong for approval in Furong’s revised fact sheet):126Foot Note 126×See the first defendant’s affidavit at pp 349, 359. 3.Safe Investors can enjoy a peace of mind with guaranteed capital and returns upon maturity. As the funds mainly aims to generate returns from Foreign exchange spread and commission earnings, the majority of invested capital will not be subjected to market/foreign exchange risk. There was no evidence that the first plaintiff (or the second defendant) had anything to do with the amendments proposed by Continental. Emails between 27 April 2016 and 3 May 2016 exchanged between Damien Chin the then manager of Furong and the printers DL Ideas Pte Ltd showed that neither the first plaintiff not the second defendant was responsible for the printing of the fact sheet that was revised by Continental.127Foot Note 127×See the first defendant’s affidavit at pp 372–377. (c) The first defendant’s disclaimer of involvement in Furong Corpbond (see [52] above) was untrue as he gave his consent to act as one of its two directors (the other director being the second defendant) and he also signed the form for Furong Corpbond to open an account with The Central Depository (Pte) Limited.128Foot Note 128×See the second defendant’s affidavit filed on 29 March 2018 in the winding-up proceedings at pp 208–209.The fact that he may have requested the second defendant to remove his name subsequently does not detract from the fact that he was very much aware of Furong Corpbond’s existence and that Furong was involved with Furong Corpbond. 73 What the court found highly suspicious was the first defendant’s contention that he had taken action against CVHT and Lee for Furong’s losses caused by CVHT. According to the first defendant (see [51] above), he had consulted Hong Kong solicitors by early August 2017 once he learnt of the losses in June 2017. In the first plaintiff’s reply affidavit, she had exhibited (at TY-18) a copy of the solicitors’ bill from King & Wood Mallesons (“KWM”) dated 6 February 2018 for services rendered to Furong between 24 November 2017 and 26 January 2018.129Foot Note 129×See the first plaintiff’s reply affidavit at pp 28–31.Item 8 of the bill’s breakdown showed that the solicitor(s) accompanied the client to Wan Chai police station on or about 1 December 2017. KWM’sentireservices related to the making of the police report, nothing more. No civil proceedings were commenced against CVHT in Hong Kong. 74The Wan Chai police report (at tab 10 of the first defendant’s affidavit) made on 22 November 2017 was barely legible. The bill of KWM referred to accompanying the client to the police station on or about 1 December 2017.  That must be a reference to the date when a supplemental police report was made by the second defendant (according to the first defendant’s affidavit). Inthe second defendant’s affidavit (at pp 333–334) filed on 29 March 2018 in the winding-up proceedings (“the winding-up affidavit”), it was noted that the Wan Chai police authorities (via email) had on 23 January 2018 requested of the second defendant to get the first defendant to sign a police report without which police investigations could not commence. The request was ignored by the first defendant. Hence, nothing came out of the police report(s) that the first defendant deposed he had requested the second defendant to lodge in Hong Kong. 75 I should add that the first defendant’s reply affidavit stated that a Hong Kong firm Oldham, Li & Nie Lawyers (“OLN”) was initially consulted;130Foot Note 130×First defendant’s reply affidavit at para 15.2.that statement is neither here nor there. He had exhibited to that reply affidavit a letter from OLN dated 10 August 2017 addressed to Furong.131Foot Note 131×See first defendant’s reply affidavit at p 38.It was not countersigned to confirm OLN’s services had even been accepted while its bill was totally redacted – the court had no clue what services if any were provided by OLN and if they related to CVHT, what was the nature/scope of those services.132Foot Note 132×See first defendant’s reply affidavit at p 42.Similarly, the Warrant to Act of Ho & Wee LLP (the alleged Singapore solicitors) exhibited in the same affidavit was not evendated letalone signed.133Foot Note 133×See first defendant’s reply affidavit at para 15.4, p 45.Closer scrutiny of those exhibits showed they did not bear out what the first defendant’s reply affidavit claimed at para 15. 76 As the first plaintiff said, it was strange that the first defendant could procure Lee’s statutory declarationin Singaporeon 9 February 2018 (see [28] above) after Furong had presumably made a complaint against Lee in Taiwan. (Lee’s statutory declaration gave a Taiwanese address.) The Taiwanese authorities appeared to have issued a criminal summons requiring Lee to attend at a police station on 22 June 2016 (exhibited at p 8 of Khoo Shuzhen Jolyn’s affidavit filed on 4 April 2018). The court found it suspicious that Lee would be so co-operative with the first defendant when possible criminal proceedings in Taiwan were hanging over Lee’s head. 77 Even more perplexing was the fact that Lee had admitted his wrongdoing/responsibility in a WeChat message to the first and second defendants and a third person on 25 June 2017 (at p 35 of the first defendant’s reply affidavit). It was (in the words of counsel for the plaintiffs) “an unequivocal admission of liability”. Yet, neither the first defendant nor the Furong have to date taken action and/or proceedings to recover Furong’s losses from CVHT and/or Lee. Such inaction lent credence to the allegation by the second defendant in para 86 of the winding-up affidavit that the first defendant and Lee were in collusion with one another.",
        "Conclusion": "78 This was a case where the court had to apply the classic “balance of convenience” test laid down by the UK House of Lords inAmerican CyanamidCo v Ethicon Ltd[1975] AC 396 (“American Cyanamid.”). 79 Undoubtedly, the second test inAmerican Cyanamidwas satisfied in this case – there was indeed a serious question to be tried. On the one hand, the plaintiffs’ statement of claim accused the defendants of making misrepresentations, breaching their fiduciary duties and conspiring to injure the plaintiffs by unlawful means. On the other hand, in the separate defences filed by the first defendant and Furong, they pushed the blame for the default on the Furong Bonds to the second defendant and the first plaintiff, contending that there was no case against them for misrepresentation or breach of fiduciary duties. Furong also filed a counterclaim against the first plaintiff and the second defendant. 80 The second defendant’s defence generally denied he had made any misrepresentations or breached his fiduciary duties to Furong or that he had conspired to injure the plaintiffs, raising again a serious question to be tried. 81 Applying the balance of convenience test, the court did not discharge but varied the injunction order such that the injunction order granted against the Sound Property was lifted. In its place, the court granted the plaintiffs leave to lodge a caveat against the Sound Property instead of accepting the first defendant’s offer (see [63] above) to inform the plaintiffs with seven days’ advance notice should he dispose of the Sound Property. In view of the questionable nature (see [72]–[77] above) of some of the actions of the first defendant and/or of some documents and/or events that transpired, the court was wary of accepting the first defendant’s word. A caveat lodged by the plaintiffs would undoubtedly alert them should the first defendant sell the Sound Property. 82 If the second to seventh plaintiffs were not allowed to file the caveat in place of the injunction the court lifted, grave injustice may be caused to them, as they were not party to any of the egregious actions (if true) that the first defendant had levelled against the first plaintiff. The first defendant would have dissipated all the assets within jurisdiction if he sold the Sound Property without the plaintiffs’ knowledge. The court was of the view that varying the injunction order by replacing the injunction in respect of the Sound Property with a caveat would result in the lowest risk of injustice to all parties concerned. Lai Siu ChiuSenior Judge Yeo Lai Hock, Nichol, Qua Bi Qi and Ong Tai Tiong Desmond (JLC Advisors LLP) for the plaintiffs;Thio Ying Ying Nee Lau and Khoo Shuzhen, Jolyn(Kelvin Chia Partnership) for the first defendant;Lam Kuet Keng Steven John (Templars Law LLC) for the second defendant on watching brief;Tien De Ming, Grismond and Ivan Ng (Infinitus Law Corporation) for the third defendant on watching brief."
    }
}