{
    "case_title": "Public ProsecutorvKoh Rong Guang",
    "ncitation": "[2018] SGHC 117",
    "coram": "Audrey Lim JC",
    "sections": {
        "Introduction": "1The Accused claimed trial to 12 charges, including four rape charges committed against one V who was then 13 years old. The charges pertained to incidents which occurred over five separate occasions, some of which involved other complainants (Fu, Ng and Tan). 2The charge relating to the first occasion (“1st Occasion”) is as follows: (1st Charge) That you, Koh Rong Guang, sometime between November and December 2013, on the 1st occasion, at the staircase of K-Box Entertainment Outlet at Choa Chu Kang Centre located at level 5 of 309 Choa Chu Kang Avenue 4, Singapore, did penetrate with your penis the vagina of [V] (Date of Birth: [x].08.2000), a woman then under 14 years of age, without her consent, and you have thereby committed an offence under Section 375(1)(b) and punishable under Section 375(3)(b) of the Penal Code (Cap 224, 2008 Rev Ed). 3The charges relating to the second occasion (“2nd Occasion”) are as follows: (2nd Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at the staircase of K-Box Entertainment Outlet at Choa Chu Kang Centre located at level 5 of 309 Choa Chu Kang Avenue 4, Singapore, did penetrate with your penis the mouth of [V] …, a woman then under 14 years of age, without her consent, and you have thereby committed an offence under Section 376(1)(a) and punishable under Section 376(4)(b) of the Penal Code (Cap 224, 2008 Rev Ed). (3rd Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at the staircase of K-Box Entertainment Outlet at Choa Chu Kang Centre located at level 5 of 309 Choa Chu Kang Avenue 4, Singapore, did penetrate with your penis the vagina of [V] …, a woman then under 14 years of age, without her consent, and you have thereby committed an offence under Section 375(1)(b) and punishable under Section 375(3)(b) of the Penal Code (Cap 224, 2008 Rev Ed). (4th Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at the staircase of K-Box Entertainment Outlet at Choa Chu Kang Centre located at level 5 of 309 Choa Chu Kang Avenue 4, Singapore, did commit an indecent act with a child, [V]…, a female then below the age of 16 years old, to wit, by making [V] strip naked and taking a photograph of her naked body, and you have thereby committed an offence punishable under section 7(a) of the Children and Young Persons Act (Cap 38, 2001 Rev Ed). (5th Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at the staircase of K-Box Entertainment Outlet at Choa Chu Kang Centre located at level 5 of 309 Choa Chu Kang Avenue 4, Singapore, did commit criminal intimidation to wit, by threatening to cause injury to [V] by hitting the wall with a spanner close to her face, with intent to cause alarm to her, and you have thereby committed an offence punishable under Section 506 (1st limb) of the Penal Code (Cap 224, 2008 Rev Ed). 4The charges relating to the third occasion (“3rd Occasion”) are as follows: (6th Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at a staircase of Blk 672A Choa Chu Kang Crescent, Singapore, did penetrate with your penis the vagina of [V] …, a woman then under 14 years of age, without her consent, and you have thereby committed an offence under Section 375(1)(b) and punishable under section 375(3)(b) of the Penal Code (Cap 224, 2008 Rev Ed). (7th Charge) (Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at a staircase of Blk 672A Choa Chu Kang Crescent, Singapore, did commit criminal intimidation, to wit, by threatening one [Ng], [Tan] and [Fu] with a knife and warning them not to tell anyone about the rape that they had witnessed, with intent to cause alarm to them, and you have thereby committed an offence punishable under section 506(1st limb) of the Penal Code (Cap 224, 2008 Rev Ed). 5The charges relating to the fourth occasion (“4th Occasion”) are as follows: (8th Charge) (Amended) That you, Koh Rong Guang, on 25 January 2014, at a staircase of a HDB block in the vicinity of NTUC Foodfare located at Blk 673B Choa Chu Kang Crescent, Singapore, did voluntarily cause hurt to [Fu], to wit, by punching the face and kicking the body of [Fu], causing him bodily pain, and you have thereby committed an offence punishable under section 323 of the Penal Code (Cap 224, 2008 Rev Ed). (9th Charge) (Amended) That you, Koh Rong Guang, on 25 January 2014, at a staircase of a HDB block in the vicinity of NTUC Foodfare located at Blk 673B Choa Chu Kang Crescent, Singapore, did commit criminal intimidation, to wit, by threatening to cause injury by hitting [Fu] and [V] with a brick, with the intent to cause alarm to them both, and you have thereby committed an offence punishable under section 506 (1st limb) of the Penal Code (Cap 224, 2008 Rev Ed). (10th Charge) (Amended) That you, Koh Rong Guang, on 25 January 2014, at a staircase of a HDB block in the vicinity of NTUC Foodfare located at Blk 673B Choa Chu Kang Crescent, Singapore, did penetrate with your penis the vagina of [V] …, a woman then under 14 years of age, without her consent, and you have thereby committed an offence under Section 375(1)(b) and punishable under Section 375(3)(b) of the Penal Code (Cap 224, 2008 Rev Ed). (11th Charge) (Amended) That you, Koh Rong Guang, on 25 January 2014, at a staircase of a HDB block in the vicinity of NTUC Foodfare located at Blk 673B Choa Chu Kang Crescent, Singapore, did procure the commission of an indecent act by one [Fu] (Male/ then 16 years old / D.O.B.: [y].02.1997) with a child, [V] (Female / then 13 years old / D.O.B.: [x].08. 2000), to wit, by directing [Fu] to stand behind [V], with his pants unzipped, while her buttocks were exposed, in order to take sexually explicit photographs, and you have thereby committed an offence punishable under section 7(a) of the Children and Young Persons Act (Cap 38, 2001 Rev Ed). 6Finally, the charge relating to the fifth occasion (“5th Occasion”) is as follows: (12th Charge) That you, Koh Rong Guang, on 19 January 2014, in Singapore, did circulate an obscene object to [Fu], who was then 16 years old …, to wit, by sending [Fu] a photograph of [V’s] naked body via a Whatapp message, and you have thereby committed an offence punishable under Section 293 of the Penal Code (Cap 224, 2008 Rev Ed). 7At the conclusion of the trial, I found that the Prosecution had proved beyond a reasonable doubt the 2nd to the 6th charges and the 8th to the 12th charges, and I convicted the Accused on those charges. I acquitted the Accused on the 1st charge as I was not satisfied that the Prosecution had proved its case beyond a reasonable doubt as to that charge. As for the 7th charge, although I was satisfied beyond a reasonable doubt that the Accused had committed the offencevis-a-visNg and Tan, there was a reasonable doubt as to whether Fu was present at the material time. I thus amended the charge as follows and convicted the Accused on the amended charge: (7th Charge) (Re-Amended) That you, Koh Rong Guang, sometime between end 2013 and early 2014, at a staircase of Blk 672A Choa Chu Kang Crescent, Singapore, did commit criminal intimidation, to wit, by threatening one [Ng] and [Tan] with a knife and warning them not to tell anyone about the rape they had witnessed, with intent to cause alarm to them, and you have thereby committed an offence punishable under section 506 (1st limb) of the Penal Code (Cap 224, 2008 Rev Ed). 8For the purposes of sentencing, the Accused admitted to seven other charges and agreed to have them taken into consideration, namely: (a) Two charges of using criminal force, punishable under s 352 of the Penal Code; (b) One charge of rioting, punishable under s 147 of the Penal Code; (c) One charge of voluntarily causing hurt (together with another person), punishable under s 323 read with s 34 of the Penal Code; (d) One charge of criminal intimidation, punishable under s 506 (1st limb) of the Penal Code; and (e) Two charges under the Films Act (Cap 107, 1998 Rev Ed) for possession of video files without a valid certificate and for possession of obscene films respectively. 9I sentenced the Accused to a total of 28 years’ imprisonment and 24 strokes of the cane (see [122]–[123] below). The Accused has appealed against both conviction and sentence.",
        "The Prosecution’s case": "10The Prosecution’s main witnesses were V, Fu, Tan, Ng and Victoria, whose testimonies I set out briefly below. The evidence of other witnesses will be dealt with where necessary in my findings.",
        "V’s testimony": "11V came from a broken home, with an abusive father. Because of this, she would leave home shortly after returning from school in the afternoon and stay out till late at night. In 2013, V spent a lot of time at Lot 1 Shopping Centre (“Lot 1”) and became acquainted with the Accused, a gang leader, and his friends including Fu, Tan and Kim. 12In relation to the 1st Occasion, sometime in the afternoon of November or December 2013, V was smoking at the staircase landing of the K-Box Entertainment Outlet (“KBox”) on level 5 of the building next to Lot 1, which V referred to as “Lot 2”, when she saw the Accused. He told V that he wanted to settle a conflict between V and XW (Fu’s then girlfriend), and told his friends to leave the staircase landing so that he could speak to V alone.After the Accused’s friends left, the Accused pinned V to the ground. She kicked him and struggled, but to no avail as he was much stronger. He then proceeded to pull down her shorts, unzipped his pants and raped her (1st charge).This was the first time V was alone with the Accused. 13The 2nd Occasion occurred between end 2013 and early 2014, although V could not recall the exact date.1Foot Note 1×Notes of Evidence (“NE”) 17/1/18at p 56.Whilst she was at Lot 1, Ng and Kim2Foot Note 2×NE 16/1/18 at p 37.came along and invited her to smoke with them, and they proceeded to Lot 2. At that time, V did not suspect anything amiss. When they arrived at the staircase landing at Lot 2, V saw the Accused.Ng and Kim then left V with the Accused, whereupon he took out a spanner and hit the wall near her face (5th charge), and scolded her vulgarities. V was very afraid. The Accused then forced her to perform oral sex on him by pushing her head towards his groin and inserting his penis into her mouth (2nd charge). After that, he put his penis into her vagina against her will (3rd charge).He then forced her to remove her clothes while holding onto the spanner to threaten her,3Foot Note 3×V’s conditioned statement (“CS”) at para 5; NE 16/1/2018 at p 42.and took a photograph of her naked (“Photo P19”) (4th charge) and walked out the door of the staircase landing. V put on her clothes and left. 14The 3rd Occasion occurred, also sometime between end 2013 and early 20144Foot Note 4×NE 17/1/18 at p 56., when Victoria had arranged to meet up with V. V did not suspect anything then. When V met Victoria, Victoria was with the Accused, Fu, Ng and Tan. They then asked V to follow them, to which she agreed, and they boarded two taxis to Yew Tee.5Foot Note 5×NE 16/1/18 at p 54.At that time, V did not think that Victoria would “sabotage” her.6Foot Note 6×NE 16/1/18 at p 54.When they arrived at Yew Tee, they took a lift up a block of HDB flats.After alighting from the lift, the Accused told everyone to leave as he wanted to talk to V separately. He then brought V down to another floor, and at the staircase landing, he pulled down her shorts and raped her (6th charge). Thereafter, they met up with the rest of the group and V then went home. 15The 4th Occasion occurred sometime around January or February 2014.7Foot Note 7×NE 17/1/18 at pp 56–57.The Accused had called V to meet him, but she replied “no” as she did not wish to be sexually abused again.8Foot Note 8×V’s CS at para 8.V then texted Fu to inform him that the Accused wanted to meet her. V told Fu about this as she needed someone to confide in and by then, she knew that Fu was already aware of what the Accused had done to her previously.9Foot Note 9×NE 16/1/18 at pp 58–59.Fu told V that he would accompany her to meet the Accused to persuade him not to do anything to her as Fu would “pretend” to be her boyfriend.10Foot Note 10×NE 16/1/18 at p 61.V agreed to go with Fu to meet the Accused as she thought that Fu would protect her from the Accused.11Foot Note 11×NE 17/1/18 at pp 15–16.Fu and V boarded a bus to Yew Tee to meet the Accused and all of them proceeded to a block of HDB flats. When they reached one of the floors of the HDB block, Fu tried to discourage the Accused from having sex with V, but he punched Fu’s face and body until he collapsed onto the floor (8th charge).The Accused then pulled V’s hair, and took a brick and held it near Fu’s face, threatening to smash Fu’s and V’s faces if V did not have sex with him (9th charge).12Foot Note 12×NE 16/1/18 at p 63.V told the Accused to stop hitting Fu and agreed to go with the Accused.13Foot Note 13×NE 17/1/18 at p 20.He then brought her up the staircase landing and forced her to have sex with him, by inserting his penis into her vagina (10th charge).The Accused then called Fu to go to where they were and told him to pose with V in a compromising position, as if Fu and V were having sex. The Accused stated that if they did not comply, he would use the brick to smash their faces. Hence, Fu stood behind V and pretended to penetrate her from the back, whilst the Accused took a photograph of them (“Photo P20”) (11th charge). The Accused then warned Fu that if he created any trouble for him, he would post the photo on social media.14Foot Note 14×NE 16/1/18 at p 65. 16On 4 July 2014, V found out that a collage of photographs (“the photo collage”), which included Photo P20 and a picture of V’s face, was circulating on social media. It was not disputed that the photo collage was sent by the Accused to one Popo (purportedly a social media influencer) and uploaded by Popo on Facebook. V then lodged a police report in the early hours of 5 July 2014 (exhibit D1) (“the First Report”), and a further report that night (exhibit P23) (“the Second Report”).",
        "Fu’s testimony": "17The Accused was the headman of a gang and Fu was his right-hand man and the one who executed the Accused’s orders.15Foot Note 15×NE 17/1/18 at p 84.The other gang members included Ng and Kim, but not Tan. The gang loitered around Lot 1 and that was how Fu came to know V. The Accused and V also came to know each other as they hung around the same vicinity, but they were not close. 18Sometime in November 2013, Fu complained to the Accused that V had badmouthed XW.16Foot Note 16×NE 17/1/18 at p 87.Fu asked the Accused to settle this issue, and the Accused subsequently informed Fu that he and Zona (the Accused’s girlfriend then) had brought V to the staircase landing at Lot 1 where Zona slapped V. However, Fu did not know if this was true as he was not there at that time.17Foot Note 17×NE 17/1/18 at p 90; NE 18/1/18 at pp 44–45. Account relating to the 2nd and 5th Occasions 19A few days later in November 2013, Fu, the Accused and their friends saw V at Lot 1. The Accused told Fu and the rest that he wanted to speak to V alone, and asked Fu and some others to look after Zona whilst he brought V to the staircase landing beside KBox at Lot 2. Fu and Ng waited with Zona as instructed by the Accused, and after a while, they grew impatient and went to look for him at KBox.18Foot Note 18×NE 18/1/18 at p 43.Right outside a side door of KBox was a staircase landing (see exhibits P13–P15). At KBox, Fu saw the Accused emerge from the staircase landing through the side door of KBox, and the Accused informed Fu that he had threatened and slapped V. A while later, V emerged from the staircase landing and walked away.19Foot Note 19×NE 18/1/18 at pp 43 and 47. 20Sometime in January 2014 and after the above incident, the Accused, Fu and Ng were playing “LAN” games at Bugis, when the Accused told Fu that he had threatened V, raped her and taken nude photographs of her on the day that Fu had waited with Zona whilst the Accused brought V to Lot 2 (see [19] above).20Foot Note 20×NE17/1/18 at pp 90–95 and 97–98.The Accused then sent to Fu (via Whatsapp on his hand phone) and some others a photograph of V in the nude (“Photo P19”) (12th charge). Fu also found out from V that the Accused had raped her on the day when Fu was with Zona. Account relating to the 3rd Occasion 21Fu then related another incident which occurred around late 2013 or early 2014. Whilst the Accused was with Fu and some others at Lot 1, the Accused informed them that he wanted to lure V out to have sex with her again. They then met up with V at a block of HDB flats near the Yew Tee NTUC Foodfare – at this time, Ng, Tan and Victoria were there as well. All of them (including V) took a lift up a block of HDB flats and went to a staircase landing. At this point, Fu decided to go downstairs to buy a drink and Victoria accompanied him – Fu was not feeling thirsty, but he did not want to witness what would happen to V.21Foot Note 21×NE 17/1/18 at p 125; NE 18/1/18 at p 61.When he returned upstairs, he saw Ng and Tan at the same staircase landing. The Accused then appeared and threatened Fu, Ng and Tan with a knife not to tell anyone about what they had witnessed (7th charge).22Foot Note 22×NE 17/1/18 at pp 124–125 Account relating to the 4th Occasion 22Sometime in January 2014, V informed Fu that the Accused wanted to meet her. Fu contacted the Accused to find out the reason for the meeting and the Accused told Fu that he wanted to have sex with V. Fu then arranged the meeting place with the Accused, and told V that he would accompany her to meet the Accused. It was not disputed that the meeting between the Accused, Fu and V occurred on 25 January 2014. 23Fu and V then travelled to Choa Chu Kang Crescent to meet the Accused and they all proceeded to a block of HDB flats near the Yew Tee NTUC Foodfare,23Foot Note 23×NE 18/1/18 at p 23.and took the lift upstairs. The Accused then asked V why she had told Fu that he was looking for her and started to threaten her. At that point, Fu intervened and told the Accused that V was his girlfriend, apparently to protect V. The Accused then punched Fu’s face, and punched and kicked his body until he collapsed onto the ground. The Accused took a brick and was about to hit Fu when V pleaded with him to stop and agreed to have sex with him. V and the Accused then left for another floor. 24A while later, the Accused asked Fu to come upstairs to where he and V were. He forced Fu to pose in a compromising position with V (as if they were having sex) and took photographs of them (including Photo P20). The Accused stated that he wanted to use the photographs as leverage against V, so that V would not report him to the police. Immediately after that incident, the Accused showed Fu, on his hand phone, the photographs that he had taken (including Photo P20). As Fu was the Accused’s right-hand man, the Accused informed Fu that he would delete the photos. However he did not do so but instead sent Photo P20 to Fu’s hand phone.24Foot Note 24×Exhibit P24, s/n 278; NE 17/1/18 at pp 115–116. 25On 4 July 2014, Fu discovered on Facebook the photo collage. He was shocked and upset and contacted V, and they went to the police station where V lodged the Second Report. Fu knew that the Accused had caused the photos to be uploaded onto social media, as the Accused had previously messaged Fu to find out if Fu had implicated him in a rioting case (pending in the State Courts).25Foot Note 25×NE 18/1/18 at p 9; Exhibit D3.Although Fu knew that the Accused had been sexually abusing V, he did not report to the police as he was afraid of the Accused.",
        "Victoria’s testimony": "26Victoria was V’s senior in school and they were acquaintances. She had planned to meet V one night at Jurong, and whilst they were there, the Accused came along. V “froze” when she saw him, but nevertheless the three of them proceeded to board a taxi to a block of HDB flats at Yew Tee.26Foot Note 26×NE 17/1/18 at p 68.Fu was with them, although Victoria could not recall whether he was with the Accused throughout or only arrived later.27Foot Note 27×NE 17/1/18 at p 76.The Accused, Fu, Victoria and V then took a lift up a block of HDB flats. After they got off the lift, Victoria and Fu left the Accused with V, took the lift downstairs and waited around the vicinity. After a while, the Accused and V came downstairs. Victoria could not recall if there were others with them that day.28Foot Note 28×NE 17/1/18 at p 80.However, this was the only occasion that she had met V together with the Accused and Fu.29Foot Note 29×NE 17/1/18 at p 72.",
        "Tan’s testimony": "27Tan came to know Fu and Ng in 2013. Tan was not a member of the Accused’s gang although he hung out with the Accused and his gang. Tan testified regarding the 3rd Occasion, where he was with Fu, Ng and the Accused at Yew Tee. The Accused had called V to meet them, and Victoria also came along. Subsequently all of them (including V) proceeded to Block 672A Choa Chu Kang Crescent,30Foot Note 30×NE 18/1/18 at pp 104, 115–116 and 118.took a lift upstairs and proceeded to a staircase landing. At the staircase, the Accused brought V one or two floors down from where Tan, Ng and Fu were. By this time, Tan knew of the Accused’s intention as the Accused had earlier mentioned that he wanted to have sex with V.31Foot Note 31×NE 18/1/18 at pp 104–105.Subsequently, Fu and Victoria went downstairs to buy drinks, leaving Tan and Ng.32Foot Note 32×NE 18/1/18 at p 107.Tan and Ng then walked down a few steps and peeped through the gaps in between the staircase railings and saw the Accused having sex with V.33Foot Note 33×NE 18/1/18 at p 125.After that, the Accused proceeded back upstairs to where Tan and Ng were and asked them if they wanted to have sex with V, whereupon they said no. He then took out a knife, which was about 30 cm long (inclusive of the blade and the handle),34Foot Note 34×NE 18/1/18 at p 110.and pointed it at Tan and Ng and threatened them not to say anything about what had happened. Tan was afraid when the Accused pointed the knife at him.35Foot Note 35×NE 18/1/18 at p 128. 28Tan also testified that prior to the 3rd Occasion, the Accused had shown him a photo of V naked and informed him that he had had sex with V.36Foot Note 36×NE 18/1/18 at p 111.",
        "Ng’s testimony": "29Ng was a member of the Accused’s gang, and they frequented Lot 1 as well as the KBox in Lot 2. Whilst at Lot 2, Ng came to know V. Ng also discovered, from the Accused and Fu, of two occasions on which the Accused had sex with V. The Accused would also boast to Fu and him about having had sex with her. The Accused had also shown Photo P19 to Ng and informed him that he had taken it.37Foot Note 37×NE 23/1/18 at p 19. 30Ng related the incident on the 3rd Occasion, which occurred at the end of 2013.38Foot Note 38×NE 23/1/18 at p 26.He was with the Accused, Fu and Tan at Yew Tee when the Accused called V to meet him. The Accused then asked Ng, Fu and Tan whether they wanted to have sex with V and they replied no. When V came, the Accused brought everyone up a block of HDB flats (near the Yew Tee NTUC Foodfare). After getting off the lift, the Accused brought V down two floors while Ng and Tan waited at the staircase landing. Fu went to buy a drink. Ng decided to look through the gaps between the staircase railings and saw the Accused having sex with V. The Accused then went back upstairs to where Ng and Tan were and warned them not to tell anyone what they had witnessed. Ng knew that V was not willing to have sex with the Accused but he did not report the matter to the police as he was afraid of the Accused.39Foot Note 39×NE 23/1/18 at p 14.",
        "The Defence case": "31The Defence case was narrated by the Accused, who was the leader of a gang whose members included Fu, Ng, and Kim.40Foot Note 40×NE 23/1/18 at pp 72–73 and 79.They were a “well-known notorious gang” at Lot 1 and Lot 2, who fought with others, got into trouble with the police and the Accused even had Tan beaten up when he heard rumours that Tan had raped V.41Foot Note 41×NE 23/1/18 at pp 43, 46 and 61.Fu was the Accused’s “best brother” and “assistant”.42Foot Note 42×NE 23/1/18 at p 73.I found that Fu was his right-hand man – the Accused trusted him, and he was the one who relayed the Accused’s instructions and messages to the other gang members43Foot Note 43×NE 23/1/18 at pp 73 and 95.. The Accused came to know of V in 2013, and all throughout, V was merely a stranger to him. 32The main thrust of the Accused’s case is that of bare denial. Regarding the 1st Occasion, Zona had, in the presence of the Accused and Fu, slapped V because V had bad-mouthed XW.  He stated that he did not rape V on this occasion.44Foot Note 44×NE 23/1/18 at p 38.As for the 2nd Occasion, it was a “normal day” and the Accused did not meet V at all and did not do anything to her at the staircase landing outside KBox as he was not there.45Foot Note 45×NE 23/1/18 at p 42.However, on that day, one Yixin (who was not part of the Accused’s gang but was known to him) had sent the Accused Photo P19 and the Accused then sent it to Fu.46Foot Note 46×NE 23/1/18 at p 42.The Accused stated that the incidents on the 3rd Occasion did not occur as there was never an occasion on which he, Fu, Ng, Tan, Victoria and V had met at Yew Tee and taken a lift up a block of flats.47Foot Note 47×NE 23/1/18 at p 56.The only occasion where he had met V at Yew Tee was on 25 January 2014 and this was with Fu (see [33] below). 33Turning to the 4th Occasion, the Accused stated that on 25 January 2014, Fu had devised a plan to make V his girlfriend.48Foot Note 48×NE 23/1/18 at pp 48–51.To effect the plan, the Accused would approach V to ask her why she claimed to be the “Teck Whyedajie” (big sister of Teck Whye). Fu would then step in and pretend to protect V from the Accused. The Accused agreed to help Fu carry out his plan. Hence, Fu brought V to meet the Accused at the Yew Tee NTUC Foodfare, but when they arrived, the Accused noticed that V was “giving [Fu] attitude” and “staring” at Fu. Fu then told the Accused that he wanted to speak to V alone, and Fu and V left the Accused at the Yew Tee NTUC Foodfare. About half an hour later, Fu returned with V to meet the Accused at the Yew Tee NTUC Foodfare. The Accused did not know where Fu had gone, but later that day, Fu sent him Photo P20 and two other photographs of Fu and V taken on the same occasion as Photo P20 (as found in the photo collage). 34The Accused admitted that he had prepared the photo collage and in July 2014 asked Popo to upload it, as he wanted to shame Fu who had implicated him in a rioting case.49Foot Note 49×NE 23/1/18 at pp 39 and 66.He also alleged that V had made all these allegations to get back at him for the photo collage that was circulated.50Foot Note 50×NE 23/1/18 at p 38.",
        "My decision": "",
        "Applicable legal principles": "35I will first set out the applicable principles for assessing the evidence and the credibility of a witness. Where no other evidence is available, a complainant’s testimony can constitute proof beyond reasonable doubt only when it is so “unusually convincing” as to overcome any doubts that might arise from the lack of corroboration (seeAOF v PP[2012] 3 SLR 34 (“AOF”) at [111]). A complainant’s testimony would be considered unusually convincing if the testimony “when weighed against the overall backdrop of the available facts and circumstances, contains that ring of truth which leaves the court satisfied that no reasonable doubt exists in favour of the accused”. The “relevant considerations in determining whether a witness is unusually convincing are his or her demeanour and the internal and external consistencies found in the witness’ testimony” (Haliffie bin Mamat vPP and other appeals[2016] 5 SLR 636 (“Haliffie”) at [28], citingPPvMohammed LitonMohammed Syeed Mallik[2008] 1 SLR(R) 601 (“Mohammed Liton”) at [39] andAOFat [115]). The requirement that the complainant’s evidence should be “unusually convincing” does not change the ultimate rule that the Prosecution must prove its case beyond a reasonable doubt, but it sets the threshold for preferring the complainant’s testimony over the accused’s evidence where there is no other evidence and it boils down to one person’s word against another’s (XP vPP[2008] 4 SLR(R) 686 at [31] and [34]). Where the complainant’s evidence is not unusually convincing, an accused’s conviction is unsafe unless there is some corroboration of the complainant’s story (Haliffieat [30], citingAOFat [173]). 36The approach to corroborative evidence is a “liberal” one. To determine whether a piece of evidence can amount to corroboration, the court looks at “the substance as well as the relevance of the evidence, and whether it is supportive or confirmative of the weak evidence which it is meant to corroborate” (Mohammed Litonat [43]). But such “liberal corroboration” is nevertheless subject to certain “inherent conceptual constraints” (AOFat [175]). Under s 159 of the Evidence Act (Cap 97, 1997 Rev Ed), former statements may corroborate later testimony as to the same fact but this is only if the former statements were made “at or about the time when the fact took place, or before any authority legally competent to investigate the fact”. 37At the outset and from the parties’ submissions, there was no dispute by the Defence over the elements of the offences constituting each of the charges. The Accused’s defence was one of bare denial – Zona slapped V on the 1st occasion and he did not rape her; he never met V on the 2nd and 3rd Occasions; and he never went with V and Fu to a block of HDB flats on the 4th Occasion. Hence the incidents which are the subject-matter of the 2nd to 11th charges could not have taken place. As for the 12th charge, the Accused admitted to circulating Photo P19 to Fu.",
        "1st Occasion (1st charge)": "38In relation to the 1st Occasion, V stated that whilst at Lot 2 around November or December 2013, the Accused confronted her to settle a conflict between her and XW. When he was alone with V at the staircase landing outside KBox, he pinned her down and raped her. 39I found that the Prosecution had not proved its case beyond a reasonable doubt on the 1st charge. A reasonable doubt had been raised, as V’s evidence was not unusually convincing and there were some external inconsistencies. First, V stated that the confrontation (and the rape) occurred when she and the Accused were alone. However, there was evidence to suggest that this might not have been the case. Fu testified that Zona had informed him that she had been present at the confrontation and had slapped V.51Foot Note 51×18/1/18 NE 45.The point here is not whether Zona had indeed been there and slapped V, but that Fu recounted that Zona had told him as such. Second, V did not inform anyone about this incident until after Photo P20 was circulated in July 2014. In fact, before V made the Second Report, she did not even inform Fu of this incident, despite having informed him of the 2nd, 3rd and 4th Occasions.52Foot Note 52×18/1/18 NE 16.I accept that a rape victim may be hesitant to make a report, and V explained that she did not want to be thought of as “loose” and that it was embarrassing, but this did not explain why she was forthcoming with Fu about the other three Occasions but not the 1st Occasion. 40In the final analysis, whether the 1st Occasion occurred was based on V’s sole and uncorroborated account. Whilst there might be cogent reasons why V did not inform anyone about the 1st Occasion until after she made the Second Report, the lack of contemporaneous or early reporting of the 1st Occasion, coupled with the absence of supporting evidence, reduced the strength of her testimony. As such, I found it unsafe to prefer V’s account over the Accused’s account and to convict the Accused on the 1st charge.",
        "2nd Occasion (2nd, 3rd, 4th and 5th charges)": "41As for the 2nd Occasion, V stated that Ng and Kim had approached her at Lot 1 to smoke and they proceeded to Lot 2. When they arrived at the staircase landing at Lot 2, V saw the Accused. She was then left alone with the Accused who took out a spanner and hit the wall near V’s face and scolded vulgarities at her. He then forced her to perform oral sex on him before he raped her and took Photo P19. The Accused’s defence was that he was never alone with V on any occasion anywhere,53Foot Note 53×23/1/18 NE 108.he was not even at the staircase beside KBox on the day of the alleged 2nd Occasion, and that Yixin sent Photo P19 to him on that day. 42I accepted V’s evidence and disbelieved the Accused. I found her evidence to be clear and consistent on the material aspects, and consistent with other evidence. Whilst no one had witnessed the acts that she described, there was evidence to support her account that the Accused and her were at Lot 2 together, that he had raped her and that he had taken Photo P19. 43First, Fu testified that the Accused had on an occasion (around end 2013) instructed him to look after Zona whilst the Accused and V settled matters at Lot 2. Fu stated that when he subsequently went to KBox to look for the Accused, he saw the Accused emerge from the staircase landing through the door into KBox, followed by V. I accepted Fu’s account in this regard. 44Next, that the Accused had taken a photograph of V naked was supported by the forensic examination of his hand phone which revealed that, whilst Photo P19 was transmittedoutfrom his hand phone (to Fu), there was no prior transmission of Photo P19intohis hand phone from anyone else. Darius Cai (“Darius”), a Technology Crime Forensic Investigator of the Criminal Investigation Department, had conducted a forensic examination of the Accused’s hand phone that he had used to send Photo P19 to Fu on 19 January 2014.  Whilst the forensic examination revealed that the Accused hadsentPhoto P19 from his hand phone to Fu’s hand phone, no such Photo P19 was found in the Whatsappreceiveditems on the Accused’s hand phone.54Foot Note 54×NE 19/1/18 at p 35.The Accused claimed that Yixin had sent him Photo P19 on the same day or one or two days via Whatsapp55Foot Note 55×NE 23/1/18 at p 111.before the Accused sent it to Fu and that Photo P19 was received by the Accused on the same hand phone number that he used to send it to Fu.56Foot Note 56×NE 23/1/18 at pp 42, 102 and 111.If so, Photo P19 would have appeared in the Whatsapp received items on the Accused’s hand phone, but it did not. Even if Darius could not categorically confirm who had taken the photo, the fact remained that if anyone had sent the photo to the Accused (as he claimed), it would have appeared in his hand phone as a received item. As such, the Accused’s account was inconsistent with and plainly contradicted by the objective evidence from his hand phone. 45In any event, the Accused’s assertion, that Yixin had sent him Photo P19, was not substantiated by Yixin (whom the Accused did not call) nor put to V in her cross-examination, although Mr Choh, the defence counsel for the Accused, admitted that this was an important point.57Foot Note 57×NE 18/1/18 at p 50.If the Accused’s assertion were true, it made no sense for V to implicate him instead of Yixin in relation to who had taken Photo P19. I thus found that the evidence pointed to the Accused having taken Photo P19. 46Additionally, Fu’s and Ng’s independent accounts of what the Accused had told them supported the case that that the Accused and V had been together and that he had taken Photo P19. I had no reason to disbelieve their independent accounts. Fu testified that the Accused had told him that on the day Fu was looking after Zona, the Accused had threatened V, raped her and taken Photo P19 at the Lot 2 staircase.58Foot Note 58×NE 17/1/18 at pp 90–92 and 98.He then sent the photo to Fu and others via Whatsapp on his hand phone.59Foot Note 59×NE 17/1/18 at pp 97–98.Fu and Ng were also clear and categorical in maintaining that the Accused had shown Photo P19 to them from his hand phone and had also told them that he took the photograph.60Foot Note 60×NE 18/1/8 at pp 48–49 and 53–54; NE 23/1/18 at pp 18–19.Although there was some uncertainty as to where this occurred – Fu stated that they were at Bugis playing “LAN games”, whereas Ng could not recall – this discrepancy was immaterial. Mr Choh (in Fu’s cross-examination) asserted that the Accused had shown Fu Photo P19 when they were playing LAN games, and the Accused had admitted that he shown Photo P19 to Fu and sent the photo to Fu.61Foot Note 61×NE 18/1/18 at pp 53–54; NE 23/1/18 at pp 110–111. 47Fu’s and Ng’s evidence of what the Accused had told them was material and relevant evidence supporting V’s claim that the Accused had threatened and raped her and forced her to remove her clothes to take a photograph. Whilst there was no independent evidence supporting V’s claim that he had used a spanner in threatening her (although a spanner, among other tools, was seized from his home by the police) or had forced her to perform oral sex, given the totality of the evidence including the accounts of V, Fu and Ng, I was satisfied that V was telling the truth that the Accused had threatened her with a spanner and forced her to perform oral sex on him. I did not see any reason why V would embellish her account with such additional incidents if they did not occur. 48I was satisfied that Fu had no reason to lie. I rejected the Defence’s claim that Fu lied to get back at the Accused for causing the photo collage to be circulated. Pertinently, there was no reason for Ng to lie, and the Accused admitted that he could not think of any reason for Ng to falsely implicate him.62Foot Note 62×NE 23/1/18 at p 92. 49I turn to various matters that Mr Choh raised to cast doubt on the Prosecution’s case. First, the Accused claimed that the 2nd Occasion did not occur as he had never used the door of KBox to enter the staircase landing, and no one was allowed to use the door to enter the staircase landing to smoke there.63Foot Note 63×NE 23/1/18 at pp 44–45.I disbelieved the Accused as the evidence showed otherwise. Fu had testified that he saw the Accused emerge from the staircase landing on the 2nd Occasion. The Accused himself admitted that the photographs of the staircase landing (exhibit P15) showed cigarette butts on the floor.64Foot Note 64×NE 23/1/18 at p 100.It was clear that people smoked there whether or not it was permitted, and in fact Ng stated that the gang would go to the staircase landing to smoke.65Foot Note 65×NE 23/1/18 at p 26.More importantly, the Accused contradicted himself when he subsequently admitted that he had used the door before to enter the staircase landing.66Foot Note 66×NE 23/1/18 at p 46. 50Second, Mr Choh suggested that the Accused could not have re-entered KBox from the staircase landing, after the alleged incidents occurred, because the door leading to the staircase landing was a one-way door that only opened outward to that area. I found that this did not affect V’s veracity and testimony. V explained that whilst the door was not completely open, she did not know if it was completely shut on that day – it was possible that something was used to hold the door to prevent it from shutting.67Foot Note 67×NE 17/1/18 at p 46.V stated that she was looking at the floor at that time,68Foot Note 68×NE 16/1/18 at p 45.which was unsurprising given that she was scared, vulnerable and embarrassed when the Accused raped her and then took a photograph of her naked.69Foot Note 69×NE 16/1/17 at p 44.In any event, Fu testified that he saw the Accused walk through that door into KBox when he went to KBox to look for him. 51Third, Mr Choh suggested that it was “impossible” for Photo P19 to be taken at the staircase beside KBox as the bottom of the photograph had a “brown border lining against the wall”, which appeared to be absent from the bottom of the wall of the staircase.70Foot Note 70×NE 17/1/18 at pp 43–44.In my judgment, this was inconclusive and no reliable inferences could be drawn from a comparison of Photo P19 with the photographs taken of the staircase beside KBox (eg, exhibit P17). The colour of the background wall as seen in Photo P19 was not a reliable indication of the true colour of that wall, and nothing helpful could be deduced from it. A perusal of Photo P19 would show that the background colour had various shades and was “grainy” – this could be due to the quality of the photograph image. Hence, it was not possible to form any reliable conclusion that the photograph could not have been taken at the staircase beside KBox. 52Fourth, Fu stated that he saw the Accused return to KBox through the door leading to the staircase landing, and then witnessed V do the same. V stated that the Accused walked through the door into KBox, but she walked down the stairs and went home. In my view, even if there was a mistake as to how V had exited Lot 2, this inconsistency did not affect V’s (or Fu’s) credibility.It is not unusual for victims of trauma not to recall each and every minutiae detail or even recall them correctly, particularly if the incident occurred sometime ago.As stated inMohamed Abdullahs/o Abdul Razak v PP[2000] 1 SLR(R) 922 at [34], “[i]n weighing the evidence of witnesses, human fallibility in observation, retention and recollection will be recognised by the court … The question for the court in each case is whether the alleged discrepancies are sufficient to destroy the credibility of the witnesses”. Likewise, whether the Accused had pulled V’s shorts to the side or had pulled it down to her thigh area before raping her71Foot Note 71×NE 16/1/18 at p 42; NE 17/1/18 at pp 40–41.was not a material inconsistency sufficient to shake V’s credibility and veracity. 53Finally, Mr Choh suggested that it made no sense for V to follow the Accused’s friends to Lot 2 on the 2nd Occasion, if she had previously been raped by the Accused on the 1st Occasion. I did not find this to affect V’s veracity and testimony regarding the 2nd Occasion. V explained that she was with other persons, and there was no evidence that she knew what the Accused was intending to do to her.72Foot Note 72×NE 16/1/18 at p 38.I add that although V did not attempt to escape when they were at the staircase alone, this was not surprising or unusual. Without warning, the Accused threatened V with a spanner and hurled vulgarities to frighten her. V also tried to resist when the Accused pulled and tugged at her shirt, but it was obvious that he was the stronger party. 54I reiterate – the Accused’s defence was one of bare denial. He claimed that he never met V on the 2nd Occasion and did not take Photo P19. However, the evidence showed otherwise. The forensic examination of the Accused’s hand phone pointed to him having taken Photo P19, and this was corroborated by Fu’s and Ng’s accounts that he had told them the same. Fu also stated that the Accused had informed him that he had threatened and raped V on the occasion he had taken Photo P19, and Ng had also testified that the Accused had boasted to him about having sex with V. Having found that Photo P19 was taken by the Accused, I had no reason to doubt V’s account that it was so taken after she was raped by him, and it was clear that Photo P19 was taken without V’s consent. Hence, on the totality of the evidence, I was satisfied that the 2nd, 3rd, 4th and 5th charges had been proved beyond a reasonable doubt.",
        "3rd Occasion (6th and 7th charges)": "55Coming to the 3rd Occasion, V’s evidence was that Victoria had arranged to meet up with her and subsequently they met the Accused, Fu, Ng and Tan. They took a lift up a block of flats at Yew Tee and when they alighted, the Accused brought V down to another floor and raped her at the staircase landing. The Accused claimed that this 3rd Occasion was a “fake”73Foot Note 73×NE 23/1/18 at p 59.and he had never gone to any block of flats with V (whether or not with other persons), and the only occasion he had met V was at the Yew Tee NTUC Foodfare on 25 January 2014 when V was with Fu.74Foot Note 74×NE 23/1/18 at pp 56 and 108. Preliminary issue – when the 3rd Occasion occurred 56As a preliminary point, there was some uncertainty as to whether the 3rd Occasion preceded the 4th Occasion orvice versa. It was not disputed that the Accused, Fu and V had met up on 25 January 2014, which was the subject of the 4th Occasion. V stated that the 3rd Occasion preceded the 4th Occasion – this was supported by Tan’s account, as he admitted that he had raped V in December 2013, which was after the 3rd Occasion had occurred.75Foot Note 75×NE 18/1/18 at p 114.It was also supported by Ng’s account that the 3rd Occasion happened in end 2013.76Foot Note 76×NE 23/1/18 at p 26.Fu on the other hand stated that the 4th Occasion preceded the 3rd Occasion,77Foot Note 77×NE 17/1/18 at p 123.and Victoria recounted the events as taking place in February 2014 on the night before she was due to appear in court for an unrelated offence.78Foot Note 78×NE 17/1/8 at p 72. 57I accepted V, Tan and Ng’s accounts that the 3rd Occasion preceded the 4th Occasion. Tan testified that he had raped V after he had witnessed the Accused do the same to her, and Tan was sentenced for this offence which he admitted to have taken place in December 2013.79Foot Note 79×NE 18/1/18 at p 135.I found that Fu was likely mistaken about the chronology of events – although in court he stated that the 3rd Occasion happened after the 4th Occasion, in his conditioned statement he had recounted the 3rd Occasion taking place “in late 2013 or early 2014” and the 4th Occasion occurring after he returned to Singapore in January 2014.80Foot Note 80×Fu’s CS (PS4) at paras 5, 7 and 12.As for Victoria, no evidence was tendered as to when she appeared in court for her own case. In any event, I found the witnesses’ inconsistencies as to the dates of the 3rd and 4th Occasions to be immaterial. It should be borne in mind that where a witness gives evidence on a matter after a significant lapse of time, “[a]dequate allowance must be accorded to the human fallibility in retention and recollection” (seePPv Singh Kalpanath[1995] 3 SLR(R) 158 at [54] and [60]). In the present case, the 3rd and 4th Occasions occurred some three years before the conditioned statements were recorded and some four years before the commencement of trial and it was reasonable to expect that the witnesses’ memories of the incidents may fade over time. In Victoria’s case, she was not even slated as a witness in this trial, and the decision to call her was only made after V testified in court that Victoria was with her on the 3rd Occasion. 58That said, whether the 3rd Occasion preceded the 4th Occasion did not materially affect and was not detrimental to the Prosecution’s case. It was clear from the witnesses’ evidence that they were all referring to the same occasion. Ultimately the Accused’s defence was that he had never gone with V to any block of flats and the 3rd Occasion was a “fake”. The issue thus, was whether the 3rd Occasion happened at all, regardless of whether it was in late 2013 or early 2014. Findings on the 6th charge 59I was satisfied that V was telling the truth regarding the 3rd Occasion. V’s account was consistent with and amply supported by the accounts of Victoria, Fu, Ng and Tan, whom I found were present on that occasion, and in the case of Ng and Tan, had witnessed the rape. 60I accepted Fu’s testimony that the Accused wanted to lure V out that day to have sex with her.81Foot Note 81×Fu’s CS at para 12.This was corroborated by Ng who was with the Accused, Fu and Tan when the Accused told him that he would call V out and even asked Ng, Fu and Tan if they wanted to have sex with V.82Foot Note 82×Ng’s CS at para 5.Victoria then contacted V to meet up with her. I accepted that V did not then suspect what was going to happen or that she was expecting to see the Accused that night, and that when she saw him, she felt “betrayed”.83Foot Note 83×NE 16/1/18 at pp 52–53.This accorded with Victoria’s evidence that V “froze” when she first saw the Accused. 61Pertinently, the meeting at which the Accused was present was corroborated by Victoria. I accepted her account of what had occurred (see [26] above), in particular that the Accused, Fu, V and she had taken a lift up a block of HDB flats at Yew Tee, and subsequently she and Fu went downstairs leaving the Accused and V at the block of HDB flats. I found Victoria to be an impartial witness who had no reason to lie. She did not know V well and they were merely acquaintances.84Foot Note 84×17/1/18 NE 66–67 and 74.Victoria also did not know the Accused well, and the Accused agreed that there was no reason for her to make such allegations against him.85Foot Note 85×17/1/18 NE 77; 23/1/18 NE 57, 68–70.However he suggested that she might have been mistaken as to that meeting as they had met up on many occasions. I found no merit in his assertion. Victoria was categorical in maintaining that the Accused was there at Yew Tee one night with her and V,86Foot Note 86×17/1/18 NE 77–79.and Fu and Tan also testified that Victoria was present with them on an occasion at Yew Tee. Regardless of whether Victoria had met the Accused on other occasions elsewhere, she was clear that she had met up with the Accused and V together at a block of flats at Yew Tee. 62Next, the meeting and what had transpired that day was corroborated by Ng and Tan, whom I accepted had witnessed the Accused having sex with V at the staircase landing. It was possible for them to see what was going on as there were gaps in between the staircase railings. Ng and Tan both witnessed the Accused standing behind V whilst having sex, consistent with V’s testimony.87Foot Note 87×V’s CS (PS3) at para 7; Tan’s CS (PS5) at para 5; Ng’s CS (PS6) at para 5.I found that Ng and Tan had no reason to lie. The Accused could not proffer an explanation as to why Ng would lie.88Foot Note 88×NE 23/1/18 at p 92.As for Tan, he was not even in the Accused’s gang and he did not know V well.89Foot Note 89×NE 18/1/18 at p 101.The Accused’s suggestion that Tan had lied to get back at him for being beaten up,90Foot Note 90×NE 23/1/18 at p 92.was never put to Tan in his cross-examination, nor borne out by the evidence. Tan had been candid as he had even admitted to raping V after witnessing the Accused having sex with V that night, and had admitted to the offence when charged.91Foot Note 91×NE 18/1/18 at p 135; Tan’s CS at para 9.I also accepted Fu’s evidence that he had been there that night and had accompanied the Accused and V up the lift. He then left with Victoria to get a drink (corroborated by Victoria) as he did not want to witness what would happen to V, knowing well beforehand that the Accused had lured V out for sex. 63Whilst V could not recall the location where she was raped, I accepted that Tan was able to identify that it had happened at Block 672A Choa Chu Kang Crescent although he could not recall the specific floor. He was able to identify the specific block of flats as he could retrace his steps from the Yew Tee NTUC Foodfare when he led the investigating officer to that block in 2015.92Foot Note 92×NE 18/1/18 at p 118.I had no reason to doubt his recollection of this event, given that the path from the Yew Tee NTUC Foodfare to Block 672A through an open area was a straightforward one (see exhibit P43). ASP Samantha Xu, who had brought Tan to the scene also confirmed that Tan had identified the block of flats.93Foot Note 93×NE 19/1/18 at pp 19 and 25–26. 64No doubt, there were some discrepancies among the witnesses’ accounts. This included whether Victoria had met V first before the Accused and the others came along, how many taxis they took and who were seated in each taxi. Nevertheless, I did not find the differences in the accounts were material to affect the veracity of V, Victoria, Fu, Ng and Tan. Additionally, although Ng could not recall Victoria being present on this occasion,94Foot Note 94×NE 23/1/18 at p 12.I found that he had likely forgotten, given that the incident happened some four years back. At the end of the day, the Accused’s defence was one of bare denial – that he did not go to a block of flats with V (let alone with V, Fu, Tan, Ng and Victoria) on any occasion. The evidence of more than one witness showed otherwise. 65I was also cognisant that, even given that V might not have realised that she would be meeting the Accused that night when she first met up with Victoria, she still continued to follow him to the block of flats whereupon he raped her. However, I did not find her conduct unusual. V stated that if she had not followed the Accused and the rest, she would have had to explain why and this would entail having to reveal what the Accused had done to her previously,95Foot Note 95×NE 16/1/18 at p 54.which, she was understandably reluctant to do. It must be noted that V was only 13 years old then. Further, Victoria had accompanied her all the way up the block of flats and V did not think that Victoria would sabotage her. When the Accused then took her alone to a separate floor, after getting off the lift, I accepted that V did not try to run away as she was afraid of him – he was a well-known notorious gang leader96Foot Note 96×NE 16/1/18 at pp 34–35 and 55–56.and he had previously threatened her with a spanner on the 2nd Occasion. Further, when V was then raped on this 3rd Occasion, I accepted that she felt that she had no choice and had resigned herself to such abuse.97Foot Note 97×NE 16/1/18 at pp 55–56.Regardless of her conduct, there was independent evidence from Ng and Tan who had witnessed the Accused having sex with V. 66On the whole, the discrepancies and V’s conduct were insufficient to cast a reasonable doubt on the Prosecution’s case. The Accused’s defence was that there had never been an occasion on which he had gone to a block of flats with V. Victoria, Fu, Ng and Tan wereat idemin stating otherwise. If the Accused were to be believed, V, Victoria, Fu, Ng and Tan must all be lying, which was highly unlikely. The Accused’s bare allegation that all of them had met up before the trial to cook up a consistent story to implicate him98Foot Note 98×NE 23/1/18 at p 68.was preposterous. 67Hence, I found that the Prosecution had proved its case beyond a reasonable doubt in relation to the 6th charge. Findings on the 7th charge 68With regard to the 7th charge, I accepted Ng’s and Tan’s testimonies that, after the Accused had raped V, he threatened Ng and Tan not to inform anyone about the rape that they had witnessed. Here, I noted there were some discrepancies in the evidence of Fu, Ng and Tan. Fu stated that he was present when the Accused made the threat;99Foot Note 99×NE 18/1/18 at p 68.whereas Ng, Tan and Victoria stated that Fu went downstairs with Victoria and did not go up the block of HDB flats again.100Foot Note 100×NE 17/1/18 at p 71; NE 18/1/18 at p 127; NE 23/1/18 at p 22.In light of Ng, Tan and Victoria’s evidence, this left a reasonable doubt as to whether Fu was present when the Accused threatened Ng and Tan, and I found that Fu was most likely mistaken. Additionally, Tan testified that the Accused had pointed a knife at Ng and him, whereas Ng stated that he did not see any weapon.101Foot Note 101×NE 18/1/18 at p 128; NE 23/1/18 at p 13.I accepted Tan’s testimony – overall I found Tan to be more forthcoming and certain when recounting events, unlike Ng who was more hesitant and could not recall many details. I should add, for completeness, that it is not a requirement that Tan and Ng must actually have felt threatened as a matter of fact (Mohammed Litonat [63]). Nevertheless, in this case Tan had stated (and which I believed) that he was afraid when the Accused pointed the knife at him.102Foot Note 102×NE 18/1/18 at p 128. 69All things considered, I found that the 7th charge was made out against the Accused, butvis-à-visTan and Ng only. As such, I amended the 7th charge (see [7] above) and convicted the Accused on the amended charge. In my judgment, the amendment to the 7th charge did not cause the Accused to be prejudiced or misled (seeAng Lilian v PP[2017] 4 SLR 1072 at [26]–[27]), as the facts involved remained the same as those for the original charge. In any event, the Defence’s case was one of complete denial, that the Accused was never there on the 3rd Occasion and could not have committed the offence.",
        "4th Occasion (8th, 9th, 10th and 11th charges)": "70I turn to the 4th Occasion on 25 January 2014. V stated that she and Fu had met the Accused at Yew Tee and the three of them had proceeded to a block of HDB flats in the vicinity. When Fu tried to discourage the Accused from wanting to have sex with V, the Accused punched and kicked him, and took a brick, with which he threatened to smash Fu’s and V’s faces.103Foot Note 103×V’s CS at para 10.V then agreed to have sex with the Accused and, after he raped her, he made Fu and V pose in a compromising position so that he could take photographs of them as leverage. On the other hand, the Accused claimed that when Fu and V arrived at the Yew Tee NTUC Foodfare to meet him, V was “giving [Fu] attitude” whereupon Fu wanted to speak to V alone. Thereafter Fu and V left the Yew Tee NTUC Foodfare, whilst the Accused stayed behind. The Accused stated that he did not accompany Fu and V to any block of flats, and claimed that Fu had taken Photo P20 with a self-timer on his phone and sent the photo to him.104Foot Note 104×NE 23/1/2018 at p 91. 71I accepted Fu and V’s testimonies and rejected the Accused’s version of events. First, it was clear from the evidence that the Accused had intended to meet up with V and had contacted her for that purpose. Indeed, the Accused’s own account of how he came to meet up with Fu and V that day was inherently inconsistent. In evidence-in-chief, he claimed that Fu had a “plan” to “trick” V into becoming his girlfriend, and in that plan, the Accused would “approach [V] to ask her about the rumours of her claiming [to be] Teck Whyedajie”.105Foot Note 105×NE 23/1/18 at pp 49–51.In other words, the 25 January 2014 meeting was Fu’s idea and planned at his initiation. However, in cross-examination, the Accused admitted that he had called V to meet her, and this was regardless of Fu’s purported “plan” – the hand phone messages between the Accused and Fu on that day (“Whatsapp messages”) corroborated this (see [74] below).106Foot Note 106×NE 23/1/18 at pp 76, 88, 91, 113 and 120. 72Moreover, I found that that Accused had intended to meet Valone. Fu had accompanied V only because he found out from her about the Accused’s plan to meet her; the Whatsapp messages showed that Fu had asked for the Accused’s permission to accompany V to meet him.107Foot Note 107×NE 23/1/18 at p 80; Exhibit P24, entry 62.There was no reason for the Accused to meet V at all, since he claimed that she was a “stranger”, he had never contacted her and did not intend to be her friend, he did not hang out with girls, and he disliked V because she was a “slut”.108Foot Note 108×NE 23/1/18 at pp 36, 98 and 108–109.Yet, on this occasion, he had contacted V to meet him. The irresistible inference why the Accused had done so, in the same way that he had previously lured her out (see [60] above), was because he wanted to sexually abuse her again. 73Second, I rejected the Accused’s assertion that he wanted to meet V that day to “scold” her for claiming to be the “big sister” or leader of the Teck Whye gang, of which he was its leader.109Foot Note 109×NE 23/1/18 at pp 81–82.This assertion was never put to V in her cross-examination, and in any event, the Accused’s conduct was inherently inconsistent. He did not carry out his purported intent to scold V, despite the lengthy exchange of Whatsapp messages between Fu and him to plan this meeting with V,110Foot Note 110×See exhibit P24.and despite the Accused subsequently meeting Fu and V at the Yew Tee NTUC Foodfare. Even if the Accused had left Fu and V alone (which I disbelieved), he never saw through his purported intent to scold V when Fu and V returned to the Yew Tee NTUC Foodfare where he was (as he claimed), and not even at any time subsequently.111Foot Note 111×NE 23/1/18 at p 82.The Accused’s explanation, that he did not carry through with his purported intent to scold V that day because Fu had not carried out the plan (ie, to make V his girlfriend), defied logic. 74Third, the Whatsapp messages clearly revealed that the Accused wanted to meet V not with the intent to scold her but to have sex with her. I reproduce the relevant parts of the messages as follows: Fu:  U ask [V] meet you tdy?? … Accused: [V] tell you? … Fu:  Y tdy wan meet [V] for?? … Accused: I want ask her somethings. … Fu:  She scared of u mah Den I say don worry Be my [girlfriend] den I in position to speak up for u lor Accused: You got which position to speak up? … Fu:  U ask her wadeva I wont interupt Accused:I tell you what, whatever I want do to her you cannot interupt… You like [XW] i ok, I see her as your [girlfriend] like me and zona,but [V] is someone I dont put in the eye.. fk buddy is fk buddydont do till overboard. Shirt [translated: street gang] have law, iplay is play when comes to serious make sure know where the line is. … Fu:U gg fk her?[translated: You going fuck her?] Accused:I say clear first, whateveri do to her you cannot interupt. I want ask her things first. And see what she gonna say first … Even if she were to be your [girlfriend] i wont give a fk, as long as she do something stupid im going to catch her simple … Fu:U gg fuck her ltr right?[translated: You going fuck her later right?] Accused:Depends. … Accused:See my mood. Fu:U so many girls alr sia… Tis xmm gimme luh … Pls lah tao eh Accused: Yea la give you la,iwant no one can snatch from me … I let you go woo her, but wheni want means i want so you have to keep quiet [emphasis added] 75The Accused claimed that Fu had used the word “fk” or “fuck”, in the Whatsapp messages to mean “scold” or “beat” and those were theonlymeanings ascribed to that word every time the gang members communicated with each other.112Foot Note 112×NE 23/1/18 at pp 83–85.I disbelieved him and found his explanation inherently inconsistent. First, the Accused claimed that the word “fuck” meant “beat” and that he had intended to meet V to beat or scold her – however, when he was reminded of his earlier evidence that he never touched girls because of gang rules, he changed his position and stated that he only intended to meet V to scold her.113Foot Note 113×NE 23/1/18 at pp 85 and 113.Second, the Accused later admitted thathisownuse of the word “fk” in his message “fk buddy is fk buddy” was used torefer to Vand to mean someone to “fuck and throw” or “have sex with”but get rid of subsequently.114Foot Note 114×NE 23/1/18 at pp 114–116.It did not make sense thatFu’suse of “fk” or “fuck” meant to “scold” whenthe Accusedused the same word (in the same conversation with Fu) to mean “have sex”. In fact, the Accused subsequently admitted that he had used the word “fk” with his gang members to mean “have sex”.115Foot Note 115×NE 23/1/18 at p 116. 76Whilst it was possible that the word “fk” could have been used in more than one sense, I found that the context in the Whatsapp messages was clear.  Fu had asked the Accused twice whether he was going to “fk” V,ie, have sex with her, and the Accused did not deny Fu’s queries. I found that the Whatsapp messages showed that Fu was testing the waters for the Accused’s reaction to Fu pretending to be V’s boyfriend. This was dismissed by the Accused who relayed the following messages to Fu: (a) Fu was in no position to speak up for V; (b) what the Accused intended to do to V, Fu should not get in the way; (c) V was no more than a “fk buddy”; and (d) even if V was Fu’s girlfriend, the Accused “[would not] give a fk”.116Foot Note 116×Exhibit P24 at pp 7–9, s/n 39–71. 77Fourth, I disbelieved the Accused that after meeting Fu and V at the Yew Tee NTUC Foodfare, he left them alone as V was “giving [Fu] attitude”. It was unbelievable that V would give Fu “attitude”, after she had sought Fu’s help to protect her from the Accused and Fu had accompanied her to meet him. Contrary to the Accused’s assertion, I found that he, Fu and V had gone together to a block of HDB flats after they met up. 78Fifth, I find that Photo P20 was taken by the Accused, and not by Fu as the Accused claimed. If the Accused’s claim were true, it made no sense for him to send Photo P20 to Fu when Fu was the one who took the photograph. It also made no sense to send it to Fu shortly after Fu had purportedly sent the photograph (and two other photographs taken on the same occasion) to him on the same day.117Foot Note 117×NE 23/1/18 at p 111.The Accused’s explanation, that he had sent Photo P20 to Fu to “prank” him in the light of his promise to Fu to delete it,118Foot Note 118×NE 23/1/18 at pp 52–53.was unconvincing as the Accused admitted that he could have subsequently deleted it if he wanted to. Pertinently, whilst the forensic examination of the Accused’s hand phone revealed that he hadsentPhoto P20 to Fu’s hand phone, no such photograph of P20 (or the two other photographs of Fu and V together as found in the photo collage) was found in the Whatsappreceiveditems on the Accused’s hand phone.119Foot Note 119×NE 19/1/18 at pp 34–35.This was despite the Accused’s claim that the hand phone he used to send Photo P20 to Fu was the same hand phone and the same hand phone number to which Photo P20 was purportedly sent by Fu to him.120Foot Note 120×NE 23/1/18 at p 55. 79Based on the totality of the evidence, I found that the Accused had intended to lure V out to have sex with her – there was no other reason why he would initiate a meeting with V. I thus accepted V’s evidence that he had raped her, after he had beaten up Fu and threatened both Fu and V with a brick. I also found that Photo P20 (and the two other photographs of Fu and V together,  as found in the photo collage) was taken by the Accused when he forced Fu and V to pose in a compromising position. 80I turn to deal with the matters raised by defence counsel. First, Mr Choh suggested that the photographs in the photo collage showed Fu “smiling” when he was posing with V; Fu disagreed that this was the case. Having examined the photographs, I was not able to come to any such conclusion, as it was unclear what Fu’s facial expression was. In fact, it was even possible to infer, in the photograph that showed Fu walking away from V, that Fu had a look of disgust on his face. In any event, Mr Choh’s assertion that Fu had admitted that he was laughing in the photographs121Foot Note 121×Defence’s closing submissions at para 125.was clearly not borne out by the evidence, as Fu had categorically denied that he was smiling in the photograph.122Foot Note 122×NE 18/1/18 at p 37.Hence, at best, this point was neutral. If Mr Choh’s point was to show that Fu was lying about the Accusedbeing presentwith Fu and V at the block of HDB flats when the photograph was taken (since the Accused’s defence was that he was never there), the supporting evidence showed otherwise. This included the forensic evidence of the Accused’s hand phone and the Whatsapp messages (at [74] – [76] and [78]). I add that it did not make sensefor V to implicate the Accused, rather than Fu, if Fu were the one who had instigated V to pose with him in the indecent manner for the photographs to be taken. 81Second, Mr Choh submitted that it did not make sense for V to agree to meet the Accused that day despite having been purportedly raped by him on three previous occasions. In my judgment, whilst a reasonable response might be to avoid one’s perpetrator completely having been previously abused, V’s actions had to be viewed in the light of her age (she was only 13 years old then) and her history of abuse at home and at the Accused’s hands. It was also not the case that she had readily met the Accused on her own on the 4th Occasion. She had first confided in Fu, who had already known of the Accused’s previous abuse of her. She was assured by Fu that he would accompany her to see the Accused to persuade him to stop abusing her, by Fu pretending to be her boyfriend.123Foot Note 123×NE 16/1/18 at p 61.She went along with Fu as she thought that Fu, the Accused’s right-hand man, would be able to protect her from him.124Foot Note 124×NE 16/1/18 at p 61; NE 17/1/18 at pp 15–16.The Whatsapp messages corroborated Fu’s and V’s accounts of what they had intended to do.125Foot Note 125×Exhibit P24, s/n 39–42.It was also not a case in which V had initiated the meeting, but a case in which the Accused had asked her out when he had no good reason to. 82Third, Mr Choh submitted that the Accused and Fu were still on relatively good terms even after he had sent Photo P20 to Fu,126Foot Note 126×Defence closing submissions at para 120.in that Fu could still swear and confront him about the photograph and was not afraid of him, as evidenced from Fu’s replies to the Accused after he sent Photo P20 to Fu:127Foot Note 127×Exhibit P24 at pp 26–27, s/n 279–284 and 286–287. Fu:  Fuck luh Cb!! Don bastard leh Wtf!!! Accused: Now then reply? Lpl Lol … Fu:  Walan eh U say delete one eh 83Mr Choh thus submitted that this dispelled any notion that the Accused had hit Fu or threatened him with a brick. I found that the above hand phone messages were insufficient to raise a reasonable doubt as to the Prosecution’s case. It was also possible, looking at the messages, that Fu had responded with displeasure after the Accused sent Photo P20. Moreover, the fact that Fu confronted the Accused about breaking his promise to delete Photo P20 did not necessarily imply that the Accused had not previously threatened Fu with a brick or hit him. At best, this point was neutral. The Accused was Fu’s gang leader and he had a fearsome reputation even among his gang members; thus Fu was cautious in his response to the Accused. Mr Choh also submitted that Fu’s claim, that the Accused had promised to delete Photo P20 after he had taken it, made no sense. However, I accepted Fu’s explanation that the Accused had told him that he had intended to use the photograph as leverage against V but not Fu and hence he had reassured Fu that he would delete the photograph.128Foot Note 128×NE 17/1/18 at p 115. 84In conclusion, I found that the Prosecution had proved its case beyond a reasonable doubt in relation to the 8th, 9th, 10th and 11th charges pertaining to the 4th Occasion.",
        "5th Occasion (12th charge)": "85As for the 12th charge, whilst the Accused had claimed trial to it, he had admitted to circulating Photo P19 to Fu, on 19 January 2014. His qualification that he did not take Photo P19 (as he claimed it was taken by Yixin) was not a valid defence to the charge. As such, I found this charge to have been proven beyond a reasonable doubt. Mr Choh had, in any event, not raised any issue pertaining to this charge.",
        "Miscellaneous observations and findings": "86In coming to my findings and conclusion I was cognisant of various matters. First, V continued to frequent Lot 1 and Lot 2, places she knew that the Accused went to, despite having been raped by him. I accepted V’s explanations as to why she continued to do so. These were places where she normally spent time with her friends and she felt secure in their presence.129Foot Note 129×NE 16/1/18 at p 37–38.At the same time, she did not wish to be at home for fear that her father might continue to abuse her.130Foot Note 130×NE 16/1/18 at p 26.Crucially, V did not frequent Lot 1, Lot 2 or anywhere else with the intention of being with the Accused alone and on all the occasions that she met him, their meetings were not at her initiation. For instance, the 3rd Occasion was arranged by others, and V did not expect to see the Accused. The 4th Occasion was initiated by the Accused, and V met him after Fu agreed to accompany her, thinking that Fu would speak up for her to ask the Accused not to bother her anymore. In fact, at the time the Accused called V to meet him on the 4th Occasion, V was reluctant to do so and hence called Fu for help. 87I pause to add that V’s behaviour of continuing to meet the Accused given that she was a victim of his repeated sexual abuse might seem strange. However, as Aedit Abdullah J stated in his oral grounds inPP v Roger Yue Jr(CC 75 of 2017), which I agree with, “while the average adult may be expected to react in a particular way and would have been expected to resist or to report or complain about an assault as soon as possible, a juvenile could not be expected to always react similarly. The thinking process, assumptions and viewpoint of a juvenile victim may lead to a course of action that may appear unreasonable or improbable.” Moreover, different victims react and cope differently with assault and trauma, and a victim may even rationalise his or her own reaction. For instance, even when V had suspected what might happen to her on the 3rd Occasion, she continued to follow the Accused as she felt that she had no choice and felt resigned to the circumstances. 88This ties in to the next point, that V had not made any formal complaint to the police until shortly after the photo collage was circulated in July 2014, despite having been raped on various occasions since end 2013. I accepted that V did not do so for fear of being judged and viewed as “loose”, and did not find her conduct to be out of the ordinary. It is not unusual for victims of sexual abuse not to report such traumatic experience until much later or at all, as it is embarrassing and distressing, and for fear of repercussions and being stigmatised. I reiterate V’s circumstances at the material time: she was only 13 years old and the Accused was much older; she knew that the Accused was a notorious gang leader who resorted to violence (as he himself admitted); and she came from a broken home where she had experienced physical abuse. It was not that V was not traumatised by the incidents – she testified that she coped by cutting herself.131Foot Note 131×NE 16/1/18 at pp 74 and 111–112.Additionally, although V did not make a formal report until July 2014, she had, around end 2013 or early 2014, shared with Fu that the Accused had raped her, and this was corroborated by Fu.132Foot Note 132×NE 16/1/18 at pp 58–59; Fu’s CS at para 6. 89I found V to be candid and honest. She repeatedly stated that she would not have reported any of the incidents had she not felt pressured to do so after the photo collage had been circulated.133Foot Note 133×NE 16/1/18 at pp 69–70.Again, I did not find this unusual. The Accused had deliberately, in the photo collage, added a picture of V’s face prominently, so that she could be easily recognised as the person posing in the compromising position with Fu. The Accused admitted that but for that picture, V would not have been identifiable in the photo collage.134Foot Note 134×NE 23/1/18 at pp 66–67.Had V not been so identified, she would most likely have continued to remain silent about the incidents. As she repeatedly stated in court, she just wanted to be left alone and had no desire to get at the Accused.135Foot Note 135×NE 16/1/18 at pp 73, 86 and 121. 90Turning to the First Report, I noted that V had mentioned only the 4th Occasion without the rape charge. In my judgment, this did not affect V’s overall credibility or veracity. As V explained, it was very sudden and unexpected when she discovered the photo collage on social media. Her friends started querying her on the photo collage and at that time, she was “very stressed” and felt that she had to explain her situation.136Foot Note 136×NE 16/1/18 at pp 70, 71, 89, 94 and 103.When she made the First Report, she was reluctant to reveal all that the Accused had done, especially in the presence of her mother and others who had accompanied her to the police station. Hence, she did not reveal the full extent of what the Accused had done in the First Report, as her main focus then was to report on the cyber-bullying by the Accused and to explain the photo collage. V’s conduct was reasonable and not unusual given the situation that she was in then. Likewise, although there were some discrepancies in the First Report, such as the month of the 4th Occasion (stated as March 2014), these did not affect the overall credibility and veracity of V’s testimony. The First Report was made in a hurry and V did not have time to reflect on the details then; even in court she could only recall that the 4th Occasion happened sometime in early 2014 but not the actual month. 91V subsequently lodged the Second Report after Fu contacted her regarding the circulated photo collage and wanted to have their names cleared.137Foot Note 137×NE 16/1/18 at pp 73, 96 and 98.By then, V had time to think through the matter and decided to report on the rape incidents. I did not find that when Fu accompanied V to make the Second Report, there was any intention between them to fabricate allegations against the Accused. By then, V had made the First Report (without Fu knowing until after it was made) recounting details of the 4th Occasion (albeit omitting the rape incident). In fact, Fu stated that V was hesitant to make the Second Report but he persuaded her to do so as he felt that the contents of the First Report (recounted to him by V) were incomplete.138Foot Note 138×NE 18/1/18 at pp 14 and 82.This supported V’s evidence and was consistent with her conduct that she was all along reluctant to report the Accused to the Police and that she just wanted to be left alone. 92There were two points to note about the Second Report. First, it was brief with no details. However, nothing material turned on this. The recording officer, Sergeant Zarina, confirmed that the report was short because the subject matter was sensitive and further details were subsequently recorded in a room by another officer.139Foot Note 139×NE 19/1/18 at p 15.The second point was that the date and time of the incident as reflected in the Second Report were mere approximations as V could not recall the details. Sgt Zarina confirmed that they had settled on approximations as it was mandatory to input the date and time into the computer system.140Foot Note 140×NE 19/1/18 at pp 13–17. 93I turn to V’s medical reports made in late 2014 and produced by Dr Rajeswari and Dr Pathy. In both reports, V had recounted three occasions of rape by the Accused, namely two occasions at Lot 2 (or referred to as the building near Lot 1) and one occasion at the staircase of a block of HDB flats at Yew Tee. Although V’s accounts to Dr Rajeswari and Dr Pathy were incomplete, for instance V had only mentioned one occasion at Yew Tee instead of two, I found that this did not affect V’s credibility or veracity. Both Dr Rajeswari and Dr Pathy were not investigating the case and it was not their purpose to elicit from V exactly what had happened. Dr Pathy’s role was limited to assessing whether V was fit to testify in court and whether she had any psychiatric or psychological issues that needed to be addressed, and Dr Rajeswari’s role was to conduct a medical examination of V.141Foot Note 141×NE 19/1/18 at p 5.As such, they did not probe V in detail and did not prepare a comprehensive report of what had transpired between V and the Accused.142Foot Note 142×NE 19/1/18 at pp 5–6. 94Finally, Mr Choh suggested that V and Fu had colluded to fabricate the allegations in revenge as the Accused had caused the photo collage to be circulated. An accused must adduce sufficient evidence of motive to raise a reasonable doubt in the Prosecution’s case; only then would the burden of proof shift to the Prosecution to prove that there was no such motive (Goh Han Heng vPP[2003] 4 SLR(R) 374 at [33]). 95I found that the Accused had not adduced sufficient evidence of a motive to raise a reasonable doubt in the Prosecution’s case, and even if such a doubt had been raised, I was satisfied that there was no such motive. If V had wanted to seek revenge against the Accused for circulating the photo collage, this purpose was sufficiently achieved by filing the First Report. If she wanted to go further, she could have fabricated one incident of rape rather than complicate matters for herself by reporting multiple incidents. There was also no evidence to suggest that V and Fu colluded. At the time the First Report was lodged, V had not even discussed the matter with Fu, who did not know that she had lodged the report until after the fact. Indeed, V could have easily explained away the photo collage by blaming Fu (who was the one in the photographs) instead of the Accused. 96Pertinently, there was supporting evidence from Victoria, Ng and Tan on what had transpired. The Accused had not been able to proffer a credible reason why Ng143Foot Note 143×NE 23/1/18 at p 92.and Tan would lie. His claim that Tan lied to get back at him for having Tan beaten up144Foot Note 144×NE 23/1/18 at p 92.was at best a speculation, and in any event it was never put to Tan when he was on the stand. As for Victoria (who was not a complainant or a victim in any of the 12 charges), the Accused could only say that she was “mistaken” about her account of the 3rd Occasion.145Foot Note 145×NE 23/1/18 at p 69.Indeed, the suggestion thatallthe witnesses had come together to fabricate their accounts was clearly preposterous. I also reiterate that the Prosecution’s case was corroborated independently by the Accused’s and Fu’s hand phones and the forensic examination of the Accused’s hand phone which supported the fact that Photos P19 and P20 were taken by him. 97For completeness, I deal briefly with the issue of lack of consent, a crucial element to establish the punishment under s 375(3)(b) of the Penal Code for an offence under s 375(1)(b).PPv Iryan bin Abdul Karim and others[2010] 2 SLR 15 at [123], referring to a commentary fromRatanlal & Dhirajlal’s Law of Crimes: A Commentary on the Indian Penal Code 1860vol 2 (C K Thakker & M C Thakker eds) (Bharat Law House, 26th Ed, 2007) succinctly sets out the approach to be adopted in determining if sexual acts are consensual in nature: A mere act of helpless resignation in the face of inevitable compulsion, quiescence, non-resistance or passive giving in, when volitional faculty is either clouded by fear or vitiated by duress, cannot be deemed to be ‘consent’ as understood in law … Consent implies the exercise of free and untrammelled right to forbid or withhold what is being consented to; it is always a voluntary and conscious acceptance of what is proposed to be done by another and concurred in by the former … 98It was clear that V did not consent to any of the acts of the Accused, and this was not an issue raised by the Accused as his defence was one of bare denial. On the 2nd Occasion, the Accused had threatened V with a spanner and forced her to perform oral sex on him before he raped her and took Photo P19. On the 3rd Occasion, she was resigned to being subjected to the abuses, and on the 4th Occasion, the Accused had pulled her hair and threatened Fu and her with a brick. These circumstances clearly pointed to a lack of consent from V. Concluding observations 99Overall I found V to be a credible and honest witness throughout, who had recounted the incidents consistently. Although I observed that she did not articulate herself well at times, this was not due to a lack of veracity on her part. Rather, she was trying to recount the past that was understandably difficult and traumatic to her, and to move on with her life. 100In contrast, I found the Accused to be an untruthful witness who contradicted himself on material aspects, and there were internal and external inconsistencies in his testimony. He claimed that he had never once met V alone nor had any intent to do so – yet, he had called V to meet on the 4th Occasion. Likewise, he claimed that under gang rules, he could not “touch girls”,146Foot Note 146×NE 23/1/18 at p 58.yet the Whatsapp messages and his own evidence clearly showed otherwise. The Whatsapp messages revealed that he not only intended to “touch” V but to have sex with her. Next, he stated that Photo P19 was sent to him by Yixin and Photo P20 was taken by Fu – the forensic evidence however showed that the Accused took both photographs. He then claimed that his reputation as a very fearful person was just “rumours” and in fact he was “laid back”.147Foot Note 147×NE 23/1/18 at p 51.This contradicted his own testimony that his gang was a well-known notorious gang, they got into fights and were always getting into trouble with the police.148Foot Note 148×NE 23/1/18 at p 43.In fact, he claimed that he was not afraid of the police. He had also had Tan beaten up for raping V. As such, the Accused’s claim that none of his gang members and V were afraid of him149Foot Note 149×NE 23/1/18 at pp 73–74.was clearly unbelievable. As Fu and Ng testified, although they knew what the Accused was doing to V, they did not dare to report to the police as they were afraid of him. 101Finally, I found that the aspersions cast by the Accused on various persons were a futile attempt to discredit the witnesses and distance himself from the offences. He labelled V a “slut” who slept around with various named persons150Foot Note 150×NE 23/1/18 at pp 94 and 99.(but did not call a single one of them to support his claims) and called her a “joke” as she was purportedly an attention-seeker.151Foot Note 151×NE 23/1/18 at p 42.He called his own right-hand man, Fu, a “playboy” and claimed that Fu went out mostly with underage girls.152Foot Note 152×NE 23/1/18 at pp 40–41.Overall, I found his conduct left much to be desired.",
        "Conclusion": "102In conclusion, I was satisfied that the Prosecution had proved its case beyond a reasonable doubt on the charges relating to the 2nd, 3rd, 4th and 5th Occasions and convicted the Accused on the 2nd to 12th charges (including the 7th charge in its amended form). Although I found that a reasonable doubt had been raised in relation to the 1st Occasion, this did not mean that I had to disbelieve V’s evidence in its entirety in relation to all the Occasions, and I did not find V to lack credibility. Even if there were certain gaps in V’s evidence, it did not mean that “there was a ‘systematic and widespread pattern of many inconsistencies coming together’ which ought to destroy her credibility altogether” (seeADF v PP and another appeal[2010] 1 SLR 874 at [23] and [25]). Unlike the 1st Occasion (for which I found it unsafe to convict based on V’s testimony alone), the incidents on the 2nd, 3rd and 4th Occasions were supported by other independent evidence.",
        "Sentencing": "103The following sentences were proposed by the Prosecution and Defence respectively for the 2nd to 12th charges: ChargeOffenceSentence (Prosecution)Sentence (Defence)2nd chargeSexual assault by penetration – s 376(1)(a) p/u s 376(4)(b) Penal Code12 years’ imprisonment and 12 strokes8 years’ imprisonment and 12 strokes3rd chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes12 years’ imprisonment and 12 strokes4th chargeSexual exploitation of a child – s 7(a) Children and Young Persons Act (“CYPA”)12 months’ imprisonment1 month’s imprisonment5th chargeCriminal intimidation – s 506 (1st limb) Penal Code6 months’ imprisonment2 months’ imprisonment6th chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes12 years’ imprisonment and 12 strokes7th chargeCriminal intimidation – s 506 (1st limb) Penal Code3 months’ imprisonment2 months’ imprisonment8th chargeVoluntarily causing hurt – s 323 Penal Code2 months’ imprisonment2 weeks’ imprisonment9th chargeCriminal intimidation – s 506 (1st limb) Penal Code6 months’ imprisonment2 months’ imprisonment10th chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes12 years’ imprisonment and 12 strokes11th chargeSexual exploitation of a child – s 7(a) CYPA8 months’ imprisonment1 month’s imprisonment12th chargeCirculating obscene object to young person – s 293 Penal Code3 months’ imprisonment2 weeks’ imprisonment 104The Prosecution pressed for a global sentence of at least 28 years’ imprisonment and the maximum 24 strokes of the cane, with at least two of the statutory rape charges to run consecutively. It submitted that the key sentencing principles of deterrence and retribution should apply. The Accused’s actions were considered and deliberate as he had lured V out in order to rape her. He had also committed the offences whilst on probation for an offence of rioting with a deadly weapon (under s 148 of the Penal Code). Quite apart from the embarrassment, shame and fear V had experienced, she had also suffered great trauma and irreparable psychological and emotional harm. The Prosecution submitted that there were numerous aggravating factors which warranted the imposition of a lengthy custodial term, but was cognisant that the overall sentence proposed should be calibrated with due regard to the totality principle and should not be crushing. 105The Defence submitted that the totality of the sentence should not be crushing, and that a global sentence of 20 years’ and 3 months’ imprisonment and 24 strokes of the cane (with the 2nd, 6th, 8th, 9th and 12th charges to run consecutively) was sufficient. It submitted that the Accused had no related antecedents and the fact that he claimed trial should not be taken against him.",
        "Statutory rape under s 375(3)(b) Penal Code (3rd, 6th and 10th charges)": "106The Prosecution submitted that the present case fell within Band 2 of the sentencing bands established inNg Kean Meng Terence vPP[2017] 2 SLR 449 (“Terence Ng”) and towards the higher end of Band 2, and submitted for a term of 14 years’ imprisonment for each of the three charges of statutory rape after recalibrating downwards based on the totality principle. The Defence submitted that the statutory rape charges fell within Band 1, as there was only one offence-specific aggravating factor, namely that V was below 14 years old. 107I found that the present case fell within Band 2 of the sentencing bands, and on the higher end of the band.  InTerence Ngat [53], the Court of Appeal stated that cases which contain any of the statutory aggravating factors and prosecuted under s 375(3) of the Penal Code will almost invariably fall within Band 2. In this case, in addition to the fact that V was below 14 years old and did not consent to the acts on the three occasions, there were other various offence-specific factors. First, there was pre-meditation and planning. On the 2nd Occasion, the Accused made sure that V was alone with him at the Lot 2 staircase by asking Fu to look after Zona whilst the Accused carried out his plan. He was also armed with a spanner with which he used to threaten V to ensure that she would comply with his directions. As for the 3rd Occasion, Fu, Tan and Ng had all stated that they were with the Accused when the Accused decided to call V to meet him. Fu stated that the Accused had informed him that he wanted to lure V out for sex and Ng stated that the Accused had asked Fu, Tan and him whether they also wanted to have sex with her. It was clear that the Accused had used Victoria to lure V out to meet him. On the 4th Occasion, the Whatsapp messages revealed that the Accused had planned to meet V on 25 January 2014 to have sex with her; in fact, on this occasion, the Accused had contacted V directly to meet her alone. Second, the Accused had threatened to use, and had used, violence. On the 2nd Occasion, he hit the wall near V’s face with a spanner; on the 4th Occasion, he pulled V’s hair and took a brick and threatened to smash her face if she did not have sex with him. In my view this was use of violence over and above the force necessary to commit the rape. Third, I found that there was deliberate infliction of special trauma on V by further degradation of her. On the 2nd Occasion, the Accused had forced her to fellate him and to remove her clothes to photograph her. On the 4th Occasion, the Accused forced her to pose with Fu in a compromising position and took photographs of them. 108However, I was unable to agree with the Prosecution that there was severe harm caused to V. InTerence Ngat [44(h)], the Court of Appeal acknowledged that every act of rape invariably inflicts immeasurable harm on a victim. However, it is where there are “especially serious physical or mental effects on the victim such as pregnancy, the transmission of a serious disease, or a psychiatric illness” that this is a serious aggravating factor. There should be a relatively severe state of psychological or physical harm for the court to consider it an additional offence-specific aggravating factor.  In this case, there was no evidence that V had contracted a sexually-transmitted disease from the Accused nor had been made pregnant. Although she had resorted to cutting herself, she had been doing so since being abused by her father, and there was no evidence as to the severity of this self-infliction of harm, nor the length of it, that was caused by the Accused’s abuses. 109The court should also have regard to the “offender-specific” factors (Terence Ngat [62]). In this case, I agreed with the Prosecution that the Accused’s conduct at trial demonstrated a lack of remorse on his part. He had disparaged V’s character by referring to her as a “joke” and a “slut” and alleged that she slept with a number of persons. There were also no mitigating factors in his favour. 110Although I agreed with the Prosecution that this case fell within the higher end of Band 2 and warranted a sentence on the higher end of that Band, I imposed a sentence of 14 years’ imprisonment for each of the 3rd, 6th and 10th charges, taking into account the totality principle. I also imposed the mandatory minimum 12 strokes of the cane for each of the charges.",
        "Sexual assault by penetration under s 376(4)(b) Penal Code (2nd charge)": "111The Court of Appeal inPram Nairv PP[2017] 2 SLR 1015 (“Pram Nair”) at [159] has set out three sentencing bands for the offence of sexual penetration of the vagina using a finger. The Prosecution submitted that the present case fell within Band 2 of the sentencing bands inPram Nair(ie, 10 to 15 years’ imprisonment) as there were various offence-specific factors, but that there should be an uplift for acts of forced fellatio given the more intrusive and degrading nature of the act. As such, the Prosecution submitted for a term of 12 years’ imprisonment and 12 strokes of the cane. 112The Defence submitted for a term of 8 years’ imprisonment and 12 strokes of the cane, citingPPv BLV[2017] SGHC 154 (“PP v BLV”), which concerned a series of sexual offences perpetrated against the accused’s daughter when she was between 11 and 13 years old. There, the accused was convicted on 10 charges, including two charges of fellatio and was sentenced to 10 years’ imprisonment and 12 strokes of the cane for each of the fellatio charges. The Defence submitted that the sentence inPP v BLVrepresented the “glass ceiling” which sentences for s 376(1) offences should not exceed. Furthermore, in that case there was the aggravating factor of abuse of trust between a father and child that was absent here. 113InPP v BLVat [146], Aedit Abdullah JC (as he then was) was of the view that whilst a sentence of 15 years’ imprisonment was ordinarily warranted for offences under s 376(4)(b) of the Penal Code, a lower sentence of 10 years was imposed in light of the totality principle. Aedit Abdullah JC also stated at [142] that “the analogy between aggravated sexual assault by penetration and aggravated rape had been drawn by both Parliament and the Courts”. I agreed with the Prosecution that an act of forced fellatio is more intrusive and degrading than sexual penetration of a vagina using a finger. In my view, given the aggravating factors (mentioned earlier in relation to the statutory rape charges), I imposed a term of 11 years’ imprisonment and the mandatory minimum 12 strokes of the cane.",
        "Sexual exploitation of child under s 7(a) CYPA (4th and 11th charges)": "114InAQW vPP[2015] 4 SLR 150 at [13] (“AQW v PP”), Menon CJ stated that the objective of s 7 of the CYPA is the protection of vulnerable minors from sexual exploitation, and that the minor’s vulnerability and the degree to which the accused has exploited the minor constitute the key considerations in sentencing. Generally, six to eight months of imprisonment would be appropriate where: (a) the sexual act that took place between the offender and the minor involved touching of naked genitalia; (b) the minor was 14 years old or above, and did not appear to be particularly vulnerable; (c) the offender did not coerce or pressure the minor into participating in the sexual act; and (d) there was no element of abuse of trust (AQW v PPat [50]). The Prosecution relied on the cases ofAPA vPP(MA 451/2010, unreported) (appeal fromPPv APA[2010] SGDC 544) (“APA v PP”),PPv AZN[2012] SGDC 155 (“PP v AZN”),Sim Wei Liang Benjamin vPP(CCA 25/2015, unreported) (appeal fromPPv Sim Wei Liang Benjamin[2015] SGHC 240) (“Benjamin Sim”) and some other cases, where the offender was charged under s 7(b) of the CYPA for procuring or requesting obscene acts. In those cases the sentence imposed ranged from six to 11 months’ imprisonment. 115The Prosecution submitted a sentence of at least 12 months’ imprisonment for the 4th charge and at least 8 months’ imprisonment for the 11th charge. The difference in the sentences submitted was because Photo P20, the subject of the latter charge, was less obscene in a nature. The Prosecution submitted that the present case was closer toAPAv PPandPP v AZNthanBenjamin Sim, where the victim had willingly provided a nude photograph to the accused. The Defence submitted that no more than one month’s imprisonment should be imposed on each charge in light of the totality principle. 116In the present case, the offencesper sedid not involve the touching of any genitalia or abuse of trust. However, V was below 14 years old at that time and, unlike inAQW v PP(where there was no suggestion of any threat or coercion), what V did (ie, to strip naked for Photo P19 and to pose for Photo P20) had been preceded by threats and use of force. Both offences were also committed immediately after V was raped and was meant to cause V significant humiliation and fear. As such, a sentence higher than the starting point of six months stated inAQW v PPwas warranted, and following from the cases cited by the Prosecution, I imposed a term of 10 months’ imprisonment on the 4th charge and 8 months’ imprisonment on the 11th charge.",
        "Criminal intimidation under s 506 Penal Code (5th, 7th and 9th charges)": "117In submitting for a sentence of at least six months’ imprisonment each for on the 5th and 9th charges and three months’ imprisonment on the 7th charge, the Prosecution relied on the cases ofPPv Low Jin Long(CC 33/2014, unreported) (“Low Jin Long”),Lwee Kwi Ling Mary v Quek Chin Huat[2003] 2 SLR(R) 145,PPv Shaikh Salman Bin Anwar Baladaram[2013] SGDC 424 andPPv Roman[2015] SGMC 8, where sentences of between two to six months’ imprisonment were imposed. The Defence submitted for a sentence of no more than two months’ imprisonmentpercharge and relied onChua Siew Lin vPP[2004] 4 SLR(R) 497 (“Chua Siew Lin”). 118InChua Siew Lin, the accused had placed a knife at the neck of her domestic helper. Yong Pung How CJ recognised that the district judge had found that the accused had threatened the domestic helper in a moment of frustration, the threat was not prolonged and the accused had not seriously intended to carry out the threat. In my judgment, the present case (in particular the 5th and 9th charges) was more akin toLow Jin Long, where the threat to cause injury was with intent to put V in significant fear to compel her to perform various acts subsequent to the intimidation (ie, fellatio, sex, stripping naked and posing for Photos P19 and P20 in the present case). The threats by the Accused were also accompanied by the use of a spanner and a brick respectively. As for the 7th charge, the Accused intended to put fear into Tan and Ng so that they would not report the rape which they had witnessed. Hence I imposed a term of six months’ imprisonment each for the 5th and 9th charges, and a lower term of four months’ imprisonment for the 7th charge as no physical harm was caused to Tan and Ng.",
        "Voluntarily causing hurt under s 323 Penal Code (8th charge)": "119The Prosecution submitted for a term of at least two months’ imprisonment for the 8th charge, given the Accused’s propensity for violence. He had been sentenced to 24 months of split probation in August 2013 for an offence of rioting with a deadly weapon under s 148 of the Penal Code committed on 23 December 2012. Whilst on probation, he committed additional violence-related offences, and these charges were taken into consideration for the purposes of sentencing in the present case. The Defence however submitted for a term of no more than two weeks’ imprisonment given that whatever injuries the Accused had inflicted on Fu were not severe and there were no weapons used. 120InLow Jin Long, the accused pleaded guilty to seven charges, including rape, and consented to have eight charges taken into consideration for sentencing. He had hit the victim on the head with his fist, for which he was sentenced to three months’ imprisonment. In the present case, I accepted that there was no evidence of any serious injuries suffered by Fu and no weapon was used when the Accused attacked Fu. Nevertheless, regard must be had to the Accused’ propensity for violence. The Accused had committed various offences of using criminal force whilst on probation and committed the offence of voluntarily causing hurt even after the 4th Occasion. These formed the charges which he had admitted to, and they were taken into consideration for the purposes of sentencing. As such, I sentenced the Accused to two months’ imprisonment for the 8th charge.",
        "Circulating obscene object to young person under s 293 Penal Code (12th charge)": "121The Prosecution submitted for a term of three months’ imprisonment for the 12th charge. Although this charge only referred to circulation of Photo P20 to Fu, the Accused had also exhibited the photograph to other gang members, and all these surrounding circumstances had to be taken into account. The Prosecution cited the unreported decision ofPPv Zulkiflie bin Rahmat(Magistrate’s Arrest Case No 900759 of 2017 and others) (“Zulkiflie”) in which the accused had pleaded guilty to three counts under s 293 of the Penal Code with 13 similar charges taken into consideration. The court imposed a term of between two to three months’ imprisonment for each of the three charges. On the other hand, the Defence submitted that the present offence was one-off and the Accused had circulated Photo P20 only to Fu. As such, a short term of two weeks’ imprisonment was adequate. In my judgment, a term of one month’s imprisonment was appropriate, given that there was only one occasion here, unlike inZulkiflie.",
        "Conclusion on sentence": "122In conclusion, I imposed the following sentences for the 2nd to 12th charges: ChargeOffenceSentence imposed2nd chargeSexual assault by penetration – s 376(1)(a) p/u s 376(4)(b) Penal Code11 years’ imprisonment and 12 strokes3rd chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes4th chargeSexual exploitation of a child – s 7(a) CYPA10 months’ imprisonment5th chargeCriminal intimidation – s 506 (1st limb) Penal Code6 months’ imprisonment6th chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes7th chargeCriminal intimidation – s 506 (1st limb) Penal Code4 months’ imprisonment8th chargeVoluntarily causing hurt – s 323 Penal Code2 months’ imprisonment9th chargeCriminal intimidation – s 506 (1st limb) Penal Code6 months’ imprisonment10th chargeStatutory rape – s 375(1)(b) p/u s 375(3)(b) Penal Code14 years’ imprisonment and 12 strokes11th chargeSexual exploitation of a child – s 7(a) CYPA8 months’ imprisonment12th chargeCirculating obscene object to young person – s 293 Penal Code1 month’s imprisonment 123I ordered the sentences for the 6th charge and 10th charge to run consecutively. The Accused’s total sentence is thus 28 years’ imprisonment and the maximum 24 strokes of the cane. 124In coming to my decision on the sentences for each individual charge and the global sentence, I took into account the totality principle and that the overall sentence should not be crushing. In addition, I also took into account that there was an overlap of factors pertaining to various charges. I was of the view that a stiff sentence was warranted to reflect the culpability of the Accused and to deter the commission of such offences by the Accused and other would-be offenders.  This was a case in which the offences were planned and pre-meditated. There were clear aggravating factors and no mitigating circumstances.  Audrey LimJudicial Commissioner David Khoo and Sruthi Boppana (Attorney-General’s Chambers) for the Prosecution;Choh Thian Chee Irving and Kor Wan Wen, Melissa (M/s Optimus Chambers LLC) for the accused."
    }
}