{
    "case_title": "Soh Tian Khoon RaymondvPublic Prosecutor",
    "ncitation": "[2019] SGHC 76",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The applicant faced a pending criminal trial whose verdict was adjourned pending the conclusion of this application. The applicant filed this criminal motion for an order that the Prosecution disclose a “delivery list”, and for an order that certain witnesses be recalled pursuant to s 283 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“the CPC”). Having considered parties’ submissions, I dismissed the application in relation to the recalling of the witnesses. I now set out my detailed reasons and some observations.",
        "Facts": "2 The background to the present application was gleaned from the affidavit evidence, notes of evidence of the chambers hearings, and letters sent by the parties. 3 The applicant stood trial in the State Courts before the District Judge for two charges under s 128I(1)(b) of the Customs Act (Cap 70, 2004 Rev Ed) (“the Customs Act charges”) for dealing with duty-unpaid cigarettes. The trial was heard from 27 to 29 March 2018, and on 29 and 30 August 2018. Upon the conclusion of the trial, the District Judge directed parties to file closing and reply submissions by 25 October and 8 November 2018 respectively.",
        "Chambers hearing on 9 November 2018": "4 On 9 November 2018, Mr Nathan Edmund (“Mr Nathan”), the applicant’s counsel, informed the District Judge in chambers that the Prosecution had withheld a material document during the trial, namely, a “delivery list” of customers that had been referred to in the statement of facts which Ng Seng Kiong (“Ng”), the applicant’s co-accused, had admitted to in his own plead-guilty mention on 23 June 2017. Ng had been a prosecution witness in the applicant’s trial and had taken the stand on 27 March 2018. Ng had left the jurisdiction on 4 May 2018 after serving his sentence. 5 In chambers, Mr Nathan explained that the contents of the “delivery list” would demonstrate that the applicant was not the purchaser of the duty-unpaid cigarettes that were the subject of the Customs Act charges. Mr Nathan had instructions to file a criminal motion to apply for disclosure of this evidence. The District Judge granted an adjournment for him to do so.",
        "Chambers hearing on 27 November 2018": "6 On 21 November 2018, Mr Nathan wrote to the State Courts to invite the District Judge to invoke his “inherent discretion” to order the Prosecution to produce the “delivery list”, and to recall Ng for cross-examination. 7 On 27 November 2018, the District Judge saw parties in chambers and stated that Mr Nathan’s letter did not provide reasons to recall Ng as a witness; the court also had no power to compel the Prosecution to disclose the evidence in question. It followed that there would also be no recall of Ng as a witness. The District Judge then stated that it would be procedurally more appropriate for Mr Nathan to file a criminal motion. Mr Nathan agreed to do so. 8 Mr Nathan proceeded to file this criminal motion on 2 January 2019. On 16 January 2019, the District Judge saw parties in chambers and postponed the trial verdict, pending the outcome of the present application.",
        "The parties’ cases": "9 The applicant submitted that the Prosecution should disclose the “delivery list” as it was admissible, credible and relevant. The “delivery list” would corroborate the applicant’s defence in the trial that he was not a purchaser of the duty-unpaid cigarettes. Such disclosure required two witnesses, namely, Ng and Faizal Ahamed, the investigating officer in charge of Ng’s case who drafted the statement of facts that Ng had pleaded guilty to, to be recalled and cross-examined pursuant to s 283 of the CPC.1Foot Note 1×Applicant’s Submissions at pp 6–13. 10 The Prosecution responded that it was not obliged to disclose the “delivery list”. This “delivery list” was not a formal list disclosing names of buyers or orders of duty-unpaid cigarettes; it was constituted by various WeChat messages that wereprima facieinadmissible as hearsay. Even if they were admitted as an exception to hearsay, they were incomplete and hence not credible. Furthermore, the messages were not relevant: they neither undermined the Prosecution’s case nor strengthened the applicant’s case. The Prosecution’s case dealt with the applicant’s role as a coordinator of deliveries of duty-unpaid cigarettes. In comparison, Ng’s role was to perform the deliveries and collect payments. The messages concerned the specifics of these deliveries, and were not relevant to the Prosecution’s case against the applicant. It followed from the above that the court’s discretionary power under s 283 of the CPC should also not be exercised to recall Ng and Faizal Ahamed.2Foot Note 2×Respondent’s Submissions at paras 14–42.",
        "My decision": "11 As a preliminary matter, I was persuaded that this court had jurisdiction to consider the present application, notwithstanding that proceedings against the applicant were ongoing in the State Courts. It appeared there was at least a determination by the first instance court in relation to which this court could exercise its jurisdiction. On the record, the learned District Judge had decided on 27 November 2018 not to compel the Prosecution to disclose the “delivery list” and not to recall Ng as a witness. The situation would be otherwise had the District Judge declined to make a decision in the proceedings below. 12 It was not necessary at this point to determine whether the criminal motion represented an attempt to invoke the court’srevisionaryorsupervisoryjurisdiction. Parties did not make full arguments on this issue and the Prosecution did not raise any jurisdictional objections in the proceedings. I would note only that the High Court’s revisionary jurisdiction is sparingly exercised and not easily invoked; there must be some serious injustice and something palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below:NgChye Huey v Public Prosecutor[2007] 2 SLR(R) 106 (“NgChye Huey”) at [73]–[75];AngPoh Chuan v Public Prosecutor[1995] 3 SLR(R) 929 at [13] and [17]. 13 That being said, I would strongly discourage criminal motions from being filed when there are pending matters at first instance unless very strong countervailing reasons are present. In the event an issue of this nature arises in the future, it would generally be best for matters to be determined by the first instance court. Any evidential shortcomings should generally be addressed as part of the appeal process instead; if the need for additional evidence is then made out, the appellate court can be persuaded to remit the matter to the trial court or to allow the calling of new evidence on appeal, as the case may be. In this regard, I echo the concerns raised by the Court of Appeal inNgChye Hueyat [68]–[74]. 14 In the present circumstances, I did not fault Mr Nathan for filing the present application on behalf of the applicant, given what he understood as having transpired, namely, that the District Judge had in fact declined to make a decision as to whether the Prosecution should disclose the “delivery list”. Moreover, I bore in mind that as the applicant had been remanded for a substantial period of time, the matter should proceed as expeditiously as possible. If I declined to determine the application for recall, that would add to further delay. 15 It remained for me to determine the substantive application prayed for. I understood the applicant to rely on the contents of the “delivery list” to prove that he was not the purchaser of the duty-unpaid cigarettes that were the subject of the Customs Act charges against him. The Prosecution did not dispute this; its case against the applicant was concerned with his role in coordinating the delivery of the cigarettes. The parties agreed to convey their respective positions to the trial court, which settled the issue of disclosure between them. 16 Accordingly, I was not persuaded that there was any reason in the present case for an order for the recall of the witnesses to be made. The order sought for the recall of the witnesses should not be granted. 17 Finally, I make the observation that determinations by the court in matters in a criminal trial should be made in open court: this accords with the spirit and intent of the CPC. While it is entirely in order for a judge to see parties in chambers to work out administrative or logistical matters, such as for pre-trial conferences, arguments and any pronouncements or decisions should be made in open court in the presence of the accused person.",
        "Conclusion": "18 The criminal motion was dismissed as regards the recall of the witnesses. I left it to the parties to proceed with the trial and for the Prosecution to convey its position to the trial court that it was undisputed between the parties that the applicant was not the purchaser of the duty-unpaid cigarettes in question. Aedit AbdullahJudge Nathan Edmund (Tan & Pillai) for the applicant;Grace Goh Chioa Wei and Christopher Ong (Attorney-General’s Chambers) for the respondent."
    }
}