{
    "case_title": "UTQ vUTR",
    "ncitation": "[2019] SGHCF 13",
    "coram": "Tan Puay Boon JC",
    "sections": {
        "Introduction": "1 The plaintiff (“Wife”) and the defendant (“Husband”) (collectively “Parties”) were married in November 1985. They have three sons (“the Children”) who are all about 30 years old. Two of them are twins. The Wife, who is 59 years old this year, has been working throughout the marriage and is currently a research assistant. She earns approximately $5,697.20 per month. The Husband, who is 57 years old this year, has also been working throughout the marriage and is currently holding a senior position in a telecommunications company. He earns approximately $20,179.75 per month.1Foot Note 1×Joint Summary of Relevant Information (Amendment No 3) (“JSRI-3”) at pp 1-2. 2 The Parties last lived together in their matrimonial home, a HDB flat in Bishan (“Bishan Property”) that they own. They also own a condominium unit near Farrer Park (“Farrer Park Property”) that was purchased in 2005, and another condominium unit in Pasir Panjang (“Pasir Panjang Property”) that was purchased in 2010. In January 2015, the Husband moved out to live in the Pasir Panjang Property.2Foot Note 2×Wife’s written submissions dated 13 July 2018 (“WWS 13 July 2018”) at para 66(i).The Wife filed a writ of divorce in May 2016 and interim judgment was granted on 4 October 2016 on the ground that the Husband had behaved in such a way that she could not reasonably be expected to live with him, ending a marriage that lasted some 31 years. The ancillary matters were adjourned to chambers.",
        "Issues": "3 The contested ancillary matters to be decided are the division of the matrimonial assets, the maintenance for the Wife and costs.",
        "Division of matrimonial assets": "25 Parties have agreed that the structured approach inANJ v ANK[2015] 4 SLR 1043 (“ANJ v ANK”) applies to the division of matrimonial assets.16Foot Note 16×WWS 13 July 2018 at paras 48-78; HS 24 July 2018 at paras 20-104.This structured approach was succinctly summarised inTIT v TIUand another appeal[2016] 3 SLR 1137 at [21] as follows: (a) express as a ratio the parties’ direct contributions relative to each other, having regard to the amount of financial contribution each party made towards the acquisition or improvement of the matrimonial assets [(“Step 1”)]; (b) express as a second ratio the parties’ indirect contributions relative to each other, having regard to both financial and nonfinancial contributions [(“Step 2”)]; and (c) derive the parties’ overall contributions relative to each other by taking an average of the two ratios above (the derived ratio shall be referred to as “the average ratio”), keeping in mind that, depending on the circumstances of each case, the direct and indirect contributions may not be accorded equal weight, and one of the two ratios may be accorded more significance than the other. Adjustments could also be made in respect of other relevant factors under s 112 or s 114(1) of the [WC] [(“Step 3”)]. 26 I will apply this structured approach in the present case. Step 1: Direct contributions 27 The Husband submitted that the operative date for ascertaining direct contributions should be on 4 October 2016, the date of the interim judgment. He argued that his contributions after parties separated (amounting to over $333,372) towards the Bishan Property and the Pasir Panjang Property should be reimbursed to him.17Foot Note 17×HRS at para 19.The Husband highlighted that the Wife had taken the position in her second affidavit of assets and means that the cut-off date should be the time of the issuance of the interim judgment. The Wife submitted that payments made to the matrimonial properties between the interim judgment and the ancillary matter hearing date should be included as the Parties’ direct contributions.18Foot Note 18×WWS 5 September 2018 at paras 16-19.In support of her submission, the Wife relied onARL v ARM[2015] SGHC 61, where the High Court held at [41] that: … In order to arrive at a just and equitable division in the present case, it is appropriate to take into account the Defendant’s direct financial contribution of $55,890 … made up to the point of the hearing. This approach is also consistent with the wording of s112(2) of the WC … Nothing in s 112 of the WC dictates that only contributions up to the date of the grant of interim judgment can be taken into account … 28 I accept the Wife’s submission despite the position taken by her earlier. The court can deviate from the general position that the cut-off date for direct contributions is the hearing date of the ancillary matters if it is necessary to achieve a just and equitable division. However, I am not satisfied that the Husband’s contribution of approximately $333,372 towards the two matrimonial properties, which were for payments of mortgages and expenses connected with these properties, justifies a deviation from this general position. I therefore adopt the date of the hearing of the ancillary matters as the cut-off date. 29 The Husband had submitted that the $300,000 contributed towards the Pasir Panjang Property by his mother was a loan and is hence not part of his direct financial contributions.19Foot Note 19×HRS at paras 2-3.I have dealt with this at [17] above, and found that the $300,000 was a gift to the Husband that is taken to be his direct financial contribution towards the Pasir Panjang Property. Even if the $300,000 is a loan to the Husband, it is still to be taken to be his direct financial contribution. As a loan, he will have to return it to his mother from his share of the matrimonial assets after division. 30 Likewise, the $35,000 from the Children to the Wife is taken to be her direct financial contribution towards the Pasir Panjang Property (see [19] above). However, since it is a loan to her, the Wife will have to return the amount to the Children from her share of the matrimonial assets after division. 31 Parties have agreed that if the cut-off date of August 2018 is used, their direct financial contributions will be the figures set out at JSRI-3 at pages 3 and 4.20Foot Note 20×NE dated 8 October 2018 at pp 3-4.In summary, I set out my findings of the Parties’ direct contributions in the table below: AssetHusband’s Direct Contributions ($)Wife’s Direct Contributions ($)Joint AssetsBishan Property370,013.42322,989.95Farrer Park Property360,588.28180,550.00Pasir Panjang Property810,003.98145,200.00DBS Savings Account No ending with 87863,634.723,634.72DBS Fixed Deposit Account No ending with 83015,490.105,490.10UOB Current Account No ending with 25203,952.923,952.92Wife’s AssetsPOSB Passbook Savings Account No ending with 733909,019.78POSB MySavings Account No ending with 238603,353.88Maybank Savings Account No ending with 57040112,603.41Prudential Insurance Policy No ending with 3711022,413.19Bayswater Fiduciary Services Investment013,200.00Central Depository Account041,822.41Central Provident Fund Account0264,021.11Hatten (Harbour City Resort)016,152.93AVIVA MyWhole LifePlan Policy No ending with 634904,834.50Husband’s AssetsPOSB Account No ending with 71767,130.090POSB Account No ending with 595012,493.380DBS Multiplier Account No ending with 09303,114.660UOB Investments Account No ending with 78537,883.000Central Depository Account8,661.100Central Provident Fund Account383,202.930Standard Chartered Mortgage One Current Account No ending with 711373,115.660Standard Chartered Bonus Saver Account No ending with 86776,166.080UOB CashPlus Statement Account No ending with 19805,740.940Citibank Maxisave Account No ending with 2007 and Unfixed Time Deposits No ending with 061230,092.520NatWest Account4,132.770Fidelity Investments Account397,910.360Car (sold 31 July 2017)65,630.000AXA Inspire Policy No ending with 459219,244.730PruLink Capital Account8,932.800UOB SRS Fixed Deposit Account83,721.200Total2,670,855.641,149,238.90Percentage (%)69.930.1 32 The ratio of direct contributions between the Wife and the Husband is therefore 70.0:30.0 (rounded off). Step 2: Indirect contributions 33 The Wife submitted that the ratio of indirect contributions ought to be 85:15 between her and the Husband.21Foot Note 21×WWS dated 13 July 2018 at para 70.Broadly, she asserts that she was the primary caregiver to the Children and the household for over 30 years and handled the logistics and management in relation to the Farrer Park and Pasir Panjang properties.22Foot Note 22×WWS 13 July 2018 at para 62.She pointed out that since the Husband moved out of the Bishan Property into the Pasir Panjang Property in January 2015, he had washed his hands of the family affairs.23Foot Note 23×WWS 13 July 2018 at para 66.She also argued that even though Parties employed domestic helpers for 19 years from the time the two younger children were six months old, she had trained and supervised the domestic helpers, and did not abdicate her responsibility in running the household or doing some of the chores herself.24Foot Note 24×WWS 13 July 2018 at paras 63-65.In support of her submission, she relied on the Court of Appeal’s decision inPang Rosaline v Chan KongChin[2009] 4 SLR(R) 935 at [20] that: … The Wife, in other words, took on a managerial role in ensuring the smooth running of the household (with all the accompanying logistical requirements). This role is at least as essential and important as the direct performance of the chores itself. Further, it is clear, in our view, that the Wife also, when required, personally looked after the needs of the two children. Considering that she managed to do all these while holding down a regular full-time job, the wife should be accorded the credit that is due to her. 34 The Wife further highlighted that in 1995, ten years into the Parties’ marriage, the Husband spent a year abroad to pursue his master’s degree, and the Wife single-handedly cared for the Children and the household with domestic help when they remained in Singapore.25Foot Note 25×WWS 13 July 2018 at paras 66-68.She argued that this is a substantial indirect contribution and relied on the decision of the High Court inUAP v UAQ[2018] 3 SLR 319 at [80] that: … [T]he Wife’s indirect non-financial contributions were significant. The Wife had made serious sacrifices in order to support the Husband in his overseas attachments and night classes to obtain his post-graduate degree, and to take care of the son… The Husband’s focus was on his career … 35 In contrast, the Husband submitted that the ratio of indirect contributions ought to be 50:50 between him and the Wife.26Foot Note 26×HS 24 July 2018 at para 105.He argued that the Wife worked full-time throughout the marriage and had full-time domestic help. The Husband also submitted that he bore the lion’s share of the household expenses, paid for the Children’s expensive tuition classes, helped with the household chores and organised family gatherings and children’s parties. The Husband concluded his submission by asserting that while Parties played differing roles throughout the marriage, their commitment was equal.27Foot Note 27×HS 24 July 2018 at paras 65-69.He had also continued paying the mortgages of the Farrer Park and Pasir Panjang properties which allow them to be available for division between Parties. 36 Even in households where both parties are working full-time, absent concrete evidence to the contrary, the wife will ordinarily be the party who renders greater indirect contributions (ANJ v ANKat [24]). This is a dual-income marriage that lasted 31 years and, even though the Wife had the assistance of a domestic helper, the Husband did not allege that the Wife delegated all the household responsibilities to the domestic helper. Nevertheless, the engagement of a domestic helper did reduce the burden of the Parties’ homemaking and caregiving responsibilities (ANJ v ANKat [27]). This will be taken into account when assessing the Parties’ indirect contributions. 37 Furthermore, it was undisputed that when the Husband pursued his master’s degree abroad in 1995, the Wife had to single-handedly manage both her full-time job and the care of the Children. This is a significant indirect contribution of the Wife. Moreover, I note that two of the Children are twins. This means that caring for them would have demanded more from the Wife from the time they were born as compared to caring for single birth children. 38 Parties also did not dispute that it was the Husband who contributed to the majority of the household expenses.28Foot Note 28×WWS 13 July 2018 at para 66(a).Furthermore, the Husband made efforts to take the family out for holidays, and planned gatherings and parties for the family.29Foot Note 29×Husband’s Affidavit of Assets and Means dated 15 December 2016 at p 8.These are the Husband’s indirect contributions that have to be credited to him. However, he also had a number of extra-marital liaisons,30Foot Note 30×WWS dated 13 July 2018 at para 66.and these would have affected the amount of time that he could otherwise devote to his family. 39 Assessing the evidence, I find that the ratio proposed by the Wife to be overly generous, and I am of the view that an indirect contribution ratio of 70.0:30.0 between the Wife and the Husband would be just and equitable. I am guided by the following dual-income long marriage cases: (a) InTPY v TPZ and another appeal[2017] SGHCF 2 (“TPY v TPZ”), the parties were married for about 13 years, worked full-time and relied on a domestic helper substantially for homemaking and caregiving. The wife was the main supervisor of the domestic helper. The court found the ratio of indirect contributions to be 60:40 in favour of the wife.(b) InUTJ v UTK[2019] SGHCF 6 (“UTJ v UTK”), the parties were married for 41 years, worked full-time and relied on a domestic helper who was supervised by the wife. The wife retired in 2004, and parties divorced on May 2015. The Husband contributed to the bulk of the family expenses. The court found the ratio of indirect contributions to be 60:40 in favour of the wife.(c) InUNE v UNF[2018] SGHCF 12 (“UNE v UNF”), the parties were married for 29 years, have two adult children and worked full-time. The wife worked full-time for around 19 years of the marriage before assuming the role of a homemaker for the final 10 years. The wife was the main caregiver. The court found the ratio of indirect contributions to be 75:25 in favour of the wife. 40 The ratio of 70.0:30.0 is in line with the cases above. I have awarded the Wife a higher indirect contribution ratio of 70% as compared to the 60% found in bothTPY v TPZandUTJ v UTKbecause the Wife made a more significant indirect contribution by single-handedly caring for the Children (including the twins) while the Husband pursued his master’s degree abroad in 1995. InUNE v UNF, the court awarded an indirect contribution ratio of 75% to the wife because she took unpaid leave and relocated with the husband to Canada for a year for his employment, and also assumed the role of a homemaker for the last ten years of their marriage (UNE v UNFat [75] and [79]). Since the Wife in the present case has continued working full-time throughout, it would be inappropriate to adopt the higher ratio used inUNE v UNF. Step 3: Average ratio 41 Based on the circumstances of the case, the average ratio of contributions may be adjusted by giving different weights to direct and indirect contributions (ANJ v ANKat [27]). Factors affecting the weightage include the length of the marriage, the size of the matrimonial assets and its constituents, and the extent and nature of the indirect contributions. 42 The Wife submitted that in the light of the fact that Parties were married for 31 years with three adult children, and that she had supported the Husband while he was pursuing his master’s degree abroad, the court should give more weight towards the Parties’ indirect contributions.31Foot Note 31×WWS 13 July 2018 at paras 72-78.The Husband’s position was that given the Parties’ long marriage, both the direct and indirect contributions should be given equal weight.32Foot Note 32×HS 24 July 2018 at para 103. 43 The court can calibrate the average ratio in favour of one party if it is just and equitable to do so (ANJ v ANKat [26]). In long marriages, indirect contributions tend to feature more prominently, especially where there are children of the marriage (ANJ v ANKat [27]). I accept the Wife’s submission that in a long marriage of 31 years with three adult children, the indirect contributions made by the Parties would have been more pronounced. As stated by the High Court inUBM v UBN[2017] 4 SLR 921 at [30]: [I]n a very long marriage where extensive marital co-operation, mutual emotional support and joint parenting have been carried out, an adjustment to the final ratio ought to be made to reflect this circumstance … In the case of long marriages, such assistance and support is very substantial and is immensurable. 44 In the present case, however, the Wife’s significant indirect contributions have already been duly recognised by having a higher percentage given to it. The Husband has also been paying for the mortgages of the Farrer Park and Pasir Panjang properties since the Parties’ separation, which helped to retain them in the pool of matrimonial assets for division. I therefore find it just and equitable to accord equal weight to the Parties’ direct and indirect contributions. 45 In the result, from the ratios of the direct and indirect contributions, I arrive at the overall average ratio of 50.0:50.0 between the Husband and the Wife based on the computations in the table below: Husband (%)Wife (%)Direct Contributions70.030.0Indirect Contributions30.070.0Average ratio50.050.0 46 Based on the total value of the pool of matrimonial assets being $3,875,157.78 (see [24] above), both the Husband and the Wife’s 50% share of the matrimonial assets is $1,937,578.89 each.",
        "The legal principles": "55 The court has the power to order the Husband to pay maintenance to the Wife pursuant to s 113 of the WC, after taking into account the non-exhaustive factors listed under s 114 of the WC. The purpose of an order for maintenance is to place the Wife in the financial position which she would have been had the marriage not broken down (s 114(2) of the WC). This is noted by the Court of Appeal inFoo Ah Yan v Chiam Heng Chow[2012] 2 SLR 506 at [13]: … The overarching principle embodied in s 114(2) of the Act is that of financial preservation, which requires the wife to be maintained at a standard, which is, to a reasonable extent, commensurate with the standard of living she had enjoyed during the marriage … 56 Further, maintenance plays only a supplementary role to an order for division of matrimonial assets, and the court will take into account the Wife’s share of the matrimonial assets upon division before deriving at an appropriate maintenance sum:BG v BF[2007] 3 SLR(R) 233 at [75]; andATE v ATDand another appeal[2016] SGCA 2 at [33].",
        "Identification and Assessment of the matrimonial assets": "6 The starting position for the identification of matrimonial assets is the date that the interim judgment is granted,ie, on 4 October 2016 (ARY v ARXand another appeal[2016] 2 SLR 686 at [31]), and the valuation of matrimonial assets is the date of the ancillary matters hearing,ie, on 8 October 2018 (TND v TNC and another appeal[2017] SGCA 34 (“TND v TNC”) at [19] - [20]). 7 After various updates, the Parties have provided a Joint Summary of Relevant Information (Amendment No 3) dated 10 October 2018 (“JSRI-3”) which sets out all the assets which the Parties individually or jointly owned, and reflects their latest positions on the division of matrimonial assets. 8 Parties initially disagreed on whether the Children’s joint accounts that they held with the Wife, and the Husband’s inheritance monies (including the alleged dissipation of them) amounting to $525,264.02, should be included as part of their matrimonial assets.5Foot Note 5×WWS 13 July 2018 at paras 17-34 and 39-41; HS 24 July 2018 at paras 42-94.At the hearings on 10 September 2018 and 8 October 2018, Parties confirmed that they have agreed that those Children’s joint accounts with the Wife and the Husband’s inheritance monies will not form part of the pool of matrimonial assets. 9 Parties had therefore agreed what the matrimonial assets were. While the valuations of most of these assets were also agreed, a number of them were disputed. I will deal with these shortly. Agreed Assets 10 I set out first the matrimonial assets with agreed values in the table below: S/NoDescriptionAgreed value ($)Joint Assets1.DBS Savings Account No ending with 87867,269.442.DBS Fixed Deposit Account No ending with 830110,980.203.UOB Current Account No ending with 25207,905.84Sub-total (A)26,155.48Wife’s Assets4.POSB Passbook Savings Account No ending with 73399,019.785.POSB MySavings Account No ending with 23863,353.886.Maybank Savings Account No ending with 5704112,603.417.Prudential Insurance Policy No ending with 371122,413.198.Bayswater Fiduciary Services Investment13,200.009.Central Depository Account41,882.4110.Central Provident Fund Account264,021.1111.Hatten (Harbour City Resort)16,152.9312.AVIVA MyWhole LifePlan Policy No ending with 63494,834.50Sub-total (B)487,481.21Husband’s Assets13.POSB Account No ending with 71767,130.0914.POSB Account No ending with 595012,493.3815.DBS Multiplier Account No ending with 09303,114.6616.UOB Investments Account No ending with 78537,883.0017.Central Depository Account8,661.1018.Central Provident Fund Account383,202.9319.Standard Chartered Mortgage One Current Account No ending with 711373,115.6620.Standard Chartered Bonus Saver Account No ending with 86776,166.0821.UOB CashPlus Statement Account No ending with 19805,740.9422.Citibank Maxisave Account No ending with 2007 and Unfixed Time Deposits No ending with 061230,092.5223.NatWest Account4,132.7723.Fidelity Investments Account397,910.3624.Car (sold 31 July 2017)65,630.0025.AXA Inspire Policy No ending with 459219,244.7326.PruLink Capital Account8,932.80Sub-total (C)1,033,451.02Total [(A) + (B) + (C)]1,547,087.71 Assets with disputed values 11 The matrimonial assets with disputed values are the Bishan Property, the Farrer Park Property, the Pasir Panjang Property, and the balance in the Husband’s UOB SRS Fixed Deposit Account. I will deal with these in turn. (1) Bishan Property 12 The Parties have different net valuations of the Bishan Property because they valued it at different dates. The Wife valued it as at August 2018 while the Husband valued it as at January 2018.6Foot Note 6×JSRI-3 at p 4.The Wife’s net valuation was derived from deducting pending liabilities from a gross valuation of $898,000 as at 31 August 2018 while the Husband’s net valuation was derived from deducting pending liabilities from an agreed gross valuation of $906,000 as at 24 January 2018. 13 Instead of the Husband’s net valuation of $799,143.00, I will adopt the Wife’s net valuation of $822,689.48, being the value closest to the date of the ancillary matters hearing (Yeo Chong Lin v Tay Ang Choo Nancyand another appeal[2011] 2 SLR 1157 at [39]). Although this is not a hard and fast rule, neither the facts nor the Husband’s submissions suggest that it was more appropriate to adopt the January 2018 figure: see, for example,TND v TNCat [22]–[23]. (2) Farrer Park Property 14 The Farrer Park Property was purchased in 2005 for approximately $625,000. The Parties’ different net valuations of this property were due to the same reasons as that for the Bishan Property.7Foot Note 7×JSRI-3 at p 4.For the same reasons in deciding the net valuation of the Bishan Property, I will adopt the Wife’s net valuation of the Farrer Park Property of $806,936.34 instead of the Husband’s net valuation of $686,470.62. (3) Pasir Panjang Property 15 The Pasir Panjang Property was purchased in 2010 for $2,382,330. The Wife’s net valuation was $614,723.05 also as at August 2018 while the Husband’s net valuation of $48,393.00 was again as at January 2018.8Foot Note 8×JSRI-3 at p 4. 16 The Husband’s net valuation of $48,393.00 was arrived at by deducting from the agreed gross valuation of $2,110,000 as at 24 January 2018 the liabilities of the property, which also included a sum of $300,000 contributed by his mother, and $32,000 (later agreed by Parties to be $35,000) contributed by the Children towards the purchase price of the Pasir Panjang Property.9Foot Note 9×HS 24 July 2018 at paras 23-24.The Husband submitted that these were loans that have to be deducted from the gross valuation of the Pasir Panjang Property. Otherwise, the value of the property would be inflated, and he had to reimburse his mother the $300,000 from his share of the matrimonial assets, leaving him a substantially lower amount.10Foot Note 10×Husband’s Reply Submissions dated 7 September 2018 (“HRS”) at paras 2-4.The Wife’s position was that the $300,000 from the Husband’s mother was not a loan, but a gift to the Husband that should be treated as the Husband’s direct contribution and forms part of the matrimonial asset pool.11Foot Note 11×WWS 13 July 2018 at para 59.She agreed that the $35,000 contributed by the Children was a loan from the Children to her.12Foot Note 12×Notes of Evidence (“NE”) of 10 September 2018 at p 5. The $300,000 contributed by the Husband’s mother 17 I will first deal with the $300,000 contributed by the Husband’s mother. A presumption of resulting trust arose in favour of the Husband’s mother since equity presumes that when one party makes a voluntary payment towards a property, he or she did not intend to benefit the other through a gift (Shi Fang v Koh Pee Huat[1996] 1 SLR(R) 906 at [11]). This presumption of resulting trust, however, is displaced by a presumption of advancement that operates within a parent-child relationship by presuming that when the Husband’s mother contributed $300,000 towards the purchase of the Pasir Panjang Property, it was intended to be a gift to her son, the Husband (Lau Siew Kim v Yeo Guan Chye Terence and another[2008] 2 SLR(R) 108 at [56] – [59], [67] and [77]). To rebut this presumption of advancement, the Husband must produce evidence that the $300,000 from his mother was not intended to be a gift, but a loan. This he has not done. The Husband failed to produce any documentary evidence evidencing a loan, whether to him or to Parties jointly, nor was there any affidavit from the Husband’s mother that could have supported his claim. Further, there was no attempt by the Husband’s mother to claim any beneficial interest in the Pasir Panjang Property. For the reasons above, I am satisfied that the $300,000 contributed by the Husband’s mother is a gift to the Husband. It is therefore to be taken as the Husband’s direct contribution towards the Pasir Panjang Property. 18 For completeness, I note that there is a presumption that a parent’s contribution towards the purchase of his or her child’s matrimonial home is presumed to be a gift for the benefit of both the husband and wife (Ang Teng Siong v Lee Su Min[2000] 1 SLR(R) 908 at [28]). This presumption, however, is not applicable to this case as the Pasir Panjang Property is not a matrimonial home, but an investment property: see for example,Beh Chin Joo and another v Chu Kar Hwa Leonard[2018] SGHC 17 at [99]. The $35,000 contributed by the children 19 Parties have agreed that the $35,000 contributed by the Children is a loan from the Children to the Wife. Unlike bank loans, this is a liability that is borne by the Wife alone. It should therefore not be deducted from the gross value of the Pasir Panjang Property when determining the net value of the property. Similar to the treatment of the $300,000 gift from the Husband’s mother to him as his direct contribution, the $35,000 loan from the Children to the Wife is also to be taken as her direct contribution towards the Pasir Panjang Property. (4) UOB SRS Fixed Deposit Account 20 The Parties’ difference in valuation of the Husband’s UOB SRS Fixed Deposit Account arose from the fact that the Husband used the amount as at 30 November 2016, while the Wife used the amount as at 31 December 2016.13Foot Note 13×JSRI-3 at p 7.I will adopt the Wife’s valuation since it is the value closest to the date of the ancillary matters hearing on 8 October 2018. 21 In summary, I set out in the table below Parties’ valuations of the assets with disputed values, and my valuations for these properties, after liabilities have been deducted: AssetHusband’s Valuation ($)Wife’s Valuation ($)Court’s Valuation ($)Joint AssetsBishan Property799,143.00822,689.48822,689.48Farrer Park Property686,470.62806,936.34806,936.34Pasir Panjang Property48,393.00614,723.05614,723.05Husband’s AssetUOB SRS Fixed Deposit Account45,791.3683,721.2083,721.20Total2,328,070.07 22 I should point out that the Wife had used the “x value” provided by the website “www.srx.com” of the Singapore Real Estate Exchange to obtain the gross valuations of the Bishan, Farrer Park and Pasir Panjang properties as at August 2018. These are computer-generated estimates of the value based on certain methodologies, and she had adopted the highest values obtained.14Foot Note 14×W’s written submissions dated 5 September 2018 (“WWS 5 September 2018”) at Tab D.The Wife proposed that a joint valuer be appointed for all three properties if Parties could not agree on the valuations.15Foot Note 15×NE dated 8 October 2018 at p 3. 23 While I have accepted the net valuations of the three properties based on the gross valuations provided by the Wife, I recognise that a more conventional valuation method may yield different gross valuations. I will revisit this when I deal with the apportionment of the matrimonial assets below. Total value of pool of matrimonial assets 24 Subject to any revaluation of the Bishan, Farrer Park and Pasir Panjang properties, the total value of the pool of matrimonial assets is set out in the table below: Class of AssetsValue ($)ReferenceAssets with agreed values1,547,087.71[10] above.Assets with disputed values2,328,070.07[21] above.Total3,875,157.78-",
        "Apportionment of the matrimonial assets": "47 The Wife submitted that since she is staying in the Bishan Property with the Children, the Bishan Property should be transferred to her with no consideration.33Foot Note 33×WWS 13 July 2018 at para 87.The Wife further submitted that the Farrer Park Property should be transferred to her and the Husband is to pay to her the balance share of her entitlement to the matrimonial assets (if any).34Foot Note 34×Wife’s Revised Table on Division of Assets (Amended) dated 10 October 2018 at p 6.The Husband agreed that the Wife should be awarded the Bishan Property, but submitted that he should get to keep the Farrer Park and Pasir Panjang properties.35Foot Note 35×HS 24 July 2018 at para 105(a).He later submitted that he should retain the Farrer Park Property while the Pasir Panjang Property be sold and the losses divided between Parties.36Foot Note 36×NE dated 10 September 2018 at p 3. 48 Having the Parties retain the respective properties that they are staying in and the assets in their sole names is a sensible way to divide the matrimonial assets. Since the Husband has agreed that the Wife should retain the Bishan Property, I order that the Husband is to take steps to transfer it to her within three months of this judgment. 49 To minimise the transaction costs necessitated by any transfer ordered, I further order that the Wife is to retain the assets in her sole name. 50 Accordingly, the Wife is to retain the following assets: S/NoDescriptionAgreed value ($)Wife’s Assets1.POSB Passbook Savings Account No ending with 73399,019.782.POSB MySavings Account No ending with 23863,353.883.Maybank Savings Account No ending with 5704112,603.414.Prudential Insurance Policy No ending with 371122,413.195.Bayswater Fiduciary Services Investment13,200.006.Central Depository Account41,882.417.Central Provident Fund Account264,021.118.Hatten (Harbour City Resort)16,152.939.AVIVA MyWhole LifePlan Policy No ending with 63494,834.5010.Bishan Property822,689.48Total1,310,170.69 51 The Wife is therefore entitled to another sum of $627,408.20 (being $1,937,578.89 - $1,310,170.69) from the pool of matrimonial assets. 52 Again, to minimise the transaction costs, I order that the Husband is to retain the assets in his sole name as follows: S/NoDescriptionAgreed value ($)Husband’s Assets1.POSB Account No ending with 71767,130.092.POSB Account No ending with 595012,493.383.DBS Multiplier Account No ending with 09303,114.664.UOB Investments Account No ending with 78537,883.005.Central Depository Account8,661.106.Central Provident Fund Account383,202.937.Standard Chartered Mortgage One Current Account No ending with 711373,115.668.Standard Chartered Bonus Saver Account No ending with 86776,166.089.UOB CashPlus Statement Account No ending with 19805,740.9410.Citibank Maxisave Account No ending with 2007 and Unfixed Time Deposits No ending with 061230,092.5211.NatWest Account4,132.7712.Fidelity Investments Account397,910.3613.Car (sold 31 July 2017)65,630.0014.AXA Inspire Policy No ending with 459219,244.7315.PruLink Capital Account8,932.8016.UOB SRS Fixed Deposit Account83,721.20Total1,117,172.22 53 Since both Parties want the Farrer Park Property and there is no agreement on how the Pasir Panjang Property is to be dealt with, they will have to decide how these two properties and the balances in the joint bank accounts (see S/No 1 to 3 of [10] above) are to be divided, so that each will receive their respective shares of the total matrimonial asset pool that is valued at $3,875,157.78 (see [24] above). This may involve the use of assets in their sole names, if required. If Parties are unable to agree, they will have liberty to apply within three months of this judgment on how the Parties are to achieve their shares. 54 As I have pointed out in [22] above, there was no updated formal valuation of the three properties as at August 2018. I have therefore used the Wife’s net values of these properties, which are derived from the gross values obtained by her using the website “www.srx.com”, to arrive at the total value of the pool of matrimonial assets set out in [24] above. If Parties are unable to agree on the valuations, they will also have liberty to apply within three months of this judgment to appoint a joint valuer to provide the gross values of the three properties as at August 2018, and thereafter to review the total value of the pool of matrimonial assets as a result of the new valuations. The amounts that they receive under their respective shares (see [46] above), which were determined using their direct and indirect contributions and independent of the values of the three properties, would then be adjusted accordingly.",
        "Maintenance for the Wife": "",
        "The needs of the Wife": "57 The Wife stated that her total expenses per month amounted to $6,261.33, and that the Husband had been contributing $2,350 per month towards a general fund for “property taxes, conservancy charges, utility bills and other miscellaneous household expenses”, before eventually reducing it to $500 when their marriage broke down.37Foot Note 37×WWS 13 July 2018 at paras 88-104.The Wife submitted that she should be awarded a lump sum maintenance of $120,000 ($2,000 per month multiplied by five years) or in the alternative, $2,000 per month.38Foot Note 38×WWS 13 July 2018 at para 105; JSRI-3 at p 3.The Husband disagreed and submitted that the Wife’s earnings are more than sufficient to maintain herself, and that her expenses are inflated as it includes the Children’s expenses.39Foot Note 39×HS 24 July 2018 at paras 96-98. 58 In the present case, the Wife will receive a total of $1,937,578.89 (unless revised after revaluation of the three matrimonial properties) as her share of the matrimonial assets. She is also currently working full-time, and earns a monthly salary of $5,697.20. I note though that she is already 59 years old this year. On the other hand, the Husband, who is younger at 57, earns a monthly salary of $20,179.75 (at [1] above). 59 In my view, while the amount of assets that the Wife will receive is substantial, with a significant part of it in liquid form, it remains fair that the Wife should be given a sum of maintenance. In so deciding, I have taken into consideration that this was a 31-year old marriage, the role of the Wife in bringing up the Children, the number of working years left before she reaches retirement age, and the four times greater earning power of the Husband. The maintenance will be for a period of five years. And while the Husband used to contribute $2,350 per month towards household expenses, it included payments for the upkeep of the Bishan Property,40Foot Note 40×WWS dated 13 July 2018, at para 103(i), S/No 1.and would have benefited the Children too. A reasonable amount for the Wife’s maintenance would therefore be $1,000 per month.",
        "The ability of the Husband to pay": "60 The Husbands earns approximately $20,179.75 per month (see [1] above). While he claimed that his monthly expenses totalled $20,543.15,41Foot Note 41×WWS dated 13 July 2018, at para 103(i) and (ii).he had included items which were disputed by the Wife (eg, payments for the upkeep of the Bishan Property which the Wife said was only $500 per month, and SRS contributions which are in the nature of savings), items where the amount appeared excessive (eg, utility and broadband bills of $1,000 per month for the Pasir Panjang Property), and mortgage payments for the Farrer Park and Pasir Panjang properties (which will be substantially reduced after the division of the matrimonial assets). He is therefore well able to afford to pay maintenance of $1,000 per month to the Wife.",
        "The maintenance amount ordered": "61 However, to achieve a clean break, since the Husband also has substantial liquid assets after division of the pool of matrimonial assets, I order that the Husband pays to the Wife the maintenance amount as a lump sum of $60,000 (being $1,000 per month x 5 years) within three months of this judgment.",
        "": "",
        "Costs": "62 I encourage Parties to agree on the issue of costs, including the option of each party bearing its own costs. If there is no agreement, they are to file and exchange submissions on the issue of costs (limited to ten pages each) within 21 days from the date of this judgment. Tan Puay BoonJudicial Commissioner   Kalpanath Singh Rina and Andrea Lim (Kalco Law LLC) for the plaintiff;Suchitra A/P Ragupathy (Dentons Rodyk & Davidson LLP) for the defendant."
    }
}