{
    "case_title": "Heince Tombak Simanjuntak and others vPaulus Tannos and others",
    "ncitation": "[2019] SGHC 216",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 The present case concerned the recognition of foreign personal bankruptcy orders under the common law. The applicants, who are receivers and administrators appointed under Indonesian law, originally obtained recognition of Indonesian bankruptcy orders made against the four respondents, Paulus Tannos (“the 1st Respondent”), Lina Rawung (“the 2nd Respondent”), Pauline Tannos (“the 3rd Respondent”), and Catherine Tannos (“the 4th Respondent”). The respondents then sought the setting aside of the recognition order. Some time was taken to confirm the state of proceedings in Indonesia. These grounds will focus on the respondents’ application for setting aside. 2 These proceedings demonstrated that there may be some room for a regional recognition regime or common approach as not all issues may be resolved by the UNCITRAL Model Law on Cross-Border Insolvency (“the Model Law”), even if it were extended in Singapore to include personal bankruptcy orders.",
        "Background": "3 The present proceedings were commenced arising out of bankruptcy and insolvency orders made in Indonesia against the Respondents, as well as a company with which they were connected, PT Megalestari Unggul.1Foot Note 1×1st Respondent’s closing submissions dated 30 April 2018 at para 8.The participation of the Respondents in those proceedings was disputed. 4 In any event, the Indonesian proceedings culminated in orders for: (a) A moratorium on debt repayment (alternatively termed a suspension of debt payment obligations), thePenundaanKewajiban Pembarayan Utaang(“PKPU”), dated 9 January 2017.2Foot Note 2×Applicants’ second affidavit dated 28 March 2018 at pp 58–83. (b) A bankruptcy order against the Respondents dated 22 February 2017.3Foot Note 3×Applicants’ second affidavit dated 28 March 2018 at pp 84–95. (c) The appointment of an additional receiver and administrator on 17 April 2017.4Foot Note 4×Applicants’ second affidavit dated 28 March 2018 at pp 96–100. I will refer to these collectively as the “Indonesian Bankruptcy Orders”. 5 On the filing of Originating Summons No 71 of 2018 by the Applicants, recognition was granted to the Indonesian Bankruptcy Orders in anexpartehearing, with the Applicants being empowered to administer, realise and distribute the Respondents’ property in Singapore. The Respondents subsequently filed Summons No 903 of 2018 and Summons No 1188 of 2018 to set aside the orders granting recognition of and assistance to the Appellants.",
        "Summary of the Applicants’ arguments": "6 The Applicants argued that the Indonesian Bankruptcy Orders appointing them as receivers and administrators of the Respondents should be recognised as the common law requirements were met. They were final and conclusive, being judgments of a court which had jurisdiction according to Singapore private international law rules, and no defences applied against recognition.5Foot Note 5×Applicants’ submissions dated 27 April 2018 at paras 16, 27–66. 7 Here, the Indonesian Bankruptcy Orders were final and conclusive, as no pending judicial review or appeals against them were in place. It was unclear from the evidence adduced by the Respondents that there was any appeal extant.6Foot Note 6×Applicants’ submissions dated 27 April 2018 at paras 29–30.In any event, any such review or appeal was impermissible under Indonesian law.7Foot Note 7×Applicants’ submissions dated 27 April 2018 at paras 31–40. 8 The Respondents had submitted to the jurisdiction of the Commercial Court of the Central Jakarta District Court (“the Indonesian Court”), which granted the Indonesian Bankruptcy Orders. The respondents had notice of the proceedings and had participated in the process.8Foot Note 8×Applicants’ submissions dated 27 April 2018 at paras 41–46. 9 No defences applied to the recognition of the Indonesian Bankruptcy Orders. While the Respondents had alleged that the deeds of personal guarantee were fraudulent, they had actually affirmed these guarantees during the proceedings, and the Indonesian Court had in fact verified those guarantees.9Foot Note 9×Applicants’ submissions dated 27 April 2018 at paras 47–55. 10 The applicants also objected to any interim stay being granted on the basis that there was no stay in place for the Indonesian Bankruptcy Orders. The Respondents were also highly likely to dissipate their assets within Singapore.10Foot Note 10×Applicants’ submissions dated 27 April 2018 at paras 70–76.",
        "Summary of the Respondents’ arguments": "11 The respondents argued for the setting aside of the original recognition order, and argued as well that the Court should not recognise the Indonesian Bankruptcy Orders. 12 The Indonesian Bankruptcy Orders had been obtained fraudulently and in breach of natural justice.11Foot Note 11×1st Respondent’s submissions dated 30 April 2018 at paras 120–143.Apart from these, the respondents also raised several alleged instances of failure by the applicants to provide full and frank disclosure: first, that there were appeals and judicial review proceedings pending in Indonesia against the Indonesian Bankruptcy Orders;12Foot Note 12×1st Respondent’s submissions dated 30 April 2018 at paras 84–88.second, that the respondents were heavily contesting the Indonesian Bankruptcy Orders and that there were Indonesian judgments in favour of the respondents undermining the underlying debt and personal guarantees which resulted in the Indonesian Bankruptcy Orders; and third, that the respondents’ debts had in any event been satisfied by the seizure of assets in Indonesia.13Foot Note 13×1st Respondent’s submissions dated 30 April 2018 at paras 98–105.",
        "The decision": "13 The issue that took the longest time to determine was whether there was a pending appeal to the Supreme Court of Indonesia. A number of affidavits were filed by both sides in relation to this point. In the end, I was of the view that there was probably no appeal actually underway. The grounds for common law recognition of the Indonesian Bankruptcy Orders were also met, and no defence was applicable. Recognition and assistance should be granted without any stay to accommodate such an appeal.",
        "Analysis": "14 In the present case, recognition of the Indonesian Bankruptcy Orders against the respondents was made on the basis of the common law, because the Model Law, as enacted in Singapore, does not extend to personal bankruptcy orders. In any event, the Indonesian Bankruptcy Orders predated the coming into force of the Model Law following the enactment of the Companies (Amendment) Act 2017 (No 15 of 2017), which amended the Companies Act (Cap 50, 2006 Rev Ed). The recognition of the Indonesian Bankruptcy Orders in relation to the connected company, PT Megalestari Unggul, was made under the common law as well.",
        "Recognition at common law": "15 Prior to the Model Law’s enactment and coming into force in Singapore, a number of cases recognised foreign corporate insolvency proceedings on the basis of common law. These included my own decisions inReOpti-medix Ltd (in liquidation) and another matter[2016] 4 SLR 312,ReTaisoo Suk (as foreign representative of Hanjin Shipping CoLtd) [2016] 5 SLR 787 andRe Gulf Pacific Shipping Ltd(in creditors’ voluntary liquidation) and others[2016] SGHC 287.These essentially proceeded on the basis of the endorsement of the modified universalist approach endorsed in the Court of Appeal’s decision inBeluga Chartering GmbH (in liquidation) and others v Beluga Projects (Singapore) Pte Ltd (in liquidation) and another (deugro (Singapore) Pte Ltd, non-party)[2014] 2 SLR 815 (“Beluga”). 16 The applicants referred to a number of cases in which foreign insolvency proceedings were considered in the context of the application of theres judicatadoctrine: (a) InHumpussSea Transport Pte Ltd (in compulsory liquidation) v PT Humpuss Intermoda Transportasi TBK and another[2016] 5 SLR 1322, the court refused to recognise an Indonesian court’s approval of a composition plan between a company and its creditors (referred to as a homologation judgment) on the basis that it was not final and conclusive (at [75]–[81]) and that the Indonesian court lacked jurisdiction (at [82]–[84]). In doing so, the court, citingGiant Light Metal Technology (Kunshan) Co Ltd v Aksa Far East Pte Ltd[2014] 2 SLR 545 (“Giant Light”) at [67], reiterated the criteria for recognition, namely that that the decision was the final and conclusive judgment of a court which, according to Singapore private international law rules, had jurisdiction, and no defence to recognition applied. The court there emphasised the need for finality and conclusiveness, without going into the question of the availability of any appeal, as it was primarily concerned with the operation of theres judicatadoctrine. (b) As to when a judgment would be final and conclusive, the Court of Appeal inThe “Bunga Melati 5”[2012] 4 SLR 546 stated (at [81]): … A judgment isfinal and conclusive on the meritsif it is one which cannot be varied, re-opened or set aside by the court that delivered it ... [emphasis in original] (c) This was expanded on in the High Court’s decision inManharlal Trikamdas Mody and another v Sumikin Bussan International (HK) Ltd[2014] 3 SLR 1161 which, citingTheVasiliy Golovnin[2007] 4 SLR(R) 277 andTheIrini A (No 2)[1999] 1 Lloyd’s Rep 189, stated that a pending appeal does not mean that a judgment is not final and conclusive (at [141]). 17 Recognition andres judicataare doctrinally similar as some of their elements overlap. The clearest distinction, though, is in their effects: recognition provides a basis for various consequences, including, in the context of insolvency and bankruptcy proceedings, the rendering of assistance to the foreign insolvency practitioners appointed by the foreign court. In comparison,res judicata, which comprises three distinct but interrelated principles, namely, cause of action estoppel; issue estoppel; and the “extended” doctrine ofres judicataas set out inHenderson v Henderson(1843) 3 Hare 100, is essentially a passive doctrine: seeThe Royal Bank of Scotland NV (formerly known as ABNAmro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 at [98]. Under the doctrine ofres judicata, there is no scope for the granting of assistance or other similar consequential reliefs. 18 A similar position is stated inDicey, Morris and Collins onthe Conflict of Lawsvol 1 (Lawrence Collins gen ed) (Sweet & Maxwell, 15th Ed, 2012) at para 14-026: .... At common law, a foreign judgment may be final and conclusive even though an appeal is actually pending in the foreign country where it was given. “In order to its receiving effect here, a foreign decree need not be final in the sense that it cannot be made the subject of appeal to a higher court; but it must be final and unalterable in the court which pronounced it; and if appealable the … court will only enforce it, subject to conditions which will save the interests of those who have the right of appeal.” So in a proper case a stay of execution would no doubt be ordered pending a possible appeal. This makes clear that a foreign judgment may be final and conclusive, though it is subject to appeal. Recognition will not be denied, but a stay or other order may be made to preserve the position pending appeal. 19 I was of the view that recognition should be granted to a foreign bankruptcy order if the following requirements are met: (a) First, the foreign bankruptcy order is made by a court of competent jurisdiction. (b) Second, that court must have jurisdiction on the basis of: (i) the debtor’s domicile or residence; or (ii) submission by the debtor to the jurisdiction of the court. (c) Third, the foreign bankruptcy order must be final and conclusive. (d) Fourth, no defences to recognition apply. 20 I noted the concern expressed inCross-Border Insolvency(Richard Sheldon gen ed) (Bloomsbury, 4th ed, 2015) at para 9.3, citingEx parteStegmann1902 TS 40,against the use of the recognition doctrine in respect of bankruptcy orders, as such orders are not judgments but bind the whole world. A similar argument was made by the respondents, citingLawand Practice of Bankruptcy in Singapore and Malaysia(Kala Anandarajahetal)(Butterworths Asia, 1999) at p 472: To argue that a foreign bankruptcy is like a foreign judgment and so should be recognised on the same basis is not strictly accurate. This is because, unlike in the case of a judgment which impacts only upon the parties thereto, a foreign bankruptcy has a much wider impact. 21 I was, with respect, not convinced that that was a valid distinction to draw in order to deny the use of the foreign judgment doctrine in this area. I was not persuaded that the fact that a bankruptcy order affects the whole world renders it different from other judgments or orders: corporate insolvency orders have the same effect after all. The effect of a bankruptcy order should be taken into account in considering the scope of recognition and assistance. But given the modified universalist approach modified endorsed inBeluga, which applies just as much to bankruptcies as to corporate insolvencies as a matter of principle, cooperation should be extended. Some of the authorities invoked were much older, and came from an era in which there was less international cooperation and a different view was taken not just of foreign bankruptcies but also insolvencies. 22 There have been a number of Singaporean decisions in which recognition was given to foreign insolvencies, restructurings and receiverships, as noted above. Recognition of the foreign appointment of insolvency practitioners does, however, throw up a number of issues in comparison to recognition and enforcement of foreign money judgments. The assistance of the court would be required, particularly in dealings with assets, monies and information. These go beyond what is entailed in the enforcement of foreign judgments, for instance. The effects on third parties may also be more extensive. For that reason, it may be appropriate for the court to impose restrictions or requirements, for example, on the expatriation or taking possession of certain assets. In this regard, the requirements of the Model law may provide some suitable guidance. Jurisdiction 23 The applicants argued that the jurisdiction of the Indonesian Court was established on the basis that the respondents: (i) were Indonesian citizens; and (ii) had voluntarily submitted to its jurisdiction. The applicants pointed to the fact that the respondents had not challenged the jurisdiction of the Indonesian Court; their complaint on notice was about their inability to attend the PKPU hearing and raise the issue of the alleged fraud being committed. It was argued that the respondents had participated in the Indonesian proceedings culminating in the Indonesian Bankruptcy Orders through their lawyers; it was not necessary for them to have attended or participated in each and every meeting.14Foot Note 14×Applicants’ submissions dated 27 April 2018 at paras 41–46. 24 The respondents did not really press the issue of jurisdiction. As noted by the applicants, the respondents’ primary thrust was on the non-finality of the Indonesian Bankruptcy Orders and defences being available against their recognition.15Foot Note 15×Applicants’ submissions dated 27 April 2018 at para 42. 25 I accepted that there was submission to the Indonesian Court. This was borne out by the evidence which showed that the respondents were present at various hearings and other sessions. The bankruptcy decision of the Indonesian Court dated 22 February 2017 extensively documented the participation of the respondents through their legal counsel at various creditor meetings and meetings related to the PKPU proceedings.16Foot Note 16×Applicants’ second affidavit at p 85–95.Notably, following the PKPU hearing on 9 January 2017, the respondents were all represented by legal counsel at the first creditor meeting held on 20 January 2017.17Foot Note 17×Applicants’ second affidavit at p 88.What counts as submission is that a party has taken a step in the proceedings which necessarily involves waiving its objection to the jurisdiction:Giant Lightat [24], citingWSG Nimbus Pte Ltd v Board of Control forCricket in Sri Lanka[2002] 1 SLR(R) 1088. Here, I was satisfied that the participation of the respondents, through legal counsel, in various hearings and other sessions constituted such a step. Indeed, with the exception of the 3rd Respondent, who only appeared in the 20 January 2017 creditor meeting, the other respondents were each represented at more than one hearing relating to the Indonesian Bankruptcy Orders. It was not a requirement for submission that the respondents attend at every session. Whether the decision was final 26 The respondents argued that the Indonesian Bankruptcy Orders were not final and conclusive as there were pending appeals against the PKPU decision to the Supreme Court of Indonesia. Expert opinion was given that in the present case, judicial review proceedings may be commenced on the ground of “evasion of law”.18Foot Note 18×Affidavit of Dr M Hadi Shubhan at p 22.There was also some suggestion that the PKPU proceedings ought not to have been commenced, that the amounts owed by the respondents were erroneously calculated, and that there was improper service of notice to the respondents of the PKPU proceedings, though it was not clear whether they were independent grounds of appeal.19Foot Note 19×Affidavit of Dr M Hadi Shubhan at pp 23–25. 27 Based on the principles identified above at [18], recognition would be denied if the Indonesian Bankruptcy Orders were not final and conclusive. An appeal would not necessarily render the Indonesian Bankruptcy Orders non-final, but might be grounds for modifying or staying any recognition order granted pending the resolution of the appeal. 28 Here, there was a significant difference between both sides as to whether an appeal existed, and unfortunately some time was taken for confirmation of the state of proceedings in Indonesia. As it was, even after further affidavits were filed, it was not entirely definitive what the position was. In the face of the position of the applicants that the decision to be recognised was final and conclusive, with supporting evidence that on the face of it seemed to show that an appeal was not in fact under way, the evidential burden at least lay on the respondents to show otherwise. What they brought in was insufficient. 29 The applicants pointed to the absence of any papers indicating that an appeal was in progress, beyond an alleged payment and case number.20Foot Note 20×Applicants’ submissions dated 7 January 2019 at paras 21–24.It was also argued that there was no room for the involvement of the Indonesian High Court.21Foot Note 21×Applicants’ second affidavit dated 28 March 2018 at p 39, para 79.Thus, the correspondence referred to by the respondents was not relevant. 30 The respondents relied on the following to prove that there was a pending appeal of the Indonesian Bankruptcy Orders: (a) The assertions in the affidavit of the 1st Respondent that there were appeals and judicial review applications against the Indonesian Bankruptcy Orders;22Foot Note 22×1st Respondent’s affidavit dated 20 July 2018 at paras 4–8. (b) The Supreme Court of Indonesia had assigned a case number for the judicial review of the Indonesian Bankruptcy Orders;23Foot Note 23×1st Respondent’s affidavit dated 20 July 2018 at pp 8–15. (c) Payment had been made by the 1st Respondent for the appeal, as evidenced by a payment invoice;24Foot Note 24×1st Respondent’s affidavit dated 28 November 2018 at p 50. (d) Correspondence between the Indonesian Court and the 1st Respondent’s legal counsel, showing discussions about the appeal being taken up to the Supreme Court of Indonesia;25Foot Note 25×1st Respondent’s affidavit dated 28 November 2018 at paras 5–19. (e) Correspondence between the Central Jakarta District Court and the Supreme Court of Indonesia dated 30 October 2017 in which the former requests for directions on whether the 4th Respondent’s judicial review application should be forwarded;26Foot Note 26×1st Respondent’s affidavit dated 28 November 2018 at para 15. (f) Correspondence between the High Court of Jakarta and the Central Jakarta District Court dated 14 June 2017 and 19 October 2017, in which the former requests the latter to reconsider its decision not to forward the judicial review application to the Supreme Court of Indonesia;27Foot Note 27×Affidavit of Paulus Sinatra Wijaya dated 21 February 2018 at pp 702–704, 716–719.and (g) The expert opinion of Indonesian lawyers that appeals and judicial review were permissible under Indonesian law. 31 The communications which the respondents had with the High Court of Jakarta were to seek its intervention over the Central Jakarta District Court’s refusal to allow their judicial review applications to be filed and to convey the necessary documents to the Supreme Court of Indonesia.28Foot Note 28×Affidavit of Paulus Sinatra Wijaya dated 21 February 2018 at pp 713–715.This was an issue removed at least one degree from the question of whether an appeal was in fact pending. If anything, it would seem to show that there was no appeal pending, whatever the reason may be. 32 Much of the other correspondence relied upon did not show that there was an active appeal being pursued — these were in essence communications between the respondents’ legal counsel and the courtsinter seindicating that possible issues may have arisen relating to formalities and procedure. 33 As argued by the applicants, there were no communications from the Supreme Court of Indonesia showing that the Indonesian Bankruptcy Orders were the subject of an appeal. There were certainly no court papers of the sort that would have been expected indicating that an appeal was underway. In comparison, the applicants managed to obtain a letter from the Supreme Court of Indonesia confirming that nothing had been received from the Central Jakarta District Court and that nothing further could be pursued.29Foot Note 29×Applicants’ affidavit dated 28 September 2018 at pp 13–15. 34 It did not appear to be the case that the Supreme Court of Indonesia had assigned a case number for an appeal against the Indonesian Bankruptcy Orders. Rather, the case number referred to was assigned by the Central Jakarta Commercial Court in relation to the 4th Respondent’s judicial review application.30Foot Note 30×Affidavit of Paulus Sinatra Wijaya dated 21 February 2018 at pp 474–478. 35 As for the payment of fees, this could have assisted the respondents had there been some other papers showing some progress. 36 Taking all of these all together, I was doubtful that there was a substantive appeal underway. In any event, even if there as any such appeal, given the state of the matters as shown before me, I did not see any reason to stay recognition and assistance of the Indonesian Bankruptcy Orders. Defences to recognition 37 The respondents alleged that several defences applied to prevent the recognition of the Indonesian Bankruptcy Orders: (a) The Indonesian Bankruptcy Orders were obtained in breach of natural justice as the respondents had not been given notice of the PKPU proceedings;31Foot Note 31×1st Respondent’s submissions dated 18 April 2018 at paras 120–132. (b) The alleged personal guarantees which resulted in the respondents’ being declared bankrupt in Indonesia were obtained fraudulently;32Foot Note 32×1st Respondent’s submissions dated 18 April 2018 at paras 133–140.and (c) The Indonesian Bankruptcy Orders were being fraudulently enforced by the applicants.33Foot Note 33×1st Respondent’s submissions dated 7 January 2019 at paras 55–70. (1) Breach of natural justice 38 The respondents claimed that there was a breach of natural justice as they had been given insufficient notice about the proceedings against them which culminated in the Indonesian Bankruptcy Orders. The summons for the PKPU proceedings were not served on the 1st Respondent and the advertisements were placed in an obscure newspaper.34Foot Note 34×1st Respondent’s written submissions dated 30 April 2018 at paras 80–81. 39 As against this, the applicants argued that the respondents had been informed of the proceedings against them and had participated in them. The PKPU proceedings were advertised in accordance with the directions of the Indonesian Court.35Foot Note 35×Applicants’ written submissions dated 27 April 2018 at paras 45–46.Service on the respondents was done by way of registered mail, as documented in the PKPU decision.36Foot Note 36×Applicants’ second affidavit dated 28 March 2018 at p 69. 40 I was of the view that the evidence showed that there was no breach of natural justice. The respondents had adequate notice of the proceedings. As I found above at [25], the records showed that there was some actual participation by the respondents in parts of the proceedings. I thus accepted the applicants’ arguments on this score. (2) Whether the foreign orders were obtained by fraud 41 The respondents claimed that the Indonesian Bankruptcy Orders were also obtained by fraud as the underlying personal guarantees were fraudulently obtained.37Foot Note 37×1st Respondent’s written submissions dated 30 April 2018 at paras 133–135.In this regard, the respondents relied on certain decisions of the High Court of Jakarta and the High Court of Bandung, which purportedly found that there was fraud in connection with the personal guarantees and that there were no debts due from the respondents. 42 The respondents also referred to instances of what was termed extrinsic fraud, which was defined in the Court of Appeal’s decision inHongPian Tee v Les Placements Germain Gauthier Inc[2002] 1 SLR(R) 515 (“HongPian Tee”) at [21]: … [W]hat would constitute extrinsic fraud was elaborated in the … Ontario Court of Appeal decision inWoodruff v McLennan(1887) 14 OAR 242 as being: …the defendant had never been served with process, that the suit had been undefended without the defendant’s default, that the defendant had been fraudulently persuaded by the plaintiff to let the judgment go by default … or some fraud to the defendant’s prejudice committed or allowed in the proceedings of the other court. The extrinsic fraud allegedly committed in this case included:38Foot Note 38×1st Respondent’s written submissions dated 30 April 2018 at para 140. (a) the Indonesian Court informing the Respondent’s lawyers that they could appeal; and (b) the respondents being prevented from presenting arguments before the court as to why the PKPU decision should not even have been granted. 43 The applicants, on the other hand, took the position that the decisions relied on by the respondents had been overturned by the Supreme Court of Indonesia; the underlying debts of the respondents were thus still valid. 44 I did not find anything in the nature of fraud in relation to the conduct of the proceedings vis-à-vis the applicants. It may be that the respondents had some complaint about the underlying personal guarantees and other transactions that led to the ordering of the Indonesian Bankruptcy Orders, but those were not to my mind sufficiently connected to the present proceedings. 45 In any event, the evidence was that the Supreme Court of Indonesia had found that the underlying personal guarantees were validly given. The respondents relied on two court decisions which purportedly found that the underlying personal guarantees were invalid. Against this, the applicants adduced evidence in the form of two case searches showing that the lower court judgments in favour of the respondents had been overturned by the Supreme Court of Indonesia.39Foot Note 39×Applicant’s second affidavit dated 28 March 2018 at pp 591–592, 594–599.The respondents did not appear to seriously contest this fact; in the 1st Respondent’s submissions, objection was taken to the non-disclosure of the Supreme Court of Indonesia’s decisions, rather than their validity.40Foot Note 40×1st Respondent’s written submissions dated 30 April 2018 at para 96.In these circumstances, it appeared to me that the respondents’ allegations of intrinsic fraud were simply an attempt to re-litigate issues that had already been adjudicated upon. 46 As for what the respondents’ termed instances of extrinsic fraud, they did not appear to me to fall within the definition of extrinsic fraud adopted by the Court of Appeal inHongPian Tee(see [42] above). The allegations made by the respondents were directed not against the applicants, but at the Indonesian Court. I did not see how informing the respondents’ lawyers of the availability of an appeal, or preventing them from presenting certain arguments before the Indonesian Court, could amount to an instance of extrinsic fraud. These were matters properly within the remit of the Indonesian Court to decide. (3) Fraudulent enforcement 47 The respondents’ arguments on fraudulent enforcement as I understood it were that the applicants had unlawfully and fraudulently enforced the Indonesian Bankruptcy Orders by seizing shares owned by the respondents in an Indonesian company, PT Pakuan, and passed a shareholders’ resolution to oust the respondents from its management. This was found to have been done illegally by the Depok District Court.41Foot Note 41×See 1st Respondent’s written submissions dated 7 January 2019 at Annex B. 48 To my mind, these allegations of fraudulent enforcement were really matters for the Indonesian courts, if at all. What would have been relevant before me was fraud in respect of the obtaining of the Indonesian Bankruptcy Orders. The fact that the applicants may have exceeded their lawful authority in enforcing the Indonesian Bankruptcy Orders, while concerning, did not affect the legitimacy of the orders themselves. 49 That being said, the conduct of the receivers or foreign insolvency representatives could be material for a Singapore Court deciding whether to grant recognition if it is proven that their conduct was particularly wanting and the evidence supports such a finding. But the level of improper conduct would have to be fairly substantial before recognition is withheld: it would essentially have to be such egregious conduct that the application for recognition and assistance amounts to an abuse of process. 50 Here, the applicants were adjudged to have wrongfully replaced the board of PT Pakuan without observing the necessary corporate formalities.42Foot Note 42×See 1st Respondent’s written submissions dated 7 January 2019 at Annex B.The Depok District Court also made a finding that the receivers were not entitled under Indonesian law to exercise the voting rights of a bankrupt person’s shares. This did not appear to me to be so serious as to warrant a denial of recognition and assistance to the Indonesian Bankruptcy Orders. Conclusion on recognition 51 Assistance would generally follow from recognition in bankruptcy cases, though the scope of such assistance would be bounded by any concerns compatible with the general approach of modified universalism as endorsed inBeluga. Thus, limitations may be placed on the repatriation of funds out of Singapore, and orders for possession and sale may be required if other interests in Singapore are affected. 52 In the circumstances, full recognition was granted to the Indonesian Bankruptcy Orders. The applicants were empowered to administer the respondents’ property in Singapore, save that leave of court should be obtained in respect of transfers of real or immovable property and for the repatriation of any assets out of Singapore. While the applicants were authorised to seek and receive information on the respondents’ finances from various banks, any moneys were to remain in the existing accounts. The order on information from banks was stayed pending the resolution of the appeal following the Respondents’ application in Summons No 2381 of 2019.",
        "Change in receivers": "53 There was a change in receivers, but I did not consider that this affected the recognition and assistance. Such changes are not uncommon for various reasons. There was no necessity to startde novo, unless the basis of the receiver’s authority was some different order of the foreign court. This was not the case here: the basis of the receivers’ authority remained the original Indonesian Bankruptcy Orders.",
        "Miscellaneous": "54 I had asked parties to submit on whether it was open to me to introduce a requirement of reciprocity. The indications were that an Indonesian court would not in any situation recognise a Singapore insolvency or restructuring decision, or the appointment of Singapore receivers and managers. The common law has not imposed such a requirement, though it is a feature of a number of civilian systems. The 1st Respondent suggested mirroring the position of the Indonesian courts, which would not seem to recognise Singaporean bankruptcy orders.43Foot Note 43×1st Respondent’s submissions dated 10 May 2018 at paras 14–23.There are perhaps advantages to an approach premised on reciprocity, but in the end, introducing it would be a significant departure from the common law, which would be outside the usual remit of apuisnejudge. 55 There was also an argument raised that the applicants had failed to make full and frank disclosure of several material facts in theexpartehearing: (a) The 1st Respondent was not served with the summons for the PKPU proceedings, with the advertisement being made in an obscure newspaper.44Foot Note 44×1st Respondent’s submissions dated 30 April 2018 at paras 80–81. (b) The respondents still heavily contesting the Indonesian Bankruptcy Orders.45Foot Note 45×1st Respondent’s submissions dated 30 April 2018 at para 83. (c) There were appeals and judicial review proceedings against the Indonesian Bankruptcy Orders.46Foot Note 46×1st Respondent’s submissions dated 30 April 2018 at paras 84–88. (d) There were Indonesian judgments undermining the validity of the underlying debts and personal guarantees.47Foot Note 47×1st Respondent’s submissions dated 30 April 2018 at paras 89–97. I did not think that there was any such failure. The argument in respect of (a) was essentially the same as that for the breach of natural justice which I rejected (see [38]–[40] above). Taking (b) and (c) together, these could not constitute a failure to make full and frank disclosure as I found that there were no appeals underway against the Indonesian Bankruptcy Orders (see [26]–[36] above). Finally, for (d), I accepted the applicants’ explanation that the Indonesian judgments relied upon by the Respondent had actually been overturned by the Supreme Court of Indonesia.48Foot Note 48×Applicants’ submissions dated 27 April 2018 at para 56. 56 It was also argued that there had been satisfaction of the underlying debts.49Foot Note 49×1st Respondent’s submissions dated 30 April 2018 at paras 98–105.I was not persuaded as the applicants brought in sufficient evidence to show that there was a difference in position as to the amounts owed by the respondents. As argued by the applicants, this would be an issue for the Indonesian Court, and would be dealt with by the applicants in the discharge of their duties as receivers, with the final tallying of the amounts to be done subsequently.50Foot Note 50×Applicants’ submissions dated 27 April 2018 at para 65.In any event, there would be a continued ability to bring to the Court’s attention issues on specific actions by the receivers in the execution of their functions. 57 Finally, at the initial arguments, the 2nd to 4th Respondents suggested that cross-examination of the deponents was necessary. I did not adopt this suggestion as such testimony would not have assisted in the determination of the crucial issues in this case, which were primarily legal or which concerned the position of the foreign courts on the facts here.",
        "Arguments for stay pending appeal": "58 Arguments and further arguments were heard for a stay pending appeal. I ordered modification of the original recognition and assistance orders to essentially preserve the position pending the appeal (see [52] above). I was of the view that such powers existed in the recognition of foreign insolvency proceedings (including bankruptcy proceedings) as the court had a continued role to play in supervising the work of the foreign practitioners here. Aedit AbdullahJudge For Summons Nos 903 and 1188 of 2018: Ho Pei Shien Melanie, Chang Man Phing Jenny, and Wan Rui Jie Erwin (WongPartnership LLP) for the applicants;Govintharash s/o Ramanathan, Cham Shan Jie Mark and Isabel Lim (Gurbani & Co LLC) for the first respondent;K Nair Chandra Mohan (Tan, Rajah & Cheah) for the second, third and fourth respondents. For Summons No 2381 of 2019: Ho Pei Shien Melanie, Chang Man Phing Jenny, and Wan Rui Jie Erwin (WongPartnership LLP) for the applicants; Philip Antony Jeyaretnam SC and Lau Wen Jin (Dentons Rodyk & Davidson LLP) for the respondents."
    }
}