{
    "case_title": "Public Prosecutor vMohd Taufik bin Abu Bakar and another appeal",
    "ncitation": "[2019] SGHC 90",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1 Sexual offences, of whatever kind or degree, are deplorable and cannot be condoned. Equally important, however, is the reminder that persons accused of committing sexual offences are, as the label suggests, merely accused of such conduct. Until each and every element of the charge preferred against them is proven beyond reasonable doubt, they are not guilty of the offence in the eyes of the law.",
        "Background": "2 The appellant, Mohd Taufik bin Abu Bakar, was a police inspector in his fifties. At the material time, he was an Officer-in-Charge (“OC”) in the Traffic Police (“TP”).1Foot Note 1×District Judge’s Grounds of Decision (“GD”) at [1]; Record of Appeal (“ROA”) at p 527. 3 The appellant claimed trial to seven charges involving the outrage of modesty of five national servicemen, who served as Special Constables (“SCs”) in the Singapore Police Force. After trial, the District Judge (“the trial judge”) convicted the appellant of six charges (which related to four SCs), and acquitted him on one charge.2Foot Note 2×GD at [2]; ROA at p 527. 4 The particulars of the six charges which the appellant was convicted of are as follows:3Foot Note 3×GD at [4]; ROA at pp 528–530. Name and detailsParticulars of the chargePW1Male/Singaporean1st charge (MAC-908191-2016): Applying hair removal cream on PW1’s pubic region, including his penis, testicles and anus, knowing it to be likely to outrage his modesty on 13 September 2015 between 10:35 am and 12:10 pm in the toilet of the master bedroom of the appellant’s flat.Sentenced to 12 months’ imprisonment and an additional four weeks’ imprisonment in lieu of caning of two strokes.2nd charge (MAC-908190-2016): Massaging PW1’s naked body, including his buttocks, knowing it to be likely to outrage his modesty on 13 September 2015 between 10:35 am and 12:10 pm in the master bedroom of the appellant’s flat.Sentenced to ten months’ imprisonment.PW2Male/Singaporean3rd charge (MAC-908194-2016): Pinching PW2’s left nipple, knowing it to be likely to outrage his modesty, sometime between 8 June 2015 and 29 July 2015, at the Special Investigation Team Office, Traffic Police.Sentenced to four months’ imprisonment.4th charge (MAC-908195-2016): Squeezing PW2’s right buttock, such that the appellant’s fingers were at PW2’s anus region, knowing it to be likely to outrage his modesty, sometime between 8 June 2015 and 29 July 2015, at the Special Investigation Team Office, Traffic Police.Sentenced to ten weeks’ imprisonment.PW3Male/Singaporean5th charge (MAC-908196-2016): Slapping PW3’s right buttock, knowing it to be likely to outrage his modesty, sometime between 8 June 2015 and July 2015, at the Special Investigation Team Office, Traffic Police.Sentenced to five weeks’ imprisonment.PW5Male/Singaporean6th charge (MAC-908197-2016): Putting his right hand around PW5’s waist, such that the appellant’s chest and legs made contact with PW5’s body, knowing it to be likely to outrage his modesty, sometime between January 2015 and July 2015, at the Special Investigation Team Office, Traffic Police.Sentenced to five weeks’ imprisonment. 5 The sentences for the first, third and sixth charge were ordered to run consecutively, with the result that the appellant’s global sentence was 16 months and nine weeks’ imprisonment.4Foot Note 4×GD at [88]; ROA at p 556. 6 The appellant appealed against his conviction on all six charges,5Foot Note 5×HC/MA/9199/2018/02.while the Prosecution appealed against his sentence for being manifestly inadequate.6Foot Note 6×HC/MA/9199/2018/01. 7 After considering the evidence and the findings of fact made by the trial judge, I acquitted the appellant on four of the six charges (namely the first, second, fifth and sixth charges). I also reduced his sentence in relation to the third charge from four months’ imprisonment to twelve weeks’ imprisonment, pursuant to s 394 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (“CPC”), as the sentence imposed by the trial judge was manifestly excessive. Finally, I upheld the sentence in relation to the fourth charge, which I ordered to be run concurrently with the reduced sentence for the third charge. Globally, the appellant’s sentence was therefore reduced to twelve weeks’ imprisonment. 8 I also dismissed the Prosecution’s appeal against sentence entirely. 9 As the appellant’s counsel informed me that he had been in remand for about eight months by the time the appeal was heard, he had out-served his sentence, and he was released on the same day.7Foot Note 7×Minute Sheet (22 March 2019).",
        "Facts": "10 I summarise the findings of fact made by the trial judge, which I did not disturb. 11 The four SCs were either posted to the Hit and Run Investigation Team (“HRIT”) or the Accident Enquiry Investigation Team (“AEIT”). Both HRIT and AEIT share the same Special Investigation Team Office in the Traffic Police (“the office”). The appellant was the OC of HRIT. However, whenever the OC of AEIT was on leave, the SCs under AEIT would also report to the appellant.8Foot Note 8×GD at [3]; ROA at p 528.",
        "PW1: First and second charges": "12 On 26 August 2015, PW1 was posted to AEIT. Sometime in September 2015, there were conversations within the office about PW1’s body odour. On the pretext of wanting to help PW1 with his body odour problem, the appellant called PW1 to his cubicle and asked for his phone number, which PW1 gave to him.9Foot Note 9×GD at [7] – [9]; ROA at p 531. 13 After a series of messages between the pair, PW1 agreed to go to the appellant’s home so that the appellant could teach him how to apply hair removal cream and scrub his body.10Foot Note 10×ROA at p 614.This was allegedly to help PW1 get rid of his body odour. 14 It was arranged that the appellant would pick PW1 at his home on a Sunday morning, 13 September 2015.11Foot Note 11×GD at [11]; ROA at p 532. The first charge: Application of hair removal cream on PW1’s pubic and anus region 15 On 13 September 2015, the appellant drove to PW1’s flat to pick him up. Upon arriving at the appellant’s flat, the appellant instructed PW1 on how he was to apply the hair removal cream and body scrub.12Foot Note 12×GD at [12]; ROA at p 532. 16 The appellant then left PW1 in the toilet. About five minutes later, the appellant knocked on the toilet door to check on PW1’s progress, and PW1 complied by showing him his armpit.13Foot Note 13×GD at [13]; ROA at p 532. 17 Subsequently, the appellant slid open the toilet door and entered without first obtaining PW1’s permission. He then proceeded to help PW1 apply the hair removal cream on PW1’s armpits, pubic region, and anus.14Foot Note 14×GD at [14] – [16]; ROA at p 532. The second charge: Massaging PW1’s naked body, including his buttocks 18 After the hair removal process, PW1 used a towel to cover his private parts, and sat on the appellant’s bed while waiting for rashes that had developed on his armpits to subside.15Foot Note 15×GD at [17]; ROA at p 533. 19 After the rashes had subsided, the appellant proceeded to apply body scrub on PW1’s bare legs, buttocks, back and shoulders.16Foot Note 16×GD at [18]; ROA at p 534.However, the appellant did not touch PW1’s pubic region, and instead handed PW1 some of the body scrub to rub on his own pubic region.17Foot Note 17×GD at [18]; ROA at p 534; Transcripts (Day 1), p 56 at lines 17 and 22 – 23; ROA at p 79. 20 Throughout the hair removal and body scrubbing process, PW1 did not verbally consent to the appellant’s instructions. Instead, PW1 complied as he “froze” and was “lost”, and thus “could not react”.18Foot Note 18×Transcripts (Day 1), p 44 at lines 12 – 13; ROA at p 67.",
        "PW2, PW3 and PW5: Inappropriate contact": "21 PW2, PW3 and PW5 were all SCs who were working in the same office as the appellant at the material time. The charges in relation to them involved inappropriate contact which the appellant made with them in the office. PW2: Third charge of pinching PW2’s nipple 22 Sometime between 8 June 2016 and 29 July 2016, PW2 was carrying less than ten files with both hands, and wearing t-shirt and pants. As he passed the photocopying machine, the appellant raised his right hand and pinched PW2’s left nipple. PW2 shouted “Ah” in response, to which the appellant laughed.19Foot Note 19×Transcripts (Day 2), p 54 at lines 1 – 2 and 10 – 12; ROA at p 206; GD at [25]; ROA at p 535. 23 As PW2’s hands were full with the files, he could not do anything, although he felt taken advantage of and angry at the time.20Foot Note 20×Transcripts (Day 2), p 54 at line 19; ROA at p 206. PW2: Fourth charge of squeezing PW2’s buttocks near the anus region 24 Sometime after the incident relating to pinching PW2’s nipple,21Foot Note 21×Transcripts (Day 2), p 49 at lines 20 – 21; ROA at p 201.the appellant called PW2 into his cubicle to collect some files. As PW2 was resting the files on the appellant’s desk, the appellant was exiting his own cubicle. As the appellant exited the cubicle, he squeezed PW2’s right buttock cheek near his anus region22Foot Note 22×Transcripts (Day 2), p 42 at lines 23 – 26 and p 43 at line 6; ROA at pp 194 – 195.for about one to two seconds.23Foot Note 23×Transcripts (Day 2), p 46 at line 18; ROA at p 198. 25 While PW2 felt violated, he refrained from hitting the appellant for fear of being punished for hitting an inspector.24Foot Note 24×Transcripts (Day 2), p 47 at lines 19 – 30; ROA at p 199.The appellant also acted like nothing had happened after the incident.25Foot Note 25×Transcripts (Day 2), p 48 at line 12; ROA at p 200. PW3: Fifth charge of slapping the PW3’s buttock 26 Sometime between 8 June 2015 and July 2015, while PW3 was posted to AEIT, PW3 was carrying a stack of files and walking along the corridor outside the office. The appellant was walking down the same corridor in the opposite direction from PW3. As PW3 passed the appellant, the appellant slapped him once on his right buttock, which PW3 described as a “slap and a slide away”.26Foot Note 26×GD at [32]; ROA at pp 536 – 537. 27 PW3 stopped in his tracks, but the appellant simply walked past him. PW3 did not say anything, even though he felt “like [his] personal space had been invaded”.27Foot Note 27×GD at [33]; ROA at p 537. PW5: Sixth charge of holding PW5’s waist 28 PW5 was posted to AEIT in 2014. In early January 2015, the appellant covered for the OC of AEIT as she was on an extended period of leave. The appellant therefore directly supervised PW5 during this period, and their interactions increased as a result.28Foot Note 28×GD at [35]; ROA at p 537. 29 Sometime between January 2015 and July 2015, while PW5 was using the shredder in the office whilst listening to his MP3 player, the appellant approached him from behind and placed his right hand around PW5’s right waist for about four to five seconds. PW5 could feel the appellant’s chest against his back and the appellant’s legs against his own.29Foot Note 29×GD at [36]; ROA at p 537. 30 The appellant had done so to check if PW5 was angry as he did not respond to the appellant when he called for PW5; in fact, PW5 had been listening to music on his MP3 player, and could not therefore hear the appellant.30Foot Note 30×Transcripts (Day 3), p 62 at lines 9 – 13; ROA at p 297. 31 The appellant then walked back to his work station. PW5 felt “awkward” and “uncomfortable” as the appellant had been “too close” to him, and as he considered his waist to be an intimate part of his body.31Foot Note 31×GD at [37]; ROA at p 538.",
        "Elements of the outrage of modesty charge": "32 For the acts disclosed above, the appellant was convicted on six counts of outraging the modesty of PW1, PW2, PW3 and PW5. Outrage of modesty (“OM”) is an offence under s 354(1) of the Penal Code (Cap 224, 2008 Rev Ed) (“Penal Code”), which provides that: 354.—(1) Whoever assaults or uses criminal force to any person, intending to outrage or knowing it to be likely that he will thereby outrage the modesty of that person, shall be punished with imprisonment for a term which may extend to 2 years, or with fine, or with caning, or with any combination of such punishments. 33 To convict an accused person for outraging the modesty of another person, two aspects must be proven beyond reasonable doubt: (a)Actus reus:the accused had assaulted or used criminal force against the person; and (b)Mens rea: the accused had the intention to outrage the modesty of that person,orknew that his actions would likely outrage that person’s modesty. 34 In this case, theactusreusof each of the six charges were clearly established on the facts found by the trial judge, which I did not disturb.",
        "The knowledge element of an OM charge": "35 Themensreaelement of an OM charge has two disjunctive limbs, namely the intent and the knowledge limb. Satisfaction of either of the two limbs will suffice. 36 In this case, all six charges preferred against the appellant utilised the knowledge, rather than the intent, limb of s 354(1) of the Penal Code.32Foot Note 32×ROA at pp 9 – 14. 37 To prove that the accused had sufficient knowledge for the purposes of the OM charge, it must be shown that the accused committed his acts on the victim whilst “knowing it to be likely that he will thereby outrage the modesty ofthatperson” [emphasis added] (s 354(1) of the Penal Code). Here, the knowledge that is relevant is that of the accused, and the unexpressed feelings and thoughts of the victim is often irrelevant for the purposes of proving that knowledge. Furthermore, the accused’s knowledge must be assessed in relation to the alleged victim, as can be gleaned from the focus on the outrage of modesty of “thatperson”. 38 Hence, context is everything. In assessing the knowledge of the accused in the commission of the act, the objective circumstances shedding light on the accused’s state of mind must be read against the backdrop of the appropriate context. 39 For example, if an accused person touches the private parts of a stranger, the objective circumstances, read against the context of the non-existent relationship between the parties, would suggest that the accused must have known that his acts would outrage the victim’s modesty. Unless the accused can avail himself of one of the relevant exceptions in the Penal Code (such as the unsoundness of mind), any allegations by the accused that he did not know that his acts would outrage the victim’s modesty would fly in the face of logic and human experience. 40 However, in cases where the context discloses a relationship (whether romantic or not) between the parties, the objective circumstances in which the alleged OM offence was committed must be carefully assessed against the context to determine whether the accused knew at the material time that his acts would likely outrage the victim’s modesty. This is a two-stage process: (a) First, the objective circumstances that are patent to the accused must be determined. (b) Secondly, the objective circumstances in (a) must be assessed against the context in which the acts were committed. 41 It is to this point which I now turn.",
        "The trial judge’s findings as regards the appellant’s knowledge": "42 The trial judge was cognisant of the need to consider the mental state of the appellant at the time of the commission of the alleged offences, and that this mental state had to be assessed against the appropriate context.33Foot Note 33×GD at [91]; Physical ROA at p 598. 43 Key to her finding that the appellant had knowledge that his respective acts would likely outrage the modesty of PW1, PW2, PW3 and PW5 (collectively, “the PWs”) was the superior-subordinate relationship between the parties. In this regard, the appellant was the OC (or covering OC) of the PWs, and held the rank of Inspector. He was a senior officer, while the PWs were only SCs (a lower rank than the appellant) who were serving their national service obligations. 44  Viewing the appellant’s acts in light of this superior-subordinate relationship, the trial judge found that the lack of express consent by the PWs to the appellant’s actions, which amounted to intrusions of varying degrees to the PWs’ intimate regions, was sufficient to imbue in the appellant knowledge that his acts would likely outrage the PWs’ modesty.34Foot Note 34×GD at [102], [105], [111] – [112], [116], [120] – [121]. 45 For example, in finding that the appellant knew that his acts of applying hair removal cream on PW1’s pubic region and his anus would likely outrage PW1’s modesty, the trial judge observed (Public Prosecutor v MohdTaufik Bin Abu Bakar[2018] SGMC 73 (“GD”) at [101]–[102]): 101 To establish the charge, both the mindset of PW1 and the accused must be considered. In this regard, the relationship between PW1 and the accused is critical. PW1 was then performing his national service in the [Singapore Police Force]. He was 19 years old. The accused was an Inspector, his superior and more than 30 years older. The accused was in a position of authority in relation to PW1. 102 As for the accused’s state of mind, … [t]here is … no evidence to suggest that he could have reasonably believed PW1 was a consenting party. There is no requirement of resistance to prove the absence of consent. I accepted PW1’s description of his state of mind, namely, his ‘freeze’ reaction. He was understandably shocked and embarrassed as he was naked when the accused entered unexpectedly. I accepted his evidence that he ‘froze’. He found himself unable to say anything and the fact that he did not stop the accused cannot be considered as consent. Hence, to the trial judge, the absence of verbal consent by PW1, viewed in light of the superior-subordinate relationship between PW1 and the appellant, was sufficient to prove that the appellant had knowledge that his acts would likely outrage PW1’s modesty. 46 Considering the totality of the evidence, I did not agree with the trial judge’s assessment of the appellant’smensreain relation to the first, second, fifth and sixth charges. I found that the evidence plainly did not show that the appellant had knowledge that his actions in respect of those charges were likely to outrage the modesty of the PWs. Accordingly, for reasons to be elaborated on, I quashed the convictions on those charges.",
        "The knowledge of the appellant": "",
        "PW1": "47 The acts committed by the appellant to PW1 were undoubtedly of a highly intrusive nature. With respect to the first charge, the appellant had applied hair removal cream to PW1’s pubic and anal region. With respect to the second charge, the appellant applied body scrub to PW1’s naked body, including his buttocks. 48 Viewed in isolation, it would have been obvious that the appellant’s acts were done with the knowledge that they would have likely outraged PW1’s modesty. However, as alluded to at [40] above, in determining the appellant’s knowledge, the objective circumstances must be assessed against the appropriate context. The appellant’s knowledge must be ascertained objectively also by what the appellant himself would have known or been informed from (a) reading PW1’s messages; (b) seeing PW1’s actions, responses, facial expressions and behaviour; and (c) hearing and understanding what PW1 had said to him.  One cannot expect the appellant to be able to read PW1’s mind if PW1 had not in some way expressed himself in words or messages to the appellant or exhibited his emotions and feelings physically through some form of facial or bodily expressions in the view of the appellant. Objective circumstances 49 The objective circumstances that were patently before the appellant would shed light on his knowledge at the time of the commission of the acts. 50 Here, PW1 went to the appellant’s home, where the appellant gave PW1 instructions on how to remove the hair on his body. The appellant also informed PW1 that the hair removal cream should not be left on for too long as it could burn the skin or cause rashes.35Foot Note 35×GD at [12]; ROA at p 532. 51 The appellant then left PW1 to his own in the appellant’s toilet, where PW1 locked the toilet door and took off all his clothes for the purposes of the hair removal process. PW1 then began applying the hair removal cream on his armpit.36Foot Note 36×GD at [12]; ROA at p 532. 52 After about five minutes, the appellant asked to check on PW1’s progress, and PW1 opened the toilet door slightly to show the appellant his armpit. The appellant gave PW1 instructions to apply more hair removal cream, and PW1 then closed the toilet door again. However, PW1 did not lock the door this time around.37Foot Note 37×GD at [13]; ROA at p 532. (1) The hair removal 53 Sometime later, the appellant slid open the toilet door, and entered the toilet without first obtaining PW1’s permission. PW1 did not raise any alarm or objections when the appellant entered the toilet. The appellant told PW1 that he was still applying too little cream, and proceeded to squeeze the cream on his own palm.38Foot Note 38×GD at [14]; ROA at p 533. 54 The appellant first applied the hair removal cream on PW1’s left and right armpit. After applying the cream on each armpit, the appellant used a spatula to scrape the hair off the armpits. The appellant then rinsed off the cream with a small showerhead next to the toilet bowl area.39Foot Note 39×Transcripts (Day 1), p 47 at lines 28 – 30; ROA at p 70. 55 After the armpit region was done, the appellant proceeded to apply the cream on PW1’s pubic region.40Foot Note 40×GD at [14]; ROA at p 533.He then repeated the process of scraping the hair off with the spatula, before rinsing the cream off.41Foot Note 41×Transcripts (Day 1), p 48 at lines 1 – 8; ROA at p 71.Apart from the application of the hair removal cream, the appellant did not make skin-to-skin contact with PW1, be it when using the spatula or when rinsing off the cream.42Foot Note 42×Transcripts (Day 1), p 48 at lines 9 – 16; ROA at p 71. 56 Thereafter, the appellant sat on the toilet bowl and asked PW1 to turn around and bend down in front of him, where he then applied the hair removal cream on PW1’s anus.43Foot Note 43×GD at [16]; ROA at p 533.After about two to three minutes, the appellant took a spatula and scraped the hair off. He then rinsed the cream off with a small showerhead.44Foot Note 44×GD at [16]; ROA at p 533; Transcripts (Day 1), p 49 at lines 13 – 16; ROA at p 72. (2) The body scrub 57 After the hair removal process, PW1 noticed rashes on his armpits. As such, he did not proceed with the body scrub immediately, and instead took a towel from the appellant to wrap around his waist so as to cover his hitherto exposed private parts. So covered, PW1 exited the toilet and went to the master bedroom, where he sat on the edge of the appellant’s bed while waiting for the rashes to subside.45Foot Note 45×GD at [17]; ROA at p 533. 58 After the rashes subsided, the appellant asked PW1 to remove his towel and lie face down on an orange-coloured groundsheet on the floor. The appellant then applied the body scrub, starting from PW1’s legs to buttocks, before proceeding upwards to his back and shoulders. The appellant, who was fully clothed,46Foot Note 46×Transcripts (Day 1), p 55 at lines 13 – 14; ROA at p 78.sat on PW1’s waist as he applied the body scrub.47Foot Note 47×GD at [18]; ROA at p 534; Transcripts (Day 1), p 54 at lines 29 – 31; ROA at p 77. 59 The appellant then asked PW1 to turn over, where he applied the body scrub on the front side of PW1’s legs and armpits. The appellantdid nottouch PW1’s pubic region, and instead handed PW1 some of the body scrub to rub on his own pubic region.48Foot Note 48×GD at [18]; ROA at p 534; Transcripts (Day 1), p 56 at lines 17 and 22 – 23; ROA at p 79. (3) No visible objection 60 The appellant and PW1 had arrived at the appellant’s home at around 10:31 am,49Foot Note 49×GD at [12]; ROA at p 532.and they only left at around 12:11 pm.50Foot Note 50×GD at [21]; ROA at p 534.Hence, this chain of events took place over the course of about an hour, during which time there was no expression of any objection by PW1, who complied with each of the appellant’s instructions.51Foot Note 51×The appeThe reason for PW1’s compliance was because he felt “lost” and “frozen” from the moment the appellant entered the toilet.52Foot Note 52×Transcripts (Day 1), p 44 at lines 12 – 13, p 45 at lines 5 – 8, p 46 at lines 5 – 8, p 48 at line 31, p 49 at lines 6 – 10.As PW1 recounted, “[s]ince the moment he entered, I---I froze, I was lost; I couldn’t react. It’s like---I feel like the whole world collapsed on me, so all I did was comply.”53Foot Note 53×Transcripts (Day 1), p 44 at lines 12 – 13; ROA at p 67. 61 However, as PW1 explained, his feelings were entirely internal and could not be seen:54Foot Note 54×Transcripts (Day 2), p 21 line 21 – p 22 line 5; ROA at pp 173 – 174. Q: Yes, you have to explain to the Court what you meant by that. “You could have stopped him but you couldn’t.” What do you mean by that? What stopped you? A: Be---because, Your Honour, I have fear in my heart, I explained before. And I don’t know what he’s going to do next too. Q: You do not know what he is going to do. Court: Okay, you have said this many times, you had fear in your heart. So explain, why did you have this fear? Witness: One thing for sure, Your Honour, I---I’m not saying that you’re wrong, I know what I feel. And I really don’t know what to do at that point of time. Court: So can you explain the first sentence, “I am not saying you are wrong”? What do you mean by that? Witness: I am saying that the fear part, like, what I mean is thatthe fear in---inside my chest is, like, there.I know you can’t see itor---but the only way is feeling it, and that is what I felt. [emphasis added] 62 I pause at this juncture to emphasise that I am in no way critical of PW1’s failure to express his objections to the appellant. As See Kee Oon J observed inGBR v Public Prosecutor and another appeal[2018] 3 SLR 1048 (GBRv PP) at [20], “victims of sexual crimes cannot be straightjacketed in the expectation that they must act or react in a certain manner.” I also accepted without hesitation the trial judge’s finding that PW1 was a “soft-spoken” and “shy” person,55Foot Note 55×GD at [94]; Physical ROA at p 599.given that the trial judge had made her findings based on her direct observations on the demeanour and credibility of PW1. As a result, it was understandable that PW1 failed to sound out his objection to the appellant’s acts. Most importantly, I am in no way condoning the interpretation that mere silence invariably amounts to consent where the acts involve intrusions to a person’s bodily integrity. 63 Nonetheless, the objective circumstances disclose the following: (a) PW1 complied with the appellant’s instructions for an extended period of time. Such instructions included the appellant touching PW1 in highly sensitive areas, namely his pubic region, anus, and buttocks. However, they were strictly confined to the hair removal and body scrubbing procedure which the appellant had invited PW1 to his home to do. (b) PW1 never told the appellant that he was agreeing or consenting to the appellant’s acts. However, notwithstanding the highly intrusive nature of the appellant’s acts, PW1 also did not show any visible signs of objection, alarm or discomfort throughout that extended period of time. (c) The active participation by PW1 for the hair removal process and the scrubbing procedure would not have appeared to the appellant to be consistent with the conduct of someone who felt that his modesty was outraged. Instead, it would have demonstrated to the appellant that PW1 was a willing participant. 64 With these, it is appropriate to turn towards the context in which PW1 arrived at the appellant’s home. The context as disclosed by the messages 65 While much weight was placed on the power disparity between the appellant and PW1, a closer inspection of the messages exchanged between them prior to the fateful day when PW1 went to the appellant’s home reveal that the appellant had taken active steps to downplay his superiority, and that the parties had a relationship that belied the formal superior-subordinate relationship they otherwise shared. 66 To begin, the appellant started the conversation between the pair by asking PW1 personal questions such as which block PW1 lived in and where PW1’s family was staying.56Foot Note 56×ROA at pp 604 – 606. 67 The appellant then started using suggestive words in his messages, such as telling PW1 not to be “naughty hanky panky hurray hurray”,57Foot Note 57×ROA at p 607.and “you naughty I squeeze your…”,58Foot Note 58×ROA at pg 608.to which PW1 replied “[w]ah being gay now ahh sir”.59Foot Note 59×ROA at p 638, S/N 53.The appellant also repeatedly emphasised that PW1 could drop the authoritative “sir” salutation outside of the office, and that addressing the appellant as “uncle” would suffice.60Foot Note 60×ROA at p 642, S/N 94; p 643, S/N 99; p 644, S/N 100 – 101; p 646, S/N 117. 68 After the initial messages, the appellant then raised the issue of PW1’s body odour61Foot Note 61×ROA at p 644, S/N 106.and offered to help PW1 get rid of the said odour.62Foot Note 62×ROA at p 645, S/N 109.The appellant gave a vivid description of the process, and the parties eventuallyagreedto carry out the process in the appellant’s home:63Foot Note 63×ROA at pp 645 – 646, S/N 112 – 119. FromDate and timeMessageAppellant12 September 2015, 5:03 pmNeed to teach you how to use the stuffs [to get rid of the body odour]…. Need scrubbing whole body but before that need to apply the creamy under the armpits, between legs, pubic hairs and hair near asshole….sorry have to be blatant and is not vulgar, has to be donePW112 September 2015, 5:05 pmIf u’re free tmr then we canPW112 September 2015,  5:05 pmWe can go out*Appellant12 September 2015, 5:07 pmIs it okay at my place? Can you [sic] my master bedroom as there’s shower facilities. I will go alone and get the stuff to clean you up…PW112 September 2015, 5:07 pmOkay can sirAppellant12 September 2015, 5:08 pmUncle lah…..PW112 September 2015, 5:08 pmOopsPW112 September 2015, 5:08 pmUncle* 69 On the morning of 13 September 2015, at 9:51 am, PW1 messaged the appellant to check what time the appellant would be picking him up: “[u]ncle w[h]at time [yo]u’ll pick me up”.64Foot Note 64×ROA at p 654, S/N 186.The appellant picked PW1 shortly after, and the parties arrived at the appellant’s place at around 10:31 am on the same day. 70 The messages show that the parties communicated as equals, and contradict the alleged power disparity between them. It is in this context (rather than as superior and subordinate) that PW1’s compliance to the appellant’s intrusive acts had to be assessed in determining whether the appellant had knowledge that his acts would likely outrage PW1’s modesty. Assessment of the appellant’s knowledge 71 The context reveals that, from the appellant’s perspective, PW1 had willingly arrived at his home for the hair removal and body scrub processes. There was also little to no power disparity between the parties for the purposes of PW1’s visit to the appellant’s home. 72 Viewing the objective circumstances (see [63] above) in light of this context, PW1’s lack of objection over an extended period of time to the appellant’s highly intrusive acts (which were in line with the procedure he had described to PW1 in his message) would not lead to the inference that the appellant knew that his acts would likely outrage PW1’s modesty. The contrary would be the case. In fact, consistent with his expressed intention of helping PW1 get rid of his body odour, after the hair removal and body scrub was complete, the appellant gave PW1 several personal hygiene products, including the body scrub and hair removal cream, before PW1 left his home.65Foot Note 65×GD at [20]; ROA at p 534. 73 Hence, I quashed the appellant’s conviction for the first and second charge, which related to acts committed against PW1. 74 For clarity, I should add that I arrived at my conclusion on themensreaof the appellant without consideration of PW1’s behaviourafterthe appellant had applied the hair removal cream and body scrub on his body parts. 75 PW1’s behaviour which were highlighted to me were as follows: after PW1 left the appellant’s home with the appellant, PW1 went to see his mother off with the appellant as she was leaving to Malaysia on a coach. PW1 then had lunch with the appellant at a nearby food centre, before following the appellant to purchase a pair of sweat pants.66Foot Note 66×GD at [106], Physical ROA at p 605.Finally, after the appellant dropped PW1 home at about 3 pm, being almost 3 hours after they had left the appellant’s home, PW1 messaged the appellant “thank you for everything”.67Foot Note 67×ROA at p 655, S/N 192.This behaviour appears to be more consistent with someone whose modesty had not been outraged rather than one who had felt that his modesty had been outraged. 76 However, suchex post factobehaviour, which suggests that PW1 might well have consented to the appellant’s conduct, areirrelevantfor the purposes of determining whether the appellant knew that his acts would have been likely to outrage PW1’s modesty at the material time when he was committing those acts.",
        "PW2, PW3 and PW5": "Objective circumstances 77 The acts committed against PW2, PW3 and PW5 involved opportunistic intrusions into the private spaces of the PWs in the office: (a) Against PW2: (i) Third charge: the appellant suddenly pinched PW2’s left nipple while PW2 was holding files with both hands. PW2 could not react as his hands were full with the files, and he could only shout “Ah” in response, to which the appellant laughed.68Foot Note 68×Transcripts (Day 2), p 54 at lines 1 – 2 and 10 – 12; ROA at p 206; GD at [25]; ROA at p 535. (ii) Fourth charge: the appellant suddenly squeezed PW2’s buttocks near the anus region69Foot Note 69×Transcripts (Day 2), p 42 at lines 23 – 26 and p 43 at line 6; ROA at pp 194 – 195.for one to two seconds.70Foot Note 70×Transcripts (Day 2), p 46 at line 18; ROA at p 198.PW2 did not physically react, and the appellant acted like nothing happened.71Foot Note 71×Transcripts (Day 2), p 48 at line 12; ROA at p 200. (b) Against PW3: (i) Fifth charge: the appellant slapped PW3 on the right buttock as they walked down the same corridor in opposite directions.72Foot Note 72×GD at [32]; ROA at pp 536 – 537. (c) Against PW5: (i) Sixth charge: the appellant held onto the waist of PW5 for about four to five seconds, and PW5 could feel the appellant’s chest against his back and the appellant’s legs against his own.73Foot Note 73×GD at [36]; ROA at p 537. 78 The objective circumstances reveal that the intrusions into the private spaces of the PWs were of varying degrees. The pinching of PW2’s nipple and the squeezing of his buttock near the anus region involved much graver intrusions into a person’s private space than the “slap and slide” of PW3’s buttock and the holding of PW5’s right waist. The context 79 In his defence, the appellant emphasised that he was merely “horsing around” when he committed the acts against the PWs. 80 In this regard, PW5 stated that the appellant had the habit of hanging around and joking with other SCs, whereby he would sometimes massage their shoulders, tap their buttocks, or make dirty jokes with them.74Foot Note 74×Transcripts (Day 3), p 59 at lines 1 – 3; ROA at p 294.PW5 did not feel offended by those actions as they were “the kind of things [that SCs] do to each other” during their basic military training and in the Traffic Police, and it felt “very natural” for them as a result.75Foot Note 75×Transcripts (Day 3), p 59 at lines 22 – 26; ROA at p 294. 81 PW5 also gave evidence that the appellant had previously massaged his shoulders and tapped his buttocks on about four or five incidents.76Foot Note 76×Transcripts (Day 3), p 67 at lines 9 – 11; ROA at p 302.During those incidents, he thought that there was “nothing wrong” as the appellant “was just horsing around”.77Foot Note 77×Transcripts (Day 3), p 67 at lines 15 – 19; ROA at p 302. 82 Another Prosecution witness, who was also a SC in the office, corroborated this account, and agreed that the appellant would usually slap the SCs’ buttocks, and that he did not regard such acts as sexual in nature. Instead, he thought that the appellant was playing around during those occasions.78Foot Note 78×Transcripts (Day 3), p 54 at lines 4 – 24; ROA at p 289. 83 Such conduct appeared to be consistent with the appellant’s relationship with the SCs. While the appellant was superior in rank to the SCs, the Prosecution’s witnesses consistently testified that he was friendly with them, and would occasionally make physical contact with them.79Foot Note 79×Transcripts (Day 3), p 77 at lines 22 – 26; ROA at p 312, Transcripts (Day 4), p 8 at lines 4 – 7; ROA at p 333; Transcripts (Day 3), p 65 at lines 28 – 31; ROA at p 300; Transcripts (Day 3), p 19 at lines 15 – 32; ROA at  p 254. 84 Through these occasions, the appellant was never informed that his physical contact with the SCs was considered inappropriate, or that his acts would outrage their modesty. In relation to the acts that were the subject matter of the third to sixth charges, none of the PWs had communicated their discomfort with his actions. Assessment of the appellant’s knowledge 85 I accepted that there was a work culture whereby the appellant would sometimes make physical contact with his SCs, whether by giving them massages on their shoulders, or tapping their buttocks in a non-sexual manner. 86 However, there is a limit to such “horseplay”. That the PWs and other SCs never sounded out their discomfort does not mean that the appellant did not know that certain of his more intrusive acts would likely outrage their modesty. Victims of sexual offences often suffer in silence, and silenceper secannot be interpreted as their consent to further acts of sexual assault. 87 In this case, unlike as between PW1 and himself, the appellant’s relationship with PW2, PW3 and PW5 remained strictly one of superior and subordinate, with the result that the PWs would be less likely to be able to speak out about their discomfort with the appellant’s intrusion into their private space. As PW2 recounted, after the appellant squeezed his right butt cheek near his anus, he wanted to elbow the appellant in the face, but he had to refrain from doing so for fear of punishment that could follow from hitting an inspector (the appellant).80Foot Note 80×Transcripts (Day 2), p 47 at lines 19 – 30; ROA p 199. 88 In particular, the acts were committed by the appellant in the office, whereby the superior-subordinate relationship between himself and the PWs would be readily apparent. 89 Viewing the objective circumstances in the context of the offences, I agreed with the trial judge that the appellant knew that his acts of pinching PW2’s nipple and squeezing his buttock near the anus would likely outrage PW2’s modesty. Such acts could not have been justified by the workplace culture whereby SCs had appeared to accept the tapping of their buttocks and provision of massages on their shoulders, which were physical intrusions of a much lesser degree. 90 Given the circumstances, I did not believe that the appellant knew that his acts of slapping PW3’s buttock and holding PW5’s waist would likely outrage their modesty. In such acts, the degree of intrusion into the PWs’ private spaces were of a much lesser degree when compared to the acts committed against PW2. Viewed in light of the workplace culture whereby physical intrusions of a similar nature were seemingly accepted, I found that the evidence did not establish that the appellant knew that his acts were likely to outrage the modesty of PW3 and PW5. Had PW3 and PW5 previously expressed their discomfort with acts of such nature, and if the appellant had ignored their complaints and continued with his conduct, I would have found that he knew that his acts would likely outrage their modesty. However, there was no evidence that PW3 and PW5 had ever done so. 91 Accordingly, I upheld the trial judge’s conviction on the third and fourth charges, while I overturned the conviction on the fifth and sixth charges.",
        "The appropriate sentence": "92 Having acquitted the appellant on the first, second, fifth and sixth charges, I was left to consider the appropriate sentence for the third and fourth charges only. 93 The Prosecution appealed against the appellant’s sentence for being manifestly inadequate. 94 InKunasekarans/o Kalimuthu Somasundara v Public Prosecutor[2018] 4 SLR 580 (“Kunasekaran”), the two-step sentencing bands approach was adopted for OM cases under s 354(1) of the Penal Code. 95 Under theKunasekaranframework (Kunasekaranat [45], citingGBR vPP), (a)  The court should first consider the following offence-specific factors (at [27]–[30]): (i) The degree of sexual exploitation. This includes considerations of the part of the victim’s body the accused touched, how the accused touched the victim, and the duration of the outrage of modesty. (ii) The circumstances of the offence. These include considerations of: (A) the presence of premeditation; (B) the use of force or violence; (C) the abuse of a position of trust; (D) the use of deception; (E) the presence of other aggravating acts accompanying the outrage of modesty; and (F) the exploitation of a vulnerable victim. (iii) The harm caused to the victim, whether physical or psychological, which would usually be set out in a victim impact statement. (b) Based on the consideration of the foregoing offence-specific factors, the court should ascertain the gravity of the offence and then place the offence within any of the following three bands … (c) Finally, the court should also consider the aggravating and mitigating factors that relate to the offender generally but which are not offence-specific (ie,offender-specific factors). … 96 The sentencing bands for offences under s 354(1) of the Penal Code were as follows (Kunasekaranat [49]): (a)Band 1: less than five months’ imprisonment; (b)Band 2: five to 15 months’ imprisonment; and (c)Band 3: 15 to 24 months’ imprisonment.",
        "Offence-specific factors": "Degree of sexual exploitation 97 In relation to both the third and fourth charge, the degree of sexual exploitation was low. 98 For the third charge, the appellant pinched PW2’s nipple over his t-shirt.81Foot Note 81×GD at [68], ROA at p 550.A male’s nipple is generally not regarded as a private part, and there was no skin-to-skin contact. 99 Similarly, for the fourth charge, which concerned the appellant squeezing PW2’s buttock near the anus region, the offence lasted only for about one to two seconds,82Foot Note 82×Transcripts (Day 2), p 46 at line 18; ROA at p 198.and there was no skin-to-skin contact as PW2 was wearing pants at the material time. Circumstances of the offence 100 As for the circumstances of the offence, there was no evidence of premeditation, as the acts were committed in a short span of time and occurred as PW2 happened to be physically proximate to the appellant. Furthermore, while I noted that the offences took place abruptly such that PW2 could not react to the appellant’s action, such opportunistic behaviour was not unique to the appellant’s case, and was a common element in most OM cases. Hence, I did not regard this aspect of the appellant’s behaviour as aggravating. 101 Nonetheless, the appellant, being the superior of PW2, was in a position of responsibility towards PW2. Instead of exercising responsibility towards PW2, the appellant abused his position, and took liberties with intruding PW2’s personal space on at least two occasions (forming the substance of the third and fourth charges). In this regard, deterrence was clearly relevant, given the difficulty of detection of such offences committed in the workplace, where the subordinates may be wary of speaking out against such untoward conduct of their superior. The requirement to deter such conduct is particularly apposite in this case as the victim (PW2) was a full-time national serviceman, serving his national service liability, and who therefore had little mobility and choice as regards his choice of workplace and superiors. Therefore, I found that the appellant’s abuse of his position of trust vis-à-vis PW2 was an aggravating factor. Harm caused to the victim 102 As regards the harm caused to the victim, while the Prosecution tendered a victim impact statement of PW2 stating that he became “miserable” and “extremely uncomfortable”, and that he “began losing trust” in people after the incident, the trial judge had found that the victim impact statement was exaggerated.83Foot Note 83×GD at [70], ROA at p 550.I accepted the trial judge’s conclusion on this. Given that the degree of sexual exploitation was relatively minor, the degree of harm caused to PW2 was not likely to be severe. Offences fell within Band 1 103 Given the low degree of sexual exploitation, the presence of one aggravating factor (the abuse of a position of trust), and as there was no serious harm caused to PW2, I found that both the offences in the third and fourth charge fell within the lower end of Band 1 of theKunasekaranframework.",
        "Offender-specific factors": "104 I found that there were no mitigating factors in favour of the appellant. However, at least some weight ought to be given to the aggravating factor that the appellant was a senior law-enforcement officer, of whom higher standards may reasonably be expected.",
        "The sentence for the third and fourth charges": "105 InPublic Prosecutor vMazlan(SC-910871-2015) (“Mazlan”),84Foot Note 84×See GD at [52(f)]; ROA at p 544.the offender was convicted after trial on four charges under s 354(1) of the Penal Code for offences committed against his 14-year-old step-daughter. The first charge was for the offender using his hand to squeeze the left side of her buttocks, while the second charge was for using his hand to squeeze her buttock cheeks. The fourth charge was for using his hand to stroke her right buttock area. The third charge was more egregious, and involved him touching her body from her breast to the groin area. 106 The district judge inMazlanapplied the sentencing bands inKunasekaran, and sentenced the offender to three months’ imprisonment for the first, second and fourth charges, and a term of eight months’ imprisonment for the third charge. The total sentence was 11 months’ imprisonment. 107 Two offence-specific aggravating factors were apparent inMazlan, namely the abuse of a position of trust and the exploitation of a young, vulnerable victim. However, as regards the first, second and fourth charges, the degree of sexual exploitation was relatively low. 108 In relation to the third charge in this case, the degree of sexual exploitation was low and there was only one aggravating factor (the abuse of a position of trust). While higher standards may be expected of a law-enforcement officer, I did not think that the sentence of four months’ imprisonment imposed by the trial judge was commensurate with the culpability of the appellant. This was especially so because, as the trial judge observed, “Mazlan’scase … involved a graver betrayal of trust and multiple offences against the 14-year-old step-daughter” (GD at [73]). Accordingly, I reduced his sentence for the third charge to 12 weeks’ imprisonment. 109 As for the fourth charge, given that the appellant’s sentence was lower at ten weeks’ imprisonment, I did not find the trial judge’s sentence manifestly excessive, and accordingly did not disturb it. 110 I also did not disturb the trial judge’s holding that the sentences of the third and fourth charge, which were committed against the same victim, were to run concurrently. This, in my view, was in order with the overall gravity of the appellant’s offending, and would send a sufficiently deterrent message. 111 As a result, the appellant’s aggregate sentence was reduced from 16 months’ and nine weeks’ imprisonment to 12 weeks’ imprisonment. Given that he had long out-served his sentence by the time the appeal was heard, I ordered his release immediately.",
        "Conclusion": "112 This was a troubling case. On one hand, it is important to deter unsolicited encroachment of another person’s private space. On the other hand, the law mandates that the appellant must have had knowledge that his acts would likely outrage his victims’ modesty. This was a vital requirement, and failure to prove this was fatal to some of the convictions against the appellant. Hence, it was necessary to undertake a laborious process to determine whether the objective circumstances, considered against the appropriate context, would have been sufficient to imbue in the appellant with such knowledge. As is often emphasised, the Prosecution bears a weighty burden of proving each element of the charge beyond reasonable doubt. Since the Prosecution had failed to prove the first, second, fifth and sixth charges to such a degree, I was duty bound to acquit the appellant on those charges. Chan Seng OnnJudge Mahmood Gaznavi s/o Bashir Muhammad and Khadijah Yasin (Mahmood Gaznavi & Partners) for the appellant;Nicholas Lai Yi Shin (Attorney-General’s Chambers) for the respondent."
    }
}