{
    "case_title": "Pegaso Servicios Administrativos SA de CV and another vDP Offshore Engineering Pte Ltd and another",
    "ncitation": "[2019] SGHC 47",
    "coram": "Mavis Chionh JC",
    "sections": {
        "Introduction": "1 This was an action brought by the plaintiffs against the defendants for the return of a sum of US$2m. This sum had initially been paid by the first plaintiff to the first defendant as a deposit under a Rig Purchase Agreement for two rigs, pending the eventual execution of another set of contracts which would set out the terms in relation to the construction of the rigs (“the Shipbuilding Contracts”). The Shipbuilding Contracts, however, were never executed; and the sum of US$2m was to be used instead as part of the acquisition price of certain Mexican companies that were owned by the second defendant. But this proposed investment did not bear fruit either, and the plaintiffs commenced the present action to seek the return of the sum of US$2m. 2 At the conclusion of the trial, I gave judgment for the plaintiffs in the sum of US$2m with interest to run at 5.33% per annum from the date of the writ. As the defendants have filed an appeal, I set out below the grounds for my decision.",
        "The parties": "3 The first and second plaintiffs, Pegaso Servicios Administrativos S.A. de C.V. and Tendedora de Empresas, S.A. de C.V., are companies incorporated in Mexico and are involved in business in the oil and gas industry. They are part of a group of companies known as “Grupo Pegaso”.1Foot Note 1×Statement of claim, paras 1–3.At all material times, the plaintiffs were represented by Mr Alejandro Orvañanos (“Mr Orvañanos”), who was also the plaintiffs’ sole factual witness in the trial. For the purposes of the trial, the plaintiffs also engaged a foreign law expert to testify on the issue of the formation of contracts under Mexican law, Mr Jaime Inchaurrandieta Sanchez Medal (“Mr Sanchez Medal”).2Foot Note 2×Plaintiffs’ closing submissions, para 5. 4 The first and second defendants, DP Offshore Engineering Pte Ltd and PACC Offshore Services Holdings Limited, are companies incorporated in Singapore and engaged in the business of constructing and operating vessels, including oil rigs, for use in the oil and gas industry. Both defendants are part of a group of companies known as the “Kuok Group”.3Foot Note 3×Statement of claim, paras 5 and 7; Defence, paras 3 and 5.In turn, the second defendant owned shares in two subsidiaries, Servicios Maritimos Gosh, S.A.P.I. de C.V., which was known to the parties as “SMG” or “GOSH”, and Servicios Maritimos Posh, S.A.P.I. de C.V., known to the parties as “SMG2”, “SMP” or “POSH”. These subsidiaries later became the subject of the plaintiffs’ proposed investment once the rig purchase project fell through. For the sake of clarity, I shall refer to the two subsidiaries as “GOSH” and “SMP”, although I should note that the parties frequently referred to the subsidiaries by their other names. 5 During the relevant transactions, the defendants were represented by Captain Gerald Seow (“Capt Seow”) and Mr Jose Luis Montalvo, whom the parties referred to as “Pepe”. Only Capt Seow, however, was called by the defendants as a factual witness during the trial. Like the plaintiffs, the defendants also called an expert in Mexican law, Mr Francisco Gonzalez de Cossio (“Mr Gonzalez”).4Foot Note 4×Plaintiffs’ closing submissions, para 6. 6 The dispute between the parties centred around the circumstances in which the sum of US$2m had been paid and whether, in these circumstances, the said sum ought to be returned to the plaintiffs. I shall begin by setting out the salient facts in some detail, as they are necessary in order to understand the specific points of dispute between the parties.",
        "Background facts": "",
        "Events leading to the signing of the Rig Purchase Agreement": "7 In 2013, the second defendant was involved in certain businesses in the oil and gas industry in Mexico. It had entered into a joint venture with three other Mexican companies and incorporated a joint venture company known as “GOSH”. GOSH owned six vessels that it chartered to one Oceanogafia S.A. de C.V. (“OSA”) which were then sub-chartered to the national oil company of Mexico, “PEMEX”. The second defendant funded the purchase of the vessels and took security over them. 8 In May 2013, the second defendant and OSA experienced tensions in their working relationship due to OSA’s failure to make certain payments. Sometime in May 2013, Grupo Pegaso was invited by a Mexican governmental agency to attend a meeting. Grupo Pegaso was represented at the meeting by Mr Orvañanos and the chairman of Grupo Pegaso, Mr Alejandro Burillo Azcarraga (“Mr Burillo”).5Foot Note 5×AEIC of Mr Orvañanos, paras 3–6.Also at the meeting was Pepe, as the “liaison”6Foot Note 6×AEIC of Capt Seow, para 8.of the second defendant. It was alleged by Mr Orvañanos that at that meeting, Pepe explained the situation to him and suggested that Grupo Pegaso might be able to replace OSA as the defendants’ business partners. Pepe also suggested that Grupo Pegaso invest in two rigs that were being constructed by the first defendant and charter those rigs to PEMEX.7Foot Note 7×EIC of Mr Orvañanos, para 9. 9 Following the meeting, Mr Orvañanos met with Capt Seow, who represented the first defendant, in Singapore in August 2013. The parties exchanged comments on the draft Rig Purchase Agreement throughout August 2013 and on 29 August 2013, one Mr Tang Ying Kee of the first defendant (“Mr Tang”) sent Mr Orvañanos the basic technical specifications of a CJ-46 Jack-Up Rig, which was the type of rig that was to be built.8Foot Note 8×1AB185. 10 On 30 August 2013, Capt Seow followed up on Mr Tang’s email with his own comments about the specifications of the rigs which were to be included in the Rig Purchase Agreement. This email formed the basis of the plaintiffs’ allegation of misrepresentation and thus it is helpful to set out the relevant parts of the email in full:9Foot Note 9×1AB338. My company lawyer has not had a look at this yet, but she is copied in. On the “Agreement to Purchase” [ie, the rig purchase agreement], we will include the general arrangement drawings, and the outline specifications [as] part of this agreement, hence, Buyer knows what it is getting for the purchase price. The GA drawings and the outline specifications were sent to you last night. Please understand that engineering is completed, and construction has already started. There is no room to make major changes. Minor changes could be effected, if it is brought up early on. We will also give you a draft of the “Rig Building Contract” in order that your lawyers will be able to review this. Pepe had previously submitted the specifications and drawings to Pemex, and Pemex [has] accepted the specifications. The CJ46 Jackup rig design is well proven, and standards well accepted in the market, and Pemex is familiar with the rig. Therefore we are confident acceptance by Pemex is not an issue. When you are ready to begin contractual terms in earnest, we will also provide you a copy of the detailed design specifications. … 11 On the same day, Mr Orvañanos and Capt Seow signed the Rig Purchase Agreement on behalf of the first plaintiff and the first defendant respectively.10Foot Note 10×AEIC of Capt Seow, pp 55–57.The Rig Purchase Agreement provided that the first plaintiff would purchase two rigs from the first defendant and that a deposit of US$1m would be paid to the first defendant for each rig, for a total sum of US$2m. The Rig Purchase Agreement also provided that the parties would endeavour to enter into the subsequent Shipbuilding Contracts, although it made provision for the possibility that the Shipbuilding Contracts would not be executed. The relevant clauses, which I reproduce here, provided in essence that the deposit would only be forfeited by the first defendant if the failure to execute the Shipbuilding Contracts could be attributed to the first plaintiff: 1. Purchase of Vessels … 1.2 The specifications of the Vessels are attached hereto. [The first plaintiff] shall review the specifications and advise the [first defendant] of any changes that it requires no later than 13 September 2013. The [first defendant] shall notify [the first plaintiff] by 16 September 2013 if it can or cannot comply with such changes to the specifications, or if the [first defendant] is able to comply but by varying the key terms. If the [first defendant] cannot comply with such changes to the specifications or if the parties cannot agree on such variation to the key terms, then this Agreement will be terminated without penalty and the [first defendant] shall refund to [the first plaintiff] the Vessel Deposit paid under clause 2.2 by 20 September 2013. 2. Deposit 2.1 [The first plaintiff] shall pay to [the first defendant] a sum of US$1,000,000 for each Vessel … 2.2 The Vessel Deposit shall be applied towards the first instalment under the relevant Shipbuilding Contract to be entered into between the [first plaintiff] and the [first defendant] for each Vessel in accordance with the terms herein. In the event that the Shipbuilding Contract is not entered into for a reason attributable to [the first plaintiff], the Vessel Deposit shall be forfeited by [the first plaintiff] and the [first defendant] shall be entitled to retain the Vessel Deposit paid hereunder. 3. Execution of Shipbuilding Contract 3.1 The parties shall endeavour to execute the relevant Shipbuilding Contract for each Vessel by 6 October 2013 and in any event no later than 16 October 2013 3.2 In the event that the Shipbuilding Contracts for the Vessels are not executed by the dates mentioned in clause 3.1 above, then this Agreement shall terminate immediately, the Vessel Deposit will be forfeited as provided for in clause 2.2 only in the event that the non execution is attributable to GP.",
        "Events leading to the failure to execute the Shipbuilding Contract": "12 Following the execution of the Rig Purchase Agreement, the parties continued to negotiate the terms of the Shipbuilding Contracts. On 3 September 2013, Capt Seow sent the draft Shipbuilding Contracts to Mr Orvañanos for his comments.11Foot Note 11×1AB424.Mr Orvañanos replied, stating that he had sent the drafts to the legal counsel of the plaintiffs for review, and that Capt Seow would be kept informed regarding any progress as well as with their questions and comments.12Foot Note 12×1AB500.It was not disputed that there was no direct reply to this email, in the sense that Mr Orvañanos did not send back the draft Shipbuilding Contracts with any appended comments or edits, although his evidence was that he had given feedback to both Pepe orally and to Capt Seow by way of subsequent emails in November 2013, in which he addressed certain issues relating to the terms upon which the Shipbuilding Contracts would be entered into (see [17]–[18] below). 13 On 10 September 2013, the actual specifications of the rigs to be built were sent to Mr Orvañanos, which is to be contrasted with the basic specifications that had previously been sent by Mr Tang (see [9] above). Upon receipt of the specifications, Mr Orvañanos asked Capt Seow for additional time to review the specifications, because although the Rig Purchase Agreement envisaged that the first plaintiff would review the said specifications and revert to the first defendant by 13 September 2013, the actual specifications were sent to Mr Orvañanos far too close to the deadline. Capt Seow acceded to this request, extending the deadline for the review of the specifications of the rigs to 24 September 2013.13Foot Note 13×2AB780–781. 14 This delay in sending the specifications also had an impact on the subsequent deadlines under the Rig Purchase Agreement, in particular the deadline for the execution of the Shipbuilding Contracts, which was 6 October 2013 subject to a long-stop deadline of 16 October 2013 (see cl 3.1 at [11] above). Thus, on 26 September 2013, Capt Seow agreed to extend the deadline for the execution of the Shipbuilding Contracts from 16 October 2013 to 30 October 2013.14Foot Note 14×2AB956. 15 In addition, during this period, the first plaintiff began to look for a partner who was willing to provide funds for the first plaintiff’s purchase of the rigs. A company known as Perforadora Latina (“CP Latina”) expressed interest in funding the purchase15Foot Note 15×AEIC of Mr Orvañanos, para 35.and thus representatives from CP Latina visited the shipyard where the rigs were being constructed on 24 September 2013 in order to ascertain whether it was willing to fund the purchase of the rigs. The construction of the rigs, however, was not satisfactory to CP Latina for a variety of reasons. In order to assuage its concerns, CP Latina requested a formal inspection and the commissioning of a report by a marine surveying company known as Noble Denton. It appears that CP Latina’s need for a formal report also contributed to the extension of the deadline for the execution of the Shipbuilding Contracts. 16 Noble Denton issued its report on 17 October 2013. The findings in the report were not entirely favourable to the first defendant, highlighting in particular that the construction of the rigs might not be completed on time and that the rigs as constructed might not be to PEMEX’s specifications.16Foot Note 16×AEIC of Mr Orvañanos, para 49.CP Latina decided not to participate in the rig purchase project. Mr Orvañanos then requested from Capt Seow and was granted an additional extension of the deadline for the execution of the Shipbuilding Contracts, this time until 31 December 2013.17Foot Note 17×AEIC of Mr Orvañanos, para 52; AEIC of Capt Seow, para 23. 17 On 7 November 2013, Mr Orvañanos met Pepe to discuss the progress towards the Shipbuilding Contracts, which discussion was summarised in an email that Pepe sent to Capt Seow later that day.18Foot Note 18×2AB1456.According to the email, Pepe informed Mr Orvañanos during the discussion that the defendants had an “interesting offer by a third party to buy the two platforms [ie, the rigs]” and that the rigs could, at any time, be sold to this third party. In response to this, Mr Orvañanos stated that the first plaintiff was willing to finalise the Shipbuilding Contracts if the first defendant was willing to address the concerns that it had regarding the construction of the rigs up to that point, which were presumably the same concerns that had been revealed by the Noble Denton report. In particular, Mr Orvañanos was said to have proposed the following conditions: (a) that there would be a discount of US$5m on the purchase price of each rig, for a total discount of US$10m; (b) that the issues in the Noble Denton report relating to the quality of the rigs and the time of delivery would need to be addressed; and (c) that any penalties that PEMEX would impose on the first plaintiff for any late delivery would be borne by the first defendant. 18 On 13 November 2013, Mr Orvañanos wrote directly to Capt Seow by email, proposing the same conditions that Pepe had already informed Capt Seow about in the email of 7 November 2013. Mr Orvañanos sought Capt Seow’s comments on the proposal and confirmed that the first plaintiff had “immense interest and responsibility towards this project”.19Foot Note 19×2AB1458. 19 I should note at this point that the meeting of 7 November 2013 and the email of 13 November 2013 formed a large part of the dispute between the parties. As will be elaborated on below, I found that Capt Seow never replied to this email. The defendants took the position that any silence on his part was indicative of a rejection of the proposal, especially because the terms proposed were, in Capt Seow’s words, “ridiculous”. In contrast, the plaintiffs’ position was that Capt Seow’s silence meant that he had failed to take the appropriate steps towards the execution of the Shipbuilding Contracts. The plaintiffs also relied on the discussion on 7 November 2013 and the email of 13 November 2013 as constituting the “feedback” that Mr Orvañanos gave to Capt Seow and/or Pepe in relation to the draft Shipbuilding Contracts sent on 3 September 2013 (see [12] above). 20 Turning back to the negotiation of the Shipbuilding Contracts between the parties, on 27 December 2013, Mr Orvañanos emailed Capt Seow, suggesting that they meet to find a way to move forward with the negotiations. Capt Seow replied on 30 December 2013, stating that his schedule had not been finalised and that if Mr Orvañanos planned to travel to Singapore to meet, it would be best done “before 20th Jan, or after 1st week of March”.20Foot Note 20×2AB1462.It is noteworthy that even though the deadline for the execution of the Shipbuilding Contracts was 31 December 2013, which was the very next day, Capt Seow made no mention of this and appeared willing to discuss the matter in January 2014, at which time the deadline for the execution of the Shipbuilding Contracts would have passed. 21 Mr Orvañanos and Capt Seow eventually met on 24 January 2014. While the parties dispute what precisely was said during this meeting, it was clear that after this meeting, both Mr Orvañanos and Capt Seow were aware that the Shipbuilding Contracts would no longer be executed and that both parties would move on from this project. In particular, Mr Orvañanos took the position that during the meeting, Capt Seow had assured him that the US$2m deposit could be put into another investment, this time with the second defendant, either by the plaintiffs investing in its subsidiaries directly or in a vessel that was owned by the second defendant through its subsidiaries.21Foot Note 21×AEIC of Mr Orvañanos, para 57.",
        "Proposed investment into Mexican companies owned by the second defendant": "22 In the months following the meeting in January 2014, the parties negotiated a potential investment by the second plaintiff in one of the Mexican companies owned by the second defendant, GOSH or SMP, or in a vessel owned by the second defendant through these subsidiaries. In particular, in April 2014, Mr Orvañanos and the 2nd  defendant’s employee Mr Jeffrey Phang (“Mr Phang”) began discussing the details pertaining to a term sheet, which was to be a precursor to the final investment by the plaintiffs into either GOSH or SMP – or both.22Foot Note 22×AEIC of Mr Orvañanos, para 83. 23 By the beginning of July 2014, it appeared that the draft term sheet was close to being finalised. On 9 July 2014, Mr Orvañanos and Capt Seow had an oral conversation about the detailed terms of the investment. While there was no contemporaneous record of what had been raised by both parties during this conversation, it appears that Capt Seow had stated, or at least intimated, that the US$2m deposit that had been paid pursuant to the Rig Purchase Agreement could be used to offset part of the acquisition price of whichever company the plaintiffs eventually chose to invest in. This can be seen from an email that was sent by Mr Granada Ramirez Diego Julian (“Mr Ramirez”) of the plaintiffs to Mr Phang later that day, referencing the conversation between the two, albeit in passing:23Foot Note 23×5AB3104. … We also included a wording [in the term sheet] that specifies that the US$2m that Pegaso paid in advance for the Jackups will be credited for this deal. This is related with a conversation Alejandro [ie, Mr Orvañanos] had with one of your principals … While Mr Ramirez does not specifically refer to Capt Seow, it was not disputed that the reference to “one of [the defendant’s] principals” who spoke to Mr Orvañanos was a reference to Capt Seow. 24 On 10 July 2014, Mr Phang replied to this email. He explained that the proposed inclusion of such a term in the term sheet would not be feasible, because while SMP was the subject of the proposed investment, it was not a party to the initial Rig Purchase Agreement pursuant to which the US$2m deposit had been paid. However, Mr Phang expressed his confidence that the $2m would still be returned, albeit upon the satisfaction of two conditions:24Foot Note 24×5AB3103–3104. The US$2 million paid to the Shipyard for the jack-up rigs was paid to PaxOcean. However, as POSH is a separate public listed entity, and does not own PaxOcean, POSH cannot give a credit for the advance of US$2 million. POSH cannot be a part of any agreements regarding the deposit. a. On the other hand, management is willing to return the payment for the US$2 million made to PaxOcean with the following condition: i. That Grupo Pegaso becomes a partner in SMP. ii. Upon the sale of the jack-up rig to a third party, and full payment is received from the third party. b. For your info, PaxOcean has recently concluded the sale of the jack up rigs, and the vessel is supposed to be launched in September. c. We are expecting the full payment to be received in September. As can be seen from the extract, the two conditions were that the plaintiffs had to invest in SMP and that the rigs, which were previously to be bought by the first plaintiff, would have to be sold to a third party and full payment received. 25 Mr Orvañanos replied on the same day, acknowledging the difficulty and asking Mr Phang how the latter wished to “document the return of the US$2MM” in the light of the difficulty that had been raised. Mr Phang proposed that, subject to confirmation, the parties could “perhaps sign a side letter between Grupo Pegaso and PaxOcean”,25Foot Note 25×5ABB3103.to which Mr Orvañanos agreed and asked Mr Phang to inform him if there were further updates.26Foot Note 26×5AB3103. 26 On 11 July 2014, Capt Seow sent an email to Mr Orvañanos, apparently providing the update that had been sought by Mr Orvañanos’ previous email, and expressed the defendants’ position as follows:27Foot Note 27×5AB3117. Dear Alejandro, I refer to your request for the refund of the $2 million deposit paid to DPOE (DDW Paxocean Engineering) last year, and forfeited due to non-completion of the sale of the 2 x CJ46 drilling jackups. As a gesture of goodwill, I am pleased to advise that the Kuok Group will refund this deposit to Grupo Pegaso, when the 2 jackups are sold, and by way of an offset against the acquisition price of the shares of SMG2 or of one of the other Mexican companies. I am pleased to advise that the 2 Jackups have been sold, and we expect the stage payment to be received shortly. On this note, please understand that POSH is not the recipient of the of the deposit monies paid by Pegaso, and, as such we will need to properly structure this offset against the share acquisition price. … 27 I have set out the relevant parts of this email in full because it formed a critical plank of both parties’ cases. The plaintiffs contended that this email, coupled with the oral conversation of 9 July 2014, showed that there was a legally binding agreement between the parties to return the sum of US$2m, although I should note that the plaintiffs’ case was that despite the wording of this email, the successful sale of the rigs was not a condition precedent to the return of the deposit. In contrast, the defendants took the position that this email showed that any indication that they would refund the sum of US$2m was purely a gesture of goodwill and did not create any legally binding obligations. 28 Mr Orvañanos replied on the same day, thanking Capt Seow for his proposal and stating that the parties would “structure the refund as [Capt Seow] propose[d]”.28Foot Note 28×5AB3117. 29 Pursuant to this discussion, the term sheet relating to the second plaintiff’s investment was signed on 14 July 2014. The parties continued to discuss the details of the plaintiffs’ investment in the Mexican companies owned by the second defendant, this time relating to the purchase of a 35% interest in GOSH. On 27 August 2014, Mr Orvañanos had separate telephone conversations with both Pepe and Capt Seow in relation to the investment. The details of what Mr Orvañanos had discussed with Capt Seow were recorded in the following email that was later sent by Capt Seow to Mr Orvañanos:29Foot Note 29×5AB3690. Dear Alejandro, To recap our discussion today: 1. Posh is committed to build and develop its business in Mexico. 2. We are looking for a good and committed partner to grow and build this business with us. 3. The purchase price of the Gosh shares are equivalent to the market price of the vessels. 4. We need Pegaso to be firmly committed, not only in words, but also financially. 5. It is important that you feel comfortable about this, and something you have to judge for yourself, if this investment has good potential. 6. In this regard, I have committed that we will re-imburse the $2 million deposit for the jack-up rigs, irrespective whether Pegaso comes with Posh or not. 7. For us, the commitment of our partners, who we can trust to work together with us to overcome the short term problems, and to build the company is the most important. I look forward to receive your comments. 30 As regards Mr Orvañanos’ discussion with Pepe, it appears that Pepe had subsequently briefed Capt Seow on the contents of the discussion, which is why Capt Seow sent a follow-up email to Mr Orvañanos that same day, reassuring the latter that what was discussed with Pepe did not differ from the discussions as recorded in the earlier email:30Foot Note 30×5AB3726. Dear Alejandro, Pepe has given me a short brief regarding your meeting today. I need to clarify our conversation yesterday […] as the intention is not to exert pressure on Pegaso. In fact, it is the reverse. We want Pegaso to feel comfortable and clear in its choices. It is for this reason that I made it clear, and have given you the assurance that the refund of the $2 million will be made, irrespective whether Pegaso decides to acquire the shares of Gosh or not. … Therefore, we want Pegaso to decide whether an investment in Gosh on its own merits, i.e. whether it is good value, considering the price, potential for growth, the business climate, as well as the attendant risks attached. … 31 The plaintiffs relied on these emails from Capt Seow to Mr Orvañanos as evidence of a variation of the contract concluded on 9 or 11 July 2014 to the effect that the US$2m deposit would be returned regardless of whether the plaintiffs chose to invest in any of the Mexican companies. 32 Eventually, however, the plaintiffs decided to go ahead with the investment. On 29 August 2014, Mr Orvañanos, on behalf of the plaintiffs, made a proposal for the purchase of 35% interest in GOSH.Inter alia, the terms proposed were that the 35% interest in GOSH would be immediately purchased and that the acquisition price would be offset by using the US$2m deposit; the remaining terms would be as reflected in the term sheet dated 14 July 2014. 33 To the plaintiffs’ surprise, Capt Seow replied the same day rejecting the proposal as it did not “reflect the intrinsic value of the assets and its potential”. However, Capt Seow confirmed that the defendants would nevertheless reimburse the US$2m, which was in line with the position that had been expressed in the emails dated 27 August 2014:31Foot Note 31×5AB3731. As discussed, we will honour our commitment to reimburse Pegaso the $2 million of the non-refundable deposit that had been paid for the 2 units of CJ46 drilling rigs. I expect that the 1st unit will be delivered in Jan 2015 and the 2nd unit about mid 2015. The reimbursement of $1 million each will be concurrent with the delivery of each unit to the Buyers.",
        "Events leading to the commencement of the suit": "34 Pursuant to these emails, on 2 October 2014, Mr Orvañanos sent a draft refund agreement to Capt Seow.32Foot Note 32×5AB3751.In the draft agreement, it was first noted that the Rig Purchase Agreement had been terminated “without penalty to either party”. The draft agreement then proceeded to set out the terms of the refund:33Foot Note 33×5AB3753. (a) the US$2m deposit would be refunded in two tranches, one no later than 31 January 2015 and the other no later than 30 June 2015; and (b) if the refund was not timeously paid, interest would be levied at 12% per annum. 35 Capt Seow replied on the same day refusing to sign the draft refund agreement. In his view, there was “no need for another agreement” because he had already given his word on the matter, although he noted that the defendants were under no obligation to reimburse the plaintiffs. It is again helpful to set out the email in full:34Foot Note 34×AEIC of Capt Seow, p 325. Dear Alejandro, I have already given you my word on this matter, although we are under no obligation to do so. I have also mentioned this a few times in my emails. I believe this is good enough and there is no need for another agreement. We will pay you when each vessel is delivered and we receive payments from the Buyer. The first Jackup will be launched on 9th October. 36 Although the draft refund agreement was not signed, it appears that Mr Orvañanos proceeded on the basis that the two deadlines of January and June 2015 as mentioned in the draft refund agreement would apply. Thus, on 14 May 2015, when no such payment had been made by the defendants, Mr Orvañanos emailed Capt Seow once more to ask about the return of the US$2m deposit:35Foot Note 35×5AB3785. … The second issue has to do with the US$2MM refund, as confirmed in your August 29, 2014 email, POSH will refund the deposit on delivery of each of the rigs to the buyers. The original agreed payment dates (set out in your August 29, 2014 email) were January 2015 for the first USD 1 million deposit and mid-2015 for the second USD 1 million deposit. In your March 23, 2015 email to me, you stated that the buyer of the rigs had asked for up to a 9 month delay in the delivery date for the rigs. We noted so and agreed that the first deposit (USD 1 million) will be repaid by the end of September 2015 and that the second deposit (USD 1 million) will be paid by the end of March 2016. Now I ask you for a consideration, is there any way that we could have both refunds repaid by this upcoming august? We would greatly appreciate such a consideration to our understanding, and we could even contemplate some discount if necessary. 37 The context to this email is that on 23 March 2015, Capt Seow had informed Mr Orvañanos that the sale of the two rigs, which was originally slated for January and June 2015 (see the email reproduced at [33] above), would be delayed by up to nine months.36Foot Note 36×5AB3784.Thus, it appears from the email that Mr Orvañanos had taken the position that the deadlines for the two tranches of payments would similarly be extended by about nine months each, to September 2015 and March 2016 respectively. 38 In May and June 2015, Mr Orvañanos attempted to “re-confirm” with Capt Seow that the parties had an agreement in place by which the sum of US$2m would be repaid in two tranches in September 2015 and March 2016,37Foot Note 37×5AB3789.whereas Capt Seow repeatedly stated in his email replies that the defendants had offered to repay the sum of $2m even though it was not contractually obliged to do so.38Foot Note 38×5AB3788 and 3793. 39 On 17 February 2017, the plaintiffs filed the present suit seeking to recover the sum of US$2m.",
        "The parties’ cases": "",
        "Plaintiffs’ case": "40 The plaintiffs sought an order that the US$2m deposit be returned based on five alternative grounds. 41 First, the plaintiffs submitted that Capt Seow had made misrepresentations to the plaintiffs in his email of 30 August 2013, which induced the first defendant to enter into the Rig Purchase Agreement pursuant to which the sum of US$2m was paid. The alleged misrepresentations were the following:39Foot Note 39×Plaintiffs’ closing submissions, para 227. (a) that Pepe had provided the specifications of the rigs to PEMEX; (b) that PEMEX had accepted the specifications of the rigs; and (c) that the first defendant was confident that acceptance by PEMEX of the rigs and/or their specifications was not an issue. 42 Secondly, the plaintiffs contended that the US$2m deposit ought to be returned pursuant to the terms of the Rig Purchase Agreement, because under the agreement, the first defendant could only forfeit the deposit where the failure to execute the Shipbuilding Contracts was attributable to the first plaintiff.40Foot Note 40×Plaintiff’s closing submissions, para 91.On the present facts, the plaintiffs submitted that the non-execution was attributable instead to the first defendant. 43 Thirdly, the plaintiffs argued that the US$2m deposit should be returned because there was total failure of consideration. According to the plaintiffs, what the first plaintiff had bargained for under the Rig Purchase Agreement was the ability to purchase the rigs, which the first plaintiff had tried to complete but failed due to no fault of its own.41Foot Note 41×Plaintiffs’ closing submissions, para 283.The plaintiffs disagreed with Capt Seow’s evidence that the first plaintiff had received a benefit in the sense that the rigs had been reserved for the first plaintiff until 31 December 2013. 44 Fourthly, the plaintiffs contended that the parties had concluded a collateral contract pursuant to which the defendants were to return the US$2m deposit, either unconditionally or upon the fulfilment of certain conditions which had since been satisfied. The contract was said to have been concluded by way of the oral conversation on 9 July 2014 and the email of 11 July 2014 (see [23]–[27] above). 45 In relation to this argument, there was a preliminary issue of whether Mexican or Singapore law should apply to determine the existence of the collateral contract. The plaintiffs took the position that, pursuant to the three-stage choice of law test inPacific Recreation Pte Ltd v S Y TechnologyInc and another appeal[2008] 2 SLR(R) 491,42Foot Note 42×Plaintiffs’ BOA for closing submissions, Tab 11.Mexican law ought to apply because it had the closest and most real connection to the contract in terms of the place of contracting and of performance.43Foot Note 43×Plaintiffs’ closing submissions, para 123.The plaintiffs submitted that under Mexican law, consideration was not required44Foot Note 44×Plaintiffs’ closing submissions, para 142.and the term “gesture of goodwill” had no legal meaning,45Foot Note 45×Plaintiffs’ closing submissions, para 143; NE 23 August 2018 79:21–80:7.and thus, a legally binding contract had been concluded notwithstanding the fact that Capt Seow stated in the email dated 11 July 2014 that the defendants had offered refund the sum of US$2m as a gesture of goodwill.46Foot Note 46×Plaintiffs’ closing submissions, para 145. 46 Alternatively, the plaintiffs submitted that even if Singapore law applied, the phrase “gesture of goodwill” did notipso factomean that there was no intention to be legally bound. And while consideration was required under Singapore law, unlike Mexican law, the plaintiffs contended that they had given consideration to the defendants in the form of continued negotiations to invest into the second defendant’s Mexican companies47Foot Note 47×Plaintiffs’ closing submissions, para 196.as well as assisting the second defendant in its dealings with PEMEX and the Mexican authorities.48Foot Note 48×Plaintiffs’ closing submissions, para 197. 47 Under either Mexican or Singapore law, the plaintiffs’ primary case was that the promise to return was unconditional. Alternatively, even if the refund hadinitiallybeen conditional, this condition was later removed. In the plaintiffs’ submissions, the only condition was that the refund would be contingent upon the investment by the plaintiffs into the second defendant’s Mexican companies. This condition had been removed by the parties’ email correspondence on 27 August 2014, in which Capt Seow said that the refund would take place regardless of whether the plaintiffs invested in GOSH or SMP (see [29]–[30] above).49Foot Note 49×Plaintiffs’ closing submissions, para 157.The plaintiffs’ case is that the sale of the rigs did not constitute a precondition to the refund of the US$2m deposit because it was not mentioned in the 9 July 2014 oral conversation or the 11 July 2014 email; it was only a mechanism which the parties had intended to use to refund the sum.50Foot Note 50×Plaintiffs’ closing submissions, paras 221–222. 48 Finally, the plaintiffs submitted that Capt Seow’s two emails dated 27 August 2014 also constituted an acknowledgment and/or admission of debt, which was a separate legal basis upon which the US$2m deposit should be returned.51Foot Note 51×Plaintiffs’ closing submissions, paras 285–289.",
        "Defendants’ case": "49 The defendants submitted that none of the grounds alleged by the plaintiffs had been made out. First, in respect of the misrepresentation claim, the defendants took the position that the statements made by Capt Seow in the email of 30 August 2013 were not misrepresentations. In relation to the specifications that had been sent, the defendants said that Capt Seow was not referring to the actual specifications of the rigs in question, but rather basic specifications for a general CJ-46 rig. 50 Alternatively, the defendants submitted that there was no reliance on the representations to enter into the Rig Purchase Agreement; instead, the plaintiffs relied either on their own business judgment or were under an obligation themselves to present the actual specifications of the rigs to PEMEX.52Foot Note 52×Defendants’ closing submissions, paras 49 and 57.In the alternative, the defendants submitted that the first plaintiff had affirmed the Rig Purchase Agreement and had waived its right to rescind the same.53Foot Note 53×Defendants’ closing submissions, para 58. 51 Secondly, in respect of the claim under the terms of the Rig Purchase Agreement, the defendants contended that the failure to execute the Shipbuilding Contract was attributable to the first plaintiff. In particular, the defendants contended that the plaintiff had failed to respond with any questions or comments on the drafts emailed by Capt Seow to Mr Orvañanos on 3 September 2013. Alternatively, the defendants submitted that the failure to obtain funding from CP Latina was a cause attributable to the first plaintiff, as it had known that it needed funding but failed to obtain it.54Foot Note 54×Defendants’ closing submissions, paras 103–104; NE 21 August 2018, 31:22–32:5. 52 Thirdly, in respect of the claim that there had been total failure of consideration, the defendants contested this on the basis that the deposit was paid “as an earnest” for the first plaintiff’s performance of the Rig Purchase Agreement and as aquid pro quofor the first defendant reserving the rigs for it until 31 December 2013.55Foot Note 55×Defendants’ closing submissions, para 116. 53 Fourthly, in respect of the claim based on the alleged collateral contract, the defendants took the position that there was no such contract whether under Singapore or Mexican law, and alternatively, that the promise to refund was subject to two conditions, neither of which had been fulfilled. 54 On the preliminary question of the applicable law, the defendants submitted that the three-stage choice of law test did not apply where the existence of the contract was itself challenged; in such situations, the applicable law would be the “domestic contract law of the forum”, which was Singapore law.56Foot Note 56×Defendants’ closing submissions, paras 186–187.Applying Singapore law, the crucial element of consideration was not present in this case because the assistance given was unconnected with any promise to return the deposit, given that the plaintiffs had provided the said assistance to advance their own interests in Mexico.57Foot Note 57×Defendants’ closing submissions, para 200.In any event, applying either Singapore or Mexican law, the defendants submitted that no contract had been concluded. 55 Alternatively, even if a contract had been concluded, the defendants argued that any refund was subject to the following two conditions: (a) The first condition was that the plaintiffs had to enter into an investment with the defendants in relation to the Mexican companies; this condition had not been satisfied and was not removed by the emails of 27 August 2014 and 29 August 2014 (see [29]–[31] above), because Mr Orvañanos had rejected Capt Seow’s proposal to do so by way of emails dated 28 August 2014 and 29 August 2014. (b) The second condition was that the rigs had to be sold and full payment received by the defendants. This condition was also not satisfied.58Foot Note 58×Defendants’ closing submissions, para 181. 56 Finally, in respect of the argument on the acknowledgment of debt, the defendants submitted that Capt Seow’s emails on 27 August 2014 did not constitute a sufficiently clear and unequivocal admission.59Foot Note 59×Defendants’ reply submissions, para 55.",
        "Issues to be determined": "57 The following five issues arose for my determination. (a) First, whether Capt Seow had made misrepresentations in his email dated 30 August 2013 which induced the first plaintiff into entering the Rig Purchase Agreement, and thus whether the US$2m deposit, which was paid pursuant to this agreement, should be refunded. (b) Secondly, whether the first plaintiff was entitled under the terms of the Rig Purchase Agreement to the return of the US$2m deposit or whether the first defendant was entitled to forfeit the said deposit under the terms of the said Agreement. (c) Thirdly, whether the first plaintiff was entitled to the refund of the US$2m deposit on the basis of total failure of consideration. (d) Fourthly, whether the plaintiffs and defendants had validly concluded a collateral contract by way of the 9 July 2014 oral conversation and the 11 July 2014 email, under which the defendants were to refund the US$2m deposit to the plaintiffs, and whether there were any conditions attached to the refund of the said deposit. (e) Lastly, whether Capt Seow had, by his emails on 27 August 2014, acknowledged and/or admitted the existence of a debt of US$2m. 58 I ruled against the plaintiffs on the first, the fourth and the fifth issues, but held that they were entitled to judgement based on my findings in respect of the second and the third issues. As this is the defendants’ appeal against the judgement given in the plaintiffs’ favour, I will address only briefly the first, the fourth and the fifth issues before I explain the reasons for my findings on the second and the third issues.",
        "On the issue of alleged misrepresentation (the first issue)": "59 In respect of the plaintiffs’ claim for misrepresentation, I did not find this to be sufficiently proven on the evidence adduced before me. 60 In gist, the evidence – and in particular the email evidence – before me did not support a finding of any representation by Capt Seow that Pepe had sent PEMEX the actual specifications for the rigs themselves and/or that PEMEX had accepted these specifications. On the contrary, the objective email evidence appeared clearly to indicate that Capt Seow was not referring to the actual specifications of the rigs in question, but rather, basic specifications for a CJ-46 rig – and that Mr Orvañanos was aware of this. I found particularly pertinent Mr Orvañanos’ concession in cross-examination that Mr Tang had sent thebasicspecificationsto him the day before the signing of the Rig Purchase Agreement:60Foot Note 60×NE 21 August 2018, 21:14–22:11. Q. So you were asking YK Tang for the specs that had been given to Pemex; is that correct? A. Correct. Q. You received specifications from YK Tang on 29 August; correct? A. Correct. Q. Can you have a look at those specifications. … So you really had, as of 30 August 2013, no doubt that what you were talking about was basic specs for a CJ46-type rig; do you agree with me? A. Yes. 61 Mr Tang’s email to Mr Orvañanos expressly stated that he was sending the latter “the basic Specs and GA Plans for our CJ46 jackup drill rig”. In his email to Mr Orvañanos on 30 August 2013, Capt Seow clearly referenced the “GA drawings and the outline specifications” forwarded by Mr Tang to Mr Orvañanos, adding:61Foot Note 61×1AB318. When you are ready to begin contractual terms in earnest, we will also provide you a copy of the detailed design specifications. 62 As to Capt Seow’s statement in this 30 August 2013 email about acceptance by PEMEX not being an issue, having regard to the totality of the evidence, I accepted the defendants’ explanation that what Capt Seow meant was that PEMEX had previously accepted rigs of similar design, PEMEX were in fact operating such rigs, and there was thus no objective reason from a technical standpoint for PEMEX to reject the same CJ-46 rigs on this occasion (subject to the caveat about the plaintiffs having enough political muscle to push the deal through, etc). This interpretation was borne out by the parties’ subsequent correspondences, in which Capt Seow stated on numerous occasions that he would send Mr Orvañanos theactualdetailed specificationsfor the rigs. Thus, for example, in his email of 7 September 2013 to Mr Orvañanos, Capt Seow stated:62Foot Note 62×1AB750. We will send you the detailed specifications. I believe you will need to present to Pemex asap, so that we can try to incorporate any changes required by Pemex if possible. You will probably need our technical team, engineers to be with you when you meet with Pemex, pls let me know. 63 If indeed the plaintiffs had been informed before 30 August 2013 that the detailed specifications for the rigs had already been given to – and accepted by – Pemex, one would have expected Mr Orvañanos immediately to query Capt Seow about the above remarks. Tellingly, he did not. 64 In any event, I also found that Capt Seow’s remark about acceptance by PEMEX not being an issue was a statement of opinion rather than a statement of fact; further, that even assuming the representation was that Capt Seow himself believed that the actual rigs would be accepted, the plaintiffs had not adduced sufficient evidence to satisfy me that he did not genuinely hold this belief (and thus that the representation was false). 65 I also found that even assuming for the sake of argument that the first defendant had represented that the actual detailed specifications for the rigs had been provided to and accepted by Pemex prior to 30 August 2013, the evidence did not support a finding that the 1st plaintiff relied on such representation in deciding to sign the Rig Purchase Agreement. It was revealing that when asked why he had not sought to query Capt Seow about his 7 September 2013 email (see [62]), Mr Orvañanos said that this was because the first plaintiff’s “strategy” was to “see for [themselves]” and to seek “personal” confirmation from Pemex that it had “indeed, received and accepted” the detailed specifications.63Foot Note 63×NE 21 August 2018, 24:17–26:13.That the first plaintiff had this “strategy” plainly indicated that it could not have genuinely believed that Pemex had received and accepted the detailed technical specifications for the rigs before the signing of the Rig Purchase Agreement. 66 Indeed, far from relying on any representation by the 1st defendant of Pemex’s supposed approbation of the detailed technical specifications for the rigs, the contemporaneous email evidence showed that the 1st plaintiff was aware it was responsible for seeking Pemex’s approval of these technical specifications. Thus, for example, as the defendants pointed out, in an email to Capt Seow on 10 October 2013, Mr Orvañanos himself had spoken of the plaintiffs needing “to go to Pemex and show them the specs and the report for their blessing”. Asked what he meant by obtaining Pemex’s “blessing”, Mr Orvañanos stated that this meant getting Pemex to “approve the specifications”. In the same portion of his cross-examination, he also conceded that the 1st plaintiff was responsible for obtaining this “blessing”:64Foot Note 64×NE 21 August 2018, 59:9–60:6. Q. … (P)lease let her Honour know if you agree or disagree, under the circumstances it was Pegaso that was responsible for obtaining Pemex’s blessing: do you agree or disagree? A. I agree. ….. Ct. Sorry, when you talk about obtaining Pemex’s blessing, this is Pemex’s blessing for what exactly? A. That they approve the specifications. Blessing in Spanish is, sort of, like, approving, accepting. 67 For the reasons set out above, I found against the plaintiffs in respect of their claim in misrepresentations.",
        "On the issue of an alleged collateral contract (the fourth issue)": "68 In respect of the plaintiffs’ claim based on a collateral contract to return the US$2m, I also did not find this proven on the evidence adduced before me. 69 As indicated earlier (at [45]), the defendants denied the existence of any such collateral contract. A preliminary issue arose, therefore, as to whether Mexican law or Singapore law should be applied in determining whether such a collateral contract was formed. The plaintiffs submitted that Mexican law should be applied. I did not agree with their submission. In gist, my reasons were as follows. 70 Firstly, as the defendants pointed out, the cases replied on by the plaintiffs in making the above submission (chiefly,Las Vegas HiltonCorp (trading as Las Vegas Hilton) v Khoo Teng Hock Sunny[1996] 2 SLR(R) 549 (“Las Vegas Hilton”)andPacific RecreationPte Ltd v S Y Technology Inc and another appeal[2008] 2 SLR(R) 491 (“Pacific Recreation”)) were cases where the issue of whether a contract had been formed was not itself in contention – unlike the present case. InLas Vegas Hilton, there was no dispute as to the existence of an agreement between the parties, which was for the plaintiff to grant the defendant a USD 1 million credit facility. Instead, in the suit brought by the plaintiff in the Singapore High Court to recover balance sums repayable by the defendant, the dispute was over the place where the contract to grant credit facilities was made, the proper law of the contract, and whether the contract was enforceable in Singapore law. This was because whereas the plaintiff contended that the contract was made in Las Vegas and governed by Nevada law, the defendant contended that the contract was made in Singapore, that the proper law was Singapore law, and that the contract should accordingly be held to be void because it was a contract to game, and such contracts offended public policy in Singapore. In respect of the question of the proper law of the contract for credit facilities, Chao J (as he then was) held that the court had to first consider whether the parties had “in terms in their agreement expressed what law they intend to govern”; failing which “the court has to impute an intention, or to determine for the parties what is the proper law which, as just and reasonable persons, they ought or would have intended” (see at [41] ofLas Vegas Hilton). 71 InPacific Recreation, the dispute between the parties was over whether the Deed of Indemnity executed in the respondent’s favour by the appellant PRPL, another company PAPL, and their founder Mr Lee, was governed by Chinese law or by Singapore law. The appellant, PAPL and Mr Lee, argued that the Deed was governed by Chinese law, and that it was invalid because it had been entered into pursuant to an earlier contract which was void under Chinese law. The respondent argued that the Deed was governed by Singapore law. What all parties were agreed on, however, was that the Deed existed. For this reason, it made sense for the court considering the governing law of the Deed to apply the three-stage test propounded in cases such asOverseas Union Insurance Ltd vTuregum Insurance Co[2001] 2 SLR(R) 285. In the first stage of this test, the court examined the contract itself to determine whether it stated expressly what the governing law should be. In the absence of an express provision, the court considered whether the parties’ intention as to the governing law could be inferred from the circumstances. If this could not be done, the third stage was to determine with which system of law the contract had “its most close and real connection” – and that system would “be taken, objectively, as the governing or proper law of the contract” (see at [38] ofPacific Recreation). 72 Having regard to the formulation of the three-stage test, it would not make sense to apply the test in a case where one party denies altogether the existence of any agreement. In such a case, it would be illogical to apply the first stage of the test and to look at what the express provisions of the contract say – since one party disputes that there is any contract to look at. Nor would it make sense to apply the second stage of the test and to ask whether the parties’ intention as to the governing law of the contract can be inferred from the circumstances. Indeed, there is nothing in the judgements inLas Vegas HiltonandPacific Recreationto suggest that where the very existence of a contract is disputed, the appropriate system of law to apply in addressing that dispute may be discerned by the court leapfrogging the first two stages of the three-stagePacific Recreationtest to apply the third stage. 73 From the (admittedly insubstantial) case law available, it would appear that judicial views have been divided as to whether thelexfori(seeOceanic Sun Line Special Shipping CoInc v Fay[1988] 79 ALR 9 at 55) or the “putative proper law” test (seeTheParouth[1982] 2 Lloyd’s Rep 351 at 353) should apply in considering whether a contract has been formed. As I indicated in delivering oral judgement, I favoured the application of thelexforiin a case like the present, where the existence of the entire contract is disputed, since it seemed to me to avoid the circularity of the “putative proper law” test which “assumes that a contract has been formed, and then determines the proper law on that basis in order to determine whether the contract has been formed” (Professor Yeo Tiong Min, S.C,Private International Law: Law Reform in Miscellaneous Matters(unpublished).65Foot Note 65×Defendants’ BOA for closing submissions, Tab 19, at para 194.To this finding I would add two other observations. First, I did not think an application of the “putative proper law” test would have led me to a different view about the applicability of Singapore law.Inter alia, I noted that in both the Rig Purchase Agreement and the draft Shipbuilding Contract, it was stipulated that the governing law would be Singapore law: see in this respect clause 4.1 of the former and clause 18.1 of the latter.66Foot Note 66×AEIC of Mr Orvañanos, pp 145 & 200 respectively.Given that parties had negotiated the Rig Purchase Agreement and contemplated the execution of the draft Shipbuilding Contract with reference to Singapore law as the governing law, I considered that if it came to deciding the putative proper law of an alleged collateral contract for the return of the rig deposits paid pursuant to the Rig Purchase Agreement, that putative proper law would in all probability be Singapore law. 74 Secondly, and more importantly, having examined the evidence, my factual findings in relation to the plaintiffs’ claim of a collateral contract would have been the same whether Singapore law or Mexican law applied. Both the plaintiffs’ and the defendants’ Mexican law experts were in agreement that in order for a contract to be formed under Mexican law, an essential element was “consent”, “the agreement of will between two parties”,67Foot Note 67×AEIC of Mr Jaime Inchaurrandieta Sanchez Medal, p 14; AEIC of Mr Franciso Gonzalez de Cossio, pp 17 & 20-21.or “common will”; further, under the Federal Civil Code of Mexico, the formation of consent is expressed in the language of offer and acceptance familiar to lawyers in common law jurisdictions such as Singapore.68Foot Note 68×AEIC of Mr Sanchez Medal, pp 15-16.In this connection, the evidence before me – including contemporaneous email evidence – simply did not support a finding that the parties had reached the consensus necessary for the formation of a binding contract, whether as a result of communications on 9 July 2014 or on 11 July 2014. This being the defendants’ appeal and the decision on this issue of a collateral contract having been in their favour, I do not propose to set out in detail my factual findings in this respect, but will highlight a number of salient matters. 75 From the outset, Mr Orvañanos has maintained in his AEIC that in a telephone conversation with Capt Seow on 9 July 2014, he “stressed to Capt Seow” that “Grupo Pegaso (including the 2nd Plaintiff) would only be able to carry on with the negotiations with the 2nd Defendant if there was some assurance that the Deposits would be returned”. Mr Orvañanos’s evidence was that in this telephone conversation, Capt Seow “agreed that the Deposits would be returned”,69Foot Note 69×AEIC of Mr Orvañanos, para 94.apparently without seeking to impose any conditions. However, Mr Orvañanos’ account of the exchange on 9 July 2014 did not appear borne out by the subsequent correspondence. In response to an email from the plaintiffs’ financial advisor Mr Granada Ramirez Diego Julian to the 2nd defendant’s Mr Jeffrey Phang which stated that the Term Sheet for the 2nd plaintiff’s proposed investment in SMP (POSH) should reflect the US$2 million being credited to the SMP deal, Mr Phang’s email reply expressly set down two “conditions” for the return of the US$2 million: that “Grupo Pegaso becomes a partner in SMP”, and that the return of the monies be made “(u)pon the sale of the jackup rig to a third party, and full payment [being] received from the third party”.70Foot Note 70×5AB3103-3104.It was the defendants’ position that Mr Phang’s email was sent pursuant to discussions with Capt Seow on the subject of the refund.71Foot Note 71×NE 24 August 2018, 183:5–183:22.This articulation of the conditions for the return of the monies clearly diverged from Mr Orvañanos’ own assertion in his AEIC of an apparently unconditional refund. Clearly, therefore, assuming Mr Orvañanos had made a proposal on 9 July 2013 for the unconditional return of the plaintiffs’ US$2 million payment, the defendants’ documented response to that proposal changed the terms of that proposal. In the circumstances, I did not find it possible to say that a valid offer and acceptance had arisen out of the 9 July 2013 telephone call and the ensuing correspondence; and I agreed with the defendants that it “was simply not possible for any contract for the unconditional refund of the Rig Deposit to have arisen out of the 9 July Conversation”.72Foot Note 72×Defendants’ closing submissions, para 148. 76 I also did not find the evidence before me sufficient to support an alternative case theory that Capt Seow’s email of 11 July 2014 constituted a valid offer to return the US$2 million which Mr Orvañanos accepted. Both Mr Sanchez Medal and Mr Gonzalez Cossio were in agreement that a valid offer arose under Mexican law only if the debtor-offeror had the will to incur liability (that is, to be legally bound); and in this respect, the Singapore position – that a contracting party must intend to create legal relations (seeThe Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) at para 0.5.001) – is not in my view substantively different. Given Capt Seow’s repeated characterisation of any return of the US$2 million as being a “gesture of goodwill”, coupled with his repeated and unambiguous rejection of Mr Orvañanos’ attempts to procure written documentation of a binding “agreement” for the return of the monies,73Foot Note 73×AEIC of Capt Seow, pp 322-326, 518-521.it was not possible to say that Capt Seow’s 11 July 2014 email constituted a valid offer capable of being accepted and giving rise to a contract under either Mexican law or Singapore law. 77 For the reasons set out above, I found against the plaintiffs in respect of their claim of a collateral contract for the return of the Rig Deposits. On the issue of an alleged acknowledgment and/or admission of debt by Capt Seow (the fifth issue) 78 I also did not find the evidence before me sufficient to support the plaintiffs’ alternative claim based on the alleged acknowledgement and admission of debt by Capt Seow in his emails of 27 August 201474Foot Note 74×5AB3690.and/or 28 August 2014.75Foot Note 75×5AB3728 and 3729.In advancing this alternative claim, the plaintiffs sought to rely on the decision of the Court of Appeal (“CA”) inChuan& Company Pte Ltd v Ong Soon Huat[2003] 2 SLR(R) 215 (“Chuan& Co”).76Foot Note 76×Plaintiffs’ BOA for closing submissions, Tab 5.Two points need to be made about the plaintiffs’ reliance onChuan& Co. First, the CA’s judgement inChuan& Cohighlighted the need for the alleged acknowledgement of debt to be “clear” and “plain” (see at [12], [23] and [28]). Thus, for example, Chao Hick Tin JA (who delivered the judgement of the CA) referencedinter aliathe decision of the English Court of Appeal inDungatevDungate[1965] 3 All ER 818 (see at [23]). In that case, the letter relied on by the plaintiff as constituting an acknowledgement of debt contained the sentence: “Keep a check on totals and amounts I owe you and we will have an account now and then”. This, in Diplock LJ’s view, “made it quite plain that there were amounts owing and outstanding”.  In contrast, inChuan& Coitself, where the letter from the respondent relied on by the appellant (Chuan) as an acknowledgement of debt simply referred to Chuan’s “allegation” of a debt and asked Chuan for documents “substantiating the alleged debts”, the CA held that it was unable to read the letter as amounting to an acknowledgement of debt (at [28]).  In the same vein, I did not find that the email correspondence relied on by the plaintiffs constituted a sufficiently “clear and unequivocal” acknowledgement of debt. 79 Secondly, insofar as the plaintiffs appeared to be suggesting that the emails of 27 August and 28 August 2014 should be read in isolation from all other contemporaneous communications, such an approach appeared to me to be unrealistic and contrary to common sense. The emails of 27 August and 28 August 2014 were sandwiched between Mr Jeffrey Phang’s email of 10 July 201477Foot Note 77×5AB3103-3104.and Capt Seow’s email of 11 July 201478Foot Note 78×5AB3117.on the one hand, and Capt Seow’s email of 29 August 201479Foot Note 79×5AB3741.on the other hand. As noted earlier, Mr Phang’s email of 10 July 2014 expressly stated that the return of the US$2m would be made “with the following conditions”: namely, Grupo Pegaso becoming a partner in SMP, the jack-up rigs being sold to one thirdparty and full payment being received from the third party. Capt Seow’s email of 11 July 2014 appeared to follow up on Mr Phang’s email by fleshing out some details of the “conditions” stated by Mr Phang:inter alia, Capt Seow referred to the US$2m being “offset” against the price to be paid by Grupo Pegaso for the acquisition of “the shares of SMG280Foot Note 80×“SMG2” was the previous name of the defendants’ Mexican joint venture entity “SMP”: AEIC of Mr Orvañanos, para 42.or of one of the other Mexican companies”; and he also informed that the two rigs had been sold and that the stage payments were expected to be received “shortly”. Capt Seow’s emails of 27 August and 28 August 2014 then sought to assure Mr Orvañanos that because the defendants wanted Grupo Pegaso to be “comfortable” deciding for itself the merits of investing in one of the defendants’ Mexican companies and did not wish to “exert pressure” on Grupo Pegaso, the refund of the US$2m would not depend on Grupo Pegaso acquiring shares in one of the Mexican companies – that is, the first of the two “conditions” spoken of by Mr Phang would not apply. It may also be noted that in his email of 11 July 2014, Capt Seow had spoken in terms of the US$2m having been “forfeited” previously and had referred to the proposed “refund” of the sum as “a gesture of goodwill”. In his further email on 29 August 2014, Capt Seow spoke of the US$2m as a “non-refundable deposit”. In all these circumstances, therefore, I did not find it feasible to characterise the 27 August and 28 August 2014 emails as a “clear” and unequivocal acknowledgement by the defendants that theyowed the US$2m as a debtto the plaintiffs. 80 For the reasons set out above, I found against the plaintiffs in respect of their claim of acknowledgment and/or admission of debt by Capt Seow. 81 That I found the evidence insufficient to prove any collateral contract for the return of the US$2m or any acknowledgement by the defendants of this sum being owed as a debt to the plaintiffs did not mean that the defendants were in law justified in retaining the US$2m following the non-execution of the Shipbuilding Contracts. On the contrary, I found that the first defendant was not entitled to forfeit this sum under the terms of the Rig Purchase Agreement and that the first plaintiff was accordingly entitled to have the sum returned to it under the terms of the said Agreement when the Shipbuilding Contracts were not eventually entered into; in the alternative, the first plaintiff was entitled to the refund of this US$2m deposit on the basis of total failure of consideration. I will now explain my reasons for these findings.",
        "On the plaintiffs’ claim for the return of the US$2m under the terms of the Rig Purchase Agreement (the second issue)": "82 On the above-captioned second issue, parties weread idemthat the first defendant had an express contractual right to forfeit the US$2m – but “only in the event” of the Shipbuilding Contracts “for a reason attributable to [the first plaintiff]”. This followed from the italicised words in the following clauses of the Rig Purchase Agreement:  2. Deposit 2.1 [The first plaintiff] shall pay to [the first defendant] a sum of US$1,000,000 for each Vessel … 2.2 The Vessel Deposit shall be applied towards the first instalment under the relevant Shipbuilding Contract to be entered into between the [first plaintiff] and the [first defendant] for each Vessel in accordance with the terms herein.In the event that the Shipbuilding Contract is not entered into for a reason attributable to [the first plaintiff], the Vessel Deposit shall be forfeited by [the first plaintiff] and the [first defendant] shall be entitled to retain the Vessel Deposit paid hereunder. 3. Execution of Shipbuilding Contract 3.1 The parties shall endeavour to execute the relevant Shipbuilding Contract for each Vessel by 6 October 2013 and in any event no later than 16 October 2013 3.2 In the event that the Shipbuilding Contracts for the Vessels are not executed by the dates mentioned in clause 3.1 above, then this Agreement shall terminate immediately,the Vessel Deposit will be forfeited as provided for in clause 2.2 only in the event that thenon execution is attributable to GP. 83 As a preliminary point, I would note that insofar as clause 2.2 of the Rig Purchase Agreement provided for the first defendant’s right to forfeit the US$2m “only in the event” that the non-execution of the Shipbuilding Contract was attributable to the first plaintiff, I understood this to mean that the first plaintiff must be foundsolelyresponsible for the non-execution of the Shipbuilding Contract. I arrived at this understanding based on the following reasons. First, the terms of the Rig Purchase Agreement clearly distinguished between acts attributable to one party and those attributable to both the parties. Thus, for example, in addressing the situations in which parties were unable to agree on changes to the specifications for the rigs, clause 1.2 expressly distinguished between situations where such lack of agreement was due to the first defendant and situations where the lack of agreement was due to both the parties (“If the [first defendant] cannot comply with such changes to the specifications or if the parties cannot agree on such variation to the key terms, then this Agreement will be terminated without penalty and the [first defendant] shall refund to [the first plaintiff] the Vessel Deposit paid under clause 2.2 by 20 September 2013”).  It appeared to me, therefore, that if the parties had intended the provision for forfeiture in clauses 2.2 and 3.2 to be triggered by non-execution of the Shipbuilding Contracts for reasons attributable to both the parties, they would have said so expressly. 84 In any event, it was not disputed that the Rig Purchase Agreement was prepared by the defendants:81Foot Note 81×AEIC of Mr Orvañanos, para 28.indeed, the defendants rejected an initial attempt by the plaintiffs to introduce clauses favouring the plaintiffs.82Foot Note 82×AEIC of Capt Seow, paras 15-17.Accordingly, even assuming the existence of some doubt as to the meaning of the words “attributable to [the first plaintiff]”, thecontraproferentemrule should apply, such that doubt about the meaning of the words should be resolved against the party who put them forward (Zurich Insurance (Singapore Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 at [131]).83Foot Note 83×Plaintiffs’ BOA for closing submissions, Tab 16. 85 It should also be noted that the defendants themselves conducted their case on the basis that it was the first plaintiff to whom the non-execution of the Shipbuilding Contracts was solely attributable;84Foot Note 84×Defendants’ closing submissions, paras 77 to 110.whilst the plaintiffs resisted any such suggestion and argued that it was the first defendant to whom the non-execution of the contracts was attributable.85Foot Note 85×Plaintiffs’ closing submissions, paras 113 to 116.The dispute between them in this respect was thus one of fact. Having reviewed the evidence adduced, I found that the first plaintiff was not solely responsible for the non-execution of the Shipbuilding Contract. In my view, the non-execution was at least attributable to both parties – if not to the first defendant. 86 The defendants contended86Foot Note 86×Defence, para 10; Defendants’ closing submissions, para 82.that the eventual non-execution of the Shipbuilding Contract was due to the first plaintiff’s failure to revert with any questions or comments on the draft of the contract forwarded by Capt Seow on 3 September 2013.87Foot Note 87×1AB424-499.In my view, this was factually incorrect. From the contemporaneous email evidence, it was clear that in early November 2013, Mr Orvañanos conveyed a number of comments to Pepe (the defendants’ local representative in Mexico). As noted earlier, in an internal email to Capt Seow on 7 November 2013,88Foot Note 88×2AB1456.Pepe updated Capt Seow on a meeting with Mr Orvañanos in which the latter had informed him that the plaintiffs were “interested in go ahead and sign the final contract of purchase” subject to an updated Noble Denton report on delivery time and quality of construction, as well as the inclusion in the penalty clauses in the Shipbuilding Contract of penalties which would “mirror” those included in the plaintiffs’ contract with Pemex for the lease of the jack-up rigs. Pepe added that the plaintiffs also wanted to “(f)ormalize the discount price of $5 million per platform”. 87 Pepe’s meeting with Mr Orvañanos and his update to Capt Seow were followed by an email by Mr Orvañanos to Capt Seow on 13 November 2013 in which he started by thanking the defendants for their “offer of discounting US$ 10MM from the agreed price”.89Foot Note 89×2AB1458.He then stated: We are willing to sign the final documents subject to 2 conditions. 1. One being that Pemex approves the issue of quality assurance and time delivery of the rigs. 2. And secondly, that we reflect in the final documents the same penalties that Pemex would vest upon us for late delivery, if your delivery is late. 88 The defendants sought to dismiss Mr Orvañanos’ testimony about his comments on 13 November 2013 by arguing firstly that he had failed to mention these comments in his AEIC and had only brought them up during cross-examination. According to the defendants, Mr Orvañanos “manufactured the assertion that the 1st Plaintiff had provided its comments on the draft Shipbuilding Contract over the course of cross-examination”.90Foot Note 90×Defendants’ Closing Submissions, para 85. 89 I did not accept the above argument for the following reasons. Whilst it was true that Mr Orvañanos did not mention his comments on 13 November 2013 in his AEIC, this was not a reasonper seto reject his evidence on this issue. After all, as the plaintiffs pointed out, Capt Seow too had at various points in his testimony under cross-examination brought up matters on which his AEIC was silent – even admitting at one point that the evidence given in his AEIC was incorrect whereas his oral testimony (on the same issue) represented the truth.91Foot Note 91×NE 24 August 2018, 163:8–163:16; 167:9-167:24; 183:5-183:22. In gist, Capt Seow conceded in cross-examination that the statement in his AEIC (para 37) that Mr Orvañanos had requested the refund of the Rig Deposit “(o)ver the course of the Negotiations” was wrong; and that the truth was that Mr Orvañanos had “never asked for the return” of the Deposit “(b)efore…the middle of 2014”: “I volunteered to [Mr Orvañanos] that we would reimburse the money and never put it in writing”. See also Plaintiffs’ Reply Submissions at paras 5 and 6.Since AEICs are usually drafted in the first instance by lawyers and lay witnesses are not always as meticulous as they should be in reviewing their AEICs (nor their memories always as sharp as one might hope at the time of reviewing such AEICs), I do not think it reasonable to accuse a witness of “manufacturing” evidence the moment he gives oral testimony which either does not appear in his AEIC or which diverges from it. The court still has to evaluate the credibility of that oral testimony – an exercise which includesinter aliaconsidering whether the oral testimony is supported by objective documentary evidence. In the present case, Mr Orvañanos’ testimony about having given comments on the proposed Shipbuilding Contracts was substantiated by the contemporaneous email evidence – namely, Pepe’s email to Capt Seow on 7 November 2013 conveying Mr Orvañanos’ proposals, and the email from Mr Orvañanos himself to Capt Seow on 13 November 2013. In the circumstances, there was simply no basis for the defendants’ contention that Mr Orvañanos “manufactured the assertion that the 1st Plaintiff had provided its comments on the draft Shipbuilding Contract over the course of cross-examination”. 90 The defendants also sought to argue that Mr Orvañanos’ comments – as conveyed through Pepe and through Mr Orvañanos’ own email – were “not genuine comments on the draft Shipbuilding Contract” but rather, attempts “to negotiate the agreement between the parties”.92Foot Note 92×Defendants’ Closing Submissions, at para 88.I rejected this argument for the following reasons. 91 First, the defendants did not manage to explain what sort of comments might amount to “genuine comments”. If all the defendants meant was that the plaintiffs were restricted solely to commenting on the clauses which were already incorporated in the 3 September 2013 drafts and which were highlighted to Mr Orvañanos in cross-examination (i.e., the clauses dealing with matters such as the flag state and shipping registry jurisdiction of the rigs, the governing law, dispute resolution, force majeure, liquidated damages, etc), this seemed to me an entirely illogical and unrealistic proposition. Given that the first plaintiff was proposing to enter into contracts for which the total purchase price came to nearly US$400m, I did not think either the first plaintiff or the first defendant would have contemplated the former’s comments on these proposed contracts being restricted solely to comments on the draft clauses highlighted by counsel – or that they would have contemplated the first plaintiff being somehow barred from raising issues not already incorporated in the draft contracts. 92 Indeed, nothing in the email exchange between Capt Seow and Mr Orvañanos on 3 September 201393Foot Note 93×1AB424 - 500.suggested that the first plaintiff would be precluded from raising matters not already spelt out in the draft contract. In connection with this, it should be remembered that at the point when the draft Shipbuilding Contract was forwarded to Mr Orvañanos on 3 September 2013, barely a fortnight had elapsed since his first meeting with Capt Seow in August 2013:94Foot Note 94×AEIC of Capt Seow at para 7.obviously, parties would have had little time to hammer out all the terms of the intended deal. 93 In these circumstances, I did not see why the comments highlighted above from Mr Orvañanos’ 13 November 2013 email should be dismissed as “not [being] genuine comments on the draft Shipbuilding Contract”. In any event, at least one of the comments in Mr Orvañanos’ 13 November 2013 email related to one of the draft contractual clauses brought up by counsel in cross-examination – namely, the liquidated damages clause (Article XI).95Foot Note 95×1AB457.As it then stood in the draft contract on 3 September 2013, this clause provided for the first defendant (“Builder”) to pay liquidated damages at US$20,000 per day “for each and every day that the delivery of the Rig is…delayed more than sixty (60) day beyond” the specified Delivery Date. In his email of 13 November 2013, the second of the proposals put forward by Mr Orvañanos was that the parties should reflect in the final contract “the same penalties that Pemex would vest upon [the plaintiffs] for late delivery, if [the 1sf defendant’s] delivery is late”. The defendants did not explain why this did not amount to a “genuine comment on the draft Shipbuilding Contract”. In my view, it did. 94 For the reasons set out above, I rejected the defendants’ contention that the non-execution of the Shipbuilding Contract was due to the first plaintiff’s failure to revert with questions or comments on the draft. Going further, I also found that having received Mr Orvañanos’ comments, the defendants did not respond. 95  I found it telling, first of all, that when cross-examined about Mr Orvañanos’ email of 13 November 2013, Capt Seow said he could not recall responding to Mr Orvañanos.96Foot Note 96×NE 23 August 2018, 161:12–161:23.This seemed an oddly evasive response, given that in the same breath, Capt Seow also vehemently disparaged Mr Orvañanos’ proposals as being “ridiculous” and insisted that it was “totally out of the question” that the first defendant should “face some penalties from Pemex which [it was] not even a party to”. Having regard to his vigorous critique of Mr Orvañanos’ proposals and of the first plaintiff and Mr Orvañanos himself (“MrOrvañanos and Pegaso at that time to my mind was all over the place”), I would have expected Capt Seow to issue to Mr Orvañanos a swift and firm rejection of his proposals. The fact that he claimed instead to be unable to recall responding to Mr Orvañanos, coupled with the absence of any objective evidence of a response, strongly suggested that he hadnotresponded – and was belatedly realising under cross-examination the adverse repercussions of this omission. 96 I would add that if one were to step back and take a look at the general tenor and content of the communications between the parties in the period following 3 September 2013, the defendants’ submission – that the first plaintiff had failed to take steps to execute the Shipbuilding Contracts – simply could not be borne out. I set out below some of the contemporaneous email communications which in my view showed clearly that in the period after 3 September 2013, the first plaintiff was taking active steps towards the successful conclusion of the deal for the purchase of rigs, and the defendants were well aware of – and responsive to – these efforts. 97 Thus, for example, on 23 September 2013, Pepe informed Capt Seow via an internal email that:97Foot Note 97×2AB818. …the negotiation with Grupo Pegaso to acquire the jackups are still on, the next step is the technical visit from the group that they are in negotiation with [CP Latina]. Mr Antonio Acuña is the leader of the project between Grupo Pegaso and [CP Latina]. Mr Acuña will be in Singapore from October the 2nd, and he would meet with the technical staff Pax Ocean [the first defendant]. 98 On 25 September 2013, Pepe informed Capt Seow via another email that he had met with Mr Orvañanos and that the latter wanted to get some sort of acceptance or approval of the rigs from Pemex and was also keen to update Capt Seow personally on the progress of the deal for the rigs as well as to invite the defendants to participate in the deal:98Foot Note 98×2AB854-855. …I spoke with Alejandro [Mr Orvañanos] and he told me that the date of 16 October [at that point in time the deadline for the execution of the Shipbuilding Contracts] is very concerned. Because before making the first payment, it is necessary that Pemex says that he agrees with the Jack Ups, and that although verbally tell him that Pemex can give it the contracts. Which is why asked me a meeting with you to explain all the advances on different fronts (operational, financial and investment), as well as become a formal invitation to participate in this project. Alejandro is willing to go where you say to meet with you, preferably in Europe or if you need his ready to go again to Singapore. 99 On 26 September 2013, Mr Orvañanos emailed Capt Seow to inform him that the first defendant wished to “push forward the signing of the shipbuilding contract”,99Foot Note 99×2AB915.subject to two outstanding items which affected the signing of the contract. The first was the technical visit by CP Latina to the shipyard which at that point was “still in progress”; the second concerned “a number of discrepancies between the first financial projections given to [the first plaintiff] by [the first defendant’s] team, and those given…by CP Latina”, which Mr Orvañanos wanted to present to Capt Seow for further discussion. Mr Orvañanos’ email also alluded to an item titled “Potential Partnership”, under which he stated that in addition to intending to present to Capt Seow the first plaintiff’s proposed partnership with CP Latina, he also wanted: … most importantly, to persuade you to invest along with us. 100 Capt Seow’s reply on the same day acknowledged his awareness of the impending visit by CP Latina and requested clarification of the “financial projections” given to the first plaintiff by his team.100Foot Note 100×2AB914.This was also the email in which he assured Mr Orvañanos that “to give [the first plaintiff] more time”, the first defendant could “in principle, agree to delaying the contract finalization by 2 weeks until 30th October 2013”. In response to Mr Orvañanos’ suggestion of “Potential Partnership”, Capt Seow’s reply was: Yes, we can discuss when we meet. 101 On 3 October 2013, Mr Orvañanos emailed Capt Seow to update him that following their visit to the shipyard, CP Latina had expressed concern over,inter alia, the alleged delay in the construction of the rigs and “the potential risk of Pemex not approving the product delivered by [the defendants’] shipyard”.101Foot Note 101×2AB1032-1033.Capt Seow responded on the same day refuting the concerns raised. This was then met with a further email from Mr Orvañanos the following day, apologising for having made Capt Seow “feel uncomfortable” and assuring him that “so long as we keep the same spirit of searching for an strategic and robust solution, in the end our vision should prevail”.102Foot Note 102×2AB1035-1037.In the same email, Mr Orvañanos also sought to make arrangements to receive the Noble Denton report “by next week”. 102 On 8 October 2013, Mr Orvañanos emailed Capt Seow to chase for “any news regarding the initial inspection” by Noble Denton and to follow up on his previous proposal for the defendants to invest in the project.103Foot Note 103×2AB1071.Capt Seow replied that the Noble Denton report would take another 8 days, adding:104Foot Note 104×2AB1071. …we are running out of time. We must meet as soon as the ND [Noble Denton] report is out. I suggest we meet halfway, perhaps in London? 103 Mr Orvañanos responded with details of the partnership being contemplated with CP Latina. Capt Seow’s email to Mr Orvañanos a day later asked the latter for details of the “level of investment” which the plaintiffs were expecting from the first defendant (harking back to Mr Orvañanos’ suggestion that the first defendant participate in the deal as well), and asked if the plaintiffs would “consider our investment in the form of a convertible bond”.105Foot Note 105×2AB1070.On 10 October 2013, Mr Orvañanos replied that a convertible bond could be considered “at the SPV level”. He also added:106Foot Note 106×2AB1070. It all seems very challenging to align. Once we have the report from ND, and assuming that the report will come out as expected, Latina will need to decide immediately if they want us as partners. Parallel to the previous activity, we would need to go to Pemex and show them the specs and the report for their ‘blessing’. Then you and I need to meet to discuss the potential partnership… Afterwards there are a great number of tasks to achieve, we would be working against the clock, but I trust that we can pull it off. We really want you as a partner. I truly believe that many positive things will evolve out of this initial endeavour. 104 On 16 October 2013, Capt Seow emailed Mr Orvañanos as follows:107Foot Note 107×2AB1094-1095. I understand that ND had commented that they are not confident we can deliver the first rig by end of next, based on their experience with Keppel. This matter is very subjective. Keppel has 17 jackups under construction simultaneously. We have only 2, and can focus… We are confident of delivering on schedule. 105 On 17 October 2013, Mr Orvañanos emailed Capt Seow the draft Noble Denton report.108Foot Note 108×2AB1098.Mr Orvañanos was concerned because the report had identified the risk of a delay in the delivery date of the two rigs, notinginter aliathat the “ongoing two projects are running almost simultaneously leaving no room for delays and manpower shortages. The yard is basically doing all construction works using subcontractors. During the peal construction periods, the management of a large number of subcontractor companies and their workforce will be a challenge for project management”.109Foot Note 109×AEIC of Mr Orvañanos at para 49.Mr Orvañanos sought Capt Seow’s comments “regarding the time issue and how [he could] give comfort to [CP Latina] regarding the time element”. 106 Capt Seow replied the following day, enclosing input from his technical staff on the projected delivery dates for the rigs110Foot Note 110×2AB1325-1326.. However, the first plaintiff was informed by CP Latina that it no longer wished to be a partner in the purchase of the rigs. Whilst both the plaintiffs and the defendants have sought to blame each other for CP Latina’s decision to withdraw from the deal for the rigs, it was clear to me on the evidence available that CP Latina’s withdrawal did not put an end to the deal at that point in time. First, it is not disputed that following the withdrawal of CP Latina, the plaintiffs continued their efforts to find a suitable partner in Mexico. This is alluded to, for example, in Pepe’s email update to Capt Seow on 7 November 2013, in which Pepe informed that “Grupo Pegaso continue with negotiations with Grupo Alfa”;111Foot Note 111×2AB1456.and also in Mr Orvañanos’ email to Capt Seow on 13 November 2013 in which he informed:112Foot Note 112×2AB1458. We continue to look for an operator to partner with us. ALFA is still very much interested, and we are meeting next Wednesday with DIAVAZ. 107 In the same email, Mr Orvañanos informed Cap Seow that if the plaintiffs did not find an operator in Mexico to partner with, they would “analyse what will it take to pursue the project on [their] own (with [the defendants] as a partner)”. 108 It is also not disputed that on 25 October 2013, Capt Seow agreed to extend the deadline for signing the Shipbuilding Contracts to 31 December 2013. What is interesting is that the email correspondence during this period, shows Capt Seow to have been taking steps to dispel the concerns expressed by the first plaintiff about the first defendant’s ability to deliver the rigs on time. In his email of 25 October 2013 to Pepe updating the latter on the extension of the contract-signing deadline, Capt Seow stated that he himself would be going to the shipyard the following week “to discuss action plan with SY [presumably the shipyard] to show Baudelio we can deliver” (Baudelio being the senior Pemex executive who had visited the shipyard earlier in 2013).113Foot Note 113×2AB1454.In fact, Capt Seow stated: I will ask NOV engineer to explain to Baudelio about our plan, and how NOV will work with us to speed up the delivery. 109 Capt Seow also emailed Mr Orvañanos on 22 October 2013 specifically to draw his attention to “the progress made” on another rig ordered by the Swire Pacific Group. He took pains to highlight to the latter:114Foot Note 114×2AB1355. We completed the hull, outfitted all the equipment and launched this $75 million vessel in 6 months. No one believed that we could do it… 110 The above email was obviously an example of the efforts made by the first defendant to convince the first plaintiff of its ability to deliver the two rigs on time and thus to fulfil the Shipbuilding Contracts. There was no reason otherwise for Capt Seow to bring to Mr Orvañanos’ attention the first defendant’s successful completion of an entirely different rig ordered by another company. 111 I have highlighted the above emails from Capt Seow because they demonstrate that the first defendant was amply aware of the first plaintiff’s concern about how the risk of delay in the delivery of the rigs might affect the conclusion of the Shipbuilding Contracts – and was moreover keen to take steps to assuage these concerns. 112 Why, then, were the Shipbuilding Contracts not eventually executed? As I indicated in giving oral judgement, I accepted Mr Orvañanos’ evidence on this score – that the Shipbuilding Contracts were not eventually executed because the parties moved on from the rig purchase project to a proposal by the defendants for the plaintiffs to invest in one of their Mexican companies instead.115Foot Note 115×AEIC of Mr Orvañanos at paras 57 to 60, 74 to 86. 113 In this connection, I noted firstly that the contemporaneous email communications showed that the plaintiffs had from the outset been interested in engaging the defendants in some form of partnership. This interest was initially focused on the rig purchase agreement. As early as 13 September 2013, Pepe informed Capt Seow via email that the plaintiffs hoped to persuade the defendants “to participate as a partner of them” in the scheme they were then drawing up for the operation of the rigs”:116Foot Note 116×2AB790. The idea would be 50/50, and Posh [the 2nd defendant] and Grupo Pegaso in the same company with a very easy exit scheme and clear. 114 As noted earlier, Mr Orvañanos’ emails to Capt Seow in the period of September to October 2013 also alluded repeatedly to the plaintiffs’ hopes of partnering with the defendants. By early November 2013, it was also clear that the plaintiffs’ interest in partnering with the defendants extended to a potential investment in one of the defendants’ Mexican companies. In his email dated 3 November 2013 to Capt Seow, Pepe reported that Grupo Pegaso:117Foot Note 117×2AB1457. …[was] still very interested in buying the 50% of SMG [GOSH] shares, they have looked at various options, and intend to meet next Friday with AY to propose purchase of AY and GGM, paying them with football soccer team, and additional money. They are very interested to be partners with POSH [the 2nd defendant], not any other Mexican partner interested as much as POSH. 115 In cross-examination, Capt Seow sought to portray the defendants as having been largely indifferent to the plaintiffs’ interest in investing in one of their Mexican companies. Capt Seow asserted that it was Mr Orvañanos who had “of his own accord” been “trying to do deals with Amado Yanez”, claiming:118Foot Note 118×NE 23 August 2018, 159:7–159:19. (I)f he [Mr Orvañanos] wants to go and meet Mr Amado Yanez and do whatever he wants… it is not in my control. 116 I did not find Capt Seow’s assertions about the defendants’ indifference (or passivity) believable. My reasons were as follows. In the first place, Capt Seow had stated in cross-examination that if he himself were to go and talk to his partner Mr Yanez about the acquisition of his shares, the latter “would be very very insulted”.119Foot Note 119×NE 23 August 2018, 169:10–169:13.Given Capt Seow’s awareness of the potential sensitivity of an approach being made to Mr Yanez for his shares, I did not find it believable that he would have viewed with passive equanimity the prospect of Mr Orvañanos making Mr Yanez an offer for the latter’s GOSH shares. 117 Further, in Mr Orvañanos’ email to Capt Seow on 13 November 2013, he had laid out for Capt Seow his strategy for a meeting with Mr Yanez scheduled for that very day:120Foot Note 120×2AB1458. We are having lunch today with Amado. Our strategy is to let him talk and wait until we find the proper spot to come in and mention the “possibility” of acquiring his stake in GOSH. I discussed this with Jose Luis [Pepe] last week and we felt that the solution of keeping the accounts payable of USD$18MM, plus keeping one of your vessels, both as payments for their 50% stake in the company might be appealing to him.I just need to know if such solution has been discussed with him or not.As you well advised, we will be very careful.But we are very excited that we could put together a partnership with you in which we could have 6 vessels and 2 jack ups, all with Pemex contracts. 118 The above email is revealing for two key reasons. First, Mr Orvañanos’ reference to putting together a “partnership” with the defendants in which they “could have 6 vesselsand 2 jack ups” showed that as far as the plaintiffs were concerned, their interest in investing in one of the defendants’ Mexican companies was not meant to be a substitute for the intended purchase of the two rigs: the plaintiffs’ intention was apparently to achieve both the conclusion of the deal for the rigs and investment in one of the defendants’ Mexican entities. This was again reflected in Mr Orvañanos’ email of 27 December 2013 to Capt Seow, in which he updated the latter that the plaintiffs had “continued in [their] search for a local operator” and had also been meeting with “diverse officials from all relevant positions all across Pemex” to gain a “clear understanding of Pemex immediate interests”.121Foot Note 121×2AB1462.In this email, Mr Orvañanos requested to meet with Capt Seow “ASAP” to “discuss how…to move forward”. It was in response to this email that Capt Seow suggested – via email on 30 December 2013122Foot Note 122×2AB1462.– they meet either in January or in March 2014. It is not disputed that they eventually met on 24 January 2014 in Singapore. 119 Capt Seow’s email reply on 30 December 2013 and the subsequent email correspondence are also revealing for the following reasons. First, it is noteworthy that despite the deadline for the execution of the Shipbuilding Contracts being ostensibly due on 31 December 2013, Capt Seow did not allude to this fact at all, nor did he point out to Mr Orvañanos that the plaintiffs had (according to the defendants’ case at trial) failed to forward any comments on the draft contracts. In fact, despite the defendants contending that “(b)y 31 December 2013, the 1st Plaintiff had not executed the Shipbuilding Contract”, the contemporaneous email evidence showed that post 31 December 2013, the plaintiffs continued to take steps towards the execution of the contracts, and the defendants were not only aware of this but also sought to encourage them. 120 Thus, for example, prior to the meeting on 24 January 2014, Mr Orvañanos had emailed Capt Seow on 11 January 2014 to report a planned meeting with another potential partner for the operation of the rigs (Perforadora Mexico).123Foot Note 123×2AB1464.In the same email, Mr Orvañanos also reported that it appeared that Pemex – which had up till then been immersed in internal reforms – would “soon tender the purchase of a number of rigs as well as number of traditional rig rentals”, and that “(e)verything looks very promising”. 121 It must be remembered that the defendants’ case was that the 31 December 2013 deadline expired without the Shipbuilding Contracts being executed because the 1st plaintiff “was not able to successfully market the Rigs to Pemex”.124Foot Note 124×AEIC of Capt Seow, para 25.If this had indeed been the defendants’ position all along, one would have expected Capt Seow to respond to the above email by pointing out to Mr Orvañanos that the deadline for executing the Shipbuilding Contracts had long passed and that the 1st plaintiff had only themselves to blame if they had not managed to “successfully market the Rigs to Pemex”. Capt Seow did no such thing. Instead, on 16 January 2014, he emailed Mr Orvañanos as follows:125Foot Note 125×2AB1476. I think it will be good for you to visit the rigs when you are here, so you can witness the progress. 122 Plainly therefore, contrary to the defendants’ subsequent claims at trial, the first defendant did not take the position at this critical stage that the matter of the Shipbuilding Contracts had come to an end on 31 December 2013 with the first plaintiff’s supposed failure to market the rigs successfully to Pemex. 123 Secondly, the italicised words in Mr Orvañanos’ email of 13 November 2013 (see at [117] above) revealed that there had been previous discussions between Mr Orvañanos and Capt Seow on the subject of the plaintiffs making an approach to Mr Yanez for his stake in GOSH. There was simply no reason otherwise for Mr Orvañanos to have made these statements. There was also no evidence of any rebuttal by Capt Seow of these assertions as to previous discussions. Indeed, if Mr Orvañanos had for some reason decided to insert blatant falsehoods about such previous discussions in his email to Capt Seow, it was unbelievable that Capt Seow would simply have chosen to ignore them and to keep quiet – especially when Mr Orvañanos was proposing to speak to the defendants’ Mexican partner about acquiring his shares. To my mind, this piece of evidence indicated that the defendants were aware of the plaintiffs’ interest in acquiring a stake in one of their Mexican entities – and that far from being averse to this interest, they had engaged in at least some discussions with the plaintiffs on how to achieve the acquisition of such a stake. 124 In this connection, the defendants’ acquiescence in and encouragement of the plaintiffs’ interest was not surprising, given Capt Seow’s admission in cross-examination of the poor state of relations between the defendants and their then Mexican partners. In gist, Capt Seow claimed that “the company” had not harboured any thoughts of exiting its then Mexican partners from GOSH in 2013 even if “some people” might have held that view. However, when asked to clarify, he actually admitted that sometime in 2013, the defendants had been compelled to threaten withdrawal of their financing of the GOSH vessels because of the tardiness of their then Mexican partners in paying them their share of the charter payments from Pemex:126Foot Note 126×NE 23 August 2018, 132:2–132:10. (T)he relationship… was quite factious, and therefore we had to threaten to withdraw the financing and to force the payments to be made into a trust account to secure payments, because payments received by [OSA] were being very late…they were paying us very slow, too slow. 125 Having regard to the above background and the supporting evidence of contemporaneous email communications, I found Mr Orvañanos’ evidence of his 24 January 2014 meeting with Capt Seow127Foot Note 127×AEIC of Mr Orvañanos, paras 57 to 59.entirely credible. According to Mr Orvañanos, by the time he met Capt Seow on 24 January 2014 (which was some two weeks after his update to Capt Seow on 11 January), he had started having concerns about the viability of getting new contracts for the rigs and was thinking of suggesting that the rig purchase deal be abandoned and the US$2m deposit be returned – but when he broached this possibility with Capt Seow, the latter’s response was as follows:128Foot Note 128×AEIC of Mr Orvañanos, para 57. …he told me not to worry, that the Rigs would be sold to someone else and that Grupo Pegaso should, instead of claiming for the Deposits, work with the 2nd Defendant and the Deposits could be refunded as part of a new deal whereby Grupo Pegaso would purchase an interest in a vessel owned by the 2nd Defendant, called POSH Gannet. 126 Crucially, Capt Seow admitted that he had told Mr Orvañanos on 24 January 2014 that “the 1st Defendant would be selling the Rigs to another buyer”.129Foot Note 129×AEIC of Capt Seow, para 28.He claimed that he had told Mr Orvañanos this was because “the extended deadline for the execution of the Shipbuilding Contracts of 31 December 2013 had lapsed”. I did not believe Capt Seow’s claims in this respect, given that he had on 16 January 2014 expressly invited Mr Orvañanos to “visit the rigs” when he was in Singapore so as to “witness the progress”. As noted earlier, Capt Seow also claimed in cross-examination that Mr Orvañanos had “never asked” him about the return of the Rig Deposits during the 24 January 2014 meeting. Again, I did not find Capt Seow’s evidence credible in this respect, given that he conceded his testimony in cross-examination directly contradicted the statement in his AEIC that Mr Orvañanos had requested the refund of the Rig Deposits “(o)ver the course of the Negotiations” for the Plaintiffs’ investment into GOSH and/or the vessel POSH Gannet.130Foot Note 130×AEIC of Capt Seow, para 37. 127 I should add that Mr Orvañanos’ evidence – that it was the defendants who had proposed on 24 January 2014 that the plaintiffs turn their attention to an investment into POSH Gannet – was also supported by the contemporaneous email evidence which showed that prior to their meeting on 24 January 2014, Capt Seow had emailed Mr Orvañanos “pictures of the Posh Gannet undergoing modification and report of [the defendants’] senior superintendent”.131Foot Note 131×2AB1489-1501.Subsequent to the meeting on 24 January 2014, the email evidence also showed the defendants’  Chief Financial Officer Mr Geoffrey Yeoh following up with Mr Orvañanos on 27 January 2014 by forwarding him the cash flow projects for the POSH Gannet. Mr Yeoh’s email specifically stated that this was:132Foot Note 132×2AB1512, (f)urther to our discussions last week regarding the possible investment by Pegaso into POSH Gannet. 128 For the reasons set out in [85] to [127] above, I found that the non-execution of the Shipbuilding Contracts was not attributable to the plaintiffs. Instead, it was attributable to the parties shifting their focus to the plaintiffs’ proposed investment in one of the defendants’ Mexican companies, which shift in focus led Capt Seow to tell Mr Orvañanos on 24 January 2014 that “the 1st Defendant would be selling the Rigs to another buyer” and to propose that the plaintiffs consider investing into the vessel POSH Gannet instead. This is why I stated in giving oral judgement that the non-execution of the Shipbuilding Contracts was attributable to both parties, if not to the defendants. I would add that contrary to the defendants’ contention, this state of affairs was actually pleaded in the alternative by the plaintiffs in their Statement of Claim: see in this respect [18.2] of the Statement of Claim which asserted that the Shipbuilding Contract “was not entered into because…[the first defendant] intended to sell the Rigs to another purchaser”. 129 For the above reasons, I found that the first defendant was not entitled to forfeit the US$2m under the terms of the Rig Purchase Agreement, and that the plaintiffs were accordingly entitled to have the said sum returned. On the issue of total failure of consideration (the third issue) 130 I also found the plaintiffs to be entitled to the return of the US$2m based on the alternative ground of total failure of consideration. My reasons were as follows. 131 In their Statement of Claim, the plaintiffs pleaded in the alternative that the Rig Deposits totalling US$2m “were pre-contractual deposits paid to the First Defendant in their anticipation of the parties entering into the Shipbuilding Contract”; and that these contracts not having ultimately been entered into, “there was a total failure of consideration and of basis and the sum of USD 2,000,000 should be returned to the First Plaintiff”.133Foot Note 133×Plaintiffs’ Statement of Claim, para 14 and 25. 132 The defendants took the position in their closing submissions that the Rig Deposits “served as an earnest for the [1st Plaintiff’s] performance of the Rig Purchase Agreement and was paid as a quid pro quo for the 1st Defendants reserving the Rigs for the 1st Plaintiff”; and that the basis for the Rig Deposits “did not fail as the 1st Defendant reserved the Rigs for the 1st Plaintiff until 31 December 2013”.134Foot Note 134×Defendants’ closing submissions, para 116. 133 As a preliminary point, it must be noted that the assertion that the Rig Deposits were paid “as an earnest for the [1st Plaintiff’s] performance of the Rig Purchase Agreement and …as a quid pro quo for the 1st Defendant reserving the Rigs for the 1st Plaintiff” was not pleaded in the Defence. In the Defence, the defendants simply pleaded a denial of [14] and [25] of the Statement of Claim. Having regard to the materiality of the characterisation of the US$2m payment, I considered the defendants’ omission a fundamental defect in their pleadings and would have been inclined to reject outright the argument they put forth in their closing submissions on this matter – but for the absence of any objections from the plaintiffs themselves. In fact, the plaintiffs sought to respond in some detail to the defendants’ submissions on the alleged “earnest”.135Foot Note 135×Plaintiffs’ reply submissions, paras 45-60.As such, I proceeded to consider both parties’ submissions on this matter. 134  In respect of the legal principles applicable in this subject-area, these have been clearly set out in the recent judgement by the CA inSimpson Marine (SEA) Pte Ltd vJiacipto Jiaravanon[2019] SGCA 7 (“Simpson Marine”). In that case, the appellant contended that the judge at first instance had erred in failing to find that the deposit of £1m remitted by the respondent was a holding deposit for the two specified yachts and was not refundable if he subsequently declined to purchase either yacht. The CA noted that “(o)rdinarily”, if a deposit were a true pre-contract deposit: 46 …Part of the basis of payment of a pre-contract deposit is that the contract will subsequently come into existence. If no contract materialises, the basis of the payment would have failed, and the deposit must be returned. The payor is not under any obligation to bring the contract into existence, and may reclaim the deposit at any time before a binding contract is entered… 47 However, not all pre-contract deposits are of this nature. Pre-contract deposits are governed by general principles of restitution for failure of consideration or basis: seeGoff & Jonesat para 14-12. Prof Peter Birks, in his revised edition ofAn Introduction to the Law of Restitution(Oxford University Press, 1989) at p 222, summarised the meaning of failure of consideration as follows: Failure of the consideration for a payment should be understood in that sense. It means that the state of affairs contemplated as the basis or reason for the payment has failed to materialise or, if it did exist, has failed to sustain itself. 48 InBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 (“Benzline”), this Court clarified (at [46]) thatthe inquiry into the unjust factor of failure of consideration has two parts: first, what was the basis for the transfer in respect of which restitution is sought; and second, did that basis fail? [emphasis added] 135 InBenzlineAuto Pte Ltd v Supercars Lorinser Pte Ltd and another[2018] 1 SLR 239 (“Benzline”),136Foot Note 136×Defendants’ BOA for closing submissions, Tab 1.the CA explained that the basis of a transfer must be “objectively determined based on what is communicated between the parties; the parties’ uncommunicated subjective thoughts are irrelevant”(see at [51]). From the CA’s judgement, it is clear that the starting-point of an inquiry into the basis of a transfer must be to examine whether any express agreement or understanding existed between the parties as to such basis; if yes, the terms of that express agreement or understanding; and if no, whether the basis may be objectively implied from the evidence (see [67] ofBenzline). InBenzline, the CA examined the evidence first to ascertain whether there was any express agreement between the appellant and the respondent as to the basis for the payment of a sum of $300,000 by the latter to the former: the respondent contended that the money had been paid on the basis that it would be entering into an Exclusive Sub-Dealership Programme with the appellants; the appellant disagreed. The CA held that the weight of the evidence before it militated against there having been any express understanding that entry into the Exclusive Sub-Dealership Programme formed part of the basis of the payment; and that such a basis also could not be objectively implied. Instead, the CA found that on the evidence before it, the implied basis for the payment was not that the parties would enter into the Exclusive Sub-Dealership Programme, but that the appellant wouldofferthe respondent the Exclusive Sub-Dealership Programme on terms which would correspond in material ways to the first draft of an agreement (“the First Draft Agreement”) between the appellant and Lorinser (Lorinser was the company responsible for modifying the cars which formed the subject-matter of the proposed Exclusive Sub-Dealership Programme). At the second stage of the inquiry, the CA found that this basis had not failed because the appellant had been prepared to move forward with the Exclusive Sub-Dealership Programme, whereas it was the respondent who had thrown a spanner in the works by refusing to provide a standby letter of credit – something which was required in the First Draft Agreement. In the circumstances, the respondent was not entitled to the return of the money when the Exclusive Sub-Dealership Programme was eventually not entered into. 136 InLee Chee Wei v TanChor Peow Victor and others[2007] 3 SLR(R) 537 (“Lee Chee Wei”),137Foot Note 137×Defendants’ BOA for closing submissions, Tab 7.the plaintiff had entered into an agreement to sell his shares in a company (“DMS”) to the fourth defendant. When the agreement fell through, a question arose as to whether the fourth defendant was entitled to the return of a sum of $750,000 which had been paid as an initial deposit under the agreement. The CA found that it was so entitled, after scrutinizing a number of clauses in the agreement. It pointed out that these clauses stipulated that the purchase price of the shares would be paid by multiple instalments and expressly characterised the $750,000 as an “instalment” in contradistinction to a “deposit”, “thereby branding it as an advance payment” which was “prima facieimmediately repayable” (see at [88] and [89]). As the English Court of Appeal noted inHowe v Smith(1884) 27 Ch. D. 89 at 98 (an authority referenced by the CA inLee Chee Wei): …the question as to the right of the purchaser to the return of the deposit money must, in each case, be a question of the conditions of the contract. 137  It should be noted that inLee Chee Wei, the $750,000 payment was a “deposit paid upon or after the conclusion of a contract”, since the agreement for the purchase of the DMS shares was already in existence when the payment was made. InUnited Artists Singapore Theatres Pte Ltd v Parkway Parade Pte Ltd[2003] 1 SLR(R) 791 (“United Artists”), the High Court noted that the difference between a pre-contract deposit and a deposit paid on or after the conclusion of a contract (a “contract deposit”) was that a pre-contract deposit wasprima facierecoverable if the prospective contract in connection with which the payment was made did not come into existence; whereas a contract deposit served the “dual purpose of an earnest to bind the bargain and as part payment of the purchase price”: “…that the expression used in the present contract that the money is paid ‘as a deposit and in part payment of the purchase money’ relates to the two alternatives, and declares that in the event of the purchaser making default the money is to be forfeited and that in the event of the purchaser making default the money is to be forfeited and that in the event of the purchase being completed the sum is to be taken in part payment” (see at [71] to [77]). 138 InUnited Artists, the plaintiffs negotiated with the defendants between 1994 and 1999 to develop and manage a Cineplex. Over the course of that period, four payments totalling $1,846,900 were made by the plaintiffs to the defendants. In 1999 the plaintiffs decided not to undertake the project. The High Court found that the payments in question were “pre-contract deposits which served as an indication of the plaintiffs’ confidence with funding, genuine interest and seriousness in being the casino operator”: they served as a tangible assurance of genuine intent, and were made in anticipation of the lease that was being negotiated, and without any intention that they would be outright payments if a lease was not concluded; and they were therefore objectively recoverable in the event of failure to reach a final agreement. As the CA later highlighted inBenzlineat [59], there were “three significant facts which grounded the decision inUnited Artists: the multiple references to ‘good faith payment” in the documentary evidence, the defendants’ specific request for tangible assurance of the plaintiffs’ financial ability to complete the deal; and the repeated emphasis that the arrangements were “subject to contract”. 139 Applying the above case law to the present case, I considered whether the express terms of the Rig Purchase Agreement supported the plaintiffs’ characterisation of the US$2m as a pre-contract deposit paid in anticipation of the Shipbuilding Contract being entered into, or whether they supported the defendants’ contention that the payment “served as an earnest for the [1st Plaintiff’s] performance of the Rig Purchase Agreement and was paid as a quid pro quo for the 1st Defendant reserving the Rigs for the 1st Plaintiff”. It was clear to me that the express terms of the Rig Purchase Agreement supported the plaintiffs’ claim and militated against the defendants’. For ease of reference, I reproduce again below the relevant terms in clauses 2.2 and 3.2: 2. Deposit 2.1 [The first plaintiff] shall pay to [the first defendant] a sum of US$1,000,000 for each Vessel (the “Vessel Deposit”) … 2.2The Vessel Deposit shall be applied towards the first instalment under the relevant Shipbuilding Contract to be entered into between the [first plaintiff] and the [first defendant] for each Vessel in accordance with the terms herein. In the event that the Shipbuilding Contract is not entered into for a reason attributable to [the first plaintiff], the Vessel Deposit shall be forfeited by [the first plaintiff] and the [first defendant] shall be entitled to retain the Vessel Deposit paid hereunder. 3. Execution of Shipbuilding Contract 3.1 The parties shall endeavour to execute the relevant Shipbuilding Contract for each Vessel by 6 October 2013 and in any event no later than 16 October 2013. 3.2In the event that the Shipbuilding Contracts for the Vessels are not executed by the dates mentioned in clause 3.1 above, then this Agreement shall terminate immediately, the Vessel Deposit will be forfeited as provided for in clause 2.2 only in the event that thenon execution is attributable to GP. 140 The italicised portions of the two clauses show that the Rig Purchase Agreement expressly provided for the US$2m to be applied towards the first instalment payment payable under the Shipbuilding Contract. Nothing in the Rig Purchase Agreement stated that the US$2m would be forfeited upon breach of theRig PurchaseAgreementby the first plaintiff – which is what should have been stipulated if indeed the monies “served as an earnest for the [first plaintiff’s] performance of the Rig Purchase Agreement” as the defendants claimed (see in this respect the judicial definition of “earnest money” per the High Court inTriangle Auto Pte Ltd v Zheng Zi Construction Pte Ltd[2000] 3 SLR(R) 594 at [9]). Instead, whilst clauses 2.2 and 3.2 did make provision for forfeiture of the US$2m, this was in the specific context of the Shipbuilding Contracts not being entered into for a reason attributable to the first plaintiff. 141 There was also no provision at all in the Rig Purchase Agreement for the first defendant to “reserve the rigs” for the first plaintiff for a specified period. In this connection, I did not find it possible to construe clause 3.1 as imposing such an obligation on the first defendant. Clause 3.1 simply provided for the parties to “endeavour to execute the relevant Shipbuilding Contract for each Vessel by 6 October 2013 and in any event no later than 16 October 2013”. Not only did the use of the term “endeavour” place a far less onerous level of responsibility on the first defendant than a clause requiring “best endeavours” or “all reasonable endeavours” or even “reasonable endeavours” would have done (seeKS Energy Services Ltd v BR Energy (M)Sdn Bhd[2014] 2 SLR 905138Foot Note 138×Defendants’ BOA for reply submissions, Tab 3.at [46] – [47], [62] – [63] for the CA’s definition of the level of responsibility imposed by these different clauses), there was no mention at all in clause 3.1 of the first defendant being obliged to reserve the rigs for a specified period. 142 It should be added that aside from the terms of the Rig Purchase Agreement, the bank documentation for the actual transfer of the US$2m also made no mention of the monies being intended for the reservation of the rigs for a specified period. Instead, the bank transfer notice stated that the monies were a “deposit on behalf of GPin accordance to agreement to purchase 2 units of Gusto MSC CJ 46 jack-ups” (emphasis added). This may be contrasted with the position inSimpson Marine, where the CA noted that the appellant’s remittance record expressly stated that the funds remitted by the respondent were a “deposit” to reserve the two specified yachts for a specified period (see [68] ofSimpson Marine). The terms stated in the remittance record formed one of the “significant” pieces of evidence which the CA relied on to draw the conclusion that the £1m was paid by the respondent as a non-refundable deposit to secure two specified yachts for the stated period. 143 For the reasons set out in [133] to [142] above, I rejected the defendants’ argument that the US$2m “served as an earnest for the [1st Plaintiff’s] performance of the Rig Purchase Agreement and was paid as a quid pro quo for the 1st Defendants reserving the Rigs for the 1st Plaintiff”. I accepted instead the plaintiffs’ contention that the monies were paid as a pre-contractual deposit – an “anticipatory payment intended only to fulfil the ordinary purpose of a deposit if and when the contemplated agreement should be arrived at” (seeUnited Artistsat [82]). This being the case, it was clear that the basis for the payment failed when the Shipbuilding Contracts were not entered into; and that such failure having occurred, the monies ought to be restituted to the plaintiffs.",
        "Summary of decision": "144 For the reasons given above, I allowed the plaintiffs’ claim and ordered the sum of US$2m to be refunded with interest to run at 5.33% per annum from the date of the writ. On the issue of costs 145 Insofar as judgement was obtained by the plaintiffs on their claim under the Rig Purchase Agreement and their alternative claim in total failure of consideration, these were causes of action which did not involve the second defendant. The second defendant was the focus of the unsuccessful claim relating to the purported collateral contract, it having been the entity involved in the interactions and negotiations between the parties post 31 December 2013. 146 In accordance therefore with the general principle that costs should follow the event, I held that insofar as the plaintiffs had successfully obtained judgement against the first defendant for the sum of USS$2m with interest, they should be entitled to their costs from the first defendant of successfully obtaining such judgement. It was common ground between the parties that the plaintiffs had on 8 November 2017 served on the defendants an offer to settle; and that the first defendant having rejected the said offer to settle, the plaintiffs were entitled to their costs against it on a standard basis up to the date of service of the offer (8 November 2017) and on an indemnity basis from that date. It was also common ground between the parties that costs on an indemnity basis should generally be subject to a one-third uplift. It was also not seriously disputed that the bulk of the action in this case (or the “heavy lifting”, as it were) took place after the exchange of parties’ lists of documents in October 2017, and thus after the service of the offer to settle on 8 November 2017 – such that the bulk of the plaintiffs’ costs vis-à-vis the first defendant should be on the indemnity basis. 147 Insofar as the second defendant had successfully defended the claim against it based on purported collateral contract, I held that it should be entitled to its costs of defending such claim from the plaintiffs. The defendants’ counsel conceded that more time had been spent by counsel on the first defendant’s case, and indicated that he was agreeable to a 70:30 split between the first and the second defendants in terms of the amount of work done and thus the quantum of legal costs incurred. 148 As the present appeal is brought by the defendants, I will not address the arguments made on whether the plaintiffs were entitled to aBullockorSandersonorder, since my decision on this issue (that the plaintiffs were not so entitled) was in the defendants’ favour. 149 In respect of the quantum of costs to be awarded to the plaintiffs on the one hand and the 2nd defendant on the other, counsel’s submissions were unfortunately very far apart. The defendants’ counsel submitted that the 2nd defendant should be awarded $150,000 in costs for successfully defending the claim in purported collateral contract, and that the plaintiffs should get only $40,000 in costs for obtaining judgement because they had failed on at least half of their pleaded causes of action and deserved to have their costs discounted accordingly. The plaintiffs’ counsel submitted that they should be awarded $200,000 in costs, addinginter aliathat they proposed the award of costs for a notional sixth day of trial to address the additional work which had been caused by Capt Seow giving new evidence in cross-examination. As for the 2nd defendant’s costs, the plaintiffs’ counsel submitted that it should get only $14,000 costs because the cause of action it had succeeded in defending related to only “two of the six issues pleaded” in the Statement of Claim. 150 In respect of the quantum of costs to be awarded to the plaintiffs, I did not think the submissions by the defendants’ counsel for a substantial discount on those costs was reasonable. Whilst the plaintiffs did not succeed on their claims in misrepresentation, collateral contract and acknowledgement of debt, their success on the claims under the Rig Purchase Agreement and for total failure of consideration meant that they got substantively the outcome they had always sought from the outset; namely, the return of the US$2m. On the claim in misrepresentation, the defendants’ counsel conceded that he could not in good conscience say that this claim was plainly unsustainable from the outset. As for the claim in acknowledgement of debt, very little of the parties’ time was spent on this issue both in cross-examination and in closing submissions. In the circumstances, I did not think it fit to apply a substantial discount to the plaintiffs’ costs for obtaining judgement against the first defendant. At the same time, having regard to the nature of the legal and evidential issues covered at trial, I did not view the present case as one where it would have been appropriate to award costs substantially in excess of the daily tariff of $17,000 per trial day denoted in theAppendix Gcosts guidelines. I also did not see any basis for awarding the plaintiffs costs for a notional sixth day of trial. However, in respect of the fifth (and last) day of trial, I treated this as a full day of trial although the hearing that day ended shortly after 2 pm; and I was also prepared to allow a modest uplift in costs in light of the quantity of documentary evidence involved in this case. 151 Having regard to the above reasons, I fixed the plaintiffs’ costs against the first defendants at $120,000. Disbursements were agreed between the parties at $104,762.91. 152 In respect of the quantum of costs to be awarded to the second defendant for successfully defending the claim in collateral contract, whilst I agreed with the plaintiffs’ counsel that some discount was warranted in principle in light of the inevitable overlap between work done for the first defendant and work done for the second defendant, I did not agree that the discount should be as steep as that proposed by the plaintiffs. In addition, as noted earlier, the defendants’ counsel had indicated his willingness to accept a 70:30 split between the first and the second defendants in terms of the amount of work done, which apportionment I found to be a reasonable starting-point. Having regard to the nature of the legal and evidential issues involved in the claim in collateral contract and also to the views I expressed earlier on the tariff costs figures in theAppendix Gguidelines, I fixed the second defendant’s costs at $65,000. 153 In respect of the second defendant’s disbursements, the only item in any real dispute was the item relating to the costs of engaging the defendants’ Mexican law expert. The defendants’ counsel submitted that although they had argued in the main that the law governing the issue of formation of a collateral contract was properly Singapore law (as thelexfori), it was nevertheless reasonable for the second defendant to have engaged a Mexican law expert to address in the alternative the application of Mexican law, because this area of law was a very fraught and uncertain one. I did not agree with this submission. In my view, it should have been clear to both parties from the outset that insofar as the issue of formation of the alleged collateral contract was concerned, the three-stage test articulated inPacific Recreationcould not apply, becausePacific Recreationwas a case where the existence of the contract per se was never in dispute – unlike the present case. On the basis of the available authorities, that left either the putative proper law test or thelexfori; and for the reasons explained in [73] above, it was clear to me that if it came to deciding the putative proper law of an alleged collateral contract for the return of the rig deposits paid pursuant to the Rig Purchase Agreement, that putative proper law would in all probability be Singapore law. With respect, I considered that this was a fairly plain conclusion, given that parties had indisputably negotiated the Rig Purchase Agreement and contemplated the execution of the draft Shipbuilding Contract with reference to Singapore law as the governing law. For these reasons, I did not find the item of disbursement relating to the defendants’ Mexican law expert to have been reasonably incurred; and I disallowed this item. The plaintiffs too were not awarded the disbursements relating to their Mexican law expert.  The second defendant’s disbursements were fixed at $16,520.34 (the remaining items being undisputed by the plaintiffs). Mavis Chionh Sze ChyiJudicial Commissioner Samuel Richard Sharpe and Zheng Shengyang, Harry (Selvam LLC) for the plaintiffs;Chan Tai-Hui, Jason and Oh Jialing, Evangeline (Allen & Gledhill LLP) for the defendants."
    }
}