{
    "case_title": "Ram Niranjan vNavin Jatia and others and another suit",
    "ncitation": "[2019] SGHC 138",
    "coram": "Chua Lee Ming J",
    "sections": {
        "Introduction": "1 Sadly, this was yet another case involving disputes between family members over property and money. In this case, the disputes were between a son and his parents. The disputes centred around various matters including a residential property of some 10,600 square feet, two office units, shares in a company and investments in bonds. 2 The facts were ugly. In one incident, the father exposed himself to his son in the presence of his daughter-in-law and grandson. In another incident, the son called the police who arrested his father and mother for trespass and they spent a night in the lock-up. In her affidavit of evidence-in-chief (“AEIC”), the mother declared in no uncertain terms that “[she does] not have a son”;1Foot Note 1×Mrs Ram’s AEIC, at para 43.she repeated this during her oral testimony. 3 The present proceedings involved two actions which were consolidated – Suit 911 of 2016 (“Suit 911”) and Suit 139 of 2017 (“Suit 139”). 4 In Suit 911, the father, Mr Ram Niranjan (“Ram”), was the plaintiff. His son, Mr Navin Jatia (“Navin”) was the first defendant. Navin’s wife, Mdm Samridhi Jatia (“Mrs Navin”) was the second defendant. The third defendant, Evergreen Global Pte Ltd (“Evergreen”) was a company started by the plaintiff but which subsequently became controlled and managed by Navin. Ram’s wife/Navin’s mother, Mdm Shakuntala Devi (“Mrs Ram”), was the fourth defendant. She was a nominal defendant who effectively aligned her case with Ram’s. 5 Suit 911 also involved a counterclaim by Navin against Ram, and a third party action by Mrs Ram against Navin and Mrs Navin. 6 In Suit 139, Navin sued Ram for defamation arising from certain statements made by Ram to one Pankaj s/o Dhirajlal (“Pankaj”), a family friend. 7 Ram and Mrs Ram succeeded in some but not all of their claims in Suit 911. Navin’s counterclaim was dismissed, as was his claim in Suit 139. Appeals have been filed by all the parties in Suit 911. There is no appeal against the dismissal of S 139.",
        "Background": "8 The numerous claims in these proceedings were based on events that spanned over more than two decades.   The early-1990s – the family settled in Singapore 9 An Indian national by descent, Ram invested S$1m in Singapore in 1989 and became a Singapore permanent resident under a scheme for foreign investors. Mrs Ram also became a Singapore permanent resident. On 15 May 1989, Ram incorporated Evergreen.2Foot Note 2×Agreed Bundle, vol 3 (“3 AB”) at p 2576.As of 14 June 1989, Evergreen’s directors were Ram and one Mr Kamal Kishore (“Kishore”) who was Ram’s trusted business associate.  Evergreen’s issued share capital at incorporation was 11 shares.3Foot Note 3×3 AB 2539.On 1 December 1989, it was increased by 500,000 shares.4Foot Note 4×3 AB 2580–2582.As of 30 September 1990, Ram held 500,010 shares while Kishore held the remaining one share as Ram’s nominee.5Foot Note 5×3 AB 2587; Ram’s AEIC, at para 16.Evergreen’s main business was in exporting yarn, filament yarn and tyres to Nepal and the Indian sub-continent. 10 The newly-incorporated Evergreen needed an office. To that end, Ram bought unit #10-05 at High Street Plaza (“HS Unit #10-05”) for S$512,366 on 3 June 1989.6Foot Note 6×Ram’s AEIC, at para 16.At the same time, Ram continued with his trading and distribution businesses in Nepal in addition to the textile, televisions, lamp and umbrella factories that he had set up there.7Foot Note 7×Ram’s AEIC, at para 24. 11 Also in 1989, Navin moved to join his parents in Singapore and began serving his national service. He completed his national service in 1991 and became a Singapore citizen. Navin started working at Evergreen in mid-1991. 12 In 1993, Navin signed an option to purchase a piece of landed property at 44 Poole Road, Singapore (“the Poole Road property”) for S$2.88m.8Foot Note 8×1 AB 29–32.Navin exercised the option on 13 March 1993.9Foot Note 9×1 AB 33.The property comprised a detached bungalow on some 10,600 square feet of land. As a permanent resident, Ram could not own landed property without approval. 13 The purchase of the Poole Road property was completed in June 1993 in Navin’s sole name.10Foot Note 10×1 AB 42–45.Navin was then 23 years old.11Foot Note 11×Ram’s AEIC, at para 36.Of the purchase price of S$2.88m, S$2.3m was paid using a mortgage loan  from Overseas Union Bank Limited (“OUB”).12Foot Note 12×Plaintiff’s Bundle of Documents, vol 2 (“2 PB”) at p 53.Whether it was Ram or Navin who paid for the property was in dispute. However, it was not in dispute that the Poole Road property effectively functioned as the family home for the better part of the next 23 years or so. The mid-1990s to 2006 – Navin’s greater involvement in Evergreen and lead-up to the MOU 14 Ram spent a lot of his time in Nepal and India, in particular, after 1994 when there was political instability in Nepal. Between 1994 and 2004, Ram spent time in India trying to manage the problems that his businesses were facing in Nepal.13Foot Note 13×Ram’s AEIC, at para 40. 15 Meanwhile, in Singapore, Navin was appointed as a director of Evergreen on 14 September 1994.14Foot Note 14×3 AB 2629.Ram claimed that this was done without his consent. 16 In January 1995, Ram bought a second unit at High Street Plaza (“HS Unit #10-04”) for S$938,716.20. This unit is adjacent to HS Unit #10-05, which Ram already owned. 17 On 3 April 1995, the board directors of Evergreen (“the Board”) approved the transfer of the one share held by Kishore to Navin; the transfer was effected on 29 April 1995.15Foot Note 15×3 AB 2681 and 2684.On 4 April 1995, Kishore resigned from his directorship in Evergreen.16Foot Note 16×3 AB 2682.At the end of 1995, the directors of Evergreen were Ram, Navin and one Mr Om Prakash.17Foot Note 17×3 AB 2701.On 10 December 1996, Om Prakash resigned and was replaced by Mrs Navin.18Foot Note 18×3 AB 2719. 18 Between 1995 and September 2006, the following allotments/transfers of shares in Evergreen took place: DateTransfer/allotmentShareholding29 Apr 1995Kishore transferred the one share held by him to Navin.Ram:                     500,010Navin:                              15 Mar 1996499,989 shares were allotted to Ram.Ram:                     999,999Navin:                             125 Oct 2002Ram transferred 499,999 shares to Mrs Ram.Ram:                     500,000Mrs Ram:             499,999Navin:                              130 Sep 20066m shares were allotted to Ram (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares).Ram:                  1,750,000Mrs Ram:          1,750,000Navin:                  3,500,000 Ram claimed that the above allotments and transfers were carried out without his knowledge or consent. 19 By 2006, Ram and Navin were at loggerheads. The reasons were in dispute. Amongst others, Ram claimed that during a quarrel sometime in 2001 over matters relating to Evergreen’s business, Navin threw a punch at him. Mrs Ram managed to pull Ram away and Navin’s punch landed on a glass window, breaking the glass.19Foot Note 19×Ram’s AEIC, at para 50.Subsequently, Ram’s younger daughter, Kalpana Binani (“Kalpana”), and her husband, Braj Binani (“Braj”) stepped in to mediate.20Foot Note 20×Braj’s AEIC, at para 11.Navin denied throwing the punch at Ram. Another incident took place in December 2006 during which Navin allegedly tried to hit Ram again. Kalpana and Braj were again summoned to Singapore to mediate.21Foot Note 21×Braj’s AEIC, at paras 15-16; Ram’s AEIC, at para 59. 20 This time, the mediation led to a Memorandum of Understanding dated 9 December 2006 being signed by Ram, Mrs Ram and Navin (“the MOU”). Mrs Navin was named as a party to the MOU but she did not sign the MOU. The reason why she did not sign was in dispute. Whether the MOU was intended to be legally binding was also in dispute. Under the MOU: (a) Clause 1 provided that Evergreen would have a “revised Capital structure” under which Ram would hold 25%, Mrs Ram 25% and Navin 50%. (b) Clause 2 provided that in view of the “restructured shareholding pattern”, Navin would ensure that the personal guarantees which Ram, Mrs Ram and Mrs Navin had given to Evergreen’s bankers will be discharged “at the earliest possible convenience”. (c) Clause 3 provided that Ram will remain as a “non-executive Director” and “elected Chairman of the Board of the Company”. Clause 4 provided that Navin will assume the role of managing director and “will have effective control of the day-to-day operations of the company” and if necessary, Evergreen’s operations will be supported by Navin’s personal guarantee secured by his personal assets. (d) Clause 5 provided for a power of attorney to be given by Evergreen to Navin for “running the day to day operations of the company” and on terms which included the following: (i) Clause 5(i): The term of office will be from 1 October 2006 until 31 December 2011 and will be subject to renewal thereafter. (ii) Clause 5(ii): Navin will be paid a remuneration of S$35,000 per month. (iii) Clause 5(ix): Navin was under an “obligation … to arrange to provide SGD360,000 in three prior instalments in favour of [Ram] and [Mrs Ram] effective 1/10/2006 till further advice towards meeting expenses in Nepal and Mumbai and out of pocket expenses” (“the Annual Allowance”). It was not disputed that payment of the Annual Allowance could take the form of dividends from Evergreen or director’s fees to Ram.22Foot Note 22×NE, 15 August 2018, at 91: 8–19.It was also not disputed that the Annual Allowance was paid up to 2013.23Foot Note 23×NE, 19 July 2018, at 48: 13–17. (iv) Clause 5(xii): Ram “has provided one office block to be used by [Evergreen] and till such time he has extended this to be used by the company. The company will be under obligation to meet all its outgoings in running and maintaining the office”. (v) Clause 5(xiii): Navin “shall be under obligation to acquire a residential property for [Mrs Ram] to the extent of US$1 million anywhere as she desired”. To exercise this right of hers, Mrs Ram had to first indicate her desire for such a property in writing to Navin. (vi) Clause 5(xvii): Ram and Mrs Ram “have absolute discretion of right of stay with full comforts in [the Poole Road property] for their entire lives.”   2007 to 2015 The Bonds 21 In May 2007, Ram opened an account with UBS AG (“UBS”), in his and Mrs Ram’s names, for purposes of making investments (“Ram’s UBS account”). Navin managed the investment of the moneys in Ram’s UBS account and invested Ram’s monies in bonds (“the Bonds”). The Bonds were paid for in part using loans from UBS. The actual amount invested for Ram was in dispute. Navin claimed that the Bonds were a joint investment by Ram and him, in “about equal shares”.24Foot Note 24×Navin’s AEIC, at para 73.The Bonds were held in an account held by La Brasserie Corporation Ltd (“La Brasserie”), an entity controlled by Navin and Mrs Navin.25Foot Note 25×Navin’s AEIC, at para 72.Ram asserted that his bonds should have been held by an entity called Mandalay Global Assets Ltd (“Mandalay”) instead.26Foot Note 26×Ram’s AEIC, at para 88.Mandalay was company incorporated in The Bahamas and was owned and managed by UBS Trustees. Initially, the beneficial owners were Ram and Mrs Ram.27Foot Note 27×1 AB 402.In February 2013, Mrs Navin was added as the third beneficial owner.28Foot Note 28×1 AB 545–546. Further allotments of shares in Evergreen 22 Between 2007 and 2008, there were two more allotments of shares. DateTransfer/allotmentShareholding13 July 20071,040,000 shares were allotted to Ram (260,000 shares), Mrs Ram (260,000 shares) and Navin (520,000 shares).Ram:                 2,010,000Mrs Ram:          2,010,000Navin:               4,020,00025 Aug 20081.96m shares were allotted to Ram (490,000 shares), Mrs Ram (490,000 shares) and Navin (980,000 shares).Ram:                 2,500,000Mrs Ram:         2,500,000Navin:               5,000,000 Again, Ram claimed that these allotments were made without his knowledge and consent. Transfer of one share to Mrs Navin 23 On 28 December 2012, Navin transferred one share in Evergreen to Mrs Navin.29Foot Note 29×Navin’s AEIC, at para 44.Once again, Ram claimed that the transfer was without his knowledge and consent. Events leading up to the 2015 Deed 24 Unfortunately, the MOU did not end the disputes between Ram and Navin. Navin stopped paying the Annual Allowance after October 2013.30Foot Note 30×NE, 19 July 2018, at 48:13–17.About a month later, Braj and Kalpana found out about this. Braj asked Navin why he was not paying the Annual Allowance to his parents in accordance with the MOU.31Foot Note 31×Braj’s AEIC, at paras 32-33. 25 Ram alleged that when Navin refused to pay the Annual Allowance, he asked Navin to transfer the Bonds to him but Navin did not do so.  In early July 2014, Ram found out from UBS that there were no bonds held in his UBS account. As stated earlier, the Bonds were held in La Brasserie’s name. Navin admitted that in July 2014, Ram asked him to transfer the Bonds to Mandalay.32Foot Note 32×Navin’s AEIC, at para 75.On 24 July 2014, Navin instructed UBS to transfer the Bonds (together with the outstanding loans) to Mandalay.33Foot Note 33×1 AB 587–589.Subsequently, Navin changed his mind. According to Navin, this was because Ram had started demanding that Navin transfer his shares in Evergreen, the Poole Road property and US$5m to Ram. Ram disputed Navin’s allegation. In November 2014, Navin instructed UBS to liquidate the Bonds instead.34Foot Note 34×Navin’s AEIC, at para 76.The proceeds from the sale of the Bonds plus interest income amounted to US$4,270,058.83.35Foot Note 35×NE, 17 August 2018, at 75:5.Navin held on to the entire sum, and claimed that he did so because he wanted to discuss a global settlement with Ram. 26 Also in November 2014, Mrs Ram left Ram. Ram claimed that this was because of his strained finances at the time, which in turn stemmed from Navin’s refusal to pay the Annual Allowance and Ram’s share of the moneys from the investment in the Bonds. According to Mrs Ram, however, she left Ram after quarrelling with him over his threats to close down Evergreen as a result of his disagreements with Navin. 27 On 2 January 2015, Mrs Ram and Navin entered into an agreement (“the SPA”) for the sale of Mrs Ram’s 25% shareholding in Evergreen to Navin for US$1,962,000. Mrs Ram sought to set aside the SPA in the third party proceedings. Under the terms of the SPA,36Foot Note 36×1 AB 861–864. (a) the transfer of the shares to Navin was to take place upon Mrs Ram’s demise; (b) pending the transfer, Mrs Ram was to grant an irrevocable power of attorney to Navin to deal with all the rights and interests with respect to the shares; and (c) in the event Mrs Ram breached the terms of the SPA, Navin would be entitled to transfer the shares to himself forthwith. 28 Pursuant to the SPA, Mrs Ram signed a power of attorney dated the same day, in favour of Navin (“the POA”).37Foot Note 37×1 AB 868–869.Navin paid Mrs Ram the sum of US$1,962,000 by way of a cheque dated the same day.38Foot Note 38×1 AB 865.Navin also signed a letter addressed to Mrs Ram, stating that he “will endeavour to provide [her] the sum of SGD180,000 per year, to the best of [his] ability, towards [her] housing/living maintenance expenses etc”.39Foot Note 39×1 AB 866. 29 On 26 March 2015, Mrs Ram signed a Revocation of Power of Attorney purporting to revoke the POA.40Foot Note 40×1 AB 893–894.This was sent to Navin and Evergreen on 30 March 2015.41Foot Note 41×1 AB 891–892.By a letter dated 6 April 2015, Navin informed Mrs Ram’s then-solicitors that he had exercised his right pursuant to the SPA and transferred the purchased shares to himself.42Foot Note 42×1 AB 895. 30 Ram claimed that he did not know about the signing of the SPA at the time. Mrs Ram left him in November 2014 and he only met Mrs Ram again in January 2015 at a family wedding in Bangkok where they then reconciled.43Foot Note 43×Ram’s AEIC, at paras 100–101. The 2015 Deed and September Agreement 31 Eventually, Braj and Navin’s father-in-law were roped in to mediate the disputes between Ram and Navin. A meeting was scheduled for 11 August 2015. Before the scheduled meeting of 11 August 2015 could take place however, on 6 August 2015, Ram, Mrs Ram, Navin and Mrs Navin signed a settlement deed (“the 2015 Deed”).44Foot Note 44×2 AB 952–956.Pursuant to the 2015 Deed: (a) Navin paid Ram US$2m “in full and final settlement of all or any Issues (including any claim(s) thereto) arising between them.” The term “Issues” was defined as “disagreements over matters concerning personal business styles, work aptitudes, monies and other personal matters/concerns … which have created certain disharmony within the family or amongst the individual members”. (b) Each party agreed to henceforth “conduct himself/herself in the best possible manner so as to achieve a good and harmonious relationship with one another and also vis-à-vis [Evergreen] (including its officers, employees, agents or otherwise) so as to enhance [Evergreen’s] growth and success in whichever way possible” (“the harmonious relationship clause”). (c) The parties also agreed and confirmed that the 2015 Deed “revokes and supersedes all previous agreements, arrangements and/or understandings made between them (including those made individually between certain parties to [the 2015 Deed], without the involvement of all four parties herein)”. 32 Also around this time, Navin transferred his entire 10% shareholding in another company called EG Global Holdings Pte Ltd (“EG Global”) to Ram.45Foot Note 45×Navin’s AEIC, at para 36.The remaining 90% of the shares in EG Global were held by Ram (45%) and Mrs Ram (45%).46Foot Note 46×1 AB 516–519.According to Navin, the transfer to Ram was at Ram’s request and made by Navin as a gesture of goodwill.47Foot Note 47×Navin’s AEIC, at para 36. 33 The 2015 Deed was followed soon after by a further agreement dated 1 September 2015 (“the September Agreement”) signed by the same parties to the 2015 Deed. In the September Agreement,48Foot Note 48×2 AB 988. (a) Navin stated that, based on Ram’s and Mrs Ram’s request, he agreed to execute a deed of gift and power of attorney to transfer to Mrs Ram 7,300 shares in an Indian company called Janson Engineering and Trading Company Pte Ltd (“Janson”); and (b) the parties agreed that henceforth, “[they] will each retain the assets held in respective names and will be free to deal with the same in any manner”. 34 Ram claimed49Foot Note 49×Ram’s AEIC, at paras 103–106.that he had signed the 2015 Deed on the understanding that Navin would (a) return to Mrs Ram the shares in Evergreen which Navin had transferred to himself pursuant to the SPA; (b) pay Ram the Annual Allowance; (c) return one unit at High Street Plaza to Ram; and (d) return the shares in Janson to Mrs Ram. Ram alleged that Navin held the shares in Janson on trust. Navin disputed any such understanding. Navin did transfer 7,300 shares in Janson to Mrs Ram but he said that the transfer was pursuant to the September Agreement. 2016 35 Any flicker of hope for a harmonious relationship after the 2015 Deed and the September Agreement dissipated soon enough. Navin alleged that on or about 14 January 2016, Ram defamed him during a conversation with Pankaj. In March 2016, Navin commenced action against Ram for defamation. That action was subsequently transferred to the High Court and became Suit 139. 36 Also, life over at the Poole Road property was anything but harmonious. Ram and Mrs Ram alleged that Navin and Mrs Navin attempted to make life miserable for them at the Poole Road property. Ram gave the example of the visit by his elder brother and sister-in-law in May 2016. They had come from India to visit Ram and Mrs Ram at the Poole Road property. Ram alleged that it was an embarrassing episode for him, as his guests saw for themselves how Ram and Mrs Ram were effectively restricted to living in their bedroom.50Foot Note 50×Ram’s AEIC, at para 126.Ram also alleged that his guests were not accorded the respect due to them as elders.51Foot Note 51×Ram’s AEIC, at para 130. 37 CCTV recordings at the Poole Road property were played in court showing Ram shouting and hurling vulgarities. One recording showed Ram walking around the house holding a knife which he had obtained from the kitchen. Ram claimed that he was merely going to cut a piece of rope. Another recording showed Ram banging and kicking at a door to one of the rooms. On 12 July 2016, Mrs Navin obtained an expedited protection order against Ram (on anex partebasis), on the grounds that there was imminent danger of family violence being committed against her and her children.52Foot Note 52×2 AB 1121.The order was eventually discharged on the ground that a personal protection order was not necessary because (a) there was no physical violence, (b) Mrs Navin had proved only one incident of family violence against her, and (c) Ram had confirmed that he would not return to the Poole Road property as long as Navin and Mrs Navin lived there.53Foot Note 53×2 AB 1373–1375. 38 On 14 July 2016, Mrs Ram was unwell and suffered from body aches. Navin’s sister, Kusum Jain, arranged for a lady to go to the Poole Road property to give Mrs Ram a massage. Navin was not at home. Mrs Navin spoke to him about it and he told her to call the police, which she did. Navin claimed that he told Mrs Navin to call the police because Mrs Ram did not respond to her questions about the lady. Navin claimed that he did not want illegal helpers working in the house and that Ram had previously threatened to report to the Ministry of Manpower that Navin had illegal maids at the Poole Road property. 39 On 31 July 2016, an incident happened at the Poole Road property during which Ram reacted to something Navin said by pulling down his pants and exposing himself to Navin in the presence of Navin’s wife and son. The CCTV recording of this incident was played in court. Ram claimed that Navin had told him “I will f--- you”. Navin denied this. The CCTV had no voice recording. Navin called the police who, upon arrival, advised Ram to leave the Poole Road property. 40 Ram returned to the Poole Road property the next day. Navin called the police again. What actually happened after the police arrived was in dispute. In the event, the police arrested both Ram and Mrs Ram and charged them with criminal trespass.54Foot Note 54×NE, 20 July 2018, at 150:23–151:16.Ram and Mrs Ram spent the night in the police lock-up and were released on bond the next day. Ram claimed that since then, Mrs Ram and he have not been able to access the Poole Road property to pack and retrieve their belongings. Although Navin had his parents’ belongings packed and sent to them, Ram and Mrs Ram alleged that many of their belongings were missing.",
        "The claims in Suit 911": "41 In summary, Ram’s claims in Suit 911 were primarily for: (a) minority oppression under s 216 of the Companies Act (Cap 50, 2006 Rev Ed) in relation to the affairs of Evergreen; (b) various allotments and transfers of shares in Evergreen to be set aside; (c) orders enforcing the terms of the MOU; (d) payment of his share of the proceeds of sale of the Bonds; (e) the 2015 Deed to be set aside; and (f) delivery up of his belongings, alternatively, damages for conversion. 42 Mrs Ram’s claims against Navin and Mrs Navin in the third party proceedings were mainly for: (a) orders enforcing the MOU; (b) the SPA to be set aside and the shares in Evergreen transferred back to her; (c) the 2015 Deed and September Agreement to be set aside; and (d) delivery up of her belongings, alternatively, damages for conversion. 43 Navin’s counterclaims in Suit 911 were for: (a) the return of the sum of US$2m paid to Ram pursuant to the 2015 Deed; (b) the return of the 7,300 shares in Janson that were transferred to Mrs Ram; and (c) the return of the shares in EG Global that were transferred to Ram. Navin’s counterclaims were based on his allegation that Ram had breached the harmonious relationship clause under the 2015 Deed.",
        "The 2015 Deed and September Agreement": "44 Navin’s and Mrs Navin’s main defence was that the 2015 Deed and the September Agreement constituted a full and final settlement of all disputes between the parties which had arisen at the time.55Foot Note 55×Defence and Counterclaim (Amendment No 5) (“D&CC”), at para 62f. 45 Ram’s case was that the 2015 Deed was void for uncertainty, or alternatively, that it was voidable for misrepresentation, duress, undue influence, unconscionability, and/or material non-disclosure.56Foot Note 56×Statement of Claim (Amendment No 3) (“SOC”), at paras 98, 102, 102B and 103.Mrs Ram pleaded much the same, with the additional reliance on the doctrine ofnonest factum.57Foot Note 57×4th Defendant’s Statement of Claim (Amendment No 2) (“D4SOC”), at paras 42, 45 and 47C. Whether the 2015 Deed was void for uncertainty 46 A contract is valid and enforceable if its terms are certain. A term is uncertain if there is no objective or reasonable method of ascertaining how the term is to be carried out:RudhraMinerals Pte Ltd v MRI Trading Pte Ltd (formerly known as CWT Integrated Services Pte Ltd)[2013] 4 SLR 1023 at [32]. At the same time, courts do strive to uphold contracts where possible rather than striking them down:Climax Manufacturing Co Ltd vColles Paragon Converters (S) Pte Ltd[1998] 3 SLR(R) 540 at [22] and [26]. 47 As stated in [31(a)] above, the 2015 Deed was stated to be in full and final settlement of all “Issues”. Ram submitted that the definition of “Issues” was uncertain. Ram also argued that it was not clear what previous agreements, arrangements and/or understandings were superseded by the 2015 Deed (see [31(c)] above). 48 I disagreed with Ram. The 2015 Deed defined “Issues” as those “disagreements over matters concerning personal business styles, work aptitudes, monies and other personal matters/concerns … which have created certain disharmony within the family or amongst the individual members”. Although it could have been better drafted, in my view, the definition was sufficiently certain to be enforceable. The 2015 Deed also purported to revoke and supersede all past agreements and understandings. Such a provision is commonly found in settlement agreements and I was of the view that there was nothing ambiguous or uncertain about the provision. During oral submissions, Ram’s counsel agreed that such a provision was not uncertain.58Foot Note 58×NE, 6 September 2018, at 22:8–12. Whether the 2015 Deed ought to be set aside for misrepresentation 49 Ram’s pleaded case was that he was induced to sign the 2015 Deed by Navin’s misrepresentations that he would arrange for the Annual Allowance to be paid and for the Evergreen shares sold to him under the SPA to be returned to Mrs Ram (as trustee for Ram) after Ram signed the 2015 Deed.59Foot Note 59×SOC, at para 103(1); Plaintiff’s Closing Skeletal Arguments (5 September 2018) (“PCS”) at para 143.Navin did neither. 50 Mrs Ram pleaded that Navin had made life very unpleasant at the Poole Road property, and that she signed the 2015 Deed in reliance on Navin’s misrepresentation that things “would return to normal” if she signed the 2015 Deed.60Foot Note 60×D4SOC, at paras 42(e) and (g).According to Mrs Ram, Navin continued to make life unhappy for her. 51 An actionable misrepresentation consists in a false statement ofexisting or past factmade by one party before or at the time of making the contract, which is addressed to the party misled, and which induces that party to enter into the contract:Tan Chin Seng and others v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [20], citingAnson’s Law of Contract(28th Ed, 2002) at p 237. In other words, an actionable misrepresentation does not operate on statements of intention. 52 It was not necessary for me to make any finding as to whether Navin made the representations as alleged. It was clear that both Ram’s and Mrs Ram’s pleaded cases on misrepresentation were based on statements of intention and not existing fact, and therefore failed. A statement of intention can be a representation of existing fact where the representor did not in fact hold the intention he was expressing. However, this was not pleaded by Ram and Mrs Ram. Whether the 2015 Deed was voidable for duress, undue influence or unconscionability 53 Ram pleaded that there was a relationship of trust and confidence between Navin and him. He also pleaded that he was dependent on Navin for the Annual Allowance, had nowhere else to stay in Singapore apart from the Poole Road property, was cash-strapped and could not maintain his and Mrs Ram’s then-standard of living. The 2015 Deed, according to Ram, was manifestly disadvantageous to him because it effectively meant that he waived all his claims to the moneys from the Bonds, which were his to begin with. Moreover, the US$2m he received under the 2015 Deed was highly disproportionate to the value of all the entitlements he had to relinquish in exchange, such as the proceeds of the Bonds, the Evergreen shares that Mrs Ram sold to Navin (which Ram claimed was held on trust for him by Mrs Ram), the payment of the arrears of the Annual Allowance and resumption of payment thereof.61Foot Note 61×SOC, at para 102A. 54 Mrs Ram pleaded that she did not receive any benefit for entering into the 2015 Deed. Navin had ceased to pay her and Ram the Annual Allowance since 2013. She also did not receive independent legal or financial advice before entering into the 2015 Deed.62Foot Note 62×D4SOC, at paras 42(c), (d) and (i). Economic duress 55 There are two elements in duress. First, there had to be pressure amounting to compulsion of the victim’s will. Second, the pressure exerted had to be illegitimate:E C Investment Holding Pte Ltd vRidout Residence Pte Ltd and another[2011] 2 SLR 232 at [48]. 56 Both Ram and Mrs Ram claimed that they signed the 2015 Deed under economic duress. Navin stopped paying the Annual Allowance to his parents in 2013. Ram claimed that he was in a vulnerable financial position, having been deprived of the Annual Allowance and his Bonds, and that Navin was adamant that Ram had to sign the 2015 Deed before he would receive either.63Foot Note 63×PCS, at paras 146–147. 57 Mrs Ram’s case appeared to be that the economic duress arose because Navin stopped paying her half share of the Annual Allowance in 2013. 58 In my view, Ram and Mrs Ram failed to prove economic duress. Mrs Ram received the US$1,962,000 in January 2015 pursuant to the SPA. Ram had access to those funds since, according to him, the shares that Mrs Ram sold under the SPA, were held by Mrs Ram on trust for him (a fact that Mrs Ram confirmed64Foot Note 64×Mrs Ram’s AEIC, at para 12.). That amount was left intact until a full six months later. Even then, US$1m was withdrawn not for the purposes of meeting daily expenses, but for the purposes of investment.65Foot Note 65×NE, 19 July 2018, at 61:7–62:5.Neither Ram nor Mrs Ram gave any credible explanation why they did not have to make use of the proceeds from the sale of the shares under the SPA for their living expenses. The inescapable conclusion was that they were not in such a desperate need for money for their living expenses, as they claimed. 59 Further, the evidence did not support any compulsion of will: (a) Ram testified that he signed the 2015 Deed on the understanding that Navin would return the shares in Evergreen, pay the Annual Allowance, return one unit at High Street Plaza to Ram, and return the shares in Janson (see [34] above). It seemed to me that the evidence was more consistent with the striking of a bargain than any compulsion of will. (b) Mrs Ram testified that she signed the 2015 Deed “because Ram had signed it.”66Foot Note 66×Mrs Ram’s AEIC, at para 42.This put paid to any allegation of compulsion of will. Undue influence 60 InBOM v BOK and another appeal[2019] 1 SLR 349 (“BOM v BOK”), the Court of Appeal provided a useful summary on the law of undue influence (at [101]). Essentially, there are two classes of undue influence: (a) “Class 1” undue influence, also known as actual undue influence, requires the plaintiff to show that he entered into the impugned transaction because of the undue influence exerted upon him by the defendant. To do this, the plaintiff has to demonstrate that: (i) the defendant had the capacity to influence him; (ii) the influence was exercised; (iii) its exercise was undue; and (iv) its exercise brought about the transaction. (b) “Class 2” undue influence, also known as presumed undue influence, does not require the plaintiff to prove actual undue influence. Instead, it suffices for the plaintiff to show (i) that there was a relationship of trust and confidence between him and the defendant; (ii) that the relationship was such that it could be presumed that the defendant abused the plaintiff’s trust and confidence in influencing the plaintiff to enter into the impugned transaction; and (iii) that the transaction was one that calls for an explanation. This class of undue influence is further divided into “Class 2A” and “Class 2B” undue influence. (i) Under “Class 2A” undue influence, there are relationships that the law irrebuttably presumes to give rise to a relationship of trust and confidence. Once the plaintiff shows that his relationship with the wrongdoer triggers the presumption and that the impugned transaction calls for an explanation, there is arebuttablepresumption that the wrongdoer has exerted undue influence. (ii) Under “Class 2B” undue influence, the plaintiff must prove that there is a relationship of trust and confidence. If it is shown that there was such a relationship and that the transaction calls for an explanation, then there is arebuttablepresumption of undue influence. 61 In my view, both Ram and Mrs Ram failed to prove undue influence (whether actual or presumed). The evidence simply did not support their case. 62 With respect to actual undue influence, Ram and Mrs Ram relied on the same allegations that they relied on for economic duress. For the same reasons discussed above, I concluded that they did not sign the 2015 Deed under any actual undue influence. 63 As for presumed undue influence, Ram relied on both Class 2A and Class 2B undue influence. As for Mrs Ram, it was not clear if she was relying on Class 2A undue influence but it was at least clear that she did rely on Class 2B undue influence. In any event, with respect to Class 2A undue influence, in a parent-child relationship, the presumption that the parent has influence over the child arises out of the authority that a parent inherently has over his/her child, in particular a young child. There is no presumption that a child has influence over the parent, merely by reason of the parent-child relationship. Indeed, even as between an adult child and elderly or senile parents, no presumption of influence over the parents arise:Chitty on Contractsvol 1 (H G Beale gen ed) (Sweet & Maxwell, 33rd Ed, 2018) at para 8-080. 64 Although Class 2A undue influence was not applicable, Ram and Mrs Ram could still rely on Class 2B undue influence if they could prove a relationship of trust and confidence reposed by them in Navin, and that the transaction called for an explanation. 65 However, in my judgment, the evidence showed that at the time the 2015 Deed was signed, the relationship between Ram/Mrs Ram and Navin was anything but one of trust and confidence. The MOU, signed in 2006, did not end the disputes between Ram and Navin. Instead, by the time the 2015 Deed was signed, there was palpable distrust between Ram and Navin as a result of, among other things, the disputes over the non-payment of the Annual Allowance after 2013, the Bonds and the SPA. As for Mrs Ram, there could not have been any relationship of trust and confidence between her and Navin either. By then, there were the disputes over the Annual Allowance and the SPA (in connection with which she had revoked the POA). Braj and Navin’s father-in-law had also been roped in to mediate the disputes. Even the 2015 Deed itself was stated to be a settlement of disagreements which “have created certain disharmony within the family or amongst the individual members”. 66 I therefore found that Ram and Mrs Ram failed to show that there was a relationship of trust and confidence reposed by them in Navin. Accordingly, the presumption of undue influence under Class 2B was not applicable. Unconscionability 67 Before me, Ram and Mrs Ram relied on the High Court’s decision inBOK v BOL and another[2017] SGHC 316 (“BOK v BOL”). InBOK v BOL, the High Court held that the doctrine of unconscionability forms part of the law of Singapore, and set out a three-stage test to determine whether a transaction is unconscionable (at [120]–[122]). First, there must be weakness on one side, which could arise from poverty, ignorance or other circumstances, like acute grief. Second, there must be exploitation of that weakness and a transaction at an undervalue would be a necessary component of this requirement. Third, upon the satisfaction of these two elements, it will be for the defendant to demonstrate that the transaction was fair, just and reasonable. 68 I concluded that there was no reason to set aside the 2015 Deed for unconscionability. Ram and Mrs Ram relied on the same allegations that they relied on for economic duress and undue influence. In my view, they had not shown that they were suffering from such a weakness as to invoke the doctrine. 69BOM v BOKwas the appeal against the High Court’s decision inBOK v BOL.The Court of Appeal’s decision was rendered after I had given my decision in the present case. InBOM v BOK, the Court of Appeal held (at [142]) that the narrow doctrine of unconscionability applies in Singapore. To invoke the doctrine, the plaintiff has to show that he was suffering from an infirmity that the other party exploited in procuring the transaction. Upon satisfaction of this requirement, the burden is on the defendant to demonstrate that the transaction was fair, just and reasonable. There is no requirement that the transaction was at an undervalue or that there was a lack of independent advice, but these are factors that the court will invariably consider. The Court of Appeal also clarified (at [141]) that the plaintiff’s infirmity must have been of sufficient gravity as to have acutely affected his ability to conserve his own interests. 70 In my view, there is nothing in the Court of Appeal’s decision inBOM v BOKthat changes my conclusion that Ram and Mrs Ram had not established unconscionability. Whether Mrs Ram could rely onnonest factum 71 Mrs Ram also relied on the doctrine ofnonest factumto set aside the 2015 Deed. The doctrine ofnonest factumoperates as an exception to the general rule that a person is bound by his signature on a contractual document even if he did not fully understand its terms. Two elements need to be established for this doctrine to be invoked. First, there must be a radical difference between what was signed and what was thought to have been signed. Second, the party seeking to rely on the doctrine must prove that he took care in signing the document, that is, he must not have been negligent. SeeMahidonNichiar bte Mohd Ali and others v Dawood Sultan Kamaldin[2015] 5 SLR 62 at [119]. 72 Navin brought Mr Mohan Singh, a lawyer, to the signing of the 2015 Deed. Mr Mohan Singh was the witness to the execution of the 2015 Deed by all the four parties. He also explained the 2015 Deed to Mrs Ram in Hindi. However, Mrs Ram claimed that nobody explained the deed to her.67Foot Note 67×Mrs Ram’s AEIC, at para 42.She admitted that Mr Mohan Singh was present but claimed that she could not understand him because his Hindi was poor. 73 Even if one assumed that Mrs Ram did not understand all or some of the terms of the 2015 Deed, she would not be able to rely onnonest factumso long as she knew that the document was a settlement deed. I rejected Mrs Ram’s claim that she did not understand the nature of the 2015 Deed. First, the disputes between Ram and Navin had escalated and Braj and Navin’s father-in-law had been roped in to mediate. The 2015 Deed was signed shortly before the scheduled date for the meeting with Braj and Navin’s father-in-law. Ram, Mrs Ram, Navin and Mrs Navin signed the 2015 Deed. I found it unbelievable that under these circumstances, she had no inkling at all as to what she was signing. Second, Ram knew that the 2015 Deed was a settlement deed. I found it unbelievable that he would not have told Mrs Ram that it was a settlement deed. 74 In any event, the evidence showed that Mrs Ram was clearly negligent in signing the 2015 Deed. According to her evidence, she took no steps to enquire as to the nature of the document even though Ram was present. Instead, she signed the 2015 Deed because Ram had signed it. In the circumstances, I concluded that Mrs Ram could not rely on the doctrine ofnonest factum. Whether the 2015 Deed should be set aside for material non-disclosure 75 Ram submitted that the 2015 Deed was a family arrangement and as such, it should be set aside because Navin failed to disclose a material fact, that is, Navin failed to disclose the actual amount of Ram’s share of the proceeds from the sale of the Bonds. 76 A family arrangement is an agreement between members of the same family intended to be generally and reasonably for the benefit of the family either by compromising doubtful or disputed rights or by preserving the family property or the peace or security of the family by avoiding litigation or by saving its honour:RajabaliJumabhoy and others v Ameerali R Jumabhoy and others[1997] 2 SLR(R) 296(“RajabaliJumabhoy”) (at [204]). In any family arrangement there must be honest disclosure by each party to the other of all such material facts known to him, relative to the rights and title of either, as are calculated to influence the other’s judgment in the adoption of the arrangement, and any advantage taken by either of the parties of the other’s known ignorance of such facts will render the agreement liable to be set aside:Halsbury’s Laws of Englandvol 18 (Butterworths, 4th Ed, 1977), at para 315. 77 Clearly, the 2015 Deed was a family arrangement as defined in RajabaliJumabhoy. The next question was whether Navin failed to disclose a material fact. 78 As stated in [25] above, Navin instructed UBS to liquidate the Bonds in November 2014 and he held on to the sale proceeds plus interest income amounting to US$4,270,058.83.68Foot Note 68×NE, 17 August 2018, at 75:5.Navin claimed that the Bonds were a joint investment by Ram and him in “about equal shares” (see [21] above). As will be seen later, I found that Ram’s share of the sale proceeds was US$3,442,378.29. Navin did not disclose this to Ram. Instead, his position was that Ram’s share was less than US$1.5m. 79 Obviously, Ram’s share of the sale proceeds was material since the 2015 Deed purported to settle all the existing disputes for a sum of US$2m to be paid to Ram. Navin had therefore failed to disclose a material fact. Accordingly, I set aside the 2015 Deed. 80 Navin’s and Mrs Navin’s case was that the 2015 Deed and the September Agreement constituted the overall settlement amongst the parties.69Foot Note 69×D&CC, at para 57d; Navin’s AEIC, at para 35.In the circumstances, having set aside the 2015 Deed, I also set aside the September Agreement. In any event, in my view, the effect of the September Agreement was merely to confirm that a full and final settlement had been reached under the 2015 Deed. The statement that the parties would retain the assets held in their respective names added nothing of significance. I would only add that even if the September Agreement survived the setting aside of the 2015 Deed, it would not have provided Navin and Mrs Navin any defence to the claims for breaches of the MOU or for the payment of Ram’s share of the proceeds of sale of the Bonds. 81 As Navin had paid US$2m to Ram pursuant to the 2015 Deed, I ordered Ram to return the sum of US$2m to Navin, subject to a set off against amounts that I ordered Navin to pay to Ram in this action. 82 I should add that even if the 2015 Deed were not set aside, it settled only disputes which had arisen at the time that it was signed. This was because the 2015 Deed settled only the “Issues” as defined in that document, and as defined, the term “Issues” was limited to disagreements which had created disharmony within the family or amongst the individual members. At the time the 2015 Deed was signed, there were no disputes over (a) Ram’s and Mrs Ram’s right under the MOU to stay at the Poole Road property, and (b) Mrs Ram’s claim under the MOU to payment of US$1m from Navin for the acquisition of a residential property. The 2015 Deed would not have caused Ram and Mrs Ram to lose these rights in any event.",
        "The MOU": "",
        "Whether the MOU was intended to be legally binding": "83 Navin and Mrs Navin submitted that the MOU was an informal family arrangement set out in writing, and that there was no intention to create legal relations by any party. I disagreed. 84 It is true that in social and domestic arrangements, there is a presumption that parties do not intend to create legal relations:Gay ChoonIng v Loh Sze Ti Terence Peter and another appeal[2009] 2 SLR(R) 332 (at [72]). Nevertheless, it bears reminding that the facts, context and circumstances in each case must be carefully considered. In my view, the presumption was easily rebutted in this case. An objective assessment of the facts showed that the parties clearly intended the MOU to be legally binding. 85 First, disputes had arisen between Ram and Navin over various matters. One of the more notable incidents was when Navin attempted to punch Ram during a heated quarrel.  Mrs Ram managed to push Ram aside and Navin’s fist shattered a glass window instead.70Foot Note 70×Mrs Ram’s AEIC, at para 10.Mrs Ram testified that during a “big disagreement” between Ram and Navin in 2006, Navin demanded that Ram give him shares in Evergreen.71Foot Note 71×Mrs Ram’s AEIC, at para 11. 86 Kalpana and Braj had to step in to mediate and the MOU was the result of that mediation. This was the context in which the MOU came to be signed. The matters agreed upon included (a) the capital structure of Evergreen; (b) the discharge of guarantees given by Ram and Mrs Ram in connection with Evergreen; (c) Ram’s and Navin’s roles in the company and Navin’s remuneration; (d) payment of the Annual Allowance; (e) Evergreen’s continued use of the office premises which belonged to Ram; and (f) Navin’s obligation to pay Mrs Ram US$1m to acquire a residential property of her choice. An additional provision relating to Ram’s and Mrs Ram’s right to stay at the Poole Road property was hand-written in by Navin. All of these were significant matters and reflected an agreement reached between Ram/Mrs Ram and Navin to resolve their differences. Navin himself acknowledged that he “had to try to resolve it somehow with [Ram]…”.72Foot Note 72×Navin’s AEIC, at para 30.In my view, the MOU was clearly intended to be legally binding. It was not just some informal family arrangement. 87 Second, many of the terms of agreement related to the business of Evergreen. These terms were more in the nature of a commercial settlement than a domestic arrangement. 88 Third, the provision relating to Ram’s and Mrs Ram’s right to stay at the Poole Road property was significant. As will be seen later, I concluded that it was Ram who wanted to buy and who paid for the Poole Road property. Navin became the registered owner only because Ram, not being a Singapore citizen, could not buy the property in his own name. The provision was proposed by Braj to protect Ram’s and Mrs Ram’s right to stay at the Poole Road property in express terms and Navin agreed. In my view, this showed that the MOU was intended to be legally binding; Ram and Mrs Ram would not be protected otherwise. I also accepted the testimony given by Braj (who mediated the dispute together with Kalpana) that the MOU was intended to be legally binding.73Foot Note 73×NE, 20 July 2018, at 37:20–24. 89 Fourth, the disputes between Ram/Mrs Ram and Navin led to two settlement agreements being signed – the MOU and the 2015 Deed. Both came about because of disputes between Ram/Mrs Ram and Navin. Both were entered into to resolve these disputes. Navin accepted that the 2015 Deed was legally binding but claimed that the MOU was not. In my view, there was no reason why the intention would have been different for both agreements, except for the fact that Navin wanted to rely on the 2015 Deed, but not the MOU, in this action. 90 Navin argued that the MOU could not have been intended to be legally binding because not all of the terms were subsequently followed. Although this was a relevant consideration, in my view, on an overall objective assessment of the evidence, it was clear that the MOU was intended to be legally binding. 91  It was also submitted that, in any case, the MOU was superseded by the 2015 Deed. As the 2015 Deed was set aside, this submission was moot.",
        "Annual Allowance": "92 Under cl 5(ix) of the MOU (see [20(d)(iii)] above), Navin was, and continues to be, obligated to provide the Annual Allowance of S$360,000 a year to Ram and Mrs Ram. It was not disputed that payment of the Annual Allowance could take the form of dividends from Evergreen or director’s fees to Ram.74Foot Note 74×NE, 15 August 2018, at 91:8–19.It was also not disputed that the Annual Allowance had not been paid since October 2013.75Foot Note 75×NE, 19 July 2018, at 48:13–17.Navin was therefore liable to pay Ram and Mrs Ram S$1,440,000 (ie, S$720,000 each)being arrears of the Annual Allowance for the years 2014–2017. Since I had set aside the 2015 Deed for material non-disclosure, I found that Navin is under a continuing obligation to pay his parents the Annual Allowance under the MOU. As provided in the MOU, the Annual Allowance is payable in three equal instalments,ie, on the first of October, February and June of each year.",
        "Mrs Ram’s claim for US$1m for a residential property": "93 Under cl 5(xiii) of the MOU (see [20(d)(v)] above), Navin is obligated to acquire a residential property for Mrs Ram worth up to US$1m anywhere she desired so long as she gives notice of such desire to Navin in writing. 94 Mrs Ram submitted that paragraph 6 of a letter dated 26 August 2016 from her lawyers to Navin’s lawyers constituted the requisite notice for the purposes of cl 5(xiii) of the MOU.76Foot Note 76×2 AB 1151–1154.I disagreed. Paragraph 6 of that letter merely asked Navin to confirm that he was ready and willing to perform his obligation under cl 5(xiii). 95 I granted a declaratory order that Navin is liable to pay Mrs Ram to the extent of US$1m upon receipt of the notice in writing as required under cl 5(xiii). Subsequently, I gave directions to implement the carrying out of Navin’s obligation under cl 5(xiii).",
        "The Poole Road property": "",
        "The purchase of the Poole Road property": "96 Ram claimed that he wanted to buy the Poole Road property but could not do so in his own name as he was not (and still is not) a Singapore citizen. Mrs Ram was also not a Singapore citizen and still is not a Singapore citizen. The property was therefore purchased in Navin’s name as he had become (and was the only one in the family who was) a Singapore citizen. Ram claimed that he paid for the property. 97 Navin, on the other hand, claimed that the Poole Road property was purchased and paid for by him. 98 I found on a balance of probabilities that it was Ram who wanted to buy the Poole Road property and that it was purchased in Navin’s name only because Ram, not being a Singapore citizen, could not buy it in his own name. I also found that it was Ram who paid for the property. 99 First, I accepted the evidence given by Braj that Ram had mentioned that he wanted to purchase a piece of landed property in Singapore for himself and Mrs Ram, and had brought Kalpana and him to view the Poole Road property before purchasing it, and that Navin was not present.77Foot Note 77×Braj’s AEIC, at paras 6–7.Braj gave his evidence objectively. There was no motive for him to lie about this. 100 Second, two days after Navin exercised the option to purchase the Poole Road property, an application was made to the Land Dealings (Approval) Unit for approval to take the title to the property in the names of Ram (65%) and Navin (35%), with both of them holding the property as tenants-in-common (“the LDU application”).78Foot Note 78×1 AB 34.This application was rejected on 12 April 1993.79Foot Note 79×1 AB 35.An appeal was made on 24 April 1993, this time, for approval for Navin and his parents to hold the property as joint tenants (“the LDU appeal”).80Foot Note 80×1 AB36–39.The appeal was also rejected.81Foot Note 81×1 AB 40.In my view, the LDU application and the LDU appeal were consistent with the fact that it was Ram who was buying the property. In particular, I noted the following: (a) Under the LDU application and the LDU appeal, Navin’s interest in the property was to be only 35% and 33.3% respectively. This was inconsistent with Navin’s claim that he bought the property by himself. Navin’s explanation was that Ram wanted to co-invest in the property.82Foot Note 82×NE, 7 August 2018, at 92:22 – 93:17.I rejected Navin’s explanation. Navin had no credible explanation for not having included this explanation in his AEIC.83Foot Note 83×NE, 7 August 2018, at 93:18–94:1. (b) The LDU application expressly stated that the Poole Road property was intended to be used as a family residence. This was more consistent with Ram buying the property as Navin was not married then. 101 Third, Navin moved to Singapore in 1989 and finished his national service in mid-1991. The Poole Road property cost S$2.88m. The cash outlay was S$580,000. The balance of S$2.3m was paid with a mortgage loan. According to Navin, he repaid the mortgage loan within six years. I found it highly unlikely that Navin, at the age of 23 in 1993, would have had the means to buy the Poole Road property for $2.88m, paying S$580,000 in cash and repaying a S$2.3m loan over six years. 102 In his AEIC, Navin claimed that the funds that he used to pay for the Poole Road property were from “a combination of [his] overseas brokerage business/investments and salary/fees/loans from Milansar Pte Ltd (“Milansar”) and Evergreen.84Foot Note 84×Navin’s AIEC, at para 57.Milansar was a company that Ram incorporated in Singapore in 1981; it was eventually closed down in December 2007. I did not believe Navin’s claim for the following reasons: (a) Navin claimed that he was able to pay for the property as he “had already been running the family business since 1991” and had “helped to increase the annual turnover of [Evergreen] from about SGD6 million in 1990 to SGD30 million in 1993”.85Foot Note 85×Navin’s AEIC, at para 57.However, this was at odds with the fact that Navin became a director of Evergreen only in September 1994.86Foot Note 86×3 AB 2629.Further, it was clear from the evidence that the fact that Navin started working in Evergreen in 1991could not explain his alleged ability to pay for the Poole Road property: (i) Under cross-examination, Navin agreed that he was not paid any salary in Evergreen or Milansar until 1994.87Foot Note 87×NE, 7 August 2018, at 80:12–15 and 114:10–11.In any event, the total commissions and salaries paid by Evergreen for the years from 1991 to 1993 were only S$21,179 for 1991, S$18,964 for 1992 and S$51,405 for 1993.88Foot Note 88×3 AB 2609, 2623, 2649. (ii)  Further, Evergreen’s profits before tax for the financial years from 1991 to 1993 were a loss of S$338 for 1991,89Foot Note 89×3 AB 2607.a profit of S$15,677 for 199290Foot Note 90×3 AB 2621.and a profit of S$43,656 for 1993.91Foot Note 91×3 AB 2647.In fact, Evergreen’s profits before tax for the years from 1994 to 1999 were also nowhere near US$300,000 a year except for 1997 (S$380,280).92Foot Note 92×3 AB 2673, 2708, 2730, 2749, 2773, 2788.Evergreen’s profits could not have funded the purchase of the property. (b) Navin also claimed that he was carrying out his own brokerage business selling tyres and yarn to Afghanistan and that he earned about US$300,000 to US$400,000 in commissions per year.93Foot Note 93×Navin’s AEIC, at para 57; NE, 7 August 2018, at 80:15–83:11.Navin claimed that when he exercised the option to purchase the Poole Road property in 1993, he had some US$800,000 which he had earned from his own brokerage business from 1991 to 1993.94Foot Note 94×NE, 7 August 2018, at 109:14–25.According to Navin, the moneys were brought into Singapore through his account with UCO Bank. However, he did not produce any bank statements to support his claim. The issue as to who paid for the Poole Road property was not a new issue; the statement of claim pleaded that Ram provided the funds for the purchase of the property.95Foot Note 95×SOC, at para 66.Navin admitted that he had not written to UCO Bank for his account statements and could not explain why he had not done so.96Foot Note 96×NE, 7 August 2018, at 84:25 – 85:13.I also noted that Navin did not give any details of his own brokerage business in his AEIC. (c) Navin did not produce any evidence of his earnings in Milansar or any of the loans which he claimed to have taken from Milansar and Evergreen to pay for the Poole Road property. (d) Mr Moti Vaswani (“Moti”) gave evidence on behalf of Navin. Moti was the lawyer who handled the conveyancing for the Poole Road property. In his oral testimony, he said that he could not remember details of the purchase. However, when he was asked whether it was Ram who paid for the property, his immediate answer was that Navin was “a NS person with a salary of $200.”97Foot Note 97×NE, 1 August 2018, at 76:7–10.When pressed for a direct answer, Moti finally said he could not recall who gave him the payment.98Foot Note 98×NE, 1 August 2018, at 76:11–21.Moti did not say that Navin paid for the property. On the contrary, Moti’s first answer showed that he did not come across anything that suggested that Navin paid  for the property. In my view, if it had been clear that Navin, as “a NS person with a salary of $200”, was paying for the property, surely Moti would have remembered. 103 Fourth, the S$2.3m mortgage loan included a S$1.8m overdraft facility in Ram’s and Navin’s names.99Foot Note 99×NE, 7 August 2018, at 116:25–117:16.There was no reason why Ram had to be a borrower if Navin had the funds and earning capacity that he claimed he had. According to Navin, he gave the bank the details of his brokerage business and the commissions he was earning.100Foot Note 100×NE, 7 August 2018, at 97:19–98:11.Navin also claimed that he exercised the option to purchase on the basis of UOB’s in-principle approval for the loan (which included Ram as a co-borrower for S$1.8m) without first obtaining Ram’s consent.101Foot Note 101×NE, 7 August 2018, at 99:5–100:2.I found this claim too incredible to believe. Finally, I also noted that Navin was not forthcoming in his evidence about the overdraft facility to Ram and him. It was not mentioned in his AEIC. In his oral testimony, Navin at first said that the overdraft facility was against his account.102Foot Note 102×NE, 7 August 2018, at 116:11–117:8.It was only after he was questioned further that he admitted that it was an overdraft facility given to Ram and him.103Foot Note 103×NE, 7 August 2018, at 117:9–16. 104 It is true that Ram did not produce evidence of his payments towards the purchase price of the Poole Road property. However, the evidence gave rise to a strong inference that he was the one who made the payments. The burden therefore shifted to Navin to prove his claim that he paid for the Poole Road property. Without some other more objective evidence, I was not persuaded that Navin had discharged his burden of proof.",
        "Life interest / contractual licence": "105 Ram pleaded that he allowed the Poole Road property to be registered in Navin’s name and paid for the purchase thereof in reliance on the common understanding among Ram, Mrs Ram and Navin (“the common understanding”) that Ram and Mrs Ram would have a “life interest” in the Poole Road property.104Foot Note 104×SOC, at para 60.In his closing submissions, Ram submitted that the life interest meant that Mrs Ram and he had an irrevocable right to reside rent-free at the Poole Road property for life. 106 Ram pleaded in the alternative that under the MOU, Mrs Ram and he were granted an irrevocable contractual licence to occupy the Poole Road property with full comforts for the duration of their lives.105Foot Note 105×SOC, at para 70B. 107 Mrs Ram pleaded an irrevocable contractual licence to stay with full comforts at the Poole Road property for her lifetime, by reason of the common understanding pleaded in Ram’s statement of claim and/or pursuant to the MOU.106Foot Note 106×D4SOC, at para 8. 108 Both Ram and Mrs Ram sought the following reliefs: (a) A declaration that they are entitled to a right of occupation of the Poole Road property for life with full comforts. (b) Further or alternatively, a declaration that Navin holds the Poole Road property on remedial constructive trust for Ram and Mrs Ram. (c) An order that the Poole Road property be sold and the net proceeds or such amount as the Court deems fit be apportioned and distributed to Ram and Mrs Ram equally. (d) Damages in lieu of specific performance of the contractual licence under the MOU (in Ram’s case) and under the common understanding and/or MOU (in Mrs Ram’s case). Common understanding 109 Neither Ram nor Mrs Ram adduced, in their respective AEICs, any evidence of the common understanding that was alleged to have arisen before completion of the purchase of the Poole Road property in Navin’s name. There was no evidence that this common understanding was even discussed. Ram and Mrs Ram may have had the expectation that Navin, as their son, would not deny them the right to stay at the property. However, such an expectation on the part of Ram and/or Mrs Ram did not constitute the alleged common understanding. 110 I therefore found that there was no common understanding that gave rise to a life interest. Besides, the relief sought appeared to relate only to the contractual licence under the MOU since the common understanding, as pleaded, had no reference to “full comforts”. Contractual licence under the MOU 111 Under cl 5(xvii) of the MOU (see [20(d)(vi)] above), Ram and Mrs Ram “have absolute discretion of right of stay with full comforts in the Singapore residence for their entire lives”. Braj proposed this clause. Navin admitted that he wrote this clause into the MOU and that the intent was to provide his parents with a place to stay at the Poole Road property with full comforts. 112 A licence in relation to land is a mere permission which makes it lawful for the licensee to do what would otherwise be a trespass. Such a licence is merely a defence to an action in tort and confers no estate or interest in land: Charles Harpum, Stuart Bridge & Martin Dixon,Megarry& Wade: The Law of Real Property(Sweet & Maxwell, 8th Ed, 2012) at para 34-001. A contractual licence is a contractual right, as a result of which the revocability of the licence must rest on the terms of the contract, express or implied: Tan Sook Yee, Tang Hang Wu and Kelvin F K Low,Tan Sook Yee’s Principles of Singapore Land Law(LexisNexis, 3rd Ed, 2009) (“Principles of Singapore Land Law”) at paras 19.7 and 19.31. 113 Navin’s case was that the contractual licence under the MOU was subject to an implied term that Ram/Mrs Ram did not misbehave in such a way as would make it unreasonable for them to insist on staying at the property. 114 The Court of Appeal inSembcorp Marine Ltd v PPL Holdings Pte Ltd[2013] 4 SLR 193 set out a three-step process for the implication of contractual terms (at [101]). The first step is to ascertain how the gap in the contract arises. Implication will be considered only if the court discerns that the gap arose because the parties did not contemplate the gap. At the second step, the court considers whether it is necessary in the business or commercial sense to imply a term in order to give the contract efficacy. Finally, the court considers whether the specific term to be implied is one which the parties, having regard to the need for business efficacy, would have responded “Oh, of course!” had the proposed term been put to them at the time of the contract. If it is not possible to find such a clear response, then the proposed term will not be implied. The exercise of implying contractual terms in fact is best understood as an exercise in giving effect to the parties’presumed(and notactual) intentions (at [93]). 115 I agreed with Navin and Mrs Navin that the contractual licence under the MOU was subject to the implied term that Ram/Mrs Ram did not misbehave in such a way as would make it unreasonable for them to insist on staying at the property (“the Implied Term”). First, the MOU did not address the question whether the contractual licence could be revoked on such a ground. On the evidence, it was clear that this was not contemplated for otherwise, surely, it would have been addressed. Second, given the disputes between Ram and Navin, it was necessary to imply a term as to revocation of the licence, in order to give the MOU efficacy. Third, in view of the disputes between Ram and Navin, the Implied Term would, in my view, have received their unhesitating agreement had it been proposed to them then.",
        "Revocation of the contractual licence": "116 In my judgment, Ram breached the Implied Term. The CCTV recordings showed the following: (a) On 13 April 2016, Ram was walking around the house carrying a knife and dressed only in a singlet and his underwear. There was no evidence of him looking for Mrs Navin or threatening her with the knife and I accepted Ram’s evidence that he was bringing the knife to cut a rope.107Foot Note 107×NE, 19 July 2018, at 150:6–13.Mrs Ram testified that Ram was in his underwear because he had taken off his “sarong” after he had slipped and his “sarong” got wet.108Foot Note 108×NE, 1 August 2018, at 13:24–14:77.However, that was no reason for Ram to walk around the house in his underwear when Mrs Navin was around. (b) On 17 May 2016, Ram kicked at Navin’s car (which was parked in the driveway) and/or the domestic helper. According to Ram, his elder brother and sister-in-law could not leave after their visit, because neither Mrs Navin nor the domestic helpers wanted to unlock the main gate. One of the domestic helpers, one Ms Sunanda, subsequently “grudgingly unlocked the gate using a remote control”. Ram claimed that as he was walking out to apologise to his guests, Sunanda “inexplicably opened the door of one of the cars which blocked” Ram’s way.109Foot Note 109×Ram’s AEIC, at para 129.However, the CCTV recording merely showed Sunanda opening the car door and looking for something in the car. Ram was nowhere near at this time. Just as she was done, Ram walked up to the car and kicked the car and/or Sunanda. Suannda tried to move away but Ram continued behaving aggressively towards her. The CCTV recording was clear proof that Ram’s allegation was pure fabrication. (c) On the same day, Ram kicked the door to Navin’s room. Navin was apparently not home at the time. Mrs Navin locked herself in the guestroom, with her son. Ram started banging and violently kicking the door to the guestroom, all the while hurling verbal abuse. (d) On 31 July 2016, Ram reacted to something that Navin said by pulling down his pants and exposing himself to Navin in the presence of Navin’s wife and son. Ram claimed that Navin had told him “I will f--- you”. Navin denied this. There was no voice recording. However, Ram’s behaviour was simply inexcusable. 117 The CCTV recordings confirmed Ram’s propensity towards violent behaviour and verbal abuse whilst living at the Poole Road property. It was clear to me that Ram had, by his conduct, breached the Implied Term and that Navin was fully entitled to revoke Ram’s licence to stay at the Poole Road property. Navin and his family cannot be expected to have to put up with Ram’s behaviour at the Poole Road property. 118 As for Mrs Ram, it was clear that she had not breached the Implied Term; neither was it alleged that she had breached the Implied Term. Navin had not prohibited her from staying at the Poole Road property either. Mrs Ram did not want to return to the Poole Road property after both Ram and she were arrested by the police on 1 August 2016. In her AEIC, she disowned Navin. It was Mrs Ram’s own decision not to continue staying at the Poole Road property. On the evidence before me, I was compelled to find that Navin did not breach the contractual licence where Mrs Ram was concerned.",
        "Estoppel": "119 Ram pleaded that Navin was estopped from denying the life interest or revoking Ram’s and Mrs Ram’s licence to reside at the Poole Road property.110Foot Note 110×SOC, at para 70A.As pleaded, the estoppel was based on the common understanding as to the alleged life interest. Since I found that there was no common understanding, the estoppel plea failed. In any event, the estoppel plea did not assist Ram’s case. If Ram succeeded in establishing the common understanding, that would give rise to an irrevocable right to stay at the Poole Road property and the estoppel plea would have been unnecessary. On the other hand, if Ram failed to establish the common understanding, the estoppel plea would likewise fail.",
        "Remedial constructive trust": "120 I dismissed Ram’s and Mrs Ram’s claims for a declaration that Navin holds the Poole Road property on remedial constructive trust for them. The basis for these claims had not been established, whether in their pleadings or closing submissions. In fact, in his oral testimony, Ram confirmed that the only claim he was making with respect to the Poole Road property was a right to stay and nothing more.111Foot Note 111×NE, 17 July 2018, at 151:5–8. 121 I was also doubtful that I could make an order that Navin holds the Poole Road property on remedial constructive trust for Ram and Mrs Ram. As Ram and Mrs Ram are not Singapore citizens, they are prohibited from having any interest in any residential property: s 3(1) of the Residential Property Act (Cap 274, 2009 Rev Ed). However, I did not have to decide this issue, since no basis for such an order had been established.",
        "Conspiracy to evict Ram and Mrs Ram": "122 Both Ram and Mrs Ram claimed that Navin and Mrs Navin conspired to remove or constructively evict them from the Poole Road property by lawful and/or unlawful means.112Foot Note 112×SOC, at para 71A; D4SOC, at para 10.Ram and Mrs Ram pleaded numerous alleged breaches by Navin “acting by himself and/or in concert with [Mrs Navin]” as evidence of the alleged constructive eviction.113Foot Note 113×SOC, at para 71B; D4SOC, at para 10(a).It appeared therefore that the focus was on unlawful means conspiracy. 123 I was not satisfied that Ram and Mrs Ram had proved the alleged breaches. (a) Ram/Mrs Ram alleged that Navin/Mrs Navin instructed their domestic helpers and one driver not to serve them and consequently, Mrs Ram had to do her own chores. In my view, it was more likely that, as Navin and Mrs Navin claimed, the domestic helpers and driver were simply reluctant to serve Ram and Mrs Ram, in view of Ram’s conduct. (b) I rejected Ram/Mrs Ram’s allegation that they had no access to the common areas in the house because they were locked, or that they were effectively confined to their bedrooms. The CCTV recordings showed Ram and Mrs Ram wandering freely about the house. Ram had no hesitation walking around the house holding a knife and dressed only in his singlet and underwear. This was not evidence of a man confined to his bedroom. (c) I rejected Ram/Mrs Ram’s bare allegations that they were not permitted assistance by external service providers to attend to maintenance issues in their bedroom, that Navin/Mrs Navin controlled their mail, and that they did not have the keys to the Poole Road property and if they left the house together, there was a “real likelihood” that Navin/Mrs Navin would lock them out. (d) I also did not accept Ram’s bare assertion that Navin threatened him in November 2014 that Mrs Navin would falsely accuse him of molest if he returned to the Poole Road property. No such accusation has been made even though Ram had subsequently returned to the house. 124 Ram/Mrs Ram also complained that Navin/Mrs Navin kept their children away from them. In my view, even if Navin/Mrs Navin kept their children away from Ram/Mrs Ram, given the circumstances of this case, I did not think that this sufficient to show a conspiracy to constructively evict Ram/Mrs Ram. 125 Finally, Ram/Mrs Ram complained that Navin/Mrs Navin called the police on at least five occasions making false accusations against Ram/Mrs Ram. In his statement of claim, Ram set out four occasions when the police were called.114Foot Note 114×SOC, at paras 71B(10) and (11).I did not think that the calls to the police showed a conspiracy to constructively evict Ram/Mrs Ram. These calls were in response to certain incidents, two of which had to do with Ram’s conduct. 126 As stated earlier, on 31 July 2016, Ram had exposed himself to Navin and his wife and son. The police were called and Ram was advised to leave the property. Ram returned the next day and Navin called the police again. Both Ram and Mrs Ram were arrested and they spent the night in the police lock-up. Navin testified that Ram was arrested because he refused to leave and kept insisting that the police should arrest him instead.115Foot Note 115×Navin’s AEIC, at para 63.According to Navin, Mrs Ram, being the dutiful wife, followed Ram to the police station. Ram and Mrs Ram disputed Navin’s evidence and produced evidence that showed that both of them were charged with criminal trespass. . The reason for the arrest was not clear and regardless of the reason, one might wonder how Navin could have left Ram, and in particular Mrs Ram, to spend the night in the police lock-up. It was one thing to call the police to tell Ram to leave the premises; it was altogether a different thing to let Ram and Mrs Ram spend the night in the police lock-up without trying to have them released on bail. Nevertheless, I did not think that this incident therefore meant that there was a conspiracy to constructively evict them. 127 I therefore dismissed the claim for conspiracy to injure. Ram/Mrs Ram had not proved that there was an agreement between Navin and Mrs Navin to carry out the alleged acts with a view to constructively evict them from the Poole Road property.  Navin/Mrs Navin may have been prepared to take advantage of Ram’s conduct (such as when he exposed himself) and call the police; however, the evidence overall fell short of a conspiracy.",
        "Conversion and detinue": "128 Generally, an act of conversion occurs when there is an unauthorised dealing with the claimant’s chattel as to question or deny his title to it, while a claim in detinue lies at the suit of the person who has a right to immediate possession of goods against a person who is in possession of the goods and who, upon proper demand and without lawful excuse, fails or refuses to deliver them up:SimgoodPte Ltd v MLC Shipbuilding Sdn Bhd[2016] 1 SLR 1129 (at [150] and [159]). 129 Navin had engaged professional movers to pack his parents’ belongings at the Poole Road property into several boxes, which were then returned to them.116Foot Note 116×Navin’s AEIC, at para 65.Ram testified that Navin had “sent two truckloads of cartons to the hotel” where he was putting up with Mrs Ram temporarily.117Foot Note 117×NE, 19 July 2018, at 168:13–14.Ram/Mrs Ram claimed that certain items were not returned to them.118Foot Note 118×SOC, at para 72(2); D4SOC, at para 11.However, neither Ram nor Mrs Ram produced any evidence in support of their claim apart from their bare statements. I therefore dismissed these claims.",
        "Ram’s minority oppression claim": "130 Ram’s minority oppression claim was based on the following complaints: (a) That Navin caused/procured certain transfers and allotments of shares in Evergreen without Ram’s knowledge or consent. (b) That Navin procured the transfer of shares in Evergreen by Mrs Ram to Navin, by duress, undue influence and/or unconscionable conduct. (c) That Navin denied Ram access to Evergreen’s books and records. (d) That Navin and Mrs Navin wrongfully removed Ram from the Board of Directors (“Board”) of Evergreen. (e) That Navin and Mrs Navin wrongfully excluded Ram from general meetings and Board meetings of the Evergreen. (f) That Navin and Mrs Navin caused Evergreen to refuse or fail to declare and pay dividends. (g) That Navin misused Evergreen’s funds. (h) That Navin and Mrs Navin breached their duties as directors of Evergreen by procuring Evergreen’s participation in the present action.",
        "Unauthorised transfers / allotments of shares": "131 Ram’s statement of claim pleaded that Navin caused or procured the following without Ram’s knowledge and consent: (a) Transfer of 499,999 ordinary shares from Ram to Mrs Ram and one ordinary share from Ram to Navin. These transfers were reflected in Evergreen’s records with the Accounting and Corporate Regulatory Authority (“ACRA”) on 6 October 2005.119Foot Note 119×SOC, at para 30 read with para 14(6). (b) Allotment of six million ordinary shares in Evergreen on 30 September 2006 to Ram (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares).120Foot Note 120×SOC, at para 30 read with para 14(7). (c) Allotment of 1,040,000 ordinary shares in Evergreen on 13 July 2007 to Ram (260,000 shares), Mrs Ram (260,000 shares) and Navin (520,000 shares).121Foot Note 121×SOC, at paras 31–32. (d) Allotment of 1,960,000 ordinary shares on 25 August 2008 to Ram (490,000 shares), Mrs Ram (490,000 shares) and Navin (980,000 shares).122Foot Note 122×SOC, at para 33. (e) Transfer of one share from Navin to Mrs Navin on 7 January 2013 in breach of Article 31 of Evergreen’s articles of association and/or the MOU.123Foot Note 123×SOC, at para 34. 132 The above transfers and allotments, save for the transfer of one share by Navin to Mrs Navin on 7 January 2013, were evidenced by various documents that were signed by Ram. Ram’s common refrain was to claim that his signatures were forged. Ram and Navin called Mr Pang Chan Kok William and Mr Yang Chiew Yung respectively as their handwriting expert witnesses. 133 Ram’s expert produced a report dated 27 April 2018 (“Ram’s Expert’s Report”)124Foot Note 124×Document Examination Report dated 27 April 2018 prepared by Pang Chan Kok William.and a supplementary report dated 14 June 2018 (“Ram’s Expert’s Supplementary Report”).125Foot Note 125×Document Examination Supplementary Report dated 14 June 2018 prepared by Pang Chan Kok William.Navin’s expert produced a report dated 5 June 2018 (“Navin’s Expert’s Report”)126Foot Note 126×Forensic Report dated 5 June 2018 prepared by Yang Chiew Yung.and a supplementary report dated 28 August 2018 (“Navin’s Expert’s Supplementary Report”).127Foot Note 127×Forensic Report – Supplementary Report dated 28 August 2018 prepared by Yang Chiew Yung.Navin’s Expert’s Supplementary Report was prepared after the originals of five documents were made available to Navin’s expert. 134 A table comparing the conclusions reached by the two experts was first set out in Navin’s Expert’s Report.128Foot Note 128×Navin’s Expert’s Report, at p 7.Navin’s Expert’s Supplementary Report set out an amended table.129Foot Note 129×Navin’s Expert’s Supplementary Report, at p 10.After reviewing Navin’s Expert’s Supplementary Report, Ram’s expert made some revisions to his earlier conclusions in his reports, during his oral testimony. Both experts used a scale of nine levels to express conclusions on the authorship of handwriting and signatures, although each used different descriptive terms as set out below:130Foot Note 130×Navin’s Expert’s Report, at p 7. Conclusion LevelDescriptions used by Ram’s expertDescriptions used by Navin’s expert1Conclusive (did write)Identification (wrote)2Very strong support that he wroteHighly likely that he wrote3Strong support that he wroteLikely that he wrote4Limited support that he wroteIndications that he wrote5No conclusion or inconclusiveInconclusive6Limited support that he did not writeIndications that he did not write7Strong support that he did not writeUnlikely that he wrote8Very strong support that he did not writeHighly unlikely that he wrote9Conclusive that he did not writeElimination (did not write) 135 The evidentiary burden of proof in so far as allegations of forgery and fraud are concerned must be at the upper end of the scale, albeit on a balance of probabilities:R Mahendran and another v RArumuganathan[1999] 2 SLR(R) 166 (at [17]). In this regard, the role of expert handwriting analysis may be probative of the genuineness of signatures, but like all other forms of evidence, the probative value of the expert’s opinion is to be assessed and weighed against contradictory evidence:SudhaNatrajan v The Bank of East Asia Ltd[2017] 1 SLR 141 (at [45]). I need only add that where Ram’s expert found it inconclusive whether a questioned signature was Ram’s, that would not be sufficient to discharge Ram’s burden of proving that the signature was a forgery. Transfer of 499,999 shares to Mrs Ram and one share to Navin 136 Notice of these transfers was lodged with ACRA on 6 October 2005.131Foot Note 131×4 AB 2943–2946.However, the transfer of 499,999 shares from Ram to Mrs Ram was effected on 25 October 2002, as evidenced by the following documents all of which bore Ram’s signature: (a) A notice of the EGM to be held on 25 October 2002 to “approve transfer of shares”.132Foot Note 132×Ram’s Expert’s Report, at p 50.In his oral testimony, Ram’s expert revised his previous view and concluded that there was strong support that Ram signed this document.133Foot Note 133×NE, 31 August 2018, at 2:22–24.Navin’s expert concluded there were indications that Ram signed the document.134Foot Note 134×Navin’s Expert’s Supplementary Report, at 10. (b) The minutes of the EGM held on 25 October 2002, approving the transfer of the 499,999 shares.135Foot Note 135×Ram’s Expert’s Report, at p 51.Ram’s expert concluded that there was strong support that Ram did sign the document, whilst Navin’s expert concluded that there were indications that Ram signed the document.136Foot Note 136×Navin’s Expert’s Supplementary Report, at 10. (c) The transfer form dated 25 October 2002 for the transfer of the 499,999 shares.137Foot Note 137×Ram’s Expert’s Report, at p 52.Ram’s expert concluded that it was inconclusive whether one of the signatures was Ram’s and that there was strong support that the other signature was not Ram’s, whilst Navin’s expert concluded that there were indications that both signatures were Ram’s.138Foot Note 138×Navin’s Expert’s Supplementary Report, at p 10. (d) The requisition form dated 25 October 2002 for the transfer of the 499,999 shares.139Foot Note 139×Ram’s Expert’s Report, at p 53.Ram’s expert concluded that it was inconclusive whether the signature was Ram’s whilst Navin’s expert concluded that there were indications that it was Ram’s.140Foot Note 140×Navin’s Expert’s Supplementary Report, at p 10. (e) A Working Sheet A dated 25 October 2002 for the transfer of the 499,999 shares.141Foot Note 141×Ram’s Expert’s Report, at p 54.Ram’s expert concluded that it was inconclusive whether the signature was Ram’s whilst Navin’s expert concluded that there were indications that it was Ram’s.142Foot Note 142×Navin’s Expert’s Supplementary Report, at p 10. 137 As for the transfer of one share to Navin, Ram claimed that it was transferred from him to Navin without his knowledge. However, the evidence showed that the one share was transferred by Kishore to Navin on 29 April 1995 (see, also, [17] above).143Foot Note 143×3 AB 2684.The minutes of the directors’ meeting on 3 April 1995 approving the transfer, was signed by Ram, Navin and Kishore.144Foot Note 144×Ram’s Expert’s Report, at p 47.Ram’s expert concluded that there was strong support, and Navin’s expert concluded that it was highly likely, that the signature was Ram’s.145Foot Note 145×Navin’s Expert’s Supplementary Report, at p 10. 138 Based on the evidence, I concluded that Ram did sign the above documents, and knew and consented to the transfer of (a) 499,999 shares in Evergreen from him to Mrs Ram on 25 October 2002, and (b) one share in Evergreen from Kishore to Navin in April 1995. Allotment of six million ordinary shares in Evergreen on 30 September 2006 139 On 30 September 2006, a loan of US$3,781,433 (equivalent to S$6m) from Ram to Evergreen was capitalised and six million shares were allotted to Ram (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares). This was evidenced by the following documents all of which bore Ram’s signature: (a) The notice dated 14 September 2006 for the EGM to be held on 30 September 2006 to approve “the allotment of shares for otherwise than for cash of the Company”.146Foot Note 146×Ram’s Expert’s Report, at p 58.Ram’s expert concluded that there was strong support, and Navin’s expert concluded that it was highly likely, that the signature was Ram’s.147Foot Note 147×Navin’s Expert’s Supplementary Report, at p 10. (b) The minutes of the EGM held on 30 September 2006, approving the conversion of Ram’s loan into shares and the allotment of 6m shares to Ram (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares).148Foot Note 148×Ram’s Expert’s Report, at p 59.Ram’s expert concluded that there was strong support, and Navin’s expert concluded that it was highly likely, that the signature was Ram’s.149Foot Note 149×Navin’s Expert’s Supplementary Report, at p 10. (c) Ram’s request dated 30 September 2006 to convert his loan into shares and to allot the shares to himself (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares).150Foot Note 150×Ram’s Expert’s Report, at p 60.Ram’s expert concluded that it was inconclusive whether the signature was Ram’s whilst Navin’s expert concluded that there were indications that it was Ram’s. 140 Based on the evidence, I concluded that Ram did sign the above documents, and knew and consented to the conversion of his loan into shares and the allotment of 6m shares to himself (1,250,000 shares), Mrs Ram (1,250,001 shares) and Navin (3,499,999 shares). Allotment of 1,040,000 ordinary shares in Evergreen on 13 July 2007 141 On 13 July 2007, 1,040,000 shares were allotted to Ram (260,000 shares), Mrs Ram (260,000 shares) and Navin (520,000 shares). The minutes of the EGM approving the allotment, bore Ram’s signature.151Foot Note 151×Ram’s Expert’s Report, at p 61.In his oral testimony, Ram’s expert revised his previous view and concluded that there was strong support that Ram signed this document.152Foot Note 152×NE, 31 August 2018, at 3:5–6.Navin’s expert concluded there were indications that Ram signed the document.153Foot Note 153×Navin’s Expert’s Supplementary Report, at 10. 142 In December 2006, Ram sold his two units at High Street Plaza (HS Units #10-04 and #10-05) to Evergreen for S$520,000 each. The proceeds of sale amounting to S$1,040,000 were used to pay for the 1,040,000 shares. The sale and the use of the sale proceeds were evidenced by the following documents, all of which bore Ram’s signature: (a) An undated letter from Ram to Moti instructing Moti to act for him in the sale of the two properties to Evergreen.154Foot Note 154×Ram’s Expert’s Report, at p 65.Ram’s expert concluded that there was very strong support that the signature was not Ram’s, whilst Navin’s expert concluded that there were indications that it was Ram’s.155Foot Note 155×Navin’s Expert’s Supplemental Report, at p 10. (b) The sale and purchase agreements, both dated 13 December 2006, for the sale of the two properties to Evergreen.156Foot Note 156×Ram’s Expert’s Report, at pp 66–71.Ram’s expert concluded that there was very strong support that the signature was not Ram’s, whilst Navin’s expert concluded that there were indications that it was Ram’s.157Foot Note 157×Navin’s Expert’s Supplemental Report, at p 10. (c) The transfer forms for the transfer of the two properties to Evergreen, in which Ram’s signatures were witnessed by an advocate in Nepal.158Foot Note 158×Ram’s Expert’s Report, at pp 72–73; 2 PB 43–50.Ram’s expert concluded that there was very strong support that the signature was not Ram’s, whilst Navin’s expert concluded that there were indications that it was Ram’s. As it turned out, these transfer forms were not used. (d) The transfer forms for the transfer of the two properties to Evergreen, in which Ram’s signatures were witnessed by Moti.159Foot Note 159×Ram’s Expert’s Report, at pp 74 – 77; 2 PB 35–41.Ram’s expert concluded that there was very strong support that the signatures were not Ram’s, whilst Navin’s expert concluded that either it was likely or there were indications that the signatures were Ram’s.160Foot Note 160×Navin’s Expert’s Supplementary Report, at p 10.Further, Ram’s expert concluded that there was very strong support that Moti’s signatures on these documents were not Moti’s, while Navin’s expert concluded that either it was likely or there were indications that those signatures were Moti’s.161Foot Note 161×Navin’s Expert’s Supplementary Report, at p 10. (e) A cheque dated 30 May 2007 for S$1,040,000 issued by Ram in favour of Evergreen.162Foot Note 162×Ram’s Expert’s Report, at p 81.Ram’s expert concluded that there was strong support that the signature on the cheque was not Ram’s, whilst Navin’s expert concluded that there were indications that the signature was Ram’s.163Foot Note 163×Navin’s Expert’s Supplementary Report, at p 10. 143 Ram’s expert opined that (a) Ram’s questioned signatures were composites,iethe signatures were created using some form of tracing process where different letters or combination of letters from two or more genuine signatures were used to create the composite signatures.164Foot Note 164×Ram’s Expert’s Report, at para 5.47; NE, 29 August 2018, at 47:19–48:4. (b) Moti’s questioned signatures were composites as there was a high level of co-incidence between the signatures.165Foot Note 165×Ram’s Expert’s Report, at para 6.4. 144 In my view, Navin’s expert’s conclusions were more persuasive. First, she showed, using enlargements, that the questioned signatures were not as similar to the specimen signatures as Ram’s expert claimed. Second, Ram’s expert’s conclusion that Ram’s questioned signatures were composites was based on comparisons of only the first parts of the questioned signatures.166Foot Note 166×NE, 29 August 2018, at 52:9–10; 52:18–24; 54:11–12.There was no evidence that the subsequent parts of the signatures showed any similarities. It did not seem logical that a forger would trace one part of the signature and then finish the rest of the signature by his own hand,ie,without tracing. Third, Navin’s expert showed that Moti’s specimen signatures that were signed on the same day were consistent.167Foot Note 167×NE, 29 August 2018, at 57:20–58:4; 61:8–62:11. 145 More importantly, I accepted Moti’s evidence that he did sign the transfer forms and that he witnessed Ram’s signatures on the transfer forms. I found no reason to doubt Moti’s evidence. 146 I was also not persuaded by Ram’s claim that it was only in the course to these proceedings that he found out that the two units at High Street had been sold to Evergreen and that the proceeds of sale amounting to S$1,040,000 had been used to pay for the 1,040,000 shares allotted in 2007.168Foot Note 168×SOC, at para 32A.I found it unbelievable that in the nine years from the date of the cheque until the issuance of the writ in these proceedings, Ram did not realise that a substantial sum of S$1,040,000 had been transferred from his account to Evergreen. 147 Based on all the evidence, I concluded that Ram did sign the above documents, and knew and consented to (a) the sale of his two units at High Street Plaza to Evergreen, (b) the use of the sale proceeds to pay for the allotment of 1,040,000 shares, and (c) the allotment of the 1,040,000 shares to himself (260,000 shares), Mrs Ram (260,000 shares) and Navin (520,000 shares). Allotment of 1,960,000 ordinary shares on 25 August 2008 148 On 21 August 2008, Navin requested that a loan of US$1,388,102 (equivalent to S$1,960,000) that was due to him, be converted into 1.96m shares to be allotted to Ram (490,000 shares), Mrs Ram (490,000 shares) and Navin (980,000 shares).169Foot Note 169×1st to 3rd Defendants’ Bundle of Documents, vol 1 (“1 DBD”), at p 192.The allotment was approved at an EGM held on 25 August 2008.170Foot Note 170×Ram’s Expert’s Report, at p 62.Navin readily admitted that he initialled the minutes of the EGM on 25 August 2008, approving the allotment, on Ram’s behalf. Navin said Ram had authorised him to do so. Ram denied having authorised Navin to do so. 149 In his statement of claim, Ram questioned the circumstances as to how the debt arose.171Foot Note 171×SOC, at para 33.Ram did not pursue this in his AEIC. In any event, if Ram’s complaint was that the shares allotted to Navin, Mrs Ram and himself were not paid for, he offered no evidence to contradict Navin’s 21 August 2008 letter and the minutes of the EGM held on 25 August 2008. 150 On balance, I accepted Navin’s testimony that he had initialled the minutes on Ram’s behalf, with Ram’s authority. If Navin was forging Ram’s signature, it was not likely to be just an initial. I also found it incredible that Ram would not have noticed the increase in shareholdings over the years; yet, he raised neither complaint nor queries about the allotment until the present disputes arose. 151 I concluded that Ram knew and consented to the 25 August 2008 allotment of 1.96m shares to himself (490,000 shares), Mrs Ram (490,000 shares) and Navin (980,000 shares). Transfer of one share from Navin to Mrs Navin on 7 January 2013 152 On 7 January 2013, Navin transferred one share to Mrs Navin. A board resolution approving the transfer bore Ram’s signature.172Foot Note 172×Ram’s Expert’s Report, at p 63.Ram’s expert’s view was inconclusive as to whether the signature was Ram’s, whilst Navin’s expert concluded that it was likely that the signature was Ram’s.173Foot Note 173×Navin’s Expert’s Supplementary Report, at p 10. 153 I concluded that Ram did sign the resolution and that he knew and consented to the transfer of the one share to Mrs Navin. I noted also that no reason was offered as to why Navin would need to forge Ram’s signature for such a transfer or why Ram would not have agreed. 154 Navin admitted that he did not comply with Article 31 of Evergreen’s articles of association174Foot Note 174×3 AB 2556.(“Article 31”) which was the usual provision giving a right of first refusal to existing shareholders. Since Ram had agreed to the transfer, he had no cause to complain about this breach. Conclusion 155 I found that Ram had not proved his allegation that Navin had caused or procured the transfers and allotments of shares set out above. Consequently, I dismissed Ram’s claims for the transfers and allotments to be set aside.",
        "Wrongfully procuring the transfer of shares from Mrs Ram to Navin": "156 Ram’s complaint was that the SPA between Mrs Ram and Navin (see [27] above) was (a) procured by Navin by duress, undue influence and/or unconscionable conduct, and (b) procured by Navin in breach of Article 31  .175Foot Note 175×SOC, at paras 48 and 50.Ram accepted in oral closing submissions that his complaint that the SPA was procured by duress, undue influence and/or unconscionable conduct, did not fall within the scope of s 216 of the Companies Act.176Foot Note 176×NE, 6 September 2018, at 17:7—9.That must be correct, as those vitiating factors were relevant only as between Navin and Mrs Ram and had nothing to do with s 216. 157 As for the alleged breach of Article 31, Mrs Ram did give the requisite notice of her proposed transfer of shares to Navin.177Foot Note 177×1 DBD 193.Evergreen sent a notice of the proposed transfer to Ram at the Poole Road property.178Foot Note 178×1 DBD 194–195.Navin admitted on the stand that he knew that Ram was not in Singapore at the time and would not see the notice.179Foot Note 179×NE, 20 August 2018, at 62:13–24.I rejected Navin’s bare allegation that Ram had been informed of the impending transfer of shares by phone.180Foot Note 180×NE, 20 August 2018, at 62:24—63:6.That evidence was nowhere to be found in Navin’s AEIC and was, in my view, an afterthought. I accepted Ram’s evidence that he did not receive the notice and did not know of Mrs Ram’s notice to Evergreen. It also seemed to me that if he did, he would surely have raised objections given the circumstances then existing. 158 I found that Navin (in his capacity as a director of Evergreen) failed to notify Ram of Mrs Ram’s transfer notice despite knowing that Ram would not receive the notice that was sent to the Poole Road property.",
        "Denial of access to Evergreen’s books and records": "159 According to Ram, following Navin’s appointment as a director of Evergreen in or around 1995, Ram was prohibited by Navin from entering Evergreen’s office, speaking to Evergreen staff (and vice versa) and participating in Evergreen’s affairs.181Foot Note 181×SOC, at para 51 read with para 14(4).Further, Ram alleged that Navin had instructed Evergreen’s auditors, Natarajan & Swaminathan (“N&S”) (a) not to disclose to Ram any information relating to Evergreen, and (b) to remove Evergreen’s books and records from its registered office at N&S’ premises.182Foot Note 182×SOC, at para 56. 160 I rejected Ram’s assertion that he was denied access to Evergreen’s books and records since 1995. Ram was the majority shareholder in Evergreen up until September 2006, when Navin became a 50% shareholder. Ram could have easily removed Navin as a director if he was being denied access to Evergreen’s books and records but he did not do so. 161 As for the period after September 2006, Ram relied on the fact that in March 2016, he was unable to access Evergreen’s books and records when he went to the registered office because the books and records were not there, and that subsequently, he was told to get the audited financial statements from the company’s management and the statutory records and minute books from the company secretary or the board of directors.183Foot Note 183×Ram’s AEIC, at paras 109–110.Ram concluded from this that Navin and Mrs Navin did not want him to have access.184Foot Note 184×Ram’s AEIC, at para 111.However, there was no evidence that Ram had asked Evergreen’s management or its board and was refused access. 162 I therefore rejected Ram’s  allegation that he had been denied access to Evergreen’s books and records.",
        "Removal from the Board": "163 Ram was removed as a director of Evergreen, at an EGM on 5 August 2016 that was attended only by Navin and Mrs Navin.185Foot Note 185×4 AB, at pp 3456–3457.According to Navin, the notice of the EGM was sent to Ram at the Poole Road property by registered post.186Foot Note 186×Navin’s AEIC, at para 53.Ram claimed Navin and Mrs Navin breached the MOU and the company’s articles of association by removing him from the Board without notice or justification. Under cl 3 of the MOU, Ram was to remain as a non-executive director and chairman of the Board.187Foot Note 187×1 AB 303. 164 The reasons for Ram’s removal from the Board were that Ram:188Foot Note 188×1 DBD 154–156. (a) failed/refused to (i) attend the last 11 Board meetings, (ii) participate in the company’s business since October 2015, and (iii) attend at the company’s business premises since October 2015; (b)  acted against the company’s interest, including abusing senior management employees, behaving in a manner unbecoming of a director, and allowing a third party to use or access the company’s property without the company’s knowledge or consent. 165 Navin relied on notices dated between July 2015 and June 2016 for Board meetings held between August 2015 and June 2016.189Foot Note 189×3 PB 187–191, 196–223, 229 – 232 and 235–236.The notices were sent to Ram at the Poole Road property, by registered post. Ram did not attend these meetings because, according to him, he did not receive the notices. 166 I accepted Ram’s evidence that he did not receive the notices of the Board meetings held between August 2015 and June 2016, or the notice of the EGM held on 5 August 2016. I also agreed with Ram that the notices were sent out to create a paper trial and to manufacture grounds for Ram’s removal from the Board. 167 First, sending the notices by registered post was a new practice. Navin’s evidence was that Board meetings had always been informal before a professional company secretary was appointed and that the company secretary had been sending the notices of Board meetings after he was appointed on 15 September 2014.190Foot Note 190×3 PB 135; NE, 17 August 2018, at 30:12–15; 33:13–16; 34:9–21.However, as Navin admitted on the stand, the notices were prepared in his office and then given to the company secretary.191Foot Note 191×NE, 17 August 2018, at 29:2–4;The company secretary’s evidence confirmed that he did not prepare the notices but merely posted them; he also did not draft the minutes of the meetings.192Foot Note 192×Viswanathan Ramdas’ AEIC, at para 4; NE, 3 August 2018, at 32:19–33:8.It seemed to me that the company secretary was mostly just a post box for Navin. This conclusion was supported by the fact that the company secretary only had the contact number of Navin and not the other two directors of Evergreen, and he needed to deal with one person only.193Foot Note 193×NE, 3 August 2018, at 40:6–9.In my judgment, the decision to send the notices by registered post was most likely made by Navin. 168 Second, it was telling that there was suddenly a need for no less than 13 Board meetings within a period of less than 12 months, and yet the agenda in many of the notices was simply to do nothing more than “discuss periodic review of the Co”.194Foot Note 194×3 PB 196, 200, 204, 208, 212, 216 and 229. 169 As for the other grounds, Navin did not elaborate on, or substantiate them in his AEIC. 170 Accordingly, I found that Ram was wrongfully removed from the board, in breach of cl 3 of the MOU.",
        "Exclusion from general meetings and Board meetings": "171 Ram alleged that195Foot Note 195×SOC, at para 58D read with paras 14(4), 57 and 71B(7). (a) since 1995, he had been prohibited from going to the office, speaking to the staff and participating in the management of the company; (b) Navin and/or Mrs Navin refused/failed to give him notices of general meetings and Board meetings; (c) he was denied access to the letterbox at the Poole Road property. 172 I rejected Ram’s allegation that he had been prohibited from going to the office, speaking to the staff or participating in the management of the company since 1995. As stated earlier, Ram was the majority shareholder in Evergreen up until September 2006. Navin could not have done what Ram claimed; Ram could have removed Navin as director. As for the period after 2006, in my view, Ram had not proved his claim either. 173 As for notices of meetings, the evidence showed that Ram chaired at least the following general and Board meetings: (a) EGMs held on 5 March 1996,196Foot Note 196×Ram’s Expert’s Report, at p 49.25 October 2002,197Foot Note 197×Ram’s Expert’s Report, at p 51.30 September 2006, 13 July 2007 and 25 August 2008. (i) With respect to the minutes of the EGM on 5 March 1996 and 25 October 2002, Ram’s expert concluded that there was strong support that Ram signed both sets of minutes, whilst Navin’s expert concluded that it was highly likely that Ram signed the minutes for 5 March 1996 and there were indications that Ram signed the minutes for 25 October 2002.198Foot Note 198×Navin’s Expert’s Supplementary Report, at p 10.I was satisfied that Ram did sign those minutes. (ii) As for the minutes of the remaining three EGMs, I have already found that they were signed by Ram (see [140], [147] above) or initialled by Navin on his behalf (see [150] above). (b) AGMs held on 18 September 2003,199Foot Note 199×Ram’s Expert’s Report, at p 56.22 April 2010,200Foot Note 200×3 PB 36.8 April 2011201Foot Note 201×3 PB 39.and 22 March 2012.202Foot Note 202×3 PB 76. (i) With respect to the minutes for the AGM on 18 September 2003, Ram’s expert revised his view and concluded that there was strong support that Ram signed the minutes, whilst Navin’s expert concluded that there were indications that Ram signed the minutes.203Foot Note 203×Navin’s Expert’s Supplementary Report, at p 10; NE, 31 August 2018, at 3:3–4.I was satisfied that Ram did sign the minutes. (ii) As for the remaining three sets of minutes, I was not prepared to accept Ram’s bare assertion that he did not sign those minutes. This was especially so given his conduct in simply denying his signatures to just about every document that was adverse to him despite his own expert having concluded (in some cases, in strong terms) that the signatures were his. In any event, the burden was on Ram to prove that the signatures on the minutes were not his and he clearly did not discharge this burden. (c) Board meetings held on 15 September 1997204Foot Note 204×3 PB 23.and 31 October 2002.205Foot Note 205×Ram’s Expert’s Report, at p 55. (i) The Board meeting on 15 September 1997 resolved to open a bank account in Mumbai. I saw no reason to doubt that Ram did sign the minutes of the meeting. (ii)   As for the minutes of the Board meeting on 31 October 2002, Ram’s expert was of the view that it was inconclusive whether Ram signed the minutes, whilst Navin’s expert concluded that there were indications that Ram did.206Foot Note 206×Navin’s Expert’s Supplementary Report, at p 10.I was satisfied that Ram did sign the minutes. 174 I also found it unbelievable that Ram would not have exercised his majority voting power to remove Navin as a director, if indeed he had not received any notice of meetings for so many years. 175 I therefore rejected Ram’s allegation that he had been wrongfully excluded from attending Board and general meetings of Evergreen, except for the Board meetings held between August 2015 and June 2016 and the EGM held on 5 August 2016 in respect of which I have found that Ram did not receive the notices (see [166] above).",
        "Failing to declare dividends and misuse of company funds": "176 Ram claimed that Navin and/or Mrs Navin caused Evergreen to fail to declare and pay dividends since 1994.207Foot Note 207×SOC, at para 60.This was yet another example of Ram making overreaching unsubstantiated claims in these proceedings. 177 Before September 2006, Ram was the majority shareholder. I found it unbelievable that Navin and/or Mrs Navin could have caused Evergreen to not declare dividends without Ram’s agreement. In any event, Evergreen’s financial statements show that dividends were declared for financial years 2001 (but paid in 2002),208Foot Note 208×4 AB 2865.2007,209Foot Note 209×4 AB 3026.2010,210Foot Note 210×4 AB 3081.and 2013.211Foot Note 211×4 AB 3272.However, directors’ fees had been paid every year up to 2016. In the circumstances of this company, I did not think it mattered that much whether the shareholders received their returns by way of directors’ fees or dividends. In my view, Ram had no cause for complaint, at least while he remained a director. Following Ram’s removal as a director in 2016, payment of dividends would become more important. However, this is now moot since I have ordered that Navin buys out Ram’s shares in Evergreen. 178 I also dismissed Ram’s complaint that Navin misused company funds to make various payments. No evidence whatsoever was produced in support of his allegations, as Ram admitted in closing submissions.212Foot Note 212×NE, 6 September 2018, at 18:3–6.",
        "Evergreen’s participation in these proceedings": "179 Evergreen was represented by the same lawyers who acted for Navin and Mrs Navin. Ram claimed that Navin and Mrs Navin breached their directors’ duties in procuring their solicitors to represent Evergreen and in procuring or allowing Evergreen’ active participation in these proceedings beyond what was appropriate for a nominal party.213Foot Note 213×SOC, at para 63A. 180 In my view, Ram’s claim was wholly unmeritorious and I dismissed it.",
        "Conclusion on Ram’s minority oppression claim": "181 Section 216 of the Companies Act (Cap 50, 2006 Rev Ed) states as follows: Personal remedies in cases of oppression or injustice 216.––(1) Any member or holder of a debenture of a company… may apply to the Court for an order under this section on the ground –– (a) that the affairs of the company are being conducted or the powers of the directors are being exercised in a manner oppressive to one or more of the members or holders of debentures including himself or in disregard of his or their interests as members, shareholders or holders of debentures of the company … 182 The touchstone for minority oppression is whether the conduct being complained of is commercially unfair:Over & Over Ltd vBonvests Holdings Ltd[2010] 2 SLR 776 (“Over & Over”) (at [81]). 183 I found that: (a) Ram was wrongfully excluded from Board meetings held between August 2015 and June 2016 and the EGM held on 5 August 2016; (b) Ram was wrongfully removed as director in August 2016, in breach of the MOU; and (c) Navin failed to notify Ram of Mrs Ram’s transfer notice despite knowing that Ram would not receive the notice that was sent to the Poole Road property. 184 In my judgment, the above were sufficient to establish the grounds under s 216 of the Companies Act. First, as a shareholder, Ram was entitled to expect that Navin and/or Mrs Navin would (a) properly notify all directors of any directors’ meetings, and (b) properly notify shareholders of any general meetings. Second, under the MOU, Ram had an expectation not to be removed as a director of Evergreen without justification. Third, as a shareholder, Ram was entitled to expect that Navin would take steps to notify Ram of Mrs Ram’s transfer notice since he knew for a fact that Ram would not receive the notice sent by Evergreen. 185 In his statement of claim, Ram sought a buy-out order, alternatively, an order that Evergreen be liquidated. As Evergreen was a going concern, a buy- out order was more appropriate. I ordered that Navin and Mrs Navin buy out Ram’s shares in the company at fair value, without discount.",
        "The Bonds": "186 The background has been set out earlier (see [21] and [25] above). The total amount invested in bonds was US$3,017,340.10 comprising the following fund transfers:214Foot Note 214×Exh 1D16, at p 1. (a) US$991,000 from Ram’s UBS account; (b) US$1.04m from Ram’s account with Citibank NA (“Citi”); (c) US$120,240 from Ram’s account with Citi; (d) US$847,396.14 from Mrs Navin’s accounts with State Bank of India (“SBI”); and (e) US$18,703.96 from Navin’s account with UBS. 187 The source of funds for two of the above transfers were in dispute. First, Navin claimed that of the US$1.04m transferred from Ram’s Citi account, only US$200,000 belonged to Ram and the balance US$840,000 belonged to him. Second,  Ram claimed that of the US$847,396.14 transferred from Mrs Navin’s accounts with SBI, US$550,760.52 belonged to him.",
        "Transfer of US$1.04m from Ram’s Citi account": "188 The amount of US$1.04m was transferred from Ram’s Citi account to Navin/Mrs Navin’s joint account with UBS.215Foot Note 215×1 AB 465; Exh 1D16, at p 11.Navin claimed that (a) the amount of US$1.04m comprised the remittances received between 5 October 2010 and 10 November 2010 from one Rajesh Jatia (“Rajesh”) amounting to US$1,044,816.64, after deducting bank charges (“the Rajesh Remittances”);216Foot Note 216×D&CC, at para 58e; NE, 10 August 2018, at 112:9–113:24.and (b) of the Rajesh Remittances (and consequently the US$1.04m transferred from Ram’s Citi account), only US$200,000 belonged to Ram and the balance of about US$840,000 belonged to him.217Foot Note 217×NE, 10 August 2018, at 119:7–10. 189 Navin relied on a series of emails exchanged with Rajesh (“the Rajesh Emails”)218Foot Note 218×1 AB 436–464.which showed that, between 5 October 2010 and 10 November 2010, Rajesh made the following remittances which  added up to the total amount of US$1,044,816.64: (a) US$94,980;219Foot Note 219×1 AB 440. (b) US$149,960.64;220Foot Note 220×1 AB 445. (c) US$129, 980 and US$119,980;221Foot Note 221×1 AB 449. (d) US$199,980;222Foot Note 222×1 AB 457. (e) US$149,980 and US$199,956;223Foot Note 223×1 AB 463. 190  Navin submitted that the similarity in amounts and the proximity of dates (the transfer of US$1.04m from Ram’s Citi account was made on 18 November 2010)224Foot Note 224×Exh 1D16, at p 11.showed that the US$1.04m transferred from Ram’s Citi account came from the Rajesh Remittances. I rejected Navin’s submission. 191 First, the Rajesh Remittances included remittances of US$95,000 (net US$94,980) and US$150,000 (net US$149,960.64). Both amounts were remitted to Evergreen’s account.225Foot Note 225×NE, 10 August 2018, at 114:17 – 22; 1 AB 437–440; 443–445.Instructions to remit the latter amount to Ram’s Citi account were received too late. There was no evidence that these amounts were subsequently transferred to Ram’s Citi account. 192 Second, the Rajesh Remittances included a sum of US$150,000 which belonged to Rajesh. In an email dated 4 November 2010 (“the 4 November Email”), Rajesh wrote:226Foot Note 226×1 AB 456. inform Tauji arrnegd 200k and 150k @ 74.05 net 200k is thapa account 150k is my account Navin explained that “thapa account” referred to Ram’s account. 193 Navin claimed that the expression “my account” meant his (Navin’s) account. I rejected Navin’s spurious claim. The meaning of the words in the email was plain. Rajesh was writing to Navin. If he had meant that the US$150,000 was for Navin’s account, he would surely have said “your account” or even “Navin’s account”. Navin could not give a credible explanation for his tortured interpretation which flew in the face of the plain meaning of the words used. 194 Next, even if the US$1.04m came from the Rajesh Remittances, Navin still had to prove that only US$200,000 belonged to Ram. Navin relied on the 4 November Email to support his contention.227Foot Note 227×1 AB 456; NE, 10 August 2018, at 157:19—25.Navin submitted that the reference in the email to US$200,000 being for Ram’s account meant that of the Rajesh Remittances, only US$200,000 belonged to Ram.228Foot Note 228×NE, 10 August 2018, at 117:1–14.In my view, Navin’s submission involved an impossible leap in logic. The 4 November Email expressly state that US$200,000 was for Ram’s account because the same email had a reference to a second amount of US$150,000 that was for Rajesh’s own account.  The fact that other remittances to Ram’s account did not expressly state that they were for Ram’s account did not mean that therefore the moneys were not Ram’s. Further, the 4 November Email did not prove that US$840,000 belonged to Navin. The US$150,000 mentioned in that email belonged to Rajesh, not Navin. In any case, there was no reason why the funds had to be remitted to Ram’s account if they in fact belonged to Navin. 195 At the end of the day, the fact remained that Navin bore the burden of proving his claim that some US$840,000 in fact belonged to him. Navin clearly failed to discharge his burden of proof. I concluded therefore that the whole amount of US$1.04m that was invested in the bonds was to count as Ram’s contribution.",
        "Transfer of US$847,396.14 from Mrs Navin’s SBI accounts": "196 It was not disputed that the sum of US$847,396.14 transferred from Mrs Navin’ SBI account included US$450,000 and US$100,760.52 that were transferred from Ram’s account to Mrs Navin’s SBI account.229Foot Note 229×2 AB 1473.Navin claimed that both of these sums were repayments by Ram for monies transferred in 2009 to Ram in India because Ram wanted to buy real property in India. However, Navin did not produce any evidence whatsoever of the transfers that either he or his agent allegedly made to Ram in India.230Foot Note 230×NE, 15 August 2018, at 66:5–67:20.Further, Navin’s AEIC was silent on these details and he made the allegations about the fund transfers to Ram in India only in his second supplementary AEIC which was filed during the course of the trial.",
        "Conclusion": "215 With respect to Suit 911: (a) The 2015 Deed and the September Agreement were set aside due to Navin’s failure to disclose a material fact. Ram was ordered to return the sum of US$2m to Navin, subject to a set off against amounts that Navin had been ordered to pay Ram. (b) The MOU was found to be legally binding and under the MOU, (i) Navin was ordered to pay Ram and Mrs Ram S$720,000 each, being arrears of the Annual Allowance for the years from 2014 to 2017; (ii) Navin was ordered to continue to pay Ram and Mrs Ram the Annual Allowance of S$360,000 a year (ie, S$180,000 each)in three equal instalments, on the first of October, February and June of each year; (iii) Navin was ordered to pay Mrs Ram to the extent of US$1m upon receipt of notice in writing that Mrs Ram desires to acquire a residential property; and (iv) Ram and Mrs Ram had a contractual licence to stay at the Poole Road property with full comforts for the rest of their lives subject to Implied Term (ie,that they did not misbehave in such a way as would make it unreasonable for them to insist on staying at the property). (c) Ram was found to have breached the Implied Term and Navin was entitled to revoke Ram’s licence to stay at the Poole Road property. Mrs Ram had not breached the Implied Term but it was her own decision not to continue staying at the Poole Road property. (d) Ram had established his case under s 216 of the Companies Act and Navin and Mrs Navin were ordered to buy out Ram’s shares in Evergreen at fair value, with no discount. (e) Navin was found to hold sum of US$3,442,378.29 being Ram’s share of the proceeds from the sale of the Bonds (plus accrued interest), on trust for Ram. Navin was ordered to pay this sum to Ram. Ram is entitled to trace this sum into any traceable product; alternatively, Ram is entitled to an equitable lien over any traceable product. (f) All other prayers for relief were dismissed. 216 Navin’s claim in Suit 139 was dismissed. 217 As for costs, I ordered Navin and Mrs Navin to pay (a) Ram costs fixed at S$200,000. I allowed the disbursements as claimed save for the disbursements for Ram’s handwriting expert (which I disallowed) and the reimbursement of hearing fees (which I limited to 50 per cent);   (b) Mrs Ram costs fixed at S$150,000. I allowed the disbursements as claimed. Chua Lee MingJudge Tan Teng Muan and Loh Li Qin (Mallal & Namazie) for the plaintiff in Suit No 911 of 2016 and defendant in Suit No 139 of 2017;Letchamanan Devadason, Mahtani Bhagwandas and Chong Jia Hao (Legal Standard LLP) for the first to third defendants in Suit No 911 of 2016 and the plaintiff in Suit No 139 of 2017;Sarbjit Singh Chopra and Ho May Kim (Selvam LLC) for the fourth defendant in Suit No 911 of 2016.",
        "The SPA between Navin and Mrs Ram": "199 The background has been set out in [27] to [29] above.",
        "Mrs Ram’s claims": "200 In her closing submissions, Mrs Ram argued that the SPA234Foot Note 234×1 AB 861–864.should be set aside on the grounds of economic duress, undue influence, unconscionability, misrepresentation and non est factum.235Foot Note 235×4th Defendant’s Closing Submissions, at paras 67–97. See SOC, at paras 25–41. 201 It was clear that Mrs Ram did not sign the SPA under any economic duress or undue influence and that she had not successfully invoked the doctrine of unconscionability. After all, Mrs Ram’s own evidence was that236Foot Note 236×Mrs Ram’s AEIC, at paras 29 and 31. (a) she had a quarrel with Ram in November 2014 because he wanted to close Evergreen due to his disagreements with Navin, after which she left Ram; (b) one reason she did not want Ram to close Evergreen was that it could cause Navin to lose his livelihood; and (c) she signed the SPA and the POA so that Navin could exercise the voting rights to her shares and prevent the closure of Evergreen. 202 As for misrepresentation, Mrs Ram claimed that Navin misrepresented to her that:237Foot Note 237×D4SOC, at para 25(s). (a) the power of attorney for him to exercise the voting rights to her shares had to be structured as a sale and purchase agreement; (b) Mrs Ram would remain the legal owner of the shares for the rest of her life without exception; (c) Navin required the POA so that he could secure her proxy for meetings of Evergreen; (d) Navin would resume payment of Mrs Ram’s share of the Annual Allowance after she signed the SPA. 203 I dismissed Mrs Ram’s misrepresentation claim. The structure of the SPA suggested that the intent was to let Navin exercise the voting power on his mother’s shares. However, the payment of US$1.962m to Mrs Ram was more consistent with it being a sale than a mere power of attorney to vote. Mrs Ram’s pleaded case was that the payment was a transfer of half of the sale proceeds of the Bonds.238Foot Note 238×D4SOC, at para 24.However, Mrs Ram’s oral testimony clearly contradicted this. On the stand, Mrs Ram testified that239Foot Note 239×NE, 31 July 2018, at 44:16–45:3. (a) she did not know that it was half of the money invested in the Bonds; and (b) the US$1.962m that was paid to her was “for her security” because she had left Ram and did not have any money. 204 I did not accept Mrs Ram’s claim that Navin gave her US$1.962m for her “security”. As Mrs Ram admitted, Navin had never given her such big sums of money in the past.240Foot Note 240×NE, 31 July 2018, at 45:4–6.Further, as dealt with earlier (at [58] above), the amount of US$1.962m was not used to meet any living expenses. It could not therefore have been for her “security” as Mrs Ram claimed. Mrs Ram’s oral testimony also showed that she understood that she was transferring her shares to Navin.241Foot Note 241×NE, 31 July 2018, at 40:21–41:5.In my view, the US$1.962m was the purchase price of her share, as stated in cl 2.1 of the SPA. In my judgment, Mrs Ram knew she was selling her shares to Navin for US$1.962m. 205 As for the alleged representation that Navin would resume payment of Mrs Ram’s share of the Annual Allowance, that was a representation of intention, not of fact. Even if it was false, it was not actionable. Further, it was not pleaded that Navin did not in fact hold the intention to pay the Annual Allowance, at the time of the alleged representation. 206 Mrs Ram also pleaded that the SPA was void for lack of consideration. In my view, this was an unmeritorious claim. US$1.962m was paid to Mrs Ram pursuant to the SPA. 207 In her statement of claim, Mrs Ram pleaded that Navin had no right under the SPA to transfer the shares to his name.242Foot Note 242×D4SOC, at para 23.In closing submissions, she confirmed that she would not proceed with this claim.243Foot Note 243×NE, 6 September 2018, at 19–21.In any event, it was clear that Mrs Ram’s revocation of the POA was a breach of her undertaking to grant an irrevocable POA to Navin, and that accordingly, Navin was entitled to transfer the shares to his name.",
        "Ram’s claim": "208 Ram claimed that Mrs Ram held her shares on trust for him and that Navin dishonestly assisted Mrs Ram in her breach of trust and/or was in knowing receipt of the shares.244Foot Note 244×SOC, at par 49.I found that Ram had not proved that the shares were held by Mrs Ram on trust for him. Both Ram245Foot Note 245×NE, 17 July 2018, at 132:3–14.and Braj246Foot Note 246×NE, 20 July 2018, at 31:15–19.testified that the MOU provided for Mrs Ram to have 25% of the shareholding in Evergreen so that she would have these shares if anything happened to Ram. This was inconsistent with the claim that Mrs Ram held the shares on trust for Ram. 209   I therefore found that the SPA was a valid sale of Mrs Ram’s shares in Evergreen to Navin and that the transfer of the shares to Navin was valid.",
        "Navin’s counterclaim": "210 Navin counterclaimed for the return of: (a) the US$2m settlement sum paid to Ram under the 2015 Deed; (b) the 10% shares in EG Global transferred to Ram; and (c) the 7,300 shares in Janson Engineering transferred to Mrs Ram. 211 I had set aside the 2015 Deed and the September Agreement, and ordered Ram to return the sum of US$2m to Navin. As for the shares in EG Global, Navin’s own evidence was that he transferred those shares to Ram as “as gesture of goodwill”.247Foot Note 247×Navin’s AEIC, at para 36.There was therefore no basis for his counterclaim for the return of the shares in EG Global. 212 As for the shares in Janson, those shares were gifted by Navin to Mrs Ram “out of natural love and affection” by way of a Deed of Gift dated 1 September 2015.248Foot Note 248×2 AB 996 – 1000.In his AEIC, Navin testified that he agreed to transfer the shares to Mr Ram, after the 2015 Deed had been entered into, as Ram had “agreed to drop all his claims and live in harmony with [Navin’s] wife and [Navin] as a family”.249Foot Note 249×Navin’s AEIC, at para 37.In the circumstances, there was also no basis for Navin’s counterclaim for the return of the shares in Janson. In my view, the September Agreement did not give Navin any claim to these shares either. The transfer of the shares was clearly described as a gift to Mrs Ram. 213 In any event, Navin’s counterclaim was based on an alleged breach of the harmonious relationship clause in the 2015 Deed. This clause obligated the parties to the 2015 Deed to “conduct [themselves] in the best possible manner so as to achieve a good and harmonious relationship with one another and also vis-à-vis [Evergreen]”. I had reservations about the certainty and consequent enforceability of this clause. Further, in my view, a breach of this clause would result only in damages.",
        "Suit 139": "214 I dismissed Navin’s claim for defamation against Ram. In brief, I found that Ram had defamed Navin but that the defence of justification had been made out.  Navin has not appealed my decision in Suit 139."
    }
}