{
    "case_title": "Scotch Whisky AssociationvIsetan Mitsukoshi Ltd",
    "ncitation": "[2019] SGHC 200",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Background": "2 The respondent is a Japanese department store group selling a variety of different products, including alcoholic beverages. It was established over a century ago and was one of the earliest Japanese retail groups to enter the Asian market.1Foot Note 1×Appellant’s Bundle of Documents, Volume 1, p 314.The respondent applied to register the trade mark “Isetan Tartan” on 18 June 2016 under Class 33 (all alcoholic beverages except beer; sake). 3 The appellant is an association of the leading distillers, blenders, and exporters of Scotch Whisky.2Foot Note 2×Appellant’s Written Submissions, para 3.Its members sell Scotch Whisky all over the world, including Singapore under world famous brands such asTheMacallan,Johnnie Walker, Vat 69,Chivas Regal, etc.3Foot Note 3×Appellant’s Notice of Opposition dated 3 January 2017.One of its principal objectives is the protection of the Scotch Whisky trade around the world.4Foot Note 4×Appellant’s Bundle of Documents vol 1, p 31; Memorandum of Association of The Scotch Whisky Association.On 3 January 2017, the appellant filed its notice of opposition to the respondent’s application. It raised several grounds in the notice of opposition, but ultimately proceeded on ss 7(7), 7(5), 7(4)(b), 7(1)(b) and 7(1)(c) of the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the TMA”) before the assistant registrar. The assistant registrar dismissed the opposition on all grounds.",
        "Grounds of Appeal": "4 On appeal, the appellant raised three grounds of opposition to the registration of the “Isetan Tartan” mark. 5 First, the appellant argued that registration of the “Isetan Tartan” mark should not be allowed as it would be contrary to s 7(4)(b) of the TMA as the mark was of such a nature as to deceive the public as to its geographical origin. 6 Secondly, the appellant contended that registration of the “Isetan Tartan” mark should not be allowed as it would be contrary to s 7(5) TMA read with s 3 of the Geographical Indications Act (Cap 117B, 1999 Rev Ed) (“GIA”). 7 Lastly, the appellant argued that registration of the “Isetan Tartan” mark should not be allowed as it would be contrary to s 7(7) TMA as it contained a geographical indication.",
        "My decision": "8 I deal with the first ground separately, and the second and third grounds together as they raise common issues.",
        "Section 7(4)(b) of the TMA": "9 Section 7(4)(b) of the TMA provides as follows: Absolute grounds for refusal of registration (4) A trade mark shall not be registered if it is — … (b) of such a nature as to deceive the public (for instance as to the nature, quality or geographical origin of the goods or service). [emphasis in original] 10 The provision is inparimateriawith s 3(3)(b) of the Trade Marks Act 1994 (c 26) (“UK TMA”). The commentary in James Melloret al,Kerly’sLaw of Trade Marks and Trade Names(Sweet & Maxwell, 15thEd,2011)(“Kerly”) at [8-200] – [8-201] on s 3(3)(b) of the UK TMA is therefore useful guidance in applying s 7(4)(b) of the TMA: Section 3(3)(b) of the 1994 Act prevents the registration of deceptive marks, a notion familiar in the United Kingdom from s 11 of the 1938 Act. The paragraph itself cites some non-exhaustive examples: trade marks which are of such nature as to deceive the public as to the nature, quality or geographical origin of the goods or services. In general, if a mark gives rise to an expectation which will not be fulfilled, then registration will be refused. The expectation (and hence the objection) must be a real one, as opposed to something obscure or fanciful, arising from the mark itself. There are two features of this provision to note. First, it is an absolute and not a relative ground for refusal. It is concerned with deceptiveness which is inherent in the mark itself, as opposed to deception caused by the similarity of the mark to another. … Secondly, the paragraph refers expressly to deception caused by the nature of the mark itself. This does not mean that the mark has to be considered in a vacuum. It must be considered against the goods or services applied for and in the general context of the relevant trade. 11 Thus, in applying s 7(4)(b) of the TMA, the court ought to consider the goods or services applied for, as well as the general context of the relevant trade. The objection must be a real one, as opposed to something obscure or fanciful, arising from the mark itself. In this present case, the appellant confined its opposition solely to the respondent’s use of the “Isetan Tartan” mark in whisky that is not Scotch whisky. Hence, I consider whether the mark is of a nature as to deceive the public as to its geographical origin in relation to these products. The public in this context does not refer to the “general public”, but the “public” in the general context of the relevant trade. To my mind, this refers to consumers who drink and purchase whisky. This is the position adopted by both the appellant and the respondent at the hearing. 12 I briefly summarise the parties’ respective cases. The appellant argued that tartan is an iconic symbol of Scotland, and that Singaporean consumers recognise tartan as such an icon. It also submitted that courts around the world have prohibited the use of the word “Tartan” on whiskies which do not originate from Scotland. On this point, it cited,inter alia, the UK Trade Marks Registry case ofTARTAN GLORY Trade Mark[2000] BL O/003/00 (“Tartan Glory”). Further, the appellant suggested that, even though the word “Tartan” is used together with the word “Isetan”, as in “Isetan Tartan”, the “house mark” principle applies: consumers would therefore view “Isetan” as the “house mark” denoting the identity of the manufacturer and see “Tartan” as the “real” trade mark of the product.5Foot Note 5×Appellant’s Written Submissions, para 56. 13 The respondent argued that the mark “Isetan Tartan” is not of such a nature as to deceive the public. There is “no real or sufficiently serious risk or danger” that a consumer will be deceived that the goods originate from Scotland.6Foot Note 6×Respondent’s Written Submissions, para 29.The respondent also submitted that, even if the appellant successfully proves that Singaporeans are familiar with the term “Tartan” as well as with Scotland, use of the trade mark “Isetan Tartan”, with both words combined, would not deceive the public. The respondent stated that the public will call to mind Japan (as opposed to Scotland), as Isetan was strongly evocative of Japan. In its view, greater significance must attach to the first word of the mark – in this case, “Isetan”. 14 The appellant sought to demonstrate that the “Isetan Tartan” mark is of such a nature as to deceive the public as to its geographical origin or quality by adducing evidence in order to establish two underlying facts. First, that tartan is an iconic symbol of Scotland and that it is used to signify a link with Scotland. Second, that Singapore consumers recognise tartan as a Scottish icon. 15 I now consider whether the appellant has adduced sufficient evidence to prove the above stated facts. I find these two facts to be helpful in determining whether the “Isetan Tartan” mark is of a nature as to deceive the public as to its geographical origin. The stronger the association between tartan and Scotland, the more likely the public is to be deceived. Equally, the greater the familiarity the public in Singapore has with tartan and Scotland, the greater the likelihood of deception. 16 To provide some background, a tartan is a cross-checked repeating pattern of different coloured bands, stripes, or lines of definite width and sequence, woven into woollen cloth. In the appellant’s submission, while such patterns have existed for centuries in many cultures, they have come to be regarded as “peculiarly Scottish” and a quasi-heraldic Scottish family or clan emblem: Robert Bain, Margaret O. MacDougall and P.E. Stewart-Blacker, “The Clans and Tartans of Scotland” (Collins, 1976).7Foot Note 7×Exhibit H, OSD, pp 137 – 138.Evidence was also provided of a survey conducted in 2012 byYouGov, an international market research firm, ranking tartan as Scotland’s third most recognisable icon.8Foot Note 8×Appellant’s Written Submissions, para 15; Exhibit LML-4, OSDR, p 43.Dr Megan Rae Blakely has also written in the article “Pattern recognition: government regulation of tartan and commodification of culture” 2015, Volume 22(4), pp 487 – 504, International Journal of Cultural Property at 491): 491. Tartan’s importance to Scotland cannot be overestimated. It is deeply embedded in Scottish culture and is an internationally recognised symbol of Scotland. This symbol serves to maintain identity and local solidarity and also directs positive attention towards Scotland through heritage and genealogical tourism as well as private and public scholarship. 17 I accept that there is ample evidence to show that tartan is an iconic symbol of Scotland. During the hearing, the respondent did not seriously dispute that tartan is an iconic symbol of Scotland, although it was pointed out to the court that tartans were also associated with countries other than Scotland – foreg, tartans were also produced in Ireland. However, I do not think that this detracted from the fact that tartan remains an iconic symbol of Scotland. 18 The next aspect of the appellant’s evidence which I turn to consider is the Singapore public’s familiarity with tartan, as well as Scottish culture and traditions more generally. From the evidence, it is clear that Singapore has had an enduring association with Scotland. The appellant pointed out that that Colonel William Farquhuar, the first Resident and Commandant of Singapore, was a Scotsman and that Singapore’s first European style church was also named St Andrew’s Church, after the patron saint of Scotland. 19 More persuasively, the appellant highlighted evidence suggesting contemporary familiarity with tartan and Scotland. In 2006, the Highlander bar organised a two-night “Taste of Tartan” festival in 2006 in Clarke Quay for St Andrew’s Day. Evidence was also presented that Scotland received more than 21,000 visitors from Singapore in 2016 with more than 29 million pounds Sterling being spent over more than 500,000 nights.9Foot Note 9×Exhibit 19, OSDR, pp 123 – 125.In my view, this is sufficient evidence that the public in Singapore is familiar with tartan, and Scotland more generally. 20 I now proceed to consider the relevance ofTARTAN GLORY Trade Mark[2000] BL O/003/00 (“Tartan Glory”), a key aspect of the appellant’s submissions. This was a case in which the applicant attempted to register the mark “TARTAN GLORY” in Class 33 for “Scotch whisky, vodka, gin, spirits”. The opponents objected to the registration, and argued that that it fell afoul of s 3(3)(b) of the UK Trade Marks Act, the UK equivalent to s 7(4)(b) of the TMA. The registrar disallowed the registration and stated at [30]: Although the mark applied for is TARTAN GLORY and not TARTAN solus it does not on that account escape objection under Section 3(3)(b). Words such as GLEN and LOCH are almost always associated with other words but that does not in itself detract from an association with Scotland.I take the view that the mark applied for is likely to bestrongly evocative of Scotland. [emphasis added in bold] 21 As this was an English case, the registrar’s focus would have been whether the mark was of a nature that the public in England would be deceived as to the quality or geographical origin of the product bearing the name “TARTAN GLORY”. In the present case, I am obliged to consider whether the “Isetan Tartan” mark is of such a nature to deceive the public in Singapore as to the product’s geographical origin, regardless of the decision arrived at inTartan Glory. However, I am guided by the decision, as well as the evidence presented by the appellant, that the word “Tartan” is especially evocative of Scotland. 22 I now turn to the respondent’s case. Its first objection to the ground of opposition under s 7(4)(b) of the TMA centred on the appellant’s failure to show that there is a “real or sufficiently serious risk or danger” that a consumer will be deceived.10Foot Note 10×Respondent’s Written Submissions, para 26. 23 In addition to the statements above at [10] and [11] elucidated inKerly, I accept the principles inSmirnoff Trademarks[2006] RPC 16 at [46] and [49] on the degree of public deception which is required for s 7(4)(b) of the TMA to be triggered. It is stated: As a result it seems to me that the authorities consider the consumer to be reasonably observant and circumspect and thus sufficiently alert and sensible such as not to need protection from claims that might only deceive a relatively small number of customers. Overall, what is alleged to be misleading must be sufficiently serious and likely to affect the economic behaviour of the public. … Thus, taking all those points and authorities into account, I reach the view that in relation to s 3(3)(B) there must be something inherent within the trade mark sufficient to mislead the public to a material extent before a positive finding can be made. 24 Given my above finding that there is a strong association between tartan and Scotland, as well as the public’s familiarity with Scotland and tartan, I find that that the use of the mark “Isetan Tartan” on non-Scotch whisky products is sufficiently deceptive as to the product’s geographical origin. In assessing deception, I bear in mind that the average whisky consumer is likely to be particularly familiar with Scotland and its tartan. In the mind of the whisky drinker, any whisky bearing the label “Tartan”, whether it be accompanied with the word “Isetan”, will call to mind Scotch whisky. The nature of the deception is also intensified because Scotland is globally renowned for its whisky. If, for instance, the mark “Isetan Tartan” were used on an alcoholic beverage which was not whisky, I would agree with the respondent that it does not fall afoul of s 7(4)(b) of the TMA. 25 I do not agree that the word “Isetan” in front of the word “Tartan” makes the mark any less deceptive. Although it was suggested by the respondent that the mark is more likely to evoke “Japan” than Scotland, one ought to consider that Isetan is a department store selling a variety of different products originating from various countries. It is unlikely that the average consumer would think that the different products sold in Isetan all originate from Japan, even though the word “Isetan” may well evoke Japan. In considering the mark “Isetan Tartan” in the context of sale,ie, non-Scotch whisky bottles sold in the Isetan department store, the average consumer of whisky is likely to think that the whisky originates from Scotland. 26 The respondent also submitted that greater emphasis should be placed on the “first word”,ie, “Isetan”, instead of the second word “Tartan”. I do not think that this is necessarily true in every instance. In the circumstances of this case, it is clear to me that the average consumer of whisky will attach greater significance to the second word “Tartan” and is therefore likely to be deceived that the product is from Scotland. 27 As the use of “Isetan Tartan” on non-Scotch whisky products would deceive the public as to the products’ geographical origins, I allow the appeal on this ground.",
        "Sections 7(5) and 7(7) of the TMA": "28 Section 7(5) of the TMA states: (5) A trade mark shall not be registered if or to the extent that its use is prohibited in Singapore byany written law or rule of law. [emphasis added] 29 The written law or rule of law which the appellant relied on is ss 3(2)(a), 3(2)(b) and 3(2)(d) of the GIA. They read as follows: (2) This section shall apply to the following acts: (a) theuse of a geographical indicationin relation to any goods which did not originate in the place indicated by the geographical indication, in a manner which misleads the public as to the geographical origin of the goods; (b)any use of a geographical indicationwhich constitutes an act of unfair competition within the meaning of Article 10 bisof the Paris Convention; … (d)any use of a geographical indication, being a geographical indication which identifies a spirit, in relation to a spirit which did not originate from the place indicated by the geographical indication, whether or not — (i) the true geographical origin of the second-mentioned spirit is used together with the geographical indication; (ii) the geographical indication is used in translation; or (iii) the geographical indication is accompanied by any of the words “kind”, “type”, “style”, “imitation” or any similar word or expression. [emphasis added in bold] 30 The second provision upon which the appellant relies is s 7(7) of the TMA. It reads: (7) Notwithstanding subsection (2), a trade mark shall not be registered ifit contains or consists of a geographical indicationin respect of a wine or spirit and the trade mark is used or intended to be used in relation to a wine or spirit not originating from the place indicated in the geographical indication. [emphasis added in bold] 31 In order for s 7(5) of the TMA to come into effect, the appellant must first show that there has been “useof a geographical indication”. As for s 7(7), the appellant must show that the trade mark “contains or consists of a geographical indication”. Both grounds thus raise the common issue of what is a “geographical indication”. I deal with this below in more detail at [43] and [44]. 32 In determining whether there has been “use of a geographical indication” under s 7(5) of the TMA, two questions must be answered: (a) First, what is it that is being “used” by the trade mark applicant? (b) Second, is the thing that is being “used” by the trade mark applicant a “geographical indication” within the meaning of s 2 of the GIA? 33 Similarly, in determining whether the “trade mark contains or consists of a geographical indication” under s 7(7) of the TMA, two questions must be answered: (a) First, what is it that the trade mark contains or consists of? (b) Second, is that thing that the trade mark contains or consists of a “geographical indication” within the meaning of s 2 of the GIA? 34 I first deal with the arguments raised by the appellant in relation to s 7(5) of the TMA. 35 During the oral hearing, the appellant attempted to convince me that what was beingusedby the respondent was the phrase “Scotch Whisky”, and that because “Scotch Whisky” is undisputedly an established “geographical indicator”, the respondent’s registration of the trade mark “Isetan Tartan” should be refused under s 7(5) of the TMA. The appellant relied on the European Court of Justice (“ECJ”) decision inScotch Whisky Association v Klotz[2018] Bus. L.R 1466 (“Klotz”) as authority that the word “use” should also include other forms of use than direct “use”. I am not persuaded by this argument. 36 In theKlotzcase, the ECJ considered the following question in relation to Articles 16(a) and 16(b) of Parliament and Council Regulation No 110/2008: whether an “indirect commercial use” of a geographical indication or an “evocation” of a geographical indication can be used in identical or phonetically and/or visually similar form, or is it sufficient that the disputed element evokes in the relevant public some kind of association with the registered geographical indication or the geographical area (see at pp 1470-1471).11Foot Note 11×Appellant’s Bundle of Authorities, Tab 32, p 456. 37 The relevant legislation, Article 16 of Parliament and Council Regulation No 110/2008, reads as follows: Protection of geographical indications Without prejudice to Article 10, the geographical indications registered in Annex III shall be protected against: a) Any direct or indirect commercial use in respect of products not covered by the registration in so far as those products are comparable to the spirit drink registered under that geographical indication or insofar as such use exploits the reputation of the registered indication; b) Any misuse, imitation or evocation, even if the true origin of the product is indicated or the geographical indication is used in translation or accompanied by an expression such as ‘like’, ‘type’, ‘style’, ‘made’, ‘flavour’ or any other similar term; c) Any other false or misleading indication as to the provenance, origin, nature or essential qualities on the description, presentation or labelling of the product, liable to convey a false impression as to its origin; d) Any other practice liable to mislead the consumer as the true origin of the product. 38 In my view, the ECJ decision inKlotzdoes not shed any light on the scope of the word “use” under the GIA. The decision does not have anything to do with how the word “use” is to be interpreted under Article 16, let alone under the TMA read with the GIA. 39 Counsel for the appellant then submitted that the word “use” under the GIA had to be interpreted in accordance with Article 16 of the Parliament and Council Regulation No 110/2008 as both the Singapore and EU legislation were enacted pursuant to Articles 22 and 23 of the TRIPS Agreement. The word “use” should therefore include wider forms of “use” such as “indirect commercial use” and “evocation” of a geographical indication, as under Article 16 of Parliament and Council Regulation No 110/2008. Even if it is true that both the Singapore and EU legislation were enacted pursuant to the TRIPS Agreement, it does not necessarily follow that the ambit of the word “use” must mean precisely the same thing in both jurisdictions. Examining Article 16, the provision prohibits “indirect commercial use” as well as “evocation” of a geographical indicator. Thus, it is apparent that the scope of protection offered by the EU legislation is significantly wider than that which is offered under Singapore’s equivalent legislation. Reading s 7(5) of the TMA with s 2 of the GIA, it is clear that only “use” of a geographical indicator is proscribed. I am therefore guided by the plain and ordinary meaning of the word “use”. Wider forms of “use” such as “indirect commercial use” and “evocation” do not fall within the definition of “use” under the GIA. 40 Having rejected counsel’s submission that the word “use” embraces wider concepts such as “indirect commercial use” and “evocation”, I reject the appellant’s submission that the respondent has used “Scotch Whisky”. It is manifestly obvious that what is being “used” by the respondent is the trade mark “Isetan Tartan”. After all, this is the subject of its application for registration of a trade mark. There is no evidence whatsoever that the respondent is attempting to register the trade mark “Scotch Whisky”, or is using the words “Scotch Whisky” in any other manner. 41 The appellant also ran the alternative argument that the respondent “used” the geographical indicator “Tartan” in the trade mark “Isetan Tartan”. I accept that what is being used is the trade mark “Isetan Tartan”. I proceed to consider whether “Tartan” is a geographical indication under s 2 of the GIA. 42 The phrase “geographical indication” is statutorily defined under s 2 of the GIA. The provision reads as follows: Interpretation 2. In this act, unless the context otherwise requires — “geographical indication” means any indication used in trade to identify goods as originating from a place, provided that — (a)  the place is a qualifying country or a region or locality in the qualifying country; and (b) a given quality, reputation or other characteristic of the goods is essentially attributable to that place; … [emphasis in original] 43  Thus, s 2 of the GIA states that a “geographical indication” means “any indication used in trade to identify goods as originating from a place”. The following extract at [34.003] of Susanna H S Leong,Intellectual Property Law of Singapore(1st Ed, 2013) (“Leong”) elaborates helpfully on this definition: [Geographical indications] often consist of the actualgeographical name of the place of origin of the products but other indicating terms may also suffice as [Geographical Indications] as long as they identify the goods as originating in the territory, region or locality in the territory. Thus, it may be argued that iconic symbols such as the Eiffel Tower, the Great Wall of China or the Taj Mahal may serve as [Geographical Indications] of products from France, China or India. 44 The usual form of a “geographical indication” is one which consists of theactualgeographical nameof the place or origin, foreg, French wine, Italian cheese, or Greek olives – these indicate that the products originate from and have a given quality, reputation or other characteristic essentially attributable to France, Italy and Greece respectively. The learned author also suggests that iconicsymbolsof particular countries may also be used as a geographical indication. 45 Relying on this, the appellant submitted that an iconic symbol of Scotland, like tartan, can similarly be used to identify the product as originating from Scotland. However, the examples provided byLeongat [34.003] – the Eiffel Tower, the Great Wall of China, and the Taj Mahal – all relate toparticularplaces, even if they do not explicitly specify the countries from which they originate. Use of the word “Tartan” does not denote a particularplace. Nor does it clearly attribute a given quality, reputation or characteristicto a place. A tartan, as I have stated above at [16],is the name for a cross-chequered repeating pattern, albeit one that is especially associated with Scotland. Although the appellant sought to convince me to extend the definition of a “geographical indication” to include matters that were notplaces, I am loath to do so in the absence of any authority. It is clear to me that a “geographical indication” must refer to a geographical location or place. I dismiss the appellant’s ground of opposition based on s 7(5) of the TMA. 46 The last ground of appeal centres on s 7(7) of the TMA. Under this provision, the appellant must show the trade mark “contains or consists of a geographical indication”. What the trade mark contains is the word “Tartan”. The question then is whether “Tartan” is a geographical indication. Having already determined that it is not (see at [44]), I also dismiss the appellant’s ground of opposition based on s 7(7) of the TMA.",
        "Conclusion": "47 The appeal is allowed on the ground that it is contrary to s 7(4)(b) of the TMA as the mark, when used for whisky that is not Scotch whisky, is of such a nature as to deceive the public as to its geographical origin.  This means that the mark would have been allowed if this category of goods,ie,whisky that is not Scotch whisky, were excluded from the class of goods that the mark is to be used for. 48 Unless there is any reason for me to order otherwise, for which the parties have liberty to apply, I order the respondent to pay costs to the appellant fixed at $5000. Lee Seiu KinJudge Thng Aaron and Christabel Lim (Amica Law LLC) for the appellant;Yvonne Tang Li Ling and Jaswin Kaur Khosa (Drew & Napier LLC) for the respondent."
    }
}