{
    "case_title": "Ng Kong Yeam  (suing by Ling Towi Sing (alias Ling Chooi Seng) and others)vKay Swee Pin and another",
    "ncitation": "[2019] SGHC 219",
    "coram": "Vincent Hoong JC",
    "sections": {
        "Introduction": "1 It is unfortunate that the dispute in the present case has landed in court. It is a dispute between the plaintiff and the defendants over the ownership of shares in a company which in turn owns two valuable assets: shares in a local tour agency, and an apartment in Singapore. 2 The plaintiff, Ng Kong Yeam, cohabited with the first defendant, Kay Swee Pin for about thirty years. While the plaintiff and the first defendant were never lawfully married as the plaintiff remained married to his wife in Malaysia throughout, they lived as a family unit in Singapore with the second defendant, Wu Yimei Eva Mae, their biological child. 3 Following a doctor’s report on 20 August 2013, whereby the plaintiff was certified to be “mentally disordered under the provisions of the Mental Health Act 2001 of Malaysia”,1Foot Note 1×Plaintiff’s Bundle of Affidavits of Evidence-in-Chief Vol 1 (“PBAEIC1”) Tab NCS-1, pp 4 – 5, para 12.the High Court of Malaya (Johor Bahru) declared the plaintiffnon compos mentison 6 December 2013.2Foot Note 2×PBAEIC1 Tab NCS-2.Consequently, his wife and children from his marriage in Malaysia (“the litigation representatives”) were appointed by the High Court of Malaya as the Committee of the Estate of Ng Kong Yeam to manage the plaintiff’s estate and legal proceedings.3Foot Note 3×PBAEIC1 Tab NCS-2.Flowing from their appointment, the litigation representatives assert, on the plaintiff’s behalf, that 799,999 shares in NatWest Holdings (Pte) Ltd (“NHPL”) which had been transferred by the plaintiff to the first defendant are in fact held by the first defendant on the plaintiff’s behalf, by virtue of a resulting trust or a presumption of resulting trust. Alternatively, the plaintiff claims that the defendants are liable for breach of contract by failing to provide consideration for the transfer of the shares.4Foot Note 4×Bundle of Pleadings, Tab 3 (“SOC”), pp 4 – 11. 4 Given the state of the plaintiff’s lack of mental capacity, this court is left with a less than straightforward task of discerning whether the transfer of the valuable shares, which were effectedbeforethe plaintiff lost his mental capacity, can be impugned in any of the ways asserted by his litigation representatives. 5 Having considered the objective evidence which shed light on the plaintiff’s state of mind when effecting the transfer of the shares and the parties’ submissions, I find that the first defendant is the legal and beneficial owner of the disputed shares. Accordingly, I dismiss the plaintiff’s claims in their entirety. These are my reasons. Facts",
        "Background to the dispute": "6 The plaintiff has been married to Ling Towi Sing (“Mdm Ling”) since 1962.5Foot Note 5×PBAEIC1 at para 9.They have three children; namely Ng Chung San (“NCS”), who is also known as “Gabriel”, Lena Irene Cheng Leng Ng (“Irene”) and Iris Ng Tse Min.6Foot Note 6×PBAEIC1 at para 4. 7 While the plaintiff has remained married to Mdm Ling throughout, it is undisputed that they have been estranged since the 1980s, when the plaintiff began a relationship with the first defendant.7Foot Note 7×Defendants’ Bundle of Affidavits of Evidence in Chief (“DBAEIC”) at p 75, para 16; Transcripts (9 July 2019) p 122 lines 12 – 15.The plaintiff and the first defendant subsequently had a child together with the birth of the second defendant in May 1987.8Foot Note 8×DBAEIC at p 75, para 17. 8 Also in the 1980s, the plaintiff incorporated NHPL as a holding company for his assets in Singapore.9Foot Note 9×DBAEIC at p 84, para 44.At the time of the commencement of the suit, NHPL’s assets comprised: (a) more than 27 million shares in Sino America Tours Corporation Pte Ltd (“SA Tours”), making it the majority shareholder of the company, and (b) an apartment at 53 Cairnhill Road, #28-03, Singapore 229664 (the “Cairnhill apartment”), which has served as the family home  of the plaintiff and the defendants since its acquisition in 1991.10Foot Note 10×DBAEIC p 74, para 9 and PBAEIC1, p 48, para 101.",
        "The share transfer": "9 As at 6 June 2009, the first defendant owned one share in NHPL, while the plaintiff owned the remaining 799,999 shares.11Foot Note 11×PBAEIC1 p 3, para 7 and Tab NCS-3. 10 However, by a share transfer form dated 1 November 2010 and lodged on 1 April 2011 (“the share transfer form”),12Foot Note 12×PBAEIC1 p 16, paras 36 – 37.the plaintiff’s 799,999 shares in NHPL were transferred to the first defendant, purportedly for the consideration of S$1 million (“the share transfer”).13Foot Note 13×PBAEIC1, Tab NCS-17, p 180. 11 The plaintiff’s litigation representatives do not dispute that the share transfer is properly evidenced by the share transfer form.14Foot Note 14×Transcripts (9 July 2019), p 82 lines 16 – 25 and p 83 line 23 – p 84 line 2.Nonetheless, given the considerable value of the assets held by NHPL, it is with little surprise that the parties have diametrically opposed accounts of the events surrounding the transfer of the 799,999 shares from the plaintiff to the first defendant. 12 In brief, the plaintiff’s version of the events, as asserted by his litigation representatives, is that the first defendant had, in an email dated 10 November 2008, asked the plaintiff to give to her his shares in SA Tours in the event that he pre-deceased her. In the same email, the first defendant requested the plaintiff to sign a share transfer form, with the undertaking that she would not execute it until his demise.15Foot Note 15×DBAEIC p 197.In his reply dated 13 November 2008, the plaintiff explained that he had decided to will SA Tours to the first defendant,16Foot Note 16×DBAEIC p 198.thus obviating the need for a share transfer form. Yet, the first defendant obtained a blank share transfer form (“the Blank Form”) that had been pre-signed by the plaintiff and, without the plaintiff’s knowledge and consent, surreptitiously filled in the details of the Blank Form to effect a transfer of all of the plaintiff’s NHPL shares (which held the SA Tours shares) to herself.17Foot Note 17×SOC pp 4 – 8, paras 6 – 15. 13 It is further alleged, in the alternative, that the first defendant had breached the contract for the transfer of the shares as the first defendant had failed to provide the consideration of S$1 million that was stipulated in the share transfer form.18Foot Note 18×SOC, p 8, para 16. 14 The defendants flatly reject the plaintiff’s version of events in relation to the share transfer. Instead, they aver that the plaintiff and the first defendant had on various occasions discussed the issue of the transfer of the plaintiff’s shares in SA Tours to the first defendant. Eventually, the plaintiff and the first defendant decided that he would transfer his shares in SA Tours to the first defendant “in case the plaintiff died before” the first defendant.19Foot Note 19×Bundle of Pleadings, Tab 4 (“Defence”), p 4, paras 9(b) - (c).He accordingly transferred all of his shareholdings in NHPL, which owned the shares in SA Tours, to the first defendant by way of a share transfer form dated 1 November 2010.20Foot Note 20×Defence, p 6, para 9(e).Because of the transfer, the plaintiff’s Will dated 17 August 2011 did not reflect the bequest of his shares in NHPL to anyone,21Foot Note 21×Defence, p 9, para 19; DBAEIC, Tab KSP-27whereas his previous draft Will in June 2010 had reflected the gift of his shares and entitlement of NHPL to the defendants in equal shares.22Foot Note 22×Defence, p 9, para 19; DBAEIC, Tab KSP-12. 15 As for the consideration of S$1 million, the defendants’ case is that the consideration had been cumulatively provided by way of payments made by the first defendant on the plaintiff’s behalf during their lengthy period of cohabitation. Such payments included, for example, household expenses in Singapore and payments made by the first defendant towards the second defendant’s university tuition fees and related living expenses when she was a student in the United States of America between 2005 and 2008.23Foot Note 23×Defence, p 10, para 20(a); DBAEIC, p 96, paras 88 - 92.",
        "Abandoned heads of claim": "16 At the outset, I note that the plaintiff’s litigation representatives have abandoned their claims in fraud,24Foot Note 24×SOC p 4.unlawful means conspiracy25Foot Note 25×SOC p 5.and remedial constructive trust.26Foot Note 26×SOC p 8.In their closing submissions, they simply pray for relief with respect to their claims in resulting trust, presumption of resulting trust, and breach of contract.27Foot Note 27×PCS paras 9, 10 and 176.This is consistent with NCS’s testimony during the trial, where he explained that while there is no dispute in relation to the share transfer form and its subsequent lodgement, the plaintiff’s case is that there was no intention to benefit the first defendant by way of said share transfer.28Foot Note 28×Transcripts (9 July 2019), p 82 lines 16 – 25 and p 83 line 23 – p 84 line 2.Having taken such a position, the plaintiff’s assertion at [12] that the first defendant had completed the share transfer form and lodged it without the plaintiff’s knowledge and consent therefore falls away. As the abandoned claims were founded on this assertion, they also fall away as a matter of logic. In any event, without the benefit of full arguments in this regard, I decline to make any findings on the abandoned heads of claim.",
        "The key issue": "17 The key contention of the plaintiff’s litigation representatives (as represented in the main by NCS) is that the plaintiff did not intend to benefit the first defendant with the said transfer. Because of this lack of intention to benefit the first defendant, they assert that the first defendant holds the 799,999 NHPL shares on a resulting trust for the plaintiff. Inherent in this assertion is the argument that the plaintiff did not intend the transfer of the shares as a gift to the first defendant. Alternatively, the plaintiff claims S$1 million from the first defendant for breach of contract, on the basis that the consideration stipulated in the share transfer form was never provided by the first defendant (“the contractual claim”).29Foot Note 29×SOC pp 10 – 11; Plaintiff’s Closing Submissions (“PCS”) at p 80, para 176. Resulting trusts: the lack-of-intention analysis 18 I will first address the issue relating to resulting trusts. An intention to benefit the recipient of the transferred property is at the heart of a resulting trust analysis. 19 This is apparent from the Court of Appeal’s reading of Robert Chambers,Resulting Trusts(Clarendon Press, Oxford, 1997) at p 32 (cited inLau Siew Kim v Yeo Guan Chye Terence and another[2008] 2 SLR(R) 108 (“Lau Siew Kim”)at [35]), where the learned author observed as such: The facts which give rise to the presumption of resulting trust are (i) a transfer of property to another, (ii) for which the recipient does not provide the whole of the consideration. The facts which give rise to the resulting trust itself are (i) a transfer of property to another, (ii) in circumstances in which the provider does not intend to benefit the recipient. 20 According to the court inLau Siew Kim(at [35]), Robert Chambers has quite appropriately highlighted two essential points: first, that the lack of consideration required for the presumption isnota requirement for the resulting trust; and second, thatthelack of intention to benefitthe recipient required for the resulting result is precisely the fact being inferred when the presumption is applied. It is thus apparent thata resulting trust may arise independently of the presumption so long as it can be shown that the transfer wasnot intended to benefitthe recipient; and, in a similar vein, a resulting trust may notnecessarilyariseeven ifthere was no consideration, if it can be shown that the transfer wasindeedintended to benefit the recipient. [emphasis in italics in original; emphasis added in bold and underline] 21 As is clear from the above, regardless of whether the resulting trust is established by way of an unrebutted presumption of resulting trust or through direct proof of a lack of intention to benefit the recipient, it is clear that resulting trusts share a unified basis: they are both defeated if it can be shown that the transferor intended to benefit the recipient with the transfer. This follows from Prof Robert Chambers’ lack-of-intention analysis (endorsed by the Court of Appeal inChan YuenLanv See FongMun[2014] 3 SLR 1048 (“Chan YuenLan”) at [38]–[44]), which theorises that resulting trusts “arise whenever the intention of the transferor to benefit the recipient is vitiated or absent” (Chan Yuen Lanat [38]). 22 The difference in practice, however, relates to the burden of proof. Where the presumption of resulting trust arises, the burden lies on the transferee to adduce evidence to show “that the transferor intended to benefit or to make a gift to the transferee”:Chia Kok Weng v Chia Kwok Yeo and another[2017] 2 SLR 964 (“Chia Kok Weng”) at [48]. In contrast, if no presumption of resulting trust arises, the burden falls on the transferor to adduce evidence to show that the transfer was not intended to benefit the recipient:Lau Siew Kimat [35] andChan Yuen Lanat [43]. 23 Therefore, the key issue that falls to be decided is whether the plaintiff intended to benefit the first defendant with his shares in NHPL via the share transfer. If that is proven to be the case, the plaintiff’s claim of a resulting trust (or presumption of a resulting trust) would fall away. The contractual claim, which is analysed in greater detail at [171]–[175] below, would also fail, since the natural corollary of an intention to benefit or a gift of the shares to the first defendant is that no consideration is required for the share transfer. 24 The plaintiff himself was unable to testify in the present proceedings as he was declarednon compos mentisby the High Court of Malaya on 6 December 2013.30Foot Note 30×PBAEIC1 Tab NCS-2.Hence, this court has to rely on contemporaneous documents, as well as the testimonies of the respective witnesses, to determine the plaintiff’s state of mind at the material time of the share transfer.",
        "Presumption of resulting trust": "25 At the outset, I find that the presumption of resulting trust arises in the present case as the first defendant did not provide any consideration for the share transfer. 26 In two separate proceedings in 2013 and 2014 in Malaysia, the first defendant had testified that she had purchased the plaintiff’s shares in NHPL by furnishing consideration of S$1 million.31Foot Note 31×Plaintiff’s Core Bundle of Documents Vol I (“PCB1”) at Tab 38, pp 241 – 242 and Tab 44, p 256.According to the first defendant, she had furnished such consideration through a “series of transactions”, including occasions when she had paid off some of the plaintiff’s debts:32Foot Note 32×PCB Tab 38, pp 240 – 244. [Q]: Now, can you tell us whether you ended up until today with only 1 share or did you suddenly become an owner of many shares? [A]: On, I am trying to recollect the date, I believe it’s sometime in March 2011, … [the plaintiff] sold all his shares in [NHPL] to me. … [Q]: Ok, what was the purchase consideration? [A]: 1 million Singapore Dollars. [Q]: And how did you pay that 1 million? [A]: I paid him, Your Honour, there were many transactions between us. [Q]: I am talking about the 1 million. [A]: Yes I know, I know, I know what you are talking about but there were many transactions between us. Sometimes I pay some of his debts for him and sometimes, you know like I said. … [A]: Yes, I paid for it. I can still remember there was on [sic] outstanding sum of like 400,000 that he owed me for arr [sic] some shares that, you know, that I had bought for him. Ok, so he said, ok off set against that. Then there was another I think 200 to 300,000.00 dollars because we had some apartments in the US, so I was paying all along all the maintenance for the last 15 years. Ok, so he said ok, offset against that, ok. So it was, that’s what the major items I can remember. 27 Similarly, in the present proceedings, the first defendant asserts that she had paid S$1 million “in cash” or “in kind” for the NHPL shares.33Foot Note 33×Transcripts (18 July 2019) p 62 lines 14 – 15.During re-examination, she explained that the consideration of S$1 million was inserted into the share transfer form on her instructions, to account for the loans she had extended to the plaintiff, as well as household expenses which she had incurred over the years:34Foot Note 34×Transcripts (19 July 2019) p 26 line 20 – p 27 line 9. So all along, [the plaintiff’s NHPL shares] was always meant to be transferred to me. In the end, why was there a consideration of $1 million? Was because I was the one who told him, I was the one who told him, \"Let's put the consideration as $1 million.\" Okay? Based on through the years, I mean, I have extended loans to him, I have paid for every -- almost everything that needed to be paid, running the household. So I said, \"Okay, why don't you put $1 million and just round up, you know, just give it a nice round figure. And then that's it, you know, whatever loans I've given you, or whatever else that you should have paid your part in our lives together, let's just lump it all into this $1 million.\" And that was why it was stated as a consideration of $1 million. 28 Therefore, in the Malaysia and present proceedings, the first defendant has consistently maintained that the S$1 million had been set-off against the numerous payments which she had made on the plaintiff’s behalf over their many years of cohabitation. 29 Crucially, however, the first defendant admitted that when she had made the above  payments or loans, she did not envisage that they would be applied towards her eventual purchase of the plaintiff’s NHPL shares:35Foot Note 35×Transcripts (18 July 2019) p 57 lines 9 – 23. Q.   Going on the face of it, can you show me where you paid this or how you paid this $1 million, on the understanding of your own evidence-in-chief? A. Through the years.  Through the years.  How do I pay it? Depends on what are the items.  Q. Yes, but, you see, I have difficulty here; right?  It's because I did ask you a couple of questions agowhetherall these other expenses, all right, you could envision that in 2010 there were to be this sale of the shares. A.No. Q.   I'm just going on what you said in your AEIC. A.   Yes, yes. Q.   So I put it to you, you never paid this $1 million. A.   I never paid him in cash.  That I will be the first to admit. [emphasis added] 30 It is trite law that an act done before the giving of a promise is past consideration, and past consideration does not amount to consideration, unless three requirements are fulfilled (PaoOn and others v Lau Yiu Long and others[1980] 1 AC 614at 629): An act done before the giving of a promise to make a payment or to confer some other benefit can sometimes be consideration for the promise. The act must have been done at the promisor’s request: the parties must have understood that the act was to be remunerated either by a payment or the conferment of some other benefit: and payment, or the conferment of a benefit, must have been legally enforceable had it been promised in advance. 31 Here, the payments and loans that were allegedly made by the first defendant on the plaintiff’s behalf were not the subject of a legally enforceable agreement between them. Instead, they were extended by the first defendant in the course of her relationship with the plaintiff, during their lengthy period of cohabitation. When such payments and loans were made, the first defendant did not envisage that she would “be remunerated either by a payment or the conferment of some other benefit”, such as by way of the share transfer. In the result, the payments and loans extended by the first defendant, even if proven to have been made, amount merely to past consideration, and cannot qualify as consideration for the transfer of the plaintiff’s 799,999 NHPL shares to her. 32 That the share transfer form stipulates that the plaintiff’s NHPL shares were being transferred to the first defendant “in consideration of the Sum of $ One Million” that had been “fully paid”36Foot Note 36×PBAEIC1 Tab NCS-17.does not change the fact that, even accepting the first defendant’s own explanation as to how the S$1 million had been paid, no consideration was in fact provided by her. 33 As such, I find that the first defendant has not provided consideration for the 799,999 NHPL shares. Since a presumption of resulting trust arises where property is conveyed to another for no consideration (Lau Siew Kimat [34]–[35] and Tang Hang Wu and Kelvin FK Low,Tan Sook Yee’s Principlesof Singapore Land Law(LexisNexis, 4th Ed, 2019) at para 7.17), a presumption of resulting trust arises in this case.",
        "Did the plaintiff have an intention to benefit the first defendant with the share transfer?": "34 On that footing, I turn now to consider whether the presumption of resulting trust is rebutted by an intention on the plaintiff’s part to benefit the first defendant with the share transfer. 35 The burden lies on the defendants to adduce evidence to show, on a balance of probabilities, that the plaintiff intended to benefit the first defendant with his NHPL shares by way of the share transfer.",
        "Bad character evidence": "36 As a preliminary point, the plaintiff has sought to impugn the credibility of the first defendant by referring to prior court proceedings in which she was found to be untruthful and unreliable. According to the plaintiff, such prior findings are relevant as they reveal the first defendant’s propensity to be dishonest, and hence reduce the evidential burden on the plaintiff to show that the conversations between her and the plaintiff never took place.37Foot Note 37×PCS pp 72 – 75, paras 152 – 157. 37 However, such evidence tending to show the first defendant’s bad character is irrelevant, and therefore inadmissible unless such character evidence is made relevant by other provisions of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”). As provided in s 54 of the EA: In civil cases the fact that the character of any person concerned is such as to render probable or improbable any conduct imputed to him is irrelevant, except in so far as such character appears from facts otherwise relevant. 38 Hence, unless the plaintiff is able to identify a provision in the EA that would render the evidence on the first defendant’s propensity to be dishonest relevant, such bad character evidence is irrelevant to the present proceedings. In the absence of such a provision, the first defendant should be allowed to defend the present proceedings on a clean slate, without any doubts cast on her credibility from the outset. 39 The plaintiff refers to s 11(b) of the EA, which provides that: 11. Facts not otherwise relevant are relevant — … (b) if by themselves or in connection with other facts they make the existence or non-existence of anyfact in issue or relevant facthighly probable or improbable. [emphasis added] 40 On its face, s 11(b) of the EA appears to render admissible any fact that would render another fact “highly probable or improbable”. However, the emphasised words show that the fact sought to be admitted must relate to a “fact in issue or relevant fact”. Illustration (a) to s 11(b) of the EA provides examples of the kind of evidence that would be considered related to the fact in issue: (a) The question is whether A committed a crime at Singapore on a certain day. The fact that on that day A was at Penang is relevant. The fact that near the time when the crime was committed A   was at a distance from the place where it was committed, which would render it highly improbable, though not impossible, that he committed it, is relevant. 41 In the illustration, the fact in issue was whether A had committed a crime at Singapore on a certain day. Therefore, the location of A on that particular day in the illustration is clearly relevant. Other facts tending to show A’s location, such as the fact that A was in fact in Penang, would therefore be relevant. 42 Here, the fact in issue relates solely to whether the plaintiff had intended to benefit the first defendant by way of the share transfer. While the first defendant’s credibility is, of course, tangentially relevant to proof of such intention, her credibility is not directly in issue. Hence, I do not see why her credibility in prior lawsuits is relevant to the present proceedings. If it were relevant as of right, the first defendant would find herself in a position where she could never commence or defend any lawsuit on a clean slate. Instead, she would inevitably carry the baggage of findings made against her character in previous court proceedings. This directly contradicts the rationale behind s 54 of the EA. As Choo Han Teck J explained inRocklineLtd and others v Anil Thadani and others[2009] SGHC 209 at [2]: Section 54 is not a shelter for bad character. In civil cases, as it is generally, the law protects a person from adverse findings against him only on the evidence that he was of bad character.Character in itself is an irrelevant fact.A person might be in breach of contract whether or not he was of good character; and conversely, a person of bad character might suffer a civil wrong inflicted on him by a person of good character. … [emphasis added] 43 Hence, for example, inChan Emily v Kang Hock Chai Joachim[2005] 2 SLR(R) 236 (“Chan Emily”), Choo J did not think it was relevant that the defendant, who was defending a civil claim for breach of trust in respect of property entrusted to him, had previously been convicted for criminal misappropriation. This was because “[t]he key issue here is whether the property and money were gifts or not” (Chan Emilyat [12]); the defendant’s propensity to misappropriate was not a fact in issue, and hence it was irrelevant for the purposes of the proceedings. 44 As a result, I find that the findings made in previous court proceedings on which the plaintiff relies to show the first defendant’s propensity for dishonesty are irrelevant in my assessment of her testimony in this case. Accordingly, I shall review her evidence on a clean slate, free of any prejudice that may flow from findings in previous court proceedings associated with her character.",
        "The defendants’ case": "NHPL represented the fruits of the parties’ relationship 45 Returning to the key issue of whether the plaintiff intended to benefit the first defendant with the share transfer, the defendants assert that the share transfer was intended by the plaintiff to ensure that the defendants would be provided for. According to the defendants, this desire of the plaintiff to provide for the defendants stemmed from their life as a family together for over two decades, which centred on their family, their work in SA Tours and their familial home, the Cairnhill apartment.38Foot Note 38×DBAEIC p 87, para 59. 46 In this respect, while the plaintiff remains married to his lawful wife in Malaysia, he had for all intents and purposes lived with the defendants as a family unit from around the late 1980s until 2013,39Foot Note 39×DBAEIC p 75 para 17 and p 77 paras 27 – 28.when he returned to live in Malaysia following a significant deterioration in his mental condition.40Foot Note 40×DBAEIC p 77, para 28.The quasi-familial relationship between the parties is corroborated by an interview which the plaintiff gave to the Sunday Times in 2006, in which he referred to the first defendant as his wife, and the second defendant as his daughter from his second marriage.41Foot Note 41×DBAEIC p 117. 47 Together, the plaintiff and first defendant were involved in the  management of SA Tours, with the first defendant playing an active role in its day-to-day running as the plaintiff had a law practice on the side.42Foot Note 42×DBAEIC p 78, para 30.The plaintiff served as SA Tours’ Executive Chairman, while the first defendant served as the Group Deputy Executive Chairman since 2005.43Foot Note 43×DBAEIC p 84, paras 46 – 47. 48 Outside of their work, the plaintiff and the first defendant lived with their daughter, the second defendant, in the Cairnhill apartment where she was raised.44Foot Note 44×DBAEIC p 327, para 12. 49 Given the centrality of SA Tours and the Cairnhill apartment (which are owned by NHPL) to the parties’ lives together, it is therefore conceivable  that the plaintiff would have wished to give his shares in NHPL to the first defendant by way of the share transfer.45Foot Note 45×DBAEIC p 87, paras 59 – 60. Contemporaneous documents and correspondence 50 The plaintiff’s intention to benefit the first defendant with the NHPL shares is also supported by contemporaneous documents and correspondence between the parties. 51 On 10 November 2008, following the first defendant’s discovery that the plaintiff had instructed that all his future credit card billings were to be sent to the office instead of their Cairnhill apartment, the first defendant wrote a strongly worded email to the plaintiff. In the email, among other things, the first defendant alleged that the plaintiff had an “affair”, and that he had a “sexual addiction”. In her dejection, the first defendant wrote:46Foot Note 46×DBAEIC p 197. [i]f you really feel that you want to be free and do not wish me to be involved in your life, then I will not stand in your way. I have asked that SA [Tours] be given to me if you happen to die before me. … If you are agreeable, then please sign the transfer form and let me keep it but will not execute it until you are gone. If you do not agree, then I will leave the company immediately and play no part at all. 52 The plaintiff replied on 13 November 2008 stating that:47Foot Note 47×DBAEIC p 198. [t]he change of address is only for payment on time. Nothing to do with distrusting you at all. I have decided that SA Tours will be willed to you. I love you and I truly did not distrust you just because of change of address of my accounts. 53 Consistent with this, the plaintiff prepared a draft Will in June 2010, in which he bequeathed his shares in NHPL to the first defendant and second defendant in equal shares (“the June 2010 draft Will”).48Foot Note 48×DBAEIC Tab 12, p 200, para 3(a).It is undisputed that the June 2010 draft Will was never executed. 54 Be that as it may, according to the first defendant, towards the end of 2010, the plaintiff conveyed to her that he had decided that she was to be the sole shareholder of NHPL. This was to “save [the first defendant] the trouble of having to go through a probate process” and to “prevent a contested and ugly fight over his estate during the probate process”.49Foot Note 49×DBAEIC p 86 para 57. 55 Accordingly, on 1 November 2010, the plaintiff executed the share transfer form in the first defendant’s favour. The details in the share transfer form were filled in by Ms Rita Khoo (“RK”), who was the plaintiff’s personal assistant, on the plaintiff’s instructions.50Foot Note 50×DBAEIC pp 98 – 99, paras 93 – 94.After the details were filled in, the plaintiff signed the form in the second defendant’s presence. Thereafter, the plaintiff and the first defendant proceeded to the home of the first defendant’s sister, who witnessed the first defendant’s execution of the share transfer form in her capacity as the transferee of the NHPL shares.51Foot Note 51×DBAEIC pp 99 – 100, paras 96 – 103.Significantly, when the second defendant took the stand, she was not cross-examined on her witnessing of the share transfer form, suggesting that there is no disputevis-à-visthe fact that she was a proper witness to the execution of the share transfer by the plaintiff. 56 Although the form was duly signed on 1 November 2010, the first defendant did not lodge it immediately. According to the first defendant, the plaintiff had informed her that he wanted to ensure that SA Tours was not owing monies to the bank before the share transfer form was lodged. As a result, the first defendant waited for the plaintiff’s go-ahead before lodging the share transfer form. This came in or around early March 2011, when the plaintiff told her to proceed to lodge the transfer form.52Foot Note 52×DBAEIC p 103, paras 120 – 121.The share transfer form was lodged on 1 April 2011.53Foot Note 53×PBAEIC1 p 16, para 37. 57 Not long after the lodgement of the share transfer form, the plaintiff executed another Will on 17 August 2011 (“the August 2011 Will”), in which he made several amendments to the June 2010 draft Will. In the August 2011 Will, the plaintiff provided, for example, that his shares in three Malaysian companies were to be bequeathed to his son, NCS, and that cash of S$500,000 was to be bequeathed to the second defendant. Pertinently, while the August 2011 Will made provisions for several companies in which the plaintiff had interests, the plaintiff did not make any express provision for the NHPL shares.54Foot Note 54×DBAEIC Tab 27, pp 314 – 315.This is in sharp contrast to his earlier June 2010 draft Will in which the plaintiff  provided that NHPL was to be bequeathed to the defendants in equal shares.55Foot Note 55×DBAEIC Tab 12, pp 200 – 201.The omission of the NHPL shares in his August 2011 Will therefore supports the defendants’ account that the plaintiff had fully intended to gift all of his shares to the first defendant through the share transfer on 1 April 2011. 58 More than a year after the share transfer, on 14 August 2012, the first defendant wrote an email to NCS, discussing the care and living arrangements for the plaintiff, whose mental health  was deteriorating.56Foot Note 56×PBAEIC1 Tab NCS-9, pp 96 – 97.In the same email, the first defendant asserted that NHPL belonged to her:57Foot Note 57×PBAEIC1 Tab NCS-9, p 97. I have been involved with SA Tours from the very beginning. I spent as much time, if not more, than your father managing SA Tours. Everyone in SA Tours will tell you that your father has said repeatedly that SA Tours must belong to Kay Swee Pin (the first defendant). I am sure you have done your due diligence and realise that Natwest Holdings (NHPL) belongs to me. Do not let me despise you by trying to stake a claim. 59 In response to the first defendant’s assertion, NCS replied that he would not dispute the share transfer as it was aligned with the plaintiff’s wishes:58Foot Note 58×PBAEIC1 Tab NCS-9, p 96. As for the rest of your email, I am not sure what the anxiety is. If dad (the plaintiff) has transferred SA Tours to you, willingly, of sound mind, and with proper documentation and witnesses, then who am I to argue against it and what effect would objections of mine (if any) have? In any caseI would never go against his wishesso please have nothing to fear. [emphasis added] 60 During cross-examination, NCS sought to explain his response as a “placation exercise”.59Foot Note 59×Transcripts (9 July 2019) p 146 line 9 – p 147 line 5.However, on NCS’s own evidence, even based on a conservative estimate, NHPL’s shares were worth S$20,000,000.60Foot Note 60×PBAEIC1 p 48, para 102.Furthermore, he admitted that he did not share a good relationship with the first defendant.61Foot Note 61×Transcripts (10 July 2019) p 45 lines 18 – 20.It therefore beggars belief that he would want to placate the first defendant when she had asserted unequivocally that the highly valuable shares in NHPL belonged to her. In fact, NCS ended his email in response to the first defendant with this request:62Foot Note 62×PBAEIC1 p 96. There is one matter which I would like to discuss with you,not related to SA Tours, but I hope that can be discussed offline and not via email when next we meet. [emphasis added] 61 This, read with his response at [59] above, shows that NCS was of the view that the SA Tours shares (which were held by NHPL) belonged to the first defendant, in accordance with the plaintiff’s wishes, and that he did not have anything further to discuss in that regard. Hence, far from being an exercise in placation, his response to the first defendant was an acknowledgment that the shares in NHPL belonged to her. In my view, this further supports the defendants’ case that the plaintiff had intended to benefit the first defendant with the share transfer. Rita Khoo’s evidence 62 The defendants’ account of the chain of events surrounding the share transfer is supported by RK’s evidence. At the material time of the transfer, RK was the personal assistant of the plaintiff, whom she had served since 2004.63Foot Note 63×DBAEIC p 52 para 2. 63 According to RK, on or around 1 November 2010, the plaintiff told her that he would be transferring the NHPL shares to the first defendant, instead of willing it to her as he had earlier intended in his June 2010 draft Will. This was to save the first defendant the trouble of having to go through a probate process. As such, the plaintiff instructed RK to prepare the share transfer form, which provided that the plaintiff’s shares in NHPL were to be transferred to the first defendant for the consideration of S$1 million.64Foot Note 64×DBAEIC p 54 para 14. 64 After the share transfer form was prepared, RK had no role to play in relation to the share transfer until in or around March 2011, when the plaintiff asked her to lodge the share transfer form. RK then informed the first defendant of the plaintiff’s instructions, and the first defendant personally delivered the transfer form.65Foot Note 65×DBAEIC p 55 para 17. 65 Apart from her preparation of the share transfer form, RK had also assisted the plaintiff in preparing the June 2010 draft Will and the August 2011 Will.66Foot Note 66×DBAEIC p 53 paras 8 – 10 and p 55 para 18.RK was also a witness to the August 2011 Will.67Foot Note 67×DBAEIC p 70.In relation to the plaintiff’s failure to make any stipulation for his NHPL shares in his August 2011 Will, RK observed that this “made sense to [her] at that time as the Plaintiff had already transferred the said shares to [the defendant] vide the Transfer Form.”68Foot Note 68×DBAEIC p 55, para 18. 66 Under cross-examination, RK presented herself as a forthcoming and candid witness. In the main, she reiterated the above chain of events, in particular as regards her role in preparing the share transfer form.69Foot Note 69×Transcripts (22 July 2019) p 62 line 15 – p 63 line 8. 67 RK also volunteered that she became a personal assistant for the first defendant after the plaintiff retired in 2012.70Foot Note 70×Transcripts (22 July 2019) p 61 lines 7 – 12.During cross-examination, counsel for the plaintiff did not rely on this fact to suggest that RK was partisan with regard to her evidence. In any event, I note that RK did not attempt to augment her evidence to bolster the defendants’ case. For example, when detailing her role in relation to the share transfer form, RK was clear that her involvement relatedsolelyto preparing the form, and that she had no part to play in the execution of the form: A.   So over the phone, [the plaintiff] actually also told me the particulars of his IC, his address, the transfer -- buyer's name, that's [the first defendant], the consideration price, then [the first defendant’s] IC number, the address, and the company's name and the date to be typed in on the transfer form as 1 November 2010. This was told to me over the phone, so I took down the particulars. I used my typewriter to type it on the transfer form and dated the 1 November 2010. After typing, I returned the transfer form to [the plaintiff] personally. Soafter that, I left my office. Q.   I see. A.I don't have the original copy.  I just returned the whole lot after typing. I checked through and returned it personally to [the plaintiff]. [emphasis added] 68 Finally, according to RK, the plaintiff used to tell her that he was going to transfer all his shares in NHPL and SA Tours to the first defendant,71Foot Note 71×Transcripts (22 July 2019) p 72 lines 15 – 24.and that “eventually Natwest and SA Tours will be under [the first defendant]”.72Foot Note 72×Transcripts (22 July 2019) p 72 lines 15 – 19.This was consistent with her affidavit of evidence-in-chief, in which she had stated that she did not find it surprising that the plaintiff wanted to will NHPL to the first defendant in June 2010. This was “given, amongst other things, his intention, [the first defendant’s] role of leadership in SA Tours (which was owned through NHPL), [the first defendant’s] contributions to SA Tours, the Plaintiff, [the first defendant] and [the second defendant] being a family unit as well as the fact that the Cairnhill Apartment where they lived was owned through NHPL”.73Foot Note 73×DBAEIC p 53, para 10. Findings in relation to the defendants’ version of events 69 On the whole, the defendants’ version of the events presents a straightforward transfer of shares from the plaintiff to the first defendant, which transfer was wholly intended by the plaintiff to be for the benefit of the first defendant. The chain of events as presented by the defendants is inherently consistent, and supported by the plaintiff’s 13 November 2008 email professing his intention to will his NHPL shares to the first defendant, the June 2010 draft Will, the August 2011 Will which followed the share transfer of November 2010, as well as correspondence between the first defendant and NCS following the share transfer. Importantly, the defendants’ version of events is corroborated by RK’s evidence, which I find to be reliable and independent.",
        "The plaintiff’s response": "70 The plaintiff’s litigation representatives levy several attacks on the defendants’ version of events relating to the share transfer, which they allege go towards showing a lack of intention on the plaintiff’s part to benefit the first defendant by way of the share transfer. Breakdown of the parties’ relationship 71 Central to the plaintiff’s litigation representatives’ argument that the plaintiff did not intend to benefit the first defendant by the share transfer is their assertion that the relationship between the first defendant and the plaintiff had broken down. 72 Having reviewed the evidence, I am not persuaded that there had been a breakdown in the relationship between the plaintiff and first defendant. On the contrary, the evidence shows that the parties continued to share a generally good relationship until the plaintiff’s relocation to Malaysia in July 2013, following a deterioration in his mental health. (1) Plaintiff’s reference to the first defendant as his wife after the bigamy investigations 73 According to NCS, the plaintiff’s son and litigation representative, the breakdown of the plaintiff’s and first defendant’s relationship started when details of their relationship went public after the first defendant initiated civil actions against the Singapore Island Country Club.74Foot Note 74×PBAEIC1 pp 5 – 6, para 13.As a result of those actions, the first defendant’s marital statusvis-à-visthe plaintiff came to light, and the plaintiff became subjected to police investigations for bigamy, an offence under the Penal Code (Cap 224, 2008 Rev Ed). Those investigations received media attention, and was the subject of a Straits Times article on 29 March 2008.75Foot Note 75×PBAEIC1 Tab NCS-6.NCS avers that the bigamy investigations caused the plaintiff to be deeply embarrassed, leading to “severe tensions within the relationship between [the plaintiff] and [the first defendant]”.76Foot Note 76×PBAEIC p 6, para 14. 74 While the bigamy investigations allegedly distressed the plaintiff to a point that it severely strained his relationship with the first defendant, I note that an email dated 17 August 2009 shows the plaintiff continuing to refer to the first defendant as his wife to a third party who was organising a golfing holiday for them.77Foot Note 77×DBAEIC p 121. 75 This 17 August 2009 email evinces the plaintiff’s intention to holiday with the first defendant, whom he continued to refer to externally as his wife, evenafterthe 29 March 2008 Straits Times article, which reported that the plaintiff was being investigated for bigamy.78Foot Note 78×PBAEIC1 Tab NCS-6.This suggests that NCS’s assertion that the plaintiff had been deeply affected by the investigations was grossly exaggerated. (2) The email titled “Goodbye, my love” 76 Nonetheless, to further support his claim that the parties’ relationship had broken down, NCS refers to an email titled “Goodbye, my love” that was sent by the first defendant to the plaintiff on 30 June 2010, not long before the 1 November 2010 share transfer form was executed. In the email, the first defendant wrote that the “time ha[d] come for [her] to walk away” as she could not continue her life with the plaintiff or she would “surely go mad”. Further, she wrote that she did not want SA Tours, and that the plaintiff could give it to NCS. As for the Cairnhill apartment, she implored the plaintiff to find it in his heart to grant herself and the second defendant a roof over their heads.79Foot Note 79×PBAEIC Tab NCS-8, p 93. 77 However, as the first defendant explained during cross-examination, her email was sent to convey her anger and frustration at the plaintiff. This was the means by which she had learned to settle their differences, as the plaintiff was a non-confrontational person, and would have retreated had she confronted him in person. In short, the email was the couple’s way of resolving their disputes, and was not symptomatic of a breakdown in their relationship. Had that been the case, the plaintiff would not have stayed on with the first defendant until he became very ill.80Foot Note 80×Transcripts (18 July 2019) p 114 line 4 – p 115 line 11. 78 I accept the first defendant’s explanation of the email, which I agree cannot, in and of itself, show that the parties’ long-standing relationship had broken down. 79 In this regard, the plaintiff’s response to her earlier email on 10 November 2008 (being the only other email surfaced by the plaintiff’s litigation representatives to suggest a breakdown in the relationship) is instructive. In the earlier email, the first defendant raised allegations that the plaintiff had an “affair” and a “sexual addiction”. She similarly wrote that she would walk away from his life were that his wish, and asked that SA Tours be given to her should he predecease her.81Foot Note 81×DBAEIC p 197.In response to her email, the plaintiff replied, on 13 November 2008, explaining himself before professing his love for her:82Foot Note 82×DBAEIC p 198. Pin (the first defendant), The change of address is only for payment on time. Nothing to do with distrusting you at all. I have decided that SA Tours will be willed to you. I love you and I truly did not distrust you just because of change of address of my accounts. KY (the plaintiff) The plaintiff’s conciliatory response corroborates the first defendant’s account that the use of emails was an effective means of resolving their differences as a couple. 80 Furthermore, trials and tribulations experienced by couples in the course of their relationship are not unusual, and how they learn to settle their differences may differ. When conflicts arise, words may be uttered which are later retracted, or which do not truly reflect one’s feelings. In my view, it is therefore incorrect to place too much weight on the first defendant’s email which was titled “Goodbye, my love” as evincing the breakdown of her relationship with the plaintiff. 81 This is especially since events subsequent to the email show that the first defendant continued to care deeply for the plaintiff until he eventually moved back to Malaysia in July 2013, thereby supporting her evidence that the email was but a way for her to vent her frustrations and anger to the plaintiff. 82 It is these events subsequent to the email to which I now turn. (3) Ng Chung San’s evidence shows that he knew that the plaintiff had not lost trust in the first defendant 83 NCS asserts that, after the June 2010 email titled “Goodbye, my love”, the relationship between the parties continued to break down to the point that the first defendant was no longer entrusted by the plaintiff with the management of his medical condition. As a result, on 14 August 2012, the first defendant wrote to NCS stating that she was “only too happy for [NCS] to play an active role in the management of [the plaintiff’s] illness” as NCS “seemed to be able to manage him better” (“the 14 August 2012 email”).83Foot Note 83×PBAEIC1 p 9, paras 17, 18 and Tab NCS-9, p 97.The 14 August 2012 email was the same email in which the first defendant had asserted that NHPL belonged to her (see [58] above). 84 According to NCS, this indicated that the plaintiff did not trust the defendant enough to let her accompany him for a medical examination by the neurologist, thus demonstrating a breakdown in their relationship.84Foot Note 84×PBAEIC p 9, para 18. 85 However, in NCS’s 15 August 2012 reply to the first defendant’s 14 August 2012 email, NCS expressed that the plaintiff’s “own preferred choice is to stay in Singapore and to stay in Cairnhill Plaza. It is wherehe says he feels most comfortable. Also, it is better for him to be near to his likely principal medical providers … So, no, I don’t think he needs to go anywhere” [emphasis added].85Foot Note 85×PBAEIC p 96. 86 Tellingly, the 15 August 2012 email sent by NCS reflects his own concession that the plaintiff was most comfortable living with the first defendant, plainly contradicting his own allegation that the plaintiff’s and first defendant’s relationship had broken down to the point that the plaintiff could not trust the first defendant to care for him. 87 Furthermore, in the penultimate paragraph of the same email, NCS wrote:86Foot Note 86×PBAEIC1 p 96. I have certainly witnessed, to some extent, the tumultuous nature of your 30-year relationship with my dad and I hope that peace comes to both of you in your latter years. 88 NCS rightly admitted under cross-examination that in this paragraph, there was no contemplation of a complete fracture of the relationship between the plaintiff and the first defendant.87Foot Note 87×Transcripts (9 July 2019) p 148 lines 1 – 13.It is important to note that NCS’s email followed his discovery that NHPL had by then belonged to the first defendant. According to him, this was the first time he had found out about the share transfer,88Foot Note 88×Transcripts (9 July 2019) p 144 lines 6 – 8.which caused him to be shocked.89Foot Note 89×Transcripts (9 July 2019) p 144 line 22.Yet, in the email, he did not raise the fact that the transfer was highly suspicious, despite his apparent view that the relationship between the plaintiff and the first defendant had already begun to break down from as early as 2008, when the plaintiff became subject to bigamy investigations (see [73] above). 89 In summary, I find that NCS’s reply to the first defendant’s assertion in August 2012 that NHPL belonged to her shows that even from his point of view, there was no breakdown in relationship between the plaintiff and first defendant by that time. (4) Circumstances surrounding the plaintiff’s relocation to Malaysia 90 To continue NCS’s version of events, the gradual breakdown of their relationship culminated in the plaintiff moving back to Johor Bahru, Malaysia in July 2013, as the defendants no longer wanted the burden of caring for the plaintiff, who was no longer of any value to them.90Foot Note 90×PBAEIC1 p 9, para 18.In a July 2013 email sent by the first defendant to the plaintiff’s daughter, Irene, the first defendant instructed that “[u]nder NO circumstances(except medical) must [the plaintiff] be brought back to Singapore although I am almost certain he will want to return … If for some reasons he is brought to SA’s office in Singapore, please let me know in advance so as to avoid any embarrassing scene.”91Foot Note 91×PBAEIC, p 102.According to NCS, this was proof that there had been an irretrievable breakdown of the relationship between the plaintiff and first defendant.92Foot Note 92×Transcripts (9 July 2019) p 97 lines 5 – 15. 91 However, this is not borne out from a reading of the emails exchanged between the first defendant and Irene. The move was not a result of a fraught relationship between the plaintiff and first defendant. On the contrary, the first defendant had reluctantly allowed the plaintiff to move back to Malaysia as it was considered to be in the latter’s best interests. 92 The chain of emails between the first defendant and Irene began on 22 July 2013, when the first defendant informed Irene that the plaintiff was extremely unwell and that his condition continued to deteriorate. In this vein, she reflected that “[t]he status quo of [the plaintiff] being taken care by me while [NCS] and [Mdm Ling] continue to take the position that I have no standing in making any decisions on behalf of [the plaintiff] is not tenable for me. As discussed with you, I am prepared to leave the care of [the plaintiff] to [NCS] and [Mdm Ling] if they feel they are the legally recognised guardians.”93Foot Note 93×PBAEIC1 p 106.This email shows that the impetus for allowing the plaintiff to move back to Malaysia was not a result of the fraught relationship between the plaintiff and first defendant. Rather, it was due to problems which the first defendant faced in relation to making decisions on the plaintiff’s behalf given that she was not his lawful wife and legal representative. 93 Consistent with this notion, in a subsequent email dated 23 July 2013, the first defendant wrote that she felt “extremely torn that [the plaintiff] has to be removed from my care but I think this is the only way to stop the acrimony between [NCS/Mdm Ling] and myself”.94Foot Note 94×PBAEIC1 p 105. 94 Following the first defendant’s emails, Irene responded in writing, saying that “I understand that this must be really hard on you and I appreciate your strength at this time, thinking through what’s best for [the plaintiff]”. Irene then proposed a transitioning arrangement to facilitate the plaintiff’s move back to Malaysia.95Foot Note 95×PBAEIC1 p 104. 95 The parties then exchanged several emails, in which the first defendant relayed that the plaintiff would never agree to leave Singapore and move back to Malaysia on his own accord.96Foot Note 96×PBAEIC1 p 103.This formed the context of the first defendant’s instructions to Irene, stipulating that under no circumstances was the plaintiff to be allowed to return to Singapore.97Foot Note 97×PBAEIC1 p 102.The instruction was not a reflection of a breakdown in relationship between the first defendant and the plaintiff; rather, it was the first defendant’s way of facilitating the plaintiff’s move to Malaysia. Indeed, in reply to the first defendant’s instructions, Irene’s email was sympathetic, evincing her understanding of how difficult it was for the first defendant to part with the plaintiff:98Foot Note 98×PBAEIC1 p 101. Auntie Pin You have been with dad for so many years and I for one, appreciate the happiness you have given him. Please do not think of this being permanent. While it would probably be best that he doesn’t return to the Singapore home, there is no reason why you are (sic) [the second defendant] cannot visit him occasionally. Let’s just get through this period with less trauma on all sides and more importantly, that he adapts to life in [Johor Bahru, Malaysia]. We can then take it from there. … 96 To Irene’s email, the first defendant responded with instructions on the plaintiff’s medication and prescriptions, and concluded by stating that Irene could reach out to her should she require her assistance “if the caregiver is not able to handle [the plaintiff]”.99Foot Note 99×PBAEIC1 p 100. 97 At this juncture, it is important to note that the first defendant’s chain of emails with Irene, in which she expressed care and concern for the plaintiff, followed NCS’s assurance that he would not challenge her entitlement to NHPL (see [59] above). Hence, there was no reason for the first defendant to falsely paint a picture that she and the plaintiff were on generally good terms, and that parting with him was difficult on her part. 98 Viewed in totality, it is clear that even as late as in July 2013 when the plaintiff moved back to Malaysia,100Foot Note 100×PBAEIC1 p 10, para 19.the relationship between the first defendant and the plaintiff had not broken down. Rather, the first defendant continued to care deeply for the plaintiff, and his move back to Malaysia had been decided upon because it was considered to be in the plaintiff’s best interest, in light of his deteriorating medical condition. The move was certainly not the result of the first defendant seeking to get rid of the plaintiff as he was no longer of any value to her, as NCS had sought to characterise it. 99 As a result, I find NCS’s allegations of a breakdown in the relationship between the plaintiff and first defendant to be unsupported and, indeed, contradicted by the evidence. Instead, I find that the parties continued to share a generally good relationship right until the time when the plaintiff moved back to Malaysia in July 2013, thereby supporting the defendants’ submission that the plaintiff intended to benefit the first defendant by the share transfer. 100 On this footing, I turn now to consider the other arguments mounted by the plaintiff’s litigation representatives. The 29 March 2011 letter 101 The plaintiff’s litigation representatives rely on a photograph of a letter dated 29 March 2011 (“the 29 March 2011 letter”), in which the first defendant allegedly wrote:101Foot Note 101×PBAEIC1 Tab NCS-18, p 186. The time has come for me to move on. However, I will appreciate it if you could do the following: 1 In order not to cause rumours regarding our relationship or the well-being of SA [Tours], please allow me to remain as a director of SA [Tours] and [NHPL]. I will not interfere in how you manage the funds of both companies 2  Since we do not have anyone suitable to take over as COO, please allow [the second defendant] to try. I will guide her during April and thereafter, if she is still interested, she will carry on. Have a nice day. Pin29 March, 2011 102 On the same sheet of the above letter and on the same day, the plaintiff replied: My dearest Pin, I do agree to what you suggested on 29 March 2011. Make sure that Mae will learn to be a good and great COO of SA Tours. Have a nice day. Ng Kong Yeam, 29 March 2011 103 According to NCS, he had taken a photograph of the letter during a visit to Singapore on 29 March 2011, at the plaintiff’s office at 1 Park Road, Singapore 059108.102Foot Note 102×PBAEIC1 p 18, para 40. 104 Apart from evincing a breakdown of their relationship (which I have found above to be unsupported and contradicted by the evidence), this letter, purportedly sent by the first defendant on 29 March 2011, is relied on as proof that the first defendant fully understood that the plaintiff did not give her the beneficial interest in the NHPL shares by way of the share transfer.103Foot Note 103×PCS p 43, para 88. 105 The defendants challenge the authenticity of the letter, which exists only in the form of a photographic image. As a consequence, both sides appointed forensic document examiners to evaluate the authenticity of the letter. Having considered the evidence, I find the letter to be wholly unreliable, and give it no weight. 106 In this regard, the evidence of the plaintiff’s forensic document examiner, Mr Tan Kah Leong (“Mr Tan”), is illuminating in several respects. First, Mr Tan admitted that he did not examine the photographic image of the letter. Instead, he simply analysed a portable document format (“PDF”) document which purportedly contained the metadata of the photograph of the letter.104Foot Note 104×Transcripts (24 July 2019) p 7 lines 4 – 7; PBAEIC3 Tab E, p 2 para 4 and Tab TKL-3.Yet, as Mr Tan himself admitted, the metadata contained in the PDF document could have related to anything from a blank image to an image of Mickey Mouse, for example.105Foot Note 105×Transcripts (24 July 2019) p 17 lines 4 – 11.Plainly, the subject of Mr Tan’s analysis was many steps removed from the purported letter which was the subject of the dispute. Accordingly, any conclusions arrived at by Mr Tan, who was never provided nor received the photograph of the letter,106Foot Note 106×Transcripts (24 July 2019) p 15 lines 2 – 16.related solely to the authenticity of the metadata provided to him, and does not shed any light on the authenticity of the letter itself. 107 To compound the problem, Mr Tan admitted that the contents of the PDF document which he analysed could have been edited prior to him having received it.107Foot Note 107×Transcripts (24 July 2019) p 30 lines 6 – 10.Thus, while the PDF document reflected that the photograph was taken on 29 March 2011,108Foot Note 108×PBAEIC3 Tab E, Tab TKL-3.this date could have been the subject of an editing process to ensure that it would match the date when NCS allegedly took a photograph of the letter. In fact, the metadata produced in the PDF document showed that the PDF document had been edited, with one of the edits being that the image had been rotated.109Foot Note 109×Transcripts (24 July 2019) p 73 line 22 – p 74 line 3. 108 Furthermore, the Global Positioning System (“GPS”) coordinates of the metadata analysed by Mr Tan indicates that the photograph was taken at 9 Empress Place, Singapore 179556110Foot Note 110×PBAEIC3 Tab E, p 21, para 4.14.and not 1 Park Road where the photograph was allegedly taken. The straight line distance between 9 Empress Place and 1 Park Road is 1.09km,111Foot Note 111×PBAEIC3 Tab E, p 22, para 4.16.strongly suggesting that the metadata analysed wasnotof the photograph of the letter. To explain away this discrepancy, Mr Tan referred to the Apple internet forums, where certain users had complained that the GPS programme on their mobile phones reflected the wrong current location after they had upgraded their mobile phone software.112Foot Note 112×Exhibit D14.This is pure speculation. The forum posts complaining of inaccurate GPS locations related to the mobile phone operating software in June 2009, almost three years before the photograph was allegedly taken by NCS.113Foot Note 113×Exhibit D14.In the interim period, the inaccuracy in the GPS coordinates could have been resolved by software updates. As such, there was no way of finding out if the Apple mobile phone which NCS had allegedly used to take the photograph of the letter was afflicted with the GPS error, especially as Mr Tan admitted that he did not know the version of the operating system on which NCS’s phone was operating when he purportedly took the photograph.114Foot Note 114×Transcripts (24 July 2019) p 85 lines 6 – 8. 109 In the circumstances, I find that the evidence of the plaintiff’s forensic document examiner is wholly unhelpful in determining the authenticity of the letter. 110 Turning to the purported photograph of the letter, it can be seen that the letter that was allegedly sent by the first defendant is printed on thesamepage as the reply to the letter that was sent by the plaintiff:115Foot Note 115×PBAEIC1 Tab NCS-18 p 186.   111  This is highly suspicious, as one would not expect physical letters to be exchanged on asinglesheet of paper, since the recipient of a letter would naturally reply to the sender on a fresh sheet of paper. 112 To add to the suspicion, the contents of the purported letter appear to betypedon a personal computer or device, such that the plaintiff’s response is printed directly below the first defendant’s response on the same page of the letter. If the letter is truly authentic, one would imagine that the plaintiff would have had to painstakingly create a Word document in which sufficient blank space was allocated at the top of the document so that his response to the first defendant would not be printed over her letter to him. Furthermore, after producing such a Word document, the plaintiff would have to accurately print his response on the correct side of the first defendant’s letter, such that his response would appear on the same pageandunder her letter. Apart from this letter, there is no evidence that the parties tended to correspond in such a peculiar fashion. On the contrary, the evidence tendered shows that they were both comfortable with electronic devices, and more than willing to convey their messages through emails.116Foot Note 116×See PBAEIC1 Tabs NCS-8 – 10. 113 Furthermore, the photograph of the letter was conveniently taken on 29 March 2011, being the same day the first defendant and plaintiff had allegedly sent their respective messages by way of the single sheet of paper.117Foot Note 117×PBAEIC3 Tab TKL-3.This suggests that it was doctored, especially since the time-stamp as reflected in the purported metadata of the photograph is 13:35:30,118Foot Note 118×PBAEIC3 Tab TKL-3.meaning that the plaintiff and first defendant had only up to that time to convey their messages via the letter on 29 March 2011 prior to NCS taking the photograph of it. 114 Finally, the method in which the parties signed off on the purported letter is again highly suspicious. For a start, both the first defendant and the plaintiff dated their respective letters “29 March 2011”. It was as if the parties knew that the date of 29 March 2011, being just two days before the share transfer form was to be lodged on 1 April 2011, was to be a highly significant date, such that they had the preternatural foresight to stipulate the date of their letter in case of a dispute. Furthermore, the plaintiff signed off with his full name “Ng Kong Yeam”.119Foot Note 119×PBAEIC1 Tab NCS-18 p 186.This may be contrasted with his personal emails to the first defendant, in which he simply signed off with his initials “KY”.120Foot Note 120×PBAEIC1 p 110.“KY” was also the way the first defendant addressed the plaintiff in her email to him.121Foot Note 121×PBAEIC1 p 108.I find that there is no reason why the plaintiff would have suddenly decided to be so formal with the first defendant when he purportedly wrote his letter on 29 March 2011, particularly as their relationship remained generally good until he moved back to Malaysia in July 2013. 115 Having considered the evidence, I find that the 29 March 2011 letter was created under highly suspicious circumstances, and the authenticity of the photograph of the letter doubtful and produced solely for the purposes of the present proceedings. In the result, I decline to place any weight on the purported letter or the photograph of it. The 6 February 2012 Will 116 Next, significant reliance is placed on a will that was executed by the plaintiff on 6 February 2012, in Kuala Lumpur, Malaysia (“the 6 February 2012 Will”).122Foot Note 122×PCB Tab 19.At paragraph 2.1 of the will, the plaintiff bequeathed his shares in SA Tours that were “held and owned by [him] and/or [NHPL]” to NCS and the second defendant in the proportion 75:25.123Foot Note 123×PCB Tab 19, p 72, para 2.1.In paragraph 2.3 of the same will, the plaintiff then bequeathed his Cairnhill apartment to NCS. As the 6 February 2012 Will was executed after the share transfer form was lodged on 1 April 2011, the plaintiff contends that the share transfer was not intended as a gift to the first defendant, since the plaintiff saw that he retained the beneficial ownership of the SA Tours shares and the Cairnhill apartment (which were held by NHPL).124Foot Note 124×PCS pp 27 – 28, paras 57 – 59. 117 In further support, the plaintiff refers to the 14 August 2012 email by the first defendant to NCS, in which the first defendant wrote that the plaintiff and herself “had many financial dealings … but I can tell you with certainty that [the plaintiff] did not show any generosity towards me in any of our dealings … so don’t ever get the impression that your father made me rich.”125Foot Note 125×PBAEIC1 p 97.The plaintiff submits that this shows that the plaintiff had not intended to benefit the first defendant with the highly valuable NHPL shares. Otherwise, the first defendant would not have said that the plaintiff was not generous with her.126Foot Note 126×PCS p 38, para 77. 118 I will first deal with the plaintiff’s reliance on the first defendant’s 14 August 2012 email. Read in its proper context, it is clear that the first defendant was not denouncing her entitlement to the NHPL shares. Rather, she felt that the NHPL shares were rightly hers in the first place, and did not flow from any generosity on the plaintiff’s part. This is seen as after declaring that the plaintiff had not been generous to her in their dealings, she proceeded in the next two paragraphs to talk about her involvement in SA Tours, before concluding in the penultimate paragraph of the email to NCS: “I am sure you have done your due diligence and realise that [NHPL] belongs to me. Do not let me despise you by trying to stake a claim.”127Foot Note 127×PBAEIC1 p 97.Plainly, the first defendant had asserted her interest in the NHPL shares in her 14 August 2012 email. It was simply that she did not regard the gifting of the interest in the NHPL shares as an act of generosity on the plaintiff’s part. 119 Turning to the 6 February 2012 Will, having considered the circumstances surrounding its making, I find that it was made under suspicious circumstances, such that no weight ought to be given to it for the purposes of the present proceedings. (1) Plaintiff’s account of the will making exercise 120 According to NCS, sometime in early 2012, the plaintiff informed him that he wanted to make a new will, and thus instructed him to contact Mr Ling Hua Keong (“Mr Ling”), who was the plaintiff’s lawyer in Kuala Lumpur, to draft his new will. An appointment was later made for the plaintiff to sign his new will on 6 February 2012, at Mr Ling’s Kuala Lumpur office. As a result, on 4 February 2012, the plaintiff flew from Singapore to Kuala Lumpur, where he signed the 6 February 2012 Will with Mr Ling and his wife, Ms Mok Sheau Ping (“Ms Mok”) as his witnesses.128Foot Note 128×PBAEIC1 pp 23 – 24, paras 48 – 51. 121 The will making exercise was video-recorded by NCS’s wife, Tan Yen Lin (“Ms Tan”), with Mr Ling’s approval. NCS had explained to Mr Ling that  it was necessary because the plaintiff had an illegitimate family (in the defendants) and that he would therefore prefer the proceedings to be video-recorded to put it beyond doubt that the will had been drafted on the plaintiff’s instructions.129Foot Note 129×PBAEIC1 p 24, para 52. (2)  Suspicious circumstances 122 Notwithstanding the plaintiff’s litigation representative’s attempt to portray the will making exercise as a straightforward one that was in accordance with the plaintiff’s wishes, I find the circumstances surrounding the making of the will highly suspicious. (a) Ng Chung San’s resignation less than a month before the will 123 For a start, the 6 February 2012 Will was executed slightly more than a month after the plaintiff had written to NCS, on 30 December 2011, seeking NCS’s resignation as a director of SA Tours.130Foot Note 130×DBAEIC p 321.Pursuant to the plaintiff’s direction, NCS resigned on the same day.131Foot Note 131×Transcripts (10 July 2019) p 43 lines 10 – 11; Agreed Bundle of Documents Vol 1 (“AB1”) Tab 13.According to NCS, the first defendant had said that it was difficult for NCS to sign documents on behalf of SA Tours since he was based in Kuala Lumpur. The first defendant thus pushed for the second defendant to replace NCS as a director of SA Tours. When NCS was non-committal about resigning, the first defendant had a heated argument with the plaintiff, causing the plaintiff to eventually relent and ask NCS to resign “to protect the peace in his family”.132Foot Note 132×Transcripts (10 July 2019) p 44 line 9 – p 45 line 4; see also AB1 Tab 12. 124 If the plaintiff had indeed seen it necessary for NCS to resign from his directorship of SA Tours to preserve the peace in his family (in particular, between NCS and the defendants), it begs the question as to why the plaintiff would then decide to bequeath SA Tours in the proportion of 75:25 to NCS and the second defendant respectively, just slightly more than a month later. In so doing, the parties would either have to work together, or NCS could, by virtue of his shareholding, force the defendants out of SA Tours. This would have defeated the plaintiff’s intention of preserving the peace in his family. 125 Next, I turn to the circumstances surrounding the will making exercise itself. (b) Circumstances surrounding the will making exercise 126 During the trial, the video-recording of the will making exercise was played in court. Watching the video, it was clear that the plaintiff was merely reading aloud the contents of the will verbatim,133Foot Note 133×PCB Tab 20, pp 78 – 79.including even the technical portions of the will such as the following: This Will was signed by Kong Yeam (the plaintiff) in this in – in this [inaudible] the presence of both persons at the same time who have this requested his presence in the presence of each one. [Inaudible] hereunto subscribe our names as witnesses. Last will and testament.134Foot Note 134×PCB Tab 20, p 79. 127 To my mind, the mechanistic nature of the will making exercise casts serious doubts on whether the 6 February 2012 Will was a true reflection of the plaintiff’s wishes. 128 To add to the suspicion, the following exchange occurred immediately after the plaintiff had finished reading the will:135Foot Note 135×PCB Tab 20, pp 79 – 80. [Mr Ling]:136Foot Note 136×Male Speaker 1 is Mr Ling: Transcripts (10 July 2019) p 3 lines 3 – 5.Correct, Dato (referring to the plaintiff)? [NCS]:137Foot Note 137×Male Speaker 2 is NCS: Transcripts (10 July 2019) p 3 lines 10 – 11.Okay? [Plaintiff]:138Foot Note 138×Ng Kong Yeam is the name of the plaintiff.The most important is the [SA Tours]. The 2-8? Eh you didn’t do the… hah? … [Plaintiff]: Where’s the 2-8? [NCS]: Here [points to paper]. [Plaintiff]:  Oh, yes, this one. Only these two major things only lah ah? … [Plaintiff]: The others, the big house in Singapore, in Kuala Lumpur in the, in the… [NCS]: J.B. [Plaintiff]: No problem that one. [NCS]: Oh, given already. [Plaintiff]: That house no problem right because that house is 12 million. [NCS]: Yeah, yeah. So the most important is… [Plaintiff]: This one, this one is more than more than 5 million, 10 million. More than that. 30 million sing dollars. [Inaudible]. In local money, it’s close to 100 million now. [NCS]: So, correct? [Plaintiff]: Yes, yes. Major things are two things. Major things. … 129 The above exchange casts serious doubts as to whether the plaintiff had in fact given instructions to Mr Ling in relation to the drafting of the will. Plainly, even during the will making exercise, the plaintiff had multiple queries of significant weight, such as how SA Tours and the Cairnhill apartment (which he referred to as “2-8”)139Foot Note 139×Transcripts (10 July 2019) p 18 lines 8 – 14.were to be willed. This suggests that, to his mind, provisions had not been made for them. The queries also cast doubts on the mental awareness of the plaintiff while he was reading the pre-prepared will, since the will, which he had just read verbatim, had in fact made provisions for SA Tours and the Cairnhill apartment. 130 More troublingly, the queries raised by the plaintiff suggests that his mental faculties were in doubt during the will making. For example, the plaintiff stated that he had a “big house in Singapore, in Kuala Lumpur”, only for NCS to correct him and point out that the big house was in “J.B.”, meaning Johor Bahru, Malaysia. This was because, as NCS explained, the plaintiff did not own a big house either in Singapore or Kuala Lumpur.140Foot Note 140×Transcripts (10 July 2019) p 21 lines 18 – 22. 131 The plaintiff also referred to assets that were worth “five million”, “ten million”, “30 million sing dollars”, and “close to 100 million now” (in Malaysian ringgit), without specifying what or where these assets were. Despite such large numbers being spouted by the plaintiff, Mr Ling explained that he did not think that it was necessary to clarify with the plaintiff what assets he was referring to. Instead, he was comfortableassumingthat they referred to the shares in SA Tours and the Cairnhill apartment.141Foot Note 141×Transcripts (22 July 2019) p 20 line 12 – p 21 line 19.I find Mr Ling’s explanation in this regard to be bordering on incredible – Mr Ling was preparing a will for the plaintiff, by which the plaintiff was intending to bequeath significant assets to his respective beneficiaries. Despite that, when the plaintiff spouted unspecified assets of high value, Mr Ling was comfortable to disregard the plaintiff’s words. His explanation was that to his mind, it was already clear that the plaintiff had given whatever he wanted to give in his will, and it was not in his domain to ascertain the value of such properties.142Foot Note 142×Transcripts (22 July 2019) p 21 line 20 – p 22 line 5; p 24 line 6 – p 25 line 1.However, the plaintiff could have referred to other assets that were not provided in his will. Indeed, when the plaintiff raised a query about a big house in Singapore and/or Kuala Lumpur,143Foot Note 143×PCB Tab 20, p 79.there was no provision in the will relating to such “big houses”. Given how large the sums were, it would have been only reasonable to expect Mr Ling to at least check if the sums were indeed in relation to the SA Tours shares and the Cairnhill apartment or some other assets. If they referred to something else (such as an unspecified big house in Singapore and/or Kuala Lumpur), further instructions could have been taken to account for them in the will. Yet, that was not done. 132 In my view, that Mr Ling did not bother to enquire the unspecified high value asset referred to by the plaintiff suggests that the instructions for the will were not given by the plaintiff. Otherwise, any further information (such as the significant values) volunteered by the plaintiff would have alerted him or raised his awareness, and prompted him to check if any amendments to the will ought to be made to account for the unspecified assets to which the values could have related. 133 Furthermore, the fact thatbothNCS and Mr Ling consistently checked with the plaintiff if the will was in order suggests that they were the ones who had prepared the will, and they intended to show through the video recordings of the will making exercise that the plaintiff had approved the will. However, during re-examination, Mr Ling attested that he had, prior to the will making exercise, received instructions from the plaintiff on how the will was to be prepared. Based on the plaintiff’s instructions, Mr Ling then drafted the will.144Foot Note 144×Transcripts (22 July 2019) p 54 line 21 to p 55 line 2.Mr Ling also asserted that NCS played a minimal role in the preparation of the will.145Foot Note 145×Transcripts (22 July 2019) p 51 lines 5 – 12.However, given the number of assets that the plaintiff was bequeathing in the 6 February 2012 Will, it would have been reasonable to expect contemporaneous documents to support Mr Ling’s claim that the will had been drafted on the plaintiff’s instructions. Yet, Mr Ling did not provide a single draft will, client attendance note, email, or any correspondence with the plaintiff to support his bare assertion that the will was drafted following instructions from the plaintiff. (C) Mr Ling’s conduct in relation to the making of the will 134 The above circumstances ought to have raised Mr Ling’s suspicion. As summarised in the Malaysian High Court decision ofChennaGounder a/l Kandasamy v Angamah a/p Sunappan[2017] 10 MLJ 387 (“ChennaGounder”) at [16] (citingThoYow Pew & Anor v Chua Kooi Hean[2002] 4 MLJ 97): If a will was prepared and executed under circumstances which raised a well-grounded suspicion that the will …did not express the mind of the testator, the will (or that provision) is not admissible to probate unless that suspicion is removed by affirmative proof of the testator’s knowledge and approval. A classic instance of suspicious circumstances is where the will was prepared by a person who takes a substantial benefit under it. Another instance is where theperson was active in procuring the execution of the will under which he takes a substantial benefit by, for instance, suggesting the terms of the will to the testator and instructing a solicitor chosen by that person. [emphasis added] 135 This portion ofChennaGounderwas read to Mr Ling when he was cross-examined, and Mr Ling agreed that this was accepted law in Malaysia.146Foot Note 146×Transcripts (22 July 2019) p 29 lines 20 – 21. 136 Similar views have been echoed by the Singapore Court of Appeal inChee Mu Lin Muriel v CheeKa Lin Caroline (Chee Ping Chian Alexander and another, interveners)[2010] 4 SLR 373 at [48]: One oft-cited example of suspicious circumstances is where a will was prepared by a person who takes a substantial benefit under it, or who procured its execution, such as bysuggesting the terms to the testatoror instructing a solicitor to draft the will which is then executed by the testator alone… [emphasis added] 137 Despite agreeing with the law in this regard, Mr Ling allowed the plaintiff to proceed with executing his will. In fact, video recordings that were produced in court which are believed to show the plaintiff signing and affixing his thumbprint on the 6 February 2012 Will show Mr Ling physically removing a pen in the plaintiff’s hand before gesturing to the plaintiff that he could affix his thumbprint onto the same document.147Foot Note 147×Supplementary AEIC of Tan Yen Lin, para 3; exhibit TYL-2 and TYL-3; see Defendant’s Closing Submissions (“DCS”) at pp 31 – 32.It would thus appear that the plaintiff, whom Mr Ling described as a “very good senior lawyer”,148Foot Note 148×Transcripts (22 July 2019) p 21 line 4.could have been ailing under a mental condition, such that he required help even with rudimentary acts like affixing his thumbprint in the will. As a consequence of Mr Ling’s guidance, it can be seen that the 6 February 2012 Will contains what appears to beboththe plaintiff’s signature and his thumbprint.149Foot Note 149×PCB Tab 19, p 74. 138 Significantly, Mr Ling also allowed NCS, the primary beneficiary under the will, to remain present throughout the will making process. Further, he allowed NCS to prompt the plaintiff, through means such as physically pointing to the will to show that the Cairnhill apartment had been accounted for, and checking with the plaintiff repeatedly if the will was in order.150Foot Note 150×Transcripts (10 July 2019) p 19 lines 20 – 24. 139 Hence, quite apart from taking active steps to ensure that the plaintiff, whose actions clearly raised doubts as to his mental abilities, was executing a will in accordance with his wishes, Mr Ling appeared to have been an active participant in seeking to ensure that the 6 February 2012 Will was executed in accordance with the terms that had been pre-prepared, and which were clearly beneficial to NCS. 140 In this respect, Mr Ling’s willingness to defend the propriety of the will making exercise at all cost was made clear when it was pointed out to him during cross-examination that the video recordings played in court did not show his wife, Ms Mok, to be present.151Foot Note 151×Transcripts (22 July 2019) p 43 lines 13 – 16.Yet, the 6 February 2012 Will expressly stipulates Ms Mok as a witness to the execution of the will.152Foot Note 152×PCB Tab 19, p 74.Faced with this conundrum, Mr Ling stated, for the first time, that his wife had witnessed the will making exercise from herownroom, which was separated by a glass panel from his own office (where the will was being signed).153Foot Note 153×Transcripts (22 July 2019) p 44 line 12 – p 45 line 3.According to Mr Ling, Ms Mok could see the plaintiff sign the will from her room.154Foot Note 154×Transcripts (22 July 2019) p 45 lines 8 – 9.Apart from  revealing evidence on the cuff, Mr Ling’s version of events is contradicted by Ms Tan’s (NCS’s wife) evidence. Ms Tan had personally been present to video-record the plaintiff signing the 6 February 2012 Will. It was Ms Tan’s evidence that Ms Mok had been moving in and out of the room, and had returned to witness the signing of the will by the plaintiff.155Foot Note 155×Transcripts (11 July 2019) p 45 line 13 and p 46 lines 3 – 5.However, Ms Mok was not captured in Ms Tan’s videos of the will making exercise as she was not the focus of the latter’s video recording. Nonetheless, Ms Tan was certainthat Ms Mok was physically present during the will making exercise, rather than in her own room:156Foot Note 156×Transcripts (11 July 2019) p 47 lines 1 – 7 and p 48 lines 10 – 18. Q. … I don't see a Madam Mok Shiau Ping in these two clippings of video footage.  So what's your explanation for that, if you have one? A. I can only state what I state, which is she is not in           the shooting, she is not the one administering it, butsheis there, lah. I mean am I expected to take, like, everything?  I was only supposed to focus on him. … … Q. You are a witness in these proceedings.  And I'm asking you a very simple question.Was MadamMok there, with absolute certainty, given the fact that she doesn't           appear anywhere here, was she there to witness your           father-in-law's signature against this will? It's a           simple question.  Do you remember vividly or you don't? A. I would have to sayyes.  Yes. Q. You remember vividly? A.  Not vividly but I remember yes. [emphasis added] 141 Furthermore, Ms Tan testified that, even from her point of view (she was in close proximity since she could record the signing of the will on video), it was not clear what the plaintiff was signing.157Foot Note 157×Transcripts (11 July 2019) p 47 lines 8 – 10.It would therefore be incredible, if it were indeed the case, that Ms Mok could see the plaintiff affixing his signature on the will from her own room, which was separated by Mr Ling’s room through a glass panel.158Foot Note 158×Transcripts (22 July 2019) p 44 line 12 – p 45 line 3. 142 In the result, quite apart from being far-fetched, I find Mr Ling’s belated explanation of how his wife, Ms Mok, had witnessed the execution of the will, to be contradicted by the evidence. I therefore find Mr Ling an unreliable and partisan witness, who was willing to go to extreme lengths to defend the will to support the case for the plaintiff’s litigation representatives. 143 Reviewing the evidence relating to the making of the 6 February 2012 Will in totality, I find that there were clearly suspicious circumstances, which are not dispelled, that throw the reliability of the 6 February 2012 Will into grave doubt. I therefore decline to place any weight on the will. Evidence tending to show the plaintiff’s beneficial interest after the share transfer form was lodged 144 Next, the plaintiff’s litigation representatives refer to the following evidence, which they submit show that, even after the share transfer form was lodged on 1 April 2011, the plaintiff retained a beneficial interest in the NHPL shares: (a) First, in the letter dated 30 December 2011, the plaintiff asked NCS to resign as a director of SA Tours.159Foot Note 159×DBAEIC p 321.This followed an email on 29 December 2011, when the first defendant had written to NCS to suggest that the plaintiff had agreed that the second defendant ought to replace NCS as the director of SA Tours.160Foot Note 160×AB1 Tab 12. (b) Second, the first defendant admitted that the plaintiff was paid salary and dividends for the year 2010untilApril 2011, when the share transfer form was lodged.161Foot Note 161×Transcripts (18 July 2019) p 109 line 24 – p 110 line 6. (c) Third, in an email of 23 March 2012 from Sumin, an SA Tours employee, to the auditors of a Malaysian company that was owned by the plaintiff, it was stated that the plaintiff had a direct interest in 799,999 NHPL shares.162Foot Note 162×PCB Tab 22. (d) Finally, in the 2011 Annual Financial Statement of SA Tours (“the 2011 statement”),  that was signed on 18 May 2012 by the plaintiff and first defendant, the plaintiff’s interest in NHPL is shown to have been converted from a direct one to a deemed one by the end of the financial year:163Foot Note 163×PCB Tab 23. The following directors of the company who held office at the end of the financial year had, according to the register required to be kept under Section 164 of the Singapore Companies Act, Chapter 50, a beneficial or deemed interest in shares of the company, and its holding company, Natwest Holdings Pte Ltd, as stated below:Direct interestDeemed interestName of DirectorAt beginning of financial yearAt end of financial yearAt beginning of financial yearAt end of financial yearHolding company Natwest Holdings Pte Ltd (Ordinary shares of $1.00 each)Ng Kong Yeam (the plaintiff)799,999--800,000Kay Swee Pin (the defendant)-800,000799,999- 145 I will first consider the letter dated 30 December 2011. In my opinion, that the plaintiff’s approval was required does not necessarily point to the plaintiff having retained a beneficial interest in the NHPL shares after the share transfer. As can be seen from the 2011 statement, the plaintiff remained a director of SA Tours as at the end of 2011.164Foot Note 164×PCB Tab 23 p 92.Since the plaintiff’s directorship and concomitant right of management were not intricately tied to his beneficial ownership of the NHPL shares, I find that the fact that the plaintiff’s agreement was sought for NCS’s removal as a director does not by itself show that the plaintiff had retained a beneficial ownership after the share transfer. 146 In any event, given that NCS was not just a director, but also the plaintiff’s son, it is understandable for the first defendant to have sought the plaintiff’s agreement before seeking NCS’s resignation. This would prevent any unnecessary conflict with the plaintiff, who was still involved in the management of SA Tours in his capacity as a director. Hence, that the plaintiff’s agreement was sought does not show that the plaintiff had no intention to benefit the first defendant through the share transfer. 147 Turning to the first defendant’s admission that the plaintiff had been paid salary and dividends until April 2011, I do not see how this contradicts the finding that the plaintiff intended to benefit the first defendant by way of the share transfer. As explained, the share transfer form was only lodged on 1 April 2011. Hence, the plaintiff remained thelegalandbeneficialowner of the NHPL shares until 1 April 2011. By extension, he was entitled to dividends from SA Tours until 1 April 2011. It is therefore not unusual for him to be paid dividends until that point in time. As for his salary, this was tied to his directorship, not his shareholding. 148 In relation to Sumin’s email on 23 March 2012, I find that the reference to her email is plainly a red herring. While Sumin’s email indeed stipulated that the plaintiff had a direct interest in 799,999 NHPL shares, it was sentbeforethe 2011 statement was signed off on 18 May 2012.165Foot Note 165×PCB Tab 23 p 93.Therefore, as the first defendant had explained, Sumin’s email was correct insofar as the only point of reference she had at that time was SA Tours’ 2010 Annual Financial Statement, which would have reflected that the plaintiff had a direct interest in 799,999 of the NHPL shares, since the share transfer was only effected on 1 April 2011.166Foot Note 166×Transcripts (18 July 2019) p 68 lines 15 – 18. 149 Finally, the 2011 statement included the directors’ report signed off by the plaintiff and first defendant, which show that while the plaintiff had lost his direct interest in 799,999 NHPL shares at the end of 2011, he gained a deemed interest in 800,000 NHPL shares in the same year.167Foot Note 167×PCB Tab 23, p 92.According to the plaintiff, this is direct evidence that the NHPL shares are held on trust by the first defendant for the plaintiff, as s 7(2) of the Companies Act (Cap 50, 2006 Rev Ed) (“the Act”) provides that “[w]here any property held in trust consists of or includes shares and a person knows, or has reasonable grounds for believing, that he has an interest under the trust, he shall be deemed to have an interest in those shares.”168Foot Note 168×PCS p 28, paras 53 – 54.Reading the 2011 statement with s 7(2) of the Act, the plaintiff submits that there is conclusive proof that the plaintiff did not intend to benefit the first defendant by way of the share transfer,169Foot Note 169×PCS p 29, para 56.as he merely intended for her to be the legal owner of the said shares.  150 The 2011 statement was submitted by the plaintiff and the first defendant to the auditors for the purpose of complying with s 164 of the Act, which requires a company to keep a register of the director’s and chief executive officer’s shareholdings.  151 Section 164(15) of the Act further provides: (15) For the purposes of the application of this section — (a)a director or chief executive officer of a company shall be deemed to hold or have an interest or a right in or over any shares or debentures if —(i)a wife or husband of the director or chief executive officer (as the case may be) (not being herself or himself a director or chief executive officer thereof) holds or has an interest or a right in or over any shares or debentures; … 152 While s 164(15) of the Act is relied on by the defendants in an attempt to explain away the 2011 statement,170Foot Note 170×DCS p 62, para 144.the plaintiff rightly points out that the first defendant is not the wife of the plaintiff, and hence the provision does not apply. Further, even if the first defendant were the plaintiff’s wife, she was clearly a director at the material time, being a co-signatory, alongside the plaintiff, of the 2011 statement. That being the case, s 164(15) of the Act is plainly inapplicable, as it applies only when the “wife or husband of the director” is “not being herself … a director” of the company.171Foot Note 171×Plaintiff’s Reply Closing Submissions (“PRCS”) p 5 para 24. 153 During cross-examination, the first defendant was referred to the 2011 statement, and she was adamant that she did not know what “deemed interest” in the 2011 statement meant.172Foot Note 172×Transcripts (18 July 2019) p 74 lines 4 – 22.Her obliviousness of the significance of the “deemed interest” shifting to the plaintiff by the end of the year is supported by the statement itself. In the 2011 statement, it is stated that, at the beginning of the financial year 2011, the first defendant herself had a deemed interest in 799,999 NHPL shares. However, at the end of the financial year, the first defendant lost all her deemed interest. Instead, the plaintiff had acquired a deemed interest in 800,000 NHPL shares. If the plaintiff and the first defendant indeed regarded “deemed interest” to mean beneficial ownership of the shares, the question ishowdid the first defendant acquire the beneficial interest in the 799,999 NHPL shares at the start of 2011, only to lose them all by the end of the year? In other words, why did the first defendant trade her beneficial interest in the shares for bare legal interests by way of the share transfer?173Foot Note 173×Transcripts (9 July 2019), p 82 lines 16 – 25 and p 83 line 23 – p 84 line 2. 154 In response to the above, the plaintiff refers to ss 7(6) and 10 of the Act,174Foot Note 174×PRCS p 5 para 26.which provide as follows: (6) Where a person — (a) has entered into a contract to purchase a share; (b) has a right, otherwise than by reason of having an interest under a trust, to have a share transferred to himself or to his order, whether the right is exercisable presently or in the future and whether on the fulfilment of a condition or not; … that person shall be deemed to have an interest in that share. … (10) An interest in a share shall not be disregarded by reason only of — … (c) the fact that the exercise of a right conferred by the interest is, or is capable of being made, subject to restraint or restriction. 155 According to the plaintiff, given that the first defendant was in possession of the share transfer form that was dated 1 November 2010, she had, pursuant to either s 7(6)(a) or 7(6)(b) of the Act, a deemed interest in the shares at the start of 2011. Additionally, s 10(c) of the Act meant that the first defendant’s deemed interest in the shares was not to be disregarded by the fact that it was subject to the restraint or restriction that she was only the legal, and not beneficial, owner of the shares.175Foot Note 175×PRCS p 5, para 27.As such, that the first defendant lost her deemed interest in the shares by the end of 2011 was consistent with their case that she was, at all times, but only a legal owner of the shares. 156 I am unable to accept the plaintiff’s submission. Adopting the plaintiff’s explanation of what “deemed interest” meant to the parties when they signed the 2011 statement, the first defendant’s deemed interest in 799,999 NHPL shares at the start of 2011 would refer solely to herlegalinterest in the said shares. However, it is then the plaintiff’s own case that the 800,000 NHPL shares in which the plaintiff was stipulated to have a “deemed interest” at the end of 2011 refers to hisbeneficialinterest in the NHPL shares. 157 If the plaintiff’s submission is correct, the parties would have ascribedtwodiametrically opposed meanings to “deemed interest” in the 2011 statement. At the start of the financial year, the first defendant had a deemedlegalinterest in 799,999 NHPL shares. By the end of the financial year, after the lodgement of the share transfer form, she acquired a directlegalinterest in 800,000 NHPL shares. Meanwhile, the plaintiff’s direct interest in the 799,999 NHPL shares at the start of the year morphed into a deemedbeneficialinterest in 800,000 NHPL shares by the end of the financial year. There is no evidence, whether in the 2011 statement itself or otherwise, which shows that the parties intended to ascribe such a confusing meaning to the term “deemed interest”, such that it vacillated in a manner that best suited the plaintiff’s case at all times. 158 In the circumstances, I find that both the plaintiff and first defendant could have been confused about what the “deemed interest” meant, irrespective of its actual legal meaning in the Act. For this reason, I hesitate to ascribe a legalistic interpretation of “deemed interest” to mean a beneficial interest in the shares, and I therefore do not find the 2011 statement to be conclusive evidence that the plaintiff had no intention to benefit the first defendant by way of the share transfer. 159 Even if I am wrong in the above analysis, the plaintiff’s reliance on the 2011 statement sits at odds with the totality of the evidence as discussed above. On the plaintiff’s interpretation, the 2011 statement shows that the share transfer was but a means to transfer thelegalinterest in the NHPL shares to the first defendant. However, to summarise my findings above, the plaintiff had clearly expressed his intention to will his SA Tours shares to the first defendant in 2008. Consistent with this intention, he executed the June 2010 draft Will by which he had bequeathed his shares to the defendants in equal shares. After the share transfer was executed, the plaintiff then executed the August 2011 Will, in which he omitted the NHPL shares, thereby supporting the defendants’ case that he had transferredallhis interest in the NHPL shares to the first defendant by way of the share transfer (see [52]–[57] above). In all of the above documents, the plaintiff did not for once distinguish between the legal and beneficial interest in the shares (or any other shares in his other companies for that matter), nor did he ever hint that the share transfer (or bequeathing of the said shares) was with regard to thelegalinterest in the said shares only. Furthermore, RK’s undisputed and credible evidence was that it was always the plaintiff’s intention to gift NHPL to the first defendant, and that the share transfer was but a means to save the first defendant the trouble of the probate process (see [63]–[68] above). The above chain of events is consistent with the generally good relationship that plaintiff and first defendant shared until, during and afterthe share transfer, up until the plaintiff moved back to Malaysia in July 2013 (see [71]–[99] above). On balance, the defendants have clearly demonstrated that the plaintiff intended to benefit the first defendant through the share transfer. 160 In contrast, the litigation representatives’ case, which hinges on the plaintiff having delineated between the legal and beneficial interest in the NHPL shares, is unsupported byanycorrespondence between the parties. Instead, it is founded on a legalistic interpretation of the 2011 statement, as well as unsupported allegations of a breakdown of relationship between the parties and certain documents (like the 29 March 2011 letter (see [101]–[115] above) and the 6 February 2012 Will (see [116]–[143] above)) which I have found to be unreliable and to which I ascribe no weight. Viewed in totality, even if I accept the plaintiff’s interpretation of the 2011 statement, it is insufficient, in and of itself, to tilt the balance back in favour of the litigation representatives, who claim that the plaintiff had no intention to benefit the first defendant. Delay in lodgement of the share transfer form 161 Finally, the plaintiff submits that the fact that the share transfer form was only lodged on 1 April 2011, five months after it was executed, tends to show that the plaintiff had no intention to benefit the first defendant by the share transfer.176Foot Note 176×PCS p 25, para 51. 162 Their argument in this respect requires elaboration. The first defendant’s evidence is that the reason for the delay in lodgement was that the plaintiff had explained that he wanted to ensure that NHPL’s assets were unencumbered so that he could transfer the shares to her free from encumbrance.177Foot Note 177×DBAEIC p 87, para 58. 163 During the hearing, the first defendant was referred to strata title searches on NHPL’s property, which showed that they remained encumbered by mortgages from 1 November 2010 (when the share transfer form was executed) to 1 April 2011 (when the share transfer form was lodged).178Foot Note 178×Exhibits P5, P9, P13, P16, P17.These mortgages were only discharged on 31 December 2015 (for the SA Tours’ properties)179Foot Note 179×Exhibits P9, P13, P16, P17 (see TDM [Total Discharge of Mortgage] date).and 7 October 2017 (for the Cairnhill apartment).180Foot Note 180×Exhibit P5.This suggests that the first defendant’s account for the delay in lodgement was untrue. 164 However, the first defendant explained that, to her mind, an encumbrance does not refer to a mortgage over the property.181Foot Note 181×Transcripts (19 July 2019) p 3 line 25 – p 4 line 5.Instead, to render the property unencumbered meant that no monies remained owing to the bank which would require monthly repayment or servicing.182Foot Note 182×Transcripts (19 July 2019) p 4 lines 18 – 23, p 5 line 2, p 18 lines 3 – 5.This appears to be her true interpretation of the term “encumbrance”. In her affidavit of evidence in chief, which she had tenderedbeforebeing shown the exhibits at trial that showed that NHPL’s properties remained encumbered by mortgages, she had stated that the delay in lodgement was because “the Plaintiff told me previously that he wanted to ensure that SA Tours wasnot owing monies to the banks” [emphasis added].183Foot Note 183×DBAEIC p 103 para 120.Thus, while the mortgages remained intact, they were simply kept in place as “collateral to secure banker’s guarantee[s]”.184Foot Note 184×Transcripts (18 July 2019) p 35 lines 14 – 19. 165 However, no evidence was tendered to show that, between 1 November 2010 and 1 April 2011, the plaintiff had actively sought to clear NHPL’s debts with the banks. The plaintiff submits that an adverse inference ought to be drawn against the first defendant for failing to produce evidence to this effect.185Foot Note 185×PCS p 25 para 50. 166 Even if such an adverse inference is drawn, and it is inferred that the plaintiff did not actually discharge the loans as the first defendant alleged that he would, this at best only serves to impugn the first defendant’s credibility. I struggle to conceive how the delay in lodgement of the share transfer form, in and of itself, tends to show a lack of intention to benefit the first defendant. If at all, the delay in lodging the transfer only acted to the disadvantage of the first defendant as it would not have been in her interest to delay the lodgement of the share transfer form which had already been executed in her favour, and which propriety the plaintiff’s litigation representatives have not disputed. 167 While one of the plaintiff’s causes of action is in fraud,186Foot Note 186×SOC p 4 paras 7 – 8.that ground appears to have been abandoned by the end of trial, and the plaintiff now only seeks relief based on its causes of action in “resulting trust, the presumption of resulting trust, or in the alternative, breach of contract.”187Foot Note 187×PCS p 80, para 176.Had the plaintiff proceeded on the basis of fraud, the delay in lodgement of the share transfer form would have been relevant insuggestingthat the share transfer was carried out fraudulently. This is because the plaintiff’s case in fraud was based on an averment that the first defendant had obtained a Blank Form that was pre-signed by the plaintiff, and which the first defendant proceeded to fill in the details of before executing the share transfer to herself.188Foot Note 188×SOC p 4, paras 7 – 8.The delay in lodgementcouldtherefore throw the propriety of the share transfer into doubt. 168 However, the plaintiff’s litigation representatives do not dispute the share transfer form and its subsequent lodgement (see [16] above). NCS had agreed in his testimony during the trial that there is no evidence to contradict the evidence provided by the defendants in relation to the share transfer.189Foot Note 189×Transcripts (9 July 2019), p 82 lines 16 – 25 and p 83 line 23 – p 84 line 2.In the result, the only issue in dispute is whether the plaintiff intended to benefit the first defendant by way of the share transfer. In this regard, RK’s evidence was that the plaintiff had instructed her to lodge the share transfer form sometime in March 2011, and the share transfer form was accordingly lodged on 1 April 2011.190Foot Note 190×DBAEIC p 55 para 17.That being the case, the share transfer form was lodgedon the plaintiff’s instructions. Whatever reason the plaintiff could have had for instructing the first defendant to delay the lodgement of the share transfer form, he ultimately gave instructions to lodge the transfer form. Hence, even if NHPL’s debts were not cleared by 1 April 2011, that fact alone does not prove that the plaintiff did not have an intention to benefit the first defendant by way of the share transfer, which he had himself procured. Conclusion on the plaintiff’s response 169 For these reasons, I find the various arguments mounted by the plaintiff’s litigation representatives to be devoid of merit. In fact, their desire to paint a picture of a breakdown in the relationship between the first defendant and plaintiff was counter-productive, as a review of the evidence shows that their relationship had not broken down, thus supporting the defendant’s case that the plaintiff fully intended to benefit the first defendant when he executed the share transfer form. 170 As such, I find that the presumption of a resulting trust is rebutted, as the evidence shows, on a balance of probabilities, that the plaintiff intended to benefit the first defendant by way of the share transfer, notwithstanding the lack of consideration provided. For the same reason, a resulting trust does not arise (see [23] above).",
        "Contractual claim": "171 Turning to the contractual claim, I note that the plaintiff’s litigation representatives have pleaded it as an alternative claim. This claim appears to sit uneasily alongside the claims in resulting trust and presumption of resulting trust, as the latter claims are premised on alackof contract. For completeness, I shall deal with this observation even though the defendants have not raised any objections to the contractual claim on the basis of its inconsistency with the other claims. 172 The Court of Appeal inNg Chee Wengv Lim Jit Ming Bryan and another[2012] 1 SLR 457 (“Ng Chee Weng”) clarified at [32] (citingMallal’sSupreme Court Practice(Vol 1, 2nd Ed, 1983) with approval) that alternative pleas in the same action are generally permissible: Alternative pleas: A plaintiff may base his claim alternatively, upon two or more different sets of facts, each entitling him to the relief sought, or of some modifications of it. A plaintiff may rely upon different rights alternatively and there is nothing in these rules to prevent a party from making two or more inconsistent sets of allegations and claiming relief in the alternative.The object of permitting alternative reliefs to be claimed in one litigation is to obviate the necessity of another litigation to dispose of the same controversy or the subject-matter of the same relief, though the ground upon which the relief is claimed may be different. [emphasis in original] 173 A plaintiff’s general right to seek alternative reliefs is however subject to the rule that “the alternatives cannot offend common sense and justice”. In this regard, “an exception to the general rule is that alternative statements of fact are not permitted if one statement or the other must, to the knowledge of the pleader, be false” (Ng Chee Wengat [36]). 174 Here, the plaintiff is represented by his litigation representatives. Given that the plaintiff has been declarednon compos mentis, the plaintiff’s litigation representatives could not have known whether the alternative statements of fact pleaded in relation to the contractual claim were false. As a matter of common sense, due regard ought therefore to be given to the alternative contractual claim, despite its inconsistency with the claims in resulting trust and presumption of resulting trust. 175  That having been said, the contractual claim also fails, since I find that the plaintiff intended to benefit the first defendant with the share transfer, which was executed on the plaintiff’s instruction notwithstanding a lack of consideration being provided by the first defendant. Accordingly, no consideration was expected by the plaintiff for the share transfer. As it is trite that consideration is necessary for contractual formation, there is simply no contract between the plaintiff and the first defendant. Concomitantly, there is no breach of contract on the first defendant’s part.",
        "Conclusion": "176 In conclusion, I dismiss the plaintiff’s claims in resulting trust, presumption of resulting trust and contract as I find that the plaintiff intended to benefit the first defendant by way of the share transfer. 177 Consequently, the first defendant is the legal and beneficial owner of the 799,999 NHPL shares that were transferred to her by the plaintiff. 178 Accordingly, the action is dismissed. I will hear the parties on the question of costs at a later date, if such costs are not agreed.  Vincent HoongJudicial Commissioner Martin Roderick Edward SC, Sharon Chong Chin Yee, Nandhu and Gideon Yap (RHTLaw Taylor Wessing LLP) for the plaintiff;Suresh s/o Damodara, Ong Ziying, Clement and Khoo Shufen, Joni (Damodara Hazra LLP) for the defendants."
    }
}