{
    "case_title": "UVH and another vUVJ and others",
    "ncitation": "[2019] SGHCF 14",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 Two sisters (“the Sisters”), the third and fourth children of their father (“the Testator”), brought suit against their three brothers (“the Brothers”), contending that the Brothers had failed in their fiduciary duties as executors of the Testator’s estate (“the Estate”). On 10 April 2017, I ordered that an account be taken on a wilful default basis. There had been, by that stage, a failure on the part of the Brothers to furnish any account for some 19 years. This judgment details the consequent taking of the account on a wilful default basis.",
        "Background": "2 The Testator passed away on 30 May 1997. The grant of probate was issued on 4 September 2000.1Foot Note 1×UVL’s Affidavit, Bundle of Affidavits of Evidence-In-Chief (“BAEIC”) Volume 1 Tab 2, p 74.The Testator’s will dated 8 May 1996 (“the Will”) was a simple one and its material parts read as follows: I, [Testator], of [address], hereby revoke all former testamentary dispositions made by me. 1.  I appoint my sons namely, [UVJ], [UVK] and [UVL] (hereinafter called ‘my trustees’) to be the executors and trustees of this my Will. 2.  I give to each of my following children namely, [Two Half-Siblings] the sum of $500,000.00 (called the specific pecuniary bequests) free of duty. 3. I give all my real and personal property whatsoever and wheresoever (including any property over which I have a general power of appointment or disposition by will) to my trustees for the payment of my debts[,] funeral and testamentary expenses legacies including the specific pecuniary bequests contained in Clause 2 hereinbefore provided and all estate duty on any legacy given free of duty and subject thereto to be divided into ten (10) equal shares to be divided among my wife and my children in the following manner: i) to my wife, [the Mother]   5 shares ii) to my son, [UVJ]    1 share iii) to my son, [UVK]    1 share iv) to my son, [UVL]    1 share v) to my daughter, [UVH]   1 share vi) to my daughter, [UVI]    1 share 4. If any child of mine shall die in my lifetime leaving issue at my death who attain the age of eighteen years or marry under that age such issue shall take by substitution and if more than one in equal shares per stirpes the share of my estate which such deceased child would have taken if he or she had survived me but so that no issue shall take whose parent is alive at the date of my death and capable of taking. 5. I declare that my two children named in clause 2 hereinbefore provided shall each be entitled to DOLLARS FIVE HUNDRED THOUSAND ONLY ($500,000.00) free of estate upon my death and no more and if any of my abovesaid children [the Half-Siblings] shall object to any provision or device in this my will and/or take legal suit in any court of law whether in Singapore or elsewhere for resolving or determining his or her objections on any ground or for any reason whatsoever whether under common law or by virtue of any Act of Parliament in respect to their exclusion from the ten (10) shares as in Clause 3 hereinbefore provided or may any other respect whatsoever that my abovesaid gift or device to him and her shall be of no effect null and void as if no provision or device has been made to him and/or her in this my will and he or she shall take nothing from my estate. 3 The Will did not provide the Brothers, who were named as executors of the Estate in Clause 1, with any power to postpone the getting in, conversion or distribution of the assets. 4 Clause 2 contained a specific devise to two half-siblings (“the Half-Siblings”) in the sum of $500,000 each. Only Clause 2 has been administered, because of action taken by the Half-Siblings. Around December 2000, the Half-Siblings, through their solicitors, started asking the Brothers for information relating to the steps that the Brothers had taken in administering the Estate since the grant of probate was obtained, as well as a statement of the Estate’s account.2Foot Note 2×PCB Volume 6, pp 4126-4131; NE 11 February 2019, p 16.None was supplied. Finally, on 4 September 2002, the Half-Siblings filed Originating Summons No 1241 of 2002 (“OS 1241/2002”) to compel the Brothers to accede to their requests for information and a statement of the Estate’s account. They complained that the Brothers had not been forthcoming in providing any information despite their fiduciary obligations as executors.3Foot Note 3×PCB Volume 6, p 4130. 5 OS 1241/2002 was eventually resolved on 4 December 2002 with no substantive orders made.4Foot Note 4×PCB Volume 6, p 4207.Nevertheless, Belinda Ang Saw Ean JC (as she then was) ordered costs against the Brothers, for the reason that it was the lack of information provided to the Half-Siblings that prompted them to take out the application. These costs, together with the legal fees incurred through defending the action, were charged to the Estate.5Foot Note 5×NE 11 February 2019, pp 20-21.Thereafter, the Half-Siblings were each paid their entitlement of $500,000 on 19 October 2004.6Foot Note 6×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 34; NE 11 February 2019, p 24.The Brothers did not inform the Sisters about OS 1241/2002, the legal costs that ensued, or the payment to the Half-Siblings.7Foot Note 7×NE 12 February 2019, pp 7-8. 6 This suit arises out of Clause 3, which devised all the Testator’s “real and personal property whatsoever and wheresoever” to the five children and the Mother. The Mother was still alive at the time of the Testator’s death. She died in November 2015. Although the Will contained no power to postpone the calling in and distribution of assets, the administration of the Estate has not, to date, been completed. 7 The Testator, during his lifetime, had channelled the profits of his quarrying business into substantial real property investments held by various private companies. His Estate therefore included a sizable real estate portfolio at his time of death, held in the main through four private companies, which I shall refer to in this judgment as “[A] Trading”, “[B] Development”, “[C] Investments” and “[D] Company”, and collectively as “the Companies”. Prior to the Testator’s demise, the Brothers had been appointed as directors in the Companies (save for UVJ’s directorships in [A] Trading, [B] Development and [C] Investments), and had held shares in their own names.8Foot Note 8×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 10. 8 The Testator’s, and therefore his Estate’s, shareholding comprised 1.67% in [A] Trading, 2.22% in [B] Development, 0.19% in [C] Investments, and 12.5% in [D] Company. [D] Company also held 34% in [A] Trading and 37.92% in [B] Development, and [A] Trading held 97.56% in [C] Investments. It is not disputed that from 1997, the Brothers used the Estate’s shares to vote in favour of resolutions re-appointing themselves as directors and approving their remuneration as directors in the Companies.9Foot Note 9×NE 7 February 2019, pp 109-110. 112.The Sisters were not consulted on these various decisions.10Foot Note 10×NE 7 February 2019, p 112.The Sisters were also not informed of the substantial proceeds received as a result of divestment of real estate from the Companies’ portfolios. Dividends accrued to the Estate in 2008 and 2012,11Foot Note 11×NE 7 February 2019, pp 113; NE 11 February 2019, p 56.but the Sisters were not informed nor were their share of the dividends distributed to them. 9 The youngest brother, the third defendant, lived with the Mother at the family home until her death. The two elder Brothers lived in premises owned by the Companies. The first defendant, UVJ, has been staying at [E] Shelford Road from 1 January 2008, and has been paying a monthly rental of $7,000.12Foot Note 12×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 15-16.Similarly, the second defendant, UVK, has been staying at [F] Shelford Road from 20 December 2000, and has also been paying monthly rental of varying amounts. There is no dispute that these rentals paid were at a value below market valuation. The Sisters were not aware of the benefits in kind enjoyed by UVJ and UVK, and discovered the arrangements in the context of the current proceedings.13Foot Note 13×NE 8 February 2019, p 35. 10 The Testator’s Estate included an apartment at Jalan Kechil (“the Eastern Mansion property”), which was owned by the Testator at the time of his death. The Testator’s mistress, Mdm Kok, had lived there from 1993. Before his passing, the Testator had entered into an agreement to participate in an en-bloc collective sale of the Eastern Mansion property.14Foot Note 14×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 24, 775.The Brothers contend that the late Testator had given instructions for Madam Kok to stay in the Eastern Mansion property, rent-free, until the en-bloc sale was concluded.15Foot Note 15×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 24.It is not disputed that the Sisters were not informed of the existence of or the arrangements pertaining to Madam Kok’s residence at the Eastern Mansion property.16Foot Note 16×NE 8 February 2019, p 16.The Eastern Mansion property was eventually sold in May 2006 for $909,207.90.17Foot Note 17×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 24.Upon the collective sale taking place, the Sisters signed their consent to the sale as beneficiaries of the Estate and subsequently the proceeds of sale were distributed. 11 The Testator’s Estate also included land in Johor Bahru (“the JB Land”). In 2011, the Brothers received an attractive offer to purchase the JB Land and decided to accept the offer.18Foot Note 18×NE 8 February 2019, p 148.As part of the process for the sale of the JB Land, the Brothers required the agreement of the Mother and the Sisters as beneficiaries of the Estate. Because of her unhappiness over the Mother’s gift of her share of the Eastern Mansion proceeds to UVL, UVI refused to sign the relevant documents for the transfer of the land unless the Mother waived receipt of her share of the proceeds from the sale.19Foot Note 19×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 38; NE 8 February 2019, pp 148-149.The manner in which this dispute was resolved is not free from contention, but on 11 April 2011, the beneficiaries signed the relevant documentation and sold the JB Land for the sum of $879,800.20Foot Note 20×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 38, 1033-1057; NE 8 February 2019, p 148.The Brothers then aggregated the proceeds with a portion of the dividends from the Companies that had accumulated in the Estate account since May 2008.21Foot Note 21×NE 11 February 2019, p 55.Using a $1m starting figure, the Brothers distributed the $1m in five portions, such that each sibling individually received $200,000.22Foot Note 22×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 38-39; NE 8 February 2019, p 148.The Sisters were not aware that their portions contained dividend components. 12 On 7 November 2015, the Mother passed away. Her Last Will and Testament provides that UVL is entitled to a two-sixth share of her Estate, while the remaining siblings are entitled to a one-sixth share each.23Foot Note 23×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 39, 1080.UVJ, UVK and UVL are the executors of her Estate and are joined in their capacities as such as UVO, UVP and UVQ. 13 On 17 March 2016, the Sisters sent a letter to the Brothers, seeking a statement of the Estate’s account.24Foot Note 24×PCB Volume 6, pp 3742-3743.Although the Brothers rendered a statement of account on 15 April 2016,25Foot Note 25×PCB Volume 6, pp 3746-3747.the Sisters were of the opinion that it was unsatisfactory26Foot Note 26×PCB Volume 6, p 3748.and commenced High Court (Family Division) Suit No 6 of 2016 against the Brothers on 25 July 2016. They followed on with Summons No 370 of 2016 (“S 370/2016”), a summary application for an account to be taken of the Estate on a wilful default basis.27Foot Note 27×HCF/SUM 370/2016, Order of Court 10 April 2017.I granted the order on 10 April 2017. 14 At the time of the taking of the accounts, UVJ, the eldest child, was 72. The first four siblings are close in age, with the fifth, UVL, some 11-12 years younger than UVI, the fourth child and younger of the two Sisters. UVL was 59 at the taking of accounts. UVH, the third child and elder of the two Sisters, acted by her litigation representative.",
        "Issues": "15 After viewing the accounts provided by the Brothers, the Sisters argue that the Brothers had committed deliberate and systematic breaches of their fiduciary duties as executors of the Estate.28Foot Note 28×Closing Submissions of the Plaintiffs, p 8.In particular, they seek the following remedies in the taking of the accounts: (a) First, an account of profits or in the alternative, equitable compensation, for the sum of $20,987,689.90, being the total remuneration received by the Brothers for the accounting period, to the Estate’s account; (b) Second, a surcharge on the Estate’s account for the sum of $174,000, being the benefit in kind enjoyed by the first defendant for his occupation of [E] Shelford Road; (c) Third, a surcharge on the Estate’s account for the sum of $360,000, being the benefit in kind enjoyed by the second defendant for his occupation of [F] Shelford Road; (d) Fourth, a surcharge on the Estate’s account for the sum of $84,600, being the annual value of rental income that would have been collected by the Testator’s Estate until the Eastern Mansion property was sold in 2006; (e) Fifth, a falsification of the sum of $5,500.65, being the legal fees accrued from OS 1241/2002; (f) Sixth, that the sum of $1,000,000 that is stated as owing from the Estate to the Mother’s Estate following the distribution of the monies from the sale of the JB Land be falsified; (g) Seventh, that the Brothers be removed as the executors for the Estate, and for an alternative executor be appointed instead.",
        "Preliminary matters": "16 As may be seen from the list of remedies requested, the Sisters seek, at the end of the taking of accounts, various different kinds of consequential orders, including an account of directors’ remuneration and benefits in kind received by the Brothers as executors. In addition, they seek the removal and replacement of the Brothers as executors. 17 The order for an account on a wilful default basis had been sought and obtained on a summary basis on 10 April 2017. At the taking of the account, the Sisters elected not to give evidence, preferring instead to rely on the admissions made by the Brothers in the course of their cross-examination. The Brothers raise two preliminary contentions. They argue, first, that the scope of orders that the court could grant are limited, and could not extend to the remedy of an account of profits or the removal of the executors. Second, they also take issue with the fact that the Sisters did not adduce any evidence of their own. I shall deal with each in turn.",
        "Scope of remedies upon the taking of an account": "18 The Sisters’ requests in respect of the remedies to be granted after the taking of accounts included an account of profits and the removal of the Brothers as executors. The Brothers are of the view that the current proceedings for the taking of accounts are limited to dealing with assets which belonged to the Testator, for two reasons. The first is that the remedies arising out of the account should be limited to the Order of Court dated 10 April 2017 in S 370/2016 (“the Order of Court).29Foot Note 29×Closing Submissions for the 1st to 3rd Defendants, pp 21-22.The material part of the Order of Court, which followed from the grant of an order in terms of the summons, states as follows:30Foot Note 30×HCF/SUM 370/2016, Order of Court 10 April 2017. It is ordered that: 1. That an account be taken of all assets belonging to the estate of the late [father] as stated in the claim endorsed on the Writ of Summons; 2. That the said account be taken on a wilful default basis; 3. The Defendants do make restitution to the estate of any sums found due to have been misapplied, misappropriated or wrongly incurred by the Defendants by and/or on behalf of the estate; 4. The Defendants do pay to the Plaintiffs the amount found to be due from the Defendants to the Plaintiffs on the taking of such account. 19 Mr Sreenivasan SC argues that wider remedies, in this case, for the removal and replacement of executors, or an account of profits, may not be ordered after the taking of accounts. For the removal of the executors, he concedes that this had been sufficiently pleaded within the statement of claim, but is of the view that a further application must be specifically filed for this purpose. For the account of profits, a second objection is that there is no express stipulation in the Sisters’ statement of claim for the remedy of an account of profits.31Foot Note 31×Closing Submissions for the 1st to 3rd Defendants, p 21.There had to be, in his view, a separate statement of claim brought by the Sisters that specified an account of profits as a consequential remedy to the taking of accounts.32Foot Note 32×Closing Submissions for the 1st to 3rd Defendants, p 23; NE 4 April 2019, pp 10-11.At various junctures, he suggested that the matter be listed again for trial, or a new statement of claim be filed; no authorities were tendered in aid of these propositions. 20 I agree with Mr Jeyaretnam SC that the statement of claim has sufficiently prayed for the remedies requested. The pleading for the removal of executors is conceded. As for the account of profits, Prayer B requests “[a]n account of what is due to the Plaintiffs and payment of the amount found due on taking the account”. This prayer envisaged that the Sisters would claim any entitlement arising from an account, including any account of profits that may be due. Regarding the Order of Court, clauses 1 and 2 would sufficiently deal with all remedies arising out of the taking of the account. Clause 3 stipulated restitution for any sums found misappropriated; in any event it could not be said to limit any wider remedies for any misfeasance established arising from clauses 1 and 2. The Sisters, in their notice of objections and non-admissions dated 22 September 2017 filed in response to the accounts, specifically included a surcharge for an account of profits for “[u]nauthorised profits made by the Defendants” and “[p]ersonal expenses of the Defendants which were borne by the Companies”, at items 6 and 7. 21 The Brothers emphasise that the taking of an account functions as a process, not as a remedy (Lalwani Shalini Gobind and another v Lalwani Ashok Bherumal[2017] SGHC 90 at [26]). It doesnotfollow, in my view, that remedies are not available at the end of the process. The Court of Appeal inChng Weng Wah v Goh Bak Heng[2016] 2 SLR 464 summarised the process of taking accounts as a three-step process, at [22], with “any consequential relief” listed as the last step. The Court of Appeal stated at [20]: The accounting procedure under the law of equity is often used for a variety of purposes. In a case involving a violation of fiduciary duties, the court may order an account of profits in order to disgorge profits wrongfully gained by the defendant. … 22 As explained by Lord Millett inLibertarian Investments Ltd v Thomas Alexej Hall[2013] HKCFA 93 (“Libertarian Investments”) at [167]–[168]: 167 It is often said that the primary remedy for breach of trust or fiduciary duty is an order for an account, but this is an abbreviated and potentially misleading statement of the true position. In the first place an account is not a remedy for wrong. … Once the trust or fiduciary relationship is established or conceded the beneficiary or principal is entitled to an account as of right. … 168 In the second place an order for an account does not in itself provide the plaintiff with a remedy;it is merely the first step in a process which enables him to identify and quantify anydeficit in the trust fund and seek the appropriate means by which it may be made good. … [emphasis added in italics] 23 It is only upon the taking of an account, then, that the true position between the fiduciary and the beneficiary may be ascertained. It is at that time that the beneficiary may identify any deficit in the trust fund or estate and request any consequential relief (seeTongbao (Singapore) Shipping Pte Ltd and another v Woon Swee Huat and others[2018] SGHC 165 at [124]). 24 The present taking of accounts has an additional feature that it was ordered on a wilful default basis. The purpose of such accounting is to discover concealed misconduct. Misconduct may be investigated that was neither pleaded nor mentioned at the hearing at which the accounting was directed and the defendants may be charged accordingly: seeSnell’s Equity(John McGhee gen ed) (Sweet & Maxwell, 33rd Ed, 2015) at para 20-025(b)(2). It was explained inCheong Soh Chin and others v Eng Chiet Shoong and others[2018] SGHC 131 (“Cheong Soh Chin”) at [83], citingBartlett v Barclays Bank Trust Co (No 2)[1980] 1 Ch 515, 546, that in such cases, the trustee is subject to a “roving commission”, where the judge is entitled to look into all aspects of the trustee’s management. In that case, Vinodh Coomaraswamy J also dealt with various consequential reliefs after the taking of an account, including an account of profits for various service fees (at [241]). 25 No authority stipulating the requirement of an additional summons or other step in order for consequential relief to be granted has been cited, despite the Brothers’ contentions that such is necessary. Nor is any reason proffered for a further trial. No further evidence is needed. The remedies that the Sisters ask for have been made clear from the outset, through the statement of claim, the notice of objections and non-admissions, their opening statement, and counsel’s cross-examination in the course of the taking of accounts. At the close of evidence, issues were listed for counsel to address and time was given for both written submissions and oral responses. In my judgment, the issue must be one of proper notice and opportunity to address any necessary points. Here, the Brothers have had sufficient notice and time to address all the allegations thoroughly and to have made all arguments in their own favour. Accordingly, I am of the view that I may grant such remedies as the Sisters establish are necessary.",
        "Evidential issues": "26 The second preliminary issue arises from the process of the accounts being taken on a wilful default basis. Counsel agreed when they appeared before me at the pre-trial conference (“JPTC”) that the order of witnesses would be reversed for the taking of the accounts, as the basis for the account was that of wilful default and the Brothers were fiduciaries who would possess direct knowledge of the accounts’ administration. After the Brothers’ case closed, the Sisters decided not to give evidence, choosing to rely on the admissions that had been made by the Brothers in cross-examination. 27  The Brothers contend that the effect of the Sisters’ decision to not give evidence is threefold. First, that the Sisters cannot dispute the Brothers’ version of events. Secondly, that adverse inferences should be drawn against the Sisters under s 116(g) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”).33Foot Note 33×Closing Submissions for the 1st to 3rd Defendants, pp 26 and 30.Thirdly, that there cannot be any finding that the Brothers were in breach of their fiduciary duties, because there was no evidence to demonstrate so.34Foot Note 34×NE 4 April 2019, p 11. 28 There appears to be some misunderstanding of the course of events. The accounts were ordered to be taken on a wilful default basis because the Sisters were able, on a summary basis, to establish failure on the part of the Brothers to exercise the requisite standard of care. This was the effect of the hearing on 10 April 2017, from which the Brothers did not appeal. In the brief oral grounds given at the time of judgment, I highlighted at least two breaches of fiduciary duties. The first was the failure on the part of the Brothers to furnish any form of account for some 19 years. The second was the failure to distribute or deal with the shares in the Companies. Putting the Brothers’ case at its highest at the point that summary judgment was given, they ought to have turned their attention to the general devise once they had dealt with the pecuniary legacies to the Half-Siblings in October 2004. 29 It follows, then, from the premise of their default as fiduciaries, that the onus is on the Brothers to make sense of the accounts. As Arden LJ (as she then was) explained inMuradv Al-Saraj[2005] EWCA Civ 959 (“Murad”) at [77], the onus is on the defaulting fiduciary to explain his actions: Again, for the policy reasons, on the taking of an account, the court lays the burden on the defaulting fiduciary to show that the profit is not one for which he should account: see, for example,Manley v Sartori[1927] Ch 157. This shifting of the onus of proof is consistent with the deterrent nature of the fiduciary’s liability. The liability of the fiduciary becomes the default rule. In the Brothers’ attempt to discharge their liability, the court may choose to accept their explanation, but again, it would be entirely logical that the court may choose not to. Neither is the court bound to accept their version of disputed facts. By not taking the stand for cross-examination, the Sisters do not have the benefit of their affidavits of evidence-in-chief. That does not, however, lead to the conclusion that the Sisters accept the Brothers’ version of events. As a matter of logic, it simply means that the Sisters are of the view that the Brothers’ admissions are sufficient to establish their case. The Court’s duty to assess evidence remains. As the Court of Appeal emphasised inSandz Solutions (Singapore) Pte ltd and others v Strategic Worldwide Assets Ltd and others[2014] 3 SLR 562 at [56]: … ultimately, the trial judge has to consider thetotalityof the evidence in determining the veracity, reliability and credibility of a particular witness’s evidence. This includes contemporaneous objective documentary evidence. [emphasis in original] 30 It also follows that the Brothers’ position on drawing an adverse inference is wholly misplaced. Section 116(g) of the EA states: 116.The court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct, and public and private business, in their relation to the facts of the particular case. Illustrations The court may presume –– … (g) that evidence which could be and is not produced would if produced be unfavourable to the person who withholds it; … 31 The wording of s 116(g) makes it clear that the drawing of an adverse inference is dependent on the court’s discretion, and whether one is drawn depends upon all the circumstances of the case. In a situation of a taking of accounts, the only persons who are able to give direct evidence as to the administration of the estate are the executors.Cheong Soh Chinis a case in point, where at [29], Vinodh Coomaraswamy J stated: … Only the Engs can give direct evidence as to much of their dealings with the Wees’ monies and assets. Only the Engs can give direct evidence as to how they came to incur many of the disputed expenses. Hence, the failure of the Wees to be cross-examined in the accounting phase of this action on aspects of the Wees’ case on which they cannot give direct evidence does not justify an adverse inference. 32 Where the evidence concerns the administration of the estate, it is unlikely that the beneficiaries would be in possession of the relevant details. The present case is no different. The Sisters only discovered various instances of purported wrongdoing by the Brothers upon the taking of the Estate’s account. The Sisters are hence allowed to rely on the admissions and concessions of the Brothers in particularising and substantiating their claims, including fresh evidence of breaches of fiduciary duties raised by the account. 33 Coming then, to the reversal of the order of witnesses, while counsel agreed to the order of witnesses at the JPTC, comments were made at various points of submission that this was erroneous. I should therefore make clear that I was in any event of the view that the Brothers ought to take the stand first. Order 35 r 4(1) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) confers upon the trial judge the power to give directions as to the party to begin. The court has a discretion to order the defendant to begin first (seeSingapore Civil Procedurevol 1 (Chua Lee Ming ed) (Sweet & Maxwell, 2019) at para 35/4/2;Lo Khi On (t/a Fuji Hairdressing Saloon) v Tanjong Aru Hotel Sdn Bhd[1994] 3 MLJ 766). Section 108 of the EA, as an exception to the general rule in s 103 of the EA that the party who asserts must prove, imposes on a person the burden of proving a fact where that fact was particularly within the knowledge of that person (seeSurender Singh s/o Jagdish Singhand another (administrators of the estate of Narindar Kaur d/o Sarwan Singh, deceased) v Li Man Kay and others[2010] 1 SLR 428 at [217]). In the present case, the account had been ordered on a wilful default basis, and the onus was upon the Brothers to explain the accounts. The relevant facts were peculiarly within their own knowledge. It was appropriate for them to furnish such explanations as they had at the outset. 34 In stating the above, I acknowledge that the parties’ respective burdens of proof with regard to the reliefs of surcharge and falsification must be taken into consideration when determining the merits of the parties’ contentions. Where a beneficiary seeks to surcharge a common account, the beneficiary bears the burden of showing that the trustee received more income than that which the account records. On the other hand, where a beneficiary seeks to falsify an entry in the account, the trustee or fiduciary bears the burden of proving that that disbursement was in fact an authorised one (seeCheong Soh Chinat [78]–[79]). 35 Having dealt with these preliminary matters, I now turn to consider the first substantive issue, that of the Brothers’ remuneration as directors in the Companies.",
        "Directors’ remuneration": "36 The Brothers are directors at the Companies in which the Estate has shareholdings. The Sisters’ position is that the Brothers should account for all the remuneration they received as directors of the Companies in which the Estate had shareholding because they did not disclose their conflict of interest.35Foot Note 35×Closing Submissions of the Plaintiffs, pp 30-31.Their premise is that a fiduciary who gains unauthorised profits within the scope of their duty is obliged to account for those profits to their beneficiary. Because a principal is entitled to the single-minded loyalty of his fiduciary, a fiduciary ought not to place himself in a position where his interest and duty conflict. Where he does, full and informed consent of the beneficiaries is necessary.",
        "Salaries and bonuses": "37 The Sisters therefore argue that the Brothers had committed a breach of fiduciary duty by voting on the Estate shares while in a position of conflict of interest, without first seeking their informed consent, in order to obtain remuneration that constituted unauthorised profits. They claim an account of profits, or in the alternative, equitable compensation. 38 On the other hand, the Brothers deny that the Estate is entitled to their remuneration. They contend that they received the remuneration in their capacity as directors of the Companies, rather than in their capacity as executors.36Foot Note 36×Closing Submissions of the 1st to 3rd Defendants, p 37.They point to the fact that they had been appointed as directors in the Companies prior to their becoming executors of the Testator’s Estate (save for UVJ’s directorships in [A] Trading, [B] Development and [C] Investments).37Foot Note 37×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 10.Moreover, they claim the Sisters had known that they were beneficiaries at the time the relevant resolutions were being passed, and simply chose not to question the Brothers.38Foot Note 38×Closing Submissions of the 1st to 3rd Defendants, p 32; NE 4 April 2019, p 17.The Brothers further emphasise that the Estate’s shareholding in the Companies was very much a minority shareholding.39Foot Note 39×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 8.They argue that the approval of their remuneration could not be attributed to the Estate’s shares when the latter was neither instrumental in procuring the Brothers’ appointments as directors nor in passing the resolutions granting their remuneration.40Foot Note 40×Closing Submissions of the 1st to 3rd Defendants, p 49. 39 In particular, the Brothers rely on the decision ofInre Gee, decd.[1948] Ch 284 (“Inre Gee”), at 295, which, they point out, was cited with approval and applied inCheong Soh Chinat [224]–[226]: 224 I hold that the Wees are not entitled to claim an account of profits over the structuring fee. In the first place, I doubt whether the fees were in fact obtained by virtue of the Engs’ fiduciary position. This is because CSP, even by controlling the Wees’ shareholding through their control of Berners, was a minority in the resolution to pay the fees. Although Berners was the largest shareholder in Agis, it only held 47.7% of the shares. This means that the Engs did not find themselves in a position to award themselves fees by virtue of their position as fiduciaries. 225  Indeed, the decision of Harman J inRe Gee[1948] Ch 284 bears noting. There, Harman J observed at 295 that: … it appears not to be the law that every man who becomes a trustee holding as such shares in a limited company is made ipso facto accountable for remuneration received from that company independently of any use by him of the trust holding, whether by voting or refraining from so doing. For instance, A who holds the majority of the shares in a limited company becomes the trustee of the estate of B, a holder of a minority interest; this cannot, I think, disentitle A to use his own shares to procure his own appointment as an officer of the company, nor compel him to disgorge the remuneration he so receives, for he cannot be disentitled to the use of his own voting powers, nor could the use of the trust votes in a contrary sense prevent the majority prevailing. 226 The present facts, to my mind, are also a case where the Engs could not have exploited their control over the Wees’ shareholding to vote themselves the fees, even if I accept that it is because they were fiduciaries to the Wees that they had the power to appoint directors or control the shareholding. I therefore do not take the view that the fees were obtained as a result of their fiduciary position. 40 I reject the Brothers’ contentions for the following reasons. First, while the Brothers were indeed appointed as directors prior to their becoming executors, this does not exculpate them of any responsibility as fiduciaries after they became executors. It simply follows that the profits that the Brothers earnedpriorto their becoming executors would not be subject to an account of profits, and no request is made in this case concerning remuneration prior to their becoming executors. 41 Second, the starting point is for fiduciaries to always seek informed consent when in a position of conflict. Here, the Brothers admitted during cross-examination that there was a conflict.Inre GeeandCheongSoh Chin, which Mr Sreenivasan SC relies upon, may be distinguished. InInre Gee, there appears to have been no conflict of interest. Harman J, on an examination of the facts, stated at 296 that the persons entitled to the benefit of the estate’s shares in that case were in favour of the appointment and the payment of the stipulated remuneration; and further, no suggestion was made that the remuneration was excessive or that the executors had acted in bad faith. InCheongSoh Chin, Coomaraswamy J in disposing of the issue relating to the structuring fees did so on the basis that there was sufficient disclosure and informed consent. This is clear from the paragraph following the three paragraphs set out above at [39] (upon which Mr Sreenivasan SC relies), at [227]: 227 In any event, however, I find that the Engs gave sufficient disclosure, and moreover, received the Wees’ informed consent. The Engs highlighted multiple times to the Wees that such a fee was being negotiated, and moreover, informed the Wees when that fee was finally agreed. The relevant details of the fee, being the amount of 2.5% of the investment amount, was also disclosed. 42 Coming to the facts of this case, there were clearly actions taken in conflict of interestwithoutthe informed consent of the beneficiaries. The conflict of interest arose because the directors’ remuneration and the dividends payable to shareholders came from the same pool of funds. The Companies owned valuable properties that were sold or for which acquisition compensation was given. These proceeds could have been channelled either into directors’ remuneration or dividends. The quarries held by [A] Trading, for example, were compulsorily acquired by the government in 1998 with a gain of $16,895,000. A supplementary award in 2001 for compulsory acquisition by the government resulted in a further gain of $21,100,000. These gains were accumulated in the reserves of [A] Trading but were reduced by substantial net losses in 1999, 2000, and 2002 to 2007. A property owned by [A] Trading was sold in 2010 with a gain of $21,788,610 $5,031,632 was diverted as remuneration in 2010. Director salaries were tripled such that between 2011 and 2015, the remuneration to directors amounted to about $1.3m per year despite low levels of income, resulting in net losses: for example, $695,000 in 2011, $575,000 in 2015. UVJ admitted in cross-examination that the interest of the directors would lie in higher bonuses, while the Sisters’ interest would lie in higher dividends.41Foot Note 41×NE 7 February 2019, p 109.While the Estate’s shares were not instrumental in procuring the passing of the resolutions that granted the Brothers’ their remuneration, there is no doubt that the Estate’s votes were indeed used by the Brothers to vote in favour of resolutions approving the directors’ remuneration.42Foot Note 42×NE 7 February 2019, p 121.The use of the Estate’s shares, without the informed consent of beneficiaries, constitutes a breach of the no-conflict rule. Informed consent was necessary but not obtained.43Foot Note 43×NE 7 February 2019, pp 111-112. 43 In my judgment, it was the very fact of non-disclosure that allowed the Brothers to draw down on the proceeds of properties sold by the company. Shareholder approval in this particular company was a foregone conclusion because those voting were receiving the remuneration voted upon. Thus, [A] Trading could submit the IR8A tax declaration form in January 2011 for the payment of a $863,000 bonus to the first defendant prior to its approval at the relevant AGM in July 2011.44Foot Note 44×NE 7 February 2019, p 85.Further, it was the non-disclosure that allowed continuation of the remuneration for many years. Despite the Estate’s small shareholding, the Sisters would not be without remedy if they did not agree with the vote: for instance, they could have had recourse to s 216 of the Companies Act (Cap 50, 2006 Rev Ed) under a claim for minority oppression. The continuation of the Brothers’ misconduct was permitted by the non-disclosure, which has had significant practical effect. Cross-examination revealed that there were no contracts of employment or any documents delineating their scope of work as directors. The Brothers’ remuneration bore no relation to the work done within the Companies. For example, in Financial Year 2010, [A] Trading paid UVJ the sum of $863,000 as a bonus although he was fully employed as a senior executive elsewhere. Amongst the salaries which escalated in 2011 was the near doubling of the salary of one Mr Lee, a man who was at the time 90 years of age, had not visited the office for a number of years, and who passed away the next year in 2012. 44 I should make clear three matters for completeness. First, the Brothers contended at various points that the Sisters had deprived themselves of their rights by their decision to refrain from questioning the Brothers until after their Mother’s death.45Foot Note 45×Closing Submissions of the 1st to 3rd Defendants, p 32; NE 4 April 2019, p 17.Counsel clarified when asked that he is not advancing any case of estoppel. There is no merit in this argument. Any knowledge the Sisters may have had that they were beneficiaries at the time is irrelevant to the responsibility of the Brothers. Full and frank disclosure of all relevant matters is the requisite standard (seeMuradat [71]). The Brothers clearly failed to meet this standard. 45 Second, while the Brothers have sought to argue that their remuneration is in line with salaries earned in the field of private equity,46Foot Note 46×NE 12 February 2019, p 66.this was not the role they performed as directors. The evidence provided by the Brothers’ expert witness, Mr Sim, on private equity salaries is therefore irrelevant. Further, any question of their remuneration being reasonable only arises if the court is of the view that they should be given an equitable allowance. The granting of an equitable allowance is the exception, not the norm (seeMona Computerat [23]). It is for the fiduciary to establish that it would be inequitable to order an account of one’s entire profits (seeMona Computerat [28]). There are no facts upon which to make such an order. The Brothers have not shown themselves to be honest fiduciaries nor have they done work for the Estate. Quite the opposite. They remained responsible for the Estate’s shareholding in the Companies because they had not distributed the shares. Having omitted to distribute the shares, they were responsible to keep the beneficiaries informed and to act in the beneficiaries’ best interest. Drawing down the proceeds of the property proceeds through directors’ remuneration was not in the best interests of the beneficiaries. In any event, once their remuneration is paid back into the Estate, they will receive a share of the same as beneficiaries of the Estate. 46 Third, the Brothers contend that the rule against reflective loss applies to bar the Sisters’ claim for an account of profits.47Foot Note 47×Closing Submissions of the 1st to 3rd Defendants, p 49.The principle of reflective loss dictates that a claim will not lie by a shareholder to make good a loss which would be made good if the company’s assets were replenished through action by the company against the party responsible for the loss (seeTownsing Henry George v Jenton Overseas Investment Pte Ltd(in liquidation)[2007] 2 SLR(R) 597 at [69]). But the profits claimed here are not owed to the Companies. The Sisters claim in their capacity as beneficiaries, for the Brothers to disgorge the wrongful profits they obtained while acting in breach of their fiduciary duties. The premise of the account to the beneficiaries is to ensure that the defaulting fiduciary does not retain the profit. The rule against reflective loss has no applicability in the present case. 47 An account of the Brothers’ profits in terms of the remuneration earned is therefore owed to the Estate. The directors’ remuneration in the sum of $20,978,689.90 received by the Brothers should therefore be repaid to the Estate.",
        "Benefits in kind": "48 With regard to the benefits in kind enjoyed by the Brothers in the form of the two properties at [E] Shelford Road and [F] Shelford Road, which were owned by the Companies, the Brothers conceded in cross-examination that they were renting the premises at below annual value.48Foot Note 48×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 15. 49 UVJ also conceded during cross-examination that no attempts were made to rent out the said properties, nor was there any approval by the Companies’ shareholders or the Sisters that was sought and obtained for them to reside there at the lower rentals they were paying.49Foot Note 49×NE 8 February 2019, pp 38-39.This thus constitutes an impermissible benefit enjoyed by the Brothers. 50 The sums of $174,000 and $360,000, premised on the difference between the rental amounts paid by the Brothers and the annual value of the two properties, are to be surcharged to the Estate’s accounts.50Foot Note 50×NE 8 February 2019, pp 38–39 and 46; 1st to 3rd Defendants Bundle of Document for HCF/TAI 1/2017, pp 30–31.",
        "Alternative claim in equitable compensation": "51 An alternative claim was advanced by the Sisters in equitable compensation for the same salaries, bonuses and benefits in kind. I have awarded an account of profits and therefore do not deal with this alternative contention.",
        "Debt of $1m owed to the Mother’s estate": "52 The Sisters ask for the falsification of a sum of $1m said to be owed to the Mother’s estate. The Brothers say this arises from the sale of the JB Land. The Sisters contend that prior to the sale of the JB Land, the beneficiaries had agreed to a five-way split of the Mother’s share of the monies from the sale of the JB Land amongst each sibling.51Foot Note 51×Closing Submissions of the Plaintiffs, pp 50-51.There was thus no liability to the Mother for the sum of $1m, and any claim to the contrary was simply an excuse devised by the Brothers to explain away their failure to distribute the assets.52Foot Note 52×Closing Submissions of the Plaintiffs, p 53. 53 In contrast, the Brothers contend that the Mother, as the rightful beneficiary of half of the Testator’s residuary Estate, was entitled to the sum as part of a distribution.53Foot Note 53×Closing Submissions of the 1st to 3rd Defendants, pp 66-67.They argue that the five children had received a total of $1m from the sale of the JB Land as an advance of monies, with the Mother receiving her share at a later date.54Foot Note 54×Closing Submissions of the 1st to 3rd Defendants, p 66.Under the Will, the Mother was entitled to half of all the Testator’s real property; the entitlement to half of the JB Land proceeds arose out of this devise. 54 On this issue, the Brothers as fiduciaries bear the burden of demonstrating that any entry is properly made: see above, at [34]. The Sisters signed their transfers in due course, with the second plaintiff’s pre-condition for the proceeds to be paid equally between the five siblings (without any payment to the Mother) still in place. This is at odds with any agreement that the five-way split of the Mother’s share of the JB Land was merely an advance distribution of funds. Indeed, no agreement was alleged. UVL gave evidence that the signatures of all beneficiaries were needed for the land sale to be effected, and that the second plaintiff refused to sign the relevant transfer documents unless the Mother’s share of the proceeds was divided amongst the five children.55Foot Note 55×UVL’s Affidavit, BAEIC Volume 1 Tab 2, pp 37-38.His evidence was that the Mother had “informed [him] that she would not confront the second Plaintiff and was agreeable to receive her share at a later date”.56Foot Note 56×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 34.In other words, the Brothers’ defence was that the Mother deferred the receipt of her share. 55 The surrounding evidence belie the Brothers’ narrative, for three reasons. First, the proceeds from the sale of the JB Land were $879,800.57Foot Note 57×NE 8 February 2019, p 148.The Mother’s entitlement in such an instance would be $439,900, not $1m. Even if one were to take into account the additional funds that were taken out of the Estate account and added to the $879,800 to form the total disbursement of $1m to the five children, this would not equate to an entitlement of $1m.58Foot Note 58×NE 8 February 2019, p 148.The correct method to reflect any deferral in payment on the Mother’s part in the accounts would be to reflect $439,900 as owing to her for the land. While counsel for the Brothers argues that money is fungible, the proceeds from the sale of land were a specific amount. 56 Second, the Estate received significant dividends in 2012.59Foot Note 59×NE 7 February 2019, pp 113.The Mother could have been repaid the sum she had deferred receipt on at that point, but was not. 57 Third, the accounts do not reflect the Mother’s debt at all. Despite the JB Land being sold in 2011,60Foot Note 60×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 34.the $1m (or even the $439,900), owed to the Mother was not recorded in the accounts kept by the accounts clerk at [D] Company. This was despite the accounts having acknowledged the sale of the JB Land.61Foot Note 61×NE 8 February 2019, p 168; Defence dated 22nd August 2016, Exhibit 2.Indeed, no debt to the Mother was reflected even in the accounts annexed to the defence filed. The lack of any entry in the accounts supports the Sisters’ position that the Mother waived her entitlement altogether. 58 I therefore accept the Sisters’ position that the distribution of the JB Land proceeds after the second plaintiff’s clear request shows that the Mother had waived her entitlement to her portion of the residual Estate from the sale of the JB Land. I also agree that the $1m debt was created as an excuse to counter the Sisters’ allegation made in this suit that the Brothers had tarried unreasonably with regard to distributing the assets for an unreasonably lengthy period of time. 59 I should mention the expert evidence of Mr Sim on the $1m entry is of limited usefulness. He admitted that he did not take any steps to inquire into the circumstances of the purported debt to the Mother’s estate beyond the instructions of UVL.62Foot Note 62×NE 12 February 2019, p 62. 60 I thus find that the sum of $1m owing to the Mother’s estate should be falsified. As this sum has yet to be disbursed to the Mother’s estate, it is simply to be removed as an outstanding liability from the Estate account.",
        "The Eastern Mansion property": "61 The Sisters argue that the Brothers, in failing to consult them with regard to the affairs of the Eastern Mansion property and not attempting to rent it out, have failed to maximise its value.63Foot Note 63×Closing Submissions of the Plaintiffs, pp 46–47.They are thus seeking to surcharge the late Testator’s Estate account with the value of the rental income that would have been otherwise collected by the Testator’s Estate until the sale of the Eastern Mansion property, a sum of $84,600. This essentially constitutes a claim under the head of equitable compensation, which resembles common law damages in that it is awarded by way of compensation to the plaintiff for his loss (seeThenKhek Khoon and another v Arjun Permanand Samtani and another and other suits[2014] 1 SLR 245 at [105];Mothewat 17G–H). 62 The Brothers instead claim that it was pursuant to the Testator’s late wishes that they decided not to rent out the Eastern Mansion property. They allowed the Testator’s mistress to stay rent-free in the Eastern Mansion property until the house was sold.64Foot Note 64×NE 12 February 2019, pp 5–6; Closing Submissions for the 1st to 3rd Defendants, p 63.I note that the Brothers were unable to adduce any direct documentary evidence evincing the late Testator’s intention for his mistress to stay rent free in the Eastern Mansion property.65Foot Note 65×Closing Submissions for the 1st to 3rd Defendants, p 63. 63 Taking a holistic view of the evidence, I am of the opinion that the Brothers’ decision to allow Mdm Kok to reside there rent-free until the time of the en-bloc sale was a reasonable one. The Brothers adduced evidence that the late Testator had been paying for the utility bills for his mistress and her family since 1993 and he had issued a cheque of $150,000 dated 24 May 1996 to Mdm Kok.66Foot Note 66×UVL’s Affidavit, BAEIC Volume 1 Tab 2, p 24.. Mdm Kok’s daughter was an employee of one of the Companies at the time of his passing. These facts support the Brothers’ contention that the Testator wished for Mdm Kok to remain at the Eastern Mansion property rent-free until the en bloc sale. Importantly, I note that the Brothers would possess a financial incentive to rent out the Eastern Mansion property, as they too would have benefitted by virtue of their position as beneficiaries of the late Testator’s Estate. Their interests aligned with those of their Sisters on this issue. 64 Notwithstanding, the Brothers, as part of their responsibility as executors to keep beneficiaries informed, ought to have kept the Sisters apprised with regard to the affairs of the Eastern Mansion property, and they did not. I am of the view, nevertheless, that had they done so, the Sisters would in all probability have agreed with this course of action. Their Mother was still alive during this period, and even if they disagreed with the Testator’s preference, such a decision would have minimised embarrassment to their Mother. 65 It is not disputed that the standard that executors should be held to is that of good faith and reasonableness (seeADP v ADT[2014] 3 SLR 904 at [10]). Given the Testator’s wishes and their respect for their Mother, I find that it was reasonable for the Brothers to have refrained from renting out the Eastern Mansion property before its sale.",
        "Legal Fees incurred in OS 1241/2002": "66 The Sisters argue that the Brothers were not entitled to charge the legal fees incurred in OS 1241/2002 to the Estate.67Foot Note 67×Closing Submissions of the Plaintiffs, p 48.They claim that the Brothers’ refusal to provide the necessary information the Half-Siblings were seeking led to the latter’s application in OS 1241/2002, and the subsequent incurring of legal fees.68Foot Note 68×NE 12 February 2019, p 18.The Brothers, on the other hand, contend that the legal costs were an expense incurred on behalf of the Estate and should legitimately be deducted from the Estate monies.69Foot Note 69×Closing Submissions for the 1st to 3rd Defendants.Great emphasis was placed on the fact that the Estate purportedly did not have enough money at the time for the pecuniary disbursements of $500,000 to each Half-Sibling.70Foot Note 70×NE 11 February 2019, p 16; NE 4 April 2019, p 37. 67 I agree with the Sisters that the expenses for OS 1241/2002 were not reasonably incurred. The devise to the Half-Siblings was clear from the Will, and the Half-Siblings ought to have been informed when they could have been paid in a transparent manner as soon as practicable. After probate was issued, the Half-Siblings asked the Brothers for information through their solicitors from December 2000 onwards.71Foot Note 71×PCB Volume 6, p 4128.The Brothers did not answer satisfactorily, which led to OS 1241/2002 being filed on 4 September 2002, more than one and a half years after their first letter. As admitted by UVL during cross-examination, it was the Brothers’ refusal to be forthcoming with their Half-Siblings that led to OS 1241/2002 being taken out.72Foot Note 72×NE 11 February 2019, p 17; NE 12 February 2019, pp 17–18.This, too, was the reason that the court made the costs order that it did. 68 The Brothers’ argument that they did not have sufficient funds in 2000 misses the mark. It was their refusal to provide any information or explanation to their Half-Siblings that triggered OS 1241/2002. The legal fees of OS 1241/2002 were thus unnecessarily incurred by the Brothers, and cannot be considered as reasonable testamentary expenses that could otherwise be charged to the Estate’s funds under s 67(1) of the Probate and Administration Act (Cap 251, 2000 Rev Ed) (“Probate and Administration Act”). 69 I therefore find that the legal expenses of $5,500.65 incurred in OS 1241/2002 should be falsified.",
        "Whether the Brothers should be removed as executors": "70 The Brothers ask that they be relieved of any liability under s 60 of the Trustees Act (Cap 337, 2005 Rev Ed) (“Trustees Act”). Section 60 reads: Power to relieve trustee from personal liability 60.If it appears to the court that a trustee, whether appointed by the court or otherwise, is or may be personally liable for any breach of trust, whether the transaction alleged to be a breach of trust occurred before, on or after 1st September 1929, but has acted honestly and reasonably, and ought fairly to be excused for the breach of trust and for omitting to obtain the directions of the court in the matter in which he committed the breach, then the court may relieve him either wholly or partly from personal liability for the same. 71 It would be clear from my findings above that, aside from the issue of the Eastern Mansion property, the Brothers could not be said to have “acted honestly and reasonably” in committing the breaches, nor do the facts show any reason to excuse their breaches. Conversely, as a consequence of the various breaches of fiduciary duties discovered in the course of the accounts, the Sisters request to remove and replace the current executors. 72 The applicable test for whether an executor should be removed involves taking into account whether there has been improper administration of the estate. Thus, inJigarlalKantilal Doshi v Damayanti Kantilal Doshi(executrix of the estate of Kantilal Prabhulal Doshi, deceased)[2000] 3 SLR(R) 290, the Court of Appeal held at [12] that any evidence of misconduct on the part of the executors that demonstrates “undue and improper administration of the estate in total disregard of the interests of the beneficiaries” would be sufficient to revoke probate under s 32 of the Probate and Administration Act. 73 The Sisters had established, even at the time of summary judgment for the account to be taken, the Brothers’ failure to distribute assets despite the absence of a power to postpone distribution, and the failure to furnish any account of their actions to the beneficiaries for a lengthy period of years.73Foot Note 73×HCF/SUM 370/2016, Notes of Argument 10 April 2017, p 19.It was conceded at closing submissions that a regular account from the Brothers as fiduciaries, that the Sisters would have been entitled to as beneficiaries, would have included items such as the status of the Eastern Mansion property, the JB Land, and the shares of all the Companies. 74 The taking of accounts has also now established further breaches. Ignoring their core duty of loyalty and fidelity, the Brothers have omitted to distribute dividends and the shares held by the Estate without any reasonable justification.74Foot Note 74×NE 4 April 2019, p 66.At the time of the summary hearing, the Brothers contended that the market had not recovered from the financial crisis until 2004, which was when they distributed the pecuniary bequests to their Half-Siblings. Nonetheless, their obligation commenced with the grant of probate in 2000, and during cross-examination at the taking of accounts, they were unable to furnish any good reason why they had not distributed the Estate sharesin specie. Doing so would not have required cash. The Sisters’ component of the Estate shares was also small: they could have valued and then purchased the Sisters’ shares. Despite the small number of the shares, the substantial real estate portfolios the Companies held would have made the shares valuable. But whether in cash orin specie,no distribution was contemplated up to the time this suit was filed. Their contention was that of oversight because they were not professional executors. This contention is disingenuous considering that UVJ has held multiple senior corporate positions. The executors would well have known that it was incumbent on them to seek and follow legal advice, as they had for OS 1241/2002. Excuses proffered ranged from needing funds to maintain the JB Land, to requiring money to develop the JB Land, to engaging in a joint venture with a third party in respect of the JB Land. In truth, attempt at either form of distribution of the shares, whether in cash orin specie, would have alerted the Sisters to their share in a valuable stable of companies. The Brothers’ purpose was to keep their Sisters uninformed, in order to continue to extract value from the Companies in their capacity as directors. In so doing, they have acted in conflict with, and to the detriment of, their Sisters’ interest. A new executor, or executors, as the case may be, are appropriate to ensure a timely and proper realisation and distribution of the assets. 75 For clarity, and Mr Jeyaretnam SC also confirmed at the hearing, in view of the facts shown during the account which necessitate the removal and replacement of the Brothers as executors, clause 4 of the Order of Court (which requires the Brothers to pay to the Sisters the amount found to be due to them on the taking of such account) is no longer necessary. As the Estate is not yet fully administered, the beneficiaries have no equitable or beneficial interest in any particular asset comprised in the unadministered estate (seeWong Moy(administratrix of the estate of Theng Chee Khim, deceased)v Soo Ah Choy[1996] 3 SLR(R) 27 at [11]), theirs is the right in appropriate circumstances to institute action to protect the estate: seeFong Wai LynCarolyn v Kao Chai-Chau Linda and others[2017] 4 SLR 1018 at [8]–[16]. It should be for the new executor/s to call in the assets and then decide on the distribution.",
        "Conclusion": "76 In conclusion, I agree with the Sisters on the issue of the directors’ remuneration, the benefits in kind arising from occupation of [E] and [F] Shelford Road, the $1m entry as the Mother’s debt, the legal fees arising out of OS 1241/2002, and the removal of the present executors. 77 Regarding the replacement of the executors, the Sisters have put forward two alternative names. The Brothers, in view of their opposition, have not given thought to the names or whether there should be single or co-executors. I will hear counsel on the fresh executor/s to be appointed. I shall also hear counsel on interest, costs and the form of the judgment to be drawn up.  Valerie TheanJudge Philip Jeyaretnam SC and Reuben Gavin Peter (Dentons Rodyk & Davidson LLP) for the plaintiffs;N Sreenivasan SC and Lim Shu Fen (K&L Gates Straits Law Practice LLC) for the first to third defendants;Dr G Raman (Withers KhattarWong LLP) for the fourth to sixth defendants."
    }
}