{
    "case_title": "Eastern Resource Management Services Ltd vChiu Teng Construction Co Pte Ltd",
    "ncitation": "[2019] SGHC 19",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1 The plaintiff, Eastern Resource Management Services Ltd (“ERMS”), commenced Suit No 855 of 2014 (“S 855/2014”) against the defendant, Chiu Teng Construction Co Pte Ltd (“Chiu Teng”), for breach of contract. Before this court, ERMS claims payment of 50% of certain fees collected by Chiu Teng (through use of another company) from June 2012 to August 2014,1Foot Note 1×See Statement of Claim (Amendment No 5) (“SOC”) at pp 6–7.with interest, or alternatively, for damages to be assessed. 2 S 855/2014 was first decided by Edmund Leow JC after hearing the trial over two days in October 2015. Thereafter, ERMS appealed in Civil Appeal No 34 of 2016 against part of the decision of Leow JC. On 25 September 2017, the Court of Appeal allowed the appeal and set aside the judgment of Leow JC, except in relation to the costs ordered in respect of an amendment by ERMS of its statement of claim. The Court of Appeal remitted the claim of ERMS in S 855/2014 for a re-trial in the High Court. The Court of Appeal also gave directions for ERMS to file its amended statement of claim and for Chiu Teng to file its amended defence. 3 I heard the re-trial over three days and reserved judgment. The trial was not bifurcated.2Foot Note 2×Notes of Evidence of 31 July 2018 (“NEs 31/07/18”) at p 4 lines 19–22.References to “the trial” are to this re-trial before me unless otherwise stated.",
        "Background": "4 I set out the background facts as far as they were relevant to the parties’ allegations in this suit. 5 Chiu Teng is a company incorporated in Singapore. At the material time, Chiu Teng held a licence from the Building and Construction Authority (“BCA”) to operate an overseas test centre (“the OTC”) in Bangladesh to conduct the requisite trade tests for various trades for workers in Bangladesh to determine their fitness to work in the Singapore construction industry.3Foot Note 3×See SOC at para 2; Defence (Amendment No 3) (“Defence”) at para 2.The OTC was owned and managed by Bangladesh Foundry and Engineering Works Ltd (“BFEW”), a company incorporated in Bangladesh. The OTC usually conducted the trade tests monthly. Workers who passed the trade test could then apply for an in-principle approval letter from the Singapore government to work in Singapore. With the licence from BCA, the registered licensee Chiu Teng was also allowed to register workers with BCA for testing at the OTC.4Foot Note 4×See Reply at para 3. 6 ERMS is a company incorporated in Bangladesh. Chiu Teng appointed ERMS to be its agent in carrying out its responsibilities as the OTC licensee in Bangladesh.5Foot Note 5×See SOC at para 4; Defence at para 2. 7 Both ERMS and BFEW had training centres in Bangladesh which trained workers for various jobs in the construction industry and prepared them for testing at the OTC.",
        "2008 JVA": "",
        "May 2011 Agreement": "20 From early 2011, BCA imposed, for the first time, a quota on the number of workers who could be tested for each trade at each overseas test centre each month.26Foot Note 26×See SOC at para 9.This resulted in ERMS, Chiu Teng and BFEW meeting on 14 May 2011 and agreeing that until ERMS and BFEW furnished a more detailed proposal, the quota for the number of workers who could be tested for each of five trades at the OTC was to be allocated as follows: 30% to ERMS, 30% to Chiu Teng and 40% to BFEW.27Foot Note 27×Defendant’s Bundle of Documents (“DB”) 30.This agreement (“May 2011 Agreement”) was recorded in the minutes of the meeting. The quotas allocated to ERMS and BFEW were for the workers trained at the training centres of ERMS and BFEW respectively, and the quota allocated to Chiu Teng was for direct testing workers.",
        "June 2011 Agreement": "",
        "July 2012 Agreement": "108 I consider the next issue as to whether following the July 2012 Agreement, ERMS was entitled to a share of the direct testing fees from June 2012 to August 2014. 109 Chiu Teng pleaded that the July 2012 Agreement superseded the 2008 JVA, the June 2011 Agreement and any other agreements between Chiu Teng and ERMS, such that there were no further sums owing by Chiu Teng to ERMS.130Foot Note 130×Defence at para 11.Chiu Teng thus submitted that ERMS cannot revert to the 2008 JVA at its convenience.131Foot Note 131×Defendant’s Closing Submissions at para 85. 110 On the other hand, ERMS submitted that the July 2012 Agreement was only for the settling of accounts for the period from April 2011 to May/June 2012 and since the June 2011 Agreement was not enforceable (whether because of duress or some other reason), ERMS was still entitled to its share of direct testing fees under the 2008 JVA from June 2012 to August 2014.132Foot Note 132×See Plaintiff’s Closing Submissions at para 39; Plaintiff’s Reply Submissions at para 12.ERMS submitted that Chiu Teng was unable to show otherwise, whether through some admission which had been made by ERMS or by Chiu Teng.133Foot Note 133×See Plaintiff’s Closing Submissions at para 38. 111 To recapitulate, under the June 2011 Agreement, ERMS was no longer entitled to a share of the direct testing fees with effect from the April 2011 testing. The July 2012 Agreement thereafter only allowed ERMS to have a share of the direct testing fees from April 2011 to May 2012,ie, $100 for each direct testing worker (see [34] above). The minutes for the meeting which evidenced the July 2012 Agreement were silent on the question as to whether ERMS was to have any share of the direct testing fees after May 2012. 112 ERMS did not refer the court to instances where ERMS had asserted to Chiu Teng after 6 July 2012 that ERMS was entitled to a share of the direct testing fees, save for an email Monsur had sent to Cedric Ng on 14 December 2013.134Foot Note 134×See Plaintiff’s Closing Submissions at para 13; 1AB 166.When cross-examined on this email, Cedric Ng accepted that Monsur was conveying in his email that he wanted the 2008 JVA to be followed so that ERMS could receive a 50% share of the direct testing fees.135Foot Note 135×See NEs 02/08/18 at p 43 lines 31–32, p 44 line 1.This seems to be the earliest piece of documentary evidence provided to the court in the Agreed Bundle of Documents in which ERMS asserted to Chiu Teng an entitlement to a share of the direct testing fees after May 2012. However, this email was written much later in December 2013, almost1.5 yearsafter the July 2012 Agreement had already been entered into. There was no explanation by ERMS why it took so long to claim a share of the direct testing fees from June 2012 if it had genuinely believed that the July 2012 Agreement did not preclude it from claiming such a share. In my view, its silence for so long supported Chiu Teng’s position that the parties had agreed, under the July 2012 Agreement, that ERMS would have no further share in such fees. 113 It seems to me that the purpose of the July 2012 Agreement was to settle the disputes between the parties. It would have been strange to settle the question of ERMS’ share of direct testing fees up to May 2012 only and then continue to dispute ERMS’ share from June 2012. It was more likely that the $100 per direct testing worker granted to ERMS up to May 2012 was the agreed sum to resolve once and for all ERMS’ share of direct testing fees. 114 I therefore find that even if the June 2011 Agreement was not enforceable, the parties had agreed under the July 2012 Agreement that ERMS was not entitled to any share of the direct testing fees from June 2012 to August 2014.",
        "After the July 2012 Agreement": "35 The parties were agreed that from June 2012 to August 2014, the OTC conducted trade tests for a total of 2,248 direct testing workers.50Foot Note 50×See NEs 02/08/18 at p 13 lines 24–26.The OTC did not conduct anymore trade tests for direct testing workers thereafter. 36 On 27 October 2017, a winding up order was made against CTBF and the liquidation has since been completed.51Foot Note 51×See POS at para 27. 37 The crux of ERMS’ case in this suit was that ERMS was not paid any share of the direct testing fees for these 2,248 direct testing workers. Alleging that Chiu Teng was consequently in breach of the 2008 JVA,52Foot Note 52×See SOC at para 16; Plaintiff’s Closing Submissions at paras 48–49.ERMS claims from Chiu Teng a 50% share of these direct testing fees, which ERMS submits to be $387,780 (ie, 50% x $345 x 2,248), with interest.53Foot Note 53×See formula in SOC at para 18.",
        "Issues": "38 I summarise the submissions of ERMS and Chiu Teng. 39 ERMS’ position was that the 2008 JVA was still binding on the parties as at August 2014, and that under the 2008 JVA, the direct testing fee of $345 per direct testing worker was to be divided equally between ERMS and Chiu Teng. ERMS thus claims from Chiu Teng a 50% share of the direct testing fees for the 2,248 direct testing workers tested from June 2012 to August 2014 at the OTC. ERMS argued that the June 2011 Agreement was not enforceable because (i) it was tainted with illegality for a contravention of BCA guidelines, (ii) Chiu Teng did not provide any or sufficient consideration, and/or (iii) the June 2011 Agreement was procured by economic duress by Cedric Ng on Monsur. As for the July 2012 Agreement, ERMS submitted that it was only in respect of the direct testing fees from April 2011 to May 2012, and not direct testing fees thereafter. 40 On the other hand, Chiu Teng’s position was that the 2008 JVA had first been superseded by the June 2011 Agreement, which was in turn superseded by the July 2012 Agreement. Chiu Teng submitted that the June 2011 Agreement was enforceable, and that the July 2012 Agreement was a full and final settlement of all claims the parties had against each other. Thus, as at August 2014, the 2008 JVA was no longer binding on the parties. ERMS was not entitled to any share of the direct testing fees, except for the direct testing fees of $100 each for 868 direct testing workers from April 2011 to May 2012 which Chiu Teng agreed to under the July 2012 Agreement and which was taken into account to reach the sum of $129,709.02 that ERMS undertook to pay CTTC under the July 2012 Agreement (see [31] above). In the alternative, Chiu Teng pleaded that the 2008 JVA was not enforceable because it was tainted with statutory illegality as ERMS and BFEW both contravened s 22A of the Employment of Foreign Manpower Act (Cap 91A, 2009 Rev Ed) (“EFMA”). Alternatively, Chiu Teng pleaded that if the June 2011 Agreement was not enforceable because it was tainted with illegality for a contravention of BCA guidelines, the 2008 JVA should also not be enforceable for a similar illegality. 41 The following issues thus arose for consideration: (a) in relation to the 2008 JVA: (i) whether it was tainted with illegality and was not enforceable; (ii) how the direct testing fee of $345 per direct testing worker was to be divided between ERMS and Chiu Teng; and (iii) what the contract duration for the 2008 JVA should be; (b) in relation to the June 2011 Agreement: (i) whether it was tainted with illegality and was not enforceable; (ii) whether Chiu Teng provided sufficient consideration; and (iii) whether the June 2011 Agreement was procured by economic duress by Cedric Ng on Monsur; (c) whether following the July 2012 Agreement, ERMS was entitled to a share of the direct testing fees from June 2012 to August 2014; and (d) how much was collected from June 2012 to August 2014 from the 2,248 direct testing workers. 42 I mention first that if I find that the June 2011 Agreement was enforceable and the July 2012 Agreement only provided that ERMS had a share of the direct testing fees from April 2011 to May 2012 and not thereafter, the sub-issues in relation to the 2008 JVA (see [41(a)(i)]–[41(a)(iii)] above) become moot. I nevertheless address the above issuesseriatim.",
        "Illegality": "79 Moving on to the June 2011 Agreement, the first issue was that of illegality in respect of a contravention of BCA guidelines. I have considered this same issue in relation to the 2008 JVA. 80 Under cl 2 of the June 2011 Agreement, ERMS would have to pay CTTC $600 for every worker trained at ERMS’ training centre who passed the trade test at the OTC with effect from the April 2011 testing (see [25] above). ERMS thus argued that the June 2011 Agreement was not enforceable because it was tainted with illegality since Chiu Teng required ERMS to collect $600 from every such worker, when BCA only allowed the OTC to collect a test fee of $350 at that time.90Foot Note 90×SOC at paras 13(a)–13(c).ERMS also argued that Chiu Teng contravened public policy by extorting or attempting to extort more than what was permitted by BCA.91Foot Note 91×SOC at para 13(d). 81 As I have found earlier in relation to the 2008 JVA (see [63]–[64] above), I find that non-compliance with the amount of test fee BCA allowed the OTC to collect did not constitute a contravention of a statutory provision. Also, such non-compliance did not necessarily mean that BCA would review or revoke the endorsement of Chiu Teng to conduct testing at the OTC. The June 2011 Agreement also did not fall foul of one of the established heads of common law public policy because of such non-compliance. I thus find that the June 2011 Agreement was not tainted with illegality or void by virtue of public policy such that it was not enforceable. 82 In any case, even if non-compliance with the amount of test fee BCA allowed the OTC to collect amounted to some illegality, this was only with respect to cl 2 of the June 2011 Agreement. Such illegality would not have affected cl 1 of the June 2011 Agreement, under which ERMS would not be receiving a share of the direct testing fees with effect from the April 2011 testing (see [23] above). ERMS’ agreement not to share in the direct testing fees under cl 1 had not been given in exchange for its obligation to pay CTTC under cl 2. Thus, only cl 2 would have been unenforceable.",
        "Division of direct testing fees": "67 The next issue was how the direct testing fee of $345 per direct testing worker was to be divided between ERMS and Chiu Teng under the 2008 JVA (see [14] above). ERMS contended that the direct testing fee was to be divided equally,ie, 50% or $172.50 each for ERMS and Chiu Teng.76Foot Note 76×SOC at para 6.ERMS made the point that this was the intention of the parties when the 2008 JVA was signed.77Foot Note 77×POS at paras 37–38. 68 On the other hand, Chiu Teng submitted that cl 8 of “Other Points” of the 2008 JVA (see [13] above) should be interpreted as follows:78Foot Note 78×See Defendant’s Closing Submissions at p 7 (heading “Interpretation of Clause 8”).because the direct testing fee of $345 had been collected by CTBF, and ERMS had been paid 49% of the net profits of CTBF through dividend payments from 2008 to April 2011, ERMS was only entitled to 49% of CTBF’s profits, through distributions of dividends, if any (see [14] and [17] above).79Foot Note 79×See also Defendant’s Closing Submissions at paras 30–32. 69 In this regard, Chiu Teng argued that ERMS should be claiming (or should have been claiming) against CTBF and not Chiu Teng, as ERMS should be advancing its claims, if any, as a shareholder against CTBF.80Foot Note 80×See Defendant’s Closing Submissions at para 40.Chiu Teng submitted that both the rights of ERMS and Chiu Teng in relation to CTBF were those accorded to them under the Companies Act (Cap 50, 2006 Rev Ed) and under CTBF’s memorandum and articles of association.81Foot Note 81×Defence at para 5.However, ERMS chose to omit CTBF as a defendant.82Foot Note 82×See Defendant’s Closing Submissions at para 44.Where ERMS is claiming a share of the direct testing fees for the 2,248 direct testing workers tested from June 2012 to August 2014 at the OTC, Chiu Teng added that since CTBF’s profits were distributed by way of dividends and none were declared after 2012, ERMS had no valid claim.83Foot Note 83×See Defendant’s Closing Submissions at para 39. 70 I make two preliminary points on the pleadings. First, Chiu Teng did not plead that it was incorrectly brought in as a defendant.84Foot Note 84×See Plaintiff’s Reply Submissions at para 5.I accept that ERMS was not suing as a shareholder of CTBF but against Chiu Teng for breach of the 2008 JVA.85Foot Note 85×Plaintiff’s Reply Submissions at para 4. 71 Second, to the extent that ERMS sought for this court to imply a term that the direct testing fee of $345 was to be divided between ERMS and Chiu Teng equally,86Foot Note 86×Plaintiff’s Reply Submissions at para 4.ERMS did not plead a case for such a term to be implied.87Foot Note 87×See Defendant’s Closing Submissions at para 34. 72 I find that cl 8 of “Other Points” of the 2008 JVA can be construed and interpreted in line with the common intention of ERMS and Chiu Teng when the 2008 JVA was signed, that the direct testing fee of $345 was to be divided between ERMS and Chiu Teng equally. Cedric Ng had drafted the 2008 JVA and gave evidence at the trial that under this provision, “[t]he remainder amount of $345.00 will be divided between [Chiu Teng] and ERMS” meant that the sum of $345 was to be divided equally.88Foot Note 88×See NEs 02/08/18 at p 28 lines 29–30, p 30 lines 14–18.Monsur’s evidence was also that it was understood between the parties that this sum would be divided equally.89Foot Note 89×Seeeg, NEs 31/07/18 at p 42 lines 3–4.Therefore, I find that under the 2008 JVA, the direct testing fee of $345 was to be divided between ERMS and Chiu Teng equally. 73 I am aware that from 2008 to April 2011, ERMS was not in fact paid a 50% share of the direct testing fee of $345. Instead, during that period, CTBF had collected the direct testing fee of $345 and ERMS was paid 49% of the net profits of CTBF through dividend payments (see [17] above). ERMS had agreed to receiving such dividend payments as its share of the direct testing fee. 74 In the light of the common intention of ERMS and Chiu Teng when the 2008 JVA was signed that the direct testing fee of $345 was to be divided between them equally, there is no reason in this case to use the subsequent conduct of how the direct testing fee was in fact collected and distributed to interpret cl 8 of “Other Points” of the 2008 JVA, even if a court may rely on subsequent conduct to interpret a contractual provision. 75 Chiu Teng did not plead that if under the 2008 JVA the direct testing fee of $345 was to be divided between ERMS and Chiu Teng equally, this had been varied by oral agreement as evidenced by subsequent conduct. Neither did Chiu Teng plead estoppel by convention. 76 It bears mentioning that the difference between ERMS’ claim of a 50% share of the direct testing fees for the 2,248 direct testing workers (see [37] above) and a 49% share of the same is $7,755.60 (ie,1%x $345 x 2,248).",
        "Contract duration": "77 As for the issue of the contract duration of the 2008 JVA, I have mentioned that the 2008 JVA only had two clauses pertaining to the duration of the 2008 JVA,ie, cll 10 and 11 of “Other Points”, set out at [18] above. 78 Cedric Ng had drafted the 2008 JVA, and this was done without the assistance of any lawyer (see [8] above). It could not have been the parties’ intention that the 2008 JVA could only be terminated on 31 March 2009 (cl 10) or on the expiry, revocation or suspension of BCA’s endorsement of the OTC (cl 11). I do not find that cll 10 and 11 were exhaustive with respect to how the 2008 JVA might be terminated. This is relevant as I will elaborate later at [85] below.",
        "Consideration": "83 ERMS also argued that Chiu Teng did not provide any or sufficient consideration for the June 2011 Agreement.92Foot Note 92×SOC at para 10. 84 On the other hand, Chiu Teng submitted that it had provided consideration for the June 2011 Agreement as follows:93Foot Note 93×Defence at para 7. (a) Chiu Teng continued with the 2008 JVA despite the change in circumstances brought about by BCA’s imposition of quotas on the number of workers who could be tested at each overseas test centre each month (see [20] above); (b) Chiu Teng allocated 60% of the monthly quota to ERMS and BFEW to share in any manner as they deemed fit, as opposed to the original arrangement under the May 2011 Agreement where ERMS had 30% of the monthly quota, Chiu Teng had 30% and BFEW had 40% (see [20] above); and (c) ERMS no longer needed to source for direct testing workers on behalf of Chiu Teng. 85 I disagree with the submission of ERMS that the continuation of the 2008 JVA could not amount to consideration for a new agreement.94Foot Note 94×Plaintiff’s Closing Submissions at para 22.As I have found at [78] above, the 2008 JVA did not exhaustively stipulate the circumstances under which the 2008 JVA might be terminated. I find that Chiu Teng’s decision to continue with the 2008 JVA, in so far as its terms were not varied by the June 2011 Agreement, could and did constitute consideration for the June 2011 Agreement. 86 On the other hand, I do not find that Chiu Teng’s allocation of 60% of the monthly quota to ERMS and BFEW constituted consideration for the June 2011 Agreement. Where the quota limited the number of workers who could be tested at the OTC each month, ERMS was limited in respect of the number of workers from its training centre that it could send for testing at the OTC. Compared with the May 2011 Agreement where ERMS had 30% and BFEW had 40% of the quota, it is not apparent how a combined quota of 60% for ERMS and BFEW conferred a benefit on ERMS. 87 As for Chiu Teng’s third argument that ERMS no longer needed to source for direct testing workers on behalf of Chiu Teng, I find that there was insufficient evidence to sustain such an argument. 88 As mentioned at [12] above, Cedric Ng gave evidence that ERMS had ‘recruited’ direct testing workers for Chiu Teng until the April 2011 testing, but Chiu Teng itself ‘recruited’ these direct testing workers from the April 2011 testing and onwards. 89 However, during cross-examination, Monsur gave evidence that he never sourced for direct testing workers on behalf of Chiu Teng and that it was not the responsibility of ERMS/Monsur to do so.95Foot Note 95×See NEs 02/08/18 at p 6 lines 10–13, p 9 lines 1–4.Monsur did nevertheless liaise on behalf of Chiu Teng with employment agents who would bring direct testing workers for testing at the OTC, and Monsur stated that he did this both before and after entering into the June 2011 Agreement.96Foot Note 96×See NEs 02/08/18 at p 6 lines 21–26, p 9 lines 6–17. 90 The written agreement for the 2008 JVA itself did not impose on ERMS any obligation to recruit or source for direct testing workers on behalf of Chiu Teng.97Foot Note 97×See 1AB 3–6.Given the evidence adduced before this court, I am unable to prefer the account given by Chiu Teng over that given by ERMS. 91 I add that I do not accept the submission by ERMS that Chiu Teng’s third argument on consideration was an afterthought simply because it had not been pleaded for the trial before Leow JC.98Foot Note 98×See Plaintiff’s Closing Submissions at para 25.Although it had not been pleaded, Cedric Ng had already given the same evidence mentioned at [88] above in his AEIC for the trial before Leow JC.",
        "Duress": "92 ERMS also pleaded that the June 2011 Agreement was not enforceable as it was procured by economic duress by Cedric Ng on Monsur.99Foot Note 99×SOC at para 11.ERMS pleaded that, on or about 15 June 2011, Cedric Ng had threatened Monsur that unless Monsur agreed to the June 2011 Agreement, Chiu Teng would stop the registration for the July 2011 testing at the OTC of the workers trained at the training centres of ERMS and BFEW.100Foot Note 100×SOC at para 11(a).The consequences of such an alleged threat have been described at [27] above. 93 I mention that while Monsur’s evidence was that Cedric Ng and two other representatives of Chiu Teng,ie, CH Ng and Kor, had made the same threat to Monsur,101Foot Note 101×Seeeg, Monsur’s AEIC at para 13; NEs 01/08/18 at p 27 lines 5–6.ERMS’ pleading mentioned only Cedric Ng as the person who had threatened Monsur. There was no dispute that CH Ng and Kor had been present at the meetings with Monsur first on 15 June 2011 or 16 June 2011, and second on 17 June 2011. However, neither side chose to call CH Ng or Kor as a witness. 94 Chiu Teng submitted that neither Cedric Ng nor any of Chiu Teng’s employees, officers, servants or agents exerted any form of duress on Monsur when he entered into the June 2011 Agreement.102Foot Note 102×Defence at para 8.Cedric Ng denied that he made the alleged threat.103Foot Note 103×Cedric Ng’s AEIC at para 19.Instead, Chiu Teng argued that ERMS had regretted entering into the June 2011 Agreement after it had been signed.104Foot Note 104×Defendant’s Closing Submissions at para 55. 95 I address first ERMS’ argument that Chiu Teng had chosen not to cross-examine Monsur on his account of the two June 2011 meetings.105Foot Note 105×Plaintiff’s Closing Submissions at para 12.During the trial, while cross-examining Monsur, counsel for Chiu Teng informed the court that Chiu Teng’s case was that it had never made the alleged threat to Monsur.106Foot Note 106×See NEs 01/08/18 at p 24 line 21.Counsel for Chiu Teng then referred to two letters dated 17 October 2011 and 20 October 2011 respectively which were sent by ERMS’ then lawyers to Chiu Teng. Monsur gave evidence that ERMS had instructed its then lawyers to send the letter dated 17 October 2011 because of a disagreement over the May 2011 Agreement concerning the quotas on the number of workers who could be tested at the OTC.107Foot Note 107×See NEs 01/08/18 at p 30 lines 13–23; DB 40–41.The subsequent letter dated 20 October 2011 was sent under ERMS’ instructions to withdraw the earlier letter.108Foot Note 108×See DB 42.Counsel for Chiu Teng then asked why Monsur/ERMS had not asked the lawyers to send Chiu Teng a letter to complain that Monsur had been under duress when he entered into the June 2011 Agreement.109Foot Note 109×See NEs 01/08/18 at p 30 lines 24–27.Monsur’s answer was that Chiu Teng had promised to review the June 2011 Agreement and there was an ongoing discussion on this at that time110Foot Note 110×See NEs 01/08/18 at p 30 lines 28–30.(for a similar point, see [29] above). Thereafter, counsel for Chiu Teng put Chiu Teng’s case to Monsur that there was actually no duress by Chiu Teng when Monsur entered into the June 2011 Agreement.111Foot Note 111×NEs 01/08/18 at p 30 lines 31–32.I find that counsel for Chiu Teng had sufficiently put Chiu Teng’s case on duress to Monsur, although counsel might not have expressly put it to Monsur that Cedric Ng did not make the alleged threat. 96 With regard to whether the alleged threat was made, I have mentioned that the undisputed circumstantial fact was that Chiu Teng had in fact registered the workers trained at the training centres of ERMS and BFEW on 17 June 2011, which was the last day for registration of workers for the July 2011 testing at the OTC, and Chiu Teng had done so after the June 2011 Agreement was entered into (see [26] above). 97 I am not convinced that Cedric Ng made the alleged threat to Monsur. Even if Cedric Ng made the alleged threat and it amounted to illegitimate pressure, I am not persuaded that such pressure overwhelmed Monsur’s will such that he entered into the June 2011 Agreement involuntarily. 98 First, Monsur referred the court to several of his emails to Chiu Teng from September 2011 to June 2012 which he claimed showed that he had protested against the June 2011 Agreement.112Foot Note 112×See 1AB 119–146.I note that the earliest of these emails was sent on 22 September 2011.113Foot Note 113×1AB 119.This wasthree monthsafter the June 2011 Agreement had already been entered into. There was no mention in the earliest email of any threat or pressure from Chiu Teng. 99 Second, Monsur had sent an email to Cedric Ng and BFEW on 12 October 2011 stating, “As I will not enjoy CTBF profit from April 2011, and I decide I will resigne [sic] from the company.”114Foot Note 114×1AB 126.During cross-examination, Monsur sought to explain that the moneys (ie, the direct testing fees) were no longer being collected by CTBF but were being collected by CTTC instead (see [24] above). However, Monsur agreed that he did not mention in this particular email that he was still entitled to receive profits (which had their source from the direct testing fees), whether they would come through CTBF or CTTC.115Foot Note 115×See NEs 01/08/18 at p 22 lines 30–32.I find that this email confirmed that ERMS/Monsur had voluntarily entered into the June 2011 Agreement under which ERMS would not share in the direct testing fees. That was why he decided to resign from CTBF. 100 Third, in none of these emails that Monsur sent to Chiu Teng from September 2011 to June 2012 do I find any mention of the alleged threat that Chiu Teng would stop the registration of workers for testing. During the trial, Monsur himself testified that he did not state directly in these emails that he had been pressured by Chiu Teng to enter into the June 2011 Agreement,116Foot Note 116×NEs 01/08/18 at p 1 lines 14–17.but instead stated that he only followed the 2008 JVA or stated that he requested Chiu Teng to honour the 2008 JVA and not any other agreement.117Foot Note 117×NEs 01/08/18 at p 2 lines 27–29.I observe that in Monsur’s email sent to Cedric Ng on 24 November 2011, Monsur stated “again I request do not threat to stop transfer letter” [original emphasis omitted],118Foot Note 118×1AB 135.but this did not refer to a threat to stop the registration of workers for testing. It referred to withholding the transfer letter which would prevent a worker who had passed the trade test from travelling to Singapore.119Foot Note 119×See POS at para 44(a); 1AB 134. 101 More importantly, Monsur did not say in any of these emails that, notwithstanding what he had signed in June 2011, ERMS would still be entitled to revenue from CTBF (or otherwise) or a share of the direct testing fees. This was with the exception of one email dated 29 June 2012,120Foot Note 120×1AB 145–146.but it was disputed as to whether this email was even sent to or received by Chiu Teng. This email was sent by Monsur but the addressee was Monsur himself. During the trial, Monsur said that he gave a copy of this email to Chiu Teng (it was unclear when),121Foot Note 121×See NEs 01/08/18 at p 15 lines 25–28.but Cedric Ng said that Chiu Teng did not receive this email (at the material time).122Foot Note 122×See NEs 02/08/18 at p 43 lines 15–21.In any event, while Monsur in this email seemed to deny that the June 2011 Agreement was binding and seemed to assert that ERMS was entitled to share in the direct testing fees, this email was written much later in June 2012. This wasa yearafter the June 2011 Agreement had already been entered into, and does not assist ERMS in showing that it had not voluntarily entered into the June 2011 Agreement under which ERMS would not share in the direct testing fees. 102 During the trial, Monsur testified that he can read and understand English.123Foot Note 123×See NEs 31/07/18 at p 42 lines 11–23.For instance, Monsur confirmed that he read and understood the 2008 JVA without the help of any interpretation. Monsur also gave part of his oral evidence in English.124Foot Note 124×See NEs 31/07/18 at p 43 lines 3–16.In the light of this, I find that Monsur had the ability to express himself in English, including using the word “threat”, if he had wished to state directly in his emails that he had been pressured by Chiu Teng to enter into the June 2011 Agreement as a result of the alleged threat that Chiu Teng would stop the registration of workers for testing. The fact that Monsur did not make any mention of the alleged threat suggests that Cedric Ng did not make such a threat to Monsur or that the alleged threat, if any, did not amount to pressure amounting to the compulsion of Monsur’s will. During the trial, Monsur was also able to insist in English on ERMS’ claim for a share of the direct testing fees. The fact that Monsur did not do so in his emails (until June 2012) suggests that he had entered into the June 2011 Agreement voluntarily, knowing that under this agreement, ERMS would not be receiving a share of the direct testing fees with effect from the April 2011 testing. 103 Fourth, I do not accept the submission of ERMS that it had protested against the June 2011 Agreement by not complying with the obligation provided for in the June 2011 Agreement to pay CTTC $600 for every worker trained at ERMS’ training centre who passed the trade test at the OTC (see [25] above).125Foot Note 125×See Plaintiff’s Closing Submissions at para 19. 104 During the trial, counsel for ERMS had initially stressed, particularly when re-examining Monsur, that ERMS had refused to pay the $600 for every such worker and that this supported its position that it was not bound by the June 2011 Agreement.126Foot Note 126×Seeeg, NEs 02/08/18 at pp 10–12.Unfortunately for ERMS, it was not accurate to say that it had refused to pay the $600 for every such worker. Cedric Ng had explained during cross-examination that under the July 2012 Agreement, the amount that ERMS was owing to Chiu Teng as at June 2012 included the sum of $600 for every such worker under the June 2011 Agreement (see [33] above). Counsel for ERMS then informed the court that ERMS accepted Cedric Ng’s evidence on this point.127Foot Note 127×See NEs 02/08/18 at p 81 lines 28–31, p 82 line 4. 105 At that time, counsel for ERMS did not then say that ERMS’ payment of $600 for every such worker was “in conjunction with” Chiu Teng agreeing to pay $100 for each direct testing worker from April 2011 to May 2012 under the July 2012 Agreement (see [34] above). Neither was there any evidence from ERMS to this effect. This point was only made after the trial in ERMS’ closing submissions.128Foot Note 128×Plaintiff’s Closing Submissions at para 14.In fact, this is a different point from that made by ERMS in its opening statement at para 71, where ERMS had stated that Chiu Teng decided to pay the $100 for each direct testing worker “at [Chiu Teng’s] own volition”.129Foot Note 129×See also POS at paras 53–54. 106 I find that the June 2011 Agreement was not procured by economic duress by Cedric Ng on Monsur. 107 I therefore find that the June 2011 Agreement was enforceable between ERMS and Chiu Teng. Under the June 2011 Agreement, ERMS would no longer be entitled to a share of the direct testing fees with effect from the April 2011 testing. This was subject to any further contractual agreement otherwise.",
        "Direct testing fees from June 2012 to August 2014": "115 For completeness, I will also address the issue of the amount of direct testing fees collected from June 2012 to August 2014 from the 2,248 direct testing workers. 116 Chiu Teng pleaded that for this period, it had only collected $350 per direct testing worker in 2012, and $50 per direct testing worker in 2013 and 2014.136Foot Note 136×Defence at para 12(d).ERMS did not seem to dispute that Chiu Teng had only collected $350 per direct testing worker in 2012,137Foot Note 137×See POS at para 70.but submitted that Chiu Teng did not substantiate its assertion that it had only collected $50 per direct testing worker in 2013 and 2014.138Foot Note 138×See Plaintiff’s Closing Submissions at para 40. 117 During the trial, Cedric Ng gave evidence that Chiu Teng collected $350 per direct testing worker from June 2012 to September 2012, and $50 per direct testing worker from October 2012 to 2014.139Foot Note 139×Exhibit D2.Cedric Ng relied on copies of deposit slips showing payments of sums into CTTC’s bank account.140Foot Note 140×See Cedric Ng’s Supplemental AEIC at para 18 and exhibit marked CN-33.However, these copies of deposit slips did not evidence the amount that was collected per direct testing worker, whether $350 or $50. Chiu Teng did not produce any invoices that CTTC had issued to collect $50 per direct testing worker, despite having access to them,141Foot Note 141×See NEs 02/08/18 at p 95 lines 13–19.and did not call Kor, who was the director of CTTC, to give evidence on the same. 118 I thus find that Chiu Teng has not proven that it only collected $350 per direct testing worker from June 2012 to September 2012, and $50 per direct testing worker from October 2012 to 2014. If I were wrong in finding that the 2008 JVA was no longer binding on the parties, I would have found that ERMS was entitled to 50% of a direct testing fee of $345 for each of the 2,248 direct testing workers who tested at the OTC from June 2012 to August 2014.",
        "Conclusion": "119 For the foregoing reasons, I dismiss ERMS’ claim against Chiu Teng. 120 I will hear the parties on costs. Woo Bih LiJudge Andrew John Hanam (Andrew LLC) for the plaintiff;Lee Mei Yong Debbie and Wong Qiao Ling Sharon (ECYT Law LLC) for the defendant."
    }
}