{
    "case_title": "Liu Yanzhe and another vTan Eu Jin and others",
    "ncitation": "[2019] SGHC 67",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "Introduction": "1 In March 2014, the plaintiffs invested a sum of $1m with the third defendant in what I shall call the “Autostyle investment”.1Foot Note 1×Certified Transcript dated 30 April 2018, page 16, lines 22–28.Under the terms of the Autostyle investment, the plaintiffs were to be repaid the $1m in March 2015 with interest payable in the meantime at the rate of 15% per annum in two bi-annual tranches. The plaintiffs did receive both interest payments on the Autostyle investment. But the plaintiff’s capital sum of $1m was not repaid when due in March 2015 or at all. In May 2015, the plaintiffs were repaid $103,740 out of their $1m investment.2Foot Note 2×Affidavit of evidence in chief of the second plaintiff, paragraph 42 and page 135.They have therefore suffered a net loss of $896,260. 2 In this action, the plaintiffs bring a claim in fraud against all four defendants, seeking to recover from them damages in the sum of $896,260 plus interest and costs. Of the four defendants, only the fourth defendant has defended the plaintiffs’ claim all the way to judgment. 3 Following a trial before me, I have dismissed the plaintiffs’ claim against the fourth defendant. The plaintiffs have appealed against that decision.3Foot Note 3×Notice of appeal dated 24 May 2018.I now set out my grounds.",
        "The parties": "4 The plaintiffs are husband and wife. They run what is by all accounts a successful construction and real estate business.4Foot Note 4×Certified Transcript dated 18 August 2017, page 58, lines 16–17.The second plaintiff is also known as “Merry Ma”. 5 Because it is only the plaintiffs’ claim against the fourth defendant which is the subject-matter of these grounds of decision, it is convenient to introduce the defendants in reverse order. The three other defendants in this action are each the subject of formal insolvency proceedings.5Foot Note 5×Certified Transcript dated 2 April 2018, page 1 line 22 to page 4 line 24; HC/ORC 1061/2017 in HC/B 27/2017.Each of those insolvency proceedings is unrelated to the plaintiffs and unrelated to the subject-matter of this action. The fourth defendant 6 The fourth defendant is also known as “Dawson Lim”. He was at all material times a private banker and a senior relationship manager with Credit Suisse in Singapore (“Credit Suisse”).6Foot Note 6×Affidavit of evidence in chief of the fourth defendant, paragraph 5. 7 The plaintiffs’ case against the fourth defendant is a straightforward case in fraudulent misrepresentation. They assert that: (i) the fourth defendant made certain misrepresentations to them about the Autostyle investment; (ii) that he did so fraudulently;7Foot Note 7×Certified Transcript dated 2 April 2018, page 5, lines 30–32.(iii) that the plaintiffs were thereby induced to enter into the Autostyle investment by paying $1m to the third defendant;8Foot Note 8×Statement of Claim (Amendment No 1), paragraph 17.and (iv) that the plaintiffs have thereby suffered loss and damage in the sum of $896,260.9Foot Note 9×Statement of Claim (Amendment No 1), paragraphs 31–32. 8 One of the reasons given by the plaintiffs for relying on the fourth defendant’s representations is that they trusted him as a senior banker10Foot Note 10×Statement of Claim (Amendment No 1), paragraph 20.who was then employed by Credit Suisse, a reputable financial institution. But the plaintiffs expressly accept that, in all his dealings with them, the fourth defendant acted in his personal capacity and not as an employee of Credit Suisse.11Foot Note 11×Statement of Claim (Amendment No 1), paragraph 3.The plaintiffs do not, therefore, suggest that Credit Suisse is in any way liable to them, vicariously or otherwise, for the fourth defendant’s alleged misrepresentations.12Foot Note 12×Closing submissions of the plaintiffs, paragraph 7. The third defendant 9 The third defendant is a company incorporated in Singapore. The first and second defendants together control the third defendant. They are the third defendant’s only two directors. In addition, each of them holds 36% of the third defendant’s issued and paid up share capital.13Foot Note 13×Affidavit of evidence in chief of the fourth defendant, pages 157–159. 10 In form, the third defendant purports to be a holding company which provides business and management consultancy services.14Foot Note 14×Affidavit of evidence in chief of the fourth defendant, page 157.In substance, it appears to have served purely as an instrument of the first and second defendants’ fraud.15Foot Note 15×Affidavit of evidence in chief of the second plaintiff, pages 378 and 381; affidavit of evidence in chief of the first defendant, paragraph 8.Indeed, it appears that the first and second defendants incorporated not just the third defendant but another company to serve as an instrument of their fraud. The other company is JE Capital Investments Limited, a company incorporated in the British Virgin Islands (“BVI”) with its office in Hong Kong.16Foot Note 16×Affidavit of evidence in chief of the first defendant, paragraph 5 and page 15; Certified Transcript dated 22 August 2017, page 26, lines 26–28; page 37, lines 5–10.Both of these companies have similar names, no doubt calculated deliberately to confuse and mislead. To add to the confusion, the first and second defendants adopted the practice, again no doubt calculated deliberately to mislead, of referring to JE Capital Investments Limited by the abbreviated name “JE Capital Ltd”,17Foot Note 17×Certified Transcript dated 22 August 2017, page 90, lines 13–30.thereby increasing the possibility of confusing the BVI company with the third defendant. Both of these companies and all three of these names feature in the Autostyle investment. 11 The third defendant defended the early stages of this action. It was represented by solicitors from shortly after it was served in October 201518Foot Note 18×Notice of appointment of solicitors filed 2 October 2015 under “4. Solicitor(s) for the 3rd Defendant(s)”.until April 2016.19Foot Note 19×Order for withdrawal of solicitor dated 27 April 2016.During that time, it entered an appearance and filed a defence. 12 In April 2016, the third defendant was ordered to be compulsorily wound up.20Foot Note 20×HC/ORC 2183/2016 in HC/CWU 215/2015.Upon assuming office, the third defendant’s liquidators informed the plaintiffs’ solicitors that the third defendant lacked the funds to defend the plaintiffs’ claim any further.21Foot Note 21×Certified Transcript dated 2 April 2018, page 3, lines 25–30.As a result, the third defendant ceased to defend this action from April 2016. It therefore did not participate in the trial. 13 In November 2016, the plaintiffs applied for22Foot Note 22×HC/OS 1197/2016.and obtained23Foot Note 23×HC/ORC 8015/2016 in HC/OS 1197/2016.leave under s 262(3) of the Companies Act (Cap 50, 2006 Rev Ed) to continue this action against the third defendant notwithstanding its liquidation. The second defendant 14 The second defendant is also known as “Jerry Ng”.24Foot Note 24×Affidavit of evidence in chief of the fourth defendant, paragraph 4.He is a director and a shareholder of the third defendant.25Foot Note 25×Affidavit of evidence in chief of the fourth defendant, pages 158–159.Although the second defendant is a Singapore citizen, he lives and works in China had has done so for a number of years.26Foot Note 26×Affidavit of evidence in chief of the first defendant, paragraphs 5 and 14.It appears that, over those years, he has built up an extensive business network in China.27Foot Note 27×Affidavit of evidence in chief of the first defendant, paragraph 5. 15 The second defendant is, by all accounts, the driving force behind the third defendant and its fraud. Like the archetypal fraudster, the second defendant can no longer be traced.28Foot Note 28×Certified Transcript dated 2 April 2018, page 2, lines 5–9; affidavit of evidence in chief of the first defendant, paragraph 8. 16 The plaintiffs effected substituted service of the writ in this action on the second defendant by way of an advertisement in the Straits Times in November 2015.29Foot Note 29×Memorandum of service filed 26 November 2015.He did not enter an appearance and did not participate in this action in any way. Accordingly, in December 2015, the plaintiffs entered judgment30Foot Note 30×HC/JUD 795/2015.against the second defendant in default of appearance for $896,260 plus interest and costs. 17 The second defendant was adjudicated bankrupt in February 2017.31Foot Note 31×HC/ORC 1061/2017 in HC/B 27/2017. The first defendant 18 The first defendant is also known as “Eugene Tan”. He is a director of and a shareholder of the third defendant.32Foot Note 32×Affidavit of evidence in chief of the fourth defendant, pages 158–159. 19 The first defendant defended this action through solicitors33Foot Note 33×Notice of appointment of solicitor filed 2 October 2015.up to December 201634Foot Note 34×HC/ORC 7/2017.and in person from December 2016 up to the fourth day of trial, with the assistance of aMcKenziefriend.35Foot Note 35×Certified Transcript dated 17 August 2017, page 1, lines 13–16.Thus, either through solicitors or in person, the first defendant entered an appearance, filed a defence, participated in discovery, filed affidavits of evidence in chief, cross-examined witnesses and submitted himself to cross-examination. 20 At the beginning of the fifth day of trial, after he had given evidence, the first defendant informed me that he intended to cease participating in the trial of this action36Foot Note 36×Certified Transcript dated 24 October 2017, page 1, lines 9–17.but without withdrawing his defence or his evidence. I informed him that he was at liberty to do so, but warned him that the result would be that he would nevertheless be bound by my decision on the merits of his defence. He accepted the consequences of his decision.37Foot Note 37×Certified Transcript dated 24 October 2017, page 1, lines 18–29.Accordingly, the first defendant ceased to participate in the trial on and from the fifth day of trial. 21 The first defendant was adjudicated bankrupt in January 2018. That was after the trial of this action but before closing submissions.38Foot Note 38×HC/B 696/2017. 22 The plaintiffs have applied for39Foot Note 39×HC/OS 504/2018.and obtained40Foot Note 40×Certified Transcript dated 30 April 2018 in HC/OS 504/2018.leave under s 76(1)(c)(ii) of the Bankruptcy Act (Cap 20, 2009 Rev Ed) to continue this action against the first defendant notwithstanding his bankruptcy. I have granted that leave and, pursuant thereto, entered final judgment against the first defendant to the full extent of the plaintiffs’ claim against him. In my view, the first defendant is personally culpable for the third defendant’s fraud which was the Autostyle investment. As the first defendant has not filed an appeal against my decision, I need say no more in this judgment about my reasons for entering judgment against him. 23 I turn now to the factual background.",
        "Factual background": "",
        "The third defendant opens an account with Credit Suisse": "24 Part of the fourth defendant’s duties as a senior relationship manager with Credit Suisse included bringing in new private banking clients for Credit Suisse from the greater China market.41Foot Note 41×Affidavit of evidence in chief of the fourth defendant, paragraph 8.It was in that context that the fourth defendant was introduced to the other defendants and also to the second plaintiff. 25 In 2013, the fourth defendant was introduced to the first and second defendants as potential clients and to the third defendant as their personal investment vehicle.42Foot Note 42×Affidavit of evidence in chief of the fourth defendant, paragraph 6.In or around October 2013, the first, second and third defendants all opened private banking accounts with Credit Suisse43Foot Note 43×Affidavit of evidence in chief of the fourth defendant, paragraph 7.with the fourth defendant as their relationship manager.44Foot Note 44×Certified Transcript dated 22 August 2017, page 41, lines 31–32; page 44, line 27. 26 On matters related to the third defendant, the fourth defendant dealt almost exclusively with the second defendant and very rarely with the first defendant. Thus, even though the first defendant was also a director of the third defendant, it was the second defendant, in his capacity as a director of the third defendant, who gave almost all of the instructions which are relevant to this dispute to the fourth defendant.45Foot Note 45×Defence of the fourth defendant (Amendment No 2), paragraph 7. 27 The third defendant’s account with Credit Suisse was opened as an investment account,ieas an account through which the third defendant would bring in assets with a minimum value of US$2m to be invested with the assistance of Credit Suisse in financial instruments to generate income and capital growth.46Foot Note 46×Certified Transcript dated 23 August 2017, page 133, lines 16–32.But the third defendant did not use its Credit Suisse account as an investment account. Instead, the only sums which were ever paid into the third defendant’s Credit Suisse account were the $1m from the plaintiffs under the Autostyle investment and another sum of $1m from another defrauded investor.47Foot Note 47×Certified Transcript dated 2 April 2018, page 8, lines 7–12.",
        "The second plaintiff lends money to the third defendant": "28 Also in 2013, the second plaintiff was introduced to the fourth defendant.48Foot Note 48×Affidavit of evidence in chief of the fourth defendant, paragraph 9.The introduction was effected through a business associate of the second plaintiff.49Foot Note 49×Affidavit of evidence in chief of the second plaintiff, paragraph 2.The fourth defendant was trying to win over the second plaintiff’s business associate as a new private banking client for Credit Suisse. He viewed the second plaintiff as the business associate’s trusted “gatekeeper” and informal adviser. He therefore saw the second plaintiff as someone he needed to impress in order to win over her business associate as a new client.50Foot Note 50×Affidavit of evidence in chief of the fourth defendant, paragraphs 9–10. 29 After the initial introduction, the fourth defendant spoke to the second plaintiff from time to time about opportunities to make investments.51Foot Note 51×Affidavit of evidence in chief of the second plaintiff, paragraph 2.The second plaintiff’s evidence is that she declined to take up any of these opportunities because she was unfamiliar both with the fourth defendant and with the nature of the proposed investments.52Foot Note 52×Affidavit of evidence in chief of the second plaintiff, paragraph 2. 30 In or about November 2013, the fourth defendant put the second plaintiff in touch with the third defendant in connection with a potential investment.53Foot Note 53×Affidavit of evidence in chief of the fourth defendant, paragraph 20.As a result of this introduction, in January 2014, the second plaintiff agreed to make an unsecured loan to the third defendant of $200,000, to be repaid in January 2015, with interest payable in the meantime in two bi-annual tranches.54Foot Note 54×Affidavit of evidence in chief of the second plaintiff, paragraph 3.Because this loan was a relatively small one, the second plaintiff did not discuss it with the first plaintiff before agreeing to extend the loan.55Foot Note 55×Affidavit of evidence in chief of the second plaintiff, paragraph 3.This loan is not part of the subject-matter of this action.",
        "The Autostyle investment and its documentation": "31 In or about February 2014, the fourth defendant told the second plaintiff of an opportunity to invest $1m through the third defendant in what I have called the Autostyle investment. This time, the investment would be secured by a banker’s guarantee.56Foot Note 56×Affidavit of evidence in chief of the second plaintiff, paragraph 5.Because this investment opportunity was significantly larger than the earlier investment of $200,000, the second plaintiff felt that she needed to bring the first plaintiff into the discussion. 32 On 28 February 2014, the fourth defendant sent an email to the second plaintiff to which was attached two draft documents. One was headed “Mezzanine Fund Term Note” (“the draft Note”) and the other was headed “Fund Subscription Agreement” (“the draft Agreement”).57Foot Note 57×Affidavit of evidence in chief of the second plaintiff, paragraph 6. 33 The fourth defendant’s email of 28 February 2014 reads as follows:58Foot Note 58×Affidavit of evidence in chief of the second plaintiff, page 19. Dear Merry, For your reference only. Attached a copy of the term note for your reference. The investment currency can be in USD or SGD. A Bankers [sic] Guarantee will be issued to you as additional secured collateral 12 weeks after the closing of the subscription. Issuer of the Bankers [sic] Guarantee will be either Credit Suisse AG Singapore branch or Standard Chartered Bank, Singapore Branch. Closing period will be on the 6th March. The second plaintiff showed the email and its attachments to the first plaintiff.59Foot Note 59×Affidavit of evidence in chief of the first plaintiff, paragraph 3. 34 The pleaded defence of the first and third defendants is that the Autostyle investment was a genuine investment by which the plaintiffs advanced money, not to the third defendant, but to an Autostyle entity “facilitated and underwritten by JE Capital Investments Limited”.60Foot Note 60×Defence of the third defendant, paragraphs 3 and 13; defence of the first defendant, paragraph 4.JE Capital Investments Limited is not the third defendant and is one of the three instruments of fraud established by the first defendant and the second defendant (see [10] above). I reject the defence of the first defendant and the third defendant on every level. The Autostyle investment was a fraudulent scheme from beginning to end, and is one for which the first, second and third defendants are all culpable in the tort of deceit. 35 I arrive at that conclusion partly because of the large number of unusual features about the draft documentation attached to the fourth defendant’s email of 24 February 2014. That indicates to me that the draft documentation could never be – and was never intended to be – contractually or even commercially effective. I deal first with the unusual features of the draft Note before considering the unusual features of the draft Agreement. 36 The draft Note has two unusual features.61Foot Note 61×Affidavit of evidence in chief of the second plaintiff, page 20.First, there is no counterparty to the Note. The draft Note refers to a “Term deposit of SINGAPORE Dollars” for a “12 calendar month term” yielding a return of “15% annually on [the] Principal Deposit” payable in six-monthly intervals.62Foot Note 62×Affidavit of evidence in chief of the second plaintiff, page 20.It is therefore drafted as a debt instrument with the plaintiffs as the creditor. It also stipulates expressly that the plaintiffs’ $1m investment is to be paid into an account in the third defendant’s name. From that term, it could be inferred that the third defendant is to be the plaintiff’s debtor. But the draft Note places no obligation on the third defendant to repay the $1m to the plaintiffs. Indeed, the draft Note leaves entirely unstated the name of the plaintiffs’ debtor. 37 The draft Note is drawn up on the letterhead of JE Capital Ltd. JE Capital Ltd is not the third defendant and is another one of the three instruments of fraud established by the first and second defendants (see [10] above). Further, the draft Note provides that the first and second defendants are to sign the note for “JE Capital Ltd”. But nowhere does the draft Note does it place any obligation on JE Capital Ltd to pay interest due to the plaintiffs, to repay the principal to the plaintiffs and to procure the banker’s guarantee for the principal amount. 38 I find, however, that the plaintiffs’ debtor is and was the third defendant. First, it is the third defendant who received the plaintiffs’ funds. Second, it is the third defendant who the plaintiffs were told that they were contracting with and with whom they believed that they were contracting.63Foot Note 63×Certified Transcript dated 17 August 2017, page 38, lines 16–25. 39 The second unusual feature of the draft Note is that it includes a number of provisions which are couched in what appears at first sight to be formal legal language but which is in fact utter gibberish barely carrying any syntactical sense, let alone commercial sense. Two examples suffice.64Foot Note 64×Affidavit of evidence in chief of the second plaintiff, page 20. 40 First, the draft Note describes its purpose in the following introductory language: Mezzanine Fund Term NOTES - TJM - JWN/ GLB 280215 - PT FUND Amount: Value amount in 4 denomination coupon term notes 1. SGD $1,000,000.00 Singapore Dollars One Million 2. SGD $2,000,000.00 Singapore Dollars Two Million There is no evidence that the Note which was eventually “issued” to the plaintiffs was a part of any legitimate series of notes. 41 Second, the draft Note makes the following provision on interest: Returns /Interest rate: 15% annually on Principal Deposit of SINGAPORE Dollars (SGD$ XXXXXXXXXX) Investment of semi annually payout: SINGAPORE Dollars $XXXXX Only (SGD$ XX,XXX.XX) Although there is a clear provision for 15% interest to be paid, the remainder of this provision makes no sense. 42 The draft Agreement accompanying the draft Note describes itself as a “Fund Subscription Agreement” and is drawn up on the letterhead of “Autostyle Cars Company Limited”.65Foot Note 65×Affidavit of evidence in chief of the second plaintiff, page 24.It states that it is to be entered into between JE Capital Investments Limited and Autostyle Cars Company Limited on the one hand and a “subscriber” on the other.66Foot Note 66×Affidavit of evidence in chief of the second plaintiff, page 31.The intent of the draft Agreement appears to be to set out the terms on which the “subscriber” is to invest money in a fund which is somehow connected to “Autostyle Cars Company Limited” and another company with a confusingly similar name: “Autostyle Cars Limited” (iewithout “Company” in the name). 43 There is no evidence that either “Autostyle Cars Limited” or “Autostyle Cars Company Limited” ever actually had any actual business or ever actually solicited subscriptions for any actual fund to which either company had any actual connection. It is therefore unnecessary to distinguish between the two names. I shall therefore refer to both collectively as “Autostyle”. 44 The draft Agreement too contains copious amounts of impressive-looking gibberish. Four examples suffice. First, it describes the parties as follows:67Foot Note 67×Affidavit of evidence in chief of the second plaintiff, page 24. Parties AUTOSTYLE CARS LIMITED & AUTOSTYLE CAR COMPANY LIMITED(BVI & UK REGISTERED ), a Holding company incorporated in the HONG KONG SAR and having its registered office at780 Harrow Road, Sudbury, Middlesex HA 3EL, United Kingdom and Unit A, 21st Floor 128 Wellington Street Central, Hong Kong SAR,(the “Company”);and (Singapore ID No:[ ] of[Mr. XXXXXXXXX] of Address [ ] (the “Subscriber”). 45 Second, it recites the background to the Agreement as follows: Recitals 1. The Company is a limited company limited by shares incorporated in UK And HONG KONG SAR under the Companies Act, (Cap.50) and has at the date of this Agreement an authorized share capital of £ 10,000,000.00. The Subscriber has applied to subscribe for equity fund investment in the Company and the Company has agreed to issue and allot the unit of investments fund notes to the Subscriber on the terms and conditions in this Agreement. 46 Third, it sets out the key obligation as follows: 2. SUBSCRIPTION Subject to the terms and conditions of this Mezzanine Equity Fund Investment Agreement, the Subscriber shall subscribe for the preferential or cash at a price of SGD $XXXXXXX and the company shall forthwith thereafter effect the allotment and issue each unit to the Subscriber on the Completion Date as fully paid up. 47 Fourth, although it describes itself as a fund subscription agreement,iean investment in equity, the Appendix refers to the indicia of a debt instrument. Thus, the Appendix refers to “FUND Notes” with an issue size in the “Principal amount of GBP£35 million” and provides for interest as follows:68Foot Note 68×Affidavit of evidence in chief of the second plaintiff, page 32. Interest : Per Unit of COUPONS SIZE MEZZANINE Funds Notes shall bear returns as follows: Current prevailing LIBOR Rate : 1.05% (i) SGD$500,000.00 of the Notes shall bear interest at the rate of 1.45% per annum LIBOR plus 14.55% per annum; total (15%) – 12 months option 48 The draft Agreement provided for it to be executed by the second defendant “On behalf of JE CAPITAL INVESTMENTS LTD Underwriter for AUTOSTYLE GROUP”69Foot Note 69×Affidavit of evidence in chief of the second plaintiff, page 30.with his signature to be witnessed by someone called “Sharon Lucas” of the third defendant. 49 The draft Agreement is accompanied by an application form ostensibly to be submitted to Autostyle to invest in a fund called the “Autostyle Market Recapitalisation Auto Term Fund”. This too contains a significant amount of gibberish:70Foot Note 70×Affidavit of evidence in chief of the second plaintiff, page 23. 1. *I hereby apply for the abovementioned fund subject to the Company’s Memorandum and Articles of Association and enclose a *Banker’s Draft for the above stated amount being payment in full for the above fund investment. 2. *I hereby undertake and agree to accept the MEZZANINE FUND in respect of which this application may be accepted. In the event that the Company decides to allot any lesser number of such FUND or not to allot any FUND to *me, *I agree to accept that decision as final. 3. *I authorize you to procure the Company to place *my name on the Register of Members of the Company as holder(s) of the fund allotted to *me thereof should this application be unsuccessful or accepted in part only, all by ordinary post at *my risk at the address which appears below. 4. I declare that I am not under 21 years of age. (For individuals only). 50 It is virtually impossible to ascertain from the draft Note and the draft Agreement the precise structure of the Autostyle investment which the first and second defendants were seeking to present to the plaintiffs. Presumably, the intention was to frame the Autostyle investment as a transaction in which the plaintiffs lent money to an (apparently unnamed) entity controlled by the first and second defendants which money that entity was then to use to subscribe for shares in Autostyle. The income from those shares would fund the interest payments due to the plaintiffs and the capital value of those shares would be realised in March 2015 to fund the repayment of principal. 51 However, the initial draft of the remittance instructions pursuant to which the plaintiffs were to pay $1m to the third defendant’s Standard Chartered Bank account gave the purpose of the payment as “Purchase of Equity Stake of JE Capital Pte Ltd Holdings” [sic].71Foot Note 71×Affidavit of evidence in chief of the second plaintiff, page 45.And those instructions were signed by the first defendant and the second defendant on behalf of JE Capital Ltd,ienot the third defendant. So perhaps any attempt to make sense of the Autostyle investment is doomed to fail, being no more than an attempt to make sense out of the nonsensical.",
        "The plaintiffs meet the fourth defendant": "52 Because of the size of the proposed Autostyle investment, the second plaintiff felt that she needed to have the first plaintiff’s input before committing to it. She therefore suggested that both plaintiffs meet the fourth defendant to discuss the terms of the investment.72Foot Note 72×Affidavit of evidence in chief of the second plaintiff, paragraph 5.According to the first plaintiff, he was not keen on this investment because he was not familiar with the nature of the investment, because the capital sum was large and because the returns were not high enough to be attractive.73Foot Note 73×Affidavit of evidence in chief of the first plaintiff, paragraph 2.Nevertheless, he agreed to meet the fourth defendant and to hear him out, particularly because the investment was to be secured by a banker’s guarantee.74Foot Note 74×Affidavit of evidence in chief of the first plaintiff, paragraph 2. First meeting 53 On 2 March 2014, both plaintiffs met the fourth defendant at a restaurant in Parkway Parade to discuss the investment.75Foot Note 75×Affidavit of evidence in chief of the first plaintiff, paragraph 4; affidavit of evidence in chief of the fourth defendant, paragraph 25.The plaintiffs’ case is that at this meeting, the fourth defendant went through the draft Note with them76Foot Note 76×Affidavit of evidence in chief of the second plaintiff, paragraphs 7 and 9.and told them that: (a) The investment would be secured by a banker’s guarantee if the amount invested was $1m or more;77Foot Note 77×Affidavit of evidence in chief of the second plaintiff, paragraphs 7 and 9. (b) He too had invested money with the third defendant, but that his investment was not secured by a banker’s guarantee because it was less than $1m;78Foot Note 78×Affidavit of evidence in chief of the second plaintiff, paragraphs 7 and 9; affidavit of evidence in chief of the first plaintiff, paragraph 5. (c) The money which the plaintiffs invested would be paid into the third defendant’s account with Credit Suisse;79Foot Note 79×Affidavit of evidence in chief of the second plaintiff, paragraph 8; affidavit of evidence in chief of the first plaintiff, paragraph 5. (d) The fourth defendant was managing the third defendant’s bank account(s) in Credit Suisse and would therefore have visibility of the third defendant’s financial status;80Foot Note 80×Affidavit of evidence in chief of the second plaintiff, paragraph 10; affidavit of evidence in chief of the first plaintiff, paragraph 6. (e) Autostyle’s inventory of luxury cars would be pledged with Credit Suisse;81Foot Note 81×Affidavit of evidence in chief of the second plaintiff, paragraph 10; affidavit of evidence in chief of the first plaintiff, paragraph 6. (f) The banker’s guarantee to secure the plaintiffs’ investment would be issued by Credit Suisse;82Foot Note 82×Affidavit of evidence in chief of the second plaintiff, paragraph 7; affidavit of evidence in chief of the first plaintiff, paragraph 5.and (g) A banker’s guarantee was a guarantee by a bank (in this case Credit Suisse) to pay to the plaintiffs the sum of $1m if there was a default in the investment.83Foot Note 83×Affidavit evidence in chief of the first plaintiff, paragraph 5. 54 Further, the plaintiffs say, they wanted to be able to withdraw from the Autostyle investment and retrieve their capital at any time before the one-year period expired. This was important to them because the plaintiffs, being in the construction industry, might have need for the capital before the one year expired. The first plaintiff asked the fourth defendant specifically about this at the meeting. According to them, the fourth defendant assured them that they would be able to withdraw 100% of the capital which they invested upon 30 days’ notice.84Foot Note 84×Affidavit of evidence in chief of the first plaintiff, paragraph 8; affidavit of evidence in chief of the second plaintiff, paragraph 15. 55 The first plaintiff’s evidence is that he put great credence in what the fourth defendant told him because the fourth defendant was a banker with Credit Suisse and because of what the fourth defendant told him of Credit Suisse’s connection to the investment:85Foot Note 85×Affidavit of evidence in chief of the first plaintiff, paragraphs 6–7. 6. … I have never invested in such investment products before, but based on the 4th Defendant’s representation, I was led to believe that this was an investment product put together by Credit Suisse, since the “inventory” was going to be pledged with Credit Suisse and the Banker’s Guarantee would be issued by Credit Suisse. 7. Furthermore, it was fronted by the 4th Defendant who is a Credit Suisse banker. I also considered that the investment would be paid into the 3rd Defendant’s Credit Suisse bank account and that the 4th Defendant was the banker managing the 3rd Defendant’s account. I relied on the truth of these representations by the 4th Defendant and without these conditions I would not have invested. 56  Further, the first plaintiff says that, because he was not keen on the investment, he was particularly circumspect about the risks associated with it and was looking for assurances that would minimise those risks, such as the promised banker’s guarantee:86Foot Note 86×Affidavit of evidence in chief of the first plaintiff, paragraph 5. … For me, the Banker’s Guarantee was crucial, and if it meant having to invest the sum of S$1,000,000.00 in order to have the Banker’s Guarantee, I would rather do so than to invest a lesser [sic] sum without the Banker’s Guarantee. 57 On 9 March 2014, the plaintiffs decided in principle to make the Autostyle investment.87Foot Note 87×Affidavit of evidence in chief of the second plaintiff, paragraph 15, and page 36.On 10 March 2014, they asked the fourth defendant to put both their names into the final documentation.88Foot Note 88×Affidavit of evidence in chief of the second plaintiff, paragraph 15, and pages 38–39.But they wanted to check the terms of the banker’s guarantee before giving their final agreement. As a result, on 10 March 2014, the second plaintiff asked the fourth defendant to send her by email a “sample of T&C and BG for our quick final decision”.89Foot Note 89×Affidavit of evidence in chief of the first plaintiff, paragraph 9; affidavit of evidence in chief of the second plaintiff, paragraph 15, and page 38.It is common ground that “BG” refers to a Credit Suisse banker’s guarantee. Second meeting 58 The plaintiffs met the fourth defendant for a second time on 12 March 2014.90Foot Note 90×Affidavit of evidence in chief of the second plaintiff, paragraph 16; affidavit of evidence in chief of the first plaintiff, paragraph 10.Of great concern to the plaintiffs was that the Note provided that the banker’s guarantee would not have to be produced until 90 days after the plaintiffs had paid the $1m to the third defendant. They were concerned that they might never receive the banker’s guarantee.91Foot Note 91×Affidavit of evidence in chief of the first plaintiff, paragraph 10.The fourth defendant explained that the 90-day period was for Credit Suisse to process Autostyle’s collateral and issue the banker’s guarantee. The plaintiffs believed what the fourth defendant told them because the fourth defendant was the banker in charge of the third defendant’s account with Credit Suisse.92Foot Note 92×Affidavit of evidence in chief of the first plaintiff, paragraph 10.The plaintiffs asked to shorten the period for the third defendant to issue the banker’s guarantee from 90 days to 60 days. They also asked for the third defendant to guarantee repayment of the $1m as security during the 60 days.93Foot Note 93×Affidavit of evidence in chief of the first plaintiff, paragraph 11; affidavit of evidence in chief of the second plaintiff, paragraph 18.The fourth defendant said that he would try and get the third defendant to agree to shortening the period.94Foot Note 94×Affidavit of evidence in chief of the first plaintiff, paragraph 10. 59 At this meeting, the first plaintiff reminded the fourth defendant to forward a “draft”95Foot Note 95×Affidavit of evidence in chief of the first plaintiff, paragraph 11; affidavit of evidence in chief of the second plaintiff, paragraph 20.Credit Suisse banker’s guarantee to the plaintiffs for their approval. The fourth defendant’s evidence is that the plaintiffs asked for a “sample”96Foot Note 96×Affidavit of evidence in chief of the fourth defendant, paragraph 26.Credit Suisse banker’s guarantee, not for a “draft”. The difference appears to be that the plaintiffs consider a “draft” to refer the actual form of the banker’s guarantee which was to be issued to them whereas a “sample” refers topro formawording which is merely an indication of what the banker’s guarantee to be issued to the plaintiffs would look like. The fourth defendant’s account is more consistent with the contemporaneous correspondence, such as the one I have quoted at [57] above.",
        "The draft banker’s guarantee": "60 On 17 March 2014, the fourth defendant forwarded to the plaintiffs by email a copy of a Credit Suisse banker’s guarantee.97Foot Note 97×Affidavit of evidence in chief of the first plaintiff, paragraph 12; affidavit of evidence in chief of the second plaintiff, paragraph 20 and page 63; affidavit of evidence in chief of the fourth defendant, paragraph 26.The second plaintiff asked a friend to vet it. The friend reported that the wording of the banker’s guarantee was in order.98Foot Note 98×Affidavit of evidence in chief of the first plaintiff, paragraph 12; affidavit of evidence in chief of the second plaintiff, paragraph 21. 61 On 18 March 2014, the fourth defendant forwarded to the plaintiffs by email the final draft of the Note. It incorporated the two points which the plaintiffs had raised at the 12 March 2014 meeting,iethat they should be able to terminate the investment early with only the loss of interest which had accrued but which had not yet been paid and that there should be a guarantee of the principal amount to cover the period before the banker’s guarantee was issued.99Foot Note 99×Affidavit of evidence in chief of the first plaintiff, paragraph 13.These two points were incorporated in the following fractured form:100Foot Note 100×Affidavit of evidence in chief of the second plaintiff, page 67. JE Capital Ltd guarantees the Interest and Principal repayments to the Note Subscriber. In the event the term note should be terminated or withdrawn for whatever reason, before the maturity of the note, all collected interest / monies will not be taken back, nor will the principal amount be penalized. However, any forthcoming interest will be forfeited. The notice period to be given for withdrawals is 21 Business days: i.e. for the principal amount to be credited back to the respective designated account. The first defendant’s evidence at trial was that “JE Capital Ltd” in this passage is a reference to “JE Capital Investments Ltd” and not to the third defendant.101Foot Note 101×Certified Transcript dated 22 August 2017, page 91, lines 1–25.Notable is the fact that, although it remained the case after this amendment that no specific principal debtor is identified in the note, the Note now included a specific obligation on “JE Capital Ltd” (iethe BVI company and not the third defendant) to guarantee payments under the Note. 62 The plaintiffs’ request that the banker’s guarantee be issued within 60 days of their payment rather than 90 days was not incorporated in the final draft of the Note.102Foot Note 102×Affidavit of evidence in chief of the first plaintiff, paragraph 13.Despite this, the plaintiffs decided to go ahead with the Autostyle investment.103Foot Note 103×Affidavit of evidence in chief of the first plaintiff, paragraph 13.",
        "The plaintiffs make the Autostyle investment": "63 On 24 March 2014, the fourth defendant handed over to the plaintiffs at their home the final draft of the Note and the Agreement already signed by the second defendant on behalf of the third defendant.104Foot Note 104×Affidavit of evidence in chief of the first plaintiff, paragraph 14.According to the plaintiffs, the fourth defendant assured them that all the documents were in order.105Foot Note 105×Affidavit of evidence in chief of the second plaintiff, paragraph 23.With that assurance, the plaintiffs executed the documentation106Foot Note 106×Affidavit of evidence in chief of the first plaintiff, paragraph 14.and mailed it to the third defendant’s address. The fourth defendant gave the plaintiffs details of the third defendant’s bank account with Credit Suisse so that they could remit the $1m.107Foot Note 107×Affidavit of evidence in chief of the first plaintiff, paragraph 15. 64 On 28 March 2014, the plaintiffs remitted $1m to the third defendant’s account with Credit Suisse by telegraphic transfer.108Foot Note 108×Affidavit of evidence in chief of the first plaintiff, paragraph 15; affidavit of evidence in chief of the second plaintiff, paragraph 25 and page 81.A letter was issued to the plaintiffs, formally acknowledging that the third defendant had received the funds.109Foot Note 109×Affidavit of evidence in chief of the second plaintiff, paragraph 26 and page 85.The letter appears to be on the letterhead of “JE Capital Ltd” and is signed by “Sharon Lucas” as “Vice-President, Finance & Compliance” of “JE Capital Ltd” (iethe BVI company and not the third defendant). However, the letter begins by saying: “Greetings from JE CAPITAL PTE LTD” (iethe third defendant and not the BVI company) and concludes with the third defendant’s company stamp. 65 The banker’s guarantee was due to be furnished within 90 days of 28 March 2014,ieon or before 26 June 2014. No guarantee was furnished by the due date. On 30 June 2014, the first defendant emailed to the second plaintiff, with a copy to the fourth defendant, a scanned copy of a guarantee for the sum of $1m ostensibly issued by ABN Amro’s Singapore branch.110Foot Note 110×2AB518–519.The first defendant then delivered the physical guarantee to the second plaintiff in person111Foot Note 111×Affidavit of evidence in chief of the first plaintiff, paragraph 16; affidavit of evidence in chief of the second plaintiff, paragraph 27.on or after 5 July 2014.112Foot Note 112×Certified Transcript dated 18 August 2017, page 21, lines 4–6.The second plaintiff’s evidence is that she was surprised not to receive a guarantee from Credit Suisse, that she had never heard of ABN Amro, and that she therefore queried the first defendant about the guarantee. Her evidence, further, is that the first defendant informed her that ABN Amro was a Dutch bank recognised worldwide and that the ABN Amro guarantee was valid.113Foot Note 113×Statement of Claim (Amendment No 1), paragraph 19.I accept this evidence. 66 The first plaintiff’s evidence is that he was “agitated and uncomfortable”114Foot Note 114×Affidavit of evidence in chief of the first plaintiff, paragraph 16.when he learned that the banker’s guarantee had not been issued by Credit Suisse, as the fourth defendant had led the plaintiffs to expect, but had instead been issued by a bank of which the first plaintiff had never heard. He asked the second plaintiff to contact the fourth defendant immediately to clarify matters.115Foot Note 115×Affidavit of evidence in chief of the first plaintiff, paragraph 16; affidavit of evidence in chief of the second plaintiff, paragraph 28. 67 The second plaintiff checked with the fourth defendant. According to the second plaintiff, the fourth defendant expressed no surprise that the first defendant had delivered a banker’s guarantee from ABN Amro rather than from Credit Suisse. He did not offer to verify the guarantee or even to see it. He assured her that ABN Amro “was also an established bank with branches in Singapore and that there is no problem with the ABN [g]uarantee”.116Foot Note 116×Affidavit of evidence in chief of the second plaintiff, paragraph 29.The first plaintiff took this as the fourth defendant’s assurance that the banker’s guarantee was in order:117Foot Note 117×Affidavit of evidence in chief of the first plaintiff, paragraph 17; see also affidavit of evidence in chief of the second plaintiff at paragraph 30. 17. … Although I felt uncomfortable because what was previously promised by the 4th Defendant was not fulfilled, as the 4th Defendant was a senior banker with Credit Suisse and was the person responsible for put [sic] this Investment together, we accepted his representation and assurance that the ABN Guarantee was in order and we therefore did not pursue the matter. …",
        "Interest and principal fall due": "68 The third defendant was obliged to pay interest on the Note in September 2014 and March 2015. A third party made the first interest payment, albeit late.118Foot Note 118×Affidavit of evidence in chief of the second plaintiff, paragraph 31.The third defendant made the second interest payment on time.119Foot Note 119×Affidavit of evidence in chief of the second plaintiff, paragraph 34. 69 The third defendant was also obliged to repay the principal sum of $1m on 31 March 2015.120Foot Note 120×Affidavit of evidence in chief of the second plaintiff, paragraph 35.In anticipation of that, on 27 March 2015, the second plaintiff asked the fourth defendant to confirm that the third defendant would make payment upon maturity as stipulated in the Note.121Foot Note 121×Affidavit of evidence in chief of the first plaintiff, paragraph 19.The fourth defendant indicated that there was likely to be a delay.122Foot Note 122×Affidavit of evidence in chief of the first plaintiff, paragraph 19.Both the first defendant and the second defendant explained to the second plaintiff that six more months were needed to repay the principal because Autostyle was purportedly in the midst of being acquired by an international car-rental company and that, in the meantime, the banker’s guarantee had expired and would not be renewed.123Foot Note 123×Affidavit of evidence in chief of the second plaintiff, paragraph 33, pages 112–116.The plaintiffs were understandably upset.124Foot Note 124×Affidavit of evidence in chief of the first plaintiff, paragraph 20. 70 The plaintiffs held the fourth defendant responsible for securing repayment of their principal.125Foot Note 125×Affidavit of evidence in chief of the second plaintiff, paragraph 35.On 2 April 2015, the plaintiffs met the fourth defendant to discuss what could be done to recover the plaintiff’s principal. The fourth defendant assured the plaintiffs that he would assist and volunteered to fly to Shanghai to speak to the second defendant.126Foot Note 126×Affidavit of evidence in chief of the first plaintiff, paragraph 21; affidavit of evidence in chief of the second plaintiff, paragraph 35.However, instead of flying to Shanghai, the fourth defendant sent a Whatsapp message to the plaintiffs on 3 April 2015 saying that he did not want to be a middleman and asking the plaintiffs to communicate directly with the second defendant about recovering their principal.127Foot Note 127×Affidavit of evidence in chief of the first plaintiff, paragraph 22. 71 With that, the plaintiffs decided to call on the ABM Amro guarantee.128Foot Note 128×Affidavit of evidence in chief of the first plaintiff, paragraph 22; affidavit of evidence in chief of the second plaintiff, paragraph 37.ABN Amro’s Singapore branch told the plaintiffs that the guarantee had not been issued by the Singapore branch and referred the plaintiffs to ABN Amro’s head office in the Netherlands. On 6 April 2015, ABN Amro’s head office told the plaintiffs that that the guarantee was a forgery.129Foot Note 129×Affidavit of evidence in chief of the first plaintiff, paragraph 22; affidavit of evidence in chief of the second plaintiff, paragraph 37.",
        "The plaintiffs meet the first defendant": "72 The plaintiffs then arranged two meetings at the third defendant’s premises. The meetings took place on 6 April 2015 and 8 April 2015. The plaintiffs, the first defendant and the fourth defendant were present in person at both meetings.130Foot Note 130×Affidavit of evidence in chief of the first plaintiff, paragraph 23; affidavit of evidence in chief of the second plaintiff, paragraph 38.The second defendant participated in both meetings by telephone. The meetings did not result in any resolution. Instead, the plaintiffs received promises of instalment payments, ostensibly from a representative of Autostyle.131Foot Note 131×Affidavit of evidence in chief of the second plaintiff, paragraph 42. 73 On 18 May 2015, the plaintiffs received a part-payment of £50,000 from Autostyle Cars Company Limited.132Foot Note 132×Affidavit of evidence in chief of the second plaintiff, page 135.At the prevailing exchange rate, that sum was equivalent to $103,740.133Foot Note 133×Affidavit of evidence in chief of the second plaintiff, page 135.The plaintiffs give credit to the defendants in this action for this sum. 74 On 22 September 2015, the plaintiffs commenced this action.",
        "Overview of the parties’ cases": "",
        "The plaintiffs’ case": "75 Although the plaintiffs’ case against the fourth defendant is, at least on one view, pleaded in both negligent134Foot Note 134×Statement of Claim (Amendment No 1), paragraphs 26 and 29.and fraudulent misrepresentation,135Foot Note 135×Statement of Claim (Amendment No 1), paragraphs 27–28.plaintiffs’ counsel confirmed in his written136Foot Note 136×Closing submissions of the plaintiffs, paragraph 7.and oral137Foot Note 137×Certified Transcript dated 2 April 2018, page 5, lines 30–32; page 35, lines 20–21; page 47, lines 23–24.closing submissions that the plaintiffs pursue their case against the fourth defendant in fraudulent misrepresentation only. It is therefore unnecessary for me to consider the plaintiffs’ alternative claim in negligence and, in particular, to analyse the essential threshold question of whether the fourth defendant owed the plaintiffs any duty of care at all. 76 The plaintiffs’ case as finally presented to me in closing submissions is that, in or about February 2014, the fourth defendant made the following six fraudulent misrepresentations to the plaintiffs:138Foot Note 138×The plaintiffs’ closing submissions, paragraph 55. (a) That a banker’s guarantee from Credit Suisse in the sum of $1m will be issued to the plaintiffs no more than 90 days after 31 March 2014 in order to secure the Autostyle investment;139Foot Note 139×Statement of Claim (Amendment No 1), paragraph 7(e). (b) That, because the third defendant maintains a bank account with Credit Suisse, and because the fourth defendant is the banker at Credit Suisse handling the third defendant’s account, the fourth defendant is able to warrant the financial status of the third defendant and to ensure that the banker’s guarantee will be issued by Credit Suisse;140Foot Note 140×Statement of Claim (Amendment No 1), paragraph 7(f). (c) That the investment was safe and secure, because the fourth defendant was managing the third defendant’s bank account;141Foot Note 141×Statement of Claim (Amendment No 1), paragraph 10(c). (d) That Credit Suisse is able to issue the banker’s guarantee to secure the investment as Autostyle’s inventory would be pledged to Credit Suisse;142Foot Note 142×Statement of Claim (Amendment No 1), paragraph 7(g). (e) That the 90-day period to issue the banker’s guarantee was necessary for the subject matter of the Autostyle investment to be pledged to Credit Suisse before the banker’s guarantee could be issued;143Foot Note 143×Statement of Claim (Amendment No 1), paragraph 13.and (f) That the fourth defendant had also invested in the Autostyle investment and that the Autostyle investment was secure.144Foot Note 144×Statement of Claim (Amendment No 1), paragraph 8. 77 Plaintiffs’ counsel confirmed in closing submissions that the plaintiffs’ case in its final form rests on these six alleged misrepresentations, and only on these six representations. The plaintiffs have thereby chosen to abandon – in my view rightly – a number of the alleged representations which are pleaded and which appear in their affidavits of evidence in chief. In this judgment, therefore, I need analyse only these six representations.",
        "The fourth defendant’s case": "78 The fourth defendant’s case on these six representations is essentially as follows. First, he denies that he made any of the six representations at all;145Foot Note 145×Defence of the fourth defendant (Amendment No 2), paragraph 8 (denying paragraph 7(e), (f) and (g)); paragraph 15 read with paragraph 8 (denying paragraph 10(c)); paragraph 18 (denying paragraph 13); paragraph 10 (denying paragraph 8); Certified Transcript dated 2 April 2018, page 100, lines 18–22.Second, if he did make any of them, he was simply relaying the other defendants’ representations to the plaintiffs and not adopting any of those representations as his own.146Foot Note 146×Affidavit of evidence in chief of the fourth defendant, paragraph 30.Third, the representations are not actionable, being statements of belief or intention as to the future rather than representations of present fact.147Foot Note 147×Defence of the fourth defendant (Amendment No 2), paragraphs 9, 15 and 18.Fourth, there was no fraud or dishonesty on his part.148Foot Note 148×Defence of the fourth defendant, paragraph 28.Finally, and in any case, the plaintiffs did not rely on any of the alleged misrepresentations in entering into the Autostyle investment and were not induced or caused thereby to do so.149Foot Note 149×Defence of the fourth defendant (Amendment No 2) paragraphs 11 and 22. 79 The key issue in this action is whether the fourth defendant is liable to the plaintiffs in the tort of fraudulent misrepresentation or deceit in respect of any of the six representations which I have set out at [76] above. I will briefly set out the general law in this area before turning to the facts of the case.",
        "The law on fraudulent misrepresentation": "80 As the Court of Appeal held inPanatronPte Ltd and another v Lee Cheow Lee and another[2001] 2 SLR(R) 435 (“Panatron”) at [14], a plaintiff who seeks damages for fraudulent misrepresentation does so in the tort of deceit and must establish five essential elements in order to succeed: (a) That the defendant made a representation of fact by words or conduct; (b) That the defendant made the representation with the intention that it should be acted upon by the plaintiff or by a class of persons which includes the plaintiff; (c) That the plaintiff acted upon the representation; (d) That the plaintiff suffered damage by doing so; and (e) That the defendant made the representation with the knowledge that it is false, or at least in the absence of any genuine belief that it is true. 81 Thelocusclassicuson the element of fraud in the tort of deceit is the speech of Lord Herschell in the House of Lords’ decision inDerry v Peek(1889) 14 App Cas 337 Lord Herschell’s conspectus on fraud inDerry v Peekat 374 bears quoting in full: … First, in order to sustain an action of deceit, there must be proof of fraud, and nothing short of that will suffice. Secondly, fraud is proved when it is shewn that a false representation has been made (1) knowingly, or (2) without belief in its truth, or (3) recklessly, careless whether it be true or false. Although I have treated the second and third as distinct cases, I think the third is but an instance of the second, for one who makes a statement under such circumstances can have no real belief in the truth of what he states. To prevent a false statement [from] being fraudulent, there must, I think, always be an honest belief in its truth. And this probably covers the whole ground, for one who knowingly alleges that which is false, has obviously no such honest belief. Thirdly, if fraud be proved, the motive of the person guilty of it is immaterial. It matters not that there was no intention to cheat or injure the person to whom the statement was made. The Court of Appeal has endorsed Lord Herschell’s approach inPanatron(at [13]) and more recently inWishing Star Ltd vJurong Town Corp[2008] 2 SLR(R) 909 (“Wishing Star”) at [16] andWeeChiaw Sek Anna v Ng Li-Ann Genevieve (sole executrix of the estate of Ng Hock Seng, deceased) and another[2013] 3 SLR 801 (“Anna Wee”) at [32]. 82 As Lord Herschell went on to explain inDerry v Peekat 375, the making of a “false statement through want of care falls far short of, and is a very different thing from, fraud, and the same may be said of a false representation honestly believed though on insufficient grounds.” Therefore, Lord Herschell’s reference inDerry v Peekto the representor being “reckless, careless whether it be true or false” does not allow gross negligence or recklessness to suffice to establish fraud. As the English Court of Appeal said inAngus v Clifford[1891] 2 Ch 449 at 471, as affirmed inWishing Star(at [18]) andAnna Wee(at [34]): It seems to me that a second cause from which a fallacious view arises is from the use of the word “reckless.” …Not caring… did not mean not taking care, it meant indifference to the truth, the moral obliquity which consists in a wilful disregard of the importance of truth, and unless you keep it clear that that is the true meaning of the term, you are constantly in danger of confusing the evidence from which the inference of dishonesty in the mind may be drawn—evidence which consists in a great many cases of gross want of caution—with the inference of fraud, or of dishonesty itself, which has to be drawn after you have weighed all the evidence. [emphasis added in italics] 83 Dishonesty is an essential aspect of fraud. Dishonesty in this connection is a state of mind to be determined subjectively. Negligence is conduct which demonstrates a failure to take reasonable care. Dishonesty must not be conflated with negligence (seeChu Said Thong and another v Vision Law LLC[2014] 4 SLR 375 at [117]). Conduct which demonstrates a failure to take reasonable care may be evidence from which one can infer dishonesty as a subjective state of mind. But negligence, however gross, is not fraud (seeAnna Weeat [35]). 84 The burden of proof in establishing fraudulent misrepresentation rests on the person alleging fraud:AlwieHandoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 (“AlwieHandoyo”) at [159]. That burden must be discharged on the ordinary civil standard of the balance of probabilities. However, establishing fraud on the balance of probabilities requires cogent evidence (AlwieHandoyoat [161]). That is for two reasons. First, an allegation of fraud is an allegation of dishonesty and is a serious one. Further, a finding of fraud has serious consequences for a defendant. Second, the law recognises that fraud, because of its serious nature, is less common in the ordinary course of human affairs than negligence. As Lord Nicholls of Birkenhead said inIn re Hand others (Minors) (Sexual Abuse: Standard of Proof)[1996] AC 563 at 586: The balance of probability standard means that a court is satisfied an event occurred if the court considers that, on the evidence, the occurrence of the event was more likely than not. When assessing the probabilities the court will have in mind as a factor, to whatever extent is appropriate in the particular case, that the more serious the allegation the less likely it is that the event occurred and, hence, the stronger should be the evidence before the court concludes that the allegation is established on the balance of probability. Fraud is usually less likely than negligence. … Built into the preponderance of probability standard is a generous degree of flexibility in respect of the seriousness of the allegation. Although the result is much the same, this does not mean that where a serious allegation is in issue the standard of proof required is higher. It means only that the inherent probability or improbability of an event is itself a matter to be taken into account when weighing the probabilities and deciding whether, on balance, the event occurred. The more improbable the event, the stronger must be the evidence that it did occur before, on the balance of probability, its occurrence will be established. …",
        "The fourth defendant did not benefit personally from the fraud": "85 Before turning to the six representations on which the plaintiffs rely for their case in fraud against the fourth defendant, I must deal with an overarching aspect of the plaintiffs’ case. This is the allegation that the second defendant paid commissions to the fourth defendant and that the fourth defendant thereby benefited personally from the third defendant’s fraud.150Foot Note 150×Closing submissions of the plaintiffs, paragraph 90. 86 The plaintiffs have no direct evidence to support this allegation. Instead, they invite me to draw the inference of personal benefit from three strands of circumstantial evidence: (i) the unusually close nature of the relationship between the fourth defendant and the second defendant; (ii) the fourth defendant’s lack of surprise when he learnt that the third defendant’s banker’s guarantee had been issued by ABN Amro instead of Credit Suisse;151Foot Note 151×Certified Transcript dated 18 April 2018, page 18, lines 12–16; affidavit of evidence in chief of the second plaintiff, paragraph 29; closing submissions of the plaintiffs, paragraph 50.and (iii) the undisputed evidence that the second defendant made four substantial payments to the fourth defendant in 2014. 87 I do not accept that any of the three strands of circumstantial evidence, whether taken together or taken alone, is capable of bearing the weight of this aspect of the plaintiffs’ case. I analyse each strand of evidence in turn.",
        "Unusually close relationship": "88 On the first strand, the plaintiffs’ case is that the relationship between the fourth defendant and the second defendant was so unusual and so close as to invite suspicion. The plaintiffs point out for example, that the fourth defendant and the second defendant, together with their respective partners, went on holidays overseas together.152Foot Note 152×Closing submissions of the plaintiffs, paragraph 14. 89 I discount this strand of evidence. It is the role of a relationship manager with a private bank to build a close personal relationship with actual and potential clients. The fourth defendant did that with the second defendant and, to my mind, did no more than that. 90 To my mind, the relationship between the fourth defendant and the second defendant was not so unusually close as to arouse suspicion. It is too slender a circumstance from which to draw the inference that the fourth defendant received commissions from the second defendant and benefited personally from the fraud.153Foot Note 153×Closing submissions of the plaintiffs, paragraph 90.",
        "The fourth defendant’s lack of surprise": "91 The second strand on which the plaintiffs rely is the fact that, according to them, the fourth defendant did not express any surprise when they informed him that the first defendant had delivered to them a guarantee from ABN Amro rather than from Credit Suisse. The second plaintiff says this in her affidavit of evidence in chief:154Foot Note 154×Affidavit of evidence in chief of the second plaintiff, paragraph 29. When the 4th Defendant was queried about the ABN Guarantee he was not surprised that it was not a Credit Suisse Banker's Guarantee and did not even offer to check on it or asked [sic] to have sight of the ABN Guarantee. Instead he assured us that ABN AMRO was also an established bank with branches in Singapore and that there is no problem with the ABN Guarantee. From the reaction of the 4th Defendant, we understood that the 4th Defendant was aware of the issuance of the ABN Guarantee which was why he was not surprised and had assured us about its validity. In cross-examination, the second plaintiff accepted that this conversation must have taken place on or after 5 July 2014.155Foot Note 155×Certified Transcript dated 18 August 2017, page 19 line 11 to page 21 line 6. 92 The fourth defendant accepts in his affidavit of evidence in chief156Foot Note 156×Affidavit of evidence in chief of the fourth defendant, paragraph 35.that the second plaintiff told him that the third defendant had procured a banker’s guarantee issued by ABN Amro instead of Credit Suisse. But he says nothing about his reaction to this information. In cross-examination, he accepted that he was indeed not surprised when the second plaintiff informed him that the third defendant had procured a banker’s guarantee issued by ABN Amro. But his explanation is that this was because, on 30 June 2014, the first defendant had copied the fourth defendant on an email to the second plaintiff enclosing a scanned copy of the ABN Amro guarantee.157Foot Note 157×Certified Transcript dated 18 August 2017, page 21, lines 15–26; 2AB518.Therefore, when the second plaintiff told the fourth defendant about the guarantee a few days later, on or after 5 July 2014, the fourth defendant already knew from the first defendant’s earlier email that the guarantee had been issued – at least ostensibly – by ABN Amro and not by Credit Suisse.158Foot Note 158×Certified Transcript dated 24 October 2017, page 78, lines 5–15. 93 I accept the fourth defendant’s evidence. The fourth defendant’s failure to express surprise when the second plaintiff informed him that the banker’s guarantee had been issued by ABN Amro is too slender a circumstance from which to draw the inference that the fourth defendant received commissions from the second defendant and benefited personally from the fraud.159Foot Note 159×Closing submissions of the plaintiffs, paragraph 90.",
        "Payments from the second defendant to the fourth defendant": "94 The final strand of circumstantial evidence on which the plaintiffs rely is the undisputed evidence which shows that the second defendant transferred four sums of money from his personal account to the fourth defendant in 2014: (i) $55,000 on 10 March 2014; (ii) $50,000 on 23 March 2014;160Foot Note 160×Certified Transcript dated 2 April 2018, page 18, lines 21–32.(iii) $5,000 on 25 June 2014;161Foot Note 161×Affidavit of evidence in chief of the second plaintiff, paragraph 47.and (iv) $190,000 on 5 December 2014.162Foot Note 162×Affidavit of evidence in chief of the second plaintiff, paragraph 48.The plaintiffs draw specific attention to the fact that the second defendant did not make the last payment to the fourth defendant directly, but instead by depositing a cheque into a joint account held by the fourth defendant with his mother.163Foot Note 163×Affidavit of evidence in chief of the fourth defendant, paragraph 49. 95 The plaintiffs invite me to draw the inference that, by some or all of these payments, the second defendant paid the fourth defendant commissions as a reward for inducing the plaintiffs to participate in the Autostyle investment.164Foot Note 164×Certified Transcript dated 2 April 2018, pages 10 and 17.Their principal argument is that, by on or around 17 March 2014, the plaintiffs had effectively committed themselves to the Autostyle investment. It was on that date that they agreed to participate in the investment subject to the banker’s guarantee and certain amendments to the investment documentation.165Foot Note 165×Certified Transcript dated 2 April 2018, page 20, lines 21–22.Thus, the plaintiffs submit, the four payments which the second defendant made to the fourth defendant in 2014 are more likely than not to have been commissions linked to the plaintiffs’ participation in the Autostyle investment. 96 I reject the plaintiffs’ submission. At the 12 March 2014 meeting, the plaintiffs still had at least two concerns about the terms of the Autostyle investment. They asked whether the third defendant could reduce the 90-day period for the bank guarantee to be issued. They also asked for the right to withdraw the entire investment on demand.166Foot Note 166×Certified Transcript dated 2 April 2018, page 23, lines 19–31.On 17 March 2014, therefore, negotiations over the terms of the investment were still ongoing. The plaintiffs had not committed themselves to pay any money over to the third defendant, let alone actually paid over any money to the third defendant. The plaintiffs received the final documentation for the Autostyle investment only on 24 March 2014. They remitted the $1m to the third defendant only on 28 March 2014. Yet, according to the plaintiffs, the second defendant paid a total of $105,000 to the fourth defendant as his commission well before the plaintiffs paid over the proceeds of the fraud on 28 March 2014. No fraudster would agree to pay a commission to an accomplice before the victims of the fraud had paid over the proceeds of the fraud.167Foot Note 167×Certified Transcript dated 2 April 2018, page 21, lines 5–15.I therefore find that the two payments which the second defendant paid to the fourth defendant in March 2014 were unconnected to the plaintiffs’ participation in the Autostyle investment. 97 The fourth defendant has also provided an explanation for all four of the transfers from the second defendant, including the last two transfers. His evidence is that all of these payments relate largely to the second defendant’s reimbursement of expenses which the fourth defendant had incurred at the request of and on behalf of the second defendant.168Foot Note 168×Reply submissions of the fourth defendant, paragraphs 25–27.The fourth defendant has supported his explanation with contemporaneous instant messaging exchanges which he had with the second defendant and contemporaneous bank records showing the expenses which the fourth defendant had incurred and for which the second defendant was reimbursing him.169Foot Note 169×Affidavit of evidence in chief of the fourth defendant, paragraphs 48–50; pages 104–125.I accept the fourth defendant’s evidence in this regard. 98 The fourth defendant does concede that, just before the second defendant made the final payment of $190,000 into the fourth defendant’s joint account with his mother on 5 December 2014, the second defendant informed the fourth defendant of an intention to make a “goodwill payment” to him.170Foot Note 170×Affidavit of evidence in chief of the fourth defendant, paragraph 49.However the fourth defendant’s evidence is that the second defendant also informed him that he wanted, in the same payment, to make an advance to the fourth defendant to cover future expenses. 99 I do not consider that this evidence of a “goodwill payment” supports the plaintiffs’ case. Even assuming that part of this final payment of $190,000 includes a “goodwill payment”, that is neither here nor there. The plaintiffs have not suggested any credible evidence to connect this “goodwill payment” to the plaintiffs’ payment into the Autostyle investment which took place nine months earlier. And even if there were such a connection, a “goodwill payment” is equally consistent with both an honest and a dishonest intention on the part of the fourth defendant in dealing with the plaintiffs in connection with the Autostyle investment.171Foot Note 171×Certified Transcript dated 2 April 2018, page 18, lines 1–12.In other words, even taking the plaintiffs’ case at its highest, just because the second defendant foreshadowed an intention to pay an incentive to the fourth defendant for persuading the plaintiffs to invest in the Autostyle investment, this is insufficiently cogent to permit me to draw the inference that the fourth defendant was complicit in the third defendant’s fraud. That is so even if the incentive was undisclosed to the plaintiffs. It is not the plaintiffs’ case that the fourth defendant owed the plaintiffs any duty which would render a payment such as this improper in and of itself, whether it was disclosed or undisclosed. 100 To make the connection between these payments and an improper motive for inducing the plaintiffs to enter into the Autostyle investment, the plaintiffs rely on evidence from the first defendant that the second defendant had told him that the fourth defendant would be paid a commission if he were able to find persons willing to participate in the Autostyle investment. 101 Thus, the first defendant says this in his affidavit of evidence in chief:172Foot Note 172×Affidavit of evidence in chief of the first defendant, paragraph 7. … I am aware through the conversations that 2nd Defendant had with me, 4th Defendant will be paid commission if he recommended a client willing to invest in our overseas project. 2nd Defendant will pay from his personal banking account in OCBC Singapore Pte Ltd which is jointly owned by “Ng” and his female associate from Shanghai … 102 He goes on to say this in his supplementary affidavit of evidence in chief:173Foot Note 173×Supplementary affidavit of evidence in chief of the first defendant, paragraph 8. … I am deeply troubled over the monies that has been transferred to the 4th Defendant in the year of 2014; by way of the 2nd Defendant personal account held with joint name owner Ge YanRu. A total of sum of 300, 000 Singapore Dollars was transferred from the 2nd Defendant to the 4th Defendant who claims that these transactions was his personal loans to 2nd Defendant. Referred to in the plaintiff Affidavit. This is highly improbable and as the 1st Defendant who has a close working relationship with 2nd Defendant, I have been informed that these were commission accorded to 4th Defendant and need to managed on a personal basis instead of using the 3rd Defendant name to manage the transactions. … 103 I reject this evidence for a number of reasons. 104 First, the first defendant’s evidence in his affidavit of evidence in chief that the fourth defendant “will be paid” a commission by the second defendant is not evidence of the historical fact of such a payment. At most, it is capable of being evidence only as to an intention to do so in the future. There is no direct evidence before me that the second defendant followed through on his intention. Indeed, the only direct evidence available to me on the issue is the fourth defendant’s oral evidence. And the tenor of that direct evidence is unequivocal: there were no such commissions. 105 Second, to the extent that the first defendant’s evidence in his affidavit of evidence in chief carries within it an implied assertion that the second defendant actually followed through on his intention as to the future and did pay commissions to the fourth defendant, that implied assertion is not direct evidence of such payments within the meaning of s 62 of the Evidence Act (Cap 97, 1997 Rev Ed) (“Evidence Act”). The content of the implied assertion would not be a fact which the first defendant perceived with his own senses as s 62 requires. The plaintiffs were unable to demonstrate that this evidence was rendered admissible by any of the exceptions to s 62.174Foot Note 174×Certified Transcript dated 2 April 2018, page 14, lines 12–16.Only the second defendant could have given direct evidence in this action that he actually paid the commissions to the fourth defendant as intended. But the second defendant did not participate in the trial of this action in any way. The first defendant’s evidence is therefore inadmissible to prove the truth of the facts impliedly asserted within it. 106 Third, the implied suggestion in the first defendant’s affidavit of evidence in chief is inconsistent with the dates and times on which the payments were made, for reasons I have already given (see [96] above). 107 Fourth, the express statement in the first defendant’s supplementary affidavit of evidence in chief that these were commissions to the fourth defendant is framed purely as something which the first defendant has been informed. It is not within his personal knowledge. It is not direct evidence within the meaning of s 62 of the Evidence Act. The plaintiffs do not seek to admit the evidence under any exception to the requirement of direct evidence. 108 Fifth, the first defendant is not an honest witness. I have found that the first defendantwascomplicit in the second defendant’s and the third defendant’s fraud and held him personally culpable for it. The first defendant therefore has an obvious motive for seeking to implicate the fourth defendant. It is in the first defendant’s interest to spread the collective liability of the defendants across four defendants rather than only three. 109 I therefore decline to accord the first defendant’s evidence the weight necessary to constitute it cogent evidence of the fourth defendant’s complicity in the other defendants’ fraud.",
        "The fourth defendant’s role in the Autostyle investment": "110 I accept the fourth defendant’s evidence that his role in the Autostyle investment was simply as an intermediary, acting as a messenger between the plaintiffs and the third defendant.175Foot Note 175×Certified Transcript dated 30 April 2018, page 11 line 23 to page 12 line 3.Although the relationship between the fourth defendant and second defendant was indeed close, there is no evidence to establish on the balance of probabilities that the fourth defendant was anything more than a neutral messenger between the second defendant and the plaintiffs. 111 It is not in dispute that the fourth defendant did introduce the Autostyle investment opportunity to the plaintiffs. Beyond that however, the evidence shows that the fourth defendant did little, if anything, to persuade the plaintiffs to take up the opportunity. An examination of the correspondence between the fourth defendant and the second plaintiff when the terms of the investment were being discussed and negotiated shows that the fourth defendant simply conveyed the plaintiffs’ requests and instructions to the third defendant and conveyed the third defendant’s responses back to the plaintiffs.176Foot Note 176×Certified Transcript dated 30 April 2018, page 12, lines 3–6; reply submissions of the fourth defendant, paragraph 13. 112 It is true that the fourth defendant is unlikely to have acted even as a mere intermediary between the plaintiffs and the third defendant without some sort of an incentive. But I accept his evidence that his only incentive was to establish a long-term relationship with the other defendants and with the plaintiffs and their high net worth contacts.177Foot Note 177×Certified Transcript dated 30 April 2018, page 15, lines 26–29.As a senior relationship manager in a private bank, the fourth defendant is incentivised to establish close relationships with persons like the second plaintiff who can improve the fourth defendant’s prospects of bringing in business associates as private banking clients.178Foot Note 178×Affidavit of evidence in chief of the fourth defendant, paragraph 9.This customarily involves establishing strong personal connections with actual and potential private banking clients. It therefore appears to me that the role which the fourth defendant played as an intermediary in the Autostyle investment is neither an anomalous nor a surprising role for a senior relationship manager in a private bank to play. 113 Indeed, the fourth defendant’s position as a private banker suggests to me that it is unlikely that he would be complicit in the third defendant’s fraud. The entire purpose of his efforts in cultivating a relationship with the second plaintiff and her business associate would be entirely defeated if he were to introduce the second plaintiff to any transaction by which she ended up losing money, whether by reason of fraud or otherwise. It is true that the curious features I have identified above about the documentation for the Autostyle investment are more likely to have been noticed by the fourth defendant than by the plaintiffs, given that the fourth defendant was a banker, but that goes at most to negligence. Negligence is not the basis of the plaintiffs’ claim against the fourth defendant. Negligence is not fraud. And the fourth defendant’s failure to spot the curious features of the Autostyle investment is insufficiently cogent evidence from which to infer that the fourth defendant’s involvement was carried out with fraudulent intent. 114 It is further significant to me that, when the second plaintiff confronted the fourth defendant with the fact that the ABN Amro guarantee was a forgery, his reaction was to urge the second plaintiff to report the matter to the police so that it could be investigated. Even the second plaintiff had to accept in cross-examination that the fourth defendant’s reaction is inconsistent with his having been complicit in the fraud of the other defendants.179Foot Note 179×Certified Transcript dated 18 August 2017, page 31, lines 22–32. 115 In conclusion, I find that the fourth defendant was not complicit in the fraud of the other three defendants. The plaintiffs’ case to the contrary is founded on suspicion, speculation and conjecture rather than on evidence. Their pursuit of the fourth defendant in this action is, ultimately, nothing more than a manifestation of their disappointment in hindsight, perhaps most deeply in themselves, at having permitted themselves to be defrauded in the Autostyle investment.",
        "The six representations": "116 Having addressed and rejected the plaintiffs’ overarching allegation that the fourth defendant was complicit in the fraud which was the Autostyle investment, that is sufficient to dispose of the plaintiffs’ entire claim, confined as it is to fraudulent misrepresentation. 117 Nevertheless, I turn now to analyse the six misrepresentations on which the plaintiffs now rely and which I have listed at [76] above. I find that the plaintiffs’ claim resting on each of the six representations fails. For that reason, it is not necessary for me to consider the fourth defendant’s submission that some of the alleged misrepresentations on which the plaintiffs now choose to rely are not in fact pleaded.",
        "The first representation": "118 The first alleged representation is that Credit Suisse will issue a banker’s guarantee in the sum of $1m to the plaintiffs no more than 90 days after 31 March 2014 to secure the Autostyle investment.180Foot Note 180×Statement of Claim (Amendment No 1), paragraph 7(e).For the following reasons, I find that the plaintiffs’ claim resting on this misrepresentation fails. 119 First, as I have found, the fourth defendant did not make this representation on his own behalf.181Foot Note 181×Certified Transcript dated 30 April 2018, page 13, lines 19–28.Rather, he was simply conveying to the plaintiffs the position of the other defendants on one of the terms of a potential transaction between the plaintiffs and the third defendant. And he had no reason to adopt this representation as his own. I have found that the fourth defendant was not complicit in the other defendants’ fraud. Further, he was not a representative, employee or agent of the third defendant. He therefore had no knowledge of the genuineness of the third defendant’s intention to secure a banker’s guarantee from Credit Suisse and no control over whether that would happen. This representation relates to an action in the future (issuing a banker’s guarantee) to be carried out by a third party (Credit Suisse), in response to another action in the future (an application for a banker’s guarantee) to be carried out by another person (the third defendant).182Foot Note 182×Certified Transcript dated 30 April 2018, page 13 line 29 to page 14 line 4.He was not in any position to control either Credit Suisse or the third defendant’s actions. He had no reason to adopt the second defendant’s representation to this effect and make it his own, and did not do so. 120 Second, even if the third defendant adopted this representation as his own, it is not a representation of present fact. Instead, this representation in terms relates to an event in the future. A representation as to an event in the future is not, without more, a representation of present fact183Foot Note 183×Certified Transcript dated 30 April 2018, page 13, lines 29–32.and is not actionable as a misrepresentation:The Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) at para 11.029. 121 The plaintiffs try to get around this principle by arguing that the representation was indeed one of present fact because the act,iethe issuance of the banker’s guarantee, was to take place upon the investment and be completed within 90 days.184Foot Note 184×Certified Transcript dated 2 April 2018, page 46, lines 15–32; closing submissions of the plaintiffs, paragraph 95.That argument is fundamentally misconceived. No doubt, the obligation to procure a banker’s guarantee would bind the third defendant as soon as the plaintiff signified its contractual assent to the Autostyle investment. But that is an entirely different question from the question whether, at the time the fourth defendant made the representation, it was then a representation of existing fact. It was not. This representation was fundamentally promissory in nature, but promissory only as between the third defendant and the plaintiffs. 122 I accept the plaintiffs’ submission, however, that a statement as to an event in the future may, in certain circumstances, be an actionable misrepresentation. For this submission, the plaintiffs rely onBankLeumi le Israel BM v British National Insurance Co Ltd and others[1988] 1 Lloyd’s Rep 71 (“BankLeumi”) at 75, which was cited by the High Court inDeutsche BankAG v ChangTse Wen[2013] 1 SLR 1310 at [95]. The plaintiffs argue that a representation as to the future may be actionable if it carries with it a representation that the representorbelievesthat the future event will transpire as he has represented that it will. In those circumstances, the misrepresentation would carry within it a representation of present fact,ieof the representor’s state of mind at the time the representation is made. 123 But it is important to respect the very real distinction between a representation as to an event in the future and a representation as to an event in the future coupled with a representation as to the representor’s present state of mind. Failing to respect the distinction will undermine entirely the rule that an actionable misrepresentation must make a misrepresentation of present fact. I heed the warning of Lord Wilberforce inBritish Airways Board v Taylor[1976] 1 WLR 13 at 17: … Everyone is familiar with the proposition that a statement of intention may itself be a statement of fact and so capable of being true or false.But this proposition should not be used as a general solvent to transform the one type of assurance with another: the distinction is a real one and requires to be respected… [emphasis added] 124 The plaintiffs’ attempt to rely on theBankLeumiprinciple fails because of an absence of evidence. Even if I accept, for the sake of argument, that the first representation was coupled with the fourth defendant’s implied representation that he honestly believed Credit Suisse would issue a banker’s guarantee in the sum of $1m no more than 90 days after 31 March 2014 to secure the Autostyle investment, the plaintiffs can succeed only if they can prove on the balance of probabilities, that the fourth defendant lacked an honest belief when making this representation that the Credit Suisse guarantee would be issued. This point was emphasised by the Court of Appeal inTan Chin Sengand others v Raffles Town Club Pte Ltd[2003] 3 SLR(R) 307 at [12] and [14]: 12  A representation is a statement which relates to a matter of fact, which may be a past or present fact.But a statement as to a man’s intention, or as to his own state of mind, is no less a statement of fact and a misstatement of a man’s mind is a misrepresentation of fact: perBowen LJ inEdgingtonv Fitzmaurice(1885) 29 Ch D 459 at 483. … 14 Of course, it will be difficult to prove what was the state of a person’s mind at any particular point in time. Nevertheless,that is a matter of proof and it should not be confused with the substantive principles of law. [emphasis added] There is no evidence that the fourth defendant did not subjectively believe, at the time he made the first representation, that the other defendants would procure Credit Suisse to issue a bank guarantee in the sum of $1m within 90 days of 31 March 2014 to secure the Autostyle investment. 125 Third, I do not accept that the plaintiffs acted on or relied on the first representation in taking their decision to enter into the investment.185Foot Note 185×Certified Transcript dated 2 April 2018, page 41 line 12 to page 43 line 4.A defendant can be liable on a misrepresentation only if the misrepresentation induced the representee to act as he did and to suffer loss. As stated inAlwieHandoyoat [188], the representation must have a “real and substantial effect on the representee’s mind such that it can be said to beaninducing cause which led him to act as he did” [emphasis in original]. 126 A critical aspect of the plaintiffs’ case is that it was of the utmost importance to them that the banker’s guarantee be issued by Credit Suisse and by no other bank. That is why the plaintiffs say they asked the fourth defendant to supply to them a “draft” of the guarantee to be issued by Credit Suisse. Without that “draft” guarantee which the fourth defendant supplied to them on 17 March 2014, the plaintiffs say that they would never have paid the $1m to the fourth defendant under the Autostyle investment.186Foot Note 186×Certified Transcript dated 2 April 2018, page 38, lines 5–25. 127 The plaintiffs insisted at trial on characterising what they asked the fourth defendant to supply to them as adraftof the Credit Suisse banker’s guarantee. They did this in order to emphasise that they wanted to see the precise form of words which it was their contractual right, upon entering into the Autostyle investment, to insist that the third defendant supply to them within the 90-day period.187Foot Note 187×Certified Transcript dated 2 April 2018, page 29, lines 8–10; page 33, line 23–31.The fourth defendant’s case is that what they wanted and what they received was asamplebanker’s guarantee,ie, one which the plaintiffs wanted to review simply for their own edification.188Foot Note 188×Defence of the fourth defendant (Amendment No 2), paragraph 17.The plaintiffs valiantly resisted any attempt to characterise what they received as a “sample” rather than a “draft”. I have already found that all the plaintiffs wanted was a sample banker’s guarantee (see [59] above). 128 I do not accept the plaintiffs’ evidence that a Credit Suisse banker’s guarantee was of critical importance to them in their decision to invest.189Foot Note 189×Certified Transcript dated 30 April 2018, page 12, lines 7–15.I also reject the plaintiffs’ argument that they would not have invested if they knew from the outset that the banker’sguarantee ultimately issued would come from a bank other than Credit Suisse. Likewise, I find that the precise form of words adopted in the banker’s guarantee was not of importance to the plaintiffs in entering into the investment. 129 The first point I make is that the plaintiffs possess a degree of commercial sophistication. The first plaintiff runs a construction business.190Foot Note 190×Certified Transcript dated 18 August 2017, page 58, lines 16–17.As such, he is personally familiar with performance bonds, instruments which are very similar to banker’s guarantees. The second plaintiff is also involved in the construction and real estate industry.191Foot Note 191×Certified Transcript dated 17 August 2017, page 15, lines 15–17.I do not accept that the plaintiffs in deciding to participate in the Autostyle investment would have considered the specific identity of Credit Suisse to be critical. What was critical to the plaintiffs was that their investment should be secured such that they could have recourse to a bank if the third defendant defaulted on its contractual obligations. In other words, it is my finding that what the plaintiffs wanted was a genuine and operable guarantee, regardless of its precise form and regardless of which bank issued it. Therefore, I find that even if the first representation was indeed adopted as his own by the fourth defendant and is actionable, the plaintiffs did not rely on it in entering into the Autostyle investment.",
        "The second representation": "130 The second representation is that that, because the third defendant maintains a bank account with Credit Suisse, and because the fourth defendant is the banker at Credit Suisse handling the third defendant’s account, the fourth defendant is able to warrant the financial status of the third defendant and to ensure that the banker’s guarantee will be issued by Credit Suisse.192Foot Note 192×Statement of Claim (Amendment No 1), paragraph 7(f).I find that the plaintiffs’ claim resting on this misrepresentation fails. 131 The second representation is undoubtedly true insofar as it asserts as a fact that: (i) the third defendant maintains a bank account with Credit Suisse; (ii) the fourth defendant is a banker at Credit Suisse; and (iii) the fourth defendant is able to see the flow of funds into and out of the fourth defendant’s account. To that extent, I am prepared to assume in the plaintiffs’ favour that the fourth defendant made this representation. 132 But there was simply no reason for the fourth defendant, as an intermediary who was not complicit in the other defendants’ fraud and without any incentive to persuade the plaintiffs to enter into a fraudulent investment, to warrant the financial status of the third defendant. I find that the fourth defendant did not make the second representation insofar as that alleged warranty is concerned. In any event, a warranty as to the financial status of the third defendant is a representation as to the future and isprima facienot actionable. Given that I have found that the fourth defendant was not complicit in the fraud of the other defendants, there is no basis for finding that the fourth defendant, even if he made this representation, did so fraudulently.",
        "The third representation": "133 The third representation is that the Autostyle investment is safe and secure, because the fourth defendant was managing the third defendant’s bank account.193Foot Note 193×Statement of Claim (Amendment No 1), paragraph 10(c).I find that the plaintiffs’ claim resting on this misrepresentation fails. 134 The third representation falls into two parts. The first part is that the Autotyle Investment is “safe and secure”. There is simply no reason for the fourth defendant to represent that the Autostyle investment was “safe and secure”. As I have found, he was a pure intermediary, not complicit in the fraud and without any incentive to persuade the plaintiffs to enter into a fraudulent investment. And even if it were to be assumed that the fourth defendant did make this representation, it was a representation as to the future, not as to present fact. There is no evidence that the fourth defendant did not subjectively hold this belief at the time he is alleged to have made the representation. 135 The second part of the third representation is that the fourth defendant was managing the third defendant’s bank account. The import of this representation appears to be the plaintiffs’ claim that the fourth defendant represented that he would keep an eye on the third defendant’s account with Credit Suisse and sound the alarm if the plaintiffs’ funds were put to improper use.194Foot Note 194×Certified Transcript dated 2 April 2018, page 70, lines 15–16.It is not entirely clear what the plaintiffs mean by this except that counsel for the plaintiffs seems to suggest that, to carry through on this representation, the fourth defendant would have warned the plaintiffs if their investment of $1m was not transferred to Autostyle in accordance with the term note. The plaintiffs argue that this part of the third representation is necessarily false because it would result in the fourth defendant breaching his obligations of banking secrecy.195Foot Note 195×Certified Transcript dated 2 April 2018, page 74, lines 8–25; closing submissions of the plaintiffs, paragraph 79. 136 The plaintiffs’ argument is again without merit. It is undisputed that the fourth defendant, as the third defendant’s banker, would have sight of the flow of funds into and out of the third defendant’s Credit Suisse bank account.196Foot Note 196×Closing submissions of the plaintiffs, paragraph 78; certified transcript dated 2 April 2018, page 70, lines 20–23.But there is no evidence that the fourth defendant represented anything more than that,iethat he would breach banking secrecy by informing the plaintiffs of the flow of funds. There is also little reason why the fourth defendant as an intermediary would personally make such a representation. In any event, in cross-examination, the second plaintiff accepted197Foot Note 197×Certified Transcript dated 17 August 2017, page 49 line 3 to page 51 line 3.that it is not part of the plaintiffs’ case that, by this representation, the fourth defendant undertook to inform the plaintiffs if the third defendant used the plaintiffs’ $1m funds improperly. The first plaintiff too accepted that it was merely his impression that the fourth defendant would do so.198Foot Note 198×Certified Transcript dated 18 August 2017, page 72, lines 5–10.",
        "The fourth representation": "137 The fourth representation is that Credit Suisse is able to issue the banker’s guarantee to secure the investment because Autostyle’s inventory would be pledged to Credit Suisse.199Foot Note 199×Statement of Claim (Amendment No 1), paragraph 7(g).I find that the plaintiffs’ claim resting on this misrepresentation fails. 138 Counsel for the plaintiffs sought to argue that even though there was collateral to be pledged, it was to be Autostyle’s collateral and that the eventual guarantee was to be issued by Autostyle and not Credit Suisse.200Foot Note 200×Closing submissions of the plaintiffs, paragraph 76; Certified Transcript dated 2 April 2018, page 56 line 22 to page 57 line 5.In my view, even if such a representation was made, it was immaterial. It is clear to me that, if the ABN Amro banker’s guarantee had been genuine, this action would not have been commenced and the plaintiffs would not now be alleging any of these misrepresentations.",
        "The fifth representation": "139 The fifth representation is that the 90-day period for Credit Suisse to issue the banker’s guarantee was necessary for the subject matter of the Autostyle investment to be pledged to Credit Suisse before the banker’s guarantee could be issued.201Foot Note 201×Statement of Claim (Amendment No 1), paragraph 13.I find that the plaintiffs’ claim resting on this misrepresentation fails.202Foot Note 202×Certified Transcript dated 30 April 2018, page 14 line 28 to page 15 line 2. 140 Counsel for the plaintiffs alleges that the requirement of 90 days is unusual and suspicious203Foot Note 203×Certified Transcript dated 2 April 2018, page 57 line 25 to page 58 line 26.because the fourth defendant’s evidence was that a banker’s guarantee from Credit Suisse could be processed within a week.204Foot Note 204×Certified Transcript dated 24 October 2017, page 54, lines 8–11.They submit that the fourth defendant, when asked about his knowledge of why a period as long as 90 days was required, was evasive and inconsistent in his explanation.205Foot Note 205×Closing submissions of the plaintiffs, paragraphs 64–65. 141 I reject the plaintiffs’ submission. I find that the fourth defendant’s evidence is largely consistent. I am inclined to believe that the fourth defendant did ask the second defendant about the 90-day period but was not given an explanation.206Foot Note 206×Certified Transcript dated 24 October 2017, page 53, lines 5–16.The fourth defendant’s account is corroborated by the Whatsapp conversation dated 18 March 2014 between the two parties, where in effect, the fourth defendant queried the reason for the 90-day period on behalf of the plaintiffs.207Foot Note 207×Supplementary Bundle of Documents of the fourth defendant, page 16.The fourth defendant’s query was rebuffed. The fourth defendant has maintained that he did not know why the third defendant required 90 days to procure a bank guarantee.208Foot Note 208×Certified Transcript dated 24 October 2017, page 51 line 24 to page 54 line 13.In the course of cross-examination, the fourth defendant postulated that the 90-day period may simply be the business conditions of Autostyle. In my view, this postulation of the fourth defendant is not inconsistent with a genuine honest belief by the fourth defendant that the 90-day period was simply required as part of the Autostyle investment. 142 Moreover, the plaintiffs knew that the stated purpose of the $1m which they invested was to acquire inventory.209Foot Note 209×Certified Transcript dated 2 April 2018, page 59 line 4 to page 60 line 2.They also knew that the third defendant’s position was that the 90 days was required for the inventory to be pledged so that a banker’s guarantee could be issued. The mere fact that the fourth defendant knew that Credit Suisse could issue a banker’s guarantee within a week210Foot Note 210×Certified Transcript dated 24 October 2017, page 54, lines 8–11.does not assist the plaintiffs’ case. Given that this was the arrangement that the plaintiffs and the fourth defendant were working with, I do not see how the requisite element of dishonesty on the fourth defendant’s part is made out.",
        "The sixth representation": "143 The sixth representation is that the fourth defendant had also invested in the Autostyle investment and that the Autostyle investment was secure. I find that the plaintiffs’ claim resting on this misrepresentation fails. 144 The fourth defendant did send a Whatsapp message dated 1 April 2015 to the plaintiffs suggesting that he had invested in Autostyle.211Foot Note 211×Affidavit of evidence in chief of the second plaintiff, page 34; Certified Transcript dated 25 October 2017, page 15 line 10 to page 16 line 12.But the fourth defendant’s evidence at trial was that he did not invest.212Foot Note 212×Certified Transcript dated 2 April 2018, page 89–90.Given that the Whatsapp correspondence took placeafterthe plaintiffs had already signed the documents and transferred their $1m for the Autostyle investment, there is no element of reliance on it. It appears to me that the fourth defendant’s representation here was simply an effort to empathise with the plaintiffs’ situation given that there were some delays in recovering their investment.213Foot Note 213×Certified Transcript dated 2 April 2018, page 100, lines 1–11.",
        "Conclusion": "145 The real causes of the plaintiffs’ loss are the first, second and third defendants. The plaintiffs pursue the fourth defendant only because these remaining defendants are either unavailable to be sued or insolvent. 146 For the foregoing reasons, I dismiss the plaintiffs’ claim against the fourth defendant with costs. Vinodh CoomaraswamyJudge Leslie Yeo, Jolene Tan and Shriveena Naidu (Sterling Law Corporation) for the first plaintiff and the second plaintiff;The first defendant in person;The second defendant absent and unrepresented;The third defendant absent and unrepresented;L Devadason, Chong Jia Hao and Goh Hui Hua (LegalStandard LLP) for the fourth defendant."
    }
}