{
    "case_title": "BTN and another vBTP and another",
    "ncitation": "[2019] SGHC 212",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1 In Originating Summons No 683 of 2018 (“OS 683”), the first and second plaintiffs, known henceforth as the Companies, characterise the partial arbitral award dated 30 April 2018 (‘the Partial Award”) as a negative jurisdictional decision and seek a review of the arbitral tribunal’s decision pursuant to s 10(3)(b) of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (the “IAA”). In the alternative, the Companies seek to set aside the Partial Award on a multitude of grounds pursuant to s 24(b) of the IAA and Art 34(2) of the UNCITRAL Model Law on International Commercial Arbitration (“Model Law”) as set out in the First Schedule to the IAA. 2 The Partial Award was a decision on the legal questions submitted to an eminent three-member tribunal (“the Tribunal”) pursuant to a list of agreed legal issues. In these circumstances, a challenge on a jurisdiction ground is surprising.  At the same time, a jurisdictional challenge is not that surprising seeing how any arguments on the legal or factual mistakes made by a tribunal can be reviewed based on ade novoreview of the award if the challenger succeeds on the argument that a jurisdictional ground is engaged. 3 The Singapore courts have time and again cautioned against the creativity of parties in crafting their arguments based on an alleged breach of natural justice (BLC and others v BLB and another[2014] 4 SLR 79 (“BLC v BLB”) at [4] andCoal & Oil Co LLC v GHCL Ltd[2015] 3 SLR 154 (“Coal & Oil”) at [3]). The same caution applies to jurisdictional challenges.  A challenger may stretch the concept of jurisdiction in an attempt to shoehorn his dissatisfaction with an arbitral award into a jurisdictional challenge in order to seek ade novoreview of a tribunal’s decision. 4 In this Judgment, the first issue to consider is the allegation that the Partial Award is a ruling on negative jurisdiction. This issue will require a close analysis of the reasoning in the Partial Award on the legal issues pertaining to the termination of the defendants’ employment, identified as the “Construction Issue” and the “Res JudicataIssue” in [20] below. This Judgment will then address the alternative grounds brought by the Companies. It will examine whether the Tribunal had failed to deal with an issue where the determination of that issue is essential to the decision reached in the Partial Award. In this context, an issue is essential where the decision cannot be justified because the particular key issue has not been decided. In this regard, this Judgment will examine whether the arguments now put forth in OS 683 had been put to the Tribunal as issues and in the same terms as are now being ventilated. I will be referring to the complaints in precise terms in due course. Suffice it to say for now that if the Tribunal had dealt with the issue put to it, that is the end of the review for it does not matter for the purposes of s 24(b) of the IAA and Art 34(2) of Model Law that the Tribunal had dealt with it wrongly. The central tenor of the Companies’ case is that they were deprived of the opportunity to present their case in defence to a US$35m claim. This Judgement will examine the facts leading to this deprivation that the Companies complain of to decide whether the circumstances call for an exercise of the court’s power to review the Tribunal’s decision under s 10(3) or to set aside the Partial Award.",
        "Background facts": "",
        "Sale of the second plaintiff by the defendants to the first plaintiff": "5 The defendants were the owners of a group of companies (“the Group”), of which the second plaintiff, BTO, is the principal holding company. BTO is an online travel agency incorporated in Malaysia. On 26 September 2012, the defendants, along with two other owners of the Group entered into a Share and Purchase Agreement (“the SPA”) with the first plaintiff, BTN. BTN is a publicly listed company, incorporated in Mauritius. Pursuant to the SPA, BTN acquired 100% ownership and control of the Group on both the shareholder and board level. 6 The consideration for the acquisition was made up of two elements: the Guaranteed Minimum Consideration of US$25m and the Earn Out Consideration. The latter element depended on the financial performance of the Group in financial years 2013, 2014 and 2015, calibrated based on the different levels of Earn Out Targets for each financial year as specified in the SPA, up to a maximum amount of US$35m. 7 The SPA also stipulated that the defendants had to be employed by BTO. The employments of the defendants (“the Employees”) were governed by the respective Promoter Employment Agreements (“PEAs”), unsigned versions of which had been annexed to the SPA. Pursuant to the PEAs signed in November 2012, BTP, the first defendant, was employed as the Chief Executive Officer and BTQ, the second defendant, as the Chief Technical Officer. The PEAs were signed by the respective employees, and BTO as the employer and BTN as the confirming party. Both the SPA and PEAs contained materially identical provisions as to the Employees’ “With Cause” and “Without Cause” termination. Clause 15.1.2 in both PEAs, governing without-cause termination, stated: If the Company terminates the Employment without cause (that is at will for reasons other than as specified in Clause 14.2 [sic] below) ... the Employee shall, only be entitled to receive (1) Remuneration which has accrued but has not been paid up to the date of termination … (2) severance pay ... and (3)such payments as may be expressly specified as payable upon ‘Without Cause’ termination under Clause 12.9.3 of the Share Purchase Agreement. … [emphasis added] 8 The Company referred to in the PEAs was BTO, and the reference to cl 12.9.3 of the SPA should be a reference to cl 12.9.2 instead, and this is not disputed. Clause 12.9.2 of the SPA provides that the consequence of a without-cause termination was that BTN was to pay the Employees an amount equal to 100% of the Earn Out Consideration Tranche that would have been payable to them for the unpaid term of the Earn Out Period, assuming achievement of a percentage level of Earn Out Targets equal to 100% for the remaining financial years in the Earn Out Period. This means that on the facts, if the dismissals of the Employees were without cause, then they would be entitled to US$35m. Whereas if the dismissals were with cause, then they would not be entitled to any Earn Out Consideration. 9 Without-cause termination was termination for reasons other than those justifying a with-cause termination. With-cause termination was defined in cl 12.9.1 of the SPA and cl 15.2.1 of the PEAs. The relevant grounds for with-cause termination in the PEAs (mirroring the grounds set out at cl 12.9.1 of the SPA) were as follows: 15.2 Termination of Employment of the Promoter by the Company With Cause (“With Cause”) 15.2.1 The Company shall be entitled at any time to terminate the Employment with cause by summary notice and the termination shall be effective on and from the date of such notice of termination of Employment, (A) if the Employee:- … (v) in the performance of his duties under the Transaction Documents and/or this Agreement or otherwise, commits any act of gross misconduct or gross negligence or wilful insubordination; or (vi) has committed an act of willful [sic] damage/willful [sic] omission to commit an act which has resulted in material loss or damage to the Company and/or [Group] entity; (vii) has ... behaved in a manner that is materially detrimental to the interests of the Company and/or other [Group] entity; (viii) where in any Finance Year (as defined in the Share Purchase Agreement) during the Earn Out Period (except in respect of any Financial Year where, inter alia, the Company and the Employee have jointly determined that a Force Majeure Event (as defined in the Share Purchase Agreement) has accrued and, inter alia, the Employee, has issued a Force Majeure Notice in respect of that Financial Year) the Employee have not achieved in respect of the Business: (1) 50% or above of the Earn Out Target (as defined in the Share Purchase Agreement) …; or (2) a positive EBITDA; and within 90 (ninety) days of the Audited Accounts for the Business for the relevant Financial Year being adopted in accordance with the Share Purchase Agreement the Company has terminated the employment of the Employee; … EBITDA was defined in the SPA as “earnings (positive or negative) from operations of the [Group], in relation to the Business before interest, tax, depreciation and ammortisation for a Financial Year, determined on the basis of the Audited Accounts”. 10 The dispute resolution clause (cl 18.4) and the jurisdiction clause (cl 18.5.1) in the PEAs were as follows: 18.4 Dispute Resolution 18.4.1 If any dispute, controversy or claim between the Parties arises out of or in connection with this Agreement, including the breach, termination or invalidity thereof (“Dispute”), the Parties shall use all reasonable endeavours to negotiate with a view to resolving the Dispute amicably. Specifically it is agreed that in respect of any warranty claim or claim for breach of contract or agreement or breach of other clause hereunder which is capable of remedy, subject to the same not prejudicing in any manner the non defaulting Party, the non defaulting Party shall give an opportunity to the defaulting party, to remedy such breach, at no cost to such non defaulting Party in an immediate basis and in any event within 30 (thirty) Business Days from the date of notification by the non-defaulting Party. In the event the concerned Parties are unable to resolve the Dispute amicably within 30 (thirty) days (or such other extended period as may be mutually agreed to in writing by the Parties), any Party (“Claimant”) may refer the Dispute to arbitration by issuing to the other Party (“Respondent”) a notice (“Dispute Notice”) upon which the Dispute shall be referred to arbitration in accordance with the terms of Clause 18.4.2 below. 18.4.2 Subject to Clause 18.4.1 above, any Dispute shall be finally submitted to binding arbitration in accordance with the Arbitration Rules of the Singapore International Arbitration Centre (“Arbitration Rules”). … 18.4.3 The arbitrators shall have powers to award and/or enforce specific performance. The arbitration award shall be final and binding on the Parties and the Parties shall be entitled to apply to a court of competent jurisdiction for enforcement of such award. … The venue of the arbitration shall be Singapore. The language of the arbitration shall be English. … 18.5 Governing Law and Jurisdiction 18.5.1 This Agreement and the relationship between the Parties hereto shall be governed by, and interpreted in accordance with, the laws of Malaysia. Subject to the provisions of Clause 18.4 (Dispute Resolution), the courts of Malaysia shall have exclusive jurisdiction in relation to all matters arising out of this Agreement. 11 The dispute resolution clause in the SPA (cll 17.4(a), (b) and (c)) is substantially the same as cll 18.4.1, 18.4.2 and 18.4.3 of the PEAs. However, the governing law and jurisdiction clause under the SPA is different: 17.5 Governing Law and Jurisdiction This Agreement and the relationship between the Parties hereto shall be governed by, and interpreted in accordance with, the laws of Mauritius, without reference to the conflict of law principles. Subject to the provisions of Clause 17.4 (Dispute Resolution), the courts of Mauritius shall have exclusive jurisdiction in relation to all matters arising out of this Agreement.",
        "The dismissals": "12 On 8 January 2014, BTO gave notices to the Employees, summarily dismissing them “pursuant to Clause 15.2.1 of the [PEA] and Clause 12.9.1 of the [SPA]”. The letters were written “with reference to the [SPA]... and the [respective PEA]”, and cited the four grounds of with-cause termination at [9] above. In relation to ground under cl 15.2.1(viii), the termination notices stated that the Employees had “acknowledged and agreed that [BTO] [would] not achieve positive EBITDA for 2013” and “the audited accounts, once they [were] prepared, [would] also inevitably demonstrate this to be the case”. As for the other three grounds, various reasons were cited in the termination letter sent to BTP, including his failure to properly manage BTO’s cash flows, his misrepresentation to the board of directors in respect of accurate reporting on the quantum of fraud costs, and the taking of excessive, abrupt and/or inappropriately timed holiday leaves. The letters also reminded the Employees that subsequent to the termination of their employment, they continued to be bound by the SPA and the surviving provisions of the PEAs.",
        "The MIC proceedings": "13 In response, the Employees commenced proceedings under s 20 of the Industrial Relations Act 1967 (Act 177) (Malaysia) (the “IRA”). This provision allows a workman, defined as any person employed under a contract of employment, who considers that he has been dismissed without just cause or excuse to complain to the Director General of Industrial Relations. The Director General may direct attendance at a conference for the purposes of settlement. Where he is satisfied that there is no prospect of a settlement, he is to notify the Minister for Industrial Relations, who may, if he thinks fit, refer the matter to the Malaysian Industrial Court (“MIC”). Section 20 states: Representations on dismissals 20.(1) Where a workman ... considers that he has been dismissed without just cause or excuse by his employer, he may make representations in writing to the Director General to be reinstated in his former employment... ... (2) Upon receipt of the representations the Director General shall take such steps as he may consider necessary or expedient so that an expeditious settlement thereof is arrived at; where the Director General is satisfied that there is no likelihood of the representations being settled, he shall notify the Minister accordingly. (3) Upon receiving the notification of the Director General under subsection (2), the Minister may, if he thinks fit, refer the representations to the Court for an award. (4) Where an award has been made under subsection (3), the award shall operate as a bar to any action for damages by the workman in any court in respect of wrongful dismissal. ... 14 Under s 29(g) of the IRA, the MIC has power to do “all such things as are necessary or expedient for the expeditious determination of the matter before it”. The IRA provides a right of appeal to the High Court of Malaysia on a question of law. The MIC may make an order directing any party to comply with an award pursuant to a complaint of non-compliance, and failure to comply with the order is a criminal offence (s 56 of the IRA). 15 Following the statutory process, the Employees and BTO (represented by Mr K, a director of BTN and BTO) attended the mandatory conciliation meeting. However, no settlement was reached and the cases were referred to the MIC. The notice of the referral was sent by the Director General to the Employees and BTO. The MIC adjourned the hearings of the cases multiple times due to the absence of BTO and it sent BTO multiple notices of the proceedings by registered post. In the meantime, the Employees filed their statements of case, in which they stated the alleged grounds of their dismissals and denied the allegations. They exhibited the SPA, their respective PEAs and respective notices of termination. They sought for a declaration that their terminations of employment were without just cause and excuse and sought to be reinstated to their former positions. 16 BTO was directed to file a reply to the claims. Again, it failed to respond and engage with the proceedings. BTO claimed before the Tribunal and in OS 683 that the notices had been concealed by one of its employees. BTO subsequently conducted an inquiry and dismissed the employee. In any case, it is not disputed that the notices were properly served on BTO. 17 After BTO’s lack of response to the multiple notices sent, the MIC proceeded to hear the Employees’ claims in the absence of BTO. Documentary evidence, as included in the statements of case, was before the MIC. The Employees were represented by counsel, and they were called as witnesses to give evidence. The MIC gave judgment in their favour on 6 April 2015 and 29 July 2015 respectively (“the MIC Awards”). The MIC declined to order reinstatement but awarded compensation for lost salary. In the award in relation to BTQ, Mr N (name redacted), the Chairman of the MIC, after setting out the background facts and the four grounds of dismissal, held that the burden of proof was on BTO to establish the allegations against BTQ on a balance of probabilities. He held as follows: 5.Evaluation ... It was incumbent upon the company to come to court to justify the dismissal of the claimant. This is the statutory duty imposed upon the company by section 20 of the [IRA]. The company had to establish that the dismissal was with just cause or excuse. It was the duty of the court in [sic] to inquire into grounds given by the company to dismiss the claimant. However, as the company had elected not come [sic] to court at its own risk, the allegations against the claimant had remained unproven. The assertion of the claimant that he did no wrong remains unrebutted. 6.Finding For the reasons given, it is the finding of this court that the dismissal is without just cause or excuse. 18 In the award in relation to BTP, Mrs R (name redacted), also the Chairman of the MIC, held as follows: Issues The issues to be determine is [sic] whether: (i) the misconduct complained of by the Company has been established; (ii) if so, whether the dismissal was with just cause or excuse. Findings In a dismissal case, the burden is on the Company to prove that the employee had committed the alleged misconduct for which he had been dismissed. The standard of proof required is on a balance of probabilities. In the present case, the Company was absent from day one dispite [sic] several notices has [sic] been served on the Company’s address. The Company did not show any interest of [sic] the Claimant’s claim as until the case is fixed forex-partehearing not a single document was filed by the Company. Here the Court is left with no alternative but to rely on the Claimant’s testimony and the documents produced by the Claimant before the Court. Accordingly this Court held that on the balance of probabilities the Company failed to prove the Claimant’s misconduct. In view of the answer to the first issue is in the negative, there is no necessity to go into the second issues. Hence the Court finds that the Claimant’s dismissal was without just cause or excuse. 19 Subsequent to the MIC Awards, repeated letters from the Employees to BTO demanding payment of the compensation were ignored. The Employees commenced non-compliance proceedings against BTO, and in the adjourned hearing, BTO finally appeared through its counsel. It initially wanted to challenge the MIC Awards but decided to make full compensation to the Employees. BTO claimed that the employee that had concealed the notices finally notified BTO’s management of the notices on 16 February 2016, just before the non-compliance hearing. By then, it was about seven months after the MIC Awards were delivered, and after the three-month period for seeking judicial review of the MIC Awards (although the Employees claim that an extension of time could have been applied for).",
        "The arbitration proceedings": "20 In July 2016, the Employees commenced arbitration proceedings under the SPA, claiming that they had been dismissed without cause and were therefore entitled to receive US$35m. Prior to commencing arbitration, the solicitors representing the Employees wrote to the Companies demanding payment of the Earn Out Consideration, in the amount of US$35m. The Companies did not pay. In the arbitration, the Companies rebutted that the dismissals were with cause on the basis that the Employees had failed to cause the Group to achieve a positive EBITDA in financial year 2013 and behaved in ways that were materially detrimental to the interests of the Group. The Employees claimed that these issues wereres judicataby virtue of the MIC Awards (the “Res JudicataIssue”) and that as a matter of construction of the SPA and the PEAs, a determination under the PEAs that the dismissals were without cause was binding for the purposes of the SPA (the “Construction Issue”).",
        "List of legal issues": "21 As a result of late submissions of new materials, the Tribunal decided to adjourn the hearing on evidentiary issues and to proceed with the hearing on legal issues. The parties were able to agree on all the legal issues but one point – the Companies wanted the list to include the issue whether the Group achieved a positive EBITDA for financial year 2013, which the Employees opposed. This issue was excluded by the Tribunal on the basis that it touched on the evidence. On 29 November 2017, the Tribunal issued Procedural Order No 5, setting out the agreed list of legal issues. The Tribunal explained later in its award that the hearing was to “hear discrete issues on points of law insofar that they could be entirely divorced from factual matters”, and it became apparent that “there were potentially determinative points of law capable of resolution in this way, that the parties were aware of those points of law and were fully prepared to argue them”.1Foot Note 1×Partial Award at [106].The list of issues was as follows: A. What, if anything, is the effect of the judgments of the Malaysian Industrial Court? 1. What are the issues before the Tribunal in this arbitration that are said to be thesubject of res judicata? 2. What did the Malaysian Industrial Court decide? 3. What law governs the question of res judicata? 4.Are the findings of the Malaysian Industrial Court binding on theTribunal? Question A.4 will include: (a) the question ofwhether the decisions of the Malaysian Industrial Court are binding as a matter of contract on a proper interpretation of the SPA and PEAs, in addition to thequestions of res judicata under the general law; and (b) determination of all issues necessary to resolve whether the findings of the Malaysian Industrial Court are binding on both Respondents, including (i) all questions of Mauritian law (if that is the applicable law) and (ii)whether any preclusive effect extends to the First Respondentas well as the Second Respondent (whether by way of privity, the doctrine of co-interested parties or otherwise). B. Issues relating to the interpretation of Clause 12.9.1(viii) of the SPA 1. Can the Respondents rely on clause 12.9.1(viii) in circumstances where no “Audited Accounts” (as defined in the SPA) had been prepared and/or adopted at the time of the dismissal? 2. Is strict compliance with the definition of “Audited Accounts” (as defined by the SPA) essential for a valid dismissal under clause 12.9.1(viii) of the SPA? [emphasis added in underlined italics]",
        "Parties’ cases onres judicataand contractual constructionbefore the Tribunal": "22 The hearing of the legal issues took place on 6 and 7 December 2017. Before the Tribunal, counsel for the Employees submitted thatissue estoppel appliedbecause the same issues were most plainly raised in the MIC. Although the MIC did not decide that the dismissals were without cause but decided that the dismissals were “without just cause or excuse” under s 20 of the Act, the grounds for dismissal considered by the MIC were identical to those before the Tribunal. BTO failed to argue its case before the MIC and the MIC competently considered, in accordance with the failure of any challenge, the issues raised to reach its conclusion. Counsel argued that the Tribunal should apply the general principles of fairness by enforcing the internationally recognised principle of preclusion, which recognises issue estoppel or the re-litigation of issues as an abuse of process. In the alternative, the law of the procedural and curial court,ie, Singapore, should be applied. Under Singapore law, issue estoppel was established because (a) the MIC was of competent jurisdiction since the Malaysian courts were designated by an exclusive jurisdiction clause; (b) the MIC Awards were final; (c) the MIC Awards were on the merits; (d) the issues were the same; and (e) following English law, the Companies were privies with a privity of interest and a sufficient degree of identification. Even if Mauritius law was to be applied,res judicatacould be established. 23 Counsel further argued that the findings in the MIC Awards werebindingas a matter of contractfor the purposes of the SPA because the parties had agreed, by their contractual terms, to be bound by events that affected both the SPA and the PEAs. The SPA and the PEAs were “inextricably linked”.2Foot Note 2×Transcript of submissions on 6 December 2017 at p 70 (Bundle of Plaintiff’s affidavits at p 1146).Clause 15.1.2 of the PEAs provided, in terms, for payments under cl 12.9.2 of the SPA in the event that BTO dismissed the employees “Without Cause”. 24 On the other hand, counsel for the Companies submitted that the legal character of the findings in the MIC Awards pursuant to s 20 of the IRA could not be equated with a finding of without cause termination under the SPA and the PEAs. The MIC Awards were issued in a distinct statutory context and on grounds that were entirely irrelevant to the Employees’ entitlement under the SPA. In any case, the Companies averred that the merits of the dismissals were not actually decided by the MIC. Tracing the path of reasoning, there was no reasoning by the MIC on the merits of the grounds themselves. The MIC had not decided the issues before the Tribunal in reality and there was no actual investigation of the issues. Counsel for the Companies also argued that the public policy objective of finality – an objective attached to the idea that a litigant should not be vexed twice or more in respect of the same issue or same cause of action – was not offended as there was no vexing: the Employees did not have to prove anything and no one had to inquire into the grounds. The balance of scales should tilt in favour of the Companies; otherwise, it would be deprived of an opportunity to put its case on the merits of the dismissal. 25 On the applicable law, the Companies took the position that thelex causae,ie, Mauritius law, should apply becauseres judicatais a rule of substantive law. The present facts did not satisfy the test of triple identities under Mauritius law – identities of claim, cause of action and parties. Even if Singapore law was adopted, issue estoppel did not apply because there was no identity of subject matter. Further, it was argued that BTN could not be bound by the MIC Awards because BTN was not a party to the proceedings before the MIC. BTN could not be considered a privy of BTO under Singapore law. 26 On the contractual construction of the PEAs and the SPA, counsel for the Companies submitted that the Tribunal constituted under the SPA was not bound by the findings in another forum; the Tribunal had to decide the weight to be given to these findings, depending on what was decided, whether the forum was properly constituted under the PEAs and whether it would be fair to take the findings into account. Counsel argued that the Tribunal must make an independent determination of whether the PEAs had been terminated with or without cause for the purpose of determining what consequences would follow under the SPA. The interconnected nature of the agreements did not mean that the Tribunal should be bound by the decision of a Malaysian local employment tribunal, “especially since it did not make any contractual determinations under the PEA”. The two agreements bound different parties, were governed by different laws and contained separate dispute resolution clauses with different jurisdiction clauses.3Foot Note 3×Transcript of closing submissions on 7 December 2017 at p 118 (Bundle of Plaintiff’s affidavits at p 1474).In view of the differences, it “could not have been within the contractual contemplation of the parties that findings made by one tribunal, or, to be accurate, by a Malaysian Industrial Court, would be binding on an SIAC tribunal determining a dispute under the SPA”.4Foot Note 4×Transcript of submissions on 6 December 2017 at p 112 (Bundle of Plaintiff’s affidavits at p 1188).",
        "The Partial Award": "27 After hearing the parties’ submissions, the Tribunal released the Partial Award, holding unanimously as follows: (1) The determinations by the [MIC] that the Claimants were terminated without just cause or excuse is binding and conclusive for the purposes of termination “Without Cause” under the [SPA] and the [PEAs]. (2) The Respondents are in addition prevented from arguing that the Claimants were terminated “With Cause” under the [SPA] and the [PEAs] by the doctrine of issue estoppel under Singapore law; (3) A valid termination under Clause 12.9.1(viii) of the [SPA] requires the existence of “Audited Accounts” at the time of termination, which “Audited Accounts” must comply strictly with the [SPA] definition; and (4) All issues of costs are reserved until the final Award in this arbitration. 28 The Companies filed OS 683 on 1 June 2018 pursuant to s 10(3)(b) of the IAA and, in the alternative, to set aside the Partial Award pursuant to s 24(b) of the IAA and Art 34(2) of the Model Law. In the following parts of this Judgment, references to Articles should be read as references to Articles of the Model Law and references to sections should be read as references to sections of the IAA. 29 In OS 683, only decisions (1) and (2) of the Tribunal above are challenged. The reasoning of the Tribunal with regard to these decisions will be analysed at appropriate parts of this judgment. The third decision on cl 12.9.1(viii), hereinafter referred to as the Audited Accounts Issue, is not challenged by either party in this proceeding. 30 The arbitration is still ongoing at the time of these hearings. There are other issues that the Tribunal needs to decide, including other contractual conditions that need to be fulfilled before the Employees can show that they are entitled to the claim sum of US$35m.",
        "The Companies’ case in OS 683": "31 The Companies seek a declaration that the Tribunal has jurisdiction to determine whether the Employees were terminated “Without Cause” for the purposes of the SPA pursuant to s 10(3)(b). They submit that the Construction Issue and theRes JudicataIssue are jurisdictional decisions, which can be reviewed by this courtde novounder s 10(3)(b). 32 In the alternative, the Companies seek to set aside the Partial Award pursuant to: (a) s 24(b), Art 34(2)(a)(ii), Art 34(2)(a)(iii) and/or Art 34(2)(a)(iv), on the basis that the Tribunal made findings on disputed facts despite the parties’ agreement to reserve the resolution of disputed facts to subsequent hearings; and/or (b) s 24(b) and/or Art 34(2)(a)(ii), on the basis that the Tribunal (i) decided on an issue that was not pleaded or argued; (ii) failed to consider an argument submitted by the Companies against giving the MIC Awardsres judicataeffect under Singapore law; and/or (c) s 24(b), Art 34(2)(a)(ii), and/or Art 34(2)(a)(iii), on the basis that the Tribunal failed to decide on the merits of the substantive dispute between the parties because it regarded itself bound by the MIC’s determinations; and/or (d) Art 34(2)(b)(ii), on the basis that the Partial Award is in conflict with the public policy of Singapore. 33 Besides these grounds, the Companies further argue, in their reply submissions, that the Employees breached the dispute resolution provisions in the PEAs. However, it is unclear which ground of challenge this argument relates to. In the further alternative, the Companies take the position that the Partial Award should at least be set aside with respect to BTN, on the basis that the positions of BTN and BTO are different. 34 Overall, the Companies portray their case as one of seeking relief based on the recognised grounds for intervention in arbitral awards in order that they have the opportunity to present their case in defence to a US$35m claim, which by reason of the Employees’ wrongdoing, they had hitherto had no opportunity to present before any adjudicative body. The Companies are represented by Mr Philip Jeyaretnam SC (instructed) and Mr Colin Liew in the current proceedings. 35 At the beginning of the proceedings, the Companies brought High Court Summons No 2611 of 2018 to apply for OS 683 to be heard otherwise than in open court, and for the identity of the parties to be concealed and redacted. I allowed their application.",
        "The Employees’ case in OS 683": "36 The Employees take the position that there was never a plea that the Tribunal had no jurisdiction and there was no ruling by the Tribunal on its own jurisdiction. Thus, s 10(3)(b) does not apply in the first place. In any event, counsel argues, s 10(3)(b) does not apply to an award that contains a jurisdictional decision mixed with findings on the merits of the dispute between the parties (AQZ v ARA[2015] 2 SLR 972 (“AQZ v ARA”) at [65]). As for the grounds of challenge under Art 34, the Employees deny that there is any breach of natural justice and any breach of the parties’ agreed arbitral procedure. The Employees also submit that Art 34(2)(a)(iii) is not satisfied because the Tribunal decided on the very legal issues that were submitted for its decision. The Employees aver that the Companies have failed to specify what public policy of Singapore the Partial Award is in conflict with, and failed to cross the high threshold for establishing that an award is in conflict with public policy. The Employees are represented by Dr Michael Hwang SC (instructed after the first hearing) and Mr Chew Kei-Jin.",
        "The issues": "37  The issues for decision in OS 683 are: (a) Whether the Partial Award is a jurisdictional decision, and if so, whether the Tribunal erred in its decisions on the Construction Issue and theRes JudicataIssue; (b) Whether the Partial Award should be set aside under Art 34(2) and s 24(b), on the grounds raised by the Companies, as set out at [32] and [33] above; and (c) Whether the Partial Award should be set aside with respect to BTN, if it is not set aside for BTO.",
        "Issue 1: Review under s 10(3)(b)": "",
        "The Companies’ arguments": "38 The Companies take the position that the Partial Award is in substance a negative jurisdiction ruling, as the Tribunal abdicated the jurisdiction conferred on it by the parties to decide disputes under the SPA. Mr Jeyaretnam submitted that jurisdiction was given to the Tribunal by virtue of cl 17.4(b) of the SPA to determine any dispute arising out of the SPA, including the dispute as to whether the PEAs had been terminated without cause within the meaning of cl 12.9.1 of the SPA. But the Tribunal did not enter into the merits of this question at all. It was instead concerned with whether the MIC Awards were “binding and conclusive” and considered itself bound, with the consequence that it did not decide the substance of the dispute over the dismissals. Drawing onPT Asuransi Jasa Indonesia (Persero) v Dexia Bank SA[2007] 1 SLR(R) 597 (“PT Asuransi”), “an award must deal with the substance or merits of the dispute, failing which it is not an award [under the IAA]” (at [62] and [66]).5Foot Note 5×Applicants’ submissions at paras 100–119.By deciding not to decide the substance of the dispute, the Tribunal in fact rewrote the parties’ arbitration agreement and artificially narrowed its jurisdiction. Mr Jeyaretnam posited that with ade novoreview, this court should hold that the decision of the Tribunal on the Construction Issue and theRes JudicataIssue is wrong. 39  In response to the Employees’ argument that s 10(3) is not engaged in any event because the Partial Award ruled on the substantive merits of the dispute between the parties, Mr Jeyaretnam submitted thatAQZv ARAhas been wrongly decided and urged me to depart from it.",
        "The Employees’ arguments": "40 The Employees’ position is that the Partial Award is not a ruling on jurisdiction. The Tribunal decided on the very issues the parties had submitted to the Tribunal for decision,ie, the Construction Issue and theRes JudicataIssue, and both were issues of law going to the merits of the dispute. The Construction Issue involved an interpretation of the clauses of the SPA and the PEAs – this went to the substantive merits of the dispute: the Tribunal’s finding was not that it had no jurisdiction to hear the issue, but rather, as a matter of contract, the Companies were bound by the MIC Awards for the purposes of determining whether the dismissals were without cause under the PEAs and the SPA. TheRes JudicataIssue similarly went to the substance of the dispute and not the jurisdiction of the Tribunal. This is unlike the case ofPT Asuransiwhere the parties put the issue ofres judicatato the arbitral tribunal in the context of a jurisdictional challenge. Relying on the case ofThe Royal Bank of ScotlandNV (formerly known as ABN Amro Bank NV) and others v TT International Ltd (nTan Corporate Advisory Pte Ltd and others, other parties) and another appeal[2015] 5 SLR 1104 (“TT International”), Mr Chew submitted that the doctrine ofres judicataoperates against litigants and not against the court; the doctrine does not have any effect on the court’s authority to hear the dispute before it. Dr Hwang further argued that neither the Construction Issue and theRes JudicataIssue are capable of being construed as negative jurisdiction rulings, drawing on the holding inBAZ v BBAand others and other matters[2018] SGHC 275 (“BAZ v BBA”), where I explained the difference between the concepts of admissibility and jurisdiction. 41 In any event, Dr Hwang and Mr Chew submitted thatAQZ v ARAapplies. Even assuming that the Construction Issue and theRes JudicataIssue are jurisdictional issues, the Partial Award is a ruling that also dealt with the Audited Accounts Issue. Thus, s 10(3)(b) is not applicable. It is also submitted that s 10(3)(b) only applies where there is an express plea that an arbitral tribunal has no jurisdiction, and that being absent in the present case, it cannot apply. 42 In the alternative, the Employees aver that the Tribunal did not err in its rulings on the Construction Issue and theRes JudicataIssue.",
        "Whether the Partial Award is a ruling of negative jurisdiction": "43 Section 10(3)(b) states: If the arbitral tribunal rules – (a) on a plea as a preliminary question that it has jurisdiction; or (b) on a plea at any stage of the arbitral proceedings that it has no jurisdiction, any party may, within 30 days after having received notice of that ruling, apply to the High Court to decide the matter. 44 It is clear from the wording of s 10(3)(b) that it only applies if the Tribunal has ruled that it has no jurisdiction. Thus, the central point of dispute between the parties with regard to the applicability of s 10(3)(b) is whether the Partial Award is a ruling on jurisdiction. The Companies claim that it is a negative jurisdictional ruling that can be reviewed pursuant to s 10(3)(b), whereas the Employees claim that it is not a ruling on the Tribunal’s jurisdiction at all. 45 After considering the arguments presented by both sides, I come to the conclusion that the Partial Award isnot a ruling on jurisdiction, because neither the Construction Issue nor theRes JudicataIssue is a jurisdictional issue and in any event, the Partial Award also ruled on the Audited Accounts Issue, which the parties agree is a decision on substantive merits. With respect, the jurisdictional challenge launched by the Companies is no other than a clever argument to mask a challenge on the substantive decision by the Tribunal on the questions submitted by the parties for decision. InAKN and another v ALC and others and other appeals[2015] 3 SLR 488 (“AKN v ALC”), the Court of Appeal strongly advised that the courts “do not and must not interfere in the merits of an arbitral award and, in the process, bail out parties who have made choices that they might come to regret, or offer them a second chance to canvass the merits of their respective cases” (at [37]). The Court of Appeal was keenly aware of the creative attempts by counsel to forcefully mould their arguments to fit a certain ground to set aside or not enforce an arbitral award: “[i]n the light of their limited role in arbitral proceedings, the courts must resist the temptation to engage with what is substantially an appeal on the legal merits of an arbitral award, but which, through the ingenuity of counsel, may be disguised and presented as a challenge to process failures during the arbitration” (at [39]). 46 I find that the Partial Award is a decision on the merits of the parties’ legal questions submitted to the Tribunal for determination, and these legal questions form the building blocks to the final decision on whether the Employees are entitled to payment under the SPA. In setting out my reasons below, I will embark on a close analysis of the reasoning in the Partial Award. 47 In relation to both the Construction Issue and theRes JudicataIssue, the key question, according to the Tribunal, was “whether the effect of the [MIC Awards] [was] to prevent the Respondents from defending their position that the Claimants’ termination was properly With Cause under the SPA and PEAs”.6Foot Note 6×Partial Award at para 119.Before delving into the two issues, the Tribunal started first with its interpretation of the dispute resolution clause and the jurisdiction clause in the PEAs. It found that the dispute resolution clause stipulating arbitration in the PEAs was mandatory in naturebutthe mandatory nature wasconditionalon one party actually invoking it. Where the clause was not invoked, a party could have recourse to the Malaysian courts under cl 18.5 of the PEAs, subject to an application by the other party for a stay of proceedings or for an anti-suit injunction. In the present case, neither BTN nor BTO sought to stay or restrain the proceedings or commenced arbitration. Neither was judicial review brought against the MIC Awards. The MIC Awards were valid, and the Companies did not contend otherwise. The Awards were also paid without protest. The Tribunal found that any issues relating to the jurisdiction of the MIC or the validity of the MIC Awards were not in question. The Tribunal took the view that the MIC Awards were not default judgments, but substantive judgments on the merits of the dismissal claims. The Employees identified and denied the alleged grounds for termination with cause before the MIC, and the MIC found on the evidence that the terminations were without just cause or excuse. The MIC made factual findings that there was no proven misconduct based on BTO’s unproven grounds for termination with cause. The Construction Issue 48 I turn to the Construction Issue. The Tribunal considered it “plain on the face of the PEAs and the SPA that they [were] closely interconnected parts of the same transaction”. The Tribunal reached this conclusion based on the following characteristics of the SPA and the PEAs: (a) the definitions of termination with-cause and termination without-cause were identical in the contracts; (b) both Companies were parties to the SPA, and BTN was the “confirming party” to the PEAs between BTO and the Employees; (c) the SPA provided that the PEAs and other Transaction Documents constituted the entire agreement between the parties; (d) the execution of PEAs by the Employees was a condition precedent to the closing of the SPA and a template of the PEAs was attached to the SPA; (e) under the SPA, the Employees covenanted that they would continue to remain employed with BTO and acknowledged that their continued employment and management of the business in accordance with the SPA and the PEAs was a material obligation; (f) the commencement date of the PEAs was defined as the closing date of the SPA; (g) the recitals of the PEAs stated that the SPA and the acquisition contemplated therein were undertaken on the express understanding that the Employees would be employed by BTO; and (h) while the SPA and the PEAs contained different governing law and forum selection provisions, it was BTN’s own case that disputes under both agreements should have been resolved in a single forum, namely by arbitration in Singapore, suggesting a significant link between the agreements.7Foot Note 7×Partial Award at [147]–[149]. 49 The Tribunal further decided, based on the features of the SPA and the PEAs, that it was “plain on the face of the PEAs and the SPA that the Parties intended that the termination Without Cause provision under the PEAs would mean the same thing as the termination Without Cause provision under the SPA, and vice versa”. It would not be logically or commercially sensible for the phrase “Without Cause” to mean one thing under the SPA and something different under the PEAs. The PEAs were “part and parcel of the entire transaction achieved under the SPA, and must be read as part of a coherent whole in the context of the transaction and in a manner that is commercially sensible”.8Foot Note 8×Partial Award at [155].The Tribunal further found it significant that the Employees were purportedly terminated with cause under both the PEAs and the SPA. No distinction was made either as to the grounds for termination under the PEAs or the SPA or as to the nature of the termination under the PEAs or the SPA, which reflected that the Companies did not contemplate that a termination could be with cause under one agreement but without cause under the other. 50 Having determined that the jurisdiction of the MIC and the validity of the MIC Awards were not in question and that the MIC did determine that the Employees had been terminated without just cause or excuse, the Tribunal concluded that the determinations of the MIC in relation to the PEAs were “binding on [the Companies] as a matter of contractual construction of the SPA”. The decision of the MIC was that the Employees were terminated without just cause or excuse under the PEAs, on the same grounds that were before the Tribunal. The import of the MIC Awards was that the terminations could not have been with cause under the SPA.9Foot Note 9×Partial Award at [152]–[154] and [162]. 51 The Tribunal rejected the Companies’ arguments on the Construction Issue. It was of no consequence that several parties not signatories to the PEAs entered into the SPA. What was important was that both Companies signed the PEAs. The parties intended for BTN to assume the benefits and the burdens of the PEAs: BTN was entitled to exercise the rights of BTO under the PEAs, and the PEAs obligated BTN to pay the Employees under the SPA in the event of a termination without cause. The Tribunal also held that it did not assist the Companies that the PEAs and the SPA were governed by different substantive laws, because the determinations of the MIC were findings of fact and not law and the main question was whether the parties intended to give the phrases “without cause” and “with cause” the same effect in the contracts. The Tribunal similarly took the view that the fact that the PEAs and the SPA were subject to different jurisdiction provisions was not relevant to whether a determination under the PEAs on termination without cause would be binding for the purposes of the SPA. Nor was an explicit agreement between the parties on the binding effect necessary. 52 In my view, on the Construction Issue, it is clear that the Tribunal decided on the substantive merits of the legal dispute between the parties, as encapsulated by the legal question in Procedural Order No 5: “whether the decisions of the Malaysian Industrial Court are binding as a matter of contract on a proper interpretation of the SPA and PEAs”. The construction of the parties’ contracts was clearly within the jurisdiction of the Tribunal. There was nothing said about the jurisdiction of the Tribunal to hear this issue. The Tribunal exercised its jurisdiction in deciding the construction of the contracts; it is not a case of the Tribunal abdicating its jurisdiction. If anything, any errors in contractual construction are errors of law and fact and such errors are not subject to review. TheRes JudicataIssue 53 Having found that the determinations in the MIC Awards were binding as a matter of contractual construction of the SPA and the PEAs, the Tribunal decided that it was not strictly necessary to address theRes JudicataIssue. Nevertheless, it proceeded to determine theRes JudicataIssue since parties had submitted extensively on it. 54 On the applicable law to the question ofres judicata, the Tribunal held that Singapore law applied. Under Singapore law, the Tribunal determined that there was a four-part test for issue estoppel: (a) identity of parties; (b) the competent jurisdiction of the court pronouncing the earlier judgment; (c) a final judgment conclusive on the merits; and (d) identity of subject matter. The Tribunal considered that the second and third requirements of the test were easily met on the facts. The MIC was competent (see [47] above), and the MIC Awards were not subject to appeal and were honoured by the Companies. On the identity of the parties, the Tribunal considered BTN’s interests in the outcome of those proceedings to be sufficiently connected to BTO’s interests to put BTN in privity with BTO. It arrived at this conclusion based on the fact that BTN signed the PEAs as the “confirming party”, and the Companies purposefully and objectively shared the key benefits and risks under the contracts. Furthermore, the SPA and the PEAs were interconnected, and the attendance of Mr K (who was the director and senior financial manager of both Companies) in the conciliation phase of the MIC proceedings, while it did not support privity by itself, showed the significance of BTN’s interests in the outcome of the proceedings. 55 Turning to subject matter identity, the Tribunal found that the subject matter – whether the Employees were dismissed with or without cause under the PEAs – was “the same, in essence and at heart”, before the MIC and before the Tribunal, relying onBNX v BOEand another matter[2017] SGHC 289 (“BNX v BOE”). The Tribunal felt that the Companies were right to argue that under Singapore law, a point must have been raised and argued before a decision on that point can give rise to issue estoppel, while the Employees were also correct in saying that issue estoppel would still arise if a party conceded or failed to argue the point. The MIC Awards were decisions on the merits following trial and it was possible to trace the path of the MIC’s reasoning in their findings that the terminations were not for just cause or excuse. It did not matter that the MIC did not make findings that the dismissals were without cause under the PEAs and by connection, the SPA. The subject matter of the issues was “essentially the same” as those before the Tribunal.10Foot Note 10×Partial Award at [188]–[195]. 56 Significantly, the inescapable fact is that the parties tasked the Tribunal to determine “all issues necessary to resolve whether the findings of the [MIC] are binding on both [Companies]”, and the Tribunal did exactly that. The Tribunal’s analysis and decision answered the legal questions the parties agreed on submitting to the Tribunal: “whether the decisions of the Malaysian Industrial Court are binding ... [as a matter of] res judicata under the general law” and “whether any preclusive effect extends to [BTN] as well as [BTO] (whether by way of privity, the doctrine of co-interested parties or otherwise)” (see the list of questions at [21] above). It is clear from the Partial Award that the Tribunal was not engaged in a discussion on its jurisdiction at all. 57 Mr Jeyaretnam submitted that it does not matter that there was no discussion on the Tribunal’s jurisdiction. The Partial Award is still a negative jurisdictional decision because the Tribunal did not enter into the merits of the dispute on whether the dismissals were without cause at all, and a decision not on the merits is a ruling on jurisdiction. This argument runs roughshod over the context of the Partial Award – the decision answered the exact issues submitted by the Parties for determination. It was the substantive merits of these issues, namely, the construction of the contractual documents andres judicata, that the Tribunal resolved in the Partial Award. The Tribunal did not enter into the substantive merits of whether the dismissals were with or without cause because it ruled in favour of the Employees on the legal issues. It cannot be said that the Tribunal failed to decide the dispute between the parties by ruling that it had no jurisdiction to hear it. 58 Mr Jeyaretnam further relied upon the phrase “binding on the Tribunal” in the agreed list of legal issues to show that the Partial Award went to the jurisdiction of the Tribunal, as the phrase referred to the Tribunal and not the parties. However, this contention does not advance his case, for the Tribunal explained, in the agreed list of legal issues itself, that it was to determine “whether the findings of the [MIC] are binding on both Respondents”, and later in the Partial Award that the key issue was whether the effect of the MIC Awards was “to prevent the Respondents from defending their position that the Claimants’ termination was properly With Cause”,11Foot Note 11×Partial Award at [119].ie, thatres judicatawould apply to bind the parties. This was the way the Employees pleaded theRes JudicataIssue as well. The Tribunal used the phrase “binding on the Tribunal” loosely, not to mean that the MIC Awards were legally binding on the Tribunal, but to refer to the practical effect of the application ofres judicataor the effect of contractual interpretation. 59 The Court of Appeal sitting five judges inTT internationalexplored and explained the concepts ofres judicataand jurisdiction. On the concept ofres judicata, the court set out the law on cause of action estoppel, issue estoppel and the extended doctrine ofres judicataas encapsulated in the case ofHenderson v Henderson(1843) 3 Hare 100 (“Henderson v Henderson”). Issue estoppel, the court explained, arises when a court of competent jurisdiction has determined some question of fact or law, either in the course of the same litigation or in other litigation which raises the same point between the same parties, and it is of wider application than cause of action estoppel (at [100]). Moving to the concept of jurisdiction, the court held that it refers to the court’s “authority, however derived,to hear and determine a disputethat is brought before it” [emphasis in original]. The concept, the court explained, has also been treated as a synonym of “power”, defined as the court’s “capacity to give effect to its determinationby making or granting the orders or reliefs sought by the successful party in the dispute” [emphasis in original] (at [106]). 60 One of the parties inTT Internationalargued that the court lacked jurisdiction to hear and determine a dispute because the issues pertinent to that dispute wereres judicata. The court dismissed this argument at [115]: Res judicataoperates against the litigants, and not against the court: it bars the litigants from raising an issue or advancing a contention, and if a party persuades the court that a matter is caught by the doctrine, the court would grant an order giving effect to this; but,the doctrine does not have any effect on the court’s authority to hear the dispute before it and, having heard it, to determine whether or not to uphold the argument that the matter in question is foreclosed byres judicata. Of course,the court might be mistaken in its assessment of that argument, but that does not convert what might well be an erroneous decision into one which was made without jurisdiction.[emphasis added] 61 I gratefully adopt the court’s explanation that the doctrine ofres judicata“does not have any effect on the court’s authority to hear the dispute before it”. This statement of principle is applicable to arbitral tribunals as well. With respect, I do not agree with Mr Jeyaretnam that the concept ofres judicataas expounded inTT Internationalis inapplicable to arbitrations on the basis that a tribunal’s authority to decide disputes is derived wholly from the scope of the parties’ submission to it. He posited that any preclusion impedes a tribunal from deciding a matter that is within the scope of submission, so it necessarily goes to its jurisdiction. In my view, in context, the source of the adjudicating body’s jurisdiction does not matter, precisely because in most cases,res judicatadoes not concern the body’s authority to hear the dispute. The effect of the application ofres judicatawould be the same in court proceedings and in arbitral proceedings. There may be circumstances where the issue ofres judicatagoes to the jurisdiction of an arbitral tribunal, being inextricably linked to the consent of the parties to arbitrate (see [67] below), but this is not the case on the facts. 62 The issue ofres judicatadecided by the Tribunal is exactly that submitted by the parties for determination. The Tribunal was given theauthorityby virtue of the dispute resolution clause in the SPA and the parties’ submission for decision. The very decision of the Tribunal hinged on the implicit understanding that it had jurisdiction to address theRes JudicataIssue, and its determination was an exercise of its jurisdiction. The doctrine ofres judicataand the concept of jurisdiction are distinct and cannot be conflated. 63 In this regard, the distinction between admissibility of claim and jurisdiction of tribunal is also helpful. I have held inBAZ v BBA, in the context of a jurisdictional challenge to set aside an arbitral award under Art 34 of the Model Law, that the concepts of jurisdiction of tribunal and admissibility of claim are distinct (at [128]). Jurisdiction commonly refers to “the power of the tribunal to hear a case”, whereas admissibility refers to “whether it is appropriate for the tribunal to hear it” (Swissbourgh Diamond Mines (Pty) Ltdand others v Kingdom of Lesotho[2019] 1 SLR 263 (“Swissbourgh Diamond MinesCA”) at [207]). Admissibility has also been described as “thesuitabilityof the claim for adjudication on the merits” [emphasis in original] (Zachary Douglas,The International Law of Investment Claims(Cambridge University Press, 2009) at para 310, as cited in Hanno Wehland, “Jurisdiction and Admissibility in Proceedings under the ICSID Convention and the ICSID Additional Facility Rules” inICSID Convention after 50 Years: Unsettled Issues(Crina Baltag gen ed) (Kluwer Law International, 2016) (“Jurisdiction and Admissibility in Proceedings under the ICSID Convention and the ICSID Additional Facility Rules”) at para 8.03). The main distinguishing point between the two concepts is whether the objecting party takes aim at the tribunal or at the claim, with the former concerning the jurisdiction of the tribunal and the latter concerning the admissibility of the claim (BAZ v BBAat [129]). InBAZ v BBA, I was of the view that an objection based on time limitation went to the admissibility of the claim, rather than to the jurisdiction of the arbitral tribunal. It was for the tribunal to determine whether the claim was time-barred (at [131]). Thus, I held that the objection was not a jurisdictional challenge. 64 In my view, the doctrine ofres judicatafalls within the concept of admissibility of claim: it takes aim at the claim, and not at the defect of the improper forum. Where the doctrine applies to preclude a party from arguing a certain issue or claim, it would mean that it is “inappropriate” or “unsuitable” for the tribunal to hear the substantive merits of the issue or claim, thus going to its admissibility. As explained in Gretta Walters’ article, “Fitting a Square Peg into a Round Hole: Do Res Judicata Challenges in International Arbitration Constitute Jurisdictional or Admissibility Problems?” (2012) 29 Journal of International Arbitration 6 at p 651 (“Do Res Judicata Challenges in International Arbitration Constitute Jurisdictional or Admissibility Problems?”), where a party alleges that a dispute has already been resolved and should not be reheard, the party is actually raising an issue with the claim itself. The party is not attempting to get the dispute resolved in a different forum; rather the party does not want the claim to be resolved inanyforum. Thus, ares judicataobjection is conceptually not a jurisdictional objection, but an admissibility objection (at pp 672 and 675). The author expressed the opinion that treatingres judicataas an admissibility problem also has the practical effect of limiting court review over the decision of an arbitral tribunal (at p 677). As Dr Hwang put it, the test is, had the matter been heard by a court, would the Employees still argueres judicata?12Foot Note 12×NE 18 March 2019 at p 32.A positive answer indicates that the objection does not go to the issue of forum. 65 This was also the view taken by Hanno Wehland inJurisdiction and Admissibility in Proceedings under the ICSID Convention and the ICSID Additional Facility Rulesat para 8.05, where he explained that issues of standing, limitation periods, principles aiming to avoid multiple proceedings such aslis pendens,forum non conveniens, orres judicata, all clearly relate to the admissibility of a claim. In Jan Paulsson’s article, “Jurisdiction and Admissibility” inGlobal Reflections on International Law, Commerce and Dispute Resolution, Liber Amicorum in honour of Robert Briner (Gerald Aksenet al, eds) (ICC Publishing, 2005) (“Jurisdiction and Admissibility”) at p 616, he opined that contentions of waiver of claims, mootness, or an absence of a legal dispute are arguments against the admissibility of a claim. This distinction between admissibility of claim and jurisdiction of tribunal further explains that the Partial Award, in its decision onres judicata, is far from a decision on jurisdiction. 66 Further support for the proposition that the doctrine ofres judicatadoes not concern jurisdiction is found in foreign jurisdictions. Examples are the United States case ofChiron Corp v Ortho Diagnostic Systems207 F 3d 1126 (9th Circuit, 2000) (“Chiron Corp”) and the French case ofMarriott International Hotels, Inc v JNAH Development SA, Court of Appeal, Paris, No 09/13550, 9 September 2010, both of which are cited inDo Res Judicata Challenges in International Arbitration Constitute Jurisdictional or Admissibility Problems?. Both of these cases are in the context of arbitration. InChiron Corp, the US Court of Appeals for the Ninth Circuit held that “a res judicata objection based on a prior arbitration proceeding is a legal defense that, in turn, is a component of the dispute on the merits and must be considered by the arbitrator, not the court” and the objection “falls within a merits analysis that is subject to arbitration under the parties’ agreement” (at 1132 and 1133). The court decided that “[a]s with other affirmative defenses such as laches and statute of limitations, we agree ... that a res judicata defense is a ‘component’ of the merits of the dispute and is thus an arbitrable issue” (at 1134). 67 But there may be instances where the doctrine ofres judicatais correctly classified as a jurisdiction challenge notwithstanding the conventional understanding that it is an objection to the admissibility of a claim. This may occur when the doctrine is directly linked to the consent of the parties, because party consent lies at the core of an arbitral tribunal’s jurisdiction. Such an instance may arise where both parties are unhappy with an arbitral award and sign an agreement for the same dispute to be re-arbitrated, or where the parties’ agreement expressly provides for a review into a previous decision as inCRW Joint Operation v PT Perusahaan Gas Negara (Persero) TBK[2011] 4 SLR 305 (“CRW”) (see [108] below). This agreement would form the basis of the parties’ consent to arbitrate and would arguably go towards the jurisdiction of the second tribunal. The Court of Appeal faced a similar situation inSwissbourgh Diamond MinesCA. Having found that the conventional understanding is that the requirement of exhaustion of local remedies pertains to the question of admissibility (at [209]), the court nevertheless found that any failure on the part of the appellants to exhaust their local remedies should be taken to be an issue that concerns thejurisdictionof the tribunal. This is because the inclusion of the exhaustion of local remedies was expressed as a pre-condition for the respondent’sconsentto arbitration (at [209]). Where the consent of the parties is directly concerned, the issue is likely to go towards the jurisdiction of the tribunal. However, there is nothing on the facts to show that theRes JudicataIssue concerned the consent of the parties or related to the arbitration agreement in the SPA. As this situation does not arise and no argument on this was presented by parties, I say no more about it. 68 Mr Jeyaretnam contended that the concept of admissibility exists in the jurisprudence of the International Court of Justice and investor-state arbitrations, but not in international commercial arbitrations. He submitted that nothing in the drafting history of the Model Law and the IAA contemplates the concept of admissibility. Even if the concept of admissibility is adopted, he argued, some investor-state arbitral awards have classifiedres judicataobjections as going to the tribunal’s jurisdiction rather than to admissibility, such as inAMCO Asia Corp v Republic of Indonesia, ICSID Case No ARB/81/1, Decision on Jurisdiction (10 May 1988) (“AMCO”). Moreover, he pointed out thatPT Asuransihas clearly held thatres judicatais a jurisdictional concept. 69 I first address the contention that the concept of admissibility does not exist in commercial arbitration. Under the Model Law, Art 16(1) provides that rulings on jurisdiction include “any objections with respect to the existence or validity of the arbitration agreement”, and Art 16(2), besides referring to a plea that the arbitral tribunal does not have “jurisdiction”, also refers to a plea that the arbitral tribunal is “exceeding the scope of its authority”. Besides these phrases that could shed some light on the concept of jurisdiction, the concept of jurisdiction is not defined. This is not surprising since arbitration is consensual and parties are at liberty to scope out by agreement the exact terms of reference that form the foundation of the tribunal’s jurisdiction or authority to adjudicate on the disputes in question. As for the preparatory materials to the Model Law, in theAnalytical Commentary on Draft Text of a Model Law on International Commercial Arbitration(A/CN.9/264, 25 March 1985) (at p 40), the Secretariat explained that objections to the arbitral tribunal’s jurisdiction “go to the very foundation of the arbitration” and jurisdictional questions are “antecedent to matters of substance and usually ruled upon first in a separate decision, in order to avoid possible waste of time and costs”. Some Member States used the term “competence” when referring to jurisdiction in theSummary Records for meetings on the UNCITRAL Model Law on International Commercial Arbitrationreproduced in the Yearbook of the United Nations Commission on International Trade Law, 1985, vol XVI (see the term used by the representative of the United States of America in the 315th Meeting at para 59 and the term used by the representative of France in the 316th Meeting at para 10). There was, however, no discussion on the delineation of the concept of jurisdiction in the preparatory materials. 70 In this regard, the concept of admissibility isuseful as a foilto better illustrate the ambit of the concept of jurisdiction, for challenges as to the admissibility of claims are not jurisdictional objections. Instead, they can be said to be a subset of the category of claims on merits. Drawing on the concept of admissibility does not in any way undermine the integrity of the Model Law or the IAA. Concepts of jurisdiction, admissibility and merits are not unique to any specific types of dispute resolution or forum. There is no reason why the concept of admissibility cannot be utilised as a tool to determine whether an objection lodged in a commercial arbitration is a jurisdictional objection. 71 As for theAMCOdecision, the issue of whetherres judicatais a matter of admissibility or a matter of jurisdiction was never discussed in the decision. The tribunal had to determine which parts of the dispute between the parties wereres judicataand which were not, as a result of a partial annulment of a previous tribunal’s arbitral decision on the dispute. Apart from the heading that reads “The Jurisdiction of the Present Tribunal: The Identification of Res Judicata”, there was no discussion as to the characterisation and nature of the concept of theres judicata. Analysing theAMCOdecision inDo Res Judicata Challenges in International Arbitration Constitute Jurisdictional or Admissibility Problems?, Walters explained that the express reference tores judicataas an issue of jurisdiction is inconsistent with the tribunal’s actual treatment of the objection. TheAMCOdecision is not a strong authority for the Companies’ proposition thatres judicatais a jurisdictional concept. 72 I turn now to address the case ofPT Asuransi, upon which Mr Jeyaretnam placed great emphasis in arguing that where a ruling does not decide on the substantive merits of a claim, it is a jurisdictional ruling. To understand the decision inPT Asuransi, the background facts need to be set out in some detail. There were loan instruments known as BI Notes that were unpaid. In 2000, the guarantor of the BI Notes sought to initiate a restructuring scheme to release its payment obligations by replacing them with a new series of notes issued by another company. This scheme was opposed by Dexia Bank SA amongst other noteholders, but nonetheless, it was purportedly approved at a BI Noteholders’ meeting in February 2000. Dexia Bank SA commenced arbitration proceedings against the guarantor, claiming that the BI Notes were unpaid. This was the first arbitration. The issuer and the guarantor of the BI Notes did not appear. Instead, the issuer held a meeting in June 2001 to ratify the resolutions passed at the February 2000 meeting and they were duly ratified. The arbitral tribunal conducted the hearing a few days after the ratification, but it was not aware of the ratification at the time of the hearing. Sometime later, it received the minutes of the June 2001 meeting and the passed resolutions from the guarantor. The arbitral tribunal gave its award in October 2001, granting Dexia Bank SA’s claim. It held that the issuer and the guarantor were obliged to pay under the BI Notes and the obligations were not restructured pursuant to the February 2000 meeting. It considered the documents sent by the guarantor to be irrelevant to the issues requiring determination in the arbitration. 73 The guarantor then commenced a second arbitration against Dexia Bank SA seeking a declaration that the June 2001 meeting was valid and binding and thus the restructuring scheme was valid and binding on all noteholders. At the outset of this second arbitration, Dexia Bank SA raised jurisdictional issues, and the second arbitral tribunal addressed the question whether it had “jurisdiction to entertain the present proceedings in light of the history of the earlier proceedings between the Parties” (at [16]). In the second arbitral award, the second arbitral tribunal held that on the basis of the rule inHenderson v Henderson, “the [guarantor] could and should have brought the present claims in the [first arbitration]”, so it was estopped from raising the issue of the June 2001 meeting (at [18]). The second arbitral tribunal concluded that Dexia Bank SA “succeed[ed] on the preliminary question of jurisdiction” and the guarantor’s action was dismissed. As the Court of Appeal stated inPT Asuransi, it was clear that the second arbitral tribunal held that it had “no jurisdiction to determine the substantive issues in the submission to arbitration” (at [19]). 74 The guarantor applied to the Singapore court for the second arbitral award to be set aside on the basisinter aliathat the second arbitral tribunal had no jurisdiction to reach its conclusion, and for the arbitration be remitted back to the second arbitral tribunal for hearing. The Court of Appeal found that the second arbitral tribunal’s finding on estoppel was erroneous (at [41]), and proceeded to determine whether its “negative finding on jurisdiction [was] a finding that [might] be set aside under Art 34(2)(a)(iii)” (at [45]). The finding of estoppel stemmed from an issue that a tribunal, in determining its own jurisdiction, was entitled to determine; thus, it could not be set aside (at [50]). The Court of Appeal further decided that a negative determination on jurisdiction was not an award for the purpose of s 2 of the IAA because it was not a decision on the substance of the dispute. Therefore, it could not be set aside under Art 34 (at [66]). Section 10(3)(b) did not exist when the case was decided by the Court of Appeal, and the court held that Art 16(3) only provided for recourse when an arbitral tribunal ruled that it had jurisdiction, so a negative ruling on jurisdiction was intended to be a final and binding decision on that issue (at [68] and [69]). 75 The most relevant analysis for the purpose of the present case is the court’s decision on whether the second arbitral award was a pure negative ruling on jurisdiction or a decision on the substance of the dispute. The court decided that the second arbitral award was not an award: The nature of the Second Award 71 In the present case,the Second Tribunal decided the jurisdiction issue as a preliminary issueat the request of the respondent. The Second Tribunal acceded to the request... The Second Tribunal then proceeded to decide the preliminary issue of jurisdiction... Moreover,the Second Award states expressly... that the respondent succeeds “on the preliminary question of jurisdictionand the [appellant’s] action is hereby dismissed”... Accordingly, in both form and substance, the Second Award is a pure negative ruling on jurisdiction and is therefore not an award for the purposes of the Act. 72 Nonetheless, counsel for both parties also sought to argue that the Second Award should be treated, in substance, as a decision on the merits of the claim as the respondent could have pleaded issue estoppel as a defence to the claim rather than a jurisdictional issue. Counsel referred to the analogy of a defence based on limitation. In our view, the legal nature of the two defences is not the same. Where limitation is pleaded as a defence, it assumes that the claimant has a valid claim but that the claim is time-barred.Where issue estoppel is pleaded, it assumes that the issue has been decided against the claimant in a previous proceeding between the parties. In this case, however, it cannot be disputed that the First Tribunal simply did not decide the issue of the June 2001 meeting. 73 ... Counsel for the parties have attempted to restate it as a finding that the appellant had no claim under the submission to arbitration before the Second Tribunal. We are of the view that this was not what the Second Tribunal had decided. It cannot be restated as a decision that the appellant was still liable on the BI Notes in spite of the June 2001 meeting, because that was not the decision. It cannot be restated as a decision that the appellant was liable on the BI Notessimpliciter, because that was also not the decision.It might be said that the substance of the Second Award is that the appellanthad no claim to any rights flowing from the June 2001 meeting ... because that claim should have been, but was not, referred to the First Tribunal. In our view, however, that is not the same thing as saying that the appellant had no claim as such by reason of such a claim having been determined by the Second Tribunal.In our view, it is plain that the Second Tribunal did not decide the substance of the appellant’s claim with respect to the June 2001 meeting. ... [emphasis added] 76 Mr Jeyaretnam submitted, based on the reasoning at [72] and [73] ofPT Asuransi, that an arbitral decision onres judicatais a “pure negative ruling” on jurisdiction. On a proper analysis, the argument cannot be right. The second arbitral tribunal’s decision was explicitly based on theHenderson v Hendersonabuse of process principle (see [73] above). The word “jurisdiction” was used incorrectly. As no one pointed out the mistaken use of the concept of jurisdiction, the Court of Appeal followed the parties’ and the second arbitral tribunal’s use of the word. The parties had pleaded that the second arbitral tribunal had no jurisdiction, and the second arbitral award focussed on the very issue as to whether it had jurisdiction. In addition, as mentioned, the Court of Appeal (at [50] ofPT Asuransi) was of the view that the decision on estoppel was an issue the tribunal was entitled to determine and therefore could not be set aside under Art 34(2)(a)(iii). This reasoning supports the view that the courts should not review a tribunal’s decision onres judicata. 77 Further relying onPT Asuransi, Mr Jeyaretnam argued that because the Partial Award does not touch on the substance of the dispute, it is not an award but a jurisdictional ruling. Pursuant to s 2 of the IAA, the court inPT Asuransiheld that the meaning of “award” is clear – it is a decision on the substance of the dispute. As I have decided above, the decisions on the Construction Issue and theRes JudicataIssue are decisions on the substance of the dispute between the parties (see [52] and [57] above). Thus, the Partial Award is an award for the purposes of s 2 of the IAA. In any case, it is undisputed that the Audited Accounts Issue is a decision on the substance of the dispute between the parties. 78  In my view, based on the understanding of the concepts ofres judicataand jurisdiction as explained by the Court of Appeal inTT International, the Tribunal’s decision in the Partial Award on issue estoppel is not a jurisdictional decision. The upshot of this is that whether the Tribunal’s decision in the Partial Award is correct in fact or in law cannot be reviewedde novoby the court. Conclusion on the Construction Issue and theRes JudicataIssue 79 The legal question whether the findings of the MIC were binding on the Tribunal is a binary question that called for a “yes” or “no” answer. Procedural Order No 5 clearly provided the possibility for the Tribunal to decide that the MIC Awards were binding and thus no independent determination by the Tribunal was necessary. The idea of the Tribunal’s jurisdiction or its mandate to rule on the dispute between the parties was never on the minds of the parties or the Tribunal, as evidenced by the submissions of the Companies before the Tribunal (see [24] and [26] above). For the Companies to claim now that the lack of an independent determination by the Tribunal on the character of the dismissals makes the Partial Award a negative jurisdiction decision is untenable. The argument of counsel does not succeed because the nature of the Construction Issue and theRes JudicataIssue is not a jurisdictional one. 80 By crafting the nature of the Tribunal’s rulings on the Construction Issue and theRes JudicataIssue as a jurisdictional one, the Companies hope to challenge themde novo. However, since I have held that they are not jurisdictional decisions, the correctness of the Tribunal’s decisionscannotbe reviewed by this court. Nevertheless, I make some observations on the Companies’ arguments. 81 The Companies aver that the MIC is not a court of law of Malaysia, but a statutory arbitral tribunal. Mr Jeyaretnam pointed to the difference in wording between s 20 of the IRA on one hand and the SPA and the PEAs on the other, and to the nature of the MIC as an industrial relations tribunal that decides disputes according to “equity” and “good conscience”. This argument seems to go to both the Construction Issue and theRes JudicataIssue. 82 First, Mr Jeyaretnam argued that because the MIC was not a court of law,res judicatacould not apply. This argument was not placed front and centre before the Tribunal. The Companies did not argue before the Tribunal that the alleged nature of the MIC meant that it was not a competent court for the purposes ofres judicata. The legal character of the MIC was only included as a footnote in the Statement of Defence and Counterclaim submitted by the Companies to the Tribunal. This footnote appeared in the section titled “Parties agreed bespoke and comprehensive arbitration clauses for resolution of disputes under the PEAs and the SPA”. Importance was cast upon the parties’ agreement to arbitrate, and it was only in this context that the nature of the MIC was included as an explanatory footnote. No development of argument on this alleged nature was made. Furthermore, the case ofTurner v London TransportExecutive[1977] ICR 952 (“Turner”) placed by the Companies before the Tribunal for its consideration made it far from clear that a decision from a tribunal could not give rise tores judicata. In that case, the English Court of Appeal decided that because it was impossible to ascertain with necessary clarity what was the relevant decision of the industrial tribunal in that case, estoppel could not be established (at 964). Although the defendants in that case had argued that the industrial tribunal was not competent to pronounce a decision giving rise tores judicata, the Court of Appeal did not decide that point.Turnerwas placed before the Tribunal on the point of identity of issues and not on the point of competent court. The reference toTurner, coupled with the lack of argument on the requirement of a competent court, shows that the link between the nature of the MIC and the requirement of a competent court for the purposes ofres judicatawas never put in issue. If the Companies wanted to put it in as an issue in dispute, they should have put it squarely before the Tribunal. In any case, it is far from clear that the nature of the MIC cannot give rise tores judicata. 83 Second, Mr Jeyaretnam argued that because the MIC was not a court of law of Malaysia, there was a breach of the dispute resolution agreement between the parties under the PEAs. The purport of this argument is not clear (see [110] below). Putting it at its highest, this argument goes to the Companies’ point under the Construction Issue that it was not within the contemplation of the parties that the MIC would have the decisive say over the SPA. This argument was canvassed before the Tribunal as well (see [26] above). Before the Tribunal, the Companies relied on the international dimension of the SPA. However, it is indisputable that SPA has other agreements connected to it, particularly the PEAs. Mr Jeyeratnam had not drawn my attention to any evidence on the contemplation of the parties to support his argument. The point advanced is not unequivocal. BTO was a Malaysian company, the employment relationship between the Employees and BTO was governed by Malaysian law, and the parties designated the courts of Malaysia in their jurisdiction clause (cl 18.5 of the PEAs). The reference to the courts of Malaysia does not unequivocally restrict disputes relating the termination of the employments to the civil courts. Partial Award contains decisions on substantive merits in any case 84 Besides the rulings on the Construction Issue and theRes JudicataIssue, the Partial Award dealt with the Audited Accounts Issue, which is a decision on the substantive merits. The Companies do not dispute this. Therefore, even if the Companies were correct in arguing that the Tribunal’s decisions on the Construction Issue and theRes JudicataIssue were decisions on its jurisdiction, the Partial Award cannot be challenged under s 10(3) because it also contains a ruling on substantive merits. 85 InAQZ v ARA, Judith Prakash J (as she then was) held that “the drafters [of the Model Law] did not intend an award that deals with the merits of the dispute (however marginally) to be subject to challenge under Art 16(3) of the Model Law” (at [65]). In Howard M Holtzmann and Joseph E Neuhaus,A Guide to the UNCITRAL Model Law on International Commercial Arbitration: Legislative History and Commentary(Kluwer Law and Taxation, 1989), the authors explained that under Art 16, the arbitral tribunal has a choice whether to decide a jurisdictional question preliminarily or only in the final award. If it issues a preliminary ruling, that is subject to immediate review by a court. Otherwise, review must wait for a setting aside proceeding. Relying on this passage, Prakash J held that it is “apparent that relief under Art 16(3) is not available when a party seeks to set aside a ruling which is predominantly on jurisdiction but also marginally deals with the merits because that is simply not the purpose that the drafters intended Art 16(3) to serve” (at [69]). In such situations, the obvious and more appropriate remedy would be to set aside the award pursuant to s 3(1) of the IAA read with the relevant limbs of Art 34(2) of the Model Law (at [69]). In the same vein, this reasoning is equally applicable to s 10(3) of the IAA (at [70] and [71]). This holding inAQZ v ARAwas followed in the High Court cases ofKingdom of Lesotho v Swissbourgh Diamond Mines (Pty) Ltd and others[2019] 3 SLR 12 at [69], andSinolanka Hotels & Spa (Private) Limited v Interna Contract SpA[2018] SGHC 157 at [79]. FollowingAQZ v ARA, even if the Companies were correct in arguing that the Construction Issue and theRes JudicataIssue were jurisdictional decisions, the remedy under s 10(3) is inapplicable to the present case. 86 However, Mr Jeyaretnam contended thatAQZ v ARAis wrong because Prakash J (as she then was) did not consider the “Report of the Law Reform Committee on Right to Judicial Review of Negative Jurisdictional Rulings” (Singapore Academy of Law, January 2011) (“the Report”) which led to the amendment of s 10(3) to allow review of negative jurisdictional rulings. He pointed out that the Report included a footnote that read, “In the light of the discussions at paras 18–21 above, we avoid the words ‘either as a preliminary question or in award on the merits’” in the subsection on the power given to arbitral tribunals to rule on jurisdictional objections at any stage of the proceedings. This meant, he argued, that the intention was not to limit s 10(3) to rulings that are distinct from awards on the merits. 87 I am not persuaded by Mr Jeyaretnam’s argument. Prakash J (as she then was) had considered the preparatory materials to the Model Law comprehensively in arriving at her decision. Mr Jeyaretnam’s interpretation of the Report is not persuasive. The discussion at paras 18–21 of the Report that the footnote referred to was on the issue of whether review of negative jurisdictional rulings ought to be allowed. The footnote did not concern the issue whether a mixed award on jurisdiction and merits could be reviewed under s 10(3). The requirement of an express plea of lack of jurisdiction 88 Counsel for the Employees submitted that there is a requirement of anexpress“plea” that an arbitral tribunal has no jurisdiction before the challenge amounts to a jurisdictional one. Since there was no such plea, counsel argued that the Tribunal’s decision in the Partial Award is not a decision on jurisdiction. The recent Court of Appeal decision inRaknaArakshaka Lanka Ltd v Avant Garde Maritime Services (Pte) Ltd[2019] 2 SLR 131 (“Rakna”) is a direct answer to counsel’s submission on the requirement of an express plea. The Court of Appeal held that it was not necessary for a party to file a formal objection or plea in the legal sense of the term in order to engage Art 16(3) (at [56]). There was no express pleading by the party in that case asserting a lack of jurisdiction, but the Court found that it furnished the arbitral tribunal with its objection to jurisdiction by informing the tribunal that the parties had reached a settlement and it was thus no longer required to proceed with the arbitration (at [57]). While there is no need for a plea to be in any specific form or worded in any specific manner, the issue of the tribunal’s mandate to proceed with hearing the arbitration was placed front and centre before the tribunal inRakna. It cannot similarly be said so for the present case.",
        "Issue 2: Application to set aside the Partial Award pursuant to s 24(b)and Art 34(2)": "89 In the alternative, the Companies submit that the Partial Award should be set aside pursuant to Art 34(2) and/or s 24(b) on the grounds set out above at [32]. With regard to allegations of breaches of natural justice, the law is clear that a party must establish: (a) which rule of natural justice was breached; (b) how it was breached; (c) in what way the breach was connected to the making of the award; and (d) how the breach prejudiced its rights (Soh Beng Tee& Co Pte Ltd v Fairmount Development Pte Ltd[2007] 3 SLR(R) 86 (“Soh Beng Tee”) at [29]). I will address each of the Companies’ grounds in turn.",
        "Reliance on disputed facts": "90 Mr Jeyaretnam submitted that the parties and the Tribunal intended for the resolution of any factual or evidentiary issues to be reserved. This intention was expressly stated in Procedural Order No 5 and the Partial Award (see [21] above). He argued that in breach of this agreement, the Tribunal relied on disputed factual matters in its decision, specifically the disputed issue as to whether the Companies were to be treated as being in substantially the same position. As a result, the Companies suffered prejudice as they were deprived of any opportunity to ventilate the merits of their position on whether the PEAs were terminated with cause, and were deprived of their contractual rights to a dispute resolution forum of their choice. Had the Tribunal not relied on disputed facts, its decision could reasonably have been different. Thus, the Partial Award should be set aside on the basis that (a) the Tribunal breached the parties’ agreed arbitral procedure, (b) there was a breach of natural justice as the Tribunal closed its mind to the factual disputes, and (c) the Tribunal exceeded its jurisdiction by making factual findings in the hearing on legal issues. While the Companies have not specified the applicable provisions of the Model Law and the IAA, the corresponding grounds should be Art 34(2)(a)(ii) and s 24(b), 34(2)(a)(iii), and Art 34(2)(a)(iv). 91 In support of his argument, Mr Jeyaretnam stated that the Tribunal decided on disputed facts in the following instances: (a) The Tribunal considered the Companies to be fully aware of the MIC proceedings, based on Mr K’s attendance at the conciliation meeting. This is despite BTN’s contention that the conciliation meeting was never raised to its board or senior management and that both Companies were unaware of the subsequent MIC proceedings due to the concealment of notices from the MIC by BTO’s employee. (b) The Tribunal narrated that the Companies (instead of only BTO) dismissed the Employees. This shows, according to Mr Jeyaretnam, that the Tribunal pierced the corporate veil between the Companies, or at least treated them collectively in fact and in law, without hearing any oral evidence on this issue. He claimed that the degree of control BTN had over BTO was contested, but the Tribunal had already made up its mind on the matter that had not been subject to an evidentiary hearing. (c) The Tribunal decided that the Companies “purposefully and objectively shared the key benefits and risks” under the SPA and the PEAs in deciding that BTN was in privity of interest with BTO for the purposes ofres judicata. Mr Jeyaretnam argued that it was a disputed issue, as can be seen from Mr K’s email to the conciliator informing her that the dispute over the Earn Out Consideration under the SPA had to be settled by arbitration under the SPA. He further submitted that the Tribunal could not have properly come to such a view on the key benefits and risks without first hearing evidence on the parties’ intentions as to the nature of the transactions in the contracts. The Tribunal could not have drawn such a conclusion from the mere fact that both Companies were parties to the SPA and the PEAs. They had different obligations under the contracts: only BTN was obliged under the SPA to pay the Earn Out Consideration to the Employees while only BTO was obliged to employ the Employees and pay them remuneration. (d) The Tribunal considered that the attendance of Mr K in the conciliation meeting as a senior financial manager and director of both the Companies demonstrated BTN’s interests in the outcome of the proceedings as a party to the SPA and the PEAs. Mr Jeyaretnam argued that this means the Tribunal found that Mr K represented the legal interests of both Companies in the conciliation meeting even though the Companies made it clear that Mr K did not attend the conciliation meeting as a director of BTN. (e) Belatedly, in the Respondents’ Supplementary Reply Submissions, Mr Jeyaretnam claimed that the Tribunal, in finding that there was no breach of the dispute resolution clauses in the PEAs because the Companies failed to stay the MIC proceedings or initiate arbitration, relied on the disputed fact whether BTO and/or BTN was aware of the MIC proceedings. 92 Reading the Partial Award on the whole, while I agree with Mr Jeyaretnam that the parties and the Tribunal intended for the hearing to resolve only legal issues, the parties at the same time tasked the Tribunal to determine “all issues necessary to resolve whether the findings of the [MIC] are binding on both Respondents”,13Foot Note 13×Procedural Order No 5.a legal question submitted for the Tribunal’s determination during the hearing. I find that neither was there a breach of natural justice, nor did the Tribunal breach the parties’ agreed arbitral procedure, nor did it exceed its jurisdiction. As a preliminary point, the jurisdictional ground is not engaged in the first place because the Tribunal has jurisdiction to make factual findings, just that the parties agreed for the Tribunal to decide the legal issues first while reserving the evidentiary issues. The arguments made by Mr Jeyaretnam fall under the grounds relating to natural justice and the parties’ agreed arbitral procedure. 93 First, on the Construction Issue, the parties agreed that it could be decided without touching on the evidentiary disputes. In coming to its decision that the MIC’s findings were contractually binding, the Tribunal relied wholly on the construction of the SPA and the PEAs. I agree with the Employees that the Tribunal did not rely on any material not clear from the record. I have traced the Tribunal’s reasoning at [48]–[51] above. 94 Importantly, there wasno findingthat the corporate veil between the Companies was pierced, or that the two companies could be equated in law. Nevertheless, Mr Jeyaretnam claimed that the Tribunalimpliedthat the corporate veil had been pierced through its narration that “the Respondents” (instead of only BTO) dismissed the Employees. Such a dissection of the Partial Award to draw inferences from specific words used in the award so as to build a ground to set the award aside must be disapproved of. As the Court of Appeal opined inSoh Beng Tee, it is not the function of the court to assiduously comb an arbitral award microscopically in attempting to determine if there was any blame or fault in the arbitral process (at [65]). Neither is it the function of the court to carry out a hypercritical or excessively syntactical analysis of what the tribunal has written (BLC v BLBat [86]). Following the reasons provided by the Tribunal, not only was there no finding that the corporate veil between the Companies was pierced, its narration of how “the Respondents” dismissed the Employees was also not a reasoning supporting its decision on the Construction Issue. This means that in any case, even if the Tribunal gave the impression that the corporate veil was pierced, it would not have affected the decision in the Partial Award. 95 While proof of actual prejudice (in the sense where the procedural breach complained of could reasonably have said to have altered the final outcome of the arbitral proceedings in some meaningful way) is not necessary for the ground of breach of agreed procedure, it will often invariably show that the procedural breach complained of is not of arid, technical or trifling nature (Coal & Oilat [51]). Where any breach would not have affected the outcome of the arbitral tribunal’s decision, it would be difficult to argue that it was a material breach serious enough justifying the exercise of the court’s discretion to set aside an award. 96 The Companies’ dissatisfaction with the Tribunal’s view that the Companies were fully aware of the MIC proceedings because of Mr K’s participation in the conciliation meeting is another unwarranted dissection that picks at pieces of the Partial Award in isolation to shore up the grounds for setting it aside. Even if this view was based on disputed facts, it made no difference to the Tribunal’s decision. It wasnota finding justifying the decision on the Construction Issue. The Tribunal’s view only formed part of the context for holding that the MIC Awards were valid, and even so, it was not crucial to that holding. Its central reasoning was that the Companies did not allege that the notices were invalid under Malaysian law, so any issues relating to the proper jurisdiction of the MIC or the validity of the MIC Awards were not live. It did not find it necessary to explore what went wrong with the internal channels within BTO for service of process. What was important for the purposes of deciding the legal issues was whether the MIC Awards were valid. It was open to the Tribunal to find that they were. In fact, they were fully paid up. 97 Second, on theRes JudicataIssue, it is clear from the agreed list of legal questions that the Tribunal abided by the parties’ reference to arbitration. The agreed list of questions includes the issue as to “whether any preclusive effect extends to [BTN] as well as [BTO] (whether by way of privity, the doctrine of co-interested parties or otherwise)”. Accordingly during the hearing, the Employees submitted that BTN was a privy of BTO, while the Companies took the contrary position. Entirely within the parties’ agreed arbitral procedure, and within the terms and the scope of submission to arbitration, the Tribunal answered this question that was submitted to arbitration in the affirmative. It was clearly within the contemplation of the parties that the Tribunal had to have regard to the facts on record to reach an answer on the legal questions submitted for determination. This was in line with tasking the Tribunal to determine “all issues necessary to resolve whether the findings of the [MIC] are binding on both Respondents”. What the Companies are in fact seeking to do in the present proceeding is to rehash their arguments submitted during the arbitration on why BTN was not a privy of BTO, which is an impermissible appeal on the merits. 98 The Tribunal provided various strands of reasoning for its conclusion (see [54] above). Its opinion that the Companies “purposefully and objectively shared the key benefits and risks” under the SPA and the PEAs was one of these reasons and was based on the contractual structure of the transaction, evidenced by the contracts. As Dr Hwang pointed out, BTN had a very real interest because the payments under the SPA were triggered by the circumstances of termination under the PEAs, and BTN was a confirming party to the PEAs. The Tribunal also took the view that the attendance of Mr K at the conciliation meeting demonstrated BTN’s interests in the outcome of the proceedings. The Tribunal expressly stated that it did not use this fact by itself to support privity. Contrary to what the Companies claim, the Tribunal did not make a finding that Mr K represented the legal interests of both Companies in the conciliation meeting. 99 Lastly, on the Tribunal’s determination that the Employees could have recourse to the courts under the jurisdiction clauses in the PEAs on the basis that the Companies did not initiate an arbitration or apply to stay or restrain the MIC proceedings once the dispute was referred to court, the Tribunal clarified in a footnote that the Companies “did not at any stage seek to stay the proceedings under the [IRA]”.14Foot Note 14×Partial Award at [124], footnote 54.The Tribunal’s clarification was based on an undisputed fact that BTO attended the conciliation meeting under the IRA. Thus, even if the Tribunal had decided on the disputed fact as to the Companies’ knowledge of the proceedings in the MIC, there was no prejudice to the Companies, since the Tribunal’s clarification meant that its determination would have been the same regardless.",
        "Decision on matter not pleaded or argued": "100 The contention of the Companies is that the Tribunal drew a purported distinction between “subject matter identity” and “issue identity” in its decision on issue estoppel, and decided in favour of “subject matter identity” after finding the concept of “issue identity” to be too narrow. The Companies claim that this was not in issue between the parties; the parties had agreed that the test was whether the issue in the later proceedings and the issue in the earlier proceedings were the same. In applying its own test, despite finding the test of “identity of subject matter” to be “most difficult”, the Tribunal did not give a chance to the parties to address the difference between the two concepts. This, according to the Companies, is a breach of natural justice. 101 The question of whether the requirement of identity of subject matter was satisfied was argued extensively by the parties and decided upon by the Tribunal. Although the dichotomy between “issue identity” and “subject matter identity” was coined by the Tribunal, it is evident from the arbitral proceedings that the parties had disputed the ambit of the requirement. Their respective positions have been set out in the Partial Award, and they had ample opportunity to present their positions (see [22]–[24] above). The Companies submitted that issues must be identical and there was no identity of issue on the facts because the MIC decided on a statutory provision in the IRA, which was a different issue from the termination clauses under the PEAs or the SPA. The Employees, on the other hand, contended that the issue of without-cause termination under the PEAs and the SPA was determined in the MIC because the very question before the MIC was whether they had been dismissed without just cause. 102 The Tribunal, after assessing the arguments, preferred the Employees’ position on issue estoppel. The ratio of the decision is that the Tribunal disagreed with the insistence by the Companies “on strict identity of the relevant issues in the two proceedings”. The Tribunal found that it was “fair to say that the subject matter – whether the Claimants were dismissed with or without cause under the PEAs – is the same, in essence and at heart, before the [MIC] and before this Tribunal”.15Foot Note 15×Partial Award at [188].The Tribunal found the decision inBNX v BOE, which was addressed by both sides, to be most relevant and held that following the case, the issues before the MIC were “essentially the same” as those before itself.16Foot Note 16×Partial Award at [195].In this regard, the dichotomy between “issue identity” and “subject matter identity” was used to illustrate the difference in the degrees of identity required in the positions taken by the Companies and by the Employees. The different approaches were fully argued by the parties, and the Tribunal preferred the Employees’ approach. A plaintiff, to succeed in a claim based on breach of natural justice, has to show that “a reasonable litigant in his shoes would not have foreseen the possibility of reasoning of the type revealed in the award” and further that “with adequate notice it might have been possible to persuade the arbitrator to a different result” (Soh Beng Teeat [55], citingRotoaira Forest Trust v Attorney-General[1999] 2 NZLR 452). In the present case, the Tribunal did not adopt a new approach that was out of the parties’ expectation, and there is no breach of natural justice.",
        "Failure to consider argument": "103 To fail to consider an important issue that has been pleaded in an arbitration is a breach of natural justice because the arbitrator would not have brought his mind to bear on an important aspect of the dispute before him. It will usually be a matter of inference that the arbitrator failed to consider an important pleaded issue, and such an inference, if it is to be drawn at all, must be shown to be “clear and virtually inescapable” (AKN v ALCat [46]). 104 The Companies argue that the Tribunal failed to consider their argument that issue estoppel should not be granted where it would be unjust in the circumstances. Counsel for the Companies during the arbitration had submittedorallythat it would be unjust for issue estoppel to apply in circumstances where the plaintiffs would have had no opportunity of presenting their case on the merits in any forum. 105 From the outset, the argument that issue estoppel should not apply in circumstances where there would be injustice was not pleaded by the Companies in the arbitration. Mr Chew rightly pointed out that no such argument on injustice being an exception to issue estoppel was raised by the Companies in their Statement of Defence and Counterclaim and their Opening Statement during the arbitration. The absence of any argument that it would be unjust for issue estoppel to apply was even picked up by the Employees in their Statement of Reply and Defence to Counterclaim, which stated that the Companies “rightly do not suggest that, under any possible applicable law, there is an exception tores judicatawhere a defendant fails to participate in proceedings in circumstances where he has been given proper and adequate notice of them”.17Foot Note 17×Statement of Reply and Defence to Counterclaim at para 47(c); MK-33. 106 I turn to address the point raisedorallyduring the arbitral hearing by counsel for the Companies that the justice of the situation was one where the Companies should not be precluded from litigating the merits of their case on with-cause dismissal. I find no breach of natural justice. First, a tribunal is not obliged to deal with everyargument; all that is required of the tribunal is to ensure that the essentialissuesare dealt with (TMM DivisionMaritima SA de CV v Pacific Richfield Marine Pte Ltd[2013] 4 SLR 972 (“TMM Division”) at [72] and [73]). Natural justice does not require that the parties be given responses on all submissions made (SEF Construction Pte Ltd v Skoy Connected Pte Ltd[2010] 1 SLR 733 at [60];TMM Divisionat [76]). Second, it cannot be said that the Tribunal failed to address their mind to the issue of BTO’s absence. The Tribunal was keenly aware of the factual circumstance that BTO was absent from the MIC proceedings and did not present its case. The Tribunal expressly stated in the Partial Award that it was “true that the [MIC] did not have the benefit of submissions and evidence from [BTO]”, but “any problem was the result of the failure of the [Companies’] own internal arrangements”.18Foot Note 18×Partial Award at [192].In my view, the alleged ground of breach of natural justice has been used to cover what is essentially an attempt to review the merits of the Tribunal’s decision, which is not permissible.",
        "Decision not to decide on the merits": "107 The Companies contend that there was a breach of natural justice in that the Tribunal failed to decide on matters submitted to it because it regarded itself bound by the determinations of the MIC. The Companies also argue that the Partial Award should also be set aside under Art 34(2)(a)(iii) as a result. In this regard, Mr Jeyaretnam referred to the case ofCRW, where the Court of Appeal held that there was a breach of Art 34(2)(a)(iii) and s 24(b) because the arbitral tribunal failed to go into the substantive merits of the parties’ dispute even though the contract between the parties directed the tribunal to review the merits of the decision of the dispute adjudication board. 108 The case ofCRWis very different from the present case because there was a clear and express agreement for the arbitral tribunal to review the merits of the decision of the dispute adjudication board in that case. In contrast, the Tribunal in the present case was tasked with determining whether the findings of the MIC were contractually binding and hadres judicataeffect. In fact, the Tribunal decided on the very matters submitted to it, namely the Construction Issue, theRes JudicataIssue and the Audited Accounts Issue. This is not a case of the Tribunal having failed to give effect to the parties’ agreement. The Companies’ allegation that the Tribunal was not entitled to abdicate its fact-finding function to the MIC is a red herring. The Partial Award cannot be set aside on the basis of Art 34(2)(a)(iii) and s 24(b).",
        "The Employees’ alleged breaches of the dispute resolution clauses in the PEAs": "109  In their reply submissions, the Companies raised a last-minute claim that the Employees breached the dispute resolution clauses in the PEAs (the clause is produced at [10] above). Mr Jeyaretnam argued that under the PEAs, the Employees failed to initiate negotiations under the PEAs and did not issue a notice to BTO to cure what they considered to be BTO’s breach of the PEAs. He submitted that compliance with such mandatory steps is a precondition to any arbitration under the PEAs, followingInternational Research Corp PLC v LufthansaSystems Asia Pacific Pte Ltd and another[2014] 1 SLR 130. Mr Jeyaretnam also claimed that the Employees failed to draw the existence of the dispute resolution clauses in the PEAs to the attention of the MIC. He argued that it was mandatory for the parties to arbitrate their disputes, relying on the case ofPipeline Services WA Pty Ltd v ATCO Gas Australia Pty Ltd[2014] WASC 10. The jurisdiction clauses in the PEAs are expressly subject to the dispute resolution clauses and the MIC was not a court within the description of “the courts of Malaysia” in the jurisdiction clauses. The Employees’ conduct in commencing proceedings in the MIC was a repudiatory breach of the arbitration agreements, followingMarty Ltd v Hualon Corp (Malaysia) Sdn Bhd (receiver and manager appointed)[2018] 2 SLR 1207 (“Marty v Hualon”). Further, the parties did not contemplate the MIC to be the proper contractually-agreed forum for dispute resolution under the PEAs. 110 First of all, it is unclear which ground of challenge this relates to. On the one hand, the Companies seem to say that the Tribunal lacked jurisdiction because of the breaches. However, this goes against the whole tenor of their case, which is that the Tribunal should have decided on the substantive merits as to whether the dismissals were with or without cause. In any case, such an argument is meritless. The breaches alleged by the Companies are breachesof the PEAs. They have not alleged any breach of the preconditions to arbitrationunder the SPAand Mr Jeyaretnam confirmed so.19Foot Note 19×NE 18 March 2019 at p 101.The Companies have not explained how a breach of the PEAs resulting from the MIC proceedings would affect the jurisdiction of the Tribunal that was constituted under the SPA. Mr Jeyaretnam argued only that the breaches were relevant because the Tribunal held that its jurisdiction was fettered by the MIC Awards. This shows that his argument constitutes a challenge on the merits of the Tribunal’s decisions on the Construction Issue and theRes JudicataIssue, and does not touch on the Tribunal’s jurisdiction. I have addressed this at [81]–[83] above. 111 Another way of understanding the Companies’ argument on the breaches of the dispute resolution clauses in the PEAs is that the breaches form the context of the claims based on breach of natural justice, the erroneous abdication of jurisdiction by the Tribunal and public policy.20Foot Note 20×Plaintiffs’ supplementary reply submissions at para 20.I have analysed each of the Companies’ claims based on breach of natural justice and their claim that the Tribunal erred in abdicating jurisdiction above, and dismissed them. I now turn to their claim that the Partial Award should be set aside because it is in conflict with the public policy of Singapore.",
        "The public policy challenge": "112 The public policy ground for setting aside or refusal of recognition/enforcement is very narrow in scope. The Court of Appeal has held that the ground should only succeed in cases where upholding or enforcing the arbitral award would “shock the conscience”, or be “clearly injurious to the public good or … wholly offensive to the ordinary reasonable and fully informed member of the public”, or violate “the forum’s most basic notion of morality and justice” (PT Asuransiat [59]). In a public policy challenge, it is important to identify whether the alleged public policy exists in the first place (BAZ v BBAat [159]). 113 The Companies claim that the Partial Award should be set aside on the ground of public policy, because its effect is to shut them out of having the merits of their case on without-cause termination ventilated before any adjudicatory forum. This is exacerbated by the fact that BTO, through no fault of its own, was unaware of the MIC proceedings and was unable to defend the proceedings, and the fact that BTN was not even a party to the MIC proceedings. Their refrain is that the Partial Award is substantively unjust. To identify the public policy, Mr Jeyaretnam relied on theobiter dictainPT Asuransithat an award might be refused enforcement on the ground of public policy where through a series of procedural and other mishaps, a party found itself prevented from having its legal defence determined (at [75] and [76]). The public policy identified by the Companies appears to be that a party should not be prevented from having its case determined through a series of procedural and other mishaps. However, the Companies did not seek to address the ambit and delineation of any such public policy. 114 The Companies also claim that the Employees were in breach of the arbitration agreements in the PEAs in seeking recourse from the MIC (the alleged breaches have been described at [109] above), and it is contrary to public policy to allow them to take advantage of their own wrong. According to the Companies, it shocks the conscience or offends basic notions of morality and justice that the Employees can, by taking advantage of their own breaches of the PEAs, deprive the Companies of a hearing on the merits of their defence to a US$35m claim. Mr Jeyaretnam relied onWSG Nimbus Pte Ltd v Board of Control for Cricketin Sri Lanka[2002] 1 SLR(R) 1088 (“WSG Nimbus”), where the defendants commenced proceedings in a foreign court in breach of an anti-suit injunction ordered by the Singapore High Court, which they were aware of, and the High Court held that it would be a breach of public policy to give recognition to the foreign judgment and thus the foreign judgment did not give rise to issue estoppel (at [65]). He argued that the present case is analogous toWSG Nimbuseven though there was no anti-suit injunction on the facts, because the Companies had no opportunity to seek an anti-suit injunction. 115 Even taking the Companies’ formulation of the public policy at its highest, that a party should not be prevented from having its case determined through a series of procedural and other mishaps, the Companies face the obstacle of showing that they had in fact been prevented. The situation inPT Asuransiwas very different from the facts of the present case. The background facts of that case have been set out above at [72]–[73]. The Court of Appeal found that the guarantor’s defence based on the June 2001 meeting had been raised informally during the first arbitration, but the first arbitral tribunal found the June 2001 meeting to be irrelevant on the basis that it was outside the scope of the submission to arbitration. Thus, the second arbitral tribunal’s finding that it would have been directly relevant for the first arbitral tribunal to consider the June 2001 meeting had it been raised before the first arbitral tribunal was wrong. The corollary is that the second arbitral tribunal’s finding that the guarantor was estopped from raising its defence as it could have and should have raised it during the first arbitration was also wrong. In the setting aside proceedings, the Court of Appeal did not set aside the second arbitral award because it was not an award but a negative ruling on jurisdiction that could not be set aside under the IAA and the Model Law in force at that time. As a result of the various decisions, the guarantor was prevented from having its defence determined altogether. 116 In the present case, while one may harbour some sympathy for the predicament in which the Companies found themselves to be in, the Companies werenotprevented from having their case heard, contrary to the case ofPT Asuransi. From the outset, even putting aside the issues of whether the MIC’s findings were binding, the Tribunal decided that termination under cl 12.9.1(viii) of the SPA required Audited Accounts complying strictly with the definition set out in the SPA showing a negative EBITDA at the time of the dismissals or 90 days after. This Audited Accounts Issue is not the subject matter of the present proceedings. The Companies’ claim that they were shut out from presenting their defence therefore could relate only to the other grounds of dismissal. The failure of BTO to present its defence was, as the Tribunal found, the result of the failure of its own internal arrangements causing it to be absent before the MIC. Having found that the MIC Awards were valid and were decisions on the merits, the Tribunal decided that the MIC’s findings were binding, both as a matter of contractual interpretation and ofres judicata. I agree with counsel for the Employees that the Partial Award is not substantially unjust – the Tribunal applied the applicable law to resolve the agreed legal issues jointly submitted by the parties for determination. The Companies were given full opportunity to present their case on the legal issues. They must have been aware of the possibility that the Tribunal might decide against them on those issues. This outcome having materialised, the Companies cannot now refuse to accept the determination of the Tribunal on those legal issues. 117 With regard to the alleged wrongdoing of the Employees in commencing proceedings in the MIC, the Tribunal’s interpretation of the jurisdiction clauses and the dispute resolution clauses in the PEAs means that there was no wrongdoing. FollowingAJU v AJT[2011] 4 SLR 739 (“AJU v AJT”) at [66] and [70], such findings of fact and law by the Tribunal in a public policy challenge cannot be reviewed by this court.AJU v AJTdecided that a determination by the arbitral tribunal on what the public policy of Singapore is can be set aside if an error of law is made in this regard (at [67]), but this is not engaged in the present case. The present facts are also vastly different from the facts inWSG Nimbus, which concerned a judgment obtained in contempt of the Singapore courts.",
        "Issue 3: whether the Partial Award should be set aside with respect to BTN": "118  In the alternative, the Companies contend that the Partial Award should be set against BTN, as it stands in an entirely different position to BTO. This is because BTN has never been able to ventilate the substantive merits of its defence before any adjudicative forum, for it was not a party to the MIC proceedings, it was not heard before any arbitral tribunal convened under the PEAs or before any court proceedings pursuant to cl 18.5.1 of the PEAs. Moreover, the Tribunal refused to decide the merits of BTN’s defence. Mr Jeyaretnam submitted that this is an extraordinary and unconscionable result that strikes at all fundamental norms of arbitral jurisdiction, natural justice and public policy. 119 I do not see any merit in this argument which is founded on the Companies’ dissatisfaction with the Partial Award. The Tribunal was tasked to determine whether the MIC Awards bound both BTO and BTN, and it did so. Under the Construction Issue, the Tribunal had decided that construing the SPA and PEAs, the MIC’s findings were binding for the purposes of the SPA in respect to BTN. Under theRes JudicataIssue, the Tribunal had decided that the preclusive effect extended to BTN by virtue of it being in privity with BTO. Thus, my reasoning above for the non-applicability of s 10(3)(b) clearly applies to BTN, especially given that the nature of the Partial Award – whether it was a decision on the merits or on jurisdiction – does not depend on the party. My reasons for rejecting the various grounds to set aside the Partial Award are also equally applicable to both BTN and BTO, as the grounds relate to the alleged acts and omissions of the Tribunal. On the public policy challenge, while it is true that BTN was not a party to the MIC proceedings, the Tribunal found that the MIC’s findings were binding on BTN as a matter of the application of legal principles to the unique circumstances. It cannot be said that the application of contractual construction and the concept of issue estoppel by the Tribunal shocks the conscience or is wholly offensive to the ordinary reasonable and fully informed member of the public.",
        "Conclusion": "120 Going back to the Companies’ central complaint that they did not have the opportunity to present their case in defence to a US$35m claim, it is clear from this Judgment that the state of affairs the Companies found themselves in arose from two circumstances: (a) a failure of BTO’s internal process that led to its absence from the MIC proceedings and (b) the result or upshot of the Tribunal’s decision on the binary question as to whether the MIC Awards were binding on the parties submitted to it for decision. Having analysed each and every of the Companies’ arguments, this case does not call for an exercise of the court’s power to review the Partial Award under s 10(3) or to set it aside. 121 For the reasons given in this Judgment, OS 683, commenced to review the Partial Award pursuant to s 10(3) and to set aside the Partial Award pursuant to Art 34(2) and s 24(b) in the alternative, is dismissed with costs. Belinda Ang Saw EanJudge Philip Jeyaretnam, SC (instructed) and Liew Wey-Ren Colin (Colin Liew LLC) for the plaintiffs;Michael Hwang, SC (instructed) and Chew Kei-Jin, Yeo Chuan Tat and Tan Silin, Stephanie (Ascendant Legal LLC) for the defendants."
    }
}