{
    "case_title": "Wilmar Trading Pte LtdvHeroic Warrior Inc.",
    "ncitation": "[2019] SGHC 143",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1 The plaintiff, Wilmar Trading Pte Ltd, is a commodities trader. Pursuant to three sale contracts for various palm oil products, the plaintiff, as buyer on Free on Board (“FOB”) terms, nominated theBum Chinas the carrying vessel for the shipment of a consignment of palm oil products to be loaded at Kuala Tanjung terminal in Indonesia for carriage to and delivery at Jeddah and Adabiyah. The defendant, Heroic Warrior Inc., is the registered owner of theBum Chin, a Hong Kong flag oil/chemical tanker built in 2005. Her overall length is 145.35m, and there are 22 independent and segregated cargo tanks on board. She is classed with the Korean Register of Shipping. 2 The dispute in this action arises out of the loss and damage to part of the consignment of palm oil products due to an incident on board theBum Chinon 17 April 2013. As theBum Chinsustained physical damage in the incident, the plaintiff arranged another substitute vessel to transport the consignment of palm oil purchased under three aforementioned sale contracts that were made between PT Multimas Nabati Asahan (“MNA”) and the plaintiff. 3 The plaintiff’s pleaded claims are founded in contract and negligence. The averment in the statement of claim is that the defendant, as contracting carrier, failed in its duty to ensure that theBum Chinwas seaworthy and thus acted contrary to the Hague-Visby Rules (“Visby Rules”). The plaintiff also argues that the defendant, through its servants or agents, amongst other things, failed to take reasonable care of the cargo of RBD Palm Olein IV 64 (“ROL IV 64”) stowed in tank 4S. The plaintiff’s key contention is that tank 4S was not cargoworthy in that there were structural weaknesses present, and/or was over-pressurised due to insufficient venting of tank 4S or lack of control of the manifold valve. As a result, the longitudinal bulkhead of tank 4S buckled and the tank top fractured, thereby causing loss and damage to the cargo of ROL IV 64 stowed in tank 4S and the loss of use of theBum Chinas the nominated carrying vessel to perform the voyage to the intended discharge ports, amongst other things. The proceedings also contain an assertion of ownership of the consignment of palm oil products. 4 The defendant counterclaims against the plaintiff for,inter alia,the cost of repairs to theBum Chin. The nub of the defendant’s case is that the plaintiff is responsible for the damage sustained by theBum Chinbecause the terminal involved in the loading of the cargo was acting as the plaintiff’s agent and the terminal had improperly performed its part of the cargo operations so much so that a sudden surge of air pressure was introduced into the liquid cargo in tank 4S at a high velocity. This led to the over-pressurisation of tank 4S that caused the bulkhead of tank 4S to buckle and other damage observed after the incident. 5 As stated earlier, theBum Chinwas the nominated carrying vessel for the shipment of a consignment of palm oil products. There were three charterparties involved in the carriage of the aforementioned consignment of palm oil: a head time charter, a sub-time charter and a voyage charter. None of the three charterparties were between the plaintiff and the defendant, and no bills of lading were ever issued for the parcel of ROL IV 64 in tank 4S or other palm oil products loaded in other tanks on board theBum Chin. This judgment will first deal with the plaintiff’s claim founded on an express or implied contract derived from an intention in the charterparties to issue original bills of lading that incorporated the Visby Rules for the consignment in question. If it is adjudged that there is no contractual relationship between the plaintiff and the defendant as alleged, the plaintiff’s alternative cause of action is in negligence. In this regard, the plaintiff did not sue in common law bailment and the precise question to a claim in negligence is whether it is legally necessary for the plaintiff to have a proprietary interest in the cargo at the time of the incident before it is entitled to sue for substantial damages; or can a duty of care in negligence arise despite the absence of a proprietary interest in the consignment in question at the material time. As for the defendant, its counterclaim is premised on the existence of a contractual relationship between the parties and an agency relationship between the plaintiff and the terminal. If it is adjudged that there is no agency relationship as described, a related issue that arises is whether the plaintiff is entitled to hold the defendant wholly liable for the damages claimed even if the terminal is partly to blame for the incident. This issue would not arise if the terminal is not to be blamed for the incident at all. After addressing each parties’ title to sue under the respective claims and counterclaim, this judgment will then examine the merits of the parties’ respective cases on the cause of the incident and who is to be blamed for the incident. 6 The plaintiff is represented by Mr Prem Gurbani (“Mr Gurbani”) and assisted by Ms Tan Hui Tsing. The defendant is represented by Mr Philip Tay (“Mr Tay”) and assisted by Ms Yip Li Ming.",
        "Background facts": "7 The plaintiff brings this action as the owner and/or the party entitled to sue in respect of the following palm oil products: (a) 9,650mt of RBD Palm Olein (“ROL”); (b) 1,200mt of ROL IV 64; (c) 5,780mt of RBD Palm Oil (“RPO”); and (d) 2,240mt of RBD Palm Stearin (“RPS”). These were the quantities and quality of palm oil products stipulated for loading at the terminal in Kuala Tanjung for carriage to and delivery at Jeddah and Adabiyah under the voyage charterparty between the disponent owner of theBum Chin, NHL-Development Ltd (“NHL”), and Raffles Shipping International Pte Ltd (“Raffles Shipping International) (nominating the plaintiff as charterer) (see [10] below). 8 Further or alternatively, the plaintiff brings this action as the owner and/or the party entitled to sue in respect of: (a) 1,200.055mt of ROL IV 64; (b) 2,327.944mt of ROL; and (c) 1,146.451mt of RPO. According to the plaintiff, these were the actual volumes of the palm oil products already loaded on board theBum Chinat the time of the incident. There appears to be a discrepancy in the loaded volume of ROL IV 64 stated in the pleadings, the affidavits of evidence-in-chief (referred to as “AEICs” in the plural and “AEIC” in the singular) and in parts of the closing submissions. “1,200.055” and “1,200.55” are both used. As the plaintiff’s damages are based on calculations that use the figure of 1,200.055mt, and the surveyor report adduced by the plaintiff uses the same figure, this judgment will take 1,200.055mt as the volume of ROL IV 64 that was loaded. 9 The plaintiff had purchased these palm oil products from an Indonesian seller, MNA, under three sale contracts. These contracts expressly state that the palm oil products were purchased FOB Indonesian Ports.1Foot Note 1×Plaintiff’s Bundle of Documents (“PBOD”), pp 1–6; Plaintiff’s Bundle of Affidavits of Evidence-in-Chief of Factual Witnesses (“PBAEIC (factual)”), pp 160–165.Under the sale contracts, MNA as FOB seller was responsible for loading the palm oil products on board theBum Chinand the plaintiff was responsible for procuring theBum Chin. MNA owned the Kuala Tanjung terminal. At the terminal, palm oil products in storage tanks are pumped through the terminal’s product pipelines terminating at flanges which are fitted with flexible hose lengths for connection to the loading vessel’s manifold system. 10 As stated earlier, the carriage involved three charterparties. The head charterparty was a time charterparty between the defendant as the registered owner and STX Pan Ocean as the head charterer. The sub-time charterparty was between STX Pan Ocean and NHL. The voyage charterparty was between NHL and Raffles Shipping International (nominating the plaintiff as charterer). There are ongoing arbitration proceedings between the various parties under the three charterparties. 11 For completeness, MNA, Raffles Shipping International and the plaintiff are related companies under Wilmar International Limited. Nothing turns on this relationship in this action.",
        "Plaintiff’s causes of action against the defendant": "",
        "Plaintiff’s cause of action in contract": "12 The essence of the plaintiff’s pleaded claim in contract against the defendant is that the defendant failed to render theBum Chinseaworthy and/or make the holds and all parts of the vessel in which cargo is carried, fit and safe for the reception of goods, and that its servants or agents failed to take reasonable care in the loading, handling, storage, keeping and care of the cargo. The plaintiff asserts that there exists an express and/or implied contract of carriage between the parties. The issue for determination is whether the plaintiff and defendant are contracting parties. 13 The plaintiff’s contention that there exists an express contract of carriage between the plaintiff and defendant is ambiguous. As alluded to earlier, it is not controversial that the three charterparties involved in the carriage of the consignment of palm oil products are not between the plaintiff and the defendant. The head time charter is between the defendant and STX Pan Ocean, the sub-time charter is between STX Pan Ocean and NHL, and the voyage charter is between NHL and the plaintiff, as nominee of Raffles Shipping International (“NHL charter”). Hence, it is unclear how an express contract of carriage could arise between the parties. 14 As for the alleged implied contract, the plaintiff submits in its closing submissions that the implied contract of carriage between the plaintiff and the defendant is evidenced by original bills of lading thatwould have been issuedto the plaintiff in Singapore by the defendant had tank 4S not been damaged and loading of the entire consignment of palm oil products on board been accomplished. The NHL Charter contemplates the issuance of bills of lading for shipments under the charter. The bills of lading as contemplated would incorporate the Visby Rules, thereby giving rise to contractual obligations on the defendant’s part to exercise due diligence to make theBum Chinseaworthy, among other things. The obvious difficulty in the plaintiff’s case is that no bills of lading were ever issued as the voyage was never carried out. Thus, the plaintiff bases its argument on an intention in the NHL Charter to issue original bills of lading that incorporated the Visby Rules for the consignment in question and citesPyrene Co Ld v Scindia Navigation Co Ld[1954] QB 402 (“Pyrene”) for the proposition that there is no need for bills of lading to be actually issued for there to be a contract of carriage since the bill of lading is only evidence of an antecedent contract, and that where bills of lading were contemplated to be issued, the Visby Rules would be incorporated if the terms of the bill of lading so provide. 15 That a bill of lading evidences the antecedent contract of carriage is not controversial. The question is whether there exists such a contract of carriage in the first place. In this connection, the existence of a contract of carriage is to be decided on contractual principles. The following paragraph is instructive (Guenter Treitel & F.M.B. Reynolds,Carver on Bills of Lading(Sweet & Maxwell, 4th Ed, 2017) at para 3-002): Where the contract of carriage (or some other contract between carrier and shipper) is alleged to have been made on terms derived from negotiations which have taken place before shipment or intended shipment, the question whether these negotiations have indeed resulted in the conclusion of a contract will depend on the general principles of law relating to contract formation. In accordance with these principles, it was for example held in one case that a mere communication by a carrier of terms on which he would be prepared to carry the prospective goods did not have contractual force, and in another it was accepted that a booking note similarly did not give rise to a contract because a “shut-out” clause in the note made it clear that the prospective carrier had not intended to undertake any legal obligation to carry the goods in question. It is only if a contract of carriage has come into being between the relevant parties that the court considers the next question of whether the antecedent contract incorporated the Hague Rules or the Visby Rules as terms of the contract of carriage. 16Pyreneis of no assistance to the plaintiff. Let me begin by summarising the case. The plaintiffs in that case sold a fire tender to the Government of India for delivery FOB London. One of the defendants’ vessels was nominated as the ship under the contract of sale and arrangements were made for the carriage of the goods. While the tender was being lifted onto the vessel and before it was across the rail, it was dropped and damaged. The fire tender was not the only machinery supplied by the plaintiffs for shipment, although it was the only machinery damaged before shipment. A bill of lading had been prepared to cover the whole shipment but because of the incident, the fire tender was deleted from it. The defendants admitted liability and contended that the plaintiffs’ claim was limited under the Hague Rules. According to Devlin J, for the defendants to succeed, the defendants had to show privity of contract between themselves and the plaintiffs, that the contract incorporated the Hague Rules, and that the Hague Rules were effective to limit their liability (at 413). 17 InPyrene, it was “not disputed that … the contract of carriage was actually created before the issue of the bill of lading” (at 414) and more importantly, the existing contract was between the shipowner and the cargo interest. In the present case, there isnosuch contract between the plaintiff and the defendant. Hence, it is not apparent howPyrenewould be applicable to the facts in this case. 18 The entire basis of the plaintiff’s position on an implied contract of carriage is the allegation that the original bills of lading contemplated by the parties would be owner’s bills of lading (ie, issued by the defendant); thereby evidencing a direct contractual relationship between the plaintiff and defendant. This premise is seriously misplaced since the evidence shows, and I find, that the intention was to issue charterer’s bills of lading (ie, issued by NHL). This finding means that the defendant is not the contractual carrier and so the defendant is not liable in contract. 19 I start by addressing the matter of the bill of lading format that was intended to have been used. At the trial, the plaintiff disclosed an email dated 8 March 2013 from Inge Steensland Singapore Pte Ltd (the brokers who had arranged the fixture) to Raffles Ship Chartering Pte Ltd (the operational arm of Raffles Shipping International).2Foot Note 2×Exhibit P3; Plaintiff’s Further & Better Particulars (18 December 2015), para 1(a).This email sets out the details of the bills of lading arrangement relating to the shipment of palm oil cargo from Kuala Tanjung terminal. The plaintiff claims that the defendant had agreed to a bill of lading format purportedly attached to the 8 March 2013 email and that this was an “Owner’s Bill of Lading format”.3Foot Note 3×Transcript 26 January 2018, p 64.There appears to be no such attachment to the 8 March 2013 email. As counsel for the defendant, Mr Tay, suggested to the plaintiff’s witness, Chen Kit Peng (“Ms Chen”), the bill of lading attachment tendered to the court was sent much later in a subsequent email in 2015. And Ms Chen accepted that the 8 March 2013 email had no attachment. To this end, the only reference to apro formabill of lading is the sample contained in the NHL Charter. 20 The standard printedpro formabill of lading to the NHL Charter is drafted to express and evidence a contract between the shipper (and any transferee of the bill) and the registered owner of the vessel (ie, the defendant)as the provision for signature by the master or his agent so indicated. This standard printedpro formabill of lading at first blush supports the plaintiff’s position that owner’s bills of lading would be issued. However, reading the NHL Charter and the 8 March 2013 email as a whole, as well as taking into account the bills of lading arrangement regarding the shipment, it is clear that charterer’s bills of lading were intended to be issued by Sea Ocean Shipping Agency Pte Ltd (Singapore) (“Sea Ocean”) as agent for and on behalf of NHL. 21 The NHL Charter included two addendums: a set of Special Terms and Wilmar Trading Rider Terms (Revision 5 dated 18 April 2001). Clause 2 of the Special Terms of the NHL Charter is titled “NON NEGOTIABLE BS/L CLAUSE”, and cl 2 of the Wilmar Trading Rider Terms (Revision 5) dated 18 April 2001 is titled “BILL OF LADING CLAUSE”. Under these clauses it would appear that upon completion of loading in Indonesia, non-negotiable bills of lading will first be issued for the purposes of clearing customs. It is only upon confirmation that freight has been irrevocably remitted and that the non-negotiable bills of lading have been cancelled that Sea Ocean would release the original bills of lading. 22 The 8 March 2013 email states: “OWNER’S NAME TO BE ON B/L:NHL DEVELOPMENT CO., LTD”. The email also confirms that the agent for signing and releasing original bills of lading would be Sea Ocean. At trial, Ms Chen, who was at the material time the senior executive of operations, clarified that that the plaintiff was expecting bills of lading to be issued by the disponent owner, NHL, and not the defendant as registered owner.4Foot Note 4×Transcript 26 January 2018, pp 55–56.Her evidence is consistent with the testimony of the defendant’s representative, Mr Uchiyama Yasuhiro (“Mr Yasuhiro”). Essentially, Mr Yasuhiro’s evidence is that the defendant was not asked to issue any original bills of lading for the consignment. As Mr Yasuhiro’s AEIC explains, “[n]o blank bill of lading format or draft bill of lading was ever given to the [d]efendant for approval or comment.”5Foot Note 5×Defendant’s Bundle of Affidavits of Evidence-in-Chief (“DBAEIC”) Vol 1, p 110.In other words, the defendant was not the intended contractual carrier. 23 Going back to the language of the standard printedpro formabill of lading sample, the preamble of the NHL Charter provides that the terms of the NHL Charter in relation to receipt, delivery and discharge are incorporated in the bills of lading covering the cargo described in Part I of the NHL Charter. This suggests that any bills of lading would not be with the defendant as there is no provision for the terms of head charter to be incorporated into the bill of lading. 24 Accordingly, this court finds that the arrangement was for NHL to issue bills of lading for the consignment of palm oil products shipped on board theBum Chin. It is sufficient on this holding to dispose of the plaintiff’s submission on an implied contract of carriage. For completeness, I should mention that the defendant’s plea that the plaintiff’s claims are time-barred under the Visby Rules does not arise having regard to the holding that there is no contract of carriage between the plaintiff and defendant.",
        "Plaintiff’s cause of action in negligence": "25 I turn now to the plaintiff’s cause of action in negligence. The plaintiff brings this action as cargo owner and FOB buyer of the cargo. The endorsement of claim included the plaintiff’s plea of common law bailment.6Foot Note 6×SOC (amendment no. 2), para 2However, bailment was dropped in the plaintiff’s statement of claim and in the plaintiff’s closing submissions. Thus, it is proprietary and not possessory interest that is the relevant issue to the claim in negligence. 26 As stated above at [7] to [8], the plaintiff claims that it is entitled to sue in respect of the whole consignment of palm oil products that was to be shipped on board theBum Chin, or in the alternative, the plaintiff is at least entitled to sue in respect of cargo that were already loaded.  On either view, the plaintiff asserts that at the time of the incident, property in the cargo had passed to it. 27 The three sale contracts between MNA and the plaintiff specified that the palm oil products were sold on FOB Indonesian Ports terms. The plaintiff has not referred to any contractual clause that deviates from the classic FOB arrangement. Under a classic FOB contract, unless expressly contracted otherwise, property passes upon payment. The payment term in the sale contracts stipulates either cash against documents or advance payment. 28 The plaintiff called two witnesses to testify on payment. The first witness is a manager employed by the plaintiff, Mr Foo Chee Tong (“Mr Foo”). He confirmed the two forms of payment under the sale contracts and testified that the plaintiff normally makes payment upon the presentation of an invoice. The second witness, Mr Thomas Lim Kim Guan (“Mr Lim”) is the plaintiff’s Group Head for Edible Oils who signed the three sale contracts on behalf of the plaintiff. He testified that the plaintiff had made advanced payment for the cargo and that the plaintiff would have received an invoice to make the payment.7Foot Note 7×Transcript, 31 January 2018 p 10.However, no evidence of an invoice, or evidence detailing amount paid, mode of payment and date of payment were before this court. 29 As for the cash against documents payment option, it is highly unlikely that the plaintiff had used this mode of payment as the relevant documents could not have been ready for exchange at the material time. In the three sale contracts, the word “documents” referred to in the payment term is expressed in plural and this indicates that more than one document is envisaged to be exchanged for cash. The presentation of invoice is not to be regarded as sufficient. Other than an invoice, Mr Foo did not mention the requisite documents to be tendered for payment. However, it is likely that the documents to be presented would be similar to those listed in an email between MNA and the plaintiff dated 12 April 2013 regarding the revised shipping instructions. This is because in international sale of goods, these are the documents normally required to be presented in exchange for cash. Now the email stated that three copies of commercial invoices along with a list of other documents were required before the original bill of lading would be issued in Singapore after confirmation that freight had been received.8Foot Note 8×PBAEIC (factual), p 208.This list of other documents included the non-negotiable bill of lading where the plaintiff was to be named as the notify party with MNA as the named shipper (as was testified by Ms Chen), certificates of origin, the relevant survey report, and other certificates required at the discharge ports. It is unlikely that the plaintiff would have been presented with these documents for cash payment as these documents would normally be available only after completion of loading of cargo. At the time of the incident, the documents would not be ready to be exchanged for payment. 30 On the two alternative modes of payment, there is no evidence of the option used in this case and this court holds that the plaintiff has not proved that it had paid for the consignment of palm oil products at the time of the incident. 31 The plaintiff further contends that the property in the palm oil passed from MNA as seller to itself as buyer when the goods were loaded on board theBum Chin, and quotes the following passage from M G Bridge,The International Sale of Goods(4th Ed, Oxford University Press, 2018) at para 7.08 in its closing submissions:9Foot Note 9×Plaintiff’s Closing Submissions (“PCS”), para 498. On boardIf an FOB seller delivers the goods to a carrier, and does not reserve the right of disposal by taking control of the bill of lading, then property will pass, if it has not already done so further to the parties’ intention, when the goods are put on board. … In many FOB contracts, the seller will not have been paid by the time the goods are loaded on board. Unless the seller reserves the right under s 19 of the Act, a very common occurrence, the seller is at risk of non-payment if the buyer is to pay at a later time. [emphasis in original] 32 The plaintiff is effectively referring to s 19 of the Sale of Goods Act (Cap 393, 1999 Rev Ed) on the right of disposal, which states: Reservation of right of disposal 19.—(1) Where there is a contract for the sale of specific goods or where goods are subsequently appropriated to the contract, the seller may, by the terms of the contract or appropriation, reserve the right of disposal of the goods until certain conditions are fulfilled; and in such a case, notwithstanding the delivery of the goods to the buyer, or to a carrier or other bailee or custodier for the purpose of transmission to the buyer, the property in the goods does not pass to the buyer until the conditions imposed by the seller are fulfilled. (2) Where goods are shipped, and by the bill of lading the goods are deliverable to the order of the seller or his agent, the seller is prima facie to be taken to reserve the right of disposal. (3) Where the seller of goods draws on the buyer for the price, and transmits the bill of exchange and bill of lading to the buyer together to secure acceptance or payment of the bill of exchange, the buyer is bound to return the bill of lading if he does not honour the bill of exchange, and if he wrongfully retains the bill of lading, the property in the goods does not pass to him. 33 Theprima faciepresumption in s 19(2) is that by reserving its right of disposal in the bill of lading, the property in the goods remains with the seller until the seller has received payment of the price in full. Evidence of such a reservation of right is where the bill of lading is made out to the seller as shipper or to the shipper’s order. In this case, while no bills of lading were issued, the non-negotiable bills of lading can serve as proxies as to the intention of the buyer and seller on the passing of property in the goods at the time of shipment. The way the non-negotiable bills of lading were intended to be made out is consistent with the payment term of the three sale contract. Ms Chen’s testimony that MNA is the named shipper on the non-negotiable bill of lading. Further, in the email of 12 April 2013 which sets out the revised shipping instructions to MNA (also referred to above at [29]), MNA would be the named shipper, and the non-negotiable bills of lading were contemplated to be made out to the order of the shipper, with the plaintiff as the notify party. These are clear indications that the shipper, MNA, would be reserving its title to the shipment of palm oil products. Whilst the non-negotiable bills of lading were contemplated for custom clearance purposes, the information on the non-negotiable bills of lading as described evidentially supports an intention by MNA to reserve its right of disposal. This is logical in the light of the terms of payment in the sale contracts (see [27]–[30] above on the alternative modes of payment). 34 For the reasons stated, the plaintiff has not established that property passed when the goods were put on board. The plaintiff has not shown evidence of payment nor shown that there was no intention on the part of the seller to reserve its right of disposal. 35 The next question that arises is whether the plaintiff can sue the defendant in negligence as an FOB buyer of the palm oil products. On this basis, the defendant contends that the plaintiff has no title to sue in negligence. The defendant’s argument is that the plaintiff has no proprietary interest in the cargo and relies on the English case ofLeigh andSillavan Ltd v Aliakmon Shipping Co Ltd[1986] AC 785 (“Aliakmon”)in support of the proposition that the buyer has no title to sue the shipowner in negligence if title to the property remained with the seller at the time the goods were damaged. I note parenthetically that the English position continues to prevail even though risk in the cargo passes to the buyer: seeObestainInc v National Mineral Development Corporation Ltd (The “Sanix Ace”)[1987] 1 Lloyd’s Rep 465. 36 In my view, the defendant’s contention is now moot. The parties were invited to submit onNTUCFoodfare Co-operative Ltd v SIA Engineering Co Ltd and another[2018] 2 SLR 588 (“NTUCFoodcare”), a decision which was published after close of submissions. In that case, the Court of Appeal at [35] expressly rejectedAliakmonand held that the legal requirement of proving ownership of or a possessory interest to the cargo in order to bring a claim in negligence for loss flowing from the damage no longer applies in Singapore: … more fundamentally, under our law of negligence, there is no requirement that a plaintiff must own or have possessory title to the property to sue for loss flowing from damage to that property. There is such a requirement under English law: seeLeigh andSillavan Ltd v Aliakmon Shipping Co Ltd[1986] AC 785 at 809 (perLord Brandon of Oakbrook). However, it is critical to appreciate the basis of this requirement under English law. It is simply a corollary of the exclusionary rule against recovery for pure economic loss under English law: the rule that a defendant will not generally owe a duty of care to a party who suffers pure economic loss due to the defendant’s negligence. … However, inSpandeck… we rejected the exclusionary rule against recovery for pure economic loss (at [69]). There is thus no basis under our law for a requirement that a plaintiff must own or have possessory title to the property to sue for loss flowing from damage to that property. 37 As pure economic loss is claimable under Singapore law, the plaintiff need not prove a proprietary interest in the cargo to have title to sue in respect of the loss it has suffered. The question therefore turns on whether the defendant owes the plaintiff a duty of care; and if no such duty is owed, the plaintiff’s claim can be dismissed in its entirety. Existence of duty of care 38 The test for the establishment a duty of care in tort is settled and well-established. A duty of care will arise in tort if: (a) it is factually foreseeable that the defendant’s negligence might cause the plaintiff to suffer harm; (b) there is sufficient legal proximity between the parties; and (c) policy considerations do not militate against a duty of care (seeSpandeckEngineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 (“Spandeck”)at [73], [77] and [83]). 39 The first requirement of factual foreseeability is satisfied in this case. InSpandeckat [75]–[76], the Court of Appeal referred to factual foreseeability as a low threshold requirement. The focus of this enquiry is on the foreseeability ofharmand theclass of personswho may be affected by the negligent act of the omission: Gary Chan Kok Yew,The Law of Torts in Singapore(Academic Publishing, 2nd Ed, 2016) (“The Law of Torts in Singapore”)at p 9. In my judgment, the defendant as performing carrier would have reasonably foreseen that its negligence would cause economic loss to a buyer of cargo who bore the risk of damage to or loss of the cargo, which in this case, was the plaintiff. Indeed, it was the plaintiff who nominated theBum Chinas the carrying vessel for the shipment of a consignment of palm oil products to be loaded at Kuala Tanjung terminal, and part of the consignment was actually on board before the incident occurred on 17 April 2013. 40 The second requirement of legal proximity is also satisfied. Legal proximity focuses on “the closeness of the relationship between the parties” and includes “physical, circumstantial as well as causal proximity” (Spandeckat [77] and [81]). The crux of the inquiry is whether the plaintiff was so closely and directly affected by the defendant’s actions that the latter ought to have had the former in contemplation in its acting. 41 While the defendant has no contractual relationship with the plaintiff, the relationship between the plaintiff and defendant was sufficiently proximate. Under a classic FOB contract, it is the buyer’s duty to nominate the carrying vessel and the FOB seller’s duty to put the goods on board the nominated vessel. Risk in the goods passes from the seller to the buyer when the goods are put on board the vessel. The significance of risk passing to the buyer before payment is that even if the goods were lost or damaged, the buyer would have to pay the seller the price under the sale contract. More so under Singapore law where the claimant need not show a proprietary interest in the goods to mount a claim for pure economic loss. Here, the plaintiff, as FOB buyer, was responsible for nominating theBum Chinand took on the risk of damage to the palm oil products on board theBum Chin. The defendant as the registered owner in a chain of charterparties, was in possession of theBum Chinand the employer of theBum Chin’s crew at all material times. As a result of the damage to tank 4S, the cargo of ROL IV 64 in tank 4S was contaminated by seawater and some of the cargo of ROL IV 64 on board was lost during discharge from theBum Chin, amongst other things. Further, theBum Chincould no longer continue to perform the carriage given the physical damage she sustained. The plaintiff was also the party who saw to the transhipment of the palm oil products to a substitute vessel,PingAn, as testified by Ms Chen. In the circumstances, I am satisfied that on the evidence before the court, there was physical, circumstantial and causal proximity. 42 Finally, as regards countervailing policy considerations, the common concern that arises is indeterminacy – would a defendant be exposed to liability to an indeterminate class of persons if a duty of care is found. In my view, indeterminacy would not arise as the limitation here is on the party who is at risk. That is to say the plaintiff, as FOB buyer, is the only party who bore the risk of loss or damage to the cargo and is within an identifiable class of persons who would suffer loss as a result of the defendant’s negligence, if any. 43 It is worth repeating that there is no contract of carriage evidenced by a bill of lading between the plaintiff and the defendant. As such, the Visby Rules do not apply. As a matter of principle, the defendant owes the plaintiff a duty to take reasonable care of the cargo loaded on board theBum Chinfor carriage to and delivery at named discharge ports. The care of the cargo would be based on the common law standard applicable to a performing carrier using reasonable care and skill to ensure that theBum Chinwas cargoworthy for the purpose of undertaking the carriage to and delivery of the cargo at the discharged ports. The issues of breach of duty and causation will be examined later in the judgment.",
        "Defendant’s counterclaim": "44 The defendant counterclaims against the plaintiff for the damage on board theBum Chin. The defendant’s counterclaim is pleaded and predicated upon the plaintiff’s averment of a contract of carriage between the plaintiff and the defendant:10Foot Note 10×Defence and counterclaim (amendment no 3), para 19. As set out earlier in the Defence, it is the Plaintiff’s own case that the Plaintiff and Defendant were parties to a contract of carriage and/or a charterer by agreement and/or by law.It follows thenthat based on the Plaintiff’s own case, by law or by contract, the duties and obligations of a cargo owner / shipper / charterer to safely and properly load cargo onto the Bum Chin at the minimum up to the ship’s rails without causing damage and loss to the Vessel would apply to Plaintiff [sic] and the Plaintiff would be liable to Defendant for the loss or damage to the Vessel from their failure to safely and properly load cargo onto the same. … [emphasis added] The defendant’s closing submissions confirms that the counterclaim takes its course from the plaintiff’s allegation of a contract of carriage between the parties. To the extent that there is no contract of carriage between plaintiff and defendant, the counterclaim is readily dismissed. 45 The defendant, separately, alleges that MNA and its personnel involved in the cargo operations are agents, servants, sub-contractors or stevedores of the plaintiff. Hence, the fault of any of these individuals gives rise to liability on the part of the plaintiff as regards the defendant’s loss arising from damage to theBum Chin(“the agency argument”). In my judgment, the defendant has not shown any basis (legal or factual) for this contention and hence, the agency argument must fail. 46 The terminal (who for all intents and purposes is interchangeable with MNA), as FOB seller, was deploying its personnel to deliver the palm oil products to the plaintiff’s nominated vessel pursuant to the FOB sale contracts. From this perspective, the terminal’s personnel cannot be the servants, agents, sub-contractors or stevedores of the plaintiff as claimed by the defendant. In the light of the risk allocation under the FOB sale contracts, the relationship between the terminal’s personnel (through MNA) and the plaintiff is not one of agency. 47 Separately, under cl 7(a) of the NHL Charter, the charterer (ie, the plaintiff) agreed that the cargo be pumped into the vessel “at the expense, risk and peril” of the charterer.11Foot Note 11×PBAEIC (factual), p 180.The risk allocation in cl 7(a) is between the plaintiff and NHL and the effect of this risk allocation is that the plaintiff cannot sue NHL. Clause 7(a) cannot change the relationship of the terminal’s personnel and the plaintiff to fit the defendant’s agency argument. In any case, the defendant cannot rely on this clause for want of privity. 48 The defendant further submits that at common law, the shipper is responsible for (ie,bears the risk and expense of) pumping the cargo into the ship  and cites a passage from Sir Bernard Ederet al,Scrutton on Charterparties and Bills of Lading(Sweet and Maxwell, 23rd Ed, 2015) at para 9–143 to suggest that the plaintiff, as shipper, is jointly responsible for loading operations:12Foot Note 12×Defendant’s Closing Submissions (“DCS”), para 89. At common law loading is a joint operation of the shipper or charterer and of the shipowner. In the absence of custom or express binding agreement it is the duty of the former at his risk and expense to bring the cargo alongside and lift it to the ship’s rail, it is then the duty of the owner by his master to receive the load and stow the cargo properly. 49 The passage quoted above does not improve the defendant’s agency argument. The defendant’s characterisation of the plaintiff as shipper is inaccurate. The shipper in this case is MNA, the FOB seller. And as stated above, at the material time, MNA was to be the named shipper to be inserted into the non-negotiable bills of lading. Equally, it was the terminal acting in its own capacity when it pumped the cargo through its product lines to the ship’s manifold. 50 Although the plaintiff did raise the term “joint operations” at trial and in the closing submissions, it did not go so far as to accept responsibility over the acts of the terminal. For the plaintiff, the term was merely used to describe the interface between the terminal and the vessel for cargo operations to take place. Whereas the terminal delivered compressed air to the ship’s manifold valve for pigging and line blowing, and was responsible for controlling the main valve at the jetty, it was the responsibility of theBum Chinto handle and control the amount of pressure received at the ship’s manifold, assuming that the pressure was no more than 7 bar. On the specific responsibility of theBum Chin, it had to ensure that the ship’s manifold valve opened to a maximum of 50% during pigging, and during line blowing, it had to ensure that the manifold valve was opened to a maximum of 10% and throttled to control the amount of air entering tank 4S. Suffice to say for now, the plaintiff’s case is that the defendant’s failure to throttle the manifold valve during line blowing led to a continued increase in pressure within tank 4S that contributed to the incident. The plaintiff’s point is that it was not involved at all in the cargo operations, and as between the terminal and defendant, the fault is on the defendant for not controlling pressure at the ship manifold valve during line blowing. 51 I should add that on the finding that the plaintiff is not responsible for the acts of the terminal and its personnel, any suggestion of a duty of care between the plaintiff and defendant for the purposes of the counterclaim (ie, that the plaintiff owed the defendant a duty of care to load the cargo) cannot stand. All in all, the conclusion reached in this judgment is that the defendant’s entire counterclaim against the plaintiff is without merit and is dismissed.",
        "The substantive dispute in the main action": "52 I now turn to the plaintiff’s claim in negligence and the defendant’s defence. To succeed in its claim, the plaintiff has to establish breach of duty on the part of the defendant, and that the breach caused or contributed to the incident that in turn led to the plaintiff’s loss. It is sensible to start the inquiry with what caused the damage to tank 4S as it would lead to the determination of the real question -– what caused the plaintiff’s loss (ie, for ROL IV 64 to leak out of tank 4S to the water ballast tank, andvice versafor ingress of seawater into tank 4S, and the loss of use of the vessel). As the plaintiff is suing in negligence, the legal burden lies with the plaintiff to establish the effective cause of the incident on 17 April 2013. 53 Had the plaintiff sued in common law bailment, the legal burden would have been on the defendant to show that it had exercised reasonable care and hence, was not negligent. This is because under a plea of bailment, once the cause of the incident is clear, the question of breach is easily disposed of. It is not disputed that the ROL IV 64 cargo in tank 4S was received in good order and condition. The plaintiff’s allegation is that the ROL IV 64 cargo in tank 4S was contaminated by seawater after the incident. The defendant would then have the task of explaining how the incident was not the result of its negligence. However, the plaintiff, has not pursued bailment in the statement of claim and I shall say no more of it. 54 For a better understanding of the events leading to the incident on 17 April 2013, I start with a brief description of the terminal’s storage and loading facilities, tank 4S, cargo operations (namely, cargo loading, pigging and line blowing in the context of pipelines) and the venting facilities on board theBum Chin.",
        "The Kuala Tanjung terminal": "55 In general terms, the terminal comprises storage tanks, pump houses, various pipelines and a jetty that has flexible hoses connecting to the receiving vessel’s permanent manifold system. Typically, palm oil is first received at the terminal’s reception areas, and would be transferred into storage tanks or storage areas on site for processing into various palm oil products before export. The storage tanks are inter-connected via pipelines or pump systems at one of the terminal’s two pump houses (referred to as the NKB and KB pump house). 56 The NKB pump house is the smaller of the two pump houses. It is equipped with export lines that connect to the main product lines in the KB pump house. There are two air compressors, two associated air dryers and two air reservoirs. The compressors, dryers and reservoirs form a compressed air facility that serves the entire terminal. 57 Compressed air from the NKB pump house would be channelled to and received by the air reservoirs in the KB pump house. Compressed air is necessary to clean the lines after cargo loading, through a process of pigging and line blowing. The KB pump house is located approximately 450m away from the NKB pump house and is the larger of the two. It is equipped with the following facilities: (a) Three air reservoirs that receive compressed air sourced from the NKB pump house compressors. (b) Six product lines (labelled as “A” to “F”) that serve the jetties. (c) Six pig sender units that are fitted to the ends of every export line. I add that while pressure of 7 bar is released at the KB pump house during pigging, as the compressed air travels down the pipeline system, the pressure decreases to 3 to 4 bar by the time it reaches the main jetty valve at the jetty. 58 From the KB pump house to the jetties is a road causeway that stretches approximately 2.65km. The six product lines from the KB pump house also runs to the jetties. The causeway terminates at the main jetty, Jetty A, which was the jetty that theBum Chinwas berthed at the time of the incident. 59 Jetty A is set up with the six product lines and their associated pig receivers. At the end of each product line, before the pig receivers, is a gate valve (ie,the main jetty valve). This main jetty valve is used during loading, pigging and line blowing. The product lines terminate at flanges which are fitted with flexible hoses for connection to the receiving vessel’s manifold system. Cargo is pumped from a storage tank along a product line to the manifold at the jetty and through the manifold of the receiving vessel. The reception of cargo into the receiving vessel’s manifold system is controlled by a manifold valve on board. In this case, theBum Chin’smanifold is able to handle a maximum pressure of 7 bar. Each of the tanks on board theBum Chinhas its own manifold system. The distance between the main jetty valve and the vessel’s manifold is about 20 to 25m apart. Tank 4S 60 TheBum Chinis fitted with 22 cargo tanks, 11 on port side and starboard side. Each tank is completely segregated and independent from all the other tanks and is comprised of longitudinal and transverse corrugated bulkheads. The following tanks were slated for loading: (a) ROL IV 64 was to be loaded into tank 4S. (b) RPO into tanks 2P, 2S, 8S, 9P, 9S, and 10P; and (c) ROL into tanks 3P, 3S, 4P, 5P, 5S, 6P, 6S, 7P, 7S, and 8P. 61 Diagram 1: the plaintiff’s layout of tank 4S  62 Cargo is received from the bottom of the tank (referred to as the “tank top”). The topmost of the tank is referred to as the “deck”. The tanks are held in place by welds and stiffeners located at the underside of the tank top. 63 Every individual cargo tank is fitted with a level sensor that is connected to the system monitor panel in the Cargo Control Room (“CCR”). This panel indicates the level of cargo in a tank at any one point in time. TheBum Chinis also fitted with a level alarm system that consists of both automatic and manual alarms. The first automatic alarm, the high level alarm, will activate when the level in any tank reaches 95% of the tank capacity. The second automatic alarm, the overfill alarm, will activate when the level in any tank reaches 98% of the tank capacity. There is also a manual level alarm that cn be set within the CCR. 64 There is a pressure sensor fitted in every tank. This pressure sensor is located at the deck. The sensor is connected to the system monitor in the CCR and it indicates, in digital format, the pressure of the atmosphere in the ullage space of the cargo tank at any particular time. The ullage space refers to the space between the top level of the cargo and the deck. 65 The tank monitoring system is also equipped with a high pressure system. This is a manual system and the setting must be set by the chief officer in the CCR. The setting for the Hi Pressure Alarm System varies according to whether loading, pigging or line blowing operation is underway. Venting system of theBum Chin 66 Each cargo tank of theBum Chincould be vented through the following means: (a) the pressure vacuum valve (“P/V valve”) system; (b) the gas free vent; (c) the tank access hatch and ullage port; and (d) the Butterworth tank cleaning hatch (“Butterworth hatch”). These various components serve to allow pressure to escape from the respective tanks during cargo operations. 67 As regards the P/V valve system, the P/V valve has a pressure side and a vacuum side, and is connected directly to the tank access hatch via a 100mm line. There is an operational pressure for the P/V valve to be activated. On the pressure side, 20 kPA. On the vacuum side, -3.5 kPA. When the pressure within the tank reaches 20 kPA, the P/V valve will lift and release pressure. When the pressure falls below 17 kPA, the valve will close and the cycle will begin again. The P/V valve produces a sound when pressure is released. When the P/V valve reaches the operating pressure, the P/V valve will lift and a “sss” sound will be produced. After the pressure is released, the P/V valve sits back down and a “metal sound” is heard. 68 Open venting or closed venting can be adopted during cargo operations. The International Bulk Chemical Code (the “IBC Code”) describes an open venting system to be a system which offers no restriction except for friction losses to the free flow of cargo vapours to and from the cargo tank during normal operations. According to the Chief Officer of theBum Chin, Mr Judes Anto Kavin, Joseph Ponniah (“Mr Joseph”), there is open venting if the cover of the gas free vent is in open position. There is closed venting if only the P/V valve is used. Cargo operations 69 Cargo operations in the context of pipelines involve three phases: loading, pigging and line blowing. Both the terminal’s personnel and the crew on board the vessel would be engaged at each phase of cargo operations in respect of their own operational requirements. 70 Prior to loading, the terminal’s loading master, surveyors and the chief officer will meet to discuss and agree on specific matters pertaining to the cargo operations (such as the quantity of cargo to be loaded, the sequence of loading, loading rates and pressure). This discussion would be recorded in the Ship/Shore Safety Checklist. 71 The loading master is the person who gives instructions to the various personnel at the terminal and oversees the conduct of the cargo operations in so far as the terminal side of the operations is concerned. For instance, it is the loading master who issues instructions to the pump house to start and stop delivery of compressed air for pigging. The chief officer, in this case Mr Joseph, is in charge of the cargo operations on board theBum Chin. The cargo surveyor’s role is to sample the cargo entering the tanks including confirming the quantity loaded.  Shortly after the commencement of loading, the surveyors will take an initial sample from the manifold of theBum Chin. Loading must be stopped for sampling. Once the sample has been tested at the terminal quality assurance department office at the jetty and found to be in order, loading will resume. On completion of loading, the loading master will inform theBum Chinthat loading has been completed and the surveyors will take a final sample after completion of loading. 72 Pigging in the context of pipelines refers to the practice of using a solid device called a “pig” to clear residual cargo from the pipeline. The pig is sent down a pipeline (also known as the product line) and propelled by compressed air to clear the pipeline of residual cargo remaining in the pipeline after loading. Towards the end of the pigging process, the loading master will remain on standby at the pig receiver. This is because the loading master has to control the valves at the jetty and to issue instructions to the pump house.13Foot Note 13×AEIC of Suprianto, para 25.Pigging is completed when the pig arrives at the pig receiver, at which point the pump house will stop the air supply. Upon completion of pigging, the loading master will inform the vessel that the pigging operation has completed. 73 Line blowing is also a process by which the product lines are cleared of residual cargo. Line blowing involves throttling the main jetty valve to allow small amounts of compressed air to clear the residual cargo down the pipeline, through the flexible hose, into theBum Chin’s tank. The main jetty valve will be opened slightly for about 30 to 35 seconds using three turns of the valve wheel, and closed for about 10 to 15 seconds. This is done three times. The compressed air used for line blowing is the air leftover from pigging and the pump house will not supply fresh air. After line blowing is completed, the surveyors will once again draw cargo samples and take the ullage to ascertain the complete quantity of cargo loaded. 74 On the side of theBum Chin,the manifold valve has to be adjusted at every stage of cargo operations. During loading, the manifold valve is opened to 100%. During pigging, the manifold valve is opened to 50%. During line blowing, the manifold valve is opened to a maximum of 10% and the manifold valve is throttled to control the air entering the tank (see [144] below).14Foot Note 14×Transcript 31 January 2018, pp 34–35.",
        "Witnesses": "75 The plaintiff called several witnesses. The terminal’s personnel included the loading master, Suprianto, and the assistant loading master, Mariston Sitinjak (“Mariston”). While Suprianto (“Duty Loading Master”) was the loading master who oversaw cargo operations, Joyo Suharno (“Joyo”) was the loading master on duty at the time theBum Chinberthed at the terminal. In charge of the KB pump house (where the pig senders are located) was one Suganda Muhammad Amri (“Suganda”). Other terminal personnel who testified at the trial were Syahrul and Edy Yusri. The three cargo surveyors who testified at the trial were Eddy Gunawan, Zulchaidir and Awaluddin. Witnesses from the plaintiff’s company were Ms Chen, Mr Foo and Mr Lim. 76 On the side of theBum Chin, Mr Joseph and the Third Officer were monitoring the cargo operations in the CCR at various points in time. At the manifold was the manifold watchman, able-bodied seaman Manendra Pandey (“Manifold Watchman”). The Third Officer and the Manifold Watchman were not called to testify at the trial. Only Mr Joseph testified at the trial on behalf of the defendant as to the events on board theBum Chin. The defendant also called Mr Yasuhiro and Debdeepto Chattopadhyay, the superintendent of theBum Chin. Nichola Philip Treen who investigated the casualty on behalf of the defendant testified as witness of fact. 77 The experts for the plaintiff are Captain Nigel John Snowden (“Captain Snowden”), Dr Jonathan Sykes (“Dr Sykes”) and Dr Chee Chin Yi (“Dr Chee”). The defendant’s experts are: (a) Mr Michael Gene Sachs (“Mr Sachs”), a technical consultant specialising in oil storage issues; (b) Mr Keir Stuart Alexander Gravil (“Mr Gravil”), a naval architect; (c) Dr Ong Lin Seng (“Dr Ong”), an associate professor at the Nanyang Technological University (“NTU”), School of Mechanical & Aerospace Engineering; and (d) Dr Chua Leok Poh (“Dr Chua”) of the NTU, School of Mechanical & Aerospace Engineering. The other defendant experts are Ms Lim Huei Ling Jennifer (“Ms Lim”), Mr Lim Kie Yong and Captain Sanjay Varma (“Captain Sanjay”). 78 The parties’ positions on the cause of the incident underwent some refinement as the proceedings unfolded. While the experts advanced several alternative theories on the cause of the incident, some of the theories advanced in the reports fell away and were no longer seriously pursued as the evidence developed. It is therefore unnecessary to address every single allegation or theory that had been made throughout the course of the proceedings. Similarly, submissions that do not directly resolve the central issues will not be addressed. In this vein, although many witnesses testified (factual and expert witnesses) and their respective evidence considered, this judgment will address only the testimonies that are relevant to the determination of this action. Unfortunately, this judgment remains lengthy given the approach taken by both sides in the conduct of the litigation.",
        "The events on 16 and 17 April 2013": "79 On 16 April 2013, theBum Chinberthed at Kuala Tanjung, Indonesia. The first loading master on duty, Joyo, boarded theBum Chinwith two surveyors to discuss loading operation with Mr Joseph. The discussions were recorded in the Ship/Shore Safety Checklist. In this regard, the agreed primary mode of communication between the terminal and theBum Chinwas verbal: those at the jetty would call out to the ship’s crew at the manifold to maintain communication andvice versa.15Foot Note 15×Transcript 18 January 2018, p 7.Internal communication between the terminal personnel was through walkie-talkies in respect of personnel stationed at a distance from the jetty. Similarly, theBum Chin’s crew used walkie-talkies to maintain communication between the crew at the manifold and the CCR. 80 Loading commenced on 17 April 2013, at or about 0036 hours. By then, Joyo had ended his shift and the Duty Loading Master had taken over. Loading carried on smoothly in the various tanks. It was after the loading of tank 4S had completed that the incident occurred. When the incident precisely occurred is a matter of debate between the parties: did the incident occur during pigging or line blowing of pipelines for the cargo loaded in tank 4S. According to the plaintiff, it was during line blowing that a loud “bang” was heard and the deck in way of the centre line of theBum Chinat no. 4 wing tanks was found to be deformed.16Foot Note 16×PCS, para 9.The defendant, in its reply submissions, took the position that the incident occurred during pigging and not line blowing.17Foot Note 17×Defendant’s reply submissions, paras 134–139 81 The time at which loading completed and pigging commenced, and when pigging completed and line blowing commenced, is also a matter of some dispute. Further, the parties were in disagreement as to whether the terminal had communicated the commencement and completion of each stage of the cargo operations to theBum Chin, and sought and obtained permission to commence the next stage of cargo operations. Suffice to say for now that the plaintiff’s position is that permission was sought and obtained, and that ultimately, the surveyor’s assistance in seeking and obtaining permission from theBum Chinto commence line blowing is consistent with what was agreed in the Ship/Shore Safety Checklist. The surveyor’s assistance was required as the terminal’s personnel could not communicate in English with theBum Chin’sofficers and crew. 82 A related dispute was whether Mr Joseph was indeed present in the CCR at the time of the incident. According to Mr Joseph, around the time when he was informed by the able-bodied seaman stationed at the manifold that “pigging operations had been completed and the [t]erminal was about to start line-blowing operations”, he observed a sudden surge in the pressure of tank 4S (reaching 0.993 bar) in the CCR and the high pressure alarm was activated.18Foot Note 18×1st AEIC of CO, paras 20–21.This increase in pressure was described to have been “instantaneous”, happening in mere “seconds”. What Mr Joseph observed was later advanced in defence as the “sudden surge theory” to pin fault exclusively on the terminal. The lead surveyor, Eddy Gunawan (“Lead Surveyor”), on the other hand, testified that Mr Joseph was not in the CCR when permission to commence line blowing was sought. Instead, only the Third Officer was on duty and present in the CCR and that permission to commence line blowing was sought and obtained from the Third Officer.19Foot Note 19×AEIC of Eddy Gunawan, para 52.",
        "Aftermath of the Incident": "83 As a result of the incident, the following damage to theBum Chinwas observed:20Foot Note 20×Defence and counterclaim (amendment no 3), para 11(d); P’s Closing Submissions, pp 60–61. (a) cracks on the upper deck plate; (b) buckling of the centre longitudinal bulkhead of tank 4S; and (c) fracture and lifting of the 4S tank top. 84 TheBum Chinstopped cargo operations after the incident. According to the plaintiff, the following quantities of palm oil products had been loaded at the point in time: (a) 1,200.055mt of ROL IV 64; (b) 2,327.944mt of ROL; and (c) 1,146.451mt of RPO. 85 TheBum Chindid not perform the voyage. Palm oil products loaded on board theBum Chinhad to be discharged and loaded onto the substitute vessel. Cargo of ROL IV 64 also leaked from tank 4S to the water ballast tank andvice versa(ie,ingress of seawater into tank 4S) as a result of the incident.21Foot Note 21×Transcript 1 February 2018 at p 73There was also loss of cargo during discharge. Against this backdrop, the plaintiff’s claims relate either to the loss of and damage to the various parcels of palm oil products, and loss of use of theBum Chin.22Foot Note 22×PCS, para 496.",
        "Plaintiff’s case on liability": "86 To the plaintiff, the incident occurred during line blowing and it was the defendant’s fault that the incident occurred. The terminal had obtained permission before commencing each stage of cargo operations and had delivered the correct pressure to theBum Chin’smanifold. Against this backdrop, the plaintiff submitted that:23Foot Note 23×PCS, para 169; see generally Plaintiff’s executive summary. (a) There were pre-existing weld defects and fatigue cracks in the tank top of tank 4S which adversely affected the strength of the structure such that the buckling of the bulkhead and the fracture of the tank top happened at a lower pressure than it otherwise would. (b) TheBum Chinhad adopted closed venting and the P/V valve of tank 4S was not in good working order at the time of the incident. Hence, there was insufficient venting leading to an over-pressurisation of tank 4S. (c) TheBum Chinfailed to control the air pressure entering theBum Chinby failing to throttle the manifold valve during line blowing. Hence, “excess” air entered tank 4S during line blowing, leading to continued increase in pressure (over-pressurisation) within tank 4S that contributed to the incident. (d) TheBum Chinfailed to set the pressure alarm to 70% of the P/V valve setting for line blowing. 87 In support of its position, the plaintiff called its expert witness, Captain Snowden of Petrotech Marine Consultants (Pte) Ltd to opine on the cause of the incident. He opined that the nature of damage to tank 4S was indicative of structural weaknesses in the tank rather than a classic over-pressurisation incident. Further and in the alternative, tank 4S had not been venting through its P/V valve during line blowing, and this prevented air pressure entering tank 4S from being fully vented. Rejecting the sudden surge of air pressure observed by Mr Joseph, Captain Snowden opined that even assuming that the P/V valve was working, the Butterworth hatch was unsecured, the cover of the gas free vent was in open position, and the main jetty valve was opened at 100% with maximum air supplied by the pump house at 7 bar, it would have taken a total of 22 seconds for the air pressure within tank 4S to have risen to 0.993 bar. There was therefore no “instantaneous” rise in pressure. It was also suggested that theBum Chincould have taken emergency procedures in the 22 seconds of grace. 88 Dr Sykes testified as the plaintiff’s metallurgy expert. Dr Sykes opined that there were pre-existing fatigue cracks and substantial weld defects which reduced the strength of the welds, all of which adversely affected the structural strength of tank 4S. 89 On the allegation that theBum Chinfailed to control the air pressure entering tank 4S by failing to throttle the manifold valve during pigging and line blowing, the allegation is directed at the Manifold Watchman. Mr Gurbani for the plaintiff, invites the court to draw adverse inferences from the Manifold Watchman’s absence at the trial and relies on s 116 illustration (g) of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”). 90 Mr Gurbani further points out that according to Mr Joseph, the manifold valve was in open position during pigging and line blowing. The natural inference is that the manifold valve was not properly throttled and “excess” air was allowed into tank 4S during line blowing. Consequently, it was over-pressurisation from insufficient venting or failure to control the ship’s manifold valve that caused the incident if it was not the structural weaknesses. It follows, on the plaintiff’s argument, that the plaintiff has proved that the failure of tank 4S was due to: (a) over-pressurisation arising from the P/V valve not working or failure to control the ship’s manifold valve; (b) failure of tank 4S from structural weaknesses; or (c) a combination of reasons, such as structural weaknesses and insufficient venting, or structural weakness and failure to control ship’s manifold. 91 Finally, on the defendant’s failure to set the pressure alarm to 70% of the P/V valve setting, the plaintiff’s argues that the failure contravened theBum Chin’smanual.",
        "Defendant’s case on liability": "92 The defendant on its part seeks to either deny the factual allegations of the plaintiff or suggest that the causal factors for the failure of tank 4S as identified by the plaintiff are irrelevant. The defence in brief is as follows. There are pre-existing defects in tank 4S but the effect of the defects on structural weaknesses of tank 4S is inconclusive. The experts could not definitively conclude on the extent of weaknesses. In any event, structural weaknesses in tank 4S is irrelevant because on the defendant’s view and understanding of over-pressurisation, it is a sudden surge of air pressure from the tank top that is the primary cause of the incident. The venting capacity of the vessel is also rendered irrelevant because the sudden surge of air pressure resulted in an almost immediate buckling of the bulkhead (about 3.04 seconds). The effects of venting would therefore not have manifested at the material time. That said, regardless of whether venting is a relevant factor, the vessel had been open venting at all material times. 93 Specifically as regards structural weaknesses, the defendant further argues that even if the evidence is inconclusive on the issue of whether the structural weaknesses were a primary or secondary cause of the failure of the bulkhead –ie, whether the deflection at the bulkhead occurred before the tank top fractured and lifted (the defendant’s case) or that the tank top must first fracture and lift in order to produce the vertical displacement of the bulkhead (the plaintiff’s case) – the upshot of an inclusive finding on the issue is that the plaintiff has not discharged its burden of proof. Suffice to say for now that the defendant’s conclusion is not correct for the sequence of occurrence is not determinative of causation. What is pertinent is the occurrence of tank top fracture and lifting without which cargo in tank 4S would not suffered loss and damage. 94 On venting, the defendant denies the plaintiff’s factual allegations that the venting on board was closed and the P/V valve of tank 4S was not working. The defendant’s case is that open venting was used on board and the P/V valve of tank 4S was working. Primarily, the defendant seeks to shift the blame for the incident to the terminal. The allegation advanced is that the genesis of the sudden surge of air pressure that entered tank 4S was the terminal through the negligence of its personnel or the poor use of the terminal facilities. The two explanations given for the sudden surge of air pressure are canvassed at [100] to [102] below. 95 To elaborate on the defendant’s position on the over-pressurisation of tank 4S, the defendant’s case is that as the high velocity air penetrated through the liquid cargo, the force exerted against the liquid cargo would be transmitted instantaneously to the boundaries of the tank and thus resulting in the buckling of the bulkhead. As the buckling was instantaneous, the structural integrity and venting capacity of the tank are irrelevant to the cause of the buckling. In the closing submissions, the defendant clarified that the incident occurred at the end of pigging, before the commencement of line blowing. The defendant treats this interim period as still under the pigging phase (see [111] below). 96 In support of this position, the defendant primarily relies on the expert testimonies of Mr Sachs, Mr Gravil, Dr Ong and Dr Chua. 97 Dr Ong was asked to provide an opinion on whether the buckling was due to over-pressurisation or structural weaknesses of the tank. He was also asked to calculate the pressure required to buckle the bulkhead, which he concluded to be 1.2 bar. He arrived at this figure by modelling the bulkhead that was buckled and conducting a Finite Element Analysis (“FEA”) on the model. He further concluded that the primary cause of the buckling was due to over-pressurisation. The pre-existing structural defects at best brought about a “secondary failure”.24Foot Note 24×DBAEIC Vol 2, p 367.Dr Ong further clarified that he was only concerned with the net pressure required to buckle the bulkhead. Hence, the inflow and outflow of air from the tank were irrelevant to him.25Foot Note 25×Transcript 9 February 2018, p 104. 98 Dr Chua was asked to investigate whether the buckling would have occurred even if tank 4S had been ventilated. Relying on Dr Ong’s report, Dr Chua calculated the time in which the buckling would have occurred and concluded that it took about 3.04 seconds.26Foot Note 26×Transcript 9 February 2019, pp 70–73.He thus stated that the buckling process could be treated as immediate. Given the dynamics of air penetrating through the liquid cargo at a high velocity, buckling due to over-pressurisation would have occurred even though the tank was ventilated.27Foot Note 27×DBAEIC Vol 2, pp 1017–1018; Transcript 9 February 2019, pp 46–47.In its closing submissions, the defendant sought to use Dr Chua’s evidence to counter Captain Snowden’s 22 seconds theory (see above at [87]) and to make the point that the buckling was due to a sudden surge of air into tank 4S. 99 More to the point, Mr Gravil mentioned that it was “possible” that during the incident, the P/V valve maximum flow rate value was exceeded. This would mean that the P/V valve would not have been able to prevent a build-up of pressure as the flow rate of the air entering the tank was higher than the P/V valve’s capacity. In its reply submissions, the defendant explained that based on Mr Gravil and Dr Chua’s evidence, the P/V valve was not designed for a sudden surge of high velocity air.28Foot Note 28×Defendant’s reply submissions, para 23. 100 As to how the sudden surge of air was able to enter tank 4S, two explanations have been advanced. 101 According to Mr Joseph, the terminal failed to inform theBum Chinthat pigging had completed and failed to obtain permission before commencing line blowing. TheBum Chinwas therefore unprepared for incoming air pressure delivered from the jetty. This was also the position adopted by the Master of theBum Chinin the Letter of Protest dated 17 April 2013 written to the “Terminal Operators” and the plaintiff.29Foot Note 29×PBOD, p 293.It was also pleaded that the terminal had failed to give sufficient notice of the completion and commencement of pigging and line blowing and that the terminal failed to carry out separate operations for pigging and line blowing. 102 According to Mr Sachs, the over-pressurisation was likely to be due to an air breakthrough at the end of pigging. Based on the terminal’s own procedure, at the end of pigging, the two valves at the pig receiver that sit along return lines that eventually lead to theBum Chin’smanifold would be left momentarily open. There is therefore an inherent risk of air breaking past the pig receiver down the lines into tank 4S. This all depends on “how long the operators delay after [the pig reaches the end of the receiver] before closing the valves to the ship”.30Foot Note 30×DBAEIC Vol 2, p 472.Having considered the Duty Loading Master’s AEIC, Mr Sachs concluded that “[a]ir breakthrough must have occurred and it does not make any significant difference if this was at the end of pigging or during blowing as an extension of pigging”, and that the over-pressurisation was “due to the actions, omissions or delays by the [t]erminal operators”.31Foot Note 31×DBAEIC Vol 2, pp 473–474. 103 Finally, the defendant does not dispute that the pressure alarm was not set at 70% of the P/V valve setting for pigging and line blowing. Its defence is that even if the pressure alarm was set, the incident would still have occurred because of the instantaneous rise in pressure in tank 4S. Putting aside the defendant’s instantaneous rise in pressure argument, the plaintiff has alluded to a breach of the ship’s procedures in [91] above, but the plaintiff does not go on to explain what would have happened if the pressure alarm was set. The necessary causal link between the breach and damage is not explained. In the circumstances, I do not propose to dwell on this complaint and I say no more.",
        "Burden of proof": "104 It is for the plaintiff to establish that the defendant was negligent in the care of the ROL IV 64 cargo on board theBum Chinand in executing its end of cargo operations, amongst other things. This means that the plaintiff has to show a breach of duty to take reasonable care of the ROL IV 64 cargo loaded and stowed in tank 4S, and that the breach caused the plaintiff to suffer loss and damage, amongst other things. The general test of causation applies here. The cause or causes must be sufficiently connected or related to the loss in question as to be legally causative (in other words the effective cause). The plaintiff has attributed the cause of the failure of tank 4S to the matters set out above at [90]. On the other hand, the defendant puts forward the positive cause of the failure of tank 4S to be a sudden surge of high velocity air pressure in tank 4S. Even if the defendant’s assertion of a sudden surge of air pressure is not made out, the plaintiff has not discharged its burden. The plaintiff only succeeds if it is able to establish that the cause of the failure to tank 4S was as it had contended. This is because the legal burden remains with the plaintiff and does not shift to the defendant. 105 The plaintiff’s claim for damages will be dealt with later. Suffice to say for now that the burden of proof is on the plaintiff to make out its claim for damages.",
        "Key factual findings": "106 It is not surprising that there is heavy reliance on the opinions of experts at the trial and in submissions. However, the theories and opinions advanced as to how the incident happened must ultimately be based on the facts, not postulations and beliefs: seeKhoo Bee Keng v Ang Chun Hong & another[2005] SGHC 128 at [68]. As such, findings on the following factual issues must first be made: (a) the time at which loading, pigging and line blowing commenced and ended, and relatedly, the phase of cargo operations during which the incident occurred; (b) the procedures and matters agreed between the terminal and theBum Chinregarding cargo operations, with reference to the Ship/Share Safety Checklist (such matters include the rate of flow of cargo, maximum pressure at the ship/shore cargo connection, agreed tank venting system being use, and agreed communications during cargo operations, including signal for emergency stop); (c) whether the chief officer, Mr Joseph, was in the CCR from 0524h until the incident happened; (d) whether the terminal sought and obtained permission to commence line blowing; and (e) whether theBum Chinadopted open or controlled venting. 107 While both the terminal and theBum Chinwere involved in cargo operations, the execution of each side’s own procedures and responsibilities was, for the most part, unknown and unseen by the other, so to speak. Hence, there is little or no countervailing facts in evidence to challenge the version of facts put forth by the other. Yet, the question looming large for trial is which versions of the facts are believable. In this regard, the strength of the parties’ assertions depends on the available documents, corroborative evidence on the same side, and the credibility and veracity of witnesses under cross-examination. Whilst expert evidence can provide a check and give assistance to the analysis of the facts to some degree, it is the primary factual evidence of the witnesses that is important.",
        "Timing and the phase of cargo operations during which the incident occurred": "108 The plaintiff takes the position that the incident occurred during line blowing. On the other hand, the position taken by the defendant in the closing submissions is that the incident occurred during pigging. As a result, it is unnecessary to go into the details of loading and to make findings in relation thereto, unless required for the purposes of resolving issues relating to pigging and line blowing. 109 The parties in submissions indicated that loading of tank 4S commenced at 0036h. The parties, however, differ on the time at which pigging and line blowing ceased and commenced. Consequently, the time of the incident also varies: to the plaintiff, the incident occurred soon after 0545h; the defendant’s factual witness say it occurred 10 minutes earlier, at 0535h. One important thing to bear in mind is that the timings as to the different phases of cargo operations are really estimates even though the parties speak of timing in precise terms. For convenience, this judgment adopts the parties’ approach. 110 According to the plaintiff, loading of tank 4S ended at 0450h. Pigging, thereafter, commenced at 0500h. Pigging ended at 0540h. Five minutes later, at 0545h, line blowing commenced. The incident occurred shortly after line blowing started. Having received instructions from the Duty Loading Master to commence line blowing, Mariston, who was operating the main jetty valve at the material time, proceeded to perform two sets of opening and closing of the main jetty valve. It was upon the commencement of the third set that a loud bang from theBum Chinwas heard. 111 According to the defendant, Mr Joseph was informed by the Manifold Watchman at 0524h that a terminal representative had notified him that loading of tank 4S had completed and pigging operations had begun. At 0535h, the Manifold Watchman told Mr Joseph that the terminal had completed pigging and was about to start line blowing (the defendant treats this interim period as still under the pigging phase). The incident occurred at 0535h. It is to be noted that Mr Joseph did not directly communicate with the terminal’s personnel. Instead, Mr Joseph depended on the Manifold Watchman to relay whatever messages the latter received from the terminal to him through a walkie-talkie. Mr Joseph also relied on the Manifold Watchman to communicate with the terminal. 112 As stated, there are differences on the timing of each phase of cargo operations in the parties’ respective narration of the events. In order to identify the phase of operations at which the incident occurred, it necessary to make findings of fact on the time at which each phase of operations took place. On balance, I prefer and hence accept the plaintiff’s evidence as to timing. Mr Joseph’s evidence on timing is not plausible for the reasons explained below. It bears reiterating that reference to times are to be understood as the witnesses’ best estimates. 113 The plaintiff’s evidence on timing was led by the Duty Loading Master, whose evidence was in turn derived from the jetty logbook and a timesheet MNA had him prepare after the incident. While there were some evidential blemishes and inaccuracies in these documents, the oral testimonies of the plaintiff’s witnesses were nonetheless credible and hence reliable. The evidential blemishes therefore do not undermine the plaintiff’s evidence as a whole. 114 The Duty Loading Master explained that he had a practice of recording information regarding cargo operations for his shift on pieces of paper. The information would be transferred into a jetty logbook that was kept at the jetty, near the pig receiver. The jetty logbook recorded that loading commenced at 0036h. The Duty Loading Master also wrote “comp l” and “h off” on the relevant page, which was clarified at the trial to mean “complete loading” and “hose off” (ie, cargo operations ended entirely) respectively. Now “comp l” bore the time entry of 0540h, and “h off” bore the time entry of 0545h. At trial, the Duty Loading Master stated that the time entries for “comp l” (ie, 0540h) and “h off” (ie, 0545h) were not written by him. The entries to “comp l” and “h off” were then left blank. Someone else must have presumably filled in the time entries subsequently. In my view, the time entries “0540h” and “0545h” for “comp l” and “h off” respectively are clearly wrong. On the plaintiff’s case, loading completed at around 0450h and not 0540h. On the defendant’s case based on Mr Joseph’s version of events, loading completed and pigging had already commenced by 0524h. Therefore, 0540h and 0545h cannot relate to the completion of loading and hose off, respectively. The entries are clearly mistakes. 115 With the clarification above, the jetty logbook reflects no entries for pigging and line blowing at all. On the other hand, the plaintiff’s timesheet reflects that: (a) loading commenced at 0036h; (b) loading completed at 0450h; (c) pigging commenced at 0500h; (d) pigging completed at 0540h; and (e) line blowing commenced at 0545h. 116 The timesheet was prepared using information recorded in the jetty logbook. As the information in the jetty logbook is limited and the timesheet included more information, the Duty Loading Master would have added and corrected the inaccurate information in the jetty logbook when preparing the timesheet for MNA. It stands to reason that these additions and corrections were based on the Duty Loading Master’s recollection and account of the events as he was directly involved in loading, pigging and line blowing. Further, he could testify to these matters at trial. 117 The Duty Loading Master’s testimony at trial puts the time for the end of pigging to be after he gave instructions to Suganda to stop the air supply for pigging. He mentioned that he gave instructions to stop air supply for pigging at 0540h because the pig had arrived at the pig receiver. The Duty Loading Master then stated that line blowing took place after 0540h, at around 0545h. Suganda corroborates the Duty Loading Master’s evidence, stating that he was informed by the Duty Loading Master that the pig had arrived at the pig receiver at 0540h and to stop the air supply. He immediately stopped the air supply as instructed. In his AEIC, Suganda confirmed that the time of 0540h was based on what he had also observed from a clock in the pump house. Mariston also stated that about five minutes after the pig arrived, the Duty Loading Master instructed him to commence line blowing, which he did.32Foot Note 32×AEIC of Mariston Sitinjak, para 38.This puts line blowing at about 0545h. 118 I now turn to the Lead Surveyor’s report which contains a time log capturing the events for the time period of 0535h to 0545h, among other things. Despite some apparent discrepancies between the Lead Surveyor’s report and the Duty Loading Master’s evidence as regards the timing and description of the activities undertaken, an analysis of the Lead Surveyor’s overall evidence supports the Duty Loading Master’s time estimates. 119 The time log in the report states that loading commenced at 0036h. Turning to the entry at 0535h, the report records the following: “Commenced Blowing & Pigging”. For the entry at 0545h, the report records: “Ceasing Blowing due to ‘loud sound/bang’ experiencing …”.33Foot Note 33×AEIC of Eddy Gunawan, Exhibit Edy 3.In his AEIC, the Lead Surveyor explained that while he recorded pigging and line blowing to have commenced at 0535h, this was written in error. As surveyors are not involved during pigging, he was unaware of the time at which pigging commenced. The entry should therefore not be read as referencing pigging, but to line blowing instead. 120 The Lead Surveyor was cross-examined on his evidence that line blowing commenced at 0535h:34Foot Note 34×Transcript 26 January 2018, p 6. Q: 0535. A: That was at the commencement of the blowing. Q: And how did he know blowing started at 5.35am? A: At the time after getting the permission from the third officer, I walked to the deck to inform the loading master and thereafter, the loading master shouted for the blowing and when I saw that there was vibration at the flexible hose, at that time I recorded the time. 121 He stated that he had thought that line blowing had commenced as there were vibrations at the flexible hose. The Lead Surveyor was also asked about what he did after he saw the flexible hose vibrate:35Foot Note 35×Transcript 25 January 2018, pp 56–57. Q: … Then the next thing is … after you told [the Duty Loading Master] to start line blowing, you say you saw the flexible hose vibrate … What happened after this? … A: I and Zulchaidir was about to proceed to 2S tank. … A: Wanting to take the first foot sample. … Q: Did they reach the 2---did they reach the tank? A: Was about to reach. Q: Okay, when what happened? A: And then there was a loud sound. It was loud, like that of a loud sound. Q: Okay. And how long after line blowing started did he hear this sound, meaning while he was walking towards cargo tank 2? A: Not long after. Q: Okay. Now, when he says “not long after”, can he give an estimate? Is it, like, within seconds, or within minutes? A: I think it’s several minutes. 122 He described a series of activities he did after seeing the flexible hose vibrate and said that he heard a loud “bang” several minutes later. On reflection, the Lead Surveyor then corrected his answer on when he heard the “bang” to approximately within one minute, after he visualised the distance between the manifold and tank 2S:36Foot Note 36×Transcript 25 January 2018, p 58. A: I think it’s around one minute. Between the distance of the manifold to the starboard tank, we can see for ourself [sic] what is the distance. 123 Even though the Lead Surveyor said during cross-examination that line blowing started at 0535h, to make sense of the rest of the Lead Surveyor’s answers, the timing of 0535h cannot be taken to definitively pinpoint the commencement of line blowing. Instead, the entries for 0535h to 0545h in his report should logically be understood as encompassing a series of activities that he undertook during that period. Taking 0535h to be the commencement of line blowing would mean that line blowing would have carried on for about 10 minutes before the incident occurred. This cannot be the case as the Lead Surveyor’s own evidence is that he had heard a loud “bang” before reaching tank 2S, and in his estimation this was about a minute into line blowing (which he had assumed was underway from his own observation of the flexible hose vibrating).37Foot Note 37×Transcript 26 January 2018, p 23.Accordingly, the Lead Surveyor’s testimony at trial coheres with the Duty Loading Master’s testimony that line blowing commenced at 0545h. 124 Based on the analysis here and above, the plaintiff’s evidence on timing is preferred in contrast to the defendant’s evidence, which is unsatisfactory and unreliable. First, Mr Joseph’s evidence is hearsay. He would not have known what the terminal’s personnel said or did not say to the Manifold Watchman. His own evidence is that he was updated by the Manifold Watchman of the ongoing operations and made no mention of the terminal personally communicating with him. Second, if pigging had commenced at 0524h and ceased at 0535h, the entire pigging operation would have lasted for about 11 minutes, which is too short a time for the pig to arrive at the pig receiver bearing in mind the length of the shore pipeline (that is about 2.5km). Normally, pigging would take about 30 to 35 minutes long (40 minutes would still be within tolerance).38Foot Note 38×Transcript 25 January 2018, p 27.Mr Joseph accepts that for pigging operation to complete within 11 minutes, the flow rate would have been “phenomenal” and that anyone monitoring pigging in the CCR would have raised an alarm. Indeed, at trial, Mr Joseph testified that there were no problems during pigging proper, which on his evidence lasted from 0524h to 0535h.39Foot Note 39×Transcript 2 February 2018, pp 24–25.I will come back to this assertion below, having regard to his contradictory evidence in his second AEIC that pressure in tank 4S was observed to have increased from 0524h to 0535h. Third, Mr Joseph’s evidence in his first AEIC on what was communicated to him by the Manifold Watchman is inconsistent with the statement of facts prepared by him and signed by the Master on 20 April 2013. In his sworn written testimony, Mr Joseph stated that at 0535h, the Manifold Watchman informed him that pigging had completed and that the terminal wasabout to start line blowing. In contrast, the statement of facts records the activities at 0535h as follows: pigging completed, the terminal commenced line blowing first and the terminal then “informed” the vessel about the line blowing. The Master in the Letter of Protest interpreted the statement of facts as indicating that the terminal hadstarted line blowing without giving proper noticeto the vessel to prepare the manifold to withstand the blow (see [125] below). In the light of the foregoing, the defendant’s assertion that pigging had commenced at 0524h and ceased at 0535h is not plausible, is unsubstantiated and hence is rejected. 125 For the reasons above, it follows that the said statement of facts has no evidential value as to the question of timing. The time entries in the statement of facts were all derived from what the Manifold Watchman had informed Mr Joseph. Even if Mr Joseph could give a description of what he saw at 0535h (for instance, cargo vapour on deck), the very timing of 0535h itself is traced back to his walkie-talkie conversation with the Manifold Watchman as opposed to his own appreciation of time. In similar vein, other documents that rely on 0524h and 0535h to describe the events that occurred are equally unreliable as to timing; for instance, the defendant’s Letter of Protest dated 17 April 2013 signed by the Master of theBum Chin:40Foot Note 40×PBOD, p 293. Dear Sirs, I Capt. Onkar Rai hereby strongly protest and put on record that while vessel was loading at Kuala Tanjung (Indonesia), Jetty A-MNA at 0524LT on 17/04/2013 after completion of Loading in 4S COT the teminal [sic] commenced pigging and at 0535 Lt on 17/04/2013 started blowing air without giving proper notice to the vessel for preparing tank / manifold to withstand line blow. In fact the terminal commenced blowing air, thereafter informed the vessel regarding this operation. The terminal blowed [sic] the shore line at a very high pressure which resulted in receiving high pressure alarm at CCR, PV valve lifted and at the same time 4S COT ruptured. During this operation [Mr Joseph] and [duty officer] who [were] monitoring the operation observed high pressure alarm of the respective tank activated and the pressure shoot up enormously high, i.e shoot up to 660 HPA first and then to 990 HPA in fraction of seconds. At this time ship’s crew also found cargo vapour mist on deck from the ruptured tank. At present we also noticed cargo ingress in to No-4 S and No-4 (p) WBT. We suspect inter tank / hold bulkhead failures. At this point of time the exact extent of damage is not known. 126 There was some debate over whether the incident occurred during pigging or line blowing. To the plaintiff, there was a break and pause between end of pigging and start of line blowing (ie, the five-minute break between 0540h and 0545h, when line blowing commenced). The incident occurred after the start of line blowing. On the part of the defendant, the incident occurred at pigging. At this juncture, I note parenthetically that there appears to be a departure from the position set out in the Master’s Letter of Protest. In its reply submissions, the defendant stated that it did not submit a case that the incident occurred during line blowing and that its pleaded case has always been so. I reproduce the material portion of the amended defence and counterclaim:41Foot Note 41×Defence and counterclaim (amendment no 3), paras 11(b)–(c). (b) … At 0524 hours local time on 17 April 2013, the Terminal reported that the loading of the Cargo into the Tank had been completed and that pigging operations had begun. … That operation was completed at 0535 hours local time, at which time line-blowing operations were reported as having simultaneously commenced. (c) Immediately thereafter, the Tank’s ‘high pressure alarm’ on the Vessel’s cargo tank monitoring panel sounded. … 127 The reproduction of the pleadings above does not actually bear out the position taken in the reply submissions. It states that pigging operations hadcompletedat which time line blowing was reported to have simultaneously commenced. It does not follow from the mere use of the word “simultaneously” that the incident did not occur at or during line blowing. In the end, the nub of the defendant’s contention is the position advanced by its expert, Mr Sach: the incident took place in the interim period at the end of pigging and before the start of line blowing. For clarity, the defendant treats this interim period as still under the pigging phase. The defendant’s reason for holding on to its position that the incident occurred during pigging loops back to Mr Sachs’ theory of air breakthrough at the end of pigging. 128 In order to determine when pigging ended, it is necessary at this stage to deal in some detail with Mr Sachs’ theory of air breakthrough because not only is his opinion that the incident occurred at the end of pigging, he also opined that line blowing followed effectively without a break. He referred to the terminal’s manual and concluded that the procedure at the end of pigging creates an inherent risk of air breakthrough. At trial, Mr Sachs clarified that the incident happened at the end of pigging before the start of line blowing.42Foot Note 42×Transcript 9 February 2018, p 69.He explained that the air breakthrough “happened while all the valves returning the driving air, compressors, air receivers, pipeline, pig receivers, jetty valves, ship’s manifold valves were all fully open”.43Foot Note 43×Transcript 9 February 2018, p 26.It is necessary to examine whether his premise as identified is satisfied on the factual evidence before this court. 129 Diagram 2: Pig receiver  130 The pig receiver is located at the jetty and is connected to theBum Chin’smanifold through a flexible hose. I now refer to the diagram above. During loading, cargo will enter from the right and pass the main jetty valve (D on the diagram above) to theBum Chin’smanifold. The block valve at B is closed. Towards the end of pigging, as the pig is reaching the pig receiver, the main jetty valve would be closed. The block valve and drain valve (C on the diagram above) would be opened to enable residual cargo to drain into the pigging return line, leaving the pig in the receiver. According to Mr Sachs’ understanding of the terminal’s manual, air driving the pig would continue to be supplied to clear the pigging return line of cargo before the air supply is shut off.44Foot Note 44×DBAEIC Vol 2, p 468, para 33(c).If this were the case, then air breaking pass the pig receiver, through the ship’s manifold and into the cargo hold is possible depending on the length of delay on the part of the terminal’s operator in closing the main jetty valve and drain valve, both of which would have been in the open position at that point in time.45Foot Note 45×DBAEIC Vol 2, p 472, para 45.He also explained that even if air supply were shut off, the line would still be full of compressed air which would continue to drive the residual cargo left in the line to theBum Chinuntil the drain valve is closed.46Foot Note 46×DBAEIC Vol 2, p 468, para 33(c).Mr Sachs thus posited that if the terminal’s manual were followed, line blowing effectively follows pigging without a break.47Foot Note 47×DBAEIC Vol 2, p 470, para 37.This opinion must reasonably describe the stretch of onshore pipelines on the terminal’s side and not line blowing through the flexible hose connecting the jetty manifold to theBum Chin’smanifold. He further suggested that the equipment used by the terminal was ill-suited for pigging operations. 131 Mr Sachs’ theory of air breakthrough is premised on the terminal’s actions, omissions or delays. However, this premise is not borne out on the facts. I find that the Duty Loading Master had closed all the necessary valves by the time the pig arrived at the pig receiver.48Foot Note 48×Transcript 23 January 2018, p 2.There are two valves that have to be closed in this regard – the main jetty valve (D on the diagram above) and the drain valve (C on the diagram above). As regards the main jetty valve, the Duty Loading Master testified that this was closed around the time the pig arrived at the pig receiver. Indeed, according to his AEIC, the main jetty valve was closed gradually in the course of pigging, and by the time the pig reached the pig receiver, the main jetty valve was closed completely. The arrival of the pig can be heard as a loud audible sound is produced.49Foot Note 49×AEIC of Suprianto, paras 23, 55.Turning to the drain valve, during cross-examination, the Duty Loading Master explained he had “immediately” closed the drain valve upon hearing the pig reach the end of the pig receiver. In reply to Mr Tay’s question regarding the purpose of closing the drain valve on the arrival of the pig, the Duty Loading Master explained that this was done to prevent air from entering theBum Chin.50Foot Note 50×Transcript 18 January 2018, pp 19–20.It is reasonable to infer that the Duty Loading Master knew that the drain valve had to be closed in a timely fashion to prevent an air breakthrough (assuming that it is an inherent risk) and that he had done so on the day of the incident. He had also instructed Suganda to shut off the air supply from the pump house.51Foot Note 51×Transcript 23 January 2018, p 2.Suganda confirmed that the Duty Loading Master had informed him of the arrival of the pig and that he received instructions to shut off the air supply over walkie-talkie.52Foot Note 52×AEIC of Suganda, para 19; Transcript 24 January 2018, p 73.I accept the Duty Loading Master’s evidence. His evidence is consistent throughout cross-examination and is corroborated by Suganda, whose evidence in turn was not demolished by cross-examination. 132 At trial, Mr Sachs agreed that the arrival of the pig at the receiver would be audible. However, he added that the operator might have been mistaken as to which pig receiver received the pig and closed the wrong valve. This is because there were more than one product line in use on the day of the incident.53Foot Note 53×Transcript 9 February 2018, p 28.This suggestion of a mistake is speculative. The simple point is this – while various lines were used to load the various cargo, the only line that had reached the stage of pigging at the material time was the one supplying ROL IV 64 to tank 4S. All other lines were either still pumping cargo or were unused. 133 As regards Mr Sachs’ theory, I make two broad comments. First, Mr Sach’s criticism of the terminal’s procedure is questionable. In describing the air breakthrough as an inherent risk, he is effectively taking a definitive position in that at the end of pigging, air breakthrough is almost certain. Yet, the terminal had loaded a number of vessels in the past without incident (282 vessels between 2011 and 2013) and the particular incident with theBum Chinwas the only one of its kind experienced by the terminal.54Foot Note 54×Snowden 1st report, pp 170 & 182.Second, and more importantly, Mr Sachs’ air breakthrough theory assumes that the ship’s manifold valve is fully open. Mr Joseph’s evidence is that the manifold valve ultimately controls the pressure entering the tanks.55Foot Note 55×Transcript 1 February 2018, p 76.From this perspective, Mr Sachs’ theory is not balanced and fair without explaining the significance of theBum Chin’smanifold valve in stopping or controlling the air pressure. There are two possibilities as to the status of the manifold valve. If theBum Chinhad complied with its own procedures, the manifold valve would have been 50% open at the time of pigging.56Foot Note 56×Transcript 31 January 2018, p 34.On the other hand, the manifold valve could have been left fully opened since loading. Indeed, Mr Joseph’s complaint against the terminal is that there was no opportunity to give the Manifold Watchman instruction to close and adjust the manifold valve before pigging, and thus the manifold valve was left fully opened. At the same time, Mr Joseph accepted that he could have stopped pigging (see [147] below) and if he had stopped pigging, the rhetorical question is whether there would be air breakthrough to begin with. On any scenario, the state of theBum Chin’smanifold valve would have had an impact on the inflow of air into tank 4S at the end of pigging. Mr Sachs did not specifically address theBum Chin’smanifold valve (ie, that controlling the manifold valve could control air pressure and reduce the risk of excessive air pressure entering tank 4S) and it is unclear if Mr Sachs even took any of the scenarios into consideration.I am therefore unpersuaded that the incident would have occurred at pigging. 134 On balance, I find that the incident occurred during line blowing, after 0545h. There was at least a five-minute break between the end of pigging and start of line blowing. To sum up, loading commenced at 0036h, as accepted by the parties. The factual finding here is that loading ceased at 0450h, pigging commenced at 0500h, pigging ceased at 0540h and line blowing commenced at 0545h. It bears repeating that these timings are estimates.",
        "Ship/Shore Safety Checklist and other procedures": "135 It is not controversial that the Shipboard Management Manual (“Ship’s Manual”) contains theBum Chin’sprocedures for pigging and line blowing at terminals. Even though Mr Joseph joined theBum Chinas chief officer on 21 March 2013 (with the incident on 17 April 2013), he appears to have been apprised of the risks and hazards cautioned in the Ship’s Manual. This is to be gathered from his first AEIC where he deposed that he had asked the loading master for a smaller diameter hose but none was available. Although the context of his affidavit evidence on this point is not stated, if the issue of smaller size hose were raised with the terminal, it could only have been raised with reference to section 3.1.9.4 of the Ship’s Manual on the by-pass of the ship’s manifold valve:57Foot Note 57×DBOD Vol I, p 599. Pigging or blowing of shore lines to ships as a general rule should not be allowed. If the terminal insists,all risks involved including extremely rapid pressure increase in small ullage spaces, availability of free space in vessels tanks and whenthe pig reach the catcher ashore shall be considered. The capacity of the P/V pressure relief valve is designed to handle inflow of liquids through the cargo lines and not gas as air …Risk reducing measures like controlling flow by by-passing manifold valves with smaller size hoses must be in place. …It is important that experienced personnel open and close (throttle) manifold valves in a controlled manner. Due caution to be allowed towards the possibility of trapped gas bubbles releasing and expanding in the tank and hence the operation must be directly controlled by a Responsible Officer & Pigging Operation verified by Chief Officer prior to start. [emphasis added] 136 It is against this factual matrix –ie,the non-usage of smaller diameter by-pass line to restrict/reduce pressure for pigging or line blowing – that the Ship’s Manual then highlights the importance of putting in place “experienced personnel to open and close (throttle) manifold valves in a controlled manner”. Significantly, the Ship’s Manual states that pigging and line blowing isgenerally not allowedbecause of the known risks such operations presented. Thus, the Ship’s Manual specifies certain procedures that must be adopted and these include:58Foot Note 58×DBOD Vol I, p 601. 1) It is to be ensured during pre-loading safety meeting that following information is provided by the terminal:- a) Retention volume/quantity of shore lines which are to be displaced to the vessel during pigging; b) Maximum expected pressure during the pigging/blowing operation must be clearly discussed including provisions of restricting/reduce pressure. This includes the fitting and usage of smaller diameter by-pass line (for pigging operation by-pass line/hose ofnot exceeding 1” diameter. c) Specific reference is made on emergency signal and emergency shutdown procedure where the pigging/blowing is to be immediately suspended; 2) The deck officer shallCONTINUOUSLYmonitor/control tank pressure, adjust tank pressure and maintain communication with watchman at the manifold valve; 3) Pigging/blowing is to be immediately stopped and manifold and tank valves shut down immediately when tank pressure exceeds 70% of the PV valve setting; 4) Pressure alarm for tank into which pigging/blowing takes place is to be set at 70% of the PV valve pressure setting; 5) Manifold and tank valve are to be attended to at all times during the pigging/blowing operations; … [emphasis in the original] 137 Besides the Ship’s Manual, a 40-minute long pre-loading safety meeting was held where the Ship/Shore Safety Checklist was discussed and signed. The checklist concerns the safety of the ship, the terminal and all personnel. Its importance must not be overlooked. On the face of the Ship/Shore Safety Checklist, agreed items were ticked and the checklist was jointly signed by Mr Joseph and Joyo. 138 As it transpired, while the Ship/Shore Safety Checklist was signed during the meeting, certain additional information was added afterwards. Mr Joseph was questioned on these additions. He admitted to inserting information in the column “Tanks checked & ready for loading” after Joyo signed the checklist. However, he denied inserting the following handwritten note after the Ship/Shore Safety Checklist was signed:59Foot Note 59×Transcript 31 January, pp 87–88. After completion of ROL IV 64, pigging and line blowing will be carried out at a slow rate and hose to be transferred to tank cargo for RPS. 139 Mr Joseph clarified in cross-examination that “slow rate” in the handwritten note referred to pigging (ie, the slow rate of residual cargo) and not line blowing, and that the rate corresponded to the topping off rate (100 m3/h).60Foot Note 60×Transcript 31 January 2018, pp 30 & 33. 140 The other checklist of items in the Ship/Shore Safety Checklist that were considered and agreed upon include: (a)  the initial and maximum loading rates;(b)  the topping off rate (100 m3/h);(c)  the maximum pressure that the manifold could receive (7 bar);(d) the mode of communication between the ship and the shore (primarily, “verbal” and as a backup, to use the “surveyor onboard”);(e) the emergency signal and shutdown procedure to be used by the ship and shore (shout out “stop 3 times”);(f) the allowance for reaction time in response to signals. For example, the maximum time required for reducing or increasing rate is 5 minutes and the time required for stopping any operation is 2 minutes;(g) the venting system used by the ship (“PV/purge pipe”); and(h) the requirements for closed operations. 141 The procedures and matters outlined in the Ship’s Manual and Ship/Shore Safety Checklist above all go towards highlighting the risks of pigging and line blowing, and prescribe or indicate procedures designed to mitigate such risks. It is therefore important to determine if the terminal and the vessel had executed their respective roles in a manner consistent with the proper procedures and matters. 142 It is obvious from the checklist that whilst there is reference made to the maximum acceptable manifold pressure (7 bar), there is nothing on the expected pigging and line blowing pressures. According to the Ship’s Manual, the expected pigging and line blowing pressures have to be ascertained by theBum Chin. And in my view, if so ascertained, such information must find its way into the Ship/Shore Safety Checklist. Taking the defendant’s case at its highest, pigging was to be carried out at a slow rate (ie, the topping-off rate). The question then is whether any other provisions were made for restricting or reducing pressure, in particular for line blowing. In this vein, the testimony of the “experienced personnel” controlling the manifold valve at the relevant times is key and his absence at the trial leaves a critical gap in the evidence. 143 Pausing here, I should mention that after the trial, Mr Tay wrote to court on 10 April 2018 purporting to update the court on the ongoing arbitration proceedings and conveniently included in the update statements made by the Manifold Watchman and Third Officer. An attempt to bring the statements to the court’s attention in such a manner is highly improper and impermissible. The statements are plainly inadmissible and are disregarded. 144 Apart from the Ship’s Manual and the Ship/Shore Safety Checklist, Mr Joseph at the trial elaborated on the correct procedure before the start of each phase of cargo operations: these include, the adjusting of the manifold valve and the setting of the pressure alarm. Upon the completion of loading, the pressure alarm must be set at 70% of the P/V valve’s pressure setting. The manifold valve will be closed completely before being slowly adjusted to about 50% of its maximum. This is to adjust the rate of flow so that the pressure in the tank does not exceed 70% of the P/V valve’s pressure setting.61Foot Note 61×Transcript 31 January 2018, pp 34–35.Similarly, once pigging ends, the manifold valve is again closed completely and then slowly opened to 5–10% of the maximum for line blowing. The alarm remains set at 70% of the P/V valve’s pressure setting.62Foot Note 62×Transcript 1 February 2018, p 15. 145 The adjustment of the manifold valve is important as it controls the rate of flow of residual cargo during pigging and the pressure of compressed air entering the ship during line blowing. This is especially crucial in the present case as there wasno agreementin the checklist between theBum Chinand the terminal on the maximum expected pressure for line blowing, to say the least, or any provisions made for restricting or reducing pressure for line blowing. Indeed, the Ship’s Manual mandates that the controlling of the manifold valve be done by an experienced crew member. This reflects the importance of the manifold valve; it controls the amount of air pressure entering the tank and is the first “line of defence” for the ship.63Foot Note 63×Transcript 31 January 2018, pp 73–74.Mr Joseph had in fact accepted that the incident would not have happened if the manifold valve had been controlled correctly:64Foot Note 64×Transcript 1 February 2018, p 33. Q: So if that pressure that was coming into the ship was correctly controlled, right, and it is controlled at the manifold, is it not? A: Yes. Q: This incident would not have happened. A: Yes. 146 Mr Joseph appears to accept that there was a lapse in procedure in the present case. His complaint, however, is that theBum Chinwas unable to execute the procedures outlined at [144] above as the terminal had not given prior warning of the change in phase of the operations (whether it be pigging or line blowing). Accordingly, there was no opportunity to give the Manifold Watchman any instructions to close and adjust the manifold valve. The manifold valve was left fully open since the completion of loading.65Foot Note 65×Transcript 1 February 2018, p 74.In his first AEIC, he described the failings of the terminal and the steps he had taken to mitigate these failings in the following terms:66Foot Note 66×1st AEIC of CO, para 18. At 0524 hours local time, the manifold watchman Able Seaman Mr Manendra Pandey who was a member of our crew informed me by radio that he had been told by the [t]erminal representative that loading into [t]ank 4S was completed and pigging operations had begun. This was unusual as normally the [t]erminal would ask us to shut the manifold valve when loading was completed and then ask us to open the manifold valve before they start pigging. They did not do so. If they had done so I would have asked the [t]erminal to reduce the loading rate to the top off rate of 100 m3/hour so that by the time 95% of the cargo was loaded, loading would be at the reduced rate. However since pigging had already started, I could not do so. Since the [t]erminal said they already started pigging, as safety precaution we could not shut the manifold. I told Mr Pandey to tell the [t]erminal representative to do pigging at a slow rate and he confirmed that he had done so. After that I asked Mr Pandey to check the pressure gauge at the manifold. He checked and told me that the pressure was normal. I checked the tank pressure and it was somewhere between 10-20 HPA. 147 Mr Joseph was cross-examined on these paragraphs. He added that while theBum Chincould not adjust the manifold valve while pigging was underway, it always open him to instruct the terminal to stop pigging in order to close the manifold valve for subsequent adjustment and to set the pressure alarm.67Foot Note 67×Transcript 1 February 2018 at p 57. 148 I make three points. 149 First, assuming that the terminal had indeed proceeded to pig the product lines before subsequently notifying theBumChin, Mr Joseph had the option of stopping the operations to correct any lapse. All theBum Chinneeded to do, as agreed in the Ship/Shore Safety Checklist, was to shout out “Stop” three times to stop pigging. A two-minute reaction time is agreed in the Ship/Shore Safety Checklist to respond to theBum Chin’ssignal. For the sake of argument, on the defendant’s case that pigging took 11 minutes, if Mr Joseph had stopped pigging at the time he instructed the Manifold Watchman to inform the terminal to slow the rate of flow, the terminal would have had ample time to respond to the stop instruction. The point to note here is that Mr Joseph did accept that he could have stopped pigging, and instructing the terminal to stop pigging is the only way to effectively shut out the pressure coming into the ship. Hence, instructing the terminal representative to slow the rate of flow of residual cargo during pigging would not only be an inadequate step, but also wrong. On the defendant’s case that the incident occurred during pigging (ie, the interim period), Mr Joseph’s failure to stop pigging would significantly undermine the defendant’s defence and its position on liability. 150 Second, Mr Joseph’s AEIC evidence on the status of the manifold is inconsistent. In the earlier portion of the quoted part of his first AEIC (see [146] above), Mr Joseph stated that theBum Chincould not shut and adjust the manifold for pigging as the terminal had taken him by surprise. He further claimed at trial that the manifold valve was left fully open since loading as he had no opportunity to instruct the Manifold Watchman to close and adjust the manifold valve. But in the later part of the quoted portion of his first AEIC, Mr Joseph stated that he had asked the Manifold Watchman to check the pressure at the manifold and the Manifold Watchman then told him that the pressure was normal. On this note, the defendant makes the point in its closing submissions that the needle of the pressure gauge at the manifold would show nothing if the manifold valve were fully opened: “[t]he manifold pressure gauge or meter only shows pressure when closed”.68Foot Note 68×DCS, para 277.There is a patent inconsistency in the evidence. It is more probable than not that the manifold valve was first closed for the Manifold Watchman to take a reading of the pressure and then adjusted to 50% open for pigging. This is because as Mr Joseph repeatedly reiterated at trial, pigging carried on without incident. I therefore find that the manifold valve was opened to a maximum of 50% during pigging. 151 Third, it is unlikely that Mr Joseph had informed the terminal to pig at a slow rate. If Mr Joseph’s testimony that he gave instruction for pigging proceed at a “slow rate” is to be believed, the instruction could not have been givenafterpigging started. On the overall evidence, there was no problem during pigging proper. The instruction for pigging proceed at a “slow rate” must have been givenbeforepigging started. On the related question whether it was Mr Joseph who gave those instructions, it was more probable than not that it was the Third Officer gave the instruction. I will address the presence of Mr Joseph in the CCR below. 152 In view of the matters discussed above, it appears that there were lapses in procedure on board theBum Chin. A key question to be answered is whether the air pressure at manifold valve was properly controlled at the time of the incident. The evidence, however, is left wanting in the absence of the Manifold Watchman.",
        "Presence of Mr Joseph in the CCR": "153 Much has been argued on whether Mr Joseph was present in the CCR at the material time. The plaintiff submits that Mr Joseph was not in fact in the CCR from 0500h onwards. In making this argument, the plaintiff relies on the chief officer’s night orders and theBum Chin’swatch arrangement. The plaintiff contends that Mr Joseph’s own night orders suggest that he did not think he would be woken up before 0630h. According to the watch arrangement, Mr Joseph had no reason to be in the CCR at the time of the incident because the Third Officer was the person in charge of the watch (from 0400h to 0800h). Against this backdrop, the plaintiff urges this court to accept the Lead Surveyor’s evidence that Mr Joseph was not in the CCR at the time permission for line blowing was sought. 154 Mr Joseph deposed that he saw the pressure reading of tank 4S to be 0.993 bar at 0535h and that this was a sudden spike. Suddenly, the alarm sounded in the CCR and he saw mist on deck. It is to be noted that the sudden increase in pressure coincided with the time the Manifold Watchman told him that the pigging operations had completed and that the terminal was about the start line-blowing. This piece of evidence, if true, would show that he was in the CCR before and at the time of the incident. 155 The plaintiff’s position above is to be contrasted with Mr Joseph’s detailed version of event, that could only suggest that he was present in the CCR at the material time. However, there are inconsistencies in Mr Joseph’s AEIC evidence and his oral testimony in the witness box. The inconsistencies cast serious doubt on his claim that he was present in the CCR at the material time to enable him to observe the pressure in tank 4S and to comment on the Lead Surveyor’s evidence that he was not in the CCR. 156 Mr Joseph has given two accounts of the increase in pressure in tank 4S. In his second AEIC, Mr Joseph asserted that pressure in tank 4S was observed to have increased from 0524h to 0535h, when pigging was underway. This suggests that he was reading the system monitor in the CCR for the pressure of the atmosphere in the ullage space of the cargo tank at that period of time and that there was a noticeable but gradual rise in pressure in tank 4S. In his first AEIC, however, Mr Joseph suggested that the increase in air pressure was sudden. At trial, he further testified that there were no problems during pigging. His oral testimony at trial on there being no problems with pigging must be the correct one for two reasons. First, Mr Joseph accepted that for pigging operation to complete within 11 minutes (0524h to 0535h) the flow rate (the volume of fluid that passes through a pipeline) would have been “phenomenal” and that anyone monitoring pigging in the CCR would have raised an alarm. Nobody raised an alarm. Second, as found earlier, pigging took 40 minutes and there was no incident during pigging proper. As for the differing accounts, this casts doubt on whether Mr Joseph was in the CCR at the time close to or at the incident. 157 The plaintiff relies on the Lead Surveyor and Zulchaidir to rebut Mr Joseph’s position that he was in the CCR. 158  The Lead Surveyor testified that Mr Joseph was not in the CCR when he sought permission for line blowing to commence and that at all material times, the Third Officer (who was the duty officer) was present in the CCR. In his AEIC, the Lead Surveyor explained that prior to 0500h, he was resting in the messroom with a fellow surveyor, Zulchaidir. Save for sampling at the start of loading, their presence was not necessary for the rest of loading and pigging. They had estimated that their assistance was needed after 0500h and so sometime after 0500h, they left the messroom and proceeded to the CCR. Later, Zulchaidir left the CCR to go to the manifold and the Lead Surveyor remained in the CCR for a few minutes before leaving for the deck to check with the Duty Loading Master when line blowing would commence. 159 On the way to the deck, the Lead Surveyor met the Duty Loading Master. There the Duty Loading informed the Lead Surveyor about his intention to seek permission to commence line blowing. The Lead Surveyor then told the Duty Loading Master that he would assist and thereafter, proceeded to the CCR. The Lead Surveyor, however, stated that only the Third Officer was in the CCR at the material time. Mr Joseph was not in the CCR. He thus sought permission from the Third Officer to commence line blowing and permission was granted. The Lead Surveyor then left for the manifold and once there, told the Duty Loading Master that permission to commence line blowing has been granted. 160 Zulchaidir’s account supported the Lead Surveyor’s evidence. Zulchaidir met Mr Joseph when he boarded the vessel on 16 April 2013. At 0525h on 17 April, he saw the Third Officer in the CCR. After that Zulchaidir left the CCR for the manifold and the Lead Surveyor stayed behind. At the manifold, he witnessed the Duty Loading Master ask a crew member, the Manifold Watchman, for permission to commence line blowing. The crew member replied, “wait a while”. Shortly after, the Duty Loading Master left the manifold and headed in the direction of the CCR. Not long after the Duty Loading Master returned to the manifold to wait. The story picks up with the Lead Surveyor heading to the CCR to obtain permission to line blow (see [163] below) and thereafter returned to the manifold and said to the Duty Loading Master “okay”. The Duty Loading Master then told a crew member (who was in all likelihood the Manifold Watchman) that line blowing could commence and sought his concurrence. 161 On balance, I accept the plaintiff’s evidence that Mr Joseph was not present in the CCR from the time the Lead Surveyor went to the CCR to the time of the incident. Consequently, Mr Joseph’s testimony on what he saw (such as the sudden rise in pressure to 0.993 bar) and heard cannot be relied upon and is therefore rejected.",
        "Permission to commence line blowing": "162 The plaintiff’s position is that the terminal gave notice to commence line blowing, and that permission was sought and obtained from theBum Chin. Mr Tay argues that the plaintiff had not pleaded that permission to commence line blowing was granted. There is nothing to this contention. Permission to commence line blowing is put in issue because of the Letter of Protest and the accompanying statement of facts. Mr Gurbani further explains that any finding that permission had been sought and given must necessarily undermine the air breakthrough theory, and would therefore come up as an issue. Mr Gurbani’s further point is that paragraphs 8(a) and 8(b) of the plaintiff’s Reply (amendment no 2) is sufficient to cover the issue of permission. 163 Turning to the plaintiff’s narrative on permission, the Duty Loading Master testified that having completed pigging at around 0540h, the Duty Loading Master shouted to one of the ship’s crew something to the following effect: “I will be blowing manifold 4 starboard”.69Foot Note 69×Transcript 18 January 2018, p 25.While he saw the crew member (who was in all likelihood the Manifold Watchman) communicate with someone, he was unsure if the crew member sought permission from an officer. Thus, the Duty Loading Master boarded theBum Chinand proceeded to the CCR to seek permission for line blowing. As the Duty Loading Master was approaching the superstructure along the walkway, he met the Lead Surveyor and told the Lead Surveyor that he was on his way to seek permission to start line blowing for tank 4S. The Lead Surveyor then told the Duty Loading Master that he would seek permission on the Duty Loading Master’s behalf. The Lead Surveyor’s account regarding the exchange with the Duty Loading Master is set out in [158] above. The Duty Loading Master returned to the ship’s manifold and waited for the Lead Surveyor. After obtaining permission from the Third Officer (who was the officer on duty), the Lead Surveyor went to the manifold and informed the Duty Loading Master that line blowing may commence. Thereafter, the Duty Loading Master turned to the Manifold Watchman, asking if he could proceed with line blowing. The Duty Loading Master, Lead Surveyor and Zulchaidir all heard the Manifold Watchman confirm that line blowing could start.70Foot Note 70×Transcript 26 January 2018, pp 32–33; Transcript 18 January 2018, p 25; Transcript 25 January 2018, p 54; AEIC of Suprianto, para 59; AEIC of Eddy Gunawan, para 54.Having satisfied himself of the permission to commence line blowing, the Duty Loading Master shouted to Mariston to commence line blowing. Mariston, who was operating the main jetty valve at the material time, proceeded to perform two sets of opening and closing of the main jetty valve. It was upon the commencement of the third set that a loud bang was heard. It is noteworthy that whilst Mariston was cross-examined on the opening and closing of the main jetty valve for line blowing, the defendant could not point to any mistake on his part. More to the point, the defendant’s primary case is that air breakthrough occurred before line blowing started. 164 The defendant submits that it was odd for the Lead Surveyor to assist the terminal in obtaining permission to commence line blowing and relies on the evidence of its own expert, Captain Sanjay, to suggest so. This submission does not assist the defendant. The terminal and theBum Chinhad explicitly agreed to use surveyors as a mode of communication. This is clear from the Ship/Shore Safety Checklist. Further, Mr Joseph also testified that the Duty Loading Master had a poor command of the English language and that the Lead Surveyor could speak English. Hence, it is unsurprising that the Lead Surveyor went to the CCR to seek permission on behalf of the Duty Loading Master. 165 From the evidence above, the time taken to seek permission for line blowing (which includes conferring with the Manifold Watchman and giving instructions to Mariston) is consistent with the finding of the five- minute break between the end of pigging and commencement of line blowing. This five-minute break is also significant when considering Mr Sach’s expert evidence. 166 As foreshadowed, there is an evidential gap as the Manifold Watchman and Third Officer were not called to testify. On the evidence before the court, I am satisfied that the terminal had done everything properly up to the point before the incident. I accept the plaintiff’s evidence that permission to commence line blowing was sought and obtained by the terminal prior to the start of line blowing. As permission was duly sought and obtained, and the terminal had executed its procedures properly, the fact that the incident occurred must mean that there was a lapse on the side of theBum Chin. Without the critical witnesses, what happened on board has not been adequately explained by the defendant and in the light of the shape of the evidence, the fault lies on the defendant. This fault would include the control of the ship’s manifold valve during line blowing. In the absence of the Manifold Watchman at the trial to explain the state of affairs and the part he played at the manifold, adverse inference is drawn against the defendant. The adverse inference drawn against the defendant is that the Manifold Watchman did not properly control the ship’s manifold valve during line blowing, and I so hold. 167 On a general note, the terminal’s personnel do not speak English. Much of the difficulties during cross-examination had to do with the translation of the questions and answers, and not because the witnesses who spoke Bahasa Indonesia had been evasive. Further, the difficulties in the first three of days of trial had to do with the first interpreter’s competence, which necessitated a change of interpreters at the court’s direction. The situation improved after the second interpreter took over.",
        "Whether the Bum Chin adopted open or controlled venting": "168 The relevance and implication of either open or controlled venting to each party’s case is as follows. The plaintiff’s case is that the vessel adopted controlled venting (ie, venting through its P/V valve alone) and the P/V valve of tank 4S was not working on the day of the incident. As such, there was over-pressurisation in tank 4S when air was introduced because of insufficient venting. As a defence to the plaintiff’s case, the defendant mounts two arguments. First, the defendant claims that open venting was adopted and denies that the P/V valve was not working. Second, and in any event, it does not matter if controlled or open venting was adopted by the vessel, since there was a sudden surge of air pressure entering tank 4S (“sudden surge theory”). The defendant’s sudden surge theory is not dependent on open or controlled venting. 169 As discussed above, open venting would require use of the other venting facilities apart from the P/V valve. This is further confirmed by Mr Joseph who stated that for controlled venting, only the P/V valve is used.71Foot Note 71×Transcript 31 January 2018, p 58.I add here that the approach of the parties was to focus on the venting arrangement for theBum Chin’scall at the Kuala Tanjung terminal, but this misses the specific issue regarding the venting of tank 4S. As the parties had spent time dealing with the venting arrangement of the vessel, I will discuss this first and comment accordingly. 170 As to whether theBum Chinintended to adopt open or controlled venting for cargo operations at Kuala Tanjung terminal, the Intended Stowage Plan prepared on 6 April 2013 indicated that the plan was to adopt controlled venting. The Ship/Shore Safety Checklist (item 29) provided that venting would be through “PV/purge pipe” and item 30 stated that requirements for closed operations have been agreed upon. 171 According to the plaintiff, based on the Ship/Shore Safety Checklist, it was agreed that only the P/V valve would be used for venting as theBum Chindid not have a purge pipe. In this regard, Mr Joseph explained that “PV/purge pipe” means that theBum Chinwill be venting through the P/V valveandthe purge pipe. First, Mr Joseph’s explanation that the slash in “PV/purge pipe” is to be read as “and” is not persuasive. Second, theBum Chinis not fitted with a purge pipe. Mr Joseph claims that “purge pipe” is nautical “slang” for gas free vent. His explanation is that even though theBum Chinis not fitted with a purge pipe, by opening the cover of the gas free vent, the gas free vent would serve as a purge pipe. However, Mr Joseph eventually agreed on further cross-examination that both venting facilities were different and that theBum Chinis not fitted with a purge pipe:72Foot Note 72×Transcript, 1 February 2018, pp 10–11. Q: Yes. And you confirm that the Bum Chin did not have a purge pipe? A: Yes. … A: The purpose of the purge pipe and gas freeing cover is the same. Only some ships are fitted with separate pipes and some ships are fitted in the same PV stack. … … Q: A gas free vent is not a purge pipe. You said that earlier. A: Yes. Q: The Bum Chin does not have a purge pipe. You said that earlier as well. A: Yes. 172 The Ship/Shore Safety Checklist makes clear that the venting agreed upon for theBum Chinwas through its P/V valve. The venting arrangements in items 29 and 30 of the Ship/Shore Safety Checklist are on controlled venting. Therefore, any assertion that there was to be open venting for the consignment of palm oil products is inconsistent with what has been agreed and hence incorrect. 173 Mr Joseph also explained that while the Intended Stowage Plan showed that controlled venting was to be adopted, the document was made in advance of the actual loading and he had then anticipated that the terminal would not allow open venting. When it came to actual cargo operations, it was discussed that theBum Chinwould adopt open venting and hence, the Ship/Shore Safety Checklist indicated open venting:73Foot Note 73×Transcript, 31 January 2018, pp 64–65. Q: “Controlled”. A:  Controlled just using PV. Before making the plan, before making the plan, some of the terminals don’t allow open venting, because the gas escapes and the smell comes. So most of the terminals don’t allow to do open venting. So in the plan we made it as controlled, and why---before starting the operations, we already discussed with the terminal, we asked them whether they allow open venting or not. After that, we decided to go on open venting, and then mentioned that in the ship shore checklist. 174 As explained in [172], I do not accept that open venting was agreed upon in the Ship/Shore Safety Checklist. At trial, Mr Gurbani pointed out that the Intended Stowage Plan was eventually endorsed by the Master on 20 April 2013, after the incident had occurred. It was also further pointed out to Mr Joseph that there was no need for the Master to sign the plan at all if it was never used. The inference is that the Intended Stowage Plan was the final stowage plan and it is significant that the document stated controlled venting. As the Master was not called to testify, Mr Joseph agreed that he could not explain the Master’s intention behind endorsing the Intended Stowage Plan.74Foot Note 74×Transcript 31 January 2018, p 68. 175 It follows from the above that the defendant has to explain why it asserts that open venting was adopted during cargo operations. Mr Joseph’s explanation in [173] above on the Intended Stowage Plan is unconvincing. His explanation of the purge pipe is also unconvincing. 176 Based on the Ship’s Manual, when open venting is adopted, the Butterworth hatch must also be used as a “safety relief valve”. It is accepted that there are at least two Butterworth hatches for each tank.75Foot Note 75×Transcript 31 January 2018, p 55.For open venting, the Ship’s Manual instructs the ship to “open and leave a Butterworth hatch unsecured”.76Foot Note 76×DBOD Vol 1, p 600.There is no evidence to show that there has been compliance with this requirement in the Ship’s Manual. Mr Joseph was cross-examined on the status of the Butterworth hatch:77Foot Note 77×Transcript 1 February 2018, p 21 A: So that’s the butter worth tank, where hatch was not opened, but it is not secured. Q: Okay. So you don’t open it. When you say “open” means the lid is off, right? A:  Lid is off, yes. Q: That’s what open means. A: Yes. Q: But it was unsecured. A: It was unsecured. Q:  The lid was on, but it was unsecured. A: Lid was on, unsecured, yes. The Butterworth hatch was not left open, though it was unsecured. 177 For completeness, the plaintiff in its closing submissions attempt to counter Mr Joseph’s evidence that open venting was adopted by pointing to a photograph of the gas free vent of tank 3S to suggest that the gas free vent of  tank 4S was closed.78Foot Note 78×PCS, paras 214–215.This photograph was taken three hours after the incident. In my view, there is no probative value to the photograph to counter the open venting argument. It is not known what was done to the gas free vent in the three hours. Further and more crucially, the photograph is of the gas free vent of tank 3S and not tank 4S. 178 At the trial, Mr Joseph insisted that the gas free vent of all the tanks were open. He explained that the pump man had opened the gas free covers and he personally checked them. I will come back to whether the gas free cover of tank 4S was specifically left in the open position below. However, in so far as the other tanks are concerned, Mr Joseph’s evidence is wanting. He offered no details as to when he carried out the checks. 179 For the above reasons, the defendant has not shown that open venting was adopted by theBum Chin. I should mention that other means of venting, that is to say, through the ullage port and tank access hatch were not used at all material times. As the agreed position for controlled venting in the Ship/Shore Safety Checklist only involved the P/V valve, it is odd for Mr Joseph to introduce the state of the gas free cover as evidence of open venting adopted for the entire vessel. This is misleading because the material question relates to the venting of tank 4S. It appears that the gas free cover of tank 4S was in the open position and it is the plaintiff’s case that the P/V valve of tank 4S was not working. 180 The plaintiff relies on the point that that theBum Chindid not carry out proper checks of the P/V valve and the evidence of its witnesses that the P/V valve of tank 4S did not emit a sound during cargo operations to suggest that the P/V valve was not working on the day of the incident. The Ship/Shore Safety Checklist (item 31) provides that the operation of the P/V system was verified by theBum Chin. However, it is unclear when the check was carried out. Mr Joseph’s signature against item 31 of Ship/Shore Safety Checklist has limited evidential value in this respect. The terminal did not sign off against item 31 of the Ship/Shore Safety Checklist as it quite plainly could not verify if Mr Joseph did indeed check the operation of the P/V system. 181 Mr Joseph’s evidence at trial was that he had checked the pressure side of the P/V valve by fiddling with the test lever for movement of the operating mechanism to conclude that the P/V valve of tank 4S was working. In addition, the Letter of Protest stated that the P/V valve lifted at the time of the incident. I make two points. First, I have earlier commented on the limited probative value of the Letter of Protest. It simply took dressing from Mr Joseph’s statement of facts. Second, Mr Joseph’s so-called fiddling of the lever is vague. The operation of the P/V valve should be checked using the testing facility provided by the manufacturer to ensure that the valve is operating. In this regard, I refer to theBum Chin’sPlanned Maintenance System. This document was disclosed by the defendant and it records the monthly periodic checks for the P/V valves for December 2012 to April 2013. The document shows that maintenance was done for all other P/V valves except for that of tank 4S in the month of April 2013 (which was the month when the incident occurred).79Foot Note 79×DBOD Vol 2, pp 965–968, 985–986; Transcript 1 February 2018, p 87.Curiously, in the previous months of March, February and January 2013, the P/V valve of tank 4S did receive periodic maintenance. The defendant was not able to explain why the P/V valve of tank 4S was not maintained in April 2013 and the implication of this is that the P/V valve of tank 4S was not in working condition at the time of the incident. I will elaborate on this point below (see [184]). 182 At trial, Mr Joseph insisted that a periodic check for the P/V valve of tank 4S was done in April 2013. He claimed that a periodic check was the same as a routine check and that he had done many routine checks in April 2013.80Foot Note 80×Transcript 1 February 2018, p 85.However, upon further cross-examination, Mr Joseph accepted that periodic checks are in fact different from routine checks. The former requires the use of a test kit whereas the latter simply involves lifting of the levers attached to the P/V valve.81Foot Note 81×Transcript 1 February 2018, pp 95–96.The defendant also tendered Exhibit D1 in response to the missing data entry in the Planned Maintenance System. However, theBum Chin’sname does not appear in Exhibit D1. The plaintiff quite rightly questions the utility of Exhibit D1. 183 There is the matter of sound emitting when the P/V valve is operating. The Duty Loading Master, who was on the deck when the incident occurred testified that he did not hear the P/V valve in operation. Mariston, who was at the jetty (which is approximately 25m away from theBum Chin) likewise testified that he did not hear the P/V valve in operation at the time of the incident. Zulchaidir stated in his AEIC that it is normal to hear noises from the P/V valve during loading and blowing, but on the day of the incident, no sound was heard from the P/V valve of tank 4S. He added that he saw the crew check the P/V valve of tank 4S after the incident. 184 On the overall evidence before the court, it was more probable than not that closed venting was adopted and the P/V valve to tank 4S was not in operation at the material time. With this state of affairs, it is logical that the gas free cover to tank 4S was open to accommodate the fact that the P/V valve was not working. This may well explain Mr Joseph’s insistence that the gas free cover to tank 4S was in open position throughout loading, pigging and line blowing procedures (and that the photograph of tank 3S showed that the gas free cover was in close position). Critically,Mr Joseph testified that when the gas free cover is open, pressure by-passes the P/V valve.82Foot Note 82×Transcript 31 January 2018, p 26.As analysed, I accept Mr Joseph’s evidence that the cover of the gas free vent to tank 4S was opened and it is more probable than not that the P/V valve of tank 4S was not working, and I so find. 185 The real question now is whether tank 4S was sufficiently vented for cargo operations, and more crucially line blowing. It is worth noting that only the gas free cover was opened for tank 4S. As Mr Joseph indicated at trial, the Butterworth hatch had its lid on but it was unsecured. Mr Joseph insisted the ullage port and tank access hatch were not used for venting and Mr Gurbani did not seriously pursue this line of inquiry. 186 Having regard to the finding at [184], Captain Snowden’s first report contains the throughputs of the gas free vent at various pressure settings. In his response to Mr Gravil’s second expert report, Captain Snowden referred to the calculations he did in his own first report and concludes that the venting capacity of the gas free vent would exceed the capacity of the P/V valve. The defendant has no evidence of the venting capacity of the gas free vent. Their experts were focused on the instantaneous rise in air pressure. Adopting the only evidence on the matter, Captain Snowden’s conclusion on the venting capacity of the gas free vent effectively undermines the plaintiff’s case on over-pressurisation on account of the non-working P/V valve of tank 4S. The plaintiff’s contention that tank 4S was insufficiently vented because the P/V valve of tank 4S was not working is ill-founded.",
        "Expert Evidence": "187 To reiterate, the parties put forward three theories as to the cause of the damage to tank 4S: (a) Pre-existing weld defects and fatigue cracks in the tank top of tank 4S (“structural weaknesses of tank 4S”); (b) Insufficient venting that resulted in over-pressurisation of tank 4S (“insufficient venting of tank 4S”); and (c) Over-pressurisation of tank 4S as a result of the sudden surge of air into tank 4S (“sudden surge theory”). 188 In the light of the key factual findings above, I will now examine the three theories. It is convenient and expedient to examine the sudden surge theory first. Thereafter, the insufficient venting of tank 4S and structural weaknesses of tank 4S will be evaluated. Insufficient venting is easily disposed of having regard to the views in [186] above.",
        "Sudden surge theory": "189 As a point of clarification, the parties adopt the term “over-pressurisation” to describe the cause of the failure of tank 4S. However, the way the term was understood by each side seems to vary. To the plaintiff, over-pressurisation refers to a build-up of pressure in tank 4S as a result of insufficient venting because the P/V valve of tank 4S was not working. Pausing here, there is the other form of “over-pressurisation” that has to do with theBum Chin’sfailure to control the air pressure entering theBum Chinduring line blowing. I will come to this matter in another part of this judgment. In so far as the defendant is concerned, over-pressurisation refers to a sudden surge of air at high velocity into tank 4S. 190 The sudden surge theory was adopted to support Mr Joseph’s observation that the pressure in tank 4S rose very quickly, as well as to support the position taken in the Letter of Protest, namely, that the incident occurred in a matter of seconds. The sudden surge theory is primarily premised on the combined testimonies of Mr Sachs, Dr Ong and Dr Chua. The defendant’s explanation of the sudden-surge theory has been set out in [95] above: as high velocity air penetrate through the liquid cargo, the force exerted against the cargo would be transmitted instantaneously to the surrounding walls of tank 4S, and thus cause the buckling of the bulkhead. As the buckling was instantaneous, the structural integrity and venting capacity of the tank are irrelevant to the cause of the buckling. The defendant advances two explanations for the sudden surge of air entering into tank 4S: (1) Mr Sach’s inherent risk of an air breakthrough at the end of pigging, before the commencement of line blowing (ie,the interim period); and (2) the terminal’s failure to inform theBum Chinthat pigging had completed and failure to obtain permission before commencing line blowing. I have dealt with these explanations. Mr Sach’s air breakthrough theory is unconvincing on the analysis set out at [131] to [134] above, and is thus rejected. I have found that permission to commence line blowing was sought and obtained prior to line blowing, and in addition, the Manifold Watchman was duly informed of the matter before the commencement of line blowing (see analysis from [162] to [166] above). Thus, even if there were a sudden surge of air, it could not have been the fault of the terminal. For the reasons I will come to, the improper throttling of the manifold valve is a likely contributory cause to the failure of tank 4S (see [217] and [220]–[221] below). 191 Turning to the sudden surge theory proper, Mr Sachs’ report merely sets out how the terminal procedure could lead to an air breakthrough. It is at trial that he later “adopted” the sudden surge theory. In doing so, he relied on Dr Chua’s theoretical analysis and Dr Ong’s calculation on the net pressure needed to buckle the bulkhead instantaneously to make his conclusions. Pausing here, it is worth clarifying that Dr Ong’s net buckling pressure of 1.2 bar is not to be equated as the air pressure that passed through the ship’s manifold valve. In ascertaining the driving force to buckle the tank wall, he would have to accept as true Mr Joseph’s pressure of 0.993 bar and that this was a sudden spike in pressure. 192 To determine the buckling pressure and whether tank 4S had buckled as a result of over-pressurisation, Dr Ong modelled the corrugated tank wall that had buckled and ran an FEA on the model. Based on the FEA, it was calculated that the bulkhead would buckle at a net pressure of least 1.2 bar surcharge pressure. Dr Ong was of the opinion that buckling was caused by pressure exerting a load on the tank wall by high compressive in-plane forces that suddenly occurred. He concluded that the buckling was instantaneous. He added that it was “extremely unlikely that the primary cause of failure was due to the existence of incipient cracks at the welded joints or the failure associated with fatigue cracks”.83Foot Note 83×DBAEIC Vol 2, p 367–368The weld defects are static and localised. They would only result in leakages at the defect zone and would not have caused the buckle. Buckling of the tank top requires internal pressure from within the tank. On this opinion, the defendant submits that the buckle was caused by over-pressurisation and not the tank’s defects, especially since Dr Ong testified that the FEA model showed the exact same deformation shape and location as the actual damage in the tank that was reproduced. 193 Based on Dr Ong’s calculations as to the net pressure required to buckle the bulkhead, Dr Chua then determined the speed at which the buckling occurred to support the position that the buckling occurred in a matter of seconds. However, instead of using 1.2 bar as the net buckling pressure in his calculations, Dr Chua took 2.2 bar as the buckling pressure. In the annex of his report he explained that 2.2 bar was adopted to compensate for the effect of venting through “a small valve installed on the top of the tank” and loss of pressure energy due to the friction force between the penetration of high pressure air through the palm olein as the former travels through the liquid phase.84Foot Note 84×DBAEIC Vol 2, p 1013.Based on the starting parameters of 5 bar pressure entering the tank, the volume of the palm olein in tank 4S as well as the pressure of 2.2 bar in the ullage space, among other things, Dr Chua calculated the time required for buckling to be about 3.04 seconds. He concluded that the “buckling process is quite fast and can be treated as [immediate] even if the tank had been ventilated”.85Foot Note 85×Chua’s report, para 13.As Dr Chua testified, energy would have transferred from the air travelling through the liquid phase to the walls of tank 4S almost immediately and cause the bulkhead to buckle. 194 Relying on the above two opinions, the defendant submits that Dr Ong and Dr Chua’s scientific calculations render the sudden-surge theory probable: tank 4S buckled due to a sudden surge of air (ie, it occurred with approximately 3.04 seconds). 195 As observed earlier, Dr Ong’s net pressure of 1.2 bar is not to be equated as the air pressure that passed through the ship’s manifold valve. Dr Ong did not address or take into account the venting capacity of the tank 4S in his FEA model, claiming that he was only calculating the net pressure required to buckle tank 4S. He confirmed at the trial that venting is irrelevant for his experiment. On the other hand, Dr Chua took into account the ventilation of tank 4S by using a buckling pressure of 2.2 bar. In my view, the defendant cannot rely on both Dr Ong’s net pressure of 1.2 bar and Dr Chua’s calculation of time (ie, 3.04 seconds) at the same time. This is because Dr Chua’s time calculation was premised on a buckling pressure of 2.2 bar. To accept the net pressure of 1.2 would render the time calculation of 3.04 seconds inaccurate, andvice versa. 196 I now turn to the plaintiff’s criticisms of the experts’ analyses. The plaintiff highlights what it considers as three flaws in Dr Ong’s analysis:86Foot Note 86×PCS, para 231. (a) Dr Ong only modelled a single wall panel, fixed at three sides. Such a model is unrealistic given that the actual wall panel was welded to theBum Chin’sstructure around all four sides. Further, the absence of full restraint makes the wall more flexible, thereby allowing the buckling to take place more easily. (b) Dr Ong’s model completely disregarded the presence of weld defects, but yet concludes that these defects were extremely unlikely to be the primary cause of tank failure without any scientific basis or calculation. As Dr Chee pointed out, Dr Ong’s model was based on an assumption that buckling is going to take place, therefore the defects were not considered in the model in the first place. In failure analysis, it is necessary to model the actual tank exactly so that actual deformation can be observed and deduced from that. (c) Dr Ong’s model disregards the venting capacity of tank 4S. 197 Criticism (b) is valid. Dr Ong had assumed that the structural weaknesses were irrelevant from the outset and that all he needed was to show technical evidence to support this assumption:87Foot Note 87×Transcript 9 February 2018, p 98. Witness (DW11): Okay, because I see that that is a subsequent so called questions to be asked. Maybe let me describe to the Court: the way I --- the approach the methodology I approached this problem. Okay, when I first known of these problems, and--- by Philip, and he described the problem to me, and he said that--- that the tank wall has buckled and there was also the---the tank top has ruptured, and he asked me, in the very first meeting what caused the tank wall to buckle.I say definitely it’s due to internal pressure. The weld defect has nothing to do---do with it. But then I need to show some so-called technical evidenceto---to show what I say is true, and that’s why I---I used the finite element model. By the way, finite element model, it’s a universal engineering analysis too, and it---it can be used to model complex engineering geometry, including in this case the tank”. [emphasis added] On further cross-examination, Dr Ong also accepted that he had not taken the structural weaknesses into account. 198 Criticism (c) is similarly valid. Dr Ong’s reason for disregarding the venting capacity of tank 4S is because he was calculating the net buckling pressure. But he was not called to merely provide calculations but to also provide an opinion on the cause of the tank’s failure. On this note, Dr Ong’s report did not set out why venting was irrelevant. It is only at the trial that Dr Ong appears to suggest so. Further, unlike Dr Ong, Dr Chua did accommodate for venting by adopting a buckling pressure of 2.2 bar based on a rough assumption of the venting capacity of tank 4S. Under these circumstances, more is expected of Dr Ong to explain his conclusions and not to merely dismiss the venting capacity of the tank. In addition, I repeat the observations made in [195] above. Both criticisms (b) and (c) are valid and they serve to diminish the evidential value of Dr Chua’s expert report and testimony. It is unnecessary to discuss criticism (a) here, but later when discussing structural weaknesses of tank 4S. 199 I now turn to the plaintiff’s criticisms of Dr Chua’s report. The plaintiff say that Dr Chua was not fully apprised of the presence of defects, the design of tank 4S and other material facts such as the state of the main valve at the jetty:88Foot Note 88×Transcript 9 February 2018, pp 73, 75–76 and 110. Q: …Have you assumed that the main valve in the jetty was completely open? A: I’m sorry, I don’t---Your Honour, I am sorry, I do not have the---the knowledge on that part, but can assume it is open. … … Q: So, Professor Chua, we---if in fact the jetty valve was not [open] 100%, and I understand, from some materials I have seen, I don’t know quite where now, that that is 37 turns, right? If that was not correct,if the jetty valve was not open completely, or 100%, do you agree that the basis of the calculations that you have done, you know, will be wrong? A: Yeah, but that should---definitely, that should be affected, but we still can recalculate to show the time. …. Q: … you did say that Professor Ong may have told you that you don’t have to take into account defects. Did you ask him why? A: I do admit to you, I’ve been---I---I really do not know at the very beginning, because I joined at the very, very end. …. Q: Did you even know, Professor Chua, that there were defects, when you did the report? … A: At that time, no. Q: Sothe report was prepared on the basis that there were no defects? A: Yah,I didn’t even know there’s a defect. … … Q: … Professor Chua, I think you said earlier that there was a high speed---you took into account a high speed flow and high speed---high--- A: Flow rate. Q: ---volume flow rate, as far as the tank is concerned.Were you told that the tank is actually fitted with diffusers at the bottom of the loading line? …. Q: Well,the purpose of a diffuser is to slow down rates at the bottom of the loading line. So were you told that, or you assumed that there were no diffusers, or you don’t know that there were diffusers A:No, I---I was not told that. [emphasis added] 200 In my view, without being apprised of the above matters, Dr Chua could not have taken into account all the material facts to render his calculations reliable. Specifically, as regards the main valve at the jetty, Dr Chua’s answer in cross-examination in [199] above is significant. Dr Chua’s readily admitted that he had assumed that the main jetty valve was opened. He accepted that his calculations would be affected if the main valve was closed and recalculation is needed. As stated, the finding is that the Duty Loading Master had closed the main jetty valve. Hence, based on Dr Chua’s answer in cross-examination that a recalculation of time is required, unless he had revised his report, Dr Chua’s conclusion on the time required to buckle the bulkhead is unreliable. Furthermore, the conclusion in his report is unreliable as the report was prepared on the basis that there were no defects in tank 4S. 201 For the reasons stated, the defendant is not able to prove that the buckling of the bulkhead was instantaneous due to a sudden surge of air into tank 4S at high velocity. The factual genesis of the sudden surge theory was Mr Joseph’s testimony that he saw a pressure reading of 0.993 bar at 0535h in the CCR and that this was a sudden spike in pressure.89Foot Note 89×Joseph’s AEIC, at paras 20 and 21.Within a very short span of time, the alarm sounded and Mr Joseph saw mist on deck. On the findings of fact made above, the conclusion is that Mr Joseph was not present in the CCR from at least 0525h and therefore his testimony on each of the aforesaid matters has been rejected. There is no eye witness account that buckling was instantaneous. Separately, I have also explained the reasons why the calculations of Dr Chua and Dr Ong do not assist the defendant to prove that buckling was instantaneous above. 202 For completeness, I should mention Captain Snowden’s opinion to counter the sudden surge theory. The plaintiff argues that if, as the defendant claims, theBum Chinhad been open venting (meaning the P/V valve was in operation, the gas free cover and Butterworth hatch were left open), and assuming that the main jetty valve and manifold valve were left completely open, and further assuming that tank 4S received 7 bar of air pressure from the terminal, the time taken for the pressure in rank 4S to reach 0.993 bar (as reported by Mr Joseph) would be 22 seconds. This 22 seconds is intended to rebut the defendant’s allegation of an instantaneous rise in pressure as it would have been unrealistic if theBum Chinhad been open venting. There are doubts as to whether Captain Snowden’s calculations are entirely reliable. This is because, as was pointed out by the defendant’s experts, Captain Snowden’s calculations assumes a static system where the air entering the bottom of Tank 4S would rise to the deck unimpeded. However, as there is a liquid layer through which the air must first push through, the dynamic forces at play may affect the speed at which the tank reaches the pressure of 0.993 bar. Having said that, it is unnecessary for me to take a view on Captain Snowden’s 22 seconds calculations that are premised on assumptions when the facts are otherwise.",
        "Insufficient venting of tank 4S": "203 The plaintiff and defendant both agree that the failure of tank 4S was due to over-pressurisation. The difference between both sides, however, is in how the over pressurisation happened – on the one hand, the plaintiff is saying that the over-pressurisation was due to insufficient venting, on the other hand, the defendant is saying that the over-pressurisation was due to a sudden surge of air. I have already explained why the sudden surge theory is unsupportable above. On the plaintiff’s explanation of over-pressurisation due to insufficient venting because the P/V valve to tank 4S was not working, I have already covered and rejected this for the reasons stated in [186] above. 204 I address some further matters in this section. The defendant, through its experts, tried to suggest that the tank was sufficiently vented. Mr Sachs said at trial that even if the P/V valve of tank 4S were not functioning, he would conclude that there was ventilation of some kind, otherwise damage would have been done to the tank during pigging proper. I agree with Mr Sachs’ comment as venting for tank 4S was through the gas free vent at loading, pigging and line blowing and this reinforces my conclusion at [184] above. 205 At trial Captain Sanjay said that he could accept that pressure in tank 4S would increase if theBum Chinhad only vented through its P/V valve and the P/V valve was not operational. But he added that he could not comment on whether that would result in the damage without doing some calculations. In relation to line blowing specifically, he took the position that even if the P/V valve was not functioning, if line blowing had been done properly, the pressure would only go up marginally.90Foot Note 90×Transcript 9 February 2018, pp 66–67.The caveat here is that no damage would result if line blowing was done properly. I make three comments here. First, Captain Sanjay did not consider the status of the gas free vent. The finding is that the gas free vent cover was open to by-pass and compensate for the non-working P/V valve. Second, the defendant’s case is that the incident happenedbeforeline blowing started, and it is not the defendant’s case that line blowing was not done properly. Third, adverse inference is drawn that the Manifold Watchman did not control the air pressure at the manifold valve properly during line blowing. 206 In summary, the plaintiff’s claim that the failure of tank 4S due to over-pressurisation from insufficient venting on account of the P/V valve to tank 4S not working is ill-founded and unsubstantiated.",
        "Structural weaknesses of tank 4S": "207 Three main experts were called to give their opinion on the structural weaknesses of tank 4S. As introduced above, Dr Sykes gave evidence for the plaintiff. As for the defendant, Ms Lim, a consultant in the field of materials, and Mr Gravil testified. While not the main expert on the structure weaknesses of tank 4S, Dr Ong offered his views on the matter in his report. By way of background, plates of tank 4S were cut out and sent to Singapore Testing Services Pte Ltd for joint testing by the plaintiff and defendant. On behalf of the plaintiff, Captain Snowden and Dr Sykes were present to witness the testing. On behalf of the defendant, Ms Lim was present to witness the testing.91Foot Note 91×AEIC of Lim Kie Yong, paras 3, 8. 208 The experts on both sides agreed that defects were present. There were pre-existing weld defects between the underside of the tank tops and the stiffeners, and fatigue cracks in the tank top plate were present. In respect of the weld defects, Ms Lim confirmed that she had identified the same defects as the ones in Dr Sykes report.92Foot Note 92×Transcript 8 February 2018, p 48.These defects could be seen on the stereomicroscope examination of the weld samples taken from the surfaces of the failed welds. In respect of the fatigue cracks, Dr Sykes and Ms Lim agreed that there exist fatigue cracks on the tank top. There were darker semi-elliptical flat regions at the toes of the welds to the tank top of the tank and there were corrosion stains that were indicative of pre-existing cracks.93Foot Note 93×Transcript 8 February 2018, pp 53–54. 209 The parties’ main point of dispute is whether these defects caused the tank 4S to fail. The plaintiff contends that the pre-existing weld defects between the tank top of tank 4S and the stiffeners, and fatigue cracks in the tank top of the tank 4S, had adversely affected the strength of the structure such that the buckling of the bulkhead and fracture of the tank top happened at a lower pressure than it otherwise would. On the other hand, the defendant’s case is based on Mr Gravil and Dr Ong’s testimony that it was over-pressurisation from the surge of air pressure that caused the bulkhead to buckle and not the identified defects. As stated above, Dr Ong does not believe that the primary cause of failure was due to existence of cracks at the welded joints or the failure was associated with fatigue cracks. 210 Let me begin with Dr Sykes’ explanation as to how the defects had caused the failure of tank 4S and what the specific failures are. According to Dr Sykes, the bulkhead in this case had deflected outwards. This deflection was almost certainly caused by a pressure difference across the centre bulkhead. When a corrugated bulkhead deflects, the ends of the bulkhead will attempt to pull together, exerting a force on the tank top and the deck plating. Consequently, the tank top must be adequately reinforced by stiffeners that are welded to its underside. In this case, the welds between the stiffeners and the tank top plate had failed, allowing the tank top plate to pull up and fracture. Further, the fracture to the tank top was an extension of the pre-existing fatigue cracks. The presence of the fatigue cracks would have reduced the load carrying capacity of the tank top, at its interface with the bulkhead, making the tank top more susceptible to fracture. 211 Dr Ong made the distinction between rupture and buckle. In the case of rupture, the cargo in the tank would leak out. In a case of buckling, the tank deforms outward or inward and there could be no rupture at the buckled location.  Dr Ong opined that the sudden (inward or outward) movement of the tank wall due to buckling caused pulling-in action of the wall and large rotation at the welded joints at the top and/or bottom edges of the tank brought about a secondary failure therein. 212 Mr Gravil noted that the bulkhead would not have buckled without over-pressurisation having regard to the design pressure of 0.7 bar as set out by the IBC Code. Here, as calculated by Dr Ong the bulking pressure was 1.2 bar. Mr Gravil posited that the buckling had occurred first and that the buckling then caused an overload of the adjoining welds.94Foot Note 94×Transcript 8 February 2018, p 59.In other words, the failure of the welds is aconsequenceof the bulkhead first buckling. 213 In light of the conflicting expert opinions, Mr Tay argues that even if there were no sudden surge of air pressure, the effect of the pre-existing defects is inconclusive because the experts are unable to opine on the extent of the structural weaknesses. Mr Tay further argues that even if the evidence is inconclusive on the issue of whether the deflection at the bulkhead occurred before the tank top fractured and lifted (the defendant’s case), or that the tank top must first fracture and lift in order to produce the vertical displacement of the bulkhead (the plaintiff’s case), the upshot of an inclusive finding on the issue is that the plaintiff has not discharged its burden of proof. I do not agree with Mr Tay’s submissions. 214 It is important to examine the issue of structural weaknesses having regard to the findings and conclusions made in this judgment. The defendant’s case that it was over-pressurisation that caused the tank failure and not structural weaknesses, has to be understood in the context of the defendant’s sudden surge theory. I have already considered the sudden surge theory earlier. In addition, I do not agree with Mr Tay’s submissions that the plaintiff would have failed to discharge its burden of proof on causation if there is an inconclusive finding on the issue of whether the deflection at the bulkhead occurred before the tank top fractured and lifted, or that the tank top must first fracture and lift in order to produce the vertical displacement of the bulkhead. In my view, the sequence of occurrence is not determinative of causation. The issue is not what caused the buckling of tank 4S. What is pertinent and determinative is the central question of what caused the ROL IV 64 cargo to leak out of tank 4S to the water ballast tank, andvice versa,for ingress of seawater into tank 4S. In this relation, it is the occurrence of tank top fracture and lifting that is the cause. 215 At the trial, the experts on both sides agreed that the existence of pre-existing weld defects would have reduced the strength of the welds, and that the fatigue cracks in the tank top plate would allow the tank top plate to fracture under the influence of lower loads.95Foot Note 95×Transcript 8 February 2018, pp 56–57.The experts, however, could not agree on the extent of the structural weaknesses. 216 Dr Sykes testified that the strength of the weld would have been reduced by 15% to 20%, and the strength of the cross-sectional area between the bulkhead and tank top would have been reduced by about 25%. Mr Gurbani pointed out that Dr Sykes supported his testimony with calculations based on the formula of S+F/A (where S= stress, F=force and A=cross sectional area). Dr Sykes calculated the strength reduction of the welds by reference to the dimensions of the defects. Similarly, Dr Sykes conclusion that the fatigue cracks would have reduced the strength of the cross-sectional area between the bulkhead and tank top was with reference to the measured depth of the cracks as well as the thickness of the steel. Whilst the defendant’s experts, Ms Lim and Mr Gravil, did not directly challenge the calculations, they stated that without conducting an FEA analysis, they could not commit to the extent the identified defects would have resulted in the failure of tank 4S. 217 In my view, without going into the merits of Dr Skyes’ calculations, it is sufficient to go on what the experts are able to agree. They agree that the strength of the fusion line would have been reduced by the presence of the numerous weld defects. Again, they also agree that the presence of pre-existing fatigue cracks reduced the cross-sectional area that resisted the load. Whilst Mr Gravil and Ms Lim were unwilling to estimate the magnitude of the structural weaknesses unless these weaknesses were properly analysed, the fact of the matter is that the fracture to the tank top did manifest. The identified defects were present, and the experts could agree that there was a reduction in the strength of the weld and the cross-sectional area between the bulkhead and tank top. In these circumstances, the identified defects would have at least contributed in some way to the failure of tank 4S such that cargo could leak out of tank 4S to the water ballast tank, andvice versa,for ingress of seawater into tank 4S. It is the combination of structural weaknesses and the failure to properly control the air pressure at the manifold valve during line blowing that caused the failure of tank 4S. Put another way, if the manifold valve had been properly throttled, the structural weaknesses alone may not have been sufficient to cause the failure of tank 4S. I will explain further the failure to control air pressure the manifold valve below. 218 For completeness, I return to the plaintiff’s criticism of Dr Ong’s model. Dr Ong’s model was of a single wall panel, fixed at three sides. This criticism throws into question the opinion that buckling occurred before the tank top fractured. 219 To conclude, I repeat what is said in [214] above. I find that what caused the ROL IV 64 cargo to leak out of tank 4S to the water ballast tank, andvice versa,for ingress of seawater into tank 4S, is the occurrence of tank top fracture and lifting without which cargo in tank 4S would not be damaged. Accordingly, structural weaknesses from the identified defects is a cause of the failure of tank 4S.",
        "Manifold valve not controlled properly": "220 It is accepted that structural weaknesses alone would not have led to the failure of tank 4S. Pressure had to be introduced into tank 4S. In this case, the air pressure was introduced at line blowing. This brings me to the issue of whether air pressure entering tank 4S had been properly controlled. 221 The ship’s manifold valve was not properly controlled during line blowing and this failure gave rise to a form of “over-pressurisation” that has to do with air entering tank 4S, leading to the continued increase in pressure within the tank that contributed to the incident. I should add that the finding is the terminal had done its part of line blowing properly. Residual compressed air was used for line blowing and the pressure at the pig receiver would have been around 3 to 4 bar. The terminal would not have supplied any air at a pressure or volume that was excessive or outside normal expectation. The fact remains that the incident did happen during line blowing and the manifold valve was not controlled. An adverse inference was drawn against the defendant in the absence of Manifold Watchman to testify at the trial. All in all, it is more likely than not that over-pressurisation as a result of a failure to control air pressure at the manifold valve properly isacause of the incident.",
        "Conclusion on breach and causation": "222 The incident led to theBum Chinbeing unable to carry out the voyage and contamination was caused to the ROL IV 64 cargo stowed in tank 4S. The ROL 64 cargo was loaded in good order and condition. Seawater contamination is consistent with a failure on the part of the defendant to carry and care for the cargo properly and carefully. I find that the loss suffered by the plaintiff was caused by the defendant’s negligence in that the latter had failed to provide a cargoworthy vessel and further failure to take care of the cargo that was on board. The occurrence of tank top fracture and lifting without which cargo in tank 4S would not be damaged was due to the structural weaknesses of tank 4S, being the identified defects that were pre-existing in tank 4S. The experts on both side agree that there was a reduction in the strength of the weld, and the cross-sectional area between the bulkhead and tank top. In addition, the defendant failed to control the amount of air pressure at the manifold valve during line blowing thereby allowing more air to enter tank 4S. Hence, I find that structural weaknesses combined with over-pressurisation from failure to control air pressure at the manifold valve contributed to the failure of tank 4S. I find that the plaintiff has discharged the legal burden of proof on breach and causation.",
        "Quantum of damages": "223 After the incident, all cargo operations ceased. Cargo on board theBum Chinhad to be discharged and a substitute vessel,PingAnwas chartered. The substitute vessel was procured by the plaintiff through Raffles Shipping. Due to the failure of tank 4S, ROL IV 64 was contaminated by seawater and according to the plaintiff, 1,175.981mt of ROL IV 64 had to be downgraded to Crude Palm Oil (“CPO”). Further, as a result of the discharging of cargo to the shore tanks and draining of seawater, 24.074mt of ROL IV 64 and 46.792mt of ROL were lost. Additionally, 1,197mt of ROL IV 64 had to be shipped in flexibags to Jeddah by 15 May 2013 to fulfil the plaintiff’s contractual obligations. Against this backdrop, the plaintiff claims for the following loss and damage: CategoryType of LossComputation of Quantum of ClaimQuantum of ClaimADowngrading of 1175.981mt of ROL IV 64 to CPO in tank 4S upon discharge1175.981 x US$(791.25 + 90 – 755) per mt  (diff between value of ROL IV 64 and CPO)US$ 148,467.60B24.074mt of ROL IV 64 lost upon discharge(1200.055 – 1175.981) x US$(791.25 + 90) per mtUS$ 21,215.21C46.792mt of ROL lost upon discharge(2327.944 – 2281.152) x US$ 791.25 per mtUS$ 37,024.17DInterest lost on export duty paid on cargo loaded and to be loaded on the Bum ChinIDR 4,605,158,527 x 10% / 12 months / 9749 x 3 monthsUS$ 11,809.31EFreight difference of USD 12 per mt for use of substitute vessel of 15,998.265mt of cargoUS$(75 – 63) per mt x 15,998.265mtUS$ 191,979.18FAdditional cost of shipping of 1197mt of ROL IV 64 in flexibags1197mt x US$85 per mtUS$ 101,745.00GOperational costs of loading and discharging the cargoes from the Bum Chin to substitute vessel-US$ 35,603.05 224 I will first address the relevant legal principles and matters that generally pervade the categories of loss claimed before examining each category itself. 225 A plaintiff cannot make a claim for damages without placing before the court sufficient evidence of the loss it has suffered. It is well-established inRobertson QuayInvestment Pte Ltd v Steen Consultants Pte Ltd and another[2008] 2 SLR(R) 623 that it is necessary for the plaintiff to prove both the fact of damage and its amount. What amounts to “sufficient evidence” will vary according to the context, since proof of damage is “intensely factual”: at [27]. Where precise evidence is obtainable, the court expects the claimant to have it, where it is not obtainable, the court must do the best it can: at [30]. 226 The plaintiff’s claims are straightforward, and it is entitled, as a matter of principle, to recover damages. What is also clear is that the claims are capable of quantification with a fair amount of precision. The difficulty noted in this case is with the sufficiency of evidence put before the court to prove the loss it has suffered. In particular, the court expects to see evidence of payment on some of the claims but, surprisingly, this was not forthcoming. 227 The nature of the losses for Category A to G are those that directly arise from the defendant’s negligence. In breach of the duty of care owed by the defendant to the plaintiff, I find that the losses under Category A to G are reasonably foreseeable and they flow directly from the negligent acts or omissions of the defendant; resulting in theBum Chinbeing unable to carry out the voyage and the cargo having to be loaded onto a substitute vessel, as well as any loss or damage to the cargo. The question that remains is for the plaintiff to prove the quantum of the claim, and the defendant has put the plaintiff to strict proof.",
        "Quantity of cargo downgraded and discharged": "228  It is not controversial that the amount of cargo on board theBum Chinat the time of the incident is as follows: (a) 1,200.055mt of ROL IV 64; (b) 2,327.944mt of ROL; and (c) 1,146.451mt of RPO. 229 As a result of the incident, the cargo on board had to be discharged and during discharge, losses were sustained. The quantities of cargo downgraded or discharged go towards calculating Category A, B and C losses. In relation to Category B and C losses (ie, the amount ofROL IV 64 and ROL lost upon discharge), the plaintiff relies on the market price to quantify its loss. In the quality claim for Category A loss, the measure of damages used is the diminution in the value of ROL IV 64 as a result of contamination. 230 There is generally no dispute over the quantity of cargo that had to be discharged from theBum Chin. The quantities were recorded by the junior surveyor, Awaluddin, who testified on the quantities of cargo loss during discharge from theBum Chin. 231 Awaluddin testified in court that he was the one who measured the quantities of oil, and produced the documents evidencing the quantities. Awaluddin conducted the survey work for theBum Chinby taking the ullage sounding and temperature of the tanks. He measured the depth of the oil three times with a manual measuring equipment and recorded the results of ullage sounding and temperature, which would then be cross-checked by a personnel from MNA. The lost cargo due to discharge in the plaintiff’s claims were arrived at based on the following: (a) The total quantity of ROL IV 64 in tank 4S of theBum Chinat the time of the incident was 1,200.055mt and upon discharge to the shore tanks and the draining of seawater, the quantity determined was 1,175.981mt. Therefore, 24.074mt of ROL IV 64 was lost as a result. (b) The total quantity of ROL loaded on board theBum Chinwas 2,327.944mt at the time of the incident and upon discharge to the shore tanks and the draining of seawater, the quantity determined was 2,281.152mt. Therefore, 46.792mt of ROL was lost as a result. The defendant took no issue with Awaluddin’s evidence. 232 I accept the plaintiff’s evidence on the quantities of ROL IV 64 and ROL on board theBum Chinbefore and after the discharge of the cargo to the shore tanks and the draining of seawater, in relation to Category A, B and C losses.",
        "Diminution in value": "233 For context, ROL IV 64 is a premium grade of ROL. The price of ROL IV 64 is therefore calculated by adding a “mark-up” to the price of ROL. In calculating the diminution in value of ROL IV 64 cargo, the plaintiff relies on the following market prices: ItemAmount (US$ per mt)Unit Price of ROL791.25Unit Price of Premium for ROL IV 64 over ROL90.00Unit Price of CPO755.00 234 The evidence on quantification of the plaintiff’s claim for damages was led by Ms Chen. She testified to her personal knowledge of the market prices of the various palm oil products and through her, the following documents on market prices were adduced:96Foot Note 96×PBAEIC (factual), pp 240–244. (a) an email enclosing a price list of crude and refined palm oil products supplied by Malaysian brokers from Reuters dated 15 April 2013; and (b) price quotations of Premium for ROL IV 64 over ROL from three brokers in the palm oil industry. 235 The defendant argues that these documents are inadmissible on the basis of hearsay since a market expert was not called to testify on the market prices of the losses.97Foot Note 97×DCS, paras 372–373.In addition, the defendant argues that the market prices relied on by the plaintiff were “cobbled from friendly business associates” and hence unreliable.98Foot Note 98×DCS, para 377.Hence, the plaintiff has not proven the market prices for the purpose of quantifying its claims. 236 Contrary to the defendant’s position, there is no need for an expert to prove the market prices because the sort of information at hand is the readily available through Reuters. Further, the defendant’s contention that Ms Chen’s evidence as well as the documents adduced are hearsay and unreliable is without basis. It is not in every circumstance that the hearsay rule is offended. I adopt the following helpful passages fromSaga Foodstuffs Manufacturing(Pte) Ltd v Best Food Pte Ltd[1994] 3 SLR(R) 1013 (“Saga Foodstuffs”) at [11] and [16]: … When evidence is sought to be given of what someone said to the testifying witness, whether such evidence offends the rule against hearsay depends on the purpose for which the evidence is sought to be tendered. If it is sought to be tendered for the purpose of establishing the truth of what was said to the testifying witness, its introduction will offend the rule. On the other hand, if the purpose of tendering the evidence is merely to show that such a statement was made, and not that the statement is true, then the rule is not offended. … … … It seems to me that evidence of the results of a market survey research of the kind in question in this suit is evidence of the existence of the belief and opinion held by the respondents to the survey. The purpose of tendering such evidence is to show that such belief or opinion exists; there is no question of tendering it for the purpose of proving the truth or merits of the belief or opinion so held. … 237 I accept Ms Chen testimony that she has personal knowledge of the market norms on pricing. In her evidence, the Unit Price of Premium for ROL IV 64 over ROL ranges from US$90 to US$100 per mt, and to quantify the plaintiff’s claim, she used the figure of US$90 per mt, which is the lowest price within her knowledge.99Foot Note 99×Transcript 30 January 2018, p 49; Transcript 30 January 2018, p 24Now it is unsurprising that Ms Chen would have such personal knowledge of the market price of palm oil products as she was the senior executive of operations of the plaintiff at the material time. In her role, she would be aware of the value of ROL IV 64 from the various other concluded contracts in seeing to their performance. The documents above were not adduced to prove the truth of their contents neither were the documents adduced to prove the market prices set out in the table at [233] above. The documents only go to show that the opinion on market price in the documents are within the range of market prices in Ms Chen’s knowledge. As stated, Ms Chen had herself arrived at the Unit Price of Premium for ROL IV 64 over ROL in the range of US$90 to US$100 per mt, and chose to use US$90 per mt to quantify the plaintiff’s claim. The quotations from the three companies of the Unit Price of Premium for ROL IV 64 over ROL gave price ranges that collectively fall within the bracket of US$70 to US$100 per mt. Indeed, price ranges of each company varied by a mere difference of US$5 to US$10 per mt. All in all, I accept the figure of US$90 per mt as reasonable in the absence of countervailing evidence from the defendant. Therefore, I accept the plaintiff’s proposed market prices in the table above at [233]. 238 For completeness, the plaintiff relies on s 32(b)(iii) of the EA in relation to the documents adduced through Ms Chen. Section 32(b)(iii) is simply not engaged as the documents, in this context, are not barred by hearsay.",
        "Category A: Contamination of Cargo": "239 The plaintiff avers that 1,175.981mt of ROL IV 64 had to be downgraded to CPO because of seawater contamination. In this vein, the plaintiff is claiming the difference in value of the ROL IV 64 cargo and CPO. 240 The presence of “freewater” in the ROL IV 64 was noted in the Lead Surveyor’s report (the plaintiff treats “freewater” as “seawater”). The Lead Surveyor’s report recorded that joint sampling of for all the loaded tanks was carried with theBum Chin’s P&I surveyor, and samples were sent to the laboratory for testing. After the incident, the ROL IV 64 was subsequently transferred to tanks 11W and 6S on 17 April 2013 and 19 April 2013 respectively. According to the Lead Surveyor’s report, the laboratory results indicated that in tanks 4S, 11W and 6S, “[p]resence of free water was found with the use of water finding paste”.100Foot Note 100×PBAEIC (factual), pp 104 and 106. 241 Prior to sending the samples of the ROL IV 64 in tank 4S to the laboratory for analysis, the Lead Surveyor and his team found traces of “free water/moisture … upon utilising UTI/MMC device for ship’s tank nos. 4P & 4S.”101Foot Note 101×Transcript 26 January 2018, p 14; PBAEIC (factual), p 102.At trial, the Lead Surveyor testified that the finding of “mixture of free water and oil” in his report was based on Awaluddin’s visual analysis.102Foot Note 102×Transcript 26 January 2018, p 20There was leakage of ROL IV 64 from tank 4S to the water ballast tank, as confirmed by the Lead Surveyor’s report and Mr Joseph at trial.103Foot Note 103×Transcript 1 February 2018, p 73; PBAEIC (factual), p 102TheBum Chin’s ballast tank was inspected and the noticeable presence of both palm oil product and free water was found. In addition, the cargo in tank 4S was transferred to tanks 11W and 6S. The Lead Surveyor found the presence of free water in tank 4S, 11W and tank 6S. 242 Based on the foregoing, on a balance of probabilities, there was presence of seawater in the parcel of ROL IV 64 due to the incident, and I so find. As ROL IV 64 is edible oil intended for human consumption, it is plausible and not unreasonable for the plaintiff, who is a player in the trading of palm oil products, to take a precautionary stance by downgrading the product to CPO. This is also one way of salvaging the ROL IV 64, where presence of seawater has been found. 243 The Lead Surveyor’s testimony that he was not aware of the actual amount of seawater in the ROL IV 64 cargo as it could only be determined by a laboratory analysis does not undermine the finding that there was presence of water in the ROL IV 64 cargo after the incident. The laboratory analysis may well identify the specific contaminants in seawater, but this information is not strictly necessary to determine damage. Proving the presence of seawater in the parcel would suffice; necessitating the downgrading of ROL IV 64 to CPO. 244 On the basis of the matters decided here and the market prices as set out at [233] above, I find that the plaintiff has satisfied the burden of proof for Category A losses.",
        "Category B and C: Loss of ROL IV 64 and ROL after discharge": "245 For the Category B and C losses, the plaintiff claims for the loss of ROL IV 64 and ROL during discharge to the shore tanks and the draining of the seawater after the incident. 246 I accept the plaintiff’s proposed quantity of ROL IV 64 and ROL lost upon discharge of the cargo to the shore tanks and drainage as enumerated above at [231] and the market prices of the cargo as stated at [233]. I thus allow the claims for Category B and C losses (in the sum of US$ 21,215.21 and US$ 37,024.17 respectively).",
        "Category D: Interest lost on Export Duty": "247 Regarding Category D losses, the plaintiff claims for the interest lost on the export duty paid by MNA on the palm oil products loaded and to be loaded on theBum Chin. This amounts to IDR 4,605,158.527 (US$ 11,809.31). Due to the incident, the palm oil products were not exported out of Indonesia on board theBum Chin. An application was made for the refund of export duty paid for the consignment of palm oil products. The application was approved but the refund was only made three months after the incident.104Foot Note 104×Chen Kit Peng’s AEIC at pp 11 andA debit note was raised on the plaintiff by MNA for the interest lost on account of the delayed refund of three months. This interest was calculated as follows: IDR 4,605,158.527 (being the quantum of export duty paid) x 10% per annum / 12 months x 3 months / 9749 (being the conversion rate between IDR and US$).105Foot Note 105×Chen Kit Peng’s AEIC at p 110 248 The plaintiff also provided documents evidencing the correspondences between the Indonesian authorities and MNA relating to claims for the refunding of the export duty.106Foot Note 106×Chen Kit Peng’s AEIC at pp 104–109At trial, Ms Chen admitted that the documents she relied on for the correspondences between the Indonesian authorities and MNA were untranslated and in Bahasa Indonesia.107Foot Note 107×Transcript 30 January 2018, p 29The plaintiff subsequently adduced the translated copies of these documents in their closing submissions on 9 May 2018.108Foot Note 108×PCS Annex C 249 I deal first with the translation of the correspondences. The translation is signed off by an individual, with no affirmation as to the truth and accuracy of the translation. Further, the translation is produced too late in the day after the trial, leaving the defendant no opportunity to challenge the documents. On the debit note, the defendant’s criticism that there is no proof that the plaintiff paid MNA is valid. In my view, the debit note, at its highest, merely proves that the plaintiff owes MNA the said sum but there is no evidence of payment by the plaintiff. This is surprising given that the debit note was raised on 10 July 2014 and the trial took place in 2018. 250 For the reasons stated, the claim for Category D losses is rejected.",
        "Substitute Vessel: Ping An": "251 As a result of the incident a substitute vessel was chartered to carry the cargo loaded onto and yet to be loaded onto theBum Chin. The voyage had to be abandoned given the damage to theBum Chin, and the damage had to repaired before theBum Chincould be put back to service.The Korean Class Surveyor’s Survey Report dated 19 April 2013 states the following:109Foot Note 109×1st AEIC of CO, p 27. Reviewing the condition of damage. Vessel is permitted to depart for the nearest repairing facility i.e. Singapore or Malaysiawithout any cargoonboard. And the following damaged parts are to be repair as soon as possible but not later than 30 May 2013. … [emphasis added] 252 This factual matrix gave rise to the Category E, F and G losses and I will now turn to the quantum of the claims. 253 As a first matter, the defendant objects to Category E, F and G losses as a matter of law. It cites two cases (VinmarInternational Ltd and another v Theresa Navigation SA[2001] 2 Lloyd’s Rep 1 andInRe Bonvoy 1[1999] SGHC 195), arguing that the only measure of loss claimable by the plaintiff is by the diminution in value of goods and not any other measures such as the loss of profit. The defendant seems to have misapplied the cases cited. The claims in both cases are based on breaches of contract of carriage whereas in the present case, the claims arise as a consequence of the defendant’s breach in negligence. Further, it does not appear that the cases cited go so far as to prescribe a limited measure of damages to the exclusion of all other heads of claim that arise directly or as a consequence of the other party’s wrongdoing.",
        "Category E: Freight Rate Difference": "254 I now turn to the freight rate difference claimed by the plaintiff under Category E losses as a result of having to charter a substitute vessel. The plaintiff claims for the amount of US$ 191,979.18 and this figure was arrived at because the freight difference between the substitute vessel and theBum Chinwas US$ 12 per mt and 15,998.265mt of cargo was shipped on thePing An. 255 There are freight pre-paid bills of lading issued by thePing Anfor the cargo on 4 May 2013 and the plaintiff is the named shipper.110Foot Note 110×PBAEIC (factual), pp 264–266.Raffles Shipping International raised an invoice dated 6 May 2013 to the plaintiff for the quantity of cargo shipped on thePing Anand freight rate for thePing An, amounting to US$ 191,979.18. The payment was to be settled by “T/T” in the US dollar without any deductions to Raffles Shipping International, with instructions to quote invoice no. D/N “VRSI 130501 FRT”.111Foot Note 111×PBAEIC (factual), p 269.Ms Chen, who testified on this invoice, did not confirm that payment was made to Raffles Shipping International. Neither has the plaintiff disclosed documents evidencing the remittance. As the defendant rightly submits, the plaintiff has not shown proof of payment to Raffles Shipping International. It is incomprehensible why the plaintiff has not adduced evidence of payment at trial. I find the plaintiff’s attempt to show payment in a roundabout way rather curious. The argument relies on the release of prepaid bills of lading to the plaintiff as shipper as evidence that freight was paid. Why is reliance placed on prepaid bills rather than a receipt of payment from Raffles Shipping International? Arguably, freight prepaid bills could have been released because Raffles Shipping International paid freight and the invoice was raised seeking reimbursement from the plaintiff. The plaintiff’s claim for Category E losses is not proved and is hence rejected.",
        "Category F: Additional cost of shipping ROL IV 64 in flexibags": "256 Ms Chen testifies that 1200mt of ROL IV 64 was sold by the plaintiff to AFIA International Co. of Saudi Arabia (“AFIA”). However, as a result of the incident, the plaintiff was unable to ship the 1,200mt of ROL IV 64 to AFIA in April 2013. As AFIA required the goods urgently and MNA only had 800mt of ROL IV 64 available, the plaintiff diverted 1,200mt from an earlier sale contract between the plaintiff and MNA to meet their contractual obligations with AFIA. This earlier sale contract, dated 5 April 2013, is for 1680mt of RBD Palm Olein in flexibags with the purchase price of US$840 per mt.112Foot Note 112×PBAEIC (factual), p 280.On the other hand, the purchase price of the ROL IV 64 in tank 4S on board theBum Chinwas US$755 per mt, basis in bulk. Although the sale contract dated 5 April 2013 makes reference to RBD Palm Olein, the plaintiff say that the price of ROL IV 64 is calculated adding a “mark-up” to the price of ROL. The price difference between US$840 per mt and US$755 per mt is US$85 per mt. While the plaintiff initially asserted that 1200mt of ROL IV 64 was sold to AFIA, the plaintiff admits that only 1,197mt of ROL IV 64 was actually loaded into flexibags and hence would be claiming for only 1,197mt of ROL IV 64.113Foot Note 113×PCS, para 540.The total claim amount is therefore US$101,745.00 (1,197mt of ROL IV 64 x US$ 85 per mt). 257 As the defendant rightly points out, to establish the loss of US$ 101,745.00, the plaintiff must first prove that it has paid for the sale contract dated 5 April 2013 and it has not done so. It is mind boggling that the plaintiff has not adduced evidence of payment at trial. I accordingly reject the plaintiff’s claim for Category F losses.",
        "Category G: Operational Costs": "258 I now move to the Category G losses where the plaintiff claims for operational costs of loading and unloading the cargoes, amounting to a total of US$ 35,603.05, incurred as a result of the incident. The operational expenses included the cost of pumping 1146.451mt of RPO, 1200.0055mt of ROL IV 64 and 2327.944mt of ROL on board the Bum Chin, heating cost for all the cargo scheduled to be loaded into theBum Chin, heating cost for ROL IV 64 during the water separation process when the ROL IV 64 was in the shore tank and the storage cost for the storage of the cargo loaded on board theBum Chin. 259 I find that the plaintiff has not provided sufficient proof of payment of the alleged operational costs incurred.  The only documentation provided before the court is a document issued by MNA tabling the breakdown of the operational costs.114Foot Note 114×PBAEIC (factual) at p 103; Transcript 30 January 2018, p 26; PCS, para 540.Ms Chen only testified that the costs of loading and discharging were charged to the plaintiff by MNA. No other proof of payment such as an invoice or debit note was adduced as evidence before this court. I find that the plaintiff has not proved that it has suffered loss and paid for the operational costs under Category G.",
        "Conclusion on heads of claim": "260 To conclude, the plaintiff has only succeeded in proving three out of seven categories of losses, amounting to US$206,706.98, the breakdown of which is as follows: (a) Category A: US$148,467.60 (b) Category B: US$21,215.21 (c) Category C: US$37,024.17",
        "Overall conclusion": "261 For the reasons stated, on the issue of liability, I find for the plaintiff. On quantum, the defendant is to pay the plaintiff the total sum of US$ 206,706.98 together with interest at the rate of 5.33% from the date of the writ to judgment. The defendant’s counterclaim is dismissed. As costs follow the event, the defendant is to pay the plaintiff costs of the action and counterclaim to be taxed if not agreed. Belinda Ang Saw EanJudge Mr Gurbani Prem Kumar and Ms Tan Hui Tsing (Gurbani & Co LLC) for the plaintiff;Mr Tay Twan Lip Philip and Ms Yip Li Ming (Rajah & Tann Singapore LLP) for the defendant."
    }
}