{
    "case_title": "MCH International Pte Ltd and others vYG Group Pte Ltd and others and other suits",
    "ncitation": "[2019] SGHC 43",
    "coram": "Valerie Thean J",
    "sections": {
        "Introduction": "1 These four suits arise out of a joint venture to acquire certain Chinese companies in the cold chain logistics business (“the Target Companies”). The Target Companies were owned by a Singapore registered company, Yong Gui Investment Pte Ltd (“YGIPL”). The plan of the two key players, Henry Wong Kok Hwee and Simon Liong Chung Yee, was to acquire YGIPL, and to deploy a core group of personnel experienced in cold chain logistics, led by Mr Wong, to exploit its business potential. YG Group Pte Ltd (“YGG”) was incorporated in Singapore on 27 January 2015 for this purpose.1Foot Note 1×Joint Bundle of Affidavits of Evidence-In-Chief (“JAEIC”), p 20.The two shareholders of YGG were YG Logistics Pte Ltd (“YGL”), a company whose majority shareholder is Mactron Holdings Pte Ltd (“Mactron”), an investment holding company in which Mr Liong is a shareholder and the sole director; and MCH International Pte Ltd (“MCH”), a company whose majority shareholder is Mr Wong. 2 In Suit No 104 of 2016, YGL first sued Mr Wong and MCH for an alleged failure to deploy certain personnel to YGG as promised. Subsequently in Suit No 337 of 2016, YGL sued MCH, Mr Wong and his wife in relation to a S$4,500,000 loan made to MCH. YGG then sued Mr Wong in Suit No 80 of 2017 for breach of his directors’ duties. Finally, Mr Wong brought Suit No 107 of 2017 alleging conspiracy and requesting the court to wind up YGG. These were the four suits that were tried together.",
        "Background": "3 The Target Companies were owned by Lim Chee Kian, Cai Yong Cheng and Koh Chaik Ming (“the Vendors”). Mr Wong was first introduced to the Vendors in 2013. In-depth discussions between Mr Wong and Mr Lim commenced in early 2014 to structure a trade sale.2Foot Note 2×JAEIC, pp 9–10.Pursuant to these discussions, the Vendors incorporated YGIPL, and transferred control of the Target Companies to YGIPL for the purposes of acquisition.3Foot Note 3×JAEIC, p 235. 4 Sometime in November 2014, Mr Wong presented a business plan to Mr Liong.4Foot Note 4×JAEIC, pp 91–92; Joint Agreed Bundle of Documents (“JAB”) Volume 1, pp 307–315.The plan proposed the setting up of a joint venture company to acquire the Target Companies. The “information pack” prepared by Mr Wong contained detailed profiles of Dennis Seen, Lou Lin and Maglin Chng, who were identified as “Industry Veterans and key specialists” in the cold chain logistics industry. Mr Wong proposed that he could, together with the three individuals introduced, form a core management team which would make the Target Companies more profitable.5Foot Note 5×JAEIC p 92–94; JAB Volume 1, pp 314, 316–317, 320–322.Mr Wong also introduced Mr Liong to Mas Iskandar, an individual whom Mr Wong described as having extensive experience in the logistics field and an ideal candidate to be a neutral director for the proposed joint venture.6Foot Note 6×JAEIC, p 218. 5 Mr Liong expressed interest, and parties negotiated between December 2014 and January 2015. Mr Wong required a loan of S$4,000,000 to be made to MCH, to enable MCH to have sufficient cash to put in its initial contribution to the joint venture. Mr Wong explained to Mr Liong that he needed cash as his assets were tied up at the time.7Foot Note 7×JAEIC p 97.Because this placed the financial risk of the venture wholly on Mr Liong, Mr Liong emphasised that in the circumstances he needed full confidence on the due diligence that was to be conducted on the Target Companies. Mr Wong reassured Mr Liong that he had 14 years of industry and mergers & acquisitions experience and the firms he had chosen to lead the financial and legal due diligence were “the best in the market”.8Foot Note 8×JAEIC, pp 231–233; JAB Volume 6, p 2802. 6 In a meeting on 19 January 2015, the parties recorded their agreement on several key terms:9Foot Note 9×JAEIC, pp 221–222; JAB Volume 1, pp 428–439. (a) The purchase price for the acquisition of the Target Companies would be US$11,000,000. (b) A joint venture company would be incorporated in Singapore for the purposes of acquiring the Target Companies. MCH would own 70% of the shares in the joint venture company, and YGL would own the remaining 30% of shares. (c) Mr Wong, would take the lead in “hiring and forming the Core Management Team” which would be “responsible for the overall management” of the joint venture company’s business and operations in China. The “Core Management Team” included Mr Wong, Mr Seen, Mr Lou, Ms Chng and an employee of Mactron, Michael Ang Chee Siong. Mr Seen, Mr Lou and Ms Chng would be hired by MCH and seconded to the joint venture company. Mr Ang would be hired directly by the joint venture company. (d) YGL would extend a loan of up to S$4,000,000 to MCH “to assist MCH for its portion of the purchase price”, and this would be secured by the guarantees of two directors of MCH, namely, Mr Wong and his wife, Madam Sing Lee Mee Yoke (“Mrs Wong”). The first disbursement of the loan would be in January 2015, in the amount of S$500,000. This was to help MCH cover the cost of,inter alia, legal and financial due diligence expenses, and the payment for the deployment cost of the core management team members. In the event that the financial due diligence was unsatisfactory, MCH would return the S$500,000. If the financial due diligence was satisfactory, the rest of the loan would be disbursed according to a specified disbursement schedule. 7 On 27 January 2015, YGG was incorporated and Mr Wong was appointed as the managing director. Mr Liong was appointed a director, and Mr Iskandar took on the role of a “neutral director” and chairman of the YGG board.10Foot Note 10×JAEIC, pp 102, 223–224. 8 Parties then entered into a series of written contracts to reflect their agreement, including: (a) A Shareholders Agreement dated 29 January 2015 between YGG, YGL and MCH.11Foot Note 11×JAB Volume 1, p 111. (b) A Subscription Agreement dated 29 January 2015 between YGG, YGL and MCH.12Foot Note 12×JAB Volume 1, p 155. (c) A Call Option Agreement dated 29 January 2015 between YGL and MCH.13Foot Note 13×JAB Volume 1, p 196. (d) A Deed of Undertakings dated 29 January 2015.14Foot Note 14×JAB Volume 1, p 270.The Deed of Undertakings contained,inter alia, an undertaking to “procure” Mr Seen, Mr Lou and Ms Chng to be hired by MCH and seconded to YGG.15Foot Note 15×JAB Volume 1, p 272. (e) A Loan Agreement dated 29 January 2015 between YGL and MCH.16Foot Note 16×JAB Volume 1, p 217.Clause 7.1 of the Loan Agreement stated that MCH would be obliged to return all outstanding loan amounts if YGL did not wish to proceed with the proposed acquisition of the Target Companies, upon completion of due diligence.17Foot Note 17×JAB Volume 1, p 226. (f) A Deed of Personal Guarantee dated 29 January 2015,18Foot Note 18×JAB Volume 1, p 248.by which Mr and Mrs Wong guaranteed the payment obligations of MCH under the Loan Agreement. 9 The scope of a last document required discussion between parties. This was a deed of share charge signed by YGL and MCH on 30 January 2015 and dated 19 August 2015 (“the Deed of Share Charge”).19Foot Note 19×JAB Volume 1, p 277.The Deed of Share Charge was registered with the Accounting and Corporate Regulatory Authority of Singapore (“ACRA”) on 1 September 2015.20Foot Note 20×JAEIC, p 115.The purpose of the Deed of Share Charge was to secure the loan granted by YGL to MCH with a charge over MCH’s shares in the joint venture company. Clause 3.8 of the Deed of Share Charge granted YGL the right to “exercise (in the name of [MCH] and without any further consent or authority on the part of [MCH]) any and all rights with respect to the [charged shares]”, including the voting rights of the charged shares.21Foot Note 21×JAB Volume 1, p 286.In an email dated 25 January 2015, Mr Wong requested that Mr Liong insert a clause into the Deed of Share Charge which would qualify clause 3.8 and only allow YGL to exercise voting rights in MCH’s shares in the “event of a default”.22Foot Note 22×JAB Volume 1, p 440.Mr Liong responded in an email dated 28 January 2015 (“the 28 January 2015 Email”), stating that even though MCH’s shares were pledged to YGL, he would not interfere with the operations or obstruct Mr Wong in discharging his duties.23Foot Note 23×JAB Volume 1, p 440.The effect of the 28 January 2015 Email is in contention in these suits. 10 These various contracts formalised the parties’ initial acquisition plan. The initial plan was to acquire the Target Companies with a purchase price of US$11,000,000 to be paid by YGG to the Vendors in three tranches, US$2,000,000, US$5,000,000 and US$4,000,000, with full control and transfer of shares on payment of the first tranche (“the Initial Acquisition Model”). In order to fund these payments, YGL and MCH would subscribe to shares in YGG in proportion to their stake in YGG,ie, 30% and 70% respectively, whenever a payment had to be made.24Foot Note 24×JAB Volume 1, p 166–167.This acquisition process was subject to satisfactory due diligence being conducted.25Foot Note 25×JAB Volume 1, p 162. 11 On 29 January 2015, Mr Wong emailed Mr Liong, Mr Iskandar and the core management team with a copy of the financial due diligence report (“First Due Diligence Report”) for up to October 2014, prepared by a company called Shanghai Certified Public Accountants (“SCPA”) in respect of the Target Companies. The original First Due Diligence Report was written in Mandarin, and Mr Wong forwarded a copy that was translated by SCPA into English.26Foot Note 26×JAEIC, p 229. 12 Mr Wong then proceeded to finalise the acquisition with the Vendors. Throughout the negotiation process, the negotiations were managed by Mr Wong. On the side of the Vendors, Mr Lim was the primary point of contact. The other two Vendors were not active in the negotiations.27Foot Note 27×Notes of Evidence (“NE”) Day 13, p 11. 13 As a condition for the transfer of full control as suggested by the Initial Acquisition Model, the Vendors required YGG to provide security in the form of banker’s guarantees for the second and third tranche amounts of US$5,000,000 and US$4,000,000.28Foot Note 28×JAEIC, p 235.MCH was, however, unable to provide banker’s guarantees for MCH’s portion of the second and third tranche payments. Parties therefore agreed on an amended plan (the “Revised Acquisition Model”). In the Revised Acquisition Model, no security was necessary. The Target Companies were to be purchased in two phases, with full control of the companies deferred to the second phase. The first tranche would be a payment of US$4,400,000 for 40% of the issued share capital in YGIPL with an option to purchase the remaining 60% for US$6,600,000 within 12 months. By 30 March 2015, Mr Wong and Mr Lim had reached in-principle agreement on key terms of the acquisition.29Foot Note 29×JAB Volume 1, p 571.A first draft of the Share Purchase Agreement between YGG and YGIPL was sent to Mr Wong on 28 April 2015.30Foot Note 30×JAEIC, p 237. 14 Around late April 2015, Mr Wong visited the Target Companies in Shanghai to examine the business.31Foot Note 31×JAEIC, p 248.In a WhatsApp conversation with Mr Iskandar, Mr Liong and Mr Ang, Mr Wong reported that the Target Companies were performing well and expressed great optimism.32Foot Note 32×JAB Volume 6, pp 2858–2859.On 28 June 2015, Mr Wong sent an email attaching a draft legal due diligence report (“First Legal Due Diligence Report”) to Mr Liong. In the email, Mr Wong informed Mr Liong that there were a few compliance issues, but these were either previously anticipated or not “major”.33Foot Note 33×JAB Volume 2, p 689.On 23 July 2015, Mr Wong arranged for a meeting in Shanghai in order to discuss the terms of the acquisition and the findings in the First Legal Due Diligence Report. The meeting was attended by Mr Wong, Mr Liong, Mr Seen, Mr Ang, Mr Lim, Mr Cai and the general manager of the Target Companies, Mao Li. Ms Mao was held in high regard by the Vendors and she was kept fully apprised of the acquisition process.34Foot Note 34×JAEIC, p 238.After the conclusion of the meeting, Mr Wong assured Mr Liong that the results of the legal due diligence were satisfactory.35Foot Note 35×JAEIC, p 238. 15 Sometime in July 2015, Mr Wong mentioned to Mr Liong that he had found a private equity investment firm, KV Asia Capital Pte Ltd (“KV Asia”) which had expressed interest in participating in the joint venture. While Mr Wong proposed to involve KV Asia in their deal, Mr Liong did not follow up on this proposal.36Foot Note 36×JAEIC, pp 112–113. 16 On 4 August 2015, Mr Liong received an email from Mr Wong attaching a document titled “Yong Gui Investment – Commission Letter 150730”. The document appeared to be a commission agreement between Mr Wong and the Vendors. Mr Wong sent a further email on 5 August 2015 at 1.12am that stated:37Foot Note 37×JAB Volume 2, p 821. Simon, I have deliberately forwarded you this to show you this document on commission. This was offered but I will not be accepting this as this is in conflict of interest. … Mr Liong replied on 8 August 2015 thanking Mr Wong for his openness and integrity.38Foot Note 38×JAB Vol 2, p 850. 17 Mr Liong and Mr Wong agreed that a further loan of S$500,000 would be made to MCH, in exchange for which YGL would have the opportunity to subscribe to an additional 5% of shares in YGG. In addition, MCH would also be allowed to draw down the full sum of the loan on 19 August 2015, in order to fund MCH’s contribution towards its share for the acquisition of the first 40% of YGIPL.39Foot Note 39×JAEIC, pp 113–114. 18 Arising from the change in the acquisition model and to the loan between YGL and MCH, amendments to the written contracts the parties had signed in January 2015 became necessary. Several amendment agreements were executed, including: (a) An Amendment Agreement (in respect of the Shareholders Agreement) dated 18 August 2015.40Foot Note 40×JAB Volume 1, p 149. (b) An Amendment Agreement (in respect of the Subscription Agreement) dated 18 August 2015.41Foot Note 41×JAB Volume 1, p 189. (c) An Amendment Agreement (in respect of the Call Option Agreement) dated 18 August 2015.42Foot Note 42×JAB Volume 1, p 211 (d) An Amendment Agreement (in respect of the Loan Agreement) dated 18 August 2015.43Foot Note 43×JAB Volume 1, p 241.The total loan amount was amended to be S$450,000. (e) A Side Deed (in respect of the Deed of Personal Guarantee) dated 18 August 2015.44Foot Note 44×JAB Volume 1, p 265. The Deed of Undertakings dated 29 January 2015 was not amended. 19 The Sale and Purchase Agreement (“SPA”) between YGG and the Vendors was executed on 19 August 2015.45Foot Note 45×JAB Volume 1, p 85.Under the SPA: (a) On 19 August 2015, YGG purchased 40% of YGIPL shares from the Vendors for US$4,400,000;46Foot Note 46×JAB Volume 1, p 92. (b) YGG was granted a Purchaser’s Call Option to purchase the remaining 60% of YGIPL shares from the Vendors at the price of US$6,600,000. YGG could exercise this option by issuing the Purchaser’s Exercise Notice to the Vendors by no later than 19 August 2016, failing which the Purchaser’s Call Option would lapse;47Foot Note 47×JAB Volume 1, p 99. (c) In the event that YGG did not successfully exercise the Purchaser’s Call Option, the Vendors were granted a Vendors’ Call Option to buy back the initial 40% of YGIPL shares purchased by YGG for US$3,960,000, a 10% discount on the purchase price paid by YGG;48Foot Note 48×JAB Volume 1, pp 100–101. (d) Under clauses 7.1, 7.7 and 7.8 of the SPA, YGG was granted certain benefits between the completion of the SPA and the exercise of the Purchaser’s Call Option (“the SPA benefits”) including the rights to:49Foot Note 49×JAB Volume 1, pp 97–98. (i) Nominate two persons to be appointed as directors of YGIPL; (ii) Nominate one person to be a signatory for YGIPL’s bank accounts for amounts in excess of RMB10,000; (iii) Nominate an Understudy to Ms Mao; and (iv) Have the wages and accommodation of the Understudy be paid for by YGIPL. 20 In a manner complementing the SPA, the subscription of shares in YGG by MCH and YGL was also designed to be effected in two tranches. The first tranche corresponded to the entry into the SPA and the second tranche corresponded to the exercise of the Purchaser’s Call Option. The total subscription payments received by YGG in each tranche matched the amount that was due to the Vendors in each tranche. In this way, YGG would have had enough cash to pay the Vendors for the shares in YGIPL. For the first tranche, MCH was obliged to subscribe to US$2,859,950 worth of shares, and for the second tranche, MCH was obliged to subscribe to US$4,290,000 worth of shares.50Foot Note 50×YG Group Pte Ltd Closing Submissions (“D1 CS”), p 10.The combined effect of the Loan Agreement (as amended on 18 August 2015) and the SPA was that the cash for YGG’s purchase of the first 40% of the YGIPL shares came entirely from YGL.51Foot Note 51×JAEIC, pp 122–123. 21 Without Mr Liong’s knowledge, on the same date the SPA was executed, Mr Wong also signed three further documents (which I shall refer to collectively as the “Secret Arrangements”): (a) A letter written by Mr Lim on behalf of the Vendors, which promised to Mr Wong a commission of US$380,000, for the referral of YGG to the acquisition deal (“the Commission Letter”). The commission was expressed to be paid in two tranches, the first being US$300,000 upon YGG’s purchase of 40% of the YGIPL shares, the second being US$80,000 upon YGG’s purchase of the balance of the YGIPL shares.52Foot Note 52×Exhibit YGG 1, p 1.(I shall refer to this arrangement as the “Secret Commission Agreement”); and (b) Two declarations of trust, one in favour of Mr Lim and the other in favour of Ms Mao. These declarations purported to create trusts over shares in MCH in favour of Mr Lim and Ms Mao.53Foot Note 53×Exhibit YGG 1, pp 4 and 9.(I shall refer to these as the “Secret Trust Deeds”). Mr Wong received US$300,000 pursuant to the Commission Letter approximately nine days later.54Foot Note 54×NE Day 4, pp 96–97. 22 On 25 August 2015, Mr Liong sent an email to Mr Wong and Mr Iskandar proposing to amend the Memorandum and Articles of Association of YGG to bring them in line with the Shareholders Agreement (as amended on 18 August 2015). No response was given; subsequent requests were also ignored.55Foot Note 55×JAEIC, p 123.On 28 August 2015, Mr Wong discovered that Mr Liong had amended the terms of the SPA at the last minute, such that in the event the Vendors exercised the Vendors’ Call Option, the purchase money would be paid to YGL instead of YGG. Mr Wong was deeply unhappy about this change, and Mr Wong and Mr Liong had an exchange on this issue via email.56Foot Note 56×JAEIC, p 126. 23 On 15 September 2015, Mr Wong requested that Mr Liong share the cost of the expenses incurred in the course of conducting due diligence on the Target Companies. Mr Liong initially replied on 23 September 2015 stating that the agreement in January was that the due diligence costs was to be borne entirely by Mr Wong. After an exchange of emails, Mr Liong checked his documentation on the matter and by 8 October 2015 accepted that the due diligence costs were to be shared.57Foot Note 57×JAB Volume 2, pp 972–976. 24 On 3 October 2015, Mr Wong sent an email with a Letter of Offer from KV Asia dated 2 October 2015 (“KV Asia Offer”) to Mr Liong.58Foot Note 58×JAB Volume 2, p 953.In the KV Asia Offer, KV Asia proposed to inject more capital into YGG, to allow YGG to purchase other companies in the logistics industry on top of YGIPL in exchange for shares in YGG. This would have resulted in a dilution of YGL’s shareholding in YGG.59Foot Note 59×JAB Volume 2, pp 960–961.The deal also involved two individuals by the name of Troy Shortell and Paraj Kakkar.60Foot Note 60×JAB Volume 2, pp 954.They were Mr Wong’s “acquisition advisors” and were directors in a consultancy company called Assurance Box Pte Ltd (“ABPL”).61Foot Note 61×JAEIC, pp 262–263; JAB Volume 1, pp 67–68. 25 Mr Wong strenuously tried to persuade Mr Liong to accept the offer, but Mr Liong was hesitant to do so.62Foot Note 62×JAEIC, pp 127–128.In Mr Liong’s view, the KV Asia Offer would have benefited individuals or entities close to Mr Wong (such as Mr Iskandar, all the members of the core management team except for Mr Ang, and Mr Wong’s acquisition advisors) at the expense of YGL. It involved a dilution of YGL’s share in YGG, while MCH and a company owned by Mr Shortell would enjoy share premiums. The core management team would benefit from additional management incentives, but Mr Ang was left out of any such incentives. Mr Iskandar would be made President Director of one of the other logistics companies while Mr Liong would lose his seat on the Board of Directors of YGG.63Foot Note 63×JAEIC, pp 128–129.In an email dated 20 October 2015 sent at 9.08pm, Mr Liong refused the KV Asia Offer. Within that email he listed several reasons why he felt the offer was a bad deal for YGL. He expressed the view that YGL was being short changed by the deal while MCH would enjoy “huge premiums”. Mr Liong stated that Mr Wong’s attempt to pressure him into signing the deal suggested that Mr Wong was “not look[ing] after [his] interest as [his] partner in [YGG]”.64Foot Note 64×JAB Volume 2, pp 981–982. 26 Mr Wong replied in an email sent on the same day at 11.26pm. He stated that Mr Liong’s “argument [was] very one sided”. He gave his reasons why the deal was a fair one for all parties and listed several instances where he felt Mr Liong had not acted as a good partner in their joint investment.65Foot Note 65×JAB Volume 2, p 998.After receiving this email and several related WhatsApp messages in a similar vein from Mr Wong, Mr Liong was concerned that Mr Wong was going to abandon the joint venture, make a deal with KV Asia without him and take away the core management team that was promised to YGG.66Foot Note 66×JAEIC, p 131. 27 In an attempt to resolve the situation, Mr Ang and Mr Iskandar jointly came up with a modified version of the KV Asia Offer. The intent was to create a deal that would satisfy both Mr Wong and Mr Liong. This was presented by Mr Ang and Mr Iskandar to Mr Wong at a meeting on 25 October 2015.67Foot Note 67×JAB Volume 2, p 1003; JAEIC , p 426.However, during the meeting, Mr Wong instead confirmed that he was no longer intent on pursuing the KV Asia Offer and the acquisition of YGIPL would proceed as planned.68Foot Note 68×JAEIC, p 132. 28 On 6 November 2015, Mr Liong sent an email reminding Mr Wong that the parties had planned to exercise the Purchaser’s Call Option around September and October 2015, and this date was later pushed to December 2015. Mr Liong expressed the desire to not have the exercise of the Purchaser’s Call Option pushed back any further. He also reminded Mr Wong that they had envisioned that Mr Ang, Mr Seen and Mr Lou would be involved in YGG’s operations shortly after the signing of the SPA, but this had yet to be done.69Foot Note 69×JAB Volume 2, p 1015.Mr Wong did not want to exercise the Purchaser’s Call Option by December, stating in a WhatsApp group conversation between Mr Wong, Mr Liong, Mr Iskandar and Mr Ang on 19 November 2015 that “[u]nless asset tagging is done, unless I am comfortable of the business, we should not exercise”.70Foot Note 70×JAB Volume 6, p 2906. 29 On 15 December 2015, Mr Ang started travelling across various cities in China to conduct the asset tagging of the Target Companies. Mr Ang completed the asset tagging exercise on 22 December 2015.71Foot Note 71×JAEIC, pp 457–468; JAB Volume 2, p 688. 30 In an email sent on 21 December 2015, Mr Liong urged Mr Wong to procure the core management team to work in YGG and to refrain from pushing back the exercise of the Purchaser’s Call Option.72Foot Note 72×JAB Volume 2, p 1039.Mr Wong replied on the same day. In his reply, Mr Wong refused Mr Liong’s request to have the core management team work in YGG, stating: “this is the holiday period and as per my note to you before my staff has already went for a break but we were in constant communication with [YGIPL] on the many things such as procurement of assets, scraping of trucks, leasing terms and now asset tagging”. Mr Wong also gave two additional reasons (aside from asset tagging) to explain why he refused to allow the exercise the Purchaser’s Call Option. First, the dispute over the KV Asia Offer, as well the dispute relating to the payment of due diligence costs (see [23] above) had cost YGG time, and led to a delay in the process of preparing for the exercise of the Purchaser’s Call Option. Second, Mr Wong explained that “so long as we do not have full clarify [sic] on the final year’s number, we cannot exercise the option to buy the 60%”.73Foot Note 73×JAB Volume 2, p 1038. 31 Mr Liong was not impressed with these reasons. He sent an email on 26 January 2016 giving Mr Wong a deadline of 29 January 2016 to second the core management team to YGG.74Foot Note 74×JAB Volume 2, p 1126.The parties could not resolve their dispute and on 3 February 2016, YGL commenced Suit 104/2016 against MCH and Mr Wong for various breaches under the Deed of Undertakings, primarily for the failure to hire and second the core management team to YGG. 32 On 16 February 2016, YGG held a board meeting attended by Mr Iskandar, Mr Wong, Mr Liong and Mr Ang. In the meeting, Mr Wong put forward his position that YGG would not exercise the Purchaser’s Call Option until a second financial due diligence exercise (“Second Due Diligence”), commenced by the same auditors who led the first financial due diligence exercise, was completed. The Second Due Diligence could only commence after 15 March 2016, as the particular auditors that Mr Wong wanted to lead the due diligence exercise was not available till that date. Mr Liong objected to a delay in the due diligence exercise and expressed the view that the Purchaser’s Call Option had to be exercised as soon as possible. Mr Wong’s rebuttal was that it was his duty as the Managing Director of YGG to ensure that proper due diligence was done before exercising the option. Mr Wong noted several concerns found in the YGIPL’s financial reports that he felt needed to be addressed before the exercise of the option.75Foot Note 75×JAB Volume 3, pp 1213–1215. 33 In late February 2016, without Mr Liong’s knowledge, Mr Shortell and Mr Kakkar approached a company by the name of Yang Kee Logistics Pte Ltd (“YKL”), to solicit for the potential acquisition of YGIPL.76Foot Note 76×JAEIC, p 512. 34 In the meantime, Mr Liong did not agree with Mr Wong’s reasons for the refusal to exercise the Purchaser’s Call Option and suspected that it was a further attempt to stymie the acquisition process. He was concerned that if the Purchaser’s Call Option lapsed, the Vendors would buy back the 40% of YGIPL at a 10% discount, causing loss to YGG. He was also worried that given that Mr Seen had yet to be deployed to Shanghai, there would be insufficient time left for YGG to learn and take over the business of the Target Companies. Mr Liong resolved to take control of the situation. He emailed his desire to have YGG be immediately involved in the operations of the Target Companies, by having Mr Ang be deployed to China in Mr Seen’s intended role, since Mr Seen had yet to be seconded to YGG.77Foot Note 77×JAEIC, pp 291–292.However, Mr Wong rejected this suggestion. Mr Wong and Mr Liong also sparred over whether the Second Due Diligence needed to be conducted before YGG exercised the Purchasers’ Call Option.78Foot Note 78×JAEIC, pp 293–297. 35 On 18 March 2016, YGL purported to exercise its rights under clause 3.8 of the Deed of Share Charge to appoint Mr Bernard Tan Keng Beng (“Mr Tan”), an employee of Mactron, as the proxy for MCH.79Foot Note 79×JAB Volume 3, p 1313.On 22 March 2016, YGG held an extraordinary general meeting (“EGM”). Mr Wong and Mr Iskandar were invited to the EGM, but the parties had a dispute over whether Mr Seen should have been allowed into the EGM. Mr Wong wanted to appoint Mr Seen as the proxy for MCH, but Mr Liong insisted that Mr Tan had already been appointed in that capacity, and hence there was no reason for Mr Seen to attend.80Foot Note 80×JAB Volume 3, p 1278.The parties were unable to resolve their dispute and Mr Wong and Mr Iskandar left the EGM. From this point onwards, Mr Tan was the party who voted on behalf of MCH in the general meetings of YGG. 36 Mr Iskandar and Mr Wong refused to accept the legitimacy of the EGM of 22 March 2016, as well as the appointment of Mr Tan as the corporate representative of MCH. On 29 March 2016, Mr Iskandar and Mr Wong held an EGM without Mr Liong or any representative from YGL, claiming that the EGM on 22 March 2016 was “adjourned” and the EGM of 29 March 2016 was the “reconvened” version of the EGM.81Foot Note 81×JAB Volume 3, pp 1357–1361. 37 On 6 April 2016, YGL commenced Suit 337/2016 against MCH for allegedly defaulting on the Amended Loan Agreement. Mr and Mrs Wong were joined as defendants because of the personal guarantees they had provided for the loan in the Amended Loan Agreement. 38 On 15 April 2016, Mr Iskandar was removed as a director of YGG and replaced by Mr Ang.82Foot Note 82×JAB Volume 3, p 1449.On 19 April 2016, Mr Tan was appointed as a director.83Foot Note 83×JAB Volume 3, p 1457.Mr Wong and Mr Iskandar protested these actions, and filed a complaint to ACRA in relation to the removals and appointments.84Foot Note 84×Plaintiff’s Bundle of Additional Documents (“PBAD”), pp 95 and 99. 39 After Mr Iskandar’s removal as director of YGG, Mr Wong continued to copy Mr Iskandar in the email correspondences between Mr Wong and Mr Liong relating to YGG, despite being repeatedly warned by Mr Liong that he was in breach of the confidentiality clauses in their contracts. Mr Wong’s reply was that he was entitled to keep Mr Iskandar in the loop. In his view, Mr Iskandar was not validly removed, and remained a director of YGG.85Foot Note 85×JAB Volume 3, pp 1509–1513 and 1580. 40 On 14 April 2016, the Second Due Diligence was completed and the due diligence report was circulated by Ms Mao.86Foot Note 86×JAB Volume 3, p 1388.On 27 May 2016, Mr Wong claimed that based on the report, there were outstanding due diligence issues that justified a delay in exercising the Purchasers’ Call Option.87Foot Note 87×JAB Volume 4, p 2245. 41 While this was ongoing, Mr Wong secretly met with representatives of YKL to negotiate the sale of shares of YGIPL to YKL.88Foot Note 88×JAEIC, p 513.During the negotiations, Mr Wong attempted to procure a separate monetary benefit from YKL to himself, if YKL managed to purchase YGIPL.89Foot Note 89×JAB Volume 6, p 3192.The negotiations were conducted primarily between Ken Koh Kien Chon (“Mr Ken Koh”), Group CEO of YKL, on behalf of YKL, and Mr Wong with Mr Shortell acting as an intermediary. On 5 June 2016, YKL sent an offer via email for the purchase of 100% of YGIPL at the price of US$17,500,000 (“the first YKL Offer”).90Foot Note 90×JAB Volume 3, p 1620.On 6 June 2016, Mr Wong requested a Letter of Intent from Mr Ken Koh. However, on 8 July 2016, Mr Ken Koh backed out of the acquisition because his repeated requests to meet Mr Cai were ignored and also because he was uncomfortable with the lack of clarity in the shareholding structure of the Target Companies.91Foot Note 91×JAEIC pp 519–522Mr Shortell urged Mr Ken Koh to reconsider his withdrawal.92Foot Note 92×JAEIC, pp 522.In response, on 14 July 2016, YKL sent a signed Letter of Intent for the purchase of 100% of YGIPL at the price of US$15,500,000 (“the second YKL Offer”).93Foot Note 93×JAB Volume 3, pp 1706–1712.Mr Liong alleges that neither of the YKL Offers were disclosed to him. The second YKL Offer was not accepted. 42 On 28 July 2016, MCH stopped paying interest due on the loan from 28 July 2016, on the grounds that YGL had “disrupted the business of [MCH] and has engineered [MCH]’s default on interest payment”.94Foot Note 94×JAEIC, p 44. 43 Sometime in July 2016, YGG commissioned a fresh legal due diligence (“Second Legal Due Diligence”) on the Target Companies in preparation for the exercise of the Purchaser’s Call Option. This was because Mr Wong refused to give Mr Liong, Mr Ang and Mr Tan access to the final copy of the legal due diligence report that had been conducted previously (see [14] above).95Foot Note 95×JAEIC, p 334. 44 On 18 August 2016, YGG exercised the Purchaser’s Call Option and purchased the remaining 60% of YGIPL shares from the Vendors. The cash from this acquisition came entirely from YGL. Prior to the exercise and in order to ensure a smooth transition, YGG convinced Ms Mao to stay involved in the Target Companies for an additional three months till November 2016, at a monthly compensation of RMB120,000.96Foot Note 96×JAEIC, pp 335–354.On 29 August 2016, Mr Wong’s appointment as Managing Director of YGG was revoked.97Foot Note 97×JAB Volume 4 2073. 45 On 31 January 2017, YGG commenced Suit 80/2017, alleging breach of fiduciary duties on the part of Mr Wong. On 7 February 2017, MCH, Mr Wong and Mrs Wong commenced Suit 107/2017, alleging that YGG, YGL, Mr Liong, Mr Tan and Mr Ang had engaged in a tortious conspiracy against them, asking for the winding up of YGG.",
        "Parties’ positions and issues": "",
        "Overview of the four suits": "46 In Suit 104, YGL sues Mr Wong, MCH and YGG, arguing that MCH and Mr Wong are liable for breaches under the Deed of Undertakings for failing to hire and second Mr Seen, Mr Lou and Ms Chng to YGG after the acquisition of 40% of YGIPL.98Foot Note 98×Statement of Claim in Suit 104 (Amendment No. 3), pp 9–10. 47 In Suit 337, brought by YGL to enforce the loan against MCH, and with Mr and Mrs Wong joined as its guarantors, YGL relies upon the same alleged breach of the Deed of Undertakings as an “Event of Default” under clause 12.1 of the Amended Loan Agreement. YGL also cites the commencement of Suit 104, as a further Event of Default because it had a “material financial effect” on MCH.99Foot Note 99×Statement of Claim in Suit 337 (Amendment No. 3), pp 13–14.For good measure, Mr Soh, counsel for YGL, Mr Liong, Mr Tan and Mr Ang, relies additionally on 6 other Events of Default under clause 12.1 of the Amended Loan Agreement, being: (a) A breach of clause 3.8 of the Deed of Share Charge, by MCH’s refusal to recognise Mr Tan as the duly appointed corporate representative of MCH.100Foot Note 100×Statement of Claim in Suit 337 (Amendment No. 3), pp 14–16. (b) A breach of the Shareholders’ Agreement, by (i)  holding an EGM on 29 March 2016 without the requisite quorum;101Foot Note 101×Statement of Claim in Suit 337 (Amendment No. 3), p 16. (ii)  refusing to amend YGG”s Articles of Association to bring them in line with the Shareholders Agreement;102Foot Note 102×Statement of Claim in Suit 337 (Amendment No. 3), p 18. (iii) refusing to accept the vote cast by Mr Liong to adopt a resolution appointing Mr Tan as director of YGG;103Foot Note 103×Reply and Defence to Counterclaim in Suit 337 (Amendment No. 3), p 9.and (iv) divulging confidential information pertaining to YGG to Mr Iskandar after Mr Iskandar was removed as director of YGG;104Foot Note 104×Reply and Defence to Counterclaim in Suit 337 (Amendment No. 3), pp 9–10.and (c) A failure to pay interest due and payable on the loan from YGL.105Foot Note 105×Statement of Claim in Suit 337 (Amendment No. 3), pp 19–20. 48 MCH, Mr and Mrs Wong, contend that: (a) There was no breach of the Deed of Undertakings as the obligations in the Deed of Undertakings would only take effect once YGG had “full management control” of YGIPL’s operations, and as at the date of filing of Suit 104, YGG did not exercise such control.106Foot Note 106×1st and 2nd Defendants’ Defence in Suit 104 (Amendment No. 3), pp 3–4.Alternatively, Mr Wong did use his “best efforts” to carry out the tasks laid out in the Deed of Undertakings.107Foot Note 107×1st and 2nd Defendants’ Defence in Suit 104 (Amendment No. 3), p 5. (b) The commencement of Suit 104 could not be considered an Event of Default within the meaning of clause 12 of the Amended Loan Agreement as the suit itself was commenced by YGL in bad faith.108Foot Note 108×Defence and Counterclaim in Suit 337 (Amendment No. 4), p 5. (c) Clause 3.8 of the Deed of Share Charge could not be relied upon as Mr Liong’s 28 January 2015 Email contained either a collateral contract or formed the basis of a promissory estoppel which would prevent YGL from exercising clause 3.8 of the Deed of Share Charge.109Foot Note 109×Defence and Counterclaim in Suit 337 (Amendment No. 4), pp 8–10. (d) There was no breach of the Shareholders’ Agreement as (i) the EGM on 22 March 2016 was validly adjourned to 29 March 2016 by Mr Iskandar;110Foot Note 110×Defence and Counterclaim in Suit 337 (Amendment No. 4), p 10. (ii) the amendment to YGG’s Articles of Association sought by Mr Liong ran contrary to the promises made by Mr Liong to Mr Wong to allow Mr Wong to be “the captain of the ship” and there was no obligation for MCH to amend YGG’s Articles of Association;111Foot Note 111×Defence and Counterclaim in Suit 337 (Amendment No. 4), p 11; PWS, pp 29–31.and (iii) MCH did not breach the Shareholders’ Agreement when it failed to accept Mr Tan’s appointment as director of YGG and when it continued to send confidential YGG information to Mr Iskandar, as YGL was estopped from relying on clause 3.8 of the Deed of Share charge to effect the appointment of the former and the removal of the latter.112Foot Note 112×Defence and Counterclaim in Suit 337 (Amendment No. 4), p 10. 49 MCH, Mr and Mrs Wong also argue that there was no breach of the Loan Agreement on the basis of a failure to pay any interest sums, as MCH had not defaulted on any interest sums payable under the Loan Agreement leading up to the filing of Suit 104. By the time of trial, it was not disputed that the loan had reached its maturity date for repayment, being 31 August 2018. 50 A counterclaim brought in Suit 377 by MCH, Mr Wong and Mrs Wong, alleges lawful and unlawful conspiracy on the part of YGL and Mr Liong. Their counsel, Mr Wijaya, argues that the usurpation of board control during the EGM of 22 March 2016 and the filing of Suits 104 and 337 constituted a lawful means conspiracy or alternatively, an unlawful means conspiracy against MCH, Mr Wong and Mr Wong.113Foot Note 113×Defence and Counterclaim in Suit 337 (Amendment No. 4), pp 13–14.In reply, Mr Soh submits that there is no evidence of an unlawful act, nor a predominant intention on the part of YGL, Mr Liong, Mr Tan and Mr Ang to cause damage or injury to MCH, Mr Wong or Mrs Wong.114Foot Note 114×Reply and Defence to Counterclaim in Suit 337 (Amendment No. 3), pp 12–13. 51 In Suit 80, YGG sues Mr Wong for breach of directors’ duties owed to YGG by: (a) Delaying and failing to lead the exercise of the Purchaser’s Call Option;115Foot Note 115×Statement of Claim in Suit 80 (Amendment No. 1), p 15. (b) Failing to disclose that MCH had no money to subscribe for the second tranche of shares in YGG;116Foot Note 116×Statement of Claim in Suit 80 (Amendment No. 1), p 23. (c) Failing to ensure that YGG capitalised on the SPA benefits;117Foot Note 117×Statement of Claim in Suit 80 (Amendment No. 1), pp 15–16. (d) Failing to hire and second Mr Seen, Mr Lin and Ms Chng to YGG;118Foot Note 118×Statement of Claim in Suit 80 (Amendment No. 1), p 20. (e) Failing to disclose the YKL Offers;119Foot Note 119×Statement of Claim in Suit 80 (Amendment No. 1), pp 26–27.and (f) Failing to disclose the Secret Commission Agreement and the Secret Trust Deeds.120Foot Note 120×Statement of Claim in Suit 80 (Amendment No. 1), pp 24–25. 52 Counsel for YGG, Mr Lobo, also argues that Mr Wong breached the Deed of Undertakings and was liable to YGG, a party to the deed.121Foot Note 121×Statement of Claim in Suit 80 (Amendment No. 1), pp 19–20.YGG is named as a defendant in Suit 104.122Foot Note 122×Statement of Claim in Suit 104 (Amendment No. 3), p 1. 53 These breaches of directors’ duties are denied by Mr Wong. Mr Wong brought a counterclaim in Suit 80, which was struck out by an Assistant Registrar on 19 June 2017, on the footing that Mr Wong’s claims were either legally unsustainable, subject to arbitration or to be dealt with in Suit 107.123Foot Note 123×Bundle of Cause Papers Volume 1, pp 305–307. 54 In Suit 107, the conspiracy claims made in the counterclaim in Suit 337 are repeated, together with a prayer for a winding up of YGG on the just and equitable ground pursuant to s 254(1)(i) of the Companies Act (Cap 50, 2006 Rev Ed) (“Companies Act”).124Foot Note 124×Statement of Claim in Suit 107 (Amendment No. 1), pp 22–28.MCH, Mr Wong and Mrs Wong had previously sought leave to amend the Statement of Claim in Suit 107 to introduce a minority oppression claim under s 216 of the Companies Act. Leave was denied by Assistant Registrar Tan Teck Ping Karen on 31 May 2017 because the claim was not supported by the facts pleaded (seeMCH International Pte Ltd and others v YG Group Pte Ltd and others[2017] SGHCR 8 at [41]–[47]). 55 The defendants in Suit 107 deny any conspiracy and argue that the circumstances do not warrant the grant of the winding up relief sought.125Foot Note 125×Defence of the 2nd to 5th Defendants in Suit 107 (Amendment No. 2), pp 26–27 and 37–42.Mr Lobo also highlights that the acts of conspiracy alleged by MCH, Mr Wong and Mrs Wong do not involve YGG at all.126Foot Note 126×Defence of the 1st Defendant in Suit 107 (Amendment No. 2) pp 16–24.In addition, there is a buyout mechanism for either shareholder to exit found in clause 13 of the Shareholders Agreement. The application of clause 13 in this respect is the subject of arbitration proceedings that have been stayed pending the resolution of the present suits.127Foot Note 127×Defence of the 2nd to 5th Defendants in Suit 107 (Amendment No. 2), pp 37–38.",
        "Core issues": "56 These four Suits have overlapping issues and interlinked prayers for relief. The core issues are the following: (a) Suit 104 has as its core issue the interpretation of the Deed of Undertakings; first, whether Mr Wong, in failing to secure the assistance of the core management team for YGG, breached the Deed of Undertakings; and second, whether MCH is jointly responsible for this breach. (b) Suit 337 is concerned with whether any of the incidents highlighted by Mr Soh (see [47] above) constitute Events of Default within meaning of clause 12 of the Loan Agreement such that the loan became immediately payable. Issue (a) is thus relevant here as well, since Mr Soh’s case is that a breach of the Deed of Undertakings is an Event of Default. (c) The counterclaim in Suit 337 has as its central factual issue whether there was either a lawful or unlawful conspiracy on the part of YGL and Mr Liong. (d) Suit 80 has as its core a factual query on whether Mr Wong had breached his directors’ duties owed to YGG. These include the alleged breach in issue (a), along with other contended breaches. (e) Issues (c) and (d) are relevant to the resolution of Suit 107, which poses an additional query as to whether YGG is party to the contended conspiracy, and the larger query as to whether the circumstances merit YGG being wound up on the just and equitable ground. 57 Whether each cause of action is made out, and the remedies applicable, follow from these core issues. I deal with the result in each case in the context of my findings on these core issues.",
        "The Deed of Undertakings": "58 The key issue in Suit 104 is whether Mr Wong and/or MCH have breached the Deed of Undertakings. The proper interpretation of the Deed of Undertakings is important to determine whether there has been breach and if so, who should be responsible. The broad principles which guide the court in the interpretation of contracts are well summarised by the Court of Appeal inYap Son OnvDing Pei Zhen[2017] 1 SLR 219 at [30] as follows: In gist, the purpose of interpretation is to give effect to the objectively ascertained expressed intentions of the contracting parties as it emerges from the contextual meaning of the relevant contractual language. Embedded within this statement are certain key principles: (a) first, in general both the text and context must be considered … (b) second, it is theobjectively ascertainedintentions of the partiesthat is relevant, not their subjective intentions … (c) third, the object of interpretation is the verbal expressions used by the parties and so,the text of their agreement is of first importance…",
        "Whether Mr Wong has breached the Deed of Undertakings": "59 It is not disputed that Mr Seen, Mr Lin and Ms Chng were not at any time employed by MCH and seconded to YGG as originally planned. Clauses 1(b)–(d) of the Deed of Undertakings read:128Foot Note 128×JAB Volume 1, p 272. 1. UNDERTAKINGS [Mr Wong] hereby undertakes to each of [YGL] and [YGG] to use his best efforts to: b) hire and establish the core management team (the “Core Management Team”) which will be responsible for the overall management of the business of the Company and business and operations of the [Target Companies] ([YGG] and the [Target Companies] shall together be referred to as the “Group”) c)  procure the Core Management Team to be consisting of: i. [Mr Wong] as the chief executive officer … ii. [Mr Seen] … serving as the chief operations officer to manage the business of the Group … iii. [Mr Lou] … to serve as the chief financial officer to manage the businesses of the Group … iv.  [Ms Chng] … to be responsible for, among other things, the customer service and account management of the Group … v. [Mr Ang] … to be responsible for, among other things, the project management and new investments of the Group … d) procure each of [Mr Seen], [Mr Lou] and [Ms Chng] be hired by MCH and seconded to [YGG] to manage the businesses of the Group for a period of three (3) years from thecompletion of the Acquisition(the “Secondment Period”); [emphasis in original in bold, emphasis added in bold italics]  60 At this juncture, I pause to highlight Mr Soh’s argument that even after YGG had fully acquired all the shares in YGIPL on 18 August 2016, the core management team was not hired by MCH and seconded to YGG.129Foot Note 129×D2 RS, p 7.Suit 104, however, was filed on 3 February 2016, prior to the exercise of the Purchaser’s Call Option, and this is the determinative date. The proper focus of the inquiry should be whether, as at 3 February 2016, Mr Wong was in breach of the Deed of Undertakings. The important question was, therefore, when the obligation to second the core management teamarose,and whether it had crystallised by 3 February 2016. 61 I start with the observation that the term “completion of the Acquisition” is not defined in the Deed of Undertakings. This is becausethe contextin which the document was signedwas that there would be full acquisition of the Target Companies on the first disbursement of funds. Thus in recital (B) of the Deed of Undertakings, the word “Acquisition” is defined as the point when “[YGL] cooperated with [MCH] (which is controlled by [Mr Wong]) and established [YGG] to acquire the interest in [the Target Companies] in cold chain logistic businesses … ”.130Foot Note 130×JAB Volume 1, p 271.The Deed of Undertakings was not amended just prior to the execution of the SPA, in contrast to the other contractual documents. How was this document to be read in the light of the change of context? 62 Mr Wijaya originally appeared to take the position that no obligations under the Deed of Undertakings existed after the change in acquisition model, because the change in the Initial Acquisition Model rendered the Deed of Undertakings unenforceable from the moment the acquisition model was amended. He clarified in his closing arguments that his argument was that the obligations were “not yetenforceable”: that is, that “[t]he Deed of Undertakings envisioned a state of affairs where YGG had full management control of YGIPL in order for [Mr Wong] to then deploy the Core Management Team to take over the management of YGIPL” [emphasis in original].131Foot Note 131×Plaintiff’s Skeletal Submissions, p 4.Thus, Mr Wong’s defence on this point rests on the premise that his obligation to procure the hiring and secondment of the core management team under the Deed of Undertakings would only arise after YGG had fully acquired all the shares in YGIPL. Mr Lobo and Mr Soh’s case, on the other hand, rests on the assertion that the obligation arose at the point where the 40% stake in YGIPL was acquired. Therefore, after closing submissions, the two competing interpretations for the phrase “completion of the Acquisition” were: (a) The time when YGG first acquired the 40% interest in the Target Companies; or (b) The time when YGG acquired the full ownership interest in the Target Companies. 63 I hold, for the reasons below, that interpretation (a) better reflects the objective intention of the parties, because of the other contractual documents signed at the time of the acquisition of the 40% interest, and parties’ conduct. 64 I turn to the issue of the surrounding documents. I deal first with the Loan Agreement, amended on 18 August 2015. In the Amendment Agreement (in respect of the Loan Agreement), the definition of “Transaction Documents” in the original Loan Agreement was deleted in its entirety and substituted with a new list of “Transaction Documents”. The new list included at (h), the Deed of Undertakings.132Foot Note 132×JAB Volume 1, p 244.This inclusion suggests that, as at 18 August 2015, the parties intended the Deed of Undertakings to form part of the series of transaction documents that would give effect to their concrete plans for the acquisition of YGIPL. 65 A second relevant document is the SPA, signed the next day on 19 August 2015, which defines “Completion” as completion of the sale and purchase of the “Sale Shares”.133Foot Note 133×JAB Volume 1, p 88.“Sale Shares” is furthered defined as the shares comprising 40% of the total issued share capital of YGIPL.134Foot Note 134×JAB Volume 1, p 91.Clause 7 of the SPA states:135Foot Note 135×JAB Volume 1, p 97. POST-COMPLETION RIGHTS AND OBLIGATIONS 7.1 As soon as practicable upon Completion, the Vendors shall procure the following:- (a) [YGIPL] to: (i) cause two (2) persons nominated by [YGG] and three (3) persons nominated by the Vendors to be appointed as directors of [YGIPL]; and (ii) cause one (1) person nominated by the Purchaser to be signatory for the Company’s bank accounts for amounts in excess of CNY10,000 … 7.7 The Parties agree that [YGG] will cause a person nominated by [YGG] to be appointed as an understudy to [Ms Mao] (“Understudy”) for the duration of the Purchaser’s Call Option Period, whose wages shall be paid by [YGG]. … 66 From this it follows that the SPA defined completion as the 40% acquisition mark and this definition was intended to apply to the Deed of Undertakings as well. This intention is evident from the symmetry in the provisions highlighted in the SPA and clauses 1(b)–(d) of the Deed of Undertakings. The SPA suggests that certain nominees of YGG would be granted a role in YGIPL after the purchase of 40% of the YGIPL shares. The Deed of Undertakings, if interpreted in the manner suggested by Mr Lobo and Mr Soh, would facilitate the operation of these provisions, because the core management team would be hired by MCH upon “Completion” as defined in the SPA. The core management team would then be seconded to YGG, whereupon they could be nominated to fill the roles in YGIPL as delineated in the SPA. If, on the other hand, the Deed of Undertakings were to be interpreted in the manner suggested by Mr Wijaya, it would be difficult to imagine how YGG would be able to find appropriate nominees for the roles delineated in the SPA without any employees to send to YGIPL. Further, clause 7.7 of the SPA suggests that the parties contemplated that such nominees would be employees of YGG, since it expressly states that the wages of the understudy would be paid by YGG. Hence, the interpretation put forward by Mr Lobo and Mr Soh appears to be more consistent with the plans envisioned by the parties, as seen in light of the other contracting documents that were signed on 18–19 August 2015. 67 The contemporaneous conduct of all parties also confirms the interpretation put forward by Mr Lobo and Mr Soh. Three strands of evidence are of particular relevance. 68 First, the negotiations over the terms of the SPA demonstrate that Mr Wong was operating on the premise that the core management team would be seconded to YGG by the time the 40% stake in YGIPL was purchased. Mr Wong was the main point of contact YGG’s side during the negotiations over the SPA, and it was clear that Mr Wong had expressly negotiated for YGG to have the benefit of the roles set out in clause 7. In an email dated 3 March 2015 sent by Mr Wong to Mr Lim, he asked that upon the purchase of the 40% stake in YGIPL:136Foot Note 136×JAB Volume 1, p 559. (a) YGG be provided “1 signatory to counter sign all payment from [YGIPL] … 1 FC (who will be a local PRC andreport directly to [YGG]) will be stationed in [YGIPL] office full time to work hand in hand with your CFO for alignment purpose” [emphasis added]. Mr Wong confirmed in cross examination that he envisioned that Mr Lou would fulfil this role.137Foot Note 137×NE Day 1, pp 131–132 and 134. (b) YGG be given the opportunity to “secondour Ops headto [YGIPL] as an observer / advisor during this period” [emphasis added]. Mr Wong confirmed in cross examination that he envisioned that Mr Seen would fulfil this role.138Foot Note 138×NE Day 1, pp 132, 134–135. 69 If the parties only intended for Mr Seen and Mr Lou to be hired by MCH and seconded to YGG upon the acquisition of full ownership in YGIPL, the negotiations for a role specially marked for Mr Seen and Mr Lou in the period before this full acquisition would make no sense. In addition, the italicised portions of the 3 March 2015 email suggest that Mr Wong expected that Mr Seen and Mr Lou would be reporting to YGG and/or MCH by the time of the purchase of the 40% stake in YGIPL. 70 Mr Liong’s explanation for the failure to amend the Deed of Undertakings despite the amendment of the other contractual documents also gels with the context. Mr Liong sent an email on 21 September 2015 to Henry Wong at 11.37pm which discussed,inter alia, the amendment of the contracts on 18 August 2015. Paragraph 6 of that email stated:139Foot Note 139×JAB Volume 2, p 950.  6.For Undertaking of G&A:Back in August, we have amended all the 7 signed Agreements, except for the Deed of Undertaking, to reflect the changes from the previous 2m/5m/4m payment mode to the current 40%/60% mode. The reason why I didn’t propose to make amendments to the Deed of Undertaking is due to the time constraint. We didn’t have sufficient time. So I think we need to discuss how to implement this in the current 40%/60% mode instead of the previous 2m/5m/4m mode where we have immediate full control of the company. 71 Mr Liong explained in his AEIC that he eventually came to the conclusion that the Deed of Undertakings need not be amended:140Foot Note 140×JAEIC, p 115. 58. … But after that and upon further consideration, I was of the view that there was actually no need for the Deed of Undertakings to be amended, as it would have been applicable to both the Initial Model and the Revised Model, since both models would have given YGG substantial access to the business of the Targets and the Management Rights from the first payment. So I did not push Henry to amend the Deed of Undertakings. This was also a reason why the Core Management Team would have been required to be hired from the purchase of the first 40% of the shares of YGIPL. 72 At trial, Mr Liong further explained that as at 21 September 2015, his primary goal was to remind Mr Wong of his obligation:141Foot Note 141×NE Day 8, pp 33–34. Q. That’s your answer, time constraint. You did not bother whether the deed of undertaking covered all the amended agreements, or did you overlook it? A. No, I did not overlook. I – ok, can I repeat that the package that he sell to me, the most lucrative, the biggest most important part of the deal, is the core team members’ secondment. That is the very important part of the whole deal. Q. Now – A. This email is writing to him to remind him, he has to honour that deal. 73 Second, despite various demands made by Mr Liong to Mr Wong starting from 21 December 2015 (see [30] above) to hire and second the core management team to YGG, Mr Wong did not deny that his obligations under the Deed of Undertakings had yet to be engaged, until after the commencement of Suit 104. Rather, when challenged by Mr Liong at the time, Mr Wong sought to highlight the work already done by the core management team. For example, in the reply to Mr Liong’s email of 26 January 2016 (see [31] above), Mr Wong, in response to the demand to hire and second the core management team, did not state that it was premature to second the core management team , and instead highlighted the work already done by the team, stating that his “team were actually in constant communication with [YGIPL] such as coordination of the asset tagging and follow up questions [sic]”. Indeed, Mr Wong took the position in the same email that he would have “sent [his] team in” if not for the disputes over the sharing of due diligence costs two weeks before he was about to send the aforementioned team.142Foot Note 142×JAB Volume 2, p 1124.Mr Wong confirmed in cross examination that the team he was referring to was the core management team.143Foot Note 143×NE Day 2, pp 3–4. 74 Third, in an email sent on 21 February 2016 to Mr Liong and Mr Wong, Mr Lim stated:144Foot Note 144×JAB Volume 3, p 1174. We have lost 6 months in getting your team up to speed with the day to day operations of this company and we are now left with 6 months of the 1 year option that we are offering. We hope you could step up the effort from your end to get involved with the daily operations of the company as soon as possible. 75 While the Vendors were not party nor privy to the Deed of Undertakings, their frustration with Mr Wong’s delay reflected a common expectation that Mr Seen, Mr Lou and Ms Chng would be embedded with YGIPL soon after the SPA was signed. This reflected that the SPA was concluded on this expectation. 76 Seen in light of the statements which implicitly suggested that Mr Wong thought he was bound to second the core management team to YGG once the SPA was executed on 19 August 2015, coupled with the Vendors’ expectation that the core management team would be hired and working with YGIPL soon after the execution of the SPA, Mr Wong’s sudden shift in position on 21 March 2016 (after the commencement of Suit 104) to the effect that he was not bound by the Deed of Undertakings, was a clear afterthought. In fact, even on 21 March 2016, Mr Wong had yet to articulate the defence that the obligations under the Deed of Undertakings would only come into effect after the full 100% stake in YGIPL was purchased. At the time, his position was that the Deed of Undertakings was not enforceable at all due to the change in the Initial Acquisition Model.145Foot Note 145×JAB Volume 3, p 1269.Mr Wong’s defence also shifted in the middle of trial, where for the first time, he abruptly claimed that the examples of work done by the core management team was done “in good faith”.146Foot Note 146×NE Day 5, pp 22.During the earlier period between 21 December 2015 to 21 March 2016, Mr Wong had sought to emphasise these examples as evidence of him fulfilling his obligations under the Deed of Undertakings (see [73] above). The shifting nature of Mr Wong’s defence, culminating in its present form, further underscores the fact that Mr Wijaya’s proposed interpretation does not reflect the objective intention of the parties. In my view, this was merely the latest in a series of attempts by Mr Wong to avoid liability under the Deed of Undertakings. 77 Finally, Mr Wijaya mounts an alternative argument on the breach of the Deed of Undertakings: he submits that Mr Wong did carry out some work on behalf of YGG, including procurement of trucking assets, representing YGG in shareholders’ meetings and coaching Mr Ang in the asset tagging exercise.147Foot Note 147×PWS, pp 16–17.However, clauses 1(b)–(d) of the Deed of Undertakings specify that Mr Wong had to use his best efforts to hire and second the core management team to YGG and the work personally done by Mr Wong had no bearing on these obligations. 78 In the circumstances, I find that the proper interpretation of the phrase “completion of the Acquisition” within the Deed of Undertakings meant, and was understood by all parties to mean, the point when YGG acquired 40% of YGIPL. It follows that Mr Wong’s obligation was to procure the team within a reasonable time thereafter. His continued failure to do so meant that he was in breach of the Deed of Undertakings as at 3 February 2016, when Suit 104 was filed.",
        "MCH’s obligations under the Deed of Undertakings": "79 MCH did not sign the Deed of Undertakings. Mr Wong, YGL and YGG are the contracting parties to it. Mr Soh rests his argument, that MCH is a party to the deed, upon Mr Wong’s authority to bind MCH: in particular, that Mr Wong, “being the controlling mind and will and de facto managing director of MCH, had the express and/or implied authority to act for and enter into the Deed of Undertakings”.148Foot Note 148×Closing Submissions of the 2nd to 5th Defendants in Suit 107 (“D2 CS”), p 31.Authority alone, nevertheless, is not sufficient. There is no doubt that Mr Wong has such authority. If not, the other documents signed by Mr Wong on behalf of MCH, such as the Subscription Agreement, would not bind MCH due to lack of authority. It does not, however, follow that merely because Mr Wong has authority to bind MCH, every contract that he signs does so bind MCH, even where MCH is not expressed as a contracting party. MCH’s responsibility must arise from a proper interpretation of the Deed of Undertakings. 80 YGL makes three arguments to hold MCH responsible. First, the Deed of Undertakings appears to impose obligations on MCH, such as an obligation to hire members of the core management team, and to bear their salaries. Clause 1(d) of the Deed of Undertakings reads:149Foot Note 149×JAB Volume 1, p 272. [Mr Wong] hereby undertakes to each of [YGL] and [YGG]to use his best efforts to: … d)procureeach of [Mr Seen], [Mr Lou] and [Ms Chng]be hired by MCHand seconded to [YGG] … [emphasis added] Similarly, by clause 1(f)(i), Mr Wong is to procure “MCH to bear the balance” of any entitlement of Mr Seen, Mr Lou and Ms Chng during their period of secondment to YGG.150Foot Note 150×JAB Volume 1, pp 272–273. 81 Viewing the document as a whole, the obligation to secure the participation of the core management team is the personal undertaking of Mr Wong, and not that of MCH. Recital (A) of the Deed of Undertakings explains that it is Mr Wong who has the “expertise and resources” in the business, and recital (B) explains that MCH is controlled by Mr Wong.151Foot Note 151×JAB Volume 1, p 271.The Deed of Undertakings then proceed to spell out Mr Wong’s undertakings. In the context of the acts involving MCH, the obligation is again on Mr Wong touse his best efforts to procurea certain course of action on the part of MCH. Placing such a duty on Mr Wong instead of a corresponding obligation on MCH would still be effective. As recital (B) makes clear, the parties to the Deed of Undertakings were well aware that Mr Wong was in full control of MCH. 82 The second argument involves a past position allegedly taken by Mr Wong. In an email sent to Mr Liong on 30 January 2015 (“the 30 January 2015 Email”), one day after the Deed of Undertakings was signed, Mr Wong stated:152Foot Note 152×JAB Volume 1, p 502. 4) Deed of undertaking – MCH pledge to assemble a top class team to manage, run and deliver the profits. these will be paid mostly by MCH. Eventhough I agreed that it was only 2 years. The agreement stated 3. I still sign it anyway as a gesture. 83 Mr Soh thus argues that Mr Wong’s statement affirmed that MCH was a party to the Deed of Undertakings and this was a representation by words or conduct that MCH was bound by the Deed of Undertakings.153Foot Note 153×D2 CS, pp 44–46.Mr Wong’s response to the email was that he misspoke when he stated that MCH was a party to the Deed of Undertakings in the 30 January 2015 Email. He explained thus in his cross-examination:154Foot Note 154×NE Day 1, pp 127–129. Q.  … So isn’t it true that even in this email you have confirmed with Simon that under the deed of undertakings it was MCH that pledged to assemble a top-class team to manage the team? A. I agree with you partially. If your Honour allows me to explain? COURT: Yes? A. When this was entered on 30 January itself, the original intention was to have a series of contract that is to be signed. Out of these contracts itself, probably the shareholder agreement, the loan agreement, the subscription agreement and also I think the call option agreement was signed between companies, two companies. Correct? And also the deed of undertaking was signed individually as Wong Kok Hwee. Right? And the guarantee document was signed also individually as well. It was intended like this.I might have taken it out of context for this one. Q: Now, I suggest to you, Mr Wong, that you had always represented that MCH would be the party that gave the undertaking in the deed of undertakings. Do you agree? A. I don’t agree, no. If MCH is actually intended to be a party of the agreement, then the agreement would have actually reflected MCH as a party. Because out of the seven agreements that we signed, it was very clear who signs for what agreement, because I think the YGL is pretty meticulous. What they have actually decided is who signs for what: Certain agreements are signed by the company, certain agreements must be signed by individual. That is what is intended. [emphasis added] 84 The question of contractual liability is one of law, and Mr Wong could easily have been mistaken, as he contended he was. Of note is that while MCH is not named as a party to the Deed of Undertakings, all the other documents signed by parties on 29 and 30 January 2015, such as the Subscription Agreement,155Foot Note 155×JAB Volume 1, p 156.the Shareholders Agreement,156Foot Note 156×JAB Volume 1, p 113.the Loan Agreement157Foot Note 157×JAB Volume 1, p 219.and the Deed of Share Charge,158Foot Note 158×JAB Volume 1, p 279in contrast, expressly identified MCH as a party. The email correspondence between Mr Liong and Mr Wong during the period of 29 and 30 January 2015 makes clear that all the agreements signed during this period were carefully drafted with the benefit of legal advice.159Foot Note 159×JAB Volume 1, pp 502–506.Mr Liong was well aware of corporate identity and contracted around it, consciously delineating the different parties in different documents. Thus the loan was made to MCH and then secured with personal guarantees from Mr and Mrs Wong. The obligations contained within the Deed of Undertakings were framed and phrased in terms of obligations personal to Mr Wong. The objective intention of the parties was to have Mr Wong bear personal liability for any breach of the Deed of Undertakings rather than create corporate liability on the part of MCH. This interpretation does not mean that the Deed of Undertakings is commercially unworkable or ineffective. It is Mr Soh’s own case that Mr Wong is in effective control of MCH, and as such, placing obligations on Mr Wong would be sufficient to ensure that MCH would act in a certain manner. Indeed the Deed of Undertaking was itself a device to compel Mr Wong’s action, as a complement to the Shareholders Agreement, Subscription Agreement and Call Option Agreement signed by the relevant corporate parties. 85 YGL’s third argument is that this is an appropriate case to lift the corporate veil and engage in “outsider reverse piercing”. “Outsider reverse piercing” is a situation where a “third party (ie, a party who is not a shareholder or a corporate insider) invites the court to disregard the separate legal personality of the company … to hold the company liable for the shareholder’s obligations” (seeJhaveriDarsan Jitendra and others v Salgaocar Anil Vassudeva and others[2018] SGHC 24 at [47]–[48]). Mr Soh argues that the remedy of outsider reverse piercing may be granted “where the separate personality of a company had been used to enable a person to evade an existing contractual duty” and cites the English case ofJones and Another vLipman and another[1962] 1 WLR 832 (“Jones”) in support.160Foot Note 160×D2 CS, p 48 86Joneswas a case where the shareholder-defendant contracted to sell land to the plaintiff. In breach of his obligations, the shareholder-defendant sold and transferred the land to a company under his control. This company was acquired by the shareholder-defendant after the entry of the contract for sale with the plaintiff, and it was not disputed that the sale and transfer of the company was carried through “solely for the purpose of defeating the plaintiff’s rights to specific performance and in order to leave them to claim such damages, if any, as they might establish” (seeJonesat 834–835). In deciding whether the court could lift the corporate veil and order that the company specifically perform the contract between the shareholder-defendant and the plaintiff, Russell J held: The defendant company is the creature of the first defendant, a device and a sham, a mask which he holds before his face in an attempt to avoid recognition by the eye of equity. … an equitable remedy is rightly to be granted directly against the creature in such circumstances. 87 In my view, unlike inJones, MCH was not used as a device, sham or facade by Mr Wong to deliberately evade his contractual obligations to YGG and YGL. Mr Wong’s argument is not that he had procured the cooperation of the relevant individuals but MCH somehow prevented the individuals from being hired. His defence is that there was no need to procure their participation until YGG had full control of the Target Companies. Mr Wong has not used MCH to evade his personal contractual obligations. Instead, he is only suggesting that his personal contractual obligations have not arisen at all. 88 Therefore, while the Deed of Undertakings contains within recital (B) an admission that MCH “is controlled by [Mr Wong]” and Mrs Wong’s evidence on the witness stand is consistent this statement, these concessions alone are not sufficient, in light of the clear import of the document itself, to impose liability on MCH. InSun Electric Pte Ltd and another vMenrva Solutions Pte Ltd and another[2018] SGHC 264 at [142]–[146], Vinodh Coomarawamy J, in the context of a finding that a single individual was the controlling mind behind a company, pointed out aptly that: But our company law now allows one-man companies. It cannot be that a natural person who takes advantage of a mode of doing business which the legislature permits can, by that fact alone, lose the benefit of the limited liability which the legislature has extended to him under s 19 of the Companies Act (Cap 50, 2006 Rev Ed). 89 Mr Wong cannot be found to have abused the corporate personality of MCH merely because Mr Liong had structured transactions in such a way that personal liability was to be incurred in some instances and corporate liability in others. Parties had taken into account the use of the separate legal personality of a company in their consensual allocation of risk. I find, therefore, that MCH is not a party to the Deed of Undertakings.",
        "Judgment in Suit 104": "90 Suit 104 was filed in February 2015 primarily to compel Mr Wong to second Mr Seen, Mr Lou and Ms Ching to YGG. While I have found that Mr Wong is in breach of the Deed of Undertakings, with the effluxion of time and the filing of Suits 337 and 80, this primary purpose has largely been overtaken by events. As such, it is no longer appropriate to grant YGL’s prayer for specific performance of the Deed of Undertakings. Neither is the alternative prayer for common law damages arising out of the breach of the Deed of Undertakings apposite save for the two heads of claim elaborated upon in the next paragraph.161Foot Note 161×Bundle of Pleadings for Suit 104, p 15. 91 When making his closing arguments, Mr Soh pressed only two claims in common law damages. The first arose from Mr Ang taking up the understudy role instead of Mr Seen because Mr Seen was not hired by MCH and seconded to YGG as promised. I accept this argument and award damages to be assessed in respect of the expenses incurred by YGL in having Mr Ang understudy Ms Mao. Secondly, under the Deed of Undertakings, Mr Wong had undertaken to take up the role of the chief executive officer and his expenses would not have fallen to YGL. Arising from his dereliction, Mr Liong took over his role. I also accept this submission and award damages to be assessed in respect of the expenses incurred by YGL in having Mr Liong manage the company in preparation for the exercise of the Purchaser’s Call Option.",
        "Events of Default under the Loan Agreement": "92 In Suit 337, eight Events of Default are alleged as entitling YGL to consider the loan immediately repayable. These arise out of clause 12.1(a) and (e) of the Amended Loan Agreement:162Foot Note 162×JAB Volume 1, pp 229, 230 and 245 12.1 The following events are events of default (each, an “Event of Default”) (a) MCH does not perform or comply with any one or more of its obligations under the Transaction Documents, such failure continuing for a period of five (5) Business Days following the day of service by [YGL] on MCH of a written notice of such failure and requiring the same to be remedied; … (e) any legal proceedings, suits or actions of any kind whatsoever (whether criminal or civil) is instituted against MCH which, in the reasonable opinion of [YGL], has a material financial effect on MCH; … 12.2 Upon the occurrence of an Event of Default: (a) all amounts outstanding under this Agreement (including any accrued interest thereon) shall become immediately due and payable by MCH; and (b) it shall be lawful for [YGL] to exercise all or any rights, powers and remedies under this Agreement (subject to the respective terms herein) or any of them in any manner and in any order as [YGL] may determine. 93 The “Transaction Documents” are defined to include,inter alia,the Deed of Undertakings, the Deed of Share Charge, the Shareholders’ Agreement and the Loan Agreement itself.163Foot Note 163×JAB Volume 1, p 244.I highlight that in all the disputes involving Clause 12.1(a) of the Amended Loan Agreement, there is no dispute that written notice was provided for each of the alleged failures to comply. I examine each alleged Event of Default in turn.",
        "Breach of the Deed of Undertakings: Event of Default 1": "94 The Deed of Undertakings is a specified document within the Transaction Documents, and its breach is the first Event of Default alleged. I have found that MCH is not a party to the Deed of Undertakings (see [89] above). The breach is that of Mr Wong’s, while the Loan Agreement mandates that Events of Default must be breaches on the part of MCH. Clause 12.1(a) of the Amended Loan Agreement therefore does not apply.",
        "Commencement of Suit 104: Event of Default 2": "95 The second alleged Event of Default relies upon the commencement of Suit 104, which YGL contends triggered clause 12.1(e) of the Loan Agreement, as the action had a “material financial effect” on MCH. Mr Soh submits that the commencement of Suit 104 against MCH had a material financial effect on MCH, because MCH had little or no realisable assets and a paid up capital of only $10,000.164Foot Note 164×JAB Volume 1, p 71; D2 CS, p 79. 96 Mr Wijaya does not dispute that the commencement of Suit 104 put a strain on MCH’s finances. This is unsurprising since Mr Wong had conceded during cross-examination that MCH was a shell company and was not doing any other business at the material time, other than the business related to YGG.165Foot Note 165×D2 CS, pp 78–80.It stands to reason that since MCH had no other sources of revenue, and had little or no realisable assets, any law suit would materially affect MCH in financial terms. Mr Wijaya raises two points in reply to Mr Soh’s argument that the commencement of Suit 104 was an Event of Default:166Foot Note 166×Plaintiff’s Written Submissions, pp 18–19. (a) First, that the parties envisioned that clause 12.1(e) of the Loan Agreement would only apply where legal proceedings are commenced by third parties (and not YGL) against MCH; and (b) Second, that Suit 104 was initiatedmala fideas Simon was completely aware of MCH’s financial state as a company with little or no realisable assets as early as 2014, and clause 12.1(e) of the Loan Agreement was invoked in bad faith to seek an earlier repayment of the loan from YGL. Whether Clause 12.1(e) of the Loan Agreement would only apply to third parties 97 Mr Wijaya’s first argument raises a question of the proper interpretation of clause 12.1(e) of the Loan Agreement. In my view, his proposed interpretation cannot be sustained. There is nothing on the text of clause 12.1(e) that suggests that only legal proceedings commenced by third parties would engage the clause. The phrase “any legal proceedings … of any kind whatsoever” suggests the opposite effect was intended. 98 Mr Wijaya submits that a “purposive reading” of clause 12.1(e) would achieve the desired effect.167Foot Note 167×Plaintiff’s Skeletal Submissions, pp 4–5.However, in order for the court to interpret clause 12.1(e) in the manner suggested by Mr Wijaya, there would have to be some evidential basis to show that the parties intended that the clause would be limited to legal proceedings commenced by third parties. In this regard, no evidence, whether within the text of the Loan Agreement or in the extraneous material surrounding the Loan Agreement, has been highlighted to suggest that the parties objectively intended for clause 12.1(e) to be limited in the manner contended. 99 This does not mean YGL has unlimited latitude to bring any action, however unreasonable, against MCH in order to trigger clause 12.1(e). Clause 12.1(e) expressly limits the applicable legal proceedings to those which in thereasonable opinionof YGL have a material financial effect. Insofar as Suit 104 was brought without a reasonable basis, ormala fide, as Mr Wijaya suggests, clause 12.1(e) would not apply. This leads into Mr Wijaya’s second argument, to which I now turn. Whether Suit 104 was initiated mala fide 100 In support of his contention that Suit 104 was initiatedmala fide, to seek an early repayment of the loan from YGL, Mr Wijaya relies solely on the fact that Mr Liong was “completely aware of MCH’s financial state” as a company with “little or no realisable assets”. Mr Wijaya suggests that to consider Suit 104 as having a material financial effect on MCH would have the effect of “affording protection to an individual who had entered into a contractual state of affairs willingly, and seeks now to benefit from the same contractual relationship which was clearly slanted in his favour”.168Foot Note 168×Plaintiff’s Written Submissions, pp 18–21. 101 There is no dispute that Mr Liong knew of MCH’s financial position prior to the execution of the Loan Agreement. This fact alone, however, is insufficient to impute improper motives onto Mr Liong and YGL. An examination of the sequence of events leading up the commencement of Suit 104 shows a reasonable basis for its filing, In particular: (a) Suit 104 was commenced on 3 February 2016. This was more than five months after Mr Wong’s duty to second the core management team within a reasonable time was triggered due to the signing of the SPA. (b) From Mr Wong’s first presentation, he premised the success of the Target Companies upon the injection of the core management team. (c) During this five-month period, Mr Wong repeatedly indicated that he did not intend to procure MCH to hire the core management team and second the same to YGG (see [26]–[30] above). Mr Liong thus had legitimate concerns that Mr Wong would not comply with his obligations under the Deed of Undertakings. These concerns required close attention, given that the secondment of the core management team was a critical part of the business strategy that the parties had formulated at the start of their business relationship (see [4] above). The primary remedy sought was a request for specific performance of the Deed of Undertakings, which suggests that the purpose of Suit 104 was to compel Mr Wong to second the team. 102 Seen in light of these facts, Suit 104 was not commenced for the purpose of triggering an Event of Default under the Loan Agreement. Instead it was a legitimate attempt to enforce the obligations under the Deed of Undertakings, in the light of Mr Liong’s well-founded fear that Mr Wong would not hire and second the core management team. YGL’s opinion that Suit 104 had a material financial effect on MCH was therefore a reasonable one. 103 I should explain why I decide thus even though I have held that MCH was not a party to the Deed of Undertakings, and YGL was thus not successful in the litigation they instituted against MCH. Clause 12.1(e) did not limit “any legal proceedings” to those which were ultimately successful, only those which “in the reasonable opinion” of YGL would have a material financial effect. The contention that MCH was party to the Deed of Undertaking was not an implausible one and the institution of proceedings against MCH was a reasonable decision.",
        "Breach of the Deed of Share Charge: Event of Default 3": "104 The Deed of Share Charge is one of the Transaction Documents. Mr Soh argues that MCH’s failure to accept the appointment of Mr Tan as the proxy of MCH (see [34]–[35] above), amounted to a breach of clause 3.8 of the Deed of Share Charge,169Foot Note 169×D2 CS, pp 95–99.and consequently, there was a failure to “comply with any one or more of its obligations under the Transaction Documents” pursuant to Clause 12.1(a) of the Amended Loan Agreement. 105 Clause 3.8 of the Deed of Share Charge states: 3.8 Voting Rights Until all the Secured Liabilities have been irrevocably paid in full, [YGL] shall have the power to exercise (in the name of [MCH] and without any further consent or authority on the part of [MCH]) any and all rights with respect to the Shares, including without limitation the rights to attend any and all general meetings of shareholders of [YGG]; to vote the Shares at any such meeting in such manner as [YGL] may deem appropriate; to give shareholder approval in lieu of a general meeting … 106 Mr Wijaya does not dispute the scope of the powers granted by clause 3.8 of the Deed of Share Charge. Nor does he dispute that if the powers were properly exercised, MCH’s failure to accept the appointment of Mr Tan would have been an Event of Default. However, he argues that YGL was not entitled to exercise the powers granted by clause 3.8 of the Deed of Share Charge, because of the statements made by Mr Liong in the 28 January 2015 Email. 107 Mr Wijaya’s argument is that the statements made in that email amounted to either promissory estoppel or a collateral contract that would bar YGL from exercising clause 3.8 of the Deed of Share Charge on 22 March 2016.170Foot Note 170×Plaintiff’s Written Submissions, pp 21–27. 108 It is not in dispute that there are three elements to promissory estoppel (seeThe Law of Contract in Singapore(Andrew Phang Boon Leong gen ed) (Academy Publishing, 2012) at paras 4.072–4.087): (a) A clear and unequivocal promise that the promisor would not enforce his strict legal rights; (b) The promisee must have acted in reliance on the promise; and (c) It must be inequitable for the promisor to go back on his word. 109 The crux of the dispute on this point centres on the first element of promissory estoppel. Mr Wijaya suggests that there was a clear and unequivocal promise from Mr Liong that YGL would not exercise the voting rights under clause 3.8 of the Deed of Share Charge save on the occurrence of an Event of Default within meaning of the Loan Agreement.171Foot Note 171×Plaintiff’s Written Submissions, p 23.Mr Soh argues that there was no such clear and unequivocal promise. 110 In my view, there was no clear and unequivocal promise that YGL would not exercise the voting rights under clause 3.8 of the Deed of Share Charge save on the occurrence of an Event of Default. I have arrived at this conclusion after careful consideration of the text of the 28 January 2015 Email and the context of the discussions surrounding that email. 111 As mentioned (see [9] above), on 25 January 2015, Mr Wong requested for Mr Liong to qualify clause 3.8. Mr Wong stated:172Foot Note 172×JAB Volume 1, p 440. Hi Simon, … Was wondering if your lawyers is able to insert a clause in the share pledge agreement that my portion of the shares 70% pledged is only for the purpose of my obligation to repay the S$4m. loan It cannot be used by [YGL] to by pass my legal right to run the company as a 70% stakeholder. [YGL] will have the ability to exercise this right ONLY in the event of a default. MCH should retain all rights accorded with the 70% stake including dividends etc…. Was wondering if we can have this understanding before I sign the loan agreement? 112 As is apparent, what Mr Wong requested was for Mr Liong to vary the express terms of the Deed of Share Charge. The restrictions that Mr Wong requested for Mr Liong to place on the exercise of clause 3.8 mirror the restrictions Mr Wijaya now says is placed by virtue of the representations made in the 28 January 2015 Email. Yet, instead of agreeing to this request, Mr Liong replied in the 28 January 2015 Email as follows:173Foot Note 173×JAB Volume 1, p 440. Hi Henry, I think I should assure you again, this time in writing, so that everyone has a record to fall back on in future. Even though you pledge all of your 70% shares, with all voting rights, to YGL (YG Logistics), I will not interfere with the operations or obstruct you in discharging your duties. I just keep the voting rights to make myself feel good and comfortable with the 4m loan only. … 113 On the face of the email, there is no clear statement from Mr Liong that he would only exercise the voting rights only upon the occurrence of an Event of Default. If Mr Liong intended to inform Mr Wong that he was willing to restrict his use of clause 3.8 of the Deed of Share Charge in the manner requested, he could simply have amended clause 3.8 as Mr Wong requested. Instead, the clause was not amended. This sequence of events suggests that it is far from clear and unequivocal that Mr Liong was suggesting that he would only exercise the voting rights on the occurrence of an Event of Default. 114 Nevertheless, Mr Liong did reassure Mr Wong that he would not “interfere” and suggested that the voting rights was meant to make him feel “good and comfortable” with the loan. The question is thus the proper interpretation to take with regards to the scope of this reassurance. 115 The object of clause 3.8 is important in considering its scope. The loan was to provide MCH with enough capital to subscribe to shares in YGG, in order finance YGG’s acquisition of YGIPL (see [6(d)] and [0] above). Mr Liong was investing a substantial sum of money into the joint venture, both directly as a shareholder of YGG as well as indirectly as a creditor to MCH. Mr Liong provided all the cash in the initial purchase of the 40% of YGIPL shares. Seen in this light, clause 3.8 of the Deed of Share Charge was intended to give Mr Liong additional protection for his investment, in allowing him to take control of YGG, to mitigate the risk he bore if Mr Wong or MCH should act against YGG’s interests. Bearing in mind this purpose, as well as the negotiations by the parties over the possibility of amending clause 3.8, I find that the 28 January 2015 Email was a statement from Mr Liong that YGL would only exercise clause 3.8 if it was reasonable to protect YGG’s interests. 116  In my view, it was reasonable for Mr Liong to exercise clause 3.8 in the circumstances. Mr Liong knew, as early as 24 February 2015, that Mr Wong had some difficulty getting funds, which was the reason MCH was unable to provide security to proceed with the Initial Acquisition Model.174Foot Note 174×JAEIC, pp 106–108.By March 2016, more than six months after the SPA was signed, Mr Wong had repeatedly refused to exercise the Purchaser’s Call Option and had refused to hire and second the core management team to YGG (see [30]–[34]). It was also clear that by this point, the parties’ relationship was rapidly deteriorating. For reasons that had yet to be fully revealed to Mr Liong, Mr Wong appeared to be attempting to stymie the full acquisition of YGIPL. There was a genuine possibility that Mr Wong was deliberately dragging his feet on the acquisition, either due to a lack of funds for MCH to subscribe to the second tranche of shares in YGG, or simply because Mr Wong was unhappy with Mr Liong. This delay resulted in a situation where YGG had no physical presence in the Target Companies, despite the impending deadline for the complete acquisition of YGIPL. Another legitimate fear was that the Vendors would soon be able to purchase the 40% of YGIPL from YGG at a 10% discount, resulting in loss to YGG. In light of these facts, it was reasonable for Mr Liong to fear that without an intervention, Mr Wong and MCH would undermine YGG’s interests. 117 Hence, even if there was promise which formed the basis for a promissory estoppel or formed part of the terms of a collateral contract, Mr Liong acted within the scope of the promise and YGL was entitled to exercise clause 3.8 on 18 March 2018. MCH’s refusal to recognise this exercise was an Event of Default.",
        "Breaches of the Shareholders’ Agreement: Events of Default 4-7": "Holding an EGM on 29 March 2016 without the requisite quorum: Event of Default 4 118 Mr Soh submits that MCH was in breach of clause 6.2.1 of the Shareholders’ Agreement by holding a reconvened EGM on 29 March 2016 (see [36] above) without the requisite quorum. This in turn was an Event of Default, as the Shareholders’ Agreement was one of the “Transaction Documents” within clause 12.1(a) of the Amended Loan Agreement. 119 Clause 6.2.1 of the Shareholders’ Agreement states:175Foot Note 175×JAB Volume 1, p 119. 6.2.1  no business shall be transacted at any general meeting or adjourned meeting of [YGG] unless a quorum of Shareholders is present at the time when the meeting proceeds to business and a quorum shall comprise both MCH and [YGL] present in person or by proxy, and the quorum shall be present throughout … 120 Mr Wijaya’s only response to Mr Soh’s submission is to highlight that Mr Wong disagreed with the appointment of the Mr Tan as a proxy. However, Mr Wong’s views on whether Mr Tan was properly appointed has no bearing on whether or not a proper quorum was present for the 29 March 2016. No representative from YGL was present, and I thus find that in holding the EGM on 29 March 2016, MCH was in breach of clause 6.2.1 of the Shareholders’ Agreement and Event of Default 4 has been made out. Refusing to amend YGG’s Articles of Association to bring the Articles in line with the Shareholders’ Agreement: Event of Default 5 121 Mr Soh argues that MCH was in breach of clause 19 of the Shareholders’ Agreement by refusing to amend the Articles of Association of YGG to bring it in line with the Shareholders’ Agreement (see [22] above). Consequently this was a breach of one of the Transaction Documents, and an Event of Default within the meaning of clause 12.1(a) of the Loan Agreement. 122 Clause 19 of the Amended Shareholders’ Agreement provides: 19 AGREEMENT TO PREVAIL In the event of any inconsistency between the provisions of this Agreement and the Articles, the provisions of this Agreement shall, as between the Shareholders, prevail and the Shareholders shall exercise all powers and rights available to them to procure the amendment of the Articles to the extent necessary to permit the Company and its affairs to be regulated as provided in this Agreement. 123 It is not disputed that MCH refused to amend the Articles of Association. Mr Wijaya raises two defences. First, he says that there is no “strict obligation for MCH to amend YGG’s Articles of Association”.176Foot Note 176×Plaintiff’s Written Submissions, p 31.This is plainly untrue, clause 19 states that “the Shareholders shall ... procure the amendment of the Articles”. Clause 1.1 of the Shareholders Agreement makes clear that MCH is one of the “Shareholders”.177Foot Note 177×JAB Volume 1, p 115. 124 Second, Mr Wijaya suggests that the amendments appeared to grant Mr Liong a significant degree of control in YGG and would run contrary to representations from Mr Liong’s that Mr Wong would be “the captain of the ship”. Aside from this bare assertion, no attempt was made to show how the representations made by Mr Liong would have binding effect on Mr Liong, either through the doctrine of promissory estoppel or some other means. 125  In any event, there is no dispute that the amendments to the Articles of Association proposed by Mr Liong were consistent with clause 19,ie, the amendments did no more than adjust the articles to be in line with the provisions of the Shareholders’ Agreement. In the circumstances, Mr Wijaya’s factual premise, that the amendments would grant Mr Liong a significant degree of control in YGG is incorrect. This is because the Shareholders’ Agreement had already bound MCH and YGL, and any amendments in the Articles of Association would only reflect the control Mr Liong already exercised by virtue of the Shareholders’ Agreement. Additionally, it did not appear to be necessarily inconsistent for Mr Wong to be the “captain of the ship” in the sense that Mr Wong would be in charge of the day to day running of the company, and Mr Liong to retain control of the company in the event that Mr Wong began acting against YGG’s interest. Hence, I find that Mr Wijaya has failed to prove his defence and Event of Default 5 has been made out. Refusing to recognise the appointment of Mr Tan as director of YGG: Event of Default 6 126 Mr Soh argues that MCH breached clause 5.8 of the Amended Shareholders’ Agreement because Mr Wong refused to adopt the resolution appointing Mr Tan as director of YGG. This was in turn an Event of Default under clause 12.1(a) of the Amended Loan Agreement as the Shareholders’ Agreement is a “Transaction Document” as defined in the Loan Agreement. 127 Clause 5.8 of the Amended Shareholders’ Agreement provides:178Foot Note 178×JAB Volume 1, pp 151–152. 5.8 Notwithstanding Clause 5.5, at any meeting or adjourned meeting of the Directors convened before the closing of the purchase of the Vendors’ Option Shares by [YGG] (the event of which are set out in clause 8 of the [SPA],the vote castby the Director appointed by [YGL] shall be the resolution adopted by the Board of Directors at a meeting or adjourned meeting. [emphasis added] 128 Mr Wong conceded during cross examination that he refused to adopt the resolution appointing Mr Tan as director of YGG and this point is not disputed.179Foot Note 179×NE Day 2, pp 53–54.Mr Wijaya’s defence is that YGL is estopped from relying on its legal rights under clause 3.8 of the Deed of Share Charge, for the same reasons raised at [106]–[109] above, and therefore, Mr Tan could not vote on behalf of MCH, and the appointment of Mr Tan as director, which MCH voted in favour of, could not stand. 129 I accept Mr Soh’s submission and reject Mr Wijaya’s defence for two reasons. First, Mr Wijaya’s argument is strictly speaking irrelevant because according to clause 5.8 of the Amended Shareholders’ Agreement, up until the point YGG purchases the remaining 60% of the YGIPL shares, YGL’s vote must be adopted by the board of YGG. Thus, even if MCH had voted against the YGG board resolution appointing Mr Tan as director, by virtue of clause 5.8, Mr Wong was still obliged to accept the appointment of Mr Tan. 130 Second, given my finding that YGL was entitled to exercise clause 3.8 of the Deed of Share Charge on 18 March 2018 and validly appointed Mr Tan as the proxy for MCH (see [117] above), the argument that there was no effective quorum because Mr Wong did not participate in the vote for the appointment of Mr Tan as director also cannot be sustained. Hence, I agree with Mr Soh that there was a breach of the Amended Shareholders’ Agreement, and Event of Default 6 has been made out. Divulging confidential information pertaining to YGG to Mr Iskandar after his removal as director: Event of Default 7 131 Mr Soh argues that MCH breached clause 12 of the Subscription Agreement, because Mr Wong continued to send confidential information relating to YGG to Mr Iskandar, after Mr Iskandar’s removal as director (see [39] above). As the Subscription Agreement was a “Transaction Document” as defined in the Loan Agreement, this was an Event of Default under clause 12.1(a) of the Amended Loan Agreement. 132 There is no dispute that if Mr Iskandar was validly removed, there would be a breach of clause 12 of the Subscription Agreement, which prevents shareholders of YGG from divulging confidential information to third parties. Mr Wijaya’s sole point of contention rests on the issue of whether Mr Iskandar was validly removed. He argues that Mr Iskandar was not validly removed as clause 3.8 of the Deed of Share Charge was invalidly exercised by YGL. Given my finding that YGL properly exercised clause 3.8 of the Deed of Share Charge (see [117] above), it follows that Mr Iskandar was validly removed, and Event of Default 7 has been made out.",
        "Failure to pay interest under the Loan Agreement: Event of Default 8": "133 Mr Soh submits that that MCH’s refusal to pay interest from 28 July 2016 onwards (see [42] above) was a breach of the Loan Agreement, and thus constituted an Event of Default under Clause 12.1(a) of the Amended Loan Agreement. Clauses 1, 5 and 7 of the Loan Agreement state:180Foot Note 180×JAB Volume 1, pp 221, 226 and 227. 1. DEFINITIONS AND INTERPRETATION … “Interest Period”means a period of six (6) Months, other than the final Interest Period in respect of the Loan, which may be shorter. The first Interest Period in respect of the Loan shall commence on the Utilisation Date of the Loan and the final Interest Period in respect of the Loan shall terminate on the Maturity Date or the last day of the Extended Term (where applicable); … 5. INTEREST Interest shall accrue on the principal amount of the Loan outstanding from time to time (including the first day of the period during which it accrues and including the last day) at the Interest Rate. Interest shall accrue from day to day and shall be calculated on the number of days elapsed. … 7 REPAYMENT … 7.2 Subject to Clause 7.1 hereof, MCH shall pay accrued interest on the Loan, without deduction in arrear on the last day of each Interest Period. 134 Mr Wijaya highlights that interest was paid at all times until after the filing of Suit 104, and suggests that because Suit 104 was filed in bad faith to seek an earlier repayment of the Loan, MCH was not obliged to pay interest on the loan.181Foot Note 181×Plaintiff’s Written Submissions, pp 33–34.There is no basis for this argument. As established at [101]–[103] above, Suit 104 was not filed in bad faith. Even if Mr Wijaya’s case were taken at its highest and assuming that there was bad faith in the filing of Suit 104, Mr Wijaya did not point to any legal principle that would entitle MCH to cease payment of interest under the loan. I note that in his opening statement, Mr Wijaya initially indicated an intention to pursue an argument on the repudiatory breach of the Loan Agreement. Mr Wijaya confirmed during the oral closing arguments that he was no longer taking up this point.182Foot Note 182×Minute Sheet dated 13 November 2018, pp 3–4.In the circumstances, MCH was under an obligation to pay interest on the loan, and the failure to do so amounted to a breach of clause 7.2 of the Loan Agreement, and Event of Default 8 has been made out.",
        "Claim in Suit 337": "135 I find, therefore, that seven of the eight Events of Default have been made out.",
        "Counterclaim in Suit 337": "136 A counterclaim has been brought by MCH and Mr Wong, alleging lawful and unlawful conspiracy on the part of YGL and Mr Liong. 137 Mr Wijaya points to two separate acts to found his claims on lawful or unlawful means conspiracy: (a) The commencement of Suit 104 and Suit 337;183Foot Note 183×PWS, p 57.and (b) Mr Liong’s reliance on clause 3.8 of the Deed of Share Charge to take control of the Board of YGG from MCH;184Foot Note 184×PWS, p 59. 138 The elements of the tort of conspiracy are not in dispute and can be briefly stated as follows (seeGimpexLtd v Unity Holdings BusinessLtd and others and another appeal[2015] 2 SLR 686 at [150]): (a) A combination of two or more persons and an agreement between and amongst them to do certain acts. (b) If the conspiracy involves lawful acts, then the predominant purpose of the conspirators must be to cause damage or injury to the plaintiff. (c) If it is proven that the conspiracy involves unlawful means, then a predominant intention to cause damage or injury is not required; an intention to cause harm to the plaintiff should suffice. (d) The acts must actually be performed in furtherance of the agreement. (e) Damage must be suffered by the plaintiff. 139 Turning first to the allegation of unlawful means conspiracy on the part of YGL and Mr Liong, I find that all the acts complained of were lawful. 140 While YGL was not entirely successful in Suit 104, in that they have failed to establish that MCH was a party to the Deed of Undertakings (see [89] above), this does not mean that the commencement of Suit 104 and Suit 337 was unlawful. The YGL parties were perfectly entitled to commence legal action, and a partial failure of such action thus not thereby render a lawfully commenced suit unlawful. 141 Mr Liong and YGL’s act of taking over board control was also lawful. I have found that YGL was fully entitled to exercise clause 3.8 of the Deed of Share Charge and appoint Mr Tan as proxy for MCH (see [117] above). Hence, there is no basis to suggest that any of the action taken pursuant to votes cast by Mr Tan as proxy for MCH, including the removal of Mr Iskandar, and later, the revocation of Mr Wong’s appointment as Managing Director, was unlawful. 142 Turning to consider the allegation of lawful means conspiracy, I find that there was no predominant intention to injure MCH, Mr Wong or Mrs Wong. Where self-interest is the predominant motivation behind the relevant actions, this necessarily suggests that there is no predominant intention to injure (seeEFT Holdings,Inc and another v Marinteknik Shipbuilders (S) Pte Ltd and another[2014] 1 SLR 860 at [96]). In the present case, the sequence of events that led to all the acts complained of by Mr Wong clearly indicate that YGL and Mr Liong were pursuing their self-interest and the interests of YGG in commencing the suits and usurping board control, rather than possessing a predominant intention to injure the MCH parties. To reiterate, Mr Liong was anxious to ensure that Mr Wong would second the core management team to YGG and exercise the Purchaser’s Call Option after their arguments over the KV Asia Offer (see [26] above). Mr Liong was plainly of the view that it was in the best interest of YGG and YGL to complete the acquisition of YGIPL in a smooth and expedient manner. Mr Wong on the other hand, appeared to be delaying the exercise of the Purchaser’s Call Option and the secondment of the core management team. Seen in this light, the impugned actions can be viewed as a series of escalating responses to Mr Wong’s attempts to thwart the complete acquisition of YGIPL (see [28]–[35] above). I thus find that YGL and Mr Liong were acting predominantly to further their interests and the interests of YGG by ensuring that YGG completely acquired YGIPL as planned. In the circumstances, the tort of conspiracy is not made out. 143 Before leaving this issue, I highlight a final argument made by Mr Wijaya in closing submissions. He suggests that Mr Liong acted in breach of the Articles of Association of YGG by diverting the dividends due to YGG into his own private bank account without authorisation from the YGG Board, and this forms the basis of a conspiracy claim.185Foot Note 185×PWS, p 60.I do not accept this argument for four reasons. First, I note that this argument was not pleaded. Second, the article relied on by Mr Wijaya, Article 112, pertains to when the dividends of YGG may be declared, it does not prescribe a particular manner in which dividends received from other companies may be held.186Foot Note 186×JAB Volume 5, p 2711.Article 112 thus has no bearing on the fact that Mr Liong is holding these dividends in his own bank account. Third, I accept Mr Liong’s evidence that the reason for this arrangement was simply because YGG had difficulties opening a bank account in China, and Mr Liong was merely using his personal bank account in China to hold the dividend monies on trust for YGG.187Foot Note 187×JAEIC, pp 365–367.There is hence nothing unlawful about his actions. Fourth, there is nothing to suggest that Mr Liong entered into this arrangement with any intention to harm Mr Wong at all, let alone a predominant intention to harm Mr Wong. 144 I therefore dismiss the counterclaim.",
        "Judgment in Suit 337": "145 The claim in Suit 337 is successful and the counterclaim is dismissed. The Amended Loan Agreement prescribes the consequences for the occurrence of an Event of Default. First, pursuant to clause 12.2(a), all amounts outstanding under the Loan Agreement, including accrued interest, shall become immediately due and payable. The parties do not dispute that the loan has matured and the principle sum of $450,000 is hence payable in any event. Any unpaid accrued interest on the loan (see [42] above), is also due and payable. In addition, pursuant to clause 6 of the Loan Agreement, default interest on any overdue amounts in the loan agreement is also due and payable. Second, Clause 8A of the Amended Loan Agreement prescribes a mandatory pre-payment fee if an Event of Default occurs. This mandatory pre-payment fee is also due and payable. 146 In the statement of claim for Suit 337, YGL claims a total sum of S$4,568,631.94 as at 6 April 2016 (the date of filing of Suit 337), comprising:188Foot Note 188×Bundle of Pleadings for Suit 337 at p 19. (a) S$4,500,000 for the principal sum; (b) S$34,338 for the mandatory pre-payment fee; (c) S$29,344.20 for interest; and (d) S$4,949.74 for default interest, with the caveat that default interest continues to run. 147 There is no dispute on these calculations. I award the sum of S$4,568,631.94 with continuing default interest up to today. 148 The allegations made in the counterclaim to Suit 337 also form a part of the premise of Suit 107, which asks for the winding up of YGG. Before considering the winding up of YGG, however, it is important to have the full context. I therefore turn next to the purported breaches of directors’ duties by Mr Wong alleged by YGG in Suit 80. These acts explain the context of Mr Liong’s intervention in YGG.",
        "Mr Wong’s directors’ duties owed to YGG": "149 In Suit 80, YGG, now under the direction of Mr Liong, sues Mr Wong for breach of his directors’ duties. The facts as found in this suit must be considered together with Suit 107, which is an action to wind up YGG.",
        "Overview of breaches alleged": "150 It is common ground that Mr Wong owed fiduciary duties to YGG. InSingapore Swimming Club v Koh Sin Chong Freddie[2016] 3 SLR 845 at [136], the Court of Appeal explained a fiduciary’s core duty of loyalty by citing the following passage from the English decision ofBristol & West Building Society vMothew[1998] Ch 1: … A fiduciary is someone who has undertaken to act for or on behalf of another in a particular manner or circumstance which give rise to a relationship of trust and confidence. The distinguishing obligation of a fiduciary is the obligation of loyalty. The principal is entitled to the single-minded loyalty of his fiduciary. This core liability has several facets. A fiduciary must act in good faith; he must not make a profit out of his trust; he must not place himself in a position where his duty and his interest may conflict; he may not act for his own benefit or the benefit of a third person without the informed consent of his principal. This is not intended to be an exhaustive list, but it is sufficient to indicate the nature of fiduciary obligations. They are the defining characteristics of the fiduciary. … 151 Arising, therefore, from their core obligation of loyalty to the company, directors owe various fiduciary duties, including the duty to actbona fidein the best interest of the company, the duty not to place oneself in a position of conflict and the duty not to profit from one’s position. 152 The duty to actbona fidein the best interest of the company was considered by the Court of Appeal inHoKang Peng v Scintronix Corp Ltd (formerly known as TTL Holdings Ltd)[2014] 3 SLR 329 (“HoKang Peng”). I summarise the applicable principles gleaned from the case as follows: (a) The court will be slow to interfere with commercial decisions of directors which have been made honestly even if they turn out, on hindsight, to be financially detrimental (seeHoKang Pengat [37]); (b) This does not mean that the court refrains entirely from exercising supervision over directors as long as they claim to be acting to promote the companies’ interests. Where a transaction is not objectively in the company’s interest, a judge may very well draw an inference that the directors were not acting honestly (seeHoKang Pengat [38]); and (c) The requirement ofbona fidewill not be satisfied if the director acted dishonestly (seeHoKang Pengat [39]). 153 The duty not to place oneself in a position of conflict, also known as the no-conflict rule, mandates that a fiduciary may not place himself in a position or enter into a transaction in which his personal interest may conflict with his duty to his principal, unless his principal, with full knowledge of all the material circumstances and of the nature and extent of the fiduciary’s interests, consents. This duty is targeted at potential as well as actual conflict. The law only requires that there is a reasonable perception of a conflict of interest arising (seeNgEng Ghee and others v Mamata Kapildev Dave and others (Horizon Partners Pte ltd, intervener) and another appeal[2009] 3 SLR(R) 109 at [137]–[138]). 154 The duty not to profit from one’s position, also known as the no-profit rule, can be seen as a particular application of the no-conflict rule. A fiduciary is duty bound to refrain from retaining any profit which he has made through the use of the company’s property, information or opportunities to which he has access by virtue of being a director, unless he has the fully informed consent of the company (seeGoh Chan Pengand others v Beyonics Technology Ltd and another and another appeal[2017] 2 SLR 592 at [51]). 155 Mr Lobo also relied upon the statutory duty owed under s 157(1) of the Companies Act, that mandates that a director “shall at all times act honestly and use reasonable diligence in the discharge of the duties of his office”. This statutory duty encapsulates two sets of duties. The first, the duty to act honestly, is the statutory equivalent of the fiduciary duty to actbona fidein the interest of the company (seeHoKang Pengat [35]). The second, the duty to use reasonable diligence, captures a director’s separate common law duty to exercise due care, skill and diligence (seeHoYew Kong v Sakae Holdings Ltd and other appeals and other matters[2018] 2 SLR 333 (“HoYew Kong”)at [134]). The duty of care, skill and diligence is not a fiduciary duty because it is not imposed to exact loyalty from a director (seeHoYew Kongat [135]). The standard of care and diligence expected of a director is not fixed and is a continuum depending on various factors such as the individual’s role in the company, the type of decision being made, and the size and the business of the company. The standard will not be lowered to accommodate any inadequacies in the individual’s knowledge or experience and will instead be raised if the director holds himself out to possess or does in fact possess some special knowledge or experience (seePrimaBulkship Pte Ltd v Lim Say Wan[2017] 3 SLR 839 at [43]–[44], cited with approval inHoYew Kongat [136]). Both duties are in play when considering Mr Wong’s conduct. If the higher threshold of fiduciary duties is made out, a different range of remedies arise. 156 The six breaches alleged are the following: (a) Mr Wong’s failure to disclose the Secret Arrangements; (b) Mr Wong’s failure to disclose that MCH had no money to subscribe for the second tranche of shares in YGG; (c) Mr Wong’s failure to ensure that YGG utilised the management rights given by the SPA; (d) Mr Wong’s failure to second Mr Seen, Mr Lou and Ms Chng to YGG; (e) Mr Wong’s delay in exercising the Purchaser’s Call Option; and (f) Mr Wong’s failure to disclose the YKL Offer.",
        "Findings on breaches alleged": "157 The first allegation concerns that of secret profits. The last is of non-disclosure in the face of a conflict of interest. Contentions (b) to (e) concern decisions made by Mr Wong after the SPA was signed. It is contended that he did not make these decisions honestly. For the reasons below, I find that all six separate instances of breach are made out and reflect breaches of fiduciary duties. While at the same time Mr Wong may have additionally breached statutory or common law duties, this does not add further reliefs in this case where there are concomitant breaches of fiduciary duties. I focus below primarily on the breaches of fiduciary duty, and thereafter, on the remedies applicable for those breaches.",
        "Failing to disclose the Secret Arrangements": "158 It is not disputed that the Secret Arrangements were not disclosed to Mr Liong. Mr Wijaya argues that the Secret Commission Agreement and the Secret Trust Deeds were not arrangements which resulted in profit to either MCH or himself. Mr Wong’s case is that the Secret Arrangements were in substance an agreement for Mr Wong to sell the shares in MCH to Mr Lim and Ms Mao for the sum of US$380,000. Mr Wong suggests that he had made no profit at all in these Secret Arrangements, because the MCH shares were “sold” at an undervalue “in order to facilitate the deal to help push the acquisition [of YGIPL] through”.189Foot Note 189×Plaintiff’s Written Submissions, p 51.Mr Wong gave evidence that he did so in order to get Ms Mao and Mr Lim to convince the rest of the Vendors to sell the Target Companies for a favourable price.190Foot Note 190×NE Day 4, pp 133–135.On the other hand, both Mr Lim and Mr Koh Chaik Ming gave evidence that the Secret Commission Agreement had no relation to the Secret Trust Deeds. According to them, the Secret Commission Agreement was a commission requested by Mr Wong from the Vendors.191Foot Note 191×NE Day 12, pp 37–38; NE Day 13, pp 13–16.Mr Lim and Mr Koh Chaik Ming stated that the Secret Trusts Deeds were for the separate purpose of incentivising Ms Mao and Mr Lim to participate in some capacity in the future of YGIPL after the full acquisition of YGIPL.192Foot Note 192×NE Day 12, pp 76–77; NE Day 13, pp 13–16 159 I accept the version of events provided by Mr Lim and Mr Koh Chaik Ming and I reject Mr Wong’s case for three reasons. First, Mr Wong’s evidence constantly shifted throughout trial, and I did not find him to be credible on this point. In contrast, Mr Lim and Mr Koh Chaik Ming were consistent on the nature of the Secret Arrangements. Second, on 4 August 2015, Mr Wong appeared to have inadvertently sent a draft of the Secret Commission Agreement letter to Mr Liong, and pretended that he would not be accepting any commission from the Vendors (see [16] above). If Mr Wong believed that the Secret Arrangements actually involved a sale done in the interests of the YGG, it is difficult to understand why Mr Wong would lie and hide the arrangement from Mr Liong. Mr Wong himself stated that he “would not be accepting this [referring to the draft Commission Letter] because this is inconflict of interest” [emphasis added]. Third, Mr Lim and Mr Koh’s characterisation of the Secret Arrangements match more closely with the text of the documentation on these arrangements. The Commission Letter states:193Foot Note 193×Exhibit YGG 1, p 1. In consideration of your referral of the Purchaser for the sale of our shares in the Company, we agree to pay to you on a success-basis a commission of US$380,000.00 (“Commission”) if all of the Sale Shares and the Balance Shares are acquired by the Purchaser. 160 If the Secret Arrangements were indeed intended to be a sale of MCH shares, it is difficult to understand why the Commission Letter would be phrased in such a manner. There is also nothing on the face of the Commission Letter and the Secret Trust Deeds to suggest that the Secret Arrangements involved a sale of MCH shares. 161 Therefore, I find that Mr Wong made a secret profit through the Secret Commission Agreement, and this profit was obtained by way of opportunities that came about by virtue of Mr Wong’s position as a director of YGG. Mr Wong was in breach of the no-profit rule by failing to obtain fully informed consent of YGG. 162 I also find that the failure to disclose the Secret Trust Deeds was a breach of the no-conflict rule on the part of Mr Wong. Clause 2 of the Secret Trust Deeds state:194Foot Note 194×Exhibit YGG 1, pp 5–6 and 10–11. [Mr Wong] agrees and undertakes to [Ms Mao/Mr Lim] that:- … (c) he will procure that [YGG] shall not sell, transfer, charge, encumber or otherwise alienate or deal in any manner whatsoever with any of its shares in [YGIPL] unless with the prior written consent of [Ms Mao/Mr Lim], which consent may be given subject to such conditions as [Ms Mao/Mr Lim] may impose at [her/his] discretion, … 163 The Secret Trust Deeds gave Ms Mao and Mr Lim the power to control Mr Wong’s decisions in terms of how YGG would deal with YGIPL shares. This clearly created a potential conflict between the interest of YGG and Mr Wong’s obligations under the trust deeds to follow the instructions of Ms Mao and Mr Lim. His failure to give full disclosure of the Secret Trust Deeds was thus a breach of the no-conflict rule.",
        "Breaches linked to the decisions made by Mr Wong in relation to the acquisition of YGIPL": "164 The four alleged breaches that are listed at [156(b)]–[156(e)] above have overlapping factual contentions regarding the central issue of Mr Wong’s management of YGG’s acquisition of YGIPL and I therefore deal with them together. Three particular decisions are the focus of the claimed breaches: (a) The decision not to utilise the SPA benefits granted to YGG; (b) The decision not to hire and second the core management team to YGG; and (c) The decision to delay the exercise of the Purchaser’s Call Option. 165 I begin by examining Mr Wong’s responsibility for these decisions. Mr Wong’s responsibility to manage the acquisition of YGIPL 166 It is not in dispute that Mr Wong’s role and responsibility was to manage the affairs of YGG, including leading the exercise of the Purchaser’s Call Option. Indeed, it would not be inaccurate to suggest that Mr Wong jealously guarded this responsibility, and voiced his displeasure whenever Mr Liong tried to undertake a greater degree of involvement in managing YGG. Three examples illustrate this point: (a) In his Affidavit of Evidence in Chief, Mr Wong highlighted that he had always been the contact person for the deal with the Vendors, and claims that he was “usurped” from his role in the company, YGG, that he had “so painstakingly developed”.195Foot Note 195×JAEIC, p 10.Mr Wong also highlighted that at the beginning of his business relationship with Mr Liong, it was the common understanding of the parties that he would be the one “running the business of the [Target Companies]” post-acquisition since he was the one with the experience and technical knowledge, and Mr Liong would participate as a “passive investor”.196Foot Note 196×JAEIC, p 11.This indicates that Mr Wong saw himself as the central decision maker in the company. (b) During a WhatsApp conversation in November 2015, when Mr Liong attempted to push Mr Wong to exercise the Purchasers’ Call Option by December, Mr Wong replied: “Hi Simon, as per discussion we should not close out due to timing. It has to be close outwheni am comfortable. It is a call thati have to make” [emphasis added]. Mr Wong also highlighted that the decision to exercise the Purchasers’ Call Option was a “captain’s call”.197Foot Note 197×JAB Volume 6, p 2906.Mr Wong thus made clear to Mr Liong that, consistent with their understanding at the beginning of their business relationship, he would be the one making the final decision on the timing of the full acquisition of the Target Companies. (c)  Mr Liong gave evidence that Mr Wong insisted that he would be the only point of contact in dealing with the shareholders of the Target Companies and did not allow Mr Liong to engage the Vendors.198Foot Note 198×JAEIC, p 234.This is corroborated by a WhatsApp message sent on 9 September 2015 where Mr Wong chided Mr Liong for approaching one of the Vendors for his contact details during a meeting with the Vendors, telling Mr Liong that “[t]his is also very wrong and something we cannot do … Just to let you know that it will always be better to ask as you are not familiar with rules in M&A”.199Foot Note 199×JAB Volume 6, p 2886.This demonstrates that Mr Wong actively restricted Mr Liong’s access to the Vendors, and consequently, this would make it practically difficult for Mr Liong to contact the Vendors to exercise the Purchasers’ Call Option. 167 Therefore, I find that Mr Wong assumed responsibility as the primary decision maker in YGG and had actively prevented Mr Liong from intervening. I now turn to examine YGG’s interests in relation to the three decisions made by Mr Wong. The best interests of YGG 168 Under the SPA, YGG was granted the SPA benefits (see [19(d)] above), specifically, the rights to: (a) Nominate two persons to be appointed as directors of YGIPL; (b) Nominate one person to be a signatory for YGIPL’s bank accounts for amounts in excess of RMB10,000; (c) Nominate an Understudy to Ms Mao; and (d) Have the wages and accommodation of the Understudy be paid for by YGIPL. 169 As Mr Wong conceded during cross examination,200Foot Note 200×NE Day 3, p 143.it was plain that it was in YGG’s best interest to have capitalised on these rights as soon as possible in order to give YGG a measure of control and oversight over YGIPL and facilitate the eventual takeover of YGIPL. For similar reasons, there is no dispute that it was in the best interest of YGG for the core management team to be seconded to YGG as soon as possible. 170 In relation to the exercise of the Purchaser’s Call Option, it is clear that the SPA was structured in such a way as to incentivise the expedient exercise of the Purchaser’s Call Option:201Foot Note 201×JAB Volume 1, p 98. (a) Clause 7.3 of the SPA mandates that if the aggregate net profit after tax (“NPAT”) earned by the Target Companies exceeds that of the previous year, dividends would have to be declared based on 50% of the NPAT for the period from 19 August 2015 to 31 December 2015, or to the date of exercise of the Purchaser’s Call Option, whichever is earlier. (b) Clause 7.4 of the SPA mandates that if similar conditions are met for the year 2016, dividends would have to be declared based on 50% of the NPAT for the period from 1 January 2016 to 31 December 2016, or to the date of exercise of the Purchaser’s Call Option, whichever is earlier. (c) Clause 7.5 of the SPA provides that the distribution of dividends would be based on the parties’ respective shareholdings in YGIPL immediately prior to the exercise of the Purchaser’s Call Option or the Vendors’ Call Option (as the case may be). (d) Clause 7.6 mandates that if dividends are declared in accordance with clauses 7.3 and 7.4, YGIPL would pay Ms Mao an incentive amount based on 8% of the NPAT for the period from 19 August 2015 to the date of the exercise of the Purchaser’s Call Option. 171 The effect of these provisions was that the later the Purchaser’s Call Option was exercised, the more dividend would be paid to the Vendors, rather than to YGG, and the greater the amount that would be paid to Ms Mao as an incentive. Additionally, if the Purchaser’s Call Option were to lapse on 19 August 2016, the Vendors would have the option of purchasing 40% of YGIPL back from YGG at a 10% discount (see [19(c)] above). It was thus in YGG’s best interest to exercise the Purchaser’s Call Option as soon as possible, despite the outer limit of the August date. 172 Hence, it is clear that Mr Wong’s decisions in failing to capitalise on the SPA Benefits, failing to second the core management team and delaying the exercise of the Purchaser’s Call Option were not in YGG’s best interest. However, the fact that the decisions were detrimental to YGG’s interest alone is insufficient to support a finding that Mr Wong was not actingbona fidein the best interests of YGG (see [152(a)] above). The critical question is whether Mr Wong acted honestly and in good faith in making these decisions. For the reasons that follow, I find that Mr Wong did not meet this standard. Mr Wong’s lack of honesty and good faith (1) Mr Wong’s awareness on the urgency in the exercise of the Purchaser’s Call Option 173 The circumstances demonstrate that Mr Wong knew it would be in the best interest of YGG to exercise the Purchaser’s Call Option as soon as possible. Mr Wong, on behalf of YGG, had led a fairly extensive examination of the Target Companies prior to the signing of the SPA. This included the commissioning of a legal due diligence, meetings with the Vendors, as well as a site visit (see [14] above). This was the logical course to take because once the SPA was signed, YGG would be locked into an arrangement where they had to exercise the Purchaser’s Call Option within a year, or risk allowing the Vendors to purchase back the 40% of YGIPL shares at a 10% discount. Mr Wong was clearly cognizant of this risk. In an email date 3 March 2015 sent to Mr Lim, Mr Wong stated:202Foot Note 202×JAB Volume 1, p 559. We are okay for you to include a sell on clause should our team fail to exercise our option to purchase the remaining 60% share within a stipulated 12 month period. This is highly unlikely to happen as our sole objective of proceeding with the deal is for a 100% ownership of the company. Allowing for this clause is our way toassure you thatwe are sincere about the acquisitionand will want a win win outcome for both parties concerned. … [emphasis added] 174 It is also not disputed that during various meetings prior to the signing of the SPA, Mr Wong reassured Mr Liong that the Purchaser’s Call Option would be exercised very soon after August 2015, around September 2015.203Foot Note 203×JAEIC, p 248.Mr Wong subsequently told Mr Liong on 18 May 2015 that it would be better to push the exercise of the Purchaser’s Call Option till December 2015 to “play safe”.204Foot Note 204×JAB Volume 6, p 635.I would add that as the primary point of contact for YGG in the negotiation process with the Vendors, and an individual who had taken an active part in the structuring of the SPA (see [12] above), it would be extremely unusual for Mr Wong not to have noticed that the SPA was structured precisely to incentivise the early exercise of the Purchaser’s Call Option (see [170]–[171] above). 175 Thus I find that Mr Wong knew that once YGG entered into the SPA, there was a certain urgency in terms of the timing of the exercise of the Purchaser’s Call Option and it would be in the best interest for YGG to exercise the option expediently. This agreement in the SPA was not unduly detrimental to YGG because as Mr Wong himself suggested to Mr Lim in the email reproduced above at [173], the sole objective of the deal was to fully acquire YGIPL. 176 Following from this, Mr Wong must have known that the SPA Benefits would have to be utilised and the core management team would have to be seconded as soon as possible in order to support the expedient exercise of the Purchaser’s Call Option. 177 Despite this awareness, Mr Wong refused to take action. This alone does not prove Mr Wong was dishonest. He could, for example, have honestly believed that the circumstances had changed so significantly that it was not in the interest of YGG to exercise the Purchaser’s Call Option and hence it was also not necessary to capitalise on the SPA Benefits or second the core management team. However, an examination of the actual reasons given by Mr Wong for his actions betray his dishonest intentions in this regard. (2) The reasons given by Mr Wong in relation to the failure to capitalise on the SPA Benefits 178 Mr Wong could not come up with a coherent explanation for why he honestly believed it was in the best interest of YGG not to have capitalised on the SPA Benefits. His reasons vacillated wildly at different stages of the proceedings. At the pleadings stage, Mr Wong suggested that the discovery of the outstanding due diligence issues (see [40] above) and the “seizure of control” during the EGM of 22 March 2016 (see [35] above) made it such that he was unable to cause YGG to capitalise on the SPA benefits. However, all the acts in his pleaded case occurred after 3 February 2016, some six months after the execution of the SPA, hence these reasons could not have been the actual reason why Mr Wong refused to capitalise on the SPA Benefits at the time. 179 During cross examination, Mr Wong changed tack and suggested that nominating a signatory to YGIPL would be detrimental to YGG because there was a chance that the signatory would accidentally sign off on inaccurate cheques that were deliberately tampered with by the management of YGIPL.205Foot Note 205×NE Day 3, pp 143–146.This explanation made no sense. If the management of YGIPL were tampering with cheques, discovery and rectification would have been easier with the involvement of a YGG representative. 180 In closing submissions, Mr Wijaya made the suggestion that the clauses put an obligation on the Vendors to relinquish control of the company but this was not done and consequently, Mr Wong could not be faulted for not nominating the relevant persons.206Foot Note 206×Plaintiff’s Written Submissions, pp 45–47.Insofar as the Vendors had an obligation to demonstrate a willingness to provide the SPA benefits, I note that as early as 21 February 2016, Mr Lim had sent an email stating the surprise and disappointment on the part of the Vendors that YGG had yet to nominate persons to capitalise on the SPA benefits, despite 6 months having elapsed since the execution of the SPA (see [74] above).207Foot Note 207×JAEIC, p 142;This demonstrates that the Vendors were at all times ready and willing to accept any nominations from YGG. It was clear that it was Mr Wong’s intransigence that led to the failure to capitalise on the SPA benefits. (3) The reasons given by Mr Wong for the failure to second the core management team 181 Mr Wong’s defence to the failure to second the core management team is that the Deed of Undertakings was not applicable at the relevant time and it was premature for him to hire and second the core management team to YGG.208Foot Note 208×Plaintiff’s Written Submissions, p 48.I have found that the obligations under the Deed of Undertakings arose after the execution of the SPA (see [78] above). However, this alone does not render Mr Wong dishonest, Mr Wong could have honestly believed the Deed of Undertakings was not applicable at the relevant time. 182 Unfortunately, this excuse rings hollow when seen in light of the overall context of the case and the findings made (see [68]–[75] above). I reiterate that Mr Wong initially operated on the premise that the Deed of Undertakings was effective after the execution of the SPA, and it was only after the commencement of Suit 104 that his position changed. Even then, he was not consistent as to why the Deed of Undertakings did not apply. As such, I do not believe that Mr Wong honestly believed that the Deed of Undertakings was not applicable and Mr Wong’s defence on this point fails. (4) The reasons given by Mr Wong for the delay in the exercise of the Purchaser’s Call Option 183 Mr Wong first confirmed that there would be a delay in the exercise of the Purchaser’s Call Option (to after December 2015) in a series of WhatsApp group conversation messages sent by Mr Wong to Mr Liong, Mr Iskandar and Mr Ang on 19 November 2015:209Foot Note 209×JAB Volume 6, p 2906. 11/19/15, 4:10 PM [Mr Liong]: Hi Henry We hv already pushed back the exercise date several times. Hope we can exercise in Dec as planned. 11/19/15, 4:27 PM [Mr Wong]: Hi Simon, as per discussion we should not close out due to timing. It has to be close out when i am comfortable. It is a call that I have to make. 11/19/15, 4:33 PM [Mr Wong]: I think this was also spoken at length to you in China. We didnt even visit China for 1st month due to the problem we had when you inserted the YG Log instead of purchaser. When we were ready, we had a dispute over DD cost which was back in Oct. Towards the end of Oct when we are ready, golden week holiday came. Early Nov Maoli was travelling. We have just only completed our 1st board meeting. Hoped you understand why we were unable to meet the scheduled timeline. It is abt playing catch up. Unless asset tagging is done, unless i am comfortable of the business, we should not exercise. It is captain’s call and i have to protect every party’s interest including your investment. 11/19/15, 6:06 PM [Mr Liong]: Hi Henry We didn’t speak at length in Shanghai at Le Grand Meridien on this exercise issue. We spoke for more than an hour about KV’s LOI. In fact we didn’t talk about exercising of 60% option at all. It was during the following day’s lunch after the Board Meeting that I popped the question of when are we going to exercise. You shook your head as CK was approaching the table and I couldn’t hear what you were trying to say. 11/19/15, 6:10 PM [Mr Wong]: Hi Simon, key is not to be press into exercising. We have our internal delays. We are playing catchup. Asset tagging first, 2nd get the full year numbers in. 3rd get ops in and financial insight. Once done, we will exercise. 184 In this exchange, Mr Wong gave several reasons why it was not, in his view, prudent to exercise the Purchaser’s Call Option by December 2015. Mr Wong highlighted that the parties’ dispute over the amendment of the SPA in favour of YGL (see [22] above) and the dispute on the due diligence costs (see [23] above) delayed the exercise of the Purchaser’s Call Option. However, these disputes were internal to YGG, and the parties could have simultaneously worked through these matters while pushing for the exercise of the Purchaser’s Call Option, bearing in mind the fact that YGG would have to share a greater amount of the dividends of YGIPL and pay a higher amount of incentive to Ms Mao the longer the exercise took. In any event, it was clear by that point that these disputes had been resolved, and it was in YGG’s interest for Mr Wong to quickly set about the task of exercising the Purchaser’s Call Option. 185 Instead, Mr Wong provided three other reasons why the exercise of the Purchaser’s Call Option ought to be further delayed, namely, the need for asset tagging, the need for “full year numbers” and the need to get operational and financial insight into the Target Companies (see [30] above). It is significant to note that none of these reasons were part of Mr Wong’s pleaded case as to why he honestly believed that it was in the best interest of YGG to delay the exercise of the Purchaser’s Call Option. Additionally, these reasons do not hold up to scrutiny. 186 When challenged by Mr Liong on the necessity of asset tagging before the exercise of the Purchaser’s Call Option, Mr Wong claimed that asset tagging was required because the “purchase price is also dependent on actual assets”.210Foot Note 210×JAB Volume 6, p 2907.It is unclear what Mr Wong meant by this statement. If Mr Wong meant that the purchase price of YGIPL would change based on a valuation of the assets of the company, this was plainly untrue, since the purchase price had already been agreed within the SPA. If Mr Wong was suggesting that it would be prudent to check the total valuation of the assets, in order to protect YGG’s interest, this was an issue that should have been resolved in advance of entry into the SPA. As Mr Wong was well aware, once the SPA was executed, YGG would be suffer greater financial drawbacks the longer they took to exercise the Purchaser’s Call Option. In this regard, even prior to the execution of the SPA, Mr Wong was sufficiently reassured after his investigations into the Target Companies and the due diligence conducted by the firms Mr Wong himself had lionised (see [5] above) that the complete acquisition of YGIPL was a good deal for YGG (see [11] and [14] above). I also observe that asset tagging was completed by Mr Ang within the short span of a week (see [29] above), which suggests that asset tagging was not such a serious barrier to the exercise of the Purchaser’s Call Option as suggested by Mr Wong. 187 In relation to Mr Wong’s suggestion that there was a need to get operational and financial insight into the Target Companies, it was similarly unusual that sufficient operational and financial insight was not already obtained prior to the execution of the SPA through the due diligence exercises and the meetings and site visits conducted. 188 As to the need for “full year numbers”, this subsequently morphed into a suggestion by Mr Wong that the audited accounts of YGIPL needed to be obtained before the Purchaser’s Call Option could be exercised.211Foot Note 211×JAB Volume 6, p 2908.Mr Wong suggested in an email sent on 21 December 2015 to Mr Liong that:212Foot Note 212×JAB Volume 2, p 1038. As per M&A norms, so long as we do not have full clarify on the final year’s number, we cannot exercise the option to buy the 60%. This is clearly mentioned in all my explanations and it is non negotiable as it will mean acceptance and paying out their dividends to the exiting share holders. The lead time between exercising of 40% of the final execution of 60% is too short a time to make a move. 189 It is unclear what Mr Wong meant by “M&A norms”. If a lengthy delay in the exercise of the Purchaser’s Call Option was an “M&A norm”, one would have expected that Mr Wong would not have committed to December 2015 as the date for the exercise of the Purchaser’s Call Option in May 2015 (see [174] above). Further, there is nothing in the SPA that prevents YGIPL from declaring dividends on the basis of the management accounts of the company, and in fact this was what eventually occurred. Moving to the suggestion that YGG would be short-changed if an audit was not conducted, as the dividends declared would be based on unaudited accounts, this was an inherent feature of the structure of the SPA that had been agreed as between the parties; Either audited accounts were used to declare the dividends, in which case the Purchaser’s Call Option would be delayed and YGL would have to give Ms Mao a greater incentive and share more of the dividends with the Vendors, or the unaudited accounts were used. Yet, Mr Wong as the primary negotiator of the SPA on behalf of YGL did not raise this as a concern until some four months after the SPA was entered into, and even committed to a December 2015 exercise date. 190 On 16 February 2016, Mr Wong shifted his position and suggested that the Second Due Diligence was necessary before the Purchaser’s Call Option could be exercised, and further, the due diligence had to led by the exact same auditors who led the initial financial due diligence exercise (see [32] above). As is apparent, this was not a requirement that Mr Wong highlighted to Mr Liong at any point during the process leading up to the execution of the SPA, and even up till December 2015, when Mr Liong was pushing Mr Wong to exercise the Purchaser’s Call Option. Mr Wong claimed in an email dated 21 March 2016 that the reason he was insisting on the Second Due Diligence was that YGG had a contractual obligation to conduct the due diligence prior to the exercise of the Purchaser’s Call Option.213Foot Note 213×JAB Volume 3, p 1269.There is no such obligation and Mr Wong conceded as much during cross examination.214Foot Note 214×NE Day 5, p 45–47.Additionally, if Mr Wong honestly believed that the results of a Second Due Diligence were important in clarifying the viability of YGIPL as an acquisition target, Mr Wong’s prior negotiations with Mr Lim would make no sense. In such a scenario, it would run contrary to YGG’s interest to have negotiated, as Mr Wong did, for a clause that YGG would suffer a 10% loss in the event that the Vendors exercised the Vendor’s Call Option. Mr Wong even expressly told the Vendors that he had no issues with such a clause, as he wanted to assure them of YGL’s “sincerity” in the 100% acquisition of YGIPL (see [173] above). Mr Wong also conceded during cross examination that the first set of legal and financial due diligence was “actually pretty satisfactory”.215Foot Note 215×NE Day 4, pp 194–195. 191 After the Second Due Diligence was completed on 14 April 2016, Mr Liong pressed Mr Wong to follow up on the Second Due Diligence Report in order to proceed with the exercise of the Purchaser’s Call Option.216Foot Note 216×JAB Volume 3, pp 1487–1488.It was only on 15 May 2016 that Mr Wong finally raised the fact that there were “outstanding due diligence issues” which were required to be resolved before YGG could exercise the Purchaser’s Call Option. This is the only remaining reason for the delay left in Mr Wong’s pleaded case.217Foot Note 217×Bundle of Pleadings for Suit 80 of 2017, pp 260–261On this point, I agree with Mr Lobo’s submission that the issues flagged out as “outstanding due diligence issues” were substantially the same as issues that had already been raised in the First Due Diligence Report.218Foot Note 218×D1 CS, p 72; D1 CS, Annex 4.Mr Wijaya suggests that the Second Due Diligence Report highlighted that the Target Companies were likely to lose one major customer namely, Hangzhou Wei Chuan Foods Co Ltd (“Wei Chuan Foods”), and this was not raised in the First Due Diligence Report.219Foot Note 219×Plaintiff’s Written Submissions, pp 42–44.However, I accept the evidence of Mr Liong and Mr Ang that all parties already knew about the loss of Wei Chuan Foods as a customer even prior to the execution of the SPA.220Foot Note 220×YG Group Pte Ltd, Skeletal Reply, pp 2–3.If Mr Wong was acting honestly in YGG’s interest, it is difficult to understand why he would push for YGG to delay the exercise of the Purchaser’s Call Option on the basis of a report that merely flagged out problems that were already known to the parties prior to the execution of the SPA, bearing in mind that YGG had entered into the SPA nonetheless. 192 As a further demonstration of Mr Wong’s dishonest intentions, I highlight that, in the course of negotiations with YKL on the purchase of YGIPL, Mr Wong suggested to Mr Shortell in an email sent on 15 July 2016 that both the First and Second Due Diligence Reports as well as the Legal Due Diligence Report would be “crucial” to move the deal forward and proposed sending the reports to YKL.221Foot Note 221×JAB Volume 4, p 1737.This demonstrates that Mr Wong believed that the due diligence reports reflected positively on YGIPL and would incentivise YKL to purchase YGIPL. This was during the same period where Mr Wong was relying on the very same Second Due Diligence Report as the basis for his claim that it was unwise to exercise the Purchaser’s Call Option. (5) The significance of the omissions and excuses 193 Having considered the totality of Mr Wong’s actions highlighted above at [173]–[192], I find that Mr Wong was dishonest. Mr Wong failed to capitalise on the SPA Benefits, failed to embed the core management team with YGIPL and thereby acted contrary to YGG’s best interest. Mr Wong delayed, time and again, the exercise of the Purchaser’s Call Option, knowing it was deleterious to YGG’s interest. Mr Wong drip-fed a series of shifting and illogical excuses for delaying the secondment of the core management team and the exercise of the Purchaser’s Call Option. At the same time, his actions indicate that he had no honest belief in the excuses which he furnished Mr Liong. Finally, he advised Mr Liong not to proceed with the exercise of the Purchaser’s Call Option, knowing that this would occasion immediate loss to YGG, while at the same time trying to sell YGIPL to YKL. (6) Mr Wong’s lack of funds 194 Mr Wong’s motivation for his dishonesty was also laid bare at trial. While Mr Wong was delaying the exercise of the Purchaser’s Call Option, he was secretly meeting with representatives from YKL without YGL’s knowledge to structure a deal on the potential acquisition of YGIPL, despite the fact that YGG was concurrently grappling with precisely the same acquisition (see [33]–[40] above). Mr Wong’s dogged attempts in striking a deal, first with KV Asia and later clandestinely with YKL, coupled with the fact that he had to borrow money from Mr Liong to finance MCH’s purchase of YGG’s shares, reveal the reasons behind Mr Wong’s attempts to delay the exercise of the Purchaser’s Call Option. What is common to the KV Asia Offer and the YKL Offers is that Mr Wong would not need to contribute any additional cash to the venture. On the other hand, upon the exercise of the Purchaser’s Call Option, MCH would be obliged to subscribe to US$4,290,000 worth of YGG shares (see [20] above). Additionally, under the terms of the Deed of Undertakings, Mr Wong was obliged to bear a proportion of the cost of seconding the core management team.222Foot Note 222×JAB Volume 1, pp 272–273.These facts reveal the true motives for Mr Wong’s decisions. 195  In my view, after the KV Asia Offer fell through, Mr Wong was unable to locate the funds necessary in the event of the exercise of the Purchaser’s Call Option and to pay for the core management team. Mr Wong’s own pleaded position is that the alleged conspiracy by the YGL parties caused “difficulty in raising funds” and impacted MCH’s ability to subscribe to the second tranche of YGG shares,223Foot Note 223×Bundle of Pleadings for Suit 107, p 273.which fortifies the conclusion that Mr Wong was simply unable to locate funds. I therefore find that he lacked capital at the material time to subscribe for the second tranche of shares in YGG in order to enable YGG to exercise the Purchaser’s Call Option. Conclusion on the breaches linked to the decisions of Mr Wong in relation to the acquisition of YGIPL 196 I have found that Mr Wong acted dishonestly in failing to capitalise on the SPA Benefits and failing to hire and second the core management team as soon as possible. In relation to the delay in the exercise of the Purchaser’s Call Option, Mr Lobo argues that Mr Wong was in breach of his fiduciary duties as early as at 31 December 2015, even though the Purchaser’s Call Option could be exercised as late as at August 2016. I agree with Mr Lobo on this point. I note that Mr Wong had knowledge that the SPA was structured in a manner to incentivise YGG to exercise the Purchaser’s Call Option expediently (see [175] above). The plan communicated by Mr Wong in May 2015 was for the Purchaser’s Call Option to be exercised in December 2015 (see [174] above). The gist of the information available to Mr Wong did not change from May 2015 (the time he communicated this plan) up to 31 December 2015. Instead of acting honestly and exercising the Purchaser’s Call Option as planned, Mr Wong was dishonest to the YGG board as early as 19 November 2015, by concocting the first of many sham excuses to delay the execution of the Purchaser’s Call Option. In the circumstances, I find that no honest fiduciary acting with Mr Wong’s knowledge would have delayed the exercise of the Purchaser’s Call Option past 31 December 2015, and Mr Wong was in breach of his fiduciary duty to actbona fidein the best interest of YGG as at 31 December 2015. 197 I have found that Mr Wong lacked capital at the material time to subscribe for the second tranche of shares in YGG (see [195] above). Mr Wong was therefore in breach of the no-conflict rule by failing to disclose that MCH had no money to subscribe for the second tranche of shares in YGG. Mr Wong had a personal interest in ensuring that the Purchaser’s Call Option was not exercised, so that MCH would not have to subscribe to the second tranche of shares. Conversely, YGG’s interest was for the Purchaser’s Call Option to be exercised expediently. Mr Wong’s failure to fully disclose this conflict to the YGG Board was a breach of fiduciary duty. His failure to disclose was intentional, and he further omitted to answer Mr Liong’s direct query on the issue. When Mr Liong specifically asked Mr Wong on 1 May 2016 as to whether Mr Wong had the necessary funds, Mr Wong simply ignored the question.224Foot Note 224×NE Day 5, pp 54–55; JAB Volume 3, pp 1511.",
        "Failing to disclose the YKL Offers": "198 It is not disputed that a failure to disclose the YKL Offers (see [40] above) would constitute a breach of Mr Wong’s duty to actbona fidein the best interest of YGG. Mr Wijaya argues that Mr Wong did in fact disclose the YKL Offers.225Foot Note 225×Plaintiff’s Written Submissions, p 55. 199 In support of his argument, Mr Wijaya highlights a letter from MCH to YGL dated 15 July 2016 which states:226Foot Note 226×JAB Volume 4, 2258 … I am advised that by your Wrongful Actions, you have shown that, in breach of our various agreements, you do not wish to continue our JV. Consequently, we have a claim against YGL and you for all losses suffered. However, before we engage in further litigation, as an alternative, I would like YGL and you to consider the following options:: 1st option – for me to find an investor to buy our shares in YGG and takeover the acquisition of the Targets (“the New Investor”) … 200 I find that this bare reference to the possibility of Mr Wong finding an investor falls far short of the level of full informed disclosure that was required of Mr Wong. The option was only phrased in tentative terms, and suggested that Mr Wong had yet to find an investor. In truth, Mr Wong had been negotiating with YKL since late February 2016. By July, not only had Mr Wong found an investor, YKL had already made a second offer on 14 July 2016, one day before this letter was sent to YGL (see [40] above). Mr Wong had negotiated this offer in secret and entirely without Mr Liong’s knowledge. Therefore, I find that Mr Wong did not give full disclosure of the YKL offers. 201 When Mr Wong was cross-examined on the stand, he sought to explain away his omission by saying that he believed that Mr Liong would not accept the Second YKL Offer in any event, because he had earlier turned down the KV Asia Offer:227Foot Note 227×NE Day 4, p 172. Q: So despite Mr Liong specifically bringing to your attention that he doesn’t know who the investor is, he doesn’t know what the purchase price is and he doesn’t know anything about the deal, you still chose to keep it from him? A: Because I decided not to do it. It is because the consideration of the KV Asia deal was really a benchmark for me because the returns I don’t think Mr Liong would accept. Is because the KV Asia deal was around 10 million for him to exit, whereas this amount for 15.5 is only around 4.5 million above what we actually paid. I don’t think we will agree. That is why I let the deal lapse and I did not go ahead with the deal. So therefore from the YGG perspective itself, so I did not move ahead because probably the option price is probably not within the benchmark that we had for KV Asia. 202  This contention is clearly not sustainable. The KV Asia Offer was wholly different from the Second YKL Offer. The KV Asia Offer was premised upon the project going forward into an uncertain future with Mr Liong’s share diluted. The Second YKL Offer gave Mr Liong a clear exit with profit and would have come as a relief to him, since he lacked the core management team’s expertise in operating a cold chain logistics business. It was a deal with clear benefit to YGG, and in the circumstances, Mr Wong was in breach of his duty to actbona fidein the best interest of YGG.",
        "Concurrent breaches of the duty to exercise due care, skill and diligence": "203 It will be clear from the above that Mr Wong has also breached his statutory duty to use reasonable diligence and his common law duty to exercise due care, skill and diligence. The standard of care placed upon him in relation to this duty is also that of an expert in the cold chain logistics industry as well as in corporate mergers and acquisitions.228Foot Note 228×JAB Volume 1, p 318.In view of my findings on the breach of his fiduciary duties, and the more stringent standards and remedies thus applicable, I do not deal in detail with Mr Wong’s breach of his common law duties.",
        "Remedies for Suit 80": "204 Mr Lobo seeks the following relief:229Foot Note 229×D1 CS, pp 159–162. (a) The sum of US$300,000, being the profit Mr Wong gained from the Secret Commission Agreement. (b) The sum of RMB2,267,610.55, being the dividends on the profits made by the Target Companies from January 2016 to June 2016 payable to the Vendors under the SPA. While the Vendors were contractually entitled to dividends based on the profits made from January 2016 to the date of the exercise of the Purchaser’s Call Option, YGG managed to negotiate for the Vendors to allow the Target Companies to only declare dividends up till June 2016;230Foot Note 230×JAEIC pp 364–365. (c) The sum of RMB604,696.08, being the incentive paid to Ms Mao based on the profits made by the Target Companies from January 2016 to June 2016. It appears that this sum was also correspondingly reduced from the original entitlement due to Ms Mao because of the negotiations referred to in the preceding paragraph; (d) The sum of RMB360,000, being Ms Mao’s salary for the additional three months she stayed in the Target Companies; (e) The sum of RMB15,000, being the cost of commissioning a further financial audit of the Target Companies sometime around July 2016; (f) The sum of US$28,415.87, being the cost of commissioning the Second Legal Due Diligence; (g) A sum for loss of chance suffered by YGG by virtue of the failure to disclose the YKL Offers; and (h) Equitable compensation to be assessed in respect of the diminution in the value of YGG’s shares in YGIPL. Profit gained from the Secret Commission Agreement 205 It is not disputed that a fiduciary is not allowed to retain any profit derived from his breach of duty, and the court is entitled to order an account of profit in respect of any such sum (seeMona Computer Systems (S) Pte Ltd vSingaravelu Murugan[2014] 1 SLR 847 at [13] to [18]). In the present case, Mr Wong made a secret profit of US$300,000 through the Secret Commission Agreement in breach of the no-profit rule. Although the Secret Commission Agreement promised a total sum of US$380,000, Mr Lim confirmed on the stand that only US$300,000 was paid out to Mr Wong.231Foot Note 231×NE Day 12, pp 40–41.Mr Lobo confirmed in the course of oral closing submissions that YGG was only seeking the recovery of US$300,000 and not the full US$380,000. As such, I grant the remedy of an account of Mr Wong’s secret profit and award the sum of US$300,000. Equitable compensation claimed 206 Save for the profit gained from the Secret Commission Agreement, the rest of the losses claimed are equitable compensation claims. At the outset, I should mention that two different approaches to causation have been taken by the High Court. The Court of Appeal expressly left the point open inMaryaniSadeli v Arjun Permanand Samtani and another and other appeals[2015] 1 SLR 496 at [11]. The first categorises the breach of the fiduciary to determine the extent to which causation is to be proved. For present purposes, the relevant category dictates that where a fiduciary has breached his duty of honesty and fidelity, a plaintiff need only prove that the breach is in some way connected to the loss, and the evidential burden thereafter shifts to the fiduciary: seeQuality Assurance Management Asia Pte Ltd v Zhang Qing and others[2013] SGHC 96 (“QAM”),ThenKhek Koon and another v Arjun Permanand Samtani and another and other suits[2014] 1 SLR 245 (“ThenKhek Koon”),BeyonicsTechnology Ltd and another v Goh Chan Peng and others[2016] 4 SLR 472 (“Beyonics”);Tongbao(Singapore) Shipping Pte Ltd and another v Woon Swee Huat and others[2018] SGHC 165). The second and more recent approach is to use a “but-for” test across all cases of breach of fiduciary duties: seeWinstaHolding Pte Ltd and another v Sim Poh Ping and others[2018] SGHC 239 (“WinstaHoldings”) at [193]. 207 This difference in approaches to the issue of causation is not material to this case. For the losses claimed at [204(b)] – [204(g)], these losses are directly connected to the misfeasance. The higher threshold of the “but-for” test is clearly made out. For the loss claimed at [204(h)], being the diminution in the value of YGG’s shares in YGIPL, I hold that the existence of the loss itself has not been proved and hence a causation issue does not arise. My reasons follow. Dividends on the profits made by the Target Companies from January 2016 to June 2016 paid to the Vendors 208 I have found that Mr Wong was in breach of his duty to actbona fidein the best interest of YGG in delaying the exercise of the Purchaser’s Call Option past 31 December 2015. No honest fiduciary with the information available to Mr Wong would have made that decision (see [196] above). In the circumstances, it is clear that but for Mr Wong’s breach, YGG would have exercised the Purchaser’s Call Option by 31 December 2015 and the relevant dividends would not have been paid out to the Vendors. Hence, the claim for the sum of RMB2,267,610.55 is made out. Salary paid to Ms Mao for the additional three months 209 I accept Mr Lobo’s argument that if YGG had fully utilised the 12 months that it was granted under the SPA to nominate an Understudy to Ms Mao and if the core management team was properly deployed prior to the exercise of the Purchaser’s Call Option, there would have been a smooth transition in the change of management in YGIPL and the Target Companies.232Foot Note 232×D1 CS, p 176.In such a scenario, YGG would not have needed Ms Mao to stay an additional three months after the exercise of the Purchaser’s Call Option in order to facilitate the handing and taking over of the Target Companies. Therefore, it is clear that but for Mr Wong’s breach of duty in failing to ensure that YGG capitalised on the management rights under the SPA, as well as his breach of duty in failing to hire and second the core management team to YGG, YGG would not have incurred Ms Mao’s salary for an additional three months. Hence, the claim for the sum of RMB360,000 is made out. Cost of commissioning a further financial audit and the Second Legal Due Diligence 210 I accept Mr Liong’s unchallenged evidence that the further financial audit of the Target Companies sometime around June 2016 was for the purposes of calculating the dividends on the profits made by the Target Companies from January 2016 to June 2016.233Foot Note 233×JAEIC, pp 364–365; NE Day 8 p 3.I have found that but for Mr Wong’s breach, the dividends would not have needed to be paid to the Vendors (see [208] above). It follows that but for Mr Wong’s breach, there would have been no need for the further financial audit of the Target Companies. Hence, the claim for the sum of RMB15,000 is made out. 211 I also accept Mr Liong’s unchallenged evidence that YGG decided to appoint lawyers to conduct a Second Legal Due Diligence because they were unclear on the legal issues surrounding the acquisition (if any). This lack of clarity was precipitated by Mr Wong’s failure to capitalise on the SPA Benefits, which would have given YGG the opportunity to observe the business of the Target Companies up close in order to gain familiarity with any possible issues surrounding the Target Company. This was compounded by Mr Wong’s refusal to grant Mr Liong, Mr Ang and Mr Tan access to the final copy of the First Legal Due Diligence Report.234Foot Note 234×JAEIC, p 334.I find that this refusal to grant access was a part of Mr Wong’s dishonest attempt to stymie the exercise of the Purchaser’s Call Option. Hence, I find that but for Mr Wong’s breach of duty in failing to ensure that YGG capitalised on the SPA Benefits and also his breach of duty in delaying the exercise of the Purchaser’s Call Option, there would have been no need to conduct a Second Legal Due Diligence. Therefore, the claim for the sum of US$28,415.87 is made out. Loss of chance suffered by YGG by virtue of the failure to disclose the YKL Offers 212 YGG contends that by reason of Mr Wong’s breach of duties in failing to disclose the YKL Offers to the YGG board, YGG lost the opportunity to pursue the sale of the YGIPL shares to YKL. YGG therefore lost the chance to make a profit, through selling YGIPL after exercising the Purchaser’s Call Option. 213 Stuart-Smith LJ’s framework on the approach in cases where loss of chance is in contention as set out inAllied Maples Group Ltd v Simmons & Simmons[1995] 1 WLR 1602 (“Allied Maples”) at 1609–1614 has been used in various Singapore cases on loss of chance and is instructive as a starting point of reference: [W]here the plaintiff’s loss depends upon the actions of an independent third party, it is necessary to consider as a matter of law what it is necessary to establish as a matter of causation, and where causation ends and quantification of damage begins. (1) What has to be proved to establish a causal link between the negligence of the defendants and the loss sustained by the plaintiffs depends in the first instance on whether the negligence consists of some positive act or misfeasance, or an omission or non-feasance. … (2) If the defendant’s negligence consists of an omission, for example to provide proper equipment, [give] proper instructions or advice, causation depends, not upon a question of historical fact, but on the answer to the hypothetical question, what would the plaintiff have done if the equipment had been provided or the instruction or advice given? This can only be a matter of inference to be determined from all the circumstances. The plaintiff’s own evidence that he would have acted to obtain the benefit or avoid the risk, while important, may not be believed by the judge, especially if there is compelling evidence that he would not. … Although the question is a hypothetical one,it is well established that the plaintiff must prove on balance of probability that he would have taken action to obtain the benefit or avoid the risk. … (3) In many cases the plaintiff’s loss depends on the hypothetical action of a third party, either in addition to action by the plaintiff, as in this case, or independently of it. In such case, does the plaintiff have to prove on the balance of probability … that the third party would have acted so as to confer the benefit or avoid the risk to the plaintiff, or can the plaintiff succeed provided he shows that he had asubstantialchance rather than a speculative one, the evaluation of the substantial chance being a question of quantification of damages? … … [T]he plaintiff must prove as a matter of causation that he has a real or substantial chance as opposed to a speculative one.If he succeeds in doing so, the evaluation of the chance is part of the assessment of the quantum of damage, the range lying somewhere between something that just qualifies as real or substantial on the one hand and near certainty on the other. … [emphasis added] 214 The Court of Appeal inAsia Hotel Investments Ltd v Starwood Asia Pacific Management Pte Ltd and another[2005] 1 SLR(R) 661 (“Asia Hotel”)referenced the framework set out by Stuart-Smith LJ and, on the facts of that case, went on to apply the third proposition. In respect of this third proposition, the Court of Appeal set out a two stage test at [139] for cases where a claimant’s loss depended on the actions of a third party, as follows: (a) Did the breach on the part of the defendant cause the plaintiff to lose a chance to acquire an asset or a benefit? (b) Was the chance lost a real or substantial one, not one that was speculative? 215 Mr Lobo is of the view that satisfaction of the two criteria is sufficient. Mr Wijaya suggests that in order to establish causation, proof on the balance of probabilities that YGG would have acted in a certain way to avail itself of the chance is required, citingSports Connection Pte Ltd v Asia Law Corp and Another[2015] SGHC 213 (“Sports Connection”) at [12]. 216 InSports Connection, Belinda Ang Saw Ean Jrelied on the Court of Appeal case ofJSI Shipping (S) Pte Ltd vTeofoongwonglcloong (a firm)[2007] 4 SLR(R) 460 (“JSI Shipping”). There the plaintiff sued the defendant-auditors for negligently auditing the accounts, allowing a director to misappropriate a substantial amount. The court took the view that the plaintiff would not have taken the necessary steps to investigate the matter, even if the defendants had not been negligent. After referring to Stuart-Smith LJ’s framework, Chan Sek Keong CJ stated at [148]: 148 Translated into the context of the present case, the appellant needs to prove on a balance of probabilities that if the respondent had in fact taken adequate steps toward verification of Riggs’ remuneration and/or qualified the audit reports, the appellant in turn would have taken the necessary steps to investigate Riggs’ misappropriationvis-à-visthe unauthorised cheques and forged invoices. While the appellant need not prove the eventual success of the inquiries on a balance of probabilities, it does have to prove that it would in fact have investigated the matter so as to “put it on track to secure the benefit of that chance” … 217 In my view, the Court of Appeal inAsia Hotel, in setting out the two specific questions (see [214] above), was directing its mind to the specific issue of the third of Stuart-Smith LJ’s three propositions: responsibility for the loss of chance,wheresuch loss of chance was dependent on the third party. The court was not focused on the claimant’s actions but implicit in the Court of Appeal’s reasoning was that the claimant’s likely action was proved on the balance of probabilities. Chao JA stated at [141]: At no time did the appellant abandon its decision to acquire the stake. Business or bargaining strategy must not be confused with a lack of interest. Neither should Murray’s attempt to drive a hard bargain with Starwood with regard to the “key money” be viewed in any other light. 218 In these third category cases, the claimant’s act bears no relation to the loss of the chance. This category was the focal point inAsia Hotel. The claimant need only show on the balance of probabilities thathe would have availed himselfof the chance if it had arisen. This was the part of the analysis which was clarified inJSI Shipping, which referenced the earlierAsia Hoteldecision. 219 Reframing, then, the criteria highlighted byJSIShippingandAsia Hotel, YGG’s claim for loss of chance would be made out if: (a) Mr Wong’s breach of duties caused YGG to lose a chance to enter into an agreement with YKL to sell YGIPL to YKL; (b) YGG can prove on the balance of probabilities that it would have availed itself of the chance if Mr Wong did not breach his duties; and (c) The chance lost was a real and substantial chance. 220 I find that requirement (a) has been made out. Mr Wong’s breach of duty in failing to give full disclosure of the YKL Offers caused YGG to lose a chance to pursue a deal with YKL. Although the claim is for equitable compensation, this causal link is established even on the stricter “but for” test of causation. None of the YGL parties had knowledge of the YKL offers until Mr Liong coincidentally met Mr Ken Koh around May 2017.235Foot Note 235×JAEIC, p 386.The non-disclosure of the YKL offers therefore meant that YGG was denied the chance to pursue a deal. 221 As to requirement (b), I find that YGG can prove on the balance of probabilities that but for Mr Wong’s breach, YGG would have availed itself the opportunity to negotiate with YKL. Four reasons are relevant. First, at the point of the First YKL Offer in June 2016, the spectre of the exercise of the Vendor’s Call Option was rapidly approaching, and correspondingly, the possibility of being compelled to sell the 40% stake in YGIPL at a loss. Second, it was clear by that point that Mr Wong and Mr Liong’s relationship had deteriorated significantly, and the core management team was unlikely to play a part in the management of YGG. Third, both the First and Second YKL Offers represented a substantial profit from the total cost YGG would have spent to acquire YGIPL under the SPA. Fourth, YGL clearly had the financial means and desire to fund YGG’s exercise of the Purchaser’s Call Option, as was in fact done on 18 August 2016. In the circumstances, it was clearly advantageous for YGG to have struck an exit deal with YKL, taken the profit and be relieved of the burden of running the Target Companies without the expertise of the promised core management team. Stuart Smith LJ inAllied Maplesat 1610E has taken the view, that “where the action required of the plaintiff is clearly for his benefit, the court has little difficulty in concluding that he would have taken it.” 222 Regarding requirement (c), it was clear that the chance to enter an agreement with YKL was a real and substantial chance. Mr Ken Koh gave unchallenged evidence that he was highly interested in the acquisition. Mr Ken Koh explained that he was interested in acquiring the Target Companies due to economies of scale.236Foot Note 236×NE Day 14, pp 3–5.Based on the information on the Target Companies provided as well as site visits he personally conducted, he was of the view that the Target Companies were a good investment.237Foot Note 237×NE Day 14, pp 6–8.His evidence at trial was that his opening offer of $17.5m was only lowered to $15.5m because the Vendors did not seem keen to meet him, and he abandoned the second offer because Mr Wong could not arrange for him to meet the remaining two Vendors aside from Mr Lim. His position was that at the relevant time, if due diligence was successful and the conditions he imposed on the deal were met, the chance of YKL entering into a deal for the purchase of YGIPL was 80% to 90%. Additionally, Mr Ken Koh was serious enough to make two offers to Mr Wong. 223 The evidence thus suggests that YKL was at the very least, seriously contemplating a deal for the purchase of YGIPL to the extent that two offers were made, including a signed Letter of Intent (see [41] and [222] above). In the circumstances I find that the chance of YGG pursuing a deal with YKL was a real and substantial one, and this claim has been made out. In making this finding, I recognise several points that suggest the chance of achieving a deal was not as high or optimistic as Mr Ken Koh suggested: (a) Mr Lim gave evidence that he did not view Mr Ken Koh’s offers as serious offers, as the offers appeared to be an unsolicited and involved very little face-to-face negotiation.238Foot Note 238×NE Day 12, pp 21–22. (b) Due diligence had not yet been done by YKL. (c) YKL’s offer imposed a condition that Ms Mao stay with the Target Companies for a minimum of five years.239Foot Note 239×JAB Volume 4, 1733.The evidence suggests that it was only with some difficulty that YGG managed to convince Ms Mao to stay on for a further three months. (d) Mr Ken Koh was unaware of the intended departure of the Vendors. An assumption made in the context of planned integration with YKL at paragraph 12 of the Letter of Intent was that “the Target Companies [would] continue to be managed by the incumbent senior management team”.240Foot Note 240×JAB Volume 3, p 1712. (e) There is no certainty Mr Ken Koh would have maintained interest. By the time he met Mr Liong in 2017, he was no longer interested in YGIPL, because YKL had decided to focus on regions outside China.241Foot Note 241×NE Day 14, p 23. (f) Mr Ken Koh was not familiar with the true shareholding of YGIPL, and he approached the potential acquisition on the basis that he would be purchasing some portion of YGIPL from the Vendors, and not entirely from YGG.242Foot Note 242×JAEIC, p 520The structure and timing of the purchase would have required further negotiations. 224 In my view, these factors do not render the chance speculative, and are matters to be considered in the context of assessment of the applicable award for the loss of chance. InAsia Hotel, for example, the appellant wished to invest in the management of a hotel, the Grand Pacific Hotel, which was owned by a company called PSD and was negotiating with PSD’s majority shareholder. A minority shareholder held a right of first refusal in respect of shares in PSD. The appellant and the first respondent entered into an agreement to operate the Grand Pacific Hotel, and also signed a non-circumvention agreement. Subsequently, in breach of the non-circumvention agreement, the first respondent contracted with the Narula family in its bid to purchase the majority stake in PSD. Holding the first respondent liable for the appellant’s loss of chance, the Court of Appeal took note of various other contingencies at [130]: … The appellant would have to find a banker who would offer loans on terms which it and [the minority shareholder] could accept. The appellant and [the minority shareholder] would also have to agree on the question of control of PSD because taking over the Lai Sun stake would give the appellant a majority shareholding in PSD. Furthermore, the appellant would have to finalise the management contract with [the first respondent], including the question of the renovation loan. … 225 The majority of the Court of Appeal, being of the view that these contingencies did not render the chance speculative, stated, at [133] and [136], that: (a) It was not necessary for the plaintiff to prove, on a balance of probabilities, that the third party would have acted in such a manner as to confer the plaintiff the benefit in question; and (b) It was not necessary for such a plaintiff to show on a balance of probabilities that the chance would have come to fruition. 226 Turning, then, to the issue of the assessment of the loss of chance, Mr Lobo submits that the appropriate method of calculation is to multiply the probability of the event occurring by the value of the lost chance to ascertain the value of the loss. I note that this approach was approved in the context of a breach of fiduciary duty inQAMat [79], [80] and [86]. The value of the lost chance could be calculated by reference to the profit YGG would have made if it had managed to sell 100% of YGIPL to YKL for the price of the Second YKL Offer. This profit amounts to US$4.5m. 227 The probability of the event occurring in this case would correspond to the likelihood that YKL and YGG would have successfully negotiated a deal for the price of the Second YKL Offer. For example, Lai Siu Chiu J in the assessment decision forAsia Hotel(reported asAsia Hotel Investments Ltd v Starwood Asia Pacific Management Pte Ltd and Another[2007] SGHC 50) gave 34% to the probability of securing the Grand Pacific Hotel by assessing, weighting, and then adding the chances of the plaintiff obtaining financing, minority shareholder concurrence and securing the final management agreement. Mr Lobo submits that the probability of the event occurring should be 90% in light of Mr Ken Koh’s evidence (see [222] above). I find that a proper assessment of the probability ought to take into account the matters highlighted at [223] above. In particular, negotiations were at an extremely early stage. The profit margin would likely have whittled down first, on a discovery of the disagreement between shareholders, and second, in negotiations over the continued participation of Ms Mao and the rest of the incumbent management team. I set the probability of the event at 12.5%. In addition, the value of the loss should not be set at the full US$4.5m, because there would have been miscellaneous expenses saved or spent. Those details are not in the evidence. Nevertheless, the exercise of assessment in loss of chance cases, in view of the various contingencies that would require estimates, must be one where absolute precision is not possible. As Vaughn William LJ highlighted inChaplin v Hicks[1911] 2 KB 786 at 791, “certainty is impossible of attainment”. Rather than to send the profit margin to an assessment before a registrar, I am of the view that it is more practicable to set a conservative sum in the round. Therefore, using a base estimate of US$4m (instead of US$4.5m) and a percentage of 12.5%, I award US$500,000 for the loss of chance. Diminution in the value of YGG’s shares in YGIPL 228 The final head of claim is that of diminution in the value of YGG’s shares in YGIPL. It is argued that as a result of Mr Wong’s breach of duty in failing to hire and second the core management team to YGG, there was a diminution in the value of the shares of the Target Companies held by YGIPL, which in turn caused a corresponding diminution in the value of the YGIPL shares held by YGG.243Foot Note 243×D1 CS, p 198. 229 As a preliminary matter, I should deal with the reflective loss issue relevant to this head of claim. The principle of reflective loss dictates that a claim will not lie by a shareholder to make good a loss which would be made good if the company’s assets were replenished through action against the party responsible for the loss (seeJohnson v Gore Wood & Co(a firm)[2002] 2 AC 1 (“Johnson”) at 35). In the present case, the primary loss occasioned in this case is the loss of profit to the Target Companies, and the diminution in value of the YGG shares is reflective of the loss which would be made good if the Target Companies’ assets were replenished through an action taken by the Target Companies against Mr Wong. This does not pose issues for YGG in this case because the Court of Appeal inTownsingHenry George v Jenton Overseas Investment Pte Ltd (in liquidation)[2007] 2 SLR(R) 597 (“Townsing”) at [79] has held that if there is no risk of double recovery and no prejudice to the creditors or shareholders of the company, the policy reasons behind the decision inJohnsondo not apply. The Court of Appeal further noted at [87] that it may be highly prejudicial and unjust to allow a defendant who has failed to plead the principle of reflective loss as a defence to subsequently rely on the same principle to escape liability. In the present case, Mr Wong has not pleaded reflective loss as a defence although Mr Wijaya has referred to it in his submissions. Even if Mr Wong had done so, it is reasonable to assume that YGG would have been able to procure YGIPL and the Target Companies to give an undertaking not to bring an action against Mr Wong in respect of this claim, given that the Target Companies are wholly owned by YGIPL, which is in turn wholly owned by YGG. Thus, the reflective loss principal is not engaged. 230 Nevertheless, I find that this head of claim has not been made out. In the context of common law damages, it is well-established that a claimant must prove the fact of loss. A claimant who cannot prove that damage has been suffered cannot mount a claim in respect of the alleged loss. On the other hand, the fact that the amount of the loss cannot be assessed with certainty is not a bar to a claim (see James Edelman, McGregor on Damages (Sweet & Maxwell, 20th Ed, 2018) at pp 315–316). Belinda Ang J inSabyasachiMukherjee and another v Pradeepto Kumar Biswas and another suit[2018] SGHC 271 (“Mukherjee”) at [52] applied the same requirement of proof of loss to a claim in equitable compensation. I agree with the approach inMukherjee. 231 It is important to note that the Target Companies continue to be profitable. On the stand, Mr Ang testified that there was a drop in the net profits of the Target Companies when comparing between 2015 to 2016, from US$1.65m to US$1.1m.244Foot Note 244×NE Day 9, p 49.Mr Liong similarly confirmed that there was a drop in the comparative net profit of the Target Companies from 2015 to 2016.245Foot Note 245×NE Day 10, p 43.When asked about the net profit for 2017, Mr Liong stated that it was still profitable, but he thought there was a further drop, however, he did not have the exact figures.246Foot Note 246×NE Day 10, pp 43–44.No further evidence was led on the specifics of the decrease in net profit, nor was the court referred to the relevant financial accounts which would illustrate the factors that led to the decrease. The mere fact that a company makes less net profit compared to the previous year is, without more, insufficient in itself to prove the loss suffered by the company. Particulars of the alleged loss, such as accounts to illustrate the reasons for the fall in net profits, would be required to substantiate that the company has suffered damage, and the nature of the damage suffered. The vague estimates of the net profit given by Mr Ang and Mr Liong are far from sufficient. In oral submissions, Mr Lobo suggested that this could be put to an assessment before a registrar. This would only be feasible if the fact of loss was proven. 232 In making his case, Mr Lobo highlights Mr Wong’s representations that the core management team possessed the necessary expertise and experience to bring the Target Companies to greater heights. These representations are encapsulated in a projection made during a presentation in November 2014 from Mr Wong to Mr Liong that suggested that the profits of the Target Companies would increase from the base year of 2013, by 188% in 2015 and 255% in 2016.247Foot Note 247×JAB Volume 1, p 382.Nevertheless, Mr Lobo is not making the argument that the projections in the presentation were contractually binding promises, nor is he suggesting that there is a case in misrepresentation. Moreover, these early projections were expressly qualified by various assumptions which unsurprisingly, did not actualise, such as the Target Companies being fully acquired by 2014, “no loss of existing accounts” and a minimum year on year growth of the existing accounts at 17%.248Foot Note 248×JAB Volume 1, p 382. 233 In the present case, no loss is proved. The claim fails without the necessity of a full consideration of the issue of causation. Mr Lobo’s arguments nevertheless illustrate the instructive nature of Lord Toulson’s observation inAIBGroup (UK) plc v Mark Redler & Co Solicitors[2014] 3 WLR 1367 (“AIB”) at [70] that trusts which are commercial in nature have parameters marked by contract and it is artificial if a court does not take cognisance of those parameters. Referencing Lord Browne-Wilkinson inTargetHoldings Ltd v Redferns[1996] AC 421, Lord Toulson makes the point that the scope and purpose of a trust may vary, and this may have a bearing on the appropriate relief in the event of a breach. Referring at [71] to Professor David Hayton (inUnique Rules for the Unique Institution, the Trust, Degeling & Edelman (eds),Equity in CommercialLaw(2005, Lawbook Co) at pp 279-308), Lord Toulson highlights that: Rather, the fact that the trust was part of the machinery for the performance of a contract is relevant as a fact in looking at what loss the bank suffered by reason of the breach of trust, because it would be artificial and unreal to look at the trust in isolation from the obligations for which it was brought into being. 234 Lord Toulson’s statements inAIBwere made in the context of a commercial bare trust, whose contractual terms closely defined the fiduciary relationship. In my opinion, the point is one of wider relevance. In contrast to traditional trust relationships between beneficiary and trustee, within commercial relationships, parties deal with each other contractually to further their mutual interests. In so doing, each may expect the other to act as defined by their contractual obligations and to take reasonable steps to avoid or mitigate any loss. More so when an experienced businessman and an industry veteran have negotiated extensively on the applicable contracts ahead of a business venture with foreseeable risks. In the present case, while Mr Wong’s fiduciary obligations arise out of his position as a director,thisparticular head of lossthat YGG claims arises from the Deed of Undertakings, one of the multiple contractual documents which Mr Liong put in place to formalise their respective responsibilities. It is the Deed of Undertakings that gives rise to Mr Wong’s duty to second the core management team, in pursuit of which he has shown a lack of honesty and fidelity. There is no evidence, however, of the true capability of the team: YGG relies on the sales pitch of Mr Wong. Nor is there any evidence to show how the team would have fared any better than the management team that Mr Liong put in place in their absence. In these circumstances, where a claim for damages for breach of contract would fail because of the ‘but for’ test for causation, it would in my view be just to apply, for this particular head of claim, the same test to the claim for equitable compensation.",
        "Judgment in Suit 80": "235 I therefore grant judgment in Suit 80 in the sum of US$828,415.87 and RMB3,247,306.63 to YGG.",
        "Whether YGG ought to be wound up": "236 In Suit 107, MCH, Mr Wong and Mrs Wong contend that YGG, together with YGL, Mr Liong, Mr Tan and Mr Ang, were in a lawful or alternatively, unlawful, conspiracy. I have held in Suit 337 that there was no such conspiracy on the part of the defendants to that counterclaim. As for Suit 107, although Mr Wong’s pleadings named YGG as a party to the alleged conspiracies, his submissions do not attribute any acts of conspiracy to YGG. The commencement of Suit 104 and Suit 337 did not involve YGG. Neither is there any evidence to suggest that YGG was in any way involved in any of the acts that form the basis of Mr Wong’s claims in conspiracy. 237 There is, in addition, a wider assertion that it is “impossible to conduct the business of [YGG]” as it has become apparent that Mr Liong is no longer willing to work with Mr Wong in the joint venture.249Foot Note 249×Bundle of Pleadings for Suit 107, p 38.He requests for a winding up on the just and equitable ground pursuant to s 254(1)(i) of the Companies Act. 238 I find this wider assertion wholly without merit in the light of my findings in Suit 80. Mr Wong was wholly responsible for the missteps in YGG’s management, whose business is at present conducted by Mr Liong. The Court of Appeal inSim Yong Kim v Evenstar Investments Pte Ltd[2006] 3 SLR(R) 827 at [31] has stated that s 254(1)(i) of the Companies Act will not apply to a case where the loss of trust and confidence in the other shareholders is self-induced. Mr Wong’s breach of his fiduciary duties to YGG necessitated Mr Liong’s intervention. The Court of Appeal inPerennial (Capitol) Pte Ltd and another v Capitol Investment Holdings Pte Ltd and other appeals[2018] 1 SLR 763 (“Perennial”) at [40] has made clear that commercial unfairness is the foundation of the court’s jurisdiction under s 254(1)(i) of the Companies Act. There is no unfairness on the part of Mr Liong, whose action in taking control of YGG and its management has been reasonable. In any event, the presence of a buy-out mechanism allowing a disgruntled shareholder to exit also generally obviates a need to wind up a company on just and equitable grounds: seePerennialat [56].There is a buy-out mechanism in the present case, in clause 13 of the Shareholders Agreement.250Foot Note 250×JAB Volume 1, pp 130–135 and 152.This mechanism is currently the subject matter of arbitration proceedings which have been stayed pending the resolution of this dispute.251Foot Note 251×D1 CS, p 232.",
        "Judgment in Suit 107": "239 In the circumstances, Suit 107 is dismissed.",
        "Conclusion": "240 In Suit 104, I find that: (a) Mr Wong was in breach of Clause 1(b)–(d) of the Deed of Undertakings (see [78] above); and (b) MCH is not a party to the Deed of Undertakings, and thus did not breach the deed (see [89] above). 241 I therefore order damages to be assessed in respect of the expenses incurred by YGL in having Mr Ang understudy Ms Mao, and in having Mr Liong manage the company in preparation for the exercise of the Purchaser’s Call Option (see [91] above). 242 In Suit 337, I hold that: (a) Event of Default 1 is not made out as MCH did not breach the Deed of Undertakings (see [94] above); (b) Event of Default 2 is made out as the commencement of Suit 104 had, in the reasonable opinion of YGL, a material financial effect on MCH (see [102] above); (c) Event of Default 3 is made out as MCH failed to comply with clause 3.8 of the Deed of Share Charge (see [117] above); (d) Event of Default 4 is made out as MCH was in breach of clause 6.2.1 of the Shareholders’ Agreement (see [120] above); (e) Event of Default 5 is made out as MCH was in breach of clause 19 of the Shareholders’ Agreement (see [125] above); (f) Event of Default 6 is made out as MCH was in breach of clause 5.8 of the Shareholders’ Agreement (see [130] above); (g) Event of Default 7 is made out as MCH was in breach of clause 12 of the Subscription Agreement (see [132] above); (h) Event of Default 8 is made out as MCH was in breach of clause 7.2 of the Loan Agreement (see [134] above); and (i) There was no conspiracy, whether lawful or unlawful on the part of YGL and Mr Liong against MCH and Mr Wong (see [139]–[143]). 243 I therefore order judgment in favour of YGL in the suit, and dismiss the counterclaim. I award YGL the sum of S$4,568,631.94 with additional default interest up to today. 244 In Suit 80, I find that: (a) Mr Wong was in breach of the no-profit rule by failing to disclose the Secret Commission Agreement (see [161] above) and was in breach of the no-conflict rule by failing to disclose the Secret Trust Deeds (see [163] above); (b) Mr Wong was in breach of his duty to actbona fidein the best interest of YGG by delaying the exercise of the Purchaser’s Call Option past 31 December 2015 (see [196] above); (c) Mr Wong was in breach of the no-conflict rule by failing to disclose that MCH had no money to subscribe for the second tranche of shares in YGG (see [197] above); (d) Mr Wong was in breach of his duty to actbona fidein the best interest of YGG by causing YGG to refrain from capitalising on the SPA Benefits (see [196] above); (e) Mr Wong was in breach of his duty to actbona fidein the best interest of YGG by failing to hire and second the core management team to YGG (see [196] above); and (f) Mr Wong was in breach of the duty to actbona fidein the best interest of YGG by failing to disclose the YKL Offers (see [202] above). 245 I therefore grant judgment in Suit 80 in the sum of US$828,415.87 and RMB3,247,306.63 to YGG. 246 Suit 107 is dismissed. 247 I shall hear parties on costs. Valerie TheanJudge Sivanathan Wijaya Ravana (R. S. Wijaya & Co) for the plaintiffs in Suit 107, the defendant in Suit 80, the defendants in Suit 337 and the first and second defendants in Suit 104;Navin Joseph Lobo, Vani Nair, Shaun Oon Kim San and Yap Chun Kai (Bird & Bird ATMD LLP) for the first defendant in Suit 107, the plaintiff in Suit 80 and the third defendant in Suit 104;Soh Leong Kiat Anthony and Elias Benyamin Arun (Taylor Vinters Via LLC) for the second, third, fourth and fifth defendants in Suit 107, the plaintiff in Suit 337 and the plaintiff in Suit 104."
    }
}