{
    "case_title": "Management Corporation Strata Title Plan No 3556",
    "ncitation": "[2019] SGHC 70",
    "coram": "Vinodh Coomaraswamy J",
    "sections": {
        "The background": "",
        "The Building and its construction": "2 The Building is a nine-storey commercial building.3Foot Note 3×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 1.It comprises a total of 654 light industrial units and offices. 3 Management Corporation Strata Title Plan No. 3556 (the “MCST”) is the management corporation of the Building and the plaintiff in this action.4Foot Note 4×Statement of Claim (Amendment No 2) at paragraph 1. 4 Orion-One Development Pte Ltd (“Orion-One”) is the developer of the Building and is the first defendant in this action. It has been in members’ voluntary liquidation since May 2014.5Foot Note 5×1st Defendant’s Defence (Amendment No 3) at paragraph 9. 5 Sanchoon Builders Pte Ltd (“Sanchoon”) was Orion-One’s main contractor in the construction of the Building6Foot Note 6×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 2c and 3a.and is the second defendant in this action. Sanchoon in turn engaged various sub-contractors.7Foot Note 7×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 39. 6 Sanchoon and its sub-contractors jointly provided several warranties to Orion-One (the “Warranties”). The Warranties covered various aspects of the Building, such as its cladding, waterproofing and roof.8Foot Note 8×Agreed Bundle of Documents, vol 5, at pp 4403, 4422 and 4437.Orion-One purports to have assigned the Warranties to the MCST by a deed of assignment dated 22 November 2013 (the “Deed”).9Foot Note 9×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 253.As I explain later (see [87]–[89] below), the effect of the Deed is disputed. 7 The Temporary Occupation Permit for the Building was issued in July 2009. The Certificate of Statutory Completion was issued in December 2009.10Foot Note 10×Statement of Claim (Amendment No 2) at paragraph 7.Orion-One handed over management of the Building to the MCST in November 2010.11Foot Note 11×See for example Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 37(i)(a).",
        "Discovery of the defects": "8 In or around February 2012, the chairman of the MCST, Mr David Ong, began to notice defects in the Building. These defects included cracks in the walls, water seepage, and water ponding.12Foot Note 12×Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 16.Mr David Ong instructed the MCST’s managing agent to compile a list of defects.13Foot Note 13×Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 18.This list of defects was then sent to Orion-One.14Foot Note 14×Affidavit of Evidence in Chief of Ong Choon @ David Ong at pp 349–352.A joint inspection of the Building was conducted in October 2012.15Foot Note 15×Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 23. 9 Following the joint inspection, Sanchoon carried out works to rectify the defects.16Foot Note 16×Affidavit of Evidence in Chief of Ting Chin Seng at paragraph 26 and Agreed Bundle of Documents, vol 6, p 5014.The MCST and certain subsidiary proprietors remained dissatisfied even after the rectification. The MCST passed a special resolution in January 2014 authorising litigation against Orion-One.17Foot Note 17×Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 5.The MCST commenced this action in June 2014.",
        "Issues to be determined": "10 The issues to be decided in this action are: (a) Does the MCST have the requisitelocus standito bring its claim against Orion-One?(b) Has Orion-One breached the SPAs?(c) Does Sanchoon owe the MCST a duty of care in tort, and if so has it breached its duty?(d) Has Sanchoon breached the Warranties?",
        "Locus standi": "11 The MCST’s claim against Orion-One is a contractual claim founded on the SPAs between Orion-One and those subsidiary proprietors of the Building who are participating in this action.18Foot Note 18×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 14.The MCST represents these subsidiary proprietors in a claim against Orion-One as permitted under s 85(1) of the Building Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (the “BMSMA”). 12 The effect of s 85(1) is purely procedural. It does not confer upon a management corporation any cause of action in its own right. All that s 85(1) does is to facilitate an action by a large number of subsidiary proprietors in a development by allowing the management corporation to sue on their behalf, thereby avoiding having to name all of the participating subsidiary proprietors as parties to the action. The substantive parties to an action brought by a management corporation in reliance on s 85(1) remain at all times the individual subsidiary proprietors who have authorised the management corporation to act on their behalf. A management corporation which relies on s 85(1) is therefore required to identify the specific subsidiary proprietors whom it claims to represent in the action by naming them individually in an annex to its statement of claim:Management Corporation Strata Title Plan No 3322 v Mer Vue Developments Pte Ltd[2016] 4 SLR 351 at [18]–[19] andManagement Corporation Strata Title Plan No 2297 v Seasons Park Ltd[2005] 2 SLR(R) 613 (“SeasonsPark”) at [14]–[18]. 13 The MCST has duly identified the specific subsidiary proprietors whom it claims to represent in this action in an annex to its statement of claim. I shall refer to that group of subsidiary proprietors as the “participating subsidiary proprietors”. The MCST has attempted to prove its authority to represent the participating subsidiary proprietors by adducing letters of authorisation (“LOAs”) signed by each of them. The MCST closed its case at trial without calling any of the participating subsidiary proprietors, other than Mr David Ong, to give evidence. 14 Orion-One took the following objections to the LOAs: (a) The LOAs are hearsay and therefore inadmissible.19Foot Note 19×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 9. (b) 28 of the LOAs are not signed by all of the joint subsidiary proprietors of the unit in question.20Foot Note 20×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraph 13c. (c) 76 of the LOAs are either undated or are dated after the MCST commenced this action.21Foot Note 21×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 149. (d) 123 of the LOAs are signed by employees or directors of subsidiary proprietors who are corporations but without adducing any proof of the employees’ or directors’ authority to sign those LOAs on behalf of the corporate subsidiary proprietor.22Foot Note 22×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraph 13e. (e) The jurats of the affidavits of evidence in chief of eight subsidiary proprietors does not record that the affidavits were translated to their deponents, even though those deponents do not understand English.23Foot Note 23×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraph 21. (f) Two LOAs contain certain discrepancies.24Foot Note 24×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018, annex III, at p 12, s/n 92 and p 34, s/n 285. 15 Orion-One also took issue with the standing of certain participating subsidiary proprietors to bring an action in contract against Orion-One for the following reasons:25Foot Note 25×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 165. (a) The names of the participating subsidiary proprietors for 13 units do not match the names of the purchasers set out in the SPAs for those 13 units. (b) Eight of the participating subsidiary proprietors have since transferred their units to third parties, who have no contract whatsoever with Orion-One. (c) The SPA for #07-27 is incomplete. I deal with these objections in turn.",
        "Objections to the LOAs": "Admissibility of the LOAs 16 As I have mentioned, the MCST included the LOAs in the agreed bundle, but closed its case at trial without calling any of the subsidiary proprietors who executed the LOAs to prove the LOAs and give evidence. Orion-One consistently took the point, both before and after the MCST closed its case at trial, that the LOAs were inadmissible hearsay.26Foot Note 26×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 9.In response, the MCST applied in the course of the closing submissions:27Foot Note 27×Summons No 3663 of 2017 (“SUM3663/2017”).(i) for permission to reopen its case and to file affidavits of evidence in chief from the participating subsidiary proprietors exhibiting their respective LOAs; and (ii) to dispense with cross-examination of the participating subsidiary proprietors. 17 At the hearing of the MCST’s application, I accepted Orion-One’s argument that the LOAs were inadmissible hearsay. I nevertheless granted the MCST leave to reopen its case and to file affidavits of evidence from the participating subsidiary proprietors exhibiting their respective LOAs.28Foot Note 28×Notes of Evidence for SUM3663/2017 dated 16 October 2017 at p 28.I now set out the reasons for my decision. 18 In the discussion which follows, I leave aside the LOAs executed by Mr David Ong. He filed an affidavit of evidence in chief and testified at trial, before the MCST closed its case. He therefore gave direct evidence of the contents of his LOAs within the meaning of s 62(1) of the EA. His LOAs are not inadmissible hearsay. (1) The LOAs were indeed hearsay 19 In response to Orion-One’s hearsay objection, the MCST argued that the LOAs were not hearsay because: (a) The MCST relied on each LOA only to prove that the statement in the LOA (that the subsidiary proprietor signing the LOA had authorised the MCST to bring this action on his behalf) was made, and not as proof of the truth of the statement in the LOA.29Foot Note 29×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraphs 6–7. (b) Further or in the alternative, the LOAs fell within the exception to the rule against hearsay which is set out in s 32(1)(b)(iv) of the Evidence Act (Cap 97, 1997 Rev Ed) (the “EA”).30Foot Note 30×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 16. (c) Further or in the alternative, the LOAs fell within the exception to the rule against hearsay which is set out in s 32(1)(k) of the EA.31Foot Note 31×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 22. (d) In any event, Orion-One had waived its right to object to the admissibility of the LOAs.32Foot Note 32×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 30. 20 I did not accept any of the MCST’s arguments on this point. 21 First, it is true that evidence which is adduced to prove that an out-of-court statement was made (and not to prove the truth of the contents of that statement) is not within the hearsay rule:Saga Foodstuffs Manufacturing (Pte) Ltd v Best Food Pte Ltd[1994] 3 SLR(R) 1013 at [11]. But the MCST adduced the LOAs not to prove that the out-of-court statements in the LOAs were made. For the MCST to represent a subsidiary proprietor in this action, it has to prove that it has authority from that subsidiary proprietor to do so. In other words, the MCST has to prove the truth of the statements in that subsidiary proprietor’s LOA,i.e.that that subsidiary proprietor did authorise the MCST to represent him. It is not sufficient for the MCST simply to prove that the subsidiary proprietor made a statement to that effect. The MCST has to prove that the subsidiary proprietor in fact authorised the MCST to represent them in this action. 22 Second, the LOAs did not fall under s 32(1)(b)(iv) of the EA. Section 32(1)(b) of the EA renders a hearsay statement admissible if it is made by a person in the ordinary course of a trade, business, profession or other occupation. To fall within this exception, the statement must have been made in the course of transactions performed in one’s habitual relation with others and as a material part of one’s mode of obtaining a livelihood:Bumi Geo Engineering Pte Ltd v Civil Tech Pte Ltd[2015] 5 SLR 1322 (“BumiGeo”) at [105]. The rationale for this hearsay exception is that a statement made in the ordinary course of a trade, business, profession or other occupation is a record of historical fact made from a disinterested standpoint and may therefore be presumed to be true:Bumi Geoat [104]. The LOAs do not fall within s 32(1)(b)(iv) of the EA. Preparing the LOAs was not a material part of the MCST’s mode of business. Further, the rationale underpinning s 32(1)(b)(iv) does not apply to the LOAs. The LOAs were prepared for the sole purpose of this litigation. They were therefore not a record of historical fact made from a disinterested standpoint. 23 Third, the LOAs do not fall within s 32(1)(k) of the EA. Section 32(1)(k) renders a hearsay statement admissible if the parties so agree. The MCST argues that Orion-One agreed that the LOAs would be admissible within the meaning of s 32(1)(k) because it agreed to include the LOAs in the agreed bundles prepared for trial.33Foot Note 33×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 22.But agreement to include a document in an agreed bundle is an agreement only to dispense with formal proof of the document (ie,proof of the document by primary or permissible secondary evidence). It is not agreement as to the truth of the contents of the document:Jet Holding Ltd and others v Cooper Cameron (Singapore) Pte Ltd and another and other appeals[2006] 3 SLR(R) 769 (“JetHolding”) at [44]. 24 Fourth, Orion-One did not waive its right to object to the admissibility of the LOAs. The MCST argues that Orion-One did waive its right to object because:34Foot Note 34×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 30. (a) Orion-One consented to the MCST including the LOAs in the agreed bundle. (b) Orion-One did not file a notice of non-admission of document under O 27 r 4(2) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (the “Rules”). (c) Orion-One did not aver or disclose any evidence to suggest that the LOAs should not be taken at face value,e.g. evidence which suggests that the subsidiary proprietors were unaware of the consequences of signing the LOAs or did so under duress or in ignorance. (d) Orion-One did not cross-examine Mr David Ong, the only subsidiary proprietor whom the MCST actually called as a witness, on the accuracy or the contents of his LOAs. 25 These arguments are without merit. Orion-One’s agreement to the MCST including the LOAs in the agreed bundle does not constitute Orion-One’s agreement that the LOAs be admitted in evidence without calling the makers. Neither does Orion-One’s failure to file a notice of non-admission under O 27 r 4(2) of the Rules constitute agreement that the LOAs be admitted at trial. Order 27 rule 4 states: Admission and production of documents specified in list of documents (O. 27, r. 4) 4.—(1) Subject to paragraph (2) andwithout prejudice to the right of a party to object to the admission in evidence of any document, a party on whom a list of documents is served … shall, unless the Court otherwise orders, be deemed to admit — (a) that any document described in the list as an original document is such a document and was printed, written, signed or executed as it purports respectively to have been; and (b) that any document described therein as a copy is a true copy. This paragraph does not apply to a document the authenticity of which the party has denied in his pleading. (2) If … the party to whom the list is served serves on the party whose list it is a notice stating, in relation to any documents specified therein, that he does not admit the authenticity of that document and requires it to be proved at the trial, he shall not be deemed to make any admission in relation to that document under paragraph (1). [emphasis added] A party’s failure to file a notice of non-admission results only in the party being deemed to admit theauthenticityof the document. It has no bearing on the right of the party to object to theadmissibilityof the document, as expressly stated in the portion of O 27 r 4(1) italicised above. 26 I further reject the MCST’s objection that Orion-One cannot take the admissibility point because it did not aver or disclose any evidence to suggest that the LOAs should not be taken at face value. The burden of proving the MCST’s authority to represent the subsidiary proprietors rests on the MCST. To discharge this burden, the MCST has to adduce admissible evidence of its authority. It is not Orion-One’s duty to inform or remind the MCST that it cannot discharge this burden by attempting to rely oninadmissibleevidence. And Orion-One’s omission to do so is most definitely not a waiver of its right to object to the LOAs as hearsay. 27 In any case, Orion-One consistently indicated that it objected to the LOAs as being inadmissible hearsay before the MCST closed its case at trial. First, in its pleaded defence, Orion-One put the MCST to “strict proof” of its authority to act for the subsidiary proprietors.35Foot Note 35×1st Defendant’s Defence (Amendment No 3) at paragraph 28.There is, of course, no difference between a plea which puts a party to “proof” as to a particular fact and a plea which puts a party to “strictproof” of that fact.  Be that as it may, this plea put the MCST on notice that Orion-One would require the MCST to prove its allegations of authority at trial. And the MCST could not have understood Orion-One’s plea as agreement that MCST could meet the plea byinadmissibleevidence. Second,  Orion-One stated in its opening statement that “[g]iven that the subsidiary proprietors have not given evidence on these LOAs, [Orion-One] will show that these LOAs are purely documentary hearsay”.36Foot Note 36×1st Defendant’s Opening Statement at paragraph 27.In these circumstances, Orion-One cannot be said to have waived its right to object to the admissibility of the LOAs. 28 Finally, I reject the MCST’s objection that Orion-One did not cross-examine Mr David Ong, the only subsidiary proprietor called by the MCST as a witness, on the contents of his LOA. Orion-One is perfectly entitled to hold the view that the Mr David Ong’s LOA is admissible while also holding the view that the other subsidiary proprietors’ LOAs are inadmissible, lacking “the sanction of the tests applied to admissible evidence, namely the oath and cross-examination”:Jet Holdingat [74] citingSir John Woodroffe & Syed Amir Ali’s Law of Evidence(Butterworths, 17th Ed, 2001) vol II at p 1726. (2) Reopening the MCST’s case 29 I granted the MCST leave to reopen its case and to file an affidavit of evidence in chief for each participating subsidiary proprietor. In effect, this gave the MCST an opportunity to rectify its case by adducing fresh evidence after it had closed its case in order to render the LOAs admissible. I did not, however, dispense with their attendance for cross-examination. 30 It was common ground between the parties that I had the discretion to allow the MCST to adduce additional evidence even after it had closed its case:37Foot Note 37×Plaintiff’s Further Submissions in SUM3663/2017 dated 16 October 2017 at paragraphs 3–4; 1st Defendant’s Supplementary Submissions in SUM3663/2017 dated 16 October 2017 at paragraphs 22 and 30.see, for example,PrinceCourt Medical Centre Sdn Bhd v Germguard Technologies (M) Sdn Bhd[2016] 4 MLJ 1 at [9] andSykes v Sykes(1995) 6 BCLR (3d) 296 at [9]. I exercised my discretion in favour of allowing the additional evidence for the following reasons. 31 First, Orion-One’s objection to the admissibility of the LOAs was a highly technical objection. I have found that the objection was well-founded. And it no doubt resulted from a fundamental error by counsel for the MCST. However, the objection carried very little in terms of substance. More importantly, it seemed to me that the objection, well-founded as it was, was not conducive to determining the real matter in controversy in this action, which is whether Orion-One breached the SPAs. In my view, it was appropriate to exercise my discretion in favour of the MCST in order to allow the real matter in controversy in this action to be decided. As Bowen LJ stated in his dissenting judgment inCropper v Smith(1884) 26 Ch D 700 at 711: It seems to me that as soon as it appears that the way in which a party has framed his case will not lead to a decision of the real matter in controversy, it is as much a matter of right on his part to have it corrected, if it can be done without injustice, as anything else in the case is a matter of right. It was said by [counsel for the plaintiff] in his very powerful speech to us, “You are taking away an advantage from the Plaintiffs who have got judgment below, by making an amendment at the last moment.” In one sense we should be taking away an advantage from them, but only an advantage which they have obtained by a mistake of the other side, contrary to the true bearing of the law on the rights of the parties. 32 Second, although Orion-One’s objection was well-founded and resulted from counsel’s error, the consequence to the MCST of shutting out the additional evidence was out of all proportion to the gravamen of the objection and to the seriousness of the error. If I had declined to allow the MCST to reopen its case, the LOAs would be inadmissible hearsay. The MCST would thus have been unable to prove its authority to act for the subsidiary proprietors (other than the 58 subsidiary proprietors who voted in favour of the special resolution authorising the MCST to commence litigation against Orion-One:38Foot Note 38×Agreed Bundle of Documents, vol 6, at p 5116–5120.seeSeasons Parkat [19]–[20]). The MCST’s entire claim against Orion-One would fail solely because of counsel for MCST’s error in failing to render the LOAs admissible. I did not think it just for the subsidiary proprietors to be deprived of their entire claim against Orion-One solely by reason of counsel’s error. Nor did I think it just to shift the economic burden of that claim, insofar as it was well-founded, from Orion-One to the MCST’s solicitors’ professional indemnity insurers. 33 Third, allowing the MCST to reopen its case in these circumstances raised only a single, narrow issue relating to the MCST’s authority to represent the subsidiary proprietors. Doing so did not expand the range of issues to be determined at trial. In particular, doing so did not require the pleadings to be amended and did not require discovery to be re-visited. It also appeared to me that, with proper use of the notice to admit procedure, the MCST could ensure that Orion-One was judicious in choosing which of the subsidiary proprietors it wished to cross-examine on their affidavits of evidence in chief. The entirely justified concerns about the effect of allowing a party to reopen its case on the judicial goal of disposing of civil litigation justly and expeditiously, as highlighted inWee Soon Kim Anthony v UBS AG[2003] 2 SLR(R) 554 (“AnthonyWee”) at [17]–[18], were therefore attenuated in this case. 34 Finally, I was not satisfied that Orion-One would suffer any prejudice for which it could not be compensated by costs if I were to allow the MCST to reopen its case. Orion-One argued that it would suffer irremediable prejudice because: (i) there would not be a just and expeditious disposal of this action; (ii) the MCST would be allowed to tailor its evidence to meet Orion-One’s case; and (iii) the MCST would be given a second bite of the cherry because its claim against Orion-One would otherwise have been dismissed. I did not accept any of these three arguments. First, as I have stated above, allowing the MCST to reopen its case involved only a single, narrow issue which was very easily addressed. The delay caused by allowing the MCST to reopen its case would thus not be so severe that Orion-One could not be compensated for it by costs. Allowing the MCST to reopen its case would also not allow it to tailor its evidence to meet Orion-One’s case. The MCST was not seeking an opportunity to put in additional evidence of primary, historical fact to fill in gaps in its substantive case which had been exposed at trial by cross-examination or by the evidence of Orion-One’s factual or expert witnesses. The MCST was seeking an opportunity only to put in evidence of secondary, procedural fact which was necessary under s 106 of the EA to allow evidence which the MCST had already placed before the court to be rendered admissible. Finally, although allowing the MCST to reopen its case would give it a chance to rectify a potentially fatal defect in its claim against Orion-One, like Bowen LJ inCropper v Smith(see [31] above), I did not consider depriving Orion-One of a technical advantage arising from a procedural defect caused by a genuine error to be a form of prejudice for which it could not be compensated by costs. 35 The MCST thus arranged for 151 subsidiary proprietors to file affidavits of evidence in chief.39Foot Note 39×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 36.Orion-One dispensed with the cross-examination of 127 subsidiary proprietors. It sought to cross-examine only the remaining 24.40Foot Note 40×1st Defendant’s letter to court dated 21 March 2018.Of these 24, two (Foo Su Mei and Leong Kay Peng) did not attend for cross-examination.41Foot Note 41×Certified Transcript dated 29 March 2018, at p 2, lines 18–19.It is not necessary for me to decide whether the LOAs of these two subsidiary proprietors are admissible despite their failure to attend for cross-examination, because the MCST’s authority to represent them is flawed for other reasons (see Annex A). 36 The MCST argues that, because Orion-One did not ask to cross-examine 127 out of the 151 subsidiary proprietors, it cannot challenge the affidavits of evidence in chief of these 127 subsidiary proprietors pursuant to the rule inBrowne v Dunn(1893) 6 RJ 67 (“Browne v Dunn”). I disagree. The rule inBrowne v Dunnis not a rigid, technical rule. It is not to be applied mechanically in order to require every single point in a party’s case to be put to every opposing witness. The rule is ultimately a rule of fairness to the witness, nothing more. The rationale of the rule is to give a witness an opportunity to offer a response to allegations made against the witness:Asnah bteAb Rahman v Li Jianlin[2016] 2 SLR 944 at [115]. Orion-One’s objections to the LOAs of these 127 subsidiary proprietors are primarily that these LOAs either: (i) were not signed by all joint subsidiary proprietors; or (ii) were signed by employees or individual directors of company-subsidiary proprietors with no evidence of their authority to do so. It would not have served any purpose whatsoever for the defendants to have insisted on these 127 subsidiary proprietors taking the time and expense to attend court, taking the stand and taking the oath or affirmation simply to put formally these points to the 127 subsidiary proprietors. This is because, at best, each subsidiary proprietor could respond only by saying that he was given authority to sign the relevant LOA by his joint subsidiary proprietor or by the company-subsidiary proprietor. But an assertion of this nature coming from the party signing the LOA is valueless. An agent cannot give himself authority (Skandinaviska Enskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and another and another appeal[2011] 3 SLR 540 (“Skandinaviska”) at [59]). And an agent can give only hearsay evidence that the principal has clothed him with authority. Co-subsidiary proprietors 37 Orion-One objects to 28 of the LOAs on the basis that they are not signed by all of the joint subsidiary proprietors of a particular unit. The MCST argues that there is no requirement for all joint subsidiary proprietors to sign a LOA.42Foot Note 42×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 109.It is instead sufficient for one joint subsidiary proprietor to sign the LOA, because “[e]ach individual [subsidiary proprietor], be it held as joint tenancy or tenancy in common, has a full legal right/ownership over the property”.43Foot Note 43×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 111.Further, according to the MCST, the parties to each SPA intended for joint subsidiary proprietors to have joint and several rights and obligations under the SPA.44Foot Note 44×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 112.A single joint subsidiary proprietor can therefore exercise his personal contractual rights under the SPAs. Alternatively, the MCST argues that the joint subsidiary proprietors who signed the LOAs had implied authority from the other joint subsidiary proprietor to do so.45Foot Note 45×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 65. 38 I reject the MCST’s arguments. The MCST relies on s 85 of the BMSMA as its basis to represent the subsidiary proprietors in this action.46Foot Note 46×Statement of Claim (Amendment No 2) at paragraph 2.Section 85 of the BMSMA allows a management corporation to represent “subsidiary proprietors” in proceedings. “Subsidiary proprietor” is defined in s 2(1) of the BMSMA as having the same meaning as is ascribed to that term in the Land Titles (Strata) Act (Cap 158, 2009 Rev Ed) (the “LTSA”). Section 3(1) of the LTSA defines a subsidiary proprietor as,inter alia, “the registered subsidiary proprietor for the time being of theentire estatein a lot” [emphasis added]. A single tenant in common is not a proprietor of theentire estate. The definition of “subsidiary proprietor” in the LTSA thus does not include a single tenant in common:Goh Teh Lee v Lim Li Pheng Maria and others[2010] 3 SLR 364 (“Goh Teh Lee”) at [16]. It is thus not sufficient for a single tenant in common to authorise the MCST. 39 Similarly, although a joint tenant owns the whole of the estate together with the other joint tenants, “each and every joint tenant must partake in any dealings with the whole legal estate before such dealings may effectively bind the entire estate”:GohTeh Leeat [17]. It is thus also not sufficient for a single joint tenant to authorise the MCST. 40 Given that the MCST’s basis for bringing this action on behalf of the subsidiary proprietors is s 85 of the BMSMA and is not contractual,47Foot Note 47×Statement of Claim (Amendment No 2) at paragraph 2.it is irrelevant whether the SPAs created joint rights or several rights where Orion-One’s counterparty was more than one purchaser. In any event, the MCST has not proven that the SPAs created severalrightsfor co-owners. The MCST relies on cl 1.1.5 of the SPAs as evincing such an intention. Clause 1.1.5 states “[i]f there is more than one vendor or more than one purchaser, the obligations which they undertake under this Agreement can be enforced against them all jointly or against them individually”.48Foot Note 48×Plaintiff’s Core Bundle of Documents (For Oral Submissions) dated 31 July 2017 at tab 1, p 2.At most, cl 1.1.5 indicates an intention for the parties to the SPA to beliableseverally in addition to being liable jointly. It says nothing aboutrightsvesting in the purchasers severally rather than or in addition to rights vesting in them jointly. 41 Finally, I do not accept the MCST’s submission that each joint subsidiary proprietor who signed an LOA had implied authority from the joint subsidiary proprietors who did not sign the LOA. The MCST relies on the testimony of some of the signing joint subsidiary proprietors that the non-signing joint subsidiary proprietors gave authority to execute the LOAs on their behalf.49Foot Note 49×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 68.The MCST further argues that “the relationship between co-owners may also imply the agency relationship between co-owners, such that any one of the co-owners will be the agent to the other(s) and hence may have the usual and ostensible authority”.50Foot Note 50×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 68. 42 As noted earlier, an assertion by a joint subsidiary proprietor that another joint subsidiary proprietor authorised him to execute the LOAs on behalf of their other co-owners is either valueless as an agent cannot give himself authority:Skandinaviskaat [59] or is inadmissible hearsay. 43 As for the MCST’s argument on the relationship between joint subsidiary proprietors, the MCST has cited no authority to support its assertion that there is an agency relationship between them. A relationship of agency is a fiduciary relationship that arises when one person (the principal) manifests assent to another person (the agent) acting on the principal’s behalf, and the agent manifests assent so to act:Alwie Handoyo v Tjong Very Sumito and another and another appeal[2013] 4 SLR 308 at [147]. I cannot see how the relationship between joint subsidiary proprietors necessarily creates such assent for all the joint subsidiary proprietorsinter se. Further, unlike s 5 of the Partnership Act (Cap 391, 1994 Rev Ed) which statutorily prescribes a relationship of agency between partners, there is no equivalent provision governing the relationship between joint subsidiary proprietors. The MCST points to para 2(3) of the First Schedule to the BMSMA,51Foot Note 51×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraph 67.which states: The vote of joint subsidiary proprietors … may be cast by any of them … and if both joint subsidiary proprietors … are present at a meeting of the management corporation … the vote of the senior who casts a vote … shall be accepted to the exclusion of the votes of the others … Even if para 2(3) creates a relationship of agency between joint subsidiary proprietors, this relationship is clearly limited to the context of voting at a meeting held by a management corporation. Undated and post-dated LOAs 44 Orion-One argues that LOAs must be executed before a MCST commences action, relying onSeasons ParkandManagement Corporation Strata Title Plan No 3322 v Mer Vue Developments Pte Ltd and others (King Wan Construction Pte Ltd and others, thirdparties)[2016] SGHC 28 (“MerVue (HC)”).52Foot Note 52×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 150–153.It thus argues that I should disregard the LOAs which are undated or which are dated after the MCST commenced this action.53Foot Note 53×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 156. 45 There is no requirement for a subsidiary proprietor to execute an LOA before the management corporation commences action on behalf of that subsidiary proprietor. What is required when a management corporation commences action is the means by which it is possible specifically to identify each subsidiary proprietor whom the management corporation represents:Seasons Parkat [18]. This is necessary for two related reasons. First, to inform the defendants of the identity of each subsidiary proprietor who has authorised the management corporation to institute the claim on his behalf, allowing the defendant to meet the case against it. Second, it is necessary to ensure that there is no doubt as to whom the eventual judgment binds. 46 An LOA is not authority: it is simply evidence of authority. There is therefore no reason to require an LOA to be executed before a management corporation commences action, provided that the management corporation makes clear to the defendant whom the management corporation claims to represent. For its own protection, a management corporation may want to ensure that it has in hand documentary evidence of authority from each subsidiary proprietor it claims to represent before it commences action on that subsidiary proprietor’s behalf. But that is a matter between the management corporation and the subsidiary proprietor. As against the defendant, there is no basis to require the documentary evidence of authority to be executed before the management corporation commences action. As an example, it would be entirely legitimate for a management corporation to name in its statement of claim a subsidiary proprietor who has given it oral authorisation to represent him, and to document that oral authorisation later by a LOA which is executed after the commencement of the action. This is in fact what the MCST claims it did in this case: that it is merely using the LOAs asevidenceof its authority, and that it obtained authority from the subsidiary proprietors before commencing this action.54Foot Note 54×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 100.I do not understand the defendants to dispute this. 47 Further, neitherSeasons ParknorMer Vue(HC)requireLOAsto be executed before the commencement of an action. BothSeasons ParkandMerVue (HC)state that a management corporation must obtainauthorisationfrom its subsidiary proprietors before commencing action. They do not go further to prescribe that authorisation must take the form of LOAs which must therefore be signed before the action is commenced. The Court of Appeal inSeasons Park(at [20]) agreed with the trial judge’s observation that: … Where a cause of action is to be founded on contract every party bound by that contract must be identified, and thusevery subsidiary proprietor who had a contract with the [developer] had to expressly authorise the [management corporation] to sue on his behalf… [emphasis added] Similarly, the court inMer Vue(HC)said (at [42]): … It was also very curious that more than 80 of the additional letters of authorisation wereundated. Further, three letters of authorisation included were actually signed by subsidiary proprietors that had already been listed in the [management corporation’s further and better particulars] filed earlier on 31 October 2011, with their letters of authorisations datedafterthe fact in 2014. Specific authorisation was required from each original purchaser that had a cause of action in contract, as it cannot be assumed that original purchasers wouldipso factowish to sue in contract just because they have the right to … Thus,authorisation should be obtained from each original purchaserbefore management corporations can claim and demonstrate that they are representing and suing on behalf of these subsidiary proprietorspursuant to Section 85(1) of the BMSMA. [emphasis in original in italics; emphasis added in bold italics] I note that the court inMer Vue (HC)highlighted the fact that some of the LOAs in that case were undated and that some others were dated “afterthe fact”. But I do not understand the court inMer Vue (HC)to be laying down a rule that a management corporation must obtain a LOA before it may claim to represent a subsidiary proprietor in an action. As the court inMer Vue (HC)noted, what is important is thatauthorisationbe obtained from a subsidiary proprietor before the management corporation claims to represent it. This authorisation may be evidenced by a LOA executed later, “afterthe fact”. LOAs signed by employees and directors 48 Orion-One submits that LOAs signed by employees and individual directors of subsidiary proprietors who are companies should be disregarded. According to Orion-One, this is because an employee is not authorised to act for a company simply by virtue of being an employee.55Foot Note 55×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraph 65.And the directors of a company are empowered to authorise a company to commence legal proceedings only if the directors act collectively as a board, unless the board has delegated such authority to an individual director.56Foot Note 56×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraphs 60–61.The MCST submits that it is entitled to rely on the “indoor management rule” laid down inRoyal British Bank v Turquand[1843-60] All ER Rep 435 to assume that employees and directors were properly authorised to execute the LOAs on behalf of their companies.57Foot Note 57×Plaintiff’s Skeletal Submissions at close of third tranche trial dated 29 March 2018 at paragraphs 88 and 90. 49 The indoor management rule is a presumption of regularity to be applied in concert with the rules of apparent authority. In other words, the indoor management rule entitles an outsider to rely on an agent’s apparent authority even if there is in fact some internal irregularity that vitiates the agent’s actual authority:Walter Woon on Company Law(Tan Cheng Han, ed) (Sweet & Maxwell, Revised 3rd Ed, 2009) at paras 3.38–3.40 andSAL Industrial Leasing Ltd v Hydtrolmech Automation Services Pte Ltd and others[1997] 3 SLR(R) 676 at [43]–[44]. 50 The MCST is not entitled to rely on the indoor management rule in relation to the LOAs signed by employees and individual directors. This is because the employees and individual directors do not even have apparent authority to act on behalf their companies. The decision to bring an action in the name of a company falls within the purview of the company’s board of directors:ChanSiew Lee v TYC Investment Pte Ltd and others and another appeal[2015] 5 SLR 409 at [59]. Therefore, in the absence of proof to the contrary, an employee and an individual director do not have apparent authority to sign an LOA. The MCST relies solely on the fact that the employees and individual directors signed the LOAs to argue that they had apparent authority to do so. But an agent cannot give himself authority:Skandinaviskaat [59]. The indoor management rule thus does not apply to permit the MCST to rely on the LOAs signed by employees and individual directors of company subsidiary proprietors. 51 Having said that, I note that Orion-One has not only objected to LOAs signed by employees and individual directors of company subsidiary proprietors, but also to LOAs stamped with the rubber stamps of company subsidiary proprietors. Orion-One’s objections to the stamped LOAs are unfounded. The company stamp represents thecompanysigning the LOA. The MCST can rely on these LOAs as the companies have the authority to authorise the MCST to represent them in litigation. And any lack of actual authority on the part of the persons who stamped the LOAs can be defeated by the indoor management rule, as persons with access to the company stamp have apparent authority to represent the company. Affidavits of evidence in chief not translated to their deponents 52 Orion-one seeks to invalidate eight affidavits of evidence in chief on the basis that their jurats do not record that they were translated to their deponents, who do not understand English.58Foot Note 58×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraph 21.Orion-One argues that these affidavits of evidence in chief do not comply with O 41 r 1(7) and (8) and Form 78 of Appendix A of the Rules and should therefore be rejected, relying onFung Yuk Lien v Foong Chee Sam (as administrator of the estate of Kong Muk Tei,deceased)[2000] 3 MLJ 543.59Foot Note 59×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018 at paragraphs 23–25. 53 It is not necessary for me to decide whether these affidavits of evidence in chief are irregular and should be rejected. The MCST’s claim to represent seven of the eight units (ie#B1-05, #01-04, #01-23, #01-52, #05-01, #09-93, and #09-95) is already defeated by the fact that the LOAs for those units were not signed by all of the joint subsidiary proprietors (see Annex A). Whether the affidavits of evidence in chief of the subsidiary proprietors in respect of each of those units is irregular is thus immaterial. As for the remaining unit (ie#04-10), the affidavit of evidence in chief in question was affirmed by Mr Lee Wee Foon, who took the stand to be cross-examined.60Foot Note 60×Certified Transcript dated 6 March 2018, at p 106, lines 7–8.Because Mr Lee appeared as a witness, the LOA in respect of #04-10 has been proven and is admissible. In light of his direct, oral evidence, it is no longer necessary for the MCST to rely on Mr Lee’saffidavit of evidence-in-chiefto render his LOA admissible. As a result, whether Mr Lee’s affidavit of evidence-in-chief is irregular is also immaterial. Discrepancies 54 Orion-One has highlighted certain discrepancies between the names of the participating subsidiary proprietors as listed in the annex to the statement of claim and as set out in the LOAs. First, the subsidiary proprietor for #03-46 is listed in the annex to the statement of claim as FS-3D Support Solutions Pte Ltd. But the LOA for the unit was executed by FS-3D Project Supplies Pte Ltd.61Foot Note 61×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018, annex III, at p 12, s/n 92.Second, the subsidiary proprietors for #08-107 are listed in the annex as Ng Eng Huat and Ng Hui Enn. But the LOA for the unit is executed by Lim Lee Huat.62Foot Note 62×1st Defendant’s Skeletal Submissions (Oral Submissions on 29 March 2018) dated 29 March 2018, annex III, at p 34, s/n 285. 55 These discrepancies are immaterial. Order 20 rule 5(3) of the Rules allows an amendment to correct the name of a party at any stage of the proceedings. Such an amendment may be made even if the effect of the amendment would be to substitute a new party and even if the claim is time-barred, provided the Court is satisfied that the mistake sought to be corrected was a genuine mistake and was not misleading or did not cause any reasonable doubt as to the identity of the person intending to sue. Both discrepancies highlighted by Orion-One constitute mere misnomers and are within the scope of this rule. 56 FS-3D Support Solutions Pte Ltd is the former name of FS-3D Project Supplies Pte Ltd. Under s 28(6) of the Companies Act (Cap 50, 2006 Rev Ed), this change of name does not “affect the identity of the company or render defective any legal proceedings by or against the company”. A reference to a subsidiary proprietor by its former name is no different in law from a reference to it by its current name and is a reference to the same legal person. That suffices in itself to neutralise this alleged discrepancy. However, it is also the case that this change of name took place before63Foot Note 63×Agreed Bundle of Documents, vol 3, at p 2164.the MCST commenced this action. The use of the former name for the proprietor of #03-46 is therefore clearly a mistake. Further, all the relevant documents such as the MCST’s strata roll64Foot Note 64×Agreed Bundle of Documents, vol 1, at p 428, s/n 176.and the land title transfer record65Foot Note 65×Agreed Bundle of Documents, vol 3, at p 2160.(“LTT”) show the subsidiary proprietor of this unit under its current name. The LTT even states that FS-3D Project Supplies Pte Ltd was formerly known as FS-3D Support Solutions Pte Ltd. There thus could not have been any reasonable doubt as to the identity of the legal person whom the MCST represents in this action. That legal person is the subsidiary proprietor of #03-46,i.e.FS-3D Project Supplies Pte Ltd which is the same legal entity as FS-3D Support Solutions Pte Ltd. 57 Similarly, the discrepancy in respect of #08-107 is also a curable misnomer. The relevant documents such as the MCST’s strata roll66Foot Note 66×Agreed Bundle of Documents, vol 1, at p 436, s/n 547.and the LTT67Foot Note 67×Agreed Bundle of Documents, vol 4, at p 3696.show the relevant subsidiary proprietor to be Lim Lee Huat. There thus could not have been any reasonable doubt as to the identity of the person whom the MCST represents in this action. That person is the subsidiary proprietor of #08-107: Lim Lee Huat.",
        "Objections to the SPAs": "Inconsistencies in names between the SPAs and statement of claim 58 In respect of 13 of the subsidiary proprietors, Orion-One argues that the MCST has failed to prove that Orion-One contracted with those subsidiary proprietors because the names of the subsidiary proprietors as set out in the annex to the statement of claim do not match the names as set out in the SPAs and the LTT.68Foot Note 68×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 166. 59 I reject Orion-One’s argument. The names as they appear in the annex to the statement of claim and in the SPAs are as follows:69Foot Note 69×1st Defendant’s Closing Submissions dated 22 May 2017, Annex IV. S/NUnitName in annex to the statement of claimName in SPAName in LTT1#B1-05Hiap Leng Tuar / Ong Hock Heng / Chiew Hock YouOng Hock Heng and Chiew Hock You, the Trustees of Hiap Leng TuarOng Hock Heng (Trustee) / Chiew Hock You (Trustee) / Hiap Leng Tuar (Beneficiary)2#01-31Ong Tian Soon / Soh Bee LeeOng Tian Soon @ Ang Thian Soon and Soh Bee LeeOng Tian Soon @ Ang Thian Soon / Soh Bee Lee3#03-46FS-3D Support Solutions Pte LtdNot applicableFS-3D Project Supplies Pte Ltd (Formerly known as FS-3D Support Solutions Pte Ltd)4#04-10Lee Melvin / Lee Wee FoonNot applicableLee Wee Foon / Lee Liang Shing Melvin5#04-21Tan Lye Seng / Samuel Soh Aik Meng / Seah Mui Hui EstherNot applicableTan Lye Seng (Trustee) / Samuel Soh Aik Meng (Trustee) / Seah Mui Hui Esther (Trustee) / Gospel Baptist Church (Beneficiary)6#05-34Foo Chin Wei / Ow Siew EngNot applicableFoo Chin Wei (Hu Jinwei) / Ow Siew Eng7#06-35Mr. Ong Choon @ David Ong / Mdm. Cheong Wong Hee / Mr. Ong Li Mun AndyNot applicableOng Choon @ David Ong / Cheong Wong Hee / Ong Li Mun Andy (Wang Liman Andy)8#07-03Chew Bee Kow t/a Goodcare Building Services ContractorNot applicableChew Bee Keow trading as Good-Care Building Services Contractor9#07-31Chiang Lee Juin @ Chiang Siong Oh / Lim Peng Siang / Chew Seng Huat / Yeo Chong Beng / Khiang Khoon Tian Dragon And Lion Dance AssociationNot applicableChiang Lee Juin @ Chiang Siong Oh (Trustee) / Lim Peng Siang (Trustee) / Chew Seng Huat (Trustee) / Yeo Chong Beng (Trustee) / Khiang Khoon Tian Dragon and Lion Dance Association (Beneficiary)10#07-43Chow Chang Wei ValiantChow Chang Wei Valiant (Zhou Canwei Valiant)Not applicable11#08-02Mr. Lim Chor Yeow / Mdm. Tricia Tan Yi Joo / Mr. Tan Sek YamNot applicableLim Chor Yeow Mrs. Tan Sek Yam / Tricia Tan Yi Joo (Chen Yanyu) / Tan Sek Yam12#08-58Huang ZhenFeng / Huang ShenPingNot applicableHuang ZhenFeng / Huang ZhenPing13#09-93Mr. Wang Cher Kim / Mdm. Poh Ting TingNot applicablePoh Ting Ting (Fu Tingting) / Wang Cher Kim 60 The inconsistencies in the names between the annex to the statement of claim, the SPAs and the LTTs arise mainly because details have been included such as the capacity in which the parties entered into the SPAs (egas trustees or beneficiaries) or different Romanisations of Chinese names. The inconsistencies are so minor as to bede minimis. It is patent that the parties named in the annex to the statement of claim are the same as those in the SPAs and LTTs. Subsidiary proprietors who have transferred their units 61 Orion-One argues that the MCST cannot represent subsidiary proprietors who have transferred their units to third parties. According to Orion-One, this is because s 85 of the BMSMA allows a management corporation to represent only a “registered subsidiary proprietor forthe time beingof the entire estate in a lot” [emphasis added] (see [38] above).70Foot Note 70×1st Defendant’s Reply Closing Submissions dated 23 June 2017 at paragraph 183. 62 I accept Orion-One’s argument. Once a subsidiary proprietor has transferred his unit he can no longer be considered to be a subsidiary proprietor “for the time being” of any estate in a lot, let alone the “entire estate”: see Seasons Parkat [20]. Although some of the transfers were effected after the MCST commenced this action,71Foot Note 71×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 132.locus standican be reassessed at any time before the court reaches a final determination:Vellama d/o Marie Muthu v Attorney-General[2013] 4 SLR 1 at [14]. 63 Nevertheless, I do not accept that all eight of the units identified by Orion-One (ie,#03-46, #03-54, #04-09, #06-07, #06-08, #07-06, #08-64, #08-107) have undergone a change of ownership.72Foot Note 72×1st Defendant’s Closing Submissions dated 22 May 2017, Annex V, s/n 1–6 and 8–9.Specifically, I do not accept that the ownership of #03-46 and #08-107 has changed. Orion-One says that ownership of #03-46 was transferred from FS-3D Support Solutions Pte Ltd to FS-3D Project Supplies Pte Ltd. As explained earlier, FS-3D Project Supplies Pte Ltd is merely the new name of FS-3D Support Solutions Pte Ltd (see [56] above). There has been no change in ownership. 64 Similarly, Orion-One is wrong to say that ownership of #08-107 has been transferred from Ng Eng Huat and Ng Hui Enn to Lim Lee Huat. As the MCST admits, the annex to the statement of claim erroneously set out Ng Eng Huat and Ng Hui Enn as the subsidiary proprietors of #08-107.73Foot Note 73×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 129.I have earlier corrected this mistake to reflect Lim Lee Huat as the subsidiary proprietor for #08-107 in the annex to the statement of claim (see [57] above). Lim Lee Huat has a SPA with Orion-One.74Foot Note 74×Agreed Bundle of Documents, vol 4, at 3696. SPA for #07-27 65 Orion-One takes issue with the SPA for #07-27 as the MCST has disclosed only the first two pages of the SPA.75Foot Note 75×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 168.Orion-One argues that it is not possible to discern, from those two pages, whether the SPA was for #07-27. 66 I reject this argument. The footers of the two pages shows that the two pages are part of the SPA for #07-27.76Foot Note 76×Agreed Bundle of Documents, vol 1, at 668–669.This is consistent with the other SPAs, which also include the relevant unit numbers in their footers.77Foot Note 77×See for example, Agreed Bundle of Documents vol 1, at 783.",
        "Conclusion on MCST’s authority": "67 After taking into account the objections raised by Orion-One which I accept, the MCST represents 186 subsidiary proprietors. The reasons for allowing or disallowing the MCST’s claim to represent the individual subsidiary proprietors can be found at Annex A.",
        "Locus standi to sue Sanchoon": "68 Sanchoon argues that the MCST has nolocus standito sue Sanchoon because the subsidiary proprietors did not authorise the MCST to sue Sanchoon in their LOAs.78Foot Note 78×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 29–30. 69 I do not accept this argument. The MCST does not require authorisation from the subsidiary proprietors in order to sue Sanchoon. The MCST is suing Sanchoon: (i) in tort; and (ii) for breach of the Warranties. The MCST brings these claims in its own right and not on behalf of the subsidiary proprietors. A management corporation may bring claims in tort in respect of defects in common property pursuant to s 24(2)(b) of the BMSMA:RSP Architects Planners & Engineers v Ocean Front Pte Ltd and another appeal[1995] 3 SLR(R) 653 (“Ocean Front”) at [13]–[15].79Foot Note 79×Statement of Claim (Amendment No 2) at paragraph 2.Similarly, the Warranties were given to the MCST,80Foot Note 80×Statement of Claim (Amendment No 2) at paragraph 22, 1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 63, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 8.which thus brings the claim for breach of the Warranties in its own name. The MCST brings these claims against Sanchoon in its own right. No authorisation to do so from the subsidiary proprietors is required.",
        "Scope of claim": "70 The MCST’s capacity to sue Orion-One on behalf of the subsidiary proprietors and Sanchoon in tort is limited to proceedings in respect of common property: s 85(1) and s 24(2)(b) of the BMSMA.81Foot Note 81×Statement of Claim (Amendment No 2) at paragraph 2.The parties disagree on whether the following six areas constitute common property: (a) balconies of the units;82Foot Note 82×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraph 145, 1st Defendant’s Closing Submissions dated 22 May 2017 at para 308, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 22b. (b) railings mounted on the air-conditioning ledges of the units;83Foot Note 83×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 70, Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraph 142, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 22a. (c) windows of the units;84Foot Note 84×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 68, 70 and 72, Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraphs 146–147, (d) pipes in the units;85Foot Note 85×Plaintiff’s Reply Submissions (2nd Defendant) dated 23 May 2017 at paragraph 77, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 22d. (e) walls dividing the units from the common corridors;86Foot Note 86×Plaintiff’s Skeletal Reply to 1st Defendant’s Reply dated 31 July 2017 at p 29, paragraph x, 1st Defendant’s Reply Closing Submissions dated 23 June 2017 at paragraph 392.and (f) walkways between the balconies of the units.87Foot Note 87×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 233. I shall refer to these six areas as the “Disputed Areas”. 71 An area that is demarcated as common property on a strata title plan is presumed to be part of the common property. It is for the party contending otherwise to prove that the strata title plan is erroneous, and that the area is not part of the common property as it does not fall within the definition of common property under s 2(1) of the BMSMA. Section 2(1) of the BMSMA defines common property as any area: (i) not comprised in any lot or proposed lot in that strata title plan; and (ii) which is used or is capable of being used or enjoyed by occupiers of two or more lots or proposed lots. These two requirements are to be read conjunctively:Sit Kwong Lamv Management Corporation Strata Title Plan No 2645[2018] 1 SLR 790 (“Sit KwongLam”) at [37] and [42]. 72 I find that the Disputed Areas are not part of the Building’s common property, save for any window in a unit: (i) which is located on one of the exterior walls of the Building; and (ii) which cannot be opened. The MCST has failed to prove that the other Disputed Areas are common property because it has failed to adduce the strata title plans in evidence.88Foot Note 88×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraph 198, 1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 303.The effect of the MCST’s failure is twofold. First, the MCST cannot rely on the presumption that areas demarcated as common property in the strata title plans are common property. Second, whether the Disputed Areas satisfy the first limb of the definition in s 2(1) of the BMSMA – that the area is not comprised in any lot in the strata title plan – cannot be ascertained. As a result, the MCST has failed to prove that the Disputed Areas are common property. 73 The MCST argues that it is not required to adduce the strata title plans. It argues that it has discharged its burden by adducing registered surveyor’s certificates on strata area,89Foot Note 89×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraph 198.found in the SPAs.90Foot Note 90×See, for example, Agreed Bundle of Documents, vol 1, at p 500.I do not accept this argument for three reasons. 74 First, s 2(1) of the BMSMA stipulates that “strata title plan” in the BMSMA has the same meaning as in the LTSA. Section 3(1) of the LTSA defines a strata title plan as a plan of registered land which: (a) is described in the title or heading thereto as a strata title plan; (b) shows the whole or any part of the land comprised therein as being divided into 2 or more strata, whether or not any stratum is divided into 2 or more lots; and (c) contains the particulars prescribed under the Boundaries and Survey Maps Act (Cap. 25) … … The certificates adduced by the MCST do not even satisfy the first statutory requirement: that the plan is described in its title or heading as a strata title plan. They therefore cannot assist the MCST in establishing that the Disputed Areas are part of the common property. The first limb of s 2(1) of the BMSMA requires that the area not be comprised in any lot or proposed lot in the relevantstratatitle plan. 75 Second, as highlighted inSit Kwong Lamat [35], strata title plans are official documents which statutory significance, approved by the Chief Surveyor. Strata title plans are thus reliable, as they must be in order to create rights of property which bind the world. The same cannot be said for the certificates, which contain warnings that they are “for agreement only”,iethat they are only of contractual effect and even then only for the purposes of the SPAs. Further, cl 19 of the SPAs indicate that the certificates are not conclusive but are expressly subject to the strata title plans:91Foot Note 91×See, for example, Agreed Bundle of Documents, vol 1, at p 515. 19.Errors, omissions and misdescription 19.1 On the execution of this Agreement, the Vendor shall furnish to the Purchaser a certificate issued by a registered land surveyor certifying that the area of the Unit is the area derived from the dimensions shown in the plans approved by the Commissioner of Building Control and other relevant authorities. 19.2 Any error, omission or misdescription of the area of the Unit does not invalidate this Agreement nor does it give the Purchaser the right to be discharged from the purchase, butshould any such error, omission or misdescription of the area be discovered on completion of the title survey asapproved by the Chief Surveyor, the Purchaser has the right to an adjustment of the Purchase Price … … [emphasis added] 76 In any event, the certificates do not indicate that the Disputed Areas are common property. The certificates indicate only that the areas other than the units are common property, as can be seen from an example of the certificates set out at Annex B. 77 The MCST further relies on the definition of the units in the SPAs to argue that the railings mounted on the air-conditioning ledges of the units are common property.92Foot Note 92×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraphs 140–141.I reproduce an example of the definitions:93Foot Note 93×Agreed Bundle of Documents, vol 1, at p 501. The Unit: the factory on the 6th storey of the Building, comprising an estimated floor area of 181 square metres (including [Air-conditioning] Ledge and/or carpark and/or terrace (where applicable) as shown in the registered surveyor’s certificate on strata area) … According to the MCST’s interpretation of this definition, because the registered surveyor’s certificates do not indicate that the air-conditioning ledges are part of the unit, they must therefore be part of the common property, as are the railings mounted on the air-conditioning ledges. 78 I reject this interpretation. The registered surveyor’s certificates are meant to indicate only theestimated floor areaof the units, notwhetherthe unit includes an air-conditioning ledge, carpark or terrace. This is obvious from the fact that the registered surveyor’s certificates do not even depict the different parts of the units such as their doors, windows, air-conditioning ledges, carparks or terraces. As can be seen from an example of the certificates set out at Annex B, the certificates are merely simple, rough sketches of the layout of the Building. The main purpose of the certificates is to indicate the floor area of the unit being sold and purchased, as is evident from cl 19.1 of the SPAs, reproduced at [75] above. In the example reproduced at [77] above, the SPA should thus be read as defining the unit to be the factory on the 6th floor comprising an estimated floor area of 181 square meters (as shown in the registered surveyor’s certificate on strata area, including air-conditioning ledge, carpark and terrace, where applicable). 79 Although the MCST has failed to adduce the strata title plans, I note that s 2(9) of the BMSMA creates a presumption that windows of a unit which are located on the exterior walls of the Building and which cannot be opened are common property, unless otherwise described in the strata title plans. The burden of proof of rebutting this presumption lies on the defendants. The strata title plans are lodged with the Registrar of Titles (seeSit Kwong Lamat [35]) and are publicly accessible upon payment of the prescribed fee. By omitting to adduce the strata title plans, the defendants have failed to discharge their burden on this particular subset of the Disputed Areas. I therefore find that windows of units which are located on the exterior walls of the Building and which cannot be opened are thus common property. 80 Finally, the MCST argues that it is entitled to recover compensation for damage to common property which is caused by defects within a strata title lot.94Foot Note 94×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraphs 3e and 200.I agree that s 85(1) and 24(2)(b) of the BMSMA are phrased broadly enough to allow the MCST to do so. Sections 85(1) and 24(2)(b) provide that the MCST may bring claims “with respect to the common property” and “in respect of any matter affecting common property”, respectively. They do not require that the defect be in the common property. There would also be no sense in requiring the defects to be in the common property before the MCST may pursue a claim. As the Court of Appeal noted inOcean Frontat [13]–[15], a management corporation has certain statutory obligations in respect of common property, such as the obligation properly to maintain the common property and to keep it in a state of good and serviceable repair (see s 29(1)(b) of the BMSMA). A management corporation should therefore be able to recover compensation for the cost and expense incurred in rectifying damage to common property, whether that damage is caused by a defect in the common property or a defect in a strata title lot. 81 What the MCST is most emphatically not permitted to do is to recover compensation from the defendants either for the cost of rectifying a defect in a strata title lot or of rectifying damage caused within the strata title lot by that defect. The MCST has attempted to invoke the inherent jurisdiction of the court to allow it to make such claims. It argues that the MCST must be allowed to recover compensation for this loss because the subsidiary proprietors “do not have any legal recourse against [Orion-One] and/or [Sanchoon] any more [sic]”.95Foot Note 95×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 355.The first point I make is that the court has no inherent jurisdiction to disapply doctrines of the substantive common law, such as the doctrine of privity of contract, simply because of hardship in particular case. To suggest that it does is to subvert the whole framework of the common law and the doctrine ofstare decisis. The further point I make is that that position must bea fortioriwhen the doctrine sought to be disapplied by an appeal to the court’s inherent jurisdiction is a statutory creation. The mere fact that a limitation period has expired cannot, obviously, be a sufficient justification to invoke the court’s inherent jurisdiction to circumvent it. If it were, the entire statutory body of law on limitation periods would be rendered otiose at a stroke. Finally, it is not at all clear why the MCST considers the subsidiary proprietors’ hardship in finding their claims time-barred outweighs the defendants’ hardship in being confronted by a stale claim by the back door. As the Court of Appeal noted inLian KokHong v Ow Wah Foong and another[2008] 4 SLR(R) 165 at [2], citing Lord Scott of Foscote inHaward v Fawcetts[2006] 1 WLR 682 at [32]: … It is a hardship, and in a sense an injustice, to a claimant with a good cause of action … to be barred from prosecuting the cause of action on account simply of the lapse of time … But it is also a hardship to a defendant to have a cause of action hanging over him, like the sword of Damocles, for an indefinite period … The MCST’s attempt to invoke the court’s inherent jurisdiction is misconceived fundamentally and on multiple levels.",
        "Claim against Orion-One": "",
        "Orion-One’s obligation": "82 The MCST argues that Orion-One has breached cl 10.1 of the SPAs:96Foot Note 96×Agreed Bundle of Documents, vol 1, at p 479. The Vendor must as soon as possible build the Unit, together with all common property of the Building, in a good and workmanlike manner according to the Specifications and the plans approved by the Commissioner of Building Control and other relevant authorities. 83 The parties disagree on what the standard of “good and workmanlike manner” requires. The MCST argues that it requires that: (i) the Building be safe for its occupants and visitors;97Foot Note 97×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 19–20.(ii) the workmanship and materials used be reasonably fit for purpose;98Foot Note 98×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 39.and (iii) the Building be free from defects or any defects be rectified to the satisfaction of the MCST.99Foot Note 99×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 37–39.Orion-One argues that in respect of the common property, the standard of good and workmanlike manner requires merely that the common property be constructed according to the Specifications.100Foot Note 100×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 13.It argues that there is no requirement that the common property be fit for purpose.101Foot Note 101×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 191.In the alternative, Orion-One argues that the standard of good and workmanlike manner requires that the works be carried out with care and skill.102Foot Note 102×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 233 and 235. 84 I find that the standard of good and workmanlike manner requires that the Building be constructed with proper care and skill: Stephen Furst and Vivian Ramsey,Keating on Construction Contracts(Sweet & Maxwell, 10th Ed, 2016) (“Keating”)at para 3-071. Where the Building is unsafe, is not reasonably fit for purpose, or is defective, it cannot be said to have been constructed with proper care and skill. 85 I reject Orion-One’s argument that its duty in respect of common property was merely to construct it according to the Specifications. According to Orion-One, the standard of good and workmanlike manner requires only that the common property be constructed in accordance with the Specifications because cl 1.1.1 of the SPAs, which are statutorily prescribed pursuant to s 7(1) of the Sale of Commercial Properties Rules 1999 (GN No S 4/1085) (the “SCP Rules”), defines a defect as “any fault in the Unit which is due to defective workmanship or materials or to the Unit, the Building or thecommon property, as the case may be,not having been constructed according to the Specifications”.103Foot Note 103×Agreed Bundle of Documents, vol 1, at p 473. 1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 13.Orion-One contrasts this definition with the definition found in the statutory contract for sale and purchase of residential properties (cl 1.1.1 of Form 4 of the First Schedule to the Housing Developers Rules 2008 (GN No S 2/1985) (the “HD Rules”)): “defect” means any fault in the Building which is either due to — (a) defective workmanship or materials; or (b) the Building not having been constructed according to the Specifications. Orion-One thus argues that by providing different definitions of “defect” in the SCP Rules and the HD Rules, parliament intended to create a distinction between the obligations of developers of commercial property and residential property.104Foot Note 104×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 215. 86 I do not agree. The two definitions of “defect” provided in the SCP Rules and HD Rules respectively are included for the purposes of the provisions on the defect liability period. Throughout the SCP Rules and HD Rules, the word “defect” is only used in relation to provisions on defect liability periods. The definition of “defect” is not meant to define the scope of a developer’s duty under cl 10.1 of the statutorily prescribed SPAs. In other words, the fact that something does not fall within the definition of a “defect” under the SCP Rules means only that it does not engage the developer’s obligations within the defect liability period. It does not mean that it does not constitute a breach of the developer’s duty to build the property in a good and workmanlike manner. As stated inHalsbury’s Laws of Singaporevol 2 (LexisNexis, 2010 Reissue) at para 30.163, unless stated otherwise, a defect liability clause confers anadditional right; it does not operate to remove liability for breach of contract at general law.",
        "Discharge of Orion-One’s obligation": "87 Orion-One argues that its obligation under the SPAs was discharged pursuant to cl 7 of the Deed.105Foot Note 105×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 253.Clause 7 of the Deed states that the assignor, defined as the MCST, “releases and discharges [Orion-One] from any and all obligations relating to all matters arising out of or in connection with matters covered by the Warranties”. 88 The MCST argues that cl 7 does not apply because: (i) the purpose of a deed is to confer benefits, not obligations;106Foot Note 106×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 135.and (ii) the MCST did not sign and deliver the Deed to Orion-One.107Foot Note 107×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 140. 89 It is unnecessary for me to decide whether cl 7 has any effect. This is because even if cl 7 applies, it applies as between Orion-One and the alleged assignor,theMCST. It cannot apply to discharge Orion-One of its obligations under the SPAs to thesubsidiary proprietors, who are not even parties to the Deed. As noted earlier, in its contractual claim against Orion-One, the MCST merely represents the subsidiary proprietors in this action; the substantive parties to the contractual claim against Orion-One remain the subsidiary proprietors.",
        "Breach of Orion-One’s obligation": "90 The defects alleged by the MCST fall into 13 broad areas: (a) Plasterwork;(b) Metal items;(c) Doors;(d) Vent pipes;(e) Lightning conductor strips;(f) Fire escape staircases;(g) Tiles;(h) The driveway;(i) Carpark ramps;(j) Fire hose reel casings;(k) Floor slabs;(l) Road markings; and(m) Signage. I now consider whether the alleged defects in the above 13 areas constitute breaches of Orion-One’s obligation under the SPAs. Plasterwork 91 The MCST argues that the plasterwork at various areas in the Building is defective because there is: (a) Shrinkage cracking;(b) Dissimilar movement cracking;(c) Diagonal cracking;(d) Debonding;(e) Poor painting;(f) Moisture staining;(g) Dirt staining; and(h) Poor patching. (1) Shrinkage cracking 92 The MCST argues that the shrinkage cracking is caused by incorrect plaster mix.108Foot Note 108×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 198.Orion-One contends that the shrinkage cracking is common and can be painted over;109Foot Note 109×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 465.and in any event, no tests were conducted to prove that the shrinkage occurred at the time of construction.110Foot Note 110×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 464.Sanchoon argues that no tests were conducted to prove that incorrect plaster mix was used.111Foot Note 111×2nd Defendant’s Reply Closing Submissions dated 27 June 2017 at paragraph 121. 93 I accept that the shrinkage cracking is caused by lack of proper care and skill in the construction of the Building. First, Sanchoon’s own expert opines that the shrinkage cracking is a form of long-term drying shrinkage.112Foot Note 112×Affidavit of Evidence in Chief of Wong Chung Wan at p 39, paragraph 5.2.4.1.The reference material relied upon by Sanchoon’s expert states that:113Foot Note 113×Exhibit P6 at p 28, paragraph 7. …long-term drying shrinkage alone [cannot] initiate cracks. If adequate reinforcement and sufficient joints are provided against other forms of movement in accordance with the recommendations of the latest Codes of Practice, the contribution of drying shrinkage to the incidence of cracking will often be too small to be of consequence. When unacceptable long-term drying shrinkage do occur, they can usually be attributed tofundamental design or construction errors. … Whether or not the drying shrinkage is sufficient to cause cracks depends on the[mixture]of the concrete, the degree of restraint and the detailing of any reinforcement… [emphasis added] Errors in the “fundamental design or construction” of the Building constitute lack of proper care and skill at the time of construction. Second, even if shrinkage cracking is common and can be rectified by painting, shrinkage cracks are still defects, as is evident from the extracts from the reference material reproduced above. (2) Dissimilar movement cracking 94 The MCST argues that the dissimilar movement cracking in the Building is caused by the failure to follow the Specifications during construction. The Specifications require surfaces of dissimilar backgrounds which abut each other to be reinforced with galvanised steel strip mesh.114Foot Note 114×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 211.Orion argues that the Specifications require mesh only for surfaces of dissimilar backgrounds, and thus does not apply to parapet walls.115Foot Note 115×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 469–471.In any event, Orion contends that there is no evidence that no mesh was included.116Foot Note 116×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 471–472.Sanchoon argues that the use of metal mesh would only reduce but not eradicate dissimilar movement cracks.117Foot Note 117×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 214.Sanchoon further argues that no tests were carried out to prove that the cracks were caused by the lack of metal mesh.118Foot Note 118×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 215. 95 I accept that the dissimilar movement cracks at surfaceswithdissimilar backgrounds are caused by lack of proper care and skill in the construction of the Building. The Specifications expressly provide for these surfaces to be reinforced with metal mesh.119Foot Note 119×Affidavit of Evidence in Chief of Wong Chun Wan at p 172, cll 23 and 24.I do not consider it necessary for the MCST to remove the Building’s plasterwork to prove that metal mesh was not used. It is apparent from the photographs of the areas where the plaster has debonded that metal mesh was not used.120Foot Note 120×Affidavit of Evidence in Chief of Paul Crispin Casimir-Mrowczynski at p 108, photo no 1851/112 and p 112, photo no 1851/119. See Certified Transcript dated 24 October 2016, at p 20, lines 10–15. 96 The MCST has not, however, discharged its burden of proving that the dissimilar movement cracks at surfaceswithoutdissimilar backgrounds are caused by a lack of proper care and skill. The MCST relies only on the Specifications to argue that metal mesh should have been inserted. But the Specifications require metal mesh to be inserted only for areaswithdissimilar backgrounds. The MCST’s claim for the dissimilar movement cracks at the parapet walls (which are not dissimilar backgrounds) thus fails.121Foot Note 121×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 470. (3) Diagonal cracking 97 The MCST argues that the diagonal panel cracking at the roof area of the Building is caused by the use of aerated light concrete non-reinforced blocks instead of precast concrete blocks, as stipulated in the Specifications.122Foot Note 122×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 215.Orion argues that there was no such change of material and in any event, there is no difference between the two materials.123Foot Note 123×1st Defendant’s Reply Closing Submissions dated 23 June 2017 at paragraphs 240–241. 98 I agree that there was no departure from the Specifications here. The change in material referred to by the MCST was in respect of the internal walls of the Building’s eighth and ninth storeys, and not the external walls at the roof. This is evident from Architect’s Instruction No 042.124Foot Note 124×Affidavit of Evidence in Chief of Ting Chin Seng at p 99.The MCST has thus failed to prove that the diagonal panel cracking was caused by a lack of proper care and skill. (4) Debonding 99 The MCST argues that the debonded and debonding plaster is caused by: (i) poor workmanship; (ii) insufficient bonding between the plaster and the surface of the substrate material; and (iii) insufficient thickness of the plaster.125Foot Note 125×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 216–219.Orion argues that no tests have been carried out to prove that the plaster was insufficiently bonded or was of insufficient thickness.126Foot Note 126×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 408. 100 I agree that the MCST has not proven that the plaster was insufficiently bonded or of insufficient thickness. The MCST does not even have an exact measurement of the thickness of the debonded plaster. It instead relies on a crude estimate, derived by reference to a person’s fingers in a photograph.127Foot Note 127×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 219.As the reference material adduced by the MCST shows, there are multiple possible causes of debonded plaster, not all of which are related to lack of proper care and skill in construction.128Foot Note 128×Exhibit P3 at pp 63–67.The MCST must therefore prove that the debonding was caused by a lack of proper care and skill in construction in order to succeed on this part of its claim. It has failed to do so. (5) Poor painting 101 The MCST argues that the cracks in the plasterwork have led to water ingress beneath the paint and plaster, resulting in flaking paint and discolouration.129Foot Note 129×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 223.Orion argues that the paint finishes are satisfactory and in any event it is the duty of the MCST to carry out repainting of the Building at intervals of not more than 5 years.130Foot Note 130×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 476 and 479.Sanchoon similarly argues that the paint finishes are satisfactory and in any event the current state of the paintwork is caused by wear and tear.131Foot Note 131×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 214 and 218. 102 I agree that the MCST has not proven that the state of the paintwork is attributable to lack of proper care and skill in the construction of the Building. As the reference material adduced by the MCST shows, the primary cause of staining and discolouration of building façades is water. Water may originate from many sources: rain, ground water, embedded services and water introduced during the construction process.132Foot Note 132×Exhibit P3 at p 17.For the MCST to succeed on this part of its claim it must therefore prove that the current state of the Building’s paintwork was caused by water introduced due to a lack of proper care and skill in construction. It has not done so. (6) Moisture staining 103 The MCST argues that the various cracks in the plasterwork have caused water ingress and egress, resulting in moisture staining.133Foot Note 133×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 231. 104 The defendants are liable for the moisture staining caused by cracks which I have found to have been the result of a lack of proper care and skill (see [92]–[98] above). (7) Dirt staining 105 The MCST argues that the dirt staining on the plasterwork is caused by poor detailing.134Foot Note 134×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 235.Specifically, the MCST contends that a reasonably competent contractor would not construct horizontal ledges as they are more prone to dirt accumulation. 106 I reject the MCST’s argument. The construction of horizontal ledges, although less ideal than inclined ledges,135Foot Note 135×Exhibit P5 at p 83.cannot be said to be the result of lack of proper care and skill. As the reference material adduced by the MCST indicates, even inclined ledges are prone to dirt accumulation.136Foot Note 136×Exhibit P5 at p 79.It is the responsibility of the MCST to ensure that the ledges are routinely maintained to prevent dirt staining: s 29(1)(b) of the BMSMA. (8) Poor patching 107 The MCST has identified certain areas of the Building where the plasterwork and paintwork is patchy.137Foot Note 137×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 239, 306. 108 The patching is the result of debonded plaster and paint, which I have dealt with above (see [99]–[100] above). (9) Vulnerable plaster grooves 109 The MCST argues that the creation of grooves in the plaster of the Building’s walls has created points of weakness as the plaster is thinner there.138Foot Note 138×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 313.According to the MCST, because the plaster is thinner in the grooves, it is more likely to crack and absorb rainwater there. 110 I reject the MCST’s argument. I accept Orion-One’s expert’s opinion that the grooves were included to control the cracking of the plasterwork.139Foot Note 139×Certified Transcript dated 28 March 2017, at p 144, lines 8–16.This function of the grooves is also supported by the reference material adduced by the MCST.140Foot Note 140×Exhibit P6 at p 30, paragraph 7.2.1.The grooves are not the result of a lack of proper care and skill in construction. Metal items 111 The MCST argues that the paintwork on metal items (such as ductwork and pipework) at various areas in the Building is defective because the paintwork is flaking off. That, the MCST says, indicates either that no or incorrect primer was used.141Foot Note 141×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 240.Orion-One argues that the MCST should have carried out repainting works pursuant to reg 4 of the Building Maintenance and Strata Management (Lift and Building Maintenance) Regulations 2005.142Foot Note 142×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 410, s/n 3. 112 I accept the MCST and Orion-One’s experts’ evidence that the flaking paintwork on the metal items is a result of lack of proper care and skill.143Foot Note 143×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 240 and Affidavit of Evidence in Chief of Loggie Bruce Jamieson at p 21.Although the MCST was obliged to carry out repainting works, the MCST’s obligation to do so does not negate the lack of proper care and skill in the painting of the metal items. Openings 113 The MCST argues that the openings at various areas in the Building are defective because: (a) they lack flashings, projections, drainage tracks and canopies; and(b) kerbs were constructed outside doors. (1) Flashings, projections, drainage tracks and canopies 114 The MCST argues that flashings, projections, drainage tracks or canopies should have been installed at the Building’s openings. According to the MCST, the lack of such flashings, projections, drainage tracks or canopies has caused rainwater ingress, leading to corrosion and staining.144Foot Note 144×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 251, 387 and 397.The defendants argue that the lack of flashings, projections, drainage tracks or canopies is a design issue and the fault thus lies with the architects of the Building.145Foot Note 145×1st Defendant’s Closing submissions dated 22 May 2017 at paragraph 481, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 218. 115 It is common ground that the lack of flashings or projections requires rectification.146Foot Note 146×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 413, s/n 7.I thus accept that the lack of flashings, projections, drainage tracks or canopies is the result of lack of proper care and skill, bearing in mind that drainage tracks and canopies perform similar functions to flashings and projections.147Foot Note 147×Exhibit P5 at p 89.It is irrelevant whether the lack of flashings, projections, drainage tracks or canopies is a design issue. Orion-One is liable under the SPAs for defects caused by lack of proper care and skill in the construction of the Building. This includes lack of proper care and skill on the part of the architects in designing the Building, as noted by the Court of Appeal inSeasons Parkat [42]: However, it does not thereby follow that a purchaser of a unit has no remedy against the developer for faulty design … by the architect or engineer whom the developer has appointed. The claim will be in contract and in respect of such a claim, the developer cannot plead in defence that he has engaged competent professionals to design the project … This is because the developer has, by contract, agreed to deliver a unit, or building, in accordance with the Specifications, and if he should fail to do so, he is liable for breach of contract … (2) Kerbs 116 The MCST argues that the kerbs for the doors are poorly constructed as they are builtoutsidethe doors, encouraging rainwater ingress.148Foot Note 148×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 257.According to the MCST, the kerbs should have been builtinsidethe doors, as demonstrated by the architect’s design.149Foot Note 149×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 258.The defendants again argue that the position of the kerbs is a design issue, within the purview of the architects of the Building.150Foot Note 150×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 480–481, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 218. 117 It is common ground that the position of the kerbs requires rectification.151Foot Note 151×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 413, s/n 8.I thus accept that the position of the kerbs is the result of lack of proper care and skill. As explained earlier (see [115] above), it is irrelevant whether the position of the kerbs is a design issue. Vent pipes 118 The MCST argues that the waterproofing of the vent pipes was not constructed in accordance with the architect’s design.152Foot Note 152×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 267.According to the MCST, if the architect’s design was complied with, the waterproofing upstand would be visible. Because the waterproofing upstand is not visible, the MCST deduces that the architect’s design was not complied with. 119 I reject the MCST’s argument. It is not true that the architect’s design would result in the waterproofing upstand being visible. As Sanchoon’s witness explained, the waterproofing upstand was to be 300mm.153Foot Note 153×Affidavit of Evidence in Chief of Ting Chin Seng at paragraph 94.More than 300mm of other layers of material was to be placed on top of the waterproofing upstand, resulting in the waterproofing upstand being obscured.154Foot Note 154×Affidavit of Evidence in Chief of Ting Chin Seng at paragraph 95 and p 380. See also Certified Transcript dated 21 October 2016, at p 155, lines 10–15.As a result, the mere fact that the waterproofing upstand is not visible does not mean that the waterproofing upstand was not constructed in accordance with the architect’s design. In fact, the lack of evidence of any breach of the waterproofing155Foot Note 155×Certified Transcript dated 24 October 2016, at p 30, lines 10–20, Affidavit of Evidence in Chief of Ting Chin Seng at paragraph 96.suggests that the waterproofing upstand of 300mm was installed. Lightning conductor strips 120 The MCST argues that the lightning conductor strips were wrongly installed at the centre of the parapet wall, instead of at the outer edge of the wall.156Foot Note 156×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 278.The defendants contend that the lightning conductor strips were installed in accordance with the relevant codes and were approved by the relevant qualified persons for mechanical and electrical works.157Foot Note 157×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 416–418, s/n 13, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 221. 121 I agree that the lightning conductor strips were not installed with proper care and skill. The relevant code of practice for lightning protection at the time the Building was constructed is known as CP 33.158Foot Note 158×Certified Transcript dated 21 October 2016, at p 164, lines 3–6.CP 33 requires lightning conductors to “be installed on parts of the structure most likely to be struck such as theoutermost edgesof the roof” [emphasis added].159Foot Note 159×1st Defendant’s Core Bundle of Documents (expert conferencing) dated 21 October 2016, at tab 4, p 78, paragraph 3.2.2.Sanchoon argues that this requirement needs to be read with consideration of the rolling sphere technique of lightning protection, which forms the basis of CP 33.160Foot Note 160×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 221 and Certified Transcript dated 24 October 2016, at p 35, lines 6–8.But the roof of the building, where the lightning conductor strips in question are found, is exposed to the “rolling sphere” and is thus not protected under the rolling sphere technique.161Foot Note 161×1st Defendant’s Core Bundle of Documents (expert conferencing) dated 21 October 2016, at tab 4, pp 78–79, paragraphs 3.2.1–3.2.2.CP 33 thus requires that the roof be protected by lightning conductor strips, to be installed at the outermost edges of the roof. Fire escape staircases 122 The MCST argues that the fire escape staircases are defective as there is: (a) rainwater seepage;(b) damage to the galvanised layers; and(c) corrosion and detaching of plaster on staircase fixings. (1) Rainwater seepage 123 The MCST argues that rainwater is seeping into the wall at Staircase No 6 because of a lack of waterproofing on the Building’s roof.162Foot Note 162×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 287.The defendants take issue with the fact that no tests were carried out to prove that the seepage is caused by lack of waterproofing at the roof.163Foot Note 163×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 421–422, s/n 18, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 224. 124 All three of the parties’ experts agree that seepage of rainwater is a defect.164Foot Note 164×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 421, s/n 18.Based on the photographs adduced by the MCST,165Foot Note 165×Affidavit of Evidence in Chief of Paul Crispin Casimir-Mrowczynski at p 70, photo no 1851/35 and 1851/36.I find that there is seepage of rainwater into the walls at Staircase No 6. I thus find that there was a lack of proper care and skill in the construction of the walls of Staircase No 6. But I also accept the defendants’ argument that the MCST has not proven that the seepage is caused by lack of waterproofing at the roof. (2) Galvanised layers 125 The MCST argues that there was lack of proper care and skill in the handling of the metal staircases, causing the galvanised layers to be damaged.166Foot Note 166×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 293.The MCST also takes issue with the rectification works carried out in respect of the galvanised layers. It argues that the rectification works are haphazard and incomplete.167Foot Note 167×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 294.Orion-One argues that there is no proof that the damage to the galvanised layers was caused by lack of proper care and skill, and that it could have instead been caused by human traffic.168Foot Note 168×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 424, s/n 21. 126 I agree with Orion-One’s submission that the MCST has not proven that the damage to the galvanised layers was caused by lack of proper care and skill at the time of construction. (3) Staircase fixings 127 The MCST argues that the thinness of the plaster over the staircase fixings has led to corrosion.169Foot Note 169×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 299.According to the MCST, the fixings should not have been plastered over because the plaster traps moisture, causing corrosion. 128 It is common ground between the experts that the fixings should be repaired by removing the corrosion and not by replacing the plaster.170Foot Note 170×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 425, s/n 23.I thus accept that the staircase fixings were not constructed with proper care and skill. Tiles 129 The MCST argues that there is inadequate adhesion of tiles and lack of proper movement joints, causing tiles to debond.171Foot Note 171×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 340–341. 130 It is again common ground between the experts that the tiles should be repaired and that movement joints were not properly installed.172Foot Note 172×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 341, 1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 440, s/n 41, Affidavit of Evidence in Chief of Wong Chung Wan at pp 69–70. See also Certified Transcript dated 29 March 2017, at p 62, lines 5–9.There was thus a lack of proper care and skill in construction in this respect. 131 I note that some of the debonded tiles are found at the walkways between the balconies of the units.173Foot Note 173×Plaintiff’s Submissions at close of trial dated 23 May 2017 at p 134.Although the MCST has failed to prove that these walkways are common property (see [70]–[78] above), I accept that these defective tiles have caused damage to common property such as the façade of the building, because rainwater ingress under the defective tiles has seeped into the façade of the building, causing it to crack.174Foot Note 174×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 341, 343 and 345.The MCST can thus recover compensation for the damage to the common property caused by the defective tiles (see [80] above). Driveway 132 The MCST argues that the base of the driveway was not compacted properly before the top layer was applied, making it prone to cracking.175Foot Note 175×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 370.The defendants argue that the cracks are caused by the heavy vehicular usage and traffic in the Building.176Foot Note 176×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 443, s/n 47, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 247. 133 I accept that the cracking of the driveway is caused by lack of proper care and skill. As the reference material adduced by the MCST states:177Foot Note 177×Exhibit P6 at p 8, paragraph 1. hardened reinforced concrete cracks … when subjected to externally imposed structural loads. By means of appropriate design and detailing techniques, these cracks can be limited to acceptable levels in terms of structural integrity and aesthetics. The Building was designated for light industrial use. Proper care and skill would thus have required that the heavy vehicle usage and traffic be taken into account in the construction of the driveway, to limit cracking by employing design and detailing techniques. Carpark ramps 134 The MCST argues that the carpark ramp is slippery because: (i) the ramp is rough but the horizontal landing is smooth; (ii) the ramp is filled with multiple indented circular grooves which trap water; and (iii) the anti-skid epoxy paint finish required by the Specifications was not applied.178Foot Note 178×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 378–380.The defendants submit that no tests were conducted to prove that the ramp is slippery and that the indented circular grooves are acceptable.179Foot Note 179×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 443–444, s/n 48, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 254–255.Sanchoon further argues that anti-skid epoxy paint was not required as the tender documents replaced it with power float concrete floor finish with hardener.180Foot Note 180×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 253. 135 I accept the defendants’ submissions that the MCST has not proven that the ramp is slippery. The MCST has adduced only hearsay evidence that there have been crashes or near crashes caused by the ramp.181Foot Note 181×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 378.I also accept the evidence from the defendants’ experts that indented circular grooves are acceptable and common in Singapore182Foot Note 182×Affidavit of Evidence in Chief of Wong Chung Wan at p 64, paragraph 5.6.1.2, Certified Transcript dated 29 March 2017, at p 115, line 25.and that the requirement for anti-skid epoxy paint was replaced with power float concrete floor finish with hardener.183Foot Note 183×Affidavit of Evidence in Chief of Ting Chin Seng at p 88, s/n 1c and d. Fire hose reel casings 136 The MCST submits that the fire hose reel casings obstruct access to the fire escape staircases.184Foot Note 184×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 389.The defendants submit that the casings do not obstruct the access way and that the staircases have a walkway of 1.2m, as required by the Singapore Civil Defence Force Fire Code 2013.185Foot Note 185×1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at pp 447–448, s/n 55, 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 268. 137 From the photographs, it is clear that the casings do not obstruct the access way and that the requirement of a walkway of 1.2m is satisfied.186Foot Note 186×Affidavit of Evidence in Chief of Wong Chung Wan at p 72, Figure 44. See also 1st Defendant’s Closing Submissions dated 22 May 2017, annex IX, at p 448, s/n 55. Floor slabs 138 The MCST has identified certain areas of the Building where the floor slab is patchy.187Foot Note 187×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 404.The patching is the result of debonded coating, which the MCST blames on poor workmanship.188Foot Note 188×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 404. 139 The MCST has not satisfied me that the debonded coating is caused by poor workmanship and not some other factor, such as wear and tear. Road markings 140 The MCST submits that failing road markings are caused by poor workmanship and not wear and tear.189Foot Note 189×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 414. 141 The MCST has again only made a bare assertion that the failure of the road markings is caused by poor workmanship and not wear and tear. I am thus unable to accept the MCST’s submission. Signage 142 The MCST submits that the wall signage for firefighting equipment was installed without proper care, using double-sided tape, causing the signage to detach.190Foot Note 190×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 416. 143 The defendants do not dispute that the signage was installed using double-sided tape. I thus accept that the signage was not installed with proper care and skill. Double-sided tape cannot be expected to be adequate long-term adhesion for signage. Conclusion on Orion-One 144 The reasons for allowing or disallowing the MCST’s claim against Orion-One in respect of each item in the Scott Schedule can be found at Annex C.",
        "Mitigation": "145 Orion-One argues that the MCST has failed to mitigate its loss by:191Foot Note 191×1st Defendant’s Closing Submissions dated 22 May 2017 at paragraph 7. (a) failing to invoke the Warranties; and (b) failing to carry out its maintenance responsibilities under s 29 of the BMSMA. 146 For the reasons stated at [173]–[175] below, I reject the submission that the MCST has failed to mitigate its loss by failing to invoke the Warranties. As for the argument on the MCST’s maintenance responsibilities, I accept that the MCST’s duty to maintain extends to rectifying defects:Ocean Frontat [73]. However, Orion-One has made only a bare assertion that the MCST’s decision to postpone rectification of the defects until the conclusion of this suit has led to further deterioration of the defects.192Foot Note 192×1st Defendant’s Reply Closing Submissions dated 23 June 2017 at paragraph 255.I thus reject Orion-One’s submissions that the MCST has failed to mitigate by not performing its maintenance responsibilities.",
        "Claim against Sanchoon": "",
        "Tort": "147 It is common ground that Sanchoon owed the MCST a duty of care in constructing the common property.193Foot Note 193×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 33.What is disputed is the scope of Sanchoon’s duty of care. Sanchoon submits that its duty of care does not cover the following four broad classes of defects: (a) defects attributable to sub-contractors;194Foot Note 194×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 41.(b) defects covered under the Warranties;195Foot Note 195×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 44.(c) defects which do not pose health and safety risks;196Foot Note 196×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 45.and(d) defects arising from the architect’s design.197Foot Note 197×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 53. I deal with each of these in turn. Sub-contractors 148 An employer is not vicariously liable for the negligence of an independent contractor:Seasons Parkat [37]. 149 Sanchoon is not entitled to defeat the MCST’s claim in tort by arguing that the work complained of by the MCST in this action, even if proven to result from negligence, was the result of negligence by independent contractors engaged by Sanchoon. As the MCST points out, Sanchoon failed to plead this case anywhere in its defence.198Foot Note 198×Plaintiff’s Reply Submissions (2nd Defendant) dated 23 May 2017 at paragraph 37.The MCST will be prejudiced should Sanchoon be allowed to raise this defence at this late stage. The first indication that Sanchoon intended to rely on this defence came in its opening statement,199Foot Note 199×2nd Defendant’s Opening Statement at paragraph 29.filed a mere week before the trial was to commence. The MCST was left entirely unable to address the issue of whether Sanchoon’s sub-contractors were indeed independent contractors. Warranties 150 Sanchoon submits that it would be inequitable to allow the MCST to make concurrent claims for the defects both in tort and under the Warranties.200Foot Note 200×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 42.As a result, according to Sanchoon, its duty of care should exclude the defects covered by the Warranties.201Foot Note 201×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 44. 151 I reject Sanchoon’s submission. As the Court of Appeal noted inAnimal Concerns Research & Education Society v Tan Boon Kwee[2011] 2 SLR 146 (“AnimalConcerns”) at [60], it is possible for there to be concurrent liability in both contract and tort. The mere fact that there is a contractual backdrop to the parties’ relationship is not sufficient to exclude a duty of care. Instead, the true principle in determining whether the contractual arrangement has such an effect is whether the parties structured their contract intending thereby to exclude the imposition of a duty of care in tort:Animal Concernsat [71]. 152 Sanchoon has not shown that the parties, in entering into the Warranties, intended to exclude a duty of care on Sanchoon. In fact, the Warranties themselves appear to suggest that there was no such intention:202Foot Note 202×See, for example, Plaintiff’s Core Bundle of Documents (For Oral Submission) dated 31 July 2017 at tab 4, p 3, cl 10. The rights and benefits conferred upon [Orion-One] by this [Warranty] arein addition to any other rights and remedies[Orion-One] has or may have against [Sanchoon] including without limitation, its rights and remedies under the Contract andat law. [emphasis added] In other words, Sanchoon entered into the Warranties with Orion-One with the express intention and purpose of undertakingadditionalobligations to Orion-One, over and above any other obligations which Sanchoon might have to Orion-One in contract or in tort. There is nothing to indicate that Sanchoon intended that cumulative effect of the obligations it undertook under the Warranties to come to an end when Orion-One assigned the Warranties, as it eventually did, to the MCST. Health and safety risks 153 Sanchoon submits that it owes a duty of care to the MCST only in respect of defects which pose a risk to health or safety. For this submission, Sanchoon relies onRobinson v P E Jones (Contractors) Ltd[2011] EWCA Civ 9 (“Robinson”) andManagementCorporation Strata Title Plan No 3322 v Tiong Aik Construction Pte Ltd and another[2016] 4 SLR 521 (“Tiong Aik”).203Foot Note 203×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraphs 45–47. 154 I do not accept Sanchoon’s submission. Neither authority supports its argument. Sanchoon relies on the following excerpt from the headnote of the report inRobinson: … the relationship between ... the builder of a building and the immediate client was primarily governed by the contract between them, which represented their choice as to the allocation of risk between them; that (perMaurice Kay and Jackson LJJ),absent any assumption of responsibility,a tortious duty of care co-extensive with their contractual obligations did not spring up between them, and theonly tortious duty owed by a manufacturer or builder to his client and others who would foreseeably own or use the product or building was to take reasonable care to prevent any defect in it causing personal injury to them or damage to other property of theirs… [emphasis added in bold] 155Robinsonis an English case. The general rule in English law is that no damages are recoverable in the tort of negligence for pure economic loss. There are of course exceptions: seeRobinsonat [68] and [70] andChu Said Thong and another v Vision Law LLC[2014] 4 SLR 375 at [163]. It is for this reason that the excerpt fromRobinsonlimits the duty of care to physical injury or damage to property (as opposed to pure economic loss). 156 Singapore’s law of negligence differs significantly from English law in this respect. There is no rule in Singapore law which bars recovery of damages in the tort of negligence for pure economic loss:Spandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency[2007] 4 SLR(R) 100 at [69]. There is therefore no reason in Singapore law to limit a duty of care as a duty to avoid only causing injury to a person or damage to property. 157 Similarly,Tiong Aikdoes not stand for the proposition that a contractor owes a duty of care only in respect of risks to health or safety. Sanchoon relies on the Court of Appeal’s statements inTiong Aikthat the Building Control Act (Cap 29, 1999 Rev Ed) imposes non-delegable duties only in relation to building safety, and not in relation to other aspects of construction, such as workmanship or aesthetic flaws. But the mere fact that a contractor does not owenon-delegableduty of care in respect of workmanship or aesthetic flaws does not mean that the contractor does not oweany duty of careat allin respect of those flaws. As the Court of Appeal said inTiong Aikat [21] and [50], the common element across the categories of non-delegable duties is that the duty bearer has undertaken responsibility to the claimant in circumstances where the relationship involves a kind of special dependence or a particular vulnerability. It is this relationship which results in apersonalduty on the duty bearer. The absence of a relationship of dependence or of a particular vulnerability as between a contractor and a management corporation, for example, does not preclude a relationship of sufficient proximity such as is necessary to found a duty of care. Design 158 Sanchoon argues that it cannot be held responsible for defects caused by the architect’s design. 159 A contractor’s duty of care includes a duty to warn of design defects which an ordinarily competent contractor would suspect:Keatingat paras 3-071 and 3-079. This duty applies only to defects which are obvious, and not to those which could have been discovered only by way of additional inspections or investigations. 160 There is a dispute over whether Sanchoon’s duty to warn was engaged in relation to the following three categories of defects: (a) the lack of flashings, projections, drainage tracks and canopies;204Foot Note 204×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraphs 252, 387 and 397. (b) the positioning of the kerbs;205Foot Note 205×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 257.and (c) the fire escape staircase fixings.206Foot Note 206×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 227. 161 I find that Sanchoon’s duty to warn was engaged only in relation to the defective positioning of the kerbs. To my mind, this is the only defect which was obvious enough to trigger the duty. It is a matter of common sense that a kerb ought to be constructed on the inside of a door to prevent entry of rainwater. A kerb on the inside of a door makes it difficult for rainwater to enter as it could enter only by flowing upwards, over the kerb. In contrast, constructing a kerb on the outside of a door encourages the entry of rainwater because the rainwater is allowed to flow downwards from the kerb and seep behind the doors. 162 The other two categories of defects relate to: (i) the lack of flashings, projections, drainage tracks and canopies; and (ii) fire escape staircase fixings. These two categories require more specialist knowledge that: (i) flashings, projections, drainage tracks and canopies increase the rate of flow of rain runoff, resulting in a stronger washing effect to prevent staining;207Foot Note 207×Exhibit P5 at p 83.and (ii) plastering over staircase fixings would trap moisture, causing corrosion.208Foot Note 208×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 299.I find that these two categories are not so obvious as to trigger Sanchoon’s duty to warn. 163 In any event, even if I am wrong in finding that Sanchoon’s duty of care required it to warn the architect about the positioning of the kerbs, I find that Sanchoon is nevertheless in breach of its duty as it failed to follow the architect’s design, which called for the kerbs to be positioned on the inside of the doors.209Foot Note 209×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 258 and p 250. 164 As an aside, I note that the MCST argues that Sanchoon breached its duty by deviating from the architect’s design in not constructing the canopies. I reject this submission. The evidence shows that the decision not to proceed with the canopies was the architect’s.210Foot Note 210×Certified Transcript dated 29 March 2017, at p 166, lines 4–11.It was not the result of Sanchoon’s unilateral decision to disregard the architect’s design. Conclusion on Sanchoon’s liability in tort 165 The reasons for allowing or disallowing the MCST’s claim in respect of each item in the Scott Schedule can be found at Annex C.",
        "Warranties": "166 The MCST’s claim against Sanchoon for breach of the Warranties arises under eight Warranties.211Foot Note 211×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 151.For this purpose, I count the external precast concrete cladding warranty and the tile adhesives and bonding agents warranty as two separate warranties, which they in fact are.212Foot Note 212×Agreed Bundle of Documents, vol 5, pp 4403 and 4478.Under these eight Warranties, Sanchoon warranted that the relevant works “shall be free from any defect, deterioration, failure, lack of fitness, non-satisfaction of performance specifications or other requirements under the Contract or other faults in the Works”, and undertook that it would, upon written notice, “remedy, repair or make good to the absolute satisfaction” of the MCST the defects and any damage arising out of the defects.213Foot Note 213×See, for example, Agreed Bundle of Documents, vol 5, at p 4460, cl 1. 167 Sanchoon submits that its liability under the Warranties is limited because: (a) certain defects are not covered by the Warranties; and (b) the MCST refused to permit Sanchoon to conduct rectification works during the duration of the Warranties.214Foot Note 214×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 201. Scope of the Warranties 168 There are disagreements between the MCST and Sanchoon on whether certain defects are covered by the Warranties. Sanchoon argues that: (a) the Warranties do not apply to the strata title lots;215Foot Note 215×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 133. (b) the external precast concrete cladding warranty does not apply to defects relating to plaster and paintwork;216Foot Note 216×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 133. (c) the waterproofing warranties do not apply to defects caused by rainwater ingress;217Foot Note 217×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 134.and (d) the galvanising to metalworks warranty has expired.218Foot Note 218×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 237. 169 I reject all of Sanchoon’s submissions, except for its submission at [168(c) above]. In respect of that submission, I accept that those defects are caused by rainwater ingress and not by failure of waterproofing. I now explain why I reject Sanchoon’s other submissions. 170 First, the Warranties are not limited to defects in the common property. They expressly cover the “Premises”, defined as the “9-storey Building … on Lot 15782PT Mk 18 at Serangoon North Avenue 4 / Ang Mo Kio Avenue 5/ Yio Chu Kang Road”.219Foot Note 219×See, for example, Agreed Bundle of Documents, vol 5, at pp 4437–4438.In other words, the Warranties cover the Building as a whole and do not distinguish between the common property of the Building and the strata title lots comprised in the Building. 171 Second, the defects relating to the plaster and paintwork are caused by cracks in the external precast concrete. They are therefore covered by the external precast concrete cladding warranty. 172 Finally, it is irrelevant that the galvanising to metalworks warranty expired before the MCST commenced this action. As long as the defects in the works covered by the warranty occurred (and went unrectified) before the warranty expired, Sanchoon is in breach of the warranty. The MCST is at liberty then to seek compensation for the loss caused by the breach of warranty at any time within the limitation period, even if the warranty has expired by the time the MCST commences action. The defects covered by the galvanising to metalworks warranty were discovered, at the latest, by June 2013, when the MCST’s expert inspected the Building and documented the defects.220Foot Note 220×Affidavit of Evidence in Chief of Paul Crispin Casimir-Mrowczynski at p 26, section 3.0.At that time, the warranty had not yet expired. Permission to rectify 173 The Warranties permit the MCST to bring a claim against Sanchoon for breach of the Warranties if Sanchoon fails to rectify the defects to the MCST’s absolute satisfaction within reasonable time.221Foot Note 221×See, for example, Agreed Bundle of Documents, vol 5, at p 4461, cl 4. 174 I find that the MCST gave Sanchoon sufficient time and opportunity to rectify the defects before commencing this suit. Sanchoon was allowed to rectify the defects in December 2012.222Foot Note 222×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 167.But Sanchoon failed to rectify the defects to the satisfaction of the MCST. The MCST therefore asked for further rectification.223Foot Note 223×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraph 13.Although Sanchoon asserts that its rectifications were reasonable and sufficient,224Foot Note 224×2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 181.the Warranties provide expressly that the MCST’s decision on whether the rectifications are satisfactory is “final and conclusive”.225Foot Note 225×See, for example, Agreed Bundle of Documents, vol 5, at p 4460, cl 2.This is a subjective test. Whether the rectifications were unsatisfactory in an objective sense is thus irrelevant. 175 Discussions between the MCST and Sanchoon about further rectifications eventually fell through for two reasons. First, the MCST was unwilling to accept Sanchoon’s disclaimer that it would conduct the further rectifications on a goodwill basis, without admission of liability. Second, Sanchoon took the position that they were not responsible for (and would therefore not rectify) several of the alleged defects.226Foot Note 226×Plaintiff’s Reply Submissions (1st Defendant) dated 27 June 2017 at paragraphs 9 and 15xiii. See also Agreed Bundle of Documents, vol 6, at pp 5092–5096.By the time these discussions fell through, about two years had passed since the defects were discovered, from February 2012 to December 2013.227Foot Note 227×Affidavit of Evidence in Chief of Ong Choon @ David Ong at paragraph 16 and 2nd Defendant’s Closing Submissions dated 22 May 2017 at paragraph 205.Bearing in mind that the MCST had to avoid various time-bars, I find that the MCST did give Sanchoon reasonable time and opportunity to rectify the defects. Conclusion on Sanchoon’s breach of the Warranties 176 Sanchoon is thus liable for breach of warranty for the defects covered by the Warranties, as set out in Annex C.",
        "Conclusion": "177 For the reasons above, I hold in favour of the MCST and the subsidiary proprietors which it represents (see Annex A) in respect of the defects I have found Orion-One and Sanchoon to be liable for (see Annex C). I will hear the parties on costs and on any consequential orders to be made, including but not limited to the assessment of damages. Vinodh CoomaraswamyJudge Edmond Pereira, Goh Chui Ling and Lim Chee San (instructed) (Edmond Pereira Law Corporation) for the plaintiff;Christopher Chuah, Lydia Yahaya and Alyssa Tan (WongPartnership LLP) for the first defendant;Josephine Choo, Wilbur Lim, Jeffrey Koh and Valerie Quay (WongPartnership LLP) for the second defendant.",
        "": "",
        "Annex A": "S/NUnit NoSubsidiary ProprietorWhether MCST represents subsidiary proprietor1.#01-01Hiap Heng Heavy Equipment Co Pte LtdYes (LOA affixed with company stamp)228Foot Note 228×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC25.2.#01-02Hiap Heng Heavy Equipment Co Pte LtdYes (LOA affixed with company stamp)229Foot Note 229×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC25.3.#01-03Poo Sia Chyuong /Ker Poh Swan /Poo Ce Huang trading as Hup Hock Sing InvestmentNo (LOA not signed by all co-owners)230Foot Note 230×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC30.4.#01-04Foo Chee Peak @ Foo Chu Peak / Phua Ah Eng / Foo Cheche (Fu Ceyi) trading as C P Foo InvestmentNo (LOA not signed by all co-owners)231Foot Note 231×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC35.5.#01-05Lip Plastic Enterprise Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)6.#01-06Lip Plastic Enterprise Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)7.#01-07Abdul Kuthoose Diwan BeeviYes232Foot Note 232×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC40.8.#01-08Abdul Kuthoose Diwan BeeviYes9.#01-14Hi-Tech Fibreglass (S) Pte LtdYes (LOA affixed with company stamp)233Foot Note 233×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC45.10.#01-15Te Siow Long (Zheng Xiaolong)Yes234Foot Note 234×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC50.11.#01-16Sergent Services Pte LtdNo (claim withdrawn)235Foot Note 235×Statement of Claim (Amendment No 2).12.#01-17Chong Boon ThongYes236Foot Note 236×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC56.13.#01-19Tey Chaw Tee trading as CT BuildersYes237Foot Note 237×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC61.14.#01-211 Tech Solutions Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)15.#01-23Ang Boon Soon & Tan Siok EngNo (LOA not signed by all co-owners)238Foot Note 238×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC67.16.#01-29Multipower Distribution Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)17.#01-30Sin Siew Realty Pte LtdNo (LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)239Foot Note 239×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC68 and SAEIC72.18.#01-31Ong Tian Soon @ Ang Thian Soon / Soh Bee LeeYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)240Foot Note 240×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC75 and SAEIC77.19.#01-34Management officeNo (claim withdrawn)241Foot Note 241×Statement of Claim (Amendment No 2).20.#01-35Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)242Foot Note 242×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.21.#01-36Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)243Foot Note 243×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.22.#01-37Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)244Foot Note 244×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.23.#01-41World O’Kids (Pte) LtdYes (LOA affixed with company stamp)245Foot Note 245×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC87.24.#01-42Seah Soi Chena trading as Teck Joo Hardware & EngineeringYes246Foot Note 246×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC92; Agreed Bundle of Documents, vol 2, p 1364.25.#01-46Wee Tee Tong Chemicals Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)26.#01-47Wee Tee Tong Chemicals Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)27.#01-51Foo Su Mei / Foo Su LeeNo (LOA not signed by all co-owners)247Foot Note 247×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC102.28.#01-52Foo See Han / Wong Eng Ping / Foo Hui Chin (Fu Huiqing) / Foo Hui Yen (Fu Huiyan) trading as Kindred InvestmentsNo (LOA not signed by all co-owners)248Foot Note 248×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC107.29.#01-53Foo Kok Nong / Yeo Ah KooNo (LOA not signed by all co-owners)249Foot Note 249×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC110 and SAEIC112.30.#01-54Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)250Foot Note 250×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.31.#01-55Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)251Foot Note 251×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.32.#01-56Hong Huat Brothers Pte LtdYes (LOA affixed with company stamp)252Foot Note 252×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC82.33.#01-60CMT Electronics Pte LtdYes (LOA affixed with company stamp)253Foot Note 253×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC117.34.#01-61Seah Soi ChenaYes35.#02-03Asialand Construction Pte LtdYes (LOA affixed with company stamp)254Foot Note 254×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC122.36.#02-04Tan Ai ChinNo (LOA is hearsay, no affidavit of evidence in chief filed)37.#02-05Trident Corporation (S) Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)38.#02-06Trident Corporation (S) Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)39.#02-07OST Refrigeration Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)40.#02-10Sea Soi ChenaYes41.#02-13ACS Venture Pte LtdYes (LOA affixed with company stamp)255Foot Note 255×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC127.42.#02-14Yu Ting Pin / Wong Kum SengNo (LOA is hearsay, no affidavit of evidence in chief filed)43.#02-15Peaceon Screens Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)44.#02-16Derick Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)45.#02-19Kek Kok Hwa / Ng Ah KimNo (LOA not signed by all co-owners)256Foot Note 256×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC132.46.#02-22Rh Synergy (S) Pte LtdNo (claim withdrawn)257Foot Note 257×Statement of Claim (Amendment No 2).47.#02-24SingDuct (S) Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)48.#02-26Sim Wee Meng (Shen Weiming) / Koh Yong Kwee (Xu Ronggui)No (LOA is hearsay, no affidavit of evidence in chief filed)49.#02-32Meizhuan Builders Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)50.#02-33Meizhuan Builders Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)51.#02-34Meizhuan Builders Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)52.#02-35Meizhuan Builders Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)53.#02-36SingDuct (S) Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)54.#02-37Chiam Geak SengNo (LOA is hearsay, no affidavit of evidence in chief filed)55.#02-38Huang Shuilong / Ke QinglinNo (LOA is hearsay, no affidavit of evidence in chief filed)56.#02-39Koh Kek Jin / Wong Bee LinNo (LOA is hearsay, no affidavit of evidence in chief filed)57.#02-40JAS Components Singapore Pte LtdYes (LOA affixed with company stamp)258Foot Note 258×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC137.58.#02-45Infantree Pte LtdNo (claim withdrawn)259Foot Note 259×Statement of Claim (Amendment No 2).59.#02-46Vision Zenith Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)60.#02-47Infantree Pte LtdNo (claim withdrawn)260Foot Note 260×Statement of Claim (Amendment No 2).61.#02-49Boon Liew Electrical & Engineering Pte LtdYes (LOA affixed with company stamp)261Foot Note 261×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC142.62.#02-50Teo Guan Hoe trading as Precise Tooling SystemYes262Foot Note 262×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC147.63.#02-51Chua Poh KengNo (LOA is hearsay, no affidavit of evidence in chief filed)64.#02-52Vz Logistics Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)65.#02-53Addiction Foods Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)66.#02-54TLS International (Pte) LtdYes (LOA affixed with company stamp)263Foot Note 263×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC152.67.#02-55Comit Plastic Pte LtdYes (LOA affixed with company stamp)264Foot Note 264×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC157.68.#02-56Comit Plastic Pte LtdYes (LOA affixed with company stamp)265Foot Note 265×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC157.69.#02-57TLS International (Pte) LtdYes (LOA affixed with company stamp)266Foot Note 266×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC152.70.#02-59Chemlink Pacific Pte LtdYes (LOA affixed with company stamp)267Foot Note 267×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC162.71.#02-60Orika Impex Pte LtdYes (LOA affixed with company stamp)268Foot Note 268×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC167.72.#03-01EZPRINT Pte LtdNo (claim withdrawn)269Foot Note 269×Statement of Claim (Amendment No 2).73.#03-02T3 International Pte LtdYes (LOA affixed with company stamp)270Foot Note 270×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC172.74.#03-03Ong Ek ChuanYes271Foot Note 271×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC177.75.#03-06Lee Keng Cheong / Ong Li LiNo (LOA is hearsay, no affidavit of evidence in chief filed)76.#03-09Metalmex Illuminazione (Asia) Pte LtdNo (claim withdrawn)272Foot Note 272×Statement of Claim (Amendment No 2).77.#03-13Pacific Lighting (Singapore) Pte LtdYes (LOA affixed with company stamp)273Foot Note 273×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC183.78.#03-14Wisdom Alpha Marine Services Pte LtdYes (LOA affixed with company stamp)274Foot Note 274×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC188.79.#03-16Ampec Electronics Pte LtdNo (LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)275Foot Note 275×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC189 and SAEIC193.80.#03-17Corrom Pte LtdYes (LOA affixed with company stamp)276Foot Note 276×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC199.81.#03-18Ampec Electronics Pte LtdNo (LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)277Foot Note 277×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC189 and SAEIC193.82.#03-19BT&Tan Transport Pte LtdYes (LOA affixed with company stamp)278Foot Note 278×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC200.83.#03-21Kee Kam OonYes279Foot Note 279×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC201.84.#03-23AVS Vision Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)85.#03-26Reliant Human Resources Pte LtdNo (claim withdrawn)280Foot Note 280×Statement of Claim (Amendment No 2).86.#03-32BJC Global Pte LtdYes (LOA affixed with company stamp)281Foot Note 281×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC210.87.#03-33BJC Global Pte LtdYes (LOA affixed with company stamp)282Foot Note 282×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC210.88.#03-34Phua Kim HongYes283Foot Note 283×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC211.89.#03-37Liftcare Pte LtdNo (claim withdrawn)284Foot Note 284×Statement of Claim (Amendment No 2).90.#03-39Ying He Precision Industries Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)91.#03-40YongSheng Engrg Pte LtdNo (claim withdrawn)285Foot Note 285×Statement of Claim (Amendment No 2).92.#03-42OST Refrigeration Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)93.#03-43Chan Yee Leong / Heng Siew Mio (Wang Xiumiao)No (LOA is hearsay, no affidavit of evidence in chief filed)94.#03-44Circle Power Electrical Engineering Pte LtdYes (LOA affixed with company stamp)286Foot Note 286×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC220.95.#03-45Oon Peng Lim / Seah Chor NahYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)287Foot Note 287×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC223 and SAEIC225.96.#03-46FS-3D Support Solutions Pte LtdYes (LOA affixed with company stamp and discrepancy as to name in statement of claim is immaterial)288Foot Note 288×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC232.97.#03-50Ho Hooi Min / Lim Siew ChinNo (LOA not signed by all co-owners)289Foot Note 289×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC237.98.#03-51PMT Technology (S) Pte LtdYes (LOA affixed with company stamp)290Foot Note 290×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC242.99.#03-52Woo Mei YienNo (LOA is hearsay, no affidavit of evidence in chief filed)100.#03-53Lim Poh KokNo (claim withdrawn)291Foot Note 291×Statement of Claim (Amendment No 2).101.#03-54Interfreight Logistics Pte LtdNo (claim withdrawn)292Foot Note 292×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 131.102.#03-56Mainfreight (S) Pte LtdYes (LOA affixed with company stamp)293Foot Note 293×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC247.103.#03-57Hou Wen HauYes294Foot Note 294×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC252.104.#03-58Hou Wen HauYes105.#03-62Admoreon Engineering Pte LtdNo (claim withdrawn)295Foot Note 295×Statement of Claim (Amendment No 2).106.#04-03Soh Teng Ann trading as Pointer Commercial ArtYes296Foot Note 296×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC254.107.#04-04Tubefit (Singapore) Pte LtdYes (LOA affixed with company stamp)297Foot Note 297×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC263.108.#04-05Floorspec Pte LtdYes (LOA affixed with company stamp)298Foot Note 298×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC268.109.#04-06Floorspec Pte LtdYes (LOA affixed with company stamp)299Foot Note 299×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC268.110.#04-07Immco Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)111.#04-08Immco Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)112.#04-09Win Win Food Singapore Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)113.#04-10Lee Melvin / Lee Wee FoonYes (LOA is not hearsay as one co-owner took the stand)300Foot Note 300×Certified Transcript dated 6 March 2018, at p 106, lines 7–8.114.#04-11Istar Creation Pte LtdYes (LOA affixed with company stamp)301Foot Note 301×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC278.115.#04-12EOP21 Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)116.#04-13EOP21 Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)117.#04-14EOP21 Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)118.#04-16EOP21 Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)119.#04-17ID Care TradingNo (claim withdrawn)302Foot Note 302×Statement of Claim (Amendment No 2)120.#04-18EOP21 Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)121.#04-20Yu Chun MeiNo (LOA is hearsay, no affidavit of evidence in chief filed)122.#04-21Tan Lye Seng / Samuel Soh Aik Meng / Seah Mui Hui EstherNo (LOA not signed by all co-owners)303Foot Note 303×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC283.123.#04-24Mecbatec Enterprise Pte LtdYes (LOA affixed with company stamp)304Foot Note 304×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC288.124.#04-26Mecbatec Enterprise Pte LtdYes (LOA affixed with company stamp)305Foot Note 305×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC288.125.#04-32MA Electronics Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)126.#04-33M3 Aesthetic Framework System Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)127.#04-38Liao Mei YunYes306Foot Note 306×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC289.128.#04-39General Auto Pte LtdYes (LOA affixed with company stamp)307Foot Note 307×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC298.129.#04-40Lee Mei Ling (Li Meiling)No (LOA is hearsay, no affidavit of evidence in chief filed)130.#04-41Chua Kok Cheong & Goh Poh YinYes308Foot Note 308×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC299.131.#04-43Avo Kinetix Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)132.#04-44Mohamed Ariff S/O Abdul Rahim / M A Haleelur RahmanNo (LOA not signed by all co-owners)309Foot Note 309×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC310.133.#04-45Huang Kee Building Maintenance Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)134.#04-49Ang Kit Leng trading as Accarb EnterpriseYes310Foot Note 310×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC315; Agreed Bundle of Documents, vol 3, p 2383.135.#04-50Builders Trends Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)136.#04-51Golden Leaf Curtain Centre Pte LtdYes (LOA affixed with company stamp)311Foot Note 311×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC320.137.#04-52Builders Trends Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)138.#04-56Dashmesh Singapore Pte LtdYes (LOA affixed with company stamp)312Foot Note 312×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC325.139.#04-59JCK Controls Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)140.#04-61Dream Studios (2007) Pte LtdYes (LOA affixed with company stamp)313Foot Note 313×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC331.141.#04-62Dream Studios (2007) Pte LtdYes (LOA affixed with company stamp)314Foot Note 314×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC331.142.#05-01Cheah Eng Hang / Cheah Chew WengNo (LOA not signed by all co-owners)315Foot Note 315×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC337.143.#05-07New Eng Thiam trading as New Plumbing ContractorYes316Foot Note 316×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC338.144.#05-14Dream Studios Pte LtdYes (LOA affixed with company stamp)317Foot Note 317×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC330.145.#05-16AMX Engineering Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)146.#05-17Teo Hock Long / Teo Hock SengNo (LOA not signed by all co-owners)318Foot Note 318×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC348147.#05-18Chng Mui Seng / Chua Lee HiangNo (LOA not signed by all co-owners)319Foot Note 319×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC353.148.#05-21Accom Pte LtdNo (claim withdrawn)320Foot Note 320×Statement of Claim (Amendment No 2).149.#05-22PIE Engineering Pte LtdYes (LOA affixed with company stamp)321Foot Note 321×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC358.150.#05-24Mei De Engineering Pte LtdYes (LOA affixed with company stamp)322Foot Note 322×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC363.151.#05-25Mex Quest Engineering (S) Pte LtdYes (LOA affixed with company stamp)323Foot Note 323×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC368.152.#05-26Tang Cheng Teck trading as Manjyo TradingYes324Foot Note 324×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC369.153.#05-27Summer Pond & Landscaping Pte LtdYes (LOA affixed with company stamp)325Foot Note 325×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC378.154.#05-28Tang Cheng Teck trading as Manjyo TradingYes326Foot Note 326×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC369.155.#05-29Atlas Technologies Corporation Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)156.#05-32Ho Eng Huat Construction Pte LtdYes (LOA affixed with company stamp)327Foot Note 327×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC383.157.#05-33Witco Envirotech Pte LtdYes (LOA affixed with company stamp)328Foot Note 328×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC388.158.#05-34Foo Chin Wei / Ow Siew EngNo (LOA not signed by all co-owners and LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)329Foot Note 329×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC391 and SAEIC193.159.#05-36Builders Hub Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)160.#05-39KLW Builders Pte LtdNo (claim withdrawn)330Foot Note 330×Statement of Claim (Amendment No 2).161.#05-41Valves Com Pte LtdYes (LOA affixed with company stamp)331Foot Note 331×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC398.162.#05-43Paul Thiyagaraj S/O Koil Pillai / Esther D/O A E GeorgeNo (LOA not signed by all co-owners)332Foot Note 332×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC403.163.#05-45Poon Buck Aik trading as Aik Fah TradingYes333Foot Note 333×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC408; Agreed Bundle of Documents, vol 3, p 2575.164.#05-46Phua Chai Hung Jason / Lee Nyuk ChinNo (claim withdrawn)334Foot Note 334×Statement of Claim (Amendment No 2).165.#05-47Poon Buck Aik trading as Aik Fah TradingYes335Foot Note 335×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC408; Agreed Bundle of Documents, vol 3, p 2575.166.#05-49Poon Buck Aik trading as Aik Fah TradingYes167.#05-51New Asia Ingredients Pte LtdYes (LOA affixed with company stamp)336Foot Note 336×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC413.168.#05-52Xod Box Pte LtdYes (LOA affixed with company stamp)337Foot Note 337×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC418.169.#05-53TC Management Pte LtdYes (LOA affixed with company stamp)338Foot Note 338×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC423.170.#05-57New Asia Ingredients Pte LtdYes (LOA affixed with company stamp)339Foot Note 339×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC413.171.#05-62TWH Electrical Engineering Pte LtdYes (LOA affixed with company stamp)340Foot Note 340×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC428.172.#06-02Uei Logistic(S) Pte LtdYes (LOA affixed with company stamp)341Foot Note 341×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC433.173.#06-04Alpine Aire Services Pte LtdYes (LOA affixed with company stamp)342Foot Note 342×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC438.174.#06-05Link Fab Technologies Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)175.#06-06Broadcast Communications International Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)176.#06-07Ng Wee Nam / Lee Siok GoonNo (LOA is hearsay, no affidavit of evidence in chief filed)177.#06-08AJ Jetting Pte LtdNo (LOA signed by individual director of company subsidiary-proprietor)343Foot Note 343×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC36–SAEIC40.178.#06-09Chye Thiam Maintenance Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)179.#06-23Apecus Technologies Pte LtdYes (LOA affixed with company stamp)344Foot Note 344×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC443.180.#06-24Magnetic Screen Pte LtdYes (LOA affixed with company stamp)345Foot Note 345×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC448.181.#06-25Evergreen Landscape & Construction Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)182.#06-26Donovan Lee Reeves / Benjamin Gilbert ReevesNo (LOA is hearsay, no affidavit of evidence in chief filed)183.#06-28T & F Investment Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)184.#06-30Arcadia Engineering Services Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)185.#06-34Mole Engineering Pte LtdYes (LOA affixed with company stamp)346Foot Note 346×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC453.186.#06-35Ong Choon @ David Ong / Cheong Wong Hee / Ong Li Mun AndyYes (although not all co-owners signed LOAs, authority from those co-owners is evident from their affidavits of evidence in chief)347Foot Note 347×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC456 and SAEIC458.187.#06-36Corlison Pte LtdYes (LOA affixed with company stamp)348Foot Note 348×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC463.188.#06-37Corlison Pte LtdYes (LOA affixed with company stamp)349Foot Note 349×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC463.189.#06-38Corlison Pte LtdYes (LOA affixed with company stamp)350Foot Note 350×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC463.190.#06-39Corlison Pte LtdYes (LOA affixed with company stamp)351Foot Note 351×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC463.191.#06-40Goh Lee Lee & Tay Soo Leng trading as ALLEGRO-BRIOYes352Foot Note 352×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC464; Agreed Bundle of Documents, vol 4, p 2913.192.#06-43Reef Depot Pte LtdYes (LOA affixed with company stamp)353Foot Note 353×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC473.193.#06-44Benruson Marketing (S) Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)194.#06-49JCK Controls Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)195.#06-50Apecus Technologies Pte LtdYes (LOA affixed with company stamp)354Foot Note 354×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC443.196.#06-51MLJ Dental Trading Pte LtdYes (LOA affixed with company stamp)355Foot Note 355×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC478.197.#06-53Pacing Luck Engtrade Pte LtdYes (LOA affixed with company stamp)356Foot Note 356×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC483.198.#06-54MechFire Engineering & Construction Pte LtdYes (LOA affixed with company stamp)357Foot Note 357×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC488.199.#06-55DTC World Corporation Pte LtdNo (claim withdrawn)358Foot Note 358×Statement of Claim (Amendment No 2).200.#06-56Chin King Siang trading as Castle Peak EnterpriseYes359Foot Note 359×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC489.201.#06-57Chin King Siang trading as Castle Peak EnterpriseYes202.#06-58Chin King Siang trading as Castle Peak EnterpriseYes203.#06-60Candy Floriculture Pte LtdYes (LOA affixed with company stamp)360Foot Note 360×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC498.204.#06-61Candy Floriculture Pte LtdYes (LOA affixed with company stamp)361Foot Note 361×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC498.205.#07-01Jerevin Industrial Pte LtdYes (LOA affixed with company stamp)362Foot Note 362×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC503.206.#07-03Chew Bee Kow trading as Goodcare Building Services ContractorNo (LOA is hearsay, no affidavit of evidence in chief filed)207.#07-06Pet Lovers Centre Pte LtdNo (claim withdrawn)363Foot Note 363×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 131.208.#07-07W & Lee (S) Pte LtdNo (claim withdrawn)364Foot Note 364×Statement of Claim (Amendment No 2).209.#07-09Ademco Investments Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)210.#07-12Goh General Engineering Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)211.#07-14Asia Outdoor.Org Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)212.#07-15Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)365Foot Note 365×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.213.#07-16Kian Hong Aluminium Works Pte LtdYes (LOA affixed with company stamp)366Foot Note 366×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC514.214.#07-17Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)367Foot Note 367×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.215.#07-18Kian Hong Aluminium Works Pte LtdYes (LOA affixed with company stamp)368Foot Note 368×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC514.216.#07-19Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)369Foot Note 369×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.217.#07-20Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)370Foot Note 370×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.218.#07-21Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)371Foot Note 371×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.219.#07-22Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)372Foot Note 372×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.220.#07-23Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)373Foot Note 373×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.221.#07-24Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)374Foot Note 374×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.222.#07-25Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)375Foot Note 375×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.223.#07-26Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)376Foot Note 376×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.224.#07-27Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)377Foot Note 377×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.225.#07-28Telimax Technology (S) Pte LtdYes (LOA affixed with company stamp)378Foot Note 378×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC519.226.#07-29Pet Lovers Centre Pte LtdYes (LOA affixed with company stamp)379Foot Note 379×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC508.227.#07-31Chiang Lee Juin @ Chiang Siong Oh / Lim Peng Siang / Chew Seng Huat / Yeo Chong Beng / Khiang Khoon Tian Dragon And Lion Dance AssociationNo (LOA is hearsay, no affidavit of evidence in chief filed)228.#07-32Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)380Foot Note 380×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.229.#07-33Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)381Foot Note 381×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.230.#07-34Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)382Foot Note 382×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.231.#07-35Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)383Foot Note 383×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.232.#07-36Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)384Foot Note 384×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.233.#07-37Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)385Foot Note 385×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.234.#07-38Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)386Foot Note 386×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC24.235.#07-39Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)387Foot Note 387×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.236.#07-43Chow Chang Wei ValiantYes388Foot Note 388×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC525.237.#07-46Lim Poh KokNo (claim withdrawn)389Foot Note 389×Statement of Claim (Amendment No 2).238.#07-48Lim Poh KokNo (LOA is hearsay, no affidavit of evidence in chief filed)239.#07-50Teh Chwee LanNo (LOA is hearsay, no affidavit of evidence in chief filed)240.#07-51Yip Hon Seng Anthony trading as Multi Image EnterpriseYes390Foot Note 390×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC534; Agreed Bundle of Documents, vol 4, p 3271.241.#07-52Lim Poh KokNo (LOA is hearsay, no affidavit of evidence in chief filed)242.#07-53Fong Yang Air-Conditioning Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)243.#07-54James Ross Knudson / Alabons Anatasia LaurettaYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)391Foot Note 391×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC537 and SAEIC540.244.#07-55Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)392Foot Note 392×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.245.#07-56Yunnan Investment & Development Pte LtdYes (LOA affixed with company stamp)393Foot Note 393×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC524.246.#07-57Airecontrol Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)247.#07-58Nover Engineering Pte LtdYes (LOA affixed with company stamp)394Foot Note 394×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC545.248.#07-61Forte Resources Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)249.#08-01Tong Wang ChinNo (claim withdrawn)395Foot Note 395×Statement of Claim (Amendment No 2).250.#08-02Lim Chor Yeow / Tricia Tan Yi Joo / Tan Sek YamNo (LOA not signed by all co-owners)396Foot Note 396×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC550.251.#08-04Kamal Kanta Mrs Kultar Singh MayallYes397Foot Note 397×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC551.252.#08-06Kamal Kanta Mrs Kultar Singh MayallYes253.#08-08Yueh Song Choo trading as YH DesignYes398Foot Note 398×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC560; Agreed Bundle of Documents, vol 4, p 3400.254.#08-09Lim Hup Seng / Koay Siew Keow @ Lim Siew KeowNo (LOA not signed by all co-owners)399Foot Note 399×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC569.255.#08-10Istar Creation Pte LtdNo (claim withdrawn)400Foot Note 400×Statement of Claim (Amendment No 2).256.#08-18Tan Yeow Lok / Tan Meow HoonYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)401Foot Note 401×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC572 and SAEIC574.257.#08-20Ng Sze Mee ThereseNo (LOA is hearsay, no affidavit of evidence in chief filed)258.#08-21Expedient Tech Pte LtdYes (LOA affixed with company stamp)402Foot Note 402×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC580.259.#08-24Kaisavapany S/O Krishnasamy @ Kesavapany / Padmini D/O K K Pakpoo Mrs Padmini KesavapanyNo (LOA not signed by all co-owners)403Foot Note 403×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC585.260.#08-27Connections International Pte LtdNo (claim withdrawn)404Foot Note 404×Statement of Claim (Amendment No 2).261.#08-28Hong Hua Guan Marine & Engineering Pte LtdYes (LOA affixed with company stamp)405Foot Note 405×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC590.262.#08-30Hong Hua Guan Marine & Engineering Pte LtdYes (LOA affixed with company stamp)406Foot Note 406×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC590.263.#08-32Goh Cher Lang @ Shi Kuan Ching @ Shi Tong Chi / Tan Chye YongNo (LOA is hearsay, no affidavit of evidence in chief filed)264.#08-35F.D. Rareodd Holdings Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)265.#08-37Lim Kwee Cher Vicki ShirleyYes266.#08-39Sridha Engineering Pte LtdYes (LOA affixed with company stamp)407Foot Note 407×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC600.267.#08-42Long Siew Chiuen / Sng Teck Lim / Sng Beng KimNo (LOA not signed by all co-owners)408Foot Note 408×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC605.268.#08-48Eng Li HiangNo (claim withdrawn)409Foot Note 409×Statement of Claim (Amendment No 2).269.#08-49Uma Devi D/O NadesvaranYes270.#08-54Tan Yeow Lok / Tan Meow HoonYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)410Foot Note 410×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC572 and SAEIC575.271.#08-55Nenutec Asia Pacific Pte LtdYes (LOA affixed with company stamp)411Foot Note 411×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC616.272.#08-58Huang ZhenFeng / Huang ShenPingNo (LOA is hearsay, no affidavit of evidence in chief filed)273.#08-59Ho Chih KwongNo (claim withdrawn)412Foot Note 412×Statement of Claim (Amendment No 2).274.#08-61Ang Siew LayNo (claim withdrawn)413Foot Note 413×Statement of Claim (Amendment No 2).275.#08-63Richcoy Pte LtdYes (LOA affixed with company stamp)414Foot Note 414×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC620.276.#08-64PTC Pte LtdNo (claim withdrawn)415Foot Note 415×Plaintiff’s Submissions at close of trial dated 23 May 2017 at paragraph 131.277.#08-65Oon Peng LimYes278.#08-67PTC Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)279.#08-69PTC Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)280.#08-70Origin Resources Pte LtdYes (LOA affixed with company stamp)416Foot Note 416×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC626.281.#08-71PTC Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)282.#08-72Lew Yow Loing / Toh Bee PengNo (LOA not signed by all co-owners)417Foot Note 417×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC631.283.#08-73PTC Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)284.#08-75Eastcompeace Smart Card (Singapore) Pte LtdYes (LOA affixed with company stamp)418Foot Note 418×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC636.285.#08-76Lifetex Collections Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)286.#08-77Eastcompeace Smart Card (Singapore) Pte LtdYes (LOA affixed with company stamp)419Foot Note 419×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC636.287.#08-78Lifetex Collections Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)288.#08-79Eastcompeace Smart Card (Singapore) Pte LtdYes (LOA affixed with company stamp)420Foot Note 420×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC636.289.#08-80Huang Kee Building Maintenance Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)290.#08-81LKP Pte LtdNo (claim withdrawn)421Foot Note 421×Statement of Claim (Amendment No 2).291.#08-82FD Chapman Pte LtdYes (LOA affixed with company stamp)422Foot Note 422×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC641.292.#08-83Seah Chor NahYes293.#08-84FDD Design Pte LtdYes (LOA affixed with company stamp)423Foot Note 423×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC642.294.#08-85Wan Sheng Hao Construction Pte LtdNo (claim withdrawn)424Foot Note 424×Statement of Claim (Amendment No 2).295.#08-86Events People Inc Pte LtdYes (LOA affixed with company stamp)425Foot Note 425×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC647.296.#08-87Harvest Soon Industrial SuppliesNo (claim withdrawn)426Foot Note 426×Statement of Claim (Amendment No 2).297.#08-88Pilescan Geotechnical Service Pte LtdNo (claim withdrawn)427Foot Note 427×Statement of Claim (Amendment No 2).298.#08-89Pacing Luck Engtrade Pte LtdYes (LOA affixed with company stamp)428Foot Note 428×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC483.299.#08-90Wei Cheng To TirtakusumoNo (LOA is hearsay, no affidavit of evidence in chief filed)300.#08-91Lu Zu LiangNo (LOA is hearsay, no affidavit of evidence in chief filed)301.#08-92Triple-Max Engineering Pte LtdYes (LOA affixed with company stamp)429Foot Note 429×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC652.302.#08-93MDS Pacific Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)303.#08-94Tan Guan Lee Company LimitedYes (LOA affixed with company stamp)430Foot Note 430×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC657.304.#08-95Lim Beng Cheng / Ng Bee YongNo (LOA is hearsay, no affidavit of evidence in chief filed)305.#08-96Tan Guan Lee Company LimitedYes (LOA affixed with company stamp)431Foot Note 431×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC657.306.#08-98Zhong Cheng Development Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)307.#08-104Toh Khing HoonNo (claim withdrawn)432Foot Note 432×Statement of Claim (Amendment No 2).308.#08-106Biam Technology Pte LtdYes (LOA affixed with company stamp)433Foot Note 433×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC662.309.#08-107Ng Eng Huat / Ng Hui EnnYes (discrepancy as to name in statement of claim is immaterial)434Foot Note 434×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC663.310.#09-04Charmine Leong Chen SinNo (claim withdrawn)435Foot Note 435×Statement of Claim (Amendment No 2).311.#09-05Koo Yew Heap / Yap Ee ChooNo (LOA not signed by all co-owners)436Foot Note 436×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC673.312.#09-06Goh Song How / Leong Kay PengNo (LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)437Foot Note 437×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC674–SAEIC678.313.#09-07Semsatti Mohamed Kassim Jainulabideen / Kadir MuhyideenNo (LOA not signed by all co-owners)438Foot Note 438×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC684.314.#09-09Edward Tay Thiam ChyeNo (claim withdrawn)439Foot Note 439×Statement of Claim (Amendment No 2).315.#09-10IPT Services Pte LtdYes (LOA affixed with company stamp)440Foot Note 440×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC689.316.#09-12Yueh Song Choo trading as YH DesignYes441Foot Note 441×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC560; Agreed Bundle of Documents, vol 5, p 3875.317.#09-13Thia Bee Eng / Thia Bee HuaNo (LOA not signed by all co-owners)442Foot Note 442×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC694.318.#09-14Qsec Pte LtdYes (LOA affixed with company stamp)443Foot Note 443×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC699.319.#09-16Chin Seow WahNo (claim withdrawn)444Foot Note 444×Statement of Claim (Amendment No 2).320.#09-18Cornerstone Investments Holdings Pte LtdYes (LOA affixed with company stamp)445Foot Note 445×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC704.321.#09-20Tan Kay JinNo (LOA is hearsay, no affidavit of evidence in chief filed)322.#09-30Yong Chee Meng / Lim Gek LanNo (LOA not signed by all co-owners)446Foot Note 446×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC709.323.#09-38Sng Teck Lim / Long Siew ChiuenNo (LOA not signed by all co-owners)447Foot Note 447×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC601–SAEIC605.324.#09-40Sng Teck Lim / Long Siew ChiuenNo (LOA not signed by all co-owners)448Foot Note 448×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC601–SAEIC605.325.#09-42SVS Intertrade Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)326.#09-49Fong Yit FoonYes449Foot Note 449×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC710.327.#09-51Foong Yuit ChunYes450Foot Note 450×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC715.328.#09-52Lim Jui SeckNo (claim withdrawn)451Foot Note 451×Statement of Claim (Amendment No 2).329.#09-54Pang Euu NguangNo (LOA is hearsay, no affidavit of evidence in chief filed)330.#09-60Ho Sweet Ling / Khoo Kok PengNo (LOA is hearsay, no affidavit of evidence in chief filed)331.#09-63IBMS Technology Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)332.#09-66Ong Li LiYes452Foot Note 452×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC720.333.#09-67Liew Fook Goh / Juat Meng @ Audrey LiewYes453Foot Note 453×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC725.334.#09-68Aurora Real Estate Pte LtdYes (LOA affixed with company stamp)454Foot Note 454×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC734.335.#09-69Sunshine Land Pte LtdYes (LOA affixed with company stamp)455Foot Note 455×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC739.336.#09-70Jennychew Pte LtdYes (LOA affixed with company stamp)456Foot Note 456×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC744.337.#09-72Diamond International Consolidators (S) Pte LtdYes (LOA affixed with company stamp)457Foot Note 457×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC749.338.#09-74Diamond International Consolidators (S) Pte LtdYes (LOA affixed with company stamp)458Foot Note 458×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC749.339.#09-75Ng Chin Sin / Tan Lai FoongYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)459Foot Note 459×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC752 and SAEIC754.340.#09-76Diamond International Consolidators (S) Pte LtdYes (LOA affixed with company stamp)460Foot Note 460×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC749.341.#09-82Tan Thiam HongNo (LOA is hearsay, no affidavit of evidence in chief filed)342.#09-84Lai Tau Lim / Lim Peng SiangYes461Foot Note 461×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC755.343.#09-85Dong Heng Watch Trading Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)344.#09-87Deng Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)345.#09-88Gao Huazhu trading as Ten Fu Engineering WorksNo (LOA is hearsay, no affidavit of evidence in chief filed)346.#09-89Aw Kim SengYes (Although no affidavit of evidence in chief filed, voted in special resolution)462Foot Note 462×Agreed Bundle of Documents, vol 6, p 5117 at s/n 53.347.#09-90De Northstar Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)348.#09-91Lee Choong JeeNo (LOA is hearsay, no affidavit of evidence in chief filed)349.#09-92De Northstar Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)350.#09-93Wang Cher Kim / Poh Ting TingNo (LOA not signed by all co-owners)463Foot Note 463×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC764.351.#09-95Wang Cher Kim / Aw Gim ChooNo (LOA not signed by all co-owners)464Foot Note 464×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC769.352.#09-96Lee Keng Cheong / Ong Li LiNo (LOA is hearsay, no affidavit of evidence in chief filed)353.#09-97Aw Kim Seng / Aw Gim Choo / Aw Suan ChooNo (LOA is hearsay, no affidavit of evidence in chief filed)354.#09-98Soon Sin Contracts Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)355.#09-99Weltmacht Asia Pte LtdYes (LOA affixed with company stamp)465Foot Note 465×Plaintiff’ Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC774.356.#09-100Choi Wing Cho / Chong Lai KengYes (although one co-owner did not sign an LOA, authority from that co-owner is evident from his/her affidavit of evidence in chief)466Foot Note 466×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC775–SAEIC779.357.#09-101Choon Kim Property Pte LtdYes (LOA affixed with company stamp)467Foot Note 467×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC784.358.#09-104Peter MoaNo (claim withdrawn)468Foot Note 468×Statement of Claim (Amendment No 2).359.#09-106Gecko Precision Singapore Pte LtdNo (LOA is hearsay, no affidavit of evidence in chief filed)360.#B1-01Ban Hoe Hardware Pte LtdYes (LOA affixed with company stamp)469Foot Note 469×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC5.361.#B1-02Ng Teck Meng & Lim Yew KhengNo (claim withdrawn)470Foot Note 470×Statement of Claim (Amendment No 2).362.#B1-03Teck Leong Metals Pte LtdNo (LOA signed by employee/ director of company-subsidiary proprietor and LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)471Foot Note 471×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC10.363.#B1-04Teck Leong Metals Pte LtdNo (LOA signed by employee/ director of company-subsidiary proprietor and LOA is hearsay as signatory to LOA is different from the person who filed affidavit of evidence in chief)472Foot Note 472×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC10.364.#B1-05Hiap Leng Tuar / Ong Hock Heng / Chiew Hock YouNo (LOA not signed by all co-owners)473Foot Note 473×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC15.365.#B1-06Seow Hock Cheng trading as Aik Chin Hin Machinery CoYes474Foot Note 474×Plaintiff’s Supplementary Bundle of Affidavit of Evidence in Chief at SAEIC16; Agreed Bundle of Documents, vol 5, p 4307.366.#B1-07Seow Hock Cheng trading as Aik Chin Hin Machinery CoYes475Foot Note 475×Agreed Bundle of Documents, vol 5, p 4317.367.#B1-08Seow Hock Cheng trading as Aik Chin Hin Machinery CoYes476Foot Note 476×Agreed Bundle of Documents, vol 5, p 4327.",
        "Annex B": "",
        "Annex C": "Item in Scott ScheduleOrion-One’s liabilitySanchoon’s liabilityRelevant warrantyRoof1. For the main plastered and painted elevations, the condition of both the plaster and paint at the roof level was poor.See [91]–[102]See [91]–[102]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty2. The plasterwork was prone to moisture staining due to poor application, detailing and cracking; dirt staining due to poor and insufficient detailing; debonding due to insufficient bonding and plaster thickness; and poor patching due to poor quality and incomplete workmanship.See [103]–[108]See [103]–[108]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty3. The quality of paintwork application on metal items was poor. Paintwork was flaking off because there was an insufficient bond with the galvanised metal layer below. This indicated that either the incorrect or no primer had been used.See [111]–[112]See [111]–[112]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty4. A similar defect is also noted at the air-handling ductwork.See [111]–[112]See [111]–[112]5. There was also paintwork detachment at the service pipework. There was a lack of a good paintwork bond.See [111]–[112]See [111]–[112]6. The Service rooms and staircase housings’ plasterwork was prone to both shrinkage and dissimilar movement plaster cracking. The resulting rainwater ingress then led to deterioration of the paint finish.See [92]–[96], [101]–[102]See [92]–[96], [101]–[102]- Tile adhesives and bonding agents warranty7. There is also poor detailing around the door opening, which did not include any projection at the door head, so as to direct rainwater away from the door opening. Rainwater ingress and corrosion at the door head then resulted.See [114]–[115]See [158]–[164]8. The door threshold was also vulnerable to rainwater ingress, and it was poorly constructed. In effect there was no significant step between the external and internal floor finishes. A simple kerb had been formed only. Rainwater, running down the door face, was then prone to seep inside.See [116]–[117]See [158]–[164]9. In the case of the parapet walls, the plasterwork was also badly cracked and this subsequently damaged the paint finish. As such, it would be necessary to rectify the defective plasterwork before repainting works were undertaken.See [92]–[104]See [92]–[104]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty10. There is dissimilar movement cracking at the external parapet wall faces, highlighting poor construction techniques. The profile of the cracking followed the lines of the beam and column structure.See [94]–[96]See [94]–[96]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty11. In the case of the parapet walls’ waterproofed upstands, it was apparent that there was cracking to the bases. The plaster ‘skim’ coat was detaching. The skim coat needed to be hacked off (without damaging the rooftop waterproofing), and then replaced, properly bonded to the substrate.See [99]–[100]See [99]–[100]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck12. There were upstand issues in relation to the uPVC vent pipes. At some locations, there was an insufficient waterproofing upstand. the waterproofing should have extended up the pipework at least 150mm above the finished roof level. The pipework was inconsistently supported with concrete plinths.See [118]–[119]See [118]–[119]- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck13. In the case of the lightning conductor strips at the parapet walls, these were poorly installed. Not only were the strips partially painted over, they were poorly located. The strips should have been located at the wall’s outer edge, as opposed to the centre.See [107]–[108] and [120]–[121]See [107]–[108] and [120]–[121]14. The parapet walls were also moisture stained, as a result of plaster cracking. Such cracking then led to further deterioration of the paintwork.See [92]–[96] and [103]–[104]See [92]–[96] and [103]–[104]- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck15. As for the main elevations, the plasterwork was prone to moisture staining due to poor detailing and cracking, dirt staining due to poor and insufficient detailing, debonding due to insufficient bonding and plaster thickness, and poor patching due to poor quality and incomplete workmanship.See [92]–[119]See [92]–[119]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty16. The quality of paintwork application was poor. Paintwork was flaking off, because there was an insufficient bond with the galvanised metal layer `below.See [118]–[119]See [118]–[119]- External precast concrete cladding warranty- Tile adhesives and bonding agents warrantyFire escape staircases (external)17. There is rainwater ingress at the exposed wall face and also internal rainwater ingress.See [114]–[115]See [158]–[164]18. At Staircase No. 6 at the top floor level, there was rainwater ingress at the roof and wall face junction. This indicated a lack of complete waterproofing at the external upstand.See [123]–[124]See [123]–[124]19. External roof repairs were necessary, below the screed level, in order to ensure that there was a complete waterproofing membrane installed both across the roof surface and then up the wall face (by 150mm).See [123]–[124]See [123]–[124]- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck- Elastic membrane to flat roof warranty20. In the case of the external metal fire escape staircase, which comprised galvanised steel, there were significant defects.See [125]–[126]See [125]–[126]- Galvanising to metalworks warranty21. Due to poor handling at the installation stage, the galvanised layer had been damaged and then roughly patched over. Not only was the finishing ugly, the brush-applied coating would be more vulnerable to failure than the original coating.See [125]–[126]See [125]–[126]- Galvanising to metalworks warranty22. There was rainwater run-off and staining, which also affected the poorly detailed door installations.See [114]–[115]See [158]–[164]23. The staircase fixings were shallow, being covered with a thin layer of plaster, which was now detaching. Corrosion was also evident.See [127]–[128]See [158]–[164]24. The thin plaster layer, in addition to detaching, would allow rainwater ingress to occur. Such cracks which would trap moisture.See [127]–[128]See [158]–[164]- Tile adhesives and bonding agents warranty25. There was dissimilar movement cracking, in addition to the detachment of what appeared to be a thin skim coat.See [94]–[96]See [94]–[96]- Tile adhesives and bonding agents warrantyElevations26. The elevations were finished with plaster and paint and they were in a poor state (due to poor construction).See [70]–[78], [92]–[98],and [103]–[115]See [70]–[78], [92]–[98],and [103]–[115]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty27. Typical defects included the following, being:-a. Patchy finishes.b. Rainwater ingress.c. Plaster shrinkage cracking.d. Dissimilar movement cracking.e. Diagonal panel cracking.f. Staining at cracked surfaces.g. Vulnerable plaster grooves.h. Horizontal ledges and rainwater backflow.i. Rainwater ingress and egress at balconies.j. Staining at ledges.k. Corrosion at railings.See [70]–[78], [92]–[98],and [103]–[117]See [70]–[78], [92]–[98],and [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty28. Various problems were noted, including rainwater ingress, plaster cracking and staining.See [92]–[98], [103]–[108], and [113]–[117]See [92]–[98], [103]–[108], and [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty29. The problem of cracking was leading to rainwater ingress. There were two types of plaster cracking present, being random shrinkage cracking and also regular dissimilar movement cracking. Both types of plaster cracks needed to be repaired, prior to any repainting.See [92]–[96]See [92]–[96]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty30. The wall plaster and paint was more fundamentally defective.See [92]–[98], [101]–[110], and [113]–[117]See [92]–[98], [101]–[110], and [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty31. Overall, the plasterwork was in a very poor state, and it was apparent that the structure was absorbing rainwater. In addition, the horizontal grooves were also considered to be vulnerable to rainwater ingress, being thinner than the general plaster thickness and, in effect, creating points of weakness.See [92]–[98], [103]–[110], and [113]–[117]See [92]–[98], [103]–[110], and [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty32. The profile of the elevations included predominately horizontal surfaces where rainwater would be more prone to enter the building.See [105]–[106]See [105]–[106]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty33. The presence of horizontal surfaces was also leading to very obvious staining due to dirt collection and subsequently the collected dirt washing off resulting in staining. This was also noted at the parapets and also at the ledges.See [105]–[106]See [105]–[106]- External precast concrete cladding warranty- Tile adhesives and bonding agents warrantyTiled walkways and balconies34. In the case of the open walkways, obvious defects included corrosion at the railing bases, detaching tiling and rainwater ingress and egress.See [70]–[78], [129]–[131]See [70]–[78], [129]–[131]- Tile adhesives and bonding agents warranty- Galvanising to metalworks warranty35. In the case of the seepage issue, rainwater was entering through the tiled finish, and it was then seeping down and out at the façade’s own plaster cracking.See [129]–[131]See [129]–[131]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty36. A similar issue existed in respect of the balcony and patio areas. Rainwater was seeping in and then out from the structures, in addition to problems of flaking paintwork and, often, rainwater seepage into the units themselves.See [70]–[78]See [70]–[78]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty37. Overall the result was both unsightly and it was also leading to general deterioration of the finishes due to construction failure.See [70]–[78], [129]–[131]See [70]–[78], [129]–[131]- Tile adhesives and bonding agents warranty38. It was also very obvious that many of the balconies’ finished floor levels were too high. This then led to rainwater ingress. The balcony levels should have been lower than the internal levels by approximately 150mm.See [70]–[78]See [70]–[78]39. It was also apparent, as for the parapet walls and external elevations, that the plasterwork was badly cracked, and that the application of a paint coating over the cracking had not solved the defect.See [91]–[97], [102]–[107], [112]–[116]See [91]–[97], [102]–[107], [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty40. The poor external appearance at such locations, and at the elevations in general also included the poor glazing detailing. The flush finish, with no window head or projection, led to vulnerable edge details, a poor seal and staining. Projecting flashings needed to be installed to shed the rainwater away from the cladding.See [114]–[115]See [158]–[164]- External precast concrete cladding warranty- Tile adhesives and bonding agents warranty41. More generally, there was an issue of debonding floor tiling and tiling breakage, due to a lack of proper movement joints and complete bedding respectively.See [129]–[131]See [129]–[131]- Tile adhesives and bonding agents warrantyRailings42. Throughout the site, at the walkways, balconies and car park areas, there was a problem of corroding railings.See [70]–[78]See [70]–[78]- Galvanising to metalworks warranty43. Corrosion was occurring at the welded sections being both the vertical and horizontal railing joints, and also at the railing to railing joints.See [70]–[78]See [70]–[78]- Galvanising to metalworks warranty44. It was likely that such welded joints had not been primed properly, if at all, prior to painting.See [70]–[78]See [70]–[78]45. In addition, the railing bases were often installed too close to the wall edge, and so there was both a problem of stability and also detaching plaster cover. The railings needed to be set-back, in addition to carefully priming and painting and plastering.See [70]–[78]See [70]–[78]Driveway46. The driveway was of a similar constructional quality to the main building.See [132]–[133]See [132]–[133]47. The driveway and aprons were prone to cracking (and possible, localised, settlement), and patch repairs had failed to rectify the defects.See [132]–[133]See [132]–[133]Car park ramp48. Not only was the ramp understood to be slippery when wet, but it was apparent that the adjacent finishes were poor, as with the main elevations. The ramp finish needed grooves to be set to an outward fall, as opposed to multiple indented circles that trapped water.In addition, there was cracking through the ramp slab, also leading to surface water seepage and potential spalling.See [91]–[97], [102]–[107], [112]–[116], [134]–[135]See [91]–[97], [102]–[107], [134]–[135], [158]–[164]49. In addition, the applied paint coat was detaching and the plasterwork was cracking.See [91]–[97], [102]–[107], [112]–[116]See [91]–[97], [102]–[107], [158]–[164]50. The edge railings were poorly installed.See [70]–[78]See [70]–[78]51. The railings were not set out correctly, and so the base fixings were too close to the wall face. As such, the thin plaster cover was prone to crack and detach.See [70]–[78]See [70]–[78]52. The detached plaster then exposed the fixings, which would then corrode, in addition to being loose.See [70]–[78]See [70]–[78]Fire escape staircase (internal)53. The staircases were prone to rainwater damage and staining.See [114]–[115]See [158]–[164]54. The presence of unprotected openings allowed rainwater to enter the staircases, and then to damage and stain the internal finishes.See [114]–[115]See [158]–[164]55. In addition, it was considered the case that the access ways were not clear. It was apparent that the fire hose reel casings projected out into the lobbies. The lobby width was compromised.See [136]–[137]See [136]–[137]56. The problem, which was considered a safety hazard, was noted at the smoke-stop lobbies in general.See [136]–[137]See [136]–[137]Ninth floor57. At the ninth floor, and as noted within many of the units, there was diagonal cracking at many of the infill wall panels.See [70]–[78]See [70]–[78]58. The cracking was relatively straight, but diagonal, and it could extend through the thickness of the wall panel too.See [70]–[78]See [70]–[78]59. Such cracking was noted at various locations and it was not limited to one particular area.See [70]–[78]See [70]–[78]60. At the internal and external walkway interfaces, there was also a problem of uncontrolled rainwater ingress. There was no proper weather protection, which then allowed rainwater to flow down the adjoining wall faces, causing staining and damage.See [114]–[115]See [158]–[164]Eighth floor61. There were common issues noted, being that of broken tiling (due to unsupported tiling) and also debonded tiling.See [129]–[130]See [129]–[130]- Tile adhesives and bonding agents warranty62. The debonding tiling would be caused by insufficient movement joints and also insufficiently cured base screeds or slabs prior to the laying of the tiles.See [129]–[130]See [129]–[130]- Tile adhesives and bonding agents warranty63. Furthermore, the tile joints, being poorly grouted, allowed rainwater ingress and egress and including the presence of resultant deposits.See [129]–[130]See [129]–[130]- Tile adhesives and bonding agents warrantySeventh floor64. The floor slab was irregular and there had been some patching, possibly in an attempt to overcome the issue of ponding.See [138]–[139]See [138]–[13965. However, the patching was rough and the coating was prone to debond, partially because the substrate was smooth and it had not been roughened in order to provide a better key.See [138]–[139]See [138]–[139]66. The ramps were slippery when wet and this was likely due to the finish, which tended to trap rainwater, as opposed to letting it drain to the ramp edges.See [134]–[135], and [138]–[139]See [134]–[135], and [138]–[139]Sixth floor67. Towards the centre of the building, and close to the visitors’ parking area, there was significant ponding present.See [138]–[139]See [138]–[139]68. Notably, the slab falls were irregular, and it was not necessarily the case that surface water flowed to the outlets.See [138]–[139]See [138]–[139]69. Omitted.--Fifth floor70. It was apparent that the floor slab had been patched, and that the patch repairs were failing.See [138]–[139]See [138]–[139]71. In addition, there was ponding present, and the road markings were failing.See [138]–[141]See [138]–[141]Fourth floor72. There is a presence of ponding, including close to the drainage outlets.See [138]–[139]See [138]–[139]73. Notable wall signage had also detached, which had originally been applied with double sided tape. Signage related to fire fighting equipment should have been securely installed.See [142]–[143]See [142]–[143]74. As for the remaining levels, but despite the lower, more sheltered outlook, the ramp finishes were of poor quality and exhibited detaching paintwork over cracked wall plaster.See [91]–[97], [102]–[107], [112]–[116], [134]–[135]See [91]–[97], [102]–[107], [134]–[135], [158]–[164]Third floor75. The finishes were of a poor quality.See [94]–[96], and [99]–[100]See [94]–[96], and [99]–[100]76. The thin plaster skim coat was detaching, and one section had debonded and fallen.See [94]–[96], and [99]–[100]See [94]–[96], and [99]–[100]77. At the point of failure the plaster was noted to be very thin, and the substrate was smooth, providing insufficient key or bond.See [94]–[96], and [99]–[100]See [94]–[96], and [99]–[100]78. At the ramp area, the ramp slab was poorly finished and the adjacent railings were prone to poor setting out, corrosion and plaster detachment.See [91]–[97], [102]–[107], [112]–[116], [134]–[135]See [91]–[97], [102]–[107],[134]–[135], [158]–[164]79. There was dissimilar movement cracking at the structure and infill panel junctions. Such crack profiles indicated a lack of care at the construction stage.See [94]–[96]See [94]–[96]Second floor80. The second floor level also suffered from a significant ponding problem, including at the central driveway area. Rainwater was flowing towards the area and not towards the floor traps.See [134]–[135], and [138]–[139]See [134]–[135], and [138]–[139]First floor81. There are defects related to the finishes.See [107]–[108]See [107]–[108]82. The paintwork was detaching, indicating a lack of bond between the paint layers.See [107]–[108]See [107]–[108]Units83. Defects including leakage, wall cracking, staining, corroding railings, balcony leakage and pipework leakage.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]- Aluminium works and glazing warranty- Galvanising to metalworks warranty84. The defects related to rainwater ingress at the balcony areas, via the external wall plaster and also at the window frame and wall plaster junctions.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]- Aluminium works and glazing warranty- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck85. Other, common, defects related to staining (due to poor detailing and construction) and also corroding railings, due to poor construction.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck86. In the case of the balcony leakage it was very common to find that the balcony had been constructed to a higher level than the internal floor level. This was a fundamental defect. The balcony should have been at a lower level. As such, rainwater tended to seep in at the door thresholds and wall junctions. It was also apparent that there was leakage at the balcony flooring and wall junctions, indicating a lack of proper or any waterproofing upstand.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]- Waterproofing/ watertightness of deck areas, landscaping, planets, pes/ open terrace and other areas at roof deck87. It was also apparent that many of the units suffered from internal wall panel cracking, which was similar to that noted at the common property corridors.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]88. At various units it was apparent that there was pronounced diagonal cracking at the brick or blockwork panels. Furthermore, the cracking was generally occurring through the full wall thickness, through common corridor wall.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]89. Typically such cracking would be due to movement within the infill panels themselves, often related to the use of blockwork.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]90. The cracks needed to be repaired, not superficially, and once it was confirmed that there was no thermal or moisture movement that could lead to further cracking.See [91]–[108], [111]–[112], and [114]–[119]See [91]–[108], [111]–[112], and [158]–[164]"
    }
}