{
    "case_title": "Hyflux Ltd vSM Investments Pte Ltd",
    "ncitation": "[2019] SGHC 236",
    "coram": "Aedit Abdullah J",
    "sections": {
        "Introduction": "1 These grounds deal with two summonses heard together: one by the plaintiff to strike out the defendant’s counterclaim under O 18 r 19 of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (“ROC”); the other, the defendant’s application for determination of a question of law or construction under O 14 r 12 of the ROC.",
        "Background": "2 These applications stem out of an agreement between the parties relating to an investment by the defendant in the plaintiff (“the Restructuring Agreement”). The plaintiff was at the material times, and at the time of this judgment, in the midst of a restructuring effort. The plaintiff was covered by a moratorium under s 211B of the Companies Act (Cap 50, 2006 Rev Ed) (“CA”), which has been extended by this Court several times since 2018. The moratorium was imposed to allow the plaintiff to eventually propose a scheme of arrangement to its creditors. 3 In the course of 2018, the plaintiff and defendant entered into negotiations, which led to the conclusion of the Restructuring Agreement. Under the Restructuring Agreement, the defendant would invest in the plaintiff by,interalia¸subscribing for shares in the plaintiff. Various conditions precedent were specified in the Restructuring Agreement. One of these, cl 5.1(e)(i), stipulated that the consent of the Public Utilities Board (“PUB”) for the change in control of Tuaspring Pte Ltd (“Tuaspring”), a subsidiary of the plaintiff which ran a desalination plant, was to be obtained.1Foot Note 1×Arief Sidarto’s affidavit dated 1 July 2019 at p50. 4 On 25 March 2019, the PUB informed Tuaspring by letter that it consented to the change in control of Tuaspring, but subject to the following provisos:2Foot Note 2×Arief Sidarot’s affidavit dated 1 July 2019 at pp 79–80. (a)  the PUB had, by 26 April 2019, exercised its right to terminate the water purchase agreement (“WPA”) with Tuaspring and elected to purchase the desalination plant and other infrastructure; and (b) ownership of the desalination plant and other infrastructure had vested in the PUB in accordance with the WPA. 5 Whether this consent by the PUB fulfilled the requirements of cl 5.1(e)(i) of the Restructuring Agreement was contested by the parties. The defendant asserted through correspondence that it had the right to terminate the Restructuring Agreement, because of what it claimed was non-fulfilment of the condition precedents, as well as developments relating to other desalination plants.3Foot Note 3×Arief Sidarto’s affidavit dated 1 July 2019 at pp 185–191. 6 The plaintiff claims that the defendant committed a repudiatory breach of the Restructuring Agreement, which the defendant denies. The plaintiff seeks,inter alia, the release to it of the deposit of S$38,900,000 which was placed in escrow pursuant to cl 3.1(a) of the Restructuring Agreement (“the escrow sum”).4Foot Note 4×Arief Sidarto’s affidavit dated 1 July 2019 at p 47.The defendant in its counterclaim seeks the release to it of the escrow sum.",
        "Summons No 2747 of 2019: application to strike out": "7 The first application is by the plaintiff, seeking to strike out the defendant’s counterclaim under O 18 r 19 of the ROC as it would be in breach of the moratorium covering the plaintiff. The plaintiff’s primary argument is that the defendant failed to obtain leave of court to commence or continue its counterclaim against the plaintiff in breach of the moratorium.5Foot Note 5×Plaintiff’s submissions for Summons No 2747/2019 at para 5.The plaintiff relies on all four grounds under O 18 r 19(1),ie, that the counterclaim discloses no reasonable cause of action; is scandalous, frivolous or vexatious; that it may prejudice, embarrass or delay the fair trial of the action; or would amount to an abuse of process.6Foot Note 6×See Summons No 2747/2019 dated 30 May 2019. 8 The defendant contends that it is able to proceed without leave of court as its counterclaim does not fall within the moratorium covering the plaintiff.7Foot Note 7×Defendant’s reply submissions for Summons No 2747/2019 at para 5.The requirements under O 18 r 19 of the ROC for striking out its counterclaim would thus not be met.8Foot Note 8×Defendant’s reply submissions for Summons No 2747/2019 at para 4.In any event, the defendant applied for leave to pursue its counterclaim at the oral hearing on 20 August 2019.",
        "The decision": "9 The defendant is entitled to assert its counterclaim without leave in so far as it relates to its entitlement to the escrow sum. It cannot, however, pursue the claim for damages and other reliefs without leave, as these go beyond a purely defensive stance. In any event, leave should be granted for the counterclaim and the other reliefs to be pursued by the defendants, save that no execution or enforcement of reliefs obtained may be made without leave of court.",
        "Analysis": "10 The plaintiff’s application would fall away if the counterclaim does not require leave, or if leave is actually granted, as there would be no violation of the moratorium in that situation.  The decision thus turned on the application of the law in respect of counterclaims while a moratorium or stay is in force, and on the discretion of the court to grant leave.",
        "The Law": "11 Under s 211B of the CA, an automatic moratorium is triggered when an application is made.  Prior to the expiry of the automatic moratorium period, the applicant may apply for an extension, the granting of which is at the discretion of the court and grounded in the provisions of s 211B of the CA: Power of Court to restrain proceedings, etc., against company 211B.—(1) When a company proposes, or intends to propose, a compromise or an arrangement between the company and its creditors or any class of those creditors, the Court may, on the application of the company, make one or more of the following orders, each of which is in force for such period as the Court thinks fit: … (c) an order restraining the commencement or continuation of any proceedings (other than proceedings under this section or section 210, 211D, 211G, 211H or 212) against the company, except with the leave of the Court andsubject to such terms as the Court imposes; … (5) An order of the Court under subsection (1) — (a) may be madesubject to such terms as the Court imposes… … [emphasis added] It is clear from the statutory provisions that the court’s discretion is wide enough to allow for the imposition of various conditions, and carve outs may be allowed for certain claims by creditors. 12 The courts have allowed claims by creditors to proceed in some situations despite the existence of a moratorium. In some instances, the claims are allowed to proceed in so far as court proceedings are permitted to be commenced or continued, with stays being imposed on any execution. The primary consideration is to strike a balance between allowing the restructuring company space and time to pursue its reorganisation without the added distraction of fending off claims by creditors, and on the other hand, avoiding unnecessary delays in the satisfaction of creditor claims. The plaintiff’s arguments 13 The plaintiff argues that the moratorium framework under s 211B of the CA is absolute and requires that leave be obtained even for counterclaims. The plaintiff relies on the absence of any express qualifications in favour of such counterclaims in either the statute or rules. Section 211B(12) of the CA specifies that a moratorium does not affect “the exercise of any legal right under any arrangement (including a set-off arrangement or a netting arrangement) that may be prescribed by regulations.”  Regulation 3 of the Companies (Prescribed Arrangements) Regulations 2017 (S 246/2017) only specifies that legal rights under security interest arrangements are not affected.9Foot Note 9×Plaintiff’s submissions for Summons No 2747/2019 at paras 13–15. 14 The moratorium in the present case is wide in import, covering all proceedings. The objective of the moratorium regime, to treat all creditors evenly, should require leave for the counterclaim to be obtained.10Foot Note 10×Plaintiff’s submissions for Summons No 2747/2019 at paras 16–26.No Singapore authority supports the defendant’s assertions that the counterclaim falls outside the moratorium because it arises from the same dealings which are the basis of the claim made against it.11Foot Note 11×Plaintiff’s submissions for Summons No 2747/2019 at para 27.The limited exceptions recognised in English cases such asMortgage Debenture Ltd (in administration) v Chapman and others[2016] 1 WLR 3048 apply only to counterclaims in so far as they are defensive and are pleaded solely to raise a defence by way of set off. What the defendant seeks to do, it is said, goes beyond this.12Foot Note 12×Plaintiff’s submissions for Summons No 2747/2019 at paras 28–30.In any event, even if an exception were to be found, it should be narrowly construed, and should not extend to allowing damages and payment out of the funds from escrow. To allow these would permit the defendant to get ahead of the other creditors.13Foot Note 13×Plaintiff’s submissions for Summons No 2747/2019 at paras 32–53. The defendant’s arguments 15 The defendant argues that the counterclaim could proceed without leave of court. The moratorium order does not give the plaintiff immunity to pursue claims on a contract without facing counterclaims for breach on that same contract.14Foot Note 14×Defendant’s submissions for Summons No 2747/2019 at para 19. 16 The defendant relies on the Malaysian case ofCGU InsuranceBhd v Asean Security Paper Mills Sdn Bhd and other appeals[2002] 2 MLJ 1 (“CGU Insurance”)and the English case ofThomas Evan Cook v Mortgage Debenture Limited[2016] EWCA Civ 103 (“Thomas Evan Cook”)for the proposition that proceedings commenced to escape liability do not fall within the ambit of a statutory moratorium.15Foot Note 15×Defendant’s submissions for Summons No 2747/2019 at paras 22–23.Here, the defendant’s counterclaim was commenced to escape liability and is defensive in nature, as seen from its mirroring of the plaintiff’s claims.16Foot Note 16×Defendant’s submissions for Summons No 2747/2019 at paras 33–37.No limits are imposed in respect of a cross-claim for liquidated or unliquidated damages. Costs will be saved if the defendant were to be allowed to pursue its full counterclaim. This also avoids multiplicity of proceedings.17Foot Note 17×Defendant’s submissions for Summons No 2747/2019 at paras 39–40.The defendant’s counterclaim is in fact stronger than a set-off as it is an entire defence to the plaintiff’s claim, and if successful would entirely negate the plaintiff’s claim: the two sides cannot both have a claim to the escrow sum.18Foot Note 18×Defendant’s reply submissions for Summons No 2747/2019 at paras 16The defendant also submits that a statutory moratorium does not bar a claim by a claimant to his own property, citingIn re David Lloyd & Co6 Ch. D. 339.19Foot Note 19×Defendant’s reply submissions for Summons No 2747/2019 at paras 17–20. The counterclaim as a defence 17 The rationale for allowing certain counterclaims to proceed even in the face of moratoria is clear. It would be inimical to allow a claim to proceed but not a counterclaim in respect of the same factual grounds: the defendant would be deprived of either a defence or a reduction of the claim based on the very same facts. Disregarding the counterclaim would tilt the balance too far in favour of the applicant company. This, I believe, is the basis of the various cases cited. 18 InLangley Constructions (Brixham) Ltd v Wells[1969] 1 WLR 503, the plaintiff company (which was in liquidation) brought proceedings against one of its directors for a sum of £5,000. The defendant attempted to bring a counterclaim against the plaintiff for £15,086 allegedly owing to him. Section 231 of the Companies Act 1948 (c 38) (UK), the applicable legislation at the time, provided: Actions stayed on winding-up order When a winding-up order has been made or a provisional liquidator has been appointed, no action or proceeding shall be proceeded with or commenced against the company except by leave of the court and subject to such terms as the court may impose. The English Court of Appeal held that the defendant was entitled to proceed with its counterclaim without leave to the extent of the plaintiff’s claim (ie, for the sum of £5,000) (at 512). Leave would be required for the balance of the defendant’s counterclaim (at 513). 19 InCGU Insurance, the respondent company, which was undergoing liquidation, commenced proceedings against its insurers. The statutory provision in question was s 226(3) of the Companies Act (No 125 of 1965) (M’sia), which states: Actions stayed on winding up order (3) when a winding up order has been made … no action or proceedings shall be proceeded with or commenced against the company except— (a) by leave of the Court; and (b) in accordance with such terms as the Court imposes. The issue before the court was whether the insurers required leave to: (a) appeal a decision in favour of the company; and (b) bring an application for security for costs. The Federal Court of Malaysia held that they were not proceedings “commenced against the company” as they were defensive in nature. 20 InThomas Evan Cook, the English Court of Appeal considered the scope of the statutory moratorium under paragraph 43(6) of schedule B1 to the Insolvency Act 1986 (c 45) (UK), which reads: Moratorium on other legal process (1)  This paragraph applies to a company in administration … (6) No legal process (including legal proceedings, execution, distress and diligence) may be instituted or continued against the company or property of the company except— (a) with the consent of the administrator, or (b) with the consent of the court. CitingHumber & Co v John Griffiths Cycle Co(1901) 85 LT 141, the English Court of Appeal held at [16]–[18] that the statutory moratorium did not apply to defensive steps: 16 The essential feature of legal proceedings falling within the moratorium is that they must be “against the company”. A claimant who wishes to commence proceedings against a company which has gone into administration … must obtain the consent of the administrator or the permission of the court. No such consent or permission is required in the case of proceedings brought by a company which is in administration or which goes into administration after the commencement of proceedings. 17 It follows, as a matter of basic fairness, that defendants to proceedings where the claimant is a company in administration should be able to defend themselves without restriction. This causes no difficulty in taking steps such as serving a defence or witness statements or participating in a trial. However, an issue could be said to arise where defence takes the form of an active step against the claimant company. It is established that essentially defensive steps are not within the statutory moratorium. 18 In Humber & Co v John Griffiths Cycle Co (1901) 85 LT 141, the respondent company brought proceedings against the appellants for damages for breach of an alleged contract but the claim was dismissed at first instance. The respondent company appealed to the Court of Appeal after it had been ordered to be wound up. The appeal was allowed and the defendants appealed to the House of Lords. A preliminary objection was taken on behalf of the respondent company that an appeal was a proceeding against the company within section 87 of the Companies Act 1862, which provided that when a winding-up order had been made “no suit, action, or other proceeding shall be proceeded with or commenced against the company except with the leave of the court”. The House of Lords rejected the submission, Lord Davey saying: ‘I am of opinion that the objection cannot be maintained. It was the respondents who themselves proceeded with the action after the winding-up order, by prosecuting their appeal in the Court of Appeal, and when once an action by the company itself has been proceeded with, there is no necessity for the defendants in the action to obtain leave for any defensive proceedings on their part … … 21 What can be gleaned from these cases is that where a statutory moratorium is imposed in respect of the commencement of proceedings against a company, it would ordinarily not cover situations where the company itself commences proceedings and the defendant seeks, through a counterclaim, to reduce or extinguish any liability owed to the plaintiff. 22 While there does not appear to be any mention of an exception for counterclaims in any of the Parliamentary debates relating to the enactment of s 211B of the CA, I do not find that the intention was manifested to require leave to be obtained for counterclaims. Clearer language would have been expected to be used had that been the intention. The position at common law in relation to the interpretation of similar statutes would have been well understood: see [18]–[20] above. In the absence of express language to the contrary, the expectation is that Parliament intended to leave existing case law unaffected. 23 It follows that a counterclaim made in respect of a claim brought by a company undergoing s 211B restructuring would not require leave of court, but only in so far as it operates to extinguish or negate the claim, without affecting the position of the other creditors. Thus, any part of a counterclaim that goes beyond operating as a defence, such as a claim for damages or property, would require the leave of court. Leave to proceed 24 In any event, oral application for leave was made at the hearing. The plaintiff, correctly it must be said, does not take issue with the granting of leave, subject to conditions. 25 I am of the view that leave should be granted. 26 The principles governing the granting of leave are clear.In re Atlantic Computer Systems Plc[1992] 2 WLR 367has been the primary case cited in applications thus far. That case concerned the granting of leave in relation to the enforcement of security, but its considerations are applicable generally. In particular, it was noted that the granting of leave requires a balancing exercise between the secured creditor in that case, and those of the other creditors (at 395A–C). Here, the balancing exercise would need to consider the interests of the defendant as against those of the plaintiff’s other creditors. 27 In the present case, a number of factors would have to be weighed, including: (a) the impact on the other creditors; (b) the possible distraction from restructuring; and (c) the prejudice or effect of either refusing or allowing the application on the parties. 28 Bearing these in mind, I find it appropriate to grant leave in the present case. Safeguards may be put in place to minimise the impact on the other creditors. Leave can be restricted to allowing the counterclaim and associated claims to be pursued only to determination of liability (if any), with enforcement or execution of any award or order being stayed. 29 As for the possible distraction of the company from focussing its resources on the restructuring, that would be a valid objection but for the fact that here part of the defendant’s counterclaim can proceed even without leave of court (see [23] above). Any additional burden, it seems, is unlikely to be that substantial. 30 Finally, allowing the counterclaim to proceed would not appear to have any significant adverse impact on the plaintiff, while disallowing it would expose the defendant to a claim that it could otherwise possibly extinguish or attenuate. 31 For the reasons above, leave is restricted to the same extent as the portion of the counterclaim which does not require leave. Other matters such as the defendant’s claim for damages may proceed to trial, but not execution. This will ensure that the defendant does not gain an advantage over the plaintiff’s other creditors through its counterclaim.",
        "Summons No 3287 of 2019:  Determination under O 14 r 12": "32 The other summons before me was one for determination of a question of law or construction under O 14 r 12 of the ROC, relating to the fulfilment of a condition precedent specified in the restructuring agreement between the parties. The controversy between the parties is whether a letter issued by the PUB satisfied clause 5.1(e)(i) of the Restructuring Agreement. The defendant says that it did not. The plaintiff’s position is that it did, but that in any event the case should proceed to trial as it would not be determinative of the matter.20Foot Note 20×Plaintiff’s submissions for Summons 3287/2019 at paras 11–18.",
        "The Decision": "33 I am not satisfied that this issue is suitable for determination under O 14 r 12 of the ROC. There are significant disputes of fact as to the interpretation of cl 5.1(e)(i) of the Restructuring Agreement that cannot be resolved without the benefit of a full trial. However, the plaintiff’s pleadings are deficient and ought to be amended. It also does not appear to be the case that a determination of the issue would fully resolve the dispute between the parties.",
        "Principles": "34 Order 14 r 12(1) of the ROC reads as follows: Determination of questions of law or construction of documents (O. 14, r. 12) 12.—(1) The Court may, upon the application of a party … determine any question of law or construction of any document arising in any cause or matter where it appears to the Court that — (a)such question is suitable for determination without a full trial of the action; and (b) such determination will fully determine (subject only to any possible appeal) the entire cause or matter or any claim or issue therein. There are thus two conjunctive requirements: first, the question of law or construction must be suitable for determination without a full trial; and second, such determination mustfullydetermine the entire cause or matter or any issue or claim. This is illustrated in the following passage fromBarangBarang Pte Ltd v Boey Ng San[2002] 1 SLR(R) 949 at [5]: … The construction of law or document must be such that it can be achieved without a full trial and such a determination will fully determine the entire cause or matter. ... [emphasis in original omitted] This passage was cited approvingly by the Court of Appeal inOlivine CapitalPte Ltd and another v Chia Chin Yan and another matter[2014] 2 SLR 1371 at [50] (“Olivine Capital”). 35 In the present case, the clause in question is only one of several grounds invoked by the plaintiff as the bases for its claim in repudiatory breach.21Foot Note 21×Plaintiff’s submissions for Summons 3287/2019 at para 14.That fact does not, however, disqualify the application. It is not necessary that the determination dispose of the entire matter as the language of O 14 r 12 of the ROC permits its use even if the issue in play is only part of the overall claim:  seePaynaChettiar v Maimoon bte Ismail and others[1997] 1 SLR(R) 738at [34]–[36]. 36 It follows that if the construction of cl 5.1(e)(i) of the Restructuring Agreement and the letter from PUB are suitable for determination without trial, and such determination would fully determine the entire cause or matter or any claim or issue, the court should proceed with summary determination under O 14 r 12 of the ROC. This would be in keeping with the overriding consideration of O 14 r 12 of the ROC, which is the saving of time and costs for the parties:United Overseas Bank Ltd v Lippo Marina Collection Pte Ltd and others[2016] 2 SLR 597 at [13].",
        "The question posed": "37 The question posed by the defendant as one of law or construction, asks the court to determine whether a letter dated 25 March 2019 from the PUB satisfied cl 5.1(e)(i) of the Restructuring Agreement between the plaintiff and the defendant.",
        "Saving of time and cost": "38 As to whether there will be any saving of time and costs for its determination, the defendant argues that it will, as a determination that the PUB letter did not satisfy cl 5.1(e)(i) would mean that the defendant, and not the plaintiff is entitled to the escrow sum. The entirety of the plaintiff’s claim would fail. 39 The plaintiff argues that there will not be any saving of time and costs. The question posed, it is said, only relates to one out of five instances of repudiatory conduct as particularised by the plaintiff in its statement of claim.22Foot Note 22×See statement of claim at paras 47–53.Even if the PUB letter did not satisfy cl 5.1(e)(i) of the Restructuring Agreement, the defendant would not have been entitled to terminate the agreement prior to the long-stop date of 16 April 2019. The five instances of alleged repudiatory conduct on the part of the defendant, having occurred prior to 16 April 2019, meant that the defendant repudiated the Restructuring Agreement prior to 16 April 2019. The plaintiff was thus entitled to the escrow sum.23Foot Note 23×Plaintiff’s submissions for Summons 3287/2019 at paras 12–16; statement of claim at paras 47–53. 40 Clause 3.2 of the Restructuring Agreement governs the entitlement of the parties to the escrow sum: 3.2 The [escrow sum] shall be released … in the following manner: … (b) to the [plaintiff], the whole [escrow sum] (less the amount of the Pre-Completion Working Capital Rescue Financing disbursed to the [plaintiff] in accordance with Clause 3.2(a)): (i) on Completion in accordance with Clause 4; or (ii) upon termination of [the Restructuring Agreement] due to a default or breach of the terms of [the Restructuring Agreement] by the [defendant]; or (c) to the [defendant], the whole [escrow sum] (less the amount of the Pre-Completion Working Capital Rescue Financing disbursed to the [plaintiff] in accordance with Clause 3.2(a)): … (ii) in the event any of the Conditions are not satisfied (or waived) by or on the Long-Stop Date, or it being determined in the reasonable opinion of the [plaintiff and defendant] that it is likely that any of the Conditions cannot be satisfied by or on the Long-Stop Date; … 41 The determination of the question in favour of the defendant would not put to rest all of the plaintiff’s claims. The plaintiff would still be entitled to the escrow sum if the Restructuring Agreement was validly terminated prior to 16 April 2019 following a breach of its terms by the defendant. So, a determination in favour of the defendant would not be conclusive of its entitlement to the escrow sum. Nonetheless, this would appear to be a substantial point, and there would be to my mind sufficient savings if this were resolved early. However, the question that remains is whether it is suitable for determination without trial.",
        "Suitability for determination without trial": "42 Clause 5.1(e)(i) of the Restructuring Agreement, which the defendant seeks a determination of, reads: 5.1 Completion is conditional upon: … (e) the necessary approvals, consents and waivers being obtained from: (i) the Public Utilities Board (“PUB”), for the issuance of New Shares which will result in a change of control under Clause 21 of the Water Purchase Agreement dated 21 November 2013 entered into between PUB and Tuaspring (as may have been amended, restated and supplemented from time to time); … 43 The defendant argues that the letter received from the PUB did not amount to consent under cl 5.1(e)(i) of the Restructuring Agreement. The defendant was thus entitled to terminate Restructuring Agreement.24Foot Note 24×Defendant’s submissions for Summons 3287/2019 at paras 51–59.This interpretation is consistent with the commercial purpose of the Restructuring Agreement.25Foot Note 25×Defendant’s submissions for Summons 3287/2019 at para 44–58.The interpretation advocated for by the plaintiff is absurd as the PUB’s consent was conditional on the latter exercising its right to acquire the desalination plant and infrastructure owned by Tuaspring; this would defeat the defendant’s objective of acquiring control over the same assets.26Foot Note 26×Defendant’s submissions for Summons 3287/2019 at para 15, 48–58/There are no factual disputes that would affect the construction of cl 5.1(e)(i) of the Restructuring Agreement, which can be determined based on affidavits.27Foot Note 27×Defendant’s submissions for Summons 3287/2019 at para 25, 34Clause 17.2 of the Restructuring Agreement stipulates that the agreement constitutes the entire agreement and understanding between the parties.28Foot Note 28×Defendant’s submissions for Summons 3287/2019 at para 29.The plaintiff has not pleaded or deposed in its affidavits with sufficient specificity any of the relevant extrinsic facts it intends to rely on to support its construction of the Restructuring Agreement as required by case law; this disentitles the plaintiff from raising the alleged context in the O 14 r 12 application.29Foot Note 29×Defendant’s submissions for Summons 3287/2019 at para 31–33.In any event, the evidence of pre-contractual negotiations is unlikely to relate to a clear and obvious context as required inZurich Insurance (Singapore)Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”).30Foot Note 30×Defendant’s submissions for Summons 3287/2019 at para 41. 44 The plaintiff submits that the PUB letter satisfied the requirements of cl 5.1(e)(i) of the Restructuring Agreement based on the natural and ordinary meaning of the words used.31Foot Note 31×Plaintiff’s submissions for Summons 3287/2019 at paras 32–33.In the alternative, the question was not suitable for determination under O 14 r 12 of the ROC. Both parties have put forward plausible interpretations of cl 5.1(e)(i) of the Restructuring Agreement. A full trial will allow the court to come to a proper determination of cl 5.1(e)(i) of the Restructuring Agreement as key witnesses can be cross-examined and all relevant evidence, including that of pre-contractual negotiations, adduced.32Foot Note 32×Plaintiff’s submissions for Summons 3287/2019 at paras 27–51.",
        "Evidence of the negotiations": "The law 45 The law on contractual interpretation and construction in Singapore was laid down in a number of cases, includingZurich Insurance;SembcorpMarine Ltd v PPL Holdings Pte Ltd and another and another appeal[2013] 4 SLR 193 (“Sembcorp”);Y.E.S F&B Group Pte Ltd v Soup Restaurant Pte Ltd (formerly known as Soup Restaurant (Causeway Point) Pte Ltd[2015] 5 SLR 1187 (“Y.E.S F&B”);andXiaZhengyan v Geng Changqing[2015] 3 SLR 732 (“XiaZhengyan”). 46 The use of pre-contractual negotiations was considered inXiaZhengyan, where the Court of Appeal noted: 62     …  [T]he issue of whether evidence of prior negotiations should be included under Singapore law remainsopen. This court’s earlierrejectionof ablanketprohibition on all evidence of pre-contractual negotiations (seeZurichInsurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd[2008] 3 SLR(R) 1029 (“Zurich Insurance”) at [132(d)]) is also a significant departure from the English position set out in the leading House of Lords decisions ofInvestors Compensation Scheme Ltd v West Bromwich Building Society[1998] 1 WLR 896 (“ICS”) andChartbrookLtd and another v Persimmon Homes Ltd[2009] 1 AC 1101 (“Chartbrook”). 63     In any event, it should be noted that this court inZurich Insurancelaid down three requirements to govern the admissibility of such extrinsic evidence (assuming that there was no overriding objection in principle to admitting such evidence in the first place). First, the evidence had to be relevant. Secondly, the evidence had to be reasonably available to all the contracting parties. Thirdly, the evidence had to relate to a clear and obvious context. … 69     … [A]s already noted above (at [62]), whether or not there should – in the Singapore context – be a principle that evidence of prior negotiations ought to be generally admissible is a legal issue that is still an open question and that caution should therefore be exercised in this particular regard (and see the quotation fromSembcorp Marineset out above, also at [62]). The precise legal status (in particular, the limits (if any) and/or safeguards) of a situation involving evidence of prior negotiations remains to be worked out in a future case (when full argument has been heard), although there ought, in our view, to be no difficulty in satisfying the three requirements set out inZurich Insurancewhere the situation concerned (such as that inInglis) is extremely clearand, in any event, in a case such as the present, the evidence of prior negotiations merely serves as aconfirmatory(and, hence, complementary as well as subsidiary) function. Much would, of course, depend very much on the precise facts before the court. What can be taken from the Court of Appeal’s guidance is that the door has not been entirely closed against the use of evidence of pre-contractual negotiations in determining the context of words used in the Restructuring Agreement. The use of such evidence would be subject to the fulfilment of theZurich Insurancecriteria of relevance, availability to all contracting parties, and relation to a clear and obvious context. 47 The current position of the law was usefully surveyed by Professor Goh Yihan in Chapter 6 ofThe Interpretation of Contracts in Singapore(Sweet & Maxwell, 2018).  In brief, he posits a greater hesitation about the relevance of pre-contractual negotiations in more recent cases as compared toZurichInsurance.  I am not certain that there is a difference in the degree of caution expressed by the courts. But in any event, the position remains undecided. One may perhaps think that a bright line rule against the admissibility of pre-contractual negotiations is entirely justified when the contract in question has been vetted and fussed over by squads, if not battalions, of lawyers; there may indeed be some merit in the English and traditional position against the relevance of pre-contractual negotiations. But that is not what I understand to be the law in Singapore. The defendant’s arguments on the negotiations 48 The defendant contends that the Court of Appeal inXiaZhengyancautioned against the use of draft agreements, as these would not without more give a clear and obvious context (XiaZhengyanat [65]).33Foot Note 33×Defendant’s submissions for Summons 3287/2019 at para 40.The defendant also relies onZurich Insurance,in which it was emphasised that the focus should be on ascertaining the objective intention of parties (Zurich Insuranceat [127]). Trawling through evidence of the pre-contractual negotiations should be avoided as the plaintiff is attempting to use them to favour its own subjective interpretation of the Restructuring Agreement.34Foot Note 34×Defendant’s submissions for Summons 3287/2019 at para 41. 49 The defendant invokes the commercial purpose of the agreement, and contends that the plaintiff’s advocated construction is absurd. An interpretation that is absurd is to be avoided: seeY.E.S F&Bat [45],Rainy SkySA v Kookmin Bank[2011] 1 WLR 2900 at [21]. Clause 5.1(e)(i) of the Restructuring Agreement was aimed at avoiding a default under the WPA and a loss of the desalination plant and other infrastructure; the consent provided by PUB, being conditional on the termination of the WPA and the purchase by PUB of the desalination plant and other infrastructure, could not therefore satisfy clause 5.1(e)(i) without leading to an absurd result.35Foot Note 35×Defendant’s submissions for Summons 3287/2019 at paras 48–54.A consent that is subject to significant or onerous conditions would not satisfy the requirements of the Restructuring Agreement: seeTay ThengKhoon and another v Lee Kim Tah (Pte) Ltd[1992] 1 SLR(R) 509 at [16];Ideal City DevelopmentSdn Bhd v Dynamic Mould Sdn Bhd[2003] 3 MLJ 152.36Foot Note 36×Defendant’s submissions for Summons 3287/2019 at paras 56–58. The plaintiff’s arguments on the negotiations 50 The plaintiff argues that evidence was required in the interpretation and construction of cl 5.1(e)(i) of the Restructuring Agreement. There was no common intention between the parties that the defendant’s commercial interests were to be protected.37Foot Note 37×Plaintiff’s submissions for Summons 3287/2019 at para 46.The Restructuring Agreement specifically allocates all post-completion commercial risks, including risks associated with the condition precedent in cl 5.1(e)(i), to the defendant.38Foot Note 38×Plaintiff’s submissions for Summons 3287/2019 at para 48.This is evidenced by the pre-contractual negotiations and various drafts of the Restructuring Agreement that were circulated.39Foot Note 39×Plaintiff’s submissions for Summons 3287/2019 at para 49Any common intention is also further contradicted by the representations and warranties made by the plaintiff in respect of Tuaspring pursuant to para 1.2 of schedule 3 to the Restructuring Agreement. 51 As regards the defendant’s advocated construction of the Restructuring Agreement (see [49] above), the assertions made by its Chief Executive Officer Mr Arief Sidarto were disputed by the plaintiff and ought to be tested in cross-examination at trial.40Foot Note 40×Plaintiff’s submissions for Summons 3287/2019 at paras 41–45. The Determination of the Court 52 Here, I am satisfied that the evidence of pre-contractual negotiations could be material, and might play a role in the determination of the interpretation and construction of cl 5.1(e)(i) of the Restructuring Agreement. The evidence would also seem to be available to all parties, and would possibly point to a clear and obvious context: theZurich Insurancecriteria could be fulfilled here. At any rate, it is important to note that the evidence of pre-contractual negotiations may not ultimately be determinative or conclusive. What matters at this point, when the court is considering the invocation of O 14 r 12 of the ROC, is whether there are factual disputes that could determine the outcome of the suits. The pre-contractual negotiations may shed light on the proper interpretation of cl 5.1(e)(i) of the Restructuring Agreement, and therefore, should be left for trial rather than be determined one way or another right now. 53 The appropriate standard at this stage is guided by the requirement under O 14 r 12 (1) (a) of the ROC, that ‘such question is suitable for determination without a full trial of the action’. The door has been left open for evidence of pre-contractual negotiations to influence the interpretation and construction of cl 5.1(e)(i) of the Restructuring Agreement. That is enough to show that disposal of the question under O 14 r 12 of the ROC is not suitable. 54 While there may be some tentativeness about the consideration of pre-contractual negotiations, the entire agreement clause does not itself bar such evidence: cl 17.2 of the Restructuring Agreement prescribes the terms of the contract, but does not control how those terms are to be interpreted, which is the exercise for which the pre-contractual negotiations might be relevant. 55 As for the question of absurdity, what amounts to absurdity would have to be taken against the objective intention of the parties together: there would be no absurdity if it was indeed agreed that the risk of the loss of the desalination plant and infrastructure was to be left with the defendant alone. It is thus necessary to examine what the actual agreement was, which in these circumstances calls for a trial. (1) Specificity of pleadings 56 The defendants correctly submitted that the pleadings should be specific. InSembcorp, the Court of Appeal noted: 73     We hasten to add that although the contextual approach is most frequently engaged in the context ofinterpretation, this is not to say that the contextual approach is irrelevant when it comes to other aspects of construction such as implication or rectification. Indeed, it is trite that the court must have regard to the context at the time of contracting when considering the issue of implication. Therefore, to buttress the evidentiary qualifications to the contextual approach to the construction of a contract, the imposition of four requirements of civil procedure are, in our view, timely and essential: (a)     first, parties who contend that the factual matrix is relevant to the construction of the contract must plead with specificity each fact of the factual matrix that they wish to rely on in support of their construction of the contract; (b)     second, the factual circumstances in which the facts in (a) were known to both or all the relevant parties must also be pleaded with sufficient particularity; (c)     third, parties should in their pleadings specify the effect which such facts will have on their contended construction; and (d)     fourth, the obligation of parties to disclose evidence would be limited by the extent to which the evidence are relevant to the facts pleaded in (a) and (b). 57 Here, what was in the pleadings seemed to fall shy of the above requirements. The plaintiff only pleaded repudiatory conduct by the defendants, and did not go into the negotiations between the parties, as well as the interpretation or construction that should be made of cl 5.1(e)(i).  It could perhaps be read in that the plaintiff had a different interpretation of the requirements, but that is not enough to fulfil theSembcorprequirements. 58 Be that as it may, I do note that the requirement of specificity regarding pleadings laid down inSembcorprelates to matters after trial, and not at the interlocutory stage. As matters have not progressed that far, an opportunity for the plaintiff to amend its pleadings will be given. This will enable the real issue in controversy between the parties to be determined: seeOlivine Capitalat [44]–[46]. The plaintiff should specify the particulars of the pre-contractual negotiations which it intends to rely on, failing which the defendant will be at liberty to apply for determination of this question on the basis that no further evidence will be adduced. Any cost consequences from the amendment of the pleadings can be addressed separately. (2) The plain and ordinary meaning 59 All that could be determined at this stage, without trial, was the plain and ordinary meaning of cl 5.1(e)(i) of the Restructuring Agreement. Other materials would be required to determine its actual meaning in the Restructuring Agreement. There is little saving of time and costs in just considering what the plain and ordinary meaning might be, since the contract could possibly not turn on that at all, if it is shown that the meaning between the parties was something else.",
        "Costs": "60 Directions for costs arguments will be given separately, with time for appeal extended in the meantime till after the costs determination has been made.",
        "Conclusion": "61 For the above reasons, the counterclaim may be raised. Such a counterclaim does not need leave of the Court, in so far as it does not operate as more than a defence. Since the defendants have sought leave, and wish to pursue remedies going beyond a pure defence, leave is granted for them to assert and pursue the counterclaim, save that no execution of any judgment, including the release of funds or payment, is to occur without leave so long as the moratorium is in place. 62 As for the determination under O 14 r 12 of the ROC, I find that that it would not be appropriate to answer the question posed at this time, as there are factual issues to be determined which require a full trial. However, the plaintiff has not yet sufficiently pleaded its case specifically on the factual assertions and must amend its pleadings accordingly (see [56]–[58] above).  Directions will be given for amendments to be made to sufficiently address the concerns raised in this judgment, failing which the defendants may revive its application under O 14 r 12 of the ROC. No order is made on the O 14 r 12 application at this time. Aedit AbdullahJudge Leo Zhen Wei Lionel, Liu Zhao Xiang, Tan Kai Yun and Muhammad Ismail K.O. Noordin (Wongpartnership LLP) for the plaintiff;Chelva Retnam Rajah SC, Baratham Sayana, Sudhershen Hariram, Yap En Li and Yong Manling Jasmine (Tan Rajah & Cheah) for the defendant."
    }
}