{
    "case_title": "Sun Electric Pte Ltdv Sunseap Group Pte Ltd and others",
    "ncitation": "[2019] SGHCR 4",
    "coram": "Justin Yeo AR",
    "sections": {
        "Background": "",
        "The Parties": "2 Sun Electric Pte Ltd (“the Plaintiff”) is the registered proprietor of Singapore Patent Application No 10201406883U (“the Patent”), titled “Power Grid System and Method of Consolidating Power Injection and Consumption in a Power Grid System”. 3 Sunseap Group Pte Ltd (“the 1st Defendant”) is the parent company of Sunseap Energy Pte Ltd (“the 2nd Defendant”) and Sunseap Leasing Pte Ltd (“the 3rd Defendant”). They are collectively referred to as “the Defendants”. 4 The 2nd Defendant operates as an electricity retailer in the National Electricity Market of Singapore, while the 3rd Defendant designs, develops, manages and constructs rooftop solar photovoltaic systems to generate electricity (“PV Generation Facilities”). Phuan Ling Fong (“Phuan”) and Wu Jueh Ming Lawrence (“Wu”) are directors and substantial shareholders of the 1st Defendant. They are also directors of the 2nd and 3rd Defendants.",
        "The Plaintiff’s pleadings": "5 The particulars sought in the Application relate to the Particulars of Infringement (Amendment No 1) (“the POI”), the Reply and Defence to Counterclaim (Amendment No 1) (“the RDCC”) and the Plaintiff’s Further and Better Particulars filed on 2 October 2018 (“the Plaintiff’s Filed FNBP”). The requests touch on a substantial range of issues. It is therefore useful to first set out, in some detail, aspects of the Plaintiff’s pleadings that provide context to the various decision points below. This summary is, of course, neither exhaustive of the Plaintiff’s claims nor intended to be a binding or comprehensive understanding of the claims. Plaintiff’s POI – alleged infringement of system claims, process claims and common design 6 The Plaintiff alleges that the Defendants have jointly or severally infringed certain system claims in the Patent, pleading the following particulars in the POI: (a) The 2nd and 3rd Defendants are, respectively, the “electricity retail arm” and the “solar generation arm” of the 1st Defendant. The 2nd and 3rd Defendants cooperate to implement off-site power purchase agreements (“PPAs”). Specifically, the 3rd Defendant constructs PV Generation Facilities and generates electricity while the 2nd Defendant retails electricity that is “associable” to the PV Generation Facilities via the national electricity grid. (b) In early 2015, Apple Inc (“Apple”) entered into a PPA with one or more of the Defendants for the supply of electricity (ieelectricity “associable” to PV Generation Facilities) to various facilities, including the Apple Store at Knightsbridge Mall, Apple’s corporate office at One-North, and Apple’s office in Ang Mo Kio (“the Apple Facilities”). In this regard: (i) Each of the Apple Facilities has an electrical meter which meters the amount of electricity imported from the national electricity grid to the Apple Facilities (“the First Meter”). The Apple Facilities are “considered” to be supplied with electricity “associable” to the electricity generated by the PV Generation Facilities located at the rooftops of Housing and Development Board (“HDB”) buildings in areas “including, but not limited to, Jurong, Tampines, Sembawang and Marine Parade”, the rooftops of Jurong Port’s buildings, as well as the rooftop of Apple’s office in Ang Mo Kio. (ii) One or more of the PV Generation Facilities exports electricity to the national electricity grid. Each of the PV Generation Facilities has an electrical meter which meters the amount of electrical energy generated (“the Second Meter”). (c) One or more of the Defendants relies on a “consolidation unit”, which is configured for “associating” the electricity readings from the Second Meter with those from the First Meter. This “association” offsets at least a portion of the amount of electricity generated by the PV Generation Facilities against the amount of electricity consumed by the Apple Facilities. (d) The “consolidation unit” is also configured to “perform the association over a given period of time”. The Defendants utilise the APX Singapore Registry for Tradable Instruments for Global Renewables (“TIGRs”), which is a platform that validates the generation of electricity from renewable sources (“the APX Platform”). The detailed operations are as follows: (i) The 1st Defendant is a holder and administrator of an “Asset Holder/Representative” account on the APX Platform. (ii) The 3rd Defendant submits “Generation Data” (iedata on the energy generated by the PV Generation Facilities to the national electricity grid) to the Solar Energy Research Institute of Singapore (“SERIS”). SERIS processes the Generation Data and certifies that the electricity is generated from a renewable source, and issues a corresponding amount of TIGRs to the 1st Defendant’s account on the APX Platform. (iii) Based on the amount of electricity consumed by the Apple Facilities for a given period of time (iemonthly, quarterly, biannually or annually), a corresponding amount of TIGRs is then transferred to Apple’s account on the APX Platform. This effectively offsets the Apple Facilities’ electricity consumption against the amount of electricity generated by the PV Generation Facilities for the given time period. (e) Other than Apple, one or more of the Defendants or their “Affiliates” (ie“affiliated or associated entities that have a common shareholding and/or directors” which “include, but are not limited to” Sunseap Leasing Beta Pte Ltd and Sunseap Commercial Assets Pte Ltd) have entered into similar and separate PPAs with “Additional Customers” (ie“other entities including, but not limited to Microsoft, Sakae Holdings, Ricoh Asia Pacific, Unilever, logistics firm Ninja Van and other SME companies”) for the supply of electricity to the Additional Customers’ respective facilities (“the Additional Customers’ Facilities”). In this regard, [6(b)]–[6(d)] above apply with some modifications. For instance, references to “Apple Facilities” are replaced by “Additional Customers’ Facilities”, and the pool of PV Generation Facilities is expanded to “include[e], but not [be] limited to” the PV Generation Facilities mentioned in [6(b)(i)] above. 7 The Plaintiff further claims that the Defendants have infringed certain process claims in the Patent by virtue of the matters in [6] above, and also in view that one or more of the Defendants perform certain steps “either alone or in combination with each other, and/or with other third parties, including but not limited to their Affiliates (at the behest of one or more of the Defendants)”. The alleged steps are as follows: (a) The 2nd Defendant or its Affiliate(s) receives information on the amount of electricity consumed and imported by the Apple Facilities and the Additional Customers’ Facilities (collectively, “the Facilities”) from the First Meter readings. (b) The 3rd Defendant or its Affiliate(s) receives information on the amount of electricity generated by the PV Generation Facilities from the Second Meter readings, and submits the Generation Data to SERIS for validation on the APX Platform. (c) Upon validation, TIGRs are issued to the 1st Defendant. The 1st Defendant or its Affiliate(s) then assists in the transfer of TIGRs to Apple and the Additional Customers (collectively, “the Customers”). (d) The association and offsetting of the consumption of energy by the Facilities against the Second Meter readings, by one or more of the Defendants, occurs over a given period of time by way of the TIGRs issued in respect of at least a portion of the energy generated by the PV Generation Facilities. The TIGRs are then used to offset against the energy consumed by the Facilities over the given period of time. 8 The Plaintiff also pleads that the Defendants have “committed acts pursuant to a common design to infringe the Patent”. In this regard, the Plaintiff “relies on and repeats the matters set out at paragraphs 2 to 6 above of the POI” (iethe matters summarised at [6]–[7] above). Plaintiff’s defence to the Defendants’ counterclaim on invalidity 9 The Defendants also seek further and better particulars in relation to the following averments in the RDCC: 6.  … [T]he Plaintiff avers that the Defendants’ acts as set out in the POI constitute infringements of [the asserted system claims and the asserted process claims]. In particular, the Plaintiff avers the following: (a) … The 1st Defendant therefore has full control and oversight of the 2nd and 3rd Defendants through its directors Phuan and/or Wu. The 2nd and 3rd Defendants are registered “Market Participants” of the NEMS and conduct business with the benefits accruing to the 1st Defendant therefore enabling the Defendants to act in concert as a single economic enterprise in the generation and/or retail of electricity; (b)  … The Plaintiff avers that under PPA arrangements, the 2nd Defendant retails electricity to consumers associable to the amount of electricity generated from the PV Generation Facilities constructed and managed by the 3rd Defendant; … (d) … [T]he Plaintiff avers that the 2nd Defendant retails electricity to Apple that is associable to the amount of electricity generated by the 3rd Defendant from PV Generation Facilities. … … (g) The Plaintiff avers that the 1st Defendant is the account holder and its employees administer the APX Platform account. ... … … Plaintiff’s Filed FNBP 10 Finally, the relevant extracts of the Plaintiff’s Filed FNBP (which provide further and better particulars of the POI) are as follows: 8. … Answer The 1st Defendant assists the 2nd and/or 3rd Defendant in the transfer of TIGRs to Apple’s Account. … 11. … Answer See answer at paragraph 8. … 16. … Answer a. The “product obtained directly” by means of the process claims 15, 17, 19, 20, 25, 26, 27 and 28 is an electricity product that supplies electricity to at least one load connected on the power grid. … (emphasis in original)",
        "The Application": "11 The Application comprises two substantive prayers. The first is the main prayer seeking further and better particulars. There were 51 separate requests, eight of which the Defendants opted not to pursue at the hearing. The remaining 43 may be classified into the following five categories: (a) The first category comprises 11 requests relating to the terms “consolidation unit” and “associate” (and its variants) (“the Category 1 Requests”).(b) The second category comprises three requests relating to the “electricity product” used by the Defendants (“the Category 2 Requests”).(c) The third category comprises 13 requests relating to the roles of the individual Defendants in the infringement of the Patent (“the Category 3 Requests”).(d) The fourth category comprises 14 requests relating to the “Affiliates”, “Additional Customers”, “Additional Customers’ Facilities” and “PV Generation Facilities” (“the Category 4 Requests”).(e) The fifth category comprises two requests relating to acts pursuant to a common design to infringe the Patent (“the Category 5 Requests”). 12 These requests are summarised in the following sections of this judgment. The actual requests are not reproduced in the interests of brevity, but references to the actual request numbers are included for completeness of the record. 13 The second substantive prayer presents a further or alternative prayer in relation to some of the Category 4 Requests,ie, for the striking out of parts of the POI such as “include … but… not limited to” (and its variants) pursuant to O 18 r 19(1)(a), (b) or (c) of the Rules of Court, on the basis that they disclose no reasonable cause of action, are scandalous frivolous or vexatious, or may prejudice, embarrass or delay the fair trial of the action. The alternative prayer essentially seeks to limit the Plaintiff’s case to the Affiliates, Additional Customers, Additional Customers’ Facilities and PV Generation Facilities that have hitherto been identified in the Plaintiff’s pleadings.",
        "Category 1 Requests – “Consolidation Unit”, “Associate”": "14 The Category 1 Requests seek further and better particulars in relation to the terms “consolidation unit” and “associate” (and its variants), as follows: (a) What each Defendant allegedly relies on that constitutes a “consolidation unit” (Requests 2(b) and 13(a)).(b) How the Facilities are “considered” to be supplied with electricity “associable” to the electricity generated by the PV Generation Facilities (Requests 1(a), 7(b), 15(c) and 16(a)).(c) How each Defendant “relies” on the “consolidation unit” (Requests 2(c), 2(d) and 2(e)).(d) What “association” the “consolidation unit” performs (Request 3(a)).(e) How, for each Defendant, the “association” has been configured to perform over a given period of time (Request 3(b)).",
        "Parties’ Arguments": "48 Defendants’ counsel submitted that there were no Singapore decisions dealing with the level of particularisation required for pleading a claim of common design, and relied instead on three cases from other Commonwealth jurisdictions,ie,Anheuser-Bush Incorporated v Budejovicky Budvar, Narodni Podnik[2000] HKCU 1109 (“Anheuser-Bush”),SNE Engineering Co Ltd v Hsin Chong Construction Co Ltd & anor[2015] 6 HKC 583 (“SNE Engineering”) andAmmon v Consolidated Minerals Ltd and anor[2005] WASC 156 (“Ammon”): see [54] below. Defendants’ counsel submitted that despite the cross-reference to paragraphs 2 to 6 of the POI: (a) the Plaintiff had failed to plead the “act in furtherance of the alleged common design”;(b) it is unclear what the allegedly tortious acts are; and(c) it is unclear which parties are involved in the alleged common design. 49 Plaintiff’s counsel contended that the Defendants have failed to explain how the current pleadings are inadequate such that further particulars are necessary. Plaintiff’s counsel further submitted that, in any event, the Plaintiff had already set out in paragraphs 2 to 6 of the POI the acts committed by the Defendants “pursuant to a common intention to execute their business model of off-site PPAs” (a phrase taken from Plaintiff’s counsel’s written submissions, but which is not in the pleadings).",
        "Decision": "50 The law on joint tortfeasorship can be divided into two broad categories,ie, (a) first, where one party conspires with the primary party or induces the commission of the tort; and (b) second, where two or more persons join in a common design pursuant to which the tort is committed (seeTrek Technology (Singapore) Pte Ltd v FE Global Electronics Pte Ltd and ors and or suits (No 2)[2005] 3 SLR(R) 389 (“Trek”) at [35]). 51 In relation to joint tortfeasorship by common design, the High Court inTrekadopted the approach inMorton-Norwich Products Inc and Others v Intercen Limited[1978] RPC 501 at 512, explaining a claim for common design as one in which “two persons agree on common action in the course of and to further which one of them commits a tort”, or, in other words, where there is a tort committed by one person “on behalf of and in concert with the other” (Trekat [37]). In order for common design to be found, it is not necessary for the persons involved to have mapped out a plan; tacit agreement will also suffice (Trekat [38], citingUnilever Plc v Gillette (UK) Limited[1989] RPC 583 (“Unilever”) at 609). 52 More recently, the UK Supreme Court had occasion to consider the law in relation to common design inFish & Fish Ltd v Sea Shepherd UK and others[2015] 2 WLR 694 (“Fish & Fish”). The Law Lords were divided on the outcome of the appeal, but essentially agreed (albeit with slightly different phraseology) on the elements of liability for joint tortfeasorship by common design (see, also, the observations of Hacon J in the postscript toVertical Leisure Limited v Poleplus Limited, Peter Bowley[2015] EWHC 841). It suffices for present purposes to adapt from the formulations put forward by Lord Sumption and Lord Neuberger inFish & Fishat 705 and 710. In essence, in order for a defendant to be liable to a plaintiff as a joint tortfeasor by common design, three elements must be satisfied: (a) First, the defendant must have assisted in the primary tortfeasor’s commission of an act.(b) Second, the assistance must have been pursuant to a common design on the part of the defendant and the primary tortfeasor that the act be committed.(c) Third, the act must constitute a tort as against the plaintiff. 53 In relation to the level of particularisation required for pleading common design, I have considered the three Commonwealth cases cited to me by Defendant’s counsel as well as three further cases which provide some insight on the issue. Thesecases do not purport to set out principles or guidance on pleading a common design claim, and most of them (save forAnheuser-BushandCranway) do not involve any judicial examination of the level of particularisation required. 54 I start first with the three cases cited by Defendants’ counsel: (a) InAnheuser-Bush, defendant’s counsel contended that the plaintiff had failed to “plead the act in furtherance of the alleged common design”. The Hong Kong Court of First Instance agreed that the plaintiff ought to establish “not just a common design but the commission of a tortious act by one of the parties in furtherance of that common design” (Anheuser-Bushat [45]). (b) InSNE Engineering, the Hong Kong Court of Appeal citedAnheuser-Bushfor the proposition that “[i]t is clear that common design must be pleaded” (SNE Engineeringat [162]). The court found that the court below had rightly disallowed the plaintiff from arguing on common design at trial because the plaintiff had “not pleaded the common design or the ‘tacit agreement’ and [had] not provided any particulars or evidence relied upon in support of the alleged common design” (SNE Engineeringat [163]). (c) InAmmon, the Supreme Court of Western Australia found it unsatisfactory for the pleadings on common design to merely repeat allegations of the primary infringement (Ammonat [55]). While Defendant’s counsel attempted to draw a parallel betweenAmmonand the Plaintiff’s cross-reference to paragraphs 2 to 6 of the POI, it must be kept in mind that the circumstances of the two cases are different. InAmmon, the court had already found that the particulars of primary infringement were insufficient; the court’s finding of insufficient particularisation of the secondary infringement by cross-referencing the particulars of primary infringement must therefore be understood in this context. In my view,Ammondoes not stand for the proposition that it isalwaysinsufficient for pleadings on common design to cross-refer to the particulars of primary infringement. 55 I turn next to the three further cases I have considered. All three cases dealt with similar questions of whether an entity outside the jurisdiction can be joined to a patent infringement action, on account of an alleged common design with other defendants in the action. As with cases involving applications for service out of jurisdiction or for setting aside such service, these cases involved an assessment of the evidence at hand, rather than simply the question of whether the common design claim was properly pleaded. Be that as it may, the first two cases provide some insight as to the level of detail that has previously been included in other common design claims (although there is no express judicial analysis of these pleadings), while the third case –Cranway(a case that Defendant’s counsel had cited in relation to the Category 1 Requests) -– touched briefly on a pleading point. (a) InBradley Lomas Electrolok Ltd and another v Colt Ventilation East Asia Pte Ltd and others[1999] 3 SLR(R) 1156 (“Bradley”), the plaintiffs (iethe appellants in the appeal) commenced an action against a Singapore company for patent infringement, and added two foreign companies as defendants on the basis that they had a common design with the Singapore company to carry out certain infringing acts. The High Court held that the first foreign company was properly made a defendant, but set aside the writ against the second foreign company. The particulars of infringement in relation to common design were pleaded as follows: 3  The first defendants have, without the consent of the first or second plaintiffs, infringed the patent by the disposing, offering to dispose of, importing and keeping of fire screens or curtains (hereinafter ‘the Colt Product’) made in accordance with the fire screens of curtains described in the said specification and claimed in Claims 1, 2, 4, 6, 7, 9, 14, 16 and 17 (hereinafter ‘the patented product’). 4 The second and third defendants are liable together with the first defendants as joint tortfeasors with the first defendants, for the said acts of disposing, offering to dispose of, importing and keeping referred to in para 3 above, in that the second and third defendants have/had the common intention and common design with the first [defendants] to carry out the said acts. Particulars 4.1  at all material times, the second and third defendants have/had control and/or influence over the first defendants in the conduct of the first defendants’ business. 4.1.1  the first defendants were wholly owned by the second and third defendants, with the second defendants holding 1, and the third defendants holding 299,999 of the 300,000 shares of the first defendants; 4.1.2  the first defendants shared directors and representatives with the second and third defendants, namely, Paul Jerome O’Hea, David Earp and Keith Rickinson. 4.2  at all material times, the second and third defendants participated in, the marketing, supply and installation of the Colt Product in Singapore which infringed the patent. The plaintiffs will refer, inter alia, to the following documents as evidence of the second and third defendants’ participation: (11 listed documents). On appeal, the Court of Appeal held that there was no evidence that the second foreign company had participated in the tort (iepatent infringement) by way of common design. In particular, the fact that there was common management amongst the companies (amongst other linkages between the defendants) was not indicative of the second foreign company’s participation or involvement in the tort. As such, the Court of Appeal agreed with the High Court that there was no basis for allowing service out of jurisdiction on the second foreign company. (b) InThe Mead Corporation and Another v Riverwood Multiple Packaging Division of Riverwood International Corporation[1997] FSR 484, the plaintiffs had brought a claim against a foreign defendant company. The defendant applied to strike out the claim on the basis that it had committed no tort within the UK. The plaintiff applied to join two English companies (which were the defendant’s subsidiaries), and to amend the statement of claim to allege joint tortfeasance against all three companies. The question before the UK High Court was whether the plaintiffs had an arguable case that the acts of primary infringement were committed in furtherance of a common design between the two subsidiaries, or between either of them and the defendant. The common design claim was pleaded as follows: The Defendants and each of them have infringed the said patent in the manner appearing in the Amended Particulars of Infringement served herewith. If and in so far as it is established that the First Defendant has not itself carried out the acts particularised in the Particulars of Infringements the Plaintiffs will say that the First Defendant was a joint tortfeasor with the Second and/or Third Defendant in that such acts were committed in furtherance of a common and concerted design between the First and the Second and/or Third Defendants.  Particulars The Second and Third Defendants are part of a group of companies ultimately owned by the First Defendant. That group of companies is operated as a single international business which is controlled from the United States by the First Defendant. It is the design and intention of the First Defendant that the cartons and carton blanks referred to in the Particulars of Infringements should be sold in the United Kingdom by its group of companies. The identity of the company within the group that carries on the business in question is determined by the First Defendant by reference to financial considerations. (emphasis in original) As withBradley, the court did not expressly comment on the sufficiency of the pleading, and instead focused on whether the evidence relied upon was sufficient for an arguable case to be made out. After considering the evidence, the court found that the defendant had merely “looked on with general approval at what its subsidiaries… were doing in their local market”, which “goes no way towards indicating that [the defendant] played any part in the specific acts of primary infringement”. As such, the court concluded that the defendant should not have been made a party to the proceedings. (c) InCranway, the plaintiff pleaded that the defendant had procured tortious acts to be carried out by other companies, and that the acts in question were part of a common design. Against this backdrop, the plaintiff sought and obtained an order to serve the defendant outside the jurisdiction in relation to alleged patent infringement. The defendant applied to set aside service, on the basis that there was no evidence as to a serious issue to be tried,inter aliabecause the particulars of claim were general and lacking in particulars. The court observed as follows (Cranwayat [21]): The allegation of infringement against [the defendant] also alleged that [the defendant] is responsible not only for things that it did itself but also for things done by other companies. This vicarious responsibility is put in two different ways. Firstly, that [the defendant] procured tortious acts to be carried out by others and, second, that the acts in question were part of a common design. No particulars of this allegation are given; no act is identified which [the defendant] is alleged to have procured and the common design was not identified. Nor is there alleged any fact from which it is said the common design can be inferred. The court set aside the order permitting service outside the jurisdiction, and ordered that the claim against the defendant be set out. 56 Having considered the elements of liability for joint tortfeasorship by common design (see [52]) and the cases in [54] and [55], I find that a common design claim ought to be particularised with details that identify: (a) First, the primary and secondary tortfeasors in question.(b) Second, the relevant act of the primary tortfeasor.(c) Third, the common design in question. This should include the facts on which reliance is to be placed in support of the existence of a common design, and how those give rise to the inference that the defendants were parties to a common design.(d) Fourth, the assistance allegedly rendered by the defendant, pursuant to the identified common design, towards the primary tortfeasor’s commission of an act. 57 I would add that because common design is related to conspiracy inasmuch as they are the two broad categories of joint tortfeasorship (seeTrekat [35]), in preparing pleadings on common design, it may be useful to also consider pleading precedents on conspiracy (see,eg,Bullen & Leake & Jacob’s Singapore Precedents of Pleadings(Jeffrey Pinsler SC gen ed) (Sweet & Maxwell, 2016) at paragraph 16.20et seqandBullen & Leake & Jacob’s Precedents of Pleadings, Volume 2 (Justice William Blairet algen eds) (Sweet & Maxwell, 18th Ed, 2016) at paragraph 59-03et seq). 58 In the present case, the Plaintiff’s pleading on common design is a bare pleading that cross-references all the allegations of primary infringement set out in the POI. The paragraphs of the POI encompass a large range of acts and refer to a variety of entities (ieDefendants, Affiliates and Customers). Even if the details of the alleged secondary infringement by common design can technically be unearthed from the mass of detail, the Defendants are left with the unenviable task of attempting to do so, without any assurance that they have correctly understood the Plaintiff’s common design claim. This is an unsatisfactory state of affairs, as it is the Plaintiff’s obligation to properly particularise its claim on common design. 59 The Category 5 Requests seek particularisation of the details I have found to be necessary for a common design claim. I therefore grant these requests.",
        "Category 2 Requests – “Electricity Product”": "27 The Category 2 Requests relate to the “electricity product” used by the Defendants, as follows: (a) What exactly the alleged “electricity product that supplies electricity” is (Request 22(a)).(b) How the alleged “electricity product” is obtained directly by means of the asserted process claims (Request 22(b)).(c) How the Defendants have used such an alleged “electricity product” (Request 22(c)). 28 The Plaintiff had previously provided the following particulars in relation to “electricity product”: a.  The “electricity product that supplies electricity” is the product that one or more of the Defendants has used and continues to use to supply electricity to at least one load connected on the power grid, such as Apple and the Additional Customers. b.  The “electricity product” is obtained directly by performing the steps of the process claims 15, 17, 19, 20, 25, 26, 27 and 28. c. One or more of the Defendants have used the “electricity product” by supplying electricity to at least one load connected on the power grid, such as Apple and the Additional Customers. (emphasis in original) 29 The Category 2 Requests appear to seek information that has already been specifically provided by the Plaintiff as cited in the preceding paragraph. Furthermore, the Plaintiff has adduced additional evidence in the Application containing a screenshot of the Defendants’ website promoting a variety of electricity solutions and products. This provides further indication of the electricity products in question. 30 At the hearing, Defendants’ counsel contended that in view that the Plaintiff had already perused the Defendants’ website, the Plaintiff would be fully in a position to inform the Defendants of the specific infringing “electrical product”. This contention does not provide any basis for the ordering of further particulars. 31 Overall, there is no evidence that the provided particulars are insufficient to enable the Defendants to know the case to be met. I therefore reject the Category 2 Requests.",
        "Category 3 Requests – Roles of individual Defendants": "32 The Category 3 Requests relate to the roles of the individual Defendants in the infringement of the Patent: (a) Which Defendant(s) are being referred to as relying on the alleged “consolidation unit” (Request 2(a)).(b) Which Defendant(s) are being referred to as having allegedly entered into similar and separate PPAs with other entities (Request 6(a)).(c) Which Defendant(s) are being referred to as allegedly performing the steps mentioned at [7] above (Request 8(a)).(d) Which Defendant(s) allegedly carry out the association and offsetting of the consumption of energy by the Facilities (Requests 11(a) and 11(b)).(e) Which Defendant has used such an alleged “electricity product” and when and where did such use take place (Request 22(d)).(f) How the 1st Defendant (or its Affiliates) allegedly “assists” in the transfer of the TIGRs to the Customers (Requests 10(d), 20(a) and 21(a)).(g) How the 1st Defendant’s employees allegedly “administer” the APX Platform account (Request 18(a)).(h) The facts and circumstances supporting the allegation that the 1st Defendant has full control and oversight of the 2nd and 3rd Defendants through Phuan and Wu (Request 14(a)).(i) What “benefits” allegedly accrue to the 1st Defendant (see [9] above) (Request 14(b)).(j) All the facts and circumstances supporting the allegation that the Defendants “act in concert as a single economic enterprise” in the generation or retail of electricity (see [9] above) (Request 14(c)).",
        "Category 4 Requests – “Affiliates”, “Additional Customers”, “Additional Customers’ Facilities” and “PV Generation Facilities”": "40 The Category 4 Requests raise the issue of the extent of particularisation required for the terms “Affiliates”, “Additional Customers”, “Additional Customers’ Facilities” and “PV Generation Facilities” (see [6(e)] above). The Defendant sought further particulars of: (a) Affiliates and Additional Customers besides the currently identified entities (Requests 6(b) and 6(c)).(b) Details of the PPAs with the Additional Customers, including the dates of agreement and the parties thereto (Requests 6(f), 6(g) and 15(a)).(c) Locations of the Additional Customers Facilities to which the Defendants supply electricity associable to generated electricity from PV Generation Facilities (Request 6(d)).(d) Locations of the PV Generation Facilities which supply associable electricity to the Additional Customers Facilities (Requests 6(e), 7(a) and 15(b)).(e) Which Affiliate is allegedly receiving information on readings taken from the First and Second Meters, and which of the Additional Customer Facilities the Affiliate receives information from (Requests 8(b), 8(c) and 9(a)).(f) Which Affiliate allegedly consolidates and submits the Generation Data to SERIS, or assists in the transfer of TIGRs to the Customers (Requests 10(a) and 10(c)).",
        "Category 5 Requests – Common Design": "47 The Category 5 Requests relate to the Defendants’ alleged commission of acts pursuant to a common design to infringe the Patent, as follows: (a) Which specific particulars in paragraphs 2 to 6 of the POI the Plaintiff claims depicts acts that were committed “pursuant to a common design” (Request 12(a)).(b) For each act allegedly committed pursuant to a “common design”, state which Defendants or parties shared the alleged “common design” (Request 12(b)).",
        "Conclusion": "60 In view of the foregoing, my orders are as follows: (a) In relation to the Category 1 Requests, the requests at [14(a)] are granted while the requests at [14(b)]–[14(e)] are rejected. (b) The Category 2 Requests are rejected. (c) In relation to the Category 3 Requests, the requests at [32(a)], [32(b)], [32(d)], [32(e)], [32(i)] and [32(j)] are granted, while the requests at [32(c)] and [32(f)]–[32(h)] are rejected. (d) In relation to the Category 4 Requests, the requests at [40(e)] and [40(f)] are granted, limited to the Affiliates, Additional Customers and Additional Customers’ Facilities that have already been identified in the pleadings. The requests at [40(a)]–[40(d)] are rejected. (e) The Category 5 Requests are granted. (f) The alternative prayer for striking out is dismissed. 61 I will hear parties on costs. Justin YeoAssistant Registrar Mr Jevon Louis and Mr Chan Wenqiang(Ravindran Associates LLP) for the Plaintiff;Mr Nicholas Lauw and Ms Leow Jiamin(Rajah & Tann Singapore LLP) for the Defendants."
    }
}