{
    "case_title": "The “Mount Apo” and the “Hanjin Ras Laffan”",
    "ncitation": "[2019] SGHC 57",
    "coram": "Pang Khang Chau JC",
    "sections": {
        "Introduction": "1 On 8 August 2015, at 9:59 am, the capesize bulk carrier,Mount Apo(“Mt Apo”) collided with a liquefied natural gas (“LNG”) carrier,Hanjin Ras Laffan.1Foot Note 1×Captain Rajesh Sardarsingh Chauhan’s (“Capt Rajesh”) affidavit evidence-in-chief (“AEIC”) dated 20 February 2018, at paras 6 and 35; Captain Gap Dong Kim’s (“Capt Kim”) AEIC, dated 22 January 2018, at paras 3 and 23.The collision occurred within the westbound lane of the Traffic Separation Scheme (“TSS”) in the Singapore Strait.Hanjin Ras Laffanwas transiting the Singapore Strait from east to west.Mt Apohad just left the port of Singapore and was attempting to cross the westbound lane of the TSS in order to reach the eastbound lane to continue its journey eastwards. 2 This case raises issues concerning the obligations of a vessel crossing traffic lanes in a TSS under Rule 10 of the International Regulations for Preventing Collisions at Sea (as amended) (1972) incorporated as a Schedule to the Merchant Shipping (Prevention of Collisions at Sea) Regulations (Cap 179, Section 208, Rg 10, 1990 Rev Ed) (the “COLREGS”). It also raises issues concerning crossing situations under Rules 15 and 17 of the COLREGS. In particular, it raises the interaction between a vessel’s duty under Rule 10(c) to cross a TSS at right angles to the general direction of the traffic flow and that same vessel’s duty under Rule 17 to keep her course and speed as a stand-on vessel in a crossing situation arising under Rule 15. Finally, it raises issues concerning the proper use of very high frequency (“VHF”) radio communications between passing vessels. 3 Admiraltyin remNo 246 of 2015 (“ADM 246”) is an action brought by the owner ofMt Apo, Cisslow Shipping Inc. (“Cisslow”) against the owner and/or demise charterer of theHanjin Ras Laffanin respect of the said collision. Admiraltyin remNo 195 of 2015 (“ADM 195”) is an action brought by the owner of theHanjin Ras Laffan, KSH International S.A. (“KSH”) and the demise charterer, H-Line Shipping Co. Ltd. (“H-Line”) against the owner and/or demise charterer ofMt Apoin respect of the same collision. 4 By an order of court dated 2 June 2016, ADM 246 and ADM 195 were consolidated as one action, with ADM 246 designated the lead action and with the plaintiffs in ADM 195 treated as counterclaiming defendants in the consolidated action. For convenience, this judgment will refer to the plaintiff in the consolidated action simply as “Mt Apo” (without italics) and the counterclaiming defendants collectively as “Hanjin Ras Laffan” (also without italics). 5 As both sides have prayed in their respective Preliminary Acts for a reference to the Registrar to assess the amount of damages, losses and/or expenses, the trial before me was on apportionment of liability only. 6 Hanjin Ras Laffan alleged thatMt Apobore the preponderance of the blame for the collision and that liability ought to be apportioned 70% to 30% inHanjin Ras Laffan’sfavour.2Foot Note 2×Defendant’s Closing Submissions (“DCS”), dated 25 September 2018, at paras 6, 84 and 85.Conversely, Mt Apo alleged thatHanjin Ras Laffanwas “predominantly the vessel at fault for the collision”, and submitted that liability should be apportioned 80% to 20% inMt Apo’sfavour.3Foot Note 3×Plaintiff’s Closing Submissions (“PCS”), dated 25 September 2018, at paras 130 and 163. Preliminary Issue on H-Line’s Title to Sue 7 Mt Apo raised a preliminary issue on H-Line’s title to sue. It is common ground that, for H-Line to have title to sue, it has to show that it was the demise charterer of theHanjin Ras Laffanat the time of collision. Mt Apo’s position is that, as H-Line has not proven that it was the demise charterer ofHanjin Ras Laffan,4Foot Note 4×PCS, at para 161.Mt Apo is only liable for the losses of KSH (if any, and subject to apportionment).5Foot Note 5×Plaintiff’s Opening Statement, dated 30 April 2018, at para 31. 8 In the recent case ofNTUC Foodfare Co-operative Ltd v SIA Engineering Co Ltd and anor[2018] 2 SLR 588, the Court of Appeal decided that the law of negligence in Singapore does not require a claimant to own or have possessory title to the property to sue for loss flowing from damage to that property (at [35]). It is therefore open to question whether H-Line had correctly conceded that it needed to show that it was the demise charterer in order to have title to sue. Nevertheless, since parties had conducted the case on this basis, I shall assume (without deciding the point) that H-Line needed to do so.",
        "H-Line’s case on its title to sue": "9 To prove that it was the demise charterer ofHanjin RasLaffan, H-Line relied primarily on the testimony of its deputy manager, Ms Yoo Jin Joo. (Although she had been erroneously referred to as “Ms Yoo” in submissions and some court documents, her surname is actually “Joo”.6Foot Note 6×Notes of Evidence (“NE”), 9 May 2018, at 32:4.) Ms Joo’s role at H-Line concerns the management of vessels. Her responsibilities in respect ofHanjin Ras Laffaninclude regulatory filings with Korean government agencies,7Foot Note 7×NE, 9 May 2018 at 59:29–32..liaising with the Panama ship registry,8Foot Note 8×NE, 9 May 2018 at 56:9–13..and liaising with insurers.9Foot Note 9×NE, 9 May 2018 at 31:27.. 10 Ms Joo testified generally, from her personal knowledge gained in the course of her duties, that H-Line and KSH are respectively the bareboat charterer and owner ofHanjin Ras Laffan.10Foot Note 10×Ms Yoo Jin Joo’s (“Ms Joo”) 1st AEIC, dated 28 February 2018, at paras 6–7; Ms Joo’s 2nd AEIC, dated 20 April 2018, at para 17.Her evidence is thatHanjin Ras Laffanwas previously on demise charter to Hanjin Shipping Co Ltd (“Hanjin Shipping”) and the demise charterparty was novated to H-Line on 30 June 2014.11Foot Note 11×Ms Joo’s 1st AEIC, at paras 3–4. 11 To corroborate her testimony, Ms Joo exhibited copies of the following documents to her affidavits of evidence in chief (“AEICs”): (a) a Bareboat Charter Hire Purchase Agreement dated 27 October 1997 between KSH and Hanjin Shipping in respect ofHanjin Ras Laffan(the “BBCHP”);12Foot Note 12×Ms Joo’s 1st AEIC, at exh-YJY8. (b) an Amending and Restating Agreement dated 7 September 2010 between KSH and Hanjin Shipping to amend and restate the BBCHP in accordance with the requirements of a loan agreement dated 27 August 2010 between KSH and its lenders (the “2010 Agreement”);13Foot Note 13×Ms Joo’s 1st AEIC, at exh-YJY9. (c) an Amending and Restating Agreement dated 9 September 2013 between KSH and Hanjin Shipping to amend and restate the BBCHP (as amended) in accordance with the requirements of a loan agreement dated 27 August 2013 between KSH and its lenders (the “2013 Agreement”);14Foot Note 14×Ms Joo’s 1st AEIC, at exh-YJY10. (d) a Novation and Amendment Agreement dated 30 June 2014 among KSH, Hanjin Shipping and H-Line novating the rights and obligations of Hanjin Shipping under the BBCHP (as amended) in favour of H-Line (the “Novation Agreement”);15Foot Note 15×Ms Joo’s 1st AEIC, at exh-YJY11. (e) the continuous synopsis record (“CSR”) issued on 15 January 2015 (ie, before the date of the collision) by the Panama ship registry recording thatHanjin Ras Laffanwas operated by H-Line under the terms of a registered bareboat charter;16Foot Note 16×Ms Joo’s 2nd AEIC, at para 18; exh-YJY18 (at p 20). (f) CSR issued on 10 March 2017 which continued to recordHanjin Ras Laffanas operated by H-Line under the terms of a registered bareboat charter;17Foot Note 17×Ms Joo’s 2nd AEIC, at para 18; exh-YJY18 (at p 21).and (g) a set of invoices issued by Sembcorp Marine Repairs & Upgrades Pte Ltd to “Captain & Owners ofHanjin Ras Laffan, H-Line Shipping” for repairs carried out onHanjin Ras Laffan.18Foot Note 18×Ms Joo’s 1st AEIC, at exh-YJY12. Originals of the documents described in (b) to (d) and (g) above were tendered by Ms Joo in court at trial. Ms Joo explained that the originals of the documents described in (e) and (f) could not be produced as they had to be kept on board the vessel at all times.19Foot Note 19×NE, 9 May 2018, at 59:12–21. 12 Recital (C) of the Novation Agreement explained that the background to the Novation Agreement was the transfer of Hanjin Shipping’s bulk carrier business to H-Line. Interestingly, while cl 25.01 of the BBCHP specified KSH’s address for service of notices as “c/o Hanjin Shipping Co., Ltd.”, the Novation Agreement amended this to “c/o H-Line Shipping Co., Ltd.”.20Foot Note 20×Ms Joo’s 1st AEIC, at exh-YJY11 (at Clause 4.1(b)(xvii)).Ms Joo explained that, as part of H-Line’s acquisition of Hanjin Shipping’s bulk carrier business, H-Line took over about 40 vessels from Hanjin Shipping and also took over Hanjin Shipping’s stake in KSH, as a result of which KSH became wholly owned by H-Line.21Foot Note 21×NE, 9 May 2018, at 33:17–19, and 58:30; 10 May 2018, at 7:23–26. 13 There are also two documents in the Agreed Bundlebearing H-Line’s letterhead, the authenticity of which Mt Apo has accepted. These areHanjin Ras Laffan’s passage plan dated 2 August 201522Foot Note 22×Agreed Bundle, vol 1, at p 150.andHanjin Ras Laffan’s record of passage planning dated 2 August 2015.23Foot Note 23×Agreed Bundle, vol 1, at p 153. 14 H-Line submitted that it had conducted itself at all material times as the demise charterer ofHanjin Ras Laffan. For example,sixmonths before the collision, Ms Joo caused the Panama ship registry to issue a CSR listing H-Line as bareboat charterer ofHanjin Ras Laffan. H-Line expended a significant sum of US$1.2 m to repairHanjin Ras Laffanafter the collision.24Foot Note 24×Ms Joo’s 1st AEIC, at exh-YJY12 (at p 280).Less than two weeks after the collision, solicitors representing both vessels executed a collision jurisdiction agreement which contained a warranty that H-Line was the demise charterer ofHanjin Ras Laffan.25Foot Note 25×Agreed Bundle, vol 1, at p 245. 15 At the material time,Hanjin Ras Laffanwas in H-Line’s actual possession as the vessel was manned by H-Line. The master ofHanjin Ras Laffantestified that he was employed by H-Line.26Foot Note 26×NE, 10 May 2018, at 15:17–23.",
        "Mt Apo’s case on H-Line’s title to sue": "16 Mt Apo’s approach was to question the admissibility of the documents tendered by Ms Joo and to thereby seek to persuade the court that the demise charter was a sham. Although Mt Apo initially contested the admissibility of all the documents referred to at [11] above, the objections to documents (e) to (g) were dropped during oral submissions.27Foot Note 27×NE, 8 October 2018, at 31:16–20, and 36:14–19.As for documents (a) to (d), which Mt Apo referred to in submissions collectively as the “Bareboat Contracts”, Mt Apo accepted that these were “business records” which fell within the hearsay exception under s 32(1)(b)(iv) of the Evidence Act (Cap 97, 1997 Rev Ed). However, Mt Apo submitted that I should either exclude them in the interests of justice under s 32(3) of the Evidence Act on the basis that they were unreliable28Foot Note 28×PCS, at paras 137–138.or assign them minimal weight under s 32(5) on the same basis.29Foot Note 29×PCS, at paras 158. 17 Mt Apo gave the following reasons for considering the Bareboat Contracts unreliable: (a) There was no one before the court that was familiar with the documents and could attest to the truth of their contents. Ms Joo could not possibly do so, as she had admitted that she did not sign the Novation Agreement, while the BBCHP, the 2010 Agreement and the 2013 Agreement were all signed before she joined H-Line on 2 June 2014.30Foot Note 30×PCS at para 140.Ms Joo gave inconsistent answers about the arrangement with the Korea Gas Corporation (“KOGAS”) to carry LNG onHanjin Ras Laffan.31Foot Note 31×PCS, at paras 141–145. (b) The “originals” tendered during trial were not identical to the copies exhibited in Ms Joo’s affidavits evidence-in-chief. For instance, the word “September” in handwriting on the cover page of the “original” of the 2010 Agreement brought to court looked different from the handwritten word “September” on the cover page of the copy of the 2010 Agreement exhibited in Ms Joo’s 1st AEIC.32Foot Note 32×Ms Joo’s 1st AEIC, at p 67; NE, 9 May 2018, at 52:15–53:6.This meant that the documents which Ms Joo brought to court were not the originals of the copies exhibited in her AEIC, and she had failed to produce the originals of those copies. Ms Joo could not adequately explain the discrepancies and she was being untruthful when she stated that the documents she tendered in court were originals.33Foot Note 33×PCS, at para 148. (c) The fact that the documents were disclosed in dribs and drabs, with copies of the Bareboat Contracts disclosed two years after the action commenced and with the “originals” disclosed just three weeks before the commencement of trial, meant that, until very recently, H-Line did not have the originals or even copies of the Bareboat Contracts. The only explanation is that the demise charter by H-Line was a sham.34Foot Note 34×PCS, at para 156. (d) A charge was registered at the UK companies registry against Hanjin Shipping on, among other things, the earnings of Hanjin Shipping arising out of the use and operation ofHanjin Ras Laffan.35Foot Note 35×Plaintiff’s Core Bundle (“PCB”), at pp 250–263. NE, 10 May 2018, at 12:16–13:4.Created on 7 September 2010, the status of the charge remained listed on the UK companies register as “outstanding” as at the commencement of trial. This is objective evidence thatHanjin Ras Laffanwas not demise chartered to H-Line at the time of the collision.36Foot Note 36×PCS, at para 157.",
        "Analysis on title to sue": "18 I was a little puzzled that Mt Apo focused its submission entirely on the admissibility of the Bareboat Contracts, to the exclusion of addressing the evidence outlined at [10] and [12]–[15] above. Mt Apo should have been aware that it is possible to prove title to sue without admitting documents in the nature of the Bareboat Contracts. This point may be illustrated by two cases -Jet Holding Ltd and others v Cooper Cameron (Singapore) Pte Ltd and another[2005] 4 SLR(R) 417 (“Jet Holding”) andZweite MS “Philippa Schulte” Shipping GmbH & Co KG & another v PSA Corp Ltd[2012] SGHC 135 (“Zweite”). 19 InJet Holding, JHL’s title to sue was in issue. To establish title to sue, JHL sought to prove that it purchased the drill shipEnergy Searcherfrom JSL and subsequently leased it back to JSL under a bareboat charter. JHL’s witness on this issue was a Mr Perret who, at the time of the alleged sale and lease back, was an executive vice-president of JHL and concurrently the president of JSL. Documents purportedly covering the sale between JHL and JSL were not admitted in evidence (at [55]). Despite this, Belinda Ang Saw Ean J found JHL’s title to sue proven because “Perret’s involvement in the two companies and the drill ship was sufficient to place him in a position to testify generally to the change of ownership of the drill ship and the charter to JSL as demise charterer” (at [57]). 20 InZweite, the two plaintiffs (who were, respectively, the purported shipowner and the purpoted bareboat charterer of the vessel) relied on,inter alia, the evidence of one Mr Heidrich to prove title to sue. Mr Heidrich purported to testify based on his personal knowledge. He did not exhibit any documents relating to ownership of the vessel. Tan Lee Meng J rejected Mr Heidrich’s evidence on the basis that he did not have sufficient involvement in the two plaintiffs to be able to testify from personal knowledge (at [21]). When the case went on appeal, the plaintiffs succeeded in establishing title to sue,37Foot Note 37×NE, 8 October 2018, at 86:2–26; CA 88/2012 – ORC 1693/2013 (28 February 2013).thus confirming that non-admission of ownership documents would not prevent a court from finding title to sue based on other evidence. 21 In fairness to Mt Apo, instead of treating its focus on the admissibility of the Bareboat Contracts as a decision not to challenge the evidence outlined at [10] and [12]–[15] above, I decided to construe Mt Apo’s four objections to the Bareboat Contracts’ reliability at [17] above more broadly as objections to the overall reliability of H-Line’s claim to be demise charterer ofHanjin Ras Laffan.I will therefore address each of Mt Apo’s objections in turn on this basis. Whether Ms Joo could testify to the novation of the BBCHP from Hanjin Shipping to H-Line 22 Mt Apo pointed out that Ms Joo could not have been present when the BBCHP, the 2010 Agreement and the 2013 Agreement were signed, as she joined H-Line only in 2014. This submission ignores the fact that the BBCHP, the 2010 Agreement and the 2013 Agreement were executed by Hanjin Shipping, not H-Line. The only document among the Bareboat Contracts executed by H-Line is the Novation Agreement. 23 In any event, Mt Apo does not dispute thatHanjin Ras Laffanwas bareboat chartered to Hanjin Shipping at some point in time.38Foot Note 38×NE, 8 October 2018, at 38:7–32.After all, it was Mt Apo who tendered and relied on39Foot Note 39×NE, 8 October 2018, at 38:16–29.a public document from the UK companies registry, namely the registration of charge referred to at [17(d)] above, which concerned:40Foot Note 40×PCB, at p 252. …a bareboat charterparty dated 27 October 1997 and entered between the Owner as owner and the Chargor as bareboat charterer, in respect of the chartering of the Ship, as supplemented by a side agreement dated as of 2 December 2009 and as amended by the Amending and Restating Agreement. In the foregoing passage, “Owner” refers to KSH,41Foot Note 41×PCB, at p 251.“Chargor” refers to Hanjin Shipping42Foot Note 42×Loc cit.and “Ship” refers toHanjin Ras Laffan.43Foot Note 43×PCB, at p 258.As the date of creation of the charge, 7 September 2010, was the date on which the 2010 Agreement was signed, the reference to “Amending and Restating Agreement” in the foregoing passage can only be a reference to the 2010 Agreement. In other words, there is a public document, registeredfive years before the collisionwith the UK companies registry, which referred to both the BBCHP and the 2010 Agreement and which also referred to Hanjin Shipping as the bareboat charterer ofHanjin Ras Laffanunder the BBCHP. 24 Since it is not seriously disputed thatHanjin Ras Laffanwas bareboat chartered to Hanjin Shipping, the focus is really on the Novation Agreement dated 30 June 2014, pursuant to which H-Line purportedly derived its title from Hanjin Shipping. As a matter of background, Mt Apo again did not seriously challenge Ms Joo’s explanation that, as a result of the transfer of Hanjin Shipping’s bulk carrier business to H-Line on 30 June 2014, H-Line took over about 40 vessels from Hanjin Shipping on that day.44Foot Note 44×NE, 8 October 2018, at 39:14–40:20.In my view, it would have been untenable for Mt Apo to do so since the said transfer was well known in the shipping industry and widely reported, including on Lloyd’s List. But accepting that the said transfer took place is not the same as accepting thatHanjin Ras Laffanwas one of the many vessels which H-Line took over from Hanjin Shipping as part of the said transfer. This is where the Novation Agreement comes into issue. 25Jet HoldingandZweitewere cited to me on whether Ms Joo could testify to the novation of the BBCHP from Hanjin Shipping to H-Line. The comparison is between: (a) Mr Perret inJet Holding, who held office in both JHL and JSL, and testified that although he was not involved in the financial part of the deal, he was in charge of the “technical part” of the deal and also worked closely on certain commercial aspects ofEnergy Searcher; and (b) Mr Heidrich inZweite, who was not an employee of either plaintiff and whose role as a technical director of the vessel’s technical manager was concerned with the day-to-day running of the vessel. 26 Coming back to Ms Joo, she testified that:45Foot Note 45×Ms Joo’s 1st AEIC, at para 6. Although I did not sign the Novation Agreement, I am fully familiar with the circumstances surrounding the execution thereof, and I also have personal knowledge of the running of the bareboat charterparty of the Vessel in accordance with its terms, in my capacity as deputy manager of H-Line since the time I joined the company on 2 June 2014. 27 Ms Joo also testified that: (a) she was involved in communications with the lawyers during the negotiation process leading to the Novation Agreement;46Foot Note 46×NE, 9 May 2018, at 33:22–26. (b) after the Novation Agreement was signed she was responsible for storing copies in the office computer and warehouse;47Foot Note 47×NE, 9 May 2018, at 30:2–7.and (c) even though she was not present at the signing of the Novation Agreement, she was in daily contact with the two H-Line officers who signed the Novation Agreement until they left the company in October 2014.48Foot Note 48×NE, 9 May 2018, 34:1–2. 28 Ms Joo’s role at H-Line concerns the management and commercial aspects of vessels. As noted at [9] above, her responsibilities in respect ofHanjin Ras Laffaninclude regulatory filings with Korean government agencies, liaising with the Panama ship registry, and liaising with insurers. She testified that, after the Novation Agreement was signed, she was responsible for declaring the demise charter to the relevant Korean government agency on behalf of H-Line.49Foot Note 49×NE, 9 May 2018, at 59:29–32. 29 Mt Apo attempted to show that Ms Joo was actually not familiar with the demise charter and the arrangements surrounding it by reference to certain alleged inconsistencies in her testimony. According to Mt Apo: (a) Ms Joo initially said H-Line took over Hanjin Shipping’s engagement by KOGAS to carry LNG, not that H-Line took over the bareboat charter ofHanjin Ras Laffan;50Foot Note 50×NE, 9 May 2018, at 41:1–3. (b) subsequently, in response to a question from counsel for Mt Apo, Mr Chan concerning an e-mail from Hanjin Ras Laffan’s former solicitors which contained references to “off-hire” and a contractual obligation “to provide the charterers with a substitute vessel”, Ms Joo explained that KOGAS is the charterer referred to in the e-mail. In the course of this answer, she erroneously described KOGAS as “bareboat charterer”;51Foot Note 51×NE, 9 May 2018, at 45:18.and (c) the next day, Ms Joo clarified that what she meant was, as between KOGAS and H-Line, KOGAS would be the charterer and H-Line would be the owner, while, as between H-Line and KSH, H-Line would be the charterer and KSH would be the owner. Thus the term “charterer” could refer to different parties depending on context.52Foot Note 52×NE, 10 May 2018, a 3:1–7t. 30 In relation to the exchange at [29(a)] above, since the question posed to Ms Joo concerned KOGAS,53Foot Note 53×NE, 9 May 2018, at 40:14–17.I consider it natural for her to focus her answer on H-Line’s relationship with KOGAS, especially since she had already explained the novation of the BBCHP earlier in her testimony.54Foot Note 54×NE, 8 May 2018, at 33:17–27.As for the exchange at [29(b)] above, I would not put much store by her reference to KOGAS as “bareboat charterer”. Ms Joo was giving evidence in the Korean language through an interpreter. As for the exchange at [29(c)] above, if Ms Joo had discovered that what she said the day before was inaccurate, it is entirely right and proper for her to come back the next day and clarify. 31 In my assessment, Ms Joo was not prevaricating. She was merely setting the record straight. Ms Joo’s explanation is, in any event, consistent with the terms of the letter of undertaking dated 30 June 2014 issued by KOGAS to KSH.55Foot Note 55×Ms Joo’s 2nd AEIC, at exh-YJY15 (the “CD Bible”), electronic document no 5.In the letter of undertaking, KOGAS acknowledged the Novation Agreement and the financing arrangements associated with the Novation Agreement, and undertook tocharterHanjin Ras Laffanfrom H-Line for the carriage of LNG pursuant to a contract of affreightment (“COA”). The letter of undertaking also explained that the COA, originally entered into between KOGAS and Hanjin Shipping on 14 July 2000, was transferred to H-Line by a transfer agreement dated 26 June 2014.56Foot Note 56×Ms Joo’s 2nd AEIC, at exh-YJY15 (the “CD Bible”), electronic document no 5. 32 I therefore do not accept Mt Apo’s submission that Ms Joo is not familiar with the demise charter and its surrounding arrangements. On the contrary, putting aside language barriers and minor points concerning usage of technical terms, I find her explanation of the relevant arrangements clear, cogent and consistent with the available documentary evidence. 33 Going back to the factors listed at [26]-[28] above, while they do not demonstrate that Ms Joo was in as advantageous a position as Mr Perret inJet Holdings, she was clearly in a much more knowledgeable and advantageous position than Mr Heidrich inZweite. After all, she is an employee of H-Line, her responsibilities require her to be familiar with the status ofHanjin Ras Laffan, she was involved in the preparations leading to the novation and she remained in constant contact with the officers who signed the Novation Agreement for several months thereafter. I therefore hold that Ms Joo is a person with sufficient familiarity to testify generally to the demise charter arrangements concerningHanjin Ras Laffan. Discrepancies between “originals” tendered at trial and copies exhibited in Ms Joo’s AEICs 34 I agree with Mt Apo that the “originals” of the Bareboat Contracts produced at trial were not the originals of the copies exhibited in Ms Joo’s AEICs. However, the differences are only in the handwritten annotations –ie,dates and names of signatories and witnesses. The printed content,ie,the legal provisions do not differ at all. Even the differences in the handwritten annotations do not relate to content or substance. For example, in the date “30 June” handwritten on top of the first page of the Novation Agreement, the figure zero in the number “30” on the original tendered in court57Foot Note 57×Defendants’ Bundle of Documents, at p 457.appears slightly smaller than the figure zero on the copy exhibited in Ms Joo’s AEIC.58Foot Note 58×Defendants’ Bundle of Documents, at p 466.But all the handwritten dates appear throughout both versions as “30 June”. Similarly, on the signature page of the Novation Agreement, the handwritten name “Tai Soo Suk” is written with a slightly larger “a” in the original59Foot Note 59×Defendants’ Bundle of Documents, at p 463.than in the copy exhibited in Ms Joo’s AEIC.60Foot Note 60×Defendants’ Bundle of Documents, at p 472.But the names are spelt in exactly the same way in both versions. 35  Ms Joo’s explanation is that, on 30 June 2014, Hanjin Shipping divested its bulk carrier business to H-Line, which involved H-Line taking over about 40 vessels from Hanjin Shipping, as well as the related financing arrangements. More than a hundred agreements were signed on that day.61Foot Note 61×NE, 9 May 2018, at 54:7–11.The law firm preparing the agreements, Watson Farley Williams Asia Practice LLP (“Watson Farley Williams”), scanned these agreements into “CD Bibles” and each party to the transactions was given a copy of the relevant “CD Bible”. H-Line would not know which of the many parties is in possession of the actual hardcopy from which the scan in the “CD Bible” was made.62Foot Note 62×NE, 9 May 2018, at 53:23.Ms Joo explained that: (a) in Korea, the “CD Bible” is regarded as an original;63Foot Note 63×NE, 9 May 2018, at 30:27–28, and 55:2–11. (b) H-Line’s company policy is not to retain hardcopy originals unless required by law to do so;64Foot Note 64×Ms Joo’s 2nd AEIC, at para 11.and (c) the electronic version of the agreements in the “CD Bible” are relied upon and used as the “operative document” for the purposes of operating theHanjin Ras Laffanunder a charter.65Foot Note 65×Loc cit. 36 A copy of this “CD Bible” was tendered in evidence.66Foot Note 66×Ms Joo’s 2nd AEIC, at exh-YJY15An examination of the electronic copy of the Novation Agreement in the “CD Bible” revealed that the copy of the Novation Agreement exhibited in Ms Joo’s AEIC67Foot Note 67×Ms Joo’s 1st AEIC, at exh-YJY11.was indeed printed from the “CD Bible”. 37 As for discrepancies of the same nature in the handwritten annotations on the 2010 Agreement and 2013 Agreement, Ms Joo gave a similar explanation save that she did not refer to the “CD Bible” in her explanation concerning the 2010 Agreement and 2013 Agreement.68Foot Note 68×NE, 9 May 2018, at 52:19–54:5.This is consistent with the fact that the “CD Bible” does not contain electronic copies of the 2010 Agreement and 2013 Agreement. The “CD Bible” only contains the Novation Agreement and about 30 other legal documents, executed at about the same time as the Novation Agreement, touching upon the financing arrangements in relation to the Novation Agreement. 38 In the light of the foregoing, while I agree with Mt Apo that the original documents which Ms Joo brought to court were not the same originals from which the copies exhibited in her AEICs were made, I think she has satisfactorily explained the discrepancies. With so many parties involved in the agreements, each agreement would necessarily be signed in multiple originals. Since H-Line had been relying on electronic copies of the agreements compiled by external parties, it is not surprising that any hardcopy originals it subsequently located may not have been the same originals as those from which the said electronic copies were made. 39 However, that does not mean that there are no issues with the provenance of the said original documents, a point to which I now turn. Whether the issues encountered by H-Line in producing the originals of the Bareboat Contract meant that the demise charter was a sham 40 As noted at [17(c)] above, Mt Apo submitted that the only explanation for H-Line’s belated disclosure of copies and “originals” of the Bareboat Contracts is that the demise charter was a sham. 41 Ms Joo gave evidence that, in November 2016 (two months after parties exchanged their initial lists of documents), she instructed her staff, Ms Seyeon Cha (“Ms Cha”), to contact Watson Farley Williams and a Korean law firm, Lee & Ko, to ask about originals of the BBCHP, the 2013 Agreement as well as a 2009 side agreement referred to in the Novation Agreement (“the Side Agreement”).69Foot Note 69×Ms Joo’s 2nd AEIC, at paras 13–14.Ms Cha’s e-mail of 9 November 2016 to Watson Farley Williams asked if they had “kept records of” the said agreements.70Foot Note 70×Ms Joo’s 2nd AEIC, at exh-YJY16.There was no mention of “originals” in that e-mail. Ms Joo’s evidence is that Watson Farley Williams never replied to that e-mail.71Foot Note 71×Ms Joo’s 2nd AEIC, at para 13.Ms Cha’s e-mail of 10 November 2016 to Lee & Ko, asked for “copies” of the said agreements.72Foot Note 72×Ms Joo’s 2nd AEIC, at exh-YJY15, with English translation at Ms Seong-Sook Choi’s (“Ms Choi”)1st Affidavit, at pp 34–36.Again, there was no mention of “originals” in that e-mail. Two and a half hours after her initial e-mail to Lee & Ko, Ms Cha sent another e-mail to inform Lee & Ko that there was no need to search for the BBCHP as H-Line had located it “in hardcopy”.73Foot Note 73×Ms Choi’s 1st Affidavit, at p 35.Lee & Ko replied by e-mail half an hour later attaching a copy of the 2013 Agreement.74Foot Note 74×Ms Choi’s 1st Affidavit, at p 34.This means that, by 10 November 2016, H-Line was, at the minimum, already in possession of copies of the BBCHP and the 2013 Agreement. 42 Ms Joo was asked in cross-examination about the discrepancy between her AEIC, which claimed she asked Ms Cha to seek the originals of the agreements from the law firms, and the e-mails Ms Cha sent out, which did not mention originals and appeared to be asking merely for copies. Ms Joo first explained that Ms Cha made a mistake in asking for copies instead of originals.75Foot Note 75×NE, 9 May 2018, at 36:18Two questions later, Ms Joo supplemented that Ms Cha did not have copies of the agreement with her, even though copies were in H-Line’s possession.76Foot Note 76×NE, 9 May 2018, at 37:1–3. 43 Mt Apo submits that it was incredible that Ms Cha, who was “taking care of matters for external financial institutions” would not have access to documents that “form the core of the very arrangements she was supposed to take care of”.77Foot Note 77×PCS, at para 155.I do not agree with Mt Apo. The BBCHP and 2013 Agreement concerned the relationship between H-Line and KSH, not the relationship with external financial institutions. In any event, the fact that Ms Cha located a copy of the BBCHP in H-Line a couple of hours after writing to Lee & Ko tends to corroborate Ms Joo’s answer that copies were indeed in H-Line’s possession but Ms Cha was not aware of that. 44 During oral submissions, Mr Chan highlighted what he believed to be discrepancies in Ms Joo’s evidence about the original of the Novation Agreement.  Mr Chan pointed out that: (a) Ms Choo first said in her 2nd AEIC that H-Line did not possess the original of the Novation Agreement after it was signed; (b) in court, she explained that she received the original of the Novation Agreement from Mr Yoon Yeoeul (one of H-Line’s two signatories for the Novation Agreement, who left H-Line in October 2014); (c) but she also said in court that she was not in contact with Mr Yoon after he left H-Line.78Foot Note 78×NE, 9 May 2018, at 34:5. Mr Chan submitted that it was not possible for Ms Joo to have received the original of the Novation Agreement from Mr Yoon if she had no recent contact with Mr Yoon. 45 In making the foregoing submission, Mr Chan missed out certain aspects of Ms Joo’s evidence. First, at the time Ms Joo filed her 2nd AEIC, H-Line still had not located the original of the Novation Agreement. Secondly, Ms Joo appeared to have said in court that the original of the Novation Agreement was found in H-Line’s warehouse.79Foot Note 79×NE, 9 May 2018, at 54:7–11.Thirdly, when asked whom she received the original of the Novation Agreement from, her initial answer was that “these documents were received by me fromthoseparties whocame back from the contract entered [sic]”.80Foot Note 80×NE, 9 May 2018, at 29:1–2.When asked to identify the said parties, she answered: “I received this document from Yoon Yeoeul.”81Foot Note 81×NE, 9 May 2018, at 29:11–12. 46 Taking these additional points into account, Ms Joo’s evidence appears to be that: (a) the original of the Novation Agreement was found in H-Line’s warehouse after she filed her 2nd AEIC, as opposed to being handed to her by Mr Yoon only recently; (b) the original of the Novation Agreement was handed by Mr Yoon to her when he returned from the contract signing. But this still leaves unexplained why Ms Joo said in her 2nd AEIC that H-Line “did not possess the original of the Novation Agreement after it was signed”. Perhaps what Ms Joo meant to say was that H-Line was not in possession of the original (because H-Line had up to that point not been able to locate the original). 47 From the foregoing, while I agree with Mr Chan that there are some gaps in Ms Joo’s evidence concerning the provenance of the original of the Novation Agreement, I am of the view that there are reasonable explanations for such gaps and the gaps do not significantly affect the overall credibility of Ms Joo’s evidence concerning the Novation Agreement. 48 This would also be an appropriate juncture to observe that, unlike the Novation Agreement, there was no explanation from Ms Joo on how H-Line obtained the “originals” of the 2010 Agreement and 2013 Agreement which she brought to court. 49 Finally, I do not see how any of the foregoing should lead to the conclusion that the demise charter is a sham. There is evidence that Hanjin Shipping was at one time the demise charterer ofHanjin Ras Laffan. It was not disputed that Hanjin Shipping transferred its bulk carrier business to H-Line, pursuant to which H-Line took over a large number of vessels from Hanjin Shipping. Given that the “CD Bible” shows that more than 30 other legal documents relating to the Novation Agreement and involving various parties, including financial institutions, were executed at roughly the same time as the Novation Agreement, any sham would have to be a very elaborate one. 50 When I asked Mr Chan during oral submissions what he thought the commercial purpose of such a sham could be, he moderated his position and submitted that Mt Apo’s point was that H-Line did not have any proper documentation in place and, when title to sue was put in issue, they began scrambling to produce the documents.82Foot Note 82×NE, 8 October 2018, at 37:3–8.Mr Chan then suggested that it might be open to me to find that there was a demise charter based on “circumstantial evidence” without finding that the Bareboat Contracts tendered in court were authentic. The precise question of whether the legal provisions in those documents were indeed the provisions which were operative between parties (as opposed to the general question of whether the agreements existed) would only be relevant for damages and not relevant for title to sue. Mr Chan submitted that Mt Apo may find difficulties challenging these documents during the damages phase if it were to be said then that I had already found these documents to be authentic during the liability phase.83Foot Note 83×NE, 8 October 2018, at 41:21–42:13, and 93:1–10. 51 So the final shape of Mt Apo’s submission on H-Line’s title to sue is no longer that the demise charter arrangement is a sham, but that the specific documents adduced in evidence by H-Line may not have been the actual documents which were operative between the relevant parties.84Foot Note 84×NE, 8 October 2018, at 37:15–19 Whether the registration of charge against Hanjin Shipping meant that H-Line was not the demise charterer at the time of collision 52 As for the charge registered on the UK companies register against Hanjin Shipping on the earnings fromHanjin Ras Laffan, Mr Chan suggested that: (a) no commercially sensible party (ie, H-Line) would have taken a demise charter over a vessel with a charge to secure the borrowings of a third party (ie, Hanjin Shipping); and (b) this showed that there had never been a novation of the charterparty from Hanjin Shipping to H-Line.85Foot Note 85×NE, 8 October 2018, at 44:30–45:1; PCS, at para 158. 53 I did not think that such a conclusion could be drawn from the UK companies registry search results. The mere fact that a charge was registered five years before the collision and had remained registered at the time of collision did not necessarily mean that the charge hadremainedin effect till then. It was undisputed that, while there is a legal duty under UK companies law to register a registrable charge, there is no corresponding legal duty to deregister a charge when it ceases to have effect.86Foot Note 86×NE, 8 October 2018, at 43:9–44:19.",
        "Conclusion on title to sue": "54 Given the shape of the evidence and parties’ submissions, in order to find that H-Line was the demise charterer at the time of collision, I need to find that: (a) Hanjin Shipping was, at some stage, the demise charterer ofHanjin Ras Laffan; and (b) Hanjin Shipping novated this demise charterparty to H-Line prior to the collision. 55 In relation to point (a), I find it proven that Hanjin Shipping was the demise charterer ofHanjin Ras Laffanprior to the Novation Agreement on the bases that: (a) Hanjin Shipping had been described as such in a public document, from five years before the collision, filed at the UK companies registry, which document was tendered and relied upon in evidence by Mt Apo; (b) Hanjin Shipping was described as such in the Novation Agreement, which I have found to be authentic; (c) Ms Joo, whom I found was in a position to testify generally to the demise charter arrangements concerningHanjin Ras Laffan, gave evidence that Hanjin Shipping was the demise charterer who novated the charterparty to H-Line; and (d) the point had, in any event, been effectively conceded by Mt Apo (see [23] above). 56 In relation to point (b), I am persuaded by Ms Joo’s testimony. Given her roles and responsibilities, I find that Ms Joo is a person who can testify generally to the demise charter arrangements concerningHanjin Ras Laffan. Despite certain perceived inconsistencies in Ms Joo’s evidence pointed out by Mt Apo, I find her evidence, viewed as a whole, to be credible. In particular, I find that she had sufficiently explained how the copy of the Novation Agreement in the “CD Bible” came to H-Line and how the original of the Novation Agreement was subsequently located. I find no basis for concluding that Ms Joo was engaged in the dishonest alleged act of cooking up a sham demise charter. In accepting Ms Joo’s testimony, I also took into account the matters outlined at [12]–[15] above. 57 Further, I find that H-Line had fulfilled the requirements of s 66 of the Evidence Act to tender primary evidence of the Novation Agreement by producing an original in court through Ms Joo.Explanation 1to s 64 of the Evidence Act provides that “Where a document is executed in several parts, each part is primary evidence of the document”. Thus the original produced by Ms Joo in court, being one of several originals of the signed Novation Agreement, is primary evidence of the Novation Agreement, even though it may not be the original from which the scan in the “CD Bible” was made. The obligation under s 66 is to tender primary evidence ofthe Novation Agreement, not primary evidence of the specific copy which Ms Joo happened to have exhibited in her AEIC. 58 Alternatively, given Ms Joo’s testimony that the electronic version of the agreements in the “CD Bible” are relied upon and used as the “operative documents” and are treated in Korea as originals, the electronic copy of the Novation Agreement in the “CD Bible” constitutes primary evidence of the Novation Agreement pursuant toExplanation 3of s 64 of the Evidence Act, which provides: Explanation 3 —Notwithstanding 2, if a copy of a document in the form of an electronic record is shown to reflect that document accurately, then the copy is primary evidence. Illustrations (a) An electronic record, which has been manifestly or consistently acted on, relied upon, or used as the information recorded or stored on the computer system (the document), is primary evidence of that document. ... 59 I therefore find the Novation Agreement admissible and authentic. 60 In the light of the above findings, it is no longer necessary for me to rule on the admissibility and authenticity of the BBCHP, the 2010 Agreement and the 2013 Agreement in order to determining title to sue. I therefore makeno finding either wayon this point. Should this point become relevant during the damages phase, it will be up to the court hearing the assessment of damages to determine the point, and it will also be up to the said court whether to receive further evidence from H-Line concerning the admissibility and authenticity of these documents. 61 Looking at the evidence in totality, I hold that H-Line has established, on the balance of probabilities, that it has title to sue as demise charterer ofHanjin Ras Laffanat the time of the collision.",
        "Background facts leading to the dispute": "62 I now turn to the facts proper on the collision. 63 Mr William John Ellison (“Mr Ellison”), a naval architect and an expert witness for Mt Apo has provided in evidence plots of the movements of theMt Apoand theHanjin Ras Laffan, as well as those of nearby vessels.87Foot Note 87×Mr William John Ellison’s (“Mr Ellison”) Supplementary AEIC, dated 8 August 2018, at pp 29–30.As these plots were referred to extensively during trial and there were no objections to their accuracy, I have exhibited one of them at the Annex to this judgment to illustrate the factual narrative and assist in understanding the analysis which follows.",
        "Use of plots and animation reconstructions in the trial": "64 These plots were compiled using Automatic Identification System (“AIS”) data and data from the Voyage Data Recorders (“VDRs”) on board the two vessels. Both sides’ experts also provided the court with two-dimensional (“2D”) and three-dimensional (“3D”) animations reconstructed from AIS and VDR data.88Foot Note 88×Agreed Bundle, vol 2, at Tabs 98, 99, and 101–106.The 2D animations provide aerial views of the vessels’ movements, while the 3D animations reconstructed the views from the respective bridges of the two vessels. 65 In terms of evidential value, these plots and animations are merely demonstrative or illustrative evidence. Their preparation involved interpretation and processing of the AIS and VDR data, and the use of software tools to reconcile data obtained from different sources. The need for reconciliation could ariseeg, from the fact that the internal clocks of the various systems generating and recording data may not be showing the same time. The preparation of the animation reconstructions also involved joining static data points together (a process which necessitated some form of interpolation to fill in the gaps between data points). In other words, these plots and reconstructions are expressions of the skill and judgment of the experts in their attempts to render a close approximation of what had occurred based on the way they processed the available data, subject to various margins of error. The court needs to be mindful not to treat the plots and reconstructions as if they are actual aerial photographs or video footages of the event. 66 In the present case, there was a dispute between Mr Ellison and Hanjin Ras Laffan’s expert, Captain Bruce Gordon Ewen (“Capt Ewen”), over the accuracy of the plots and animations prepared by Capt Ewen. Mr Ellison explained that Capt Ewen’s plots and animations showedMt Apo’s position to be 17 to 19 seconds ahead of her position based on GPS data recorded in the VDR. Mr Ellison attributed this shift of 17 to 19 seconds to the methodology adopted by Capt Ewen to deal with the differences between the timestamps appended by the systems generating the AIS messages and the timestamps appended by the systems receiving the AIS messages.89Foot Note 89×Mr Ellison’s Supplementary AEIC, dated 8 August 2018, at pp 11–12.The matter was discussed extensively at trial, at the end of which I agreed with Mr Ellison.90Foot Note 90×NE, 14 August 2018, at 7:27–23:29.What this means is that Capt Ewen’s plots and animations have to be viewed and understood with this 17-to-19-second shift inMt Apo’sposition in mind, while Mr Ellison’s plots and animations can be used without the viewer having to make such mental adjustments. I have therefore relied primarily on Mr Ellison’s plots and animations.",
        "The vessels and their crew": "67Mt Apois a single-screw bulk carrier with gross tonnage of 91,792 tonnes, a breadth of 45 metres and overall length of 291.80 metres. She has a minimum steering speed of 5 knots.91Foot Note 91×Agreed Bundle, vol 1, at p 203.Mt Apo’s bridge was equipped with two Furuno automatic radar plotting aid (“ARPA”) radars, with the S-band radar on the port side and the X-band radar on the starboard side of the bridge. Both radars were switched on and working normally.92Foot Note 92×Capt Rajesh’s AEIC, at paras 7 and 26.At the material time,Mt Apowas travelling in ballast.93Foot Note 93×Mt Apo’s Preliminary Act, dated 21 April 2016, at p 2. 68 The only member ofMt Apo’s crew who gave evidence was her master, Captain Rajesh Sardarsingh Chauhan (“Capt Rajesh”), an Indian national. The chief officer was Mr Grigorev Yury, a Russian national. The second officer was Mr Babenko Maksym, a Ukrainian national. The third officer, who was also the officer on watch (“OOW”) during the lead up to the collision, was Mr Li Wenming, a Chinese national.94Foot Note 94×Agreed Bundle, vol 2, at p 380. 69Hanjin Ras Laffanis a single-screw LNG carrier with gross tonnage of 93,769 tonnes, a breadth of 43 metres and overall length of 280 metres. She has a minimum steering speed of 4 knots.95Foot Note 95×Agreed Bundle, vol 1, at pp 1, 133–134.Her bridge was similarly equipped with three ARPA radars (two X-band radars and an S-band radar), which were connected to an AIS. All the equipment was in good working condition.96Foot Note 96×Capt Kim’s AEIC, at paras 5 and 6.At the material time, she was carrying only 1,600 cubic metres of LNG.97Foot Note 97×Hanjin Ras Laffan’s Preliminary Act, dated 5 May 2016, at p 1. 70 Similarly, the only member ofHanjin Ras Laffan’s crew who gave evidence was her master, Captain Gap Dong Kim (“Capt Kim”). She had a bridge team consisting entirely of Korean nationals.98Foot Note 98×Agreed Bundle, vol 1, p 177.",
        "Weather, visibility and current": "71 The weather was cloudy with intermittent passing showers. Visibility was varied due to the intermittent showers, with visibility reduced to about two nautical miles (“nm”) in areas affected by the showers. According to the parties’ Preliminary Acts,Mt Apowas first seen byHanjin Ras Laffanwhen the vessels were 4 nm apart, whileHanjin Ras Laffanwas first seen byMt Apowhen the vessels were 2.1 nm apart. 72 There was a south-westerly tidal current of about 0.5 knots.99Foot Note 99×Mt Apo’s Preliminary Act, at p 3.Both sides’ experts agree that this was not a strong current and it would not affect the ability of either vessel to take action as required by the COLREGS. However, as the tidal stream was acting on the starboard side ofMt Apo, it would have to be taken into account byMt Apoas it may affect her turning circle.100Foot Note 100×NE, 14 August 2018, at 70:2–7.In their closing submissions, neither side submitted that the tidal current had any effect on any of the actions or turning movements that were taken, or ought to have been taken.",
        "Factual narrative": "Mt Apo’s movements up to9:54 am 73 At 9:20 am,Mt Apobegan sailing out of the Eastern Special Purposes “A” Anchorage, with pilot on board. According toMt Apo’spassage plan, she was to cross the westbound lane of the TSS in the vicinity of Pilot Eastern Boarding Ground “C” (which was about 1.5 nm east of whereMt Apoeventually crossed into the westbound lane), before joining the eastbound lane of the TSS to head for Australia.101Foot Note 101×Agreed Bundle, vol 1, at p 185; PCB, at p 6.The pilot tookMt Apodown the Eastern Fairway. Before disembarking at 9:40 am (C-19), the pilot advised Capt Rajesh to followOcean Sapphire, which was directly ahead ofMt Apoand also on an eastbound journey. (As shown in the Annex,Ocean Sapphirewould eventually cross into the westbound lane in the vicinity of Pilot Eastern Boarding Ground “C” at 9:59 am.) 74 At 9:43 am,Frontier Leader, which had been travelling eastwards along the eastbound lane of the TSS, began turning to port to commence crossing the westbound lane of TSS to head into the Singapore port. She completed her turn and entered the westbound lane at 9:46 am at right angles to the general direction of the traffic flow.102Foot Note 102×Capt Rajesh’s AEIC, at para 27. 75 At 9:50 am (C-9),Mt Apowas about 0.5 nm from the northern boundary of the westbound lane of the TSS and slightly less than 1 nm fromFrontier Leader. (In this part of the TSS, the northern boundary of the westbound lane is also the northern boundary of the TSS. The terms “northern boundary of the westbound lane” and “northern boundary of the TSS” will be used interchangeably in this judgment.) Up to this point,Mt Apohad been followingOceanSapphirein turning gradually to port, with its heading changing from 140 degrees at 9:42 am to 100 degrees at 9:50 am. Capt Rajesh testified that it was at 9:50 am that he decided it was no longer possible to continue followingOcean Sapphire, asMt Apowas in a crossing situation withFrontier Leader.Mt Apohad tokeep clear ofFrontier LeadersinceMt Apowas the give-way vessel in this crossing situation.Capt Rajesh decided to maintainMt Apo’sheading.103Foot Note 103×Capt Rajesh’s AEIC, at para 28.Although this point was not mentioned in his AEIC, Capt Rajesh supplemented during cross-examination that it was also at 9:50 am that he made the decision to cross the westbound lane of the TSS.104Foot Note 104×NE, 8 May 2018, at 66:27–31.At this point,Mt Apo’sspeed was 7.8 knots and increasing.105Foot Note 105×PCB, at p 28. 76 At 9:52 am (C-7), whenFrontier Leaderwas about 0.7 nm fromMt Apo, Capt Rajesh decided to alter course to starboard to keep clear ofFrontier Leader. Immediately after giving the helm orders which resulted in a 2 degree change in course to starboard, Capt Rajesh noticed that theFrontier Leaderhad made a substantial alteration of course to starboard and decided to put the helm amidships to maintain course.106Foot Note 106×Capt Rajesh’s AEIC, at para 30; PCB, at p 30.Mt Apo’sspeed at this point was 8.5 knots, but she was beginning to slow down.107Foot Note 107×PCB, at p 30.In Capt Rajesh’s view, the crossing situation withFrontier Leaderended by 9:54 am (C-5), when theFrontier Leadercleared the bow of theMt Apo.108Foot Note 108×Capt Rajesh’s AEIC, at para 30.It was at this point thatMt Apogot into another close quarters situation with a Malaysian navy vessel,RMN 1503, which was travelling westward in the westbound lane near its northern boundary.109Foot Note 109×NE, 15 August 2018 at 15:1–4; 17:17–25. Hanjin Ras Laffan’smovements up to9:54 am 77  At the material time,Hanjin Ras Laffanwas travelling through the Singapore Strait on a westward voyage from South Korea to Qatar. Capt Kim testified thatHanjin Ras Laffanentered Sector 8 of the TSS at about 9:40 am (C-19), and duly reported to the Vessel Traffic Information Service (“VTIS”) of the Maritime and Port Authority of Singapore (“MPA”) on VHF Channel 14.110Foot Note 110×Capt Kim’s AEIC, at paras 8 and 9. 78 Capt Kim testified that it was about 9:45 am (C-14) when he first visually sightedMt Apoabout 4 nm offHanjin Ras Laffan’s starboard bow. Capt Kim stated that his additional deck officer had acquiredMt Apoon their S-band ARPA radar and reported a closest point of approach (“CPA”) of 0.2 nm and the time to CPA (“TCPA”) of 10 minutes.111Foot Note 111×Capt Kim’s AEIC, at paras 10 and 11.Hanjin Ras Laffan’s speed at this time was about 15 knots, with her engine running full ahead.112Foot Note 112×Capt Kim’s AEIC, at para 12 79Hanjin Ras Laffanthen made a number of changes in course and speed in an attempt to overtakeDalianVenture, first on the latter’s port side and then, when a change in course to port byDalian Venturemade that impractical, from its starboard side.113Foot Note 113×Capt Kim’s AEIC, at paras 13 and 14. 80 Capt Kim stated that at 9:50 am (C-9), he noted thatMt Apowas gradually turning to port. He therefore assessed thatMt Apowould not cross the TSS ahead ofHanjin Ras Laffan. Hence, at 9:52 am, he had putHanjin Ras Laffanfromfull aheadtonavigation full.114Foot Note 114×Capt Kim’s AEIC, at para 15.However, at 9:53 am (C-6), Capt Kim noticed that the CPA of theMt ApotoHanjin Ras Laffanfell to nearly zero and there was a TCPA of about five minutes.115Foot Note 115×PCB, at pp 145–146.At this point,Hanjin Ras Laffan’sspeed was 12.5 knots.116Foot Note 116×PCB, at pp 66–67. Mt Apocrossed into the westbound lane of the TSS 81 Capt Rajesh’s evidence is thatMt Apowas at the northern boundary of the westbound lane by 9:54 am.117Foot Note 117×Capt Rajesh’s AEIC, at para 31.Capt Kim’s evidence is that he observedMt Apocutting into the westbound lane between 9:53 am and 9:54 am.118Foot Note 118×Capt Kim’s AEIC, at para 16.The 2D animation prepared by Capt Ewen showsMt Apo’sbow touching the northern boundary of the westbound lane at 9:54:21 am,119Foot Note 119×NE, 11 May 2018 at 45:10–12.while that prepared by Mr Ellison showsMt Apo’s bow doing so at 9:54:42 am.120Foot Note 120×Agreed Bundle, vol 2, at Tab 98 (at p 390).Given my observations at [66] above, I consider the timing taken from Mr Ellison’s 2D animation more reliable. I therefore find thatMt Apoentered the TSS at 9:54 am (C-5), probably during VHF communication between VTIS andHanjin Ras Laffanfrom 9:54:27 am to 9:54:55 am121Foot Note 121×PCB, at pp 150–152.and before the VHF communication betweenHanjin Ras LaffanandMt Apocommenced at 9:54:57 am.122Foot Note 122×PCB, at p 152. 82Mt Apo’scrossing was done at a shallow angle of 32 degrees from the northern boundary of the TSS,123Foot Note 123×NE, 8 October 2018, at 30:1–10; 50:25.at the speed of 8 knots.124Foot Note 124×PCB, at p 32. The VHF communication at 9:55 am 83 At 9:53:28 am, VTIS calledMt Apoon the VHF radio to advise her to keep a lookout for three more westbound vessels coming on her port side.125Foot Note 125×PCB, at p 147.Mt Aporeplied with “Ok, thank you ma’am”, to which VTIS responded with “Please keep good lookout sir, and you cross safely”.126Foot Note 126×PCB, at p 148.At 9:54:27 am, VTIS calledHanjin Ras Laffanto inform her thatMt Apowas going eastbound and 1.4 nm away from her, and also to adviseHanjin Ras Laffanto keep a lookout forMt Apo.127Foot Note 127×PCB, at p 151.Capt Kim acknowledged VTIS’ call. He also asked VTIS whatMt Apo’s intentions were, and indicated that he wanted a green-to-green (starboard-to-starboard) passing withMt Apo. In response, VTIS asked Capt Kim to contactMt Apodirectly.128Foot Note 128×PCB, at p 152.This conversation ended at 9:54:55 am. 84 Within a couple of seconds after the conversation between VTIS andHanjin Ras Laffan,Capt Rajesh orderedstop engine.129Foot Note 129×PCB, at p 152.Capt Rajesh explained in his AEIC that he did so because it did not appear that theHanjin Ras Laffanwas going to give way.130Foot Note 130×Capt Rajesh’s AEIC, at para 33.Two seconds after Capt Rajesh ordered stop engine, theHanjin Ras LaffancalledMt Apoon the VHF, as suggested by VTIS. The OOW ofMt Apo, who was also the third officer,responded toHanjin Ras Laffan’scall on behalf ofMt Apo.The conversation, which I shall refer to as the “9:55 Conversation”, would become a key focus of parties’ submissions. The 9:55 Conversation went as follows:131Foot Note 131×PCB, at pp 153–154. Hanjin Ras Laffan:Mount Apo.Mount Apo. This isHanjin Ras Laffan. Mt Apo (OOW):   Yes,Mount Apo, go ahead. Hanjin Ras Laffan:  This isHanjin Ras Laffan, what is your intention? Green-to-green, green-to-green. Mt Apo (OOW):   We are now stopped our engine already. Hanjin Ras Laffan:   Are you, are you stopped now, the engine? Mt Apo (OOW):   Yes sir. Stopped engine to make you pass our bow. Hanjin Ras Laffan:   Oh very dangerous sir! 85 The phrase “make you pass our bow” inMt Apo’s reply was transcribed as “[inaudible dialogue]” in the transcript provided by Mt Apo132Foot Note 132×PCB, at pp 154–155.and as “make you passing our bow” in the transcript provided by Hanjin Ras Laffan.133Foot Note 133×Captain Bruce Gordon Ewen’s (“Capt Ewen”) 1st AEIC, dated 27 March 2018, at p 76.Mr Leong suggested during his opening statement that the words were “make you pass our bow”.134Foot Note 134×NE, 8 May 2018, at 44:11–20I have heard the recording of the VHF conversation myself and found this part of the recording to be not inaudible at all.135Foot Note 135×Agreed Bundle, vol 1, at Tab 72 (VHF Recordings from MPA).I could clearly make out the words “make you pass our bow”. 86 There are three other points to highlight: (a) WhenHanjin Ras Laffansaid “green-to-green, green-to-green” over the VHF, Capt Rajesh could be heard in the background saying “starboard-to-starboard” to the OOW.136Foot Note 136×PCB, at p 153, timestamp 9:55:06.At first blush, it appeared to me that this was an order by Capt Rajesh to the OOW that the two vessels should pass “starboard-to-starboard”. However, Capt Rajesh explained in cross-examination that he was merely asking whether, by “green-to-green”,Hanjin Ras Laffanmeant to say “starboard-to-starboard”.137Foot Note 137×NE, 11 May 2018, at 61:30–61:1. (b) WhenHanjin Ras Laffanasked “are you stopped now, the engine?”, Capt Rajesh could be heard saying “yes” in the background.138Foot Note 138×PCB, at p 154, timestamp 9:55:17.This appears to me to be a direction or guidance from Capt Rajesh to the OOW to reply “yes” toHanjin Ras Laffan’squestion. (c) The 9:55 Conversation lasted a total of 27 seconds. Events after the 9:55 Conversation 87 The 9:55 Conversation ended at 9:55:24 am. By then, it was less than four minutes before the collision. The distance between the two vessels had closed to less than 1.2 nm.139Foot Note 139×Agreed Bundle, vol 3, at p 568.Mt Apo, having stopped its engine, had slowed down to 7.8 knots,140Foot Note 140×PCB, at p 33.whileHanjin Ras Laffanhad slowed down to 12.0 knots.141Foot Note 141×PCB, at p 67.Both sides’ experts agreed that, at this point, there were still sufficient time and sufficient sea room for both vessels to avoid a collision.142Foot Note 142×Captain John Nicholas Duncan Simpson’s (“Capt Simpson”) Supplementary AEIC, dated 27 July 2018, at p 27, para 2.8.3; NE, 16 August 2018, at 69:18–27. 88After the 9:55 Conversation, both vessels continued reducing their respective speeds incrementally.Hanjin Ras Laffanmade a number of minor course adjustments to port. Capt Kim explained that this was to follow behindDalian Ventureand give more space toMt Apo.143Foot Note 143×NE, 11 May 2018, at 18:26–30; 19:26–30.Mt Apoalso altered its heading slightly to starboard. Capt Rajesh explained that this was in order to maintainMt Apo’scourse in the light of the south-westerly current.144Foot Note 144×NE, 8 May 2018, at 84:13–18. 89 At 9:57 am (C-2),Mt ApocalledHanjin Ras Laffanand requested a port-to-port passing. This request was rejected byHanjin RasLaffan, and the conversation ended in a mutual agreement to go green-to-green.145Foot Note 145×PCB, at pp 161–166.Unlike the earlier conversation which lasted only 27 seconds, this second conversation lasted almost a full minute (from 9:57:03 am to 9:57:59 am). While the second VHF conversation was taking place, Capt Kim movedHanjin Ras Laffan’sengine fromslowtodead slowand altered course to port in an effort to avert collision with theMt Apo.146Foot Note 146×Capt Kim’s AEIC, at para 20.By the time the second VHF conversation ended, it was one minute and 16 seconds before the collision, and the vessels were 0.3 nm apart.Mt Apo’sspeed had come down to 6.6 knots,147Foot Note 147×PCB, at p 35.whileHanjin Ras Laffanhad reduced its speed to 9.8 knots.148Foot Note 148×PCB, at p 69. 90 Capt Rajesh observed thatHanjin Ras Laffan’salteration of course to port had caused her stern to swing towardsMt Apo.He thus ordered hard to port shortly before 9:58 am (C-1) to try to avoidHanjin Ras Laffan.149Foot Note 149×Capt Rajesh’s AEIC, at para 34.Capt Rajesh stated in his AEIC that he gaveseveralastern orders from 9:58 am to 9:59 am to arrestMt Apo’s forward momentum. However, the VDR records show that Capt Rajesh only gave two astern orders during this period. The first time was when the Chief Officer advised Capt Rajesh: “Captain we have to run astern”, in response to which Capt Rajesh ordered “put astern” at 9:58:06 am.150Foot Note 150×Capt Ewen’s 1st AEIC, at p 171 (Appendix G, at p 5).This resulted in the engine telegraph being put first to dead slow astern, then to slow astern and then to half astern.151Foot Note 151×PCB, at pp 166–168.The second order was given when the Chief Officer reported to VTIS thatMt Apowas running at half astern. Upon hearing this, Capt Rajesh orderedfull astern.152Foot Note 152×PCB, at p 168.A mere ten seconds later, Capt Rajesh orderedstop engine.153Foot Note 153×PCB, at 169; Capt Ewen’s 1st AEIC, at p 172 (Appendix G, at p 6).The fact that Capt Rajesh ordered “put astern” only after he was reminded by the Chief Officer to do so was captured only in the transcripts provided by Hanjin Ras Laffanand not in the transcripts provided by Mt Apo. I raised this with parties during oral submission.154Foot Note 154×NE, 8 October 2018, at 28:11–25; 76:20–25.Mr Chan told me that his team tried listening to the recording again but did not hear these remarks while Mr Leong told me that Capt Ewen picked up the remarks by listening to the recording with headphones. I listened to the recording myself and confirmed that Capt Ewen was correct. The collision 91 At 9:58:57 am (ie,roughly 20 seconds before the collision),Mt ApocalledHanjin Ras Laffanon VHF again to request thatHanjin Ras Laffango hard to starboard in order to swing her stern away from theMt Apoto minimise collision impact.155Foot Note 155×PCB, at p 170Capt Kim’s testimony is that he had indeed done so before the collision.156Foot Note 156×Capt Kim’s AEIC, at para 22.However, the VDR voice recording did not record any verbal orders from Capt Kim to this effect.157Foot Note 157×PCB, at p 171.In fact, VDR records show thatHanjin Ras Laffan’srudder was not put to starboard untilafterthe collision.158Foot Note 158×PCB, at p 70. 92 The collision occurred at 9:59:15 am, withMt Apo’sstarboard bow impacting the starboard quarter ofHanjin Ras Laffan. The location of the collision was at Latitude 01° 14.8’ N, Longitude 103° 57.7’ E, which was within Singapore territorial waters, about 3.9 nm from the Singapore coast. 93 In the unlikely event that there remains any doubt today on whether the breadth of Singapore’s territorial sea is 3 nm or 12 nm, it may be useful to highlight that any uncertainty arising from the decision inTrade Resolve[1999] 2 SLR(R) 107 at [32]–[33] has been put to rest by Government Gazette Notification No 1485 – “Singapore Maritime Zones” dated 28 May 2008, which provides: It is hereby notified for general information as follows: As indicated in the Ministry of Foreign Affairs Press Statement dated 15th September 1980,Singaporehasa territorial sea limit that extends up to a maximum of 12 nautical milesand an Exclusive Economic Zone. … [Emphasis added.] InThe Fagernes[1927] 1 P 311, the English Court of Appeal took judicial notice of the UK government’s statement on the limits of British territorial waters and treated that statement as conclusive. By the same token, in the light of Government Gazette Notification No 1485, the breadth of Singapore’s territorial sea is 12 nm, not 3 nm. COLREGS, fault and approach for apportionment of liability 94 As neither side contends that the other is solely to blame for the collision, the central issue to be determined in the present case is the apportionment of liability. In this regard, s 1 of the Maritime Conventions Act 1911 (Cap IA3, 2004 Rev Ed) (“Maritime Conventions Act”) provides: 1.—(1) Where, by the fault of two or more ships, damage or loss is caused to one or more of those ships, to their cargoes or freight, or to any property on board, the liability to make good the damage or loss shall be in proportion to the degree in which each ship was in fault, except that if, having regard to all the circumstances of the case, it is not possible to establish different degrees of fault, the liability shall be apportioned equally. (2)  Nothing in this section shall operate so as to render any ship liable for any loss or damage to which her fault has not contributed. 95 Thus the apportionment of liability depends on fault, and s 1(2) of the Maritime Conventions Act makes clear that only causative fault is relevant. Useful guidance on the approach to apportionment of liability is to be found in the following passage fromThe “Nordlake” and The “Seaeagle” [2016] 1 Lloyd’s Rep 656 (“TheNordlake”) which was cited with approval inThe Dream Star[2018] 4 SLR 473 (at [126]): 148 InThe Samco Europe and MSC Prestige[2011] 2 Lloyd’s Rep 579 the court summarised the task of apportionment of liability in this way: “81Apportionment of responsibility for a collision depends upon an assessment of the blameworthiness and causative potency of both vessels: seeThe British Aviator[1965] 1 Lloyd’s Rep 271 at page 277 per Willmer LJ.The assessment is of the relative degree of responsibility of each vessel: seeThe Mineral Dampier[2001] 2 Lloyd’s Rep 419 at para 39. For that reason Admiralty judges often consider, where one ship is more to blame than the other, how many more times to blame one vessel is than the other… 149 … In his article Sir Henry Brandon describedthe proposition that both culpability and causative potency must be taken into account as the‘true principle of law applicable’(see page 1031 and 1032). Whilst there were no universal rules with regard to the assessment of culpability or causative potency he identified (‘on the basis of practical experience of apportionment in numerous cases over many years’) certain broad lines of approach which can be used when apportioning liability (see pages 1037 to 1041). They may be summarised as follows: (i) The number of faults on one side or the other is not decisive.It is the nature and quality of a ship’s faults, rather than their number, that matter. (ii) Breaches of the obligations imposed on ships in certain defined situations by the Collision Regulations will usually be regarded as seriously culpable… (iii) Causative potency has two aspects. The first is the extent to which the fault contributed to the fact that the collision occurred. The second is the extent to which the fault contributed to the damage resulting from the casualty. (iv) In most cases though not allit will be right to treat the fault of a ship that creates a situation of difficulty or danger as greater than that of the ship that fails to react properly to such situation after it has been created. (v) The fact that a fault consists of a deliberate act or omission may in certain circumstances justify the court in treating it as more culpable than a fault which consists of omission only. 150 The court deals with questions of apportionment in a fairly broad way (or as it was put inThe Volute[1922] 1 AC 129 at page 144: ‘somewhat broadly and on common sense principles’) … [Emphasis added in bold.] 96 Thus the apportionment of liability involves a broad, commonsensical and qualitative assessment of theculpabilityandcausative potencyof both vessels. 97 As noted by Belinda Ang Saw Ean J inThe Dream Star(at [47]–[49]): (a) Fault refers to a breach of duty of care that caused or contributed to the collision and damage. (b) For navigational faults, the standard of care applicable is the exercise of “good seamanship”, which is tantamount to the exercise of reasonable skill or care expected of a competent/prudent seaman to prevent the vessel from doing injury. (c) The duty of good seamanship requires the crew of a vessel to observe the COLREGS or local regulations. (d) The object of the COLREGS is to prevent collisions and to minimise their effect. The COLREGS are made not merely for the sake of the vessel which has to observe them but for the sake of other vessels which may be approaching or manoeuvring at close quarters, and which have every right and reason to suppose that the COLREGS will be observed, and none to suppose they will be broken. (e) The mere fact that the rules in COLREGS have been broken or that the vessels have not been navigated in a seamanlike manner does notipso factogive rise to a finding of fault on the part of the breaching party. To give rise to a finding of fault, the breach must have caused or contributed to the collision and damage.",
        "Analysis": "98 In analysing whether acts and omissions of the two vessels should give rise to findings of fault, I was assisted by the evidence of two navigation experts.",
        "Evidence of expert witnesses": "99 The expert witness for Hanjin Ras Laffan was Capt Ewen while the navigation expert witness for Mt Apo was Captain John Nicholas Duncan Simpson (“Capt Simpson”). Both are master mariners with extensive nautical experience as well as extensive experience as consultants and expert witnesses.159Foot Note 159×Capt Ewen’s 1st AEIC, at p 125 (Appendix A, at p 3); Capt Simpson’s 1st AEIC, dated 9 April 2018, at pp 57–59.In particular, Capt Ewen spent 15 years commanding oil tankers of various sizes while Capt Simpson spent 11 years as a pilot in the busy Humber pilotage district of the UK. Capt Ewen has been practising as a consultant and expert in Singapore since 1999, while Capt Simpson has been practising as a consultant and expert for 15 years in the UK and Hong Kong. 100 The trial was conducted in two tranches, with factual evidence heard in the first tranche and expert evidence in the second tranche. Between the two tranches, the experts were directed to hold a joint conference and then prepare a joint report setting out their areas of agreement and disagreement. Thereafter, the experts were to each file a supplementary report to comment on the areas of disagreement. The joint report listed two areas of agreement and 11 areas of disagreement.160Foot Note 160×Agreed Bundle, vol 3, at p 569–572.As the two areas of agreement were only on technical definitions of the navigational terms used in the experts’ reports, the joint report in fact contained no substantive areas of agreement. During the second tranche of the trial, the experts testified concurrently, in a process commonly referred to as “hot-tubbing”.",
        "Evidence of factual witnesses": "101 As is apparent from the factual narrative, there were aspects of both Capt Rajesh’s testimony and Capt Kim’s testimony which were inconsistent with the documentary records. Where this occurs, I will prefer the documentary records over either master’s testimony. Some of the explanations proffered by the two masters also do not appear to make sense when viewed in the light of the objective facts. In such instances, I will give less weight to their explanations.",
        "Structure of the analysis": "102 Having regard to how the experts’ evidence unfolded and also to the content of the parties’ submissions, I will examine the issues in dispute in the following order: (a) WhetherMt Apowas at fault for crossing the TSS at the time and in the manner she did. (b) WhetherMt ApoandHanjin Ras Laffanwere in a crossing situation and, if so, when did the crossing situation arise. (c) WhetherHanjin Ras Laffanwas at fault for the way she navigated prior to the 9:55 Conversation. (d) WhetherHanjin Ras Laffanwas at fault for initiating the 9:55 Conversation. (e) WhetherMt ApoandHanjin Ras Laffantook proper avoidance actions after 9:55 am. 103 I have not included proper lookout among the foregoing list of issues as it is my view that neither vessel had breached their obligations to keep a proper lookout.",
        "WhetherMt Apowas at fault for crossing the TSS at the time and in the manner she did": "104 The question whetherMt Apowas at fault for crossing the TSS at the time and in the manner she did gives rise to two sub-issues. First, whether it was safe forMt Apoto cross the TSS at the time Capt Rajesh made the decision to cross. Secondly, whetherMt Apowas at fault to cross the TSS at the shallow angle of 32 degrees. Whether it was safe forMt Apoto cross the TSS at the time Capt Rajesh made the decision to cross 105 Since Capt Rajesh claimed he decided to cease followingOcean Sapphireand to cross into the TSS becauseMt Apowas in a crossing situation withFrontier Leader, it will be useful to set out Rules 15, 16 & 17 of the COLREGS which deal with crossing situations: Rule 15 Crossing Situation When two power-driven vessels are crossing so as to involve risk of collision, the vessel which has the other on her own starboard side shall keep out of the way and shall, if the circumstances of the case admit, avoid crossing ahead of the other vessel.  Rule 16 Action by Give-way Vessel Every vessel which is directed to keep out of the way of another vessel shall, so far as possible, take early and substantial action to keep well clear.  Rule 17 Action by Stand-on Vessel (a) (i) Where one of two vessels is to keep out of the way the other shall keep her course and speed. (ii) The latter vessel may however take action to avoid collision by her manoeuvre alone, as soon as it becomes apparent to her that the vessel required to keep out of the way is not taking appropriate action in compliance with these Rules. (b)  When, from any cause, the vessel required to keep her course and speed finds herself so close that collision cannot be avoided by the action of the give-way vessel alone, she shall take such action as will best aid to avoid collision. (c)  A power-driven vessel which takes action in a crossing situation in accordance with sub-paragraph (a)(ii) to avoid collision with another power-driven vessel shall, if the circumstances of the case admit, not alter course to port for a vessel on her own port side. (d)  This Rule does not relieve the give-way vessel of her obligation to keep out of the way. 106 Rule 15 of the COLREGS provides that, in a crossing situation “the vessel which has the other on her own starboard side shall keep out of the way and shall, if the circumstances of the case admit, avoid crossing ahead of the other vessel”. In the situation betweenMt ApoandFrontier Leader,Mt Apowas required to keep out ofFrontier Leader’swayasFrontier Leaderwas on the starboard side ofMt Apo–ie, Mt Apowas the “give-way vessel” whileFrontier Leaderwas the “stand-on vessel”. 107 Since Hanjin Ras Laffan submits that Capt Rajesh’s decision to cross was unsafe, it is useful to set out Rule 10(c) of the COLREGS, which concerns vessels crossing traffic lanes in a TSS: Traffic Separation Schemes … (c) A vessel shall so far as practicable avoid crossing traffic lanes, but if obliged to do so shall cross on a heading as nearly as practicable at right angles to the general direction of traffic flow. … 108 It was held by Clarke J inThe “Century Dawn” and “Asian Energy”[1994] 1 Lloyd’s Rep 138 (“The Century Dawn(HC)”) that Rule 10(c) was designed to ensure that “the separation lanes should be left clear for vessels proceeding the correct way along them except to the extent that it is necessary for others to cross them or enter them”, and that “no attempt should be made to cross either lane in a traffic separation scheme unless it is safe to do so” (at 150–151). Clarke J’s holdings were upheld on appeal inThe “Century Dawn” and “Asian Energy”[1996] 1 Lloyd’s Rep 125 (“The Century Dawn(CA)”). In the English Court of Appeal, Hirst LJ added that the question whether it was safe for a vessel to cross should be answered by reference to the conditions prevailing at the time the decision to cross was made and not the conditions prevailing at the time when the vessel entered the TSS (at 132). 109 Capt Ewen’s opinion is thatMt Apowas not obliged to cross and it was unsafe for her to have done so.161Foot Note 161×Agreed Bundle, vol 3, at p 571, para 9.He explained that the decision to cross was unsafe because attempting to cross ahead of several westbound vessels carries unacceptable risks.162Foot Note 162×Capt Ewen’s Supplementary AEIC, dated 25 July 2018, at p 28, para 2.9(vii). 110 Capt Ewen’s view that it would be risky to cross when there were several vessels approaching in the TSS was echoed by Capt Rajesh, who testified in his AEIC that it “did not seem to be prudent” to cross at 9:46 am “when there were several vessels approaching in the westbound lane at that point in time”.163Foot Note 163×Capt Rajesh’s AEIC, at para 27.Picking up on Capt Rajesh’s evidence concerning the situation at 9:46 am, counsel for Hanjin Ras Laffan, Mr Leong asked Capt Rajesh whether the same conditions and considerations continued to prevail four minutes later at 9:50 am, in the following exchange:164Foot Note 164×NE, 8 May 2018, at 81:3–7. Q  Of course not. Right? Because at 9.46, you already said that it would not [be] prudent to cross. So, same, 9.50 also not prudent to cross? A  Correct. Q  Do you agree? A  Correct. Thus,Capt Rajesh admits that it was not prudent to cross the TSS at 9:50 am, for the same reason he gave for considering it imprudent to cross at 9:46 am. 111 To assist the court in further appreciating the imprudence of Capt Rajesh’s decision at 9:50 am to cross, Hanjin Ras Laffan suggested a number of safer options which Capt Rajesh could have pursued. Although Capt Rajesh disagreed with a number of the options suggested to him during cross-examination, he agreed with one of them in the following exchange:165Foot Note 165×NE, 8 May 2018, at 79:32–80:6. Q  So anyway, I would say that it is possible for you, right, at this point, okay, to join the westbound lane in the shallow angle, and then go down on the westbound lane and then, at the safe opportunity, make a turn back onto the eastbound lane. That is also an option available to you? A  Yes. Q  Do you agree? A  Yes. Thus Capt Rajesh agreed that, instead of crossing the westbound lane at that point to immediately join the eastbound lane, an option available to him was to join the westbound lane, travel westwards together with the oncoming westbound traffic, and then make a U-turn into the eastbound lane when it was safe to do so. 112 In Capt Ewen’s opinion, this was an option. He had used such an option himself before in the Red Sea. While he did not thinkMt Apo’s situation required it, he would have had that option in his quiver.166Foot Note 166×NE, 15 August 2018, at 91:8–18.Capt Ewen did not elaborate on why he thoughtMt Apodid not require pursuit of that option. In my view, this was because Capt Ewen’s primary recommendation had all along been forMt Apoto reduce speed and avoid crossing if possible. 113 Capt Simpson’s comment on this option was:167Foot Note 167×Capt Simpson’s Supplementary AEIC, at p 29. 2.9.6.  A final option was suggested to the master of ‘MA’ during his evidence, which was that of making a very large alteration of course to starboard, requiring the use of hard to starboard rudder, to enter the west bound lane at a shallow angle, as required by Rule 10(b)(iii). It would then be necessary to turn to port to make a ‘U’ turn at some undeterminable later stage in the TSS when circumstances finally became favourable. As ‘MA’ was in a situation where there was significant activity at 09:50, not least with ‘FL’ approaching from the south and ‘RMN 1503’ from the east, and with little indication of what manoeuvres were going to be undertaken, a bold alteration of course to starboard by ‘MA’ would certainly have caused some confusion,particularly from a vessel that was expected to be standing-on in a crossing situation in compliance with Rule 17(a)(i). 2.9.7.  In my opinion, it was not necessary to consider making a lengthy detour from the vessel’s route which would unnecessarily prolong the time that ‘MA’ had to navigate within the TSS.When the master of ‘MA’ made the decision not to continue following ‘OS’ due to the traffic situation he could not have anticipated that a transiting vessel would not comply with his obligations under the COLREGS and fail to take action as a give-way vessel. [Emphasis added.] 114 I have two difficulties with Capt Simpson’s explanation. The first is Capt Simpson’s suggestion that a bold turn to starboard byMt Apoin order to join the westbound lane is somehow inconsistent withMt Apo’sobligations as a stand-on vessel in a crossing situation with the westbound vessels. The reference to Rule 17(a)(i) in the foregoing passage is a reference to the obligation of a stand-on vessel to “keep her course and speed”. In my view Capt Simpson’s suggestion does not accord with logic and good sense. 115 If Capt Simpson were right that a vessel inMt Apo’ssituation at 9:50 am could not legally make a starboard turn to join the westbound lane, it would mean that all vessels leaving the port of Singapore to commence a westward journey along the very busy Singapore Strait will never be able to join the westbound lane of the TSS without breaching Rule 17(a)(ii), unless the westbound lane happened to be devoid of traffic. This is because every vessel leaving the port of Singapore on a westward voyage would necessarily be approaching the TSS from the north, tracking a southerly course, with the westbound traffic coming towards her from her port side. In other words, every vessel leaving Singapore on a westward journey would, prior to joining the TSS, be in the same “stand-on” situation in relation to westbound vessel as that whichMt Apofound herself in. Capt Simpson’s suggestion will lead to the absurd conclusion that a vessel coming out of the port of Singapore may join the westbound laneonlywhen there are absolutely no other westbound vessels coming down her port side along the westbound lane. 116 In my view, Capt Simpson’s suggestion is based on a misapprehension of a stand-on vessel’s duty to keep her course and speed.  The limits of this duty was explained by Scrutton LJ inThe Taunton(1928) 31 Ll. L. Rep. 119 (at 120), in this manner: The decisions of this Court have thrown a light on [this] rule which perhaps one would not derive from the rule if one did not know anything about the decisions, because they have said thatwhen the rule talks about keeping course and speed it means the course you were going to take for the object you had in view-not the courseand speed you had at any particular moment. So you keep your speed although you stop and you keep your course although you alter it 16 points. You keep your course if you are going round the bend of a river although you are altering it to follow the bend. You keep your speed though you stop to pick up a pilot. It follows that if you are crossing the tide your course is to keep diverging; and therefore, according to the authorities, you are keeping your course although you are continually porting. [Emphasis added.] Similarly, it was held inThe Topaz and Irapua[2003] 2 Lloyd’s Rep 19 (at [37]) that: As is well established, r. 17(a)(i), is subject to the qualification that the obligation of the stand-on vessel to “keep her course and speed”does not preclude, broadly and neutrally,alterations of course and speed in the ordinary course of navigation. In short, the “course and speed” are the course and speed that the stand-on vesselwas going to take for the object she had in view,not the course and speed at any particular moment… [Emphasis added.] Summarising the authorities, the authors ofMarsden and Gault on Collisions at Sea(Sweet & Maxwell, 14th Ed, 2016) (“Marsden”) conclude (at para 5–403): … Rule 17 does not require the stand-on vessel must maintain either a constant heading or a constant speed. A vessel reducing speed to pick up a pilot, a vessel (with her engines put to full speed) which was increasing her speed up to full speed, a vessel which was continually altering her heading across a tide, a vessel reducing her speed to run off her way to maintain her course preparatory to anchoring and a tug manoeuvring to pick up her tow, have been held not in breach of this rule. [Emphasis added.] 117 Thus the authorities make clear that a stand-on vessel isnotrequired by Rule 17(a)(i) to maintain either a constant heading or a constant speed. The obligation under Rule 17(a)(i) for a stand-on vessel to “keep her course and speed” refers to the course and speed which the vessel was going to take for the object she had in view, not the course and speed at any particular moment. In other words, Rule 17(a)(i) doesnotpreclude alterations of course and speed in the ordinary course of navigation. 118 During the hot-tubbing session, I put the position outlined at [117] above to the experts in the context of the issues discussed at [134]–[136] below.168Foot Note 168×NE, 15 August 2018, at 119:12–15.Capt Ewen agreed, explaining that “it’s been accepted by Courts in the past [that a stand-on vessel] may use normal navigation”.169Foot Note 169×NE, 15 August 2018, at 119:16–21.Capt Simpson, on the other hand, was evasive and did not give me a direct answer.170Foot Note 170×NE, 15 August 2018, at 119:24–121:9. 119 From the foregoing discussion, it is apparent that Capt Simpson arrived at the opinion he did because he failed to distinguish between alterations of course and speed by a stand-on vesselto avoid collision(which is precluded by Rule 17(a)(i)) and alteration of course and speed by a stand-on vesselin the ordinary course of navigationfor the object she had in view(which is not precluded by Rule 17(a)(i)). For these reasons, I cannot accept Capt Simpson’s suggestion as outlined at [114] above. 120 My second difficulty is with Capt Simpson’s point that, when Capt Rajesh made his decision at 9:50 am, he “could not have anticipated that a transiting vessel would not comply with his obligations under the COLREGS and fail to take action as a give-way vessel”.  At best, Capt Simpson’s point was an explanation that Capt Rajesh should not be faulted for failing to anticipate thatHanjin Ras Laffanwas going to ignore her obligations under COLREGS. It is not an explanation for why the option suggested by Mr Leong was unsafe or unworkable. I therefore conclude that there were no valid objections from Capt Simpson to the suggested option. 121 There was no attempt in Capt Simpson’s evidence or Mt Apo’s submissions to explain why the decision at 9:50 am to cross was asafedecision. Capt Simpson’s evidence and Mt Apo’s submissions were focused only on explaining why the various “safer options” suggested by Hanjin Ras Laffan were either allegedly impractical or not actually safer. Much was made by Capt Simpson and Mt Apo about the presence ofFrontier LeaderandRMN 1503causing the options available toMt Apoto be “severely restricted” and that Capt Rajesh was proceeding under “very difficult circumstances”.171Foot Note 171×Capt Simpson’s 1st AEIC, at p 39 (at para 4.3.26); Capt Simpson’s Supplementary AEIC, at p 29 (at para 2.10.2).In my view, the approach taken in Capt Simpson’s evidence and Mt Apo’s submission misses the point. One might ask, if Capt Rajesh’s decision to cross was unsafe and if there were also no other safe options available, then was it good seamanship for Capt Rajesh to have allowed himself to get into a position where there were no safe options for him to take? Could he have done something prior to 9:50 am in anticipation of this situation to avoid getting into such a bind? Indeed, Capt Rajesh testified that he noticedFrontier Leadercrossing the traffic separation zone into the westbound lane at 9:46 am.172Foot Note 172×Capt Rajesh’s AEIC, at para 27.In my view, it would have been within Capt Rajesh’s power to take appropriate action between 9:46 am and 9:50 am to avoidMt Apobeing put in a position where she had no safe options to pursue. 122 Having said that, I do not agree with Mt Apo that there were no safer options. One available option, as noted at [111] above, was forMt Apoto first go westwards and then U-turn into the eastbound lane later when it is safe to do so.Capt Rajesh agreed that this could be done. Capt Ewen agreed that it would have been an option in his quiver. As noted above, Capt Simpson proffered no valid reasons why the option could not be pursued. 123 The other option was forMt Apoto reduce its speed to give more time for the situation withFrontier Leaderto develop. Capt Rajesh accepted that this could and should have been done.173Foot Note 173×NE, 8 May 2018, at 77:1–12.Indeed, doing so would have been consistent with Rule 6 of the COLREGS, which provides: Rule 6 Safe Speed Every vessel shall at all times proceed at a safe speed so that she can take proper and effective action to avoid collision andbe stopped within a distance appropriate to the prevailing circumstances and conditions. … [Emphasis added.] In my view, this was a logical option. Reduction of speed would have provided more reaction time forMt Apoto make decisions and react to the unfolding situation. Doing so would also be consistent with the requirement of good seamanship, as elaborated at [131] below, toedge upto the boundary of the TSS when crossing traffic lanes and tocross at a safe speed. As noted by Capt Ewen:174Foot Note 174×NE, 15 August 2018, at 30:8–11. [Capt Rajesh] should have had contingency plans. He should have known if his---“If I can’t go across, what do I do? If I can’t do this, what else do I do?” That---that’s part of passage planning. Evidently, Capt Rajesh had no such plans. 124 In the final analysis, the inquiry into whether it was unsafe to cross must centre on what the traffic condition was in the TSS, and not on whether the vessel intending to cross had other options. An unsafe crossing does not become safe merely because there were no other options open to the vessel at the time. While lack of safer options may affect culpability, it cannot be a reason for re-characterising an objectively unsafe crossing as safe. 125 For the above reasons, and having regard in particular to Capt Rajesh’s admission that it was not prudent to cross at 9:50 am and his agreement with at least two of the options suggested by Mr Leong, I find that it was not safe for Capt Rajesh to have decided at 9:50 am to cross the TSS. WhetherMt Apowasat fault to cross the TSS at the shallow angle of 32 degrees 126 Hanjin Ras Laffan submits that, by crossing the TSS at a shallow angle of 32 degrees from the northern boundary of the TSS, Mt Apo had breached the requirement of Rule 10(c) to “cross on a heading as nearly as practicable at right angles to the general direction of traffic flow.” 127 As a preliminary point, it is not disputed that Rule 10(c) is applicable to vessels crossing only one lane of a TSS to join the other lane, and not only confined to vessels crossing the entire TSS to reach the opposite coast. It was held inCentury Dawn(HC) (at 151) that the “obligation in r. 10(c) applies to vessels crossing any traffic lane whether the purpose of crossing it is to cross the next lane or to join it”. 128 Incidentally,Century Dawnalso concerned a collision in the TSS of the Singapore Strait, at roughly the same location as the collision in the present case. After stating that a crossing at right angles would require a course of 157 degrees, Clarke J held that (at 150): …Century Dawnwas at fault in crossing the westbound lane on a course of 110 deg. or 100 deg. I further hold that she would also have been at fault if she had crossed the lane on a course of 120 deg. For context, if a crossing at 90 degrees requires a course of 157 degrees, a course of 120 degrees would give rise to a crossing at an angle of 53 degrees from the boundary of the TSS. If a vessel is at fault for crossing at an angle of 53 degrees, thena fortiorithe even shallower angle of 32 degrees adopted byMt Apo. 129 As explained inMarsden(at paras 5–328 to 5–329): A crossing angle of 90 degrees is prescribed with the aim of minimising the time a crossing vessel spends in a traffic lane, and so the number of potential encounters with through vessels, irrespective of the conditions of the sea and vessel. The original intention appears to have been that this was, “as nearly as practicable”, to be the course steered so that the crossing vessel could also display the maximum possible side aspect to through vessels, which could thus more easily recognise her as a crossing vessel and thereby receive notice that the 1972 Colregs crossing rule (r.15) was likely to apply. The 1987 amendments added the words “on a heading” to make this clear, as some courts had instead required crossing vessels to seek to make good a crossing at 90 degrees to the general direction of traffic flow. Crossing at another angle has been held at first instance to be a “vice” against the aim of the rules and a serious breach. The correct interpretation of para.(c) would appear to be that a master should always seek to follow a heading at 90 degrees to the general direction of traffic flow, except where the safety of navigation requires otherwise, or for any other good reason, including compliance with rr.15 and 17. Good seamanship would also appear to require him to line his ship up very early, to edge up to the boundary of the traffic lane, maintaining the correct broad angle, and then to cross it at a safe speed, when it is clear, even if this adds to the length of the passage. 130 It is also explained in Craig H. Allen,Farwell’s Rules of the Nautical Road(8th Ed, Naval Institute Press) (at p 329) that: Crossing at right angles reduces potential confusion to other vessels regarding the crossing vessel’s intentions and minimizes the time the crossing vessel spends in the TSS. A protracted debate over vessels crossing the TSS led to an amendment to Rule 10(c) to make it clear that vessels shall cross on a heading (not a course over the ground) as near possible at right angles to the direction of traffic flow. Although this might cause some extra work for enforcement authorities who measure the course over the ground on their shore-based radar, the revised rule clarifies matters for mariners. Beyond the bare requirements of Rule 10(c), vessels crossing a TSS are also bound to follow all other rules, especially Rule 6. Moreover, compliance with Rule 10(c) and other rules does not relieve a vessel of the duty to exercise precautions required by the ordinary practice of seamen and the special circumstances associated with the TSS. 131 Thus crossing at right angles minimises the distance and hence the time needed for the crossing vessel to complete the crossing. This conduces towards a safe crossing by minimising the number of potential encounters with vessels using the TSS. Crossing at right angles also reduces potential confusion to other vessels regarding the crossing vessel’s intention. By displaying the crossing vessel’s maximum side aspect, vessels using the TSS will more easily recognise her as a crossing vessel and thereby receive early notice that the crossing rules of the COLREGS (Rules 15, 16 and 17) were likely to apply. Therefore, a mastershouldalwaysseek to follow a heading at 90 degrees to the general direction of traffic flow, except where the safety of navigation requires otherwise, or for other good reasons. It would also be a requirement of good seamanship for a master to line his ship up very early, to edge up to the boundary of the traffic lane, maintaining the correct broad angle, and then to cross it at a safe speed, when it is clear, even if this adds to the length of the passage. 132 When Capt Rajesh was asked during cross-examination about lining upMt Apofor a right-angle crossing, he replied that turning to starboard to effect a right-angle crossing would putMt Apodirectly into the path of the general direction of the traffic.175Foot Note 175×NE, 8 May 2018 at 68:10–12.The logic of Capt Rajesh’s answer escapes me. At the material time, crossingat any anglewould have putMt Apoin the path of oncoming traffic. In my view, he would have to negotiate this risk irrespective of whether the crossing was done at 90 degrees or 32 degrees. Once a decision is made at 9:50 am to cross the TSS, I fail to see how, in the light of the various considerations outlined at [131] above, a crossing at 32 degrees would be safer than a crossing at 90 degrees. 133 As was apparent from the Annex to this judgment, a crossing at 32 degrees would double the distance whichMt Aponeeded to cover inside the westbound lane as compared to a crossing at 90 degrees, and consequently double the amount of timeMt Apowould be spending in the westbound lane in the path of oncoming traffic. In fact, while Capt Ewen thought the decision to cross at 9:50 am was imprudent, he also thought that the crossing could be negotiated successfullyat right angles“by manipulating the speed”.176Foot Note 176×NE, 14 Aug 2018, at 66:12–14, and 29–31. 134 With the principle enunciated at [97(d)] above in mind, I asked the experts whether it would be safer for the vessels coming down the westbound lane ifMt Apohad crossed at a deeper angle in order to present a broader aspect. Capt Ewen agreed. Capt Simpson gave the following long and tentative answer:177Foot Note 177×NE, 15 August 2018, at 100:26–101:9. I think, on the first point, Your Honour, if Cpt Rajesh wanted to maintain his---or try to maintain its speed---its course and as a stand-on vessel, I---I’m not surprised that he tried to maintain his course as---as a---as a master. I---I knowit’s a very fine balancing act to---to say well, I am a stand-on vessel but I’llmake an alteration of course to starboard now with the view of 1 presenting a broader aspect to the westbound vessel. I could---I can---I can see that but I can see both arguments in that, Your Honour, I can---I---I can understand the master’s position thinking well, as long as I stand on, I’m---I’m doing the right thing. The alteration of course to starboard then in that first option would, as I say, I can understand that. The second option,the broader aspect, I think would have---would have been more apparent to the westbound vessels… [Emphasis added.] In essence, Capt Simpson agreed that turning to starboard to present a broader aspect would have madeMt Apo’sintention clearer to the westbound vessels. However, he had a concern about whether it would be appropriate forMt Apo, as a stand-on vessel in relation to the westbound vessels, to make a turn to starboard. 135 For the reasons already discussed at [114]–[119] above, Capt Simpson’s concern, that a turn to starboard to cross at right angles would be inconsistent with a stand-on vessel’s duty to “keep her course and speed”, is based on a misapprehension of Rule 17(a)(i). The authorities are clear and unanimous that Rule 17(a)(i) does not preclude alterations of course and speed in the ordinary course of navigation. Since a vessel intending to cross a TSS would, in the ordinary course of navigation, line herself up to cross at right angles, Rule 17(a)(i) does not preclude such a manoeuvre by a stand-on vessel. 136 Once the concern over Rule 17(a)(i) is put to one side, the rest of Capt Simpson’s answer constitutes acceptance that presenting a broader aspect would have madeMt Apo’sintention clearer to the westbound vessels and consequently made the crossing safer. 137 Finally, as there were no vessels nearMt Apo’s starboard side at the material time, a starboard turn would not have broughtMt Apointo close quarters situation with any other vessel or give rise to new risk of collision with any other vessels.  It was therefore entirely safe forMt Apoto make the turn to starboard in order to cross at right angles. 138 In the light of the foregoing, I find that there were no good reasons forMt Apoto cross at a shallow angle. Consequently, I find that it was practicable forMt Apoto cross at right angles.Mt Apowas therefore at fault for crossing the TSS at the shallow angle of 32 degrees, in breach of Rule 10(c). 139 This is a fault with causative potency, as it generated risks and confusion in at least two ways. First, crossing at such a shallow angle meant that, during the crossing,Mt Apowould be traveling within the westbound lane for a considerable period of time in an easterly direction,ie,effectively against the flow of the traffic. The risk and confusion created by such a manoeuvre should not be underestimated. Secondly, by not presenting a broad aspectbeforecrossing into the westbound lane, vessels in the westbound lane were not given early warning ofMt Apo’sintention to cross and were thus deprived of valuable reaction time. While this risk could have been mitigated byMt Apomaking an early announcement to VTIS by VHF that she was planning to cross despite her shallow angle,Mt Apodid nothing of the sort. Hence, while it was my view at [125] above that it was unsafe at 9:50 am forMt Apoto decide to cross the TSS, havingmade that decision, it would have been incumbent upon her to have begun presenting as broad an aspect as possible to signal her decision to cross. In fact, the failure ofMt Apoto present a broad aspect and the uncertainty thereby created probably contributed to Capt Kim’s decision to initiate the 9:55 Conversation.",
        "WhetherMt ApoandHanjin Ras Laffanwere in a crossing situation and, if so, when did the crossing situation arise": "140 Rule 15 of the COLREGS, entitled “Crossing Situation” applies when “two power-driven vessels are crossing so as to involve risk of collision”. Clarification of terminology 141 According to Capt Simpson, a “crossing situation” existed betweenMt ApoandHanjin Ras Laffanfrom 9:50 am whenHanjin Ras Laffanaltered its course to starboard, but Rule 15 did not apply until the vessels were in sight of each other at 9:52 am.178Foot Note 178×Capt Simpson’s AEIC, at p 42, paras 4.3.37–4.3.38.(Rule 11 of COLREGS provides that Rules 12–18 apply to vessels in sight of one another.) 142 I believe Capt Simpson was using the term “crossing situation” loosely, to describe aphysicalstate of affairs which existed independently of whether Rule 15 waslegallyapplicable to that state of affairs. But in legal parlance, the existence of a crossing situation is synonymous with the applicability of Rule 15. I highlight this difference in usage of the term “crossing situation” as a point to be borne in mind when considering the evidence of the experts as there may be parts of the experts’ written and oral evidence where the term “crossing situation” was used in its looser sense. For the avoidance of doubt, the term “crossing situation” is used in this judgment to refer to the situation where Rule 15 applies. Parties’ positions 143 In the light of Capt Simpson’s evidence, I take Mt Apo’s position to be that a crossing situation existed betweenMt ApoandHanjin Ras Laffanfrom 9:52 am. Alternatively, Mt Apo submits that a crossing situation would have arisen at the latest by 9:53 am, whenHanjin Ras Laffan’sARPA radar showed that the CPA ofMt ApotoHanjin Ras Laffanhad fallen to nearly zero.179Foot Note 179×PCS, at paras 43(j)–(k).In contrast, Hanjin Ras Laffan’s position is that Rule 15 did not apply at all asMt Apo’sconduct was such thatHanjin Ras Laffancould not reasonably appreciateMt Apo’sintention.180Foot Note 180×DCS, at para 34.In support of this submission, Hanjin Ras Laffan relied onThe “Alcoa Rambler” [1949] 1 AC 236, a decision of the Privy Council on appeal from Canada. Conditions for applicability of Rule 15 144 According toAlcoa Rambler(at 248), to constitute a crossing situation, the essential conditions are that the vessels must be: (a) crossing vessels; and (b) crossing so as to involve risk of collision. Since there are two conditions to be fulfilled, it follows that a situation which fulfils only one condition but not the other would not be a crossing situation. Thus the mere involvement of risk of collision would not give rise to a crossing situation if the vessels are not crossing vessels. 145 With regard to the first condition, vessels are regarded as crossing vessels if they are on a “crossing course”. The following passage fromAlcoa Rambler(at 248–250) elaborates on what “crossing course” means: Articles 19 and 21 presuppose as their essential conditions that the vessels must be crossing vessels and crossing so as to involve risk of collision. It is only when these conditions are present that the articles apply, and when they cease to be present the articles cease to apply in the full sense, that is disregarding for the moment art. 27. But the problem does not depend merely on physical circumstances.As the purpose of arts. 19 and 21 is to impose a duty on the give-way ship to keep clear, that ship must be in a position to appreciate what the situation is and to know what the other ship is doing, and whether it is on a course at all or,if so, on what course. In the present case theRamblerwas presented with two alternative possibilities in regard to theNorefjord; she might be making for the Narrows or some other place on the east side of the basin or elsewhere; but theRamblercould not in the circumstances say which. If theNorefjordwas going to the Narrows she was clearly not a crossing vessel, if she was making across the basin that would be a different situation. When the vessels first sighted each other, theRamblerwas left in doubt …The question whether the two vessels were crossing vessels within the article thus depended on the purpose of theNorefjord’s movement, so far as that purpose could be inferred by the master of theRamblerfrom what he saw.The issue always depends on the reasonable inference to be drawn by the ship which has the other on her starboard side as to the latter vessel’s future course deduced from observation of her movement at the relevant moment, making due allowance for the nature of locality where she is at that moment. … Thus there are two questions: 1., was theNorefjordon a crossing course, i.e., was she on a course at all, and if so, was it a crossing course so as to be likely to involve risk of collision; 2., was the situation such that theRambler,the give-way ship, could appreciate what the situation was so as to be able to act as the rule prescribes. It is difficult to define what is meant by “course” in this connexion. It has been said that it does not mean “the actual compass direction of the heading of the vessel at the time the other is sighted”; so it was said by Lord Alverstone C.J. inTheRoanoke, citingThe Velocity, where it was held that the course of a ship going round a bend in a river could not be determined by her heading at the moment when she was at the turn of the bend. … It is only when the give-way vessel is aware or ought to be aware of that fact that the vessels are crossing vessels within arts. 19 and 21. …The test always is: was what was being done open and notorious to a seaman on the other ship in the ordinary course of navigation. There is, however, a more general question which has to be considered in this case, namely, whether what theNorefjordwas doing was being on a “course” when she was making what the pilot called a curved course. The ordinary idea of a course is a sufficiently constant direction of a ship on the same line or heading. This will enable a navigator when he sees the other vessel to know if she is on a crossing course. He can often only become aware of that if he can keep the other vessel under observation for sufficient time to ascertain if she is or is not changing her heading. … A curved or curving course, constantly changing under a port helm would not have enabled the give-way vessel to decide how to act for her. Accordingly, of the two conditions that she should be on a course and that the give-way vessel should be able to ascertain that, neither was fulfilled. It may be that in crowded or congested areas, it may not always be possible to ascertain whether the necessary conditions exist. In such cases arts. 19 and 21 cannot apply. But wherever possible arts. 19 and 21 ought to be applied and strictly enforced because they tend to secure safe navigation. [Emphases added.] 146 The following principles may be extracted from the foregoing passage: (a) The purpose of the crossing rules is to impose a duty on the give-way vessel to keep clear. In order to do so, the putative give-way vessel must be in a position to appreciate what the other vessel is doing, including whether it is on a course at all and, if so, what course. (b) Whether two vessels are crossing vessels depend on the purpose of the putative stand-on vessel’s manoeuvres, so far as that purpose could be discerned from reasonable inferences to be drawn by the putative give-way vessel as to the putative stand-on vessel’s future course. Such inference is deduced from observation of the putative stand-on vessel’s movement, making due allowance for the nature of the locality. (c) The test is: was what was being done open and notorious to the seamen on the other ship in the ordinary course of navigation. 147 Going on to the second condition, involvement of risk of collision, Rule 7 of the COLREGS provides: Rule 7 Risk of Collision (a)  Every vessel shall use all available means appropriate to the prevailing circumstances and conditions to determine if risk of collision exists. If there is any doubt such risk shall be deemed to exist. (b)  Proper use shall be made of radar equipment if fitted and operational, including long-range scanning to obtain early warning of risk of collision and radar plotting or equivalent systematic observation of detected objects. (c)  Assumptions shall not be made on the basis of scanty information, especially scanty radar information. (d)  In determining if risk of collision exists the following considerations shall be among those taken into account: (i) such risk shall be deemed to exist if the compass bearing of an approaching vessel does not appreciably change; and (ii) such risk may sometimes exist even when an appreciable bearing change is evident, particularly when approaching a very large vessel or a tow or when approaching a vessel at close range. 148 There is a minor gap between Rule 7 and Rule 15, in that while Rule 7 provides the criteria for determining whether risk of collisionexists, Rule 15 speaks ofinvolvementof risk of collision instead ofexistenceof risk of collision. As noted by Atkin LJ in theGulf of Suez[1921] P 318 (at 332), in a passage cited with approval by the Court of Appeal inNg Keng Yong v PP[2004] 4 SLR(R) 89 at [40]–[41]: … to involve risk of collision … indicates a period before the risk has, so to speak, actually matured; it means a period at which there is a probability that there will be a risk of collision if precautions are not taken. Thus, in a situation involving vesselsalreadyon a crossing course, Rule 15 will kick in shortly before the risk of collision comes into existence. 149 Before turning to the facts, I have two further comments aboutAlcoaRambler: (a) The two-step approach laid down inAlcoa Ramblerfor determining the existence of a crossing situation is consistent with the way the experts have structured their joint report to deal with the appreciation thatMt Apowas going to cross into the TSS and the appreciation of risk of collision as two separate issues. (b) AlthoughAlcoa Rambleris an old case, the footnotes toMarsdenat paras 5–386–5–387 show that it is still being followed by the English courts. Application to the facts 150 I will first consider whether the vessels were crossing vessels before turning to consider the risk of collision. (1) WhetherMt ApoandHanjin Ras Laffanwere crossing vessels 151 As the plots at the Annex to this judgment show,Mt Apowas on a curving course since the pilot disembarked at 9:40 am (C-19). Even though Capt Rajesh had decided to cease followingOcean Sapphireat 9:50 am and to maintain course in the light of the crossing situation withFrontierLeader,Mt Apo’scourse over ground continued to curve to port until 9:51 am, when her course stabilised briefly at 103 degrees for about one minute. She then altered course to starboard at 9:52 am. Her course stabilised again at 9:53 am (C-6). It was also at 9:53 am thatHanjin Ras Laffan’sARPA radar showed that the CPA ofMt ApotoHanjin Ras Laffanhad fallen to nearly zero, with a TCPA of about five minutes. 152 As noted inAlcoa Rambler(at 250): A curved or curving course, constantly changing under a port helm would not have enabled the give-way vessel to decide how to act for her. Accordingly, of the two conditions that she should be on a course and that the give-way vessel should be able to ascertain that, neither was fulfilled. Thus, whileMt Apo’s course was curving to port until 9:51 am, the vessels were not on a crossing course. Nor could the vessels be said to be on a crossing course at 9:52 am, whenMt Apowas altering her course to starboard. 153 Had the vessels been travelling in the open sea, I would have held that they were on a crossing course by 9:53 am, whenMt Apo’scourse had stabilised. However, as noted inAlcoa Rambler, the problem does not depend merely on physical circumstances but depends on whether the other vessel is in a position to appreciate what the situationwas.More specifically, as notedat [146(b)] above, whether the vessels were crossing vessels depended onMt Apo’spurpose as inferred from observation ofMt Apo’smovement, making due allowance for the nature of the locality. A key feature of the nature of the locality in the present case is the TSS. AsMt Apowas proceeding at an oblique angle, she did not present herself as a vessel which was manoeuvring with the purpose of crossing the TSS. In Capt Ewen’s words, “the doubt area is[,] is she going to cross or not”.181Foot Note 181×NE, 15 August 2018, at 51:6–7.Capt Kim also testified thatMt Apo’s heading at the time was not appropriate for crossing the TSS.182Foot Note 182×NE, 11 May 2018, at 45:3–5. 154 I therefore hold that, notwithstandingMt Apo’ssteady course from 9:53 am onwards, the two vessels were not crossing vessels until the crew ofHanjin Ras Laffanwas aware orought to have been awarethatMt Apo’s purpose was to cross the TSS. 155 Mt Apo’s position is thatHanjin Ras Laffanought to have such awareness by the time VTIS radioedMt Apowith the message “Please keep a good lookout … AIS on and you cross safely”,183Foot Note 183×PCB, at p 148.as this meant that VTIS could tell from radar plots thatMt Apowas going to cross the TSS.184Foot Note 184×PCS, at paras 43(l) and 84(b). 156 Hanjin Ras Laffan’s position is that at no point in timeoughtHanjin Ras Laffanto have such awareness. Capt Kim’s testimony is that he understood VTIS’s message toMt Apoto be a mere “navigational warning to the effect that there were West-bound vessels”.185Foot Note 185×Capt Kim’s AEIC, at para 16.He did not consider that to be an indication thatMt Apowas going to cross the TSS there and then. He expected thatMt Apowould turn to port (to follow theOcean Sapphire) after clearingFrontierLeader,because the traffic situation in the westbound lane was not suitable for a crossing at the time andMt Apowas not on a course to cross.186Foot Note 186×NE, 11 May 2018, at 44:32–45:17.Capt Kim explained that he asked whatMt Apo’sintention was over VHF becauseMt Apo’sintention was not clear.187Foot Note 187×NE, 11 May 2018, at 45:21–24.Hanjin Ras Laffan further submits that, after the 9:55 Conversation,Hanjin Ras Laffancould not reasonably be expected to know thatMt Apowould continue to cross, since she had been told byMt ApothatMt Apowould allowHanjin Ras Laffanto cross ahead ofMt Apo.188Foot Note 188×DCS, at paras 3(c) and 56. 157 Hanjin Ras Laffan’s alternative submission is that, even if there was a crossing situation prior to the 9:55 Conversation, the crossing situation ceased to exist onceMt Aporeplied by VHF thatMt Apowould letHanjin Ras Laffanpass her bow.189Foot Note 189×DCS, at paras 47–51. 158 Capt Simpson’s initial opinion was that, onceMt Apoceased turning to port to followOcean Sapphireat 9:50 am, it should have been apparent toHanjin Ras LaffanthatMt Apowas likely to enter the TSS.190Foot Note 190×Capt Simpson’s Supplementary AEIC, at p 23, para. 2.5.1.At trial, Capt Simpson accepted thatMt Apo’sdecision to cross wouldnothave been apparent toHanjin Ras Laffanat 9:50 am.191Foot Note 191×NE, 15 August 2018 at 8:18–26.Capt Simpson was prepared to concede that the latest thatHanjin Ras Laffanshould have such awareness was whenHanjin Ras Laffan’sradar showed that her CPA withMt Apohad fallen to nearly zero.192Foot Note 192×NE, 14 August 2018 at 107:26–108:7.As noted above, this was at 9:53 am. 159 Capt Ewen’s evidence is that it was only at 9:54 am thatHanjin Ras Laffanwould have appreciated thatMt Apo’sheading and course had steadied. Even then,Hanjin Ras Laffanwas unsure ofMt Apo’sintention, as evidenced by her response to VTIS at 9:54 am asking whatMt Apo’sintention was.193Foot Note 193×Agreed Bundle, vol 3, at p 570, para 5.As Capt Ewen puts it during the trial, “[it was] only when [Mt Apo] stayed reasonably steady [for] 3 minutes that questions were being asked and that was about 9:54 [am]”.194Foot Note 194×NE, 14 August 2018, at 107:21–23. 160 As noted at [146] above, the test of awareness is an objective one. The questions to be asked are whetherHanjin Ras Laffanwas in a position to appreciate thatMt Apowas crossing the TSS and whetherMt Apo’sintention to crosswas open and notorious to the crew ofHanjin Ras Laffan.Mt Apocould have made her intention open and notorious by crossing at an angle which was close to 90 degrees, thus presenting a broad aspect which would leave vessels in the westbound lane in no doubt thatMt Apowas going to cross. Alternatively,Mt Apocould have made her intention open and notorious by informing VTIS by VHF that she was crossing despite her shallow angle. This would again have left all other vessels in no doubt of her intention. ButMt Apodid neither of those things. As for the VHF conversation between VTIS andMt Aporeferred to at [155] above, I agree with Capt Ewen that it was not clear from that conversation thatMt Apowas going to cross the TSS there and then.195Foot Note 195×NE, 16 August 2018 at 8:27–31.Consequently, I find that the manoeuvre which finally madeMt Apo’scrossing of the TSS open and notorious toHanjin Ras LaffanwasMt Apo’sactual entry into the westbound lane. In my view, whatever uncertainty there was before should have been dispelled onceMt Apocrossed the northern boundary of the westbound lane. This development ought to have alerted those onHanjin Ras LaffanthatMt Apowas crossing the TSS, notwithstanding that such a crossing may have appeared unwise to them. 161 Accordingly, I find thatMt ApoandHanjin Ras Laffanwere crossing vessels from 9:54 am, whenMt Apocrossed the northern boundary of the westbound lane. (2) Risk of collision 162 Capt Ewen’s view is that the time when risk of collision should have been appreciated was 9:54 am, when VTIS radioedHanjin Ras Laffanto warn her aboutMtApo.196Foot Note 196×Capt Ewen’s Supplementary AEIC, at p 16.Capt Simpson’s initial position was that risk of collision existed from 9:50 am. However, he was prepared to concede that risk of collision arose, at the latest, by the timeHanjin Ras Laffan’sradar showed that the CPA withMt Apohad fallen to nearly zero.197Foot Note 197×NE, 14 August 2018 at 107:26–108:7.As noted above, this was at 9:53 am. I find that risk of collision existed at 9:53 am whenHanjin Ras Laffan’sradar warned of a possible collision withMtApo. Conclusions on existence of crossing situation 163 Given my finding that the risk of collision arose at 9:53 am but the vessels became crossing vessels only at 9:54 am, I find thatMt ApoandHanjin Ras Laffanwere in a crossing situation from 9:54 am, whenMt Apocrossed the northern boundary of the TSS. In this crossing situation,Mt Apowas the stand-on vessel whileHanjin Ras Laffanwas the give-way vessel. Further observations 164 I have a number of further observations to make. First, the finding that Rule 15 applies from 9:54 am onwards does not mean that the two vessels owed no duty of care to each other prior to 9:54 am. Even when Rule 15 is not applicable, vessels are subject to the duty to maintain a proper look-out, to proceed at a safe speed and to generally take such precautions as are required by the duty of good seamanship. What they are not subject to, prior to Rule 15 kicking in, is the obligation to give way or stand on in accordance with Rules 16 and 17. 165 Secondly, as noted inThe Century Dawn(CA) (at 132), Rule 15 applies in a TSS even if the vessel crossing the TSS was at fault for crossing at a dangerous angle. Thus, a vessel crossing the TSS at a wrong angle is still entitled to her status as a stand-on vessel in relation to vessels in the TSS coming down her port side, notwithstanding her own fault. This is a consequence of Rule 10(a) of the COLREGS, which provides that Rule 10 “does not relieve any vessel of her obligation under any other Rule”. 166 Thirdly, it may appear at first blush that the two-step approach inAlcoa Ramblerwhich I adopted in the present case is inconsistent with the approach adopted inTheDream Star, where the enquiry on the existence of a crossing situation focused on when the risk of collision materialised (at [67]). In fact, there is no inconsistency. InTheDream Star, it was clear that the vessels were on a crossing course, as the stand-on vessel had been on a steady course for quite some time and there was no uncertainty as to her intention (at [65]). Thus the first condition inAlcoa Rambler– that of determining whether the two vessels were on a crossing course – was not in issue inTheDream Star. Consequently, it is also not anomalous that risk of collision could arise before there was a crossing situation –Alcoa Ramblerbeing a case in point.",
        "WhetherHanjin Ras Laffanwas at fault for the way she navigated prior to the9:55 Conversation": "167 Mt Apo submitted thatHanjin Ras Laffan’s decision to overtakeDalian Ventureon her starboard side at 9:49 am was unseamanlike. Mt Apo further submitted that Capt Kim should have slowed down and ought to have been monitoring theMt Apocarefully from 9:51 am to 9:54 am. Instead, Capt Kim placed theHanjin Ras Laffanatnavigation fullat 9:52 am, allegedly to deal with an alarm.198Foot Note 198×PCS, at paras 85–86. 168  Given my finding that a crossing situation existed only from 9:54 am, I do not consider any ofHanjin Ras Laffan’smanoeuvres prior to 9:54 am to be inconsistent with the crossing rules. Mt Apo submitted in the alternative that, even before a crossing situation had arisen,Hanjin Ras Laffanought to have been carefully monitoring the movements of theMt Apofrom 9:51 am.199Foot Note 199×PCS, at para 86.While I agree with Mt Apo’s submission, I also accept Capt Kim’s evidence is that he had indeed been monitoringMt Apothroughout this period. 169  In any event, since it is my finding thatHanjin Ras Laffancould not have been expected to know before 9:54 am thatMt Apowas going to enter the TSS, I do not find thatHanjin Ras Laffan’s actions in attempting to overtakeDalian Ventureup till then to be a breach of the duty of good seamanship in relation toMt Apo.",
        "WhetherHanjin Ras Laffanwas at fault for initiating the9:55 Conversation": "Applicable principles 170 The use and misuse of VHF communication by vessels which are passing each other or approaching a close quarters situation was considered recently inTheDream Star(at [90]–[93]), where Belinda Ang Saw Ean J extracted the following principles from the English authorities: (a) Vessels should navigate in accordance with the COLREGS and not make arrangements over the VHF that are contrary to the scheme of the regulations. (b) Use of VHF to agree on manner of passing is fraught with the danger of misunderstanding and may distract mariners from paying attention to their radars. (c) Misuse of VHF is a factor that goes towards the degree of culpability of the respective vessels. (d) Good seamanship does not mandate an embargo on all VHF communications as VHF communications remain helpful for information dissemination in some circumstances. 171 The proposition at [170(d)] above is inspired by the following passage inThe “Mineral Dampier” and “Hanjin Madras”[2001] 2 Lloyd’s Rep 419 (“Mineral Dampier”) (per Lord Phillips, MR): 36.          The Admiralty Court, has, on many occasions, warned against the dangers of navigators of vessels resorting to VHF in order to assist in navigating safely past each other. In theMaloja IIMr. Justice Sheen said at p. 52: Any attempt to use VHF to agree the manner of passing is fraught with the danger of misunderstanding. Marine superintendents would be well-advised to prohibit such use of VHF radio and to instruct their officers to comply with the Collision Regulations. 37.If this passage is read as a warning against agreeing on the VHF a course of navigation which is in conflict with the collision regulations, we would endorse it. It is consistent with other statements to that effect in recent years: see e.g.The Angelic Spirit, [1994] 2 Lloyd’s Rep, 595 at p. 608. Circumstances must be quite exceptional before good seamanship will justify such conduct.But we do not think that Mr. Justice Sheen’s comments should be read as an embargo on all VHF communications about navigation between two vessels which are passing or are approaching a close quarters situation.The Admiralty Court tends to experience cases where VHF conversations have led to disastrous misunderstanding. It does not become aware of cases where an exchange of VHF information has assisted safe navigation. As the Judge observed in this case, in some circumstances VHF conversations can be useful in order to exchange information between vessels. … [Emphasis added in bold.] 172Mineral Dampieris the first reported decision by an English appellate court on the use of VHF by vessels approaching a close quarters situation. All previous reported cases from England on this issue were first instance decisions. (The “Maloja II”[1993] 1 Lloyd’s Rep 48 (“Maloja II”)was affirmed on appeal, but the Court of Appeal’s decision, reported asThe “MalojaII” [1994] 1 Lloyd’s Rep 374, made no reference to VHF communications at all.) 173 The English Court of Appeal took the opportunity inMineral Dampier,at [37], to moderate what might previously have been interpreted as the very strict position taken by Sheen J inMaloja IIand other cases against the use of VHF communication. Specifically, the Court of Appeal took Sheen J’s admonition against “[a]ny attempt to use VHF to agree the manner of passing” and qualified it as an injunction against “agreeing on the VHF a course of navigationwhich is in conflict with the collision regulations” (emphasis added). 174 Particularly instructive is Lord Phillips, MR’s explanation that: “The Admiralty Court tends to experience cases where VHF conversations have led to disastrous misunderstanding. It does not become aware of cases where an exchange of VHF information has assisted safe navigation”.  In my view, Lord Phillips, MR was alluding to the possible existence of a type of cognitive bias described by psychologists as “selection bias”. Put simply, since only cases which result in collisions reach the admiralty court while cases where collisions were successfully avoided do not, this would result in a “selection bias” in the type of information concerning VHF communication presented to admiralty judges. In other words, only cases which result in collisions are “selected” for exposure to judges by virtue of the fact that only unresolved disputes would reach the courts. As a result, admiralty judges are only exposed to cases where VHF communication had contributed to a collision and not exposed to cases where VHF communication may have successfully assisted in collision avoidance. Lord Phillips, MR was thus hinting that this phenomenon could lead to admiralty judges forming a more negative view about the utility of VHF communication than real-life experience would suggest. 175 To appreciate the true purport of theMineral Dampierdecision, it is necessary to go into the facts of that case. The case involved two VHF conversations. According to the facts as found by Aikens J in the court below (The “Mineral Dampier” and “Hanjin Madras”[2000] 1 Lloyd’s Rep 282 (“Hanjin Madras”) at [12] and [14]): (a) The first conversation was initiated byMineral Dampierabout 20 minutes before the collision, when the vessels were six to seven miles apart. At this time, the crossing rules had not kicked in as the vessels were still not in sight of each other.Mineral Dampiersuggested that the two vessels should pass “red to red”.Hanjin Madrasreplied “OK. Red to Red passing; repeat Port to Port passing. … I will alter course to starboard”. (b) The second conversation took placeabout 13 minutes before the collision, when the vessels were about two to three miles apart. By this time, the crossing rules have kicked in because the vessels were in sight of each other. The second conversation was initiated by the give-way vessel,Hanjin Madras,who askedMineral Dampier, the stand-on vessel,to “keep your present course and speed”, to whichMineral Dampierreplied “understand your message”. 176 The advice given to Aikens J by the nautical assessors were (at [25]): (a) The first conversation was prudent as anexchange of information of intention. (b) The second conversation was not prudent because it could curtail possible prudent action byMineral Dampier. Aikens J accepted the nautical assessors’ advice on both conversations (at [26]). 177 The Court of Appeal affirmed Aiken J’s finding on the first conversation but took a more charitable view of the second conversation. On the first conversation, Lord Phillips, MR, in delivering the judgment of the court, noted that the port-to-port passing agreed in the first conversation was consistent with the crossing rules, and held that “neither vessel is to be blamed for the first VHF conversation”. However, the content of that conversation made the subsequent failure ofHanjinMadrasto alter course to starboard in time all the more culpable (Mineral Dampierat [34]). On the second conversation, Lord Phillips, MR said: 41. … Under r. 15Hanjin Madraswas under a duty to give way and under r. 17(a)(i)Mineral Dampierwas under duty to maintain her course and speed. HadHanjin Madrasbeen putting in hand the appropriate manoeuvre to perform her obligation,we do not consider that she could have been criticised for advisingMineral Dampierto stand on, although it would have been more helpful if she had informedMineral Dampierof the action that she was taking.Her fault lies in suggesting a course of action toMineral Dampierwhich was predicated on appropriate action on her part which she then failed to take. 42.So far asMineral Dampieris concerned,we have some difficulty with the proposition that her reply “understand your message” constituted the exchange of an agreement for which she should be blamed. It was, at this point, the duty ofMineral Dampierto maintain her course and speed.Hanjin Madrasinstructed her to do just that. What is it suggested that she should have answered? With hindsight “I shall do so provided that you take appropriate action to keep clear of me” might have been preferable, but we feel that it would be unrealistically censorious to holdMineral Dampierto have acted culpably in failing to respond in this way. 43.          WhereMineral Dampierwas at fault was in our judgment in failing to exercise her right under r.17(a)(i) to take appropriate evasive action soon after this conversation, when it should have become apparent thatHanjin Madraswas not taking appropriate action to keep out of her way in accordance with r.15. We consider that this failure was somewhat the less blameworthy as a result of the VHF exchange as this had been calculated to reassure her thatHanjin Madrashad well in mind her duty to give way. 44.          Accordingly our approach to the second VHF conversation is not the same as that of the Judge.We are not persuaded that it amounted to an agreement, or thatMineral Dampieris to be criticized for her VHF response to theHanjin Madras’communication. 178 From the foregoing review, four observations may be made: (a) Despite the nautical assessors describing the first VHF conversation as “an exchange of information on intent”, it is clear from the facts as found by Aikens J (and left undisturbed by the Court of Appeal) that the content of the VHF conversation was anagreementto pass port-to-port. Yet both the court below and the Court of Appeal did not criticise the first VHF conversation. The reason given by the Court of Appeal was that the agreed course of action was consistent with the COLREGS. (b) The fault ofHanjin Madraslaid, not with the VHF conversation itself, but with the fact that, after givingMineral Dampierinformation thatHanjin Madraswould alter course to starboard, she failed to follow through with the course alteration. (c) No blame was assigned to either vessel for the second VHF conversation. The Court of Appeal held thatHanjin Madrascould not be criticised for advisingMineral Dampierto do what the COLREGS already requiredMineral Dampierto do, whileMineral Dampiercould not be criticised for simply acknowledgingHanjin Madras’message. (d)Mineral Dampier’sfault laid in not taking avoidance action pursuant to Rule 17(a)(ii) when it became apparent thatHanjin Madraswas not taking appropriate action to keep out of the way. However, this fault is made less culpable by the second VHF conversation during whichHanjin MadrasassuredMineral DampierthatHanjin Madraswas giving way. 179 It would appear from the decision inMineral Dampierthat the use of VHF does not deserve criticism if the course of action contemplated in the VHF conversation is consistent with the COLREGS. Where a navigational fault results from a VHF conversation, the direct cause of the collision is that navigational fault and not the use of VHF. Thus the fault ofHanjin Madraslaid in the failure to follow the course of action which she had ledMineral Dampierto believeHanjin Madraswould take, and not in the use of VHFper se. 180 In a similar vein, if the use of VHF caused a mariner to not pay proper attention to the vessel’s radar, the fault laid in the mariner’s failure to keep a proper look-out, and not in the use of VHFper se. To give yet another example, if the use of VHF resulted in loss of time which could have been used to effect early avoidance action, the fault laid in the failure to take early avoidance action. Having said that, the culpability to be assigned to any of the abovementioned faults would have to be adjusted upwards or downwards if the fault is related to the misuse of VHF by one side or the other side. 181 Lest the foregoing analysis be misunderstood, I should emphasise that althoughMineral Dampiermoderated the stricter views against VHF communication espoused in earlier cases such asMaloja II, it is not an encouragement for mariners to resort to VHF communication in close quarters situation without caution. Mariners ought to be aware of the risks associated with the use of VHF (such as uncertainty over the identity of vessels, uncertainty over the interpretation of messages, distraction from keeping a proper look-out and loss of time to take avoidance action), before resorting to VHF communication when passing other vessels or approaching a close quarters situation. Given these risks, it is clear that compliance with the COLREGS should remain the primary means for averting collision. Conversely, misuse of VHF may affect the relative culpability of one side or the other for subsequent navigational faults causing the collision. Finally, the use of VHF to agree on a course of action contrary to COLREGS remains blameworthy. 182 Before turning to the facts, I would add that the summary at [181] above is consistent with MPA’s Port Marine Circular No 18 of 2005 – “Caution on the use of VHF radio in collision avoidance”, which was brought to my attention by the experts. The circular advised that compliance with the COLREGS will be more effective to avert a collision than the use of VHF communication, but did not mandate an embargo on the use of VHF. Instead, the circular sets out a list of risk factors which mariners should consider before resorting to VHF communication. Application to the facts 183 At 9:54:27 am, VTIS contactedHanjin Ras Laffanover the VHF and the following conversation took place from 9:54:27 am to 9:54:55 am:200Foot Note 200×PCB, at pp 150–152. VTIS:Hanjin Ras Laffan,VTIS,Hanjin Ras Laffan. Hanjin Ras Laffan: Yes, this isHanjin Ras Laffan.Go ahead. VTIS:  Sir you have this one vessel eastbound,Mount Apo,Mount Apo, please look out for her. She’s about 1 decimal 4 miles away, bearing 270 sir. Hanjin Ras Laffan: Ok copy that. I…I have one question. What is her intention? I want the green to green, green to green, over. VTIS:  Call her sir, she is on this channel, you can call her. Over. Hanjin Ras Laffan:Copy that. 184 As noted above,Mt Apocrossed the northern boundary of the TSS while the conversation between VTIS andHanjin Ras Laffanwas going on, andMt ApoandHanjin Ras Laffanwere in a crossing situation from then on. It is Capt Kim’s evidence that he observedMt Apocutting into the TSS. 185 Since Capt Kim had already observedMt Apogoing across the northern boundary of the TSS, Capt Kim should have decided by then thatMt Apowould be crossing the TSS. Consequently, he should also have decided at the same time that there was no longer any need to take up VTIS’ suggestion to callMtApo, as there was nothing left for him to ascertain. Capt Kim should have simply proceeded to take appropriate action as a give-way vessel. 186 Hanjin Ras Laffan submits that the 9:55 Conversation was merely to seek information aboutMt Apo’sintention in the light of the confusion arising from the shallow angle at whichMt Apoapproached the TSS.201Foot Note 201×DCS, at para 52(h).I accept thatMt Apo’sangle of approach had indeed caused confusion to Capt Kim and delayed the moment when Capt Kim ought to realise thatMt Apowas crossing the TSS. However, despite Capt Kim’s confusion over whatMt Apo’sintention was, I am of the view that, when it comes to assessing whether a vessel approaching a TSS was going to cross the TSS notwithstanding her wrong angle of approach, a bright line must be drawn at the moment the vessel crosses the boundary of the TSS. If that were not the case, there would be no room for applying the rule laid down inCentury Dawn(CA) that a vessel crossing the TSS at a wrong angle is still entitled to her status as a stand-on vessel, notwithstanding her fault. 187 Mt Apo submits that Capt Kim was not simply seeking information aboutMt Apo’sintention – Capt Kim also asked for a green-to-green passing, which amounted to an attempt to agree on a passing arrangement contrary to the COLREGS.202Foot Note 202×PCS, at paras 98 and 103.Hanjin Ras Laffan submits that Capt Kim was merely stating his own intention while asking forMt Apo’sintention.203Foot Note 203×DCS, at para 52(g).I find that Capt Kim was indeed arranging an agreement for a green-to-green passing. This is clear from Capt Kim’s reference to his “offer” to pass green-to-green in his AEIC.204Foot Note 204×Capt Kim’s AEIC, at para 18.As a green-to-green passing at this stage would be contrary to the COLREGS, I find that Capt Kim had acted in an unseamanlike manner in attempting to arrange a crossing contrary to the COLREGS. 188 A direct consequence of Capt Kim initiating the 9:55 Conversation was the loss of 27 seconds during which both vessels could have taken avoidance action. While 27 seconds is a short time in absolute terms, it is not an insignificant period when viewed in the context of the amount of time left to the collision (four minutes). 189 On her part,Mt Apowas not blameless for Capt Kim’s decision to initiate the 9:55 Conversation. HadMt Aposignalled her intention to cross properly, either by presenting a broad aspect or by announcing her intention to VTIS over the VHF, there would have been no room at all for the confusion which led to the 9:55 Conversation. 190 After receivingHanjin Ras Laffan’sVHF communication,Mt Apocould have responded in a manner consistent with her obligations as a stand-on vessel under Rule 17. This would include responses such as “I am crossing”, “I am standing on”, “please keep clear and pass astern of me”. HadMt Aporesponded in this way,Hanjin Ras Laffanwould have been left in no doubt aboutMt Apo’sintention and would have no choice but to take action to keep clear ofMt Apo. 191 Instead,Mt Aporesponded that she had stopped engine to letHanjin Ras Laffanpass her bow. During cross-examination, Capt Rajesh agreed that the purpose of the reply was to allowHanjin Ras Laffanto passMt Apo’sbow.205Foot Note 205×NE, 11 May 2018, at 62:20–22.Capt Rajesh also agreed that the message implied thatMt Apowas not going to cut acrossHanjin Ras Laffan’sbow.206Foot Note 206×NE, 11 May 2018, at 62:25–27.This response contemplates a course of action inconsistent with Rule 15 asMt Apowas tellingHanjin Ras LaffanthatMt Apowould be giving way, notwithstanding that she was the stand-on vessel. However, Capt Ewen appeared to accept thatMt Apo’sdecision to stop engine and give way could possibly be justified under Rule 17(a)(ii), which provides that a stand-on vessel could take action to avoid collision “as soon as it becomes apparent to her that the vessel required to keep out of the way is not taking appropriate action in compliances with these Rules”.207Foot Note 207×NE, 16 August 2018, at 72:21–28.As noted at [84] above, Capt Rajesh explained that he orderstopengineat 9:54:57 am because it did not appear thatHanjin Ras Laffanwas going to give way. 192 It was suggested to Capt Kim during cross-examination that his remark “oh very dangerous sir”, was to tellMt Apothat it would be very dangerous forHanjin Ras Laffanto passMt Apo’sbow and it therefore was a rejection ofMt Apo’ssuggestion forHanjin Ras Laffanto passMt Apo’sbow. Capt Kim disagreed.208Foot Note 208×NE, 11 May 2018, at 27:21–25.He explained that he was merely remarking generally that the entire situation was dangerous.209Foot Note 209×NE, 11 May 2018, at 26:10–16.Capt Rajesh was not asked during the trial whether he thought those words amounted to a rejection ofMt Apo’s“offer” to letHanjin Ras Laffanpass her bow. There is therefore no evidence thatMt Apotreated Capt Kim’s remarks as releasing her from following through with the course of action she had informedHanjin Ras Laffanshe would take. 193 Having said that, I would still hold that Capt Kim acted in an unseamanlike manner in ending the 9:55 Conversation in the manner he did. Unlike the first VHF conversation inMineral Dampier, where one vessel suggested “red to red” and the other responded unequivocally with “OK. Red to Red passing; repeat Port to Port passing”, there was no such acknowledgment or response fromMt ApotoHanjin Ras Laffan’ssuggestion to pass “green to green”.Mt Apo’sresponse of “make you pass our bow” is equivocal. The words “green to green” or “starboard to starboard” are nowhere to be found inMt Apo’sreply. If Capt Kim thought that “make you pass our bow” was an agreement to a green-to-green passing, he should have been alert the fact thatMt Apodid not repeat “green to green” back to him, and verified withMt Apothat she was indeed going to pass green-to-green before ending the conversation. Conversely, if Capt Kim had understood “make you pass our bow” as a different suggestion from a green-to-green passing, he should have responded by explicitly accepting or rejecting the suggestion or, at the minimum, verify withMt Apothat his understanding ofMt Apo’ssuggestion was correct. 194 To sum up: (a) There was no need for Capt Kim to have initiated the 9:55 Conversation since he had already observedMt Apoentering the TSS before that. However, if Capt Kim’s purpose had been to just seek information, his decision to initiate the call would not have been unreasonable, given the very short interval betweenMt Apoentering the TSS and the initiation of the conversation. (b) Capt Kim’s attempt to arrange an agreement for a green-to-green passing was a misuse of VHF. (c)Mt Aporeplied with a suggested course of action which was inconsistent with her status as a stand-on vessel, although that reply could arguably be justified as informingHanjin Rass LaffanthatMt Apowas taking action pursuant to Rule 17(a)(ii). (d) Capt Kim had not ended the conversation in a manner which gave assurance that both sides understood what the other side was planning to do. 195 I will return to consider how the relative culpability of the parties are affected by the 9:55 Conversation after considering the action of both vessels in the final minutes leading up to the collision.",
        "WhetherMt ApoandHanjin Ras Laffantook proper avoidance actions after 9:55 am": "196 Before considering the actions taken by both vessels after the 9:55 Conversation, it will be useful to highlight that there appeared to be a misunderstanding between Capt Kim and Capt Rajesh as to whatMt Apo’sreply meant. Capt Kim interpretedMt Apo’sreply as confirmation thatMt Apowould effect a green-to-green passing.210Foot Note 210×Capt Kim’s AEIC, at para 20.In Capt Kim’s view, a green-to-green passing would involveMt Apoturning to port to followOceanSapphire.211Foot Note 211×NE, 11 May 2018, at 11:13–14.Capt Rajesh’s evidence is that he did not agree to a green-to-green passing, as turning to port whileMt Apowas already inside the westbound lane would be a dangerous manoeuvre as it would result inMt Apogoing directly against the westbound traffic.212Foot Note 212×Capt Rajesh’s AEIC, at para 33; NE, 9 May 2018, at 21:16–19.All thatMt Apooffered to do was to slow down to letHanjin Ras Laffanpass his bow. This would not involveMt Apoturning to port. 197 In other words, both Capt Kim and Capt Rajesh shared the same understanding as to what a green-to-green passing meant – it entailedMt Apoturning to port. However, while Capt Kim thoughtMt Apohad agreed to pass green-to-green and would thus turn to port, Capt Rajesh thought thatMt Apohad merely agreed to give way and therefore she had no intention to turn to port. Hanjin Ras Laffan’s actions from 9:55 am to 9:57 am 198 After the 9:55 Conversation, from 9:55 am to 9:57 am,Hanjin Ras Laffanmade a series of minor alterations of course to port213Foot Note 213×PCS, at para 18.as well as incremental reductions of speed from 12 knots to 10.7 knots.214Foot Note 214×PCS, at para 108.Mt Apo submits that these incremental alterations to course and speed are contrary to Rule 8(b) of the COLREGS, which provides that: Any alteration of course and/or speed to avoid collision shall, if the circumstances of the case admit, be large enough to be readily apparent to another vessel observing visually or by radar; a succession of small alterations of course and/or speed should be avoided. 199 Capt Kim explained he made the alterations of course and speed to follow behindDalian Venture,215Foot Note 215×NE, 11 May 2018, at 52:30–53:7.so as to provide more space onHanjin Ras Laffan’sstarboard side forMt Apoto turn to port for a green-to-green passing.216Foot Note 216×NE, 11 May 2018, at 17:14–18:30. 200 I can understand Capt Kim’s explanation and accept that these manoeuvres would be consistent with Capt Kim’s perception thatMt Apohad agreed withHanjin Ras Laffanto effect a green-to-green passing. (Whether Capt Kim was justified to believe thatMt Apohad so agreed is quite another matter.) Nevertheless, I agree with Mt Apo that it would have been more prudent for Capt Kim to make bolder alterations of course and speed to tuck in quickly behindDalian Venture.217Foot Note 217×NE, 16 August 2018, at 82:12–27.Capt Kim’s failure to do so would have caused confusion toMt Apoabout his intentions. Mt Apo’s actions from 9:55 am to 9:57 am 201 From 9:55 am to 9:57 am,Mt Apocontinued moving forward on a constant course of 100 to 101 degrees with her engine stopped. During this period, her speed reduced only very slightly, from 7.8 knots to 7.1 knots.218Foot Note 218×PCB, at pp 32–35.AssumingMt Apo’splan was indeed to slow down forHanjin Ras Laffanto pass her bow as indicated in her VHF reply, this very gradual rate of reduction inMt Apo’sspeed would not have been sufficient forHanjin Ras Laffanto passMt Apo’sbow safely even ifHanjin Ras Laffanhad maintained her speed at 12 knots the entire time. 202 To act consistently with her message toHanjin Ras Laffanthat shewould letHanjin Ras Laffanpass her bow,Mt Aposhould have taken whatever reductions in speed necessary to give effect to her stated intention. Capt Ewen described Capt Rajesh’s failure to give any astern orders until 9:58:07 am as “3¼ minutes of inactivity on the bridge”219Foot Note 219×NE, 16 August 2018, at 86:23–27.. As noted inMineral Dampier, a vessel is at fault for not acting in accordance with information she had provided to the other vessel about her intended course of action. I therefore findMt Apoat fault for failing to act consistently with the information she had provided toHanjin Ras Laffan. 203 At 9:57:03 am,Mt ApocalledHanjin Ras Laffanover VHF to arrange a port-to-port passing. Capt Kim was surprised by the call as he thought there was already an earlier agreement to pass green-to-green andMt Apowas reneging on that agreement.220Foot Note 220×Capt Kim’s AEIC, at para 20.I do not regardMt Apo’saction as a misuse of VHF. By then, the vessels were only 0.7 nm apart and about two minutes away from collision.Hanjin Ras Laffan’sincremental alterations to her course and speed had made it impossible forMt Apoto predict whatHanjin Ras Laffanwas going to do next. In the circumstances, arranging a safe passing by VHF was not unreasonable. The suggestion of a port-to-port passing was also reasonable as, notwithstanding her indication toHanjin Ras Laffanshe was giving way,Mt Aporemained a stand-on vessel in relation toOthoni.A turn to port byMt Aporisked putting her into a close quarters situation withOthoni. At the end of the conversation, the vessels reached agreement to effect a green-to-green passing which, although contrary to the COLREGS, must have appeared to both masters in the agony of the moment to be the only viable option. Unlike the 9:55 Conversation, the second VHF conversation ended at least with both sides agreeing on what should be done. The situation from 9:58 am till the collision 204 As noted above, it was only at 9:58:06 am that Capt Rajesh gave an order to put the engine astern, after being reminded by the Chief Officer to do so. This was too little too late. According to Capt Simpson, ifMt Apohad gone astern at 9:56 am (C-3), she would possibly have avoided the collision.221Foot Note 221×NE, 16 August 2018, at 103:8–13. 205 To carry out the arrangement to pass green-to-green,Hanjin Ras Laffanbegan turning to port. Noticing thatHanjin Ras Laffan’srapid turn to port was exposingHanjin Ras Laffan’sstarboard side toMt Apo’sapproaching bow,222Foot Note 222×Capt Rajesh’s AEIC, at para 34.Mt ApocalledHanjin Ras Laffanto ask the latter to turn to starboard in order to minimise the collision impact.223Foot Note 223×PCB, at p 170.Again, I do not regard this as a misuse of VHF. Both Capt Ewen and Capt Simpson agreed that puttingHanjin Ras Laffan’s rudder to starboard in the final seconds before the collision to swing her stern away fromMt Apowould have been the correct thing to do.224Foot Note 224×Capt Ewen’s AEIC, at p 119, para 12.14; Capt Simpson’s Supplementary AEIC, at p 30, para 2.11.4 and p 33, para 2.12.15.Capt Simpson considered thatHanjin Ras Laffan’sfailure to do so was unseamanlike.225Foot Note 225×Capt Simpson’s Supplementary AEIC, at p 30, para 2.11.4I accept Capt Simpson’s view and considerHanjin Ras Laffanat fault for failing to put her rudder to starboard just before the collision.",
        "Summary of findings": "206 In summary, I made the following findings: (a)Mt Apowas at fault for deciding to cross the TSS at 9:50 am when it was unsafe to do so, contrary to Rule 10(c) of the COLREGS. (b)Mt Apowas at fault for entering the TSS at the shallow angle of 32 degrees, contrary to Rule 10(c). (c)Hanjin Ras Laffan’s initiation of the 9:55 Conversation was a misuse of VHF because she used the conversation to arrange a green-to-green crossing contrary to Rule 15 of the COLREGS. (d)Mt Aposuggested a course of action contrary to Rule 15 when she informedHanjin Ras Laffanthat she could passMt Apo’sbow, but the suggested course of action could arguably be justified under Rule 17(a)(ii). (e)Hanjin Ras Laffanwas at fault for misinterpretingMt Apo’sresponse and assuming wrongly thatMt Apohad agreed to a green-to-green passing whenMt Aposaid nothing about a green-to-green passing in her reply. (f)Hanjin Ras Laffanwas at fault for her incremental alterations to course and speed after the 9:55 Conversation, contrary to Rule 8(b), which would have caused confusion toMt Apoas towhat actionHanjin Ras Laffanwas taking. (g)Mt Apowas at fault for not reducing her speed more decisively after informingHanjin Ras Laffanin the 9:55 Conversation that she would letHanjin Ras Laffanpass her bow. (h)Hanjin Ras Laffanwas at fault for not turning to starboard in the final seconds before the collision in order to minimise the impact of the collision. Apportionment of Liability 207 As noted at [95]–[96] above, the apportionment of liability is a broad, commonsensical assessment of the culpability and causative potency of both vessels. The assessment is of the relative degree of responsibility of each vessel. It is the nature and quality of a ship’s faults rather than their number that matter. The fault of a ship that creates a situation of difficulty or danger is generally greater than that of the ship that fails to react properly to such a situation after it has been created.",
        "Causative potency": "208 I do not assign significant causative potency to the decision ofMt Apoto cross at 9:50 am, as the opinion of Capt Ewen is that, even though it was unsafe to cross at the time, the crossing could have been negotiated successfully if it had been done at right angles. Instead, the event of significant causative potency isMt Apo’s decision to cross the TSS at a shallow angle in breach of Rule 10(c). I consider this the primary cause of the difficult situation which follows. It delayed the moment whenMt Apo’sintention to cross the TSS became apparent to other vessels, thus deprivingHanjin Ras Laffanof valuable reaction time. The confusion this created contributed significantly toHanjin Ras Laffan’sdecision to initiate the fateful VHF conversation. 209Hanjin Ras Laffan’sinappropriate suggestion of a green-to-green passing in the 9:55 Conversation led toMt Apo’sambiguous reply and the ensuing confusion over what actions each vessel ought to take. I accept Capt Ewen’s view that the direct cause of the collision wasMt Apo’s failure to reduce speed decisively to carry to give effect to her stated intention to letHanjin Ras Laffanpass her bow.226Foot Note 226×Capt Ewen’s AEIC, at p 119, para 12.12.The collision was also contributed to byHanjin Ras Laffan’smisinterpretation ofMt Apo’sreply and her incremental alterations of course and speed thereafter. Overall, the causative potency ofMt Apo’sfailure to reduce speed decisively was higher. 210 Finally, althoughHanjin Ras Laffan’sfailure to make a final turn to starboard just before the collision did not contribute to the collision, it would have contributed to the extent of the collision damage. 211 Having regard to the matters stated above in relation to causative potency, I am satisfied that theMt Apois more to blame for the collision.",
        "Culpability": "212 In terms of culpability,Mt Apo’sviolation of Rule 10(c) when she crossed into the TSS at a shallow angle of 32 degrees was highly culpable. Consequently, I assign less culpability toHanjin Ras Laffan’sinitiation of the 9:55 Conversation to suggest a green-to-green passing as I consider it a reaction to the difficult situation created byMt Apo’scrossing at a shallow angle.Mt Apo’sculpability is exacerbated by her failure to reduce speed decisively to give effect to her stated intention to letHanjin Ras Laffanpass her bow. In particular, I find inexplicable Capt Rajesh’s omission to putMt Apo’sengine astern for almost three minutes after the 9:55 Conversation, until he was reminded by the Chief Officer that “Captain we have to run astern”. In comparison,Hanjin Ras Laffan’sincremental alterations of course and speed following the 9:55 Conversation, while culpable, were slightly less culpable as they were at least consistent with her declared intention to effect a green-to-green passing. 213 Finally, the culpability to be assigned toHanjin Ras Laffan’sfailure to make a final turn to starboard would be slight given that this was in the final moments before the collision, with many issues vying for the bridge team’s attention at the same time.",
        "Conclusion on apportionment": "214 Taking the totality of the circumstances into account, I am of the view thatMt Apomust bear the majority of the fault for the collision. An appropriate and fair way to apportion liability in this case would be 60:40 in favour ofHanjin Ras Laffan.",
        "Conclusion": "215 For the above reasons, I conclude that responsibility for the collision is to be apportioned 60:40 in favour ofHanjin Ras Laffan. There will be judgment on the claim and counterclaim accordingly. As the issues in the claim and the counterclaim overlap, there ought to be one set of costs. The parties are to file written submissions on costs, bearing in mind that damages have to be assessed before the Registrar. The submissions on costs are due two weeks from this judgment. Pang Khang ChauJudicial Commissioner Chan Leng Sun SC and Muhammad Muzhaffar bin Omar (Wong & Leow LLC) (instructed) Mohamed Goush s/o Marikan and Syed Isa bin Mohamed Alhabshee (Goush Marikan Law Practice)for the plaintiff  by original action and defendant in the counterclaim;Leong Kah Wah, Dedi Affandi bin Ahmad, and Tay Jia En(Rajah & Tann Singapore LLP) for the defendantby original action and plaintiff in counterclaim.",
        "Annex": ""
    }
}